[{"title": "System and Method for Wheel Replacement in a Vehicle", "doc_number": "20240367459", "filename": "US20240367459A1-20241107.XML", "abstract": "In a system and method for replacing a vehicle wheel an electric motor with a drive shaft is concentrically connected to a first gear. The first gear may connect to a symmetrical bolt locking gear array having several bolt locking gears arranged such that each bolt locking gear rotates in the same direction that the first gear rotates. Each bolt locking gear may have a cylindrical hole at its center. The cylindrical hole may be outlined with an inner spiral thread, which connects to a set of power bolts that are outlined in an outer spiral thread which interlocks with the inner spiral thread. A power jack system having a plurality of extendable and collapsible bases is provided in the undercarriage of the vehicle to raise and lower the vehicle. An app running on a mobile device may control the raising/lowering of the vehicle and tightening/loosening of the power bolts.", "detailed_description": ["An apparatus and method for automatically replacing a tire are described below.", "", "FIG.1illustrates in a cross section an axle100for a vehicle. The vehicle is typically a transportation vehicle, such as a passenger automobile, truck or bus. A hydraulic fluid line102having a first end104and a second end106connects to a hydraulic fluid retainer108and to a plurality of hydraulic pistons110. The hydraulic pistons are symmetrically arranged around an axis of a wheel112. An exemplary number of pistons is five. The wheel112, a set of five power rods114and a set of five power bolts116are aligned with the hydraulic pistons110. The hydraulic fluid line108connects at the first end104to hydraulic fluid reservoir113that includes an actuator115. Opening actuator115inputs hydraulic fluid into the automatic tire replacement apparatus. Further the hydraulic fluid reservoir113and the hydraulic fluid retainer108include actuators that control the flow of the hydraulic fluid. In embodiments, the apparatus for automatically replacing a tire may be actuated electronically using a user input device such as a touch screen monitor, as shown inFIG.6, or manual controls.", "", "FIG.2. illustrates an embodiment of a power rod114connected to a power bolt116, and illustrates the power bolt w116with inward facing locking pins200extended. In embodiments, inward facing locking pins200are extended and retracted by a locking button202on the power bolt116. In embodiments the locking pins200are used to engage the power bolt116to the power rod114and may be manually disengaged to remove the power bolt116from the power rod114. Further, when the power bolt116is held in a rotationally stationary position, the relative horizontal movement of a power rod114with a spiral thread204creates rotational movement effective to fasten a power rod114to a power bolt116.", "", "FIG.3. illustrates an embodiment of a piston rod300having a first end310and a second end312, a piston302, and a power rod114having a first end314and a second end316. In embodiments the piston rod may include a piston rod thread304that may be utilized similarly to the spiral thread204. In embodiments the power rod114may include an outer lock notch,308and an inner lock notch306, where a power bolt116may engage with the power rod spiral thread204via power bolt locking pins200. In embodiments hydraulic fluid pressure may be applied to the piston302in either direction to translate the piston rod300and power bolt116in a horizontal direction. In embodiments, if the piston rod thread304, or the spiral thread are engaged with a stationary object the power bolt and the piston rod may rotate as they are translated horizontally.", "", "FIG.4. illustrates an embodiment of a power rod114connected to a hydraulic piston400having a hollow barrel414, a piston302a piston rod300, an inner volume412, an outer volume408an inner piston actuator406and an outer piston actuator404. In embodiments, the inner piston actuator406may release hydraulic fluid into the inner volume414to act on the piston302and move the piston rod300and the power rod114outwardly in a horizontal direction while the outer piston actuator404may simultaneously release hydraulic fluid from the outer volume408into the hydraulic fluid retainer. Similarly in embodiments, the outer piston actuator404may release hydraulic fluid into the outer volume408to act on the piston302and move the piston rod300and the power rod114inwardly while the inner piston actuator406may release hydraulic fluid from the outer volume into the hydraulic fluid retainer. Hydraulic fluid may be any fluid capable of being pressurized including oil and air.", "", "FIG.5. illustrates a car with an extended automatic power jack500. In embodiments the automatic car jack may comprise four bases502that collapse into the chassis of a vehicle. The bases may be pressurized by hydraulic fluid to extend outwardly from the chassis and elevate a motor vehicle. In embodiments a jack500may include an extending body504and a base502. In embodiments the power jack500may be activated to lift a motor vehicle such that the tires no longer touch the ground, and the power jack500may be deactivated to lower a motor vehicle such that the tires touch the ground.", "", "FIG.6illustrates a touch screen600, or other control system with options to actuate the power jack lift602or the power bolt604.", "", "FIG.7is an exploded perspective view of an embodiment of an apparatus for automatically replacing a tire that is actuated by an electric motor700that drives a planetary gear train702that engages power bolts704. The power bolts704extend through apertures734in platen706and gear housing cover712to engage threaded apertures720extending into bolt locking gears721thereby holding wheel708in place. The electric motor700is configured to rotate the gears of the planetary gear train702in both a clockwise direction and a counterclockwise direction. In this way, the power bolts may be loosened to remove the wheel708or tightened when the wheel708is replaced.", "", "The electric motor700produces a torque sufficient to secure and release the power bolts704. This torque is generally between 125 foot pounds and 175 foot pounds and preferably between 144 foot pounds and 173 foot pounds. The motor housing support710, gear housing cover712and platen706are formed from a corrosion resistant material, such as cast magnesium, an aluminum alloy, steel, treated steel and a steel alloy. Further corrosion resistance is provided by an apparatus cover714that may be formed from a rigid plastic, anodized aluminum alloy or other corrosion resistant material.", "", "FIG.8is a perspective view showing the apparatus encased within apparatus cover714affixed, such as by plurality of bolts716, to platen706that is adjacent an inner wall of the wheel708.", "", "FIG.9is a perspective view illustrating the electric motor700engaging drive shaft718to rotate the gears of the planetary gear train702. A threaded aperture720extends into the center of each bolt locking gear721that engages the threads722of a power bolt704. Depending on the direction of rotation of the bolt locking gears721, the power bolt704will either loosen or tighten. The electric motor also engages a transfer cylinder717that controls the amount of tightening and loosening of power bolts704.", "", "The gearing system is further illustrated inFIG.10. The electric motor700transfers rotational motion to a primary drive gear724that engages a first transmission gear726affixed adjacent a first end728of the drive shaft718. Rotation of the primary drive gear causes rotation of the first transmission gear thereby rotating drive shaft718. An opposing second end730is affixed to one of the bolt locking gears721such that rotation of the drive shaft718causes rotation of the bolt locking gear721rotating the gears of the planetary gear train702. To achieve the desired torque and rotation to engage and disengage power bolts, the bolt locking gears721have an exemplary diameter that ranges between 1.5 inches and 2.5 inches and is preferably between 1.9 inches and 2.0 inches. Each bolt locking gear721nominally has 60 gear teeth. Idler gears732provide proper spacing for the bolt locking gears and transfer rotational motion to an adjacent bolt locking gear. These idler gears have an exemplary diameter between 1.0 and 1.5 inches and preferably between 1.2 inches and 1.3 inches. Projecting from the outer edge of the idler gears732are, for example, 34 gear teeth.", "", "ReferencingFIGS.11and12, the primary drive gear724engages a bolt locking gear721that is an element of the planetary gear train702. Each bolt locking gear721has a diameter of between 1.5 inch and 2.0 inch and a preferred diameter of between 1.9″ and 2.0″. Each bolt locking gear nominally has 59 gear teeth. The planetary gear train702has sufficient bolt locking gears721to engage each power bolt704. For a passenger automobile, that is typically between four and six bolt locking gears721. The planetary gear train702also includes idler gears732positioned between bolt locking gears721so that the bolt locking gears721align with through holes734extending through platen706. The power bolts704extend through the through holes734of the platen706and engage the threaded apertures720formed in bolt locking gears721. The idler gears732have a diameter ranging between 0.5 inch and one inch and preferably between 0.8″ and 0.9″. The directional gears nominally have 25 gear teeth.", "", "The bolt locking gears721may be seated in cylindrical recess736formed in motor housing support710. The motor housing support710may be a disk having a diameter that ranges between 5 inches and 8 inches and is preferably between 6″ and7″. The motor housing support710in combination with the platen706is sized to encapsulate the planetary gear train702.", "", "Each bolt locking gear721includes a threaded aperture720having a diameter and thread pitch effective to receive and engage the threaded portion722of a power bolt704. Both the diameter and thread pitch may be English units or metric units dependent on manufacturer. Nominally, the diameter of the threaded aperture is between 0.4 inch and 0.6 inch, and preferably, that diameter ranges between 0.45″ and 0.55″ with the spiral thread formed on the wall of the bore720. The power bolts704with a bolt spiral thread722interlock with the spiral thread in each threaded aperture720. Each power bolt704may also have a power bolt cap738, which may be shaped in a rigid geometrical shape such as a standard tire lug nut shape to enable removal with a conventional lug wrench if electric power is not available or unsafe to use. For example, if the vehicle battery has been damaged in an accident. In some embodiments, each power bolt704may be made at least partially of magnetic material and have a magnetic tip.", "", "Returning toFIGS.9and10, primary drive gear724, which may have a diameter that ranges between one inch and 1.5 inches and preferably between 1.2″ and 1.3″, nominally has 34 gear teeth. The primary drive gear724engages first transmission gear726on the drive shaft718. The primary drive gear724is operatively connected to a second transmission gear740that engages an output gear742that drives momentary impact drive717.", "", "The second transmission gear740drives the output gear742which may have a diameter that ranges between 0.5 inch and 1.5 inches and is preferably between 0.9″ and 1.0 inch and nominally has 28 gear teeth. The output gear742is connected to the primary impact drive transfer717and is concentrically connected to a locking cylinder744encasing a locking coil746. The locking coil746has a number of windings that typically ranges between 3 and 6. During tightening of the power bolts704, the locking cylinder744rotates until an edge of the locking coil746contacts a stop that may be grooves that interlock with the locking coil746preventing overtightening of the power bolts704.", "", "The electric motor700drives the planetary gear train702in either a clockwise or a counterclockwise direction, rotating the bolt locking gears721, to either tighten or loosen the power bolts704. Alternatively, the electric motor may be able to reverse direction of rotation or it may turn in one direction and different gearing arrangements be engageable to control the direction of rotation of the locking gears721. The electric motor700also drives rotation of the locking coil746to stop rotation of the bolt locking gears721at the point of power bolt704tightening to prevent overtightening. The electric motor700is also connected to a power source750as also shown inFIG.14.", "", "FIG.13illustrates the apparatus for automatically replacing a tire mounted to a wheel708. Five power bolts704are illustrated passing through apertures in the wheel708and engaging bolt locking gears721. Power bolt caps752are optionally disposed on a surface of the wheel708, such that each power bolt704fits into the power bolt cap752when engaged with a bolt locking gear array721. The power bolt caps752hold each power bolt704in place, allowing the power bolt704to only translate toward and away from its respective bolt locking gear721. The power bolt caps752make manual removal of the power bolts704more difficult as a theft deterrent.", "", "As an additional safety feature, a manual quick-release lug bolt800may be provided to allow removal of a wheel708in case electric power is unavailable for use, such as if the battery becomes damaged or its charge is depleted, and the electric motor700is unable to release the power bolts704. As can be seen inFIGS.16and17, the lug bolt800threads into the rear side of one of the threaded apertures720of the bolt locking gears721. The lug bolt800may have an outer diameter (width across flats) of 11/16 (117 mm) to accommodate a correspondingly sized lug wrench of 11/16 (17 mm). In other embodiments, the diameter of the lug bolt800and the size of the lug wrench may differ according to such factors as the weight load of the vehicle. Manually rotating the lug bolt800with such a lug wrench or equivalent causes the bolt locking gears721of the planetary gear train702to rotate and thereby loosen, or tighten, the power bolts704. In this way, if electric power is unavailable, a user will still be able to change one or more wheels on the vehicle by using a lug wrench and reaching behind the wheel to rotate the lug bolt800and loosen the power bolts704.", "", "FIG.18shows that the manual quick-release lug bolt800remains easily accessible by a user even when the planetary gear train is covered by the motor housing support710and the electric motor700is covered by the apparatus cover714.", "", "FIG.14illustrates a touch screen754to control the automatic tire replacement apparatus. The touch screen754may be a display on the vehicle dashboard of an application on a separate device, such as smart phone or personal computer communicating with the automatic tire replacement apparatus by a known wired or wireless protocol. The touch screen754may display a lift control756to activate a power jack758mounted inside the vehicle (FIG.15). The touch screen754may also display a power bolt control760controlling the loosen and tighten the power bolt functions.FIG.14further schematically illustrates the touch screen754communicating with an electric switch762configured to provide either positive or negative voltage from the power source750to an input764to the electric motor700(FIG.9). The power source750may be a battery or generator on the vehicle. Alternative, the power source750may be an external power source separate from the car power system. The electric switch752may be engaged with a positive voltage or a negative voltage from the power source750effective to rotate the electric motor in a clockwise direction or a counterclockwise direction.", "", "In addition, or as an alternate, to the touch screen754control, an autojack and wheel replacement app may be provided as a download to a mobile device such as a user's smartphone. Operation of this app will be described below with reference toFIGS.19-21in the case where a user desires to change a flat tire.", "", "Here, we presume that the motorist user of a vehicle having a flat tire has pulled off to the side of a road and parked at a safe location that does not impede other traffic. The user also has shifted the vehicle's transmission to “Park” if automatic transmission, and has engaged the emergency brake. As an added safety measure, it is recommended that the user also turn on the vehicle hazard lights. At this time, the user should switch on the vehicle's hydraulic power (hydraulic power take-off (“hydraulic PTO”)) and exit the vehicle while holding the mobile device running the autojack app.", "", "FIG.19shows the basic flow of the app's operation. At a preliminary step1000, the app checks that vehicle is parked with the parking brake and/or emergency brake engaged. The app will also check that the vehicle is parked on a substantially level surface and will not operate if the slope of the underlying surface exceeds an upper limit. Depending on factors such as the weight of the vehicle, the shape and stability of the feet of the jack, the upper limit may be set to approximately four degrees. Needless to say, other embodiments may be configured to safely operate on steeper slopes. In certain embodiments the app may also check that the underlying surface is not slippery, i.e. not wet or covered in snow or ice, and is sufficiently dense to support the jacks that will lift the vehicle.", "", "At step1100, the user activates the autojack app shown inFIG.20(a)and selects “Lift”, shown inFIG.20(b), to specify that the hydraulic autojack will operate to raise the vehicle, and the user also selects the particular wheel (front/rear and left/right) to be changed (seeFIG.21(a)). Note, that in certain other embodiments the “Lift” operation may be carried out first, and then the particular wheel for replacement may be selected.", "", "The app then activates the hydraulic jack system to lift the vehicle (step1200). This process will begin lifting the vehicle by synchronously descending all four jacks from the undercarriage of the vehicle. If the vehicle does not lift, likely due to a soft underlying surface, the app will return an error message to the user to suggest moving the vehicle to a more suitable site if possible.", "", "If the app detects that the hydraulic system has engaged and the vehicle is raised to a suitable height, the app will then activate the electric motor700to loosen the power bolts704on the pre-selected wheel (step1300). The app acknowledges when the power bolts704have been loosened appropriately. The user shall again press on the center top of each power bolt to fully release and detach each power bolt from its hydraulic piston cylinder rod.", "", "The user may then safely and easily remove the selected wheel and replace it with a spare wheel, mounting the spare wheel onto the wheel hub (step1500). At this time, the user shall reinsert each power bolt704back into its respective hydraulic piston cylinder. Next the app activates the electric motor700to tighten power bolts704on the selected wheel (step1600). Finally, the user will select “Drop”, shown inFIG.20(c), to activate the hydraulic autojack to retract the four powered jacks into the undercarriage and lower the vehicle (step1700). At this time, the user may enter the vehicle, turn off the app, and switch off the hydraulic PTO system.", "", "With the faulty wheel now replaced with a spare, and the faulty wheel stored safely inside the vehicle, the user may turn on the vehicle engine, turn off the hazard lights, release the emergency brake, shift from “Park” to “Drive” (in the case of automatic transmission), and carefully merge into traffic.", "", "In this manner, a user is able to control the raising/lowering of the vehicle and the tightening/loosening of power bolts all from a single app with easy-to-use graphical user interfaces."], "claims": ["a plurality of bolt locking gears arranged in a symmetrical array such that each bolt locking gear rotates in a same rotational direction, each bolt locking gear having a cylindrical through-bore at its center, a wall of the cylindrical through-bore having an inner spiral thread formed thereon; a drive shaft connected to one of the plurality of bolt locking gears, wherein rotation of the drive shaft causes each of the plurality of bolt locking gears to rotate in the same rotational direction; a plurality of power bolts, each power bolt having an outer spiral thread sized to interlock with the inner spiral thread of one of the plurality of bolt locking gears, each power bolt capable of being inserted through apertures in a wheel and wheel hub assembly and into the cylindrical through-bore of a respective bolt locking gear, each power bolt rotatably tightenable to interlock with the corresponding bolt locking gear and securely hold the wheel to the wheel hub assembly and rotatably loosenable to disengage said interlock and release the wheel from the wheel hub assembly, wherein the rotation of the drive shaft causes the plurality of bolt locking gears to rotate in the same direction and correspondingly tighten or loosen the interlocked state of the plurality of power bolts; and a lug release bolt having an outer lug spiral thread sized to interlock with the inner spiral thread of the through-bore of one of the plurality of bolt locking gears, the lug release bolt capable of being inserted into said through-bore from a direction opposite the insertion direction of the respective power bolt, wherein the lug release bolt, when rotated counterclockwise by an external torque, causes the array of bolt locking gears to rotate and unscrew the power bolts inserted therein and release the wheel.", "2 . The wheel release mechanism of claim 1 , wherein the external torque applied to the lug release bolt is applied manually.", "3 . The wheel release mechanism of claim 2 , wherein the external torque applied to the lug release bolt is applied via an 11/16 inch (17 mm) size lug nut wrench.", "selecting, via a mobile app, a lifting operation of the vehicle by a power jack having a plurality of bases, each of the plurality of bases extendable from a collapsed position within a chassis of the vehicle to an extended position effective to elevate the vehicle, selecting, via the mobile app, one or more wheels on the vehicle to replace; causing the mobile app to activate the plurality of bases of the power jack to raise the vehicle to a height suitable for replacing the wheel; causing the mobile app to activate an electrical motor connected to a bolt locking gear array to rotate in a loosening direction so as to loosen a set of power bolts which secure a first wheel connected to a set of bolt locking gears in the bolt locking gear array; manually removing the set of power bolts; manually removing the first wheel from an axle of the vehicle; manually placing a second wheel on the axle; manually attaching the set of power bolts to secure the second wheel to the set of bolt locking gears in the bolt locking gear array; causing the mobile app to activate the electrical motor to rotate in a tightening direction so as to tighten the set of power bolts with the bolt locking gears; and causing the mobile app to activate the plurality of bases of the power jack to lower the vehicle to ground or street level.", "5 . The method of claim 4 , wherein the plurality of basis of the power jack are operated by a hydraulic fluid system.", "6 . The method of claim 5 , wherein the hydraulic fluid is a gas.", "7 . The method of claim 5 , wherein the hydraulic fluid is a liquid.", "8 . The method of claim 1 , wherein the steps of selecting via the mobile app are implemented via a graphical user interface."], "bibtex": "@patent{20240367459,\n    title = {System and Method for Wheel Replacement in a Vehicle},\n    number = {20240367459},\n    year = {2024},\n    note = {File: US20240367459A1-20241107.XML}\n    }", "classification": "B60B2900FI"}, {"title": "RUBBER COMPOSITION FOR TIRE, TREAD RUBBER, AND TIRE", "doc_number": "20240367460", "filename": "US20240367460A1-20241107.XML", "abstract": "A rubber composition for a tire, comprises a rubber component, a resin component, and a filler, wherein: the rubber component contains a rubber having isoprene skeleton and a styrene-butadiene rubber, the styrene-butadiene rubber has a glass transition temperature lower than −40° C.; a content of the resin component is in the range of ≥1 and <50 parts by mass with respect to 100 parts by mass of the rubber component; the resin component has been at least partially hydrogenated and a difference in SP value between the resin component and the isoprene skeleton rubber is ≤1.40 (cal/cm 3 ) 1/2 ; and the rubber composition satisfies the formula shown below: a mass ratio of the resin component/the isoprene skeleton rubber is ≥0.5.", "detailed_description": ["Hereinafter, a rubber composition for a tire, tread rubber, and a tire of the present disclosure will be demonstratively described in detail based on embodiments thereof."], "claims": ["wherein: the rubber component contains a rubber having isoprene skeleton and a styrene-butadiene rubber; the styrene-butadiene rubber has a glass transition temperature lower than −40° C.; a content of the resin component is in the range of ≥1 and <50 parts by mass with respect to 100 parts by mass of the rubber component; the resin component has been at least partially hydrogenated and a difference in SP value between the resin component and the isoprene skeleton rubber is ≤1.40 (cal/cm the rubber composition satisfies the formula shown below: a mass ratio of the resin component/the isoprene skeleton rubber is ≥0.5.", "2 . The rubber composition for a tire of claim 1 , wherein a difference in SP value between the resin component and the isoprene skeleton rubber is 0.5 (cal/cm 3 ) 1/2 .", "3 . The rubber composition for a tire of claim 1 , wherein a difference in SP value between the isoprene skeleton rubber and the styrene-butadiene rubber is ≥0.3 (cal/cm 3 ) 1/2 .", "4 . The rubber composition for a tire of claim 1 , wherein a content of the isoprene skeleton rubber is in the range of 1 to 80 parts by mass with respect to 100 parts by mass of the rubber component.", "5 . The rubber composition for a tire of claim 4 , wherein a content of the isoprene skeleton rubber is in the range of 1 to 40 parts by mass with respect to 100 parts by mass of the rubber component.", "6 . The rubber composition for a tire of claim 1 , wherein the styrene-butadiene rubber is modified by a modifying agent having a nitrogen atom-including functional group and an alkoxy group.", "7 . The rubber composition for a tire of claim 1 , wherein the resin component has the softening point higher than 110° C. and the weight average molecular weight in terms of polystyrene in the range of 200 to 1,600 g/mol.", "8 . The rubber composition for a tire of claim 1 , wherein the resin component is at least one selected from the group consisting of hydrogenated C 5 resin, hydrogenated C 5 -C 9 resin, hydrogenated dicyclopentadiene resin, and hydrogenated terpene resin.", "9 . A tread rubber, characterized in that it is made of the rubber composition for a tire of claim 1 .", "10 . A tire, characterized in that it has the tread rubber of claim 9 .", "11 . The rubber composition for a tire of claim 2 , wherein a difference in SP value between the isoprene skeleton rubber and the styrene-butadiene rubber is ≥0.3 (cal/cm 3 ) 1/2 .", "12 . The rubber composition for a tire of claim 2 , wherein a content of the isoprene skeleton rubber is in the range of 1 to 80 parts by mass with respect to 100 parts by mass of the rubber component.", "13 . The rubber composition for a tire of claim 2 , wherein the styrene-butadiene rubber is modified by a modifying agent having a nitrogen atom-including functional group and an alkoxy group.", "14 . The rubber composition for a tire of claim 2 , wherein the resin component has the softening point higher than 110° C. and the weight average molecular weight in terms of polystyrene in the range of 200 to 1,600 g/mol.", "15 . The rubber composition for a tire of claim 2 , wherein the resin component is at least one selected from the group consisting of hydrogenated C 5 resin, hydrogenated C 5 -C 9 resin, hydrogenated dicyclopentadiene resin, and hydrogenated terpene resin.", "16 . A tread rubber, characterized in that it is made of the rubber composition for a tire of claim 2 .", "17 . The rubber composition for a tire of claim 3 , wherein a content of the isoprene skeleton rubber is in the range of 1 to 80 parts by mass with respect to 100 parts by mass of the rubber component.", "18 . The rubber composition for a tire of claim 3 , wherein the styrene-butadiene rubber is modified by a modifying agent having a nitrogen atom-including functional group and an alkoxy group.", "19 . The rubber composition for a tire of claim 3 , wherein the resin component has the softening point higher than 110° C. and the weight average molecular weight in terms of polystyrene in the range of 200 to 1,600 g/mol.", "20 . The rubber composition for a tire of claim 3 , wherein the resin component is at least one selected from the group consisting of hydrogenated C 5 resin, hydrogenated C 5 -C 9 resin, hydrogenated dicyclopentadiene resin, and hydrogenated terpene resin."], "bibtex": "@patent{20240367460,\n    title = {RUBBER COMPOSITION FOR TIRE, TREAD RUBBER, AND TIRE},\n    number = {20240367460},\n    year = {2024},\n    note = {File: US20240367460A1-20241107.XML}\n    }", "classification": "B60C100FI"}, {"title": "TIRE AND TIRE PRODUCTION METHOD", "doc_number": "20240367461", "filename": "US20240367461A1-20241107.XML", "abstract": "On the tire equatorial plane, two of the tape-like members adjacent to each other in the tire circumferential direction are arranged such that the tire circumferential ends thereof are butted against each other, otherwise, at the end portions of the belt layer, two of the tape-like members adjacent to each other in the tire circumferential direction are arranged such that only the rubber portions overlap each other in the tire radial direction. In the attaching process, on the tire equatorial plane, two of the tape-like members adjacent to each other in the tire circumferential direction are attached so that they are butted against each other at tire circumferential ends thereof, otherwise, at the end portions of the belt layer, two of the tape-like members adjacent to each other in the tire circumferential direction are attached so that only the rubber portions overlap each other in the tire radial direction.", "detailed_description": ["The following is a detailed illustration of the embodiment of this disclosure with reference to the drawings."], "claims": ["a carcass straddling between the pair of bead portions in a toroidal shape, and a belt consisting of one or more belt layers disposed on the outer side in the tire radial direction of a crown portion of the carcass, wherein the belt layer is composed of tape-like members consisting of a plurality of belt cords arranged parallel to each other and coated with rubber, arranged in the tire circumferential direction, the tape-like member has a tape width of 1 to 10 mm, and on the tire equatorial plane, two of the tape-like members adjacent to each other in the tire circumferential direction are arranged such that tire circumferential ends thereof are butted against each other.", "a carcass straddling between the pair of bead portions in a toroidal shape, and a belt consisting of one or more belt layers disposed on the outer side in the tire radial direction of a crown portion of the carcass, wherein the belt layer is composed of tape-like members consisting of a plurality of belt cords arranged parallel to each other and coated with rubber, arranged in the tire circumferential direction, the tape-like member has a tape width of 1 to 10 mm, and at the end portions of the belt layer, two of the tape-like members adjacent to each other in the tire circumferential direction are arranged such that the belt cords thereof do not overlap each other in the tire radial direction.", "3 . The tire according to claim 1 , wherein at the end portions of the belt layer, the shortest distance between the belt cords of two of the tape-like members adjacent to each other in the tire circumferential direction is 0 mm or more.", "the method includes a raw tire forming process: using a toroidal-shaped rigid core with a tire forming surface that forms a luminal surface of the tire on its outer surface, and sequentially attaching unvulcanized tire components including carcass plies and belt plies on the tire forming surface of the rigid core to form a raw tire, the raw tire forming process includes a belt ply forming process: forming the belt ply via the carcass ply on the tire forming surface of the rigid core, the belt ply forming process includes an attaching process: attaching tape-like members with a tape width of 1 to 10 mm, consisting of a plurality of belt cords arranged parallel to each other and coated with rubber, sequentially in the tire circumferential direction at a predetermined angle to the tire circumferential direction, to form a belt ply composed of the tape-like members arranged in the tire circumferential direction, and in the attaching process, on the tire equatorial plane, two of the tape-like members adjacent to each other in the tire circumferential direction are attached so that they are butted against each other at tire circumferential ends thereof.", "the method includes a raw tire forming process: using a toroidal-shaped rigid core with a tire forming surface that forms a luminal surface of the tire on its outer surface, and sequentially attaching unvulcanized tire components including carcass plies and belt plies on the tire forming surface of the rigid core to form a raw tire, the raw tire forming process includes a belt ply forming process: forming the belt ply via the carcass ply on the tire forming surface of the rigid core, the belt ply forming process includes an attaching process: attaching tape-like members with a tape width of 1 to 10 mm, consisting of a plurality of belt cords arranged parallel to each other and coated with rubber, sequentially in the tire circumferential direction at a predetermined angle to the tire circumferential direction to form a belt ply composed of the tape-like members arranged in the tire circumferential direction, and in the attaching process, at the end portions of the belt layer, two of the tape-like members adjacent to each other in the tire circumferential direction are attached so that the belt cords thereof do not overlap each other in the tire radial direction.", "6 . The tire according to claim 4 , wherein at the end portions of the belt layer, the shortest distance between the belt cords of two of the tape-like members adjacent to each other in the tire circumferential direction is to be 0 mm or more.", "7 . The tire according to claim 2 , wherein at the end portions of the belt layer, the shortest distance between the belt cords of two of the tape-like members adjacent to each other in the tire circumferential direction is 0 mm or more.", "8 . The tire according to claim 5 , wherein at the end portions of the belt layer, the shortest distance between the belt cords of two of the tape-like members adjacent to each other in the tire circumferential direction is to be 0 mm or more."], "bibtex": "@patent{20240367461,\n    title = {TIRE AND TIRE PRODUCTION METHOD},\n    number = {20240367461},\n    year = {2024},\n    note = {File: US20240367461A1-20241107.XML}\n    }", "classification": "B60C922FI"}, {"title": "Heavy Goods Vehicle Tire with Complex Tread Pattern", "doc_number": "20240367462", "filename": "US20240367462A1-20241107.XML", "abstract": "A heavy-duty vehicle tire with complex tread pattern, and is intended to improve the resistance to irregular wear of the tread thereof. The tire ( 1 ) has a tread ( 2 ) with at least one circumferential complex cut ( 6 ) formed by an alternation of external cavities ( 7 ) and internal cavities ( 8 ), each external cavity ( 7 ) having a length (L 1 ), wherein the length (L 1 ) of each external cavity ( 7 ) is equal to at least 1.5% and at most 12% of the external diameter (D) of the tire ( 1 ), as measured on the tire when new and free.", "detailed_description": [""], "claims": ["at least one cut being a circumferential complex cut with a midline extending in a circumferential direction (XX′) of the tire, and comprising, when the tire is new, an alternation of external cavities opening onto the tread surface and internal cavities not opening onto the tread surface, two consecutive cavities, respectively an external cavity and an internal cavity, being connected to each other by a connecting channel, each external cavity having a length (L wherein the length (L", "2 . The time according to claim 1 , wherein the length (L 1 ) of each external cavity is equal to at most 10% of the external diameter (D) of the tire.", "3 . The tire according to claim 1 , having a tread surface portion in contact with flat ground of mean length (Lc) when the new tire is mounted on a recommended rim, inflated to a recommended pressure and subjected to a recommended vertical load, the recommended rim, pressure and vertical load being as defined by the European standards of the European Tire and Rim Technical Organization, wherein the length (L 1 ) of each external cavity is equal to at least 5% and at most 55% of the mean length (Lc) of the tread surface portion in contact with the ground.", "4 . The tire according to claim 3 , wherein the length (L 1 ) of each external cavity is equal to at most 45% of the mean length (Lc) of the tread surface portion in contact with the ground.", "5 . The tire according to claim 1 , wherein each internal cavity has a length (L 2 ) measured along the midline on a radially external section of said internal cavity ( 8 ), and wherein the length (L 1 ) of each external cavity is equal to at least 70% and at most 130% of the length (L 2 ) of each internal cavity.", "6 . The tire according to claim 1 , wherein each external cavity has a transverse surface (S 1 ) perpendicular to the midline, and each internal cavity has a transverse surface (S 2 ) perpendicular to the midline, and wherein the transverse surface (S 1 ) of each external cavity is equal to at least 50% and at most 150% of the transverse surface (S 2 ) of each internal cavity.", "7 . The tire according to claim 6 , in which the transverse surface (S 1 ) of each external cavity is equal to at least 80% and at most 140% of the transverse surface (S 2 ) of each internal cavity.", "8 . The tire according to claim 1 , which, tire when new, has an axial tread width (Wt) and a lateral circumferential complex cut, the midline of which is positioned at an axial distance (Yd) from a median circumferential plane (XZ) of the tire, splitting the tire into two symmetrical portions, wherein the axial distance (Yd) of the lateral circumferential complex cut is equal to at least 25% and at most 45% of the axial tread width (Wt)."], "bibtex": "@patent{20240367462,\n    title = {Heavy Goods Vehicle Tire with Complex Tread Pattern},\n    number = {20240367462},\n    year = {2024},\n    note = {File: US20240367462A1-20241107.XML}\n    }", "classification": "B60C1103FI"}, {"title": "PNEUMATIC VEHICLE TYRE", "doc_number": "20240367463", "filename": "US20240367463A1-20241107.XML", "abstract": "The invention relates to a pneumatic vehicle tire with a tread with at least one circumferential groove, which is formed to the profile depth and has a groove base and groove flanks, wherein free-standing webs, which are at a distance from one another in the circumferential direction, are elongate in the circumferential direction and have a top surface running parallel to the tread periphery and a height of 7% to 30% of the profile depth, are formed on the groove base, wherein at least one protrusion, which sits on the groove base and is elongate in the circumferential direction, is formed between successive webs in the circumferential direction on and along each groove flank, wherein the one protrusion overlaps the other protrusion with respect to the circumferential direction, at least in portions, so that between the protrusions there remains a groove-base channel, which has a constant width in the axial direction between protrusion edges which are formed on the protrusions and run at a constant depth and in the circumferential direction.", "detailed_description": ["Pneumatic vehicle tires designed according to the invention are tires for motor vehicles, in particular for multi-track motor vehicles, and preferably radial tires for passenger cars, vans, light trucks (small delivery trucks with a permissible gross vehicle weight of ≤3.5 t, light trucks with a permissible gross vehicle weight of ≤7.5 t) or SUVs.", "", "FIG.1shows a plan view of a cut-out of a tread with a shoulder-side profile rib1, which is separated from a further, only schematically indicated, circumferential profile rib3by a shoulder-side circumferential groove2running straight in plan view.", "", "The shoulder-side profile rib1is provided with a multiplicity of transverse grooves4, which lead into the circumferential groove2and lend the shoulder-side profile rib1block-like rib elements1a, wherein two evenly distributed transverse grooves5that end before the circumferential groove2are formed in each rib element1a. The transverse grooves4,5run parallel to one another, when viewed in plan view, and are respectively made up of a transverse groove portion4a(transverse groove4),5a(transverse groove5) on the outer side of the tread, running in the axial direction in plan view, and a transverse groove portion4b(transverse grooves4),5b(transverse grooves5) on the inner side of the tread, running at an angle of 25° to 45° in relation to the axial direction in plan view.", "", "The circumferential groove2has a groove base2a, two groove flanks2band two groove edges2crunning straight in plan view and beveled in portions, so that the groove flanks2bare adjoined by bevels2b′ running to the tread periphery, still to be discussed in further detail. When viewed in cross section, the groove flanks2brun at an angle α (FIG.3,FIG.4) of 0° to 5° in relation to the radial direction. When viewed in cross section, the groove base2ais formed as rounded in a flat U-shaped manner (FIG.4).", "", "Free-standing bar-like webs6, which are at a distance from the groove flanks2band are positioned in the middle of the circumferential groove2, are formed on the groove base2ain the circumferential groove2, wherein successive webs6in the circumferential direction are at a distances a1from one another of 50.0 mm to 75.0 mm in the circumferential direction, determined as smallest possible distances. Furthermore, two bar-like protrusions7, which sit on the groove base2aand between which the transverse groove portions4bof the transverse grooves4on the inner side of the tread enter the circumferential groove2, are formed between successive webs6in the circumferential direction along each groove flank2b. According toFIG.3, the circumferential groove2has between its groove edges2c, that is to say in the areas outside the bevels2b′, a width B1of 6.0 mm to 8.0 mm and at the locations where it is free from webs6is formed in the radial direction to the intended profile depth TP, which is preferably 6.5 mm to 13.0 mm, in particular up to 10.0 mm.", "", "As shown inFIG.2, the protrusions7formed on the one groove flank2bare offset in relation to the protrusions7formed on the other groove flank2bin the circumferential direction and have an offset a2, determined in the circumferential direction between similarly positioned ends of the protrusions7, of 3.0 mm to 5.0 mm. According toFIG.2andFIG.3, each protrusion7is delimited in the radial direction by a top surface7a, in the circumferential direction by two end surfaces7b(FIG.2) and laterally by a side surface7crunning to the groove base2a. According toFIG.3, the top surface7adescends from the respective groove flank2bin the direction of the middle of the circumferential groove2in the radial direction and, when viewed in the cross section oriented in the axial direction, runs at a constant angle β of 30° to 55°, in particular of 40° to 50°, in relation to the radial direction. According toFIG.2, the end surfaces7bare sloping in relation to the axial direction and inclined in opposite directions in relation to the axial direction in such a way that the protrusion7has at the level of the top surface7aon the corresponding groove flank2ba maximum circumferential length cV(circumferential length at the longest point measured in the circumferential direction) of 18.0 mm to 25.0 mm, wherein the maximum circumferential length cVis preferably at the same time 30% to 50%, particularly preferably up to 45%, of the aforementioned distance a1(FIG.1) between the webs6. AsFIG.3also shows, when viewed in the cross section oriented in the axial direction, the side surface7cis curved in the form of a circular arc, at least in portions, in such a way that it adjoins the groove base2acontinuously (without any sharp angles). In the exemplary embodiment shown, in those circumferential portions in which the side surface7cof a protrusion7lying on the one groove flank2blies directly axially opposite the side surface7cof a protrusion7lying on the other groove flank2b, the side surfaces7calso run to the groove base2a. Alternatively, the side surfaces7cin the aforementioned circumferential portions may adjoin one another at the profile depth Tp, so that the groove base2ais missing in portions. The top surface7aand the side surface7cadjoin one another via a protrusion edge7d, which in plan view runs in the circumferential direction (FIG.2) and in the radial direction at a constant depth t1of 60% to 80%, in particular of 65% to 75%, of the profile depth TP.", "", "AsFIG.2in combination withFIG.3shows, between protrusions7lying opposite one another in the axial direction there remains in each case a cross-sectionally U-shaped groove-base channel8, which-depending on the design of the side surfaces7c—is delimited either by opposing circumferential portions of the side surfaces7cand the groove base2aor exclusively by the opposing circumferential portions of the side surfaces7c. According toFIG.3, each groove-base channel8between the protrusion edges7dhas in the axial direction a constant width bRGof 45% to 65%, in particular of 50% to 60%, of the width B1of the circumferential groove2.", "", "AsFIG.2shows, in plan view each web6is elongate in the circumferential direction, is at equal distances from the groove flanks2bin the axial direction and is made up of a middle part9, which is parallelogram-shaped in plan view and formed in the middle in the circumferential groove2, and two side parts10, each of a smaller volume in comparison with the middle part9and axially adjoining the middle part9laterally (one of the side parts10is indicated by a dotted line).", "", "The web6is delimited in the radial direction by a top surface11, which is aligned parallel to the tread periphery, in the circumferential direction by end surfaces12, which in plan view slope in relation to the axial direction, and axially laterally by side surfaces13, which in plan view run in the circumferential direction and are interrupted in the area of the side parts10. When viewed in the cross section oriented in the circumferential direction, the end surfaces12run at an angle of 0° to 3°, in particular of at least 1°, in relation to the radial direction (not shown). When viewed in the cross section oriented in the axial direction, the side surfaces13run at an angle γ (FIG.4) of 1° to 3° in relation to the radial direction.", "", "The side parts10lie directly opposite one another in the axial direction, separated by the middle part9, and are positioned symmetrically in relation to one another with respect to a longitudinally sectional center plane E1of the web6defined by the circumferential direction and the radial direction. Furthermore, the side parts10are each formed symmetrically with respect to a cross-sectional center plane E2of the web6defined by the axial direction and the radial direction. The side parts10locally widen the web6, are outwardly rounded and are delimited in the radial direction by the top surface11and also by a side surface14, which adjoins the top surface11and in plan view runs in the form of a circular arc, wherein the two side surfaces14—corresponding to the rounding of the side parts10—are in plan view curved convexly in relation to one another and each side surface14has at the level of the top surface11a delimiting edge14arunning in the form of a circular arc. When viewed in the cross section running perpendicularly to the associated delimiting edge14ain plan view, the side surfaces14run in the radial direction (FIG.5) or at an angle of up to 2° in relation to this direction. The delimiting edges14aof the two side surfaces14also run on a common radius r1.", "", "The web6has a maximum circumferential length cS, determined at the level of the top surface11and projected in the circumferential direction, of 8.0 mm to 12.0 mm, in the radial direction a height hS(FIG.4), determined with respect to the level of the profile depth TPand with reference to the top surface11, of 7% to 30%, in particular of 10% to 20%, of the profile depth TP(FIG.4) and in the area of the side parts10a maximum width bS, MAX(FIG.5), determined in the axial direction on the top surface11, of 70% to 100%, in particular of 80% to 90%, of the width bRGof the groove-base channel8(FIG.3). Furthermore, the web6has in the area outside the side parts10and the end surfaces12a constant width bS(FIG.4), determined in the axial direction on the top surface11, which is at least 0.5 mm, in particular 1.0 mm to 1.5 mm, less than the maximum width bS, MAX(FIG.5).", "", "AsFIG.2also shows, the already mentioned bevels2b′ adjoining the groove flanks2band running to the tread periphery are formed on the sides of the webs6, so that there is a web6in each case in the area between the bevels2b′. The bevels2b′ are sloping surfaces which, when viewed in the cross section oriented in the axial direction, appear as straight lines, run at an angle δ (FIG.4) of 35° to 55°, in particular of 45° to 50°, in relation to the radial direction and have a width bF(FIG.4) of 1.2 mm to 2.0 mm and a maximum circumferential length cFof 18.0 mm to 25.0 mm. The bevels2b′ formed on the one groove flank2bare offset in the circumferential direction from the bevels2b′ formed on the other groove flank2b, wherein the bevel2b′ located on the one groove flank2b“overlaps” the bevel2b′ located on the other groove flank2b—in relation to the circumferential direction—in portions. The one bevel2b′ overhangs the web6in one circumferential direction and the other bevel2b′ overhangs the web6in the other circumferential direction. The offset determined between the bevels2b′ is equal to the aforementioned offset a2of the protrusions7.", "", "The invention is not limited to the exemplary embodiment described. The bevels are optional. The number of protrusions in the area between successive free-standing webs in the circumferential direction may be in particular one to three on each groove flank. The circumferential groove provided with webs and protrusions may be a central circumferential groove, i.e. a circumferential groove which separates central profile ribs from one another."], "claims": ["1 - 10 . (canceled)", "a tread with a circumferential groove, is formed to a profile depth (T free-standing webs, which are at a distance from one another in a circumferential direction, are elongate in the circumferential direction and have a top surface running parallel to a tread periphery and a height (h at least one protrusion, which sits on the groove base and is elongate in the circumferential direction, is formed between successive webs in the circumferential direction on and along each groove flank; one protrusion of the at least one protrusion overlaps other protrusions with respect to the circumferential direction, so that between the protrusions there remains a groove-base channel, which has a constant width (b wherein each web is locally widened on each side in the middle by an outwardly rounded side part, which is partly delimited by a top surface of the web, wherein one side part lies opposite an other side part and wherein the web has at the side parts a maximum width (b", "12 . The pneumatic tire of claim 1 , wherein the maximum width (b S, MAX ) of the web is at least 70%, preferably 80% to 90%, of the width (b RG ) of the groove-base channel.", "13 . The pneumatic tire of claim 1 , wherein the constant width (b RG ) of the groove-base channel is 45% to 65%, in particular 50% to 60%, of the width (B 1 ) of the circumferential groove at the tread periphery.", "14 . The pneumatic tire of claim 1 , wherein the web has in the area outside its side parts a width (b S ), determined in the axial direction at the level of the top surface, which is at least 0.5 mm, in particular 1.0 mm to 1.5 mm, smaller than the maximum width (b S, MAX ) of the web present in the area of the side parts.", "15 . The pneumatic tire of claim 1 , wherein the side parts are positioned symmetrically in relation to one another with respect to a longitudinally sectional center plane (E 1 ) of the web defined by the circumferential direction and the radial direction.", "16 . The pneumatic tire of claim 1 , wherein the side parts are formed symmetrically with respect to a cross-sectional center plane (E 2 ) of the web defined by the axial direction and the radial direction.", "17 . The pneumatic tire of claim 1 , wherein the web has a maximum circumferential length (c S ), determined at the level of the top surface and projected in the circumferential direction, of 8.0 mm to 12.0 mm.", "18 . The pneumatic tire of claim 1 , wherein the height (h S ) of the web is 10% to 20% of the profile depth (T P ).", "19 . The pneumatic tire of claim 1 , wherein the protrusions on the groove flank have a maximum circumferential length (c V ) of 18.0 mm to 25.0 mm.", "20 . The pneumatic tire of claim 1 , wherein on the sides of each web, the groove flanks are provided with bevels ( 2 b ′), which run to the tread periphery, overhang the web in the circumferential direction, at least on one side, run at an angle (δ) of 30° to 55°, in particular of 40° to 50°, in relation to the radial direction and have a width (b F ) of 1.2 mm to 2.0 mm and a circumferential length (c F ) of 18.0 mm to 25.0 mm."], "bibtex": "@patent{20240367463,\n    title = {PNEUMATIC VEHICLE TYRE},\n    number = {20240367463},\n    year = {2024},\n    note = {File: US20240367463A1-20241107.XML}\n    }", "classification": "B60C1113FI"}, {"title": "METHOD FOR FORECASTING THE CURRENT WEAR STATE OF AN IDENTFIED TIRE INSTALLED ON AN IDENTIFIED AEROPLANE", "doc_number": "20240367464", "filename": "US20240367464A1-20241107.XML", "abstract": "A computer-implemented forecasting method ( 200 ) forecasts a number of residual landings (remaining LPT) corresponding to achievement of a removal threshold of an identified tire, which is output by a forecasting model. During the forecasting method, a value of the removal threshold of the identified tire, which is installed on an identified aeroplane, is compared with the number of residual landings (remaining LPT) before achievement of the removal threshold of the identified tire, and as a consequence, a system ( 100 ) that carries out the forecasting method creates a maintenance schedule for the identified tire.", "detailed_description": ["The solution proposed by the invention aims to estimate a lifetime of an aeroplane tyre without adding new sensors and solely using historic information (comprising, for example, data corresponding to dates of departure, dates of arrival, airports visited and climatic data) of flights that the tyre in question has made and general information on this tyre (comprising, for example, data corresponding to its retread level, its position of installation on the aeroplane, the theoretical average number of landings possible in this position and the performance of similar tyres excluding removal as a result of FOD). These data, which describe a large part of the use of a tyre, will be used in a machine-learning model in order to forecast the current wear state of the tyre on the basis of parameters influencing its lifetime.", "", "Regarding the characteristics of an aeroplane tyre concerned by the invention, its geometry must be taken into account.FIGS.1and2contain schematic depictions of a tyre P which, in the conventional way, comprises two circumferential beads intended to anchor the tyre on a rim. Each bead comprises an annular reinforcing bead wire. The makeup of a tyre is typically described by a representation of its constituent components in a meridian plane, that is to say a plane containing the axis of rotation of the tyre. The radial, axial and circumferential directions denote the directions perpendicular to the axis of rotation of the tyre, parallel to the axis of rotation of the tyre, and perpendicular to any meridian plane, respectively. The expressions “radially”, “axially” and “circumferentially” mean “in a radial direction”, “in the axial direction” and “in a circumferential direction” of the tyre, respectively. The expressions “radially interior” and “respectively radially exterior” mean “closer to, respectively further away from, the axis of rotation of the tyre, in a radial direction”.", "", "With reference toFIG.1, the tyre P comprises an internal limit FIand an external limit FEwhich together define the limits of a sidewall F of the tyre P. The internal limit FIseparates the sidewall F of the tyre from a rim (not depicted) on which the tyre is intended to be mounted. The tyre P also has a rim radius RJdefined as being the distance between a central point C of the tyre and the internal limit FIwhich separates the rim and the sidewall F of the tyre. The tyre P also has a sidewall internal diameter defined as being twice the rim radius RJ. The tyre P also has a tyre radius RPdefined as being the distance between the central point C and an external limit FEof the sidewall F which represents the tread surface of the tyre. The tyre P also has a tyre diameter defined as being twice the tyre radius RP.", "", "With reference toFIG.2, the tyre P inflated and unladen has several parameters pertaining to its geometry, including a nominal section width LPand a height HP(the height HPoften being expressed as a percentage of the width LP). The tyre P also has a measurement DJ which represents the diameter of a rim on which the tyre is intended to be installed (this measurement being substantially equal to the sidewall internal diameter FI). It must be appreciated that each of these parameters may be expressed in equivalent known length measurements (for example in millimetres (mm) or in inches (in)).", "", "With reference now toFIGS.3and4, in which the same numbers identify identical elements,FIG.3shows a schematic view of embodiments of the method for forecasting a number of residual landings corresponding to achievement of a removal threshold of an identified tyre (or “forecasting method” or “method”). The forecasting method of the invention is based on the wear state of an identified tyre, being defined by way of a forecast wear profile, by a remaining groove height (the groove comprising a tread-pattern element allowing water to be removed in order to allow contact and adherence with the runway or taxiway) or via another means for predicting the potential useful tread remaining. It will be noted that a wear state is represented by a value or set of values representative of the difference between the new state (represented by a tyre having never been installed on an aeroplane) and the worn state (represented by a tyre removed from use because the removal threshold has been achieved through wear). The wear state may take the form of a unitary value such as minimum groove height, of a set of values defining the height of the tread in a meridian plane of the tyre (for example, a 2D profile) or of a set of values defining the height of the tread on all or part of the external surface of the tyre (for example, a 3D profile).", "", "As used here, the “remaining lifetime” of an identified tyre refers to its potential residual wear as a function of the values of the parameters influencing its longevity. The remaining lifetime may be determined continuously or at regular, predefined or sporadic intervals by collecting data corresponding to the parameters influencing the lifetime of the identified tyre. On the basis of the collected data, the method of the invention may define a current wear state of the tyre with a view to determining the remaining lifetime of the identified tyre, which lifetime is computed in number of landings accessible.", "", "FIG.4shows a system100that carries out the forecasting method of the invention. The system comprises a communication network102that manages the data input into the system100from various sources. The communication network102incorporates one or more communication servers (or “servers”)102athat manage the data corresponding to the historic information and to the general information regarding an identified tyre. The term “identified tyre” (in the singular or the plural) is used here to refer to a tyre present in the physical environment of the system100and which is installed on an identified aeroplane (being a tyre still in service on the identified aeroplane). The identified tyre may comprise one or more known sensors for generating or capturing data, such as data corresponding to an operational environment of the identified aeroplane or one portion thereof. The sensors may include a set of sensors for delivering data regarding characteristics of operation of the identified tyre. The sensors may include, for example, one or more speed sensors, one or more acceleration sensors, one or more sensors related to traction, one or more sensors related to braking, and/or a combination of sensors for collecting data regarding one or more aspects of the dynamic situation of the identified tyre. The sensors may also deliver stored data regarding the identification of the identified tyre (including, nonlimitingly, its provenance as regards production, distribution and/or storage, it date of production, its retreading history if applicable and its position and its installation history).", "", "The term “historic information” (in the singular or plural) is used here to refer to data corresponding to the historic flights of the identified aeroplane having the identified tyre installed. These data may comprise, nonlimitingly, data corresponding to the dates of departure and/or arrival of the identified aeroplane, the airports visited by the identified aeroplane (these data being capable of being collected from various sources, including the data of historic flights attributed to an airline104to which the identified aeroplane belongs), data on the aeroplane (including, nonlimitingly, the manufacturer, the version of the aeroplane model, its identification code, etc.) and meteorological and/or climatic conditions106during the historic flights.", "", "The term “general information” (in the singular or plural) is used here to refer to data corresponding to the identified tyre. These data may comprise, nonlimitingly, its size (which may be represented by the type of tyre and/or its nomenclature), its construction code (for example, “-” for bias-ply and “R” for radial), its provenance as regards production108(for example, the name and/or trademark of the producer of the identified tyre, its date of manufacture and its site of manufacture, distribution and/or storage), its serial number, its load rating, its speed rating, its expected landings per tread or LPT and/or its unique identification code. By way of example, for a tyre of a size 52×21.0R22, the number “52” represents the diameter of the tyre in inches, the number “21.0” represents the cross-sectional width at the widest point of an inflated new tyre, the letter “R” represents a radial tyre, and the number “22” represents the diameter of the rim in inches.", "", "The general information may also comprise the installation position110(including the installation history) of the identified tyre. It will be noted that the installation position shown inFIG.4is given by way of example.", "", "The general information may also comprise the retreading level (if applicable) of the identified tyre. The term “retreading” is used here to refer to the method used to return a worn tyre to a state fit for operation by renewing the rubber of the tread and the one or more plies. During the retreading process, old tread products are removed and replaced by new materials. Retreading is a method that is known and regulated in the aerospace industry. Data corresponding to the retreading level of an identified tyre are managed by the airline104and/or by the producer (represented by the number108).", "", "In one embodiment of the invention, the historic information and/or the general information may be generated and/or managed, at least in part, by one or more airports (or by one or more networks of airports including the specific airport). In this embodiment, the system100aims to simulate destination airports of the identified aeroplane on the basis of the historic information. It will be noted that airlines104manage their aeroplanes differently, and their modes of management are therefore capable of modification. Thus, in this embodiment, the general information may also be used to specify the relationship between the historic information and the properties of the identified tyre by performing a personalized simulation with respect to the destination airports.", "", "The communication network102of the system100comprises one or more communication devices (not shown) that capture and transmit the collected data to the server102a. The one or more communication devices comprise one or more portable devices such as a mobile network device (for example, a mobile telephone, a laptop computer, one or more portable devices connected to the network, including “augmented reality” and/or “virtual reality” devices, and/or any combinations and/or any equivalents). In all cases, the communication devices may comprise clothes and/or wearables connected to the network, and worn by one or more operators (where each operator is a human or a known apparatus such as a robot). By way of example, a monitoring device worn by an airline pilot may monitor via video the conditions of a flight and send the corresponding data (being the historic information of the identified tyre) to the server102aof the communication network102.", "", "The one or more communication devices may also comprise one or more remote computers able to transfer data via the communication network102. By way of example, a portable device of the system100may transmit the historic information and/or the general information of the identified tyre to a remote computer of the system100. On the basis of the transmitted data, the remote computer may transmit to the portable device a statement regarding maintenance of the identified tyre, indicating a plan regarding expected undertakings (for example, advice to remove from service the identified tyre because a forecasting model of the invention indicates that its tread depth is too low).", "", "The communication network102may include wired or wireless links and may employ any data-transfer protocol known to those skilled in the art. Examples of wireless links may include, nonlimitingly, radiofrequency (RF) links, satellite links, (analogue or digital) cell or mobile telephone links, Bluetooth® links, Wi-Fi links, infrared links, ZigBee links, local-area-network (LAN) links, wireless-local-area-network (WLAN) links, wide-area-network (WAN) links, near-field-communication (NFC) links, links according to other wireless-communication standards and configurations, their equivalents, and a combination of these elements.", "", "It will be understood that the communication network102aimplies the use of one or more processors as will be understood by anyone skilled in the art. The term “processor” (or, alternatively, the term “programmable logic circuit”) (in the singular or in the plural) refers to one or more devices capable of processing and analysing data and comprising one or more software packages for processing same (for example one or more integrated circuits known by those skilled in the art as being included in a computer, one or more controllers, one or more microcontrollers, one or more microcomputers, one or more programmable logic controllers (or PLCs), one or more application-specific integrated circuits, one or more machine-learning algorithms and/or one or more other known equivalent programmable circuits).", "", "The invention therefore capitalizes upon methods and tools based on artificial intelligence (or “AI”) to complete partial information that is delivered (on the basis of the historic information and general information received). An analysis of the machine learning is carried out using a machine-learning model such as an artificial neural network comprising a plurality of layers. The machine-learning analysis receives as input processed data from the communication network102, i.e. the historic information and the general information of the identified tyre. In the embodiments, data are received by way of inputs into various layers of the machine-learning model. The algorithm allows continuous improvement across all of the aeroplane tyres, ensuring self-improvement of the system100from the experience it acquires, particularly as regards the choice between a plan to service and a plan to inspect the identified tyre.", "", "With reference once again toFIGS.3and4, and furthermore toFIG.5, embodiments of a method for forecasting wear state of the invention will now be disclosed. In each embodiment, the forecasting method is implemented by computer so that the system100may construct a model for forecasting wear state for the identified tyre (or “forecasting model”) (either in terms of number of landings or in terms of the wear state of the aeroplane tyre). With reference toFIG.5, this figure shows one embodiment of the forecasting method of the invention200, in which embodiment the forecasting model may predict a number of residual landings of the identified tyre with a view to determining its remaining lifetime. The remaining lifetime of the identified tyre comprises a number of landings (or landings per tread or LPT) of the identified aeroplane corresponding to a forecast wear state of the identified tyre. In this embodiment, the method therefore concerns construction of a model for forecasting the number of residual landings of the identified tyre with a view to determining a maintenance schedule. The maintenance schedule of the identified tyre comprises a choice between a service plan (in which the identified tyre remains installed on the identified aircraft) and an inspection plan (in which the identified tyre is inspected with a view to ensuring that it is removed at the right time, either for carrying out retreading thereof or for introducing it into the end-of-life circuit, the latter comprising recycling).", "", "On starting the forecasting method200shown inFIG.5, the forecasting model is constructed on the basis of one or more parameters influencing the wear of the identified tyre. To construct the forecasting model, the method comprises a step202of introducing influencing parameters of the identified tyre, this step being carried out by the system100. During this step, influencing parameters of the identified tyre are obtained by the communication devices of the system100. The obtained influencing parameters comprise data corresponding to the historic information and to the general information of the identified tyre. These data are stored (for example, in one or more databases120,122of the system100) (seeFIG.3), and they are updated throughout the forecasting method on a continuous basis or on an intermittent basis.", "", "The introducing step comprises a step of creating a training database (or “database”) of the wear states, which is introduced into the forecasting model. The created training database may comprise a reference database of the aeroplane tyres that are intended to be installed on the identified aeroplane. The database may comprise an already created reference (for example, a table of remaining lifetimes of the aeroplane tyres at a plurality of wear thresholds). The database may include parameters corresponding to a plurality of commercially available tyres (including parameters that form part of the general information discussed above). The specific source of the wear states of a plurality of wear levels is not essential to the method described here, which would function equally well using data obtained exclusively from tyres having reached their wear threshold. By way of example, a system may implement the method of the invention using data obtained from measurements performed on tyres received by a factory after deinstallation of the installed assembly.", "", "This system implements the method of the invention to assist an airline with transmission of information on the progress of wear of the tread of an identified tyre to personnel of an airport served by the airline, perhaps during an inspection of the aeroplane. This system implements the method of the invention using data from measurement of the wear threshold of the “stocked” tread to prepare personalized reminders to be sent to an operator of the aeroplane (i.e. the airline or an airport served by the airline) to forecast servicing of the identified tyres. The created database may include images of wear profiles corresponding to known wear states and the corresponding number of landings carried out. The wear profile of an identified tyre is defined by the outline of the external surface of its tread during use. Thus, a new tread having not yet been employed is considered to be an envelope worn to 0%, and a tread that meets the manufacturer's advisory conditions for removal is considered to be an envelope worn to 100%. The profile described here may consist of one or more (3D) surface measurements (carried out beforehand) that reproduce all or some of the external surface of a tread. Furthermore, the profile described here may consist of one or more (2D) linear measurements (carried out beforehand) in one or more planes that contain the axis of symmetry of the tread. The training database therefore comprises expected images (and data therefore) corresponding to (3D, 2D, 1D) profiles of worn tyres, and the landings of the aeroplane.", "", "The forecasting method of the invention200, which method is shown inFIG.5, further comprises a step204of training the forecasting model to predict the number of residual landings corresponding to achievement of the removal threshold of the identified tyre. As used here, the “removal threshold” of an identified tyre refers to a regulatory minimum depth (or another threshold defined by the user) at which it must be replaced. During this step, a machine-learning method receives as input the obtained influencing parameters (being the historic information and the general information of the identified tyre) and the data of the created training database. After the system100has obtained the historic information and general information corresponding to the identified tyre, the processor may collect known wear states corresponding to the number of landings carried out by the identified tyre with a view to constructing the forecasting model.", "", "In one embodiment, the machine-learning method employed during the training step204comprises a supervised-learning method. The supervised-learning method may comprise one or more neural networks (for example, autoencoders, ANNs, CNNs, RNNs, perceptrons, long short-term memory (LSTM), Hopfield networks, Boltzmann machines, deep belief networks, deconvolutional neural networks, generative adversarial networks (GANs), etc.) and their complements and equivalents. The one or more CNNs may be trained with ground-truth data that are generated using data representative of the influencing parameters (for example, the data incorporated into the training database described above).", "", "In one embodiment in which the training step204comprises a supervised-learning method, this step comprises a supervised-learning method of GBR (gradient boosting regressor) type. The GBR learning method receives as input data corresponding to the historic information and general information of the identified tyre (including, nonlimitingly, the position of the identified tyre on the identified aeroplane, the retreading level of this identified tyre and the proportion of landings in each of the airports visited by this identified tyre). The GBR learning method aims to predict the number of residual landings (remaining LPT) corresponding to achievement of the removal threshold of the identified tyre. Thus, the output to be predicted of the forecasting model will be the forecast of the wear state of the identified tyre (characterized, for example, by a date range in which the removal threshold of the identified tyre will be reached). This for example allows tyres with an excessively pronounced wear state (i.e. a wear state beyond a predetermined wear threshold that ensures correct operation of the tyre) to be removed preventively. By way of example, in certain use cases, the rate of wear of the shoulder of the identified tyre induces appearance of working plies before the skid limit is reached. Providing a wear profile of a worn aeroplane tyre allows immediate and unforecast removals to be avoided.", "", "The forecasting method200of the invention further comprises a step206of forecasting the number of residual landings (or “remaining LPT”) before achievement of the removal threshold of the identified tyre. The number of residual landings of the identified tyres may be computed on the basis of data corresponding to the influencing parameters of future landings. It will be noted that the future-landing data may be hypothetical or real depending on the type of management applied by an airline to its fleet of aeroplanes and its ability to determine, within a given timeframe, the routes to which an aeroplane will be assigned. An offset between the true wear states and the number of forecast landings is denoted by a computed error, such an error indicating a variation in the tread of the identified tyre. The computed errors may be input into the training database (described above) to improve the predictive capacity of the forecasting model.", "", "The forecasting method200further comprises a comparing step208during which the remaining LPT before achievement of the removal threshold of the identified tyre, which is output by the forecasting model, is compared to a value of the removal threshold. This removal threshold is defined by the user (for example, an airline) and/or by the manufacturer of the identified tyre with a view to organizing maintenance operations.", "", "During the comparing step, the system100indicates a plan210to service the identified tyre if the number of residual landings output by the forecasting model is higher than the removal-threshold value defined for the identified tyre. Similarly, the system100indicates a plan212to inspect the identified tyre if the number of residual landings output by the forecasting model is equal to or lower than this removal-threshold value. In the case where the tread of the identified tyre has reached or is close to reaching the wear removal threshold, the system100takes into account the wear states of worn tyres obtained from measurements of wear states performed on aeroplane tyres received by a factory after use. In the case where the identified tyre must be replaced by another tyre of the same type, the forecasting model is updated during the replacement of the worn tyre by an identified tyre having a tread considered new (see the number214ofFIG.5). It will be noted that the replacement of the identified tyre may comprise either retreading or recycling (or another end-of-life treatment) of the identified tyre.", "", "With reference again toFIG.3, in all the embodiments of the forecasting method of the invention, the method may further comprise an optional simulating step400that aims to simulate destination airports of the identified aeroplane. In these embodiments, this simulation aims to simulate destination airports of a given aeroplane on the basis of historic data of flights of the airline to which this aeroplane belongs. This simulation is performed by way of a Markov chain in which each state represents one airport and each inter-airport link represents the probability of landing in one airport starting from another. These probabilities are estimated on the basis of historic information with a view to carrying out random scheduling given that the airline is ignorant of the future uses of its aircraft. The use of a Markov chain allows key characteristics of the data to be learnt with a view to developing and to evaluating a corresponding uncertainty model.", "", "In embodiments of the method of the invention aiming to simulate destination airports of the identified aeroplane, the simulation of a number of destinations allows the proportion of landings of the identified tyre at each of a plurality of airports identified in the simulation to be computed (therefore, using “real” and simulated data). This step400of simulating destination with a view to completing the life of the identified tyre is repeated a plurality of times via a Monte-Carlo loop (see number402ofFIG.3). Each simulation is, subsequently, the subject of a prediction via a model as described above, in order to finally obtain, for the identified tyre, a forecast number-of-landings distribution."], "claims": ["1 .- 10 . (canceled)", "a step ( a step of obtaining parameters influencing the identified tire, which step is carried out by the communication servers of the system ( a step of creating a wear-state training database, which is introduced into a model for forecasting the number of residual landings corresponding to achievement of the removal threshold of the identified tire; a step ( a step ( a comparing step (", "historic information comprising data corresponding to historic flights of the identified aeroplane having the identified tire installed thereon; and general information comprising data corresponding to the identified tire, including position of installation of the identified tire on the identified aeroplane.", "a plan to service the identified tire when the number of residual landings output by the forecasting model is higher than the removal-threshold value defined for the identified tire; and a plan to inspect the identified tire when the number of residual landings output by the forecasting model is equal to or lower than the removal-threshold value defined for the identified tire.", "14 . The forecasting method ( 200 ) according to claim 11 , wherein a supervised-learning method receives as input the obtained influencing parameters and the data of the training database so that the processor may acquire known wear states corresponding to the number of landings carried out by the identified tire to construct the forecasting model.", "15 . The forecasting method ( 200 ) according to claim 14 , wherein the supervised-learning method comprises a supervised-learning method of gradient boosting regressor type.", "16 . The forecasting method ( 200 ) according to claim 14 , wherein the training database includes images of wear profiles corresponding to known wear states and corresponding numbers of landings carried out by the identified tire.", "17 . The forecasting method ( 200 ) according to claim 11 , wherein, during the forecasting step ( 206 ), the number of residual landings of the identified tires is computed on a basis of data corresponding to the influencing parameters of future landings.", "18 . The forecasting method ( 200 ) according to claim 11 further comprising a step ( 400 ) of simulating destination airports of the identified aeroplane on the basis of historic flight data.", "19 . The forecasting method ( 200 ) according to claim 18 , wherein the simulating step ( 400 ) is performed using a Markov chain in which each state represents one airport and each inter-airport link represents a probability of landing in one airport starting from another.", "20 . The forecasting method ( 200 ) according to claim 18 , wherein the simulating step ( 400 ) is repeated a plurality of times via a Monte-Carlo loop ( 402 ) to forecast an end-of-life of the identified tire."], "bibtex": "@patent{20240367464,\n    title = {METHOD FOR FORECASTING THE CURRENT WEAR STATE OF AN IDENTFIED TIRE INSTALLED ON AN IDENTIFIED AEROPLANE},\n    number = {20240367464},\n    year = {2024},\n    note = {File: US20240367464A1-20241107.XML}\n    }", "classification": "B60C1124FI"}, {"title": "TIRE PRESSURE DETECTOR WITH MUTLTIPLE FREQUENCIES", "doc_number": "20240367465", "filename": "US20240367465A1-20241107.XML", "abstract": "A tire monitor includes a sensor generating tire data and a plurality of control modules having phase locked loop circuits. The control modules generate output signals carrying the tire data. A first of the control modules is configured to generate first output signals having a first frequency and according to a first protocol. A second of the control modules is configured to generate second output signals having a second frequency and according to a second protocol. In examples, the output signal can be transmitted in parallel to different computing systems.", "detailed_description": ["The subject technology overcomes prior art problems associated with tire pressure monitors. For example, systems and techniques described herein provide improved tire monitors usable with myriad different tire monitoring systems. For example, the technology described herein provides a single tire pressure monitor that can be configured to transmit information to multiple receivers. In some instances, information can be transmitted to multiple receivers in parallel. The advantages, and other features of the systems and methods disclosed herein, will become more readily apparent to those having ordinary skill in the art from the following detailed description of certain preferred embodiments taken in conjunction with the drawings which set forth representative examples of the present disclosure.", "", "In some aspects of this disclosure, a tire monitor is coupled to a tire of an automobile. The tire monitor includes a pressure sensor, and, in at least some instances a motion sensor, a temperature sensor, and/or one or more other sensors. The sensor(s) generate sensor data that can be transmitted to one or more computing systems.", "", "In aspects of this disclosure, the tire monitor is configurable to transmit the sensor data via a first frequency and/or according to a first protocol to a first computing device. The first computing device may be a tire pressure monitoring system onboard the vehicle. The tire monitor is also configurable to transmit the sensor data via a second frequency and/or according to a second protocol to a second computing device. The second computing device may be a personal device, such as a mobile device.", "", "According to additional aspects of this disclosure, a first control module is configured to generate first output signals to transmit the sensor data to the first computing device. The first control module may include a first phase locked loop (PLL) circuit that generates the first output signals according to one of a plurality of frequencies. A second control module is configured to generate second output signals to transmit the sensor data to the second computing device. The second control module may include a second phase locked loop (PLL) circuit that generates the second output signals according to one of a plurality of frequencies.", "", "As a result of the improved tire monitors disclosed herein, a vehicle service center or similar retailer can stock fewer specialized replacement parts. For instance, because the tire monitors are configurable to transmit data at different frequencies and/or according to different protocols, the need for specific replacement parts with fixed frequencies and/or transmission protocols is obviated. These and other features and benefits of this disclosure will be discussed with reference to the Figures.", "", "FIG.1illustrates a vehicle100including a number of tires102. Each of the tires102includes a tire monitor104. Specifically, one of the tire monitors104is coupled to each of the tires102. According to aspects of this disclosure, each of the tire monitors104can include, among other features, one or more sensors106, first signal processing component(s)108, and second signal processing component(s)110. Although not illustrated inFIG.1, each of the tire monitors104may also include one or more power sources, e.g., batteries, and/or other conventionally-known components.", "", "The sensor(s)106are configured to generate signals associated with one or more measured attributes of the tires102. For example, the sensor(s)106can include a pressure sensor configured to generate pressure data associated with the associated tires. In another example, the sensor(s)106can include a temperature sensor configured to generate temperature data associated with the tire. The sensor(s)106can also, or alternatively, include motion sensors. For example, motion sensor(s) can include an accelerometer, a gyroscope, an inertial measurement unit, a resolver, a rotary sensor, a position sensor, or the like. The sensor(s)106may generate updated data at a predetermined frequency, e.g., according to a sampling rate. The sensor(s)106may be configurable, e.g., the sampling rate may be adjustable. For example, the sensor(s)106may generate data at a first sampling rate when the vehicle is in motion and at a second sampling rate when the vehicle is stationary.", "", "Both the first signal processing component(s)108and the second signal processing component(s)110may be configured to process signals generated by the sensor(s)106, e.g., in parallel. In some examples, the first signal processing component(s)108and the second signal processing component(s)110may have substantially the same functionality. For example, the first signal processing component(s)108can include functionality to modulate a signal corresponding to data from the sensor(s)106onto first output signals112. The first output signals112may be associated with a first protocol, e.g., including a first radio frequency output. Similarly, the second signal processing component(s)110can include functionality to modulate a signal corresponding to data from the sensor(s)106onto second output signals114. The second output signals114may be associated with a second protocol, e.g., having a second radio frequency output. As detailed further below with reference toFIG.2, the first signal processing component(s)108can include a first control module, a first multi-frequency matching circuit, and a first multi-frequency antenna. The second signal processing component(s)110can include a second control module, a second multi-frequency matching circuit, and a second multi-frequency antenna. Although the example ofFIG.1shows only the first signal processing component(s)108and the second processing component(s)110, additional instances of the signal processing component(s) can also be included.", "", "The first signal processing component(s)108, as noted above, may be configured to generate the first output signals112, and the second signal processing component(s)110may be configured to generate the second output signal114. The first output signals112and the second output signals114are radio frequency (RF) signals carrying information associated with data generated by the sensor(s)106. The first output signals112carry information generated by the sensor(s)106and may conform to a first protocol. The second output signals114can carry the same information generated by the sensor(s)106and may conform to a second protocol. Without limitation, the first protocol and the second protocol can include one or more of a frequency or bandwidth, e.g., a transmission frequency, a transmission channel, a data rate, a transmission power, or other characteristics of a wireless transmission. In at least some examples, the first protocol and/or the second protocol may correspond to conventional communication protocols, such as Bluetooth®, near-field communication standards, or the like.", "", "In the example ofFIG.1, the first output signals112are configured for transmission to, and reception by, a tire pressure monitoring system116. The second output signals114are configured for transmission to, and reception by, a remote computing device118, which may be a personal user device.", "", "As illustrated inFIG.1, the tire pressure monitoring system116is a computing system onboard the vehicle100. Generally, the tire pressure monitoring system116includes functionality to receive signals, e.g., the first output signals112, from the tire monitors104. In examples, the tire pressure monitoring system116includes logic to determine whether any of the associated tires102has a tire pressure that is outside of a certain predefined operating limit. For instance, the tire pressure monitoring system116can include a pressure for each of the tires102based on the first output signals112, and identify that the pressure of the tire is lower than a first threshold pressure (e.g., the tire is underinflated) or higher than a second threshold pressure (e.g., the tire is overinflated). The tire pressure monitoring system116can also include logic to transmit tire information, e.g., tire pressure, a determined alarm state, and/or the like, for presentation on an operator interface (not shown inFIG.1) in the vehicle100. Without limitation, the tire pressure monitoring system116can transmit data for presentation via a wired or wireless communication connection.", "", "In the example ofFIG.1, the tire pressure monitoring system116is illustrated as including a receiver120and a transmitter122. The receiver120may be configured to receive signals, e.g., the first output signals112, from the tire monitors104. The tire pressure monitoring system116is generally configured, e.g., at manufacture, for the receiver120to cooperate with original tire monitors installed at the tires102at manufacture/assembly. Specifically, and as noted above, the protocol used to transmit signals from the original tire monitors and received at the tire pressure monitoring system116may be specific to the automobile. For instance, an original tire monitor may be configured to transmit, and the receiver120may be configured to receive, signals transmitted according to a specific frequency. For example, and without limitation, conventional frequencies can include 315 MHz and 433.92 MHz.", "", "The transmitter122may be configured to transmit data. For instance, the transmitter122can transmit data to the tire monitor104, e.g., to request information, to instruct a reconfiguration such as a modified sampling rate, or the like. The transmitter122can also be configured to transmit data to other electronic devices, e.g., an electronic device associated with an owner of the vehicle100, to a display of the vehicle100, or the like. The transmitter122may be configured to send data according to any of a number of conventional protocols.", "", "As noted above,FIG.1also shows that the tire monitor104generates the second output signals114, e.g., via the second signal processing component(s)110. In the example, the second output signals114are transmitted to the remote computing device118. The remote computing device118is illustrated as being a personal device, e.g., a mobile phone, a tablet, or the like, associated with a user124. For example, the user124may be an owner of the vehicle100, a lessee, a technician, a fleet manager, or any individual associated with the vehicle100. As will be appreciated, the remote computing device118and the user124are shown for example only. In implementations, the remote computing device118can be any computing device capable of receiving the second output signals114.", "", "The tire monitor104of the present disclosure includes functionality for communicating tire-specific information, e.g., pressure, motion data, acceleration data, position data, and/or the like, with both the tire pressure monitoring system116and the remote computing device118. As will be appreciated from the foregoing, the tire pressure monitoring system116is configured to receive signals according to a first protocol, e.g., established at vehicle manufacture, and the remote computing device is configured to receive signals according to a second protocol, e.g., based at least in part on capabilities, settings, specifications, and/or the like of the remote computing device118. Moreover, and as detailed further herein, the tire monitor104is configurable to generate the first output signals112and the second output signals114for transmission to the tire pressure monitoring system116and/or the remote computing device118, e.g., based on attributes of the tire pressure monitoring system116and/or the remote computing device118.", "", "FIG.2is a block diagram showing an example of the tire monitor104in more detail.FIG.2will be used to describe aspects and techniques for configuring the tire monitor104to transmit tire information to one or more receivers, e.g., according to different protocols.", "", "In the example ofFIG.2, the tire monitor104is illustrated as including a plurality of modules or other logically-connected computing blocks. For instance, various of the illustrated blocks and/or other aspects of the tire monitor104may be implemented in an intelligent hardware device, e.g., a central processing unit (CPU), a microcontroller, an application specific integrated circuit (ASIC), or may be implemented as part of a reconfigurable device. Aspects of the tire monitor104can include random access memory (RAM) and read-only memory (ROM) which may include instructions that are configured to, when executed (or when compiled and executed), cause aspects of the tire monitor104to perform various functions described herein (including but not limited to the operations of the process illustrated inFIG.3and discussed further below. Various components of the tire monitor104may be implemented using one or more separate CPUs or ASICs, for example, and the components may, individually or collectively, be implemented with one or more ASICs adapted to perform some or all of the applicable functions in hardware. Each of the noted components may be a means for performing one or more functions related to operation of the system.", "", "More specifically, the tire monitor shown inFIG.2includes a pressure sensor202. The pressure sensor202is configured to sense a pressure within a tire to which the tire monitor is coupled, e.g., one of the tires102. For example, the pressure sensor202can be one of the sensor(s)106discussed above. As will be appreciated, the pressure sensor202can generate data associated with a pressure of the tire, and the generated data can be used to determine whether the tire is properly inflated. Improperly inflated tires can be hazardous.", "", "As also shown inFIG.2, the pressure sensor202is communicatively coupled to a first control module204. The first control module204includes a phase-locked loop (PLL)206, which may be an N-fractional PLL. The first control module204is communicatively coupled to a first multi-frequency matching circuit208, and the first multi-frequency matching circuit208is communicatively coupled to a first multi-frequency antenna210. In examples, the first control module204(including the first PLL206), the first multi-frequency matching circuit208, and the first multi-frequency antenna210can be an example of the first signal processing component(s)108, e.g., configured to generate and output the first output signals112.", "", "In more detail, the first control module204may implement the PLL206to receive an input reference frequency as an intermediate frequency (IF) and modulate information onto the IF signal according to a particular protocol that is programmed into the first control module204. In some examples, the PLL206can include a frequency select input used to change the final output frequency of the first control module204. For example, when the first output signals112are intended for receipt by the tire pressure monitoring system116, the frequency select input may be used to select a final output frequency of either 315 MHz or 433.92 MHZ. Of course, other frequencies can also be used. The frequency select input may be programmed into the tire monitor104during initial configuration of the tire monitor104. In some embodiments, the first control module204can be implemented as an ASIC configurable to operate at the selected frequency through a programming operation, as will be described in more detail below, that configures both a frequency and a protocol associated with the first output signals112.", "", "The PLL206can include a programmable logic function that receives the frequency select input and is configured to open or close one or more switch. For instance, opening/closing the switch(es) can operatively connect one or more matching circuits of the first multi-frequency matching circuit208with components of an RF transmit chain that may include an N-fractional PLL, a crystal oscillator, and/or a power amplifier. The frequency select input may also be coupled with the N-fractional PLL to select an appropriate multiplier that is used in the N-fractional PLL, e.g., to provide the desired frequency output. For example a crystal oscillator of 20 MHz would have a multiplier of 15.75 times to produce an output frequency of 315 MHz. A multiplier of 21.696 times would produce an output frequency of 433.92 MHZ.", "", "The PLL206may output a high frequency RF signal at a selectable frequency signal through the first multi-frequency matching circuit208. In examples, the first multi-frequency matching circuit208may include a plurality of matching circuits that use impedance matching. For instance, a first matching circuit may include a capacitor coupled with multiple inductors and capacitors of an RF impedance matching circuit. A second matching circuit may omit the capacitor. Switching one or more components to be coupled to the matching circuit may obtain the desired impedance matching based on a particular frequency of interest. Thus, switch elements may be provided in such circuits to switch in and out different matching circuit components to obtain a desired matching circuit impedance. Of course, it will be readily understood by one of skill in the art that one of a number of different selected frequencies may be obtained by providing the appropriate frequency select inputs to a PLL module to produce a desired PLL output frequency and switch appropriate matching components to be coupled with a matching circuit to provide desired impedance matching characteristics for the matching circuit. Accordingly, the principles described herein are applicable to devices that may be configured to operate according to one of two or more different frequencies.", "", "Accordingly, the first control module204, using the first PLL206, may output a high frequency RF at a selectable frequency signal through the first multi-frequency matching circuit208, e.g., as the first output signals112. The first output signals112are then transmitted, as RF signals at the selected frequency signal, via the first multi-frequency antenna210to the tire pressure monitoring system116. As shown inFIG.2, the first multi-frequency antenna210can be configured to transmit signals, e.g., as the first output signals112, at a plurality of frequencies (f_1, f_2,f_n).", "", "FIG.2also shows that the pressure sensor202is communicatively coupled to a second control module212. The second control module212includes a second phase-locked loop (PLL)214, which may be an N-fractional PLL. The second control module212is communicatively coupled to a second multi-frequency matching circuit216, and the second multi-frequency matching circuit216is communicatively coupled to a second multi-frequency antenna218. In examples, the second control module212(including the first PLL206), the first multi-frequency matching circuit208, and/or the first multi-frequency antenna210can be an example of the second signal processing component(s)110, e.g., configured to generate and output the second output signals114.", "", "The second control module212and associated components can perform substantially the same functions just described with reference to the first control module204. However, the second control module212, the second PLL214, the second multi-frequency matching circuit216, and/or the multi-frequency antenna218, may be configured to generate and transmit the second output signals114at frequencies and/or protocols different from those achievable at the first output signals112. For instance, the second output signals114may be configured for transmission according to Bluetooth® protocols, or the like. Moreover, in some examples, the second output signals114can include more, less, or different information than the first output signals112.", "", "AlthoughFIG.2shows only the first control module204and the second control module212, in other examples of this disclosure additional control modules, e.g., up to “n” control modules, may be provided, each with associated matching circuitry and antennas.", "", "Although not shown inFIG.2, the tire monitor104can include a number of additional components to facilitate the functionality described herein, as will be appreciated by those having ordinary skill in the art. For instance, the tire monitor104may include one or more external oscillators, which may be used to provide a reference frequency that is used in one or more RF components within the tire monitor104. As is conventional in the art, the tire monitor104can also include a motion sensor, an external low frequency (LF) circuit, and/or a power source. For example, the motion sensor may be used initiate transmission from the tire monitor104, e.g., based on detected events from an accelerometer or other type of shock detection apparatus. The LF circuit may be used for receiving external inputs, and the power source, which may be a battery, may be used to provide power to the various components of the tire monitor104.", "", "Also in examples, and although not illustrated inFIG.2, the control modules204,212can include a microcontroller coupled with an LF interface, an RC oscillator260, a temperature sensor265. The control modules204,212can also include an analog-to-digital converter (ADC) and/or a memory. In examples, the LF interface, which may be coupled to an LF circuit, may receive information from an external device, for example a programming interface and determine the required frequency for the PLL206,214, e.g., to facilitate the switching discussed above. The RC oscillator may be used to provide a signal to the microcontroller to provide a clock signal for the microcontroller. The temperature sensor may sense the operating temperature of the control module, and the temperature may be used to compensate sensor readings and operating frequencies. An example temperature sensor may include a silicon-based temperature sensor that provides a signal that is used to adjust frequencies that may drift based on temperature of RF components or adjust readings provided from pressure sensor202that are calibrated based on temperature. As noted above, the PLLs206,214may include RF sections that receive an input reference frequency as an intermediate frequency (IF) and modulate information onto the IF signal according to a particular protocol that is programmed into the device. The PLL/switch module270may output a high frequency RF at a selectable frequency signal through the matching circuits208,216, and antennas210,218, as described herein.", "", "FIG.3illustrates an example process300in accordance with aspects of the disclosure. The process is illustrated as logical flow graphs, with each operation representing a sequence of operations that can be implemented in software, hardware, or a combination thereof. In the context of software, the operations represent computer-executable instructions stored on one or more computer-readable storage media that, when executed by one or more processors, perform the recited operations. Generally, computer-executable instructions include routines, programs, objects, components, data structures, and the like that perform particular functions or implement particular abstract data types. The order in which the operations are described is not intended to be construed as a limitation, and any number of the described operations can be combined in any order and/or in parallel to implement the processes.", "", "The various illustrative operations, components, and systems described in connection with the disclosure herein may be implemented or performed with a general-purpose processor, a digital signal processor (DSP), an application specific integrated circuit (ASIC), a field programmable gate array (FPGA) or other programmable logic device, discrete gate or transistor logic, discrete hardware components, or any combination thereof designed to perform the functions described herein. A general-purpose processor may be a microprocessor, but in the alternative, the processor may be any conventional processor, controller, microcontroller, or state machine. A processor may also be implemented as a combination of computing devices, e.g., a combination of a DSP and a microprocessor, multiple microprocessors, one or more microprocessors in conjunction with a DSP core, or any other such configuration.", "", "In more detail,FIG.3is a flowchart showing the example process300, which is a process for providing and configuring a tire monitor, e.g., a replacement tire monitor, to transmit tire data to multiple computing devices at multiple operating frequencies and using multiple protocols. In examples, aspects of the process300can be performed by the tire monitors104discussed above with reference toFIGS.1and2. However, the process300is not limited to being performed by the tire monitors104, and the tire monitors104are not limited to performing the process300.", "", "At an operation302, the process300includes determining a first operating frequency for a tire monitor to transmit tire data to a first computing device. For example, the first computing device may be the tire pressure monitoring system116of the vehicle100. The tire pressure monitoring system116may be configured, e.g., at manufacture and assembly of the vehicle100, to communicate with original tire monitors via RF signals of a certain frequency. Conventional frequencies for transmitting tire data from a tire monitor to a tire pressure monitoring system can include frequencies of 315 MHz or 433.92 MHZ, for example.", "", "At an operation304, the process300includes determining a second operating frequency for a tire monitor to transmit tire data to a second computing device. For example, the second computing device may be the remote computing device118. For example, the remote computing device118can be associated with an owner of the vehicle, a technician, or the like. The second operating frequency may be a frequency at which the second computing device can receive output signals, e.g., RF signals, from the tire pressure monitoring system116.", "", "At an operation306, the process300includes determining a first protocol for communicating with the first computing device. For example, the first computing device may be the tire pressure monitoring system116. The tire pressure monitoring system116may be configured, e.g., at manufacture and assembly of the vehicle100, to communicate with the original tire monitors according to a certain protocol. Without limitation, the protocol can specify the types of data to send, the format of the data to send, a channel on which data is to be sent, a power of a signal to be transmitted from the tire monitor104to the tire pressure monitoring system116, and/or any other information associated with signals for carrying information from the tire monitor104.", "", "At an operation308, the process300includes determining a second protocol for communicating with the second computing device. For example, the second computing device may any remote computing system. The second computing device may be configured to receive data according to any of a number of different protocols, and the operation308can include identifying such protocols for the remote computing system. The tire pressure monitoring system116may be configured, e.g., at manufacture and assembly of the vehicle100, to communicate with the original tire monitors according to a certain protocol. Without limitation, the protocol can specify the types of data to send, the format of the data to send, a channel on which data is to be sent, a transmission scheme to use a power of a signal to be transmitted from the tire monitor104to the tire pressure monitoring system116, and/or any other information associated with signals for carrying information from the tire monitor104. Examples of protocols for transmitting to the second computing device can include Bluetooth® protocols, near field transmission protocols, cellular transmission protocols, e.g., 4G, 4GLTE, 5G, or other RF transmission protocols.", "", "At an operation310, the process300includes configuring a first control module to communicate with the first computing device, via a first antenna, at the first frequency and according to the first protocol. For example, the first control module204can switch an input to the first PLL206to output the (first) operating frequency carrier signal, as well as switch the first multi-frequency matching circuit208to provide an impedance that provides that the power output is substantially the same between different selected frequencies.", "", "At an operation312, the process300includes configuring a second control module to communicate with the second computing device, via a second antenna, at the second frequency and according to the second protocol. For example, the second control module212can switch an input to the second PLL214to output the (second) operating frequency carrier signal, as well as switch the multi-frequency matching circuit216to provide an impedance that provides that the power output is substantially the same between different selected frequencies.", "", "At an operation314, the process300includes generating and transmitting first output signals to the first computing device and generating and transmitting second output signals to the second computing device. As will be appreciated, with the tire monitor104configured according to the process300, tire information such as pressure information, temperature information, acceleration information, position information, or the like, may be transmitted to multiple devices according to different protocols and at multiple frequencies, via multiple antennas. In examples, the tire monitor104can be configured to generate and transmit output signals based on characteristics of the devices to which the signals are to be transmitted. Moreover, the operation314can include transmitting the first output signals and the second output signals in parallel and/or simultaneously.", "", "In some examples, the tire monitors104may be programmed, e.g., according to the process300, using a programming module. For example, the tire monitors104discussed above are capable of operating at one of two or more selectable frequencies, and are able to be programmed to modulate and transmit desired information according to two or more communications protocols. According to some embodiments, the tire monitors104and the programming module are wirelessly connected, and the tire monitors104may be programmed and configured wirelessly. In other embodiments, the tire monitors104and the programming module may be coupled with a wired connection or through a docking type connection. For example, the programming module may include a dock having one or more contacts or connectors that may couple with contacts on the tire monitor104to provide configuration and programming for the tire monitor104. In examples where a wireless connection is utilized, the wireless connection may be implemented through some of the same RF components that are used during operation of the tire monitors104, or through another wireless interface such as an inductively coupled wireless interface that may be incorporated into the tire monitor104. In examples where the wireless connection is implemented through the same RF components that are used during operations of the tire monitors104, the tire monitors104may be manufactured and assembled such that the various control modules are configured to operate according to one of multiple selectable frequencies, which may be used for programming and configuration, including to reconfigure the tire monitors104to operate according to a different frequency than the initial frequency.", "", "Aspects of this disclosure may reduce a number of replacement parts that a retailer needs to stock. For instance, because the tire monitor104can be configured to generate and transmit output signals to many different devices and according to many different protocols and frequencies, the retailer many need only stock the tire monitor104described herein.", "", "As apparent from the foregoing, aspects of this disclosure also provide improved detection of unsafe driving conditions associated with tire pressure anomalies. For example, aspects of this disclosure can provide tire information not only to a user interface in the vehicle, as in conventional systems, but also to a remote computing device associated with a vehicle owner, a technician, a passenger, or other person associated with a vehicle of tire pressure anomalies or other tire-related issues.", "", "While the subject technology has been described with respect to preferred embodiments, those skilled in the art will readily appreciate that various changes and/or modifications can be made to the subject technology without departing from the spirit or scope of the subject technology. For example, each claim may depend from any or all claims in a multiple dependent manner even though such has not been originally claimed."], "claims": ["a pressure sensor configured to output a pressure signal associated with a pressure of a tire; a first control module communicatively coupled to the pressure sensor and having a first phase-locked loop (PLL) circuit, the first control module configured to modulate information related to the pressure signal onto a first output signal having a first radio frequency; a second control module communicatively coupled to the pressure sensor and having a second PLL circuit, the second control module configured to modulate the information related to the pressure signal onto a second output signal having a second radio frequency different from the first radio frequency; a first antenna via which the first control module transmits the first output signal at the first radio frequency; a first RF matching circuit coupled to the first control module and to the first antenna; a second antenna via which the second control module transmits the second output signal at the second radio frequency; and a second RF matching circuit coupled to the second control module and to the second antenna.", "2 . The tire monitor of claim 1 , wherein the first control module and the second control module are configured to transmit the first output signal and the second output signal in parallel.", "3 . The tire monitor of claim 1 , wherein the first control module and the second control module are configured to transmit the first output signal and the second output signal substantially simultaneously.", "the first RF matching circuit has an impedance that is selectable from at least a first impedance and a second impedance based on the first radio frequency of the first output signal; and the second RF matching circuit has an impedance that is selectable from at least a third impedance and a fourth impedance based on the second radio frequency of the second output signal.", "the first control module is programmable to selectively output signals at the first radio frequency or at a third radio frequency; and the second control module is programmable to selectively output signals at the second radio frequency or at a fourth radio frequency.", "6 . The tire monitor of claim 1 , wherein the first radio frequency corresponds to a frequency associated with a tire pressure monitoring system configured to receive the first output signal.", "7 . The tire monitor of claim 1 , wherein the second radio frequency corresponds to a frequency associated with a remote computing device comprising at least one of a mobile device, a tablet, or a personal computing device.", "determining a first radio frequency at which the tire monitor is to transmit the tire data to a first computing device; determining a second radio frequency at which the tire monitor is to transmit the tire data to a second computing device; selecting a first RF matching circuit associated with the first radio frequency; selecting a second RF matching circuit associated with the second radio frequency; configuring a first control module to output first output signals associated with the tire data at the first radio frequency; configuring a second control module to output second output signals associated with the tire data at the second radio frequency; transmitting the first output signals via a first antenna; and transmitting the second output signals via a second antenna.", "9 . The method of claim 8 , wherein the transmitting the first output signals and the transmitting the second output signals comprises transmitting the first output signals and the second output signals in parallel.", "10 . The method of claim 8 , wherein the transmitting the first output signals and the transmitting the second output signals in parallel comprises transmitting the first output signals and the second output signals substantially simultaneously.", "determining a first protocol associated with transmitting tire data to the first computing device; and determining a second protocol associated with transmitting the tire data to the second computing device.", "configuring the first control module to communicate the tire data according to the first protocol; and configuring the second control module to communicate the tire data according to the second protocol, wherein at least one of the first protocol or the second protocol comprises at least one of a type of the tire data to be transmitted, a channel for transmitting the tire data, a format for the tire data, or a transmission power.", "the first RF matching circuit has an impedance that is selectable from at least a first impedance and a second impedance based on the first radio frequency of the first output signals; and the second RF matching circuit has an impedance that is selectable from at least a third impedance and a fourth impedance based on the second radio frequency of the second output signals.", "the first control module is programmable to selectively output signals at the first radio frequency or at a third radio frequency; and the second control module is programmable to selectively output signals at the second radio frequency or at a fourth radio frequency.", "a vehicle; a plurality of tires associated with the vehicle; a first computing system disposed on the vehicle; a second computing system remote from the vehicle; and a tire monitor comprising: a pressure sensor configured to output a pressure signal associated with a pressure of a tire; a first control module communicatively coupled to the pressure sensor and having a first phase-locked loop (PLL) circuit, the first control module configured to modulate information related to the pressure signal onto a first output signal having a first radio frequency associated with the first computing system; a second control module communicatively coupled to the pressure sensor and having a second PLL circuit, the second control module configured to modulate the information related to the pressure signal onto a second output signal having a second radio frequency associated with the second computing system, wherein the second radio frequency is different from the first radio frequency; a first antenna via which the first control module transmits the first output signal at the first radio frequency to the first computing system; a first RF matching circuit coupled to the first control module and to the first antenna; a second antenna via which the second control module transmits the second output signal at the second radio frequency to the second computing system; and a second RF matching circuit coupled to the second control module and to the second antenna.", "16 . The system of claim 15 , wherein the first control module and the second control module are configured to output the first output signal and the second output signal in parallel.", "17 . The system of claim 15 , wherein the first control module and the second control module are configured to output the first output signal and the second output signal substantially simultaneously.", "the first RF matching circuit has an impedance that is selectable from at least a first impedance and a second impedance based on the first radio frequency; and the second RF matching circuit has an impedance that is selectable from at least a third impedance and a fourth impedance based on the second radio frequency.", "the first control module is programmable to selectively output signals at the first radio frequency or at a third radio frequency; and the second control module is programmable to selectively output signals at the second radio frequency or at a fourth radio frequency.", "20 . The system of claim 15 , wherein the second computing system comprises at least one of a mobile device, a tablet, or a personal computing device."], "bibtex": "@patent{20240367465,\n    title = {TIRE PRESSURE DETECTOR WITH MUTLTIPLE FREQUENCIES},\n    number = {20240367465},\n    year = {2024},\n    note = {File: US20240367465A1-20241107.XML}\n    }", "classification": "B60C2304FI"}, {"title": "IMPROVED DEVICE AND METHOD FOR FIXING A SENSOR TO A TIRE", "doc_number": "20240367466", "filename": "US20240367466A1-20241107.XML", "abstract": "Device for fixing a sensor ( 2 ) to a tire ( 5 ), which device comprises at least one base ( 1 ) provided with a seat ( 1 a ) adapted to house at least partially a first portion of at least one sensor ( 2 ) for tires, and at least one cover ( 3 ) adapted to house at least partially a second portion of the sensor ( 2 ), wherein the cover ( 3 ) comprises at least one seat ( 3 a ) adapted to house at least partially the base ( 1 ), wherein the base ( 1 ) comprises at least one first portion ( 1 b ) which is arranged adjacent to the seat ( 1 a ) of the base ( 1 ) and at least one second portion ( 1 c ) which at least partially surrounds the seat ( 1 a ) of the base ( 1 ), wherein the cover ( 3 ) comprises at least one first portion ( 3 b ) which is adapted to at least partially surround the seat ( 3 a ) of the cover ( 3 ) and at least one second portion ( 3 c ) which is adapted to at least partially surround the second portion of the sensor ( 2 ), wherein the first portion ( 1 b ) of the base ( 1 ) comprises at least one support surface ( 1 e ) on one side of the base ( 1 ) opposite the second portion ( 1 c ) of the base ( 1 ), wherein the first portion ( 3 b ) of the cover ( 3 ) comprises at least one support surface ( 3 e ) on a side of the cover ( 3 ) opposite the second portion ( 3 c ) of the cover ( 3 ), wherein the first portion ( 1 b ) of the base ( 1 ) comprises at least one protuberance ( 1 d ) which at least partially surrounds the first portion ( 1 b ) of the base ( 1 ). The present description also relates to a method which can use said device to fix a sensor to a tire.", "detailed_description": [""], "claims": ["1 . A device for fixing a sensor to a tire, which device comprises at least one base provided with a seat adapted to house at least partially a first portion of at least one sensor for tires, and at least one cover adapted to house at least partially a second portion of the sensor, wherein the cover comprises at least one seat adapted to house at least partially the base, wherein the base comprises at least one first portion which is arranged adjacent to the seat of the base and at least one second portion which at least partially surrounds the seat of the base, wherein the cover comprises at least one first portion which is adapted to at least partially surround the seat of the cover and at least one second portion which is adapted to at least partially surround the second portion of the sensor, wherein the first portion of the base comprises at least one support surface on one side of the base opposite the second portion of the base, wherein the first portion of the cover comprises at least one support surface on a side of the cover opposite the second portion of the cover, wherein the support surface of the cover is adapted to be joined to an internal surface of a tire, wherein the first portion of the base comprises at least one protuberance that at least partially surrounds the first portion of the base.", "2 . The device according to claim 1 , wherein the first portion of the cover comprises at least one protuberance which at least partially surrounds the first portion of the cover.", "3 . The device according to claim 2 , wherein the protuberance of the cover comprises an external portion of the seat of the cover, which external portion is adapted to at least partially house the protuberance of the base.", "4 . The device according to claim 1 , wherein the protuberance of the base of the cover comprises at least one fin which tapers towards the outside of the base.", "5 . The device according to claim 1 , wherein the outer edge of the support surface of the base and the inner edge of the support surface of the cover are shaped to be spaced apart when the base is arranged in the seat of the cover to form at least one channel which at least partially surrounds the first portion of the base.", "6 . The device according to claim 1 , wherein the cover comprises at least one third portion which at least partially covers the second portion of the cover.", "7 . The device according to claim 6 , wherein the cover comprises at least one fourth portion which projects outwards from the third portion of the cover and forms a bridge connecting two parts of the third portion of the cover.", "8 . The device according to claim 6 , wherein one or more openings are formed in the third portion of the cover.", "9 . The device according to claim 8 , wherein the cover comprises at least one cavity which is formed in the third portion of the cover and opens towards at least one of the openings.", "10 . The device according to claim 1 , wherein the seat and/or the first portion and/or the second portion of the base and/or of the cover have a substantially prismatic or tapered shape, in particular truncated pyramidal, more particularly truncated pyramidal with a substantially octagonal section.", "11 . The device according to claim 1 , wherein the external side walls of the first portion of the base and/or of the cover are more inclined than the external side walls of the second portion respectively of the base or of the cover with respect to an axis or reference plane parallel to the longitudinal axis of the base or of the cover respectively.", "12 . The device according to claim 1 , wherein the base and the cover are made of an elastomer.", "13 . The device according to claim 1 , wherein the first portion of the base comprises at least one groove which is open towards the support surface of the base.", "14 . The device according to claim 1 , wherein the base comprises one or more notches formed in the upper edge of the second portion of the base.", "15 . The device according to claim 1 , wherein the first portion of the cover comprises one or more grooves which are open towards the support surface of the cover.", "inserting the sensor between the base and the cover; applying the assembly of base, sensor and cover to a surface of a tire by means of at least one layer of adhesive disposed on the support surface of the base and on the support surface of the cover.", "17 . The method according to claim 16 , wherein said device is a device according to claim 1 .", "18 . The device according to claim 2 , wherein the protuberance of the cover comprises at least one fin which tapers towards the outside of the cover.", "19 . The device according to claim 1 , wherein one or more openings are formed in the second portion of the cover."], "bibtex": "@patent{20240367466,\n    title = {IMPROVED DEVICE AND METHOD FOR FIXING A SENSOR TO A TIRE},\n    number = {20240367466},\n    year = {2024},\n    note = {File: US20240367466A1-20241107.XML}\n    }", "classification": "B60C2304FI"}, {"title": "TIRE INVERTING DEVICE AND METHOD", "doc_number": "20240367467", "filename": "US20240367467A1-20241107.XML", "abstract": "Presently provided is a tire inverting device and method. The device has a base with a central support, a pushing mechanism, and a tire holding device. The tire holding device holds a first circumferential edge of a tire while the pushing mechanism axially pushes a second circumferential edge of the tire from the central support and through the first circumferential edge by a sufficient amount to invert the tire. The device has a central axis about which the tire, the central support, the pushing mechanism, and the tire holding device are all centrally disposed or moved about.", "detailed_description": ["The present disclosure provides a tire inverting device and a method for inverting a tire. The presently disclosed tire inverting device has a base or stand where a lower sidewall or bead of the tire is placed. A top sidewall, bead, or remaining upper portion of the tire is held in place at its edge. A pushing mechanism is longitudinally disposed with a center axis of the tire and has a top end that cooperates with the lower edge or bead of the tire when the pushing mechanism is longitudinally extended. The pushing mechanism is configured and disposed to push the lower sidewall or bead of the tire up through the held edge of the tire which inverts the tire.", "", "In at least one embodiment, the tire inverting device has a base with a central support, a pushing mechanism, and a tire holding device. The tire holding device holds a first circumferential edge of a tire while the pushing mechanism axially pushes a second circumferential edge of the tire from the central support and through the first circumferential edge by a sufficient amount to invert the tire. The device has a central axis about which the tire, the central support, the pushing mechanism, and the tire holding device are all centrally disposed or moved about. For example, the pushing mechanism may push along the central axis and the tire may be inverted about the central axis. This configuration may provide for smaller, more compact, or lighter device which may be more easily transported than other tire inverting devices.", "", "FIG.1shows an illustrative example of the presently disclosed tire inverting device, tire inverting device100.FIG.2shows tire inverting device100having tire115disposed for inverting. Tire inverting device100has a base102with a central support104. A pushing mechanism106has a first end108extending from central support104of the base102, a second end110, and an extendable length112axially extending between first end108and second end110. Base102and the axis of pushing mechanism106form a central axis. A tire holding device114is configured and disposed to hold a first circumferential edge117of a tire being inverted a first distance116from base102and axially centered with central axis118, as shown inFIG.2.", "", "Pushing mechanism106has its second end110configured to cooperate with a second circumferential edge119of tire115, upon an extending of the extendable length112of pushing mechanism106. For example, a wheel, rim, portion of a rim, or other outward extension(s) may be disposed on second end110. Pushing mechanism106is configured and disposed to move its second end110and cooperated second circumferential edge119of tire115along central axis118and to a second distance120from base102. Second distance120from base102is greater than first distance116from base102by an amount sufficient to invert tire115.", "", "In at least one embodiment of the present disclosure, pushing mechanism106has a wheel rim, or portion thereof, disposed on second end110for cooperating with second circumferential edge119. For example, pushing mechanism106may have a wheel rim disposed with its second end110as shown inFIG.1.", "", "In at least one embodiment, tire holding device114has a stand124held to, and at a distance from, base102. Stand124is configured and disposed to hold tire115, dispose tire holding device114, and hold pushing mechanism106, with its longitudinal axis118axially centered with central support104. Stand124is configured and disposed to hold pushing mechanism106with its longitudinal axis axially aligned with the central axis118. As shown inFIG.2, first circumferential edge117of tire115may have its bead removed and tire holding device114may be configured and disposed to cooperate with the sidewall or tread portion of tire115. For example, the tire bead about first circumferential edge117may need be cut, compromised, separated, or removed to reduce a resistance to the passing of second circumferential edge119through tire115along central axis118.", "", "In at least one embodiment, tire holding device114is adjustable and configured and disposed to hold first circumferential edge117of different sized tires at first distance116from base102. For example, holding device114may comprise a plurality of adjustable straps.", "", "FIG.3shows the illustrative example of the tire inverting device100having tire115being inverted. Second circumferential edge119of tire115a tire bead and second end110of pushing mechanism106is configured to cooperate with the tire bead. For example, second end110may have a wheel rim, or portion thereof, configured and disposed to cooperate with the tire bead. Pushing mechanism106may be hydraulically, electrically, or pneumatically activated. In at least one embodiment, an external power source is configured and disposed to activate pushing mechanism106. For example, a hydraulic line128may supply power to pushing mechanism106for activation and the extending of extendable length112disposed between first end108and second end110of pushing mechanism106.", "", "FIG.4shows the illustrative example of the tire inverting device100having holding device114removed upon tire115being inverted. Upon pushing mechanism106moving its second end110, and cooperated second circumferential edge119of tire115, to second distance120from base102, tire115is inverted. Second distance120from base102is greater than first distance116from base120by a sufficient amount to invert tire115. The movement of second circumferential edge119up and through first circumferential edge117, along central axis118, needed to invert a tire may vary for different sizes and configurations of tires.", "", "In at least one embodiment, tire holding device114is configured and disposed to automatically release from tire115, upon tire115being inverted. For example, tire holding device114may have a plurality of straps with hook shaped ends that are configured to automatically remove from tire115being inverted as shown inFIG.4. Holding device114may be adjustable in length for holding first circumferential edge117of different sizes and configurations of tires115. For example, holding device114may have a plurality of adjustable straps.", "", "FIG.5shows an illustrative example of a tire that has been inverted with the inverting device100. Upon inverting tire115, it may be repurposed or upcycled for a variety of uses150. For example, a portion of the bead or sidewall of tire115may have been removed, disposing first circumferential edge117, prior to inverting. The removed portion152may be attached to tire115about second circumferential edge119. Tire115may be repurposed or upcycled into a planter, container, or other containing or holding device. For example, a bottom wall may be placed on second circumferential edge119, inside of inverted tire115, for holding items or soil for planting.", "", "Inverted tire115may be inspect and cleaned with water and a mild detergent to remove any lubricant residue or dirt. The inverted tire may be used for creating tire art which may be a unique and creative way to repurpose or upcycle old or used tires, and transform them into functional and aesthetically appealing pieces of art. For example, designs may be cut out of the upwardly extending sidewall and/or the tire may be painted. Placement of colors, patterns, and any other decorative elements may be selected to form unique designs. The finished tire art may be displayed indoors or outdoors or even be repurposed into functional furniture such as a coffee table or ottoman.", "", "FIG.6shows an illustrative example of tire115that may be inverted with the presently tire inverting device100or200. Typically, tires have two opposing sidewalls130. Each sidewall may have a tire bead122with a bead filler128configured and disposed to mount and seal on a rim. Tires typically have layers such as an inner liner138, radial cord body132, and belt piles134. Thread136is typically disposed on belt piles134.", "", "FIG.7schematically shows a top and a cross-sectional view of an illustrative example of the presently disclosed tire inverting device200. Tire inverting device200has a base202with a central support204. Pushing mechanism206has a first end208extending from central support204, a second end210, and an extendable length212extending between first end208and second end210. Pushing mechanism206and central support204form a central axis218. Tire holding device214is configured and disposed to hold a first circumferential edge of a tire being inverted a first distance from the base and axially centered with central axis218. Pushing mechanism206has its second end210configured to cooperate with a second circumferential edge of the tire being inverted, upon extending of extendable length212. Pushing mechanism206is configured and disposed to move its second end210and the cooperated second circumferential edge of the tire being inverted along central axis218and to a second distance from base204. The second distance from base204is greater than the first distance from the base204by a sufficient amount to invert the tire being inverted.", "", "A method of inverting a tire is presently disclosed. The method comprises placing a second circumferential edge or second sidewall of a tire being inverted on a base or stand and holding a first circumferential edge of the tire a first distance from the base. A first end of a pushing mechanism is extended from a central support of the base and an extendable length of the pushing mechanism is axially aligned with the central support and a central axis of the tire, forming a central axis. The extendable length of the pushing mechanism is axially extended along the central axis and cooperates a second end of the pushing mechanism with the second circumferential edge of the tire. The second circumferential edge of the tire is pushed, with the pushing mechanism, to a second distance from the base. The second distance from the base is greater than the first distance from the base by an amount sufficient to invert the tire, thus inverting the tire.", "", "In at least one embodiment, at least a portion of a bead disposed proximate the first circumferential edge of the tire is compromising, separated, or remove, prior to the placing of the second circumferential edge or second sidewall of the tire on the base or stand. The cooperating the second end of the pushing mechanism may comprise cooperating the second end with a tire bead disposed proximate the second edge of the tire. In at least one embodiment, the cooperating the second end of the pushing mechanism comprises cooperating a wheel rim, or portion thereof, disposed with the second end of the pushing mechanism with the tire bead.", "", "In at least one embodiment, a tire holding device is adjusted to hold the first circumferential edge of the tire at the first distance from the base. The adjusting of the tire holding device to hold the first circumferential edge of the tire at the first distance from the base may comprises tightening a plurality of adjustable straps.", "", "The placing of the second circumferential edge or second sidewall of the tire on the base or stand may comprise placing the second circumferential edge or second sidewall of the tire on the stand, the stand is held to, and at a distance from, the base. The holding of the first circumferential edge of the tire the first distance from the base may comprise holding the first circumferential edge of the tire to the stand with a holding device.", "", "The method of inverting a tire may comprise hydraulically, electrically, or pneumatically activating the pushing mechanism and extending its extendable length. The holding device may be automatically released from the first circumferential edge of the tire upon the inverting of the tire.", "", "At least a portion of the sidewall with the bead disposed proximate the first circumferential edge of the tire may be removed prior to placing the tire on the base or stand. The removed sidewall portion may be attached to the second circumferential edge or second sidewall of the tire, upon the inverting of the tire."], "claims": ["a base with a central support; a stand disposed a distance from the base, the stand being configured to cooperate with a tire holding device and to support a second circumferential edge or a second sidewall of a tire being inverted; a pushing mechanism having a first end extending from the central support of the base, a second end, and an extendable length extending between the first end and the second end, the pushing mechanism and the central support forming a central axis; the stand is configured and disposed to hold the pushing mechanism with its longitudinal axis axially centered with the central support and the central axis; the tire holding device is adjustable and configured to adjustably hold a first circumferential edge of the tire to the stand and is configured and disposed to hold the first circumferential edge of the tire being inverted a first distance from the base and axially centered with the central axis; the pushing mechanism has its second end configured to cooperate with the second circumferential edge of the tire being inverted, upon an extending of the extendable length of the pushing mechanism; the pushing mechanism is configured and disposed to move its second end and the cooperated second circumferential edge of the tire being inverted along the central axis and to a second distance from the base; and wherein the second distance from the base is greater than the first distance from the base by an amount sufficient to invert the tire being inverted.", "2 . The tire inverting device of claim 1 , wherein the first circumferential edge of tire has its bead separated, compromised, or removed and the tire holding device is configured and disposed to cooperate with the sidewall or tread portion of the tire.", "3 . The tire inverting device of claim 1 , wherein the second circumferential edge of the tire being inverted has a tire bead and the second end of the pushing mechanism is configured to cooperate with the tire bead.", "4 . The tire inverting device of claim 3 , wherein the pushing mechanism has at least a portion of a wheel rim disposed with its second end.", "5 . The tire inverting device of claim 1 , wherein the adjustable tire holding device is configured and disposed to hold the first circumferential edge of different sized tires at the first distance from the base.", "6 . The tire inverting device of claim 5 , wherein the tire holding device comprises a plurality of adjustable straps.", "7 . (canceled)", "8 . The tire inverting device of claim 1 , wherein the pushing mechanism is hydraulically, electrically, or pneumatically activated.", "disposing a central support with a base; holding a stand with, and a distance from, the base; holding a first end of a pushing mechanism with the central support; supporting a second end of the pushing mechanism with the stand and axially aligning an extendable length of the pushing mechanism, extending between the first end and the second end, and forming a central axis of a tire inverting device; placing a second circumferential edge or second sidewall of a tire being inverted on the stand and axially aligning a central axis of the tire with the central axis of the tire inverting device; holding a first circumferential edge of the tire to the stand, with an adjustable holding device, and at a first distance from the base; adjusting the tire holding device to hold the first circumferential edge of the tire at the first distance from the base; axially extending the extendable length of the pushing mechanism along the central axis of the tire and the tire inverting device and cooperating the second end of the pushing mechanism with the second circumferential edge of the tire; pushing the second circumferential edge of the tire, with the pushing mechanism, to a second distance from the base; and wherein the second distance from the base is greater than the first distance from the base by an amount sufficient to invert the tire, thus inverting the tire.", "10 . The method of inverting a tire of claim 9 , further comprises compromising, separating, or removing at least a portion of a bead disposed proximate the first circumferential edge of the tire, prior to the placing of the second circumferential edge or second sidewall of the tire on the stand.", "11 . The method of inverting a tire of claim 9 , wherein the cooperating the second end of the pushing mechanism comprises cooperating the second end with a tire bead disposed proximate the second edge of the tire.", "12 . The method of inverting a tire of claim 11 , wherein the cooperating the second end of the pushing mechanism comprises cooperating a wheel rim, or portion thereof, disposed with the second end of the pushing mechanism with the tire bead.", "13 . (canceled)", "14 . The method of inverting a tire of claim 9 , wherein the adjusting the tire holding device to hold the first circumferential edge of the tire at the first distance from the base comprises tightening a plurality of adjustable straps.", "15 - 16 . (canceled)", "17 . The method of inverting a tire of claim 9 , further comprising hydraulically, electrically, or pneumatically activating the pushing mechanism and extending its extendable length.", "18 . The method of inverting a tire of claim 9 , further comprising automatically releasing a holding device from the first circumferential edge of the tire upon the inverting of the tire.", "19 . The method of inverting a tire of claim 10 , wherein the compromising, separating, or removing at least a portion of a bead disposed proximate the first circumferential edge of the tire comprises removing a portion of the sidewall.", "20 . The method of inverting a tire of claim 19 , further comprising attaching the removed portion of the sidewall to the second circumferential edge or second sidewall of the tire, upon the inverting of the tire."], "bibtex": "@patent{20240367467,\n    title = {TIRE INVERTING DEVICE AND METHOD},\n    number = {20240367467},\n    year = {2024},\n    note = {File: US20240367467A1-20241107.XML}\n    }", "classification": "B60C2515FI"}, {"title": "IMPROVEMENTS IN OR RELATING TO HITCHING", "doc_number": "20240367468", "filename": "US20240367468A1-20241107.XML", "abstract": "A vehicle-to-implement hitch is provided and comprises a force transfer hitch connector adapted to provide a hitch point to which an implement can be connected. The connector is couplable to the vehicle by one or more flexible tensioning members which are, or can be moved so as to be, taut whereby to create a rigid structure comprising a hitch location such that the hitch point is movable.", "detailed_description": [""], "claims": ["1 . A vehicle-to-implement hitch comprising a force transfer hitch connector adapted to provide a hitch point to which an implement can be connected, wherein the hitch is movable between a stowed configuration and a deployed configuration and is deployable from a vehicle in use, wherein the connector is couplable to the vehicle by two or more flexible tensioning members which are relaxed in the stowed configuration and taut in the deployed position and which create a pseudo-rigid structure in the deployed configuration comprising a hitch location such that the hitch point is movable, whereby the pseudo-rigid structure provides for a controlled over-load reaction from which the structure can recover without damage.", "2 .- 5 . (canceled)", "6 . The hitch according to claim 1 , in which the connector is a boom.", "7 . The hitch according to claim 1 , in which the hitch location is real.", "8 . The hitch a according to claim 1 , in which the hitch location is a pivot point that is part of a linkage that forms a virtual hitch point.", "9 . The hitch according to claim 1 , in which the connector is in advance of the hitch location.", "10 . The hitch according to claim 1 , in which the connector is part of the hitch point.", "11 . The hitch according to claim 1 , further comprising one or more actuators for moving the hitch from the stowed to the deployed configuration.", "12 . The hitch according to claim 11 , in which the or each actuator is pre-charged and stored energised and/or in which the or each actuator is connected or connectable to an external power source.", "13 .- 14 . (canceled)", "15 . The hitch according to claim 1 , comprising a plurality of actuators in which actuators deploy in sequence or actuators deploy simultaneously.", "16 .- 17 . (canceled)", "18 . The hitch according to claim 1 , in which in the deployed position tensioning members assume a triangular configuration with the hitch point formed at an apex thereof.", "19 . The hitch according to claim 1 , in which at least one of the two or more tensioning members is a cable, rope, strap, cord, or chain.", "20 . The hitch according to claim 19 , in which the tensioning member is a wire rope.", "21 . The hitch according to claim 19 , in which excess length of the cable, rope, strap, cord, or chain is controlled to ensure they pack neatly.", "22 . The hitch according to claim 1 , further comprising means for locking the mechanism, or parts of the mechanism, into the stowed position.", "23 . The hitch according to claim 1 , consisting of two or three tautable tensioning members.", "24 . The hitch according to claim 1 , formed as a 2D mechanism.", "25 . The hitch according to claim 1 , formed as a 3D mechanism.", "26 . A hitch mechanism comprising a deployable structure which is deployed from a compact, stowed configuration using actuators and flexible members which becomes rigid when tensioned and create a hitch location in which the resulting structure is able to collapse if hits an obstacle and then re-form after passing the obstacle.", "27 .- 29 . (canceled)", "30 . A mine clearance system comprising a vehicle-to-implement hitch according to claim 1 and a surface clearance implement connected to the vehicle via the hitch."], "bibtex": "@patent{20240367468,\n    title = {IMPROVEMENTS IN OR RELATING TO HITCHING},\n    number = {20240367468},\n    year = {2024},\n    note = {File: US20240367468A1-20241107.XML}\n    }", "classification": "B60D1167FI"}]