[{"title": "ATTACHMENT ARRANGEMENT FOR COMPOSITE WHEELS", "doc_number": "20240253391", "filename": "US20240253391A1-20240801.XML", "abstract": "An attachment arrangement for attaching a composite wheel to a wheel mount, including an attachment aperture that receives an elongate fastener element. A fastening body, including or fastened to the elongate fastener element, has an engagement portion and an attachment insert including a bearing body, a fastening aperture, and an insert section extending axially away from the bearing body and into the attachment aperture. An engagement surface, located at least in part between the bearing body and a distal end of the insert section, extends from an inner surface of the insert section and is configured complementary to and engages the fastening body engagement portion. The insert section distal end extends into the attachment aperture and is spaced from the wheel mount, or from or in an element in, on, integral with, or adjacent to the wheel mount, without directly engaging the wheel mount and/or element.", "detailed_description": ["FIG.1illustrates a carbon fibre composite wheel10which is attached to a wheel mount (or wheel hub)12through wheel studs14using an attachment arrangement16according to an embodiment of the present invention. The illustrated attachment arrangement16comprises fastening nuts18which can be fastened onto the wheel studs14, attachment inserts20and a backing plate22.", "", "The illustrated composite wheel10is a one-piece carbon fibre wheel, for example as described in International Patent Publication WO2010/025495A1 and International Patent Publication No. WO2019/033169A1, the contents of which should be understood to be incorporated into this specification by this reference. The hub portion23of the illustrated composite wheel10includes six attachment apertures24through which the wheels studs14of the wheel mount12are inserted when the wheel10is mounted on the wheel mount12. Each of the wheel studs14are an elongate externally threaded pin having a complementary thread to a threaded internal bore25(FIG.3) of each of the fastening nuts18.", "", "Whilst the illustrated wheel has six attachment apertures24, it should be appreciated that a composite wheel using the attachment arrangement of the present invention may have any number of attachment apertures, for example three, four, five, six or more.", "", "As best shown inFIGS.2and3, each fastening nut18is a cylindrical cap including a top26and a base28which annularly extends around the internal bore25. The internal bore25includes a central fastening axis X (FIG.3). Each fastening nut18has an angled engagement portion36which extends from the edge of the internal bore25(FIG.3) to the outer radial side32of the fastening nut18. The engagement portion36has a substantially complementary angle β (FIG.4) relative to the fastening axis X to an engagement surface30of the attachment insert20. It should be appreciated that in other embodiments the engagement portion36and engagement surface30can be flat, being angled 90 degrees relative to the fastening axis X or have a substantially complementary concave or convex curve.", "", "Typically, the angle β can be between 10 and 80 degrees, and more preferably between 30 and 60 degrees. In the illustrated embodiment, the angle β is 45 degrees. The angle β can be between 10 and 80 degrees, and more preferably between 30 and 60 degrees. In the illustrated embodiment, the angle β is 45 degrees.", "", "As best illustrated inFIGS.2and3, the attachment insert20comprises two main sections:(A) A bearing body21which comprises a generally toroid shaped head38—similar to a fastening washer; and(B) an axially extending cylindrical insert section (sleeve)40.", "", "The bearing body21and insert section40are preferably integrally formed from a single piece of material, such as metal, which could be cast, forged or machined from billet.", "", "A fastening aperture42extends axially through length of the attachment insert20. The fastening aperture42also includes a central fastening axis X. The fastening axis X of the fastening aperture42and internal bore25of the fastening nut18are aligned when the bearing body21and nut are in use, as shown inFIG.3. In use, the fastening aperture42receives a wheel stud14of the wheel mount12(FIG.1).", "", "The bearing body21is used to distribute clamping force F (FIGS.4and5) across the surface47of the composite wheel10around the attachment aperture24. To achieve this, the head38of the bearing body21includes a substantially flat base44configured to face and abut the surface of the composite wheel10about the attachment aperture24. The head38of the bearing body21is therefore configured to provide an increased clamping contact area with the load transfer zone45of the surface47of the composite wheel10surrounding the attachment aperture24and thereby increase the area through which the clamping force is applied to that area.", "", "Additionally, the bearing body21is configured to receive the fastening nut18in nut aperture27so that the engagement portion36of the fastening nut21engages with the engagement surface30in insert section40. The nut aperture27comprises a circular or polygonal shaped recess sized to accommodate the fastening nut18, with some clearance, to allow the fastening nut18to be manipulated in that recess. In some embodiments, that clearance is sufficient to also accommodate a portion of tool (not illustrated) used to manipulate the fastening nut18, for example a socket wrench or spanner. As shown inFIG.3, the nut aperture27forms a recess that then steps into the fastening aperture42.", "", "The insert section40of the bearing body21is designed to transfer the clamping force from the engagement surface30through to the bearing body21and base44thereof. The insert section40also functions to distribute the load away from the center of the fastening aperture42and away from the walls of fastening aperture42.", "", "The insert section40extends axially outwardly from the base44of the head38of the bearing body21about the fastening aperture42. The insert section40is configured to extend into an attachment aperture24of the composite wheel10. The radial cross-section of body50of the insert section40is circular. Furthermore, the radial width of the body50of the insert section40is smaller than the radial width of the attachment aperture24. This forms a radial gap G (FIG.4) between the outside of the body50of the insert section40and the internal sides of attachment aperture24in the composite wheel10. This reduces the possibility of the insert section40transferring some of the clamping load to the walls of the attachment aperture24and also provides clearance for a degree of expansion of the insert section40within the attachment aperture24.", "", "The thickness and radial width of the insert section40is sufficient to connect to the nut aperture27of the bearing body21, accommodate the fastening aperture42and the engagement surface36, as well as provide sufficient material to enable force transfer from the engagement surface30to the base44of the bearing body21. This can result is a significant outer diameter for the insert section40. The distal end52of the insert section40therefore includes a smaller diameter extension section53which is axially aligned with the fastening axis X and fastening aperture42which is specifically configured to be received within the insert section aperture54of the backing plate22(see below). The extension section53effectively provides a step in the distal end52of the insert section40where the radial size of the insert section40reduces in size to match the size of the insert section aperture54of the backing plate22. Additionally, it should be noted that the distal end52of the insert section40at a spaced apart location from the surface of the wheel mount12.", "", "The insert section40includes an angled annular engagement surface30formed in an inner/internal surface of the insert section40. As noted above, the engagement surface30has a complementary angle (β) relative to the fastening axis X to the base engagement portion36of the fastening nut18. In use, the engagement portion36of the fastening nut18engages with the engagement surface30of the bearing body21when the fastening nut18is assembled on a wheel stud14to fasten the composite wheel10between the bearing body21and the wheel mount12.", "", "As previously noted, the positioning of the engagement surface30in the insert section40(formed in the inner wall thereof) enables the fastening nut18to be recessed through the bearing body21and into the insert section40. This configuration positions the fastening nut in a lower position than if the engagement surface30was located within the bearing body21. The engagement portion36of the fastening nut18and the engagement surface30of the insert section40are positioned below the base44of the bearing body21and below the top surface level47of the composite wheel. This positioning enables the attachment arrangement to accommodate shorter elongate fasteners (wheel studs) compared to the arrangement taught in WO2013/000009A1, therefore accommodating a smaller stack height H (FIG.3) than possible in the arrangement taught in WO2013/000009A1. This provides the advantage of retaining standard vehicle wheel stud lengths and wheel nut designs when attaching a composite wheel10to the wheel mount12of a vehicle (not illustrated).", "", "The arrangement of the engagement surface30within the insert section40locates the clamping engagement force between the engagement portion36of the fastening nut18and the engagement surface30of the insert section40below the base44of the bearing body21and the surface47of the composite wheel10around the attachment aperture24. The attachment insert20is configured to project the compressive force from that clamping engagement outwards from the engagement surface30and axially (relative to fastening axis X) back up the insert section40, and to the base44of the bearing body21. As best shown inFIG.5, this indirectly creates a compression force JC between the base44of the bearing body21and the backing plate22, sandwiching the material of the composite wheel10together between the base44of the bearing body21and the backing plate22thereby securely fastening the wheel10onto the wheel mount12.", "", "As shown best inFIG.5, the transfer of forces results from the fastening nut18being is fastened onto the end of the wheel stud14(creating tension BT in the wheel stud14). Tightening of the fastening nut18on the wheel stud14engages the engagement portion36of the fastening nut18onto the engagement surface30creating a compression force SC on the engagement surface36, which is transferred into the adjoining portion of the insert section40. This in turn creates a tension force ST between the engagement surface30and the bearing body21, which in turn applies a compression force JC from the base44of the bearing body21onto the surface47of the composite wheel10around the attachment aperture24.", "", "Finally, as shown inFIGS.4and5, the transfer of forces from the engagement surface30through the insert section to the bearing body21ensures that the force F is distributed away from the edge of the attachment aperture24and is more evenly distributed across the composite surface in a load transfer zone45and then on and through the composite structure around the attachment aperture24.", "", "As best shown inFIGS.2and3, the backing plate22is designed to be inserted between the wheel mount12and the composite wheel10. The illustrated backing plate22is a flat toroid plate which includes six annularly spaced apart insert section apertures54. The backing plate22provides a large surface on the opposite side of the attachment aperture24to the bearing body21against which the composite wheel10can be clamped by compression force JC (FIG.5). The illustrated insert section apertures54have a generally circular shape designed to receive but not interlock with the distal end52of the insert section40section of the bearing body21. Rotation of the bearing body21is prevented by an insert rod143inserted within a recess146in the base44of the head38of the bearing body21, and projecting axially out therefrom, which is received and seated in a complementary recess147in the surface of the composite wheel10.", "", "In alternate embodiments (not illustrated), the distal end52of each insert section40can be configured to be received in a complementary shaped insert section aperture54formed in the backing plate22, for example a complementary hexagonal shape. This complementary shape substantially prevents axial rotation of the insert section40relative to the wheel mount12.", "", "As shown inFIGS.3and4, the rear side41of the backing plate22includes a series of recesses56which are concentrically arranged with each of the insert section apertures54. The recesses56shorten the length of insert section apertures54in the backing plate22, enabling the insert a shorter insert section40.", "", "The insert section40of the bearing body21is preferably not bonded to the composite wheel10in any way. This allows the insert section40to slide relative to the attachment aperture24in the composite wheel10.", "", "The insert section aperture54is sized to allow at least a portion of the distal end52of the insert section40to move through the insert section aperture54. In some arrangements, the clearance can be tailored to produce a sliding fit between the insert section40and the backing plate22allowing the distal end52of the insert section40to slide through the insert section aperture54when the attachment arrangement16is compressed. This reduces the possibility of the insert section40contacting the mount12and transferring some of the clamping load to the mount12or radially within the attachment aperture24or insert section aperture54. However, it should be understood that the distal end52of the insert section40does not directly engage or contact (radially or axially relative to axis X-X) any part of the wheel mount12(FIG.1) or the backing plate22.", "", "The distal end52of the insert section40is inserted through the insert section aperture54and then the end is fixed in place using a circlip or other fixing clip151, fitted into a groove or trench153included in a portion of this distal end52of the insert section40which extends through the attachment aperture24. The outer diameter of the fixing clip151has a greater size than the insert section aperture54. It should be appreciated that this retention formation can be in any suitable such as a circlip (as illustrated), press fit washer or a deformation feature on end of the insert section40. The fixing clip151can be seated in a complementary annular groove55(FIG.4) provided in the base of the backing plate22.", "", "In other embodiments (not illustrated), the retention formation can be formed at the distal end52of the insert section40through deformation of the distal end52for example to form a rolled edge after the distal end52of the insert section40is inserted through the insert section aperture54, so that it has a greater size than the insert section aperture54. The rolled edge can be seated in a complementary annular groove55provided in the base of the backing plate22. The arrangement still allows the insert section140to slide through the insert section aperture154relative to the backing plate122in one direction but prevents the whole attachment arrangement116from falling apart when the fastener element is removed.", "", "As noted above, clearance can also be provided between this distal end52of the insert section40and backing plate22to ensure clamping load is transmitted from the engagement surface30through the carbon composite laminate11of composite wheel10and backing plate22, and into the vehicle wheel mount (not illustrated).", "", "The arrangement allows the insert section40to slide through the insert section aperture54relative to the backing plate22in one direction as well as preventing the whole attachment arrangement16from falling apart when the fastener element is removed.", "", "FIG.6illustrates an embodiment of the attachment arrangement216according to the present invention that uses a wheel bolt218to mount the composite wheel10onto a wheel mount12. Whilst not illustrated, it should be appreciated that the wheel bolt218includes a threaded elongate fastener section214and a bolt head218A. The elongate fastener section214is inserted through the attachment aperture224of the composite wheel10, which is then fastened into a complementary threaded aperture in the wheel mount12to attach or otherwise fix the composite wheel10to the wheel mount12.", "", "In this embodiment, the bolthead218A of wheel bolt218includes all the features of each fastening nut18of the previous embodiment, with the exception that the wheel bolt218is integrally formed with the threaded elongate fastener section214. Accordingly, the function and force transfer of this embodiment is exactly the same as described above for the preceding embodiment, with the exception that an angled engagement portion236is located in the bolt head218of the wheel bolt, and that engagement portion236is configured to engage with the engagement surface230of the attachment insert220. A number of features of the attachment insert220shown inFIG.6are the same as those shown and described in relation to the embodiment shown inFIGS.1to5. Like features inFIG.6have therefore been provided with the same reference numerals as shown inFIGS.1to5PLUS200. It should be understood that the above description of the operation of the attachment arrangement16shown inFIGS.1to5equally applies to this embodiment, with the exception that the attachment arrangement216is tightened by engagement of the wheel bolt218A in an aperture in the wheel mount12as opposed to fastening the fastening nut18on wheel stud18. Thus, attachment insert220is formed from bearing body221and insert section240as previously described for the embodiment shown and describe in relation toFIGS.1to5and has the same features and function as previously described which interact with the wheel bolt218.", "", "FIG.7illustrates an embodiment of the attachment arrangement316according to the present invention where an upper portion of the engagement surface330is located above the top-level surface322of the composite wheel310. A number of the features of the attachment arrangement316shown inFIG.7are the same as those shown and described in relation to the embodiment shown inFIGS.1to5. Like features inFIG.7have therefore been provided with the same reference numerals as shown inFIGS.1to5PLUS300. It should be understood that the above description of the operation of the attachment arrangement16shown inFIGS.1to5equally applies to this embodiment, with the exception of the positioning of the engagement surface330in the insert section340. In this embodiment, the engagement surface330is still formed in the inner wall of the insert section. However, the location of the engagement surface330is higher relative to the surface347of the composite wheel310, with a portion of the engagement surface330located axially above the surface347of the composite wheel310relative to axis X-X. The distal end352of the insert section340is at a spaced apart location from the surface of the wheel mount12(FIG.1). In this sense, the distal end352of the insert section340does not directly engage or contact (radially or axially relative to axis X-X) any part of the wheel mount12(FIG.1) or the backing plate322.", "", "As shown inFIG.7, this positioning enables the attachment arrangement to accommodate shorter elongate fasteners (wheel studs or bolts) compared to the arrangement taught in WO2013/000009A1, therefore accommodating a smaller stack height H2(FIG.7) than possible in the arrangement taught in WO2013/000009A1. However, in this case, the stack height of this embodiment is much greater than the stack height H (FIG.3) of the previous embodiment.", "", "Fastening nut318is still received and recessed into the insert section340of bearing body321within nut aperture327. In this embodiment, the fastening nut sits axially higher compared to the previous embodiment, this still enables the fastening nut318to be recessed through the bearing body321, but not completely into the insert section340.", "", "FIGS.8to11illustrate an embodiment of the attachment arrangement416according to the present invention that includes a shared bearing body421.", "", "A number of the features of the attachment arrangement416shown inFIGS.8to11are the same as those shown and described in relation to the embodiment shown inFIGS.1to5. Like features inFIGS.8to11have therefore been provided with the same reference numerals as shown in FIGS.1to5PLUS400. It should be understood that the above description of the operation of the attachment arrangement16shown inFIGS.1to5equally applies to this embodiment, with the exception of the configuration of the bearing body421and insert section (sleeve)440.", "", "As best illustrated inFIGS.8and9, the attachment insert420comprises two main sections:(A) the bearing body421which comprises a single piece front plate extending over and around each of the attachment apertures424of the composite wheel410; and(B) a plurality of axially extending cylindrical insert sections440which are configured to extend into each attachment aperture424.", "", "The attachment insert420also includes fastening apertures442for each attachment aperture424in the composite wheel410.", "", "The bearing body421and each insert section440of the attachment insert420are preferably integrally formed from a single piece of material, such as metal, which could be cast, forged or machined from billet.", "", "As with the previous embodiments, a fastening aperture442extends axially through each insert section440about a central fastening axis X (FIG.10). The fastening axis X of the fastening aperture442and internal bore425of the fastening nut418are aligned in use, as shown inFIG.10. In use, each fastening aperture442receives a wheel stud414of the wheel mount (for example wheel studs14of wheel mount12inFIG.1).", "", "The bearing body421is again used to distribute clamping force F (FIG.10) across the surface447of the composite wheel410around each attachment aperture424. In this embodiment, the bearing body421comprises a top plate configured to extend over the surface447of the composite wheel410between and around each of the attachment apertures424. The bearing body421is therefore configured as a shared body that provides an increased clamping contact area445with the surface447of the composite wheel over the surface of the composite wheel around each of the attachment apertures424. Once again, the bearing body provides a flat base surface444configured to face and abut the surface of the composite wheel10about each attachment aperture424—but in this case with that base surface444extending between and about each attachment aperture424. Each fastening aperture442includes a recessed portion comprising a nut aperture427in the bearing body421which comprises a circular or polygonal shaped recess sized to accommodate the fastening nut418, with some clearance, to allow the fastening nut418to be manipulated in that recess. The nut aperture427leads directly into the insert section440of the bearing body421.", "", "As best illustrated inFIGS.9and10, each insert section440extends axially outwardly from the base444of the bearing body421about the fastening aperture442into and through the respective attachment apertures424of the composite wheel410. The radial cross-section of body450of the insert section440is circular, and preferably has a radial width smaller than the radial width of the attachment aperture424. The distal end452of the insert section440is configured to be received within an insert section aperture recess456of the backing plate422(see below).", "", "The insert section440includes an angled annular engagement surface430formed in an inner/internal surface of the insert section440. The engagement surface430has a complementary angle (equivalent to angle β inFIG.4) relative to the fastening axis X to the base engagement portion436of the fastening nut418. In use, the engagement portion436of the fastening nut418engages with the engagement surface430of the bearing body421when the fastening nut418is assembled on a wheel stud414to fasten the composite wheel410between the bearing body421and the wheel mount.", "", "In this embodiment, the engagement surface430is positioned at the distal end452of the insert section440, again formed in and extending radially inwards from the inner wall thereof. This positions the engagement surface430below the bearing body421, below the top surface447of the composite wheel, with a section of that engagement surface430extending below the composite wheel410, located within the insert section aperture recess456of the backing plate422. This enables each fastening nut418to be recessed through the bearing body421and into the respective insert section440. This configuration positions the fastening nut418in an even lower position than the embodiment illustrated inFIGS.1to5, providing an even smaller stack height.", "", "The insert section440of the bearing body421is preferably not bonded to the composite wheel10in any way. This allows the insert section440to slide relative to the attachment aperture24in the composite wheel410.", "", "The attachment insert420is configured to project the compressive force from that clamping engagement outwards from the engagement surface430and axially (relative to fastening axis X) back up the insert section440, and to the base444of the bearing body421. As best shown inFIG.10, this indirectly creates a compression force JC between the base455of the bearing body421and the backing plate422, sandwiching the material of the composite wheel10together between the base455of the bearing body421and the backing plate422thereby securely fastening the wheel410onto the wheel mount412. The transfer of forces results from the fastening nut418being is fastened onto the end of the wheel stud414(creating tension BT in the wheel stud414). Tightening of the fastening nut418on the wheel stud414engages the engagement portion436of the fastening nut418onto the engagement surface430creating a compression force SC on the engagement surface430, which is transferred into the adjoining portion of the insert section440. This in turn creates a tension force ST between the engagement surface430and the bearing body421, which in turn applies a compression force JC from the base444of the bearing body421onto the surface447of the composite wheel410around the attachment aperture424. The transfer of forces from the engagement surface430through the insert section to the bearing body421ensures that the force F is distributed away from the edge of the attachment aperture424and is more evenly distributed across the composite surface447and then on and through the composite structure around the attachment aperture424. For this embodiment, the shared nature of the bearing body421provides even greater distribution of those forces over the across the composite surface447.", "", "As best shown inFIGS.9,10and11, the backing plate422is designed to be inserted between the wheel mount412and the composite wheel410. The illustrated backing plate422is a flat toroid shaped plate which includes eight annularly spaced apart insert section apertures454—corresponding with the number of attachment apertures424in the composite wheel—through which the wheel stud414extends. The backing plate422provides a large surface on the opposite side of the attachment apertures424to the bearing body421against which the composite wheel410can be clamped by compression force JC (FIG.10). As shown inFIGS.10, the backing plate422includes a series of insert section aperture recesses456which are concentrically arranged with each of the insert section apertures454. The recesses456seat the distal ends452of the insert sections440therein as described above. Again, the distal end452of the insert section440does not directly engage (radially or axially relative to axis X-X) any part of the wheel mount412or the backing plate422.", "", "In the illustrated embodiment, a fastener such as a shoulder bolt is fastened in recess446(FIG.11) to loosely hold the shared bearing body421and the backing plate422together though the carbon fibre wheel410. This also prevents rotation of the bearing body421. Nevertheless, it should be appreciated that equally an alternate retention feature, for example a circlip or other fastener arrangement provided on the distal end of each insert section440or similar could be equally be used to perform this function. Here a further section may axially extend from the distal end452of the insert section440through the respective insert section aperture454, onto which the fastener arrangement is attached. Similarly, embodiments of the insert section440may include a sleeve or similar extension section that axially extends from the distal end452of the insert section440through the respective insert section aperture454.", "", "When fitted to a composite wheel10(for example as shown inFIG.1), the attachment arrangement16,216,316,416is preloaded tension between the annular engagement surface30,230,330,430of the arrangement16,216,316,416and the base44,244,344,444of the bearing body21,221,321,421(and the load transfer zone45,345,445of the surface of the composite wheel10around the attachment aperture24,224,324,424) through tightening of the fastening nut18on wheel studs14,314,414(embodiment shown inFIGS.1to5,FIG.7orFIGS.8to11respectfully), or tightening of the fastening bolt218(embodiment shown inFIG.6). This also preloads compression between the base44,244,344,444of the bearing body21,221,321,421and the surface of the composite wheel10around the attachment aperture24,224,324,424.", "", "While the illustrated embodiment relates to a carbon fibre wheel10, it should be appreciated that the illustrated attachment arrangement could be adapted for use with any similar type of composite material, structure or component which is designed to be fastened to a mount and in which compression joint damage can occur.", "", "Those skilled in the art will appreciate that the invention described herein is susceptible to variations and modifications other than those specifically described. It is understood that the invention includes all such variations and modifications which fall within the spirit and scope of the present invention.", "", "Where the terms “comprise”, “comprises”, “comprised” or “comprising” are used in this specification (including the claims) they are to be interpreted as specifying the presence of the stated features, integers, steps or components, but not precluding the presence of one or more other feature, integer, step, component or group thereof."], "claims": ["(A) a fastening body which includes the elongate fastener element or is configured to be fastened onto the elongate fastener element, the fastening body having an engagement portion; and (B) an attachment insert that includes: a bearing body which includes a base configured to face a surface of the composite wheel about the attachment aperture; a fastening aperture through which the elongate fastener element is inserted when in use, the fastening aperture including a fastening axis; an insert section which extends axially away from the base of the bearing body relative to the fastening axis about the fastening aperture, the insert section being configured to extend into the attachment aperture of the composite wheel; and at least one engagement surface extending from an inner surface of the insert section, the at least one engagement surface having a substantially complementary configuration to the engagement portion of the fastening body and is configured to operatively engage the engagement portion of the fastening body when the fastening body fastens to the wheel mount through the elongate fastener element, wherein at least a portion of the at least one engagement surface is located below the base of the bearing body and between the base of the bearing body and a distal end of the insert section, and wherein the distal end of the insert section extends into the attachment aperture of the composite wheel and is spaced apart from the wheel mount, or from or in an element located in, on, integral with, or adjacent to the wheel mount such that the distal end of the insert section does not directly engage with the wheel mount and/or said element.", "2 . The attachment arrangement according to claim 1 , wherein the at least one engagement surface includes a distal end and said distal end of the engagement surface is located axially away from the base of the bearing body relative to the fastening axis and between the base of the bearing body and the distal end of the insert section.", "3 . The attachment arrangement according to claim 1 , wherein the at least one engagement surface is located axially away from the base of the bearing body, and axially through and below the fastening aperture, relative to the fastening axis.", "4 . The attachment arrangement according to claim 1 , wherein at least part of the least one engagement surface is located axially above the base of the bearing body relative to the fastening axis.", "5 . The attachment arrangement according to claim 1 , wherein the at least one engagement surface is substantially located between the base of the bearing body and the distal end of the insert section.", "6 . The attachment arrangement according to claim 1 , wherein the bearing body includes a body aperture sized to receive at least a portion of the fastening body, and the body aperture optionally extends into the insert section of the attachment insert.", "7 . (canceled)", "8 . The attachment arrangement according to claim 1 , wherein the insert section includes a first section having a first internal diameter to receive the fastening body, and a second section having a second internal diameter sized to capture the fastening body, and through which the elongate fastener element can extend.", "9 . The attachment arrangement according to claim 1 , wherein the base of the bearing body includes a substantially flat contact surface configured to abut the surface of the composite wheel about the attachment aperture.", "10 . The attachment arrangement according to claim 1 , wherein the composite wheel includes at least two attachment apertures, and the bearing body extends over the surface of the composite wheel between and around each of the at least two attachment apertures.", "11 . The attachment arrangement according to claim 10 , wherein the bearing body comprises a substantially planar body, optionally a plate, which extends between and around each attachment aperture.", "12 . The attachment arrangement according to claim 10 , wherein the bearing body includes at least two fastening apertures and at least two insert sections corresponding to the number of attachment apertures in said composite wheel, each insert section extending into a respective attachment aperture of the composite wheel.", "13 . The attachment arrangement according to claim 10 , wherein the bearing body has a contoured engagement face having a complementary configuration to the surface of the composite wheel on which the bearing body engages.", "a fastening bolt which includes a fastening head including the engagement portion and the elongate fastener, the elongate fastener being configured to be connected in the wheel mount; or a fastening nut which is assembled onto the elongate fastener element to operatively engage the engagement portion thereof with the at least one engagement surface.", "15 . (canceled)", "16 . (canceled)", "17 . The attachment arrangement according to claim 1 , wherein the engagement surface is angled or curved relative to the fastening axis, and optionally wherein the angled engagement surface has an angle of between 10 and 80 degrees relative to the fastening axis, optionally between 30 and 60 degrees.", "18 . (canceled)", "19 . The attachment arrangement according to claim 17 , wherein the engagement surface comprises a substantially annular portion of an inner wall of the insert section.", "20 . The attachment arrangement according to claim 1 , wherein the insert section is configured to extend into and through the attachment aperture of the composite wheel, and the element located adjacent the wheel mount comprises at least one backing element configured to be inserted between the wheel mount and the composite wheel, the at least one backing element including at least one section of the fastening aperture.", "21 . (canceled)", "the distal end of the insert section is configured to be received in an insert section aperture located in the wheel mount or the at least one backing element, and optionally the insert section aperture is sized to allow at least a portion of the insert section to move through the insert section aperture, optionally sized to provide a sliding fit between a portion of the distal end of the insert section and the at least one backing element.", "23 - 28 . (canceled)", "the distal end of the insert section is configured to be received in an insert section aperture located in the wheel mount or the at least one backing element, and the distal end of the insert section includes at least one retention feature which prevents withdrawal of the insert section through the insert section aperture; and/or the base of the bearing body includes a fixing feature which substantially prevents axial rotation of the insert section relative to the wheel mount, and wherein the fixing feature optionally comprises at least one projection, spigot, flange or embossment that is seated in at least one complementary groove, hole, aperture, detent, recess or depression in the surface of the composite wheel.", "30 . (canceled)", "31 . The attachment arrangement according to claim 1 , wherein the composite wheel comprises a carbon fibre composite wheel.", "32 . A composite wheel including the attachment arrangement according to claim 1 , optionally comprising a carbon fibre composite wheel.", "33 . (canceled)"], "bibtex": "@patent{20240253391,\n    title = {ATTACHMENT ARRANGEMENT FOR COMPOSITE WHEELS},\n    number = {20240253391},\n    year = {2024},\n    note = {File: US20240253391A1-20240801.XML}\n    }", "classification": "B60B314FI"}, {"title": "Aerodynamic Wheel Covers and Mounting Assemblies", "doc_number": "20240253392", "filename": "US20240253392A1-20240801.XML", "abstract": "Aerodynamic wheel covers may include a hub assembly coupled with a hub of a large vehicle, such as a truck. A base assembly may be coupled to the hub assembly, and a disk assembly may be coupled with the base assembly such that removal and installation of the disk assembly may be accomplished without tools.", "detailed_description": ["Embodiments of the invention and the various features and advantageous details thereof are explained more fully with reference to the nonlimiting embodiments that are illustrated in the accompanying drawings and detailed in the following description. Descriptions of well-known starting materials, processing techniques, components and equipment are omitted so as not to unnecessarily obscure the invention in detail. It should be understood, however, that the detailed description and the specific examples, while indicating preferred embodiments of the invention, are given by way of illustration only and not by way of limitation. Various substitutions, modifications, additions and/or rearrangements within the spirit and/or scope of the underlying inventive concept will become apparent to those skilled in the art from this disclosure.", "", "As used herein, the terms “comprises,” “comprising,” “includes,” “including,” “has,” “having” or any other variation thereof, are intended to cover a non-exclusive inclusion. For example, a process, product, article, or apparatus that comprises a list of elements is not necessarily limited to only those elements but may include other elements not expressly listed or inherent to such process, product, article, or apparatus. Further, unless expressly stated to the contrary, “or” refers to an inclusive “or” and not to an exclusive “or”. For example, a condition A or B is satisfied by any one of the following: A is true (or present) and B is false (or not present), A is false (or not present) and B is true (or present), and both A and B are true (or present).", "", "Additionally, any examples or illustrations given herein are not to be regarded in any way as restrictions on, limits to, or express definitions of, any term or terms with which they are utilized. Instead these examples or illustrations are to be regarded as being described with respect to one particular embodiment and as illustrative only. Those of ordinary skill in the art will appreciate that any term or terms with which these examples or illustrations are utilized encompass other embodiments as well as implementations and adaptations thereof which may or may not be given therewith or elsewhere in the specification and all such embodiments are intended to be included within the scope of that term or terms. Language designating such non-limiting examples and illustrations includes, but is not limited to: “for example,” “for instance,” “e.g.,” “in one embodiment,” and the like. Furthermore, any dimensions, materials or other such characteristics are provided by way of example and not limitation.", "", "Tractor-trailers travel significant distances every year. Consequently, the cumulative effect of even incremental amounts of drag on a tractor-trailer can lead to significant increases in overall operating costs. Such increased transportation costs are typically absorbed by consumers of the products transported. One significant source of drag on tractor-trailers, and hence increased transportation costs, are the wheel assemblies of the tractor-trailers. In general, the aerodynamic drag of a vehicle increases when air flow is affected by a wheel opening, especially deep wheel openings commonly found on tractor-trailer vehicles. Consequently, there is a need for wheel covers that decrease drag. However, as discussed previously, previous solutions for attaching covers to hubs are unsatisfactory for use with tractor trailers. Accordingly, embodiments described herein provide mechanisms and methods for attaching cover assemblies to wheel assemblies (as used herein, the term “wheel assembly” may refer to a single wheel or a dual wheel assembly, particularly as it relates to a tractor-trailer vehicle).", "", "According to one embodiment, a wheel cover assembly may include a removable wheel cover or disk assembly coupled with a fixed hub mounting assembly that is mounted or otherwise coupled to a wheel assembly. The wheel assembly may be a single wheel or a dual wheel assembly, particularly as it relates to a tractor-trailer vehicle, or other type of wheel assembly.FIGS.1A-1Bdepict perspective and side views of one embodiment of aerodynamic wheel cover assembly100including disk assembly300mounted on a hub mounting assembly200which is coupled to wheel assembly6. In some embodiments, disk assembly300may be formed as outer retaining ring310coupled with spokes305to inner ring320and disk315. Disk315may be single piece or may be formed as disk inserts315. Outer retaining ring310, spokes305and disk315may be constructed separately or may be formed as a monolithic disk assembly300. Disk315may be formed generally planar or non-planar. Non-planar disks315may have a substantially conical or concave form. In some embodiments, disk315may be oriented with a concavity facing inboard and wheel cover assembly100may be configured such that installation of disk assembly300biases disk315. Biasing disk315may lessen the concavity, may result in an otherwise planar disk having a negative concavity (i.e., disk315has a convex shape) or may otherwise change the configuration of the disk from an initial configuration to a second configuration or flexion. In some embodiments, disk assembly300provides a substantially continuous surface to facilitate aerodynamic flow around wheels6. In other embodiments, disk assembly300may be configured to facilitate aerodynamic flow through the wheel cover, whereby the wheel cover may act as a fan or radial vent, for example. The size, rigidity, concavity/convexity, surface texture, venting features, or contact area with wheel(s)6may be selected to promote a desired air flow around wheel(s)6. Furthermore, portions of disk assembly300may be manufactured with clear material or with openings to allow visual access to components of wheel(s)6.", "", "FIGS.2A-2Bdepict perspective and side views of an alternate embodiment of an aerodynamic wheel cover assembly100including hub mounting assembly200mounted on wheel assembly6. Attachment or coupling hub mounting assembly200with hub50may involve using hardware52to couple bracket204to hub50, while still allowing access to wheel nuts22. As depicted inFIGS.2A and2B, disk assembly300may be formed as an outer retaining ring310coupled with spokes305to inner ring320with disk inserts315. The inner portion40of the rim (e.g., the area encircled by the rim's outboard flange), including the hub50may be exposed for increased circulation, to prevent debris from being trapped inside wheel cover assembly100, to improve cooling, etc.", "", "FIG.3depicts an exploded view of one embodiment of aerodynamic wheel cover assembly100including hub mounting assembly200and disk assembly300. Hub mounting assembly200may include bracket assembly150and base assembly250. Bracket assembly150may be configured or formed to allow access to components associated with wheel6, such as hub50, the rim, a tire inflation valve, a fluid level indicator, lug nuts, or the like. Bracket assembly150may be fastenable to hub50such that bracket assembly150may be removed or installed using tools. Tools used to remove bracket assembly150may be standard tools (e.g., sockets) or specialized, and may include hardware and locking mechanisms to prevent accidental or unauthorized removal of bracket assembly150. In some embodiments, bracket assembly150may be connected to hub50utilizing studs52or some other pre-existing hardware associated with hub50. In some embodiments, stationary bracket110may be coupled to hub50, such as using hub nuts53threaded onto studs52. Adjustable bracket125may be coupled fixedly or pivotally to stationary bracket204using hardware115or some other mechanical means. Adjustable bracket125may be selectively coupled to stationary bracket204such that the position of the outboard end of adjustable bracket125may be selected. That is, in the embodiment shown, the outboard position of base assembly mounting platform127may be adjusted. Selective adjustment of adjustable bracket125may be performed utilizing a series of holes, slots, or other means of linear positioning.", "", "Also depicted inFIG.3, hub mounting assembly200may include base assembly250. Base assembly250may be coupled to hub50via bracket assembly150to mount disk assembly300. In some embodiments, base assembly250includes base210, resilient member or spring212, piston214and alignment bushing220. Base assembly250may be coupled with adjustable bracket125using hardware or other mechanical, thermal or chemical means, or may be formed integral with adjustable bracket125.", "", "FIGS.4A-4Bdepict top and perspective views of one embodiment of bracket assembly150having adjustable bracket125for use with an aerodynamic wheel cover and a system for mounting an aerodynamic wheel cover on a wheel assembly. Bracket assembly150may be coupled with hub50using nuts53on studs52. In some embodiments, slots116and openings117may allow adjustments of the height H of adjustable bracket125relative to stationary brackets110to accommodate hubs of various heights, and openings350and127allow adjustments to width W of bracket125to allow adjustments for various diameters of hubs50, or to accommodate other devices, for example automatic inflators, on hub50", "", "FIG.5depicts an exploded view of components of one embodiment of base assembly250. In some embodiments, base assembly250comprises base210, piston214, spring212, and alignment bushing220. In some embodiments, inner walls of base210have a selected depth and recessed area211for retaining spring212. In some embodiments, inner walls209form a cylinder. Inner walls209defines a space within which piston214is able to translate axially. Piston214comprises ring218about an inner shaft215aligned relative to longitudinal axis A-A. Ring218includes notches216of arc length D separated by ribs229of arc length C. Inner shaft215includes a first end213for retaining a second end of spring212and a second end222. Inner shaft215is joined to ring218by a set of radially extending spokes232separated by openings of approximately a width or an arc length E.", "", "Alignment bushing220includes an outboard area having a set of outwardly extending radial arms217having an arc length of approximately D, separated by notches230of an arc length of approximately C. A set of extensions221extend inboard and have an arc length of approximately E. An aperture234is sized so that second end222of inner shaft215can pass.", "", "In operation, extensions221can pass through the gaps between spokes232, with the spokes fitting in channels231. Alignment bushing220can be coupled to base210. Alignment bushing220may be bolted, welded, glued, epoxied, or otherwise mechanically, thermally, or chemically coupled to base210to inhibit movement of alignment bushing220relative to base210. In some embodiments, alignment bushing220and base210comprise apertures206that can be aligned such that a pin, screw, rivet or other hardware (not shown) can be inserted to hold alignment bushing220relative to base210.", "", "Biasing member212can bias piston214toward alignment bushing220such that ribs229fit in notches230and radially extending arms217fit in notches216. The second end of inner shaft215can be accessible through aperture234. By pressing on second end222of inner shaft215, piston may be translated in an inboard direction such that there is clearance between the inboard surfaces of radially extending arms217and the outboard surfaces of ribs229. Consequently, a disk assembly300may rotate for installation and removal, as discussed below.", "", "FIGS.6and7depict perspective views of another embodiment of base assembly250. Embodiments disclosed herein may include features for preventing rotation of piston214in base assembly250. In the embodiment ofFIGS.6and7, piston214is similar to that depicted inFIG.5, but base210includes extensions227that extend outboard, rather than alignment bushing220including projections221that extend inboard. Although not illustrated, a biasing member, such as depicted inFIG.5, may bias piston214away from base210. Channels237have a width or arc length P to accommodate spokes232of arc length O. Channels237in base210accommodate spokes232to ensure alignment of extension227through apertures241. Each extension227is sized to extend through apertures241between spokes232. For example, extensions227may have a width M sized to fit through aperture241having width N. Base210has an inner surface272for contact with outer surface273of outer ring218of piston214. Alignment bushing220, in the example ofFIGS.6-7can be a relatively flat sheet piece having radially extending arms217separated by notches230and having an aperture234to accommodate the second end of piston214.", "", "Biasing member212can bias piston214toward alignment bushing220such that ribs220fit in notches230and radially extending arms217fit in notches216. The second end of inner shaft215can be accessible through aperture234. By pressing on second end of inner shaft215, piston may be translated in an inboard direction such that there is clearance between the inboard surfaces of radially extending arms217and the outboard surfaces of ribs229. Consequently, a disk assembly300may rotate for installation and removal, as discussed below.", "", "Embodiments disclosed herein include a system that allows tool-free installation and removal of a resilient disk. To reduce binding and to better align the components, the shape of each extensions221or227, the width or arc length of channels231or237, the arc length of spokes232, the width and arc length of apertures215, the size of inner shaft215and aperture235can be selected such that piston214is able to translate relative to alignment bushing220. In operation, piston214is able to translate relative to alignment bushing220to allow second end222to be recessed with, flush with or extended beyond alignment bushing230and to allow ribs229to be recessed with, flush with or extend axially beyond radial arms217.", "", "As discussed below, tabs of a disk assembly300are able to be positioned in notches230and in contact with ribs229and depressed and rotated behind radial arms217into notches216, and may use edge262of extensions221or227as a guide and with channels231or237small enough such that the tabs of the disk assembly do not bind or hang on axial extensions221or227. In use, spring212exerts a force on piston214to maintain axial bias of ribs229of piston214in notches230of alignment bushing, thereby trapping the tabs of the disk assembly between the surfaces243of notches216and the radial arms217of the alignment bushing220.", "", "Advantageously, embodiments such as those described herein may be manufactured from metal (including alloys) or polymers. In some embodiments, components may be manufactured using CNC techniques. Some embodiments disclosed herein may be formed with CNC techniques on a three axis machine, which may advantageously allow for increasing or decreasing the scale of a device, and which may advantageously reduce production costs.", "", "FIGS.8-10depict perspective views of one embodiment of base assembly250, illustrating one mode of operation. In a first biased position, ribs229and notches230may be aligned (and corresponding notches216and radial arms217may also aligned) such that the force exerted by spring212biases piston214to a first extended axial position. In other biased positions, forces exerted on piston214may depress spring212such that a gap G is formed between surface243of rib229and surface233(i.e., back side) of radial arms217. For example, a second biased position may be defined as a position of piston214where the gap G is large enough that the distance between the outboard surfaces of ribs219and the inboard surfaces of radial arms217is greater than the thickness of corresponding tabs on a disk assembly, thereby allowing the tabs of the disk assembly to be positioned between ribs229and radial arms217.FIG.9depicts a partial perspective view of wheel cover assembly100in which piston214is in a second position such that tabs207of a disk assembly300are inserted through notches230(see e.g.,FIG.6) and able to rotate from a first position aligned with notches230to a second position aligned with notches216(see e.g.,FIG.6).", "", "In a third biased position, spring212may exert a force on piston214such that piston214is not considered to be in the second biased position but piston214may not fully translate to the first biased position.FIG.10depicts a partial perspective view of one embodiment of wheel assembly100in which gap G is smaller than gap G inFIG.9, illustrating base assembly250being in a third biased position. In this case, the tabs207of disk assembly300may be fully seated in notches216with the piston biasing the tabs207against the radial arms217.", "", "FIGS.9and10further depict an embodiment of disk assembly300in which disk315includes cutouts920, insets910, and rails930. Insets910, cutouts920and rails930may be formed or positioned to accommodate wheel balance weights on a rim, valve stems or other hardware, to increase air flow behind disk315, to provide hand holds to assist in removal and installation of disk assembly300, to provide a desired rigidity to disk assembly300, and other advantages.", "", "In operation, disk assembly300may be positioned in base assembly250to maintain disk assembly300in a desired position.FIGS.11A-11Fdepict partial and perspective views of one embodiment of aerodynamic wheel cover assembly100and a system for mounting aerodynamic disk assembly300on hub mounting assembly200, illustrating one method for installing a wheel cover on a wheel assembly.", "", "A first step in the mounting process involves aligning disk assembly300with base assembly250.FIGS.11A and11Bdepict views of wheel cover assembly100, illustrating a step for aligning disk assembly300with base assembly250. In some embodiments, alignment includes visually checking that tabs207on inner ring202are positioned in notches230of alignment bushing220. Alignment may be performed visually, such as ensuring tabs207cover ribs229, aligning an arrow or other alignment mark244on disk assembly300with an arrow or some other alignment mark245on base assembly200, or using a color, material, or other visual information. Alignment may also be performed using auditory or tactile information or cues, such as by selecting a geometry of the parts. For example, contacting tabs207on inner ring202with radial arms217and rotating wheel cover assembly200until the operator or mechanic hears or feels a click may indicate tabs207of disk assembly300are aligned with ribs229. In one embodiment, alignment of disk assembly300to base assembly250is possible when piston214is in a first biased position, for example when radial arms217have a thickness such that ribs229appear recessed, flush, or above relative to radial arms217.", "", "Once disk assembly300is in a desired position relative to notches230, piston214can be depressed to a second biased position at a selected depth or depth range in cylinder209of base210. Depressing piston214may be accomplished by applying pressure to actuator222, (for example using a thumb or finger) or by applying pressure to tabs207in contact with ribs229.FIGS.11C and11Ddepict perspective views of one embodiment of disk assembly300, illustrating advancement of inner ring202axially inward such that tabs207are positioned behind radial arms217(such as shown inFIG.11D), indicating compression of spring212.", "", "Once piston214is depressed a minimum amount, the gap G created between tab207and the bottom surface of radial arms217allows tabs207to be rotated relative to alignment bushing220and piston214.FIGS.11E and11Fdepict perspective views of one embodiment of wheel cover assembly100with disk assembly300.FIG.11Edepicts disk assembly300rotated at an angle R relative to base assembly250but less than angle L. When tabs207are offset from and rotated relative to radial arms217some angle R that is less than angle L, tabs207contact surfaces219of ribs229to inhibit ribs229(and thus piston214or spring212) from returning to the first biased position such that piston214is in a second biased position. Rotation may be either clockwise or counter-clockwise.", "", "Further rotation of disk assembly300some angle L relative to base assembly250allows tabs207to align with radial arms217aligned with notches216in ring218of piston214. Alignment of tabs207with radial arms217in notches216allows ribs229to translate in notches230to allow piston214to move from the second biased position into a third biased position. In some embodiments, piston214does not translate to the first biased position, but still translates to a biased position that impedes inner ring202of disk assembly300from rotating.FIG.11Fdepicts a perspective view of one embodiment of wheel cover assembly100in which disk assembly300is rotated angle L to align tabs207with radial arms217, thus allowing ribs229to align in notches230.", "", "A partial release of compressive forces on spring212allow spring212to extend to maintain ribs229in notches230. Maintaining ribs229in notches230provides security to wheel cover assembly100in that piston214is further unable to rotate and disk assembly300is securely coupled with base assembly250. Using steps such as those depicted inFIGS.11A-11F, disk assembly300with tabs207may be engaged with ribs229on piston214such that disk assembly300is secured to base assembly250, effectively locking disk assembly300yet allowing some motion to accommodate curbs and other objects or users that might contact outer ring180, spoke185, inserts215or other components of disk assembly300.", "", "Removal of disk assembly300may be accomplished by performing these steps in reverse order such that piston214is depressed to the second biased position, disk assembly300is rotated to align tabs207with notches230and piston214such that tabs207can be withdrawn from base assembly250.", "", "In some embodiments, common hardware or machines elements may be utilized, which may reduce overall complexity, reduce manufacturing costs, or other advantages.FIG.12Adepicts an exploded view of one embodiment in which common machine elements are used instead of custom-made hardware.FIGS.12B and12Cdepict embodiments in an assembled position ready to receive a disk assembly. In some embodiments, spring1212and hardware1208and1220may be common, off-the-shelf parts. In some embodiments, bracket1213or hardware1215may be able to replace portions of base assembly250. In some embodiments, such as depicted inFIG.12A, piston1214may include a single rib1229and a single notch1216, alignment bushing1220may include a single radial arm1217and a single notch1230, and disk assembly300may include tab1207. Hardware1240may be used to couple portions together or to bracket1213.", "", "As those skilled in the art will appreciate after reading this disclosure, embodiments described herein provide many variations of elements but a common push and turn functionality, in which one or more tabs on the disk assembly may be captured by the base assembly to secure the disk assembly to the wheel.", "", "In addition to wheel assemblies discussed above (and shown inFIGS.1A and1B), large vehicles may also have wheels mounted on a steer axle.FIG.13depicts a view of a single wheel assembly, such as found on steer axle70. In this situation, mounting an aerodynamic wheel cover may differ due to the different depth or geometry of steer axle70.FIGS.14and15further show hub odometer1410and oil level indicator1510which may be mounted on a wheel assembly and require further accommodation from wheel cover assembly100.", "", "FIGS.16A-16Ddepict views of one embodiment of aerodynamic wheel cover assembly100useful for accommodating components mounted to hub50or for mounting to steer axle70. An inner opening diameter of inner ring202may be selected to accommodate maintenance or inspection of components mounted to a hub without removal of the inner ring202. An inner opening diameter of inner ring202may also attach to components typically mounted to the hub50, such as a hub odometer. An advantage of mounting a hub odometer or other component to the inner opening diameter of the inner ring may allow embodiments to utilize all of the benefits disclosed herein. For example, embodiments may utilize a quick release mechanism for easier removal or access for inspections and maintenance.", "", "FIG.16Bdepicts a side view of one embodiment of wheel cover assembly100mounted on wheel6having a component (e.g., steer axle70) that obstructs positioning on a hub. Inner ring202may have a diameter sized to accommodate steer axle70, hub odometer1410, oil level indicator1510, etc.", "", "FIGS.16C and16Ddepict an exploded view of one embodiment of base assembly250showing bracket assembly1210, base1209, springs212, piston1214and alignment bushing1220, along with attachment hardware1205. In some embodiments, piston1214may not include any central spokes to accommodate steer axle70. Instead, piston1214may include partial spoke projections1232projecting radially inward some distance, leaving a large enough opening for components to pass. Spokes1232may be aligned with and positioned in channels1231to inhibit rotational movement of piston1214. In such embodiments, a plurality of springs1212or other resilient members may be positioned to contact piston1214and used to maintain an outward bias on piston1214and avoid binding by piston1214in base1209or alignment bushing1220. Operation of base assembly250may be similar to operation of base assembly250described above, in that tabs207on disk assembly1300may contact ribs1229on piston1214, piston1214may be depressed from a first biased position to a second biased position such that tabs207may be rotated some angle until tabs207align with notches1216in piston1214and are positioned behind radial arms1217, and tension on springs212may be released to allow piston1214to translate into a third biased position, locking tabs207(and thus disk assembly1300) relative to wheel assembly6.", "", "An advantage to embodiments described herein may be the ability for the outer portion or edge of a disk assembly to maintain contact with a wheel. As depicted inFIGS.2A-2B,3A-3B,16A and16B, an outer edge or portion of disk assembly300or1300is maintained in contact with a rim of wheel assembly6. Maintaining contact at an outer edge may prevent undesirable effects associated with vehicle vibration and air streams in contact with disk300or310, such as noise or undue vibration, which may lessen any aerodynamic effect or undesirably wear components of the disk assembly300. An outer edge or portion of the disk may be reinforced or provided with pads, or otherwise configured to dampen vibration and reduce wear associated with contact with a rim of wheel assembly6.", "", "Variations of various components may be possible without varying from the scope of the disclosure. For example,FIGS.17A-17Cdepict views of alternative embodiments of base210.FIG.17Adepicts a perspective view of one embodiment of base210having one extension227with channel237formed therein.FIG.17Bdepicts a perspective view of one alternative embodiment of base210having a plurality of various shaped extensions227. Having different shaped extensions227may ensure that wheel cover assembly100is aligned in a particular orientation, enables locking, or some other advantage.FIG.17Cdepicts a perspective view of one alternative embodiment of base210, with inner wall272having sides. As shown inFIG.17C, inner wall272may have six sides. However, those skilled in the art will appreciate that more or fewer sides may be possible.", "", "In the foregoing specification, the invention has been described with reference to specific embodiments. However, one of ordinary skill in the art appreciates that various modifications and changes can be made without departing from the scope of the invention as set forth in the claims below. Accordingly, the specification and figures are to be regarded in an illustrative rather than a restrictive sense, and all such modifications are intended to be included within the scope of invention.", "", "Benefits, other advantages, and solutions to problems have been described above with regard to specific embodiments. However, the benefits, advantages, solutions to problems, and any component(s) that may cause any benefit, advantage, or solution to occur or become more pronounced are not to be construed as a critical, required, or essential feature or component of any or all the claims."], "claims": ["1 . (canceled)", "a valve; a disk assembly comprising an inner portion; a push and turn securing mechanism adapted to be coupled to an assembly of a wheel and compatible with the inner portion of the disk assembly, wherein the disk assembly is adapted to be removably coupled to the wheel by the push and turn securing mechanism and the push and turn securing mechanism is adapted to allow the disk assembly to rotate a portion of a single rotation to a secured position.", "3 . The wheel cover system of claim 2 , wherein the valve is positioned on the disk assembly.", "4 . The wheel cover system of claim 2 , wherein the valve is positioned on the push and turn securing mechanism.", "5 . The wheel cover system of claim 2 , wherein the valve is positioned in an opening adjacent the disk assembly.", "6 . The wheel cover system of claim 2 , wherein the valve is coupled to a second valve on the wheel.", "7 . The wheel cover system of claim 6 , wherein the valve is coupled to the second valve via an air hose extension.", "8 . The wheel cover system of claim 2 , wherein the assembly coupled to the wheel is adapted to be coupled to a hub of the wheel.", "a valve; a disk assembly; a push and turn securing mechanism compatible with the disk assembly, wherein the disk assembly is adapted to be removably coupled to a wheel by the push and turn securing mechanism and the push and turn securing mechanism is shaped to receive the disk assembly and allow the disk assembly to rotate less than a single rotation to a secured position.", "10 . The wheel cover system of claim 9 , wherein the valve is positioned on the disk assembly.", "11 . The wheel cover system of claim 10 , wherein the disk assembly comprises a disk and the valve is positioned on the disk.", "12 . The wheel cover system of claim 9 , wherein the disk assembly comprises a disk and the valve is positioned in an opening adjacent the disk.", "13 . The wheel cover system of claim 9 , wherein the valve is positioned on the push and turn securing mechanism.", "14 . The wheel cover system of claim 9 , wherein the valve is coupled to a second valve on the wheel.", "15 . The wheel cover system of claim 14 , wherein the valve is coupled to the second valve via an air hose extension.", "16 . The wheel cover system of claim 9 , wherein the assembly coupled to the wheel comprises a bracket assembly adapted to be coupled to a hub of the wheel.", "17 . The wheel cover system of claim 16 , wherein the bracket assembly is adjustable.", "18 . The wheel cover system of claim 16 , wherein the bracket assembly is adapted to be coupled to the hub utilizing a stud of the hub.", "a valve; a disk assembly comprising a centrally located opening; a rotational securing mechanism adapted to couple to a bracket assembly coupled to a hub of a wheel, wherein: an inner ring is adapted to secure to the rotational securing mechanism when the inner ring is rotated to a secured position and to release from the rotational securing mechanism when the inner ring is rotated to a released position, and wherein the rotational securing mechanism is compatible with the opening of the disk assembly such that the disk assembly is secured to the mechanism by the inner ring when the inner ring is rotated to the secured position.", "20 . The wheel cover system of claim 19 , wherein the valve is positioned on the disk assembly.", "21 . The wheel cover system of claim 19 , wherein the valve is positioned on the rotational securing mechanism or the bracket assembly."], "bibtex": "@patent{20240253392,\n    title = {Aerodynamic Wheel Covers and Mounting Assemblies},\n    number = {20240253392},\n    year = {2024},\n    note = {File: US20240253392A1-20240801.XML}\n    }", "classification": "B60B706FI"}, {"title": "HUB FOR HUMAN-POWERED VEHICLE", "doc_number": "20240253393", "filename": "US20240253393A1-20240801.XML", "abstract": "A hub is provided for a human-powered vehicle. The hub includes a hub axle, a first rotating body, a second rotating body, a first ratchet member, a second ratchet member and a slider. The first rotating body and the second rotating body are rotatably mounted on the hub axle. The first ratchet member rotates with the first rotating body. The second ratchet member rotates with the second rotating body. The slider rotates with the first rotating body and slide with respect to the second rotating body in a circumferential direction. The slider has a first contact surface in sliding contact with an axially facing surface of the second ratchet member. The slider has a second contact surface in sliding contact with a radially facing surface of the second ratchet member.", "detailed_description": ["Selected embodiments will now be explained with reference to the drawings. It will be apparent to those skilled in the human-powered vehicle field (e.g., the bicycle field) from this disclosure that the following descriptions of the embodiments are provided for illustration only and not for the purpose of limiting the invention as defined by the appended claims and their equivalents.", "", "Referring initially toFIG.1, a human-powered vehicle V is illustrated that is equipped with a hub10in accordance with one illustrated embodiment. In other words, the hub10is provided for the human-powered vehicle V. In this embodiment, the human-powered vehicle V is a bicycle and the hub10is a bicycle hub. The human-powered vehicle V includes a front wheel FW and a rear wheel RW rotatably attached to a vehicle body VB. Here, the hub10is provided to the rear wheel RW. The vehicle body VB is also provided with a handlebar H and a front fork FF for steering the front wheel FW. The vehicle body VB is also provided with a saddle S for a rider to sit on while riding the human-powered vehicle V.", "", "As seen inFIG.1, the human-powered vehicle V further comprises a drive assembly12. The drive assembly12comprises the hub10. Here, for example, the drive assembly12is a chain-drive type. The drive assembly12further comprises a crank14, a chain16(i.e., a force transmission member), a plurality of front sprockets18(i.e., a front rotatable body) and plurality of rear sprockets20(i.e., a rear rotatable body). The chain16provides mechanical communication between the crank14and the hub10. Thus, a rotational force caused by rotation of the crank14in a forward traveling direction R can be transmitted to the hub10via the chain16. The crank14includes a crank axle14A and a pair of crank arms14B. A pedal PD is rotatably coupled to the distal end of each of the crank arms14B. The crank arms14B are provided on opposite ends of the crank axle14A. The chain16can provide a mechanical connection between the front sprockets18and the rear sprockets20provided on the hub10.", "", "Here, the human-powered vehicle V further includes a front derailleur FD that is attached to the vehicle body VB for shifting the chain16between the front sprockets18that are provided to the crank14. Also, here, the human-powered vehicle V further includes a rear derailleur RD that is attached to the rear of the vehicle body VB for shifting the chain16between the rear sprockets20that are provided to the hub10. The front derailleur FD and the rear derailleur RD are one type of gear changing device. Here, for example, the front derailleur FD and the rear derailleur RD are electric derailleurs (i.e., electric gear changing devices). The front derailleur FD and the rear derailleur RD are operated when a rider of the human-powered vehicle V manually operates a gear shift operating device or shifter SL. The front derailleur FD and the rear derailleur RD can also be automatically operated based on traveling conditions and/or operating conditions of the human-powered vehicle V.", "", "The structure of the hub10will now be described with particular reference toFIGS.2and3. The hub10comprises a hub axle30and a first rotating body32. The hub axle30defines a center axis CA. The first rotating body32is rotatably mounted on the hub axle30to rotate around the center axis CA. The second rotating body34is rotatably mounted on the hub axle30to rotate around the center axis CA. As explained below, the second rotating body34is rotatably coupled to the hub axle30to transmit a driving force from the second rotating body34to the first rotating body32while the second rotating body34rotates in a driving rotational direction D1as explained later. Basically, the hub axle30is non-rotatably attached to the vehicle body VB, while the first rotating body32is rotatably mounted around the hub axle30. As indicated inFIG.1, the first rotating body32and the second rotating body34are rotatable relative to the hub axle30in the driving rotational direction D1which corresponds to a forward traveling direction R of the rear wheel RW. Here, the first rotating body32includes a hub body HB. Also, here, the second rotating body34includes a sprocket support body SB. Thus, the second rotating body34is configured to support the rear sprockets20.", "", "The hub axle30is a rigid member that is made of a suitable material such as a metal material. Here, the hub axle30is a conventional member having a shaft portion30awith a first end cap30bprovided on a first end of the shaft portion30aand a second end cap30cprovided on a second end of the shaft portion30a. Here, the shaft portion30a, the first end cap30band the second end cap30cdefine a through bore as seen inFIG.3. As seen inFIG.2, a frame securing device36is provided for attaching the hub10to the bicycle frame F (seeFIG.1) in a conventional manner. In the first embodiment, the frame securing device36includes a skewer or spindle36athat has a cam lever mechanism36bmounted at one end of the spindle36a. Thus, the hub10can be mounted onto a rear section of the vehicle body VB of the human-powered vehicle V as seen inFIG.1.", "", "As shown inFIG.2, the first rotating body32is rotatably mounted on the hub axle30to rotate around the center axis CA. The first rotating body32is a rigid member that is made of a suitable material such as a metal material or a reinforced plastic material. The first rotating body32includes a spoke attachment structure for attaching the spokes of the rear wheel RW to the hub10. In particular, the first rotating body32has a center tubular body32aand a pair of spoke attachment flanges32band32cextending outwardly in a radial direction from the center tubular body32a. The spoke attachment flanges32band32care provided with holes for attaching the inner ends of the spokes in a conventional manner. Thus, the spoke attachment flanges32band32cform a spoke attachment structure.", "", "As shown inFIG.3, the hub10further comprises at least one bearing assembly for rotatably supporting the first rotating body32on the hub axle30. In the illustrated embodiment, the first rotating body32is rotatably mounted on the hub axle30by a pair of bearing assemblies38A and38B. The bearing assemblies38A and38B are conventional parts that are well known in the bicycle field, and thus, the bearing assemblies38A and38B will not be discussed any or illustrated in detail herein. Also, other bearing arrangements can be used as needed and/or desired.", "", "The second rotating body34is rotatably mounted on the hub axle30to rotate around the center axis CA. The second rotating body34is coupled to the first rotating body32to rotate together in a driving rotational direction D1around the center axis CA. In particular, the second rotating body34is rotatably coupled to the hub axle30to transmit a driving force from the second rotating body34to the first rotating body32while the second rotating body34rotates in the driving rotational direction D1as explained later. Thus, the second rotating body34constitutes a driving member that has a tubular shape. Also, the second rotating body34is configured to rotate relative to the first rotating body32in a non-driving rotational direction D2around the center axis CA.", "", "The second rotating body34is configured to support the rear sprockets20. Thus, the second rotating body34includes a sprocket attachment structure. For example, here, the second rotating body34has an outer peripheral surface that is provided with a plurality of axially extending splines34a(FIG.2) for non-rotatably engaging the rear sprockets20(FIGS.1and3) in a conventional manner. The splines34aare parallel to each other, and extend parallel to the center axis CA. The rear sprockets20(FIG.1) are held on the second rotating body34in a conventional manner such as a conventional nut that screws into the second rotating body34. The second rotating body34has a first helical spline34bdisposed on an outer peripheral surface of the second rotating body34. In particular, the outer peripheral surface of the second rotating body34has a plurality of the first helical spline34b. As explained later, the first helical spline34baid in the disengagement of the second rotating body34from the first rotating body32during coasting or when the second rotating body34is rotating in the non-driving rotational direction D2.", "", "Referring toFIG.3, the hub10further comprises at least one bearing assembly for rotatably supporting the second rotating body34on the hub axle30. In the illustrated embodiment, the second rotating body34is rotatably coupled to the hub axle30by a pair of bearing assemblies40A and40B as seen inFIG.3. The second rotating body34is axially retained on the hub axle30by the second end cap30c. The second end cap30ccan be press-fitted or screwed onto the shaft portion30aof the hub axle30to contact an inner race of the bearing assembly40B. An O-ring41is provided between the second end cap30cand the hub axle30for sealing the interface therebetween.", "", "Also, as seen inFIGS.3and4, the hub10further comprises a first sealing ring42and a second sealing ring43for sealing the space between the exterior of the second end cap30cand the interior of the second rotating body34. The first sealing ring42is provided to the exterior of the second end cap30c. The second sealing ring43is provided to the interior of the second rotating body34. The hub10further comprises a retaining clip44for restricting axial movement of the outer race of the bearing assembly40B.", "", "Still referring toFIGS.3,4and14, the hub10further includes a dust shield45for covering annular gap between the first rotating body32and the second rotating body34. In particular, the dust shield45covers the annular gap the space between the interior of the first rotating body32and the exterior of the second rotating body34. The hub10further comprises an outer cap46and a retaining clip47for retaining the dust shield45in place between the first rotating body32and the second rotating body34. The outer cap46is provided to the exterior of the second rotating body34and disposed between the first rotating body32and the second rotating body34. The retaining clip47is provided in a recess of the exterior of the second rotating body34for restricting axial movement of the outer cap46in which in turn restricts axial movement of the dust shield45.", "", "The hub10further comprises a planar ratchet assembly50that is configured to transmit a driving force from the second rotating body34to the first rotating body32while the second rotating body34rotates in the driving rotational direction D1. In other words, the second rotating body34is rotatably coupled to the hub axle30via the planar ratchet assembly50to transmit a driving force from the second rotating body34to the first rotating body32while the second rotating body34rotates in the driving rotational direction D1.", "", "The planar ratchet assembly50functions as a one-way clutch between the first rotating body32and the second rotating body34to permit coasting or freewheeling of the second rotating body34with respect to the first rotating body32. In particular, coasting or freewheeling occurs when the second rotating body34is stopped from rotating in the driving rotational direction D1(i.e., clockwise about the center axis CA as viewed from the freewheel side of the hub10) by the chain16, while the first rotating body32rotates in the forward traveling direction R. Additionally, coasting or freewheeling occurs when the first rotating body32rotates faster in the forward traveling direction R than the second rotating body34rotates in the driving rotational direction D1by the chain16. Also, coasting or freewheeling occurs when the second rotating body34rotates in a non-driving direction D2by the chain16due to the rider pedaling backwards.", "", "In the first embodiment, the hub10further comprises a first ratchet member51and a second ratchet member52. The first ratchet member51and the second ratchet member52are part of the planar ratchet assembly50. The first ratchet member51and second ratchet member52are annular members arranged around the center axis CA. The first ratchet member51is coupled to the first rotating body32to rotate with the first rotating body32. The second ratchet member52is coupled to the second rotating body34to rotate with the second rotating body34. The hub10further comprises a slider53. The slider53is configured to rotate with the first rotating body32and to slide with respect to the second rotating body34in a circumferential direction CD with respect to the center axis CA.", "", "The hub10further comprises a biasing member54. The biasing member54is disposed between the first rotating body32and the slider53. Basically, the biasing member54biases the second ratchet member52via the slider53in an axial direction with respect to the center axis CA towards engagement with the first ratchet member51. Here, the biasing member54biases the second ratchet member52in a first axial direction A1toward the first ratchet member51into the engagement position. With the second rotating body34in a rest position (i.e., no torque being applied thereto), the biasing member54maintains the second ratchet member52in driving engagement with the first ratchet member51. The biasing member54includes, for example, a compression spring in the illustrated embodiment. Here, the first axial direction A1refers to a direction that is parallel to the center axis CA and that points in a direction towards the end of the hub axle30having the second rotating body34.", "", "The first ratchet member51and the second ratchet member52move relative to each other in the axial direction as shown inFIG.13. In particular, the second ratchet member52is biased in the first axial direction A1towards the first ratchet member51into an engaged position by the biasing member54as seen inFIG.12. During coasting, the second rotating body34stops rotating in the driving rotational direction D1and the first rotating body32continues to rotate in the forward traveling direction R (seeFIG.1). As a result of the second rotating body34stop rotating in the driving rotational direction D1, the second ratchet member52is moved in a second axial direction A2away from the first ratchet member51against the force of the biasing member54. Here, the second axial direction A2refers to a direction that is parallel to the center axis CA to the hub axle30and that points in a direction away from the end of the hub axle30having the second rotating body34. The first axial direction A1is opposite to the second axial direction A2. In this way, the first ratchet member51and the second ratchet member52can slide relative to each other as seen inFIG.13.", "", "The hub10further includes a circumferential spacer56and an axial spacer58. The circumferential spacer56is disposed between the first rotating body32and the first ratchet member51to take up the circumferential space between the first ratchet member51and the first rotating body32. The axial spacer58is disposed between the second rotating body34and the first ratchet member51to take up the axial space between the second rotating body34and the first ratchet member51. Here, the axial spacer58includes a pair of annular washers as seen inFIG.12.", "", "Referring toFIGS.6,7,12and13, the first ratchet member51will now be discussed in more detail. As seen inFIGS.6and7, the first ratchet member51is an annular member that is concentrically disposed around the hub axle30. The first ratchet member51has at least one first ratchet tooth60. The at least one first ratchet tooth is disposed on a first axially facing surface61of the first ratchet member51. Here, the first ratchet member51includes a plurality of first ratchet teeth60. The first ratchet teeth60are formed on the first axially facing surface61that axially faces the second ratchet member52. The first ratchet teeth60are configured to engage the second ratchet member52as seen inFIG.12so that the first ratchet member51and the second ratchet member52can rotate together in the driving rotational direction D1. Moreover, the first ratchet teeth60are configured to be able to be disengaged from the second ratchet member52as seen inFIG.13so that the first ratchet member51and the second ratchet member52can rotate relative to each other in the circumferential direction CD.", "", "The first ratchet member51is configured to rotate with the first rotating body32. In particular, the first ratchet member51also includes a plurality of protrusions62formed on an outer peripheral surface of the first ratchet member51. The protrusions62form an engagement portion that engages a plurality of protrusions32d(seeFIG.5) of the first rotating body32. More specifically, the circumferential spacer56has a plurally of axially extending prongs disposed between the protrusions62of the first ratchet member51and the protrusions32dof the first rotating body32to take up the circumferential spaces between the protrusions62of the first ratchet member51and the protrusions32dof the first rotating body32. In this way, torque applied from the second rotating body34is transferred from the first ratchet member51to the first rotating body32via the second ratchet member52. The first ratchet member51is sandwiched between the abutment34cof the second rotating body34and the second ratchet member52. Here, the axial spacer58is disposed between the first ratchet member51and the abutment34cof the second rotating body34. In this way, movement of the first ratchet member51in the first axial direction A1is restricted.", "", "Referring toFIGS.6and7, the second ratchet member52will now be discussed in more detail. The second ratchet member52is an annular member that is concentrically disposed around the hub axle30. The second ratchet member52has at least one second ratchet tooth64mating with the at least one first ratchet tooth60. The at least one second ratchet tooth64is disposed on a second axially facing surface65of the second ratchet member52that faces the first axially facing surface61of the first ratchet member51. Here, the second ratchet member52includes a plurality of second ratchet teeth64. The second ratchet teeth64are formed on the second axially facing surface65that axially faces the first ratchet member51. The second ratchet teeth64are configured to engage the first ratchet teeth60as seen inFIG.12so that the first ratchet member51and the second ratchet member52can rotate together in the driving rotational direction D1. Moreover, the second ratchet teeth64are configured to be able to be disengaged from the first ratchet teeth60as seen inFIG.13so that the first ratchet member51and the second ratchet member52can rotate relative to each other in the circumferential direction CD.", "", "The second ratchet member52is movably supported on the second rotating body34via the first helical spline34b. However, the second ratchet member52is configured to rotate with the second rotating body34as the second rotating body34rotates in the driving rotational direction D1. On the other hand, the second ratchet member52is configured to move both axially and circumferentially with respect to the second rotating body34for limited range of movement as the second rotating body34rotates in the non-driving direction D2with respect to the first rotating body32. In particular, the second ratchet member52has a second helical spline66mating with the first helical spline34b. The second ratchet member52is movably mounted in an axial direction with respect to the second rotating body34via the second helical spline66in engagement with the first helical spline34bwhile the second ratchet member52is being driven by a thrust force that is applied from the first rotating body32via the slider53. Here, the second ratchet member52includes a plurality of the second helical splines66. The second helical splines66are helically arranged with respect to the center axis CA. The second helical splines66mates with the first helical spline34bof the second rotating body34to allow a limited range of movement in the axial direction and the circumferential direction CD. In this way, the second ratchet member52is movably mounted in the first axial direction A1or the second axial direction A2with respect to the second rotating body34via the second helical splines66engaging the first helical spline34b. Here, the second ratchet member52includes a plurality of the second helical splines66.", "", "The second ratchet member52has an axially facing surface67and a radially facing surface68. The axially facing surface67and the radially facing surface68are preferably annular surfaces that are concentrically disposed around the hub axle30. The axially facing surface67and the radially facing surface68are configured to slidably contact the slider53as discussed below.", "", "Referring toFIGS.8to13, the slider53will now be discussed in more detail. The slider53is coupled to the first rotating body32for allowing a limited range of movement of the slider53in the axial direction and the circumferential direction CD. On the other hand, the slider53is configured to be allowed circumferential sliding of the slider53with respect to the second rotating body34and the second ratchet member52in a state where the second rotating body34and the second ratchet member52are rotating in the non-driving direction D2with respect to the first rotating body32. Basically, the slider53includes a first slider part71and a second slider part72. Here, the slider53further includes a third slider part73. The first slider part71, the second slider part72and the third slider part73are each annular members. The first slider part71, the second slider part72and the third slider part73are non-movably coupled together. Thus, here, the first slider part71is non-movably fixed to the second slider part72. Also, here, the third slider part73is non-rotatably coupled to the first slider part71and the second slider part72. Accordingly, the first slider part71, the second slider part72and the third slider part73are non-movably fixed together as a unit. Here, the first slider part71and the third slider part73are snap-fitted together. The second slider part72is sandwiched between the first slider part71and the third slider part73.", "", "The slider53has a first contact surface74in sliding contact with an axially facing surface of one of the first ratchet member51and the second ratchet member52coupled to the second rotating body34. Here, the first slider part71includes the first contact surface74. Also, here, the first contact surface74is sliding contact with the axially facing surface67of the second ratchet member52. The slider53has a second contact surface76in sliding contact with a radially facing surface of the one of the first ratchet member51and the second ratchet member52coupled to the second rotating body34. Here, the second slider part72includes the second contact surface76. Also, here, the second contact surface76is sliding contact with the radially facing surface68of the second ratchet member52. The first contact surface74and the second contact surface76are annular surfaces arranged around the center axis CA. The first contact surface74is spaced from the center axis CA by a first radial distance X1. On the other hand, the second contact surface76is spaced from the center axis CA by a second radial distance X2. The second radial distance X2is equal to or less than the first radial distance X1. Here, the second radial distance X2is less than the first radial distance X1. In the case where the first contact surface74is in surface contact with the axial facing surface67, the first contact surface74has a radial width. Thus, the first radial distance X1corresponds to a radial center position of the first contact surface74from the center axis CA or a shortest distance from the center axis CA. In the drawings, the first radial distance X1is indicated as the shortest distance from the center axis CA. However, the first radial distance X1can be the distance between the radial center position of the first contact surface74and the center axis CA.", "", "The first contact surface74and the second contact surface76have different coefficients of friction. Here, the first contact surface74is a different material than the second contact surface76. For example, in the first embodiment, the first slider part71includes a resin material. For example, in the first embodiment, the second slider part72includes an elastomeric material. In particular, in the first embodiment, the second slider part72includes a support portion78and a contact portion80. The support portion78is made of a generally rigid material such as a metallic material or a resin material. Here, the support portion78is a metal ring and the contact portion80is elastomeric material that at least partially covers the support portion78. Thus, the contact portion80includes the second contact surface76. The third slider part73is made of a material with which the torque of the first rotating body32can be effectively transmitted to the third slider part73so that the slider53can rotate with the first rotating body32. For example, in the first embodiment, the third slider part73includes a resin material. Thus, in the first embodiment, the third slider part73includes a different material from the second slider part72.", "", "Referring toFIGS.15to19, the slider53has a first anti-rotation portion82mating with a second anti-rotation portion32eof the first rotating body32. The first anti-rotation portion82and the second anti-rotation portion32eare configured to mate together so as to allow axial movement of the slider53relative to the first rotating body32in an axial direction with respect to the center axis CA. The at least one first ratchet tooth60and the at least one second ratchet tooth64are changed from disengaged (FIG.13) to engaged (FIG.12) while the slider53rotates with the second ratchet member52with respect to the first ratchet member51in the circumferential direction CD with respect to the center axis CA. The hub10is configured such that the first ratchet member51and the second ratchet member52are spaced apart in the axial direction with respect to the center axis CA during coasting. Therefore, a noise during coasting is reduced. The at least one first ratchet tooth60and the at least one second ratchet tooth64are configured to be changed from disengaged to engaged so as at least one tip of the least one first ratchet tooth60and at least one tip of the least one second ratchet tooth64approach each other in the axial direction with respect to the center axis CA while the first ratchet member51and the second ratchet member52rotate relative to each other in the circumferential direction CD with respect to the center axis CA.", "", "The first anti-rotation portion82includes at least one first circumferentially-facing surface82a. Here, the first anti-rotation portion82includes a plurality of the first circumferentially-facing surface82a. For example, the first anti-rotation portion82has a plurality of projections, each of which has at least one first circumferentially-facing surface82a. In particular, the first anti-rotation portion82includes three of the first circumferentially-facing surface82a. The first circumferentially-facing surface82aare equally spaced apart around the center axis CA. The second anti-rotation portion32eincludes at least one second circumferentially-facing surface32e1that abuts the at least one first circumferentially-facing surface82ain the circumferential direction CD with respect to the center axis CA. Here, the second anti-rotation portion32eincludes a plurality of the second circumferentially-facing surface32e1. For example, the second anti-rotation portion32ehas a plurality of recesses, each of which has at least one second circumferentially-facing surface32e1. In particular, the second anti-rotation portion32eincludes three of the second circumferentially-facing surface32e1. The second circumferentially-facing surface32e1are equally spaced apart around the center axis CA. At least one of the at least one first circumferentially-facing surface82aand the at least one second circumferentially-facing surface32e1includes an inclined surface inclined relative to the axial direction with respect to the center axis CA. Here, the at least one second circumferentially-facing surface32e1includes an inclined surface. In particular, each of the second circumferentially-facing surface32e1includes an inclined surface.", "", "One of the first anti-rotation portion82and the second anti-rotation portion32eincludes at least one convex portion and the other of the first anti-rotation portion82and the second anti-rotation portion32eincludes at least one concave portion. Here, the first anti-rotation portion82of the slider53includes the at least one convex portion82band the second anti-rotation portion32eof the first rotating body32includes the at least one concave portion32e2. In particular, the first anti-rotation portion82of the slider53has three convex portions82b, and the second anti-rotation portion32eof the first rotating body32has three concave portions32e2. Each of the three convex portions82bforms one of the first circumferentially-facing surfaces82a. Each of the concave portion32e2forms one of the circumferentially-facing surface32e1. Here, the second anti-rotation portion32ehas a convex portion32e3that is located between the concave portions32e2.", "", "In a case where the first ratchet tooth60and the second ratchet tooth64are engaged, the driving force inputted to the second rotating body34is transmitted to the first rotating body32via the second ratchet member52and the first ratchet member51. Thus, when the second rotating body34is rotated in the driving rotational direction D1by the chain16, a torque is transmitted from the second rotating body34to the first rotating body32via the first ratchet member51and the second ratchet member52. In this case, the first rotating body32, the second rotating body34, the first ratchet member51, the second ratchet member52and the slider53all rotate together.", "", "On the other hand, when the second rotating body34is rotated in the non-driving direction D2relative to the first rotating body32such as during coasting or a rider pedaling backwards, the second ratchet member52moves in the second axial direction A2away from the first ratchet member51against the force of the biasing member54. Once the second ratchet member52is disengaged from the first ratchet member51, the first rotating body32and the slider53rotate together. In other words, in a case where the engagement between the first ratchet tooth60and the second ratchet tooth64is disengaged (e.g., a coasting state or a rider pedaling backwards), the first rotating body32rotates and drives the slider53in the driving rotational direction D1. In this way, a rotational force is transmitted from first rotating body32to the slider53. In particular, the rotational force transmitted from the first rotating body32to the slider53is transmitted from the second circumferentially-facing surfaces32e1of the first rotating body32to the first circumferentially-facing surfaces82aof the slider53. A sliding frictional force is then generated between the slider53and the second ratchet member52.", "", "In a case where the rider starts to pedal after coasting, the frictional force between the slider53and the second ratchet member52becomes smaller. Thus, in this case, since the frictional force between the slider53and the second ratchet member52is reduced, the force with which the second helical spline66is pressed against the first helical spline34bis reduced. The second ratchet member52approaches the first ratchet member51due to the spring force of the biasing member54. Even in this case, the rotational force of the slider53is transmitted from the first rotating body32. That is, the rotational force of the slider53is transmitted from the second circumferentially-facing surfaces32e1of the first rotating body32to the first circumferentially-facing surfaces82aof the slider53. Due to the inclined surface of the circumferentially-facing surface32e1of the first rotating body32, the slider53moves in the first axial direction A1and rotates in the non-driving rotational direction D2respect to the first rotating body32as the first ratchet teeth60and the second ratchet teeth64are changed from disengaged (FIG.13) to engaged (FIG.12). After that, when the second ratchet teeth64engage with the first ratchet teeth60, the rotational force of the slider53is transmitted from the second ratchet member52.", "", "Referring now toFIG.20, a hub110is illustrated in accordance with a second embodiment. In view of the similarity between the first and second embodiments, the parts of the second embodiment that are identical to the parts of the first embodiment will be given the same reference numerals as the parts of the first embodiment. Moreover, the descriptions of the parts of the second embodiment that are identical to the parts of the first embodiment may be omitted for the sake of brevity.", "", "Here, the hub110is identical to the hub10, except that the first rotating body32has been replaced with a first rotating body132, the slider53has been replaced with a slider153, and the biasing member54has been replaced with a biasing member154. Thus, the following description of the hub110will focus on the first rotating body132, the slider153and the biasing member154.", "", "In the second embodiment, similar to the first embodiment, the first rotating body132has a center tubular body132aand a pair of spoke attachment flanges132c(only one shown) extending outwardly in a radial direction from the center tubular body132a. Also, similar to the first embodiment, the first rotating body132has a plurality of protrusions132dfor engaging the protrusions62of the first ratchet member51via the prongs of the circumferential spacer56. The first rotating body132differs from the first rotating body32in that the first rotating body132has a second anti-rotation portion132ethat is located radially outward as compared the first rotating body32e. The second anti-rotation portion132eare identical in configuration to the first rotating body32e, except for the location of the second anti-rotation portion132eas mentioned above.", "", "In the second embodiment, similar to the first embodiment, the slider153includes a first slider part171, a second slider part172and a third slider part173. Also, similar to the first embodiment, the first slider part171has a first contact surface174in sliding contact with an axially facing surface of the first ratchet member51, and the second slider part172includes a second contact surface176in sliding contact with the radially facing surface68of the second ratchet member52. Here, the second slider part172is identical to the second slider part72discussed above. The first slider part171has the same configuration as the first slider part71, except that the first slider part171has been modified so that the first contact surface174is spaced from the center axis CA by the first radial distance X1and the first radial distance X1is equal to the second radial distance X2. The third slider part173has the same configuration as the third slider part73, except that the third slider part173has been modified so that the coils of the biasing member154at least partially aligned with the first contact surface174as viewed in the axial direction.", "", "In the second embodiment, similar to the first embodiment, the biasing member154is configured to bias the slider153and the second ratchet member52towards the first ratchet member51. The biasing member154only differs from the biasing member54in that the outer diameter of the biasing member154is smaller than the outer diameter of the biasing member54.", "", "In understanding the scope of the present invention, the term “comprising” and its derivatives, as used herein, are intended to be open ended terms that specify the presence of the stated features, elements, components, groups, integers, and/or steps, but do not exclude the presence of other unstated features, elements, components, groups, integers and/or steps. The foregoing also applies to words having similar meanings such as the terms, “including”, “having” and their derivatives. Also, the terms “part,” “section,” “portion,” “member” or “element” when used in the singular can have the dual meaning of a single part or a plurality of parts unless otherwise stated.", "", "As used herein, the following directional terms “frame facing side”, “non-frame facing side”, “forward”, “rearward”, “front”, “rear”, “up”, “down”, “above”, “below”, “upward”, “downward”, “top”, “bottom”, “side”, “vertical”, “horizontal”, “perpendicular” and “transverse” as well as any other similar directional terms refer to those directions of a human-powered vehicle (e.g., bicycle) in an upright, riding position and equipped with the hub. Accordingly, these directional terms, as utilized to describe the hub should be interpreted relative to a human-powered vehicle (e.g., bicycle) in an upright riding position on a horizontal surface and that is equipped with the hub. The terms “left” and “right” are used to indicate the “right” when referencing from the right side as viewed from the rear of the human-powered vehicle (e.g., bicycle), and the “left” when referencing from the left side as viewed from the rear of the human-powered vehicle (e.g., bicycle).", "", "The phrase “at least one of” as used in this disclosure means “one or more” of a desired choice. For one example, the phrase “at least one of” as used in this disclosure means “only one single choice” or “both of two choices” if the number of its choices is two. For another example, the phrase “at least one of” as used in this disclosure means “only one single choice” or “any combination of equal to or more than two choices” if the number of its choices is equal to or more than three. Also, the term “and/or” as used in this disclosure means “either one or both of”. For instance, the phrase “at least one of A and B” encompasses (1) A alone, (2), B alone, and (3) both A and B. The phrase “at least one of A, B, and C” encompasses (1) A alone, (2), B alone, (3) C alone, (4) both A and B, (5) both B and C, (6) both A and C, and (7) all A, B, and C. In other words, the phrase “at least one of A and B” does not mean “at least one of A and at least one of B” in this disclosure.", "", "Also, it will be understood that although the terms “first” and “second” may be used herein to describe various components, these components should not be limited by these terms. These terms are only used to distinguish one component from another. Thus, for example, a first component discussed above could be termed a second component and vice versa without departing from the teachings of the present invention.", "", "The term “attached” or “attaching”, as used herein, encompasses configurations in which an element is directly secured to another element by affixing the element directly to the other element; configurations in which the element is indirectly secured to the other element by affixing the element to the intermediate member(s) which in turn are affixed to the other element; and configurations in which one element is integral with another element, i.e. one element is essentially part of the other element. This definition also applies to words of similar meaning, for example, “joined”, “connected”, “coupled”, “mounted”, “bonded”, “fixed” and their derivatives. Finally, terms of degree such as “substantially”, “about” and “approximately” as used herein mean an amount of deviation of the modified term such that the end result is not significantly changed.", "", "While only selected embodiments have been chosen to illustrate the present invention, it will be apparent to those skilled in the art from this disclosure that various changes and modifications can be made herein without departing from the scope of the invention as defined in the appended claims. For example, unless specifically stated otherwise, the size, shape, location or orientation of the various components can be changed as needed and/or desired so long as the changes do not substantially affect their intended function. Unless specifically stated otherwise, components that are shown directly connected or contacting each other can have intermediate structures disposed between them so long as the changes do not substantially affect their intended function. The functions of one element can be performed by two, and vice versa unless specifically stated otherwise. The structures and functions of one embodiment can be adopted in another embodiment. It is not necessary for all advantages to be present in a particular embodiment at the same time. Every feature which is unique from the prior art, alone or in combination with other features, also should be considered a separate description of further inventions by the applicant, including the structural and/or functional concepts embodied by such feature(s). Thus, the foregoing descriptions of the embodiments according to the present invention are provided for illustration only, and not for the purpose of limiting the invention as defined by the appended claims and their equivalents."], "claims": ["a hub axle defining a center axis; a first rotating body rotatably mounted on the hub axle to rotate around the center axis; a second rotating body rotatably mounted on the hub axle to rotate around the center axis; a first ratchet member having at least one first ratchet tooth, the first ratchet member being coupled to the first rotating body to rotate with the first rotating body; a second ratchet member having at least one second ratchet tooth mating with the at least one first ratchet tooth, the second ratchet member being coupled to the second rotating body to rotate with the second rotating body; and a slider configured to rotate with the first rotating body and to slide with respect to the second rotating body in a circumferential direction with respect to the center axis, the slider having a first contact surface in sliding contact with an axially facing surface of one of the first ratchet member and the second ratchet member coupled to the second rotating body, the slider having a second contact surface in sliding contact with a radially facing surface of the one of the first ratchet member and the second ratchet member coupled to the second rotating body, the first contact surface is a different material than the second contact surface.", "a hub axle defining a center axis; a first rotating body rotatably mounted on the hub axle to rotate around the center axis; a second rotating body rotatably mounted on the hub axle to rotate around the center axis; a first ratchet member having at least one first ratchet tooth, the first ratchet member being coupled to the first rotating body to rotate with the first rotating body; a second ratchet member having at least one second ratchet tooth mating with the at least one first ratchet tooth, the second ratchet member being coupled to the second rotating body to rotate with the second rotating body; and a slider configured to rotate with the first rotating body and to slide with respect to the second rotating body in a circumferential direction with respect to the center axis, the slider having a first contact surface in sliding contact with an axially facing surface of one of the first ratchet member and the second ratchet member coupled to the second rotating body, the slider having a second contact surface in sliding contact with a radially facing surface of the one of the first ratchet member and the second ratchet member coupled to the second rotating body, the slider including a first slider part including the first contact surface and a second slider part including the second contact surface, the first slider part is non-movably fixed to the second slider part.", "a hub axle defining a center axis; a first rotating body rotatably mounted on the hub axle to rotate around the center axis; a second rotating body rotatably mounted on the hub axle to rotate around the center axis; a first ratchet member having at least one first ratchet tooth, the first ratchet member being coupled to the first rotating body to rotate with the first rotating body; a second ratchet member having at least one second ratchet tooth mating with the at least one first ratchet tooth, the second ratchet member being coupled to the second rotating body to rotate with the second rotating body; and a slider configured to rotate the first rotating body and to slide with respect to the second rotating body in a circumferential direction with respect to the center axis, the slider having a first contact surface in sliding contact with an axially facing surface of one of the first ratchet member and the second ratchet member coupled to the second rotating body, the slider having a second contact surface in sliding contact with a radially facing surface of the one of the first ratchet member and the second ratchet member coupled to the second rotating body, the first contact surface being spaced from the center axis by a first radial distance, the second contact surface being spaced from the center axis by a second radial distance, the second radial distance being equal to or less than the first radial distance.", "the slider has a first anti-rotation portion mating with a second anti-rotation portion of the first rotating body, the first anti-rotation portion and the second anti-rotation portion are configured to mate together so as to allow axial movement of the slider relative to the first rotating body in an axial direction with respect to the center axis, the at least one first ratchet tooth and the at least one second ratchet tooth are changed from disengaged to engaged while the slider rotates with the second ratchet member with respect to the first ratchet member in a circumferential direction with respect to the center axis.", "the slider has a first anti-rotation portion mating with a second anti-rotation portion of the first rotating body, the first anti-rotation portion including at least one first circumferentially-facing surface, the second anti-rotation portion including at least one second circumferentially-facing surface that abuts the at least one first circumferentially-facing surface in the circumferential direction with respect to the center axis, at least one of the at least one first circumferentially-facing surface and the at least one second circumferentially-facing surface including an inclined surface inclined relative to the axial direction with respect to the center axis.", "the first contact surface includes a resin material.", "the second contact surface includes an elastomeric material.", "the first contact surface and the second contact surface are annular surfaces arranged around the center axis.", "the slider includes a first slider part including the first contact surface, a second slider part including the second contact surface, and a third slider part non-rotatably coupled to the first slider part and the second slider part.", "the third slider part includes a different material from the second slider part.", "the first slider part includes a resin material, the second slider part includes an elastomeric material, and the third slider part includes a resin material.", "a hub axle defining a center axis; a first rotating body rotatably mounted on the hub axle to rotate around the center axis; a second rotating body rotatably mounted on the hub axle to rotate around the center axis; a first ratchet member having at least one first ratchet tooth, the first ratchet member being coupled to the first rotating body to rotate with the first rotating body; a second ratchet member having at least one second ratchet tooth mating with the at least one first ratchet tooth, the second ratchet member being coupled to the second rotating body to rotate with the second rotating body; and a slider configured to rotate with the first rotating body and to slide with respect to the second rotating body in a circumferential direction with respect to the center axis, the slider having a first anti-rotation portion mating with a second anti-rotation portion of the first rotating body, the first anti-rotation portion including at least one first circumferentially-facing surface, the second anti-rotation portion including at least one second circumferentially-facing surface that abuts the at least one first circumferentially-facing surface in a circumferential direction with respect to the center axis, at least one of the at least one first circumferentially-facing surface and the at least one second circumferentially-facing surface including an inclined surface inclined relative to an axial direction with respect to the center axis.", "one of the first anti-rotation portion and the second anti-rotation portion includes at least one convex portion and the other of the first anti-rotation portion and the second anti-rotation portion includes at least one concave portion.", "the slider has a first anti-rotation portion mating with a second anti-rotation portion of the first rotating body, the first anti-rotation portion and the second anti-rotation portion is configured to mate together so as to allow axial movement of the slider relative to the first rotating body in an axial direction with respect to the center axis, and the at least one first ratchet tooth and the at least one second ratchet tooth are changed from disengaged to engaged while the slider rotates with the second ratchet member with respect to the first ratchet member in the circumferential direction with respect to the center axis.", "a biasing member disposed between the first rotating body and the slider, the biasing member biasing the second ratchet member via the slider in the axial direction with respect to the center axis towards engagement with the first ratchet member.", "a hub axle defining a center axis; a first rotating body rotatably mounted on the hub axle to rotate around the center axis; a second rotating body rotatably mounted on the hub axle to rotate around the center axis; a first ratchet member having at least one first ratchet tooth, the first ratchet member being coupled to the first rotating body to rotate with the first rotating body; and a second ratchet member having at least one second ratchet tooth mating with the at least one first ratchet tooth, the second ratchet member being coupled to the second rotating body to rotate with the second rotating body, the at least one first ratchet tooth and the at least one second ratchet tooth being configured to be changed from disengaged to engaged so as at least one tip of the at least one first ratchet tooth and at least one tip of the at least one second ratchet tooth approach each other in an axial direction with respect to the center axis while the first ratchet member and the second ratchet member rotate relative to each other in a circumferential direction with respect to the center axis.", "the at least one first ratchet tooth is disposed on a first axially facing surface of the first ratchet member, and the at least one second ratchet tooth is disposed on a second axially facing surface of the second ratchet member that faces the first axially facing surface of the first ratchet member.", "the first and second ratchet members are annular members arranged around the center axis.", "the second rotating body has a first helical spline disposed on an outer peripheral surface of the second rotating body, and the second ratchet member has a second helical spline mating with the first helical spline, the second ratchet member is movably mounted in an axial direction with respect to the second rotating body via the second helical spline in engagement with the first helical spline while the second ratchet member is being driven by a thrust force that is applied from the second rotating body.", "the second rotating body is coupled to the first rotating body to rotate together in a driving rotational direction around the center axis, and the second rotating body is configured to rotate relative to the first rotating body in a non-driving rotational direction around the center axis.", "the first rotating body includes a hub body and the second rotating body includes a sprocket support body."], "bibtex": "@patent{20240253393,\n    title = {HUB FOR HUMAN-POWERED VEHICLE},\n    number = {20240253393},\n    year = {2024},\n    note = {File: US20240253393A1-20240801.XML}\n    }", "classification": "B60B2702FI"}, {"title": "RUBBER COMPOSITION FOR TIRE, TREAD RUBBER, AND TIRE", "doc_number": "20240253394", "filename": "US20240253394A1-20240801.XML", "abstract": "Provided is a rubber composition for tire capable of highly balancing wet grip performance with fuel efficiency and wear resistance in a tire. The present disclosure provides a rubber composition containing a rubber component and a filler containing at least silica, where the rubber component contains a styrene-butadiene rubber (A) having a glass transition temperature of −50° C. or lower, which is obtained by modifying a compound represented by the formula (1) with a modifying agent, and an unmodified styrene-butadiene rubber (B) whose glass transition temperature is 30° C. or more higher than that of the styrene-butadiene rubber (A).", "detailed_description": ["The following describes the rubber composition for tire, the tread rubber, and the tire of the present disclosure in detail based on their embodiments."], "claims": ["the rubber component comprises a styrene-butadiene rubber (A) having a glass transition temperature of −50° ° C. or lower, which is obtained by modifying a compound represented by the formula (1) with a modifying agent, and an unmodified styrene-butadiene rubber (B) whose glass transition temperature is 30° C. or more higher than that of the styrene-butadiene rubber (A), where in the formula, R", "2 . The rubber composition for tire according to claim 1 , wherein a content ratio of the styrene-butadiene rubber (A) in the rubber component is 15% by mass to 60% by mass.", "3 . The rubber composition for tire according to claim 1 , wherein a content ratio of the styrene-butadiene rubber (B) in the rubber component is 30% by mass to 90% by mass.", "4 . The rubber composition for tire according to claim 1 , further comprising a resin in an amount of 1 part by mass to 50 parts by mass with respect to 100 parts by mass of the rubber component.", "a content ratio of silica in the total amount of the silica and the carbon black is 50% by mass or more and less than 100% by mass.", "6 . The rubber composition for tire according to claim 1 , wherein the modifying agent is any one of the formulas (1-1) to (1-5)", "in the formula (2), R in the formula (2a), R in the formula (2b), R", "8 . A tread rubber, comprising the rubber composition for tire according to claim 1 .", "9 . A tire, comprising the tread rubber according to claim 8 .", "10 . The rubber composition for tire according to claim 2 , wherein a content ratio of the styrene-butadiene rubber (B) in the rubber component is 30% by mass to 90% by mass.", "11 . The rubber composition for tire according to claim 2 , further comprising a resin in an amount of 1 part by mass to 50 parts by mass with respect to 100 parts by mass of the rubber component.", "a content ratio of silica in the total amount of the silica and the carbon black is 50% by mass or more and less than 100% by mass.", "13 . The rubber composition for tire according to claim 2 , wherein the modifying agent is any one of the formulas (1-1) to (1-5)", "in the formula (2), R in the formula (2a), R in the formula (2b), R", "15 . The rubber composition for tire according to claim 3 , further comprising a resin in an amount of 1 part by mass to 50 parts by mass with respect to 100 parts by mass of the rubber component.", "a content ratio of silica in the total amount of the silica and the carbon black is 50% by mass or more and less than 100% by mass.", "17 . The rubber composition for tire according to claim 3 , wherein the modifying agent is any one of the formulas (1-1) to (1-5)", "in the formula (2), R in the formula (2a), R in the formula (2b), R", "a content ratio of silica in the total amount of the silica and the carbon black is 50% by mass or more and less than 100% by mass.", "20 . The rubber composition for tire according to claim 4 , wherein the modifying agent is any one of the formulas (1-1) to (1-5)."], "bibtex": "@patent{20240253394,\n    title = {RUBBER COMPOSITION FOR TIRE, TREAD RUBBER, AND TIRE},\n    number = {20240253394},\n    year = {2024},\n    note = {File: US20240253394A1-20240801.XML}\n    }", "classification": "B60C100FI"}, {"title": "HIGH-PERFORMANCE TYRE", "doc_number": "20240253395", "filename": "US20240253395A1-20240801.XML", "abstract": "The present invention relates to a high-performance tyre for vehicle wheels comprising a tread made with a vulcanised elastomeric compound obtained by vulcanising a vulcanisable elastomeric compound comprising (i) a composition of elastomeric polymers consisting of at least one high Tg styrene-butadiene polymer (SBR) and optionally at least one low Tg isoprene (IR) polymer and (ii) a resin mixture consisting of at least one low Tr resin, at least one high Tr resin, and optionally at least one resin with intermediate Tr.", "detailed_description": ["The present invention will be illustrated in further detail by means of an illustrative embodiment with reference to the accompanyingFIG.1, where “a” indicates an axial direction and “r” indicates a radial direction. For simplicity,FIG.1shows only a part of the tyre, the remaining part not shown being identical and disposed symmetrically with respect to the radial direction “r”.", "", "The reference numeral100indicates inFIG.1a tyre for vehicle wheels, which generally comprises a carcass structure101having respectively opposite end flaps engaged with respective annular anchoring structures102, called bead cores, possibly associated with a bead filler104. The tyre area comprising the bead core102and the filler104forms a bead structure103intended for anchoring the tyre onto a corresponding mounting rim, not shown. Each bead structure103is associated to the carcass structure by folding back of the opposite lateral edges of the at least one carcass layer101around the bead core102so as to form the so-called carcass flaps101aas shown inFIG.1.", "", "The carcass structure101is possibly associated with a belt structure106comprising one or more belt layers106a,106bplaced in radial superposition with respect to one another and with respect to the carcass structure101, having reinforcing cords typically made of metal. Such reinforcing cords may have crossed orientation with respect to a circumferential extension direction of the tyre100. By “circumferential” direction we mean a direction generally facing according to the direction of rotation of the tyre, or in any case not very inclined with respect to the direction of rotation of the tyre.", "", "The belt structure106further comprises at least one radially external reinforcing layer106cwith respect to the belt layers106a,106b. The radially external reinforcing layer106ccomprises textile or metal cords, disposed according to a substantially zero angle with respect to the circumferential extension direction of the tyre and immersed in the elastomeric material. Preferably, the cords are disposed substantially parallel and side by side to form a plurality of turns. Such turns are substantially oriented according to the circumferential direction (typically with an angle of between 0° and 5°), such direction being usually called “zero degrees” with reference to the laying thereof with respect to the equatorial plane X-X of the tyre. By “equatorial plane” of the tyre it is meant a plane perpendicular to the axis of rotation of the tyre and which divides the tyre into two symmetrically equal parts.", "", "In a radially external position with respect to the carcass structure101and/or if present (as in the illustrated case) to the belt structure106a tread band109in vulcanised elastomeric compound obtained by vulcanisation of the vulcanisable elastomeric compound according to the present invention is applied.", "", "In a radially external position, the tread band109has a rolling portion109aintended to come into contact with the ground. Circumferential grooves, which are connected by transverse notches (not shown inFIG.1) so as to define a plurality of blocks of various shapes and sizes distributed in the rolling portion109a, are generally made in this portion109a, which for simplicity is represented smooth inFIG.1.", "", "To optimise the performance of the tread, the tread band may be made in a two-layer structure.", "", "Such two-layer structure comprises the rolling layer or portion109a(called cap) and a substrate111(called base) forming the so-called cap-and-base structure. It is thus possible to use an elastomeric material capable of providing a low rolling resistance for the cap109aand at the same time high resistance to wear and to the formation of cracks while the elastomeric material of the substrate111may be particularly aimed at a low hysteresis to cooperate in reducing rolling resistance. One or both layers of the cap-and-base structure may be made with a vulcanised elastomeric compound obtained by vulcanising the vulcanisable elastomeric compound according to the present invention. The under-layer111of vulcanised elastomeric compound may be disposed between the belt structure106and the rolling portion109a.", "", "Moreover, respective sidewalls108of vulcanised elastomeric compound are further applied in an axially external position to said carcass structure101, each extending from one of the lateral edges of the tread band109up to the respective bead structure103.", "", "A strip consisting of elastomeric compound110, commonly known as “mini-sidewall”, of vulcanised elastomeric compound may optionally be provided in the connecting zone between sidewalls108and the tread band109, this mini-sidewall generally being obtained by co-extrusion with the tread band109and allowing an improvement of the mechanical interaction between the tread band109and the sidewalls108. Preferably, the end portion of sidewall108directly covers the lateral edge of the tread band109.", "", "In some specific embodiments, such as the one illustrated and described herein, the stiffness of the bead103may be improved by providing a reinforcing layer120generally known as a “flipper” in the tyre bead.", "", "The flipper120is wrapped around the respective bead core102and the bead filler104so as to at least partially surround them. The flipper120is disposed between the carcass layer101and the bead structure103. Usually, the flipper120is in contact with the carcass layer101and said bead structure103. The flipper120typically comprises a plurality of metal or textile cords incorporated in a vulcanised elastomeric compound.", "", "In some specific embodiments, such as the one illustrated and described herein, the bead structure103may further comprise a further protective layer121which is generally known by the term of “chafer”, or protective strip, and which has the function to increase the rigidity and integrity of the bead structure103.", "", "The chafer121usually comprises a plurality of cords incorporated in a vulcanised elastomeric compound; such cords are generally made of textile material (for example aramid or rayon), or of metallic material (for example steel cords).", "", "Optionally, an anti-abrasive strip105is disposed so as to wrap the bead structure103along the axially internal and external and radially internal areas of the bead structure103, thus interposing itself between the latter and the wheel rim when the tyre100is mounted on the rim.", "", "Moreover, a radially internal surface of tyre100is preferably internally lined by a layer of substantially airtight elastomeric material, or so-called liner112.", "", "Preferably but non-exclusively, the tyre100for motor vehicles is of the HP (High-Performance) or UHP (Ultra High-Performance) type, i.e. it is a tyre capable of withstanding maximum speeds of at least 190 Km/h, up to over 300 Km/h. Examples of such tyres are those belonging to the classes “T”, “U”, “H”, “V”, “Z”, “W”, “Y”.", "", "According to an embodiment not shown, the tyre may be a tyre for motorcycle wheels. The profile of the straight section of the tyre for motorcycle (not shown) has a high transversal curvature since it must guarantee a sufficient footprint area in all the inclination conditions of the motorcycle. The transverse curvature is defined by the value of the ratio between the distance f of the ridge of the tread from the line passing through the laterally opposite ends of the tread itself, measured on the equatorial plane of the tyre, and the width C defined by the distance between the laterally opposite ends of the tread itself. A tyre with high transverse curvature indicates a tyre whose transverse curvature ratio (f/C) is at least 0.20.", "", "The building of the tyre100as described above is carried out by assembling respective semi-finished products onto a forming drum, not shown, by at least one assembly device.", "", "At least a part of the components intended to form the carcass structure101of the tyre100is built and/or assembled on the forming drum. More particularly, the forming drum is intended to first receive the possible liner112, and then the carcass ply101. Thereafter, devices non shown coaxially engage one of the annular anchoring structures102around each of the end flaps, position an external sleeve comprising the belt structure106and the tread band109in a coaxially centred position around the cylindrical carcass sleeve and shape the carcass sleeve according to a toroidal configuration through a radial expansion of the carcass ply101, so as to cause the application thereof against a radially internal surface of the external sleeve.", "", "After building of the green tyre100, a moulding and vulcanisation treatment is generally carried out in order to determine the structural stabilisation of the tyre100through vulcanisation of the elastomeric compounds, as well as to impart a desired tread pattern on the tread band109and to impart any distinguishing graphic signs at the sidewalls108.", "", "The present invention will be further illustrated below by means of a number of preparatory examples, which are provided for indicative purposes only and without any limitation of the present invention."], "claims": ["1 - 10 . (canceled)", "a carcass structure with opposite side edges associated with respective bead structures; optionally, a belt structure applied in a radially external position with respect to the carcass structure; a tread band applied in a radially external position with respect to the carcass structure, the belt structure, or both; wherein the tread band comprises a vulcanised elastomeric compound comprising, before vulcanization, a vulcanisable elastomeric compound comprising, before mixing, an elastomeric composition, wherein the elastomeric composition comprises: (i) 100 phr of an elastomeric polymer composition comprising: a. at least one styrene-butadiene polymer (SBR) having a Tg ranging from −45° C. to −15° C. in an amount ranging from 40 phr to 100 phr, and b. from 0 phr to 30 phr of at least one isoprene polymer (IR) having a Tg ranging from −80° C. to −50° C., (ii) from 15 phr to 50 phr of a resin mixture comprising: a. at least one resin with a softening temperature lower than 50° C. in an amount ranging from 5 phr to 45 phr, b. at least one resin with a softening temperature higher than 110° C. in an amount ranging from 5 phr to 45 phr, and (iii) from 1 phr to 130 phr of at least one reinforcing filler; and (iv) from 0.1 phr to 12 phr of at least one vulcanising agent.", "12 . The tyre for vehicle wheels according to claim 11 , wherein the at least one styrene-butadiene polymer has a Tg ranging from −40° C. to −25° C.", "13 . The tyre for vehicle wheels according to claim 11 , wherein the at least one isoprene polymer has a Tg ranging from −70° C. to −60° C.", "14 . The tyre for vehicle wheels according to claim 11 , wherein the at least one styrene-butadiene polymer comprises a weight percentage of styrene ranging from 10% to 55%, and a weight percentage of vinyl (relative to butadiene) ranging from 10% to 70%.", "15 . The tyre for vehicle wheels according to claim 11 , wherein the elastomeric polymer composition comprises at least one styrene-butadiene polymer prepared by emulsion polymerisation (E-SBR), optionally functionalised, and at least one styrene-butadiene polymer prepared by solution polymerisation (S-SBR), optionally functionalised.", "16 . The tyre for vehicle wheels according to claim 15 , wherein the E-SBR polymer comprises a weight percentage of styrene ranging from 20% to 45% and a weight percentage of vinyl (relative to butadiene) ranging from 10% to 20%.", "17 . The tyre for vehicle wheels according to claim 15 , wherein the S-SBR polymer comprises a weight percentage of styrene ranging from 20% to 45% and a weight percentage of vinyl (relative to butadiene) ranging from 15% to 65%.", "a. at least one resin with a softening temperature lower than 50° C. in an amount ranging from 5 phr to 15 phr, b. at least one resin with a softening temperature higher than 110° C. in an amount ranging from 5 phr to 15 phr, and c. optionally, at least one resin with a softening temperature ranging from 50° C. to 110° C. in an amount ranging from 5 to 15 phr.", "a. at least one resin with a softening temperature lower than 50° C. in an amount ranging from 5 phr to 15 phr, b. at least one resin with a softening temperature higher than 110° C. in an amount ranging from 5 phr to 15 phr, and c. at least one resin with a softening temperature ranging from 50° C. to 110° C. in an amount ranging from 5 phr to 15 phr.", "(i) 100 phr of an elastomeric polymer composition comprising, a. at least one styrene-butadiene polymer (SBR) having a Tg ranging from −45° C. to −15° C. in an amount ranging from 40 to 100 phr, and b. from 0 to 30 phr of at least one isoprene polymer (IR) having a Tg ranging from −80° C. to −50° C., (ii) from 15 phr to 50 phr of a resin mixture comprising; a. at least one resin with a softening temperature lower than 50° C. in an amount ranging from 5 phr to 45 phr, b. at least one resin with a softening temperature higher than 110° C. in an amount ranging from 5 phr to 45 phr, and c. from 0 phr to 40 phr of at least one resin with a softening temperature ranging from 50° C. to 110° C., (iii) from 1 phr to 130 phr of at least one reinforcing filler, and (iv) from 0.1 phr to 12 phr of at least one vulcanising agent."], "bibtex": "@patent{20240253395,\n    title = {HIGH-PERFORMANCE TYRE},\n    number = {20240253395},\n    year = {2024},\n    note = {File: US20240253395A1-20240801.XML}\n    }", "classification": "B60C100FI"}, {"title": "TIRE HAVING OPTIMIZED PERFORMANCE IN TERMS OF ROLLING RESISTANCE AND ROADHOLDING", "doc_number": "20240253396", "filename": "US20240253396A1-20240801.XML", "abstract": "The invention relates to a tyre ( 1 ) for a passenger vehicle of which the performance in terms of rolling resistance has been improved without adversely affecting the transverse slip stiffness. The bead ( 50 ) is made more flexible by the use of low-hysteresis materials. The transverse slip stiffness is compensated for through the use of a rigid, low-hysteresis sidewall layer ( 30 ). The layers of compounds of the lower region having a viscoelastic loss Tan(δ)max less than or equal to 0.10 represent a volume of between 30% and 90% of the total volume of said lower region, and the elastic shear modulus G′ (M 3 ) of each sidewall layer is in the range [0.5; 10] MPa.", "detailed_description": ["The invention was implemented on a passenger vehicle tyre of size 245/45R18 in accordance with the specifications of the ETRTO (European Tyre and Rim Technical Organisation) standard. Such a tyre can carry a load of 800 kilos, inflated to a pressure of 250 kPa.", "", "InFIG.1-A, the tyre with general reference sign1comprises a carcass reinforcement90consisting of reinforcers coated in a rubber composition, and two beads50in contact with a rim100. A region49delimited by a dashed circle defines a lower region of the tyre, an enlargement of which is given inFIG.1-B. The carcass reinforcement90is anchored in each of the beads50. The tyre further comprises a crown reinforcement20comprising two working layers21,22and a hooping layer23. Each of the working layers21and22is reinforced by filamentary reinforcing elements that are parallel within each layer and crossed from one layer to the other, forming angles of between 10° and 70° with the circumferential direction. The hooping layer23is positioned radially outside the crown reinforcement20, this hooping layer23being formed of reinforcing elements oriented circumferentially and wound in a spiral. A tread10is placed radially on the hooping layer23; it is this tread10that provides the contact between the tyre1and the ground. The tyre1depicted is a “tubeless” tyre: it comprises an “inner liner”95made from a rubber composition impermeable to the inflation gas, covering the inner surface of the tyre.", "", "The part of the rim100that interacts with the tyre within the scope of the invention is axisymmetric relative to the axis of rotation of the tyre.", "", "In a meridian plane, the rim100comprises at least one flange120located at one axial end and connected to a seat110that is intended to receive the radially innermost face of the bead. A rectilinear portion130that connects the rim flange120to the seat110via fillets is located between the seat110and the flange120. The flange120of the rim extended by the rectilinear portion130axially limits the movement of the beads during inflation.", "", "FIG.1-B shows a lower region with general reference sign55containing the sidewall layer30and the bead50. The contour of the lower region follows the outer contours of at least part of the sidewall layer30and the outer contour of the bead50.", "", "Said bead50partially comprises a carcass reinforcement90that comprises a main part52, and is then wrapped around an annular reinforcing structure51to form a turn-up53. A filler layer70is positioned between the main part52of the carcass reinforcement90and its turn-up53. Depending on the embodiment, the bead50can also comprise a lateral reinforcing layer60, positioned axially outside the turn-up53and axially inside the sidewall layer30. Axially innermost from the bead50, an airtight layer95forms the inner wall in contact with the internal inflation air.", "", "Said bead50also comprises a protective layer80that is in axially outer contact with a rectilinear portion130of the rim so as to limit the axial movement of the bead. Said protective layer80also comprises a portion intended to be in contact with the rim on the rim seat110. A sidewall layer30interacts with the bead50and forms an outer lateral wall.", "", "FIG.2-A depicts the outer profiles of a bead50of a tyre according to a particular embodiment of the invention compared with the bead of a tyre of usual design. The bead50is depicted in a section opposite the contact patch. The two profiles differ in an area at the rim flange120. The reference sign30indicates the profile of a tyre of the prior art, and the reference sign35shows the modification of the profile that is made on the tyre of the invention to facilitate contact with the rim100.", "", "FIG.2-B depicts the same thing asFIG.2-A, but the profiles are shown in the centre of the contact patch in which contact is made with the ground. The tyre is in contact with the entire rim flange120, unlike inFIG.2-A. The rate of variation in rim contact reflects this change in the rim contact.", "", "In another embodiment depicted inFIG.2-C, there is a cushion of elastomer compound40(modification located at the radially inner end of the sidewall30) that is intended to be in contact with the rim flange120. The cushion of compound40is delimited radially on the inside by a curve that closely follows the profile of the rim flange120. A first side of the cushion of elastomer compound40has a suitable geometric shape that anticipates contact with the curvature of the rim flange so as to closely follow the shape of the rim flange120when contact is being made, a second side of the cushion of elastomer compound extends an outer side of a sidewall in contact with the ambient air, a third side of the cushion of elastomer compound40is in contact with the radially inner end of the sidewall, and lastly a fourth side of the cushion of elastomer compound is in contact with the protective layer80.", "", "InFIG.2-C, the rim contact curve extends from a first point M1of the tyre that is positioned axially outermost, and in contact with the rim, and a second point M2of the tyre that is also in contact with the rim and is located in the middle of the rectilinear portion connecting the flange120to the seat110of the rim. The length of this rim contact curve is the curvilinear distance from point M1to point M2along the rim contact curve.", "", "FIG.2-D is a variant of the preceding embodiment characterized by the presence of a lateral reinforcing layer60of the bead50, positioned axially outside the turn-up53of the carcass reinforcement90and axially inside the sidewall layer30.", "", "FIG.3is a view in the vertical plane of a tyre of the invention according to a previous embodiment. The tyre is inflated, mounted on a rim100and compressed by the load carried250against the ground200. A first meridian section in the contact patch can be seen, and a second meridian section opposite the contact patch. The length of the rim100contact curve, LADC, is measured in the first section located in the contact patch, in at least a first bead. The length of the rim contact curve, LCJ, is also measured in the second section, in at least a second bead. The ratio of the difference in the lengths of the rim contact curves of the two sections, i.e. 100*(LADC−LCJ)/LCJ, is greater than or equal to 30%, and in this case is equal to 62%.", "", "FIG.4-A illustrates the determination of the height H. The height H of the tyre is the normal distance between a first straight line HH′ parallel to the axis of rotation of the tyre and tangent to the radially innermost point of the annular reinforcing structure, and a second straight line DD′ also parallel to the axis of rotation of the tyre and passing through the radially outermost point of the tread. The radial height H is measured on the tyre mounted on a rim and inflated to a reference pressure in accordance with the ETRTO (European Tyre and Rim Technical Organisation) specifications.", "", "FIG.4-B depicts the geometric parameters of the bead relating to the invention. The heights are defined from the straight line HH′, which is tangent to the bead wire51at its radially innermost point:DRI is the radial distance from HH′ of the radially inner end of the lateral reinforcing layer60. The radial distance DRI is less than or equal to 20% of the radial height H of the tyre, and in the example shown here is 5 mm;DRL is the radial distance from the straight line HH′ of the radially outer end of the lateral reinforcing layer60. The radial distance DRL is greater than or equal to 25% of the radial height H of the tyre, and in the example shown here is 38 mm;DRR is the radial distance from HH′ of the end of the turn-up of the carcass reinforcement90. The radial distance DRR is greater than or equal to 10% of the radial height H of the tyre, and in the example shown here is 20 mm;DRB is the radial distance from HH′ of the radially outer end of the filler layer70, and in the example shown here is 28 mm.", "", "The following Table 1 gives the compositions of elastomer compounds of a lower region of the invention. The main compounds used are listed, for each of which the main ingredients are expressed in phr (parts by weight per hundred parts by weight of elastomer):", "", "TABLE 1ElastomerElastomerReinforcingNRBRfiller -(Natural(ButadienecarbonReinforcingrubber)Rubber)blackAntioxidantSulphurAcceleratolresinHardenerM1100075 (N326)1.58.50.95124.18M2100075 (N326)27.50.97126.8M3356530 (N550)1.38.04.750010 (Silica)M4356548 (N550)51.41.4180", "", "The compounds of the invention used in this example are based on a natural rubber elastomer or a blend of natural rubber and butadiene for compounds M3and M4, reinforced with carbon black. Plasticizers (reinforcing resin) are incorporated into the composition to facilitate the processability of the compounds. The compounds also comprise vulcanization agents, sulphur, an accelerator, and protection agents. The associated mechanical and viscoelastic properties, measured at 23° ° C. under a strain amplitude of 10%, are summarized in Table 2:", "", "TABLE 2G′G″Tan(δ)maxM14670.2M24880.2M32.470.060.03M41.260.1000.08", "", "Configurations of tyres of the invention were tested in order to clearly highlight the performance offered by the invention. The results of these tests were compared with those obtained on control tyres.", "", "The control tyre T1illustrated inFIGS.1-A and1-B corresponds to a tyre comprising a filler layer consisting of elastomer compound M1, a lateral reinforcing layer of the bead consisting of elastomer compound M2, and a sidewall layer consisting of elastomer blend M4. The profile of the sidewall layer is of the usual design, that is, it has not been modified to facilitate contact with the rim.", "", "A second control tyre T2has the same specifications as T1, but the filler and reinforcing elastomer compounds consist of compound M3.", "", "The first tyre P1according to the invention has the same specifications as the control tyre T1, but the sidewall layer and the lateral reinforcing layer consist of elastomer compound M3.", "", "The second tyre P2according to the invention has the same specifications as the control tyre T1, but the filler layer and the sidewall layer consist of elastomer compound M3.", "", "The third tyre P3according to the invention differs from the control tyre in that the layers of elastomer compounds of the filler, reinforcing and sidewall layers consist of elastomer compound M3.", "", "Lastly, the fourth tyre P4of the invention differs from P3in the modification of the profile of the sidewall layer for a rate of variation in rim contact greater than 30%.", "", "The configurations of the tyres P1, P2and P3of the invention are illustrated inFIG.1-B. The illustrations for configuration P4can be seen inFIGS.2-A,2-B and2-D.", "", "The rate of variation in rim contact is 62% for P4, after partial modification of the profile of the sidewall layer in the area of contact with the rim, as depicted inFIGS.2-A and2-B.", "", "For all of the tyres of the invention, the content of elastomer compounds with hysteresis less than or equal to 0.10 is in the range [30%; 90%], as illustrated in Table 3 below:", "", "TABLE 3TyreLayers of the lower region% Volume ofconfigurationwith compound M3lower regionP1Sidewall layer + reinforcing layer44P2Sidewall layer + filler layer41P3Sidewall layer + filler layer +54reinforcing layerP4Sidewall layer + filler layer +54reinforcing layer + modified rimcontact area profile", "", "The rolling resistance test was carried out in accordance with ISO 28580. For a tested tyre, the result is the coefficient of rolling resistance, which represents the ratio of the resistance force opposing the forward travel of the vehicle owing to hysteresis of the tyres divided by the load carried.", "", "The transverse slip stiffness was measured on dedicated measuring machines, such as those sold by MTS.", "", "A result greater than (respectively less than) 100% indicates an improvement (respectively a deterioration) in the performance criterion under consideration.", "", "The results obtained are summarized in Table 4 below:", "", "TABLE 4Rolling resistanceTransverse slip stiffnessT1100100T211096P110898P2104100P311299P4111102", "", "All of the tyres of the invention achieve the compromise sought between rolling resistance and handling controlled by the transverse slip stiffness. Tyres P1and P3have a transverse slip stiffness of 98% and 99% respectively, without noticeably affecting the handling of the vehicle. Tyres P2and P4have superior or equal performance to the target sought.", "", "All of the variants of tyres according to the invention disclosed are produced without changing the processes and retain a normal industrial manufacturing cost.", "", "In addition, the invention can be applied more generally to other bead architectures from those described here, such as for example a bead having a first filler layer and a second lateral reinforcing layer, even if the carcass reinforcement does not comprise a turn-up."], "claims": ["1 .- 15 . (canceled)", "two beads ( two sidewall layers ( a crown ( at least one carcass reinforcement ( two lower regions ( where each lower region ( where each lower region occupying a volume obtained by rotation of the meridian surface about an axis of rotation of the tire, where the bead ( where each elastomer compound of the tire has an elastic shear modulus and a viscoelastic loss measured in accordance with ASTM D 5992-96, at 23° C., under a shear strain of 10%, wherein each layer of compound of each lower region ( wherein an elastic shear modulus of each sidewall layer is in a range [0.5; 10] MPa.", "17 . The tire ( 1 ) according to claim 16 , wherein the elastic shear modulus of the sidewall layer is in the range [1.5; 10] MPa.", "18 . The tire ( 1 ) according to claim 16 , wherein layers of compounds of the lower region having a viscoelastic loss Tan(δ)max less than or equal to 0.10 represent a volume of between 40% and 90% of a total volume of the lower region.", "19 . The tire ( 1 ) according to claim 16 , wherein the at least one filler layer consists of an elastomer compound with a viscoelastic loss Tan(δ)max less than or equal to 0.10.", "20 . The tire ( 1 ) according to claim 16 , wherein the bead comprises a lateral reinforcing layer ( 60 ) consisting of an elastomer compound occupying a volume contained at least partially between the sidewall layer ( 30 ) and the turn-up ( 53 ) of the carcass reinforcement.", "21 . The tire ( 1 ) according to claim 20 , wherein the lateral reinforcing layer ( 60 ) of the bead consists of an elastomer compound with a viscoelastic loss Tan(δ)max less than or equal to 0.10.", "wherein the tire ( wherein a length of the rim contact curve, LADC, is measured in the first section located in the contact patch, in at least a first bead, wherein a length of the rim contact curve, LCJ, is measured in the second section located opposite the contact patch relative to the axis of rotation of the tire, in at least a second bead, and wherein a ratio of a difference in the lengths of the rim contact curves in the two sections, 100*(LADC−LCJ)/LCJ, is greater than or equal to 30%.", "23 . The tire ( 1 ) according to claim 22 , wherein the ratio of the difference in the lengths of the rim contact curves of the two sections is greater than or equal to 40%.", "24 . The tire ( 1 ) according to claim 16 , wherein a distance DRB, which is a radial distance from a radially outer end of the filler layer ( 70 ), is less than or equal to 50% of the radial height H of the tire ( 1 ).", "25 . The tire ( 1 ) according to claim 20 , a distance DRI being the radial distance from a radially inner end of the lateral reinforcing layer ( 60 ) to the straight line (HH′), wherein the radial distance DRI is in a range [5%; 20%] of the radial height H of the tire ( 1 ).", "26 . The tire ( 1 ) according to claim 20 , a distance DRL being the radial distance from the radially outer end of the lateral reinforcing layer ( 60 ) to the straight line (HH′), wherein the radial distance DRL is greater than or equal to 25% of the radial height H of the tire ( 1 ).", "27 . The tire ( 1 ) according to claim 16 , wherein the turn-up ( 53 ) of the carcass reinforcement ( 90 ) is in radially outer contact with the main part ( 52 ) of the carcass reinforcement ( 90 ) along the turn-up ( 53 ).", "28 . The tire ( 1 ) according to claim 16 , further comprising a reinforcement for strengthening the bead ( 50 ) axially outside the turn-up ( 53 ) of the carcass reinforcement ( 90 ) and axially inside the sidewall ( 30 ).", "29 . The tire ( 1 ) according to claim 20 , wherein, in each bead, an elastomer compound forming at least one layer of the filler layer ( 70 ), and/or the lateral reinforcing layer ( 60 ), and/or the sidewall layer ( 30 ), has a composition based on a diene elastomer, a crosslinking system, and a reinforcing filler at an overall content of between 50 and 75 phr.", "30 . The tire ( 1 ) according to claim 29 , wherein, in each bead, the elastomer compound forming the filler layer ( 70 ), the elastomer compound forming the lateral reinforcing layer ( 60 ) and the elastomer compound forming the sidewall layer ( 30 ) have the same composition."], "bibtex": "@patent{20240253396,\n    title = {TIRE HAVING OPTIMIZED PERFORMANCE IN TERMS OF ROLLING RESISTANCE AND ROADHOLDING},\n    number = {20240253396},\n    year = {2024},\n    note = {File: US20240253396A1-20240801.XML}\n    }", "classification": "B60C100FI"}, {"title": "NON-PNEUMATIC TIRE HAVING BALANCED SPOKE STIFFNESS", "doc_number": "20240253397", "filename": "US20240253397A1-20240801.XML", "abstract": "A non-pneumatic tire and method of forming a non-pneumatic tire. The non-pneumatic tire includes a lower ring having a first diameter and an upper ring having a second diameter greater than the first diameter. The upper ring is substantially coaxial with the lower ring. A plurality of spokes extend between and interconnect the lower ring and the upper ring. The plurality of spokes have a tension stiffness of greater than or equal to 11 and less than or equal to 150 N/mm°, and a compression stiffness of greater than or equal to 11 and less than or equal to 100 N/mm°.", "detailed_description": ["The following includes definitions of selected terms employed herein. The definitions include various examples or forms of components that fall within the scope of a term and that may be used for implementation. The examples are not intended to be limiting. Both singular and plural forms of terms may be within the definitions.", "", "“Axial” and “axially” refer to a direction that is parallel to the axis of rotation of a tire.", "", "“Circumferential” and “circumferentially” refer to a direction extending along the perimeter of the surface of the tread perpendicular to the axial direction.", "", "“Radial” and “radially” refer to a direction perpendicular to the axis of rotation of a tire.", "", "“Tread” as used herein, refers to that portion of the tire that comes into contact with the road or ground under normal inflation and normal load.", "", "While similar terms used in the following descriptions describe common tire components, it should be understood that because the terms carry slightly different connotations, one of ordinary skill in the art would not consider any one of the following terms to be purely interchangeable with another term used to describe a common tire component.", "", "Directions are stated herein with reference to the axis of rotation of the tire. The terms “upward” and “upwardly” refer to a general direction towards the tread of the tire, whereas “downward” and “downwardly” refer to the general direction towards the axis of rotation of the tire. Thus, when relative directional terms such as “upper” and “lower” or “top” and “bottom” are used in connection with an element, the “upper” or “top” element is spaced closer to the tread than the “lower” or “bottom” element. Additionally, when relative directional terms such as “above” or “below” are used in connection with an element, an element that is “above” another element is closer to the tread than the other element.", "", "The terms “inward” and “inwardly” refer to a general direction towards the equatorial plane of the tire, whereas “outward” and “outwardly” refer to a general direction away from the equatorial plane of the tire and towards the side of the tire. Thus, when relative directional terms such as “inner” and “outer” are used in connection with an element, the “inner” element is spaced closer to the equatorial plane of the tire than the “outer” element.", "", "FIGS.1and2are front views of one embodiment of a non-pneumatic tire100. The non-pneumatic tire100includes a lower ring110having a first diameter and an upper ring120having a second diameter greater than the first diameter. Each of the lower ring110and the upper ring120extend in an axial direction to define a tire width. The upper ring120is substantially coaxial with the lower ring110. The lower ring110is attached to a hub130. The hub130may be used to attach the non-pneumatic tire100to a vehicle, for example. In alternative embodiments, the hub may be omitted.", "", "A circumferential tread140is disposed about the upper ring120. The tread140may include tread elements such as grooves, ribs, blocks, lugs, sipes, studs, and other elements. A shear band, shear element, or reinforcement structure (not shown) may be disposed between the upper ring120and the tread140. In alternative embodiments, the tread may be omitted and tread elements may be formed directly on the upper ring.", "", "A plurality of spokes200extend between and interconnect the lower ring110and the upper ring120. In the illustrated embodiment, the design of each one of the plurality of spokes200is substantially identical. Accordingly, further description of the plurality of spokes200will be made with reference to a single spoke. However, it should be understood that in alternative embodiments, the geometries of different spokes may vary. In other alternative embodiments, webbing may be used to interconnect the lower ring and the upper ring.", "", "Each one of the spokes200extends between a first end205and a second end210along a generally radial direction of the non-pneumatic tire100. The first end205is attached to the lower ring110. The second end210is attached to the upper ring120. The spoke200also extends between a first edge215and a second edge220along a generally axial direction of the non-pneumatic tire100to define a spoke width. In the illustrated embodiment, the width of the spoke200is slightly less than the width of the lower ring110and the upper ring120. In alternative embodiments, the spoke may have a width that is equal to the lower ring or the upper ring, or the spoke may have a width that is greater than the lower ring or the upper ring.", "", "Each spoke200has a first stiffness in tension, kt, which may be referred to as a tension stiffness. Each spoke200also has a second stiffness in compression, kc, which may be referred to as a compression stiffness. The tension stiffness ktand compression stiffness kcof each spoke200affects the performance characteristics of the non-pneumatic tire100.", "", "FIG.5ais a schematic drawing showing a front view of a testing arrangement for determining tension stiffness ktof a spoke. A spoke sample S has a first end510that is held stationary and a second end515that is free to move relative to the first end510. A load is applied to the second end515of the spoke sample S in a first direction, indicated by arrow A1. This load causes the second end515of the spoke S to deflect relative to the first end510by a tension distance dt(not shown in this view). The load likewise creates a tension force fton the spoke sample S generates as the second end515moves the tension distance dt.", "", "FIG.5bis a schematic drawing showing a front view of a testing arrangement for determining compression stiffness kcof the spoke sample S. In this arrangement, the load applied to the second end515of the spoke sample S is in a second direction, indicated by arrow A2, which is opposite the first direction shown inFIG.5a. The load causes the second end515of the spoke sample S to be deflected relative to the first end510by a compression distance dc(not shown in this view). The load also creates a compression force fcon the spoke sample S as the second end515moves the compression distance dt.", "", "The graph shown inFIG.5cshows the relationship between spoke deflection and spoke force, with deflection being plotted along the x-axis and force being plotted along the y-axis. The right side of the graph is a plot of the tension force ftand the tension distance dt, while the left side of the graph is a plot of the compression force fcand the compression distance dc. Tension stiffness ktis determined by measuring the slope of a line connecting the point (0, 0) to the point (dt, ft). Compression stiffness kcis determined by measuring the slope of a line connecting the point (0, 0) to the point (dc, fc).", "", "Known non-pneumatic tires may generally be categorized as “bottom loading” or “top loading.” Bottom loading tires carry load predominantly by compression of the tire between the underlying surface on which the tire rests and the point where the load is applied to the tire, with a small fraction of the spokes located near the underlying surface carrying a majority of the load at any given moment during rotation of the tire. As such, compression stiffness of the spokes in bottom loading tires is a primary design factor, while tension stiffness of the spokes is less significant. Bottom loading tires can provide good load carrying characteristics, but may provide poor impact absorption performance.", "", "In comparison, top loading tires carry load predominantly through the use of a hoop-like structure. Unlike a bottom loading tire where a small fraction of the spokes carry a majority of the load, the hoop-like structure of top loading tires distributes a load more evenly to all spokes in the tire. As such, both compression stiffness and tension stiffness of the spokes of top loading tires are significant design factors. In certain top loading tire arrangements, the tension stiffness of the spokes can be orders-of-magnitude higher than the compression stiffness of the spokes, which can create an imbalance of forces in the tire. Thus, while top loading tires can provide good impact absorption performance, top loading tires may suffer from undesirably high stresses or strains in tire components because of this imbalance of forces.", "", "The present disclosure identifies equations and values that can be used to design a non-pneumatic tire that overcomes the aforementioned issues to provide a non-pneumatic tire having acceptable impact absorption performance while also having acceptable stresses and strains in tire components. Specifically, the present disclosure identifies equations and values that can be used to calculate ideal tension stiffness kt,degreeand ideal compression stiffness kc,degreevalues for a tire of a desired width and a desired load capacity, with the ideal tension stiffness kt,degreeand ideal compression stiffness kc,degreevalues each being expressed in spoke stiffness per degree and having units of", "", "Nmm/°.", "", "Ideal tension stiffness kt,degreeand ideal compression stiffness kc,degreevalues are most appropriately expressed in terms of spoke stiffness per degree", "", "(Nmm/°)", "", "because the performance characteristics of the non-pneumatic tire200are affected by the total number of spokes20. Generally speaking, reducing the total number of spokes requires an increase in compression and tension stiffness of each spoke, while increasing the total number of spokes requires a decrease in compression and tension stiffness of each spoke. For example, a tire is initially designed with 60 spokes and provides baseline performance characteristics. Starting from this initial design, if the total number of spokes is reduced, the tension and compression stiffness of each spoke must be increased to compensate for the spoke reduction in order to maintain the baseline performance characteristics. If the total number of spokes is increased from the initial design, the tension and compression stiffness of each spoke must be decreased to compensate for the spoke addition in order to maintain the baseline performance characteristics.", "", "With the foregoing in mind, the following equations and values can be used to calculate ideal tension stiffness kt,degreeand ideal compression stiffness kc,degreevalues expressed in terms of spoke stiffness per degree:", "", "11≤kt,ref≤150⁢(Nmm)/°11≤kc,ref≤100⁢(Nmm)/°wref=300⁢mmfref=22,200⁢Nkt,degree=kt,ref(wrefw)⁢(ffref)kc,degree=kc,ref(wrefw)⁢(ffref)", "", "The first step in calculating ideal tension stiffness kt,degreeand ideal compression stiffness kc,degreevalues is modeling a model tire to optimize a reference tension stiffness kt,refand a reference compression stiffness kc,refvalues. The modeling may be performed using, for example, finite element analysis. This modeling is performed using a model tire with a specific model width wrefand a specific model load capacity fref. In one example embodiment, the model tire has a width wrefof 300 mm and a load capacity frefof 22,200 N.", "", "In modeling the tire, the designer takes into consideration the intended application for the non-pneumatic tire. Increasing the reference compression stiffness kc,refprovides a tire with a stiffer ride and relatively smaller footprint, while decreasing the reference compression stiffness kc,refprovides a tire with a softer ride and relatively larger footprint. Increasing and decreasing the reference tension stiffness kt,refprovides similar resultant changes. Generally speaking, however, it has been found that a reference tension stiffness kt,refin a range of 11 to", "", "150⁢Nmm/°", "", "and a reference compression stiffness kc,refin a range of 11 to", "", "100⁢Nmm/°", "", "provides desirable non-pneumatic tire performance characteristics. More preferably, a tire is provided with a reference tension stiffness kt,refin a range of 17 to", "", "140⁢Nmm/°", "", "and a reference compression stiffness kc,refin a range of 11 to", "", "70⁢Nmm/°.", "", "Even more preferably, a tire is provided with a reference tension stiffness kt,refin a range of 17 to", "", "70⁢Nmm/°", "", "and a reference compression stiffness kc,refin a range of 11 to", "", "35⁢Nmm/°.", "", "Most preferably, a tire is provided with a reference tension stiffness kt,refin a range of 17 to", "", "35⁢Nmm/°", "", "and a reference compression stiffness kc,refin a range of 17 to", "", "35⁢Nmm/°.", "", "Regardless of the specific values for reference tension stiffness kt,refand reference compression stiffness kc,ref, it has also been found that providing a reference tension stiffness kt,refto reference compression stiffness kc,refratio in the range of 0.3:1 to 8:1 results in desirable non-pneumatic tire performance characteristics. More preferably, a tire is provided with a reference tension stiffness kt,refto reference compression stiffness kc,refratio in the range of 0.5:1 to 8:1. Most preferably, a tire is provided with a reference tension stiffness kt,refto reference compression stiffness kc,refratio in the range of 0.5:1 to 1:1. In instances where kt,refis less than 1, the spokes of the tire may carry a majority of the load in compression. The tire structure, however, is such that force is transmitted around a circumference of the tire so that all of the spokes play a significant role in carrying a load, as is the case in top loading tires.", "", "With the foregoing guidelines being established, the exact values for the reference tension stiffness kt,refand the reference compression stiffness kc,refare selected based on the modeling of the model tire and desired performance characteristics. The reference tension stiffness kt,refand the reference compression stiffness kc,refcan then be entered into the equations to calculate the ideal tension stiffness kt,degreeand ideal compression stiffness kc,degreevalues for a desired tire design having a first design width and a first design load capacity. The width of the tire being designed (i.e., first design width) is designated by w, measured in millimeters, and assumes that the spoke, the lower ring, and the upper ring are all the same width. The design load capacity of the tire being designed (i.e., first design load capacity) is designated by f and is measured in Newtons.", "", "In one non-limiting example, a model width wrefof 300 mm and a model load capacity frefof 22,200 N are used again in adjusting reference tension stiffness kt,refand the reference compression stiffness kc,refvalues for the modeled tire to arrive at the ideal tension stiffness kt,degreeand the ideal compression stiffness kc,degreevalues for the tire being designed. Consequently, the equations becoming the following:", "", "kt,degree=kt,ref⁢(fw)⁢(0.0135)kc,degree=kc,ref⁢(fw)⁢(0.0135)", "", "In this example, once the initial modeling is performed using a tire with a model width wrefof 300 mm and a model load capacity frefof 22,200 N, ideal tension stiffness kt,degreeand ideal compression stiffness kc,degreevalues can quickly be adjusted for different tire widths and different tire design load capacities. Accordingly, once the ideal tension stiffness kt,degreeand the ideal compression stiffness kc,degreevalues are calculated for the tire having a first design width and a first design load capacity, the equations can again be used to calculate the ideal tension stiffness kt,degreeand the ideal compression stiffness kc,degreevalues for a tire having a second design width and a second design load capacity. First, second, and subsequent tire designs can thus be quickly designed.", "", "After the ideal tension stiffness kt,degreeand the ideal compression stiffness kc,degreeare calculated, the specific tension stiffness kt,specificand the specific compression stiffness kc,specificof each spoke can be determined by using the following equations:", "", "kt,specific=kt,degree⁢(360⁢°n)kc,specific=kc,degree⁢(360⁢°n)", "", "According to these equations, the specific tension stiffness kt,specificand the specific compression stiffness kc,specificof each spoke can be determined by multiplying each of the ideal tension stiffness kt,degreeand the ideal compression stiffness kc,degreeby (360°/n), where n is the total number of spokes in the tire being designed. Performing this operation will provide the specific tension stiffness kt,specificand the specific compression stiffness kc,specificvalues of each spoke, expressed in N/mm. Accordingly, specific tension stiffness kt,specificand specific compression stiffness kc,specificcan quickly be adjusted for tires with different number of spokes.", "", "Various spoke designs may provide the desired specific tension stiffness kt,specificand specific compression stiffness kc,specificcalculated according to the equations above, and may be achieved through a combination of geometry, material selection, and reinforcements, for example.FIG.4shows part of a non-pneumatic tire400in an unloaded condition and having an exemplary spoke design that can provide the desired specific tension stiffness kt,specificand specific compression stiffness kc,specific. The non-pneumatic tire400ofFIG.4is substantially similar to the non-pneumatic tire100ofFIGS.1-3. Thus, the description of the tire ofFIG.4will be abbreviated, and like features will be identified by like numerals increased by a factor of “300.”", "", "The non-pneumatic tire400includes a lower ring410having a first diameter and an upper ring420having a second diameter greater than the first diameter. A distance between the lower ring410and the upper ring420is denoted by R. The upper ring420is substantially coaxial with the lower ring410. A plurality of spokes500extend between and interconnect the lower ring410and the upper ring420. The design of each one of the plurality of spokes500is substantially identical. Accordingly, further description of the plurality of spokes500will be made with reference to a single spoke.", "", "Each one of the spokes500is substantially C-shaped and extends between a first end505and a second end510along a generally radial direction of the non-pneumatic tire400. The first end505is attached to the lower ring410. The second end510is attached to the upper ring420. A straight line drawn between the attachment point of the first end505and the lower ring410may be referred to as a base and is denoted by B. An apex A of the C-shaped spoke is offset from the base B along a circumferential direction of the tire by a distance r.", "", "It has been found that a spoke500having the desired specific tension stiffness kt,specificand compression stiffness kc,specificcalculated using the aforementioned equations can be designed using the following equation:", "", "r=(0.5)⁢R", "", "In this equation, the distance R between the lower ring410and the upper ring420can be calculated for a non-pneumatic tire400having a known inner and outer diameters. According to one example embodiment, it has been found that multiplying the distance R by (0.5) to calculate the offset distance r provides desirable non-pneumatic tire performance characteristics. In other example embodiments, it has been found that multiplying the distance R by values ranging from 0.5 to 2 provides acceptable non-pneumatic tire characteristics. In addition to providing a spoke having the desired specific tension stiffness kt,specificand specific compression stiffness kc,specific, it has been found that the above equation also provides a spoke having approximately linear tension and compression behavior.", "", "According to one example embodiment, the C-shaped spoke500is manufactured from steel with an elastic modulus of approximately 200 gigapascals, a thickness in the circumferential direction of 1.575 mm, and a width in the axial direction of 305 mm. These parameters may be varied without departing from the design objectives discussed above in regard to specific tension stiffness kt,specificand compression stiffness kc,specific. For example, the spoke may be manufactured from carbon fiber reinforced polymers, glass reinforced polymers, plastics (thermoplastics or thermosets), and other metals such as stainless steel. As another example, the spokes may have a thickness of 1-25 mm and, more preferably, 1-10 mm. As yet another example, the spokes may have a width of 200-305 mm and, more preferably, 260-305 mm. It is appreciated that changing one design parameter may require changing another design parameter in order to maintain the desired design objectives in regard to specific tension stiffness kt,specificand compression stiffness kc,specific. For example, if the spoke is made from polymer rather than steel, it may be necessary to increase the thickness of the spoke to 23 mm, assuming the width of the spoke remains at 305 mm. As another example, if the width of the spoke is reduced, it may be necessary to increase the thickness of the spoke.", "", "The foregoing spoke design is only one possibility for a design that provides the specific tension stiffness kt,specificand compression stiffness kc,specificdisclosed herein. Other spoke designs meeting the specific tension stiffness kt,specificand compression stiffness kc,specificdesign objectives are possible.", "", "To the extent that the term “includes” or “including” is used in the specification or the claims, it is intended to be inclusive in a manner similar to the term “comprising” as that term is interpreted when employed as a transitional word in a claim. Furthermore, to the extent that the term “or” is employed (e.g., A or B) it is intended to mean “A or B or both.” When the applicants intend to indicate “only A or B but not both” then the term “only A or B but not both” will be employed. Thus, use of the term “or” herein is the inclusive, and not the exclusive use. See, Bryan A. Garner, A Dictionary of Modern Legal Usage 624 (2d. Ed. 1995). Also, to the extent that the terms “in” or “into” are used in the specification or the claims, it is intended to additionally mean “on” or “onto.” Furthermore, to the extent the term “connect” is used in the specification or claims, it is intended to mean not only “directly connected to,” but also “indirectly connected to” such as connected through another component or components.", "", "While the present application has been illustrated by the description of embodiments thereof, and while the embodiments have been described in considerable detail, it is not the intention of the applicants to restrict or in any way limit the scope of the appended claims to such detail. Additional advantages and modifications will readily appear to those skilled in the art. Therefore, the application, in its broader aspects, is not limited to the specific details, the representative apparatus and method, and illustrative examples shown and described. Accordingly, departures may be made from such details without departing from the spirit or scope of the applicant's general inventive concept."], "claims": ["1 - 15 . (canceled)", "a lower ring having a first diameter; an upper ring having a second diameter greater than the first diameter, the upper ring being substantially coaxial with the lower ring; and a plurality of spokes extending between and interconnecting the lower ring and the upper ring; wherein the plurality of spokes have a tension stiffness of greater than or equal to 11 and less than or equal to and a compression stiffness of greater than or equal to 11 and less than or equal to", "17 . The non-pneumatic tire of claim 16 , wherein each one of the plurality of spokes is substantially C-shaped.", "18 . The non-pneumatic tire of claim 17 , wherein for each one of the plurality of spokes, an apex of the spoke is offset in a circumferential direction of the tire from a base of the spoke by a distance in the range of 0.5 to 2 times the difference between the second diameter and the first diameter.", "19 . The non-pneumatic tire of claim 16 , wherein each one of the plurality of spokes has at least one of linear tension behavior and linear compression behavior.", "20 . The non-pneumatic tire of claim 16 , wherein each one of the plurality of spokes has linear tension behavior and linear compression behavior.", "21 . The non-pneumatic tire of claim 16 , wherein each one of the plurality of spokes has a thickness in a circumferential direction of the tire of between 1-25 mm.", "22 . The non-pneumatic tire of claim 16 , wherein each one of the plurality of spokes has a width in an axial direction of the tire of the tire of between 260-305 mm.", "a lower ring having a first diameter; an upper ring having a second diameter greater than the first diameter, the upper ring being substantially coaxial with the lower ring; and a plurality of spokes extending between and interconnecting the lower ring and the upper ring; wherein the plurality of spokes have a tension stiffness to compression stiffness ratio in the range of 0.3:1 to 8:1.", "24 . The non-pneumatic tire of claim 23 , wherein each one of the plurality of spokes is substantially C-shaped.", "25 . The non-pneumatic tire of claim 24 , wherein for each one of the plurality of spokes, an apex of the spoke is offset in a circumferential direction of the tire from a base of the spoke by a distance in the range of 0.5 to 2 times the difference between the second diameter and the first diameter.", "26 . The non-pneumatic tire of claim 23 , wherein each one of the plurality of spokes has at least one of linear tension behavior and linear compression behavior.", "27 . The non-pneumatic tire of claim 23 , wherein each one of the plurality of spokes has linear tension behavior and linear compression behavior.", "28 . The non-pneumatic tire of claim 23 , wherein each one of the plurality of spokes has a thickness in a circumferential direction of the tire of between 1-25 mm.", "29 . The non-pneumatic tire of claim 23 , wherein each one of the plurality of spokes has a width in an axial direction of the tire of the tire of between 260-305 mm.", "modeling a model tire having a model width and a model design load capacity; selecting a reference tension stiffness value and a reference compression stiffness value based on the step of modeling, the reference tension stiffness value being greater than or equal to 11 and less than or equal to the reference compression stiffness being greater than or equal to 11 and less than or equal to calculating a first ideal tension stiffness and a first ideal compression stiffness for a tire design having a first design width and a first design capacity by adjusting the reference tension stiffness value and the reference compression stiffness value selected during the step of selecting; and and producing a first non-pneumatic tire having the first design width and the first design capacity, and further having the first ideal tension stiffness and the first ideal compression stiffness calculated during the step of calculating.", "31 . The method of manufacturing a tire of claim 30 , wherein the model width is 300 mm and the model design load capacity is 22,200 N.", "wherein k the step of calculating the first ideal compression stiffness is calculated according to the equation: wherein k", "33 . The method of manufacturing a non-pneumatic tire of claim 30 , wherein the reference tension stiffness value to reference compression stiffness value is a ratio in the range of 0.3:1 to 8:1.", "34 . The method of manufacturing a non-pneumatic tire of claim 30 , wherein the step of producing includes providing a lower ring and an upper ring, forming a plurality of C-shaped spokes, and interconnecting the lower ring and the upper ring with the plurality of C-shaped spokes.", "35 . The method of manufacturing a non-pneumatic tire of claim 34 , wherein the step of forming a plurality of C-shaped spokes includes offsetting an apex of each spoke from a base of each spoke in a circumferential direction of the non-pneumatic tire by a distance in the range of 0.5 to 2 times the difference between a diameter of the upper ring and a diameter of the lower ring."], "bibtex": "@patent{20240253397,\n    title = {NON-PNEUMATIC TIRE HAVING BALANCED SPOKE STIFFNESS},\n    number = {20240253397},\n    year = {2024},\n    note = {File: US20240253397A1-20240801.XML}\n    }", "classification": "B60C714FI"}, {"title": "TIRE", "doc_number": "20240253398", "filename": "US20240253398A1-20240801.XML", "abstract": "A pneumatic tire comprises a tread in contact with a road surface and a pair of inclined belts with crossing cords. A volume of the groove portion formed on the tread of outside when mounted to the vehicle based on a tire equatorial line being less than volume of the groove portion formed on the tread of inside when mounted to the vehicle based on the tire equatorial line, and the pneumatic tire is provided with a reinforcing belt covering a plurality of covering cords extending in the tire width direction and along tire radial direction and arranged at a predetermined distance between the inclined belts and the tread. The reinforcing belt extends from the outside when mounted to the vehicle to the inside when mounted to the vehicle.", "detailed_description": [""], "claims": ["volume of grooves formed on the tread of outside when mounted to a vehicle based on a tire equatorial line is less than volume of grooves formed in the tread of inside when mounted to the vehicle based on the tire equatorial line, and the tire comprises a reinforcing belt covering a plurality of reinforcing cords extending in the tire width direction and along tire radial direction and arranged at a predetermined distance between the crossing belt and the tread, wherein the reinforcing belt is provided from the outside when mounted to the vehicle to the inside when mounted to the vehicle.", "2 . The tire according to claim 1 , wherein a spiral belt with cords wound in the tire circumferential direction is provided between the crossing belt and the reinforcing belt.", "3 . The tire according to claim 1 , wherein the reinforcing belt is provided at least up to a ground end in the tire width direction.", "4 . The tire according to claim 1 , wherein the groove portion formed in the outside when mounted to the vehicle includes at least one circumferential groove.", "5 . The tire according to claim 2 , wherein the reinforcing belt is provided at least up to a ground end in the tire width direction.", "6 . The tire according to claim 2 , wherein the groove portion formed in the outside when mounted to the vehicle includes at least one circumferential groove.", "7 . The tire according to claim 3 , wherein the groove portion formed in the outside when mounted to the vehicle includes at least one circumferential groove."], "bibtex": "@patent{20240253398,\n    title = {TIRE},\n    number = {20240253398},\n    year = {2024},\n    note = {File: US20240253398A1-20240801.XML}\n    }", "classification": "B60C918FI"}, {"title": "TIRE", "doc_number": "20240253399", "filename": "US20240253399A1-20240801.XML", "abstract": "Provided is a tire comprising a pair of bead cores 5 , a carcass 6 , and a plurality of belt layers, wherein the plurality of belt layers comprise a first belt layer 7 with cords extending along the tire circumferential direction CD, and a second belt layer 8 with cords extending at an angle to the tire circumferential direction CD, which is arranged on the outer side in the tire radial direction than the circumferential belt layer, a communication device having a linear antenna is embedded at a tire radial position, that is inner side in the tire radial direction than a tire maximum width position and outer side in the tire radial direction than an outer edge position of the bead core 5 in the tire radial direction, and the linear antenna of the communication device is arranged along the tire circumferential direction.", "detailed_description": ["The tire according to the present disclosure can be used for any type of tire, but can suitably be used for a truck or bus tire.", "", "The following is an illustrative explanation of the embodiment(s) of the tire in accordance with the present disclosure, with reference to the drawings. In each figure, common components are marked with the same reference numerals.", "", "FIG.1is a cross-sectional view (half view) in the tire width direction of a tire1according to the first embodiment of this disclosure.FIG.2schematically illustrates a belt structure of the tire1according to the first embodiment of this disclosure.", "", "In this document, unless otherwise noted, the positional relationship and dimensions of each element shall be measured under the reference condition, with the tire1mounted on the applicable rim, filled with the prescribed internal pressure, and unloaded.", "", "As used herein, the term “applicable rim” refers to the standard rim in the applicable size (Measuring Rim in ETRTO's STANDARDS MANUAL and Design Rim in TRA's YEAR BOOK) as described or as may be described in the future in the industrial standard, which is valid for the region in which the tire is produced and used, such as JATMA YEAR BOOK of JATMA (Japan Automobile Tyre Manufacturers Association) in Japan, STANDARDS MANUAL of ETRTO (The European Tyre and Rim Technical Organization) in Europe, and YEAR BOOK of TRA (The Tire and Rim Association, Inc.) in the United States. The “applicable rim” includes current sizes as well as future sizes to be listed in the aforementioned industrial standards. An example of the “size as described in the future” could be the sizes listed as “FUTURE DEVELOPMENTS” in the ETRTO's STANDARDS MANUAL 2013 edition. For sizes not listed in these industrial standards, the term “applicable rim” refers to a rim with a width corresponding to the bead width of the tire.", "", "In addition, the “prescribed internal pressure” refers to the air pressure (maximum air pressure) corresponding to the maximum load capacity of a single wheel in the applicable size and ply rating, as described in the aforementioned JATMA YEAR BOOK and other industrial standards. In the case that the size is not listed in the aforementioned industrial standards, the “prescribed internal pressure” refers to the air pressure (maximum air pressure) corresponding to the maximum load capacity specified for each vehicle in which the tire is mounted.", "", "Note, that the air as used herein can be replaced by inert gas such as nitrogen gas or other inert gas.", "", "In this document, the term “tire maximum width position” means the position in the tire radial direction where the distance in the tire width direction between the carcasses at a pair of sidewall portions is the greatest.", "", "Also, in this document, the term “tire circumferential direction” is also referred to as the term “tire circumferential direction CD” and the term “tire width direction” is also referred to as the term “tire width direction WD”. In this document, the term “tire radial direction” is also referred to as the term “tire radial direction RD”. In each figure, the tire circumferential direction (CD) is indicated by the CD arrow, the tire width direction (WD) is indicated by the WD arrow, and the tire radial direction (RD) is indicated by the RD arrow, respectively.", "", "As illustrated inFIG.1, the tire1according to the first embodiment of this disclosure comprises a pair of bead portions2, a pair of sidewall portions3, and a tread portion4spanning between the two sidewall portions.", "", "The tire1comprises a pair of bead cores5, embedded in the pair of bead portions2, and a carcass6toroidally straddling the pair of bead cores5.", "", "The carcass6toroidally straddles between the pair of bead cores5and forms the frame of the tire.", "", "Preferably, the carcass6has a carcass body portion disposed between the bead cores5and carcass turn-up portions that are folded around the bead cores5from the inside to the outside in the tire width direction. However, the carcass6does not have to have carcass turn-up portions.", "", "The carcass6includes one or more carcass plies (one in this embodiment). Each carcass ply has carcass cords and coating rubber that covers the carcass cords, respectively.", "", "The carcass cords may be made of metal, such as steel, or organic fibers, such as polyester, nylon, rayon, or aramid.", "", "The configuration of the bead portion2in the tire1according to this embodiment is not limited. As illustrated inFIG.1, the tire1may comprise a bead filler51on the outer side of the pair of bead cores5in the tire radial direction, and a stiffener52on the outer side of the bead filler51in the tire radial direction. Also, the tire1according to this embodiment may also comprise a rubber chafer21, which is disposed in the bead portion2so that it is at least partially in contact with the applicable rim when mounted on the applicable rim.", "", "As illustrated inFIGS.1and2, the tire1according to this embodiment comprises a plurality of belt layers (two layers in this embodiment) disposed on the outer side of the crown portion of the carcass6in the tire radial direction RD.", "", "The plurality of belt layers comprise at least one first belt layer7(one layer in this embodiment) with cords extending along the tire circumferential direction CD, and at least one second belt layer8(one layer in this embodiment) with cords extending at an angle to the tire circumferential direction CD, which is arranged on the outer side in the tire radial direction RD than the circumferential belt layer.", "", "Here, the term “cords extending along the tire circumferential direction (CD)” shall include cases where the cords are parallel to the tire circumferential direction CD or where the cords are slightly inclined to the circumferential direction of the tire (inclined to the tire circumferential direction CD at an angle of 5° or less) due to the result of forming the belt layer by spirally winding a strip of cords coated with rubber, etc.", "", "In addition, the term “cords extending at an angle to the tire circumferential direction (CD)” shall means cords that are inclined at a greater angle to the tire circumferential direction CD than the cords extending along the tire circumferential direction CD described above, and the angle is not particularly limited.", "", "InFIGS.1and2, the first belt layer7is slightly larger than the second belt layer8in the tire width direction, but the lengths of the first belt layer7and the second belt layer8in the tire width direction are not limited.", "", "The first belt layer7and the second belt layers8have cords and coating rubber covering the cords. The cord material is not limited and may be made of organic fibers such as polyester, nylon, rayon, or aramid, or of metals such as steel. Also, the coating rubber can be any known rubber material, such as rubber materials normally used for the belt coating rubber.", "", "In the tire1according to this embodiment, a communication device9, having an IC chip10and at least one linear antenna9aconnected to the IC chip10, is embedded at a tire radial position, that is inner side in the tire radial direction than the tire maximum width position SWH and outer side in the tire radial direction than the outer edge position of the bead core5in the tire radial direction.", "", "The configuration of the communication device9is not limited to any particular configuration, as long as the communication device9is capable of wireless communication with a predetermined device outside the tire1. The communication device9can be, for example, an RF tag. The RF tag is also referred to as an RFID (Radio Frequency Identification) tag. The communication device9has an IC chip10, which constitutes the control section and a storage section, and one or more linear antennas9a, which are connected to the IC chip10. For example, the communication device9may have an overall longitudinal shape with two linear antennas extending in opposite directions from the IC chip10. Here, the term “linear” is not limited to straight lines, but includes shapes extending wavy or spirally.", "", "The IC chip10may also be operated by induced electromotive force generated by electromagnetic waves received by the one or more antennas. In other words, the communication device9may be a passive communication device. Alternatively, the communication device9may be further provided with a battery, so that to be able to communicate by generating electromagnetic waves using its own power. In other words, the communication device9may be an active communication device.", "", "FIG.3is a perspective view illustrating an RF tag as a communication device9to be disposed on the tire1in this embodiment. As illustrated inFIG.3, the RF tag as a communication device9to be disposed on the tire1in this embodiment comprises: a first antenna9a1and a second antenna9a2which constitute the antenna9a; an IC chip10which constitutes the control section9band the storage section9c, which is operated by induced electromotive force generated by radio waves received by these first antenna9a1and second antenna9a2; the plate-like support member9dto which the IC chip10is attached; and a conductive member9eelectrically connecting the IC chip10and each of the first antenna9a1and the second antenna9a2.", "", "The communication device9may be covered by coated rubber.", "", "FIG.4schematically illustrates a cross-sectional view in the tire circumferential direction of the tire1according to the first embodiment of this disclosure.", "", "As illustrated inFIGS.1and4, in the tire1according to this embodiment, a communication device9is embedded at a tire radial position, that is inner side in the tire radial direction than the tire maximum width position SWH and outer side in the tire radial direction than the outer edge position BCE of the bead core5in the tire radial direction. In addition, in the tire1according to this embodiment, the linear antenna9aof the communication device9(in this embodiment, the first antenna9a1and the second antenna9a2) is arranged along the tire circumferential direction CD.", "", "Here, the term “arranged along the tire circumferential direction (CD)” shall include cases where the longitudinal direction of the antenna extending in a straight, wavy, or spiral shape is parallel to the tire circumferential direction CD or slightly inclined with respect to the tire circumferential direction CD (inclination angle to the tire circumferential direction CD is 5° or less).", "", "The effects of the configuration of the tire1according to this embodiment are explained below with reference toFIGS.5A,5B,6A, and6B.", "", "FIG.5Ais a diagram for explaining a neutral axis of deformation of the belt layer of a conventional tire during load rolling.FIG.5Bis a diagram for explaining a neutral axis of deformation of the belt layer of the tire1, during load rolling, according to the first embodiment of this disclosure.FIG.6Ais a diagram for explaining the deformation of a conventional tire under load rolling.FIG.6Bis a diagram for explaining the deformation of the tire1, during load rolling, according to the first embodiment of this disclosure. InFIGS.6A and6B, the dotted lines in the figures represent the outline of the tire before deformation, and the solid lines represent the outline of the tire during load rolling.", "", "FIG.5Aillustrates a conventional tire comprising two belt layers that do not have the configuration of belt layer according to the present disclosure. Here, the term “do not have the configuration of belt layer according to the present disclosure” means, for example, having only two inclined belt layers with cords extending at an angle to the tire circumferential direction CD, etc.", "", "In the tire comprising two belt layers that do not have the configuration of belt layer according to the present disclosure, the neutral axis of deformation NA is located between the belt layer on the outer side in the tire radial direction and the belt layer on the inner side in the tire radial direction, and a compression force is generated in the belt layer on the outer side in the tire radial direction and a tensile force is generated in the belt layer on the outer side in the tire radial direction. As a result, the tread rubber is stretched and contracted, causing deformation such that the contour of the tire is collapsed, as illustrated by the solid line inFIG.6a, and resulting in greater distortion when the tire is stepping onto the road surface and when the tire is kicking off from the road surface. If the communication device is embedded in the tire, the durability of the communication device may be compromised by the above distortion. On the other hand, in the tire1according to the first embodiment of this disclosure, illustrated inFIG.5B, the first belt layer7with cords extending along the tire circumferential direction CD exhibits high stiffness and serves as the neutral axis. Then, only the force of compression on the second belt layer8having cords extending at an angle to the tire circumferential direction CD, which is disposed on the outer side in the tire radial direction, affects the deformation, so that the tire is lifted up while maintaining its annular shape, as illustrated by the solid line inFIG.6B. In this case, the tire distortion in tire circumferential direction is controlled when the tire is stepping onto the road surface and when the tire is kicking off from the road surface. In such a tire1with reduced deformation in the tire circumferential direction, burying the linear antenna9aalong the circumferential direction of the tire1mitigates the effect on the elongated antenna9a, and sufficient durability of the communication device9can be ensured.", "", "The following is a description of each component of the tire1according to the first embodiment of this disclosure, including suitable configurations and variations.", "", "In the tire1according to this embodiment, the number of second belt layer8is not limited to as long as it is one or more, but it is preferably two or more.", "", "In another example of a belt structure illustrated inFIG.7, a second belt layer8A and a second belt layer8B are disposed on the outer side of the first belt layer7in the tire radial direction.", "", "According to the above configuration, the force of compression generated in the second belt layer8, with cords extending at an angle to the tire circumferential direction CD, is greater than in the case that the second belt layer is comprised of one layer. In addition, since the first belt layer7, which serves as the neutral axis, is located more inward in the tire radial direction due to the increased number of the second belt layer8, it exhibits rigidity on the inner side in the tire radial direction and the distortion in the tire circumferential direction is further controlled, thus sufficient durability of the communication device9can be ensured more effectively.", "", "In the tire1according to this embodiment, the inclination angle θ1of the cords of the second belt layer8with respect to the tire circumferential direction CD is not particularly limited, but at least one layer of the second belt layers8preferably has cords extending at an inclined angle of 45° to 70° to the tire circumferential direction CD.", "", "When the tire1is running straightly, the smaller the inclination angle of the cords of the belt layer with respect to the tire circumferential direction, the easier it tends to bear the tension in the tire circumferential direction applied to the tread portion. However, according to the above inclination angle, the second belt layer8bears relatively less of the tension in the tire circumferential direction. In this way, the tension load on the inner side in the tire radial direction is higher than in the second belt layer8, and the first belt layer7, which is the neutral axis on the inner side in the tire radial direction, makes it easier to control the tire deformation. This further controls the distortion in the tire circumferential direction, thus sufficient durability of the communication device9can be more effectively ensured.", "", "More preferably, the inclination angle θ1is 50° to 65° from the viewpoint of ensuring sufficient durability of the communication device9.", "", "When there are two or more second belt layers8in the tire1according to this embodiment, the inclination angle of the cords of each second belt layer8may be the same or different from each other.", "", "In another example of the belt structure illustrated inFIG.7, the inclination angles θ2and θ3of the second belt layer8A and the second belt layer8B are the same with respect to the tire circumferential direction CD, but are inclined in different directions relative to the tire equatorial plane CL, and extend in directions that intersect with each other.", "", "Also, in the case where the inclination angles θ2and θ3are different from each other, one of the inclination angles θ2and θ3is preferably between 45° and 70°.", "", "In the tire1according to this embodiment, the position of the communication device9is not limited to any particular position in the tire radial direction, as long as it is embedded in a tire radial position, that is inner side in the tire radial direction than the tire maximum width position SWH and outer side in the tire radial direction than the outer edge position BCE of the bead core5in the tire radial direction. However, the communication device9is preferably embedded in a tire radial position, that is inner side in the tire radial direction than the outer edge of the stiffener52in the tire radial direction and outer side in the tire radial direction than the outer edge of the rubber chafers21in the tire radial direction.", "", "The above configuration more effectively ensures sufficient durability of the communication device9as well as sufficient communication of the communication device9.", "", "In addition, in the tire1according to this embodiment, belt layers may not be provided on the inner side of the first belt layer7in the tire radial direction.", "", "According to the above configuration, since the first belt layer7, which serves as the neutral axis, functions reliably as the neutral axis on the inner side in the tire radial direction, this makes it easier to control tire deformation. In this way, sufficient durability of the communication device9can be more effectively ensured.", "", "FIG.8schematically illustrates yet another example of the belt structure of the tire1according to the first embodiment.", "", "In the tire1of this embodiment, as illustrated inFIG.8, a third belt layer12with cords extending at an inclined angle θ4of 45° to 70° to the tire circumferential direction CD may be provided on the inner side of the first belt layer in the tire radial direction.", "", "When the tire1comprises the third belt layer12, the number of the first belt layer7and the second belt layer8is not limited as long as there is more than one layer, and the inclined angle θ5of the cords of the second belt layer8is not limited.", "", "In addition, inFIG.8, the third belt layer12is slightly smaller in length in the tire width direction than the first belt layer7and has the same length in the tire width direction as the second belt layer8. However, the length of the first belt layer7, the second belt layer8, and the third belt layer12in the tire width direction is not particularly limited.", "", "According to the above configuration, when the tire11rides up on a projection, curb, etc., dents occur in the tread rubber in areas where the tire comes in contact with protrusions, curbs, etc., and a tensile force to the tire width direction WD is generated on the outer side portion of the tread rubber in the tire radial direction. The third belt layer12, which is disposed on the inner side of the first belt layer in the tire radial direction, can bear the tension in the tire width direction WD, thus the distortion of the entire tire is controlled, and the durability of the communication device9embedded in the tire1can be maintained."], "claims": ["the plurality of belt layers comprise at least one first belt layer with cords extending along the tire circumferential direction, and at least one second belt layer with cords extending at an angle to the tire circumferential direction, which is arranged on the outer side in the tire radial direction than the circumferential belt layer, a communication device, having an IC chip and at least one linear antenna connected to the IC chip, is embedded at a tire radial position, that is inner side in the tire radial direction than a tire maximum width position and outer side in the tire radial direction than an outer edge position of the bead core in the tire radial direction, and the linear antenna of the communication device is arranged along the tire circumferential direction.", "2 . The tire according to claim 1 , wherein the second belt layer has two or more layers.", "3 . The tire according to claim 1 , wherein at least one layer of the second belt layers has cords extending at an inclined angle of 45° to 70° to the tire circumferential direction.", "4 . The tire according to claim 1 , comprising no belt layer on the inner side of the first belt layer in the tire radial direction.", "5 . The tire according to claim 1 , comprising a third belt layer with cords extending at an inclined angle of 45° to 70° to the tire circumferential direction on the inner side of the first belt layer in the tire radial direction.", "6 . The tire according to claim 1 , wherein the communication device is an RF tag.", "7 . The tire according to claim 2 , wherein at least one layer of the second belt layers has cords extending at an inclined angle of 45° to 70° to the tire circumferential direction.", "8 . The tire according to claim 2 , comprising no belt layer on the inner side of the first belt layer in the tire radial direction.", "9 . The tire according to claim 3 , comprising no belt layer on the inner side of the first belt layer in the tire radial direction.", "10 . The tire according to claim 2 , comprising a third belt layer with cords extending at an inclined angle of 45° to 70° to the tire circumferential direction on the inner side of the first belt layer in the tire radial direction.", "11 . The tire according to claim 3 , comprising a third belt layer with cords extending at an inclined angle of 45° to 70° to the tire circumferential direction on the inner side of the first belt layer in the tire radial direction.", "12 . The tire according to claim 2 , wherein the communication device is an RF tag.", "13 . The tire according to claim 3 , wherein the communication device is an RF tag.", "14 . The tire according to claim 4 , wherein the communication device is an RF tag.", "15 . The tire according to claim 5 , wherein the communication device is an RF tag."], "bibtex": "@patent{20240253399,\n    title = {TIRE},\n    number = {20240253399},\n    year = {2024},\n    note = {File: US20240253399A1-20240801.XML}\n    }", "classification": "B60C920FI"}, {"title": "AIRCRAFT TIRE WITH ZONED TREAD", "doc_number": "20240253400", "filename": "US20240253400A1-20240801.XML", "abstract": "The invention provides a pneumatic tire having a tire tread with a ground engaging outer surface. The tread further has a first or central tread zone located on the central or crown portion of the tread and formed of a first rubber compound. Additionally, the tread has a second or shoulder tread zone located axially outward of the first or central tread zone on each lateral end of the tread. The second or shoulder tread zone is formed of a second rubber compound. In one example, the first rubber compound has a G′ (at 50% strain) in the range of 1.6 to 1.8 MPa. In another example, the second rubber compound has a G′ (at 100% strain) in the range of 800 to 830 KPa.", "detailed_description": ["FIG.1illustrates a cross-sectional view of one half of a pneumatic tire tread10of the present invention. The tire is symmetrical about the mid-circumferential plane so that only one half is illustrated. As shown, the tire tread10is for an aircraft tire, although the invention is also applicable to other uses such as truck or off the road tires.", "", "The tire tread10defines an outer running surface12that includes a plurality of grooves14,16separated by tread blocks or ribs. The tire tread10is zoned and has a first or central tread zone30formed of a first rubber compound and is located on the central or crown portion of the tire tread10. The tire tread10further comprises a second or shoulder tread zone40formed of a second rubber compound. The second tread zone40is located axially outward of the first or central tread zone30on each lateral end of the tire tread10. The second tread zone40extends from a tire tread interface50to the shoulder region terminating at the sidewall.", "", "FIG.2illustrates a computer simulation of a comprehensive wear model illustrating the amount of wear caused by events such as takeoff, landing (touch down) taxing, turning, and braking. As shown inFIG.2, in the shoulder tread zone40at the outer lateral ends of the tire tread10, there is shown a large increase in wear.", "", "FIG.3illustrates that shoulder wear for an aircraft tire correlates strongly with high strain G′, or G′ (measured at 50%-100% strain) with an R2>0.8. G′ is the dynamic storage modulus and is a measurement of the viscoelastic properties of rubber compounds at various strain levels. G′ may be obtained using a Rubber Process Analyzer as RPA 2000™ from the Alpha Technologies. Such measurements are known to those of ordinary skill in the art. These measurements are typically made on green rubber. For example, using the RPA 2000™, a strain sweep at 100° C. at 1 Hz over a range of from 1% to 100% strain may be made.", "", "Additionally,FIG.3illustrates the shoulder wear rate for various compounds having different stiffness levels.FIG.3illustrates that the shoulder wear rate is lowest for the softer compounds, i.e., lower G′ values at high strain. In one embodiment, G′ of the second rubber compound for the shoulder or second tread zone40is selected to have a G′ (at 100% strain) in the range of 810,000 to 830,000 MPa, and more preferably about 820,000 MPa. In a second embodiment, G′ of the second rubber compound for the shoulder or second tread zone40is selected to have a G′ (at 50% strain) in the range of 1.024 to 1.028 MPa, or 1.02 MPa to 1.03 MPa, and more preferably about 1.026 MPa. In a third embodiment, G′ of the second rubber compound for the shoulder or second tread zone40is selected to have a G′ (at 100% strain) in the range of 810 to 830 KPa, or 0.81 to 0.83 MPa, and more preferably about 820 KPa, or 0.82 MPa.", "", "FIG.4illustrates the centerline wear rate for the tire tread10versus G′ at various strain levels. FromFIG.4, it has been determined that centerline wear correlates strongly with G′ at 100% strain. Centerline wear is reduced for compounds higher in stiffness, i.e., higher values of G′ (at 100% strain). Thus, for the first or central tread zone30it is preferred that the G′ (100%) of the first rubber compound be in the range of 1.2 to 1.4 MPA, and more preferably about 1.3 MPA. Additionally, for the first or central tread zone30it is preferred that the G′ (at 50% strain) of the first rubber compound be in the range of 1.6 to 1.8 MPa, more preferably, about 1.7 MPA.", "", "FIG.5illustrates the overall wear rate of the tire tread10using first and second tread zones30,40for different types of compounds. Thus, tread zoning improves the wear balance of the tire tread10, while slightly improving centerline tread wear.", "", "Accordingly, in order to improve the overall wear rate of the tire tread10, it is desired to have a first or central tread zone30formed of a first rubber compound having a G′ (50%) at least 150% greater than the G′ (at 50% strain) of the second rubber compound, and more preferably, at least 170% greater than the G′ (at 50% strain) of the second rubber compound.", "", "The first rubber compound is selected to have a greater stiffness than the second rubber compound so as to provide the tread with greater wear resistance along the first or central tread zone30, and the second rubber compound provides the tread with a softer compound that reduces shoulder wear. The interface50or dividing line between the first and second tread zones30,40is determined from modeling analysis such as shown inFIG.2. As shown inFIG.5, the tread wear is highest at the outer lateral ends of the tread, and lower in the central portion of the tread. For a typical tire tread, the first or central tread zone30is preferably at least 50-70% of the total tread arc width, and the combined outer lateral ends are preferably at least 30-50% of the total tread arc width.", "", "Referring again toFIG.5, the graph illustrates that a stiffness differential between a first rubber compound of the central or first tread zone30and a second rubber compound of the shoulder or second tread zone40is structurally critical to reducing overall tread wear. That is, where the tire tread10has a central or first tread zone30that is formed of a first rubber compound having a high G′ (measured at 50% to 100% strain) value and a shoulder or second tread zone40that at is formed of a second rubber compound having a low G′ (measured at 50% to 100% strain) value, tread wear is reduced in both the central or first tread zone30and the shoulder or second tread zone40. Stated another way, where the tire tread10has a central or first tread zone30that is formed of a first rubber compound having a high stiffness and a shoulder or second tread zone40that is formed of a second rubber compound having a low stiffness, wherein rubber compound stiffness is an isolated variable, tread wear is reduced in both the central or first tread zone30and the shoulder or second tread zone40. As a result, a tire tread having a low stiffness rubber compound applied across a full footprint of the tire tread10wears at a faster rate in a shoulder or second tread zone40than the tire tread10having the same low stiffness rubber compound applied only in the shoulder or second tread zone40and a high stiffness rubber compound in the central or first tread zone30.", "", "Simple shear G′ may be obtained using ASTM D5992 on a dynamic testing machine from Metravib Engineering. Such measurements are known to those of ordinary skill in the art. These measurements are typically made on cured rubber. For example, using the dynamic testing machine, a strain sweep at various Celsius temperatures at 10 Hz over a range of from 1% to 100% strain may be made.", "", "In an effort to effectively characterize the first and second rubber compounds across strain ranges, as shear modulus G′ is difficult to measure at 100% strain or more, tensile modulus E was measured at 0% to 200% strain of the first and second rubber compounds to supplement the shear modulus G′ data. Tensile modulus E may be obtained using ASTM D412 on a tensile tester such as a tensile tester from Instron®. Such measurements are known to those of ordinary skill in the art. These measurements are typically made on cured rubber. For example, using the tensile tester, a strain sweep at room temperature (typically 27° C.) temperatures at quasi-static conditions over a range of from 0% to material break strength strain may be made.", "", "To further improve overall wear rate of the tire tread10, in an embodiment, the central or first tread zone30is selected to have a first rubber compound having a simple shear G′ (at 50% strain), measured at 27° C. and at 10 Hz, in a range of 1.0 MPa to 2.0 MPa, and preferably about 1.7 MPa, and the shoulder or second tread zone40is selected to have a second rubber compound having a simple shear G′ (at 50% strain), measured at 27° C. and at 10 Hz, in a range of 0.6 MPa to 1.2 MPa, and preferably about 0.8 MPa. In another embodiment, the central or first tread zone30is selected to have a first rubber compound having a tensile modulus E (at 50% strain), measured at 27° C., in a range of 1.2 MPa to 2.4 MPa, and preferably about 2.0 MPa, and the shoulder or second tread zone40is selected to have a second rubber compound having a tensile modulus E (at 50% strain), measured at 27° C., in a range of 0.9 MPa to 1.7 MPa, and preferably about 1.1 MPa. In still another embodiment, the central or first tread zone30is selected to have a first rubber compound having a tensile modulus E (at 100% strain), measured at 27° C., in a range of 2.3 MPa to 4.6 MPa, and preferably about 3.8 MPa, and the shoulder or second tread zone40is selected to have a second rubber compound having a tensile modulus E (at 100% strain), measured at 27° C., in a range of 1.4 MPa to 2.6 MPa, and preferably about 1.7 MPa. In a further embodiment, the central or first tread zone30is selected to have a first rubber compound having a tensile modulus E (at 150% strain), measured at 27° C., in a range of 3.8 MPa to 7.7 MPa, and preferably about 6.4 MPa, and the shoulder or second tread zone40is selected to have a second rubber compound having a tensile modulus E (at 150% strain), measured at 27° C., in a range of 2.0 MPa to 3.8 MPa, and preferably about 2.5 MPa. In an additional embodiment, the central or first tread zone30is selected to have a first rubber compound having a tensile modulus E (at 200% strain), measured at 27° C., in a range of 5.8 MPa to 11.5 MPa, and preferably about 9.6 MPa, and the shoulder or second tread zone40is selected to have a second rubber compound having a tensile modulus E (at 200% strain), measured at 27° C., in a range of 3.0 MPa to 5.6 MPa, and preferably about 3.7 MPa.", "", "Moreover, to further improve overall wear rate of the tire tread10, in an embodiment, the central or first tread zone30is selected to have a first rubber compound having a simple shear G′ (at 50% strain), measured at 27° C. and at 10 Hz, at least 150% greater than a simple shear G′ (at 50% strain), measured at 27° C. and at 10 Hz, of a second rubber compound of the shoulder or second tread zone40. In another embodiment, the central or first tread zone30is selected to have a first rubber compound having a simple shear G′ (at 50% strain), measured at 27° C. and at 10 Hz, in a range of 125% to 325% greater than a simple shear G′ (at 50% strain), measured at 27° C. and at 10 Hz, of a second rubber compound of the shoulder or second tread zone40, preferably in a range of 210% to 325% greater, and more preferably 210% greater. In a further embodiment, the central or first tread zone30is selected to have a first rubber compound having a tensile modulus E (at 50% strain), measured at 27° C., in a range of 125% to 325% greater than a tensile modulus E (at 50% strain), measured at 27° C., of a second rubber compound of the shoulder or second tread zone40, preferably in a range of 180% to 325% greater, and more preferably 180% greater. In another embodiment, the central or first tread zone30is selected to have a first rubber compound having a tensile modulus E (at 100% strain), measured at 27° C., in a range of 125% to 325% greater than a tensile modulus E (at 100% strain), measured at 27° C., of a second rubber compound of the shoulder or second tread zone40, preferably in a range of 220% to 325% greater, and more preferably 220% greater. In an additional embodiment, the central or first tread zone30is selected to have a first rubber compound having a tensile modulus E (at 150% strain), measured at 27° C., in a range of 125% to 325% greater than a tensile modulus E (at 150% strain), measured at 27° C., of a second rubber compound of the shoulder or second tread zone40, preferably in a range of 250% to 325% greater, and more preferably 250% greater. In a still further embodiment, the central or first tread zone30is selected to have a first rubber compound having a tensile modulus E (at 200% strain), measured at 27° C., in a range of 125% to 325% greater than a tensile modulus E (at 200% strain), measured at 27° C., of a second rubber compound of the shoulder or second tread zone40, preferably in a range of 255% to 325% greater, and more preferably 255% greater.", "", "In an embodiment, the first or central tread zone30is preferably at least 50-80%, and more preferably 60-80%, of the total tread arc width, and the shoulder or second tread zones40are preferably at least 20-50%, and more preferably 20-40%, of the total tread arc width.", "", "As shown inFIG.1, the tire tread10is for a new tire. However, the zoned tire tread10of the present disclosure is also applicable to retreading, which is a process of replacing a worn tread layer on a tire with a new tread layer. In an example retread application of the present disclosure, a tire tread is the same as tire tread10in all respects and has a central or first tread zone30that is formed of the same first rubber compound as the tire tread10and a shoulder or second tread zone40that is formed of the same second rubber compound as the tire tread10. In another example retread application of the present disclosure, a tire tread is the same as tire tread10in all respects, except a central or first tread zone30is formed of a first rubber compound that is different from the tire tread10, such that that the first rubber compound may be tuned for processing differences and be less stiff or stiffer. Additionally, in the same example, a shoulder or second tread zone40is formed of a second rubber compound that is different from the tire tread10, such that that the second rubber compound may be tuned for processing differences and be less stiff or stiffer.", "", "Another benefit of the stiffness differential between the first and second rubber compounds of the central or first tread zone30and the shoulder or second tread zone40, respectively, is that the stiffness differential allows for optimization of other compound properties of the first and second rubber compounds. For example, a low stiffness second rubber compound of the shoulder or second tread zone40may be less hysteretic, which will advantageously reduce heat generation and improve dynamic integrity.", "", "Additionally, tread wear is usually considered in terms of abraidability, which is the loss of rubber resulting from mechanical action, including frictional energy, on a tread surface. The central or first tread zone30experiences a very high severity abraidability mechanism from a high-speed touchdown event, and the shoulder or second tread zone40experiences, comparatively, a much lower severity and conventional abraidability mechanism from the remaining aspects of a typical aircraft tire mission profile that consists of events, including but not limited to, takeoff, taxi, cornering, and braking events. As high and low severity abraidability are very different in mechanism, high and low severity abraidability may be independently optimized for abraidability by region within the tire tread10. When the central or first tread zone30and the shoulder or second tread zone40are targeted with a stiffness differential of 125%-325%, abrasion resistance at high and low severity can be more advantageously and independently optimized.", "", "Furthermore, a high stiffness first rubber compound in the central or first tread zone30may result in a high penetration energy to maximize cut resistance.", "", "Variations in the present invention are possible in light of the description of it provided herein. While certain representative embodiments and details have been shown for the purpose of illustrating the subject invention, it will be apparent to those skilled in this art that various changes and modifications can be made therein without departing from the scope of the subject invention. It is, therefore, to be understood that changes can be made in the particular embodiments described which will be within the full intended scope of the invention as defined by the following appended claims."], "claims": ["1 . A pneumatic tire having a tread with a ground engaging outer surface, the tread having a first tread zone and a second tread zone, wherein the first tread zone includes a central portion of the tread and the second tread zone is located adjacent the first tread zone and on each lateral end of the tread, wherein the first tread zone is formed of a first rubber compound and the second tread zone is formed of a second rubber compound, and wherein the first rubber compound has a G′ (at 50% strain) at least 150% greater than a G′ (at 50% strain) of the second rubber compound.", "2 . The pneumatic tire of claim 1 , wherein the first rubber compound has a G′ (at 50% strain) that is 150% to 325% greater than a G′ (at 50% strain) of the second rubber compound.", "3 . The pneumatic tire of claim 2 , wherein the G′ (at 50% strain) of each of the first and the second rubber compounds is measured at 27° C. and at 10 Hz.", "4 . The pneumatic tire of claim 3 , wherein the G′ (at 50% strain) of the first rubber compound is in a range of 1.0 MPa to 2.0 MPa and the G′ (at 50% strain) of the second rubber compound is in a range of 0.6 MPa to 1.2 MPa.", "5 . The pneumatic tire of claim 4 , wherein the G′ (at 50% strain) of the first rubber compound is 1.7 MPa and the G′ (at 50% strain) of the second rubber compound is 0.8 MPa.", "6 . The pneumatic tire of claim 1 , wherein an axial width of the first tread zone is in a range of 60-80% of a total arc width of the tread.", "7 . The pneumatic tire of claim 1 , wherein a combined axial width of the second tread zone on each lateral end of the tread is at least 20-40% of a total arc width of the tread.", "8 . A pneumatic tire having a tread with a ground engaging outer surface, the tread having a first tread zone and a second tread zone, wherein the first tread zone includes a central portion of the tread and the second tread zone is located adjacent the first tread zone and on each lateral end of the tread, wherein the first tread zone is formed of a first rubber compound and the second tread zone is formed of a second rubber compound, and wherein the first rubber compound has an E (at 100% strain) in a range of 125% to 325% greater than an E (at 100% strain) of the second rubber compound, wherein the E (at 100% strain) of each of the first and the second rubber compounds is measured at 27° C.", "9 . The pneumatic tire of claim 8 , wherein the E (at 100% strain) of the first rubber compound is in a range of 220% to 325% greater than the E (at 100% strain) of the second rubber compound.", "10 . The pneumatic tire of claim 9 , wherein the E (at 100% strain) of the first rubber compound is 220% greater than the E (at 100% strain) of the second rubber compound.", "11 . The pneumatic tire of claim 10 , wherein the E (at 100% strain) of the first rubber compound is in a range of 2.3 MPa to 4.6 MPa, and the E (at 100% strain) of the second rubber compound is in a range of 1.4 MPa to 2.6 MPa.", "12 . The pneumatic tire of claim 11 , wherein the E (at 100% strain) of the first rubber compound is 3.8 MPa and the E (at 100% strain) of the second rubber compound is 1.7 MPa.", "13 . The pneumatic tire of claim 8 , wherein an axial width of the first tread zone is in a range of 60-80% of a total arc width of the tread.", "14 . The pneumatic tire of claim 8 , wherein an axial width of the second tread zones is at least 20-40% of a total arc width of the tread.", "15 . A pneumatic tire having a tread with a ground engaging outer surface, the tread having a first tread zone and a second tread zone, wherein the first tread zone includes a central portion of the tread and the second tread zone is located adjacent the first tread zone and on each lateral end of the tread, wherein the first tread zone is formed of a first rubber compound and the second tread zone is formed of a second rubber compound, and wherein the first rubber compound has an E (at 150% strain) in a range of 125% to 325% greater than E (at 150% strain) of the second rubber compound, wherein the E (at 150% strain) of each of the first and the second rubber compounds is measured at 27° C.", "16 . The pneumatic tire of claim 14 , wherein the E (at 150% strain) of the first rubber compound is in a range of 250% to 325% greater than the E (at 150% strain) of the second rubber compound.", "17 . The pneumatic tire of claim 15 , wherein the E (at 150% strain) of the first rubber compound is 250% greater than the E (at 150% strain) of the second rubber compound.", "18 . The pneumatic tire of claim 16 , wherein the E (at 150% strain) of the first rubber compound is in a range of 3.8 MPa to 7.7 MPa, and the E (at 150% strain) of the second rubber compound is in a range of 2.0 MPa to 3.8 MPa.", "19 . The pneumatic tire of claim 16 , wherein the E (at 150% strain) of the first rubber compound is 6.4 MPa and the E (at 150% strain) of the second rubber compound is 2.5 MPa.", "20 . The pneumatic tire of claim 15 , wherein an axial width of the first tread zone is in a range of 60-80% of a total arc width of the tread."], "bibtex": "@patent{20240253400,\n    title = {AIRCRAFT TIRE WITH ZONED TREAD},\n    number = {20240253400},\n    year = {2024},\n    note = {File: US20240253400A1-20240801.XML}\n    }", "classification": "B60C1100FI"}]