[{"title": "VEHICLE WHEEL HAVING ADJUSTABLE INSERT NECK AND METHOD FOR MANUFACTURING THE SAME", "doc_number": "20240123760", "filename": "US20240123760A1-20240418.XML", "abstract": "A method for manufacturing a vehicle wheel includes: a casting process of manufacturing the wheel in a one-piece body having a forming end and a temporary flange protruding at inner and outer sides of the wheel, respectively, wherein the one-piece body further includes a resonance chamber forming groove; a primary shape machining process of forming a stepped part at an outer circumferential side of the resonance chamber forming groove; a flow forming process of bending the forming end to be seated on the stepped part; a friction stir welding process of integrally bonding a portion where the forming end and the stepped part are in close contact with each other; a fine machining process of removing the temporary flange; and a sound-absorbing hole machining process of forming a sound-absorbing hole for communicating between the resonance chamber and an interior space of a tire in the forming end.", "detailed_description": ["Hereinafter, exemplary embodiments of the present disclosure will be described in detail with reference to the accompanying drawings.", "", "FIGS.1A to1Gare enlarged cross-sectional diagrams of main portions sequentially illustrating a process of manufacturing a vehicle wheel according to an exemplary embodiment the present disclosure.", "", "As illustrated inFIG.1A, a vehicle wheel10, which can be manufactured through a casting process according to a predetermined design shape, has a one-piece structure in which a hollow-shaped rim part11where tires are mounted and a disc12having a spoke are integrated is manufactured through the casting process.", "", "In addition, when the wheel10having the one-piece structure is manufactured through the casting process, a forming end13for forming a resonance chamber is integrally formed to protrude from the inner location of the wheel10at the boundary between the rim part11and the disc12, a temporary flange15to be removed later is integrally formed at the outer location of the wheel10at the boundary between the rim part11and the disc12, a resonance chamber forming groove14having predetermined width and length is formed between the forming end13and the temporary flange15.", "", "The temporary flange15becomes a portion chucked in a chucking die, in other words, the temporary flange15becomes a portion clamped to be fixed, when a primary shape machining process, a flow forming process, a secondary shape machining process, a friction stir welding process, and the like for forming the resonance chamber are performed.", "", "Subsequently, as illustrated inFIG.1B, the primary shape machining process is performed to process the shape for forming the resonance chamber while smoothly machining the surfaces of the forming end13and the temporary flange15, and the surface of the resonance chamber forming groove14.", "", "At this time, the primary shape machining is performed by a known machining tool36.", "", "Particularly, based on the primary shape machining process, a stepped part16is formed so that the forming end13is bent and seated at the outer circumferential location of the resonance chamber forming groove14by the flow forming process, and the surface of the temporary flange15is processed while being easily chucked to the chucking die30.", "", "Next, as illustrated inFIG.10, the flow forming process is performed in which the forming end13is bent outward so that the end of the forming end13is seated on the stepped part16.", "", "To this end, as illustrated inFIG.2, by chucking the disc12and the temporary flange15to the chucking die30and then disposing and moving an angle of a mandrel roller32to be inclined toward a forming direction of the forming end13, that is, a direction in which the forming end13is bent to the stepped part16, the forming end13is bent and the end thereof becomes a state of being in close contact with the stepped part16.", "", "Accordingly, as the forming end13is in close contact with the stepped part16, the resonance chamber forming groove14is formed as a resonance chamber17closed by the forming end13.", "", "As the temporary flange15is chucked to a chucking die30and is supported in contact therewith, scratch or damage may occur, but since the temporary flange15is removed later as an unnecessary part of the wheel, it does not matter if scratch or damage occurs, and the temporary flange15makes it possible to stably perform the flow forming process and the friction stir welding process by maintaining the state of being chucked and supported by the chucking die30until being removed.", "", "For reference, since the resonance chamber17may be divided and formed in plural along the circumferential direction of the wheel, a partition wall may be formed between the respective resonance chambers17as indicated by reference numeral19inFIGS.1A and10.", "", "Next, as illustrated inFIG.1D, the secondary shape machining process is performed to process a portion where the forming end13is in close contact with the stepped part16into a shape accessible to a welding tool for the friction stir welding. That is, the secondary shape machining process is performed so that the outer surface of the forming end13which is in close contact with the stepped part16and the surface of the temporary flange15have the shapes easily accessible by a welding tool34for the friction stir welding (seeFIG.1E).", "", "Accordingly, through the second shape machining process, the portion where the forming end13is bent and the end thereof is in close contact with the stepped part16may be easily accessible to the welding tool34for the friction stir welding", "", "Subsequently, the friction stir welding process is performed to integrally bond the portion where the forming end13and the stepped part16are in close contact with each other.", "", "As described above, since the forming end13is bent and the end thereof is only in close contact with the stepped part16and is not bonded thereto, the portion where the end of the forming end13and the stepped part16are in close contact with each other is friction-stirred and welded by the welding tool34for forming the resonance chamber17as the completely closed space.", "", "Accordingly, the end of the forming end13and the stepped part16are integrally bonded to each other by the friction stir welding process, so that the resonance chamber17becomes the completely closed space.", "", "Next, as illustrated inFIG.1F, the fine machining process for removing the temporary flange15is performed.", "", "As described above, since the temporary flange15is only the portion which is chucked to the chucking die, when the primary shape machining process, the flow forming process, the secondary shape machining process, the friction stir welding process, and the like are performed for forming the resonance chamber and is not a substantial configuration of the wheel, the temporary flange15is finely processed and removed by a known fine machining tool.", "", "In addition, the outer surface of the forming end13and the outer surface on which the temporary flange15is removed are surface-processed by the fine machining tool according the designed shape.", "", "Next, as illustrated inFIG.1G, a sound-absorbing hole machining process is performed to form a sound-absorbing hole18for communicating between the resonance chamber17and the interior space of the tire in the forming end13.", "", "The sound-absorbing hole18may be formed through the inner end of the forming end13so as to communicate with the inner space (air filling space) of the tire mounted to the rim11.", "", "Accordingly, when the noise from the road surface during traveling of the vehicle passes through the sound-absorbing hole18through the tire and is introduced into the resonance chamber17, the phase shift for a specific frequency of noise may occur in the resonance chamber17, thereby extinguishing the noise.", "", "According to the present disclosure, after the sound-absorbing hole machining process, a process of inserting and fastening a separate insert neck20having a hollow bush shape into and to the sound-absorbing hole18may be further performed (seeFIG.3).", "", "More specifically, after the process of machining the sound-absorbing hole18communicating with the resonance chamber17, a process of further inserting and fastening the insert neck20having the selected and adjusted inner diameter and length into and to the sound-absorbing hole18may be further performed as necessary.", "", "As a result, it is possible to easily adjust the target resonance frequency for absorbing the resonance sound by the insert neck20, and in addition, by inserting and fastening the insert neck20into and to the sound-absorbing hole18, it is possible to reduce the thickness of the metal around the sound-absorbing hole18to reduce the weight of the wheel.", "", "The method for inserting and fastening the insert neck20into and to the sound-absorbing hole18will be described with reference toFIGS.3to6as follows.", "", "The insert neck20is provided by machining and adjusting the inner diameter and length of the insert neck20in advance according to the target resonance frequency for absorbing the resonance sound.", "", "That is, the insert neck20is manufactured by adjusting the inner diameter and the length thereof in advance according to different target resonance frequencies for absorbing the resonance sound, that is, different target resonance frequencies for each vehicle model or wheel type.", "", "In addition, the insert neck2may be manufactured in the previously standardized dimension in the inner diameter and length to be inserted into and fastened to the sound-absorbing hole18, thereby preventing a conventional dimensional error when the sound-absorbing hole18is processed.", "", "As illustrated inFIG.3, a first fastening method of the insert neck20thus provided may provide the insert neck20in a hollow structure having a straight tube shape to be inserted into and fastened to the sound-absorbing hole18in a forcibly fitting method, and alternatively, may apply a bonding material to the surface of the insert neck20to insert and fasten the insert neck into and to the sound-absorbing hole18.", "", "As illustrated inFIG.4, a second fastening method of the insert neck20may manufacture the insert neck20in a tapered hollow structure to be more easily press-fitted and fastened to a sound-absorbing hole18than a forcibly fitting method. As illustrated inFIG.5, a third fastening method of the insert neck20may manufacture the insert neck20in a structure in which a first uneven part21is formed on the circumference thereof by undercut machining, and also process a second uneven part22on the inner diameter portion of the sound-absorbing hole18, and then hit the insert neck20to be press-fitted into the sound-absorbing hole18, so that the first uneven part21and the second uneven part22may be engaged with and locked to each other, thereby firmly inserting and fixing the insert neck20into and to the sound-absorbing hole18.", "", "As illustrated inFIG.6, a fourth fastening method of the insert neck20may manufacture the insert neck20in a structure in which a male screw part23is formed on the circumferential portion by screw machining, form a female screw part24on the inner diameter portion of the sound-absorbing hole18by the screw machining, and then screw-fasten the insert neck20into the sound-absorbing hole18, thereby firmly inserting and fixing the insert neck20into and to the sound-absorbing hole18. Accordingly, when the noise from the road surface during traveling of the vehicle is absorbed while passing through the insert neck20through the tire and at the same time, is introduced into the resonance chamber17, the phase shift for a specific frequency of noise may occur in the resonance chamber17, thereby extinguishing the noise.", "", "Moreover, since the inner diameter and length of the insert neck20have been adjusted according to the target resonance frequency, the noise of a target resonance frequency band through the tire from the road surface may pass through the insert neck20and be introduced into the resonance chamber17to be easily extinguished, thereby improving the road noise to achieve interior quietness and the improvement in the ride comfort.", "", "Further, by inserting and fastening the insert neck20into and to the sound-absorbing hole18as described above, it is possible to reduce the thickness of the metal corresponding to the periphery of the sound-absorbing hole18(longitudinally around the sound-absorbing hole) to reduce the weight of the metal, thereby reducing the weight of the wheel.", "", "More specifically, since the minimum length of the sound-absorbing hole18needs to be secured for introducing the noise in the target resonance frequency band into the resonance chamber, as illustrated inFIG.7A, the thickness of the metal along the longitudinal direction of the sound-absorbing hole18is inevitably increased, but like the region indicated as “the portion to be reduced in weight upon casting” inFIG.7Bduring the casting process according to the present disclosure, by reducing the thickness of the metal along the longitudinal direction of the sound-absorbing hole18, it is possible to reduce the weight of the wheel.", "", "Particularly, although the minimum length of the sound-absorbing hole18is not secured by reducing the thickness of the metal along the longitudinal direction of the sound-absorbing hole18, by separately inserting the hollow-shaped insert neck into the sound-absorbing hole18, the length of the hollow hole of the insert neck may satisfy the minimum length of the sound-absorbing hole, and accordingly, the noise in the target resonance frequency band may be easily introduced into the resonance chamber17through the hollow hole of the insert neck20.", "", "Hereinabove, although the present disclosure has been described with reference to exemplary embodiments and the accompanying drawings, the present disclosure is not limited thereto, but may be variously modified and altered by those skilled in the art to which the present disclosure pertains without departing from the spirit and scope of the present disclosure claimed in the following claims."], "claims": ["a rim and a disc which are molded in a one-piece body; a resonance chamber defined at a boundary between the rim and the disc; a forming end configured to enclose the resonance chamber; and a sound-absorbing hole defined in the forming end such that the resonance chamber and an interior space of a tire communicate with each other through the sound-absorbing hole, wherein a hollow insert neck having an inner diameter and a length adjustable according to a target resonance frequency is tightly disposed in the sound-absorbing hole.", "2 . The vehicle wheel of claim 1 , wherein the insert neck has a straight tube shape.", "3 . The vehicle wheel of claim 1 , wherein the insert neck has a tapered tube shape.", "4 . The vehicle wheel of claim 1 , wherein the insert neck includes a first uneven part on a circumferential portion thereof and the sound-absorbing hole includes a second uneven part on an inner diameter portion thereof such that the first uneven part and the second uneven part are engaged and locked to each other.", "5 . The vehicle wheel of claim 1 , wherein the insert neck includes a male screw part on a circumferential portion thereof and the sound-absorbing hole includes a female screw part on an inner diameter portion thereof such that the male screw part is screw-fastened to the female screw part.", "a rim and a disc which are separately molded to be coupled to each other; a resonance chamber defined at a boundary between the rim and the disc; a forming end configured to enclose the resonance chamber; and a sound-absorbing hole defined in the forming end such that the resonance chamber and an interior space of a tire communicate with each other through the sound-absorbing hole, wherein a hollow insert neck having an inner diameter and a length adjustable according to a target resonance frequency is tightly disposed in the sound-absorbing hole."], "bibtex": "@patent{20240123760,\n    title = {VEHICLE WHEEL HAVING ADJUSTABLE INSERT NECK AND METHOD FOR MANUFACTURING THE SAME},\n    number = {20240123760},\n    year = {2024},\n    note = {File: US20240123760A1-20240418.XML}\n    }", "classification": "B60B302FI"}, {"title": "REMOVABLE AERODYNAMIC WHEEL COVER", "doc_number": "20240123761", "filename": "US20240123761A1-20240418.XML", "abstract": "A removable wheel cover includes a disc and a shaft assembly. The shaft assembly is attached to the disc. The shaft assembly includes a splined shaft, a piston, a piston spring, a push button mechanism, and an internal shaft. The piston forms an opening in which the internal shaft extends and moves therein. An exterior walled structure of the push button mechanism surrounds at least a portion of the walled structure of the piston. A walled structure of the splined shaft surrounds at least a portion of the exterior walled structure of the push button mechanism. The piston spring biases the piston in a direction away from a top surface of the push button mechanism. The push button mechanism moves to assist in unlocking the removable wheel cover indirectly or directly from a wheel.", "detailed_description": ["FIGS.1A-1Dillustrate a removable wheel cover10according to one embodiment. The removable wheel cover10includes a disc12and a splined shaft assembly30that is removably assembled or attached to the disc12in this embodiment. The removable wheel cover10is configured to provide improved aerodynamics to a wheel. Aerodynamics are important to vehicles to reduce drag and wind noise, minimize noise emission, and prevent or inhibit undesired lift forces and other causes of instabilities that occur at higher speeds. By being more aerodynamic, the vehicle runs more efficiently, yielding greater available range. The removable wheel cover10can be used on wheels of various vehicles including, but not limited to, cars, trucks and vans.", "", "The disc12as shown best inFIG.1Bis generally circular shaped. More specifically, in this embodiment, the disc12is substantially circular shaped or circular shaped. The disc is typically shaped and sized to provide improved aerodynamics to a wheel. The disc typically covers or substantially covers a rim of the wheel. It is contemplated that the disc may be of other sizes and shapes.", "", "The disc12forms a plurality of openings14a-14etherein. The plurality of openings14a-14ehas several functions. The plurality of openings14a-14eassists: (1) a user in handling the removable wheel cover when the removable wheel cover is being assembled or disassembled directly or indirectly from the wheel; and (2) in providing passive cooling to the components located within the rim, including the braking system. The plurality of openings14a-14eis generally rectangular or generally trapezoidal shaped to assist a user in handling the removable wheel cover during assembly or disassembly. It is contemplated that the plurality of openings may be other shapes and sizes.", "", "Referring toFIG.1D, the splined shaft assembly30is shown in an enlarged cross-sectional view being assembled to the disc12. The splined shaft assembly30includes a piston32, a push button mechanism40, a splined shaft60, an internal shaft70(e.g., a piston screw70in this embodiment), and a piston spring78in this embodiment.", "", "The piston32includes a walled structure34forming an opening36therethrough. The piston32has a first end32aand a second end32b. The opening36is shown as extending through the entire piston32(i.e., from the first end32ato the second end32b). It is contemplated that the opening may not extend all of the way through the piston.", "", "The opening36is sized and configured to allow the internal shaft70to extend and move therein. The piston32has a generally circular cross-sectional shape, and the opening36also has a generally circular cross-sectional shape. The opening36has a first inner diameter D1and a second inner diameter D2. The first inner diameter D1is larger than the second inner diameter D2. The transition from the first inner diameter D1to the second inner diameter D2occurs at an internal shoulder38formed in the piston32. The portion of the opening36with the second inner diameter D2is located nearer the first end32aof the piston32than the portion of the opening36with the first inner diameter D1. The piston spring78biases the piston32in a downwardly direction (in the direction of arrow A) inFIG.1D, which is away from a top surface44of the push button mechanism40. In practice, however, when the removable wheel cover10is installed directly or indirectly into a wheel, as will be discussed below, the piston spring78will bias the piston32in an inwardly direction into a wheel hub of a wheel.", "", "In the embodiment shown inFIG.1D, the internal shaft70has a head72and a threaded portion74attached to the head72. The threaded portion74includes an external thread formation76. A cross-section of the threaded portion74is generally circular shaped. As will be discussed below with respect toFIGS.4A-4C, the size of the diameter D2of the opening36assists in preventing or inhibiting the internal shaft70from being removed entirely from the opening36. Specifically, the head72of the internal shaft70abuts against the internal shoulder38of the piston32when the internal shaft is moved in the direction of arrow B. The internal shaft70is threaded onto the push button mechanism40. Thus, in this embodiment, any movement of the push button mechanism40in the direction of either arrow A or arrow B results in a corresponding movement of the internal shaft70.", "", "It is contemplated that the internal shaft may be other structures than a piston screw. For example, the internal shaft may be an unthreaded internal shaft that is attached to a push button mechanism. In another example, the internal shaft may be a structure formed integrally with the remainder of a push button mechanism. Thus, an internal shaft may be formed integrally with a remainder of a push button mechanism or attached to a push button mechanism. The internal shaft may be non-polygonal shaped (e.g., circular, oval) or polygonal shaped (e.g., square or rectangular). The shape of the opening of the piston will desirably generally correspond to the shape of the internal shaft.", "", "As will be discussed in more detail below with respect toFIGS.4A-4C, the push button mechanism40assists in unlocking the removable wheel cover10from a splined hub80in this embodiment. The push button mechanism40includes an exterior walled structure42that is bridged by the top surface44. The top surface44includes an interior walled structure46extending downwardly (in the direction of arrow A) therefrom. The interior walled structure46is configured to receive the internal shaft70. Specifically, in this embodiment, the interior walled structure46has an internal thread formation that is configured to threadingly receive the external thread formation76of the internal shaft70(a piston screw70in this embodiment). At or near an end40aopposite of the top surface44, the push button mechanism40forms a detent or recess50. The detent50in this embodiment has a generally semi-circular shape. As will be explained below, the detent50assists in unlocking the removable wheel cover10from the splined hub80in one embodiment.", "", "The exterior walled structure42of the push button mechanism40surrounds or telescopes at least a portion of the walled structure34of the piston32. As will be discussed below, the push button mechanism40generally moves in the directions of arrows A and B independently from the piston32.", "", "In this embodiment, the splined shaft assembly30further includes a button spring98. The button spring98biases the push button mechanism40in a downwardly direction (in the direction of arrow A) inFIG.1D. The amount of travel of the push button mechanism40is limited by the movement of an outward extension48that extends from the exterior walled structure42. The movement of the outward extension48is limited by an internal shoulder66of the splined shaft60in one direction and a surface12aof the disc12in the other direction. In practice, however, with a wheel, the piston spring78will bias the piston32towards a wheel hub of a wheel in an unlocked position or state.", "", "It is contemplated that a button spring may be omitted in other splined shaft assemblies. It is advantageous, however, to include a button spring because a user can more easily determine if the splined shaft assembly30is in a locked position by the position of the top surface44of the push button mechanism40. If a button spring is not used, the push button mechanism40can more freely move and may be in a position that at first glance a user believes to be in a locked position, but is in an unlocked position. If the button spring is not used, a user will need to push down (toward the wheel) on the push button mechanism to lock the removable wheel cover indirectly or directly from a wheel. The functional aspects, as will be discussed below, of locking and unlocking does not change on whether a button spring is present.", "", "Referring still toFIG.1D, the splined shaft60includes a walled structure62and an outwardly extending flange64. The outwardly extending flange64is generally perpendicular or perpendicular to the walled structure62in this embodiment. The outwardly extending flange64is located adjacent to the surface12aof the disc12. The walled structure62of the splined shaft60surrounds or telescopes at least a portion of the exterior walled structure42of the push button mechanism40.", "", "In this embodiment, as shown inFIGS.1B,1D, the outwardly extending flange64forms a plurality of threaded apertures that is configured to receive a corresponding one of a plurality of flange screws68a-68e(only one of the flange screws68ais shown inFIG.1D). The plurality of flange screws68a-68eassists in securing the splined shaft assembly30to the disc12. By removing the plurality of flange screws68a-68e, the disc12can be removed from the splined shaft assembly30. It is contemplated that the number of flange screws may vary. It is also contemplated that other fasteners may be used or other methods for attaching or removably attaching a disc and a splined shaft assembly. It is also contemplated that other methods may be used for attaching or removably attaching a disc and a splined shaft assembly.", "", "The splined shaft assembly30further includes a plurality of ball bearings94. One of the plurality of ball bearings94is shown inFIG.1D. The plurality of ball bearings94reside in a respective one of the plurality of apertures65formed in the splined shaft60. One of the plurality of apertures65formed in the splined shaft60is shown inFIG.1D. Each of the plurality of ball bearings94is generally circular in shape. As will be discussed in detail below, the plurality of ball bearings94assists in locking and unlocking the removable wheel cover10and the splined hub80in this embodiment.", "", "The number of ball bearings in the splined shaft assembly30generally varies from about 3 to about 20. The number of ball bearings is typically from about 3 to about 10, and more typically from about 4 to about 8. The ball bearings94are typically spaced equidistant around the circumference of the splined shaft60.", "", "The locking and unlocking of the removable wheel cover and the splined hub may be performed by methods other than those using ball bearings. For example, one method may include an expanding ring that assists in locking and unlocking of the removable wheel cover and the splined hub. This will be discussed below in reference toFIGS.5A-5C.", "", "The disc10may be made of different materials. Non-limiting examples of material that may form the disc include metal and polymeric metals. Examples of metallic materials include, but are not limited to, aluminum and stainless steel. Examples of polymeric materials include, but are not limited to, polyolefins (e.g., acrylonitrile butadiene styrene (ABS)), carbon-fiber reinforced polymers, and nylon (e.g., nylon-filled material). One non-limiting example of a nylon-filled material is a glass-filled nylon. It is contemplated that other polyolefins may be used in forming the disc.", "", "The splined shaft assembly30may be made of different materials. Non-limiting examples of material that may form the splined shaft assembly include metal and polymeric metals. Examples of metallic materials include, but are not limited to, aluminum and stainless steel. Examples of polymeric materials include, but are not limited to, polyolefins (e.g., acrylonitrile butadiene styrene (ABS)), carbon-fiber reinforced polymers, and nylon (e.g., nylon-filled material). One non-limiting example of a nylon-filled material is a glass-filled nylon. It is contemplated that other polyolefins may be used in forming the splined shaft assembly.", "", "Turning toFIG.2A, a removable wheel cover assembly100is shown. The removable wheel cover assembly100includes the removable wheel cover10and the splined hub80in an unattached or unlocked position. Referring specifically toFIG.2B, the splined hub80includes an exterior walled structure82, an outwardly extending flange84, and a bottom85. A nut86shown inFIG.2Bis used to threadingly engage a threaded axle end120of a vehicle as shown inFIGS.4A-4Cand to secure the splined hub80thereto. It is contemplated that the splined hub may include a threadable feature that engages with a threaded axle end of a vehicle.", "", "Referring back toFIG.2B, the exterior walled structure82forms an opening88that is sized to receive a portion of the splined shaft assembly30. The exterior walled structure82includes an exterior surface82aand an interior surface82b. The outwardly extending flange84includes an exterior surface84aand an interior surface84b. A combination of the interior surface82bof the exterior walled structure82and the interior surface84bof the outwardly extending flange84forms a plurality of detents or recesses90. In this embodiment, the plurality of detents or recesses90is an array of continuous detents or recesses. In one embodiment, the plurality of detents90extends around the entire interior surface82band the interior surface84b. Each of the plurality of detents is generally a semi-circular shape, and is sized and shaped to receive one of the plurality of ball bearings94discussed above. It is noted that the number of ball bearings94is typically much less than the number of detents90formed in the splined hub80.", "", "When the ball bearings94are received in a respective one of the detents90, the removable wheel cover10is in a locked position with the splined hub80. Each of the ball bearings94will be locked at the same time in respective different detents90of the splined hub80.", "", "It is contemplated in another embodiment that an interior surface of the exterior wall structure of the splined hub may form the plurality of detents. In a further embodiment, an interior surface of the outwardly extending flange of the splined hub may form the plurality of detents.", "", "The splined hub80may be made of different materials. Non-limiting examples of material that may form the splined hub include metal and polymeric metals. Examples of metallic materials include, but are not limited to, aluminum and stainless steel. Examples of polymeric materials include, but are not limited to, polyolefins (e.g., acrylonitrile butadiene styrene (ABS)), carbon-fiber reinforced polymers, and nylon (e.g., nylon-filled material). One non-limiting example of a nylon-filled material is a glass-filled nylon. It is contemplated that other polyolefins may be used in forming the splined hub.", "", "Referring toFIGS.3A-3C, a method of placing the removable wheel cover10and the splined hub80into a wheel100is shown. Referring initially toFIG.3A, the wheel100includes a tire102, a rim104, and a wheel hub106. The tire102, which is the width of the wheel100, surrounds the rim104. The tire102gives the wheel100a grip on a road surface. The wheel hub106is where the wheel100is attached to a remainder of the vehicle. In this embodiment, the wheel hub106includes a plurality of lug nuts108to attach the wheel100to a wheel stud of the vehicle. The wheel hub106forms an internal opening109.", "", "The initial step in this process is to secure the splined hub80to the wheel hub106. The splined hub80is threaded into the internal threaded opening109of the wheel hub106inFIG.3B. In one embodiment, the splined hub80is threaded into a threaded axle end via the internal threaded opening109. The removable wheel cover10is then attached or assembled with the splined hub80. This is depicted inFIG.3C.", "", "The process of locking and unlocking the removable wheel cover10to the splined hub80is shown in conjunction with various cross-sectional views ofFIGS.4A-4C. Referring initially toFIG.4A, the splined hub80is threadingly engaged with a threaded axle end120. More specifically, the nut86threadingly engages to the threaded axle end120and secures the splined hub80.", "", "Referring still toFIG.4A, a user presses on the top surface44of the push button mechanism40in the direction of arrow A, which is in the direction of the splined hub80threaded into the threaded axle end120. Thus, the removable wheel cover10is moving in the direction of arrow A towards the splined hub80and the threaded axle end120.", "", "As the removable wheel cover10continues moving toward the splined hub80, an end32aof the piston32contacts the threaded axle end120as shown inFIG.4B. The top surface44of the push button mechanism40is popped up (direction of arrow B) at this point in the process. More, specifically, the top surface44of the push button mechanism40extends above (in the direction away from the splined hub80) the remainder of the removable wheel cover10. This indicates to a user that the removable wheel cover10is locked into the splined hub80. In the locked position, the ball bearing94is located both in the detent90of the splined hub80and the aperture65formed in the splined shaft60. With the ball bearing94being partially in the detent90of the splined hub80, a user cannot remove the removable wheel cover10from the splined hub80without pressing on the push button mechanism40.", "", "To unlock the removable wheel cover10from the splined hub80, a user presses the top surface44of the push button mechanism40in the direction of arrow A inFIG.4B. When the top surface44is pressed downwardly (in the direction of arrow A), the ball bearing94is biased inwardly (in the direction of arrow C) from the detent90of the splined hub80and into the detent50and the aperture65(see alsoFIG.1Din a locked position). After the user presses the top surface44of the push button mechanism40in the direction of arrow A, the removable wheel cover10is unlocked as shown inFIG.4C, which enables a user to move the removable wheel cover10in the direction of arrow B (away from the splined hub80) to the position ofFIG.4A. In one embodiment, to assist in removing the removable wheel cover, a disc may be sized and shaped to have a spring force that deflects from the tire. In another embodiment, a disc may be sized and shaped not to contact the tire on unlocking from the splined hub.", "", "Thus, a method of installing a removable wheel cover assembly into a wheel in one embodiment includes providing a removable wheel cover and providing a splined hub. The splined hub is secured onto a wheel. The removable wheel cover is placed into an opening in the splined hub such that the removable wheel cover locks with the splined hub.", "", "Thus, the process of locking and unlocking the removable wheel cover10can be performed in the absence of any tooling. It is noted, however, that a tool is required for threading of the splined hub80onto the threaded axle end120. The splined hub, however, is configured to remain in place after initial installation onto the threaded axle end.", "", "In an effort to mitigate unwelcome wheel cover removal, a key locking mechanism may be desirable in other embodiments. Such a mechanism may be achieved via a key lock assembly located within the push button mechanism allowing an arm or a plurality of arms to rotate, via key turn, into a groove formed within the splined shaft. Such a configuration would lock the wheel cover to the wheel and would prevent or inhibit removal of the wheel cover without using the key. It is contemplated that other locking mechanisms may be used.", "", "As mentioned above, instead of using ball bearings, an expanding ring may be used that assists in locking and unlocking the removable wheel cover and the splined hub. Referring toFIGS.5A-5C, a removable wheel cover110is depicted that includes an expanding ring124. The removable wheel cover110is almost identical to the removable wheel cover10except that the expanding ring124replaces the plurality of wheel bearings94. The expanding ring124in one embodiment is continuous around the circumference of splined shaft160. The splined shaft160forms a continuous aperture165around its circumference and is configured to receive the expanding ring124. Otherwise, the splined shaft160is the same as described above with the splined shaft60. The push button mechanism140forms a continuous detent150around its circumference and functions in a similar manner as the detent50described above in locking and unlocking the removable wheel cover10. Otherwise, the push button mechanism140is the same as described above with the push button mechanism40.", "", "The locking and unlocking of the removable wheel cover inFIGS.5A-5Cis the same as described above inFIGS.4A-4Cexcept the locking and unlocking is performed using the expanding ring124instead of the plurality of ball bearings94.FIG.5Bshows the removable wheel cover is in a locked position, whileFIG.5Cis in an unlocked position.", "", "In another embodiment, a wheel200includes an integrated splined hub280as shown inFIG.6A. The wheel200includes a tire202, a rim204, and a wheel hub206. The tire202, which is the width of the wheel200, surrounds the rim204. The wheel hub206is where the wheel200is attached to a vehicle. The wheel hub206is shown in more detail inFIG.6B. The wheel hub206includes a plurality of lug nuts208a-ethat attaches the wheel200to a wheel stud of the vehicle. A portion of the wheel hub206forms the integrated splined hub280that includes an opening282therein. The integrated splined hub280includes a plurality of detents290formed on an exterior surface. The integrated splined hub280is integral with the wheel hub206and, thus, cannot be removed.", "", "The integrated splined hub280functions in the same or similar manner as the splined hub80discussed above. Thus, the integrated splined hub280is configured to receive the removable wheel cover10and assists in locking and unlocking the removable wheel cover10. More specifically, the integrated splined hub280is configured to receive a portion of the splined shaft assembly30. The detents290of the integrated splined hub280function in the same manner as the detents90discussed above in locking and unlocking the removable wheel cover10.", "", "Thus, a method of installing a removable wheel cover assembly into a wheel in this embodiment includes providing a removable wheel cover. The removable wheel cover is placed into an opening of the integrated splined hub. A top surface of the push button mechanism of the removable wheel cover is pressed until the removable wheel cover locks with the integrated splined hub.", "", "In a further embodiment, a splined hub380is shown inFIGS.7A,7B. The splined hub380is shown inFIGS.7A,7Bas being inserted into an expanding clamp395. The expanding clamp395inFIG.7Ais in a closed state or position, while the expanding clamp inFIG.7Bis in an open state or position after having received the splined hub380.", "", "The splined hub380is used in conjunction with a fastener392(e.g., screw392in this embodiment). The splined hub380includes an exterior walled structure382, an outwardly extending flange384and a bottom385. The bottom385forms an opening that allows the screw392to extend therethrough. The screw392assists in attaching the splined hub380and the expanding clamp395.", "", "The exterior walled structure382forms an opening388that is sized to receive a portion of the splined shaft assembly30. The exterior walled structure382includes an exterior surface382aand an interior surface382b. The outwardly extending flange384includes an exterior surface384aand an interior surface384b. The combination of the interior surface382bof the exterior walled structure382and the interior surface384bof the outwardly extending flange384forms a plurality or an array of detents or recesses390. In one embodiment, the plurality of detents390extends around the entire interior surface382band the interior surface384b. Each of the plurality of detents390is generally a semi-circular shape, and is sized and shaped to receive one of the plurality of ball bearings94as discussed above. When the ball bearings94are received in a respective one of the detents390, the removable wheel cover10is in a locked position with the splined hub380.", "", "Referring toFIGS.8A-8C, the removable wheel cover10, including the disc12and the splined shaft assembly30, is shown being assembled with the splined hub380. Referring toFIG.8A, a user presses on the top surface44of the push button mechanism40in the direction of arrow A, which is in the direction of the splined hub380. Thus, the removable wheel cover10is moving in the direction of arrow A towards the splined hub380.", "", "As the removable wheel cover10continues moving toward the splined hub380, an end32aof the piston32contacts a top portion of the bottom385of the splined hub380and a portion of the screw392. The top surface44of the push button mechanism40is popped up at this point in the process. More, specifically, the top surface44of the push button mechanism40extends above (in the direction away from the splined hub380) the remainder of the removable wheel cover10. This indicates to a user that the removable wheel cover10is locked into the splined hub380. In the locked position, the ball bearing94is located in the detent390of the splined hub380and the aperture65formed in the splined shaft60. With the ball bearing94being partially in the detent390of the splined hub380, a user cannot remove the removable wheel cover10from the splined hub380without pressing on the push button mechanism40.", "", "To unlock the removable wheel cover10from the splined hub380, a user presses the top surface44of the push button mechanism40in the direction of arrow A inFIG.8B. When the top surface44is pressed downwardly (in the direction of arrow A), the ball bearing94is biased inwardly (in the direction of arrow C) from the detent390of the splined hub380and into the detents50and the aperture65(see alsoFIG.1Din the locked position). After the user presses the top surface44of the push button mechanism40in the direction of arrow A, the removable wheel cover10is unlocked, which enables a user to move the removable wheel cover10in the direction of arrow B (away from the splined hub380) to the position ofFIG.8A.", "", "Thus, a method of installing a removable wheel cover assembly into a wheel in one embodiment includes providing a removable wheel cover and providing a splined hub. The splined hub is secured into a wheel with the assistance of the expanding clamp. The removable wheel cover is placed into an opening of the splined hub. A top surface of the push button mechanism of the removable wheel cover is pressed until the removable wheel cover locks with the splined hub.", "", "FIGS.8A-8Calso depict an axle screw402that extends through an opening formed in a wheel bearing assembly404. A disc brake rotor406is located between the wheel bearing assembly404and a wheel400. A lug nut408attaches the wheel bearing assembly404to the wheel400.", "", "While the foregoing written description of the invention enables one of ordinary skill to make and use what is considered presently to be the best mode thereof, those of ordinary skill will understand and appreciate the existence of variations, combinations, and equivalents of the specific embodiment, method, and examples herein. The invention should therefore not be limited by the above described embodiment, method, and examples, but by all embodiments and methods within the scope and spirit of the invention."], "claims": ["a disc; and a shaft assembly being attached to the disc, the shaft assembly including a splined shaft, a piston, a piston spring, a push button mechanism, and an internal shaft, the piston including a walled structure forming an opening in which the internal shaft extends and moves therein, the push button mechanism further including an exterior walled structure that is bridged by a top surface, the exterior walled structure of the push button mechanism surrounding at least a portion of the walled structure of the piston, the splined shaft including a walled structure, the walled structure of the splined shaft surrounding at least a portion of the exterior walled structure of the push button mechanism, the piston spring biasing the piston in a direction away from the top surface of the push button mechanism, wherein the push button mechanism is configured to move to assist in unlocking the removable wheel cover indirectly or directly from a wheel.", "2 . The wheel cover of claim 1 , wherein the disc is generally circular.", "3 . The wheel cover of claim 1 , wherein the disc forms a plurality of apertures therein.", "4 . The wheel cover of claim 1 , wherein the shaft assembly further includes a button spring, the button spring biasing the top surface of the push button mechanism in a direction toward the piston in an unlocked position.", "5 . The wheel cover of claim 1 , wherein the shaft assembly is removably attached to the disc.", "6 . The wheel cover of claim 5 , wherein the shaft assembly is removably attached to the disc via at least one screw.", "7 . The wheel cover of claim 1 , wherein the internal shaft is a piston screw.", "8 . The wheel cover of claim 1 , wherein the shaft assembly further includes a plurality of ball bearings, the plurality of ball bearings assisting in locking and unlocking the removable wheel cover indirectly or directly from the wheel.", "9 . The wheel cover of claim 8 , wherein the splined shaft includes at least one opening and the push button mechanism includes at least one detent, the at least one opening of the splined shaft and the at least one detent of the push button mechanism configured to receive at least a portion of each of the plurality of ball bearings and assist in unlocking the removable wheel cover indirectly or directly from the wheel.", "10 . The wheel cover of claim 1 , wherein the push button mechanism includes a plurality of detents, each of the plurality of detents having a semi-circular cross section.", "11 . The wheel cover of claim 1 , wherein the shaft assembly further includes an expanding ring, the expanding ring assisting in locking and unlocking the removable wheel cover indirectly or directly from the wheel.", "12 . The wheel cover of claim 1 , wherein the shaft assembly is a splined shaft assembly.", "13 . The wheel cover of claim 1 , wherein the removable wheel cover is directly locked to the wheel.", "14 . The wheel cover of claim 1 , wherein the removable wheel cover is indirectly locked to the wheel.", "a removable wheel cover including a disc and a splined shaft assembly, the splined shaft assembly being attached to the disc, the splined shaft assembly including a splined shaft, a piston, a piston spring, a push button mechanism, and an internal shaft, the piston including a walled structure forming an opening in which the internal shaft extends and moves therein, the push button mechanism further including an exterior walled structure that is bridged by a top surface, the exterior walled structure of the push button mechanism surrounding at least a portion of the walled structure of the piston, the splined shaft including a walled structure, the walled structure of the splined shaft surrounding at least a portion of the exterior walled structure of the push button mechanism, the piston spring biasing the piston in a direction away from the top surface of the push button mechanism; and a splined hub including a walled structured with an opening formed therein, the opening of the splined hub configured to receive a portion of the piston of the removable wheel cover, the splined hub being configured to be attached to a wheel, wherein the removable wheel cover is configured to be locked and unlocked with the splined hub, wherein the splined hub further includes a detent to assist in locking with the removable wheel cover.", "16 . The removable wheel cover assembly of claim 15 , wherein the splined hub is configured to be removably attached to the wheel.", "17 . The removable wheel cover assembly of claim 15 , wherein the splined hub is attached to the wheel via a nut.", "18 . The removable wheel cover assembly of claim 15 , wherein the shaft assembly further includes a button spring, the button spring biasing the top surface of the push button mechanism in a direction toward the piston.", "19 . The removable wheel cover assembly of claim 15 , wherein the internal shaft is a piston screw.", "20 . The removable wheel cover assembly of claim 15 , wherein the shaft assembly further includes a plurality of ball bearings, the plurality of ball bearings assisting in locking and unlocking the removable wheel cover indirectly or directly from the wheel.", "21 . The removable wheel cover assembly of claim 15 , wherein the push button mechanism includes a plurality of detents, each of the plurality of detents having a semi-circular cross section.", "22 . The removable wheel cover assembly of claim 15 , wherein the shaft assembly further includes an expanding ring, the expanding ring assisting in locking and unlocking the removable wheel cover indirectly or directly from the wheel.", "a wheel including a tire, a rim and a wheel hub; and a removable wheel cover including a disc and a shaft assembly, the shaft assembly being attached to the disc, the shaft assembly including a splined shaft, a piston, a piston spring, a push button mechanism, and an internal shaft, the piston including a walled structure forming an opening in which the internal shaft extends and moves therein, the push button mechanism further including an exterior walled structure that is bridged by a top surface, the exterior walled structure of the push button mechanism surrounding at least a portion of the walled structure of the piston, the splined shaft including a walled structure, the walled structure of the splined shaft surrounding at least a portion of the exterior walled structure of the push button mechanism, the piston spring biasing the piston in a direction away from the top surface of the push button mechanism, wherein the push button mechanism is configured to move to assist in unlocking the removable wheel cover indirectly or directly from a wheel.", "24 . The wheel assembly of claim 23 , wherein the removable wheel cover is configured to be locked and unlocked directly with the wheel.", "25 . The wheel assembly of claim 24 , wherein the wheel hub forms an integrated splined hub, the integrated splined hub forming an opening, the opening of the integrated splined hub forming at least one detent to assist in locking and unlocking the removable wheel cover and the wheel.", "26 . The wheel assembly of claim 25 , wherein the at least one detent of the wheel hub is a plurality of detents.", "27 . The wheel assembly of claim 23 further comprising a splined hub, the splined hub including a walled structured with an opening formed therein, the opening of the splined hub configured to receive a portion of the piston of the removable wheel cover, the splined hub being configured to be removably attached to the wheel hub, and wherein the push button mechanism is configured to move to assist in unlocking the removable wheel cover indirectly from a wheel.", "28 . The wheel assembly of claim 23 further including an expanding clamp positioned in an opening formed in the wheel hub, the splined hub being attached to the expanding clamp via a fastener.", "providing a removable wheel cover including a disc and a shaft assembly, the shaft assembly being attached to the disc, the shaft assembly including a splined shaft, a piston, a piston spring, a push button mechanism, and an internal shaft, the piston including a walled structure forming an opening in which the internal shaft extends and moves therein, the push button mechanism further including an exterior walled structure that is bridged by a top surface, the exterior walled structure of the push button mechanism surrounding at least a portion of the walled structure of the piston, the splined shaft including a walled structure, the walled structure of the splined shaft surrounding at least a portion of the exterior walled structure of the push button mechanism, the piston spring biasing the piston in a direction away from the top surface of the push button mechanism; providing a splined hub, the splined hub including a walled structured with an opening formed therein; securing the splined hub into a wheel; placing the removable wheel cover into an opening in the splined hub such that the removable wheel cover locks with the splined hub.", "30 . The method of claim 29 further including pressing on the push button mechanism to unlock the removeable wheel cover and the splined hub.", "31 . The method of claim 30 , wherein the placing of the removable wheel cover into the opening of the wheel hub such that the removable wheel cover locks with the splined hub and unlocking the removeable wheel cover and the splined hub is performed in the absence of tooling."], "bibtex": "@patent{20240123761,\n    title = {REMOVABLE AERODYNAMIC WHEEL COVER},\n    number = {20240123761},\n    year = {2024},\n    note = {File: US20240123761A1-20240418.XML}\n    }", "classification": "B60B706FI"}, {"title": "REMOVABLE AERODYNAMIC WHEEL COVER", "doc_number": "20240123762", "filename": "US20240123762A1-20240418.XML", "abstract": "A removable wheel cover includes a disc and a shaft assembly. The shaft assembly is attached to the disc. The shaft assembly includes an outer shaft, a contact ring spring, a push button mechanism, and a contact ring. The outer shaft includes a walled structure. The push button mechanism further includes a body including a top surface. The walled structure of the outer shaft surrounds at least a portion of the body of the push button mechanism. The contact ring spring biases the contact ring in a direction away from the top surface of the push button mechanism. The contact ring spring further biases the push button mechanism in a direction opposite of the contact ring. The push button mechanism moves to assist in unlocking the removable wheel cover and a wheel.", "detailed_description": ["FIGS.1A-1Dillustrate a removable wheel cover10according to one embodiment. The removable wheel cover10includes a disc12and a shaft assembly30that is removably assembled or attached to the disc12in this embodiment. The removable wheel cover10is configured to provide improved aerodynamics to a wheel. Aerodynamics are important to vehicles to reduce drag and wind noise, minimize noise emission, and prevent or inhibit undesired lift forces and other causes of instabilities that occur at higher speeds. By being more aerodynamic, the vehicle runs more efficiently, yielding greater available range. The removable wheel cover10can be used on wheels of various vehicles including, but not limited to, cars, trucks and vans.", "", "The disc12as shown best inFIG.1Bis generally circular shaped. More specifically, in this embodiment, the disc12is substantially circular shaped or circular shaped. The disc is typically shaped and sized to provide improved aerodynamics to a wheel. The disc typically covers or substantially covers a rim of the wheel. It is contemplated that the disc may be of other sizes and shapes.", "", "As shown inFIGS.1B,1C, for example, the disc12includes a disc flange16. The disc flange16is located in a general central portion of the disc12. The disc12forms a plurality of openings14a-14etherein. The plurality of openings14a-14ehas several functions. The plurality of openings14a-14eassists: (1) a user in handling the removable wheel cover when the removable wheel cover is being assembled or disassembled directly with the wheel; and (2) in providing passive cooling to the components located within the rim, including the braking system. The plurality of openings14a-14eis generally rectangular or generally trapezoidal shaped to assist a user in handling the removable wheel cover during assembly or disassembly. It is contemplated that the plurality of openings may be other shapes and sizes.", "", "Referring toFIG.1D, the shaft assembly30is shown in an enlarged cross-sectional view being assembled to the disc12. The shaft assembly30includes a push button mechanism40, an outer shaft60, a contact ring70, and a contact ring spring78in this embodiment. The shaft assembly30is shown inFIG.4in an exploded view without springs.", "", "The contact ring spring78biases the contact ring70in a downwardly direction (in the direction of arrow A) inFIG.1D, which is away from a top surface44of the push button mechanism40. In practice, however, when the removable wheel cover10is installed into a wheel, as will be discussed below, the contact ring spring78biases the contact ring70in an inwardly direction into a wheel hub of a wheel.", "", "The contact ring spring78also further biases the push button mechanism40in a direction opposite of the contact ring70. In practice, however, when the removable wheel cover10is installed directly into a wheel, as will be discussed below, the contact ring spring78will bias the push button mechanism70in an outwardly direction away from a wheel hub of a wheel.", "", "As will be discussed in more detail below with respect toFIGS.3A-3D, the push button mechanism40assists in unlocking the removable wheel cover10and the wheel100in this embodiment. The push button mechanism40includes a body42that includes the top surface44. It is contemplated that the push button mechanism may be formed by a walled structure instead of a body, such as a solid body.", "", "The body42includes an outward extension46extending outwardly and upwardly (direction of arrow B) therefrom. At or near an end40aopposite of the top surface44, the push button mechanism40forms a lower extension50extending slightly outwardly and downwardly (in the direction of arrow A). The lower extension50is configured to assist in locking the removable wheel cover10with the wheel100.", "", "In this embodiment, the shaft assembly30further includes a button spring98. The button spring98biases the push button mechanism40in a downwardly direction (in the direction of arrow A) inFIG.1D. The amount of travel of the push button mechanism40is limited by the movement of the outward extension46that extends from the body42. The movement of the outward extension46is limited by an internal shoulder66of the outer shaft60in one direction and a surface12aof the disc12in the other direction. In practice, however, with a wheel, the contact ring spring78will bias the contact ring70towards the wheel100in an unlocked position or state.", "", "It is contemplated that a button spring may be omitted in other shaft assemblies. It is advantageous, however, to include a button spring because a user can more easily determine if the shaft assembly30is in a locked position by the position of the top surface44of the push button mechanism40. If a button spring is not used, the push button mechanism40can more freely move and may be in a position that at first glance a user believes to be in a locked position, but is in an unlocked position. If the button spring is not used, a user will need to push down (toward the wheel) on the push button mechanism to lock the removable wheel cover and the wheel. The functional aspects, as will be discussed below, of locking and unlocking does not change on whether a button spring is present.", "", "Referring still toFIG.1D, the outer shaft60includes a walled structure62and an outwardly extending flange64. The outwardly extending flange64is generally perpendicular or perpendicular to the walled structure62in this embodiment. The outwardly extending flange64is located adjacent to the surface12aof the disc12. The walled structure62of the outer shaft60surrounds or telescopes at least a portion of the body42of the push button mechanism40. The walled structure62of the outer shaft60also abuts the outward extension46in this embodiment.", "", "As shown inFIGS.1B,1D, the outwardly extending flange64forms a plurality of threaded apertures that is configured to receive a corresponding one of a plurality of flange screws68a-68e(only one of the flange screws68ais shown inFIG.1D). The plurality of flange screws68a-68eassists in securing the shaft assembly30to the disc12. By removing the plurality of flange screws68a-68e, the disc12can be removed from the shaft assembly30. It is contemplated that the number of flange screws may vary. It is also contemplated that other fasteners may be used or other methods for attaching or removably attaching a disc and an outer shaft assembly. It is also contemplated that other methods may be used for attaching or removably attaching a disc and an outer shaft assembly.", "", "The shaft assembly30further includes a plurality of ball bearings94. One of the plurality of ball bearings94is shown inFIG.1D. The plurality of ball bearings94resides in a respective one of the plurality of apertures65formed in the outer shaft60. One of the plurality of apertures65formed in the outer shaft60is shown inFIG.1D. Each of the plurality of ball bearings94is generally circular in shape. As will be discussed in detail below, the plurality of ball bearings94assists in locking and unlocking the removable wheel cover10and the wheel100in this embodiment. When the ball bearings94are received in an opening65of the outer shaft60and are underneath an undercut formed in the wheel hub, the removable wheel cover10is in a locked position with the wheel100. Each of the ball bearings94will be locked at the same time in respective openings65of the outer shaft60. These openings65are shown best inFIG.4and are sized to allow a respective one of the ball bearings to extend therethrough and assist in locking the shaft assembly30and the wheel100.", "", "The number of ball bearings in the shaft assembly30generally varies from about 3 to about 20. The number of ball bearings is typically from about 3 to about 10, and more typically from about 4 to about 8. The ball bearings94are typically spaced equidistant around the circumference of an outer shaft60.", "", "The locking and unlocking of the removable wheel cover and the wheel may be performed by methods other than those using ball bearings. In one non-limiting example, a continuous ring or a plurality of rings may be used that would extend through, for example, a groove or a plurality of openings formed in the outer shaft.", "", "The disc10may be made of different materials. Non-limiting examples of material that may form the disc include metal and polymeric metals. Examples of metallic materials include, but are not limited to, aluminum and stainless steel. Examples of polymeric materials include, but are not limited to, polyolefins (e.g., acrylonitrile butadiene styrene (ABS)), carbon-fiber reinforced polymers, and nylon (e.g., nylon-filled material). One non-limiting example of a nylon-filled material is a glass-filled nylon. It is contemplated that other polyolefins may be used in forming the disc.", "", "The shaft assembly30including the outer shaft60, the contact ring70and the push button mechanism40may be made of different materials. Non-limiting examples of material that may form the shaft assembly include metal and polymeric metals. Examples of metallic materials include, but are not limited to, aluminum and stainless steel. Examples of polymeric materials include, but are not limited to, polyolefins (e.g., acrylonitrile butadiene styrene (ABS)), carbon-fiber reinforced polymers, and nylon (e.g., nylon-filled material). One non-limiting example of a nylon-filled material is a glass-filled nylon. It is contemplated that other polyolefins may be used in forming the shaft assembly.", "", "Referring toFIGS.2A-2C, a method of placing the removable wheel cover10into a wheel100is shown. Referring initially toFIG.2A, the wheel100includes a tire102, a rim104, and a wheel hub106. The tire102, which is the width of the wheel100, surrounds the rim104. The tire102gives the wheel100a grip on a road surface. The wheel hub106is where the wheel100is attached to a remainder of the vehicle. In this embodiment, the wheel hub106includes a plurality of lug nuts108to attach the wheel100to a wheel stud of the vehicle. The wheel hub106forms an internal opening109.FIG.2Bshows the wheel100during the process of assembling the removable wheel cover10, whileFIG.2Cshows the wheel100and the removable wheel cover10being in an assembled state.", "", "The process of locking and unlocking the removable wheel cover10to the wheel100is shown in conjunction with various cross-sectional views ofFIGS.3A-3E. Referring initially toFIG.3A, the process of locking the removable wheel cover10has begun by moving the removable wheel cover10towards the wheel100(in the direction of arrow A inFIG.3A).", "", "As the removable wheel cover10continues moving toward the threaded axle end120, the contact ring70contacts inner surface106aof the wheel hub106of the wheel100as shown inFIG.3B. The contact ring70provides a solid surface from which pressure can be applied during the installation of the shaft assembly30into the wheel100. The top surface44of the push button mechanism40is popped up (direction of arrow B inFIG.3C) at this point in the process. More, specifically, the top surface44of the push button mechanism40extends above the remainder of the removable wheel cover10, which is in the direction away from the threaded axle end120. This indicates to a user that the removable wheel cover10is locked into the wheel100.", "", "In the locked position ofFIG.3C, the ball bearing94is located in the opening65of the outer shaft60. More specifically, each of the ball bearings94is located in a respective one of the openings65of the outer shaft60. Each of the ball bearings94is located underneath an undercut106bof the wheel hub106that prevents or inhibits movement of the shaft assembly30from moving in the direction of arrow B. Each of the ball bearings94has moved outwardly from their original position ofFIG.3A. An end50aof the lower extension50in this position ofFIG.3Ccontacts the ball bearing94to assist in preventing or inhibiting movement of the ball bearing94. With the ball bearing94being in the position ofFIG.3C(locked), a user cannot remove the removable wheel cover10from the wheel100without pressing on the push button mechanism40.", "", "To unlock the removable wheel cover10from the wheel100, a user presses the top surface44of the push button mechanism40in the direction of arrow A. When the top surface44is pressed downwardly (in the direction of arrow A), the ball bearing94is biased upwardly (direction of arrow B) and inwardly from the position ofFIG.3C(locked) toFIG.3D(unlocked). This moves the ball bearings94from the respective openings65of the outer shaft60. After the user presses the top surface44of the push button mechanism40in the direction of arrow A, the removable wheel cover10is unlocked as shown inFIG.3D, which enables a user to move the removable wheel cover10in the direction of arrow B (away from the threaded axle end120) to the position ofFIG.3A. In one embodiment, to assist in removing the removable wheel cover, a disc may be sized and shaped to have a spring force that deflects from the tire.", "", "Thus, a method of installing a removable wheel cover assembly into a wheel in one embodiment includes providing a removable wheel cover. The removable wheel cover is placed into an opening in the wheel hub such that the removable wheel cover locks with the wheel. The removeable wheel cover is unlocked in this method by pressing on the push button mechanism. Thus, the process of locking and unlocking the removable wheel cover10can be performed in the absence of any tooling.", "", "In an effort to mitigate unwelcome wheel cover removal, a key locking mechanism may be desirable in other embodiments. Such a mechanism may be achieved via a key lock assembly located within the push button mechanism allowing an arm or a plurality of arms to rotate, via key turn, into a groove formed within the outer shaft. Such a configuration would lock the wheel cover to the wheel and would prevent or inhibit removal of the wheel cover without using the key. It is contemplated that other locking mechanisms may be used.", "", "While the foregoing written description of the invention enables one of ordinary skill to make and use what is considered presently to be the best mode thereof, those of ordinary skill will understand and appreciate the existence of variations, combinations, and equivalents of the specific embodiment, method, and examples herein. The invention should therefore not be limited by the above described embodiment, method, and examples, but by all embodiments and methods within the scope and spirit of the invention."], "claims": ["a disc; and a shaft assembly being attached to the disc, the shaft assembly including an outer shaft, a contact ring spring, a push button mechanism, and a contact ring, the outer shaft included a walled structure, the push button mechanism further including a body including a top surface, the walled structure of the outer shaft surrounding at least a portion of the body of the push button mechanism, the contact ring spring biasing the contact ring in a direction away from the top surface of the push button mechanism, the contact ring spring further biasing the push button mechanism in a direction opposite of the contact ring, wherein the push button mechanism is configured to move to assist in unlocking the removable wheel cover and a wheel.", "2 . The wheel cover of claim 1 , wherein the disc is generally circular.", "3 . The wheel cover of claim 1 , wherein the disc forms a plurality of apertures therein.", "4 . The wheel cover of claim 1 , wherein the shaft assembly further includes a button spring, the button spring biasing the top surface of the push button mechanism in a direction toward the wheel in an unlocked position.", "5 . The wheel cover of claim 1 , wherein the shaft assembly is removably attached to the disc.", "6 . The wheel cover of claim 5 , wherein the shaft assembly is removably attached to the disc via at least one screw.", "7 . The wheel cover of claim 1 , wherein the shaft assembly further includes a plurality of ball bearings, the plurality of ball bearings assisting in locking and unlocking the removable wheel cover and the wheel.", "8 . The wheel cover of claim 7 , wherein the outer shaft includes at least one opening, the at least one opening of the outer shaft configured to receive at least a portion of each of the plurality of ball bearings, the outer shaft and the push button mechanism assist in locking and unlocking the removable wheel cover and the wheel.", "9 . The wheel cover of claim 1 , wherein the push button mechanism includes a lower extension located opposite of the top surface, the lower extension extending outwardly and configured to assist in locking the removable wheel cover and the wheel.", "10 . The wheel cover of claim 1 , wherein the removable wheel cover is directly locked to the wheel.", "a wheel including a tire, a rim and a wheel hub; and a removable wheel cover including a disc and a shaft assembly, the shaft assembly being attached to the disc, the shaft assembly including an outer shaft, a contact ring spring, a push button mechanism, and a contact ring, the outer shaft included a walled structure, the push button mechanism further including a body including a top surface, the walled structure of the outer shaft surrounding at least a portion of the body of the push button mechanism, the contact ring spring biasing the contact ring in a direction away from the top surface of the push button mechanism, the contact ring spring further biasing the push button mechanism in a direction opposite of the contact ring, wherein the push button mechanism is configured to move to assist in unlocking the removable wheel cover from a wheel.", "12 . The wheel assembly of claim 11 , wherein the removable wheel cover is configured to be locked and unlocked directly with the wheel.", "13 . The wheel assembly of claim 11 , wherein the wheel hub forms an undercut, the shaft assembly further including a plurality of ball bearings, each of the plurality of ball bearings configured to contact the undercut formed in the wheel hub to assist in locking the removable wheel cover and the wheel.", "14 . The wheel assembly of claim 11 , wherein the shaft assembly further includes a button spring, the button spring biasing the top surface of the push button mechanism in a direction toward the wheel in an unlocked position.", "15 . The wheel assembly of claim 11 , wherein the shaft assembly further includes a plurality of ball bearings, the plurality of ball bearings assisting in locking and unlocking the removable wheel cover and the wheel.", "16 . The wheel assembly of claim 15 , wherein the outer shaft includes at least one opening, the at least one opening of the outer shaft configured to receive at least a portion of each of the plurality of ball bearings, the outer shaft and the push button mechanism assist in unlocking the removable wheel cover and the wheel.", "17 . The wheel assembly of claim 15 , wherein the push button mechanism includes a lower extension located opposite of the top surface, the lower extension extending outwardly and configured to contact the plurality of ball bearings in a locked position.", "providing a removable wheel cover including a disc and a shaft assembly, the shaft assembly being attached to the disc, the shaft assembly including an outer shaft, a contact ring spring, a push button mechanism, and a contact ring, the outer shaft included a walled structure, the push button mechanism further including a body including a top surface, the walled structure of the outer shaft surrounding at least a portion of the body of the push button mechanism, the contact ring spring biasing the contact ring in a direction away from the top surface of the push button mechanism, the contact ring spring further biasing the push button mechanism in a direction opposite of the contact ring, providing a wheel including a tire, a rim and a wheel hub; placing the removable wheel cover into an opening in the wheel hub such that the removable wheel cover locks with the wheel.", "19 . The method of claim 18 further including pressing on the push button mechanism to unlock the removeable wheel cover and the wheel.", "20 . The method of claim 19 , wherein the placing of the removable wheel cover into the opening of the wheel hub such that the removable wheel cover locks with the wheel in the absence of tooling."], "bibtex": "@patent{20240123762,\n    title = {REMOVABLE AERODYNAMIC WHEEL COVER},\n    number = {20240123762},\n    year = {2024},\n    note = {File: US20240123762A1-20240418.XML}\n    }", "classification": "B60B706FI"}, {"title": "WHEEL ASSEMBLY DEVICE", "doc_number": "20240123763", "filename": "US20240123763A1-20240418.XML", "abstract": "Provided is a wheel assembly device. The wheel assembly device includes a connection base, a wheel assembly that is deployable, and a positioning assembly configured to position the wheel assembly. The wheel assembly is movably connected to the connection base and switchable between a deployed position and a storage position. The connection base has a positioning space. The wheel assembly is configured to rotate to an interior of the positioning space when the wheel assembly is at the deployed position, and rotate to an exterior of the positioning space when the wheel assembly is at the storage position. The positioning assembly includes a first positioning member configured to cooperate with the positioning space to position the wheel assembly at the deployed position and a second positioning member configured to cooperate with the first positioning member to position the wheel assembly at the storage position.", "detailed_description": ["Specific embodiments of the present disclosure are further described below in conjunction with the accompanying drawings.", "", "It can be appreciated that according to technical solutions of the present disclosure, a variety of structural methods and implementations that can be replaced with each other can be made by those skilled in the art without changing the spirit of the present disclosure. Therefore, the following specific embodiments and the accompanying drawings are only illustrative description of the technical solutions of the present disclosure, and should not be construed as the entirety of the present disclosure or as a limitation or restriction of the technical solutions of the present disclosure.", "", "Orientation terms such as up, down, left, right, front, rear, front surface, rear surface, top, bottom, etc., which are mentioned or may be mentioned in this specification are defined relative to constructions illustrated in the accompanying drawings. They are relative concepts, and therefore are likely to change accordingly depending on different positions in which they are located or different states in which they are used. Therefore, these or other orientation terms should not be interpreted as restrictive terms.", "", "As illustrated inFIG.1toFIG.8, the present disclosure provides a wheel assembly device10which includes a connection base1, a wheel assembly2that is deployable, and a positioning assembly configured to position the wheel assembly2.", "", "The wheel assembly2is movably connected to the connection base1and configured to switch between a deployed position and a storage position.", "", "The connection base1has a positioning space11. When the wheel assembly2is at the deployed position, the wheel assembly2is rotated to an interior of the positioning space11. When the wheel assembly2is at the storage position, the wheel assembly2is rotated to an exterior of the positioning space11.", "", "The positioning assembly includes a first positioning member and a second positioning member. The first positioning member is configured to cooperate with the positioning space11to position the wheel assembly2at the deployed position.", "", "The wheel assembly device10is configured to be mounted at a seat of a children's activity center and can facilitate a movement of the seat of the children's activity center.", "", "Exemplarily, the wheel assembly device10includes the connection base1, the wheel assembly2, and the positioning assembly. The connection base1is connected to a bottom of the seat of the children's activity center. The connection base1has a base groove opened downwards. The wheel assembly2is mounted in the base groove. The positioning space11is formed at the base groove and in communication with the base groove.", "", "The wheel assembly2has a connection portion connected to the connection base1and a rotating wheel portion that is rotatable. The wheel assembly2is rotatably connected to the base groove. That is, the wheel assembly2is rotatable in the base groove. The wheel assembly2is at the deployed position or the storage position when rotated. When the wheel assembly2is rotated to the deployed position, the connection portion of the wheel assembly2is located in the positioning space11, and the rotating wheel portion of the wheel assembly2is located outside the positioning space11and is in contact with the ground. In this case, a friction with the ground is reduced, which facilitates a movement of the connection base1. When the wheel assembly2is rotated to the storage position, both the connection portion and the rotating wheel portion of the wheel assembly2are located outside the positioning space11. In this case, the connection portion or the connection base1of the wheel assembly2is in contact with the ground. Therefore, the friction with the ground is increased, which enables the connection base1to be placed stably on the ground.", "", "The positioning assembly includes the first positioning member and the second positioning member. The first positioning member is configured to cooperate with the positioning space11to position the wheel assembly2. The second positioning member is configured to cooperate with the first positioning member to position the wheel assembly2. When the wheel assembly2is at the deployed position, the first positioning member cooperates with the positioning space11to keep the wheel assembly2stable and immobile at the deployed position. In this way, during a movement, the wheel assembly2is less likely to be rotated and stored after being subjected to an external force, which is convenient for use. When the wheel assembly2is at the storage position, the second positioning member cooperates with the first positioning member to keep the wheel assembly2stable and immobile at the storage position. The wheel assembly2is prevented from being stored after being subjected to the external force, which is convenient for use.", "", "The wheel assembly device10arranged in this way has changed a conventional way of mounting a braking structure at the wheel assembly2and has a simpler structure. Therefore, the use of materials is reduced, which saves costs. In addition, the simpler structure is less prone to damages, which prolongs a service life.", "", "The second positioning member is configured to cooperate with the first positioning member to position the wheel assembly2at the storage position.", "", "In an embodiment, as illustrated inFIG.2.FIG.3, andFIG.5toFIG.8, the first positioning member includes a connection shaft3disposed at the connection base1and a sliding groove4formed at the wheel assembly2. The connection shaft3is slidably connected to the sliding groove4to enable the wheel assembly2to move to the interior of the positioning space11or the exterior of the positioning space11.", "", "Two ends of the sliding groove4have a first engagement groove41and a second engagement groove42, respectively. The first engagement groove41is located below the second engagement groove42.", "", "When the wheel assembly2is at the deployed position, the connection shaft3is engaged in the first engagement groove41.", "", "When the wheel assembly2is at the storage position, the connection shaft3is engaged and rotatable in the second engagement groove42to enable the wheel assembly2to switch to the deployed position.", "", "In an exemplary embodiment of the present disclosure, the first positioning member is composed of the connection shaft3and the sliding groove4. The connection shaft3is connected to the connection base1. The sliding groove4is formed at the connection portion of the wheel assembly2. The connection shaft3is inserted into and in a clearance fit with the sliding groove4, in such a manner that the connection shaft3can slide in the sliding groove4.", "", "The sliding groove4has the first engagement groove41and the second engagement groove42. The first engagement groove41is formed at a lower end of the sliding groove4and is in communication with the sliding groove4. The second engagement groove42is located at an upper end of the sliding groove4and is in communication with the sliding groove4. The connection shaft3is configured to be engaged in the first engagement groove41. Further, the connection shaft3is configured to be engaged in the second first engagement groove41and is rotatably connected to the second engagement groove42.", "", "When the wheel assembly2is at the deployed position, the connection shaft3is engaged in the first engagement groove41and at least part of the wheel assembly2is located in the positioning space11. When the wheel assembly2is switched from the deployed position to the storage position, the wheel assembly2is pulled downwards, and the connection shaft3is moved from the first engagement groove41into the sliding groove4and then slides through the sliding groove4into the second engagement groove42. When the connection shaft3enters the second engagement groove42, the wheel assembly2is located outside the positioning space11. Then, the wheel assembly2is rotated to be connected to the second positioning member, thereby positioning the wheel assembly2. The wheel assembly2is located at the storage position. In this way, a sufficient rotation space is provided for the wheel assembly2, which facilitates an operation.", "", "In an embodiment, as illustrated inFIG.5toFIG.8, at least one connection opening43is formed between the first engagement groove41and the second engagement groove42. A width of the connection opening43is smaller than a width of the first engagement groove41and/or a width of the second engagement groove42. The connection opening43is compressed and deformed when the connection shaft3passes through the connection opening43.", "", "In an exemplary embodiment of the present disclosure, as an example, the connection opening43is formed between the first engagement groove41or the second engagement groove42and the sliding groove4, and the connection opening43is formed between the first engagement groove41and the sliding groove4. The first engagement groove41is in communication with the sliding groove4by the connection opening43. The width of the connection opening43is smaller than each of the width of the first engagement groove41and a width of the sliding groove4. When the connection shaft3is located in the first engagement groove41, the connection opening43can block the connection shaft3, in such a manner that the connection shaft3is less likely to be separated from the first engagement groove41. When the connection shaft3enters the sliding groove4from the first engagement groove41, the connection shaft3compresses the connection opening43. The connection opening43is compressed and deformed. During a deformation of the connection opening43, the width of the connection opening43is enlarged, allowing the connection shaft3to pass through the connection opening43.", "", "In an embodiment, as illustrated inFIG.5toFIG.8, two connection openings43are formed between the first engagement groove41and the second engagement groove42. One of the two connection openings43is formed between and in communication with the first engagement groove41and the sliding groove4. Another one of the two connection openings43is formed between and in communication with the second engagement groove42and the sliding groove4.", "", "In an exemplary embodiment of the present disclosure, the two connection openings43are spaced apart from each other. For ease of description, the connection opening43between the first engagement groove41and the sliding groove4is defined as a first connection opening, and the connection opening43between the second engagement groove42and the sliding groove4is defined as a second connection opening. The first engagement groove41is in communication with the sliding groove4by the first connection opening. The second engagement groove42is in communication with the sliding groove4by the second connection opening. When the connection shaft3is located in the second engagement groove42, the second connection opening can block the connection shaft3, in such a manner that the connection shaft3is less likely to be separated from the second engagement groove42. With the two connection openings43, the connection shaft3can be reliably positioned both in the first engagement groove41and in the second engagement groove42.", "", "In an embodiment, as illustrated inFIG.5toFIG.8, the wheel assembly2has a deformation space5located at a side of the sliding groove4to allow for a deformation of the connection opening43. The deformation space5is located at a left side or a right side of the sliding groove4and is used to improve a deformation capability of the connection opening43.", "", "In another exemplary embodiment of the present disclosure, the deformation space5is made of a flexible material and integrally molded with the connection portion of the wheel assembly2. A side wall of the deformation space5forms part of the connection opening43. When the connection shaft3is located in the connection opening43, the deformation space5is compressed and deformed.", "", "In an embodiment, as illustrated inFIG.5toFIG.8, the deformation space5includes two through holes spaced apart from each other. The sliding groove4is located between the two through holes.", "", "In an exemplary embodiment of the present disclosure, the through hole is an elongated hole. The two through holes are located at the left side and the right side of the sliding groove4, respectively, and are parallel to the sliding groove4. A connection wall is formed between the through hole and the sliding groove4. The connection opening43is formed between the two connection walls. The through hole is formed to reserve a space for a deformation of the connection wall, in such a manner that the connection wall has a predetermined degree of elasticity. When the connection shaft3passes through the connection opening43, the connection shaft3compresses the connection wall. Part of the connection wall moves into the through hole to form a deformation, which enlarges the width of the connection opening43. The deformation space5arranged in this way has a simple structure and reduces materials used for the manufacturing.", "", "In an embodiment, as illustrated inFIG.2,FIG.3, andFIG.5toFIG.8, the second positioning member includes a positioning protrusion6disposed at the wheel assembly2and a positioning portion7disposed at the connection base1. When the wheel assembly2is at the storage position, the positioning protrusion6is engaged with the positioning portion7to position the wheel assembly2at the storage position.", "", "In an exemplary embodiment of the present disclosure, the second positioning member is composed of the positioning protrusion6and the positioning portion7. The positioning portion7may be a positioning recess or a positioning hole. For ease of description, as an example, the positioning portion7is the positioning recess.", "", "The positioning protrusion6is disposed at the connection portion of the wheel assembly2. The positioning recess is formed at the connection base1. When the wheel assembly2is rotated to the storage position, the positioning protrusion6is engaged in a second recess. Therefore, the wheel assembly2remains positioned at the storage position, which is convenient for people to use.", "", "In an embodiment, as illustrated inFIG.5toFIG.8, the positioning protrusion6is an elastic block that has elasticity.", "", "In an exemplary embodiment of the present disclosure, the elastic block is deformable and has an initial state and a compressed state. When the elastic block is in the initial state, the elastic block is engaged in the positioning recess. When the elastic block is in the compressed state, the elastic block is separated from the positioning recess.", "", "As an example, the wheel assembly2is switched from the storage position to the deployed position. When the wheel assembly2is located at the storage position, the elastic block is in the initial state and is engaged in the positioning recess. When a position switch for the wheel assembly2is needed, an external force is applied to the wheel assembly2to rotate wheel assembly2. When the wheel assembly2is rotated, the elastic block is in the compressed state since it is compressed, and then is separated from the positioning recess.", "", "In another exemplary embodiment of the present disclosure, the elastic block is a rubber block.", "", "In another exemplary embodiment of the present disclosure, the elastic block is an elastic plate having one end connected to the wheel assembly2and another end formed as an engagement end.", "", "In an embodiment, as illustrated inFIG.3toFIG.8, the connection base1is provided with at least two stop plates12extending downwards. The positioning space11is formed between the two stop plates12. When the wheel assembly2is at the deployed position, the wheel assembly2is inserted into the positioning space11, and the connection shaft3is engaged in the first engagement groove41. The wheel assembly2is positioned at the deployed position under an action of the stop plate12and the first engagement groove41. When the wheel assembly2is at the storage position, the connection shaft3moves from the first engagement groove41into the second engagement groove42. The positioning protrusion6is engaged with the positioning portion7to position the wheel assembly2at the storage position.", "", "In an exemplary embodiment of the present disclosure, the at least two stop plates12are disposed in the base groove of the connection base1. The positioning space11opened downwards is formed between two adjacent stop plates12. The connection shaft3is connected inside the base groove and located below the stop plate12.", "", "When the wheel assembly2is switched from the storage position to the deployed position, the connection shaft3is located in the second engagement groove42originally, and then the wheel assembly2is rotated downwards. In this case, the wheel assembly2is aligned with the positioning space11. Then, the wheel assembly2moves upwards. The connection shaft3slides from the second engagement groove42into the first engagement groove41through the sliding groove4. The connection portion of the wheel assembly2is inserted into the positioning space11. The connection shaft3is engaged in the first engagement groove41. Therefore, the wheel assembly2stays at the deployed position.", "", "When the wheel assembly2is switched from the deployed position to the storage position, the wheel assembly2is pulled to slide downwards, and the connection shaft3slides from the first engagement groove41into the second engagement groove4through the sliding groove4. Then, the wheel assembly2is rotated upwards. After the wheel assembly2is rotated upwards, the positioning protrusion6is engaged in the positioning portion7to keep the wheel assembly2at the storage position.", "", "In an embodiment, as illustrated inFIG.1andFIG.5toFIG.8, the wheel assembly2includes a roller21and a mounting base22. The roller21is rotatably connected to a lower end of the mounting base22. The mounting base22is rotatably connected to the connection base1. When the wheel assembly2is located at the deployed position, at least part of the mounting base22is located in the positioning space11, and the roller21is located outside the positioning space11. When the wheel assembly2is located at the storage position, the mounting base22is located outside the positioning space11.", "", "In an exemplary embodiment of the present disclosure, the wheel assembly2is composed of the roller21and the mounting base22. The mounting base22is the connection portion of the wheel assembly2. The roller21is the rotating wheel portion of the wheel assembly2. The mounting base22is rotatably connected to the connection base1by the connection shaft3. The positioning protrusion6, the first engagement groove41, the second engagement groove42, the sliding groove4, and the through hole are formed at the mounting protrusion6. The wheel assembly2arranged in this way has a simple structure, which facilitates manufacturing and production.", "", "When the wheel assembly2is at the deployed position, the mounting base22is inserted into the positioning space11and the roller21is in contact with the ground. Therefore, the connection base1can be moved easily. When the wheel assembly2is at the storage position, the mounting base22is located outside the positioning space11, and the mounting base22or the connection base1is in contact with the ground, allowing the connection base1to be stably placed on the ground.", "", "In an embodiment, as illustrated inFIG.1andFIG.4, the connection base11has a ball socket13opened towards the stop plate12. At least part of the stop plate12is connected inside the ball socket13.", "", "In an exemplary embodiment of the present disclosure, a wall surface of the connection base11is recessed to form the ball socket13. The ball socket13is opened towards the wheel assembly22. An upper end of the stop plate12is connected inside the ball socket13and defines a mounting position for the stop plate12. Therefore, the stop plate12can be precisely mounted. In addition, since the ball socket13has a satisfactory mechanical property, a wall surface of the ball socket13can realize a better force distribution, better protecting the stop plate12.", "", "In an embodiment, as illustrated inFIG.1andFIG.4, the connection base11is provided with a reinforcing rib. The reinforcing rib is connected to a side of the stop plate12. One end of the reinforcing rib is connected to the stop plate12. Another end of the reinforcing rib is connected to the connection base11. Therefore, a connection between the stop plate12and the connection base11is reinforced, which improves structural strength of the stop plate12and making the stop plate12less susceptible to damages.", "", "In summary, the present disclosure discloses the wheel assembly device10. The wheel assembly device10includes the connection base1, the wheel assembly2that is deployable, and the positioning assembly configured to position the wheel assembly2. The wheel assembly2is movably connected to the connection base1and switchable between the deployed position and the storage position. The connection base1has the positioning space11. When the wheel assembly2is at the deployed position, the wheel assembly2is rotated to the interior of the positioning space11. When the wheel assembly2is at the storage position, the wheel assembly2is rotated to the exterior of the positioning space11. The positioning assembly includes the first positioning member and the second positioning member. The first positioning member is configured to cooperate with the positioning space11to position the wheel assembly2at the deployed position. The second positioning member is configured to cooperate with the first positioning member to position the wheel assembly2at the storage position. The wheel assembly device10has a simple structure, satisfactory structural strength, and long service life. Through deploying or storing the wheel assembly2, the connection base1can be moved on the ground or stably placed on the ground. In addition, with the positioning assembly and the positioning space11, the wheel assembly2is kept stable at the deployed position and the storage position. Therefore, an operation is facilitated.", "", "While the principle and several embodiments of the present disclosure have been described above, it should be noted that those skilled in the art can make various variants on a basis of the principle of the present disclosure. These variants are to be encompassed by the protection scope of present disclosure."], "claims": ["a connection base ( a wheel assembly ( a positioning assembly configured to position the wheel assembly ( the wheel assembly ( the connection base ( the positioning assembly comprises a first positioning member and a second positioning member, the first positioning member being configured to cooperate with the positioning space (", "two ends of the sliding groove ( the connection shaft (", "3 . The wheel assembly device ( 10 ) according to claim 2 , wherein at least one connection opening ( 43 ) is formed between the first engagement groove ( 41 ) and the second engagement groove ( 42 ), the connection opening ( 43 ) having a width smaller than a width of the first engagement groove ( 41 ) and/or a width of the second engagement groove ( 42 ), and the connection opening ( 43 ) being compressed and deformed in response to the connection shaft ( 3 ) passing through the connection opening ( 43 ).", "4 . The wheel assembly device ( 10 ) according to claim 3 , wherein two connection openings ( 43 ) are formed between the first engagement groove ( 41 ) and the second engagement groove ( 42 ), one of the two connection openings ( 43 ) being formed between and in communication with the first engagement groove ( 41 ) and the sliding groove ( 4 ), and another one of the two connection openings ( 43 ) being formed between and in communication with the second engagement groove ( 42 ) and the sliding groove ( 4 ).", "5 . The wheel assembly device ( 10 ) according to claim 3 , wherein the wheel assembly ( 2 ) has a deformation space ( 5 ) located at a side of the sliding groove ( 4 ) to enable the connection opening ( 43 ) to be deformed.", "6 . The wheel assembly device ( 10 ) according to claim 5 , wherein the deformation space ( 5 ) comprises two through holes spaced apart from each other, the sliding groove ( 4 ) being located between the two through holes.", "the second positioning member comprises a positioning protrusion ( the positioning protrusion (", "8 . The wheel assembly device ( 10 ) according to claim 7 , wherein the positioning protrusion ( 6 ) is an elastic block that has elasticity.", "the connection base ( when the wheel assembly ( when the wheel assembly (", "the wheel assembly ( when the wheel assembly ( when the wheel assembly ("], "bibtex": "@patent{20240123763,\n    title = {WHEEL ASSEMBLY DEVICE},\n    number = {20240123763},\n    year = {2024},\n    note = {File: US20240123763A1-20240418.XML}\n    }", "classification": "B60B3306FI"}, {"title": "WHEEL ASSEMBLY STRUCTURE AND CHILD ACTIVITY CENTER", "doc_number": "20240123764", "filename": "US20240123764A1-20240418.XML", "abstract": "The present disclosure discloses a wheel assembly structure and a child activity center. The wheel assembly structure includes a connection base and a wheel assembly that is deployable. The wheel assembly is pivotally connected to the connection base. The wheel assembly has a deployment state and a storage state. An adjustment mechanism is provided between the connection base and the wheel assembly. The adjustment mechanism is configured to switch the wheel assembly into the storage state from the deployment state. When the wheel assembly is in the deployment state, the wheel assembly is deployed to a first position to move the connection base. When the wheel assembly is in the storage state, the wheel assembly is stored to a second position to stably place the connection base. The wheel assembly structure has a simple overall structure, which facilitates production and lowers production costs.", "detailed_description": ["Specific implementations of the present disclosure are further described below with reference to the accompanying drawings.", "", "It is easy to understand that, according to the technical solutions of the present disclosure, those of ordinary skill in the art may replace various structural manners and implementations with each other without departing from the ideas of the present disclosure. Therefore, the following specific implementations and the accompanying drawings are merely exemplary descriptions of the technical solutions of the present disclosure, and should not be regarded as all of the present disclosure, or a restriction or limitation on the technical solutions of the present disclosure.", "", "Orientation terms such as over, below, left, right, front, rear, front, back, top, bottom, etc., which are referred to or may be mentioned in this specification, are defined with respect to the configuration shown in the accompanying drawings, and they are relative concepts and may change in accordance with different locations thereof and different use of states. Therefore, these or other orientation terms should not be explained as limiting terms.", "", "As illustrated inFIG.1toFIG.6, in an embodiment of the present disclosure, a wheel assembly structure10includes a connection base1and a wheel assembly2that is deployable. The wheel assembly2is pivotally connected to the connection base1.", "", "The wheel assembly2has a deployment state and a storage state. An adjustment mechanism is provided between the connection base1and the wheel assembly2. The adjustment mechanism is configured to switch the wheel assembly2into the storage state from the deployment state.", "", "When the wheel assembly2is in the deployment state, the wheel assembly2is deployed to a first position to move the connection base1.", "", "When the wheel assembly2is in the storage state, the wheel assembly2is stored to a second position to stably place the connection base1.", "", "As illustrated inFIG.8, the wheel assembly structure10is configured to be mounted on a child activity center100, which can conveniently move the child activity center100.", "", "In an exemplary embodiment of the present disclosure, the wheel assembly structure10includes a connection base1, a wheel assembly2, and an adjustment mechanism. The connection base1is connected to a bottom of the child activity center100. The connection base1has a base groove opened downwards. The wheel assembly2is pivotally connected in the base groove, i.e., the wheel assembly2can rotate in the base groove. The wheel assembly2is allowed to have the deployment state and the storage state by rotating the wheel assembly2. The wheel assembly2has a connection portion connected to the connection base1and a rotatable rotary wheel portion.", "", "The adjustment mechanism is disposed between the connection base1and the wheel assembly2, and can control the rotation of the wheel assembly2and keep the wheel assembly2fixed. Through the adjustment mechanism, the wheel assembly2can be allowed to be switched back and forth between the deployment state and the storage state.", "", "As illustrated inFIG.4toFIG.6, when the adjustment mechanism adjusts the wheel assembly2to the deployment state from the storage state, the wheel assembly2rotates in a forward direction, and the wheel assembly2is deployed to the first position. At the first position, the wheel assembly2at least partially extends downwards to an outer side of the connection base1, and the wheel assembly2remains fixed. At this time, the rotary wheel portion of the wheel assembly2is in contact with the ground, to support the connection base1, to facilitate the movement of the child activity center100.", "", "As illustrated inFIG.4toFIG.6, when the adjustment mechanism adjusts the wheel assembly2to the storage state from the deployment state, the wheel assembly2rotates in a reverse direction, and the wheel assembly2is stored to the second position. At the second position, the wheel assembly2is at least partially located at an inner side of the connection base1, and the wheel assembly2remains fixed. At the second position, a wheel portion is located at the inner side of the connection base1, and the connection portion is in contact with the ground or the connection base1is in contact with the ground. In this way, the connection base1can be more stably supported, allowing the connection base1to be kept stationary on the ground.", "", "It should be noted that the forward direction and the reverse direction are not absolute, but are only used to illustrate that the wheel assembly2can rotate in two opposite directions.", "", "With this arrangement, the wheel assembly structure10is simple in overall structure, thereby reducing the production cost. When the connection base1needs to be moved, the wheel assembly2is adjusted to the deployment state. When the connection base1needs to be stably placed, the wheel assembly2is adjusted to the storage state. The entire steps are simple and convenient to operate.", "", "In an embodiment, as illustrated inFIG.1toFIG.6, the adjustment mechanism includes a first engagement portion3and a second engagement portion4that are disposed on the connection base1, and an engagement member5disposed on the wheel assembly2. The first engagement portion3and the second engagement portion4are respectively capable of being engaged with the engagement member5, to position the wheel assembly2at different positions. When the wheel assembly2is in the deployment state, the engagement member5is engaged with the first engagement portion3for positioning. When the wheel assembly2is in the storage state, the engagement member5is engaged with the second engagement portion4for positioning.", "", "In an exemplary embodiment of the present disclosure, the adjustment mechanism is composed of the first engagement portion3, the second engagement portion4, and the engagement member5. The first engagement portion3and the second engagement portion4are disposed on the connection base1. The engagement member5is disposed on the wheel assembly2. The first engagement portion3and the second engagement portion4can be detachably connected to the engagement member5, respectively, i.e., the first engagement portion3and the engagement member5can be connected to each other and disengaged from each other, and the second engagement portion4can be connected to and disengaged from the engagement member5.", "", "The first engagement portion3and the second engagement portion4are spaced apart from each other. When the wheel assembly2is in the deployment state, the engagement member5is disengaged from the second engagement portion4and engaged with the first engagement portion3, such that the wheel assembly2remains stationary in the deployment state. When the wheel assembly2is in the storage state, the engagement member5is disengaged from the first engagement portion3and engaged with the second engagement portion4, such that the wheel assembly2remains stationary in the storage state. The adjustment mechanism in such an arrangement is convenient to operate and can be repeatedly used many times.", "", "In another exemplary embodiment of the present disclosure, the first engagement portion3and the second engagement portion4are engagement hooks, and the engagement member5is a engagement lug. The engagement lug has predetermined elasticity. When the engagement lug is connected to the engagement hook, the engagement lug is bent and deformed firstly, and then the engagement hook is engaged in the engagement lug. In other embodiments of the present disclosure, the first engagement portion3, the second engagement portion4, and the engagement member5may also be of other structures, as long as the detachable connection can be implemented.", "", "In an embodiment, as illustrated inFIG.1toFIG.3, the first engagement portion3is a first engagement groove or a first engagement hole. The second engagement portion4is a second engagement groove or a second engagement hole. The engagement member5is an elastic engagement block. During the switching of the wheel assembly2into the storage state from the deployment state, the elastic engagement block is compressed and deformed, and the elastic engagement block moves to the second engagement groove or the second engagement hole from the first engagement groove or the first engagement hole.", "", "In an exemplary embodiment of the present disclosure, the first engagement portion3and the second engagement portion4are engagement grooves or engagement holes defined on the connection base1. As an example, the first engagement portion3and the second engagement portion4are used as engagement grooves for description. The first engagement portion3is defined as a first engagement groove, and the second engagement portion4is defined as a second engagement groove. The engagement member5is a deformable elastic engagement block having an extension state and a retraction state. When the elastic engagement block is in the extension state, the elastic engagement block is engaged in the first engagement groove or the second engagement groove. When the elastic engagement block is in the retraction state, the elastic engagement block is disengaged from the first engagement groove or the second engagement groove.", "", "As an example, the wheel assembly2is switched to the storage state from the deployment state. When the wheel assembly2is in the deployment state, the elastic engagement block is in the extension state and is engaged in the first engagement groove. When switching is needed, the elastic engagement block is compressed firstly to be in the retraction state from the extension state. Moreover, the elastic engagement block is disengaged from the first engagement groove. Then, the wheel assembly2rotates towards the second engagement groove. During the rotation of the wheel assembly2, the elastic engagement block is compressed by a wall surface of the connection base1to be in the retraction state all the time. When the wheel assembly2rotates to enable the elastic engagement block to be aligned with the second engagement groove, the elastic engagement block changes to the extension state from the retraction state under the action of the elasticity of the elastic engagement block itself, and is engaged in the second engagement groove.", "", "With this arrangement, the first engagement portion3, the second engagement portion4, and the engagement member5are simple in structure, convenient to produce and manufacture, and not easy to damage.", "", "In another exemplary embodiment of the present disclosure, the elastic engagement block is a rubber block.", "", "In another exemplary embodiment of the present disclosure, the elastic engagement block is an elastic plate. An end of the elastic plate is connected to the wheel assembly2, and another end of the elastic plate is an engagement end.", "", "In an embodiment, the first engagement portion3is a first elastic protrusion. The second engagement portion4is a second elastic protrusion. The engagement member5is a positioning groove or a positioning hole. During the switching of the wheel assembly2into the storage state from the deployment state, the positioning groove or the positioning hole moves to the second elastic protrusion from the first elastic protrusion, and the first elastic protrusion and the second elastic protrusion are compressed and deformed.", "", "In an exemplary embodiment of the present disclosure, the first engagement portion3and the second engagement portion4are deformable elastic protrusions. The first engagement portion3is defined as the first elastic protrusion. The second engagement portion4is defined as the second elastic protrusion. The engagement member5is the positioning groove or the positioning hole. As an example, the engagement member5is the positioning groove for description. The elastic protrusion has a first state and a second state. When the elastic protrusion is in the first state, the elastic protrusion is engaged in the positioning groove. When the elastic protrusion is in the second state, the elastic protrusion is disengaged from the positioning groove.", "", "When the wheel assembly2is in the deployment state, the first elastic protrusion is in the first state and is engaged in the positioning groove, and the second elastic protrusion is in the second state. When the wheel assembly2is switched into the storage state from the deployment state, the first elastic protrusion is first compressed. In this way, the first elastic protrusion is compressed to be in the second state and is disengaged from the positioning groove. Then, the wheel assembly2is rotated. When the wheel assembly2rotates to enable the positioning groove to be aligned with the second elastic protrusion, the second elastic protrusion changes to the first state from the second state under the action of the elasticity of the second elastic protrusion itself, and is engaged in the positioning groove.", "", "With this arrangement, the wheel assembly2is allowed to be not easily damaged. Moreover, when the wheel assembly2is switched into the storage state from the deployment state, the number of compression on the first elastic protrusion and the second elastic protrusion is also reduced, thereby prolonging a service life.", "", "In another exemplary embodiment of the present disclosure, the first elastic protrusion and the second elastic protrusion are rubber protrusions. In other embodiments of the present disclosure, other structures may be provided, as long as the structure has elasticity and can be extended and retracted.", "", "In an embodiment, as illustrated inFIG.1toFIG.6, the wheel assembly2includes a base body21and a roller22. The base body21is pivotally connected to the connection base1. The roller22is rotatably connected to the base body21. An engagement member5of the adjustment mechanism is connected to the base body21. When the wheel assembly2is in the deployment state, the roller22is positioned at the first position. When the wheel assembly2is in the storage state, the roller22is positioned at the second position.", "", "In an exemplary embodiment of the present disclosure, the wheel assembly2is composed of a base body21and a roller22. The base body21is a connection portion of the wheel assembly2, and the roller22is a rotary wheel portion of the wheel assembly2. The base body21is rotatably connected to the connection base1. Moreover, the engagement member5is connected to the base body21. In this way, the engagement member5can rotate along with the base body21. The roller22is connected to the base body21through a connection shaft, and the roller22can autorotate around the connection shaft.", "", "When the base body21rotates to the deployment state, the roller22is located at a lower side of the connection base1and is in contact with the ground. In this way, the connection base1can be pushed to move conveniently.", "", "When the base body21rotates to the storage state, the roller22is at least partially located at an inner side of the connection base1. For example, the roller22is located at the inner side of the connection base1in whole, i.e., located above a bottom surface of the connection base1. At this time, the connection base1or the base body21is in contact with the ground, such that the connection base1is not easily moved. In this way, the connection base1is stably placed on the ground. Alternatively, the roller22is partially located at the inner side of the connection base1. At this time, the base body21is in contact with the ground, and the roller22is suspended above the ground.", "", "In an embodiment, as illustrated inFIG.3toFIG.6, the base body21is pivotally connected to the connection base1through a pivot shaft23. The base body21has a first communication hole211, a second communication hole212rotatably connected to the pivot shaft23, and a connection channel213slidably connected to the pivot shaft23. The first communication hole211and the second communication hole212are spaced apart from each other. The connection channel213is connected between the first communication hole211and the second communication hole212. When the wheel assembly2is in the deployment state, the pivot shaft23is connected in the first communication hole211. When the wheel assembly2is in the storage state, the pivot shaft23is connected in the second communication hole211. During the switching of the wheel assembly2into the storage state from the deployment state, the pivot shaft23slides to the second communication hole212from the first communication hole211through the connection channel213, and rotates to the second position in the second communication hole212.", "", "In an exemplary embodiment of the present disclosure, the base body21has the first communication hole211and the second communication hole212that are spaced apart from each other. The first communication hole211is located below the second communication hole212. The connection channel213is connected between the first communication hole211and the second communication hole212. One end of the connection channel213is in communication with the first communication hole211, and another end of the connection channel213is in communication with the second communication hole212. The pivot shaft23can rotate in the second communication hole212and can slide in the connection channel213.", "", "When the wheel assembly2is in the deployment state, the pivot shaft23is located in the first communication hole211. When the wheel assembly2is switched into the storage state from the deployment state, the base body21is pulled to move downwards, allowing the pivot shaft23to slide into the second communication hole212through the connection channel213. Then, the base body21rotates, and the pivot shaft23rotates in the second communication hole212. After the rotation, the wheel assembly2is in the storage state. With this arrangement, a space for rotation of the base body21is increased. In addition, enough rotation space is provided for rotation of the base body21. Moreover, the operation is convenient.", "", "In another exemplary embodiment of the present disclosure, a side of the base body21has a stop plate. When the pivot shaft23is located in the first communication hole211, the stop plate is in contact with the base body21to block the base body21from swinging. When the pivot shaft23slides to the second communication hole212, the base body21is located below the stop plate. Moreover, the base body21and the stop plate are spaced apart from each other by a predetermined distance, such that the base body21can rotate.", "", "In an embodiment, as illustrated inFIG.3toFIG.6, the base body21has a through hole214. The through hole214is located at a side of the connection channel213to enable the connection channel213to be deformed.", "", "In an exemplary embodiment of the present disclosure, the through hole214is a elongated hole, is located at a side of the connection channel213, and is parallel to the connection channel213. A channel wall is formed between the through hole214and the connection channel213. Through the arrangement of the through hole214, a deformation space is reserved for the channel wall, such that the channel wall has a predetermined elasticity. When the channel wall is compressed by the pivot shaft23, the channel wall can partially move into the through hole214.", "", "In another exemplary embodiment of the present disclosure, the connection channel213includes a first channel opening connected to the first communication hole211and a second channel opening connected to the second communication hole212. A width of the first channel opening is smaller than a diameter of the first communication hole211, and a width of the second channel opening is smaller than a diameter of the second communication hole212. In this way, the pivot shaft23can be engaged into the first communication hole211and the second communication hole212. When the pivot shaft23moves through the first channel opening or the second channel opening, the pivot shaft23compresses the first channel opening or the second channel opening to deform the first channel opening or the second channel opening, and the through hole214provides the deformation space.", "", "In another exemplary embodiment of the present disclosure, two sides of the connection channel213have a through hole214, respectively.", "", "In an embodiment, as illustrated inFIG.1andFIG.4toFIG.7, the connection base1has two connection plates11spaced apart from each other. The wheel assembly2is connected between the two connection plates11. An accommodation groove is defined between the two connection plates11. The base body21is connected between the two connection plates11through the pivot shaft23, and is at least partially located in the accommodation groove. With this arrangement, it is convenient to install the wheel assembly2.", "", "In another exemplary embodiment of the present disclosure, the first engagement portion3and the second engagement portion4are disposed on the connection plate11facing towards the engagement member5.", "", "In an embodiment, as illustrated inFIG.1andFIG.7, the connection base1has a ball socket12opened towards the connection plate11. The two connection plates11are at least partially connected in the ball socket12.", "", "In an exemplary embodiment of the present disclosure, the wall surface of the connection base1is recessed to form the ball socket12, which is opened towards the wheel assembly2. An upper end of each of the two connection plates11is connected in the ball socket12. The ball socket12determines the mounting position for the connection plate11. In this way, the connection plate11can be accurately mounted. Moreover, the ball socket12has good mechanical properties and has a wall surface that can better disperse the stress, thereby better protecting the connection plate11.", "", "In an embodiment, as illustrated inFIG.1andFIG.7, the connection base1has a reinforcement rib13. The reinforcement rib13is connected to a side of the connection plate11. An end of the reinforcement rib13is connected to the connection plate11, and another end of the reinforcement rib13is connected to the connection base1. In this way, a connection between the connection plate11and the connection base1is enhanced. Therefore, the structural strength of the connection plate11is improved, making the connection plate11less susceptible to damage.", "", "As illustrated inFIG.1toFIG.8, a child activity center100according to the present disclosure includes an activity center member20and the wheel assembly structure10described above.", "", "The activity center member20is connected to the connection base1. The wheel assembly2is pivotally connected to a bottom of the connection base1.", "", "A specific structure and function of the wheel assembly structure10refer to the foregoing related contents, and details are omitted herein.", "", "The child activity center100is composed of an activity center member20and a wheel assembly structure10. The activity center member20is used for placing children and for children to play.", "", "In another exemplary embodiment of the present disclosure, the activity center member20has a seat pocket for placing a child. Moreover, various toys such as a toy horn, a toy bell, or a toy music box are installed on the activity center member20.", "", "The activity center member20is connected to the connection base1and is located above the connection base1. The wheel assembly2is pivotally connected to the bottom of the connection base1.", "", "When the wheel assembly2is in the deployment state, the roller22of the wheel assembly2is in contact with the ground, allowing for an effortless movement of the child activity center100.", "", "When the wheel assembly2is in the storage state, the base body of the wheel assembly2or the connection base1is in contact with the ground, thereby increasing a friction force of the base body or the connection base1with the ground. In this way, the child activity center100can be stably placed on the ground.", "", "With this arrangement, the child activity center100can switch its use state through the wheel assembly structure10, which is convenient for people to use. Moreover, a complex brake structure is removed and the production cost is lowered. Therefore, the attraction of the child activity center100is improved.", "", "In summary, the present disclosure discloses a wheel assembly structure10, which includes the connection base1and the wheel assembly2that is deployable. The wheel assembly2is pivotally connected to the connection base1. The wheel assembly2has the deployment state and the storage state. The adjustment mechanism is provided between the connection base1and the wheel assembly2. The adjustment mechanism is configured to switch the wheel assembly2into the storage state from the deployment state. When the wheel assembly2is in the deployment state, the wheel assembly2is deployed to the first position to move the connection base1. When the wheel assembly2is in the storage state, the wheel assembly2is stored to the second position to stably place the connection base1. The wheel assembly structure10can be adjusted. When the wheel assembly2is adjusted to the deployment state, the wheel assembly2is in contact with the ground. In this way, the connection base1is conveniently pushed. When the wheel assembly2is adjusted to the storage state, the connection base1or the wheel assembly2is at least partially in contact with the ground, such that the connection base1is stably placed on the ground. The whole wheel assembly structure10is simple and is not easy to be damaged. Adjustment can be performed by rotating the wheel assembly2, which is convenient to operate.", "", "The present disclosure further discloses a child activity center100, which includes an activity center member20and a wheel assembly structure10. The activity center member20is connected to the connection base1, and the wheel assembly20is pivotally connected to the bottom of the connection base1. The arrangement of the wheel assembly structure10not only improves use convenience of the child activity center100, but also lowers the manufacturing cost, thereby improving market competitiveness of the child activity center structure100.", "", "The above is merely a principle and a preferred embodiment of the present disclosure. It should be noted that, for a person of ordinary skill in the art, on the basis of the principle of the present disclosure, several other variations can also be made, and should also be regarded as the scope of the present disclosure."], "claims": ["a connection base; and a wheel assembly that is deployable, the wheel assembly being pivotally connected to the connection base, wherein the wheel assembly has a deployment state and a storage state, wherein an adjustment mechanism is provided between the connection base and the wheel assembly, the adjustment mechanism being configured to switch the wheel assembly into the storage state from the deployment state; wherein when the wheel assembly is in the deployment state, the wheel assembly is deployed to a first position to move the connection base; and wherein when the wheel assembly is in the storage state, the wheel assembly is stored to a second position to stably place the connection base.", "a first engagement portion and a second engagement portion that are disposed on the connection base; and an engagement member disposed on the wheel assembly, wherein the first engagement portion and the second engagement portion are respectively capable of being engaged with the engagement member, to position the wheel assembly at different positions; wherein when the wheel assembly is in the deployment state, the engagement member is engaged with the first engagement portion for positioning; and wherein when the wheel assembly is in the storage state, the engagement member is engaged with the second engagement portion for positioning.", "the first engagement portion is a first engagement groove or a first engagement hole; the second engagement portion is a second engagement groove or a second engagement hole; the engagement member is an elastic engagement block; and during the switching of the wheel assembly into the storage state from the deployment state, the elastic engagement block is compressed and deformed, and the elastic engagement block moves to the second engagement groove or the second engagement hole from the first engagement groove or the first engagement hole.", "the first engagement portion is a first elastic protrusion; the second engagement portion is a second elastic protrusion; the engagement member is a positioning groove or a positioning hole; and during the switching of the wheel assembly into the storage state from the deployment state, the positioning groove or the positioning hole moves to the second elastic protrusion from the first elastic protrusion, and the first elastic protrusion and the second elastic protrusion are compressed and deformed.", "a base body pivotally connected to the connection base; and a roller rotatably connected to the base body, wherein an engagement member of the adjustment mechanism is connected to the base body; wherein when the wheel assembly is in the deployment state, the roller is positioned at the first position; and wherein when the wheel assembly is in the storage state, the roller is positioned at the second position.", "the base body is pivotally connected to the connection base through a pivot shaft; and the base body has a first communication hole, a second communication hole rotatably connected to the pivot shaft, and a connection channel slidably connected to the pivot shaft, the first communication hole and the second communication hole being spaced apart from each other, and the connection channel being connected between the first communication hole and the second communication hole; when the wheel assembly is in the deployment state, the pivot shaft is connected in the first communication hole; when the wheel assembly is in the storage state, the pivot shaft is connected in the second communication hole; and during the switching of the wheel assembly into the storage state from the deployment state, the pivot shaft slides to the second communication hole from the first communication hole through the connection channel, and rotates to the second position in the second communication hole.", "7 . The wheel assembly structure according to claim 6 , wherein the base body has a through hole, the through hole being located at a side of the connection channel to enable the connection channel to be deformed.", "the connection base has two connection plates spaced apart from each other; and the wheel assembly is connected between the two connection plates.", "the connection base has a ball socket opened towards the connection plate; and the two connection plates are at least partially connected in the ball socket.", "an activity center member; and the wheel assembly structure according to wherein the activity center member is connected to the connection base; and wherein the wheel assembly is pivotally connected to a bottom of the connection base.", "a first engagement portion and a second engagement portion that are disposed on the connection base; and an engagement member disposed on the wheel assembly, wherein the first engagement portion and the second engagement portion are respectively capable of being engaged with the engagement member, to position the wheel assembly at different positions; wherein when the wheel assembly is in the deployment state, the engagement member is engaged with the first engagement portion for positioning; and wherein when the wheel assembly is in the storage state, the engagement member is engaged with the second engagement portion for positioning.", "the first engagement portion is a first engagement groove or a first engagement hole; the second engagement portion is a second engagement groove or a second engagement hole; the engagement member is an elastic engagement block; and during the switching of the wheel assembly into the storage state from the deployment state, the elastic engagement block is compressed and deformed, and the elastic engagement block moves to the second engagement groove or the second engagement hole from the first engagement groove or the first engagement hole.", "the first engagement portion is a first elastic protrusion; the second engagement portion is a second elastic protrusion; the engagement member is a positioning groove or a positioning hole; and during the switching of the wheel assembly into the storage state from the deployment state, the positioning groove or the positioning hole moves to the second elastic protrusion from the first elastic protrusion, and the first elastic protrusion and the second elastic protrusion are compressed and deformed.", "a base body pivotally connected to the connection base; and a roller rotatably connected to the base body, wherein an engagement member of the adjustment mechanism is connected to the base body; wherein when the wheel assembly is in the deployment state, the roller is positioned at the first position; and wherein when the wheel assembly is in the storage state, the roller is positioned at the second position.", "the base body is pivotally connected to the connection base through a pivot shaft; and the base body has a first communication hole, a second communication hole rotatably connected to the pivot shaft, and a connection channel slidably connected to the pivot shaft, the first communication hole and the second communication hole being spaced apart from each other, and the connection channel being connected between the first communication hole and the second communication hole; when the wheel assembly is in the deployment state, the pivot shaft is connected in the first communication hole; when the wheel assembly is in the storage state, the pivot shaft is connected in the second communication hole; and during the switching of the wheel assembly into the storage state from the deployment state, the pivot shaft slides to the second communication hole from the first communication hole through the connection channel, and rotates to the second position in the second communication hole.", "16 . The child activity center according to claim 15 , wherein the base body has a through hole, the through hole being located at a side of the connection channel to enable the connection channel to be deformed.", "the connection base has two connection plates spaced apart from each other; and the wheel assembly is connected between the two connection plates.", "the connection base has a ball socket opened towards the connection plate; and the two connection plates are at least partially connected in the ball socket."], "bibtex": "@patent{20240123764,\n    title = {WHEEL ASSEMBLY STRUCTURE AND CHILD ACTIVITY CENTER},\n    number = {20240123764},\n    year = {2024},\n    note = {File: US20240123764A1-20240418.XML}\n    }", "classification": "B60B3306FI"}, {"title": "TIRE", "doc_number": "20240123765", "filename": "US20240123765A1-20240418.XML", "abstract": "Provided is a tire in which cracks do not occur in the tire inner member during high-speed running and the occurrence of tire air leakage and detachment of electronic component mounting members is suppressed. A tire in which an electronic component mounting member for a built-in electronic component is mounted on the surface of a tire inner member, wherein the electronic component mounting member has an electronic component storage portion for storing an electronic component and a joint portion equipped with a joint surface for mounting the electronic component mounting member on the surface of the tire inner member, and the acetone extraction weight AE r (mass %) of the electronic component mounting member and the acetone extraction weight AE i (mass %) of the tire inner member satisfy (formula 1). AE r /AE i >1  (formula 1)", "detailed_description": [""], "claims": ["the electronic component mounting member has an electronic component storage portion that stores the electronic component, and a joint portion that has a joint surface for mounting the electronic component mounting member to the surface of the tire inner member, and the acetone extraction amount AE", "2 . The pneumatic tire according to claim 1 , wherein the electronic component mounting member has an acetone extraction amount AE r of less than 12% by mass.", "3 . The pneumatic tire according to claim 1 , wherein the adhesion area between the joint portion of the electronic component mounting member and the tire inner member is 12 cm 2 or more.", "4 . The pneumatic tire according to claim 3 , wherein the adhesion area between the joint portion of the electronic component mounting member and the tire inner member is less than 75 cm 2 .", "5 . The pneumatic tire according to claim 1 , wherein the complex elastic modulus E* r (MPa) of the joint portion at 70° C. and the complex elastic modulus E* i (MPa) of the tire inner member at 70° C. satisfy the following (formula 2). 0.5 E* i ≤E* r ≤3.0 E* i (formula 2)", "6 . The pneumatic tire according to claim 1 , wherein the loss tangent (70° C. tan δ i ) of the tire inner member at 70° C. is 0.18 or less.", "7 . The pneumatic tire according to claim 6 , wherein the loss tangent (70° C. tan δ i ) of the tire inner member is 0.15 or less.", "8 . The pneumatic tire according to claim 1 , wherein the tire inner member is an inner liner formed of a rubber composition containing 70 parts by mass or more of butyl-based rubber in 100 parts by mass of the rubber component.", "9 . The pneumatic tire according to claim 8 , wherein the butyl-based rubber contains 30 parts by mass or less of recycled butyl rubber.", "10 . The pneumatic tire according to claim 1 , wherein a side facing the joint surface is open in the electronic component storage portion of the electronic component mounting member.", "11 . The pneumatic tire according to claim 1 , wherein the electronic component mounting member is mounted on the surface of the tire inner member using an adhesive.", "12 . The pneumatic tire according to claim 1 , wherein, in the tire cross-section, the center of said electronic component mounting member is located in the central two areas closest to the tire equatorial plane among the four areas divided by the lines extending parallel to the tire radial direction from the line that divides between the two ground contact edges forming the tread contact width into four equal parts.", "13 . The pneumatic tire according to claim 1 , which is a tire for passenger vehicles."], "bibtex": "@patent{20240123765,\n    title = {TIRE},\n    number = {20240123765},\n    year = {2024},\n    note = {File: US20240123765A1-20240418.XML}\n    }", "classification": "B60C514FI"}, {"title": "FLAT-SPOT-PROOF TIRE, AND VEHICLE HAVING THE SAME", "doc_number": "20240123766", "filename": "US20240123766A1-20240418.XML", "abstract": "A flat spot-proof tire, and a vehicle. The flat spot-proof tire comprises a tread, a cap ply, a belt ply and a carcass. The rubber hardness of the tread is 68-78 Shore A. The cap ply is formed by nylon cords having linear density of 90-140 pieces per 100 mm. The belt ply is formed by steel cords, which comprise HT steel wires and/or SHT steel wires. The carcass is formed by polyester cords having linear density of 100-120 pieces per 100 mm. The flat spot-proof tire and the vehicle use suitable industrial rubber and polyester fiber material, have a specific size design and undergo an optimized inflation process after vulcanization such that the long-term flat spot effects of the tire can be mitigated, and the jitter of the vehicle during high-speed traveling can be reduced.", "detailed_description": ["The following will provide a clear and complete description of the technical solution in the embodiments of the present document in conjunction with the accompanying drawings. Obviously, the described embodiments are only a part but not all of the embodiments of the present document. Based on the embodiments in the present document, all other embodiments obtained by those having ordinary skill the art without creative work will fall within the protection scope of the present document.", "", "The term ‘one embodiment’ or ‘embodiment’ refers to a specific feature, structure, or characteristic that can be included in at least one implementation of the present document. In the description of the present document, it should be understood that the terms “up”, “down”, “top”, “bottom”, and etc. indicate the orientation or position relationship based on the orientation or position relationship shown in the attached drawings, only for the convenience of describing the present document and simplifying the description, rather than indicating or implying that the device or element must have a specific orientation, be constructed and operated in a specific orientation, and therefore cannot be understood as a limitation of the present document. In addition, the terms “first” and “second” are only used to describe and cannot be understood as indicating or implying the importance or inherently indicating the quantity of the technical features. Therefore, the features limited by “first” and “second” can explicitly or implicitly include one or more of these features. Moreover, the terms “first”, “second”, and etc. are used to distinguish similar objects without describing a specific order or sequence. It should be understood that the data used in this way can be interchanged in appropriate cases, so that the embodiments of the present document can be implemented in an order other than those illustrated or described here.", "", "Please refer toFIG.1, which is a structural schematic diagram of an optional flat-spot-proof tire in an embodiment of the present document.FIG.1shows a tread1, a cap ply2, a belt ply3, a carcass4, a bead filler5, and a ground clearance H of a tire shoulder.", "", "The flat-spot-proof tire and the vehicle in embodiments of the present document use suitable industrial rubber and fiber polyester materials, have a specific size design, and an optimized inflation process after vulcanization, such that the long-term flat spot effect of the tire can be mitigated, and the jitter of the vehicle during high-speed traveling can be reduced.", "", "In the present document, a rubber hardness of the tread1is in a range from 68 to 78 Shore A; The cap ply2is made of nylon cords, and a linear density of the nylon cords is in a range from 90 to 140 pieces per 100 mm; The belt ply3is made of steel cords, and the steel cords are selected from a group consisting of HT steel wires and SHT steel wires; The carcass4is made of polyester cords, and a linear density of the polyester cords is in a range from 100 to 120 pieces per 100 mm.", "", "In some embodiments, a rubber hardness of the bead filler5shown inFIG.1is in a range from 74 to 90 Shore A.", "", "In some embodiments, a height of the bead filler5shown inFIG.1is in a range from 25 to 35 millimeters.", "", "In some embodiments, the ground clearance H of the tire shoulder shown inFIG.1is in a range from 6.5 to 8.5 millimeters.", "", "In some embodiments, a vulcanization time of the flat-spot-proof tire is in a range from 16 to 18 minutes, and an inflation pressure after vulcanization is in a range from 1.2 to 1.4 bar.", "", "In some embodiments, the nylon cords are PA66 wires. A fineness of the nylon cords is 930 deniers and a linear density of the nylon cords is 134 pieces per 100 mm.", "", "In some embodiments, the steel cords are HT steel wires. A diameter of the HT steel wires is 0.25 millimeters, and the HT steel wires are twisted into 2+2*0.25HT strands.", "", "In some embodiments, the polyester cords are PET wires. A fineness of the PET wires is 1500 deniers and a linear density of the PET wires is 118 pieces per 100 mm.", "", "In some embodiments, the nylon cords are PA66 wires. A fineness of the PA66 wires is 1200 deniers and a linear density of the PA66 wires is 97 pieces per 100 mm.", "", "The following is an explanation of the flat-spot-proof tire in specific examples of the present document."], "claims": ["the cap ply is made of nylon cords having a linear density of 90 to 140 pieces per 100 mm; the belt ply is made of steel cords being selected from HT steel wires and SHT steel wires; the carcass is made of polyester cords having a linear density of 100 to 120 pieces per 100 mm.", "2 . The flat-spot-proof tire according to claim 1 , wherein the flat-spot-proof tire further comprises a bead filler having a rubber hardness of 74 to 90 Shore A.", "3 . The flat-spot-proof tire according to claim 2 , wherein a height of the bead filler is in a range from 25 to 35 millimeters.", "4 . The flat-spot-proof tire according to claim 3 , wherein a ground clearance of a shoulder of the flat-spot-proof tire is in a range from 6.5 to 8.5 millimeters.", "5 . The flat-spot-proof tire according to claim 4 , wherein a vulcanization time of the flat-spot-proof tire is in a range from 16 to 18 minutes, and an inflation pressure after vulcanization is in a range from 1.2 to 1.4 bar.", "6 . The flat-spot-proof tire according to claim 5 , wherein the nylon cords are PA66 wires having a fineness of 930 deniers and a linear density of 134 pieces per 100 mm.", "7 . The flat-spot-proof tire according to claim 6 , wherein the steel cords are HT steel wires having a diameter of 0.25 millimeters and being twisted into 2+2*0.25HT strands.", "8 . The flat-spot-proof tire according to claim 7 , wherein the polyester cords are PET wires having a fineness of 1500 deniers and a linear density of 118 pieces per 100 mm.", "9 . The flat-spot-proof tire according to claim 5 , wherein the nylon cords are PA66 wires having with a fineness of 1200 deniers and a linear density of 97 pieces per 100 mm.", "wherein a rubber hardness of the tread is in a range from 68 to 78 Shore A: the cap ply is made of nylon cords having a linear density of 90 to 140 pieces per 100 mm; the belt ply is made of steel cords being selected from HT steel wires and SHT steel wires; the carcass is made of polyester cords having a linear density of 100 to 120 pieces per 100 mm.", "11 . The vehicle according to claim 10 , wherein the flat-spot-proof tire further comprises a bead filler having a rubber hardness of 74 to 90 Shore A.", "12 . The vehicle according to claim 11 , wherein a height of the bead filler is in a range from 25 to 35 millimeters.", "13 . The vehicle according to claim 12 , wherein a ground clearance of a shoulder of the flat-spot-proof tire is in a range from 6.5 to 8.5 millimeters.", "14 . The vehicle according to claim 13 , wherein a vulcanization time of the flat-spot-proof tire is in a range from 16 to 18 minutes, and an inflation pressure after vulcanization is in a range from 1.2 to 1.4 bar.", "15 . The vehicle according to claim 14 , wherein the nylon cords are PA66 wires having a fineness of 930 deniers and a linear density of 134 pieces per 100 mm.", "16 . The vehicle according to claim 15 , wherein the steel cords are HT steel wires having a diameter of 0.25 millimeters and being twisted into 2+2*0.25HT strands.", "17 . The vehicle according to claim 16 , wherein the polyester cords are PET wires having a fineness of 1500 deniers and a linear density of 118 pieces per 100 mm.", "18 . The vehicle according to claim 14 , wherein the nylon cords are PA66 wires having with a fineness of 1200 deniers and a linear density of 97 pieces per 100 mm."], "bibtex": "@patent{20240123766,\n    title = {FLAT-SPOT-PROOF TIRE, AND VEHICLE HAVING THE SAME},\n    number = {20240123766},\n    year = {2024},\n    note = {File: US20240123766A1-20240418.XML}\n    }", "classification": "B60C920FI"}, {"title": "TIRE", "doc_number": "20240123767", "filename": "US20240123767A1-20240418.XML", "abstract": "A tire includes a tread. The tread can include a cap portion and a base portion. The cap portion can include an outer cap portion on an outer side in a width direction of a vehicle when the tire is mounted to the vehicle, and an inner cap portion on an inner side in the width direction of the vehicle when the tire is mounted to the vehicle. A 300% modulus of the inner cap portion can be not less than 5.0 MPa. A 300% modulus of the outer cap portion can be higher than the 300% modulus of the inner cap portion, and can be not greater than 9.0 MPa. A first shoulder land portion can include a boundary between the outer cap portion and the inner cap portion.", "detailed_description": ["The present disclosure has been made in view of such circumstances discussed in the Background section. An object of the present disclosure, among one or more objects, can be to provide a tire that can achieve improvement of wear resistance without decreasing noise performance.", "", "According to the present disclosure, a tire that can achieve improvement of wear resistance without decreasing noise performance can be obtained.", "", "Hereinafter, the present disclosure will be described in detail based on preferred embodiments with appropriate reference to the drawings.", "", "A tire of the present disclosure can be fitted on a rim. The interior of the tire can be filled with air to adjust the internal pressure of the tire. The tire fitted on the rim may also be referred to as tire-rim assembly. The tire-rim assembly can include the rim and the tire fitted on the rim.", "", "In the present disclosure, a state where a tire is fitted on a standardized rim, the internal pressure of the tire is adjusted to a standardized internal pressure, and no load is applied to the tire can be referred to as a standardized state.", "", "In the present disclosure, unless otherwise specified, the dimensions and angles of each component of the tire are measured in the standardized state.", "", "The dimensions and angles of each component in a meridian cross-section of the tire, which cannot be measured in a state where the tire is fitted on the standardized rim, can be measured in a cross-section of the tire obtained by cutting the tire along a plane including a rotation axis. In this measurement, the tire is set such that the distance between right and left beads can be equal to the distance between the beads in the tire that is fitted on the standardized rim.", "", "The standardized rim can mean a rim specified in a standard on which the tire is based. The “standard rim” in the JATMA standard, the “Design Rim” in the IRA standard, and the “Measuring Rim” in the ETRTO standard are standardized rims.", "", "The standardized internal pressure can mean an internal pressure specified in the standard on which the tire is based. The “highest air pressure” in the JATMA standard, the “maximum value” recited in “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the FRA standard, and the “INFLATION PRESSURE” in the ETRTO standard can be regarded as standardized internal pressures.", "", "A standardized load can mean a load specified in the standard on which the tire is based. The “maximum load capacity” in the JATMA standard, the “maximum value” recited in the “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, and the “LOAD CAPACITY” in the ETRTO standard can be regarded as standardized loads.", "", "In the present disclosure, a rubber composition can refer to a composition that is obtained by mixing a base rubber and chemicals in a kneading machine such as a Banbury mixer and that contains the uncrosslinked base rubber. A crosslinked rubber can refer to a crosslinked product, of the rubber composition, obtained by pressurizing and heating the rubber composition. The crosslinked rubber can contain a crosslinked product of the base rubber. The crosslinked rubber may also be referred to as vulcanized rubber, and the rubber composition may also be referred to as unvulcanized rubber.", "", "Examples of the base rubber include natural rubber (NR), butadiene rubber (BR), styrene-butadiene rubber (SBR), isoprene rubber (IR), ethylene-propylene rubber (EPDM), chloroprene rubber (CR), acrylonitrile-butadiene rubber (NBR), and isobutylene-isoprene-rubber (IIR). Examples of the chemicals include reinforcing agents such as carbon black and silica, plasticizers such as aromatic oil, fillers such as zinc oxide, lubricants such as stearic acid, antioxidants, processing aids, sulfur, and vulcanization accelerators. Selection of a base rubber and chemicals, the amounts of the selected chemicals, etc., can be determined as appropriate according to the specifications of components, such as a tread and a sidewall, for which the rubber composition is used.", "", "In the present disclosure, a 300% modulus of a component formed from a crosslinked rubber, of the components included in the tire, can mean the tensile stress at 300% elongation specified in JIS K6251. The 300% modulus can be measured according to the standards of JIS K6251, as an example. In this measurement, a test piece can be sampled from the tire such that the length direction thereof coincides with the circumferential direction of the tire. When a test piece cannot be sampled from the tire, a test piece can be sampled from a sheet-shaped crosslinked rubber (hereinafter, also referred to as rubber sheet) obtained by pressurizing and heating a rubber composition, which can be used for forming the component to be measured, at a temperature of 170° C. for 12 minutes.", "", "In the present disclosure, the 300% modulus can be represented as a 300% modulus at 100° C.", "", "In the present disclosure, a tread portion of the tire can be a portion of the tire that comes into contact with a road surface. A bead portion can be a portion of the tire that is fitted to a rim. A sidewall portion can bef a portion of the tire that extends between the tread portion and the bead portion. The tire can include a tread portion, a pair of bead portions, and a pair of sidewall portions as portions thereof."], "claims": ["the tread has a plurality of circumferential grooves aligned in an axial direction and dividing the tread into a plurality of land portions, the plurality of circumferential grooves include a first shoulder circumferential groove on an outer side in a width direction of a vehicle when the tire is mounted to a vehicle, and a second shoulder circumferential groove on an inner side in the width direction of the vehicle when the tire is mounted to the vehicle, the land portion outward of the first shoulder circumferential groove in the axial direction is a first shoulder land portion, the land portion outward of the second shoulder circumferential groove in the axial direction is a second shoulder land portion, the tread includes a cap portion to come into contact with a road surface, and a base portion radially inward of the cap portion and covered with the cap portion, the cap portion includes an outer cap portion on the outer side in the width direction of the vehicle, and an inner cap portion on the inner side in the width direction, a 300% modulus of the inner cap portion is not less than 5.0 MPa, a 300% modulus of the outer cap portion is higher than the 300% modulus of the inner cap portion, and is not greater than 9.0 MPa, and the first shoulder land portion includes a first boundary between the outer cap portion and the inner cap portion.", "a first end, on the tread surface side, of the first boundary between the outer cap portion and the inner cap portion is a first boundary end, a second end, on the base portion side, of the first boundary is a second boundary end, the first shoulder circumferential groove includes a groove bottom, an outer groove wall on an outer side in the axial direction, and an inner groove wall on an inner side in the axial direction, a second boundary between the groove bottom and the outer groove wall is a reference position of the first shoulder circumferential groove, a distance in the axial direction from the reference position of the first shoulder circumferential groove to the first boundary end is not less than 3 mm, and a ratio of the distance in the axial direction to a ground-contact width of the first shoulder land portion is not greater than 20%.", "3 . The tire according to claim 1 , wherein, in a meridian cross-section of the tire, a distance in the axial direction from an equator plane to the first boundary between the outer cap portion and the inner cap portion gradually increases from the first boundary end toward the second boundary end.", "4 . The tire according to claim 3 , wherein, in the meridian cross-section of the tire, an angle formed between a straight line passing through the first boundary end and the second boundary end and a tangent line tangent to the tread surface at the first boundary end is not less than 5 degrees and not greater than 80 degrees.", "5 . The tire according to claim 1 , wherein the 300% modulus of the outer cap portion is not less than 8.0 MPa.", "6 . The tire according to claim 1 , wherein the 300% modulus of the inner cap portion is not greater than 7.0 MPa.", "7 . The tire according to claim 1 , wherein a ratio of the 300% modulus of the outer cap portion to the 300% modulus of the inner cap portion is not less than 1.1.", "8 . The tire according to claim 1 , wherein, in a meridian cross-section of the tire, a contour line of the first boundary between the outer cap portion and the inner cap portion is curved toward the base portion side.", "9 . The tire according to claim 2 , wherein, in a meridian cross-section of the tire, positions of the first boundary end and the second boundary end coincide with each other in the axial direction.", "10 . The tire according to claim 1 , wherein the first shoulder circumferential groove extends in the inner cap portion in a radial direction without extending into the outer cap portion or the base portion.", "a first end, on the tread surface side, of the first boundary between the outer cap portion and the inner cap portion is a first boundary end, a second end, on the base portion side, of the first boundary is a second boundary end, the first boundary end is at the tread surface, and the second boundary end is at an interface between the base portion and the cap portion.", "the outer cap portion is formed of a first crosslinked rubber, and the inner cap portion is formed of a second crosslinked rubber different from the first crosslinked rubber.", "the first shoulder circumferential groove includes a groove bottom, an outer groove wall on an outer side in the axial direction, and an inner groove wall on an inner side in the axial direction, and a first angle of the outer groove wall is greater than a second angle of the inner groove wall.", "a first end, on the tread surface side, of the first boundary between the outer cap portion and the inner cap portion is a first boundary end, the first shoulder circumferential groove includes an outer groove wall on an outer side in the axial direction and an inner groove wall on an inner side in the axial direction, and the first boundary end is spaced apart from the outer groove wall at the tread surface.", "a first end, on the tread surface side, of the first boundary between the outer cap portion and the inner cap portion is a first boundary end, a second end, on the base portion side, of the first boundary is a second boundary end, and the first boundary extends linearly continuously from the first boundary end to the second boundary end.", "the tread has a plurality of circumferential grooves aligned in an axial direction and dividing the tread into a plurality of land portions, the plurality of circumferential grooves include a first shoulder circumferential groove on a first side in the axial direction, and a second shoulder circumferential groove on a second side in the axial direction, the land portion outward of the first shoulder circumferential groove in the axial direction is a first shoulder land portion, the land portion outward of the second shoulder circumferential groove in the axial direction is a second shoulder land portion, the tread includes a cap portion to come into contact with a road surface, and a base portion radially inward of the cap portion and covered with the cap portion, the cap portion includes an outer cap portion on the outer side in the width direction of the vehicle, and an inner cap portion on the inner side in the width direction, a 300% modulus of the inner cap portion is not less than 5.0 MPa, a 300% modulus of the outer cap portion is higher than the 300% modulus of the inner cap portion, and is not greater than 9.0 MPa, the first shoulder land portion includes a first boundary between the outer cap portion and the inner cap portion, a first end, on the tread surface side, of the first boundary between the outer cap portion and the inner cap portion is a first boundary end, a second end, on the base portion side, of the first boundary is a second boundary end, the first shoulder circumferential groove includes a groove bottom, an outer groove wall on an outer side in the axial direction, and an inner groove wall on an inner side in the axial direction, a second boundary between the groove bottom and the outer groove wall is a reference position of the first shoulder circumferential groove, a distance in the axial direction from the reference position of the first shoulder circumferential groove to the first boundary end is not less than 3 mm, a ratio of the distance in the axial direction to a ground-contact width of the first shoulder land portion is not greater than 20%, and in a meridian cross-section of the tire, a contour line of the first boundary between the outer cap portion and the inner cap portion is curved toward the base portion side.", "a first end, on the tread surface side, of the first boundary between the outer cap portion and the inner cap portion is a first boundary end, a second end, on the base portion side, of the first boundary is a second boundary end, the first boundary end is at the tread surface, and the second boundary end is at an interface between the base portion and the cap portion.", "the outer cap portion is formed of a first crosslinked rubber, the inner cap portion is formed of a second crosslinked rubber different from the first crosslinked rubber, a first end, on the tread surface side, of the first boundary between the outer cap portion and the inner cap portion is a first boundary end, the first shoulder circumferential groove includes an outer groove wall on an outer side in the axial direction and an inner groove wall on an inner side in the axial direction, and the first boundary end is spaced apart from the outer groove wall at the tread surface.", "the tread has a plurality of circumferential grooves aligned in an axial direction and dividing the tread into a plurality of land portions, the plurality of circumferential grooves include a first shoulder circumferential groove on an outer side in a width direction of a vehicle when the tire is mounted to a vehicle, and a second shoulder circumferential groove on an inner side in the width direction of the vehicle when the tire is mounted to the vehicle, the land portion outward of the first shoulder circumferential groove in the axial direction is a first shoulder land portion, the land portion outward of the second shoulder circumferential groove in the axial direction is a second shoulder land portion, the tread includes a cap portion to come into contact with a road surface, and a base portion radially inward of the cap portion and covered with the cap portion, the cap portion includes an outer cap portion on the outer side in the width direction of the vehicle, and an inner cap portion on the inner side in the width direction, a 300% modulus of the inner cap portion is not less than 5.0 MPa, a 300% modulus of the outer cap portion is higher than the 300% modulus of the inner cap portion, and is not greater than 9.0 MPa, the first shoulder land portion includes a first boundary between the outer cap portion and the inner cap portion, a first end, on the tread surface side, of the first boundary between the outer cap portion and the inner cap portion is a first boundary end, a second end, on the base portion side, of the first boundary is a second boundary end, the first shoulder circumferential groove includes a groove bottom, an outer groove wall on an outer side in the axial direction, and an inner groove wall on an inner side in the axial direction, a second boundary between the groove bottom and the outer groove wall is a reference position of the first shoulder circumferential groove, a distance in the axial direction from the reference position of the first shoulder circumferential groove to the first boundary end is not less than 3 mm, a ratio of the distance in the axial direction to a ground-contact width of the first shoulder land portion is not greater than 20%, and in a meridian cross-section of the tire, positions of the first boundary end and the second boundary end coincide with each other in the axial direction.", "a first end, on the tread surface side, of the first boundary between the outer cap portion and the inner cap portion is a first boundary end, the first shoulder circumferential groove includes an outer groove wall on an outer side in the axial direction and an inner groove wall on an inner side in the axial direction, and the first boundary end is spaced apart from the outer groove wall at the tread surface."], "bibtex": "@patent{20240123767,\n    title = {TIRE},\n    number = {20240123767},\n    year = {2024},\n    note = {File: US20240123767A1-20240418.XML}\n    }", "classification": "B60C1100FI"}, {"title": "TIRE", "doc_number": "20240123768", "filename": "US20240123768A1-20240418.XML", "abstract": "A tire according to this disclosure includes a rib-like or block-like land portion in contact with a road surface. The land portion includes a plurality of sipes. The end portion of the sipe positioned on the earlier contact side in contact with the road surface earlier as the tire rotates is opened to the side wall of the land portion. The end portion of the sipe positioned on the later contact side in contact with the road surface lately as the tire rotates terminates in the land portion.", "detailed_description": [""], "claims": ["a rib-like or block-like land portion in contact with a road surface; wherein the land portion includes a plurality of sipes; a first end portion, which is an end portion of the plurality of sipes positioned on an earlier contact side in contact with the road surface earlier as the tire rotates, is opened to a side wall of the land portion; and a second end portion, which is an end portion of the plurality of sipes positioned on a later contact side in contact with the road surface lately as the tire rotates, terminates in the land portion.", "2 . The tire according to claim 1 , wherein the plurality of sipes are inclined to a tire circumferential direction.", "3 . The tire according to claim 1 , wherein the plurality of sipes extend from the earlier contact side toward the later contact side without having a portion returning to the earlier contact side.", "the land portion is in a block shape separated by a circumferential direction groove extending to the tire circumferential direction and a width direction groove extending to the tire width direction, and the first end portion is open only to a half or less of the sidewalls among the plurality of sidewalls forming the block-shaped land portion.", "a rib-like or block-like land portion in contact with a road surface; wherein the land portion includes a plurality of sipes; a first end portion, which is an end portion of the plurality of sipes positioned on a side along a flow of water flowing through a groove portion adjacent to the land portion as the tire rotates, is opened to a side wall of the land portion; and a second end portion, which is an end portion of the plurality of sipes positioned on a side opposite to the flow of water flowing through the groove portion adjacent to the land portion as the tire rotates, terminates in the land portion.", "6 . The tire according to claim 2 , wherein the plurality of sipes extend from the earlier contact side toward the later contact side without having a portion returning to the earlier contact side."], "bibtex": "@patent{20240123768,\n    title = {TIRE},\n    number = {20240123768},\n    year = {2024},\n    note = {File: US20240123768A1-20240418.XML}\n    }", "classification": "B60C1103FI"}, {"title": "Tires with Segmented Tire Bodies, Embedded Mounting Elements and Partially Embedded Cleats", "doc_number": "20240123769", "filename": "US20240123769A1-20240418.XML", "abstract": "Segmented tires employ segments featuring cooperating recesses and protrusions at opposing sides thereof for mating of the segments with one another in the assembled tire body. Cleated tires with embedded cleats of greater rigidity than the tire body material provide improved traction in muddy or other slippery conditions while the compressible tire body smooths out the ride harshness of the tire. Mounting elements are also embedded within the segments of the tire body for secure mounting and reliable retention of the segments.", "detailed_description": ["FIG.1illustrates a composite tire10featuring a cylindrically annular rubber tire body12assembled from a plurality of identical segments fasteners, and a plurality of cleat bodies16each partially embedded within a respective one of the tire body segments14. Each cleat body16is a channel-shaped piece of steel having two side walls18,20and a central span22joining the two side walls together. Each side wall18,20lies in a respective radial plane that contains and emanates radially outward from a central axis24around which the tire body concentrically closes. This central axis24defines the rotational axis on which the wheel rotates during use, and is therefore also referred to herein as the central rotational axis of the tire10. Each segment14of the tire body is a piece of rubber or other resiliently compressible material in which the central span22of the respective cleat body16is fully embedded. The outer circumference26of the tire body12is a cylindrical surface lying concentrically of the central rotational axis24, as is the inner circumference28of the tire body12, which is of smaller diameter and thus lies radially inward of the outer circumference26. Unlike a pneumatic tire where the inner circumference is defined by the bead-equipped inner ends of two side walls that reach radially inwardly from the crown of the tire at the outer circumference, the non-pneumatic tire body12has a uniform radial thickness across the full width of the tire, whereby the cylindrical band-like inner circumference of spans the full width of the tire at a uniform radial distance from the tire's central rotational axis. When mated with a rim, the non-pneumatic tire body therefore contacts the rim over a full, or substantially full, width thereof.", "", "As best shown inFIG.4, the central span22of each cleat body16resides a short distance inwardly from the outer circumference of the tire body in a tangentially oriented plane thereof, and the two side walls18,20of each cleat body16project outwardly through the outer circumference26of the tire body such that each side wall18,20defines a respective cleat30reaching radially outward from the tire body to a terminal end32of the cleat30that will therefore contact the ground during rotation of the tire. Each cleat body16is moulded into the respective segment14of the tire body during manufacture thereof, as described in more detail below, whereby each cleat30is retained in place solely by the embedded state of the respective cleat body16within the tire body, without the use of any additional cleat fasteners or cleat retention means. The central span22of each cleat body16features a series of openings34therein at spaced apart intervals in the axial direction of the tire. The tire body material spans radially across the central span22of the cleat body16through these openings34in order to more firmly secure the cleat body in place.", "", "The tire body16has two opposing sides36,38spaced apart in the axial direction thereof. A length of each cleat body16measured axially of the tire body12is slightly less than a width of the tire measured in the same axial direction between the two sides36,38of the tire body16. The cleat bodies16are centered between the two sides of the tire body, whereby each end of the cleat body terminates a short distance axially inward from the respective side of the tire body. This way, neither end of the cleat body is exposed at the respective side of the tire body, thereby improving the cleat's resistance to delamination, loosening or separation from the tire body. The central span22of each cleat body spans and defines the full length of the overall cleat body while each side wall18,20projecting outward form the outer circumference26of the tire body to define the respective cleat30has a shorter axial length than the central span22. The two cleats30of each cleat body16start at opposing ends of the cleat body16, whereby one of the two cleats resides nearer to one side of the tire body and the other cleat resides nearer to the other side of the tire body. Moving around the outer circumference26of the tire body, each cleat body16lies in an axially-reversed orientation relative to the next cleat body16. As a result, the cleats are arranged in staggered pattern in which sequentially adjacent cleats around the outer circumference of the tire body alternate between a first position adjacent the first side of the tire body and a second position adjacent the second side of the tire body. The staggering of the cleats balances the desire for cleats of notable axial length to ensure confident contact of the cleats with the ground over which the tire is travelling regardless of irregularities or variations therein, while leaving more space between cleats at the sides of the tire to better allow mud and debris to fall free of the tire instead of becoming firmly packed between tightly spaced cleats.", "", "The side walls18,20of each cleat body are planar or plate-like in form, whereby each cleat30lies axially of the tire body in a respective radial plane. Each cleat30, in a cross-sectional plane thereof cutting perpendicularly through the planar cleat in a tangential direction of the tire body therefore has a length LCor axial dimension that exceeds its thickness TCor tangential dimension. The length dimension LCof each cleat is more than half of the tire width WT, and in one embodiment less than ¾ of the tire width WT, for example measuring approximately ⅔ thereof. Since each cleat body is shorter than the tire width WT, and each cleat is shorter than the overall cleat body length (as defined by the central span22thereof), the two cleats30of each cleat body16thus overlap one another in the axial direction of the tire. Each cleat30reaches past a vertical mid-plane, which herein refers to a reference plane that cuts through the tire halfway between the sides36,38thereof and lies perpendicular to the central rotational axis24. The angular distance between any two sequentially adjacent cleat bodies16in the circumferential direction around the central rotational axis24is equal to the circumferentially angular distance between the two cleats of each cleat body16so that all the cleats are equally spaced around the tire.", "", "Each tire body segment14spans a respective partial circumferential distance around the central rotational axis24so that a convex outer surface40of each segment defines a respective span of the overall tire body's outer circumference26, while a convex inner surface42of each segment likewise defines a respective span of the overall tire body's inner circumference. Opposing first and second sides44,46of each segment face opposing directions around the central rotational axis24of the tire, and each lie in a respective radial plane thereof. The first side44of one segment thus mates in flush contact with the second side46of a sequentially adjacent segment around the circumference of the assembled tire body. Each cleat body16is circumferentially centered in the respective tire body segment14, whereby the mated-together sides of two adjacent or neighboring segments are located centrally between the two respective cleat bodies in the circumferential direction of the tire.", "", "With reference toFIGS.6A and6B, the two mating sides44,46of the neighboring segments, and thus the two opposing sides of each individual segment, have matable male and female profiles. That is, one side44of each segment has a female recessed area44atherein, while the opposing side46has a male protruding area46athereon that is sized and shaped to mate with the recessed area of the adjacent segment in the assembled tire. In the illustrated embodiments, each recessed area44aand protruding area46ahas a simple rectangular shape spanning the full radial dimension of the respective side of the segment between the inner and outer surfaces42,40thereof. Each recessed area44aand protruding area46ais centered in the axial direction of the respective segment14so that the male and female areas44a,46amate together at the mid-plane of the tire and block axial separation of adjacent segments from one another in both axial directions moving outward from said mid-plane.", "", "Each segment14has a plurality of hollow cavities therein, of which there are three in the illustrated embodiments. These three cavities52,54,56lie axially of the segment14and terminate at the opposing ends of the segment (i.e. at the opposing sides36,38of the tire body12). In the illustrated embodiments, each cavity52,54,56is open at both sides of the tire body, but is closed at the mid-plane of the tire body by an intact internal wall58of each tire body segment14that, if omitted, would result each cavity passing fully and continuously through the tire body in the axial direction, which may be true of other embodiments. Accordingly, the three cavities of each segment may be interpreted as three cavities, each of which is divided into two parallel sub-cavities situated axially end-to-end with one another and closed off from one another by the intact internal wall58of the segment, or may be interpreted as six total cavities, three on each side of the tire's mid-plane in alignment with the three cavities on the other side of the tire's mid-plane. The cavities, being void of the rubber material of the tire body segments, increase the radial compressibility of the segments compared to a solid rubber segment that lacks any such voids between the inner and outer circumference of the tire. While the illustrated embodiments feature material-void cavities that contain only air and lack any filler material therein, it will be appreciated that cavities containing a filler material of greater radial compressibility than the rubber of the tire segment14would still nonetheless increase the overall compressibility of the segment relative to a solid segment of uniform rubber composition. Accordingly, the term cavity is not intended to specifically, the absence of any material, but rather to denote the absence of the particular material surrounding the cavity, and absence of any material of lesser radial compressibility than said surrounding material. The cross-sectional shape of the cavities in planes normal to the central rotational axis of the tire may vary from those illustrated in the drawings.", "", "The cavities of each tire body segment reside at a radially intermediate region of the segment that is spaced inwardly from each of the inner and outer surfaces28,26thereof and that, more specifically, is situated radially between the respective cleat body16and the inner surface40of the segment. Accordingly, the cleat bodies16reside in a radially outer region of the tire body that is situated between the cavities52,54,56and the outer circumference26of the tire body. Accordingly, as each cleat30comes into contact with the ground during rotation of the tire, the vehicle weight exerted downwardly on the cleat will tend to collapse the cavities52,54,56of the respective tire body segment and compress the respective tire body segment inwardly toward the inner surface40thereof. The central span22of each cleat body16not only contributes to retention of the two respective cleats30to the respective tire body segment, but also distributes the vehicle weight over a greater width of the respective tire body segment14as measured between the two sides44,46of the segment14in the circumferential direction of the tire.", "", "In addition to the embedded state of the cleat bodies16, the tire body12also has mounting elements embedded within the tire body12for use in securing the tire body12to a rim that has a cylindrical outer drum over which the inner circumference28of the tire body12is to be fitted by individual fastening of the tire body segments14to the rim. With reference toFIGS.4,5and8, a respective mounting plate60of elongated rectangular bar-shape lies axially of each segment14in a radially inner region thereof that is situated between the cavity-containing intermediate region and the inner surface40of the segment14. A pair of fastening holes or openings61are provided in each mounting plate60at respective locations near the axially opposing ends60a,60bof the mounting plate60. The threaded studs or shafts62aof a respective pair of threaded fasteners62extend in a radial direction toward and through the inner surface40of the tire body segment14. An enlarged head62bof each fastener62on the outer side of the mounting plate60that faces radially outwardly toward the outer circumference26of the tire prevents the threaded stud62afrom being drawn fully through the respective mounting plate60.", "", "Each fastening hole61of the mounting plate60is square in shape, and each threaded fastener62is a carriage bolt with a square shoulder underlying the head62bof the fastener62. Each square hole61in the mounting plate60is sized to accommodate the square shoulder of the carriage bolt fastener62and constrain the carriage bolt fastener62against rotation. Accordingly, rotation of the fastener62is not only resisted by the rubber of the tire body segment14that envelopes the embedded fastener head62band embedded portion of the fastener stud62a, but also is blocked by the cooperative action between the straight sided mounting plate hole61and the mating shape of the fastener's flat-sided shoulder. Each mounting plate60resides centrally between the male and female profiled sides44,46of the respective tire body segment14in the circumferential direction of the tire body.", "", "The rim features an array of holes passing radially through the outer drum of the rim. These holes in the rim are arranged in pairs so that each pair matches up with the respective two fasteners62of one of the mounting plates60. That is, the two holes of each pair of holes in the rim are axially spaced apart from one another, and circumferentially spaced apart from the next pair, by a distance equal to the center-to-center distance between adjacent tire body segments14in the circumferential direction of the tire body12.", "", "To assemble the illustrated tire, a user places each segment14individually onto the outer drum of the rim in order to seat the inner surface42of the segment14on the convex outer surface of the rim's cylindrical drum, and thereby insert the two fastener studs62bof that segment14through a respective pair of the holes in the outer drum of the rim. At this point, locknuts (not shown) are threaded onto the free ends of the fastener studs62band tightened up against the interior of the rim's outer drum, thereby securing the tire body segment14, and the respective cleat body16partially embedded therein, in place on the rim. This process is repeated until all the tire body segments14are secured in place, thereby collectively forming the overall tire body12that now fully spans around the rim to define a completed wheel that is ready for mounting to the wheel hub of a vehicle. With the female recessed area of each segment spanning the full radial dimension of the segment's side up to the outer surface40thereof, the male and female profiles of the segment sides form slidably matable tongues and grooves that allow radial sliding of each segment into place beside the previously installed segment.", "", "Each mounting plate60is fully embedded within the radially inner region thereof so as to be surrounded by the tire material on all sides. Accordingly, the entirety of the mounting plate60is spaced radially outward from the inner surface of the tire body segment14over the full axial length of the mounting plate, thereby maximizing the area over which the inner surface of the tire body segment is clamped to the rim.", "", "Assembled wheels of the type described above are installed on a working machine such as a skid steer, skidder, wheeled excavator, or other piece of wheeled working equipment that may be expected to work in muddy or other rough terrain (fields, forests, etc.), where the steel cleats will provide beneficial for traction compared to conventional rubber tires. At the same time, the embedding of the steel cleats in a rubber or other compressible tire body provides an improved ride quality over hard ground surfaces. The resiliently radially-compressible non-pneumatic tire body provides a degree of cushioning or suspension behind each individually cleat, whereby during rolling motion of the composite tire, the vehicle weight exerted downward on a ground-contacting cleat as it moves through its lowermost revolutionary path around the tire axis will compress the underlying area of the non-pneumatic tire body that resides between that cleat and the tire's rotational axis, thereby displacing this cleat upwardly toward the tire's rotational axis such that adjacent cleats on either side of this cleat come into contact with, or closer proximity to, the ground surface. In some embodiments, the compressibility of the tire body relative to the vehicle weight is selected such that, in rotation of the tire over a flat horizontal surface, three cleats will tend to contact the ground at a time, i.e. the centermost cleat most closely underlying the wheel's rotational axis and the two cleats adjacent to this centermost cleat. This not only improves ride quality, but reduces damage to the hard ground surface by distributing the vehicle weight over multiple cleats per wheel, instead of a single cleat per wheel. Sinking of the vehicle on soft terrain is also reduced due to this improved weight distribution.", "", "FIG.9shows a variant of the forgoing wheel in which each tire body segment14features small protuberances66at select areas of the outer surface thereof, particularly at areas thereof unoccupied by the cleats30, for example at open areas residing circumferentially between adjacent cleats at the outer circumference of the tire body. The protuberances provide the tire body with a tread pattern for improved traction on irregular terrain that may project into the open outer areas of the tire body between the cleats. With the protuberances66denoting raised areas of the tire body's outer circumference26where the tire body has greater radial thickness than the thinner remainder of the tire body at unraised areas of the outer circumference26, it will be appreciated that the cleats30are embedded in the radially thinner portions of the tire body. Likewise, even in the treadless tire body of the earlier figures, the cleated areas of the tire body are not of greater or increased thickness relative to the uncleated areas between the cleats.", "", "FIG.10illustrates another variant in which instead of each tire body segment14having a single U-shaped cleat body16integrally defining two cleats30, each tire body segment features two separate cleat units68each having a flat plate-shape defining a respective individual cleat30on either side of the segment's circumferential center. Instead of openings spanning radially through a central embedded span that integrally joins together two cleats of a U-shaped cleat body, each individual cleat unit68features openings34′ spanning therethrough in the circumferential direction of the tire body so that rubber tire body material spanning through the cleat helps retain the cleat in place on the respective tire body segment14. The variant ofFIG.10features outer cavities70located nearer to the outer surface40of each segment in the radially outer region thereof, as this region need not be reserved to accommodate the tangentially oriented center span22of the U-shaped cleat bodies16in the other figures. Instead, each cleat unit68penetrates into the tire body at a location between a respective pair of the outer cavities70in the radially outer region of the segment. As shown, another set of cavities72may be provided further inward from the outer set of cavities70, for example at the radially intermediate region of the segment, which leave room at the radially inner region of the segment for the mounting elements60,62.", "", "Whether defined by individual cleat units68or multiple-cleat bodies16, the cleats30are partially embedded into the tire segments14during manufacture. This may be accomplished using insert molding techniques, where the rubber material of the tire segment14, in a melted or viscous state, is injected into a mold cavity in which the cleats have previously been placed in predetermined positions that will partially embed the cleat units68or cleat body16within the solidified rubber once hardened in place around the cleat units or cleat body, while leaving the non-embedded remainder of the cleat units or cleat body outside the mold cavity so as to reach outward from the solidified tire body and define the cleats. During the injection molding process, the cleats may be held in place in the mold using locating pins or magnetic retention. It will be appreciated that the number of cleats per segment may be reduced to one cleat per segment (or even to embodiments in which not all segments have a respective cleat). Alternatively, the number of cleats may be increased to more than two cleats per segment. While the illustrated embodiments feature eleven segments, the number and size of the segments may likewise be varied.", "", "Likewise, the mounting plates60and fasteners62are embedded into the tire segments during manufacture, for example by insert molding, in a manner leaving the threaded stud or shaft of the fastener outside the mold cavity so as to reach externally of the tire segment at the inner surface thereof. To optimize the bond of the mounting plates60within the rubber material of the finished tire segments, the mounting plates are first texturized by sandblasting and then coated with a bonding agent prior to placement of the mounting plates and threaded fasteners in the mold cavity. The bonding agent chemically bonds with the surrounding rubber during the moulding process, and the textured surfaces of the sandblasted mounting plates improve the bond at the metal/bonding-agent interface to maximize the strength of the overall bond between the plate and the rubber. In addition to the anti-rotation securement of the carriage bolt fasteners62by the matingly-shaped fastener holes in the mounting plates, each bolt fastener may also be permanently affixed to the respective mounting plate by tack welding. This also eases placement of the mounting plates and fasteners in the appropriate positions in the mold cavity by tack-welding each mounting plate and its respective fasteners into a pre-assembled unit before placement in the mold cavity.", "", "Like the mounting plates, the cleats are also roughened by sandblasting or other suitable surface texturing technique, and coated with a bonding agent prior to moulding in order to best anchor the cleats in place within the hardened rubber of the finished segments.", "", "While the cleated first embodiment features a segmented annular tire body with a central opening passing axially therethrough to accommodate a rim onto which the tire body is radially coupled by the above-described mounting elements60,62, cleats could likewise be embedded within a unitary molded tire body. In such embodiments, the unitary tire body may be of annular form having a central rim-accommodating opening therein, or may be of a non-annular form with an intact center in which axial bolt holes are provided for direct axial fastening of the tire to a wheel hub, thereby defining a rimless wheel. While the cleated first embodiment features a non-pneumatic tire body, other embodiments may feature embedding of cleats on an inflated pneumatic tire, though non-pneumatic configurations are considered preferable for rough terrain applications where the puncture-proof aspect of non-pneumatic designs provides improved durability with reduced service and repair needs.", "", "FIGS.11through13illustrate a second embodiment of a composite, segmented, non-pneumatic tire10′ whose tire body12′ features embedded mounting elements similar to the first embodiment, but which lacks embedded cleats and instead features integrally-moulded raised rubber ribs66′ at spaced positions around the outer circumference of the tire body to form an outer tread of the tire. In the illustrated embodiment, each rib is elongated in the axial direction of the tire, and each segment features two such ribs. The ribs are laid out in the same staggered pattern as the cleats of the first embodiment, whereby the two ribs of each segment originate at opposing sides of the tire body, and each rib crosses the mid-plane of the tire body and terminates short of the opposing side of the tire body. In its direction of elongation, each rib first extends axially from the side of the tire body at which the rib originates, then deviates from the axial direction by a small acute angle, before returning to an axial orientation at its terminating end. Each rib thus has axially oriented originating and terminating portions66a,66b, and an angled middle portion66cby which the terminating portion66bis offset from the originating portion66ain a predetermined direction around the circumference of the tire body.", "", "FIG.13illustrates the mounting plate60′ and carriage bolt fasteners62that are moulded in place within each tire segment, as can be seen in the cross-sectioned tire segment14′ ofFIG.12B. The mounting plate60′ is larger than that of the first embodiment, specifically having a greater width to its rectangular shape so as to span a substantial majority of the tire segment width between the opposing sides44,46thereof to better anchor the segment in place on the wheel rim in the finished tire assembly. The larger mounting plate has four fasteners62passing through it at respective fastening holes near the four corners of its rectangular shape. Once again, the fastening holes are square in order to cooperate with the squared shoulder of the carriage bolt fasteners to prevent rotation thereof relative to the mounting plate60′. The mounting plates and cooperating fasteners perform the same function as in the first embodiment, and the mounting plates likewise have the fasteners pre-welded thereto and are sandblasted and pre-coated with a bonding agent before being molded into their embedded positions anchored within the hardened rubber of the finished tire segments.", "", "In addition to the surrounded state of the fully embedded mounting plate by the surrounding rubber of the tire segment, further mechanical anchoring of each mounting plate in place within the respective segment is achieved by inclusion of mould-through openings63in the mounting plate that serve the same function as the mould-through openings34/34′ in the cleats. During the moulding process, the flowable rubber thus not only surrounds each mounting plate on all sides thereof, but also passes through each mounting plate via the mould-through openings63therein. Once the rubber is hardened, this further anchors the mounting plate60′ and affixed fasteners62in place within the tire segment. This mechanical anchoring is further reinforced by the chemically-formed bond between the hardened rubber and the coated mounting plate. In the illustrated embodiment, multiple mould-through openings63of various shapes are defined in the plate at various locations spread across and along the plate, but it will be appreciated that the quantity, location(s) and shape(s) of the mould-through opening(s) may vary.", "", "FIG.11Ashows the tire during assembly, where the segments are placed onto the drum100of a wheel rim102so that the studs62aof the fasteners62project inwardly through the drum100via pre-defined bolt holes therein so that respective nuts can be tightened onto the fastener studs to secure the segments to the wheel rim. Like the first embodiment, the segments feature mating recessed and protruding areas44a,46aat opposing sides thereof for interlocking mating of the segments with one another during tire assembly.", "", "Further description is made herein of a number of distinctive traits of the tire segments that are clearly illustrated in the appended figures. Referring toFIGS.6A and12A, where the recessed area44A at the first side of the tire segment is respectively neighbored on its two sides by two non-recessed areas, it can be seen that a width dimension WRof the recessed area, measured in the axial direction of the tire, exceeds a respective width dimension WNof each of the non-recessed areas, measured in the same axial direction. As shown inFIGS.11B and12A, the raised treads66′ of each segment are discretely spaced from one another in the circumferential direction of the tire over an entire axial span of the raised treads66′ in the axial direction of the tire. Accordingly, the raised treads are unconnected at elevations of radially raised relation to the unraised areas between the raised treads. As can be seen inFIGS.11A and11B, the axial width WRof the recessed area of each segment exceeds the radial height HRof the recessed area (WR>HR). Referring to the right side ofFIG.12B, a first side wall SW1of the tire segment neighbors the cavity56at the first side of the tire segment, and is therefore characterized by the presence of recessed area44A in the outer face of this side wall. Referring to the left side ofFIG.12B, a second side wall SW2of the tire segment neighbors the cavity52at the second side of the tire segment, and is characterized by the presence of protruding area46A on the outer face of this side wall. The first side wall SW1has a reduced wall thickness TRat the recessed area44A compared to a greater full wall thickness TFpossessed by the first side wall at the neighboring non-recessed areas. The difference between the full wall thickness TFand the reduced wall thickness TRthus denotes a recess depth DRof the recessed area44A (DR=TF−TR). It can also be seen that this recess depth is less than the reduced wall thickness (DR<TR). The recessed area44A is characterized by lack of a raised tread66′ thereat, whereby the radial dimension of the first side of the segment at the recessed area thereof is less than the radial dimension of the second side of the segment at the protruding area thereof.", "", "Since various modifications can be made in my invention as herein above described, and many apparently widely different embodiments of same made within the scope of the claims without departure from such scope, it is intended that all matter contained in the accompanying specification shall be interpreted as illustrative only and not in a limiting sense."], "claims": ["a resiliently radially-compressible non-pneumatic tire body having an outer circumference spanning circumferentially around a central rotational axis on which said tire body is rotatable, said tire body comprising a plurality of tire segments each made of a same molded material as one another and each spanning a respective partial circumferential distance around said central rotational axis, which denotes an axial direction of the tire; wherein: each segment comprises a first side facing a first circumferential direction around the rotational axis of the tire body and a second side facing an opposing second direction around the rotational axis, the first side having a recessed area therein and the second side having a protruding area thereon sized and shaped for mating with the recessed area in the first side of an adjacent one of the plurality of tire segments, and of which said first and second sides, including the recessed and protruding areas thereof, are all composed of said molded material of the segment; the recessed and protruding areas of adjacent segments mate together and block axial separation of said adjacent segments from one another in the axial direction; the recessed area of each segment reaches an outer surface thereof that defines a respective portion of the tire body's outer circumference so as to accommodate radial sliding of the adjacent tire segment into place during assembly of the tire body; each segment, at the outer surface thereof, comprises a plurality of raised treads, at which a radial thickness of the segment is greater than at unraised areas of the outer surface between said raised treads; and one of said treads of each segment occupies the protruding area at the second side of the segment, and said raised treads of each segment are discretely spaced from one another in the circumferential direction of the tire body throughout an entire axial span of said raised treads in the axial direction, and are thus entirely unconnected to one another at elevations of radially raised relation to said unraised areas between the raised treads.", "2 . The segment tire of claim 1 wherein the recessed area at the first side of the segment is one of said unraised areas and therefore lacks presence of any of said raised treads thereat, whereby the radial dimension of the first side of the segment at the recessed area thereof is less than the radial dimension of the second side of the segment at the protruding area thereof.", "3 . The segmented tire of claim 1 wherein, at the first side of each segment, there are two non-recessed areas that each neighbor a respective side of the recessed area in the axial direction, and a width dimension of said recessed area measured in the axial direction exceeds a respective width dimension of each of said non-recessed areas measured in said axial direction.", "4 . The segmented tire of claim 3 wherein the width dimension of said recessed area also exceeds a height dimension thereof, measured radially of the central rotational axis.", "5 . The segmented tire of claim 1 wherein each segment comprises mounting elements embedded within the tire body for use in securing coupling said tire body to a compatible rim.", "6 . The segmented tire of claim 1 wherein the mounting elements of each segment comprise a mounting plate fully embedded within the tire body.", "7 . The segmented tire of claim 6 wherein the mounting plates comprise holes therein through which respective fasteners extend inwardly toward and through an inner circumference of the tire body that opposed the outer-circumference thereof.", "8 . The segmented tire of claim 7 wherein the holes in the mounting plates and the respective fasteners are cooperatively shaped to block rotation of the fasteners relative to the mounting plates.", "9 . The segmented tire of claim 8 wherein each fastener is a carriage bolt, and each hole of the mounting plates is sized and shaped to receive a square shoulder of the carriage bolt and constrain said square shoulder against rotation.", "10 . The segmented tire of claim 7 wherein the fasteners are affixed to said mounting plates.", "11 . The segmented tire of claim 7 wherein the fasteners are welded to said mounting plates.", "12 . The segmented tire of claim 1 wherein at least one of the mounting elements is coated with a bonding agent, and said bonding agent is chemically bonded with the molded material of the tire body.", "13 . The segmented tire of claim 1 wherein at least one of the mounting elements comprises textured surfaces providing improved bonding with the molded material of the tire body.", "14 . The segmented tire of claim 13 wherein said at least one of the mounting elements is sandblasted.", "15 . The segmented tire of claim 1 wherein at least one of the mounting elements has at least one opening therein at a location embedded within the tire body, and the molded material of the tire body spans through said mounting element via said at least one opening.", "16 . The segmented tire of claim 1 wherein the mounting elements comprise fasteners partially embedded within the tire and reaching inwardly from the inner circumference thereof.", "17 . A skid steer vehicle having installed thereon a set of wheels each equipped with a respective segmented tire according to claim 1 ."], "bibtex": "@patent{20240123769,\n    title = {Tires with Segmented Tire Bodies, Embedded Mounting Elements and Partially Embedded Cleats},\n    number = {20240123769},\n    year = {2024},\n    note = {File: US20240123769A1-20240418.XML}\n    }", "classification": "B60C1116FI"}]