[{"title": "BICYCLE WHEEL ASSEMBLY STRUCTURE", "doc_number": "20240270011", "filename": "US20240270011A1-20240815.XML", "abstract": "A bicycle wheel assembly structure includes an annular rim, a hub, nipples, and spokes. The annular rim includes rim penetration sections, each of which includes a rim-side limiting part. The hub is arranged at a center of the annular rim and includes hub penetration sections. The nipples each include a thread-connecting section and a nipple limiting part. The nipples are arranged on the rim penetration sections, and the nipple limiting parts are mounted to the rim-side limiting parts. The spokes include an intermediate section, a head section, and a thread section. The head sections are mounted to the hub penetration sections. The thread sections are connected to the thread-connecting sections of the nipples. The spokes, when set between the annular rim and the hub, induce tensions that cooperate with static frictional forces at the rim-side limiting parts and the nipple limiting parts resist sliding and prevent loosening of the spokes.", "detailed_description": ["Referring toFIGS.1-3, which are respectively a first schematic view showing an arrangement of a nipple and a spoke according to the present invention, a second schematic view showing an arrangement of a nipple and a spoke according to the present invention, and a schematic view showing a state of use of the present invention, as shown in the drawings, the present invention discloses a bicycle wheel assembly structure, which at least comprises an annular rim1, a hub2, multiple nipples3, and multiple spokes4.", "", "The annular rim1is provided with multiple rim penetration sections11, and each of the rim penetration sections11is provided, at an edge thereof, with a rim-side limiting part12.", "", "The hub2is arranged at a center of the annular rim1, and the hub2is provided with multiple hub penetration sections21.", "", "Each of the nipples3is provided, in an inside thereof, with a thread-connecting section31, and each of the nipples3is provided, on an outside thereof, with a nipple limiting part32. The nipples3are arranged on the rim penetration sections11of the annular rim1, and the nipple limiting part32of the nipples3are respectively mounted to the rim-side limiting parts12.", "", "Each of the spokes4comprises an intermediate section41, a head section42, and a thread section43. The head section42is arranged at one end of the intermediate section41, and the thread section43is arranged at an opposite end of the intermediate section41. The head sections42of the spokes4are respectively mounted to the hub penetration sections21, and the thread sections43of the spokes4are respectively connected to the thread-connecting sections31of the nipples3.", "", "In one embodiment of the present invention, for each of the spokes4, the intermediate section41, the head section42, and the thread section43are integrally formed together as a one piece structure and are arranged at a common location in a longitudinal direction so that each of the spokes4is structured with a linear configuration (as shown inFIG.1). Alternatively, each of the spokes4comprises a bend section45between the intermediate section41and the head section42, and the intermediate section41, the head section42, the thread section43, and the bend section45are integrally formed together as a one piece structure, and the intermediate section41and the thread section43are arranged at a common location in a longitudinal direction, while the head section42and the bend section45are arranged at a common location in a transverse direction, so that each of the spokes4shows an end-curved configuration (as shown inFIG.2).", "", "To assemble the present invention, the nipples3are respectively set in the rim penetration sections11of the annular rim1, such that the nipple limiting parts32of the nipples3are respectively mounted to the rim-side limiting parts12; and, the head sections42of the spokes4(for both the linear configuration and the end-curved configuration of the spokes4) are respectively set in the hub penetration sections21, and the thread sections43of the spokes4are respectively screwed into engagement with the thread-connecting sections31of the nipples3, so as to have each of the spokes4set up between the annular rim1and the hub2by means of natural ways of coupling, without the need for additionally applying a nylon insert or adhesives or modifying the shape of each of the spokes4, wherein the tension of each of the spokes4cooperates with a static frictional force generated at the rim-side limiting part12and the nipple limiting parts32to resist sliding of the spoke4and present loosening thereof.", "", "In one embodiment of the present invention, each of the rim-side limiting parts12is structured as an internal hexagonal pyramid (or polygonal pyramid), and each of the nipple limiting parts32is structured as an external hexagonal pyramid (or polygonal pyramid), so that each of the nipple limiting parts32and a respective one of the rim-side limiting parts12, after being combined with each other, demonstrate an effect of limiting and constraining each other in position. As such, by means of the multiple-angled configuration of each of the rim-side limiting parts12and each of the nipple limiting parts32, when the spokes4are set up between the annular rim1and the hub2, the tension of each of the spokes4cooperates with a static frictional force generated at each of the rim-side limiting parts12and a respective one of the nipple limiting parts32to resist sliding of the spokes4and also prevent loosening thereof.", "", "In one embodiment of the present invention, each of the hub penetration sections21has an internal circumference along which a hub-side limiting part22is formed, and each of the head sections42has an external circumference along which a spoke limiting part44is formed, wherein the hub-side limiting part22is structured as an internal hexagonal pyramid (or polygonal pyramid), and each of the spoke limiting parts44is structured as an external hexagonal pyramid (or polygonal pyramid), and the spoke limiting parts44of the head sections42of the spokes4are respectively mounted to the hub penetration sections21, so that each of the spoke limiting parts44and a respective one of the hub-side limiting parts22, after being combined with each other, demonstrate an effect of limiting and constraining each other in position. As such, by means of the multiple-angled configuration of each of the rim-side limiting parts12, each of the hub-side limiting parts22, each of the nipple limiting parts32, and each of the spoke limiting parts44, when the spokes4are set up between the annular rim1and the hub2, the tension of each of the spokes4cooperates with a static frictional force induced at the rim-side limiting part12and the hub-side limiting part22, and the nipple limiting part32and the spoke limiting part44to resist sliding of the spokes4and also prevent loosening thereof.", "", "In summary, the present invention provides a bicycle wheel assembly structure that effectively overcomes the defects of the prior art in such a way that when the spokes are set up between the annular rim and the hub, tensions of the spokes cooperate static frictional forces induced at the rim-side limiting parts and the nipple limiting parts to resist sliding of the spokes and also prevent loosening thereof."], "claims": ["an annular rim, which is provided with multiple rim penetration sections, each of the rim penetration sections being provided, at an edge thereof, with a rim-side limiting part; a hub, which is arranged at a center of the annular rim, the hub being provided with multiple hub penetration sections; multiple nipples, each of the nipples being provided, in an inside thereof, with a thread-connecting section, each of the nipples being provided, on an outside thereof, with a nipple limiting part, the nipples being respectively arranged on the rim penetration sections of the annular rim, the nipple limiting parts of the nipples being respectively mounted to the rim-side limiting parts; and multiple spokes, each of which comprises an intermediate section, a head section, and a thread section, the head section being arranged at one end the intermediate section, the thread section being arranged at an opposite end of the intermediate section, the head sections of the spokes being respectively mounted to the hub penetration sections, the thread sections of the spokes being respectively connected to the thread-connecting sections of the nipples.", "2 . The bicycle wheel assembly structure according to claim 1 , wherein each of the rim-side limiting parts is formed as an internal hexagonal pyramid, and each of the nipple limiting parts is formed as an external hexagonal pyramid, so that the nipple limiting part and the rim-side limiting part, after being mounted, limit and constrain each other in position.", "3 . The bicycle wheel assembly structure according to claim 1 , wherein each of the hub penetration sections has an internal circumference along which a hub-side limiting part is formed, and each of the head sections has an external circumference along which a spoke limiting part is formed, wherein the head section of each of the spokes is mounted by means of the spoke limiting part, to each of the hub penetration sections.", "4 . The bicycle wheel assembly structure according to claim 3 , wherein each of the hub-side limiting parts is formed as an internal hexagonal pyramid, and each of the spoke limiting parts is formed as an external hexagonal pyramid, so that the spoke limiting part and the hub-side limiting part, after being mounted, limit and constrain each other in position.", "5 . The bicycle wheel assembly structure according to claim 1 , wherein for each of the spokes, the intermediate section, the head section, and the thread section are integrally formed together as a one piece structure, and are arranged at a common location in a longitudinal direction so that each of the spokes shows a linear configuration.", "6 . The bicycle wheel assembly structure according to claim 1 , wherein each of the spokes comprises a bend section between the intermediate section and the head section, and the intermediate section, the head section, the thread section, and the bend section are integrally formed together as a one piece structure, and the intermediate section and the thread section are arranged at a common location in a longitudinal direction, while the head section and the bend section re arranged at a common location in a transverse direction, so that each of the spokes shows an end-curved configuration."], "bibtex": "@patent{20240270011,\n    title = {BICYCLE WHEEL ASSEMBLY STRUCTURE},\n    number = {20240270011},\n    year = {2024},\n    note = {File: US20240270011A1-20240815.XML}\n    }", "classification": "B60B104FI"}, {"title": "ULTRA-LIGHTWEIGHT STEEL WHEEL FOR COMMERCIAL VEHICLE", "doc_number": "20240270012", "filename": "US20240270012A1-20240815.XML", "abstract": "The present application relates to an ultra-lightweight steel wheel for a commercial vehicle. The wheel has excellent material characteristics and an advanced design, and consists of a rim for mounting a tire, and a disc having a hub flange for detachably connecting to a wheel hub or axle, wherein the rim and/or disc is made of a heat-treated and hardened steel material with a carbon content between 0.18 wt % and 0.37 wt %, and the disc and/or rim principally consists of a martensitic microstructure and has a tensile strength of at least 900 MPa. The maximum thickness of the rim is less than 4.50 mm and/or the maximum thickness of the disc is less than 12.00 mm, wherein the value of the product of the wheel diameter and the wheel width divided by the wheel mass is greater than 4000 mm 2 /kg.", "detailed_description": ["FIG.1shows a sectional view through a sample embodiment of a commercial vehicle steel wheel (1) according to the present application. The commercial vehicle wheel (1) comprises: a grooved rim (2) with a (for example) 15° tire bead seat, for holding a tubeless tire (the tire is not shown); and a disc (3) connected to the rim (2). The commercial vehicle wheel shown has a diameter (D) of 572 mm and a width (W) of 229 mm, and is designed as a truck wheel with dimensions of 22.5×9.00 and a maximum wheel load of 4000 kg.", "", "The disc (3) is bowl shaped, principally comprising a planar hub flange region (5) and a conical region (10); the hub flange region (5) has a central hole (8) and bolt holes (9) for detachably connecting to a hub, the conical region (10) has ventilation holes or inspection holes (11), and the conical region ends at a joint region (A) of an outer diameter and the rim (2). The disc (3) is formed as a single piece by spinning, and has different thicknesses, with a maximum thickness (T1) located in the hub flange region (5) and reaching 11.0 mm.", "", "The thickness of the conical region (10) varies radially, with a minimum thickness of 4.0 mm (T2). The disc (3) is formed of manganese boron steel, in particular 30MnB5. After spinning and after-treatment operations (e.g. cutting), the disc (3) undergoes heat treatment and hardening, to achieve dominance of a martensitic microstructure in the final component. After heat treatment and hardening, the strength of the disc (3) is greater than 1400 MPa (Rm), in particular in the conical region.", "", "The rim (2) is annular, with an overall thickness (T3) reaching 3.7 mm; the maximum rim thickness is also 3.7 mm. The rim is also formed of manganese boron steel, in particular 20MnB5. After forming the annular shape and shaping, the rim also undergoes heat treatment and hardening, to achieve a completely martensitic microstructure in the final component. After heat treatment, the material strength of the rim (2) is greater than 1200 MPa (Rm).", "", "The disc (3) and the rim (2) are joined by press-fitting and laser welding. The total thickness (O) of the lap joint is 7.7 mm, so is less than the maximum permitted thickness of 11.0 mm. Based on the design thicknesses of all components, all defined thickness proportions are satisfied. The product of the maximum rim thickness (T3) and the minimum disc thickness (T2) reaches 14.8 mm2, which is less than the specified value of 30 mm2. The product of thicknesses (T1) and (T3) is equal to 40.7 mm2, which is less than the specified value of 56 mm2, and in particular is less than the specified value of 50 mm2. The total wheel mass is about 26 kg, so the key performance factor of the designed wheel is 5038 mm2/kg, which is obviously greater than the required 4000 mm2/kg.", "", "In comparison, the weight of a commercial vehicle steel wheel in the prior art, in a comparable state and with the same dimensions and wheel load, is about 36 kg. The maximum rim thickness is greater than 4.50 mm, and the maximum thickness of the disc in the hub flange is generally greater than 12.0 mm. Thus, a standard wheel cannot meet all of the requirements of the disclosed wheel.", "", "To reduce weight further, it is also possible to apply a spinning process to the rim (2) rather than to the disc (3) alone, and optimize the thickness distribution along the rim width before the heat treatment and hardening process.", "", "According to another solution of the embodiments, the rim (2) is made of manganese boron steel, in particular 22MnB5, and the disc (3) is made of a steel material with a carbon content lower than 0.18 wt %; this steel material undergoes cold forming, but does not undergo heat treatment and hardening, and in particular is a microalloyed fine-grained structural steel, specifically S 550 MC, for example. The rim thickness (T3) reaches 3.50 mm, the maximum thickness (T1) of the disc (3) in the hub flange (5) reaches 12 mm, and the minimum thickness (T2) of the disc (3) in the conical region (10) reaches 6.00 mm. The rim (2) alone undergoes additional heat treatment and hardening and has a microstructure in which martensite is dominant, preferably having at least 90% martensite, and the strength of the final component is greater than 1400 MPa (Rm). Conversely, the microstructure of the disc (3) does not change, and the material strength is equal to about 700 MPa (Rm), in particular, mainly in the hub flange region (5). The content of martensite in the microstructure of the disc (3) is less than 20% (including 0%).", "", "The width (W) of the wheel (1) is measured radially from an inside tire bead seat region to an outside tire bead seat region, and the diameter (D) is measured radially from one tire bead seat region to another tire bead seat region, as shown inFIG.1.", "", "FIG.2shows a micrograph through a joint and contact region (A) between the rim (2) and disc (3). In this embodiment, the disc (3) and the rim (2) are joined by press-fitting and additional arc welding (F). The thermal joining of the disc (3) and the rim (2) is not limited to arc welding; laser welding, CMT welding, laser hybrid welding and brazing may also be used, but a controllable joining technique with a low heat input is preferred. Thus, adhesive bonding may also be used to make the stress distribution uniform, and avoid the input of more heat into the wheel components."], "claims": ["1 . A commercial vehicle steel wheel, having a rim for mounting a tire, and a disc having a hub flange for detachably connecting to a wheel hub, wherein at least one of the rim and disc is made of a heat-treated and hardened steel material with a carbon content between 0.18 wt % and 0.37 wt %, and at least one of the disc and rim principally consists of a martensitic microstructure and has a tensile strength of at least 900 MPa, wherein at least one of characterized in that the maximum thickness (T 3 ) of the rim is less than or equal to 4.50 mm and the maximum thickness (T 1 ) of the disc is less than or equal to 12.00 mm, wherein a value of a product of a wheel diameter (D) and a wheel width (W) divided by a wheel mass is greater than 4000 mm 2 /kg.", "2 . The commercial vehicle steel wheel as claimed in claim 1 , wherein a product of a maximum thickness (T 3 ) of the rim and the maximum thickness (T 1 ) of the disc is less than 56 mm 2 .", "3 . The commercial vehicle steel wheel as claimed in claim 2 , wherein a product of the maximum thickness (T 3 ) of the rim and the minimum thickness (T 2 ) of the disc is less than 30 mm 2 .", "4 . The commercial vehicle steel wheel as claimed in claim 3 wherein the disc and the rim are press-fitted, and are additionally fixed permanently by at least one of welding, adhesive bonding and brazing, wherein a total thickness (O) of a contact region (A) of a press-fitted joint of all wheel components is less than 11.0 mm.", "5 . The commercial vehicle steel wheel as claimed in claim 4 wherein an additional heated region with a radius (R) of 25 mm is exhibited around a weld region (F) of at least one of the disc and the rim, and a hardness value of at least one of the disc and the rim falls to lower than 350 HV 0.1 in the additional heated region.", "6 . The commercial vehicle steel wheel as claimed in claim 5 wherein at least one of the wheel diameter (D) is greater than or equal to 420 mm and the wheel width (W) is greater than or equal to 175 mm.", "claim", "8 . The commercial vehicle steel wheel as claimed in claim 6 wherein the wheel diameter (D) is between 560 mm and 600 mm.", "9 . The commercial vehicle steel wheel as claimed in claim 6 wherein the wheel width (W) is between 200 mm and 300 mm.", "10 . The commercial vehicle steel wheel as claimed in claim 6 wherein an average surface roughness (Ra) of at least one of (i) the heat-treated and hardened disc and (ii) rim is between 0.8 μm and 1.8 μm.", "11 . The commercial vehicle steel wheel as claimed in claim 6 wherein one of a spinning and spin forming process is used to form the disc and rim having different thicknesses.", "12 . The commercial vehicle steel wheel as claimed in claim 6 wherein the disc has a ventilation hole or an inspection hole, such that a hardness in a vicinity of an edge of the inspection hole will not fall to a hardness value lower than 350 HV 0.1.", "13 . The commercial vehicle steel wheel as claimed in claim 6 wherein the rim is made of heat-treated and hardened steel consisting principally of a martensitic microstructure, and has a tensile strength of at least 900 MPa, wherein the disc is made of a different steel material, which is a cold-formed steel material and has not undergone heat treatment and hardening.", "14 . The commercial vehicle steel wheel as claimed in claim 6 wherein the rim and the disc are both made of heat-treated and hardened steel, and the rim and disc principally consist of a martensitic microstructure and have a tensile strength of at least 900 MPa."], "bibtex": "@patent{20240270012,\n    title = {ULTRA-LIGHTWEIGHT STEEL WHEEL FOR COMMERCIAL VEHICLE},\n    number = {20240270012},\n    year = {2024},\n    note = {File: US20240270012A1-20240815.XML}\n    }", "classification": "B60B300FI"}, {"title": "A MECANUM WHEEL MODULE", "doc_number": "20240270013", "filename": "US20240270013A1-20240815.XML", "abstract": "A compact mecanum wheel module is disclosed. The mecanum wheel module comprises: a hub that is configured to house a motor. The hub comprises a circular planar portion and a cylindrical portion extending from the circular planar portion. The cylindrical portion forms a base of a rim of the wheel. A plurality of rollers are mounted on and around the base of the rim, the plurality of rollers each comprising a shaft and a rotatable body, the rotatable body being mounted to the shaft via needle bearings.", "detailed_description": ["Before discussing the examples in any more detail, first an overview will be provided.", "", "Mecanum wheels allow for omnidirectional movement of a vehicle by the use of rollers mounted around the rim of a wheel in place of tyres at an oblique angle, typically at an angle of 45° to the axis of rotation. The wheels on one side of the vehicle may have the rollers angled in one direction and the wheels on the other side of the vehicle in the opposite direction such that they are mirror images of each other. This provides an angled force on the vehicle from individual wheels and allows directional control by controlling the speed and direction of rotation of the wheels individually. A vehicle with such wheels mounted on it can move omnidirectionally. Examples seek to provide a mecanum wheel module that is both compact and can support high loads, that is loads of over 300 kgs. Such a module would allow substantial loads to be moved in confined and complex spaces. This may be particularly applicable to transporting vacuum system components within a sub-fab.", "", "A mecanum wheel module of examples provides a substantial load capacity, in a small footprint, with actuation components built into the module. Conventionally on vehicles with mecanum wheels the motor driving the wheel extends axially beyond the wheel, into the body of the chassis increasing the space taken up by the mecanum wheel and drive system. Examples avoid the extension of a motor into the chassis, by configuring a custom wheel hub that allows the motor to be mounted inside the volume of the wheel and wheel hub.", "", "Providing a mecanum wheel module where the rollers comprise needle bearings between the shafts and the rotating body distributes the weight across a larger surface area than would be case with roller bearings and allows the rollers to support an increased load. Furthermore, by mounting the motor and brake mechanism within the hub of the wheel, a wheel and drive system is provided that is not only compact but also modular. This allows each wheel module to be fitted, replaced and serviced individually in a simple manner with the attachment or disengagement of a mounting mechanism and control and power cables.", "", "FIG.1shows an isometric view of a mecanum wheel assembly according to an example. This shows a spool—shaped aluminium hub1which comprises a circular planar surface10that forms an outer surface of the hub1when the wheel is mounted to a vehicle. Multiple individual rollers3are mounted around the base of the rim15of the hub. A fabricated aluminium or steel housing2that serves as a mounting plate for the mecanum wheel assembly is mounted above and around the upper surface of the wheel. This housing protects the wheel and allows a load path to the chassis of the vehicle that the wheel is attached to, and also has a back plate portion that provides a mounting location for an in-hub motor. The upper surface of this housing provides the surface for mounting the wheel module to the vehicle and also protects the wheel and vehicle from debris thrown up by the wheel. The upper surface of this mounting component or housing is shown here, and there is a back plate that extends behind the wheel opposite to the planar surface1and on which the motor is mounted.", "", "The rollers3comprise custom, heavy-duty idle rollers, each of which is angled at 45° to the axis of the overall wheel's rotation. These are shown in more detail inFIG.3.", "", "FIG.2shows a section view of the mecanum wheel module or assembly. The section view shows the rollers3mounted around the rim15of the hub1. The rollers are mounted at an oblique angle to the axis of rotation of the wheel with the shafts of the rollers being attached to the inner and outer ring-shaped surfaces that form the side surfaces of the rim15of the hub1via screws facing towards the axis of overall wheels' rotation.", "", "A motor7is mounted within a recess1cwithin the hub1. The recess1cis machined into the aluminium hub1and this provides a robust housing for the motor. The motor7is in this example a high-ratio (˜20:1) electric motor including closed-loop control using Hall effect sensors and incremental encoder enabling the forced rotation of the wheel relative to the wheel housing. The aluminium or steel housing2that serves as the mounting component is shown here with both the upper mounting and vehicle protecting section along the upper portion and with the back plate on which the motor7is mounted facing the planar surface10of the hub. There is a sheet-metal guard portion4that protects the cabling from potential objects that may be kicked up by the wheel and lodged into the housing.", "", "Wire routing relief holes5that allow power and data cables to safely pass through the body of the wheel assembly to the motor are provided within the guard portion. These cables also allow for the wheel assembly to be easily connected and disconnected from the vehicle. This guide component5provides protection for the wires which may be power and data cables and allows them to safely pass through the body of the wheel assembly to the motor.", "", "In this example the motor7is mounted at a distance from the planar surface10and there is a space6for the mounting of a braking mechanism (not shown) allowing the braking of each wheel to be individually controlled.", "", "FIG.3shows a section through an individual roller. This section shows a steel shaft13that in use is affixed to the inner and outer edges of the rims of the hub at an oblique angle to the circumference. Around this steel shaft13is mounted an aluminium barrel12with a truncated oval cross-section and this rotates on the shaft13and is supported by needle bearings11. These needle bearings11allow high loads to be transferred from the barrel to the shaft while exhibiting low rolling friction. They extend along more than 10% of the length of the roller barrel and this provides a significant surface area over which the force and torque imparted to the shaft via the barrel is spread. A potential weak point of such arrangements will be via the bearings and providing needle bearings rather than roller bearings makes for a more robust mechanism that can support a higher load.", "", "The roller3comprises the aluminium barrel12and this has a polyurethane outer layer9. The polyurethane layer exhibits a Shore hardness of 90A. This material is capable of withstanding up to 4,400 N (1.000 lbs) of compression without breaking.", "", "The aluminium barrel12provides structural strength to the roller and helps distribute the load applied to the exterior of the polyurethane layer to the bearings. This barrel also controls the shape of the roller itself, which contributes to the wheel's omnidirectional functionality.", "", "The needle bearings11are press fitted into a recess16machined into shaft13. The press fitting retains the needle bearings in position but additional retaining means may be used, as the forces on the rollers are high. In this example the additional retaining means comprises a retaining washer8and a thrust bearing17.", "", "Although illustrative examples of the disclosure have been disclosed in detail herein, with reference to the accompanying drawings, it is understood that the disclosure is not limited to the precise example and that various changes and modifications can be effected therein by one skilled in the art without departing from the scope of the disclosure as defined by the appended claims and their equivalents."], "claims": ["a hub, said hub comprising a circular planar portion and a cylindrical portion extending from said circular planar portion, said cylindrical portion forming a base of a rim of said wheel; a plurality of rollers mounted on and around said base of said rim; said plurality of rollers each comprising a shaft and a rotatable body, said rotatable body being mounted to said shaft via needle bearings.", "2 . A mecanum wheel module according to claim 1 , wherein said mecanum wheel module comprises a low footprint, high load mecanum wheel, said mecanum wheel module comprising a volume of less than 8,500 cm 3 preferably less than 8,000 cm 3 more preferably less than 7,700 cm 3 and being configured to support a load of at least 300 Kg, preferably more than 330 Kg, more preferably more than 340 Kg.", "3 . A mecanum wheel module according to claim 1 , said needle bearings being located towards either end of said rotatable body and being mounted by press fitting said needle bearings into a recess machined on said shaft.", "4 . A mecanum wheel module according to claim 3 , wherein each of said needle bearings are retained in position via a retaining washer", "5 . A mecanum wheel module according to claim 4 , further comprising a thrust bearing between each of said retaining washers and said respective needle bearing.", "6 . A mecanum wheel module according to claim 1 , wherein said hub comprises side surfaces of said rim, said side surfaces being inner and outer side surfaces when said wheel is when mounted to a vehicle, said outer side surface comprising a radially outer part of said circular planar portion and said inner side surface comprising a ring extending from said cylindrical portion of said hub.", "said hub comprising a recess configured to receive said motor, one side of said recess being formed of said circular planar portion and the opposing side of said recess being open to receive said motor.", "8 . A mecanum wheel module according to claim 7 , said mecanum wheel module further comprising a mounting component for mounting said mecanum wheel module to a vehicle, said mounting component comprising an attachment portion for attaching to said vehicle and configured to extend over a portion of said rim of said mecanum wheel, and a plate portion facing said open side of said recess, said motor being mounted to said plate portion.", "9 . A mecanum wheel module according to claim 7 , said motor comprising a drive shaft, said drive shaft being attached to said circular planar portion of said hub such that rotation of said drive shaft by said motor rotates said hub, said motor being mounted such that an axis of rotation of said motor passes through a centre of said hub.", "10 . A mecanum wheel module according to claim 7 , wherein said motor comprises a high load motor, a drive shaft of said motor being mounted on two bearings arranged at different longitudinal positions along said shaft.", "11 . A mecanum wheel module according to claim 7 , wherein said portion of said hub that said attachment portion is configured to extend over comprises an entire width of said hub and at least a third of a circumference of said hub.", "12 . A mecanum wheel module according to claim 7 , wherein said motor is configured to generate a maximum torque of at least 26 Nm preferably of at least 30 Nm.", "13 . A mecanum wheel according to claim 7 , said mecanum wheel further comprises a braking mechanism mounted adjacent to said motor within said recess.", "14 . A mecanum wheel module according to claim 8 , wherein said mounting component comprises a guard channel for routing wires between said motor and a vehicle, an upper surface of said guard channel comprising said attachment portion, an outer surface of said guard channel comprising said plate portion and an inner surface of said guard channel being arranged to extend adjacent to said inner rim.", "15 . A mecanum wheel module according to claim 1 , wherein said shafts of said roller are steel and said rotatable body comprises an aluminium barrel with a truncated oval cross section coated with an outer polyurethane layer.", "16 . A mecanum wheel module according to claim 1 , wherein said hub is formed of machined aluminium.", "17 . A mecanum wheel module according to claim 1 , wherein said mecanum wheel has a power density of more than 19 kW/m 3 , preferably more than 22 kW/m 3 , more preferably more than 24 W/m 3 ."], "bibtex": "@patent{20240270013,\n    title = {A MECANUM WHEEL MODULE},\n    number = {20240270013},\n    year = {2024},\n    note = {File: US20240270013A1-20240815.XML}\n    }", "classification": "B60B1900FI"}, {"title": "MOVABLE OBJECT AND METHOD OF CONTROLLING THE SAME", "doc_number": "20240270014", "filename": "US20240270014A1-20240815.XML", "abstract": "Disclosed is a movable object which includes a wheel assembly including a main rotary part that rotates about a first rotational axis and a variable rotary part that moves relative to the main rotary part in a direction not aligned with the first rotational axis. The variable rotary part rotates at the same angular velocity as a main angular velocity when the main rotary part rotates, the main angular velocity being an angular velocity of the main rotary part.", "detailed_description": ["Hereinafter, some implementations of the present disclosure will be described in detail with reference to the exemplary drawings. In adding the reference numerals to the components of each drawing, it should be noted that the identical or equivalent component is designated by the identical numeral even when they are displayed on other drawings. Further, in describing the implementation of the present disclosure, a detailed description of well-known features or functions will be ruled out in order not to unnecessarily obscure the gist of the present disclosure.", "", "Hereinafter, a movable object1according to an implementation of the present disclosure will be described with reference to the accompanying drawings.", "", "Referring toFIG.1, the movable object1according to the present disclosure may travel on the ground. The movable object1may effectively pass through the ground having steps, such as stairs, by changing a posture depending on the state of the ground. In addition, the movable object1may implement a movement that mimics a person's walking motion. The movable object1may include a wheel assembly10, a frame20, and a controller30.", "", "Referring further toFIGS.2to10, the wheel assembly10may travel toward a target position together with the frame20in a state of being supported by the frame20. The wheel assembly10may be provided in plural numbers. The plurality of wheel assemblies10may be disposed on opposite sides of the frame20. For example, the plurality of wheel assemblies10may be disposed to face each other. Each of the wheel assemblies10may include a rotary part100, a spoke200, a power transmission part300, and a driving part400.", "", "Referring again toFIG.3, the rotary part100may be rotated relative to the frame20. In addition, the rotary part100may transmit power to the spoke200. The rotary part100may include a main rotary part110and a variable rotary part120.", "", "The main rotary part110may be rotated about a first rotational axis X1. The position of the first rotational axis X1 relative to the frame20may be fixed. The first rotational axis X1 may be defined as a virtual straight line passing through the center of the main rotary part100and extending in an axial direction. The axial direction may be defined as a direction perpendicular to a travel direction D and an up/down direction. The travel direction D may be defined as a direction in which the movable object1is moved relative to the ground. The main rotary part100may include a main rotary body111and a rotation support part112.", "", "Referring again toFIG.4, the main rotary body111may form the exterior of the main rotary part110. The main rotary body111may have an empty space formed therein. For example, the main rotary body111may have a ring shape in which a hole is formed at the center.", "", "The rotation support part112may be connected to an edge of the main rotary body111so as to be rotatable. For example, the rotation support part112may be rotated relative to the main rotary body111about a rotational axis passing through the edge of the main rotary body111and extending in the axial direction. The rotation support part112may support the spoke200. The rotation support part112may be connected to an outside of the main rotary body111. An outer direction may be defined as a direction in which the frame20faces toward the main rotary part110, and an inner direction may be defined as a direction opposite to the outer direction. The rotation support part112may have a guide hole112aformed therein.", "", "Referring again toFIG.4, the guide hole112amay be a through-hole formed in a central portion of the rotation support part112in a direction perpendicular to the axial direction. The spoke200may be inserted into the guide hole112a. The guide hole112amay guide a movement of the spoke200. For example, the guide hole112amay guide a translational motion of the spoke200relative to the rotation support part112. In other words, the spoke200may slide relative to the rotation support part112along the guide hole112a.", "", "Referring again toFIG.1, the rotation support part112may be provided in plural numbers. The plurality of rotation support parts112may be arranged to be spaced apart from each other in rotational directions C1 and C2. The rotational directions C1 and C2 may be defined as directions in which the main rotary part110is rotated about the first rotational axis X1. The rotational directions C1 and C2 may be understood as a concept including the forward rotational direction C1 and the reverse rotational direction C2. The forward rotational direction C1 may be defined as a direction in which the main rotary part110is rotated when the movable object1is moved in the travel direction D. The reverse rotational direction C2 may be defined as a direction opposite to the forward rotational direction.", "", "The plurality of rotation support parts112may include a first rotation support part and a second rotation support part. The first rotation support part and the second rotation support part may be defined as any two rotation support parts112adjacent to each other among the plurality of rotation support parts112.", "", "Referring again toFIGS.9and10, when the variable rotary part120is moved relative to the main rotary part110toward a side region, each of the first rotation support part and the second rotation support part may be rotated relative to the main rotary body111such that the angle formed by a first straight line and a second straight line is increased. The first straight line may be defined as a virtual straight line passing through the center of the first rotation support part and extending along a guide hole of the first rotation support part. Furthermore, the second straight line may be defined as a virtual straight line passing through the center of the second rotation support part and extending along a guide hole of the second rotation support part. In addition, the side region may be defined as a region of the edge of the main rotary body111formed between the first rotation support part and the second rotation support part. For example, the side region may be defined as a region disposed between the first rotation support part and the second rotation support part when the wheel assembly10is viewed in the axial direction.", "", "The variable rotary part120may be rotated about a second rotational axis X2. For example, the second rotational axis X2 may be defined as a virtual straight line passing through the center of the variable rotary part120and extending parallel to the axial direction. In other words, the second rotational axis X2 may be parallel to the first rotational axis X1. Furthermore, a variable angular velocity that is the angular velocity of the variable rotary part120may be equal to a main angular velocity that is the angular velocity of the main rotary part110. The relationship between the variable angular velocity and the main angular velocity will be described in more detail in the description of the power transmission part300to be described below.", "", "The variable rotary part120may be moved relative to the main rotary part110in a relative movement direction that is not aligned with the axial direction. For example, the relative movement direction may be a direction perpendicular to the axial direction. The variable rotary part120may be moved relative to the main rotary part110such that the second rotational axis X2 and the first rotational axis X1 overlap each other or are spaced apart from each other. The variable rotary part120may be moved relative to the main rotary part110on an allowable movement region crossing the first rotational axis X1.", "", "The allowable movement region may be defined as a region through which the center of the variable rotary part120passes when the variable rotary part120is moved relative to the main rotary part110. The allowable movement region may be surrounded by a virtual circle that is centered at the point where the allowable movement region and the first rotational axis X1 cross each other and that has a radius equal to the sum of a first driving distance and a second driving distance to be described below. The first driving distance may be defined as a separation distance between a fixed center of rotation X3 and a variable center of rotation X4 to be described below. Furthermore, the second driving distance may be defined as a separation distance between the second rotational axis X2 and the variable center of rotation X4. The sum of the first driving distance and the second driving distance may be smaller than a separation distance between the center of the main rotary body111and the rotation support part112. Since the sum of the first driving distance and the second driving distance is smaller than the separation distance between the center of the main rotary body111and the rotation support part112, interference between the variable rotary part120and the rotation support part112may be restricted.", "", "The variable rotary part120may be disposed outward of the main rotary part110. The variable rotary part120may cross a virtual plane that passes through the center of the rotation support part112and is perpendicular to the axial direction.", "", "Referring again toFIGS.2and3, the spoke200may provide a ground reaction force to the movable object1. The movable object1may travel on the ground through the ground reaction force transmitted from the spoke200. An outer end portion201of the spoke may be brought into contact with the ground. The outer end portion201of the spoke may have, for example, a ball shape. The outer end portion201of the spoke may be formed of a material (e.g., a rubber material) capable of restricting a slip on the ground. An inner end portion202of the spoke may be connected to an edge of the variable rotary part120so as to be rotatable.", "", "Referring again toFIG.10, the spoke200may perform a translational motion along the guide hole112awhen the variable rotary part120is moved relative to the main rotary part110. For example, when the variable rotary part120is moved toward the rotation support part112relative to the main rotary part110, the outer end portion201of the spoke may perform a translational motion to move away from the rotation support part112. In other words, when the variable rotary part120is moved toward the rotation support part112relative to the main rotary part110, the separation distance between the outer end portion201of the spoke and the rotation support part112may be increased.", "", "Furthermore, when the variable rotary part120is moved away from the rotation support part112relative to the main rotary part110, the outer end portion201of the spoke may perform a translational motion to move toward the rotation support part112. In other words, when the variable rotary part120is moved away from the rotation support part112relative to the main rotary part110, the separation distance between the outer end portion201of the spoke and the rotation support part112may be decreased.", "", "The spoke200may be provided in plural numbers. The plurality of spokes200may correspond to the plurality of rotation support parts112, respectively. For example, when n rotation support parts112(n>2) are provided, n spokes200may be provided so as to be inserted into the guide holes112aof the n rotation support parts112, respectively. The plurality of spokes200may be connected to the edge of the variable rotary part120so as to be rotatable. For example, the plurality of spokes200may be arranged to be spaced apart from each other in a circumferential direction of the variable rotary part120. The circumferential direction of the variable rotary part120may be defined as a direction in which the variable rotary part120is rotated about the second rotational axis X2.", "", "The plurality of spokes200may be placed in one of a first posture and a second posture. Referring again toFIG.9, the first posture may be defined as a posture of the plurality of spokes200in a state in which the first rotational axis X1 and the second rotational axis X2 overlap each other. Furthermore, referring again toFIG.10, the second posture may be defined as a posture of the plurality of spokes200in a state in which the first rotational axis X1 and the second rotational axis X2 are spaced apart from each other.", "", "Referring again toFIG.10, when each of the first rotation support part and the second rotation support part is rotated relative to the main rotary body111such that the angle formed by the first straight line and the second straight line is increased, an outer end portion of a first spoke and an outer end portion of a second spoke may move away from each other. The first spoke may be defined as a spoke200corresponding to the first rotation support part among the plurality of spokes200. The second spoke may be defined as a spoke200corresponding to the second rotation support part among the plurality of spokes200.", "", "Referring again toFIGS.5to8, the power transmission part300may receive power from the main rotary part110. The power transmission part300may transmit the power received from the main rotary part110to the variable rotary part120. For example, the main rotary part110, the variable rotary part120, and the power transmission part300may be coupled together in a Schmidt coupling manner. For example, when the main rotary part110is rotated at the main angular velocity, the power transmission part300may receive torque from the main rotary part110and may be rotated at the same angular velocity as the main angular velocity. When the power transmission part300is rotated, the variable rotary part120may receive torque from the power transmission part300and may be rotated at the same angular velocity as the rotational angular velocity of the power transmission part300. In other words, the main angular velocity, the rotational angular velocity of the power transmission part300, and the variable angular velocity may be the same. The power transmission part300may include an intermediate rotary part310and a link part320.", "", "Referring again toFIG.8, the intermediate rotary part310may receive power from the main rotary part110and may be rotated about an intermediate rotational axis passing through the center of the intermediate rotary part310and extending parallel to the axial direction. The intermediate rotary part310may include a first intermediate rotary part311, a second intermediate rotary part312, and an intermediate rotary body313.", "", "When the main rotary part110is rotated, the first intermediate rotary part311may be rotated by receiving power from a first link part321to be described below. The first intermediate rotary part311may transmit power to the intermediate rotary body313. The first intermediate rotary part311may be disposed inward of the main rotary part110.", "", "When the intermediate rotary body313is rotated, the second intermediate rotary part312may be rotated by receiving power from the intermediate rotary body313. The second intermediate rotary part312may transmit power to a second link part322to be described below. The second intermediate rotary part312may be disposed outward of the main rotary part110. For example, the main rotary part110may be disposed between the first intermediate rotary part311and the second intermediate rotary part312. Specifically, the first intermediate rotary part311, the main rotary part110, and the second intermediate rotary part312may be sequentially disposed in the outer direction.", "", "The intermediate rotary body313may extend in the axial direction between the first intermediate rotary part311and the second intermediate rotary part312. For example, an inner end portion of the intermediate rotary body313may be connected with the first intermediate rotary part311, and an outer end portion of the intermediate rotary body313may be connected with the second intermediate rotary part312. The intermediate rotary body313may be disposed in the empty space of the main rotary body111. For example, the intermediate rotary body313may be disposed to pass through the empty space of the main rotary body111.", "", "The link part320may include the first link part321and a second link part322. The first link part321may transmit the power of the main rotary part110to the first intermediate rotary part311. A first end portion of the first link part321may be connected to an inner surface of the main rotary body111so as to be rotatable. A second end portion of the first link part321may be connected to an outer surface of the first intermediate rotary part311so as to be rotatable. The first link part321may be provided in plural numbers.", "", "Separation distances between first end portions and second end portions of the plurality of first link parts321may be the same. The first end portions of the plurality of first link parts321may be symmetrically disposed with respect to the center of the main rotary body111. The second end portions of the plurality of first link parts321may be symmetrically disposed with respect to the center of the first intermediate rotary part311.", "", "The second link part322may transmit the power of the second intermediate rotary part312to the variable rotary part120. A first end portion of the second link part322may be connected to an inner surface of the variable rotary part120so as to be rotatable. A second end portion of the second link part322may be connected to an outer surface of the second intermediate rotary part312so as to be rotatable. The second link part322may be provided in plural numbers.", "", "Separation distances between first end portions and second end portions of the plurality of second link parts322may be the same. The first end portions of the plurality of second link parts322may be symmetrically disposed with respect to the center of the variable rotary part120. The second end portions of the plurality of second link parts322may be symmetrically disposed with respect to the center of the second intermediate rotary part312.", "", "Referring again toFIGS.6and8, the driving part400may provide power to the rotary part100. The driving part400may include a first driving part410and a second driving part420. The first driving part410may provide power to the main rotary part110. The first driving part410may include a main rotary motor411, a driving pulley412, a driven pulley413, and a driving belt414.", "", "The main rotary motor411may rotate the driving pulley412about a pulley rotation axis XP. The pulley rotation axis XP may be defined as a virtual straight line passing through the center of the driving pulley412and extending in the axial direction. The pulley rotation axis XP may be spaced apart from the allowable movement region. For example, the pulley rotation axis XP may be disposed above the allowable movement region. The main rotary motor411may be supported by the frame20such that the position of the main rotary motor411relative to the frame20is fixed.", "", "The driving pulley412may be rotated about the pulley rotation axis XP. The driving pulley412may provide power to the driving belt414. The driving pulley412may have, for example, a disk shape having an empty space formed therein.", "", "The driven pulley413may receive power from the driving belt414and may be rotated about the first rotational axis X1. The driven pulley413may be connected to the main rotary part110. For example, the driven pulley413may be connected to the inner surface of the main rotary body111. The driven pulley413may provide power to the main rotary body111. For example, the driven pulley413and the main rotary body111may be rotated together about the first rotational axis X1. The driven pulley413may have, for example, a disk shape having an empty space formed therein. For example, the driven pulley413may have a hollow disk shape having a larger radius than the driving pulley412.", "", "The driving belt414may receive power from the driving pulley412. The driving belt414may transmit the power received from the driving pulley412to the driven pulley413. The driving belt414may be disposed to surround the driving pulley412and the driven pulley413.", "", "The second driving part420may move the variable rotary part120relative to the main rotary part110. Furthermore, the first driving part410and the second driving part420may be driven independently of each other. The second driving part420may include a fixed driving part421and a variable driving part422.", "", "The fixed driving part421may be supported by the frame20such that the position of the fixed driving part421relative to the frame20is fixed. The fixed driving part421may be disposed inward of the rotary part100. The fixed driving part421may include a fixed motor421-1and a fixed driving arm421-2.", "", "The fixed motor421-1may provide power to the fixed driving arm421-2. The fixed motor421-1may provide a fixed center of rotation X3. The fixed center of rotation X3 may be defined as a virtual straight line passing through the fixed driving arm421-2and extending in the axial direction. The position of the fixed center of rotation X3 relative to the first rotational axis X1 may be fixed. For example, the fixed center of rotation X3 may overlap the first rotational axis X1. Furthermore, the fixed center of rotation X3 and the second rotational axis X2 may be in one of an overlapping state in which the fixed center of rotation X3 and the second rotational axis X2 overlap each other and a separation state in which the fixed center of rotation X3 and the second rotational axis X2 are spaced apart from each other.", "", "One end portion of the fixed driving arm421-2may be rotated about the fixed center of rotation X3. The one end portion of the fixed driving arm421-2may be connected to the variable driving part422. For example, the one end portion of the fixed driving arm421-2may be rotated about the fixed center of rotation X3 together with the variable driving part422. An opposite end portion of the fixed driving arm421-2may be connected to the fixed motor421-1. Furthermore, the fixed center of rotation X3 may cross the opposite end portion of the fixed driving arm421-2.", "", "The position of the variable driving part422relative to the frame20may be changed. The variable driving part422may be supported by the fixed driving arm421-2. The variable driving part422may be disposed outward of the fixed driving part421. For example, the variable driving part422may be connected to the outside of the one end portion of the fixed driving arm421-2. Furthermore, the fixed driving part421and the variable driving part422may be driven independently of each other. The variable driving part422may include a variable motor422-1and a variable driving arm422-2.", "", "The variable motor422-1may provide power to the variable driving arm422-2. The variable motor422-1may provide a variable center of rotation X4. The variable center of rotation X4 may be defined as a virtual straight line passing through the one end portion of the fixed driving arm421-2and extending in the axial direction. The variable center of rotation X4 may be spaced apart from the fixed center of rotation X3. Furthermore, the variable center of rotation X4 may cross the allowable movement region.", "", "One end portion of the variable driving arm422-2may be connected to the one end portion of the fixed driving arm421-2. Furthermore, an opposite end portion of the variable driving arm422-2may be connected to the variable rotary part120so as to be rotatable. For example, the opposite end portion of the variable driving arm422-2may not be rotated by rotation of the variable rotary part120. In other words, the variable rotary part120may be rotated relative to the opposite end portion of the variable driving arm422-2.", "", "The opposite end portion of the variable driving arm422-2may be rotated about the variable center of rotation X4. The opposite end portion of the variable driving arm422-2may cross the second rotational axis X2. The second rotational axis X2 may pass through the opposite end portion of the variable driving arm422-2and the center of the variable rotary part120. Furthermore, the second rotational axis X2 may be spaced apart from the variable center of rotation X4.", "", "The frame20may support the plurality of wheel assemblies10.", "", "Hereinafter, a process in which a rotational force is generated in the variable rotary part120will be described.", "", "When the main rotary motor411is driven, the driving pulley412may be rotated about the pulley rotation axis XP. When the driving pulley412is rotated, the driven pulley413may be rotated about the first rotational axis X1 through the driving belt414. When the driven pulley413is rotated, the main rotary body111may be rotated about the first rotational axis X1 together with the driven pulley413. When the main rotary body111is rotated, the first intermediate rotary part311may be rotated about the intermediate rotational axis through the first link part321. When the first intermediate rotary part311is rotated, the intermediate rotary body313and the second intermediate rotary part312may be rotated about the intermediate rotational axis. When the second intermediate rotary part312is rotated, the variable rotary part120may be rotated about the second rotational axis X2 through the second link part322.", "", "Hereinafter, a process in which power is generated in the variable rotary part120such that the variable rotary part120is moved relative to the main rotary part110will be described.", "", "When the fixed motor421-1is driven, the one end portion of the fixed driving arm421-2may be rotated about the fixed center of rotation X3. When the one end portion of the fixed driving arm421-2is rotated, the variable motor422-1may be rotated about the fixed center of rotation X3 together with the one end portion of the fixed driving arm421-2. When the variable motor422-1is rotated, the variable driving arm422-2may be rotated about the fixed center of rotation X3 together with the variable motor422-1. Meanwhile, when the variable motor422-1is driven, the opposite end portion of the variable driving arm422-2may be rotated about the variable center of rotation X4. In other words, the angle by which the opposite end portion of the variable driving arm422-2is rotated relative to the main rotary part110may be defined as the sum of the angle by which the variable motor422-1is rotated and the angle by which the opposite end portion of the variable driving arm422-2is rotated relative to the variable motor422-1. The variable rotary part120may be moved relative to the main rotary part110together with the opposite end portion of the variable driving arm422-2.", "", "The controller30may control the driving part400. The controller30may determine the main angular velocity by controlling the first driving part410. In addition, the controller30may determine the position of the variable rotary part120on the allowable movement region by controlling the second driving part420.", "", "An acceleration command may be input to the controller30such that the travel speed of the movable object1is increased. For example, when the acceleration command is input to the controller30, the controller30may control the driving part400to increase the spoke speed of a contact spoke. The contact spoke may mean a spoke brought into contact with the ground among the plurality of spokes200. The spoke speed may be defined as the speed of the outer end portion201of the spoke relative to the first rotational axis X1 when the movable object1travels at the travel speed.", "", "When the acceleration command is input to the controller30such that the travel speed of the movable object1reaches a speed lower than a critical travel speed, the controller30may control the first driving part410to increase the main angular velocity and may control the second driving part420to place the plurality of spokes200in the first posture. The critical travel speed may be defined as the travel speed of the movable object1when the plurality of spokes200are placed in the first posture and the main angular velocity is maximal.", "", "Furthermore, when the acceleration command is input to the controller30such that the travel speed of the movable object1reaches a speed higher than the critical travel speed, the controller30may control the first driving part410such that the main angular velocity is increased to a maximum and may perform angle control for controlling the second driving part such that the plurality of spokes200are switched from the first posture to the second posture.", "", "When the controller30performs the angle control, the second driving part420may move the variable rotary part to increase the angle formed by the contact spoke and an adjacent spoke. The adjacent spoke may be defined as a spoke200that is adjacent to the contact spoke and disposed in the reverse rotational direction C2 with respect to the contact spoke, among the plurality of spokes200. For example, when the controller30performs the angle control, the second driving part420may move the variable rotary part120toward an in-between region that is a region of the main rotary part110formed between the contact spoke and the adjacent spoke. The in-between region may be defined as a region of the edge area of the main rotary part110disposed between the contact spoke and the adjacent spoke.", "", "The controller30may be implemented with a process that is electrically connected with the driving part400and has a function of decoding and executing a command based on previously input information.", "", "Meanwhile, according to another implementation of the present disclosure, when the acceleration command is input to the controller30such that the travel speed of the movable object1reaches a target travel speed, the controller30may determine a plurality of target spoke speeds. The plurality of target spoke speeds may be defined as the speeds of the outer end portions201of the plurality of spokes.", "", "The controller30may calculate the main angular velocity, a first rotational angular velocity, and a second rotational angular velocity, based on the plurality of determined target spoke speeds. The first rotational angular velocity may be defined as the rotational angular velocity of the one end portion of the fixed driving arm421-2when the one end portion of the fixed driving arm421-2is rotated about the fixed center of rotation X3. The second rotational angular velocity may be defined as the rotational angular velocity of the opposite end portion of the variable driving arm422-2when the opposite end portion of the variable driving arm422-2is rotated about the variable center of rotation X4.", "", "Hereinafter, a method S10aof controlling the movable object according to an implementation of the present disclosure will be described with reference toFIG.11.", "", "The method S10aof controlling the movable object may include a movable-object travel step S100a, an input step S200a, and a speed control step S300a.", "", "In the movable-object travel step S100a, the movable object1may travel on the ground at the travel speed.", "", "In the input step S200a, an acceleration command may be input to the controller30such that the travel speed of the movable object1is increased. For example, in the input step S200a, the acceleration command may be input to the controller30such that the travel speed of the movable object1is higher or lower than the critical travel speed.", "", "In the speed control step S300a, the spoke speed of a spoke brought into contact with the ground among the plurality of spokes200may be increased when the acceleration command is input to the controller30in the input step S200a. The speed control step S300amay include an angle control step S310aand a rotation control step S320a.", "", "In the angle control step S310a, the postures of the plurality of spokes200may be controlled. The angle control step S310amay be performed when the acceleration command is input to the controller30such that the travel speed of the movable object1reaches a speed higher than the critical travel speed. In the angle control step S310a, the angle formed by the contact spoke and the adjacent spoke may be increased. When the angle control step S310ais performed, the wheel assembly10may obtain the same effect as increasing a person's step as the angle formed by the contact spoke and the adjacent spoke is increased. In addition, when the angle control step S310ais performed, the plurality of spokes200may be switched from the first posture to the second posture.", "", "In the rotation control step S320a, the main angular velocity may be controlled. For example, when the acceleration command is input to the controller30such that the travel speed of the movable object1reaches a speed lower than the critical travel speed, the main angular velocity may be increased in the rotation control step S320asuch that the main angular velocity reaches an angular velocity lower than the maximum main angular velocity. Furthermore, when the acceleration command is input to the controller30such that the travel speed of the movable object1reaches a speed higher than the critical travel speed, the main angular velocity may be increased to a maximum in the rotation control step S320a.", "", "Hereinafter, a method S10bof controlling the movable object according to another implementation of the present disclosure will be described with reference toFIG.12.", "", "The method S10bof controlling the movable object may include a movable-object travel step S100b, an input step S200b, a spoke speed determination step S300b, a calculation step S400b, and a speed control step S500b. The description of the movable-object travel step S100aaccording to the implementation of the present disclosure is applied to the movable-object travel step S100b.", "", "In the input step S200b, an acceleration command (hereinafter, referred to as the target acceleration command) may be input to the controller30such that the travel speed of the movable object1reaches the target travel speed.", "", "In the spoke speed determination step S300b, a plurality of target spoke speeds that are spoke speeds of the outer end portions201of the plurality of spokes may be determined when the target acceleration command is input to the controller30.", "", "In the calculation step S400b, the main angular velocity, the first rotational angular velocity, and the second rotational angular velocity may be calculated based on the plurality of determined target spoke speeds.", "", "In the speed control step S500b, based on the main angular velocity, the first rotational angular velocity, and the second rotational angular velocity, the main rotary part110may be rotated, and the variable rotary part120may be moved relative to the main rotary part110. The speed control step S500bmay include a main rotary part control step S510band a variable rotary part control step S520b.", "", "In the main rotary part control step S510b, the main rotary part110may be rotated at the calculated main angular velocity.", "", "In the variable rotary part control step S520b, the variable rotary part120may be moved relative to the main rotary part110, based on the first rotational angular velocity and the second rotational angular velocity. The variable rotary part control step S520band the main rotary part control step S510bmay be performed at the same time or at different times. The variable rotary part control step S520bmay include a first rotation step S521band a second rotation step S522b.", "", "In the first rotation step S521b, the one end portion of the fixed driving arm421-2may be rotated about the fixed center of rotation X3 at the first rotational angular velocity. Furthermore, in the second rotation step S522b, the opposite end portion of the variable driving arm422-2may be rotated about the variable center of rotation X4 at the second rotational angular velocity. The first rotation step S521band the second rotation step S522bmay be performed at the same time or at different times.", "", "According to the present disclosure, the movable object has the structure in which the angular velocity of the main rotary part and the angular velocity of the variable rotary part are equal to each other without a separate control process. Thus, a control process required for driving is simplified.", "", "Hereinabove, even though all of the components are coupled into one body or operate in a combined state in the description of the above-mentioned implementations of the present disclosure, the present disclosure is not limited to these implementations. That is, all of the components may operate in one or more selective combination within the range of the purpose of the present disclosure.", "", "Hereinabove, although the present disclosure has been described with reference to exemplary implementations and the accompanying drawings, the present disclosure is not limited thereto, but may be variously modified and altered by those skilled in the art to which the present disclosure pertains without departing from the spirit and scope of the present disclosure claimed in the following claims."], "claims": ["a main rotary part configured to rotate about a first rotational axis; and a variable rotary part configured to move relative to the main rotary part in a direction intersecting with the first rotational axis, and wherein the variable rotary part is configured to, based on the main rotary part rotating, rotate at a main angular velocity, the main angular velocity being an angular velocity of the main rotary part.", "a plurality of spokes, each of the plurality of spokes including an outer end portion configured to move with respect to the first rotational axis based on (i) the main rotary part rotating and (ii) the variable rotary part moving relative to the main rotary part; and a driving part including: a first driving part configured to rotate the main rotary part, and a second driving part configured to move the variable rotary part relative to the main rotary part, wherein the movable object further comprises a controller configured to control the driving part, and wherein the controller is configured to control the first driving part and the second driving part to thereby increase a spoke speed of a spoke that contacts a ground among the plurality of spokes based on an acceleration command being input to the controller to increase a travel speed of the movable object.", "wherein the plurality of spokes are configured to be in a first posture in which the variable rotary part rotates about the first rotational axis, and wherein the controller is configured to, based on the acceleration command being input to the controller to enable the travel speed of the movable object to reach a speed lower than a critical travel speed, control (i) the first driving part to increase the main angular velocity and (ii) the second driving part to place the plurality of spokes in the first posture, the critical travel speed being a travel speed of the movable object based on the plurality of spokes being placed in the first posture and the main angular velocity being maximal.", "wherein the controller is configured to, based on the acceleration command being input to the controller to enable the travel speed of the movable object to reach a speed higher than the critical travel speed, (i) control the first driving part to increase the main angular velocity to a maximum and (ii) perform angle control to control the second driving part to switch the plurality of spokes from the first posture to the second posture.", "wherein the second driving part is configured to, based on the angle control being performed, move the variable rotary part to increase an angle defined by (i) a contact spoke, among the plurality of spokes, that has an outer end portion that contacts the ground and (ii) an adjacent spoke, among the plurality of spokes, that is adjacent to the contact spoke and disposed in a reverse rotational direction opposite to the forward rotational direction with respect to the contact spoke, the forward rotational direction being a direction in which the variable rotary part rotates based on the movable object traveling.", "6 . The movable object of claim 5 , wherein the second driving part is configured to, based on the angle control being performed, move the variable rotary part toward an in-between region of the main rotary part defined between the contact spoke and the adjacent spoke based on the movable object being viewed along the first rotational axis.", "a fixed driving part including a fixed driving arm having one end portion configured to rotate about a fixed center of rotation at a first rotational angular velocity; and a variable driving part including a variable driving arm having one end portion connected to the fixed driving arm and an opposite end portion connected to the variable rotary part, the variable driving arm being configured to rotate about a variable center of rotation at a second rotational angular velocity, wherein the variable center of rotation passes through the fixed driving arm and is spaced apart from the fixed center of rotation, and wherein the controller is configured to, based on the acceleration command being input to the controller to enable the travel speed of the movable object to reach a target travel speed, (i) determine a plurality of target spoke speeds corresponding to spoke speeds of the outer end portions of the plurality of spokes, (ii) calculate the main angular velocity, the first rotational angular velocity, and the second rotational angular velocity based on the plurality of determined target spoke speeds, and (iii) control the driving part based on the calculated main angular velocity, the calculated first rotational angular velocity, and the calculated second rotational angular velocity.", "wherein the movable object includes: a main rotary part configured to rotate about a first rotational axis, a variable rotary part configured to move relative to the main rotary part and rotate at a main angular velocity, the main angular velocity being an angular velocity of the main rotary part, and a plurality of spokes, each of the plurality of spokes including an outer end portion configured to move with respect to the first rotational axis based on the main rotary part rotating and the variable rotary part moving relative to the main rotary part, the method comprising: controlling the movable object to travel at a travel speed; inputting an acceleration command to a controller to increase the travel speed of the movable object; and based on the acceleration command being input to the controller, increasing a spoke speed of a spoke that contacts a ground among the plurality of spokes.", "wherein the plurality of spokes are configured to be in a first posture in which the variable rotary part rotates about the first rotational axis, wherein increasing the spoke speed includes: controlling the main angular velocity, and controlling postures of the plurality of spokes, wherein, based on the acceleration command being input to the controller to enable the travel speed of the movable object to reach a speed lower than a critical travel speed: the main angular velocity is configured to increase based on the main angular velocity being controlled, and the plurality of spokes are configured to be placed in the first posture based on the postures of the plurality of spokes being controlled, and wherein the critical travel speed is a travel speed of the movable object based on the plurality of spokes being placed in the first posture and the main angular velocity being maximal.", "wherein based on the acceleration command being input to the controller to enable the travel speed of the movable object to reach a speed higher than the critical travel speed: the main angular velocity is configured to increase to a maximum based on the main angular velocity being controlled, and the variable rotary part is configured to move relative to the main rotary part based on the postures of the plurality of spokes being controlled such that the plurality of spokes are switched from the first posture to the second posture.", "wherein the inner end portions of the plurality of spokes are connected to the edge of the variable rotary part in a forward rotational direction, and wherein, based on the acceleration command being input to the controller to enable the travel speed of the movable object to reach a speed higher than the critical travel speed: an angle is increased based on the postures of the plurality of spokes being controlled, the angle being defined by (i) a contact spoke, among the plurality of spokes, that has one end portion contacting the ground and (ii) an adjacent spoke, among the plurality of spokes, that is adjacent to the contact spoke and disposed in a reverse rotational direction opposite to the forward rotational direction.", "moving the variable rotary part relative to the main rotary part, wherein moving the variable rotary part includes: rotating one end portion of a fixed driving arm about a fixed center of rotation at a first rotational angular velocity, and rotating a variable driving arm about a variable center of rotation at a second rotational angular velocity, the variable driving arm having one end portion connected to the fixed driving arm and an opposite end portion connected to the variable rotary part, the variable center of rotation being spaced apart from the fixed center of rotation and configured to pass through the fixed driving arm, wherein the method further comprises: determining a plurality of target spoke speeds being spoke speeds of the outer end portions of the plurality of spokes, based on the acceleration command being input to the controller to enable the travel speed of the movable object to reach a target travel speed, and calculating the main angular velocity, the first rotational angular velocity, and the second rotational angular velocity, based on the plurality of target spoke speeds being determined, and wherein, based on a spoke speed of a spoke being increased: the main rotary part is configured to rotate based on the main angular velocity, the first rotational angular velocity, and the second rotational angular velocity being calculated, and the variable rotary part is configured to move relative to the main rotary part.", "a main rotary part configured to rotate about a first rotational axis; and a variable rotary part configured to move relative to the main rotary part in a direction intersecting with the first rotational axis, and wherein the variable rotary part is configured to, based on the main rotary part rotating, rotate at a main angular velocity, the main angular velocity being an angular velocity of the main rotary part.", "a plurality of spokes, each of the plurality of spokes including an outer end portion configured to move with respect to the first rotational axis based on (i) the main rotary part rotating and (ii) the variable rotary part moving relative to the main rotary part; and a driving part including: a first driving part configured to rotate the main rotary part, and a second driving part configured to move the variable rotary part relative to the main rotary part, wherein the movable object further comprises a controller configured to control the driving part, and wherein the controller is configured to control the first driving part and the second driving part to thereby increase a spoke speed of a spoke that contacts a ground among the plurality of spokes based on an acceleration command being input to the controller to increase a travel speed of the movable object.", "wherein the plurality of spokes are configured to be in a first posture in which the variable rotary part rotates about the first rotational axis, and wherein the controller is configured to, based on the acceleration command being input to the controller to enable the travel speed of the movable object to reach a speed lower than a critical travel speed, control (i) the first driving part to increase the main angular velocity and (ii) the second driving part to place the plurality of spokes in the first posture, the critical travel speed being a travel speed of the movable object based on the plurality of spokes being placed in the first posture and the main angular velocity being maximal.", "wherein the controller is configured to, based on the acceleration command being input to the controller to enable the travel speed of the movable object to reach a speed higher than the critical travel speed, (i) control the first driving part to increase the main angular velocity to a maximum and (ii) perform angle control to control the second driving part to switch the plurality of spokes from the first posture to the second posture.", "wherein the second driving part is configured to, based on the angle control being performed, move the variable rotary part to increase an angle defined by (i) a contact spoke, among the plurality of spokes, that has an outer end portion that contacts the ground and (ii) an adjacent spoke, among the plurality of spokes, that is adjacent to the contact spoke and disposed in a reverse rotational direction opposite to the forward rotational direction with respect to the contact spoke, the forward rotational direction being a direction in which the variable rotary part rotates based on the movable object traveling.", "18 . The wheel assembly of claim 17 , wherein the second driving part is configured to, based on the angle control being performed, move the variable rotary part toward an in-between region of the main rotary part defined between the contact spoke and the adjacent spoke based on the movable object being viewed along the first rotational axis.", "a fixed driving part including a fixed driving arm having one end portion configured to rotate about a fixed center of rotation at a first rotational angular velocity; and a variable driving part including a variable driving arm having one end portion connected to the fixed driving arm and an opposite end portion connected to the variable rotary part, the variable driving arm being configured to rotate about a variable center of rotation at a second rotational angular velocity, wherein the variable center of rotation passes through the fixed driving arm and is spaced apart from the fixed center of rotation.", "wherein the controller is configured to, based on the acceleration command being input to the controller to enable the travel speed of the movable object to reach a target travel speed, (i) determine a plurality of target spoke speeds corresponding to spoke speeds of the outer end portions of the plurality of spokes, (ii) calculate the main angular velocity, the first rotational angular velocity, and the second rotational angular velocity based on the plurality of determined target spoke speeds, and (iii) control the driving part based on the calculated main angular velocity, the calculated first rotational angular velocity, and the calculated second rotational angular velocity."], "bibtex": "@patent{20240270014,\n    title = {MOVABLE OBJECT AND METHOD OF CONTROLLING THE SAME},\n    number = {20240270014},\n    year = {2024},\n    note = {File: US20240270014A1-20240815.XML}\n    }", "classification": "B60B1904FI"}, {"title": "ELECTRIC POWER CONTROL SYSTEM", "doc_number": "20240270015", "filename": "US20240270015A1-20240815.XML", "abstract": "Space-saving in an automobile or the like provided with a battery is achieved. Design flexibility of an automobile or the like can be improved. An electric power control method or an electric power control system capable of utilizing electric power efficiently is provided. It is an electric power control system of an automobile including a car body, a first battery, a second battery, and a control unit. The control unit obtains states of charge of the first battery and the second battery, determines whether or not a difference between remaining capacities of the first battery and the second battery exceeds a predetermined value, and controls transmission of electric power between the first battery and the second battery, in the case where the difference in the remaining capacities exceeds the predetermined value, to be made such that the remaining capacities are close to each other.", "detailed_description": [""], "claims": ["a wheel comprising a rim portion, a disk portion, a first electric power transmission mechanism, and a battery; an electric power control unit; and a second electric power transmission mechanism electrically connected to the first electric power transmission mechanism, wherein the battery includes an electrolyte solution which comprises an organic solvent, wherein the first electric power transmission mechanism is provided in the disk portion, wherein the first electric power transmission mechanism is electrically connected to the battery, wherein the second electric power transmission mechanism is electrically connected to the first electric power transmission mechanism in a state of the wheel rotating, and wherein the electric power control unit is configured to control charge and discharge of the battery using the first electric power transmission mechanism and the second electric power transmission mechanism.", "a wheel comprising a rim portion, a disk portion, a first electric power transmission mechanism, and a battery; an electric power control unit; and a second electric power transmission mechanism electrically connected to the first electric power transmission mechanism, wherein the battery includes an electrolyte solution which comprises an organic solvent, wherein the first electric power transmission mechanism is provided in the disk portion, wherein the first electric power transmission mechanism is electrically connected to the battery, wherein the first electric power transmission mechanism is configured to wirelessly transmit and receive electric power, wherein the second electric power transmission mechanism is configured to wirelessly transmit and receive electric power, and wherein the electric power control unit is configured to control charge and discharge of the battery using the first electric power transmission mechanism and the second electric power transmission mechanism."], "bibtex": "@patent{20240270015,\n    title = {ELECTRIC POWER CONTROL SYSTEM},\n    number = {20240270015},\n    year = {2024},\n    note = {File: US20240270015A1-20240815.XML}\n    }", "classification": "B60B2112FI"}, {"title": "TWO PIECE WHEEL", "doc_number": "20240270016", "filename": "US20240270016A1-20240815.XML", "abstract": "A two-piece wheel may have a first section and a second section. The wheel has areas of varying diameter across its width, and the first second and the second section are joined at the area of the wheel with the smallest diameter. The first section can be a spoke section with spokes extending from the central hub and the second section can be a barrel section.", "detailed_description": ["As shown inFIGS.1-6, the present application provides an improved, two (2) piece wheel which may be used on various automobiles, including but not limited to passenger cars and trucks. The wheel10disclosed herein offers many advantageous features not found in prior art wheels such as a lighter weight and stronger construction.", "", "FIG.1shows a front view of the wheel10fully assembled. The wheel comprises a spoke section20(which is furthest away from the automobile on which the wheel10is installed) and a barrel section30(which is closer to the automobile on which the wheel is installed).FIG.2shows a rear view of the wheel fully assembled whileFIG.3shows a top sectional view of the fully assembled wheel10.", "", "The spoke section20includes one or more spokes40that both serve to add strength to the wheel10and also provide a pleasing decorative appearance. As such, one of ordinary skill in the art can appreciate that although one design is shown in the figures included herewith, many different spoke designs and arrangements are possible based on consumer preference and the scope of the present invention should not be limited by the design shown in the figures. Additionally, the shape, design, number and length of the spokes40can be varied to increase the strength of the wheel10. The spoke section20and spokes40may also include one or more fiber composite strips25. The fiber composite strips25can be either co-molded between fiber layers as the spoke section20/spokes40are molded or they may be bonded to the spoke section20/spokes40after those features are molded. The fiber composite strips25, as shown inFIG.3, may be placed along the exterior surface of one or more spokes40or alternatively, they may be located where the spokes meet the hub or center of the spoke section, along the lip or outer edge of the spoke section or where the spokes40meet the barrel.", "", "The spoke section20also includes a plurality of apertures near its center, including one or more wheel stud apertures50and a hub aperture70. The wheel stud apertures50are configured to receive the threaded wheel studs (or sometimes called wheel bolts) present on the hub of the vehicle on which the wheel10will be installed. Accordingly, as shown in the attached figures, there may be five (5) wheel stud apertures (which is the common number on most passenger cars) but there could be more or less wheel stud apertures if needed for installation on a particular vehicle or vehicle type. For example, there could be as few as four (4) wheel stud apertures or as many as twelve (12). As shown in the attached figures, there may be a recess on the exterior of the spoke section20in which the lug nuts fit during installation, though this is not required. Alternatively, there may only be a single aperture on the wheel wherein the hub passes through the aperture and a nut is threaded onto the hub to secure to the wheel.", "", "Optionally, the spoke section20may include one or more inserts55that can be generally complimentary to the shape and size of the wheel stud apertures50. These inserts55may be molded integrally near the region of the spoke section20proximate to the wheel stud apertures50. These inserts55can be of various shapes and composition. For example, the insert55may complement the shape and size of the wheel stud aperture50and form a concentric circle therewith, as shown inFIG.2and be placed around one or more of the wheel stud apertures50. Alternatively, the insert55could be rectangular and placed proximate to the wheel stud aperture, but not of a circular shape. The insert55may be metal or other suitable materials to help distribute the forces imparted on the wheel10when the lug nuts are tightened onto the wheel studs. After the wheel studs are passed through the wheel stud apertures50, generally one or more lug nuts or other securement device will be screwed onto the threaded wheel studs to attach the wheel10securely to the vehicle. The hub aperture70is provided such that the hub of a vehicle may pass through the spoke section20. As one of ordinary skill in the art can appreciate, the dimensions of the hub aperture70will often vary due to the make and model of vehicle on which the wheel10is to be installed—i.e., a wheel designed to be installed on a Ford® may have a different dimensioned hub aperture70than a wheel designed to fit on a Subaru®.", "", "The spoke section20also includes a valve stem aperture60which receives a valve stem which is used to add air (or other suitable gasses such as nitrogen) to the tire seated on the wheel10.", "", "The spoke section20also includes a bead hump100on its interior facing surface that secures the bead of the tire to the wheel10.", "", "The spoke section20also has a mating surface80which is in contact with the barrel surface's mating surface110when the wheel10is assembled (as discussed in more detail below).", "", "The barrel section30is the portion of the wheel10closest to the automobile. The barrel section30, like the spoke section20, includes a bead hump100on its exterior facing surface that secures the bead of the tire to the wheel10. In one embodiment, as shown inFIG.5for example, the barrel section30reduces in diameter across its width, or put another way, the inner most portion of the barrel section30may have a larger diameter than the outermost portion.", "", "Further, the barrel section30has a mating surface110that may be complementary to the spoke section's mating surface80. As can be appreciated from the attached drawings, different areas of the wheel10have different diameters. For example, the area of the wheel with the bead hump100has a different diameter than the central area of the wheel10. In one embodiment the mating surface110is generally located at the drop center (also known as the tire well) of the wheel10, or the area of the wheel where it is the narrowest, and thus the opposing mating surface80of the spoke section20where the sections are joined is also located at the drop center, and the drop center of a wheel10makes mounting a tire easier in that it allows the tire's bead wires to retain their natural shape/length/diameter during the mounting process. The bead hump100may be molded or formed integrally with the spoke section20and barrel section30, as shown inFIG.5or it may be manufactured separately and affixed or attached to the spoke section20and barrel section as shown inFIG.6.", "", "The mating surface110of the barrel section30includes one or more spacers120which serve to provide a gap between the spoke sections20mating surface80and the barrel section's mating surface110after the wheel is assembled. This gap allows space for the adhesive used to join the spoke section20and the barrel section30to be applied evenly and to properly harden and attach the two sections thus creating a strong, reliable wheel10. In one embodiment, the adhesive can be selected from the group consisting of urethane and epoxy based adhesives. In one embodiment, the spacers120have a height of between 5 and 60 one-thousandth's of an inch. Alternatively, the mating surface80of the spoke section may comprise the one or more spacers rather than the barrel section30.", "", "The mating surface110of the barrel section30may have a lip or stop130that the leading edge of the spoke section's mating surface80rests against once the two sections are fitted properly during assembly. This lip or stop130serves to provide that adequate overlap is created by the two opposing mating surfaces80,110to provide for a secure assembly. The amount of overlap may vary depending upon the desired use of the wheel. In some embodiments, the amount of overlap is between 0.10 and 6.00 inches, 0.50 and 5.00 inches, 1.00 and 4.0 inches and 1.50 and 3.0 inches. In one preferred embodiment, the amount of overlap is between 1.50 and 2.00 inches.", "", "In addition to the lap joint shown in the attached figures, the overlap region could feature a tongue-and-groove construction or threads to assist in securing the spoke section20to the barrel section30. Optionally, in addition to the adhesive used to secure the spoke section20to the barrel section30, mechanical securement devices such as rivets, bolts or a tape may be used.", "", "FIGS.4and5show perspective views of the spoke section20and the barrel section30respectively.FIG.6shows a side view/cut away view of the overlap of the opposing mating surfaces80,110.", "", "The wheel10may be made of many different materials, including composite materials such as carbon fiber. The term “carbon fiber” as used herein includes all fibers which consist essentially of carbon, ranging from graphite fibers to amorphous carbon fibers. Graphite fibers are fibers which consist essentially of carbon and have a predominant X-ray diffraction pattern characteristic of graphite. Amorphous carbon fibers are fibers which consist essentially of carbon and have an essentially amorphous X-ray diffraction pattern. Additionally, the term also includes other high strength, low density materials such as boron, fiber glass or the like or any of the forgoing in a mixture, such as 1-99% carbon fiber mixed with 99-1% fiber glass. For example, the wheel10may comprise one or more of the following composite materials a carbon fiber/fiber mixture, carbon fiber or fiber glass. Additionally, additives such as nanoparticles may be added to the composite materials before molding. Additionally, the wheel10disclosed herein may not be manufactured from a composite material but rather a metallic material such as aluminum, steel or other alloy. In an embodiment where the wheel10is manufactured from a metallic material, the components of the wheel may be forged, cast or machined.", "", "In addition to the composite materials and optionally the nanoparticles, a resin is used to bind the composite materials during molding. In one embodiment, the resin is selected from the group consisting of epoxies, polyurethane, rubber and polyester resins. In a further embodiment the resin is a vinyl ester/polyurethane resin or any other thermoset or thermoplastic polymeric resin or a metallic matrix. In other alternate embodiments, the resin may be selected from the group consisting of butadiene rubber, ethylene-propylene-diene rubber, melamine formaldehyde, natural rubber, phenol-formaldehyde, polyamide, polycarbonate, polypropylene and polytetrafluoroethylene.", "", "The wheel10may be constructed using various methods of manufacture including compression molding. In one embodiment, the wheel10is constructed using a sheet molding compound (SMC) process or a bulk molding compound (BMC) process.", "", "Although particular embodiments of the present disclosure have been described, it is not intended that such references be construed as limitations upon the scope of this disclosure except as set forth in the claims."], "claims": ["1 . A two-piece molded wheel comprising a spoke section and a barrel section, wherein the spoke section and the barrel section have complementary mating surfaces joined at a drop center of the wheel, wherein a thickness of the mating surface of the barrel section is less than a thickness of the a portion of the barrel section adjacent to the mating surface.", "2 . The wheel of claim 1 , wherein the barrel section includes a lip in contact with a distal surface of a leading edge of mating surface of the spoke section, lip is positioned on an interior side of the mating surface of the barrel section.", "3 . The wheel of claim 1 , wherein either the spoke section or the barrel section's mating surface comprises a plurality of spacers extending therefrom.", "4 . The wheel of claim 3 , wherein the spacers have a height of between 5 and 60 one-thousandth's of an inch.", "5 . The wheel of claim 3 , wherein the barrel section comprises a plurality of spacers extending therefrom.", "6 . The wheel of claim 5 , wherein the spacers have a height of between 5 and 60 one-thousandth's of an inch.", "7 . The wheel of claim 5 , wherein the spoke section and the barrel section are joined via a lap joint.", "8 . The wheel of claim 1 , wherein the spoke section and barrel section are joined via a lap joint.", "9 . The wheel of claim 1 , wherein the wheel comprises a composite material.", "10 . The wheel of claim 1 , wherein the wheel comprises a composite material.", "11 . A two-piece wheel comprising a first section and a second section, wherein the wheel comprises areas of varying diameter across its width and the first section and second section are joined at complementary surfaces of the first section and the second section, wherein a radial thickness of the mating surface of the first section is tapered towards distal surface of a leading edge of the mating surface of the first section.", "12 . The wheel of claim 11 , wherein a radial thickness of the mating surface of the second section is less than a radial thickness of a portion of the second section adjacent to the mating surface.", "13 . The wheel of claim 12 , wherein the second section comprises a plurality of spacers extending therefrom.", "14 . The wheel of claim 13 , wherein the spacers have a height of between 5 and 60 one-thousandth's of an inch.", "15 . The wheel of claim 14 , wherein the first section and the second section are joined via a lap joint.", "16 . The wheel of claim 11 , wherein the first section and the second section are joined via a lap joint.", "17 . The wheel of claim 11 , wherein the wheel comprises a composite material.", "18 . The wheel of claim 12 , wherein the second section includes a lip in contact with the distal surface of the leading edge of the mating surface of the first section, and wherein the lip is positioned on an interior side of the mating surface of the second section.", "19 . The wheel of claim 18 , further comprising one or more wheel stud apertures and wherein one or more inserts are proximate to the one or more wheel stud apertures.", "20 . The wheel of claim 11 , comprising an integral bead hump defined on one or more of the first section or the second section."], "bibtex": "@patent{20240270016,\n    title = {TWO PIECE WHEEL},\n    number = {20240270016},\n    year = {2024},\n    note = {File: US20240270016A1-20240815.XML}\n    }", "classification": "B60B2500FI"}, {"title": "WHEEL BEARING DEVICE", "doc_number": "20240270017", "filename": "US20240270017A1-20240815.XML", "abstract": "A wheel bearing device for which the work of grinding a wheel hub is simplified. The wheel hub ( 3 ) has an inside track groove ( 3 c ), a seal land part ( 3 d ), a recess ( 3 m ), and a flange surface ( 3 k ). An outer-side sealing member ( 10 ) is provided with a core metal ( 11 ) and a sealing member ( 12 ). The sealing member includes a contact lip ( 12 d ) and a labyrinth lip ( 12 e ) facing the recess across a gap. The recess has a bottom ( 313 ) located between an outer diameter-side edge ( 311 ) and an inner diameter-side edge ( 312 ), and a tapered surface ( 314 ) that extends in the radial direction from the outer diameter-side edge toward the bottom and tilts toward one end of the axial direction going from the outer diameter-side edge toward the bottom.", "detailed_description": [""], "claims": ["1 - 7 . (canceled)", "an outer member having a double row outer raceway grooves on an inner periphery; an inner member including a hub ring having a hub flange extending radially outward at an axial one end portion and having a small diameter step portion extending axially on an outer periphery, and at least one inner ring press-fitted into the small diameter step portion of the hub ring, the inner member having a double row inner raceway grooves facing the double row outer raceway grooves; a double row rolling elements rollably accommodated between both raceway grooves of the outer member and the inner member; and a sealing device closing an opening end on an axial one end side of an annular space formed by the outer member and the inner member, wherein the hub ring includes the inner raceway groove, a seal land portion positioned at a base end portion of the hub flange and the seal land portion with which the sealing device is in sliding contact, a recess portion positioned on an outer diameter side of the seal land portion in the hub flange, and a flange face positioned on an outer diameter side of the recess portion in the hub flange, the sealing device includes a core metal fitted to an axial one end portion of the outer member, and a seal member integrally joined to the core metal, the seal member includes a contact lip extending from the core metal toward the hub flange side and coming into contact with the seal land portion, and a labyrinth lip extending from the core metal toward the hub flange side on an outer diameter side relative to the contact lip and axially faces the recess portion across a gap, and the recess portion includes a bottom portion positioned between an outer diameter side edge portion and an inner diameter side edge portion of the recess portion, the bottom portion where a depth of the recess portion is largest, and a tapered face radially extending from the outer diameter side edge portion toward the bottom portion side and inclined toward an axial one end side from the outer diameter side edge portion toward the bottom portion.", "9 . The bearing device for vehicle wheel according to claim 8 , wherein the flange face and the recess portion include a turning face.", "10 . The bearing device for vehicle wheel according to claim 8 , wherein an inclination angle to an axial one end side with respect to a radial direction of the tapered face is equal to or less than 26.5°.", "11 . The bearing device for vehicle wheel according to claim 9 , wherein an inclination angle to an axial one end side with respect to a radial direction of the tapered face is equal to or less than 26.5°.", "the inner raceway groove and the seal land portion include a ground face, and the inner diameter side edge portion of the recess portion in the hub flange protrudes on the sealing device side relative to the outer diameter side edge portion in an axial direction.", "the hub ring includes a heat treatment portion quenched within a range in which at least the inner raceway groove, the seal land portion, and the recess portion are formed, and an outer peripheral edge on an outer diameter side in the heat treatment portion is positioned on an outer diameter side relative to the bottom portion of the recess portion.", "14 . The bearing device for vehicle wheel according to claim 8 , wherein the inner diameter side edge portion of the recess portion of the hub flange is positioned on an outer diameter side relative to a contact portion with respect to the hub flange of the contact lip of the seal member.", "15 . The bearing device for vehicle wheel according to claim 8 , wherein the seal member includes one or two or more of the contact lips."], "bibtex": "@patent{20240270017,\n    title = {WHEEL BEARING DEVICE},\n    number = {20240270017},\n    year = {2024},\n    note = {File: US20240270017A1-20240815.XML}\n    }", "classification": "B60B2700FI"}, {"title": "SYSTEMS AND METHODS FOR WHEEL DISCONNECT", "doc_number": "20240270018", "filename": "US20240270018A1-20240815.XML", "abstract": "Systems are provided for a disconnect system for an electric vehicle. In one example, a system includes a disconnect device of an axle system, the disconnect device comprising a clip configured to engage with a first groove of an axle and a second groove of a side gear.", "detailed_description": ["The following description relates to a system for a disconnect system of a vehicle. In one example, the vehicle comprises an electric drive unit comprising an inverter, electric motor, gearbox, and the like, as shown inFIG.1.FIGS.2A and2Bare a first embodiment of a disconnect system, according to an embodiment of the present disclosure.FIGS.3A and3Bare a second embodiment of a disconnect system, according to an embodiment of the present disclosure.FIGS.4A and4Bare a third embodiment of a disconnect system, according to an embodiment of the present disclosure.FIG.5is a method for operating the disconnect system, according to an embodiment of the present disclosure.", "", "In one example, the disclosure provides support for a disconnect system to disengage the axle shaft bolts to disconnect the system from a drivetrain. By disengaging the axle shaft bolts, the wheel hubs are allowed to spin independently from the axle shafts and the rest of the gear train. The shafts may be too large to fully remove and doing so will allow lubricant to escape and contamination to enter the system. Additionally, for a vehicle operator attempting to operate the disconnect system, there may be insufficient space on a roadside to remove an entire axle. The disconnect system may use a snap ring and a series of grooves to both retain the axle shaft in the assembly while maintaining the sealing system for the lubricant as well as securing an air gap to eliminate contact between the stationary axle shaft and free spinning full float hub. Once the bolts are disengaged the axle shaft can be pulled outward until the snap ring is engaged into the groove to positively locate and avoid contact with the hub. One method is to use one groove in the shaft and one in the side gear. In the installed condition, which includes the wheel hub spinning dependently with the axle, the clip is compressed and inboard of the side gear groove. Once the bolts are disengaged and in an uninstalled condition, the shaft can be pulled outboard until the clip snaps into the groove. Another embodiment may include two grooves in the side gear, one groove in the axle shaft and one snap ring. The clip may expand in both the installed condition as well as the towing condition (e.g., uninstalled condition) in its respective grooves eliminating stress on the snap ring in constant compression. As such, a longevity of the system may be increased. An additional system is to use an oversized width groove in the side gear, a groove in the shaft and one snap ring that allows the shaft to float outboard and a spring or other method would apply pressure pushing the shaft outboard avoiding contact with the hub.", "", "FIGS.1-4Bshow example configurations with relative positioning of the various components. If shown directly contacting each other, or directly coupled, then such elements may be referred to as directly contacting or directly coupled, respectively, at least in one example. Similarly, elements shown contiguous or adjacent to one another may be contiguous or adjacent to each other, respectively, at least in one example. As an example, components laying in face-sharing contact with each other may be referred to as in face-sharing contact. As another example, elements positioned apart from each other with only a space there-between and no other components may be referred to as such, in at least one example. As yet another example, elements shown above/below one another, at opposite sides to one another, or to the left/right of one another may be referred to as such, relative to one another. Further, as shown in the figures, a topmost element or point of element may be referred to as a “top” of the component and a bottommost element or point of the element may be referred to as a “bottom” of the component, in at least one example. As used herein, top/bottom, upper/lower, above/below, may be relative to a vertical axis of the figures and used to describe positioning of elements of the figures relative to one another. As such, elements shown above other elements are positioned vertically above the other elements, in one example. As yet another example, shapes of the elements depicted within the figures may be referred to as having those shapes (e.g., such as being circular, straight, planar, curved, rounded, chamfered, angled, or the like). Further, elements shown intersecting one another may be referred to as intersecting elements or intersecting one another, in at least one example. Further still, an element shown within another element or shown outside of another element may be referred as such, in one example. It will be appreciated that one or more components referred to as being “substantially similar and/or identical” differ from one another according to manufacturing tolerances (e.g., within 1-5% deviation).FIGS.2A-4Bare shown approximately to scale, however, other dimensions may be used if desired.", "", "Turning now toFIG.1, a vehicle100is shown comprising a powertrain101and a drivetrain103. The powertrain comprises a prime mover106and a transmission108. The prime mover106may be an internal combustion engine or an electric motor, for example, and is operated to provide rotary power to the transmission108. The transmission108may be any type of transmission, such as a manual transmission, an automatic transmission, or a continuously variable transmission. The transmission108receives the rotary power produced by the prime mover106as an input and outputs rotary power to the drivetrain103in accordance with a selected gear or setting.", "", "The prime mover106may be powered via energy from an energy storage device105. In one example, the energy storage device105is a battery configured to store electrical energy. An inverter107may be arranged between the energy storage device105and the prime mover106and configured to adjust direct current (DC) to alternating current (AC).", "", "The vehicle100may be a commercial vehicle, light, medium, or heavy duty vehicle, a passenger vehicle, an off-highway vehicle, and sport utility vehicle. Additionally or alternatively, the vehicle100and/or one or more of its components may be in industrial, locomotive, military, agricultural, and aerospace applications. In one example, the vehicle100is an electric vehicle.", "", "In some examples, such as shown inFIG.1, the drivetrain103includes a first axle assembly102and a second axle assembly112. The first axle assembly102may be configured to drive a first set of wheels104, and the second axle assembly112may be configured to drive a second set of wheels114. In one example, the first axle assembly102is arranged near a front of the vehicle100and thereby comprises a front axle, and the second axle assembly112is arranged near a rear of the vehicle100and thereby comprises a rear axle. The drivetrain103is shown in a four-wheel drive configuration, although other configurations are possible. For example, the drivetrain103may include a front-wheel drive, a rear-wheel drive, or an all-wheel drive configuration. Further, the drivetrain103may include one or more tandem axle assemblies. As such, the drivetrain103may have other configurations without departing from the scope of this disclosure, and the configuration shown inFIG.1is provided for illustration, not limitation. Further, the vehicle100may include additional wheels that are not coupled to the drivetrain103.", "", "In some four-wheel drive configurations, such as shown inFIG.1, the drivetrain103includes a transfer case110configured to receive rotary power output by the transmission108. A first driveshaft113is drivingly coupled to a first output111of the transfer case110, while a second driveshaft122is drivingly coupled to a second output121of the transfer case110. The first driveshaft113(e.g., a front driveshaft) transmits rotary power from the transfer case110to a first differential116of the first axle assembly102to drive the first set of wheels104, while the second driveshaft122(e.g., a rear driveshaft) transmits the rotary power from the transfer case110to a second differential126of the second axle assembly112to drive the second set of wheels114. For example, the first differential116is drivingly coupled to a first set of axle shafts118coupled to the first set of wheels104, and the second differential126is drivingly coupled to a second set of axle shafts128coupled to the second set of wheels114. It may be appreciated that each of the first set of axle shafts118and the second set of axle shafts128may be positioned in a housing.", "", "In some examples, additionally or alternatively, the vehicle100may be a hybrid vehicle including both an engine an electric machine each configured to supply power to one or more of the first axle assembly102and the second axle assembly112. For example, one or both of the first axle assembly102and the second axle assembly112may be driven via power originating from the engine in a first operating mode where the electric machine is not operated to provide power (e.g., an engine-only mode), via power originating from the electric machine in a second operating mode where the engine is not operated to provide power (e.g., an electric-only mode), and via power originating from both the engine and the electric machine in a third operating mode (e.g., an electric assist mode). As another example, one or both of the first axle assembly102and the second axle assembly112may be an electric axle assembly configured to be driven by an integrated electric machine.", "", "Turning now toFIGS.2A and2B, they show a first embodiment of an axle shaft210and wheel in a first mode200and a second mode250, respectively.FIGS.2A and2Bare described in tandem herein. The axle shaft210is coupled to a side gear220and a wheel hub230. The side gear220may be more central (e.g., inboard) than the wheel hub230. In one example, the first mode200is a tow mode and the second mode250is a drive mode. In one example, the axle shaft210is identical to a shaft of the first set of axle shafts118and/or a shaft of the second set of axle shaft128.", "", "In the embodiment ofFIGS.2A and2B, arrow292illustrates an inboard direction and arrow294illustrates an outboard direction. The inboard direction may point to a direction toward a center of a vehicle. The outboard direction may point to a direction away from the center of the vehicle. Herein, a disengagement system is described for moving the axle shaft210inboard or outboard to engage the first mode200of the second mode250.", "", "In the second mode250, which is a drive mode and the hub rotates with the axle shaft210, hub bolts232are engaged (e.g., threaded) and a clip222is disengaged with a second groove224of the side gear220. Herein, the second groove224is referred to as a side gear groove224. The clip222is compressed against an interior of the side gear220and expands within a first groove221of the axles shaft210. A flange212of the axle shaft210is pressed against the wheel hub230in the drive mode via the bolts232.", "", "In one example, the side gear220is arranged in a differential case, wherein the differential case is arranged inboard of the axle shaft210and an opposite axle shaft that optionally couples to another wheel on a shared axis with the axle shaft210. Other embodiments of the disengagement system shown herein may include where the clip222is arranged in the side gear220, the differential case, the wheel hub230, and/or the axle guide214. The axle guide214may be interchangeably referred to as an inboard seal and is configured to accommodate the movement of the axle shaft210between the first mode and the second mode. The inboard seal may be a sleeve or other element.", "", "In the first mode (e.g., a tow mode), the hub bolts232are disengaged. In one example, the hub bolts232may be completely removed. Additionally or alternatively, the hub bolts232may be disengaged such that the hub bolts232are no longer threaded with the hub230. In one example, the hub bolts232may still be threaded to the flange212. In this way, the hub bolts232may be kept in place for reengagement with the hub230.", "", "Disengagement of the hub bolts232may include one or more elements for resisting tampering and/or undesired disengagement of the hub bolts. In one example, the hub bolts232may not be disengaged unless a button within a vehicle cabin is depressed. Additionally or alternatively, an option from a mobile device, key fob, or other electronic device may be selected to initiate disengagement of the hub bolts232. Upon receiving the request, the hub bolts232may be disengaged manually via a user possessing a unique tool (e.g., a unique key socket shaped to match a head of the hub bolts). Additionally or alternatively, an electronic actuator may begin to disengage the hub bolts232in response to the option being selected. In some examples, additionally or alternatively, the hub bolts232may only be disengaged when certain gears of the vehicle are in operation. For example, the hub bolts232may only be disengaged when the vehicle is in a park gear. Additionally or alternatively, the hub bolts232may only be disengaged when the vehicle is stopped.", "", "In the first mode200, the clip222is engaged with the side gear groove224and the axle shaft groove221. As such, the axle shaft groove221and the side gear groove224are aligned due to the outboard movement of the axle shaft210toward a wheel. The axle shaft210may be moved outboard via the user and/or via an electronic actuator configured to move the axle shaft210. The clip222may resist (e.g., stop) movement of the axle shaft210once the clip expands into the side gear groove224. When the axle shaft210is moved outboard, the flange212is spaced away from the wheel hub230, which may allow the wheel to spin independently of the motor, differential, and gear system.", "", "In one example, one or more components of the disengagement system may include a chamfer to reduce a force demanded to push the axle shaft210inboard from the outboard position of the first mode200. In the example ofFIGS.2A and2B, the side gear groove224includes a chamfer225on an inboard side of the side gear groove. The chamfer225may allow the axle shaft210be pushed in with less force relative to the grooves only including a square cross-sectional shape. Additionally or alternatively, the clip222may include a chamfer on its inboard side.", "", "Thus, in the first embodiment, the first groove221is arranged in the axle shaft210and the second groove224is arranged in the side gear220. When the bolts232are installed, the clip222is compressed and fills only the first groove221inboard of the second groove224. Once the bolts232are removed, the axle shaft210may be pulled outboard until the clip222snaps into the second groove224and engaged with each of the first groove221and the second groove224, thereby allowing the wheel to rotate independently of the drivetrain during a tow mode while retaining lubricant in the axle system.", "", "Turning now toFIGS.3A and3B, they show a second embodiment of an axle shaft310and a wheel in a first mode300and a second mode350, respectively.FIGS.3A and3Bare described in tandem herein. The axle shaft310is coupled to a side gear320and a wheel hub330. The side gear320may be more central (e.g., inboard) than the wheel hub330. In one example, the first mode300is a tow mode and the second mode350is a drive mode. In one example, the axle shaft310, the side gear320, and the wheel hub330may be used similarly to the axle shaft210, the side gear220, and the wheel hub230ofFIGS.2A and2B.", "", "In the second mode (e.g., a drive mode), hub bolts332are engaged and threaded into the hub330. A clip322is engaged with a first side gear groove326of the side gear320. More specifically, the clip322, is engaged with the first side gear groove326and an axle groove324. The flange312is engaged and pressed against the wheel hub330, resulting in the wheel spinning dependent of the drivetrain.", "", "In the first mode (e.g., tow mode), the hub bolts are disengaged and no longer threaded to the hub330. The clip322is engaged with a second side gear groove328of the side gear320. The second groove328is more outboard than the first groove326of the side gear320. The axle shaft310may move in the outboard direction due to the bolts being removed, with results in a gap being arranged between the flange312and the wheel hub330. As such, the wheel may rotate independently of the drivetrain during the tow mode while the grooves and clip system retain lubricant in the axle system.", "", "In one example, one or more of the first side gear groove326, the second side gear groove328, and the clip322may include a chamfer to decrease a force needed to move the axle shaft310. In one example, the first side gear groove326may include a chamfer on the outboard side and the second side gear groove328may include a chamfer on its inboard side. As such, the chamfer of the first side gear groove326may facilitate smoother movement of the axle shaft310in the outboard direction and the chamfer of the second side gear groove328may facilitate smoother movement of the axle shaft310in the inboard direction. Additionally or alternatively, only one of the first side gear groove326and the second side gear groove328may include the chamfer.", "", "Turning now toFIGS.4A and4B, they show a third embodiment of an axle shaft410and a wheel in a first mode400(e.g., a tow mode) and a second mode450(e.g., a drive mode), respectively.FIGS.4A and4Bare described in tandem herein. The axle shaft410is coupled to a side gear420and a wheel hub430. The side gear420may be more central (e.g., inboard) than the wheel hub430. In one example, the first mode400is a tow mode and the second mode450is a drive mode. The axle shaft, side gear420, and wheel hub430may be used similarly to the axle shafts, side gears, and wheel hubs ofFIGS.2A-3B.", "", "In the drive mode, hub bolts432are engaged and threaded into the hub430. A clip422is engaged with a side gear groove426of the side gear420. More specifically, the clip422, is engaged with an inboard end of the side gear groove426and an axle groove424of the axle shaft410. The first groove426is longer than the second groove424. In one example, the clip422is engaged with an inboard edge of the side gear groove426. The flange412is engaged and pressed against the wheel hub430, resulting in the wheel spinning dependent of the drivetrain.", "", "In the tow mode, the hub bolts432are disengaged and no longer threaded with the wheel hub430. The clip422is engaged with an outboard edge of the side gear groove426. In one example, the outboard edge of the side gear groove426is an opposite extreme end of the side gear groove426relative to the inboard edge. The axle shaft410may move in the outboard direction due to the bolts being removed, with results in a gap being arranged between the flange412and the wheel hub430. A spring414or other similar element may apply pressure and push the flange412away from the wheel hub430. As such, the wheel may rotate independently of the drivetrain during the tow mode while the grooves and clip system retain lubricant in the axle system.", "", "Turning now toFIG.5, it shows a method500for operating the disconnect system. Instructions for carrying out method500may be executed by a controller based on instructions stored on a memory of the controller and in conjunction with signals received from sensors of the engine system. The controller may employ engine actuators of the engine system to adjust engine operation, according to the method described below. As used herein, the term “approximately” is construed to mean plus or minus five percent of the range unless otherwise specified.", "", "The method500begins at502, which includes determining operating conditions. Operating conditions may include but are not limited to a gear selected, a mode selected, a battery state of charge (SOC), and the like.", "", "At504, the method500may include determining if a first mode is initiated. The first mode is a tow mode. If the tow mode is initiated, then a park gear may be selected and/or the battery (SOC) may be less than a lower threshold SOC. The tow mode may be selected by a vehicle operator through via depressing a button in a vehicle cabin interior, a mobile device, or the like. Additionally or alternatively, a tow cable hookup may be coupled to the vehicle and the first mode may be initiated.", "", "If the first mode is not initiated, then at506, the method500may include indicating the second mode is initiated, where the bolts are engaged. In one example, the second mode is a drive mode. The bolts may be engaged with a vehicle operator actuating the bolts via a specialized tool (e.g., a wrench). Additionally or alternatively, the bolts may be actuated via a vehicle actuator configured to adjust the position of the bolts based on the selected mode. As such, the clip may be disengaged with a groove of the side gear or engaged with a different section of the groove of the side gear.", "", "At508, the method500may include moving the axle and flange inboard. As such, the flange may be pressed against and coupled to the wheel hub via the plurality of wheel hub fasteners. In one example, the plurality of wheel hub fasteners may be tightened via an electronic actuator of the vehicle. Additionally or alternatively, the plurality of wheel hub fasteners may be manually tightened via the user.", "", "At510, the method500may include rotating the wheels dependent of the drivetrain.", "", "Returning to504, if the first mode is initiated, then at512, the method500may include removing the fasteners. The fasteners may be removed by a user or via an actuator of the vehicle. For example, the actuator may turn the plurality of fasteners and unthread them from a wheel hub. The fasteners may remain threaded with the flange of the axle such that the fasteners are maintained in place. By doing this, a likelihood of losing the fasteners is reduced.", "", "At514, the method500may include moving the axle and flange outboard. As such, the clip may be engaged with a groove of the side gear or engaged with a different section of the groove of the side gear. The axle and flange may be moved via an axle actuator, such as a spring or other actuator. In some examples, the axle actuator may be electrically controlled. Additionally or alternatively, the axle shaft may be manually actuated via the user.", "", "At516, the method500may include rotating the wheel independently of the drivetrain. As such, the vehicle may be towed without degrading the drivetrain.", "", "The disclosure provides support for a system including a disconnect device of an axle system, the disconnect device comprising a clip configured to engage with an axle groove of an axle and a side gear groove of a side gear. A first example of the system further includes a flange integrally arranged with the axle, wherein the flange is optionally physically coupled to a wheel hub via a plurality of wheel hub fasteners. A second example of the system, optionally including the first example, further includes where the side gear groove is a first side gear groove, further comprising a second side gear groove outboard of the first side gear groove. A third example of the system, optionally including the one or more of the previous examples, further includes where the side gear groove is larger than the axle groove. A fourth example of the system, optionally including the one or more of the previous examples, further includes where the side gear groove comprises a chamfer at an inboard edge. A fifth example of the system, optionally including the one or more of the previous examples, further includes where the side gear groove is outboard relative to the axle groove. A sixth example of the system, optionally including the one or more of the previous examples, further includes where the clip is spaced away from the side gear groove and arranged in only the axle groove when the axle is in a first position. A seventh example of the system, optionally including the one or more of the previous examples, further includes where the clip is arranged in and engaged with each of the axle groove and the side gear groove when the axle is in a second position.", "", "The disclosure provides support for an axle system of a vehicle including a disconnect system comprising a clip arranged in an axle groove of an axle of the axle system, wherein the clip engages with a side gear groove of a side gear in a drive condition. A first example of the axle system further includes where the side gear groove is a first side gear groove, and wherein the clip engages with a second side gear groove in a tow condition. A second example of the axle system, optionally including the first example, further includes where the axle moves outboard in the tow condition relative to the drive condition. A third example of the axle system, optionally including the one or more of the previous examples, further includes where the second side gear groove is outboard relative to the first side gear groove. A fourth example of the axle system, optionally including the one or more of the previous examples, further includes where the clip engages with an inboard edge of the side gear groove in the drive condition, and wherein the clip engages with an outboard edge of the side gear groove in a tow condition. A fifth example of the axle system, optionally including the one or more of the previous examples, further includes where the vehicle includes an all-wheel drive system. A sixth example of the axle system, optionally including the one or more of the previous examples, further includes where the disconnect system is arranged between each wheel and differential of the vehicle.", "", "The disclosure provides additional support for a method for a disconnect system of a vehicle including moving an axle inboard toward a differential in response to a drive mode being selected and engaging a clip with an axle groove of the axle and a first portion of a side gear and moving an axle outboard away from the differential in response to a tow mode being selected and engaged the clip with the axle groove of the axle and a second portion of the side gear. A first example moving the axle inboard further comprises tightening a plurality of wheel hub fasteners through a flange and into a wheel hub. A second example of the method further includes where moving the axle outboard further comprises loosening a plurality of wheel hub fasteners from a wheel hub. A third example of the method, optionally including one or more of the previous examples, further includes where the first portion of the side gear includes a first side gear groove and the second portion of the side gear includes a second side gear groove outboard relative to the first side gear groove. A fourth example of the method, optionally including one or more of the previous examples, further includes where only the second portion of the side gear includes a side gear groove.", "", "Note that the example control and estimation routines included herein can be used with various vehicle system configurations. The control methods and routines disclosed herein may be stored as executable instructions in non-transitory memory and may be carried out by the control system including the controller in combination with the various sensors, actuators, and other hardware. The specific routines described herein may represent one or more of any number of processing strategies such as event-driven, interrupt-driven, multi-tasking, multi-threading, and the like. As such, various actions, operations, and/or functions illustrated may be performed in the sequence illustrated, in parallel, or in some cases omitted. Likewise, the order of processing is not necessarily required to achieve the features and advantages of the example embodiments described herein, but is provided for ease of illustration and description. One or more of the illustrated actions, operations and/or functions may be repeatedly performed depending on the particular strategy being used. Further, the described actions, operations and/or functions may graphically represent code to be programmed into non-transitory memory of the computer readable storage medium in the control system, where the described actions are carried out by executing the instructions in a system including the various hardware components in combination with the electronic controller.", "", "As used herein, the term “approximately” is construed to mean plus or minus five percent of the range unless otherwise specified.", "", "The following claims particularly point out certain combinations and sub-combinations regarded as novel and non-obvious. These claims may refer to “an” element or “a first” element or the equivalent thereof. Such claims should be understood to include incorporation of one or more such elements, neither requiring nor excluding two or more such elements. Other combinations and sub-combinations of the disclosed features, functions, elements, and/or properties may be claimed through amendment of the present claims or through presentation of new claims in this or a related application. Such claims, whether broader, narrower, equal, or different in scope to the original claims, also are regarded as included within the subject matter of the present disclosure."], "claims": ["a disconnect device of an axle system, the disconnect device comprising a clip configured to engage with an axle groove of an axle and a side gear groove of a side gear.", "2 . The system of claim 1 , further comprising a flange integrally arranged with the axle, wherein the flange is optionally physically coupled to a wheel hub via a plurality of wheel hub fasteners.", "3 . The system of claim 1 , wherein the side gear groove is a first side gear groove, further comprising a second side gear groove outboard of the first side gear groove.", "4 . The system of claim 1 , wherein the side gear groove is larger than the axle groove.", "5 . The system of claim 1 , wherein the side gear groove comprises a chamfer at an inboard edge.", "6 . The system of claim 1 , wherein the side gear groove is outboard relative to the axle groove.", "7 . The system of claim 1 , wherein the clip is spaced away from the side gear groove and arranged in only the axle groove when the axle is in a first position.", "8 . The system of claim 2 , wherein the clip is arranged in and engaged with each of the axle groove and the side gear groove when the axle is in a second position.", "a disconnect system comprising a clip arranged in an axle groove of an axle of the axle system, wherein the clip engages with a side gear groove of a side gear in a drive condition.", "10 . The axle system of claim 9 , wherein the side gear groove is a first side gear groove, and wherein the clip engages with a second side gear groove in a tow condition.", "11 . The axle system of claim 10 , wherein the axle moves outboard in the tow condition relative to the drive condition.", "12 . The axle system of claim 10 , wherein the second side gear groove is outboard relative to the first side gear groove.", "13 . The axle system of claim 9 , wherein the clip engages with an inboard edge of the side gear groove in the drive condition, and wherein the clip engages with an outboard edge of the side gear groove in a tow condition.", "14 . The axle system of claim 9 , wherein the vehicle includes an all-wheel drive system.", "15 . The axle system of claim 9 , wherein the disconnect system is arranged between each wheel and differential of the vehicle.", "moving an axle inboard toward a differential in response to a drive mode being selected and engaging a clip with an axle groove of the axle and a first portion of a side gear; and moving an axle outboard away from the differential in response to a tow mode being selected and engaged the clip with the axle groove of the axle and a second portion of the side gear.", "17 . The method for the disconnect system of claim 16 , wherein moving the axle inboard further comprises tightening a plurality of wheel hub fasteners through a flange and into a wheel hub.", "18 . The method for the disconnect system of claim 16 , wherein moving the axle outboard further comprises loosening a plurality of wheel hub fasteners from a wheel hub.", "19 . The method for the disconnect system of claim 16 , wherein the first portion of the side gear includes a first side gear groove and the second portion of the side gear includes a second side gear groove outboard relative to the first side gear groove.", "20 . The method for the disconnect system of claim 16 , wherein only the second portion of the side gear includes a side gear groove."], "bibtex": "@patent{20240270018,\n    title = {SYSTEMS AND METHODS FOR WHEEL DISCONNECT},\n    number = {20240270018},\n    year = {2024},\n    note = {File: US20240270018A1-20240815.XML}\n    }", "classification": "B60B2700FI"}, {"title": "USE OF PROFILED REACTION FACE IN HYBRID TORQUE BAR APPLICATIONS", "doc_number": "20240270019", "filename": "US20240270019A1-20240815.XML", "abstract": "A torque bar is disclosed herein. The torque bar includes a body, a distal end, and a proximal end. The proximal end includes a horizontal portion having a first side and a second side, a first vertical portion having a first end and a second end, the first vertical portion coupled to the first side of the horizontal portion between the first end and the second end, a second vertical portion having a third end and a fourth end, the second vertical portion coupled to the second side of the horizontal portion between the third end and the fourth end, wherein a first profile is formed in the first end of the first vertical portion and a second profile is formed in the third end of the second vertical portion.", "detailed_description": ["The following detailed description of various embodiments herein makes reference to the accompanying drawings, which show various embodiments by way of illustration. While these various embodiments are described in sufficient detail to enable those skilled in the art to practice the disclosure, it should be understood that other embodiments may be realized and that changes may be made without departing from the scope of the disclosure. Thus, the detailed description herein is presented for purposes of illustration only and not of limitation. While these exemplary embodiments are described in sufficient detail to enable those skilled in the art to practice the invention, it should be understood that other embodiments may be realized and that logical, chemical and mechanical changes may be made without departing from the spirit and scope of the invention. For example, the steps recited in any of the method or process descriptions may be executed in any order and are not necessarily limited to the order presented. Furthermore, any reference to singular includes plural embodiments, and any reference to more than one component or step may include a singular embodiment or step. Also, any reference to attached, fixed, connected, or the like may include permanent, removable, temporary, partial, full or any other possible attachment option. Additionally, any reference to without contact (or similar phrases) may also include reduced contact or minimal contact. It should also be understood that unless specifically stated otherwise, references to “a,” “an” or “the” may include one or more than one and that reference to an item in the singular may also include the item in the plural. Further, all ranges may include upper and lower values and all ranges and ratio limits disclosed herein may be combined.", "", "Disclosed herein is a torque bar for use in an aircraft wheel assembly including a wheel and a lug, the torque bar being coupled to the wheel and the lug. The torque bar includes, in various embodiments, a reaction face that contacts a lug face. In various embodiments, the torque bar reaction face includes a tailored profiling that utilizes deflection of the torque bar to reduce and linearize contact stresses along the lug face at any given load. In various embodiments, the torque bar includes torque bar ears that deflect in response to a load increase. In various embodiments, the deflecting torque bar ears cause an increase in contact area with the wheel lug, resulting in improved load distribution. In various embodiments, the load may be distributed evenly along the lug face for various loading condition (e.g., minimum torque) up to a given load condition (i.e., peak torque). In various embodiments, profiling of the reaction faces reduces lug damage and subsequent corrosion found in current hybrid torque bar setups as compared to non-profiled surfaces. In various embodiments, profiling the torque bar surfaces may add no additional components and only adds a minimal cost to each torque bar. In various embodiments, currently fielded torque bars may be updated to include a profiled surface with minimal effort.", "", "Referring toFIG.1A, in accordance with various embodiments, an aircraft10is illustrated. The aircraft10includes landing gear, which may include a left main landing gear12, a right main landing gear14and a nose landing gear16. The landing gear support the aircraft10when it is not flying, allowing the aircraft10to taxi, take off and land without damage. While the disclosure refers to the three landing gear configurations just referred, the disclosure nevertheless contemplates any number of landing gear configurations.", "", "Referring now toFIG.1B, there is schematically depicted a brake mechanism100that may be used by the aircraft10ofFIG.1Aor any other appropriate aircraft. The brake mechanism100is mounted on an axle102for use with a wheel104disposed on and configured to rotate about the axle102via one or more bearing assemblies103. The wheel104includes a hub106, a wheel well108concentric about the hub106and a web portion110interconnecting the hub106and the wheel well108. A central axis112extends through the axle102and defines a center of rotation of the wheel104. A torque plate barrel114(sometimes referred to as a torque tube or barrel or a torque plate or back leg) is aligned concentrically with the hub106, and the wheel104is rotatable relative to the torque plate barrel114.", "", "The brake mechanism100includes a piston assembly116, a pressure plate118disposed adjacent the piston assembly116, an end plate120positioned a distal location from the piston assembly116, and a plurality of rotor disks122interleaved with a plurality of stator disks124positioned intermediate the pressure plate118and the end plate120. The pressure plate118, the plurality of rotor disks122, the plurality of stator disks124and the end plate120together form a brake heat sink or brake stack126. The pressure plate118, the end plate120and the plurality of stator disks124are mounted to the torque plate barrel114and remain rotationally stationary relative to the axle102.", "", "The torque plate barrel114may include an annular barrel or torque tube128and an annular plate or back leg130. The back leg130is disposed at an end distal from the piston assembly116and may be made monolithic with the torque tube128, as illustrated inFIG.1B, or may be made as a separate annular piece and suitably connected to the torque tube128. The torque tube128has a plurality of circumferentially spaced and axially extending splines132disposed on an outer surface of the torque tube128. The plurality of stator disks124and the pressure plate118include notches or stator slots134on an inner periphery of the disks and the plate for engagement with the splines132, such that each disk and the plate are axially slidable with respect to the torque tube128.", "", "The end plate120is suitably connected to the back leg130of the torque plate barrel114and is held non-rotatable, together with the plurality of stator disks124and the pressure plate118, during a braking action. The plurality of rotor disks122, interleaved between the pressure plate118, the end plate120and the plurality of stator disks124, each have a plurality of circumferentially spaced notches or rotor lugs136along an outer periphery of each disk for engagement with a plurality of torque bars138, each of which is secured to or made monolithic with an inner periphery of the wheel104.", "", "An actuating mechanism for the brake mechanism100includes a plurality of piston assemblies, including the piston assembly116, circumferentially spaced around an annular piston housing156(only one piston assembly is illustrated inFIG.1B). Upon actuation, the plurality of piston assemblies affect a braking action by urging the pressure plate118and the plurality of stator disks124into frictional engagement with the plurality of rotor disks122and against the end plate120. Fluid or hydraulic pressure, mechanical springs or electric actuators, among other mechanisms, may be used to actuate the plurality of piston assemblies. Through compression of the plurality of rotor disks122and the plurality of stator disks124between the pressure plate118and the end plate120, the resulting frictional contact slows or stops or otherwise prevents rotation of the wheel104. The plurality of rotor disks122and the plurality of stator disks124are fabricated from various materials, such as ceramic matrix composites, that enable the brake disks to withstand and dissipate the heat generated during and following a braking action.", "", "The torque plate barrel114is secured to a stationary portion of the landing gear such as the axle102, preventing the torque plate barrel114and the plurality of stator disks124from rotating during braking of the aircraft. The torque tube128portion of the torque plate barrel114may be attached to the annular piston housing156via an annular mounting surface158, wherein bolt fasteners160secure the torque plate barrel114to the annular piston housing156. A spacer member or pedestal162is positioned between an inner diameter surface164of the torque tube128and an outer diameter surface166of the axle102. The pedestal162includes a radially inner surface or foot168for engaging the axle102, a web portion170radially outward of the foot168and a head portion172for engaging the inner diameter surface164of the torque tube128. The pedestal162augments support of the torque plate barrel114within the brake mechanism100generally and, more particularly, against the axle102. The pedestal162may be made monolithic with the torque tube128portion of the torque plate barrel114.", "", "A heat shield140is secured directly or indirectly to the wheel104between a radially inward surface of the wheel well108and the plurality of torque bars138. As illustrated inFIG.1B, the heat shield140is concentric with the wheel well108and may have a plurality of heat shield sections142disposed between respective, adjacent pairs of the plurality of torque bars138. The heat shield140is, or heat shield sections142are, spaced from the radially inward surface of the wheel well108and secured in place by heat shield tabs190, such that the heat shield140is, or heat shield sections142are, disposed generally parallel to the axis of rotation or central axis112of the wheel104and intermediate the plurality of torque bars138and the radially inward surface of the wheel well108.", "", "The plurality of torque bars138is attached to the wheel104at axially inboard ends of the torque bars by torque bar bolts146. The torque bar bolts146extend through respective holes in a flange150provided on the wheel104as shown, which flange150for purposes of the present description is intended to be considered as part of the wheel well108. Each of the plurality of torque bars138may include a pin152or similar member at its axially outboard end (i.e., the end opposite the torque bar bolts146) that is received within a hole154disposed proximate the web portion110of the wheel104. The heat shield140, or heat shield sections142, is positioned adjacent a radially inward surface of the wheel well108and secured in place by the heat shield tabs190.", "", "Each brake assembly, including the torque plate barrel114, is designed for a specific application and for specific modes of operation. The size (e.g., length, diameter, thickness, etc.) and material of the torque plate barrel114may be modified to suit a particular application or improve a mode of operation. Different modes of operation that are considered include whirl, squeal, and disc squeal, for example. Additional design considerations include dynamic stability, such as torsional compliance, axial compliance, and structural asymmetry, and cooling of the brake assembly, including the torque plate barrel114.", "", "Referring now toFIGS.2A and2B, a wheel assembly200is illustrated, in accordance with various embodiments. Wheel assembly200includes a tire202, a wheel204, an inner rim206, a torque bar210, and a wheel drive lug212coupled to inner rim206. Torque bar210has a distal end210aconfigured to be coupled to wheel204and a proximal end210bconfigured to be coupled to wheel drive lug212. Wheel204includes a hole208that is configured to receive distal end210aof torque bar210, securing torque bar210to wheel204. A bolt216may be used to secure torque bar210to wheel drive lug212. Bolt216extends through a hole in torque bar210and into a hole214in wheel drive lug212, securing proximal end210bof torque bar210to wheel drive lug212.", "", "Referring now toFIGS.3A and3B, and with continued reference toFIGS.2A and2B, proximal end210bof torque bar210is illustrated, in accordance with various embodiments. Torque bar210, and more specifically, proximal end210bof torque bar210includes a first vertical portion220, a second vertical portion222, and a horizontal portion224extending from first vertical portion220to second vertical portion222. First vertical portion220and second vertical portion222may also be referred to as torque bar ears. Torque bar210further includes a hole226extending through horizontal portion224to receive bolt216.", "", "Proximal end210bof torque bar210, and more specifically, first vertical portion220, second vertical portion222, and horizontal portion224physically contact wheel drive lug212. As torque bar210is loaded during use, the ears (i.e., first vertical portion220and second vertical portion222) of torque bar210deflect.", "", "As disclosed herein, torque bar210, and more specifically, first vertical portion220has a first machined profile220aand second vertical portion222has a second machined profile222a. First machined profile220aand second machined profile222acause initial contact between wheel drive lug212and torque bar210to be towards an inboard side of wheel drive lug212(e.g., the positive y-direction). That is, a first contact patch having a first size is defined by the surfaces of torque bar210that contact wheel drive lug212. As the load on torque bar210increases, the ears of torque bar210deflect. That is, first vertical portion220that is above horizontal portion224moves away from second vertical portion222that is above horizontal portion224. As a result of the deflection, the contact patch between torque bar210and wheel drive lug212increases. This increase in contact patch size decreases the stress on wheel drive lug212at any given load. Accordingly, this results in a uniform stress as the load increases from zero to a maximum load.", "", "In various embodiments, first machined profile220ahas a first radius of curvature and second machined profile222ahas a second radius of curvature. In various embodiments, first radius of curvature is about 50 inches (about 127 centimeters) to about 100 inches (about 254 centimeters), and more specifically, about 70 inches (about 177.8 centimeters) to about 100 inches (about 254 centimeters). In various embodiments, first radius of curvature is the same as second radius of curvature. In various embodiments, first radius of curvature is either larger or smaller than second radius of curvature. As illustrated inFIGS.3A and3B, first machined profile220aand second machined profile222aare almost straight. In various embodiments, first machined profile220aand second machined profile222amay be a chamfer, a bevel, a flute, a groove, a slant, a slope, or other physical feature formed onto or machined from first vertical portion220and second vertical portion222, respectively. In various embodiments, first machined profile220aand second machined profile222amay be each be a compound profile. That is, a series of connected angles, lines, or curves resulting in the formation of first machine profile220aand second machined profile222a. In other words, first machined profile220aand/or second machined profile222amay be a series of different radius of curvatures, or other features connected together, resulting in different angle lines. In various embodiments, first machined profile220aextends from a top surface of first vertical portion220to a sidewall of first vertical portion220. In various embodiments, first machined profile220amay further include multiple segments between the top surface of first vertical portion220and the sidewall of first vertical portion220, resulting in a compound profile. In various embodiments, second machined profile222aextends from a top surface of second vertical portion222to a sidewall of second vertical portion222. In various embodiments, second machined profile222amay further include multiple segments between the top surface of second vertical portion222and the sidewall of second vertical portion222, resulting in a compound profile. In various embodiments, first machined profile220ais formed, or machined, at an intersection of the top surface of first vertical portion220and the sidewall of first vertical portion220. In various embodiments, second machined profile222ais formed, or machined, at an intersection of the top surface of second vertical portion222and the sidewall of second vertical portion222. In various embodiments, the first radius of curvature and the second radius of curvature may be small enough that first machined profile220aand second machined profile220bare convex.", "", "In various embodiments, torque bar210further includes a third vertical portion230extending between first vertical portion220and second vertical portion222and coupled to horizontal portion224. In various embodiments, third vertical portion230is semi-circular in shape, extending away from first vertical portion220and second vertical portion222. In various embodiments, third vertical portion230may be straight, extending from first vertical portion220to second vertical portion222. In various embodiments, first vertical portion220, second vertical portion222, and third vertical portion230may be machined from proximal end210bof torque bar210.", "", "Referring now toFIG.4, a method of manufacturing a torque bar210is illustrated, in accordance with various embodiments. At block402, a torque bar is received. The torque bar may be an example of torque bar210described above with respect toFIGS.2A,2B,3A, and3B. The torque bar may have a first vertical portion and a second vertical portion. At block404, a radius of curvature, or similar tailored profile, is determined for the machined profile of the first portion and/or the second portion. The machined profile may be an example of first machined profile220aand second machined profile222adescribed above. The determined radius of curvature, or similar tailored profile, may be based at least in part on a type of an aircraft, a weight of the aircraft, a size of a wheel of the aircraft, an expected load on the wheel of the aircraft, an expected load on the wheel drive lug of the wheel, a material of the torque bar210, or a size of a wheel lug, among others. At block406, the torque bar is machined to form the profile having the determined radius of curvature. Specifically, the first vertical portion and/or the second vertical portion is machined to have the profile having the determined radius of curvature.", "", "Benefits, other advantages, and solutions to problems have been described herein with regard to specific embodiments. Furthermore, the connecting lines shown in the various figures contained herein are intended to represent exemplary functional relationships and/or physical couplings between the various elements. It should be noted that many alternative or additional functional relationships or physical connections may be present in a practical system. However, the benefits, advantages, solutions to problems, and any elements that may cause any benefit, advantage, or solution to occur or become more pronounced are not to be construed as critical, required, or essential features or elements of the disclosure. The scope of the disclosure is accordingly to be limited by nothing other than the appended claims, in which reference to an element in the singular is not intended to mean “one and only one” unless explicitly so stated, but rather “one or more.” Moreover, where a phrase similar to “at least one of A, B, or C” is used in the claims, it is intended that the phrase be interpreted to mean that A alone may be present in an embodiment, B alone may be present in an embodiment, C alone may be present in an embodiment, or that any combination of the elements A, B and C may be present in a single embodiment; for example, A and B, A and C, B and C, or A and B and C. Different cross-hatching is used throughout the figures to denote different parts but not necessarily to denote the same or different materials.", "", "Systems, methods and apparatus are provided herein. In the detailed description herein, references to “one embodiment,” “an embodiment,” “various embodiments,” etc., indicate that the embodiment described may include a particular feature, structure, or characteristic, but every embodiment may not necessarily include the particular feature, structure, or characteristic. Moreover, such phrases are not necessarily referring to the same embodiment. Further, when a particular feature, structure, or characteristic is described in connection with an embodiment, it is submitted that it is within the knowledge of one skilled in the art to affect such feature, structure, or characteristic in connection with other embodiments whether or not explicitly described. After reading the description, it will be apparent to one skilled in the relevant art(s) how to implement the disclosure in alternative embodiments.", "", "Numbers, percentages, or other values stated herein are intended to include that value, and also other values that are about or approximately equal to the stated value, as would be appreciated by one of ordinary skill in the art encompassed by various embodiments of the present disclosure. A stated value should therefore be interpreted broadly enough to encompass values that are at least close enough to the stated value to perform a desired function or achieve a desired result. The stated values include at least the variation to be expected in a suitable industrial process, and may include values that are within 5% of a stated value. Additionally, the terms “substantially,” “about” or “approximately” as used herein represent an amount close to the stated amount that still performs a desired function or achieves a desired result. For example, the term “substantially,” “about” or “approximately” may refer to an amount that is within 5% of a stated amount or value.", "", "Furthermore, no element, component, or method step in the present disclosure is intended to be dedicated to the public regardless of whether the element, component, or method step is explicitly recited in the claims. No claim element herein is to be construed under the provisions of 35 U.S.C. 112(f) unless the element is expressly recited using the phrase “means for.” As used herein, the terms “comprises,” “comprising,” or any other variation thereof, are intended to cover a non-exclusive inclusion, such that a process, method, article, or apparatus that comprises a list of elements does not include only those elements but may include other elements not expressly listed or inherent to such process, method, article, or apparatus.", "", "Finally, it should be understood that any of the above-described concepts can be used alone or in combination with any or all of the other above-described concepts. Although various embodiments have been disclosed and described, one of ordinary skill in this art would recognize that certain modifications would come within the scope of this disclosure. Accordingly, the description is not intended to be exhaustive or to limit the principles described or illustrated herein to any precise form. Many modifications and variations are possible in light of the above teaching."], "claims": ["a body; a distal end; and a proximal end, the proximal end including: a horizontal portion having a first side and a second side; a first vertical portion having a first end and a second end, the first vertical portion coupled to the first side of the horizontal portion between the first end and the second end; a second vertical portion having a third end and a fourth end, the second vertical portion coupled to the second side of the horizontal portion between the third end and the fourth end; wherein a first profile is formed in the first end of the first vertical portion and a second profile is formed in the third end of the second vertical portion.", "2 . The torque bar of claim 1 , wherein the first profile has a first radius of curvature and the second profile has a second radius of curvature.", "3 . The torque bar of claim 2 , where the first radius of curvature is the same as the second radius of curvature.", "4 . The torque bar of claim 2 , wherein the first radius of curvature is different than the second radius of curvature.", "5 . The torque bar of claim 2 , wherein the first radius of curvature is about 50 inches to about 120 inches.", "6 . The torque bar of claim 1 , wherein the first profile is chamfered and the second profile is chamfered.", "7 . The torque bar of claim 1 , wherein the first vertical portion further includes a sidewall intersecting a top surface, the first profile being formed at an intersection of the sidewall and the top surface.", "a wheel having an axially exterior outer edge and an axially interior surface; a drive lug coupled to the axially exterior outer edge; and a torque bar coupled to the wheel and the drive lug, the torque bar including: a proximal end coupled to the drive lug; and a distal end coupled to the axially interior surface of the wheel; wherein the proximal end includes: a horizontal portion having a first side and a second side; a first vertical portion having a first end and a second end, the first vertical portion coupled to the first side of the horizontal portion between the first end and the second end; a second vertical portion having a third end and a fourth end, the second vertical portion coupled to the second side of the horizontal portion between the third end and the fourth end; wherein a first profile is formed in the first end of the first vertical portion and a second profile is formed in the third end of the second vertical portion.", "9 . The wheel assembly of claim 8 , wherein the first profile has a first radius of curvature and the second profile has a second radius of curvature.", "10 . The wheel assembly of claim 9 , where the first radius of curvature is the same as the second radius of curvature.", "11 . The wheel assembly of claim 9 , wherein the first radius of curvature is different than the second radius of curvature.", "12 . The wheel assembly of claim 9 , wherein the first radius of curvature is about 50 inches to about 120 inches.", "13 . The wheel assembly of claim 8 , wherein the first profile is chamfered and the second profile is chamfered.", "14 . The wheel assembly of claim 8 , wherein the first vertical portion further includes a sidewall intersecting a top surface, the first profile being formed at an intersection of the sidewall and the top surface.", "a wheel; a drive lug coupled to the wheel; and a torque bar coupled to an inner periphery of the wheel and the drive lug, the torque bar including: a proximal end coupled to the drive lug, the proximal end including: a horizontal portion having a first side and a second side; a first vertical portion having a first end and a second end, the first vertical portion coupled to the first side of the horizontal portion between the first end and the second end; and a first profile formed in the first end of the first vertical portion.", "a second vertical portion having a third end and a fourth end, the second vertical portion coupled to the second side of the horizontal portion between the third end and the fourth end; and a second profile formed in the third end of the second vertical portion.", "17 . The brake assembly of claim 16 , wherein the first profile has a first radius of curvature and the second profile has a second radius of curvature.", "18 . The brake assembly of claim 17 , wherein the first radius of curvature is about 50 inches to about 120 inches.", "19 . The brake assembly of claim 17 , wherein the first radius of curvature is different than the second radius of curvature.", "20 . The brake assembly of claim 15 , wherein the horizontal portion physically contacts the drive lug."], "bibtex": "@patent{20240270019,\n    title = {USE OF PROFILED REACTION FACE IN HYBRID TORQUE BAR APPLICATIONS},\n    number = {20240270019},\n    year = {2024},\n    note = {File: US20240270019A1-20240815.XML}\n    }", "classification": "B60B2700FI"}, {"title": "RADIAL TIRE FOR AIRCRAFT", "doc_number": "20240270020", "filename": "US20240270020A1-20240815.XML", "abstract": "In a radial tire for aircraft according to this disclosure, in a tire widthwise cross-sectional view, in a reference state assembled onto an applicable rim, charged with a prescribed internal pressure, and unloaded, a rim width RW of the applicable rim and a tire maximum width W satisfy RW/W≤0.7, and in the tire widthwise cross-sectional view, in the reference state, a tread width TW and the tire maximum width W satisfy 0.73<TW/W<0.8.", "detailed_description": ["A radial tire for aircraft according to one of the disclosed embodiment will be described below with reference to the drawings. Members and portions common between the drawings have the same reference numerals.", "", "FIG.1is a tire width direction cross-sectional view when a radial tire for aircraft1(hereinafter, also referred to simply as the “tire1”) according to one of the embodiments is cut along a tire width direction. As illustrated inFIG.1, the tire1includes a pair of bead portions2, a pair of sidewall portions3extending to the outer sides in a tire radial direction of these bead portions2, and a tread portion4extending between these sidewall portions3. InFIG.1, the tire1is illustrated in a reference state where the tire1is assembled onto a rim R of a wheel, an applicable rim, charged with a prescribed internal pressure, and unloaded. Specifically, the bead portions2in the tire1are seated on a bead sheet R1of the rim R and supported from side surfaces by rim flanges R2. The following describes assuming that a lumen of the tire1is charged with air and the tire1is mounted on a vehicle such as an aircraft.", "", "In the present description, the “tire width direction” refers to a direction parallel to a rotation axis of the tire1. The “tire radial direction” refers to a direction orthogonal to the rotation axis of the tire1. The “tire circumferential direction” refers to a direction in which the tire rotates around the rotation axis of the tire1.", "", "In the present description, a side closer to the rotation axis of the tire1along the tire radial direction is referred to as an “inner side in the tire radial direction”, and a side farther from the rotation axis of the tire1along the tire radial direction is referred to as an “outer side in the tire radial direction”. On the other hand, a side closer to a tire equatorial plane CL along the tire width direction is referred to as an “inner side in the tire width direction”, and a side farther from the tire equatorial plane CL along the tire width direction is referred to as an “outer side in the tire width direction”.", "", "In the present description, it is considered that the positional relationship and the like of respective components of the tire1are measured in the reference state, unless otherwise noted. The “reference state” is a state where the tire1is assembled onto the rim R of the wheel, the applicable rim, charged with the prescribed internal pressure, and unloaded. Both ends in the tire width direction of a contact patch in contact with the road surface, in a state where the tire is mounted on a rim of the wheel, an applicable rim and the tire is charged with the prescribed internal pressure and loaded with the prescribed load, are referred to as ground contact edges E.", "", "In the present description, the “applicable rim” refers to an approved rim (Design Rim) in an applicable size that is described in the latest edition of AYB (AIRCRAFT YEAR BOOK) or the latest edition of EDI (Engineering Design Information for Aircraft Tires) (the 2017 edition is used for numerical descriptions in the present description) issued by TRA (The Tire and Rim Association, Inc.) in the United States, or will be described in AYB or EDI in the future. In cases of sizes not described in the above standards, the “applicable rim” refers to a rim applicable to the tire1.", "", "In the present description, the “prescribed internal pressure” refers to an air pressure (maximum air pressure) corresponding to the maximum load capability for a single wheel in the applicable size and ply rating described in the above standards. In cases of sizes not described in the above standards, the “prescribed internal pressure” refers to an air pressure (maximum air pressure) corresponding to the maximum load capability prescribed for each vehicle on which the tire1is mounted. Furthermore, in the present description, the “prescribed load” refers to a load corresponding to the maximum load capability for a single wheel in the applicable size and ply rating described in the above standards. In cases of sizes not described in the above standards, the “prescribed load” refers to a load corresponding to the maximum load capability prescribed for each vehicle on which the tire1is mounted.", "", "In the radial tire for aircraft1according to this embodiment, in the tire widthwise cross-sectional view in the reference state where the tire1is assembled onto the rim R of the wheel, the applicable rim, charged with the prescribed internal pressure, and unloaded, a rim width RW of the rim R and a tire maximum width W satisfy RW/W≤0.7.", "", "The tire1includes: a pair of bead cores5disposed on the bead portions2; a carcass6, which is composed of one or more plies, toroidally extending between the pair of bead cores5; and a belt7, which is composed of one or more belt layers, disposed on the outer side in the tire radial direction of the crown portion of the carcass6.", "", "The tire1further includes a stiffener rubber8and a rubber chafer9on the bead portion2, includes a side rubber10disposed on the outer side in the tire width direction of the carcass6on the sidewall portion3, and includes a tread rubber11disposed on the outer side in the tire radial direction of the belt7on the tread portion4.", "", "In this embodiment, the tire1is described as having a symmetrical configuration with respect to the tire equatorial plane CL. However, the tire1may have an asymmetric configuration with respect to the tire equatorial plane CL.", "", "In this embodiment, the bead core5is composed of an annular cable bead extending in the tire circumferential direction. The cross-sectional shape of a surface orthogonal to the extending direction of the bead core5(cross-sectional shape in the tire width direction) is circular or roughly circular. The cable bead is configured, for example, such that a high-carbon steel wire is coated with rubber.", "", "The carcass6is composed of one or more (in this embodiment, five) plies toroidally extending between the pair of bead cores5. The carcass6includes one or more (in this embodiment, three) turn-up plies6aand one or more (in this embodiment, two) down plies6b.The turn-up plies6aand the down plies6bare configured, for example, such that organic fiber cords such as nylon cords are coated with rubber. However, the carcass6may be configured not to have the turn-up plies6aor the down plies6b.", "", "The turn-up plies6aeach have a ply main body6aB toroidally extending between the bead cores5and ply windup portions6aT wound up from the inner side in the tire width direction to the outer side around the bead cores5. In this embodiment, respective end portions of the ply windup portions6aT of the turn-up plies6aare arranged at positions different from one another in the tire radial direction. Specifically, two of the ply windup portions6aT of the three turn-up plies6aterminate at the inner side in the tire radial direction with respect to the position of the tire maximum width W in the reference state. The remaining one of the ply windup portions6aT of the three turn-up plies6aterminates at the outer side in the tire width direction of a first stiffener rubber8a,which is described below. However, the ply windup portions6aT of the turn-up plies6amay be configured to be wound around the bead core5.", "", "The down plies6bcover the ply windup portions6aT of the turn-up plies6afrom the outer side in the tire width direction and extend to the inner side in the tire radial direction of the bead core5. In this embodiment, the down plies6bextend to and terminate at the inner side in the tire width direction with respect to a center5cof the bead core5. Respective end portions of the down plies6bare arranged at positions different from one another in the tire radial direction and the tire width direction.", "", "The stiffener rubber8is disposed on the outer side in the tire radial direction of the bead core5. In this embodiment, the stiffener rubber8includes the first stiffener rubber8a,a second stiffener rubber8b,and a sheet rubber8c.", "", "The first stiffener rubber8ais disposed in a region surrounded by the ply main body6aB and the ply windup portion6aT of the turn-up ply6aand the bead core5, on the outer side in the tire radial direction of the bead core5. In this embodiment, the first stiffener rubber8ahas a substantially triangular shape in which the width in the tire width direction is tapered from the inner side toward the outer side in the tire radial direction, in the tire widthwise cross-sectional view.", "", "The second stiffener rubber8bis disposed on the outer side in the tire width direction of the carcass6. In this embodiment, the second stiffener rubber8bextends in the tire radial direction, from the end portion located in the vicinity of the outer side in the tire width direction of the center5cof the bead core5, over the outer end in the tire radial direction of the first stiffener rubber8a,to the end portion located at the inner side in the tire radial direction with respect to the outer end in the tire radial direction of the ply windup portion6aT of the turn-up ply6a.In this embodiment, the second stiffener rubber8bhas a shape in which the width in the tire width direction is tapered from near the center toward the end portion in the tire radial direction of the second stiffener rubber8b,in the tire widthwise cross-sectional view. In this embodiment, the first stiffener rubber8aand the second stiffener rubber8bare formed of rubber materials different from one another but may be formed of an identical rubber material.", "", "The second stiffener rubber8bis disposed to cover at least one point on the outer edge in the tire width direction of the carcass6, indicated by a position P inFIG.1, from the outer side in the tire width direction.", "", "The position P is described with reference toFIG.2.FIG.2is a tire width direction cross-sectional view of the bead portion2in the radial tire for aircraft1. InFIG.2, the tire1in a state where the tire1is assembled onto the rim R of the wheel, the applicable rim, charged with the prescribed internal pressure, and loaded with the prescribed load is indicated by a solid line, while the tire1in the reference state is indicated by a dashed line. As illustrated inFIG.2, the rim flange R2rises up from the outer end in the tire width direction of the bead sheet R1and has a curved portion R2athat is convex to the outer side in the tire radial direction and a horizontal portion R2bextending from this curved portion R2ato the outer side in the tire width direction.", "", "The position P is a position where a virtual line extending from an outer end R2aE in the tire width direction of the curved portion R2aof the rim flange R2of the rim R to the outer side in the tire radial direction intersects with the outer edge in the tire width direction of the carcass6, in the tire widthwise cross-sectional view, in a state where the radial tire for aircraft1is assembled onto the rim R of the wheel, the applicable rim, charged with the prescribed internal pressure, and loaded with the prescribed load. The outer end R2aE in the tire width direction of the curved portion R2aof the rim flange R2can be specified as a boundary between the curved portion R2aand the horizontal portion R2bon the surface facing the tire1of the rim flange R2.", "", "The stress concentrates on the position P in a state where the tire1is assembled onto the rim R. Thus, in the present description, this position P is also referred to as a stress concentration position P of the carcass6. The carcass6is likely to have larger deformation and higher temperature in the vicinity of the stress concentration position P when the load of the aircraft is applied to the carcass6during takeoff and landing and taxiing of the aircraft. Therefore, fractures are likely to occur combined with large deformation and high temperature in the vicinity of the stress concentration position P of the carcass6. Covering the vicinity of the stress concentration position P of the carcass6with the second stiffener rubber8bcan decrease the stress applied to the carcass6. This causes fractures to be less likely to occur on the carcass6to improve the durability of the bead portion2.", "", "Furthermore, the second stiffener rubber8bis formed of a rubber material having low heat generating property with a loss coefficient tan δ lower than that of a first rubber chafer9a,which is described below, disposed on the outer side in the tire width direction of the second stiffener rubber8b,in the reference state. Disposing the second stiffener rubber8bwith a lower loss coefficient tan δ in the vicinity of the stress concentration position P of the carcass6can decrease the temperature in the vicinity of the carcass6. This causes fractures to be less likely to occur on the carcass6to improve the durability of the bead portion2. Each loss coefficient tan δ of the second stiffener rubber8band the first rubber chafer9ais measured using a spectrometer, for example, under conditions at room temperature, at 52 Hz, and with an amplitude distortion of 2%.", "", "With reference toFIG.1again, the sheet rubber8ccovers at least a part of the surface on the inner side in the tire width direction of the second stiffener rubber8b.That is, the second stiffener rubber8band the sheet rubber8care located as the stiffener rubber8on the outer side in the tire width direction of the carcass6. In the illustrated example, the sheet rubber8ccovers the whole surface on the inner side in the tire width direction of the second stiffener rubber8b.However, the sheet rubber8cmay be configured to cover a part of the surface on the inner side in the tire width direction of the second stiffener rubber8b.In this embodiment, the sheet rubber8cis formed of a rubber material with a rigidity larger than that of the second stiffener rubber8band smaller than that of the carcass6. This can cause the sheet rubber8cto decrease a difference in the level of rigidity between the second stiffener rubber8band the carcass6to mitigate the strain of the second stiffener rubber8bin a state where the tire1is assembled onto the rim R, in particular, a state where the tire1is charged with the internal pressure or a state where the tire1is loaded with the load. However, the stiffener rubber8disposed on the outer side in the tire width direction of the carcass6does not have to include the sheet rubber8c.", "", "The rubber chafer9is disposed to cover the carcass6and the stiffener rubber8from the inner side in the tire radial direction and the outer side in the tire width direction. In this embodiment, the rubber chafer9includes the first rubber chafer9aand a second rubber chafer9b.The first rubber chafer9ais disposed on the outer side in the tire width direction of the second stiffener rubber8b.", "", "The first rubber chafer9acovers at least a part (in this embodiment, a great part) of the second stiffener rubber8bfrom the outer side in the tire width direction and is sandwiched between the side rubber10and the second rubber chafer9bin the tire radial direction. In this embodiment, the first rubber chafer forms the outer surface of the tire1. The first rubber chafer9ais mainly in contact with the rim flange R2of the rim R in the reference state. The first rubber chafer9ais disposed to cover the outer side in the tire width direction of the second stiffener rubber8b,at least, at the outer side in the tire width direction of the stress concentration position P of the carcass6. Covering the second stiffener rubber8band the vicinity of the stress concentration position P of the carcass6with the first rubber chafer9acan decrease the stress applied to the carcass6.", "", "The second rubber chafer9bis located on the inner side in the tire radial direction of the first rubber chafer9a.Specifically, the second rubber chafer9bis disposed to be in contact with the first rubber chafer9afrom the inner side in the tire radial direction at the outer side in the tire width direction of the bead core5and cover the bead core5and the carcass6from the inner side in the tire radial direction. The second rubber chafer9bis mainly in contact with the bead sheet R1of the rim R in a state where the tire1is assembled onto the rim R. In this embodiment, the boundary in the tire radial direction between the first rubber chafer9aand the second rubber chafer9bis located in the vicinity of the outer side in the tire radial direction of the bead core5.", "", "The second rubber chafer9bis formed of a rubber material with a loss coefficient tan δ and a breaking strength higher than those of the first rubber chafer9a.This improves the durability of the rim back face portion, such as rim shifting friction and cracking durability, without deteriorating the air sealing property, weather resistance, fatigue resistance, and rim slip resistance of the tire1.", "", "Each breaking strength of the first rubber chafer9a,the second rubber chafer9b,and the side rubber10is measured, for example, according to JIS K6301. Each loss coefficient tan δ of the first rubber chafer9a,the second rubber chafer9b,and the side rubber10is measured using a spectrometer, for example, under conditions at room temperature, at 52 Hz, and with an amplitude distortion of 2%.", "", "In this embodiment, it is preferable that, in the radial tire for aircraft1, in the tire widthwise cross-sectional view, in the reference state, at the stress concentration position P of the carcass6, a thickness GW of the first rubber chafer9aand a thickness SW of the stiffener rubber8(i.e., in this embodiment, a thickness obtained by adding the thickness of the second stiffener rubber8bto the thickness of the sheet rubber8c) located on the outer side in the tire width direction of the carcass6, which are in a direction perpendicular to the outer edge in the tire width direction of the carcass6, satisfy 0.2≤GW/SW≤0.35. Decreasing GW/SW causes the heat from the first rubber chafer9alocated on the outer surface side of the tire1with respect to the second stiffener rubber8bto be less likely to be transferred to the vicinity of the stress concentration position P of the carcass6. On the other hand, increasing GW/SW improves the durability and wear resistance of the bead portion2. In particular, setting GW/SW to 0.2≤GW/SW≤0.35 can cause the heat from the first rubber chafer9alocated on the outer surface side of the tire1with respect to the second stiffener rubber8bto be less likely to be transferred to the vicinity of the stress concentration position P of the carcass6, while ensuring the durability of the bead portion2, thus causing the carcass6to be less likely to be broken.", "", "The belt7is disposed on the outer side in the tire radial direction in the crown region of the carcass6. In this embodiment, the belt7is provided to cover the carcass6at the tread portion4. However, the belt7may be provided over the tread portion4and a part of the sidewall portions3.", "", "The belt7is composed of one or more (in this embodiment, four) belt layers laminated in the tire radial direction on the tire equatorial plane CL. The belt7has one or more (in this embodiment, three) main belt layers (spiral belt layers)71and one or more (in this embodiment, one) sub belt layers (zigzag belt layers)72disposed on the outer side in the tire radial direction of the main belt layers71.", "", "First, the main belt layer71is described with reference toFIG.3.FIG.3is a schematic view of the main belt layer71in the radial tire for aircraft1viewed from the outer side in the tire radial direction. As illustrated inFIG.3, the main belt layer71, which is a spiral belt layer, is configured such that the strip member71bon which the belt cord71ais rubber-coated is spirally wound in the tire circumferential direction. The belt cord71ais, for example, an organic fiber cord such as Kevlar.", "", "The main belt layer71is formed on the crown portion of the carcass6in a raw tire, such that the strip member71bis spirally wound in the tire circumferential direction while being shifted by a predetermined amount in the tire width direction so as not to make a gap with the adjacent strip member71b. The inclination angle with respect to the tire circumferential direction of the belt cord71ais, for example, 5 degrees or less. That is, the main belt layer71is a belt layer including a belt cord inclined in a range of 0 degrees to 5 degrees with respect to the tire equatorial plane CL. Thus, winding the belt cord having high strength, such as Kevlar, with a small inclination with respect to the tire equatorial plane CL can achieve the wear resistance required for the tread portion4with the belt layer71having a fewer number of layers , thus ensuring weight saving of the tire1.", "", "When the main belt layer71is composed of a plurality of layers, the strip member71bis layered by being wound up to one tire widthwise edge71cof the main belt layer71and then folded back, subsequently wound as a next layer on the outer side in the tire radial direction to be wound toward the other tire widthwise edge71c.", "", "Next, the sub belt layer72is described with reference toFIG.4.FIG.4is a schematic view of the sub belt layer72in the radial tire for aircraft1viewed from the outer side in the tire radial direction. As illustrated inFIG.4, the sub belt layer72, which is a zigzag belt layer, is configured such that the strip member72bon which the belt cord72ais rubber-coated is repeatedly folded back at both tire widthwise edges72cto be wavily wound in the tire circumferential direction. The belt cord72ais, for example, an organic fiber cord of nylon.", "", "The sub belt layer72is formed such that the strip member72bon which the belt cord72ais rubber-coated is repeatedly extended from one tire widthwise edge72cin the tire width direction toward the other tire widthwise edge72c,folded back at the other tire widthwise edge72c,and extended from the other tire widthwise edge72ctoward the one tire widthwise edge72cto be wavily wound in the tire circumferential direction. The inclination angle with respect to the tire circumferential direction of the belt cord72ais, for example, 5 degrees to 23 degrees. That is, the sub belt layer72is a belt layer including a belt cord inclined in a range of 5 degrees to 23 degrees with respect to the tire equatorial plane CL.", "", "With reference toFIG.1again, in this embodiment, the length between both ends in the tire width direction of the main belt layer71is longer than the length between both ends in the tire width direction of the sub belt layer72. More specifically, the main belt layer71located at the most inner side in the tire radial direction of the one or more main belt layers71is the widest belt layer having the maximum width in the tire width direction. In the present description, the distance between both ends of the widest belt layer is referred to as a belt width BW. However, the widths of the belt layers included in the belt7are not limited to the above example, and any belt layer may have the maximum width in the tire width direction. In this embodiment, the outer ends in the tire width direction of the widest belt layer are located at the outer sides in the tire width direction with respect to the ground contact edges E. However, the outer ends in the tire width direction of the widest belt layer may be located at the inner sides in the tire width direction with respect to the ground contact edges E.", "", "The tire1may further include one or more (in this embodiment, one) belt reinforcement layers73that reinforce the belt7. The belt reinforcement layer73is disposed on the outer side in the tire radial direction of the belt7. The belt reinforcement layer73is formed such that a highly elastic organic fiber cord such as Kevlar is wavily wound in the tire circumferential direction. The tire1including the belt reinforcement layer73can protect the belt7from damage or reduce the damage of the belt7when a protruding object or the like intrudes inside the tire1from a tread surface. Such a belt reinforcement layer73is particularly effective in a tire for aircraft, which has large load and extremely high prescribed internal pressure. In this embodiment, the outer ends in the tire width direction of the belt reinforcement layer73are located at the inner sides in the tire width direction with respect to the ground contact edges E. However, the outer ends in the tire width direction of the belt reinforcement layer73may be located at the outer sides in the tire width direction with respect to the ground contact edges E.", "", "In the radial tire for aircraft1according to this embodiment, in the tire widthwise cross-sectional view in the reference state, a tread width TW and the tire maximum width W satisfy 0.73<TW/W<0.8.", "", "In the present description, the “tread width” refers to a distance between the ground contact edges E of the tire1in the tire widthwise cross-sectional view in the reference state. The ground contact edges E of the tire1are specified in a state where the tire1is assembled onto the rim R of the wheel, the applicable rim, charged with the prescribed internal pressure, and loaded with the prescribed load, as described above. The specified distance between the ground contact edges E of the tire1is measured in the reference state to derive the tread width TW.", "", "In the radial tire for aircraft1, the load is large, and the prescribed internal pressure is extremely high. Thus, the damage of the bead portion2due to the collapsing of the bead portion2is likely to occur compared with a normal passenger vehicle tire. Therefore, in the radial tire for aircraft1, setting the ratio TW/W of the tread width TW to the tire maximum width W into an appropriate range can reduce the collapsing of the bead portion2in the tire1and thus reduce the strain of the part in contact with the rim R of the bead portion2. Decreasing TW/W can cause the bead portion2to be less likely to collapse to improve the durability of the bead portion2. On the other hand, increasing TW/W can increase the contact patch with the road surface to improve the wear resistance of the tread portion4. In particular, setting the ratio of the tread width TW to the tire maximum width W to 0.73<TW/W<0.8 can improve the durability of the bead portion2while ensuring the wear resistance of the tread portion4, thus improving the durability of the tire1."], "claims": ["in a tire widthwise cross-sectional view, in a reference state assembled onto an applicable rim, charged with a prescribed internal pressure, and unloaded, a rim width RW of the applicable rim and a tire maximum width W satisfy RW/W≤0.7, and in the tire widthwise cross-sectional view, in the reference state, a tread width TW and the tire maximum width W satisfy 0.73<TW/W<0.8.", "a pair of bead cores; a carcass toroidally extending between the pair of bead cores; a stiffener rubber located on an outer side in a tire width direction of the carcass; and a first rubber chafer located on an outer side in the tire width direction of the stiffener rubber, wherein in the tire widthwise cross-sectional view, in a state where the radial tire for aircraft is assembled onto the applicable rim, charged with the prescribed internal pressure, and loaded with a prescribed load, when a position at which a virtual line extending outward in a tire radial direction from an outer end in the tire width direction of a curved portion in a rim flange of the applicable rim intersects with an outer edge in the tire width direction of the carcass is a stress concentration position of the carcass, in the tire widthwise cross-sectional view, in the reference state, at the stress concentration position of the carcass, a thickness GW of the first rubber chafer and a thickness SW of the stiffener rubber, which are in a direction perpendicular to the outer edge in the tire width direction of the carcass, satisfy 0.2≤GW/SW≤0.35.", "3 . The radial tire for aircraft according to claim 2 , wherein the stiffener rubber includes a sheet rubber covering at least a part of a surface on an inner side in the tire width direction.", "the second rubber chafer has a loss coefficient tan δ and a breaking strength higher than a loss coefficient tan δ and a breaking strength of the first rubber chafer.", "5 . The radial tire for aircraft according to claim 2 , wherein the stiffener rubber has a loss coefficient tan δ smaller than a loss coefficient tan δ of the first rubber chafer.", "the second rubber chafer has a loss coefficient tan δ and a breaking strength higher than a loss coefficient tan δ and a breaking strength of the first rubber chafer.", "7 . The radial tire for aircraft according to claim 3 , wherein the stiffener rubber has a loss coefficient tan δ smaller than a loss coefficient tan δ of the first rubber chafer.", "8 . The radial tire for aircraft according to claim 4 , wherein the stiffener rubber has a loss coefficient tan δ smaller than a loss coefficient tan δ of the first rubber chafer.", "9 . The radial tire for aircraft according to claim 6 , wherein the stiffener rubber has a loss coefficient tan δ smaller than a loss coefficient tan δ of the first rubber chafer."], "bibtex": "@patent{20240270020,\n    title = {RADIAL TIRE FOR AIRCRAFT},\n    number = {20240270020},\n    year = {2024},\n    note = {File: US20240270020A1-20240815.XML}\n    }", "classification": "B60C304FI"}]