[{"title": "DECORATIVE APPLIQUE WITH POLYMERIC OVER-COATING AND METHOD OF APPLYING SAME", "doc_number": "20240116309", "filename": "US20240116309A1-20240411.XML", "abstract": "A vehicle wheel is defined by a substrate including a face and a rim portion. The face defines a plurality of spokes extending radially outwardly between a central portion of the face and the rim portion and defining a mating portion. An applique is affixed to the wheel at the mating portion. A polymer over-coating that is substantially transparent extends over the applique and the wheel substrate defining a continuous polymer surface over the applique and the wheel substrate.", "detailed_description": ["Referring toFIG.1, a partial perspective view of a wheel of the present invention is generally shown at10. The wheel10includes a formed wheel substrate12defining a face13and a rim portion16. Spokes14extend between a central portion15of the face13and a bead17defined by the rim portion16that defines a periphery of the wheel10. A decorative applique18is adhered to one of the spokes14presenting, in this embodiment, the brand identifier shown “APPLIQUE”. It should be understood that the brand identifier shown inFIG.1is merely exemplary and may be replace by alternative identifiers or slogans, including but not limited to third party brands, wheel brands, customer brands, etc. In addition, the applique18may present a texture or patterns to the wheel that previously required complex tooling or machining to form into substrate12as will be explained further herein below.", "", "By way of example, the applique18is contemplated take many forms. In one embodiment, the applique18is a two dimensional decal presenting brand names, patterns, slogans, and any number of alternatives and combinations. In an alternative embodiment, the applique18is a three dimensional component that is painted, coated, chromed, or decorated in any manner that may be complementary to the wheel10or message being conveyed. The applique18is contemplated to include lettering or graphical features extending upwardly from a base for providing additional distinguishing characteristics. Additionally, the applique18is contemplated to include coloring that blends with a wheel10color or coloring that contrasts with the wheel10coloring. Additional distinguishing features are exhibited when the applique18is affixed to the wheel substrate12that presents an alloy background appearance to the applique18that will also be explained further hereinbelow.", "", "Referring now toFIG.2, a first embodiment shows the applique18affixed to the wheel10. A polymeric over-coating20is applied over the wheel10and the applique18presenting a continuous polymeric surface extending over both the wheel10and the applique18as disclosed hereinabove. The polymeric over-coating20, in one embodiment is a clear coating presenting a consistent or same gloss level to the applique18and the wheel10. In an alternative embodiment, the polymeric over-coating20is lightly pigmented or tinted uniformly providing depth or modified appearance to the wheel10and the applique18. In a still further alternative embodiment, the polymeric over-coating20includes opalescent pigmentation providing an even further color shifting esthetic enhancement to the applique18. Further, the polymeric over-coating includes any of a powder coating, an urethane, or any polymeric coating capable of providing desirable durability to the applique18(and the wheel10). The applique18is heat resistant to at least the temperature required to cure the polymeric over-coating20in an industrial paint bake oven. The polymeric over-coating20includes ultraviolet absorbers to deter breakdown of the polymer chains and provide further durability to the applique18by preventing ultraviolet degradation.", "", "It should be understood that alternative coating and curing techniques may be used to apply the clear coat or polymeric over-coat20over the applique18. As set forth above, one embodiment, the polymeric over-coat18is a powder coating. Alternatively, the clear coat20can be a one or two component urethane. After applying the polymeric over-coat20over the applique18and wheel10, the wheel10is subject to a curing step in a bake oven or the like. Therefore, the applique18is capable of withstanding curing temperatures of the polymeric over-coat20that could exceed 280° F. Alternatively, the curing temperature of the polymeric over-coat20is adjusted to accommodate lower thermal limits of the applique18.", "", "A primer or base polymeric coating22is applied to the wheel10prior to adhering the applique18to the wheel10. The base polymeric coating22provides durability to the wheel by improving adhesion of the polymeric over-coatings20and inhibits corrosion. An intermediate polymeric coating24providing a pigmented base color is applied over the primer or base polymeric coating22. Therefore, in this embodiment, the applique18is adhered to the intermediate polymeric coating24.", "", "In a further alternative embodiment, the polymeric over-coat20may be cured by way of exposure to infrared (IR) light to accommodate lower thermal limits of the applique18. IR curing techniques are sometimes used for “spot repairs” in automotive assembly plants. However, regular production IR curing has not previously been used for automotive components, such as, for example, vehicle wheels. IR curing provides the potential to apply the polymeric over-coat20over the entire wheel surface, or only locally over the applique18while “feathering” the IR cured coating into previously applied and cured over-coat20or the intermediate polymeric coating24onto which the applique18is placed.", "", "In a further embodiment, the wheel10may require additional cleaning and conversion after the applique18has been applied. In one embodiment, the applique18is applied to a mating portion21on a recessed surface26(as shown inFIG.11) that is spaced below an upper surface28. The upper surface28is subsequently turned, machined, or milled to expose or reconfigure the face13. In this embodiment, after turning, machining or milling, the wheel10is subsequently cleaned and provided a conversion coating in a known manner. Alternatively, the wheel10may be subject to a localized dry plasma conversion as disclosed in co-pending U.S. patent application Ser. Nos. 15/524,075 and 16/256,550, the contents of which are incorporated herein by reference. In either embodiment, the applique18is configured to withstand the additional processing without discernable degradation of appearance. It is contemplated by the inventors that subjecting the applique18to a conversion coating will also enhance adhesion of the polymeric over-coating20to the applique18. Following cleaning and conversion, the polymeric over-coating20, or equivalent is applied over the applique18as is described herein.", "", "The applique18, in one embodiment is a decal that is adhered to the wheel10with an adhesive30. In another embodiment, the applique18is plastic or composite presenting a three dimensional structure providing an appearance of depth to the applique18that also may be affixed to the wheel10with the adhesive30. A snap or locating pin (not shown) may be included on a backside of the applique18to provide additional retention or assist locating the applique18, if necessary. Alternatively, a template may be used to locate the applique, or backing paper or cover paper may be configured to locate the applique18and is subsequently removed after application. The adhesive30is selected for optimal adhesion to the one of the wheel substrate12or the intermediate polymeric coating24, whichever is selected for desired appearance.", "", "FIG.3shows an alternative embodiment where the applique18is adhered to the substrate12of the wheel10as is explained hereinabove. Prior to adhering the applique18to the wheel10, the wheel10surface is cleaned and treated with at least one of a dry conversion coating or conventional conversion coating to improve adhesion of the applique18and of the polymeric over-coating20upon application. In this embodiment, multiple polymeric over-coatings may be implemented. As in the first embodiment, a first polymeric-over-coating20ais applied over both the applique18and the wheel10presenting a continuous polymeric surface. A second polymeric over-coating20band a third polymeric over-coating20care sequentially applied. Each of the polymeric coatings20a,20b,20cmay be a clear, transparent coating or include differing levels of pigmentation, dye or tint to achieve different aesthetics or depth to the face13of the wheel10and to the applique18. Further, only two layers of polymeric over-coating20a,20bmay be applied over the applique18and the wheel10to provide differing levels of environmental protection, durability and aesthetics.", "", "FIG.4shows a still further alternative embodiment where the applique18is adhered to the substrate12of the wheel10and only the first polymeric over-coating20ais applied. The first polymeric coating20aagain presents a continuous polymeric surface of the applique18and the wheel10. The wheel10in this embodiment, and in other embodiments where the applique18is adhered to the substrate12, a previously applied polymeric coating may be mechanically removed prior to adhering the applique18. The machined surface, in this embodiment the upper surface28of the face13(FIG.1), is subject to cleaning and either dry conversion or conventional conversion coatings to improve adhesion of the applique10and the first polymeric coating.", "", "FIG.5shows a further embodiment of the invention of the present application that includes a PVD metalized layer32. As is known to those of skill in the art, PVD is a process for physical vapor deposition of metals and metal alloys on a wheel or polymeric coating of a wheel providing a metallic appearance. Therefore, this embodiment includes the applique18being adhered directly to the PVD metalized layer32by way of an adhesive30. As such, it may be desirable to modify the adhesive30used to adhered the applique18to the PVD metalized layer32from that which is used to adhere the applique18to a polymeric coating. Prior to applying the PVD metalized layer32, the base polymeric coating22is applied to the substrate12of the wheel10. The intermediate polymeric coating24is applied over the base polymeric coating22prior to the application of the PVD metalized layer32to achieved desired adhesion of the PVD metalized layer to the wheel10. Therefore, the base polymeric coating22, the intermediate polymeric coating24and the PVD metalized layer32are applied in sequential order between the applique18and the wheel substrate12.", "", "FIG.6shows a still further embodiment that includes a modified first polymeric over-coat20ais applied over the wheel10and a second polymeric over-coat20bis applied over the first polymeric over-coat20a. Therefore embodiment shown inFIG.6is a modification of the embodiment shown inFIG.5that includes two polymeric over-coats20a,20bto achieve additional distinguishing visual characteristics. The applique18is adhered via the adhesive30to the PVD metalized layer32that has been deposited over the intermediate polymeric coating24and the base polymeric coating22. The second polymeric over coat20bincludes colorization by way of pigmentation or tint while maintaining translucence or transparency so that the applique18is visible. Alternatively, the gloss level of the second polymeric over coat20bis modified to a mid, low level, or matted gloss level to provide even different aesthetics. In this embodiment, the first polymeric overcoat20aincludes no additional colorization and is substantially clear to illuminate the applique18.", "", "FIG.7shows a further embodiment including the third polymeric over-coat20cand a fourth polymeric over-coat20dthat are sequentially applied prior to the first polymeric over-coat20aand the second polymeric over-coat20bas set forth inFIG.6. The multiple layers of polymeric over-coat20a,20b,20cand20dachieve aesthetics provided in the embodiment shown inFIG.6including variants in gloss level, translucence, and colorization as explained hereinabove. However, in this embodiment, the applique18is applied via the adhesive30directly to the wheel substrate12. The wheel substrate12, in this embodiment may be machined to provide a “bright shiny” surface to provide an even different aesthetic to the multiple layers of polymeric over-coat20a,20b,20cand20dwhile these layers also provide enhanced durability to the wheel substrate12and the applique18.", "", "FIG.8shows a further embodiment where the applique18is adhered to the intermediate polymer coating24. As in earlier embodiments, the intermediate polymeric coating20is applied to the base polymeric coating22that is applied to the substrate12of the wheel10. The first polymeric over-coating20ais applied over the applique18and the intermediate polymeric coating24and the second polymeric over-coating20bis applied over the first polymeric over-coating20a. As such, the aesthetic surrounding the applique18is modified by the interaction between the first polymeric over-coating20aand the intermediate polymer coating28that may be pigmented with colored pigments or metallic flake to achieve unique reflective interaction with first and second polymeric over-coatings20a,20b.", "", "FIG.9shows a still further embodiment in which the applique18is applied via the adhesive30to the substrate12of the wheel over which the first polymeric over-coat20ais applied followed by application of the second polymeric over-coat20bthat may include high, mid or low gloss level, and includes pigmentation, dye or other colorant while allowing at least some level of transparency. Therefore, additional alternative aesthetics of the applique18and of the surface of the substrate12are further modified.", "", "It should be apparent to those of ordinary skill in the art after reading the disclosure set forth herein, that unique and distinguishing aesthetics are achievable through the applique18of the present invention and by modifying the sequence and types of polymeric coatings and PVD metallic layers. Applying polymeric coatings over the applique18to achieve a continuous and polymeric or substrate12of the wheel10provides not only unique opportunities for alternative aesthetics presenting, when desired, an appearance that the applique is part of the wheel substrate12, but also provides uniform and improved durability to the wheel10.", "", "FIG.10shows an alternative applique19presenting a textured surface to generate depth for a unique aesthetic appearance without a need for costly machining or tooling. While shown adhered to the mating portion21, the applique19can be placed on any wheel surface to achieve the unique aesthetic. Further, any type of the coating combinations shown inFIGS.2through9may be used to alter the appearance of the alternative applique19.", "", "Referring now toFIG.13, a process flow diagram shows the steps of one embodiment of manufacturing the wheel of the present invention that incorporates the decorative applique18. STEP100, the wheel enters an applique18install station. STEP200, the applique18is applied either to the wheel substrate12or previously applied polymer coatings22,28, or PVD coating as required of a desired wheel appearance. The applique18is applied either manually, for low volume production, or robotically, for high volume production. STEP300, the wheel exits the applique install station after the applique18has been adhered to the wheel either mechanically or by way of adhesive as described above. It should also be understood that the wheel is transferred between stations on a moving assembly line. Alternatively, the stations are modular and various methods of transfer are employed.", "", "Following exit from the applique install station, alternative processing may take place, depending upon the desired appearance of the wheel. In one embodiment, STEP600, the wheel is transferred to an extra processing cell where the wheel is subject to milling, machining, turning, or the like to reshape the wheel configuration or expose the substrate12after the applique18has been adhered. In this step, the applique is located in the mating portion21of the spoke14beneath the upper surface28to avoid being damage during the milling or turning operation. It should be understood that while the present application discloses in detail locating the applique18on a spoke14, the applique18could be located anywhere on the face portion15of the wheel, including but not limited to the central portion15. Further, the applique18could also be located on the bead17defined by the rim portion16. Following STEP600, the wheel necessarily requires cleaning and application of a conversion coating, which is achieved in a pretreatment cell identified in STEP700. Following the pretreatments cell, the wheel is transferred again to the clear polymeric over-coat cell identified as STEP400inFIG.13.", "", "In an alternative embodiment, following applique application performed in STEP300, the wheel is immediately transferred to the clear polymer coating cell identified as STEP400. In both embodiments, the clear polymeric over-coat20, as explained above, may include liquid or powder compositions or be formulated for infrared or heated curing. If the clear polymer coating requires heat curing, the wheel is transferred to bake oven identified as STEP500a. If the clear polymer coating requires infrared curing, the wheel is transferred to an infrared curing cell identified as STEP500b. After curing, the wheel is inspected and packed for shipping at STEP800. It should be understood that the assembly process is completely flexible and adapted to hand both heat curing wheels and infrared curing on the same assembly line by making use of various transfer conveyor technology. It should also be understood that the process steps could include a PVD metal application step in which the applique18is either adhered to the PVD metal, or the PVD metal coating is covered with a clear polymeric coating and the applique is adhered to the clear polymeric coating.", "", "Obviously, many modifications and variations of the present invention are possible in light of the above teachings. The foregoing invention has been described in accordance with the relevant legal standards; thus, the description is merely exemplary than limiting in nature. Variations and modifications to the disclosed embodiment may become apparent to those skilled in the art and do come within the scope of this invention. Accordingly, the scope of a legal protection afforded this invention can only be determined by studying the following claims."], "claims": ["forming a vehicle wheel having an alloy substrate; providing an applique including a decorative feature and adhering said applique to said vehicle wheel; applying a first transparent polymer coating over said applique and said vehicle wheel thereby forming a continuous polymer surface extending over said applique and said vehicle wheel.", "2 . The method set forth in claim 1 , wherein said step of applying a first transparent polymeric coating is further defined by presenting a same gloss level over said applique and said wheel.", "3 . The method set forth in claim 1 , wherein said step of applying a first transparent polymeric coating is further defined by said transparent polymeric coating being tinted.", "4 . The method set forth in claim 1 , further including a step of applying a primer polymeric coating over said alloy substrate prior to adhering said applique to said wheel thereby adhering the applique to said primer polymeric coating.", "5 . The method set forth in claim 4 , further including a step of removing the primer polymeric coating from said alloy substrate of said wheel beneath said applique prior to adhering said applique to said wheel thereby adhering said applique to said alloy substrate.", "6 . The method set forth in claim 4 , further including a step of applying an intermediate polymeric coating over said primer polymeric coating prior to adhering said applique to said wheel thereby adhering said applique to said intermediate polymeric coating.", "7 . The method set forth in claim 6 , further including a step of applying a second transparent polymeric coating over said first polymeric coating.", "8 . The method set forth in claim 7 , wherein said step of applying a second transparent polymeric coating over said first polymeric coating is further defined by coloring said second transparent polymeric coating.", "9 . The method set forth in claim 1 , further including a step of applying a metallic layer over said primer polymeric coating prior to adhering said applique to said wheel.", "10 . The method set forth in claim 1 , wherein said step of applying an applique to said wheel is further defined by applying a three dimensional applique to said wheel.", "11 . The method set forth in claim 1 , further including a step of providing cooperable locating features on at least one of said wheel and said applique for locating said applique on said wheel.", "12 . The method set forth in claim 7 , wherein said step applying a fourth polymeric coating is further defined by applying a fourth polymeric coating being at least one of tinted, pigmented, low gloss level, and mid gloss level.", "a wheel defined by a wheel substrate including a face and a rim portion, said central portion defining a plurality of spokes extending radially outwardly between a central portion of said face and said rim portion; said wheel defining a mating portion; an applique affixed to said wheel at said mating portion; a polymer over-coating being substantially transparent extending over said applique and said wheel substrate thereby defining a continuous polymer surface over said applique and said wheel substrate.", "14 . The vehicle wheel set forth in claim 13 , wherein said polymer over-coating provides a same gloss level over said applique and said wheel substrate.", "15 . The vehicle wheel set forth in claim 13 , wherein said polymer over-coating includes coloring.", "16 . The vehicle wheel set forth in claim 13 , wherein said polymer over-coating includes a plurality of polymer layers.", "17 . The vehicle wheel set forth in claim 13 , further including a primer polymer coating disposed being adhered to said wheel substrate beneath at least one of said applique and said polymer over-coating.", "18 . The vehicle wheel set forth in claim 17 , further including an intermediate coating disposed between said primer polymer coating beneath at least one of said applique and said polymer over-coating.", "19 . The vehicle wheel set forth in claim 17 , further including a metal layer disposed between said primer polymer layer and said at least one of said applique and said polymer over-coting.", "20 . The vehicle wheel set forth in claim 17 , wherein said wheel substrate is visible through said polymer over-coat.", "21 . The vehicle wheel set forth in claim 13 , wherein said applique is three dimensional.", "22 . The vehicle wheel set forth in claim 13 , wherein said applique is two dimensional."], "bibtex": "@patent{20240116309,\n    title = {DECORATIVE APPLIQUE WITH POLYMERIC OVER-COATING AND METHOD OF APPLYING SAME},\n    number = {20240116309},\n    year = {2024},\n    note = {File: US20240116309A1-20240411.XML}\n    }", "classification": "B60B700FI"}, {"title": "Trochoid, Polar or Conic Section Spoke for Wheels", "doc_number": "20240116310", "filename": "US20240116310A1-20240411.XML", "abstract": "The invention is for a single spoke for an entire wheel that connects the hub to the rim in the shape of a trochoid graph, polar graph, or series of connected conic sections. It is impossible to determine where the spoke begins or terminates as it's one continuous piece of material.", "detailed_description": ["The key to this new design in the spoke is to identify curves that are rotationally symmetrical to the origin of a circle, meet the hub and/or rim in the shape of an arc, and begin where they end. These graphs include Polar roses, hypotrochoids, epitrochoids, amongst other geometric roulettes. Polar graphs in the form r=a sin nθ and r=a cos nθ are called roses. In these equations, the value of a, controls the size. Negative values of a give the same graph as the positive values of a except they are reflected through the origin. The value of n determines the number of petals. For both equations, when n is odd n equals the number of petals, and when n is even the number of petals equals 2n, given n is a natural number. As the value of a, the amplitude in the trigonometric functions, increased, the distance between the peak and trough of the sine and cosine graphs increased, in essence creating taller waves. In a similar way, as the value of a in the roses increased, so did the length of the petals. Therefor a would be equal to the radius of the rim. The value of n in the roses is positioned in the same way as the frequency in the trigonometric graphs, the b value. Quintessentially, increasing the frequency in the trigonometric function increases the number of waves in the same interval, just like increasing the value of n in the roses increases the quantity of petals."], "claims": ["1 . The trochoid, polar or conic spoke can absorb and distribute forces from bumps, potholes, and other irregularities in the road more efficiently than previously designed spokes.", "2 . The trochoid, polar or conic spoke can use less materials for the same strength, thus making the wheel less expensive to produce and any vehicle using this spoke would require less energy to propel the vehicle and less stopping distance due to inertia than previously designed spokes.", "3 . A rim made with the trochoid, polar or conic spoke would take less time to manufacture, because one could make a rim with a single spoke.", "4 . The trochoid, polar or conic spoke creates infinitely more opportunities for creative variations in design than previously designed spokes.", "5 . The trochoid, polar or conic spoke creates infinitely more opportunities for uses than previously designed spokes because one could increase strength by increases the thickness of the material, and/or the number of petals in the spoke.", "6 . The trochoid, polar or conic spoke creates more plains of resistance than previously designed spokes, thus allowing any vehicle using it to corner or handle better than a vehicle with previously designed spokes.", "7 . The trochoid, polar or conic spoke utilizes the same hubs and rims as previously designed spokes and can be placed in service without modifying current rims and hubs unless the user wants to.", "8 . Especially in the case of the Hypotrochoid spoke, the spoke is positioned in the same direction as centripetal force instead of perpendicular to the centripetal force, thus making the transfer of energy more efficient and the strain on the spoke less.", "9 . The trochoid, polar or conic spoke can be made with unidirectional carbon fiber because its natural shape achieves 360 degrees of strength. The advantage being unidirectional carbon fiber is less expensive and easier to work with than multidirectional carbon fiber.", "10 . The trochoid, polar or conic spoke can be made with any of the modern or traditional materials, as it's the shape that's the improvement. Some materials would better take advantage of the design than others, but that would depend largely upon the use.", "11 . Since there are an infinite number of values that could be placed into variables for the trochoid, polar or conic spoke, such as size of wheel, speed, weight, g-forces, number of wheels, and working conditions, it is impossible to show which design is best for which purpose. Testing would have to be performed on many designs before the user would find the optimal choice for the spoke.", "12 . The end user of the trochoid, polar or conic spoke may choose to employ more than one trochoid, polar or conic spoke in a wheel for a myriad of reasons including but not limited to strength, safety, aesthetic etc. The benefits of the design would still be realized regardless of the number of the trochoid, polar or conic spokes used on a wheel."], "bibtex": "@patent{20240116310,\n    title = {Trochoid, Polar or Conic Section Spoke for Wheels},\n    number = {20240116310},\n    year = {2024},\n    note = {File: US20240116310A1-20240411.XML}\n    }", "classification": "B60B926FI"}, {"title": "Caster with a Circularly Positioning Structure", "doc_number": "20240116311", "filename": "US20240116311A1-20240411.XML", "abstract": "For a caster with a circularly positioning structure, stepping on the pedal can drive the driving rod and the driving piece to rotate, so that the positioning pin of the driving piece cyclically proceeds the first positioning point, the second positioning point and the path point of the positioning member, thereby driving the cam unit to push against the shaft to let the positioning piece and the orienting hole to be engaged or disengaged from each other, and let the locking end of the locking member to be engaged in or disengaged from the locking groove. In this way, the caster can selectively be locked to stop rotation, and be released to freely rotate.", "detailed_description": ["Please refer toFIGS.1-10, the present invention according to an embodiment is a caster with a circularly positioning structure, and the caster essentially includes a driving assembly10, a positioning member20, an elastic member30, a cam unit40, a shaft50, an orienting unit60and a caster assembly70.", "", "The driving assembly10includes a bracket11, a driving rod12pivotally connected to the bracket11, and a driving piece13fixed on the driving rod12. The driving piece13includes a protruding portion131and a positioning pin132disposed on the protruding portion131, and preferably, the positioning pin132is slightly protruding from the driving piece13, wherein the extension direction of the bracket11and the driving rod12is defined as a transverse direction Y.", "", "The positioning member20is pivotally connected to the bracket11through a pivot rod21. The positioning member20includes a first end20A and a second end20B opposite to the first end20A, and an extension direction between the first end20A and the second end20B is defined as a height direction Z which is perpendicular to the transverse direction Y. The first end20A is pivotally connected to the bracket11, the positioning member20includes a pivoting portion22, the pivoting portion22is pivotally connected to the bracket11through the pivot rod21, and the first end20A is located at the pivoting portion22. The positioning member20further includes a first positioning portion23, and the first positioning portion23is connected to a side of the pivoting portion22that is closer to the driving rod12. The first positioning portion23extends along a longitudinal direction X, and the longitudinal direction X is perpendicular to the transverse direction Y, so that the first positioning portion23extends toward the driving rod12. The periphery of the positioning member20includes a first positioning point P1located between a side of the first positioning portion23that is closer to the pivot rod21, and a side of the pivoting portion22that is closer to the driving rod12. The positioning member20further includes a second positioning portion24connected to the first positioning portion23and the pivoting portion22, and the periphery of the positioning member20further includes a second positioning point P2located between the second positioning portion24and the first positioning portion23. Please refer toFIG.7B, the second positioning portion24includes a guiding slope241inclined toward the bracket11. The positioning member20further includes a third positioning portion25, and the third positioning portion25is connected to the pivoting portion22along the height direction Z. The second end20B is located at the third positioning portion25, the third positioning portion25is also connected to the second positioning portion24, and the periphery of the positioning member20further includes a path point P3located between the third positioning portion25and the second positioning portion24.", "", "In this or other embodiments, a guide arc surface231is formed on a side of the first positioning portion23closer to the pivot rod21, and the guide arc surface231is adjacent to the first positioning point P1.", "", "The elastic member30is sleeved on the pivot rod21, one of two opposite ends of the elastic member30is fixed to the bracket11, and the other one of the two opposite ends of the elastic member30is fixed to the positioning member20. In this embodiment, the elastic member30is a torsion spring, and two opposite ends of the torsion spring are respectively fixed on the positioning member20and the bracket11, so the positioning member20can be pulled toward the driving rod12through the elasticity of the torsion spring. However, the present invention is not limited to such a type of the elastic member30.", "", "Please refer toFIGS.9and10, the cam unit40includes a cam41fixed to the driving rod12, the cam41includes a first positioning portion411and a second positioning portion412both recessed from an edge thereof, the first positioning portion411includes a first bottom surface4111, the second positioning portion412includes a second bottom surface4121, and a distance between the first bottom surface4111and the driving rod12is greater than a distance between the second bottom surface4121and the driving rod12. The cam unit40further includes an abutting member42continuously abutting against the cam41.", "", "One of two opposite ends of the shaft50is connected to the abutting member42, and is defined as a first end51, and the other one of the two opposite ends of the shaft50is a second end52.", "", "The orienting unit60includes an orienting member61sleeved and fixed on the shaft50, and a positioning piece62sleeved on the shaft50and movable with the shaft50. The orienting member61includes an orienting hole611for insertion of the shaft50, and the positioning piece62includes a clamping portion621protruding from the peripheral edge thereof and configured to engage with the orienting hole611.", "", "The caster assembly70is connected to the driving assembly10. In this embodiment, the caster assembly70includes a wheel71for rolling on the ground, the wheel71includes a locking gear72on an inner side thereof, and the locking gear72is approximately circular and includes a plurality of locking grooves721on an outer peripheral edge thereof.", "", "A locking member80is approximately a sheet member and pivotally installed to the caster assembly70. The locking member80includes an butting end81and a locking end82opposite to the butting end81, the second end52of the shaft50is abutted against the abutting end81, and the locking end82is provided for being locked in one of the locking grooves721, so as to stop the wheel71. When the locking end82is disengaged from the locking groove721, the wheel71is in a rollable state.", "", "In this embodiment, please refer toFIG.1, the driving assembly10further includes a treadable structure14disposed on the driving rod12, and the treadable structure14includes two side plates141fixed to the driving rod12, and a pedal142connected to the two side plates141. Stepping on the pedal142can enable the rotation of the driving rod12.", "", "Moreover, the driving assembly10further includes a compression spring15extending along the longitudinal direction X, one of two opposite ends of the compression spring15is fixed to the driving piece13, and the other one of the two opposite ends of the compression spring15is fixed to the bracket11. The driving piece13is pulled by the compression spring15, so that after the treadable structure14is trodden on and then released, the compression spring15can drive the driving piece13to return its original position.", "", "Furthermore, the cross-section of the driving rod12is a polygon, and the driving piece13includes a polygonal hole133. The driving piece13is sleeved on the driving rod12through the polygonal hole133, so that the driving piece13is fixed to the driving rod12and is drivable by the driving rod12in rotation.", "", "The positioning member20further includes a hook portion26connected to the third positioning portion25, and the hook portion26includes a hook surface261facing the driving rod12. Between the hook portion26and the first positioning portion23is formed a gap27, and the hook surface261is inclined toward the gap27. When the user steps on the pedal142to enable the positioning pin132to shift along the guide arc surface231to abut against the hook surface261, the positioning pin132will be guided by the hook surface261to fall into the gap27, so that the positioning pin132will be positioned at the second positioning point P2.", "", "The above description exemplarily explains the structural configuration and the connection relationship of the present invention. The way of use and the technical effects of the present invention can produce as follows.", "", "Please refer toFIG.3, in the released state, the wheel71is able to rotate freely, and the positioning pin132is located at the first positioning point P1and abuts against the first positioning portion23. Please refer toFIG.9, the abutting member42is abutted against the second bottom surface4121, and because the distance between the first bottom surface4111and the driving rod12is greater than the distance between the second bottom surface4121and the driving rod12, the abutting member42is closer to the driving rod12. Moreover, the positioning piece62is disengaged from the orienting hole611. Since the positioning piece62is not restricted by the orienting hole611, the caster assembly70can rotate freely. Furthermore, the locking end82is also not locked in the locking grooves721, so the wheel71can move freely.", "", "Please refer toFIGS.3and4, when the user steps on the pedal142, the driving rod12is driven to rotate through the pedal142, and the driving piece13is driven to rotate by the driving rod12, so that the positioning pin132moves from the first positioning point P1along the guide arc surface231toward the gap27while abutting against the guide arc surface231. Since the positioning pin132is slightly protruded from the driving piece13, the positioning pin132moving along the guide arc surface231pushes the positioning member20to pivot on the pivot rod21toward the longitudinal direction X. when the positioning pin132moves from the guide arc surface231to the hook surface261, and the positioning pin132abuts against the hook surface261. After the user releases the pedal142, please refer toFIG.5, the positioning pin132is guided by the hook surface261and falls into the gap27and then is positioned at the second positioning point P2since the first positioning portion23is driven by the elastic member30to rotate towards the driving rod12.", "", "Please refer toFIG.10, since the cam41is driven to rotate, the first bottom surface4111of the cam41abuts against the abutting member42and the distance between the first bottom surface4111and the driving rod12is greater than the distance between the second bottom surface4121and the driving rod12, the abutting member42is pushed to drive the shaft50to move in a direction away from the driving rod12, so as to drive the positioning piece62to fall into the orienting hole611. Because the positioning piece62is restricted by the orienting hole611and cannot rotate in circumferential direction, the shaft50fixed to the positioning piece62cannot rotate in the circumferential direction either, whereby the caster assembly70cannot be rotated arbitrarily. At this time, the locking end82is also locked in the locking grooves721, so the wheel71is in the stationary state.", "", "Please refer toFIGS.6,7A and7B. When the user steps on the pedal142again, the positioning pin132leaves the second positioning point P2and abuts against the third positioning portion25. Then, after the user releases the pedal142, the driving piece13is rotated due to the pulling of the compression spring15so that the positioning pin132is moved to the path point P3.", "", "Please refer toFIGS.8A and8B, when the positioning pin132located at the path point P3is guided by the guiding slope241to push the positioning member20to swing outward along the transverse direction Y to compress the elastic member30, the compression spring15pulls the driving piece13to pivot and return to its original position, so that the positioning pin132returns to the first positioning point P1. In this way, the caster assembly70is returned to a freely movable and rotatable state."], "claims": ["a driving assembly including a driving rod pivotally connected to a bracket, and a driving piece fixed on the driving rod, and the driving piece including a protruding portion and a positioning pin disposed on the protruding portion; a positioning member including: a pivoting portion pivotally connected to the bracket through a pivot rod; a first positioning portion protruding toward the driving piece; a second positioning portion connected to the first positioning portion and the pivoting portion, and the second positioning portion including a guiding slope inclined toward the bracket; and a third positioning portion that is connected to the pivoting portion and the second positioning portion, wherein periphery of the positioning member includes a first positioning point located between a side of the first positioning portion that is closer to the pivot rod, and a side of the pivoting portion, a second positioning point located between the second positioning portion and the first positioning portion, and a path point located between the third positioning portion and the second positioning portion; an elastic member sleeved on the pivot rod, one of two opposite ends of the elastic member being fixed to the bracket, and the other one of the two opposite ends of the elastic member being fixed to the positioning member; a cam unit including a cam fixed to the driving rod, the cam including a first positioning portion and a second positioning portion recessed from an edge thereof, the first positioning portion including a first bottom surface, and the second positioning portion including a second bottom surface, wherein a distance between the first bottom surface and the driving rod is greater than a distance between the second bottom surface and the driving rod, and the cam unit further includes an abutting member continuously abutting against the cam; a shaft connected to the abutting member; an orienting unit including an orienting member sleeved on and fixed to the shaft, and a positioning piece sleeved on the shaft and movable with the shaft, the orienting member including an orienting hole for insertion of the shaft, and the orienting piece including a clamping portion protruding from a peripheral edge thereof; and a caster assembly fixed to the driving assembly.", "2 . The caster with the circularly positioning structure as claimed in claim 1 , wherein the elastic member is a torsion spring.", "3 . The caster with the circularly positioning structure as claimed in claim 1 , wherein the caster assembly includes a wheel for rolling on the ground.", "4 . The caster with the circularly positioning structure as claimed in claim 1 , wherein the driving assembly further includes a treadable structure disposed on the driving rod, the treadable structure includes two side plates fixed to the driving rod, and a pedal connected to the two side plates.", "5 . The caster with the circularly positioning structure as claimed in claim 1 , wherein the driving assembly further includes a compression spring, one of two opposite ends of the compression spring is fixed to the driving piece, and the other one of the two opposite ends of the compression spring is fixed to the bracket.", "6 . The caster with the circularly positioning structure as claimed in claim 1 , wherein the driving rod has a polygon cross section, the driving piece includes a polygonal hole, and the driving piece is sleeved on the driving rod through the polygonal hole.", "7 . The caster with the circularly positioning structure as claimed in claim 1 , wherein the positioning member further includes a hook portion connected to the third positioning portion, the hook portion includes a hook surface facing the driving rod, a gap is formed between the hook portion and the first positioning portion, and the hook surface is inclined toward the gap."], "bibtex": "@patent{20240116311,\n    title = {Caster with a Circularly Positioning Structure},\n    number = {20240116311},\n    year = {2024},\n    note = {File: US20240116311A1-20240411.XML}\n    }", "classification": "B60B3300FI"}, {"title": "Spring Seat Body for a Rigid Axle of a Motor Vehicle and Rigid Axle for a Motor Vehicle With a Spring Seat Body", "doc_number": "20240116312", "filename": "US20240116312A1-20240411.XML", "abstract": "A spring seat body for connection to a rigid axle of a motor vehicle, including an upper spring seat surface, a lower seat surface, lateral edge surfaces which lie between the spring seat surface and the lower seat surface, and holding means for holding tensioning means for fastening at least one spring to the spring seat body. The lateral edge surfaces include a first edge surface and a second edge surface which face away from one another and, in the mounted state of the spring seat body on the rigid axle, run transversely with respect to the rigid axle, the first edge surface, in the mounted state of the spring seat body on the rigid axle, lying closer to an end of the rigid axle which bears a vehicle wheel than the second edge surface, and the first edge surface having an edge course which, in the mounted state of the spring seat body on the rigid axle, lies in overlap with the rigid axle. In order for the spring seat body to offer improved robustness, in particular increased fatigue strength in its connection to a generic rigid axle and thereby enable a reduction in the overall weight of the rigid axle, the invention provides that said edge course, viewed from above, is at least partially formed as an outwardly projecting, preferably convex edge course, the apex or vertex lies in a region of the first edge surface which runs along a central length range of the upper spring seat surface running transversely to the rigid axle, said central length range being less than one third, preferably less than one quarter, particularly preferably less than one fifth of the length of the upper spring seat surface. In particular, the invention relates to a rigid axle for a motor vehicle, in particular a utility vehicle, with such a spring seat body.", "detailed_description": [""], "claims": ["an upper spring seat surface, a lower seat surface, lateral edge surfaces located between the spring seat surface and the lower seat surface, and holding means for holding tensioning means for fastening at least one spring to the spring seat body, said lateral edge surfaces comprising a first edge surface and a second edge surface facing away from each other and extending transversely to said rigid axle when said spring seat body is mounted on said rigid axle, wherein the first edge surface is closer to an end of the rigid axle carrying a vehicle wheel than the second edge surface when the spring seat body is mounted on the rigid axle, and the first edge surface having an edge course which, in the mounted state of the spring seat body on the rigid axle, lies in overlap on the rigid axle, wherein said edge course, viewed from above, is at least partially formed as an outwardly projecting, preferably convex edge course, the apex or vertex of which lies in a region of the first edge surface which runs along a central length range of the upper spring seat surface extending transversely to the rigid axle, wherein said central length range being less than one third, preferably less than one quarter, more preferably less than one fifth of the length of the upper spring seat surface.", "2 ) The spring seat body according to claim 1 , wherein the second edge surface having an edge course which, in the mounted state of the spring seat body on the rigid axle, lies in overlap on the rigid axle, wherein this edge course, viewed from above, is at least partially formed as an outwardly projecting, preferably convex edge course, the apex or vertex of which lies in a region of the first edge surface which runs along a central length range of the upper spring seat surface extending transversely to the rigid axle, wherein said central length range being less than one third, preferably less than one quarter, more preferably less than one fifth of the length of the upper spring seat surface.", "3 ) The spring seat body according to claim 1 , wherein the spring seat body is carried-out as a forged part, preferably as a forged steel part.", "4 ) The spring seat body according to claim 1 , wherein the first edge surface and/or the second edge surface each has/have a fillet-shaped, preferably concave edge course along its sections that do not overlap with the rigid axle when viewed from above.", "5 ) The spring seat body according to claim 1 , wherein in that the outwardly projecting, preferably convex edge course does not project beyond a tangent which touches the sections of the first or second edge surface which are not in overlap with the rigid axle.", "6 ) The spring seat body according to claim 1 , wherein at least one recess is formed in the lower seating surface, which recess opens out at said edge course of the first edge surface, preferably opens out substantially centrally at said edge course of the first edge surface.", "7 ) The spring seat body according to claim 1 , wherein the spring seat surface and the holding means are designed to hold tensioning means for fastening at least one leaf spring.", "8 ) A rigid axle for a motor vehicle, with at least one spring seat body according to claim 1 .", "9 ) The rigid axle according to claim 8 , wherein the spring seat body is connected to the rigid axle by a substance-to-substance connection.", "10 ) The rigid axle according to claim 8 , wherein the rigid axle has a flattened or substantially flat connecting surface or outer side at which the spring seat body is connected to the rigid axle.", "11 ) The rigid axle according to claim 8 , wherein the rigid axle has, in its region where the spring seat body is connected to the rigid axle, a cross-sectional profile comprising at least two mutually parallel outer sides, preferably two pairs of mutually parallel outer sides.", "12 ) The rigid axle according to claim 8 , wherein the spring seat body is welded to the rigid axle by forming one or more weld seams at least partially along the outwardly projecting, preferably convex edge course of the first edge surface and/or at least partially along the outwardly projecting, preferably convex edge course of the second edge surface.", "13 ) The rigid axle according to claim 8 , wherein the rigid axle is designed as a non-driven rigid axle, the rigid axle preferably being formed from an axle tube.", "14 ) The rigid axle according to claim 8 , wherein wheel carriers are attached to the ends of the rigid axle, each wheel carrier being supported on the rigid axle by means of a strut, preferably a substantially triangular hollow body strut, the strut being arranged on the same side as the respective spring seat body on the rigid axle at a distance from the spring seat body.", "15 ) The rigid axle according to claim 14 , wherein the strut is welded to the respective wheel carrier and a main beam of the rigid axle."], "bibtex": "@patent{20240116312,\n    title = {Spring Seat Body for a Rigid Axle of a Motor Vehicle and Rigid Axle for a Motor Vehicle With a Spring Seat Body},\n    number = {20240116312},\n    year = {2024},\n    note = {File: US20240116312A1-20240411.XML}\n    }", "classification": "B60B3500FI"}, {"title": "TIRE ASSEMBLY WITH CIRCUMFERENTIAL SHAPE MEMORY ALLOY CONFIGURATION", "doc_number": "20240116313", "filename": "US20240116313A1-20240411.XML", "abstract": "A tire assembly that includes a tread portion, a rim, and at least a first band assembly positioned between the tread portion and the rim. The first band assembly includes a first SMA element having an outer surface and a first bead member having an outer surface. The first SMA element extends circumferentially about the tire assembly and the first bead member extends circumferentially about the tire assembly. The first band assembly also includes a plurality of fiber reinforcement members. Each of the plurality of fiber reinforcement members extend around the outer surface of the first SMA element and the outer surface of the first bead member to form the first band assembly.", "detailed_description": ["The following description and drawings are illustrative and are not to be construed as limiting. Numerous specific details are described to provide a thorough understanding of the disclosure. However, in certain instances, well-known or conventional details are not described in order to avoid obscuring the description. References to one or an embodiment in the present disclosure can be, but not necessarily are references to the same embodiment; and, such references mean at least one of the embodiments. If a component is not shown in a drawing then this provides support for a negative limitation in the claims stating that that component is “not” present. However, the above statement is not limiting and in another embodiment, the missing component can be included in a claimed embodiment.", "", "Reference in this specification to “one embodiment,” “an embodiment,” “a preferred embodiment” or any other phrase mentioning the word “embodiment” means that a particular feature, structure, or characteristic described in connection with the embodiment is included in at least one embodiment of the-disclosure and also means that any particular feature, structure, or characteristic described in connection with one embodiment can be included in any embodiment or can be omitted or excluded from any embodiment. The appearances of the phrase “in one embodiment” in various places in the specification are not necessarily all referring to the same embodiment, nor are separate or alternative embodiments mutually exclusive of other embodiments. Moreover, various features are described which may be exhibited by some embodiments and not by others and may be omitted from any embodiment. Furthermore, any particular feature, structure, or characteristic described herein may be optional. Similarly, various requirements are described which may be requirements for some embodiments but not other embodiments. Where appropriate any of the features discussed herein in relation to one aspect or embodiment of the invention may be applied to another aspect or embodiment of the invention. Similarly, where appropriate any of the features discussed herein in relation to one aspect or embodiment of the invention may be optional with respect to and/or omitted from that aspect or embodiment of the invention or any other aspect or embodiment of the invention discussed or disclosed herein.", "", "The terms used in this specification generally have their ordinary meanings in the art, within the context of the disclosure, and in the specific context where each term is used. Certain terms that are used to describe the disclosure are discussed below, or elsewhere in the specification, to provide additional guidance to the practitioner regarding the description of the disclosure. For convenience, certain terms may be highlighted, for example using italics and/or quotation marks: The use of highlighting has no influence on the scope and meaning of a term; the scope and meaning of a term is the same, in the same context, whether or not it is highlighted.", "", "It will be appreciated that the same thing can be said in more than one way. Consequently, alternative language and synonyms may be used for any one or more of the terms discussed herein. No special significance is to be placed upon whether or not a term is elaborated or discussed herein. Synonyms for certain terms are provided. A recital of one or more synonyms does not exclude the use of other synonyms. The use of examples anywhere in this specification including examples of any terms discussed herein is illustrative only, and is not intended to further limit the scope and meaning of the disclosure or of any exemplified term. Likewise, the disclosure is not limited to various embodiments given in this specification.", "", "Without intent to further limit the scope of the disclosure, examples of instruments, apparatus, methods and their related results according to the embodiments of the present disclosure are given below. Note that titles or subtitles may be used in the examples for convenience of a reader, which in no way should limit the scope of the disclosure. Unless otherwise defined, all technical and scientific terms used herein have the same meaning as commonly understood by one of ordinary skill in the art to which this disclosure pertains. In the case of conflict, the present document, including definitions, will control.", "", "It will be appreciated that terms such as “front,” “back,” “top,” “bottom,” “side,” “short,” “long,” “up,” “down,” “aft,” “forward” and “below” used herein are merely for ease of description and refer to the orientation of the components as shown in the figures. It should be understood that any orientation of the components described herein is within the scope of the present invention.", "", "The figures are generally directed to a tire assembly10. In some embodiments, the tire assembly10may instead be characterized as an SMA assembly that may be used for other purposes where air or pneumatic pressure would otherwise be used within a polymer structure. Since the tire assembly10is functional without air or pneumatic pressure, use of the tire assembly10is advantageous in rugged terrain where conventional tires are prone to flats and environments where air is lacking or not present (e.g., space, other planets, moons, etc.). In addition to enhanced durability, the tire assembly10advantageously provides lower rolling resistance than pneumatic tires, which contribute to greater fuel efficiency in vehicles. The use of the SMA assembly as the tire assembly10is only exemplary and is not a limitation on the present invention. In a preferred embodiment, the SMA tire assembly10generally includes a toroidal SMA structure12encapsulated in a polymer member or structure14(such as polyurethane) and then bonded to a polymer outer tread16. It will be appreciated that the SMA structure12may be other enclosed or unenclosed shapes, such as tubular, spherical, helical etc.", "", "FIG.1is a perspective view of the tire assembly10. The tire assembly10may be shaped and sized for various use including but not limited to automobiles, bicycles, aircraft, motorcycles, and, scooters. The tire assembly10may have a recessed or indented inner surface11. The recess or indentation of the inner surface11may allow the tire assembly10to be mated with a wheel or a rim18to then be attached to a vehicle. The tire assembly10may include the SMA structure12and the polymer member14. The SMA structure12is shown inFIG.1as a spring toroid encased with a polymer (e.g., rubber) outer tread16to form an airless tire. The", "", "The SMA structure12may include SMA elements. The SMA elements may collectively form the SMA structure. In some examples, the SMA elements may be uniform in size, shape, and/or material properties. In some examples, the SMA elements may be different than each other in size, shape, and/or material properties. For example, an SMA element may be a wire, a spring, a sheet, a fiber, foam, and/or the like. The SMA element may include one or more of NiTi, Ag—Cd, Au—Cd, Cu—Al—Ni, Cu—Sn, Cu—Zn, Fe—Pt, Mn—Cu, Fe—Mn—Si, Co—Ni—Al, Co—Ni—Ga, Ni—Fe—Ga, Ti—Nb, β-Ti alloys, or ternary alloys or quaternary alloys of a material of the SMA element. The SMA elements may be attached together to form the SMA structure12. For example, the SMA elements may be interwoven with each other.", "", "The polymer outer tread16may be disposed over the SMA structure12. The polymer outer tread16may enclose an outer surface13of the SMA structure12. The polymer outer tread16may be rubber and/or another material having similar properties to rubber. The polymer outer tread16may have protrusions, bumps, threads, grooves, channels, cavities, and/or the like to provide additional grip.", "", "FIG.2is a sectional view of the SMA structure12. The SMA structure12includes a first spring20and a second spring22.FIG.3is a sectional view of the first spring20.FIG.4is a sectional view of multiple interwoven second springs22. In some examples, the first spring20and/or second spring22may be replaced with a wire, sheet, fiber, or foam. Referring back toFIG.2, the second spring22may be woven or threaded around the first spring20along a length of the first spring20in the directions of the arrows24. There may be multiple second springs22woven or threaded around the first spring20. The second springs22may also be woven or threaded around each other.FIG.5is a magnified view of the SMA structure12showing the connection between the first spring20and the second springs22. Referring back toFIG.2, the first spring20may have a first diameter26. The second spring22may have a second diameter28. The first diameter26may be greater than the second diameter28. The second springs22may be disposed around an entirety of the first diameter26. The second springs22being connected to the first spring20as shown inFIG.2maintains a pitch30of the first spring20constant. Prior to assembling the first spring20and the second springs together22, the pitch30may be varied to render the tire assembly10(seeFIG.1) harder or softer.", "", "In some examples, the SMA structure12may include or have an outer, thin, practically or nearly monomolecular microporous metal coating thereof selected from at least one of zirconium, cerium, lanthanum, nickel, cobalt, tin, titanium, zinc, copper, brass and/or bronze plated. In some examples, a second layer of coating (of any of the materials described above) may be applied, using the same or a different metal. In some examples, a benzotriazole or another corrosion inhibitor may be applied to the SMA structure12.", "", "In some examples, a prepolymer or resin may be applied to the SMA structure12by using a pre-formed mold and a curing process. In some examples, the curing process may include rotational molding, rotational casting, spin casting, injection molding, extrusion, blow molding, thermoforming, expanded bead foam molding, or extruded foam molding.", "", "FIG.6is a sectional view of the tire assembly10showing the SMA structure12encapsulated in the polymer member14. The polymer member14may be disposed between the first spring20and the second springs22such that the space defined by the first diameter26(seeFIG.2) remains hollow. Any polymer is within the scope of the present invention. For example, the polymer member14may be one of natural rubber, synthetic rubber, vulcanized rubber, polyurethane, nylon, acrylic, or another thermoset or thermoplastic polymer.", "", "In some examples, the polymer member14may be 3D printed or additively manufactured onto the SMA structure12. In some examples, the SMA structure12may be bonded to the polymer member14using a vulcanizing adhesive, solvent-based adhesive, water-based adhesive, or epoxy. For instance, Chemlok® may be used to bond the SMA structure12and the polymer member14together.", "", "FIG.7is a cross-sectional view of the tire assembly10showing the SMA structure12encapsulated by the polymer member14as well as the polymer outer tread16. The polymer outer tread16may provide additional reinforcement to the tire assembly10. The polymer outer tread16may be bonded directly to the polymer member14. The polymer material or materials of the polymer member14may be different than those of the polymer outer tread16. It will be appreciated that the polymer outer tread16may entirely cover the polymer member14and the SMA structure12.", "", "FIG.8is a side view of the tire assembly10. The polymer outer tread16may partially cover the polymer member14and the SMA structure12as shown inFIG.8. In some examples, the polymer outer tread16may not be enclosing the polymer member14and the SMA structure12at or near mating surfaces of the rim18and the tire assembly10. A bicycle rim is shown inFIG.8by example.", "", "FIG.9is a cut-off perspective view of an SMA wire32under a layer of sheathing material34. The SMA wire32may be utilized in lieu of the first spring20(seeFIG.5) and/or the second spring22(seeFIG.5) to form an SMA structure. The SMA wire32may be used as a core of a drawn filled tube36. The drawn filled tube36may include the sheathing material34. The sheathing material34may be a metal or a polymer. In some examples, the sheathing material34may be same as the material of the polymer member14(seeFIG.8) and/or the polymer outer tread16(seeFIG.8). In some examples, the sheathing material34may be same as the material of the SMA wire32.", "", "FIGS.10-17show another embodiment of the present invention where the tire assembly50includes or incorporates SMA elements52that are configured in a circumferentially extending configuration with attachments (e.g., semi-rigid attachments) to the rim and/or beads or bead members. The tire assembly50may be used with any type of vehicle, but is preferably used with a bicycle, automobile or the like. In a preferred embodiment, the tire assembly is used with existing hardware (e.g., rim, etc.), however, this is not a limitation on the present invention.", "", "As shown inFIG.11-12, in a preferred embodiment, the tire assembly50may include a number of interrelated and interacting components, including the circumferential SMA elements52(which may include any cross-sectional shape), polymer member or polymer ply member54that includes the fibers56as reinforcements therein (referred to as fiber reinforcements56), one or more belts60, tire beads or bead members58and the tread16. In a preferred embodiment, the polymer member54is configured in a band with the fiber reinforcements56therein and may be referred to herein as a fiber reinforced polymer assembly53. The fiber reinforced polymer assembly53together with the outer circumferential SMA elements52and inner circumferential bead members58may be referred to herein as a ply or band assembly55. The SMA elements52may be tubular, shape set and welded. However, this is not a limitation on the present invention. The SMA elements may include any cross-sectional shape, such as tubular (FIG.12), U-shaped (FIG.13), semi-circular, I-beam, non-hollow circular or any other desired shape. The fiber reinforcements may be SMA elements, Kevlar, nylon, polyester or similar material or chord and as may be known in the tire industry and embedded within the polymer54(similar to polymer14), which may be rubber, polyurethane, polymer or the like. None of the materials discussed herein are limitations on the present invention. The tire beads58may be a series of circumferentially extending welded tubes made of a metal, such as steel, aluminum, titanium or SMA, for example. The bead members58may also be solid wires, cables or may be any cross-sectional shape. The tubes may be received or set in individual circumferentially extending grooves, a plurality of grooves or a single groove64(seeFIG.13) in the inner surface of the rim18. The U-shaped structure shown inFIG.13may help with manufacturing of the SMA elements52(or bead members) as it may be easier (and cheaper) to use a sheet of SMA that can be rolled into a U-shape cross-section instead of creating a full tube.", "", "As shown inFIG.11, in a preferred embodiment, the tire assembly50includes the tread member or portion16, rim18, and at least a first band assembly55positioned between the tread portion16and the rim18. The band assembly55includes at least a first SMA element52having an outer surface52aand may extend circumferentially about the tire assembly55, as shown inFIG.12. The band assembly55may also include at least a first bead member58having an outer surface58and that extends circumferentially about the tire assembly50. In another embodiment, the inner portion of the band assembly55if secured to the rim18or other component, as opposed to being wrapped around or extending around the a bead. The tire assembly50also may include a plurality of fiber reinforcements or fiber reinforcement members56. The fiber reinforcement members56may extend around the outer surface of the first SMA element52and the outer surface of the first bead member58to at least partially form the band assembly55. In an embodiment where individual fiber reinforcement members56extend around the SMA element(s)52and the bead member58, the band assembly55is formed by the fiber reinforcement members56and the SMA element(s)52and the bead member58(and the polymer is omitted). Preferably, the entire set of the plurality of fiber reinforcement members56extend circumferentially about the tire assembly. In other words, each individual fiber reinforcement member36extends around at least one SMA element52and at least one bead member. However, the individual fiber reinforcement members56are positioned adjacent to one another around the circumference, as is best shown inFIG.11with the fiber reinforcement members56positioned next to each other.", "", "In a preferred embodiment, the plurality of fiber reinforcement members56are disposed, embedded, encased or otherwise associated with a polymer ply member54to together form the fiber reinforced polymer assembly53that extends around the outer surface of the first SMA element52and the outer surface of the first bead member58. As shown inFIG.11, in an embodiment of the invention, the fiber reinforced polymer assembly53may take the form of a tubular configuration that extends circumferentially about the tire assembly. The tubular configuration does not have to be circular, but can be any enclosed configuration, as shown inFIG.11or13-16, etc. In another embodiment, as shown inFIG.17, instead of a continuous circumferential tube, the fiber reinforced polyer assembly53can be formed by a wrap extending around the SMA element(s)52on the outside and the bead member(s)58on the inside. See the edges62of the wrap showing that the wrap is spiraled around the SMA element(s)52on the outside and the bead member(s)58on the inside. Therefore, the fiber reinforced polymer assembly may comprises a wrapped spiral configuration that extends circumferentially about the tire assembly. The wrap includes the fiber reinforcement members or cords therein, and may be, for example, a one inch wide strip that starts as a roll and is wrapped around the SMA element(s) and bead member(s), during manufacture.", "", "FIG.10shows the tire assembly50with a portion cut away.FIG.10also shows the tire assembly50with sidewalls17. For ease of illustrating the inner portion of the tire assembly, the sidewalls are omitted in the other views. However, it will be appreciated that the tire portion of the tire assembly (e.g., the rubber of the tire) may include an outer portion (that includes or is the tread portion16) and first and second sidewalls17that enclose or house the SMA assembly19(which includes the one or more laterally adjacent band assemblies55). It will be appreciated that the tread portion does not have to include actual treads thereon, but is referred to the tread portion herein as it is the portion of the tire that contacts the ground or road. The SMA may include a band, housing, enclosure or structure therearound to hold all the components thereof (e.g., the band assemblies55) together.FIGS.11and13-16show close-ups of the fiber reinforced polymer assemblies53and the band assemblies55. InFIG.11, the fiber reinforced polymer assembly53(which includes the fiber reinforcements56embedded in the polymer54) extends around an SMA element52at the outer end (at or near the outer circumference of the tire assembly) and around a bead member58at the inner end (at or near the inner circumference of the tire assembly), thus forming the band assembly55.FIG.12shows that an SMA element52and a bead member58extending circumferentially around the tire assembly50. As shown inFIG.11, the fiber reinforced polymer assemblies53extend around the OD of the SMA elements52and the bead members58. The separate fiber reinforcements56within the fiber reinforced polymer assemblies53are evident at the top ofFIG.13.", "", "FIGS.11and13show an exemplary embodiment that includes twelve band assemblies55configured laterally to partially form the tire assembly50. However, this is only exemplary and any number of band assemblies55are within the scope of the present invention. In this embodiment, the fiber reinforced polymer assemblies53extend vertically from a bead member58to the vertically adjacent SMA element52or tube. In another embodiment, the fiber reinforced polymer assemblies53can extend diagonally or at an angle from a bead member58to an SMA element52that is not vertically adjacent. For example, when viewingFIG.13, the fiber reinforced polymer assembly53associated with the left-most bead member58may extend upwardly to the right at an angle and extend or wrap around the SMA element that is second from the left or any of the other SMA elements that are not directly vertically adjacent thereto. This arrangement can help address lateral forces in the tire assembly when the vehicle goes around a corner. In another embodiment, a fiber reinforced polymer assembly53can extend around one or bead members58at the ID and one or more SMA elements52at the OD. Different arrangements of band assemblies55including any number of bead members58and any number of SMA elements52and at any angle are within the scope of the present invention.", "", "Further to the explanation involving more than one SMA element,FIG.14shows band assemblies55that include two SMA elements52toward the outside of the tire assembly (near the tread) and one bead member58toward the inside of the tire assembly (near the rim).FIG.15includes exaggerated layering to see that a fiber reinforcement member56inside the polymer member54and extending around the outer surfaces52aand58aof the first and second SMA elements52and the bead member58. As shown inFIG.15, the fiber reinforced polymer assembly may include an extension portion53athat extends inwardly and between the first and second SMA elements52to prevent the SMA elements from rubbing together.FIG.16shows band assemblies55that include three SMA elements52toward the outside of the tire assembly (near the tread) and one bead member58toward the inside of the tire assembly (near the rim). In this arrangement, a portion of the fiber reinforced polymer assembly53extends from the bead member58upwardly at an angle, which provides a lateral force component that helps with cornering and the like. Therefore, if the tire assembly is longitudinally bisected by a plane (e.g., the plane extends up and down with respect to the ground), the right and left sides of the fiber reinforced polymer assembly53extend upwardly at an angle that is non-parallel to the plane. This provides a lateral or horizontal component to the tension provided by the fiber reinforced polymer assembly53. It will be appreciated that inFIGS.14and16, the detail of a number of the components, including the SMA elements52, belt60, fiber reinforced polymer assemblies53and bead members58behind the cut line are not shown and are omitted so as to not complicate the drawings.", "", "In a preferred embodiment, the polymer54in the fiber reinforced polymer assemblies53is adhered to the outer surface of the bead member(s)58and SMA elements52to form the band assembly. Furthermore, the fiber reinforced polymer assemblies53may be cured such that the adjacent the fiber reinforced polymer assemblies53are adhered or otherwise secured together. The fiber reinforcements56may spiral around the bead member(s)58and SMA elements52(within the polymer strip, band or ply) over the3600of the tire assembly.", "", "It will be appreciated that each fiber reinforced polymer assembly53may include multiple layers or plies, each with fiber reinforcement members56therein. Furthermore, in any of the ply layers or the polymers, the fiber reinforcement members56or cords may extend or run at an angle, as opposed to radially, as is shown in most of the drawings.FIG.18shows two sets of fiber reinforcement members56extending at opposite angles to one another (e.g., 45 degrees one way and 45 degrees the other way). These oppositely extending fiber reinforcement members56may in the same polymer layer or may be in separate ply layers (e.g., one ply or layer with plus 30 degree cords and another ply or layer with negative 30 degree cords, which may be referred to as a bias ply. The fiber reinforcement members56may extend radially (FIG.11) or at any angle up to 90 degrees (which is essentially extending circumferentially).", "", "In use, the present invention includes an outer ring of circumferentially wrapped SMA elements52that are designed to engage when the tire assembly50is loaded. In use, the SMA elements52are designed to absorb the majority of the load. It will be appreciated by those of ordinary skill in the art that the SMA elements use a unique combination of strength, recoverability, and return energy to increase tire performance.", "", "Another component of the invention is the fiber reinforced polymer assembly53used to create a rigid attachment between the SMA elements52and the tire bead elements or members58and/or the rim18. During loading, the SMA elements52deflect to generate a footprint. The diameter of the remaining SMA elements attempts to grow to accommodate the shortened chord length of the footprint section. The fiber reinforced polymer assembly53restricts the growth of the outer diameter through the semi-rigid fiber reinforcements56wrapped around the SMA elements52to the tire bead elements or members58and/or the rim18. This effectively distributes the load to the entire band assemblies55, rather than just the SMA elements at the footprint, resulting in an efficient usage of the SMA material and improved tire performance. As load is placed on the axle, the SMA elements at or near the outer diameter (OD) of the tire assembly deflect to generate the footprint. Since the circumference is shorter due to the cord length of the footprint, the circumferential tube formed by the SMA elements attempts to grow radially outwardly and/or outside the footprint. The reinforcement fibers56extending between and attaching the rim/beads and the SMA elements restricts the OD growth, therefore generating a semi-rigid body similar to a pneumatic tire.", "", "The tire belt(s)60are used to support tire assembly performance with added lateral strength. They help maintain ideal tire shape during usage. However, the tire belt(s) may be omitted. The tire bead members58allow the tire to stay seated on the rim, similar to its purpose in conventional pneumatic tires. However, without the need for tight seals (in tubeless pneumatic tires), additional improvements can be made to the tire bead.", "", "The tread16serves a similar purpose as in conventional pneumatic tires. This is the section of the tire that comes in contact with the road. The tread is used to ensure good contact and allow water to escape during poor weather conditions.", "", "Unless the context clearly requires otherwise, throughout the description and the claims, the words “comprise,” “comprising,” and the like are to be construed in an inclusive sense, as opposed to an exclusive or exhaustive sense; that is to say, in the sense of “including, but not limited to.” As used herein, the terms “connected,” “coupled,” or any variant thereof, means any connection or coupling, either direct or indirect, between two or more elements; the coupling of connection between the elements can be physical, logical, or a combination thereof. Additionally, the words “herein,” “above,” “below,” and words of similar import, when used in this application, shall refer to this application as a whole and not to any particular portions of this application. Where the context permits, words in the above Detailed Description of the Preferred Embodiments using the singular or plural number may also include the plural or singular number respectively. The word “or” in reference to a list of two or more items, covers all of the following interpretations of the word: any of the items in the list, all of the items in the list, and any combination of the items in the list.", "", "The above-detailed description of embodiments of the disclosure is not intended to be exhaustive or to limit the teachings to the precise form disclosed above. While specific embodiments of and examples for the disclosure are described above for illustrative purposes, various equivalent modifications are possible within the scope of the disclosure, as those skilled in the relevant art will recognize. Further, any specific numbers noted herein are only examples: alternative implementations may employ differing values, measurements or ranges.", "", "Although the operations of any method(s) disclosed or described herein either explicitly or implicitly are shown and described in a particular order, the order of the operations of each method may be altered so that certain operations may be performed in an inverse order or so that certain operations may be performed, at least in part, concurrently with other operations. In another embodiment, instructions or sub-operations of distinct operations may be implemented in an intermittent and/or alternating manner.", "", "The teachings of the disclosure provided herein can be applied to other systems, not necessarily the system described above. The elements and acts of the various embodiments described above can be combined to provide further embodiments. Any measurements or dimensions described or used herein are merely exemplary and not a limitation on the present invention. Other measurements or dimensions are within the scope of the invention.", "", "Any patents and applications and other references noted above, including any that may be listed in accompanying filing papers, are incorporated herein by reference in their entirety. Aspects of the disclosure can be modified, if necessary, to employ the systems, functions, and concepts of the various references described above to provide yet further embodiments of the disclosure.", "", "These and other changes can be made to the disclosure in light of the above Detailed Description of the Preferred Embodiments. While the above description describes certain embodiments of the disclosure, and describes the best mode contemplated, no matter how detailed the above appears in text, the teachings can be practiced in many ways. Details of the system may vary considerably in its implementation details, while still being encompassed by the subject matter disclosed herein. As noted above, particular terminology used when describing certain features or aspects of the disclosure should not be taken to imply that the terminology is being redefined herein to be restricted to any specific characteristics, features or aspects of the disclosure with which that terminology is associated. In general, the terms used in the following claims should not be construed to limit the disclosures to the specific embodiments disclosed in the specification unless the above Detailed Description of the Preferred Embodiments section explicitly defines such terms. Accordingly, the actual scope of the disclosure encompasses not only the disclosed embodiments, but also all equivalent ways of practicing or implementing the disclosure under the claims.", "", "While certain aspects of the disclosure are presented below in certain claim forms, the inventors contemplate the various aspects of the disclosure in any number of claim forms. For example, while only one aspect of the disclosure is recited as a means-plus-function claim under 35 U.S.C. § 112, ¶6, other aspects may likewise be embodied as a means-plus-function claim, or in other forms, such as being embodied in a computer-readable medium. (Any claims intended to be treated under 35 U.S.C. § 112, ¶6 will include the words “means for”). Accordingly, the applicant reserves the right to add additional claims after filing the application to pursue such additional claim forms for other aspects of the disclosure.", "", "Accordingly, although exemplary embodiments of the invention have been shown and described, it is to be understood that all the terms used herein are descriptive rather than limiting, and that many changes, modifications, and substitutions may be made by one having ordinary skill in the art without departing from the spirit and scope of the invention."], "claims": ["a tread portion, a rim, and at least a first band assembly positioned between the tread portion and the rim, wherein the first band assembly includes a first SMA element having an outer surface, wherein the first SMA element extends circumferentially about the tire assembly, a first bead member having an outer surface, wherein the first bead member extends circumferentially about the tire assembly, and a plurality of fiber reinforcement members, wherein each of the plurality of fiber reinforcement members extend around the outer surface of the first SMA element and the outer surface of the first bead member to form the first band assembly.", "2 . The tire assembly of claim 1 wherein the plurality of fiber reinforcement members extend circumferentially about the tire assembly.", "3 . The tire assembly of claim 1 wherein the plurality of fiber reinforcement members are disposed in a first polymer member to form a fiber reinforced polymer assembly, wherein the fiber reinforced polymer assembly extends around the outer surface of the first SMA element and the outer surface of the first bead member.", "4 . The tire assembly of claim 3 wherein the fiber reinforced polymer assembly comprises a tubular configuration that extends circumferentially about the tire assembly.", "5 . The tire assembly of claim 3 wherein the fiber reinforced polymer assembly comprises a wrapped spiral configuration that extends circumferentially about the tire assembly.", "6 . The tire assembly of claim 3 wherein the fiber reinforced polymer assembly includes first and second polymer members, wherein the first polymer member includes a first set of fiber reinforcement members disposed therein, wherein the second polymer member includes a second set of fiber reinforcement members disposed therein, wherein the first set of fiber reinforcement members extend in a first direction, wherein the second set of fiber reinforcement members extend in a second direction, and wherein the first direction is non-parallel to the second direction.", "7 . The tire assembly of claim 3 wherein the band assembly includes a second SMA element having an outer surface, wherein the second SMA element extends circumferentially about the tire assembly, wherein the fiber reinforced polymer assembly extends around the outer surface of the first SMA element, the outer surface of the second SMA element and the outer surface of the first bead member.", "8 . The tire assembly of claim 7 wherein the first SMA element is positioned laterally adjacent to the second SMA element.", "9 . The tire assembly of claim 8 wherein the fiber reinforced polymer assembly includes an extension portion that extends inwardly and between the first and second SMA elements.", "a first SMA element having an outer surface, wherein the first SMA element extends circumferentially about the tire assembly, a first bead member having an outer surface, wherein the first bead member extends circumferentially about the tire assembly, and a plurality of fiber reinforcement members, wherein each of the plurality of fiber reinforcement members extend around the outer surface of the first SMA element and the outer surface of the first bead member to form the first band assembly.", "11 . The tire assembly of claim 1 wherein an inner portion of the first band assembly is seated in a groove associated with the rim.", "a tread portion, a rim, and at least a first band assembly positioned between the tread portion and the rim, wherein the first band assembly includes a first SMA element having an outer surface, wherein the first SMA element extends circumferentially about the tire assembly, a second SMA element having an outer surface, wherein the second SMA element extends circumferentially about the tire assembly and is positioned laterally adjacent to the first SMA element, a first bead member having an outer surface, wherein the first bead member extends circumferentially about the tire assembly, and a first fiber reinforced polymer assembly that includes a plurality of fiber reinforcement members disposed in a polymer member, wherein the first fiber reinforced polymer assembly extends around the outer surface of the first SMA element, the outer surface of the second SMA element and the outer surface of the first bead member, wherein the first fiber reinforced polymer assembly extends circumferentially about the tire assembly.", "a first SMA element having an outer surface, wherein the first SMA element extends circumferentially about the tire assembly, a first bead member having an outer surface, wherein the first bead member extends circumferentially about the tire assembly, and a first fiber reinforced polymer assembly that includes a plurality of fiber reinforcement members disposed in a polymer member, wherein the first fiber reinforced polymer assembly extends around the outer surface of the first SMA element, the outer surface of the second SMA element and the outer surface of the first bead member, wherein the first fiber reinforced polymer assembly extends circumferentially about the tire assembly."], "bibtex": "@patent{20240116313,\n    title = {TIRE ASSEMBLY WITH CIRCUMFERENTIAL SHAPE MEMORY ALLOY CONFIGURATION},\n    number = {20240116313},\n    year = {2024},\n    note = {File: US20240116313A1-20240411.XML}\n    }", "classification": "B60C714FI"}, {"title": "COMPOSITE STRUCTURE ASSEMBLY AND NPT PRODUCTION", "doc_number": "20240116314", "filename": "US20240116314A1-20240411.XML", "abstract": "A method of durably assembling a rubber part and a thermoplastic elastomer part into a composite structure is proposed. The method may comprise providing a first part comprising curable rubber and a second part made of thermoplastic elastomer (TPE) material, mediating an adhesive affinity on the at least one of the first and second parts for the other one of the at least two parts, bringing the first and second parts into contact with each other so as to form a composite structure and heat-treating the composite structure to durably bond the first part to the second part. The adhesive affinity may be mediated through adhesive, such as e.g., RFL or neoalkoxy zirconate/titanate adhesive) applied on the at least one of the first and second parts or though additives, e.g., neoalkoxy zirconate/titanate, in the rubber part.", "detailed_description": ["A non-pneumatic tire is shown inFIGS.1-3. The non-pneumatic tire10may be of the top-loader type and include an outer annular band12, an inner annular band14, and a connecting structure16extending from the outer annular band12to the inner annular band14. The inner annular band14has a first diameter, and the outer annular band12has a second diameter greater than the first diameter. The inner and outer annular bands12,14are substantially coaxial with each other and centered on the tire axis. In the illustrated embodiment, the connecting structure16comprises a plurality of spokes18but other configurations may be possible.", "", "The inner annular band14may be mounted on a hub or rim (not shown). The outer annular band12may include a circumferential tread20providing a ground-contacting surface of the non-pneumatic tire10and a shear band22. The tread20may include tread features such as, e.g., grooves, ribs, blocks, lugs, sipes, studs, etc. The tread20may be configured to improve the performance of the tire in various conditions.", "", "The shear band22is configured to receive the load exerted on the inner ring as tension in connecting structure16and to transfer this load to the ground, via the tread20. When such the shear band22deforms under load, its preferred form of deformation is shear over bending. The shear mode of deformation may occur because of inextensible membranes located on the radially inner and the radially outer portions of the shear band but other possibilities may exist. The inner structure of the shear band22is not illustrated in the drawings. The shear band22could, for instance, include a sandwich structure with first and second reinforced annular rubber layers separated by an annular shear layer. The first and second reinforced rubber layers may be configured as essentially inextensible layers, e.g., may be formed of parallel inextensible reinforcement cords embedded in a rubber coating. The reinforcement cords could comprise, e.g., steel, aramid, or other fibers.", "", "The shear band22and the connecting structure16may be configured so that the resulting stiffness is related to the spring rate of the tire10. The connecting structure16may be configured to buckle or deform in the tire footprint (i.e., the part of the tire that is in contact with the ground). This implies that the rest of the connecting structure not in the footprint area (i.e., mainly the momentary upper part of the connecting structure) carries the load. The load distribution may be such that approximately 90-100% of the load is carried by the shear band and the momentary upper part of the connecting structure, so that the momentary lower part of the connecting structure carry only a small part of the load, and preferably less than approximately 10%.", "", "The connecting structure16is preferably formed of TPE material. The TPE material may be selected based upon one or more of the following material properties: Young's modulus, glass transition temperature, yield strain at break, elongation at break, heat deflection temperature, etc. A TPE material having a tensile (Young's) modulus in the range from 45 MPa to 650 MPa, and more preferably in the range of 85 MPa to 300 MPa, measured in accordance with the ISO 527-1/-2 standard test method, may be preferred. TPE material having a glass transition temperature less than −25° C., and more preferably less than −35° C., may be considered advantageous. The yield strain at break of the TPE may preferably amount to at least 30%, and more preferably to at least 40%. The TPE material preferably has an elongation at break greater than or equal to the yield strain, and more preferably, greater than or equal to 200%. The heat deflection temperature may preferably be higher than 40° C., and more preferably more than 50° C., under a load of 0.45 MPa. Examples of TPEs for the connecting structure include the TPC products sold under the designations ARNITEL PM581, PL461, EM460, EM550, EM630 by DSM Products, Hytrel by DuPont, and the TPA product VESTAMID DX9303 (Nylon 6,12) supplied by Evonik.", "", "Examples of methods useful for producing non-pneumatic tire10are discussed below.", "", "The connecting structure16and the shear band22may initially be provided as separate parts. The connecting structure16may be prefabricated by any suitable process, e.g., extrusion, injection molding, thermoforming, heat welding, 3D printing, etc. The connecting structure16and the shear band22may each be provided as a single part or as a plurality of parts to be assembled. The connecting structure16comprises a radially outer surface, which is to become the interface24with the shear band22. The shear band22has a radially inner surface formed by curable rubber, which is to serve as a contact surface26with the connecting structure16.", "", "According to a first embodiment of a method for producing non-pneumatic tire10, an adhesive is then spread (e.g., by brushing or by spray-coating) on the radially outer surface of the connecting structure16or on the radially inner surface of the shear band22.", "", "Prior to application of the adhesive, one or more cleaning steps of the contact surfaces may be carried out, if necessary. Additionally, or alternatively, preparation of one or both of the contact surfaces may include roughening and/or application of a pre-treatment agent. For instance, the pre-treatment agent could be applied on the radially outer surface of the connecting structure in order to activate the TPE, i.e., give the TPE material the bonding functionality for the employed adhesive. Such a pre-treatment agent could, e.g., include a (blocked) isocyanate. It will be appreciated that a treatment with (blocked) isocyanate of a TPC material may be advantageous for compatibilization of the TPC material with an RFL adhesive. As a further possibility, preparation of one or both of the contact surfaces may include an atmospheric pressure plasma treatment. Such plasma treatment may be effective to increase the surface tension and thus favor the interaction between the TPE material and the adhesive. Different surface preparation techniques may be combined when needed. Cleaning and/or roughening could be effected, for instance, by dry ice blasting, sand blasting or like techniques.", "", "Optionally, the adhesive is dried after application.", "", "After application of the adhesive, the shear band and the connecting structure are assembled into a composite structure by bringing the interface part of the connecting structure into contact with the radially inner surface of the shear band. The green rubber to become the tread20may be arranged adjacent the radially outer surface of the shear band. The assembly of the individual parts may be carried out in a mold, or the assembled composite structure may be placed into a mold after assembly.", "", "After assembly, the composite structure may be heated so as to durably bond the different parts, in particular the shear band and the connecting structure. The rubber parts may be cured during the same heat treatment step.", "", "It will be understood that the adhesive mediates chemical bonding (including covalent and/or ionic bonding) between the shear band and the connecting structure only upon being subjected to the heat treatment. Nevertheless, the adhesive may be configured to increase the tack of the surface on which it is applied (in wet or dried state). This may be seen as helpful for the assembly and manipulation of the composite structure while it is still uncured. For instance, increased tack may be helpful to position the shear band and the connecting structure relative to each other and to keep these parts in that position until the curing has been effected.", "", "The TPE material of the connecting structure is chosen such that it comprises chemical groups capable of reacting with the adhesive and/or the rubber of the shear band at the vulcanization temperature of the curable rubber parts. The TPE material may contain, e.g., among other chemical groups, a significant concentration of terephthalic acid moieties, capable of reacting with an RFL dip.", "", "The TPE material may include, without being limited thereto, ester moieties, terephthalate moieties, secondary amine functional groups, tertiary amine functional groups, and/or amide groups. Preferred examples of TPE include TPC and TPA, e.g., Nylon 6,12, Nylon 6 or Nylon 6,6.", "", "The vulcanization of the rubber parts and the bonding of the shear band to the connecting structure is preferably carried out at a temperature below the softening temperature of the TPE material. The curing temperature may, e.g., be located in the range from 120° C. to 180° C. with the proviso that the softening temperature of the employed TPE material is not exceeded.", "", "According to a first example, the adhesive comprises a subcoat RFL adhesive adapted to the TPE material of the connecting structure16and a topcoat RFL adhesive adapted to the rubber material of the radially inner surface of the shear band22. The RFL adhesives may include a polymer latex based on at least one of polyisoprene rubber, styrene-butadiene rubber, acrylonitrile-butadiene rubber, hydrogenated acrylonitrile-butadiene rubber and 2-vinylpyridine rubber. The combination of the RFL adhesives is preferably adapted to the rubber part and the TPE part to be bonded."], "claims": ["providing a shear band comprising curable rubber; the shear band having a radially inner surface formed by the curable rubber; providing a connecting structure for connecting the shear band to a wheel hub, the connecting structure comprising at least one interface part made of thermoplastic elastomer material; applying at least one RFL adhesive on the at least one interface part; assembling the shear band and the connecting structure into a composite structure, the assembling of the shear band and the connecting structure comprising bringing the at least one interface part into contact with the radially inner surface of the shear band; and durably bonding the shear band to the connecting structure through a heat-treatment of the composite structure.", "2 . The method as claimed in claim 1 , wherein the composite structure is assembled in a mold or placed into a mold after assembly and wherein the heat-treatment of the composite structure comprises baking the composite structure in the mold.", "3 . The method as claimed in claim 1 , wherein the thermoplastic elastomer material comprises at least one of ester moieties, terephthalate moieties, secondary amine functional groups, tertiary amine functional groups, and amide groups.", "4 . The method as claimed in claim 3 , wherein the thermoplastic elastomer material comprises a thermoplastic copolyester or a thermoplastic polyamide.", "5 . The method as claimed in claim 1 , wherein heat-treating the composite structure comprises heating the composite structure to a temperature in a range from 140° C. to 200° C.", "6 . The method as claimed in claim 1 , comprising drying and pre-curing the RFL adhesive on the at least one interface part or on the radially inner surface of the shear band before assembling the shear band and the connecting structure into the composite structure.", "7 . The method as claimed in claim 1 , wherein the RFL adhesive includes a polymer latex based on at least one of polyisoprene rubber, styrene-butadiene rubber, acrylonitrile-butadiene rubber, hydrogenated acrylonitrile-butadiene rubber, epoxidized natural rubber and 2-vinylpyridine rubber.", "8 . The method as claimed in claim 1 , wherein the at least one interface part or the radially inner surface of the shear band is roughened prior to application of the RFL adhesive thereon.", "providing a shear band comprising curable rubber; the shear band having a radially inner surface formed by the curable rubber; providing a connecting structure for connecting the shear band to a wheel hub, the connecting structure comprising at least one interface part made of thermoplastic elastomer material; applying an adhesive on the at least one interface part, the adhesive comprising a solution of at least one of a neoalkoxy zirconate and a neoalkoxy titanate; assembling the shear band and the connecting structure into a composite structure, the assembling of the shear band and the connecting structure comprising bringing the at least one interface part into contact with the radially inner surface of the shear band; and heat-treating the composite structure so as to durably bond the shear band to the connecting structure.", "10 . The method as claimed in claim 9 , wherein the composite structure is assembled in a mold or placed into a mold after assembly and wherein the heat-treatment of the composite structure comprises baking the composite structure in the mold.", "11 . The method as claimed in claim 9 , wherein the thermoplastic elastomer material comprises at least one of terephthalate moieties, secondary amine functional groups, tertiary amine functional groups, and amide groups.", "12 . The method as claimed in claim 11 , wherein the thermoplastic elastomer material comprises a thermoplastic copolyester or a thermoplastic polyamide.", "13 . The method as claimed in claim 9 , wherein heat-treating the composite structure comprises heating the composite structure to a temperature in a range from 120° C. to 200° C.", "14 . The method as claimed in claim 9 , comprising drying the adhesive on the at least one interface part or on the radially inner surface of the shear band before assembling the shear band and the connecting structure into the composite structure.", "15 . The method as claimed in claim 9 , wherein the at least one interface part or the radially inner surface of the shear band is roughened prior to application of the adhesive.", "providing a shear band comprising curable rubber; the shear band having a radially inner surface formed by the curable rubber, the curable rubber having at least one of a neoalkoxy zirconate content and a neoalkoxy titanate content; providing a connecting structure for connecting the shear band to a wheel hub, the connecting structure comprising at least one interface part made of thermoplastic elastomer material; assembling the shear band and the connecting structure into a composite structure, the assembling of the shear band and the connecting structure comprising bringing the at least one interface part into contact with the radially inner surface of the shear band; and heat-treating the composite structure so as to create a durable bond between the shear band and the connecting structure, the bond being mediated by at least part of the neoalkoxy zirconate or neoalkoxy titanate content.", "17 . The method as claimed in claim 16 , wherein heat treatment causes part of the neoalkoxy zirconate or neoalkoxy titanate content to migrate toward the radially inner surface and to mediate the bond.", "18 . The method as claimed in claim 16 , wherein the composite structure is assembled in a mold or placed into a mold after assembly and wherein the heat-treatment of the composite structure comprises baking the composite structure in the mold.", "19 . The method as claimed in claim 18 , wherein the baking is carried out at a temperature in a range from 120° C. to 200° C.", "20 . The method as claimed in claim 16 , wherein the thermoplastic elastomer material comprises a thermoplastic copolyester, a thermoplastic polyamide or a thermoplastic polyurethane, and wherein the thermoplastic elastomer material comprises at least one of terephthalate moieties, secondary amine functional groups, tertiary amine functional groups, and amide groups."], "bibtex": "@patent{20240116314,\n    title = {COMPOSITE STRUCTURE ASSEMBLY AND NPT PRODUCTION},\n    number = {20240116314},\n    year = {2024},\n    note = {File: US20240116314A1-20240411.XML}\n    }", "classification": "B60C724FI"}, {"title": "TIRE WITH MULTIPLE STEEL BELTS AND A REINFORCEMENT LAYER", "doc_number": "20240116315", "filename": "US20240116315A1-20240411.XML", "abstract": "A tire includes a pair of annular beads, a body ply extending between the pair of annular beads, and at least three steel belt layers disposed above the body ply and extending axially across a portion of the body ply. The tire further includes at least one reinforcement layer disposed above the at least three steel belt layers, a circumferential tread disposed above the at least one reinforcement layer and extending axially across the tire, and a pair of sidewalls extending between each of the pair of annular beads and a pair of shoulders associated with the circumferential tread.", "detailed_description": ["The following includes definitions of selected terms employed herein. The definitions include various examples or forms of components that fall within the scope of a term and that may be used for implementation. The examples are not intended to be limiting. Both singular and plural forms of terms may be within the definitions.", "", "“Axial” and “axially” refer to a direction that is parallel to the axis of rotation of a tire.", "", "“Circumferential” and “circumferentially” refer to a direction extending along the perimeter of the surface of the tread perpendicular to the axial direction.", "", "“Equatorial plane” refers to the plane that is perpendicular to the tire's axis of rotation and passes through the center of the tire's tread.", "", "“Radial” and “radially” refer to a direction perpendicular to the axis of rotation of a tire.", "", "“Sidewall” as used herein, refers to that portion of the tire between the tread and the bead.", "", "“Tread” as used herein, refers to that portion of the tire that comes into contact with the road under normal inflation and load.", "", "Directions are stated herein with reference to the axis of rotation of the tire. The terms “upward” and “upwardly” refer to a general direction towards the tread of the tire, whereas “downward” and “downwardly” refer to the general direction towards the axis of rotation of the tire. Thus, when relative directional terms such as “upper” and “lower” or “top” and “bottom” are used in connection with an element, the “upper” or “top” element is spaced closer to the tread than the “lower” or “bottom” element. Additionally, when relative directional terms such as “above” or “below” are used in connection with an element, an element that is “above” another element is closer to the tread than the other element.", "", "The terms “inward” and “inwardly” refer to a general direction towards the equatorial plane of the tire, whereas “outward” and “outwardly” refer to a general direction away from the equatorial plane of the tire and towards the sidewall of the tire. Thus, when relative directional terms such as “inner” and “outer” are used in connection with an element, the “inner” element is spaced closer to the equatorial plane of the tire than the “outer” element.", "", "While similar terms used in the following descriptions describe common tire components, it should be understood that because the terms carry slightly different connotations, one of ordinary skill in the art would not consider any one of the following terms to be purely interchangeable with another term used to describe a common tire component.", "", "FIG.1is a perspective view of one embodiment of a tire100. The illustrated tire may be used for large applications, such as for a truck or bus. The tire100includes a circumferential tread105and a sidewall110. In the illustrated embodiment, the tread105includes a plurality of circumferential grooves that define a plurality of ribs. The tread105further includes a plurality of lateral grooves that define a plurality of blocks. The tread105further includes sipes and notches in the blocks. It should be understood, however, that the illustrated tread105is merely exemplary and that the tread may include any tread elements.", "", "FIG.2is a half cross section of the tire100. As can be seen in this view, the tire100further includes a pair of annular beads115(only one of which is shown in this view) and a bead filler120disposed above each bead. The beads115may be constructed of steel, while the bead fillers120may be constructed of an elastomeric material. The bead115and bead filler120form a bead region125of the tire100. In the illustrated embodiment, the bead region125also includes an abrasion130. In an alternative embodiment, two or more beads may be disposed on each side of the tire. In another alternative embodiment, the bead filler may be formed of multiple components, with each component constructed of a different material.", "", "In the illustrated embodiment, a body ply135extends between, and wraps around each of the pair of annular beads115. In the illustrated embodiment, a turn-up portion of the body ply135terminates in a lower portion of the tire. In alternative embodiments, the turn-up portion of the body ply may terminate at any location of the tire. It should be understood that the tire may include multiple body plies. In such embodiments, two or more of the body plies may wrap around the beads. Alternatively, one or more body plies may extend from bead to bead, without wrapping around the beads.", "", "The tire100further includes four circumferential belts140a,140b,140c,140ddisposed above the body ply135and extending axially across a portion of the body ply135. The belts140may be constructed of steel or any other metal. Together, the circumferential belts140and the tread105form a crown region145of the tire100. In an alternative embodiment, the tire includes three circumferential belts in the crown region instead of four belts. In another alternative embodiment, the tire includes five or more circumferential belts. In all embodiments discussed herein, it should be understood that the tire includes at least three circumferential belts in the crown region.", "", "The tire100further includes a shoulder150at each end of the crown region145, only one of which is shown inFIG.2. The tire100further includes a pair of sidewall regions155, with each sidewall region155extending from one of the shoulders150to a respective bead region125.", "", "In the illustrated embodiment, a belt wedge160is located in each shoulder150, between an end of a second belt140band an end of a third belt140c. The belt wedge160is constructed of rubber or other elastomeric material, to protect the edges of the belts140and prevent abrasion. While a single belt wedge160is shown in the illustrated shoulder150between the second and third belts140b,c, it should be understood that the location may be selected as needed, and multiple belt wedges may be employed. Alternatively, the belt wedge may be omitted.", "", "A gum strip165is also located in each shoulder150, above the ends of the second and third belts140b,c. The gum strip165further protects the edges of the belts140and prevents abrasion. While a single gum strip165is shown in the illustrated shoulder150above the second and third belts140b,c, it should be understood that the location may be selected as needed, and multiple gum strips may be employed. Alternatively, the gum strip may be omitted.", "", "In the illustrated embodiment, the tire100includes a shoulder layer170located in each shoulder region150and disposed above three of the circumferential belts140a,b,c. The shoulder layer170has an outer end175located outside a first end of each of the three circumferential belts140a,b,c. In this embodiment the outer end175of the shoulder layer170is located outside the first end of the widest belt of the tire100(i.e., the second belt140bin the illustrated embodiment). In one known embodiment, the outer end175of the shoulder layer170is located 3 to 5 mm outside of the end of the second belt140b. The shoulder layer170also has an inner end180located inside the first end of each of the at least three circumferential belts140a,b,c. Such a shoulder layer may be referred to as a “full” shoulder layer.", "", "It should be understood that the opposite side of the tire100has substantially the same construction, and thus includes a second shoulder layer that is similarly disposed. Thus, the shoulder layer170shown inFIG.2may be described as a first shoulder layer. For brevity, the second shoulder layer is not described in detail.", "", "In one embodiment the first shoulder layer170and the second shoulder layer are each constructed of steel. In alternative embodiments, the shoulder layers170may be constructed of other metal or fiberglass. In another alternative embodiment, the shoulder layers170are each constructed of nylon. In still other alternative embodiments, the shoulder layers170may be constructed of polyester, rayon, or other such material.", "", "When constructing the tire100, tension is applied to the shoulder layers170as they are wrapped circumferentially about the shoulder150. The shoulder layers170are thus under tension when the tire100is not in contact with the ground. The pre-tensioned shoulder layers170restrict the amount of growth in the shoulder150due to the centrifugal load on the tire100, and thus even the distribution of growth in the crown region throughout the life of the tire100.", "", "In one embodiment, the shoulder layers170are each made by winding a strip of material about a shoulder region of the tire100, so that the shoulder layers170extend circumferentially about the tire100, and perpendicular to the reinforcements of the body ply135. In one particular embodiment, each shoulder layer is formed by a thin strip of material that is spirally wrapped about the tire multiple times.", "", "It has long been understood in the art that reinforcement layers are not needed in the crown region of tires constructed with three or more circumferential belts. Recent experiments and observations, however, have shown results that are contrary to such widely held expectations. In fact, over a long period of use, the ends of the steel belts may move or even flip upwards. Such movement of the belt ends can cause cracks to grow in the tire, decrease the durability of the tire, and lead to irregular wear. Prolonged driving at higher speeds (as may occur when speed limits are increased) may exacerbate such belt end movement.", "", "Experiments have shown that, contrary to previous expectations, the use of shoulder layers170in a crown region150of a tire100help control shoulder growth and also mitigate the effects of heat generation. The shoulder layers170thus evenly distribute the energy in the tire100and reduce irregular wear. This reduction of irregular wear helps to prolong the life of the tire100, even after multiple retread operations. It has been found that the benefits of the shoulder layers170outweigh the added costs.", "", "Other embodiments, such as those shown inFIGS.3and4, have been shown to provide similar, unexpected benefits. For brevity, these benefits are not re-stated for each embodiment.", "", "FIG.3is a half cross section of an alternative embodiment of a tire200. The tire200ofFIG.3is substantially similar to the tire100ofFIGS.1and2, except for the differences described herein. Accordingly, like features will be identified by like numerals increased by a value of “100.” The construction of the bead region225and sidewall region255of tire200is substantially the same as that of the tire100, and is therefore not repeated. The alternative embodiments described with respect to tire100may also be applied to tire200.", "", "The tire200includes four circumferential belts240a,240b,240c,240din the crown region245, disposed above the body ply235and extending axially across a portion of the body ply235. The belts240may be constructed of steel or any other metal.", "", "The tire200further includes a shoulder250at each end of the crown region245, only one of which is shown inFIG.3. A belt wedge260is located in each shoulder250, between an end of a second belt240band an end of a third belt240c. A gum strip265is also located in each shoulder250, above the ends of the second and third belts240b,c.", "", "In the illustrated embodiment, the tire200includes a lower shoulder layer270located in the each shoulder region250and disposed above three of the circumferential belts240a,b,c. The lower shoulder layer270has an outer end275located outside a first end of each of the three circumferential belts240a,b,c. In this embodiment, the outer end275of the lower shoulder layer270is located outside the first end of the widest belt (i.e., the second belt240bin the illustrated embodiment). In one known embodiment, the outer end275of the lower shoulder layer270is located 3 to 5 mm outside of the end of the second belt240b. The lower shoulder layer270also has an inner end280located inside the first end of each of the at least three circumferential belts240a,b,c. Such a lower shoulder layer may be referred to as a “full” lower shoulder layer.", "", "The tire200further includes an upper shoulder layer285disposed above the lower shoulder layer270. Like the lower shoulder layer270, the upper shoulder layer285has an outer end290located outside a first end of each of the three circumferential belts240a,b,c. In one known embodiment, the outer end290of the upper shoulder layer285is located 3 to 5 mm outside of the end of the second belt240b. The upper shoulder layer285also has an inner end295located inside the first end of each of the at least three circumferential belts240a,b,c. Such an upper shoulder layer may be referred to as a “full” upper shoulder layer.", "", "In the illustrated embodiment, the lower shoulder layer270and the upper shoulder layer285have substantially the same width and the ends are aligned. In an alternative embodiment, the upper shoulder layer is offset from the lower shoulder layer such that the ends are not aligned. In another alternative embodiment, the lower shoulder layer may be wider than the upper shoulder layer. In yet another alternative embodiment, the upper shoulder layer may be wider than the lower shoulder layer.", "", "It should be understood that the opposite side of the tire200has substantially the same construction, and thus includes second upper and lower shoulder layers that are similarly disposed.", "", "In one embodiment the shoulder layers270,285are each constructed of steel. In alternative embodiments, the shoulder layers270,285may be constructed of other metal or fiberglass. In another alternative embodiment, the shoulder layers270,285are each constructed of nylon. In still other alternative embodiments, the shoulder layers270,285may be constructed of polyester, rayon, or other such material.", "", "The shoulder layers270,285are pre-tensioned during a tire build, in the same manner described above with respect to tire100. In one embodiment, the shoulder layers270,285are each made by winding a strip of material about a shoulder region of the tire200, so that the shoulder layers270,285extend circumferentially about the tire200, and perpendicular to the reinforcements of the body ply235. In one particular embodiment, each shoulder layer is formed by a thin strip of material that is spirally wrapped about the tire multiple times.", "", "FIG.4is a half cross section of an alternative embodiment of a tire300. The tire300ofFIG.4is substantially similar to the tire100ofFIGS.1and2, and the tire200ofFIG.3, except for the differences described herein. Accordingly, like features will be identified by like numerals increased by a value of “100.” The construction of the bead region325and sidewall region355of tire300is substantially the same as that of the tire100, and is therefore not repeated. The alternative embodiments described with respect to tire100may also be applied to tire300.", "", "The tire300includes four circumferential belts340a,340b,340c,340din the crown region345, disposed above the body ply335and extending axially across a portion of the body ply335. The belts340may be constructed of steel or any other metal.", "", "The tire300further includes a shoulder350at each end of the crown region345, only one of which is shown inFIG.4. A belt wedge360is located in each shoulder350, between an end of a second belt340band an end of a third belt340c. A gum strip365is also located in each shoulder350, above the ends of the second and third belts340b,c.", "", "In the illustrated embodiment, the tire300includes a lower shoulder layer370located in the each shoulder region350and disposed above three of the circumferential belts340a,b,c. The lower shoulder layer370has an outer end375located outside a first end of the first and third circumferential belts340a,c, but inside a first end of the second circumferential belt340b. The lower shoulder layer370also has an inner end380located inside the first end of each of the at least three circumferential belts340a,b,c. Such a lower shoulder layer may be referred to as a “mid-step” lower shoulder layer.", "", "The tire300further includes an upper shoulder layer385disposed above the lower shoulder layer370. Like the lower shoulder layer370, the upper shoulder layer385has an outer end390located outside a first end of each of the three circumferential belts340a,b,c. The upper shoulder layer385has an outer end390located outside a first end of the first and third circumferential belts340a,c, but inside a first end of the second circumferential belt340b. The upper shoulder layer385also has an inner end395located inside the first end of each of the at least three circumferential belts340a,b,c. Such an upper shoulder layer may be referred to as a “mid-step” upper shoulder layer.", "", "In the illustrated embodiment, the lower shoulder layer370and the upper shoulder layer385have substantially the same width and the ends are aligned. In an alternative embodiment, the upper shoulder layer is offset from the lower shoulder layer such that the ends are not aligned. In another alternative embodiment, the lower shoulder layer may be wider than the upper shoulder layer. In yet another alternative embodiment, the upper shoulder layer may be wider than the lower shoulder layer.", "", "It should be understood that the opposite side of the tire300has substantially the same construction, and thus includes second upper and lower shoulder layers that are similarly disposed.", "", "In one embodiment the shoulder layers370,385are each constructed of steel. In alternative embodiments, the shoulder layers370,385may be constructed of other metal or fiberglass. In another alternative embodiment, the shoulder layers370,385are each constructed of nylon. In still other alternative embodiments, the shoulder layers370,385may be constructed of polyester, rayon, or other such material", "", "The shoulder layers370,385are pre-tensioned during a tire build, in the same manner described above with respect to tire300. In one embodiment, the shoulder layers370,385are each made by winding a strip of material about a shoulder region of the tire300, so that the shoulder layers370,385extend circumferentially about the tire300, and perpendicular to the reinforcements of the body ply335. In one particular embodiment, each shoulder layer is formed by a thin strip of material that is spirally wrapped about the tire multiple times.", "", "Although not explicitly illustrated, it should be understood that in an alternative embodiment, a single “mid-step” shoulder layer may be employed in each shoulder of a tire. Such a single “mid-step” shoulder layer would be substantially the same as the shoulder layers170of tire100, but with the dimensions of the upper and lower shoulder layers370,385of tire300.", "", "FIG.5is a half cross section of another alternative embodiment of a tire400. The tire400ofFIG.5is substantially similar to the tire100ofFIGS.1and2, the tire200ofFIG.3, and the tire300ofFIG.4, except for the differences described herein. Accordingly, like features will be identified by like numerals increased by a value of “100.” The construction of the sidewall region and bead region of tire400is substantially the same as that of the tire100, and is therefore not repeated. The alternative embodiments described with respect to tire100may also be applied to tire400.", "", "The tire400includes four circumferential belts440a,440b,440c,440din the crown region445, disposed above the body ply435and extending axially across a portion of the body ply435. The belts440may be constructed of steel or any other metal.", "", "The tire400further includes a shoulder450at each end of the crown region445, only one of which is shown inFIG.5. A belt wedge460is located in each shoulder450, between an end of a second belt440band an end of a third belt440c. A gum strip465is also located in each shoulder450, above the ends of the second and third belts440b,c.", "", "In the illustrated embodiment, the tire400includes a lower cap ply470disposed above each of the circumferential belts440a,b,c,d. The lower cap ply470has a first end475located outside a first end of each of the circumferential belts440a,b,c,d. The lower cap ply470also has a second end (not shown in this view) located outside a second end of each of the circumferential belts440a,b,c,d. Such a lower cap ply may be referred to as a “full” lower cap ply.", "", "The tire400further includes an upper cap ply485disposed above the lower cap ply470. Like the lower cap ply470, the upper cap ply485has a first end490located outside a first end of each of the circumferential belts440a,b,c. The upper cap ply485also has a second end (not shown in this view) located outside a second end of each of the circumferential belts440a,b,c,d. Such an upper cap ply may be referred to as a “full” upper cap ply.", "", "In the illustrated embodiment, the lower cap ply470and the upper cap ply485have substantially the same width. In an alternative embodiment, the lower cap ply may be wider than the upper cap ply. In another alternative embodiment, the upper cap ply may be wider than the lower cap ply.", "", "In one embodiment the cap plies470,485are each constructed of nylon. In alternative embodiments, the cap plies470,485may be constructed of polyester, rayon, aramid, polyester-aramid mix, other synthetic fibers, or other such material. The cap plies470,485are pre-tensioned during a tire build, in the same manner described above with respect to tire100.", "", "It has long been understood in the art that cap plies are not needed in the crown region of tires constructed with three or more circumferential belts. Recent experiments and observations, however, have shown results that are contrary to such widely held expectations. In fact, over a long period of use, the footprints of such tires may deform due to elongation of the steel belts. Such deformation of the footprint can lead to irregular wear, and could even lead to cracking beneath the casing of the tire. Prolonged driving at higher speeds (as may occur when speed limits are increased) may exacerbate this deformation.", "", "Experiments have shown that, contrary to previous expectations, the use of cap plies470,480in a crown region445of a tire400may help control shoulder growth and also mitigate the effects of heat generation. The cap plies470,485thus evenly distribute the energy in the tire400and reduce irregular wear. This reduction of irregular wear helps to prolong the life of the tire400, even after multiple retread operations. It has been found that the benefits of the cap plies470,485outweigh the added costs.", "", "FIG.6is a half cross section of another alternative embodiment of a tire500. The tire500ofFIG.6is substantially similar to the tire100ofFIGS.1and2, the tire200ofFIG.3, the tire300ofFIG.4, and the tire400ofFIG.5, except for the differences described herein. Accordingly, like features will be identified by like numerals increased by a value of “100.” The construction of the sidewall region and bead region of tire500is substantially the same as that of the tire100, and is therefore not repeated. The alternative embodiments described with respect to tire100may also be applied to tire500.", "", "The tire500includes four circumferential belts540a,540b,540c,540din the crown region545, disposed above the body ply535and extending axially across a portion of the body ply535. The belts540may be constructed of steel or any other metal.", "", "The tire500further includes a shoulder550at each end of the crown region545, only one of which is shown inFIG.6. A belt wedge560is located in each shoulder550, between an end of a second belt540band an end of a third belt540c. A gum strip565is also located in each shoulder550, above the ends of the second and third belts540b,c.", "", "In the illustrated embodiment, the tire500includes a single cap ply570disposed above each of the circumferential belts540a,b,c,d. The cap ply570has a first end575located outside a first end of each of the first, third, and fourth circumferential belts540a,c,d, but inside a first end of the second circumferential belt540b. The cap ply570also has a second end (not shown in this view) located outside a second end of each of the first, third, and fourth circumferential belts540a,c,d, but inside a second end of the second circumferential belt540b. Such a cap ply may be referred to as a “mid-step” cap ply.", "", "In one embodiment the cap ply570is constructed of nylon. In alternative embodiments, the cap ply570may be constructed of polyester, rayon, aramid, polyester-aramid mix, other synthetic fibers, or other such material. In yet another alternative embodiment, the cap ply570may be constructed of steel. The cap ply570is pre-tensioned during a tire build, in the same manner described above with respect to tire100.", "", "Although not shown in this embodiment, it should be understood that a two cap ply may also employ “mid-step” cap plies. Likewise, it should be understood that a single cap ply may be a “full cap” ply.", "", "In each of the above-described embodiments, the cap plies and shoulder layers may be referred to as reinforcements, reinforcement layers, or reinforcement plies. It should be understood that additional embodiments may include any number of reinforcements. For example a tire may have one or more cap plies and one or more shoulder layers. Other such variations should be apparent to a person of ordinary skill in the art.", "", "To the extent that the term “includes” or “including” is used in the specification or the claims, it is intended to be inclusive in a manner similar to the term “comprising” as that term is interpreted when employed as a transitional word in a claim. Furthermore, to the extent that the term “or” is employed (e.g., A or B) it is intended to mean “A or B or both.” When the applicants intend to indicate “only A or B but not both” then the term “only A or B but not both” will be employed. Thus, use of the term “or” herein is the inclusive, and not the exclusive use. See, Bryan A. Garner, A Dictionary of Modern Legal Usage 624 (2d. Ed. 1995). Also, to the extent that the terms “in” or “into” are used in the specification or the claims, it is intended to additionally mean “on” or “onto.” Furthermore, to the extent the term “connect” is used in the specification or claims, it is intended to mean not only “directly connected to,” but also “indirectly connected to” such as connected through another component or components.", "", "While the present disclosure has been illustrated by the description of embodiments thereof, and while the embodiments have been described in considerable detail, it is not the intention of the applicants to restrict or in any way limit the scope of the appended claims to such detail. Additional advantages and modifications will readily appear to those skilled in the art. Therefore, the disclosure, in its broader aspects, is not limited to the specific details, the representative apparatus and method, and illustrative examples shown and described. Accordingly, departures may be made from such details without departing from the spirit or scope of the applicant's general inventive concept."], "claims": ["a crown region; a first shoulder region at a first end of the crown region; a second shoulder region at a second end of the crown region; a pair of bead regions, including a first bead region and a second bead region; a first sidewall region extending from the first bead region to the first shoulder region; a second sidewall region extending from the second bead region to the second shoulder region; at least three circumferential belts disposed in the crown region; a first shoulder layer located in the first shoulder region and disposed above the at least three circumferential belts, wherein the first shoulder layer has a first outer end located outside a first end of at least two of the at least three circumferential belts and a first inner end located inside the first end of each of the at least three circumferential belts; and a second shoulder layer located in the second shoulder region and disposed above the at least three circumferential belts, wherein the second shoulder layer has a second outer end located outside a second end of at least two of the at least three circumferential belts and a second inner end located inside the second end of each of the at least three circumferential belts.", "2 . The tire of claim 1 , wherein the first shoulder layer and the second shoulder layer are each constructed of steel.", "3 . The tire of claim 1 , wherein the first shoulder layer includes a first lower shoulder layer and a first upper shoulder layer disposed above the first lower shoulder layer, and wherein the second shoulder layer includes a second lower shoulder layer and a second upper shoulder layer disposed above the second lower shoulder layer.", "4 . The tire of claim 3 , wherein the first lower shoulder layer, the first upper shoulder layer, the second lower shoulder layer, and the second upper shoulder layer are each constructed of steel.", "5 . The tire of claim 3 , wherein the first lower shoulder layer, the first upper shoulder layer, the second lower shoulder layer, and the second upper shoulder layer are each constructed of nylon.", "6 . The tire of claim 1 , wherein the first shoulder layer and the second shoulder layer are both pretensioned, such that the first shoulder layer and second shoulder layer are under tension when the tire is not in contact with a ground surface.", "7 . The tire of claim 1 , further comprising a first belt wedge disposed between at least one of the at least three circumferential belts and the first shoulder layer, and a second belt wedge disposed between at least one of the at least three circumferential belts and the second shoulder layer.", "providing a pair of annular beads; extending a body ply between the pair of annular beads; placing at least three circumferential belts above the body ply and extending axially across a portion of the body ply; placing a nylon layer above the at least three circumferential belts; placing a circumferential tread above the nylon layer and extending axially across the tire; and extending a pair of sidewalls between each of the pair of annular beads and a pair of shoulders associated with the circumferential tread.", "a first lower nylon layer in a first shoulder region of the tire; a first upper nylon layer disposed above the first lower nylon layer in the first shoulder region of the tire; a second lower nylon layer in a second shoulder region of the tire; and a second upper nylon layer disposed above the second lower nylon layer in the second shoulder region of the tire.", "10 . The method of claim 9 , wherein each of the first upper nylon layer and the first lower nylon layer has a first outer end located outside a first end of each of the at least three circumferential belts and a first inner end located inside the first end of each of the at least three circumferential belts, and wherein each of the second lower nylon layer and the second upper nylon layer has a second outer end located outside a second end of each of the at least three circumferential belts and a second inner end located inside the second end of each of the at least three circumferential belts.", "placing a first belt wedge in a first shoulder region between at least one of the at least three circumferential belts and the lower nylon layer, and placing a second belt wedge in a second shoulder region between at least one of the at least three circumferential belts and the lower nylon layer.", "12 . The method of claim 8 , wherein the nylon layer includes a lower nylon cap and an upper nylon cap.", "13 . The method of claim 12 , wherein each of the lower nylon cap and the upper nylon cap has a first end located outside a first end of each of the at least three circumferential belts, and a second end located outside a second end of each of the at least three circumferential belts.", "placing a first belt wedge in a first shoulder region between at least one of the at least three circumferential belts and the lower nylon cap, and placing a second belt wedge in a second shoulder region between at least one of the at least three circumferential belts and the lower nylon cap.", "15 . The method of claim 12 , further comprising pretensioning the lower nylon cap and the upper nylon cap, such that the lower nylon cap and the upper nylon cap are under tension when the tire is not in contact with a ground surface.", "a pair of annular beads; a body ply extending between the pair of annular beads; at least three steel belt layers disposed above the body ply and extending axially across a portion of the body ply; at least one reinforcement layer disposed above the at least three steel belt layers; a circumferential tread disposed above the at least one reinforcement layer and extending axially across the tire; and a pair of sidewalls extending between each of the pair of annular beads and a pair of shoulders associated with the circumferential tread.", "a first shoulder reinforcement layer, the first shoulder reinforcement layer having an outer end located outside a first end of each steel belt layer and an inner end located inside the first end of each steel belt layer; and a second shoulder reinforcement layer, the second shoulder reinforcement layer having an outer end located outside a second end of each steel belt layer and an inner end located inside the first end of each steel belt layer.", "18 . The tire of claim 17 , wherein the first shoulder reinforcement layer includes a first upper reinforcement layer and a first lower reinforcement layer, and wherein the second shoulder reinforcement layer includes a second upper reinforcement layer and a second lower reinforcement layer.", "19 . The tire of claim 16 , wherein the at least one reinforcement layer includes at least one cap ply having a first end located outside a first end of each steel belt layer and a second end located outside a second end of each steel belt layer.", "20 . The tire of claim 19 , wherein the at least one cap ply includes an upper cap ply and a lower cap ply."], "bibtex": "@patent{20240116315,\n    title = {TIRE WITH MULTIPLE STEEL BELTS AND A REINFORCEMENT LAYER},\n    number = {20240116315},\n    year = {2024},\n    note = {File: US20240116315A1-20240411.XML}\n    }", "classification": "B60C918FI"}, {"title": "PNEUMATIC TYRE FOR A TWO-WHEELED VEHICLE", "doc_number": "20240116316", "filename": "US20240116316A1-20240411.XML", "abstract": "A two-wheeled vehicle pneumatic tire having a tread, a tire carcass, tire sidewalls, and two bead regions with a bead protective strip. The tire carcass is formed from a first carcass inlay and a second carcass inlay. The second carcass inlay is arranged radially inwardly of the first carcass inlay, and extends from a crown region ( 17 ) of the two-wheeled vehicle pneumatic tire and terminates at a second carcass inlay end under the bead protective strip. The two-wheeled vehicle pneumatic tire provides improved puncture protection whilst maintaining good rolling resistance. This is achieved in that the first carcass inlay is guided with a first carcass inlay turn-up over the particular tire sidewall as far as under the tread to a first carcass inlay end, and terminates there at the first carcass inlay end.", "detailed_description": [""], "claims": ["wherein the tire carcass is formed from a first carcass inlay and a second carcass inlay, each comprising strength members, wherein the second carcass inlay is arranged radially inwardly of the first carcass inlay and extends from a crown region of the two-wheeled vehicle pneumatic tire over the tire sidewalls into the two bead regions, loops around the respective cores from axially inside to axially outside, and terminates at respective second carcass inlay ends arranged under the respective bead protective strips of the respective bead region, wherein the first carcass inlay extends from the crown region of the two-wheeled vehicle pneumatic tire over the tire sidewalls into the two bead regions, and loops around the respective cores from axially inside to axially outside, and wherein, proceeding from the respective bead regions, the first carcass inlay is guided with respective first carcass inlay turn-ups over the respective tire sidewalls as far as under the tread to respective first carcass inlay ends, and terminates at the first carcass inlay ends.", "the tire has two axial halves, and in that each first carcass inlay end is arranged under the tread, in each case in that axial half of the tire in which the first carcass inlay is guided with the respective first carcass inlay turn-up over the tire sidewall as far as under the tread to the respective first carcass inlay end.", "the respective first carcass inlay turn-ups are arranged so as to overlap one another in the crown region of the tire.", "the bead protective strip terminates at a radially outer end at a first height of at most 15 mm, as measured relative to an outermost turning point of the strength members of the second carcass inlay that are looped around the core.", "the bead protective strip is formed as a rubberized monofilament fabric.", "the carcass is in direct contact with a tire interior.", "the tire is a tube-free tire.", "the tire is a bicycle tire for operation with a tube.", "at least in one region of the sidewall, the first carcass inlay and the second carcass inlay are the only inlays comprising strength members.", "a damping rubber inlay formed from a highly elastic rubber is arranged between the tread and the tire carcass.", "a protective ply formed from tear-resistant rubberized fabric or a rubber layer is arranged between the tread and the tire carcass.", "the tire is a bicycle tire, a racing bike tire, a mountain bike tire, a clincher bike tire, or a tire for a bicycle comprising an electric motor for driving the bicycle.", "13 . The two-wheeled vehicle pneumatic tire according to claim 2 , wherein each first carcass inlay end is arranged under the tread under a tread runout of the tread.", "14 . The two-wheeled vehicle pneumatic tire according to claim 4 , wherein the bead protective strip terminates at a radially outer end at the first height of at most 10 mm to 12 mm.", "15 . The two-wheeled vehicle pneumatic tire according to claim 10 , wherein the damping rubber inlay has a material thickness between 0.2 mm and 1 mm.", "16 . The two-wheeled vehicle pneumatic tire according to claim 11 , wherein the protective ply is formed from a tear-resistant rubberized fabric comprising fibers formed from polyethylene terephthalate polyacrylate."], "bibtex": "@patent{20240116316,\n    title = {PNEUMATIC TYRE FOR A TWO-WHEELED VEHICLE},\n    number = {20240116316},\n    year = {2024},\n    note = {File: US20240116316A1-20240411.XML}\n    }", "classification": "B60C1500FI"}, {"title": "CABLE TOW HOOK ASSEMBLIES AND VEHICLES INCLUDING SAME", "doc_number": "20240116317", "filename": "US20240116317A1-20240411.XML", "abstract": "A vehicle including a vehicle frame, a front bumper, and a tow hook assembly. The vehicle frame has an open interior. The front bumper includes a front surface, a rear surface opposite the front surface, and a channel extending between the front surface and the rear surface. The tow hook assembly includes an attachment cord coupled to the vehicle frame and extends through the channel of the front bumper.", "detailed_description": ["Embodiments described herein are directed to vehicles including one or more tow hook assemblies including an attachment cord, such that the attachment cord of the tow hook assembly is flexibly movable during a front end collision, while otherwise having the durability to tow a vehicle. The various components of the tow hook assemblies disclosed herein may be positioned such that contact with a pedestrian, as well as damage to other components of the vehicle, is minimized during a front end collision.", "", "The vehicles described herein include a vehicle frame, a front bumper, a crush box, and a tow hook assembly. The vehicle frame defines an open interior. The front bumper has a front surface, a rear surface opposite the front surface, and a channel extending through the front surface and the rear surface. The crush box extends between the vehicle frame and the front bumper and defines an open interior coaxial with the open interior of the vehicle frame and the channel extending through the front bumper. The tow hook assembly includes an attachment cord coupled to the vehicle frame and extending through the open interior of the crush box and the channel of the front bumper. Various embodiments of the vehicle and the operation of the tow hook assembly are described in more detail herein. Whenever possible, the same reference numerals will be used throughout the drawings to refer to the same or like parts.", "", "As used herein, the term “vehicle longitudinal direction” refers to the forward-rearward direction of the vehicle (i.e., in the +/−Y direction of the coordinate axes depicted inFIG.1). The term “vehicle lateral direction” refers to the cross-vehicle direction (i.e., in the +/−X direction of the coordinate axes depicted inFIG.1), and is transverse to the vehicle longitudinal direction. The term “vehicle vertical direction” refers to the upward-downward direction of the vehicle (i.e., in the +/−Z direction of the coordinate axes depicted inFIG.1). As used herein, “upper” and “above” are defined as the positive Z direction of the coordinate axes shown in the drawings. “Lower” and “below” are defined as the negative Z direction of the coordinate axes shown in the drawings.", "", "Referring toFIG.1, a vehicle100is generally illustrated according to one or more embodiments described herein. As shown, the vehicle100is illustrated as a pickup truck. However, the vehicle100may be any suitable automobile including coupes, sedans, minivans, crossovers, hybrids, sports utility vehicles, or the like, in addition to other vehicles such as a bus, boat, or the like, without limiting the scope of the present disclosure. The vehicle100includes a body102having a front end104, a rear end106opposite the front end104, and a front bumper108having a bottom surface112provided at the front end104of the body102of the vehicle100.", "", "The vehicle100includes one or more tow hook assemblies120located at the front end104of the body102of the vehicle100. For example, as depicted herein, the vehicle100includes a pair of tow hook assemblies120that extend through a channel114formed in the front bumper108. However, it should be appreciated that the vehicle100may include any number of tow hook assemblies120, such as one tow hook assembly120or more than two tow hook assemblies120. In addition, the tow hook assembly120may be mounted at any suitable location of the vehicle100such as, for example, at the bottom surface112of the front bumper108, at the front end104of the vehicle100, or to a cross member of the vehicle100located in a rearward vehicle longitudinal direction of the front bumper108(in the −Y direction of the coordinate axes depicted inFIG.1).", "", "Referring now toFIG.2, a cross sectional view of the tow hook assembly120taken along line2-2ofFIG.1is depicted. The vehicle100, depicted with the tow hook assembly120, includes the front bumper108, a vehicle frame128, a crush box130, and the tow hook assembly120. The vehicle frame128has an open interior133defined by a top surface138and a lower surface139. The term “vehicle frame” may refer to any supporting structure of the vehicle100to which other components are attached. The front bumper108includes a front surface116, and a rear surface118opposite the front surface116. The front bumper108further includes a bottom surface112and a top surface122opposite the bottom surface112. A channel114is formed in the front bumper108and extends through the front bumper108, parallel to the bottom surface112and the top surface122. The channel114extends between the front surface116and the rear surface118of the front bumper108.", "", "The crush box130extends between the vehicle frame128and the front bumper108and includes an open interior132. The crush box130includes a first end portion134, a second end portion136opposite the first end portion134, and a central portion135provided between the first end portion134and the second end portion136. The first end portion134is coupled to the front bumper108and the second end portion136is coupled to the vehicle frame128. The first end portion134and the second end portion136may be coupled to the front bumper108and the vehicle frame128in any suitable manner such as, for example, fasteners, welding, and the like. The term “crush box” may refer to an energy absorbing device installed between the vehicle frame128and the front bumper108to reduce an impact force exhibited during vehicle collisions. The open interior133of the vehicle frame128is coaxial with the open interior132of the crush box130, which is coaxial with the channel114extending through the front bumper108. In embodiments, the central portion135collapses in the vehicle longitudinal direction to reduce an impact force at the front end104of the vehicle100.", "", "Still referring toFIG.2, the tow hook assembly120includes an attachment cord150coupled to the vehicle frame128. More particularly, the attachment cord150extends through the open interior133of the vehicle frame128, the open interior132of the crush box130, and through the channel114of the front bumper108. In embodiments, the attachment cord150includes a first end152, a second end154, and a loop portion156provided between the first end152and the second end154. In embodiments, the attachment cord150may be formed from a flexible material, for example, a cable, a braided cable, a rope, a chain, or the like. In embodiments, the attachment cord150may be formed of metallic material, woven, nonwoven, natural, or synthetic materials. Accordingly, in use, the attachment member150is folded onto itself such that the first end152is positioned adjacent the second end154with the loop portion156positioned opposite the first end152and the second end154. The first end152and the second end154are provided within the open interior133of the vehicle frame128. The loop portion156is positioned opposite the first end152and the second end154and is provided exteriorly to the front surface116of the front bumper108, opposite the crush box130. In embodiments, the attachment cord150has a diameter D equal to or greater than one-eighth inches and less than or equal to three inches.", "", "In embodiments, the tow hook assembly120may further include a sheathing158surrounding a portion of the attachment cord150. In embodiments, the sheathing158may surround the loop portion156of the attachment cord150and extend along the attachment cord150through the channel114of the front bumper108. In embodiments, the sheathing158may further extend along the attachment cord150through the open interior132of the crush box130. In embodiments, the sheathing158may further extend along the attachment cord150through the open interior133of the vehicle frame128. The sheathing158improves a strength and durability of the attachment cord150while maintaining flexibility. It should be appreciated that the sheathing158may be of any material that may adequately surround the attachment cord150and remain flexible, for example, carbon fiber, plastic coating, rubber or the like.", "", "In embodiments, a cross-sectional shape of the attachment cord150with or without the sheathing158is dimensioned to be less than the cross-sectional shape of the channel114. Specifically, the cross-sectional shape and size of the attachment cord150corresponds to the cross-sectional shape and size of the channel114such that the loop portion156of the attachment cord150is inhibited from entering into the channel114. Accordingly, the cross-sectional shape and size of the channel114inhibits the loop portion156of the attachment cord150from retreating into the channel114.", "", "The attachment cord150may be coupled to the vehicle frame128in any suitable manner such as, for example, welding, using a fastener, adhesive, or the like. In some embodiments, the attachment cord150may be fixed to the crush box130. Particularly, the attachment cord150may extend through, the open interior132of the crush box130, and through the channel114of the front bumper108. Still referring toFIG.2, in some embodiments, an aperture153is formed at the first end152and an aperture155is formed at the second end154of the attachment cord150. In embodiments, an aperture157is also formed in the top surface138vehicle frame128and coaxial with the apertures153,155when the first end152and the second end154are positioned within the open interior133of the vehicle frame128. The tow hook assembly120further includes a fastener142that extends through the vehicle frame128and the apertures153,155formed in the first end152and the second end154of the attachment cord150to secure the attachment cord150to the vehicle frame128. It should be understood that the fastener142may secure the attachment cord150to any location on the vehicle frame128wherein the attachment cord150may then extend through the open interior132of the crush box130and the channel114of the front bumper108.", "", "Referring now toFIG.3, in other embodiments, the tow hook assembly120may further include a coupling member140that secures the first end152and the second end154of the attachment cord150to the vehicle frame128. However, it should be understood that the attachment cord150may be coupled to the vehicle frame128by welds, clamps, brackets, or the like.", "", "As shown inFIG.3, an isolated top view of the coupling member140is depicted. In some embodiments, the coupling member140facilitates coupling the attachment cord150to the vehicle frame128(FIG.2) of the vehicle100without providing the apertures153,155through each of the first end152and the second end154of the attachment cord150. The coupling member140includes a receiving portion145and a connection portion143extending from the receiving portion145. The connection portion143defines an eyelet147where a fastener, such as the fastener142(FIG.2), may extend therethrough to fix the connection portion143to the vehicle frame128. The receiving portion145has an open end149and defines an open interior144. The first end152and the second end154of the attachment cord150extend through the open end149and are positioned within the open interior144of the receiving portion145of the coupling member140.", "", "In embodiments, the first end152and the second end154of the attachment cord150extend through the open interior144and are fixed within the open interior144by a compressed portion146of the receiving portion145. The first end152and the second end154are clamped down upon with the compressed portion146of the receiving portion145of the coupling member140. As referred to herein, the compressed portion146refers to a portion of the receiving portion145that is deformed by a compression force to have a diameter less than a diameter of the open end149of the receiving portion145. Accordingly, the compressed portion146of the receiving portion145is compressed against, and secures the first end152and the second end154of the attachment cord150to the coupling member140. However, it may be understood that the first end152and the second end154of the attachment cord150may be coupled to the coupling member140though welds, clamps, brackets, fasteners, or the like.", "", "Referring again toFIGS.1and2, upon a force exceeding a threshold being applied against the front end104of the vehicle100in a front end collision, the central portion135of the crush box130crushes and allows for the front bumper108and the vehicle frame128to “crush” together in a predictable manor. The predictability of movement of vehicle100components allows for better protection of other components of the vehicle100such damage to the vehicle frame128. In embodiments, upon the front end collision to the vehicle100, the attachment cord150may compress, fold, or otherwise collapse so as to not interfere with the crushing of the front bumper108, the crush box130, and the vehicle frame128. In addition, during such a front end collision, the portion of the attachment cord150extending exteriorly of the front bumper108folds or retracts within the front bumper108to reduce a length that the attachment cord150extends from the front bumper108.", "", "In use, a hook is attached to the loop portion156of the attachment cord150and a force is applied in a tow direction parallel to the vehicle longitudinal direction (i.e. ±Y direction inFIG.2). The application of force by the hook in the tow direction places the attachment cord150in tension so that the vehicle100may be towed.", "", "From the above, it is to be appreciated that defined herein is a vehicle with a tow hook including a flexible attachment cord with the ability to move upon an impact force against a barrier such as, for example, a pedestrian or other object, while maintaining the strength to tow a vehicle. The various components of the tow hook assemblies disclosed herein may be positioned such that contact with a pedestrian, as well as damage to other components of the vehicle, is minimized during a front end collision.", "", "It is noted that the terms “substantially” and “about” may be utilized herein to represent the inherent degree of uncertainty that may be attributed to any quantitative comparison, value, measurement, or other representation. These terms are also utilized herein to represent the degree by which a quantitative representation may vary from a stated reference without resulting in a change in the basic function of the subject matter at issue.", "", "While particular embodiments have been illustrated and described herein, it should be understood that various other changes and modifications may be made without departing from the scope of the claimed subject matter. Moreover, although various aspects of the claimed subject matter have been described herein, such aspects need not be utilized in combination. It is therefore intended that the appended claims cover all such changes and modifications that are within the scope of the claimed subject matter."], "claims": ["a vehicle frame having an open interior; a front bumper having a front surface, a rear surface opposite the front surface, and a channel extending between the front surface and the rear surface; and a tow hook assembly comprising an attachment cord coupled to the vehicle frame and extending through the channel of the front bumper.", "2 . The vehicle of claim 1 , further comprising a crush box extending between the vehicle frame and the front bumper, the crush box having an open interior coaxial with the open interior of the vehicle frame and the channel extending through the front bumper.", "3 . The vehicle of claim 2 , wherein the attachment cord includes a first end, a second end opposite the first end, and a loop portion, the first end and the second end provided within the open interior of the vehicle frame, the loop portion provided exteriorly of the front bumper opposite the crush box.", "4 . The vehicle of claim 3 , wherein the tow hook assembly further comprises a sheathing surrounding a portion of the attachment cord extending through the channel of the front bumper.", "5 . The vehicle of claim 4 , wherein the sheathing surrounds the loop portion of the attachment cord.", "6 . The vehicle of claim 4 , wherein the sheathing comprises a plastic coating.", "7 . The vehicle of claim 3 , wherein the attachment cord is formed from a flexible material selected from the group consisting of a metal braided cable, a synthetic rope, and a chain.", "8 . The vehicle of claim 3 , wherein the tow hook assembly further comprises a fastener extending through an apertures formed in the attachment cord at the first end and the second end and further extends through the vehicle frame to secure the attachment cord to the vehicle frame.", "9 . The vehicle of claim 3 , wherein the tow hook assembly further comprises a coupling member securing the first end and the second end of the attachment cord to the vehicle frame.", "10 . The vehicle of claim 9 , wherein the coupling member comprises a receiving portion and a connection portion, the connection portion including an eyelet, extending from the receiving portion, the first end and the second end of the attachment cord secured within the receiving portion, a fastener extending through the eyelet and the vehicle frame to secure the coupling member to the vehicle frame.", "11 . The vehicle of claim 10 , wherein the receiving portion of the coupling member includes a compressed portion securing the first end and the second end within the receiving portion."], "bibtex": "@patent{20240116317,\n    title = {CABLE TOW HOOK ASSEMBLIES AND VEHICLES INCLUDING SAME},\n    number = {20240116317},\n    year = {2024},\n    note = {File: US20240116317A1-20240411.XML}\n    }", "classification": "B60D156FI"}, {"title": "APPARATUSES, SYSTEMS, AND METHODS FOR DETERMINING AND VERIFYING OPERATIONAL STATES OF FIFTH WHEELS", "doc_number": "20240116318", "filename": "US20240116318A1-20240411.XML", "abstract": "Apparatuses, systems, and methods for determining and verifying operational states of fifth wheels. Certain methods for determining the operational state of the fifth wheel may include sensing, with at least one sensor, magnetic flux caused by a magnet on a movable component movable to lock the fifth wheel to a kingpin of a towed vehicle and determining an end position of the movable component based on the magnetic flux. The end position of the movable component is then compared to a threshold position and an operational state of the fifth wheel is determined based on the comparison of the end position of the movable component to the threshold position.", "detailed_description": [""], "claims": ["sensing, with at least one sensor, magnetic flux caused by a magnet coupled to a movable component that moves as the fifth wheel locks onto a kingpin of a towed vehicle; determining an end position of the movable component based on the sensed magnet flux; comparing the end position to one or more worn threshold positions; and determining the remaining life expectancy of the component of the fifth wheel based on the comparison of the end position to the one or more worn threshold positions.", "2 . The method according to claim 1 , wherein the one or more worn threshold positions includes a first worn threshold position corresponding to a first remaining life expectancy of the component of the fifth wheel and a second worn threshold position corresponding to a second remaining life expectancy of the component of the fifth wheel.", "3 . The method according to claim 2 , wherein the second remaining life expectancy of the component is less than the first remaining life expectancy of the component.", "indicating, with an indicator, the remaining life expectancy of the component or generating an alert, with the indicator, corresponding to the remaining life expectancy of the component.", "5 . The method according to claim 1 , further comprising determining an operational state of the fifth wheel based on the comparison of the end position to the one or more worn threshold positions.", "6 . The method according to claim 5 , wherein the operational state is a worn state, a locked state, and/or an unlocked state.", "7 . The method according to claim 1 , further comprising storing data generated by the sensor corresponding to the sensed magnetic flux on to a memory.", "8 . The method according to claim 7 , further comprising accessing the data stored on the memory to thereby observe operation of the fifth wheel over time.", "9 . The method according to claim 1 , wherein the at least one sensor is a 3D Hall Effect sensor.", "10 . The method according to claim 1 , wherein the sensing the magnetic flux includes sensing the magnetic flux with two or more sensors.", "a movable component that moves as the fifth wheel locks onto the kingpin; a magnet coupled to the movable component; a sensor in operative association with the fifth wheel and configured to sense magnetic flux caused by the magnet and generate data corresponding to the sensed magnetic flux; and a controller configured to receive the data from the sensor and process the data from the sensor to determine an end position of the moveable component; wherein the controller is further configured to compare the end position of the moveable component to a worn threshold position and determine a remaining life expectancy of a component of the fifth wheel based on the comparison between the end position of the moveable component to the worn threshold position.", "wherein the controller is further configured to compare the end position of the movable component to a second worn threshold position that corresponds to a second remaining life expectancy of the component of the fifth wheel.", "13 . The fifth wheel according to claim 12 , wherein the second remaining life expectancy of the component is less than the first remaining life expectancy of the component.", "14 . The fifth wheel according to claim 11 , further comprising an indicator that indicates the remaining life expectancy of the component and/or generates an alert.", "15 . The fifth wheel according to claim 11 , wherein the at least one sensor is a 3D Hall Effect sensor.", "16 . The fifth wheel according to claim 11 , wherein the controller is further configured to determine an operational state of the fifth wheel based on the comparison of the end position to the one or more worn threshold positions.", "17 . The fifth wheel according to claim 16 , wherein the operational state is a worn state, a locked state, and/or an unlocked state.", "18 . The fifth wheel according to claim 11 , wherein the controller has a memory on which the data from the sensor is stored and the data stored on the memory can be accessed to thereby observe operation of the fifth wheel over time.", "wherein the controller is configured to receive the data from the second sensor and process the data from the first sensor and the second sensor to determine the end position of the moveable component.", "20 . The fifth wheel according to claim 11 , wherein the controller includes a timer such that the controller determines velocity of the movable component."], "bibtex": "@patent{20240116318,\n    title = {APPARATUSES, SYSTEMS, AND METHODS FOR DETERMINING AND VERIFYING OPERATIONAL STATES OF FIFTH WHEELS},\n    number = {20240116318},\n    year = {2024},\n    note = {File: US20240116318A1-20240411.XML}\n    }", "classification": "B60D158FI"}]