[{"title": "HUB-BEARING UNIT FOR A WHEEL OF A MOTOR VEHICLE", "doc_number": "20250010657", "filename": "US20250010657A1-20250109.XML", "abstract": "A hub-bearing unit includes a stationary radially outer ring and a rotatable hub having an axially extending tubular portion at an axially inner side and a radially outwardly extending toothed profile. A portion of the hub is located radially inside the radially outer ring. A radially inner ring is mounted on the hub, and a toothed sleeve is mounted axially inward of the radially inner ring and has a radially inner surface including at least one groove mating with the toothed profile. The tubular portion includes a radially outer cylindrical surface, an axial portion of the radially inner surface of the toothed sleeve lies on or is bounded by a first imaginary cylinder, the axial portion of the radially inner surface engages the radially outer cylindrical surface, and the first imaginary cylinder and the radially outer cylindrical surface are coaxial.", "detailed_description": ["With reference toFIG.1, a hub-bearing unit according to a preferred embodiment is designated, as a whole, with reference numeral10.", "", "When in use, the hub-bearing unit10is interposed between a wheel and a frame, both of which are known and not illustrated, of the vehicle, and may be coupled selectively to a constant velocity joint, which is also known and not illustrated, via a transmission device, which is also known and not illustrated, for the selective transmission of drive torque to the respective wheel (not illustrated).", "", "The hub-bearing unit comprises a rotatable flanged hub20and a bearing unit30. The bearing unit30has a central rotation axis X, a stationary radially outer ring31, and a radially inner ring20defined by a first portion of the flanged hub20and a further radially inner ring34mounted on and rigidly connected to a second portion of the flanged hub20. Both of the radially inner rings20,34are rotatable with respect to the radially outer ring31as a result of the interposition of two rows of rolling elements32,33, in this case balls.", "", "Throughout the present description and in the claims, terms and expressions indicating positions and orientations, such as “radial” and “axial”, are to be understood with reference to the central rotation axis X of the bearing unit30. On the other hand, expressions such as “axially outer” and “axially inner” refer to the mounted state of the hub-bearing unit, and in this case preferably refer to a wheel side and to a side opposite the wheel side, respectively.", "", "The flanged hub20has a central through-hole21which extends along the axis X in order to be engaged with the constant velocity joint and comprises, on an axially outer side thereof, a flange25for fastening the hub-bearing unit10of the wheel of the vehicle, and, on an axially inner side thereof, an end edge24, rolled by orbital roll forming, which is configured to axially preload both the inner ring34and a toothed sleeve55against a radially outer shoulder22of the flanged hub20. The toothed sleeve55is mounted against the inner ring34and is coupled to the flagged hub20by way of an internal groove56to a toothed profile23of the flanged hub20, and is part of a transmission device configured to be connected to or disconnected from a constant velocity joint by means of an outer toothed profile57.", "", "Bearings are required between the hub and the constant velocity joint to enable the flanged hub20to rotate independently of the constant velocity joint when the flanged hub20is disengaged from the constant velocity joint. In the present embodiment, the flanged hub20has a first radially inner shoulder26and a second radially inner shoulder27formed inside the central through-hole21, close to which are mounted at least two radial ball bearings60,61(two in the configuration illustrated inFIG.1). The two radial ball bearings60,61are mounted in a radially inner position with respect to the flanged hub20. In particular, a first radial ball bearing60is mounted in an axially outer position against the first shoulder26and a second radial ball bearing61is mounted in an axially inner position against the second shoulder27. Optionally, there may also be a second radial ball bearing in the axially inner position.", "", "FIG.2illustrates an axially inner portion of the hub-bearing unit ofFIG.1, in particular an axially inner tubular portion50of the flanged hub20and the toothed sleeve55at a time before an orbital roll forming operation has been performed on the end of the tubular portion50to form the end edge24.", "", "The internal groove56extends axially through the toothed sleeve55, and the toothed profile23of the flanged hub20has a smaller axial length than the axial length of the internal groove56.", "", "The toothed sleeve55has an axially and radially inner step58having a radially inner, discontinuous cylindrical surface59formed by the surfaces of the crests of the internal groove56. Correspondingly, the tubular portion50of the flanged hub20has a radially outer cylindrical surface29. This cylindrical surface29is axially inside the toothed profile23and axially outside the end edge24. The two cylindrical surfaces—the cylindrical surface59of the step58of the toothed sleeve55and the cylindrical surface29of the tubular portion50of the flanged hub20—are precisely mated to each other to ensure optimal centering of the toothed sleeve55with respect to the flanged hub20.", "", "The improved centering between the two components provide numerous advantages, including improving coaxiality between the flanged hub20and the toothed sleeve55, improving coaxiality between the toothed sleeve55and the radial inner ball bearings60,61, and improving the mechanical strength of the toothed sleeve55in relation to stresses induced by the orbital roll forming operation. In particular, a reduced stress and a reduced radial expansion, by virtue of the greater radial thickness of the toothed sleeve55(with respect to known solutions), due to the presence of the step58.", "", "In addition, the improved centering mitigates the engagement problems of the disconnection system by virtue of the improved centering and the reduced radial expansion of the toothed sleeve55and reduces possible vibration and noise problems when the disconnection system is inserted.", "", "Advantageously, the coupling between the two cylindrical surfaces29,59is uncertain: the processing tolerances of the two surfaces can thus define a coupling with “slight” play or a coupling with “slight” interference.", "", "Preferably, the diameter D29of the centering cylindrical surface29of the flanged hub20should satisfy the following conditions: the diameter D29of the cylindrical surface29should be smaller than the diameter D23′of a bottom cylindrical surface23′ of the toothed profile23of the flanged hub20, in order to ensure the feasibility of production of the toothed profile. Even more preferably, the diameter D29should be at least 0.01 mm smaller than the diameter D23′. In other words:", "", "D2⁢9≤D23′-0.01mm.", "", "Also, the diameter D29of the cylindrical surface29should be greater than the diameter D24′of a radially outer cylindrical surface24′ of the end edge24of the flanged hub20. Even more preferably, the difference between the diameter D29of the cylindrical surface29and the diameter D24′of the surface24′ should be between 0.1 mm and 1 mm.", "", "When establishing the maximum possible value for the diameter D29of the cylindrical surface29, the thickness s of the end edge24to be rolled should be taken into account. This thickness is chosen on the basis of the structural requirements of the application and on the orbital roll-forming operating parameters selected for the component.", "", "The axial length L of the centering cylindrical surface59of the toothed sleeve55should be at least 1 mm. However, account has to be taken of the fact that the maximum axial length L is bound by the axial length of the internal groove56of the toothed sleeve55, the choice of which is dependent on the torque transmission requirements and is defined according to the specifications of the groove standards.", "", "FIG.3illustrates a similar axially inner portion of a hub-bearing unit10′ according to an alternative embodiment. The only difference between the two configurations resides exclusively in the toothed sleeve55′ and, for that reason, this alternative embodiment of the invention is illustrated by the single detail inFIG.3, all the remaining features being identical to the embodiment shown inFIGS.1and2.", "", "In this embodiment, the toothed sleeve55′ has, unlike the case illustrated above, an internal groove56′ that does not axially pass through and is axially limited by the step58′. Consequently, the step58′ has a centering cylindrical surface59′ that is continuous rather than discontinuous as in the configuration discussed above. Nothing changes with regard to the centering cylindrical surface29of the flanged hub20or with regard to the design requirements described above.", "", "This embodiment provides a further advantage in addition to those already listed above, namely that an axially inner surface65′ of the toothed sleeve55, which supports the rolled end edge24of the flanged hub20, does not exhibit any discontinuity due to empty spaces between the teeth (discontinuity that is, however, present in a corresponding surface65of the toothed sleeve55of the first embodiment of the invention). The rolled material of the end edge24is thus pressed against a continuous surface with no empty spaces (about the full 360° of the circumference). This avoids discontinuity of the material which may cause stresses and potential crack initiation points to be concentrated on the rolled material.", "", "With reference toFIG.4, both for the embodiment inFIGS.1and2and for the alternative embodiment inFIG.3, the axial stop for the second radial ball bearing61is advantageously formed by a spacer70radially inside the flanged hub20and axially outside the radial ball bearing61. The spacer70is in turn axially blocked against the second axial shoulder27of the flanged hub20.", "", "More specifically, the two radial bearings60,61and the spacer70are pressed by a ring (known and not illustrated) against the shoulders26,27, exerting axial compression forces through the outer rings of the bearings60,61and the spacer70onto the flanged hub20that, in response to the stresses transmitted by the wheel, generate reaction forces on the shoulders26,27and in particular on the axially inner second shoulder27, since it is located in the most highly stressed part of the flanged hub20, i.e. the tubular portion50.", "", "The presence of the spacer70makes it possible to improve the geometry of the flanged hub20in terms of tension. Indeed, to enable grinding operations to be carried out on the radially inner seat28of the flanged hub20, the seat accommodating the second radial ball bearing61and the spacer70, a relief groove80has to be defined between the seat28and the second axial shoulder27of the flanged hub20. The relief groove80is therefore axially outside the seat28and radially inside the entire flanged hub20. The presence of the spacer70enables the relief groove80to be sufficiently distant from the tubular portion50of the flanged hub20.", "", "Consequently, the inclusion of the spacer70, which is used as an axial shoulder for the axially inner radial ball bearing61, is primarily intended to enable the provision of a radially inner relief groove80that is different in shape and position compared to the relief groove that could be provided without the spacer70.", "", "The inclusion of the spacer70therefore makes it possible to achieve numerous advantages, including: the radially inner relief groove80is provided in a more axially outer position, which is therefore further away from the tubular portion50of the flanged hub20, which is the most stressed zone of the hub, and the geometry of the relief groove80is characterized by larger radii and a greater overall length, with a consequent reduction in the notch effect. Furthermore, where required by the application, it is also possible to include an axially inner second radial ball bearing beside the first ball bearing without modifying the flanged hub but merely reducing the axial dimension of the spacer70. The second radial ball bearing may be useful where one ball bearing is not enough to withstand the stresses coming from the constant velocity joint.", "", "In summary, embodiments of the present invention provide improved centering of the toothed sleeve with respect to the flanged hub. This translates into a more robust design and into improved conditions of use of the hub-bearing unit.", "", "In particular, in terms of design, the advantages include improved coaxiality between the flanged hub and the toothed sleeve, improved coaxiality between the toothed sleeve and the radial inner ball bearings, and improved mechanical strength of the toothed sleeve in relation to stresses induced by the orbital roll forming operation.", "", "In addition, the embodiment inFIG.3provides the further advantage of the elimination of the concentration of the stresses and of the crack initiation points on the rolled material of the flanged hub during and after the orbital roll forming operation.", "", "Lastly, from the viewpoint of the end user, the present solution makes it possible to improve the procedure for engaging the disconnection system, by virtue of the improved centering and the reduced radial expansion of the toothed sleeve and to reduce possible vibration and noise problems when the disconnection system is inserted, which is a particularly important aspect in the case of application to electric vehicles.", "", "In addition to the embodiment of the invention as described above, it should be understood that there are numerous other variants. It should also be understood that these embodiments are solely exemplary and do not limit the scope of the invention, its applications, or its possible configurations. On the contrary, although the above description enables those skilled in the art to implement the present invention according to at least one exemplary embodiment thereof, it should be understood that numerous variations of the described components are possible, without thereby departing from the scope of the invention as defined in the appended claims, interpreted literally and/or according to their legal equivalents."], "claims": ["a stationary radially outer ring, a hub having a radially outwardly extending flange at an axially outer side and an axially extending tubular portion at an axially inner side and a radially outwardly extending toothed profile at the tubular portion, a portion of the hub being located radially inside the radially outer ring, and the hub being rotatable relative to the radially outer ring about the rotation axis; a radially inner ring mounted on the hub in axial abutment with a radial external shoulder of the hub, a toothed sleeve mounted axially inward of the radially inner ring and having a radially inner surface including at least one groove mating with the toothed profile; wherein the tubular portion includes a radially outer cylindrical surface, wherein an axial portion of the radially inner surface of the toothed sleeve lies on or is bounded by a first imaginary cylinder, wherein the axial portion of the radially inner surface engages the radially outer cylindrical surface, and wherein the first imaginary cylinder and the radially outer cylindrical surface are coaxial.", "2 . The hub-bearing unit according to claim 1 , wherein the axial portion of the radially inner surface comprises a plurality of discrete surface portions lying on the first imaginary cylinder.", "3 . The hub-bearing unit according to claim 1 , wherein the axial portion of the radially inner surface comprises a circumferentially continuous surface.", "wherein the at least one groove extends from an axially outer end of the toothed sleeve to an axially inner end of the toothed sleeve, wherein an axially length of the at least one groove is greater than an axial length of the toothed profile, and wherein the axial portion of the radially inner surface is located at an axially inner end of the toothed profile.", "wherein the at least one groove comprises a plurality of grooves forming a radially inwardly directed toothed profile.", "wherein the at least one groove extends from an axially outer end of the toothed sleeve to a closed groove end axially outward of an axially inner end of the toothed sleeve, and wherein the axial portion of the radially inner surface is located axially inward of the closed groove end.", "wherein the radially outer cylindrical surface is located axially inward of the toothed profile and axially outward of the axially inner end of the tubular portion.", "wherein a diameter of the radially outer cylindrical surface is greater than an outer diameter of the tubular portion at a location axially inward of the radially outer cylindrical surface.", "wherein troughs of the toothed profile lie on a second imaginary cylinder, and wherein a diameter of the second imaginary cylinder is greater than a diameter of the radially outer cylindrical surface.", "wherein a difference between the diameter of the second imaginary cylinder and the diameter of the radially outer cylindrical surface is between 0.1 mm and 1 mm.", "wherein an axial length of the axial portion of the radially inner surface is greater than or equal to 1 mm.", "wherein the hub includes a radially inner shoulder and a second radially inner shoulder, wherein a first radial ball bearing is mounted against the first radially inner shoulder, wherein a spacer is mounted against the second internal shoulder, and wherein a second radial ball bearing is mounted against the spacer.", "wherein the radially outer cylindrical surface is located axially inward of the toothed profile and axially outward of the axially inner end of the tubular portion, wherein a diameter of the radially outer cylindrical surface is greater than an outer diameter of the tubular portion at a location axially inward of the radially outer cylindrical surface, wherein troughs of the toothed profile lie on a second imaginary cylinder, and wherein a diameter of the second imaginary cylinder is greater than a diameter of the radially outer cylindrical surface.", "wherein the at least one groove extends from an axially outer end of the toothed sleeve to an axially inner end of the toothed sleeve, wherein an axially length of the at least one groove is greater than an axial length of the toothed profile, and wherein the axial portion of the radially inner surface is located at an axially inner end of the toothed profile.", "wherein the at least one groove extends from an axially outer end of the toothed sleeve to a closed groove end axially outward of an axially inner end of the toothed sleeve, and wherein the axial portion of the radially inner surface is located axially inward of the closed groove end."], "bibtex": "@patent{20250010657,\n    title = {HUB-BEARING UNIT FOR A WHEEL OF A MOTOR VEHICLE},\n    number = {20250010657},\n    year = {2025},\n    note = {File: US20250010657A1-20250109.XML}\n    }", "classification": "B60B2700FI"}, {"title": "FREEWHEEL HUB FOR A BICYCLE", "doc_number": "20250010658", "filename": "US20250010658A1-20250109.XML", "abstract": "A freewheel hub for a bicycle includes a driver and a hub sleeve, which are each supported on a hub axle to be rotatable about a common axis of rotation, a detent body arrangement having at least one detent body, supported in a radial detent body recess to be displaceable between a locking position and a release position, and a preloading device, which is configured to preload the detent body towards the locking position, wherein the detent body recess is provided in a component comprising the driver and the hub sleeve, while the other has a radial driving tooth system or is connected for conjoint rotation to the latter, wherein the surface of the detent body has a coupling surface, which rests against a contact surface of the detent body recess in the locking position, while an engagement portion of the detent body engages in the driving tooth system.", "detailed_description": ["The present invention relates to a freewheel hub for a bicycle. A freewheel hub of this kind comprises a driver and a hub sleeve, which are each supported on a hub axle in such a way as to be rotatable about a common axis of rotation, a detent body arrangement comprising at least one detent body, which is supported in a radial detent body recess in such a way as to be displaceable between a locking position and a release position, and a preloading device, which is configured to preload the detent body towards the locking position.", "", "In this case, the detent body recess is provided in a component comprising the driver and the hub sleeve, while the other component comprising the driver and the hub sleeve has a radial driving tooth system or is connected for conjoint rotation to the driving tooth system, wherein a surface of the detent body has a coupling surface, which rests against a contact surface of the detent body recess in the locking position, while an engagement portion of the detent body engages in the driving tooth system, such that, when the driver rotates in a first direction of rotation about the axis of rotation, torque is transmitted from the driver to the hub sleeve via the coupling surface, wherein, in the release position, the detent body does not engage in the driving tooth system and allows rotation of the hub sleeve relative to the driver in the first direction of rotation, thus enabling the hub sleeve to overtake the driver in the first direction of rotation.", "", "As regards the arrangement of the driving tooth system and the detent body recess, there are therefore two alternatives. According to alternative one, the detent body recess is provided in the hub sleeve as the one component, and the driver as the other component has the driving tooth system or is connected for conjoint rotation to the driving tooth system. According to alternative two, the detent body recess is provided in the driver as the one component, and the hub sleeve as the other component has the driving tooth system or is connected for conjoint rotation to the driving tooth system.", "", "Here, the term “for conjoint rotation” refers to a rotation about the common axis of rotation of the driver and the hub sleeve.", "", "It is the object of the present invention to further develop the freewheel hub of the type in question in such a way that it can be adapted easily to different requirements in respect of the torque to be transmitted and, at the same time, is light, small and convenient.", "", "According to the invention, it is envisaged that more than half of the coupling surface is designed as a planar region, via which force or torque can be transmitted in an effective manner from the driver to the hub sleeve.", "", "The detent body arrangement can comprise a plurality of detent bodies, which are supported in respectively associated detent body recesses, e.g. two, three, four or six detent bodies, depending on the torque to be transmitted, which are preferably of identical design in order to simplify manufacture.", "", "To the extent, therefore, that features “of the detent body” or “of the detent body recess” or “of the at least one detent body” or “of the at least one detent body arrangement” are described in this application, it will be understood that, in the case of a detent body arrangement that has a plurality of detent bodies, the respective features in each case preferably apply to a plurality of detent bodies, particularly preferably to all the detent bodies of the detent body arrangement and the associated detent body recesses, unless stated otherwise.", "", "As a preferred option, the detent body recess is formed in the hub sleeve, while the driving tooth system is present on the driver. This has the advantage that the driving tooth system can be manufactured at low cost together with the cassette profile of the driver in a single production process.", "", "The alternative basic construction with detent bodies supported in detent body recesses on the driver, which is likewise not excluded, is more expensive since in that case a specially produced high-strength ring, composed of steel for example, must be secured with the driving tooth system on the hub sleeve, which is generally manufactured from a lighter, less strong material, such as aluminum.", "", "In a variant embodiment, the entire coupling surface can be of planar design, wherein the detent body is supported in the detent body recess in such a way that it can be displaced as a detent slide in a translational movement between the locking position and the release position.", "", "This has the advantage that the force vector for rotational movement transmission acts almost exclusively tangentially and may have only a very small radial component. As a result, as in the case of axial freewheels, large forces can be transmitted with small dimensions, while the production costs are lower.", "", "However, detent slides tend under certain circumstances to tilt in the detent body recess, and this demands high accuracy of the stop surfaces.", "", "For more stable support, it is therefore possible, in an alternative variant embodiment, for the coupling surface of the detent body to be composed of the planar region and a curved region, in particular a cylindrical region, wherein the curved region serves for the rotatable support of the detent body as a detent pawl during its pivoting movement between the locking position and the release position. In particular, the cylindrical region can merge tangentially into the planar region. Here, this variant is also referred to below as a flat pawl and combines advantages of a slide-type detent mechanism, that is to say large engagement surfaces and the possibility of a predominantly tangential engagement angle with advantages of a pawl, that is to say stable support with less demanding requirements on the precision of pawl seating.", "", "Tests have shown that, given suitable setting of the angle of inclination of those tooth flanks of the driving tooth system on a steel driver which are in the lead in the first direction of rotation, most applications manage with just two pawls in engagement in each case in a single tooth gap if the surfaces of the tooth flanks which are in the lead in the first direction of rotation are sufficiently large.", "", "Particularly for interaction with a detent pawl whose engagement portion is formed by a single arm which engages only in a single tooth gap, it can be envisaged that for at least one tooth, preferably for a plurality or all of the teeth of the radial driving tooth system, provision can be made for a perpendicular to the tooth flank that is in the lead in the first direction of rotation, through a center of this tooth flank, not to intersect the tooth flank of the same tooth that is the trailing tooth flank in the first direction of rotation, something that reduces the risk that the teeth will shear off in operation.", "", "There is also no intention to exclude exemplary embodiments in which the detent body arrangement comprises both detent slides and detent pawls.", "", "The planar coupling surface can be designed to be so large that the surface pressure is greatly reduced. As a result, it is possible to reduce the number of pawls in the detent body arrangement and/or to use a less strong material for the detent bodies, e.g. AL 6082-T6 instead of the otherwise necessary AL 7075-T6.", "", "In particular, provision can be made for the planar region of the coupling surface to amount to more than twice a tooth contact region of the surface of the detent body, preferably more than three times, particularly preferably more than five times, wherein the tooth contact region is that region of the surface of the detent body which is in surface contact in the locking position with the tooth flanks of the driving tooth system which are in the lead in the first direction of rotation.", "", "For expedient transmission of the force or torque within the detent body, provision is preferably made for a perpendicular to the tooth contact region of the surface of the detent body through the center of the tooth contact region to intersect the planar region of the coupling surface of the detent body, particularly preferably in or close to the center of the planar region.", "", "This is expedient particularly when the engagement portion of the detent body is formed by just a single arm, which is configured to engage in only one tooth gap of the driving tooth system.", "", "For effective torque transmission, provision is preferably made for the planar region of the coupling surface to enclose an angle of no more than 30°, preferably of no more than 20°, even more preferably of no more than 10°, with the normal from the center of the planar region to the axis of rotation.", "", "In this case, it is possible, in particular, for the detent body to have a constant cross-sectional shape perpendicular to a direction which is parallel to the axis of rotation of the freewheel hub in the assembled state, or it can at least be based on such a constant cross-sectional shape.", "", "The spring mounting of the detent bodies can be accomplished by various variant embodiments of the preloading device, which can include an element or be formed by an element selected from a compression spring, a helical compression spring, a helical spring ring, a garter spring, a circlip, a rubber spring, a chemical-pulp spring, a sylomer spring or a combination thereof.", "", "For each detent body, the preloading device can comprise a separate spring assigned to each detent body, e.g. a helical compression spring, in order to preload each individual detent body in a particularly targeted manner towards the locking position.", "", "To reduce the number of components and simplify assembly, however, it is also alternatively possible to envisage that the preloading device comprises a spring which preloads a plurality of detent bodies towards the locking position, preferably a single spring for all the detent bodies of the detent body arrangement.", "", "In the latter case, a preferred choice for detent slides is a garter spring ring, which preloads the detent slides radially inwards, while, for detent pawls, it is also possible to use a circlip, which acts on the pawls radially from the outside or radially from the inside in such a way that the pawls are each preloaded towards the locking position in a pivoting direction.", "", "To facilitate assembly, the detent body arrangement, the preloading device and the component comprising the driver and the hub sleeve, in which the at least one detent body recess is provided, can be preassembled to form a first assembly, wherein the preloading device holds the detent body arrangement on the component, thus preventing the detent bodies from falling out of the associated detent body recesses. This first assembly can then be slipped onto the other component having the driving tooth system along the common axis of rotation, or can be inserted into the other component, depending on whether the driving tooth system faces radially outwards or inwards.", "", "In an embodiment having a detent slide, this can be accomplished, for example, in that the at least one detent body recess tapers radially inwards, and the preloading device, e.g. a garter spring ring, preloads the at least one detent slide radially inwards and thus presses it into its seat in the recess in a captive manner.", "", "For better distribution of the force introduced into the detent body or output from the latter, depending on whether the detent body recess is provided in the driver or in the hub sleeve, or in order to increase the overall force that can be transmitted, provision can be made for the engagement portion of the at least one detent body to have two or more arms, which are designed to engage in adjacent tooth gaps of the radial driving tooth system in the locking position.", "", "This embodiment is preferred especially if the detent body is designed as a detent slide since in this way the tilting moment acting on the detent body can also be reduced and thus the support can be stabilized.", "", "Moreover, precise engagement is easier to achieve with two or more arms in the case of slides than it is with pawls since, in the case of a purely translational movement, all the arms travel a path of the same length. The disadvantageous angle ratios of pawls moving in a rotational manner are eliminated, and high precision is not required.", "", "Although detent pawls with more than one arm are possible in principle, they must be manufactured very precisely since, on account of the rotational engagement principle, the outer arm has to travel a longer distance in the same time and is therefore subject to a higher engagement velocity. In this case, both the seats and guides of the pawl and the engagement toothing and their dimensional tolerances must be very tight and manufactured with high precision.", "", "As explained in the introduction, the detent body arrangement preferably has a plurality of detent bodies, preferably detent bodies of the same kind, and, in corresponding fashion, there is then a plurality of detent body recesses, which are distributed around the circumference of the component in which they are arranged, ensuring that the force or the torque of the driver is distributed between the detent bodies.", "", "By the number of detent bodies and the number of teeth per detent body, it is possible to implement different applications in a modular fashion and to enable easy construction. For example, it is conceivable with the same hub sleeve to implement a racing bicycle hub with two detent bodies, an MTB hub with three detent bodies, and an eMTB hub or a cargo wheel hub with six detent bodies, in accordance with the respective torques of the specific application, in which case individual detent body recesses can remain empty, depending on the application. In this case, the detent bodies can be, in particular, detent slides with two teeth in each case.", "", "According to a preferred exemplary embodiment, the detent body recesses are distributed in such a way that all the detent bodies can engage simultaneously in the driving tooth system, such that, when the driver rotates in the first direction of rotation, the force to be transmitted or the torque to be transmitted is distributed uniformly between all the detent bodies.", "", "However, in order to reduce the maximum angle of rotation required before torque is also actually transmitted to the hub sleeve after the start of rotation of the driver in the first direction of rotation, provision can be made for the detent body arrangement to have a plurality of groups of detent bodies, which are supported in respective detent body recesses in a manner distributed around the circumference of one component in such a way that, in the case of each of the groups, the detent bodies of the respective group engage simultaneously in the driving tooth system in the locking position when said tooth system is in a suitable rotational position, while detent bodies of different groups cannot engage simultaneously in the driving tooth system.", "", "For this purpose, provision can be made for the angular spacing of directly adjacent teeth of the driving tooth system to have a constant predetermined value and, in each group, the detent bodies of the respective group to have an angular spacing from one another which corresponds to an integral multiple of the predetermined value, while detent bodies of different groups have an angular spacing from one another which differs from an integral multiple of the predetermined value by a fraction of the predetermined value. If the detent body arrangement is formed by n groups, this fraction can be m/n, where m is a natural number that is greater than zero but less than n. In particular, the fraction can be ½ in the case of 2 groups, ⅓ and/or ⅔ in the case of 3 groups etc.", "", "In addition, it should not be excluded that one group or even several or all of the groups are formed by a single detent body. Preferably, all the groups have the same number of detent bodies.", "", "The applicant retains the right also to claim protection for a bicycle having a freewheel hub according to the invention.", "", "Features of the various exemplary embodiments which are the same or correspond to one another are each provided with the same reference signs, and the additional exemplary embodiments are explained predominantly only to the extent that they differ from the first exemplary embodiment, to the description of which reference is otherwise made.", "", "FIG.1shows a perspective illustration of a first exemplary embodiment of a freewheel hub10according to the invention, whileFIG.22shows a three-quarter longitudinal section of the same hub.", "", "Unless indicated otherwise, terms such as “axial” and “radial” in this application always refer to the longitudinal axis L of the freewheel hub10, which coincides with the common axis of rotation X and, in the assembled state, with the rear wheel axis of the bicycle.", "", "The freewheel hub10comprises a hub axle12, which can be fixed on the frame of a bicycle in a known manner. A hub sleeve14is supported on the hub axle12via two rolling bearings11and13, and a driver16is supported on the said axle via two further rolling bearings15and17, both being supported in such a way that they can rotate about the common axis of rotation X.", "", "The driver16can be connected in a conventional manner to a pinion arrangement (not illustrated here), via which torque can be introduced into the driver16, while the hub sleeve14has two spoke flanges23,25for connection to the spokes (likewise not illustrated) of a rear wheel.", "", "A longitudinal end16e1of the driver16which is adjacent to the hub sleeve14is inserted into the hub sleeve14. In the axial region of the hub in which the hub sleeve14and the driver16overlap one another there is a detent body arrangement18in the interior of the freewheel hub10, of which one detent body20can be seen in the sectional illustration inFIG.2.", "", "A cover ring19prevents dirt and/or moisture from penetrating into the radial gap between the driver16and the hub sleeve14.", "", "As can be ascertained best from the cross-sectional view inFIG.3, the hub sleeve14in the present case has three radial detent body recesses22distributed around the circumference of the hub sleeve14in order to support the detent bodies20.", "", "Three further recesses27, each having a bearing projection29arranged therein, are provided in the hub sleeve14, between the detent body recesses in the circumferential direction, for the sake of reducing weight.", "", "The detent bodies20, which are here designed as detent pawls50, are each supported in the associated detent body recesses22in such a way that they can pivot between a locking position and a release position, and they are each held in the hub sleeve14in a manner preloaded towards the locking position by a circlip61as a preloading device24.", "", "In the example illustrated, those of the three detent pawls50which are in the 12 o'clock position and in the 8 o'clock position inFIG.3are in the locking position, in which an engagement portion33of the respective detent pawl50engages in the radial driving tooth system26, which is provided on the outer circumference of the driver16, at the longitudinal end16e1thereof, while, on account of its angular position relative to the driver16, the detent pawl which is in the 4 o'clock position inFIG.3is in the release position, in which the detent pawl50is not in engagement with the driving tooth system26. In the present case, this serves primarily to illustrate the locking position and the release position in the same figure.", "", "Though not illustrated, the three detent body recesses22could preferably also be arranged in such a way that all the detent bodies are always simultaneously in the locking position or the release position.", "", "Enlarged details ofFIG.3are illustrated inFIGS.4and5, whereFIG.4shows the detent body20in the locking position, andFIG.5shows the detent body20in the release position.", "", "Here, the section plane of the views inFIGS.3to5is chosen so that it passes centrally through the grooves30in the detent bodies20, in which the circlip61is accommodated.", "", "When the driver16is rotated in the first direction of rotation R1, torque is transmitted from the driver16to the hub sleeve14and hence to the rear wheel of the bicycle via those detent pawls50which are in the locking position.", "", "However, the hub sleeve14can overtake the driver16in the first direction of rotation R1, this corresponding to rotation of the hub sleeve14relative to the driver16in the first direction of rotation R1or rotation of the driver16relative to the hub sleeve14counter to the first direction of rotation R1since, in the case of such a movement, the engagement portions33of the detent pawls50can slide over the shallower tooth flanks26.2of the driving tooth system26, which are the trailing flanks in the first direction of rotation R1, or the detent pawls50are repeatedly pivoted into the release position by the tooth flanks26.2during the rotation.", "", "As can be seen best inFIG.4, the detent body20rests part of its surface, which is here referred to as the coupling surface35, against a corresponding contact surface45of the recess22in the locking position, wherein the coupling surface35in the example illustrated is composed of a region37with a convex cylindrical curvature, which serves for the pivotable support of the detent body20, and of a planar region36, which serves for the transmission of torque to the hub sleeve14during the rotation of the driver16in the first direction of rotation R1. In corresponding fashion, the contact surface45of the detent body recess22is composed of a bearing region47with a concave cylindrical curvature and of a planar region46.", "", "In the cross-sectional view inFIG.4, the curved region37extends between the indicated points P1and P2, and the planar region extends between points P2and P3.", "", "The size and inclination of the planar region36are selected with regard to effective transmission of torque with, at the same time, stable support for the detent body20. According to the invention, the planar region36accounts for more than half of the coupling surface35.", "", "The angle α between the planar region36and the normal L from the center M of the planar region36to the axis of rotation X is preferably no more than 30°, thus enabling the tangential component of the force introduced to be transmitted in an effective manner.", "", "In the example illustrated inFIG.4, the planar region36of the coupling surface35accounts for more than five times the tooth contact region65, that is to say the region of the surface of the detent body20which is in surface contact in the locking position with the tooth flank26.1of the radial driving tooth system26which is in the lead in the first direction of rotation R1.", "", "For advantageous force transmission, a perpendicular F to the tooth contact region65, through the center N of the tooth contact region65, furthermore intersects the planar region36of the coupling surface35of the detent body20in the example illustrated, preferably in or close to the center M of the planar region36.", "", "For technical reasons, it is not possible when drafting the figures to represent a deformation of the circlip61by the detent body20, but it is possible to infer the deformation of the circlip61and the resulting forces from the overlapping regions of the circlip61and the detent body20inFIGS.4and5.", "", "Thus, the only minimal overlap inFIG.4shows that the preloading device24is largely relaxed in the locking position of the detent body20and presses the detent body20only slightly radially outwards into the concavely cylindrically curved bearing region47of the detent body recess22and in this way holds the detent body against the hub sleeve14.", "", "If, starting from the position inFIG.4, the hub sleeve14overtakes the driver16in the first direction of rotation R1, the detent pawl50is pivoted clockwise by the tooth flank26.2out of the locking position into the release position, which is illustrated inFIG.5. In this case, the position of the pivoting axis S of the displacement movement of the detent pawl50between the locking position and the release position is defined by the cylindrically curved bearing region47of the detent body recess22, as indicated inFIG.5.", "", "The significantly larger overlap region O, visible inFIG.5, between the circlip61and the detent body20shows that the circlip61is deformed by the detent body20in such a way that it presses on a base39of the groove30in the right-hand region of the detent body20inFIG.5and thus preloads the detent body20to perform an anticlockwise pivoting movement back into the locking position.", "", "It is furthermore evident fromFIG.5that, in the example illustrated, the tooth height and the inclination of those tooth flanks26.1of the radial driving tooth system26of the driver16which are in the lead in the first direction of rotation R1are chosen in such a way that a perpendicular G to a tooth flank26.1which is in the lead in the first direction of rotation, through a center Q of this tooth flank26.1, does not intersect the tooth flank26.2of the same tooth which is the trailing tooth flank in the first direction of rotation R1, something that reduces the risk that the teeth will be sheared off in operation.", "", "In the case of a detent body which has more than one arm31, on the other hand, the tooth flank26.1which is in the lead in the first direction of rotation can be steeper, or the tooth height can be lower, since in this case the force acting on the driving tooth system in operation is distributed between the various arms.", "", "Since the circlip61holds the detent body arrangement18against the hub sleeve14and prevents the detent bodies20from falling out of the detent body recesses22, the abovementioned components can be preassembled to form a first assembly41, which is illustrated from different angles of view inFIGS.6and7. In these views, it can be seen that the hub sleeve14has grooves14nand29nto receive and guide the circlip61, both in the region between the individual recesses22,27and in the region of the bearing projections29.", "", "Furthermore, these figures show that the recesses22,27are open not only radially inwards but also axially at the longitudinal end14elof the hub sleeve14which is adjacent to the driver16in the assembled state, but they are covered by the cover19in the fully assembled state (FIG.1).", "", "FIGS.8and9show the freewheel hub of the first exemplary embodiment from different angles of view with the hub axle and the hub sleeve omitted.", "", "As these figures show, the detent bodies20can be assigned to two different groups18.1and18.2here, wherein group18.1has two detent bodies and group18.2has just one detent body.", "", "The detent bodies20are arranged in a manner distributed in such a way that, for each of the two groups, all the detent bodies of the respective group engage simultaneously in the driving tooth system when said tooth system is in a suitable rotational position, while detent bodies of different groups cannot engage simultaneously in the driving tooth system.", "", "For a driving tooth system26with a predetermined number of teeth, it is thereby possible to shorten the maximum time required before torque is transmitted to the hub sleeve14after the start of a rotation of the driver16in the first direction of rotation R1.", "", "In practice, however, it is preferred in this case that all the groups have the same number of detent bodies, e.g. one, two or three detent bodies, while, in the present case, the various groups primarily serve to illustrate the locking and the release position in a single sectional view.", "", "Finally, one of the detent bodies20of the first exemplary embodiment which is designed as a “flat pawl” is illustrated once again separately and from different angles of view inFIGS.10to12.", "", "As the figures show, the detent body20has two flat parallel side walls32,34and, apart from the groove30, has the same cross-sectional shape in all the section planes parallel to the side walls32,34.", "", "In the view of the side wall32which is shown inFIG.12, the detent body20has the basic shape of a virtually isosceles triangle rounded at the tip, wherein the engagement portion33projects from this basic shape as an extension of one of the sides of the triangle.", "", "In comparison with conventional pawls, on which the engagement portion is directly adjoined by a substantially cylindrical bearing portion, the detent body according to the invention has a coupling surface with a large flat region36for more effective torque transmission, resulting in the designation “flat pawl” proposed here.", "", "FIGS.13to17illustrate further exemplary embodiments of the invention.", "", "FIGS.13and14correspond in their views approximately toFIGS.4and5. Each show an enlarged cross-sectional view of the detent body in the locking position and the release position and illustrate a variant embodiment in which each detent pawl50is preloaded towards the locking position by a separate helical compression spring42. In this case, therefore, the preloading device24is formed by all the helical compression springs42.", "", "Here, as a departure from the first exemplary embodiment, the shape of the detent pawls50and of the detent pawl recesses is configured in such a way that there are two possibilities for positioning the springs, namely either in a first spring receptacle43or in a second spring receptacle53, which are formed at different locations in the detent body recess22.", "", "In corresponding fashion, the detent body20has two pressure surfaces44,54, on which, depending on the choice of spring receptacle43,53, pressure is exerted by the correspondingly positioned helical spring in the release position of the detent body20in order to preload the detent body towards the locking position.", "", "In the third and fourth exemplary embodiments inFIGS.15to17, in contrast to the first two exemplary embodiments, the detent bodies20are not designed as detent pawls but as detent slides40.", "", "FIGS.15and16correspond once again to the views inFIGS.4and5for a third exemplary embodiment of the invention. In a manner similar to the second exemplary embodiment, a helical compression spring is provided for each detent body20, the said spring pressing on a pressure surface51of recessed design in the release position (FIG.16) of the detent body in order to preload the detent body20towards the locking position (FIG.15), although, in contrast to the second exemplary embodiment, the displacement movement is a translational movement.", "", "In the case of the detent slide solutions inFIGS.15to17, the entire coupling surface35of each detent body20is of planar design and is thus identical to the planar region36.", "", "In contrast to the previous exemplary embodiments, the engagement portion33of the detent slide40illustrated there has not only one but two engagement arms31, which engage in adjacent tooth gaps27of the driving tooth system26, ensuring that the force transmitted to the detent body20in the locking position by the driver16as the latter rotates in the first direction of rotation R1is distributed between the two contact surfaces of the engagement arms31.", "", "In the example inFIGS.15and16, the translational movement of the detent slides40during the movement between the locking position and the release position is not completely radial but is slightly inclined, corresponding to the inclination of the steeper tooth flanks26.1of the driving tooth system26, and the movement is guided by two substantially parallel side walls22sof the detent body recess22.", "", "To ensure that the detent slides40do not fall radially inwards out of the detent body recesses22during assembly, a retaining projection52is preferably provided on the radially inner edge of the detent slide recess22, the leading edge in the direction of rotation R1, wherein the insertion of the detent slides40can in this case be facilitated by an additional insertion recess55provided on the radially inner edge of the detent slide recess22, the trailing edge in the direction of rotation R1.", "", "In the exemplary embodiment inFIG.17, six detent slides40, each with two engagement arms31, are provided and, in contrast to the example inFIGS.15and16, these are jointly preloaded radially inwards towards the locking position by a single garter spring59as a preloading device. In this example, the detent body recesses22taper radially inwards slightly, with the result that the preloading device24holds the detent bodies20against the hub sleeve14in this example too.", "", "It should be added that the detent body recesses are provided on a component consisting of a driver and a hub sleeve, namely on the hub sleeve in all the exemplary embodiments illustrated here, while the driving tooth system is provided on the respective other component consisting of the driver and the hub sleeve, namely on the driver in all the exemplary embodiments illustrated. However, a reverse arrangement would also be conceivable.", "", "The freewheel hub proposed according to the invention is light, small and convenient, and it can be adapted very easily to different requirements. In particular, the novel flat pawls described here make it possible to combine some of the advantages of detent slides with those of conventional rotary detent pawls.", "", "The illustrations of the embodiments described herein are intended to provide a general understanding of the structure of the various embodiments. The illustrations are not intended to serve as a complete description of all of the elements and features of apparatus and systems that utilize the structures or methods described herein. Many other embodiments may be apparent to those of skill in the art upon reviewing the disclosure. Other embodiments may be utilized and derived from the disclosure, such that structural and logical substitutions and changes may be made without departing from the scope of the disclosure. Additionally, the illustrations are merely representational and may not be drawn to scale. Certain proportions within the illustrations may be exaggerated, while other proportions may be minimized. Accordingly, the disclosure and the figures are to be regarded as illustrative rather than restrictive.", "", "While this specification contains many specifics, these should not be construed as limitations on the scope of the invention or of what may be claimed, but rather as descriptions of features specific to particular embodiments of the invention. Certain features that are described in this specification in the context of separate embodiments can also be implemented in combination in a single embodiment. Conversely, various features that are described in the context of a single embodiment can also be implemented in multiple embodiments separately or in any suitable sub-combination. Moreover, although features may be described above as acting in certain combinations and even initially claimed as such, one or more features from a claimed combination can in some cases be excised from the combination, and the claimed combination may be directed to a sub-combination or variation of a sub-combination.", "", "Similarly, while operations and/or acts are depicted in the drawings and described herein in a particular order, this should not be understood as requiring that such operations be performed in the particular order shown or in sequential order, or that all illustrated operations be performed, to achieve desirable results. In certain circumstances, multitasking and parallel processing may be advantageous. Moreover, the separation of various system components in the embodiments described above should not be understood as requiring such separation in all embodiments, and it should be understood that any described program components and systems can generally be integrated together in a single software product or packaged into multiple software products.", "", "One or more embodiments of the disclosure may be referred to herein, individually and/or collectively, by the term “invention” merely for convenience and without intending to voluntarily limit the scope of this application to any particular invention or inventive concept. Moreover, although specific embodiments have been illustrated and described herein, it should be appreciated that any subsequent arrangement designed to achieve the same or similar purpose may be substituted for the specific embodiments shown. This disclosure is intended to cover any and all subsequent adaptations or variations of various embodiments. Combinations of the above embodiments, and other embodiments not specifically described herein, are apparent to those of skill in the art upon reviewing the description.", "", "The Abstract of the Disclosure is provided to comply with 37 C.F.R. § 1.72 (b) and is submitted with the understanding that it will not be used to interpret or limit the scope or meaning of the claims. In addition, in the foregoing Detailed Description, various features may be grouped together or described in a single embodiment for the purpose of streamlining the disclosure. This disclosure is not to be interpreted as reflecting an intention that the claimed embodiments require more features than are expressly recited in each claim. Rather, as the following claims reflect, inventive subject matter may be directed to less than all of the features of any of the disclosed embodiments. Thus, the following claims are incorporated into the Detailed Description, with each claim standing on its own as defining separately claimed subject matter.", "", "It is intended that the foregoing detailed description be regarded as illustrative rather than limiting and that it is understood that the following claims including all equivalents are intended to define the scope of the invention. The claims should not be read as limited to the described order or elements unless stated to that effect. Therefore, all embodiments that come within the scope and spirit of the following claims and equivalents thereto are claimed as the invention."], "claims": ["a driver and a hub sleeve, which are each supported on a hub axle in such a way as to be rotatable about a common axis of rotation, a detent body arrangement comprising at least one detent body, which is supported in a radial detent body recess in such a way as to be displaceable between a locking position and a release position, and a preloading device, which is configured to preload the detent body towards the locking position, wherein the detent body recess is provided in a component comprising the driver and the hub sleeve, while the other component comprising the driver and the hub sleeve has a radial driving tooth system or is connected for conjoint rotation to the driving tooth system, wherein the surface of the detent body has a coupling surface, which rests against a contact surface of the detent body recess in the locking position, while an engagement portion of the detent body engages in the driving tooth system, such that, when the driver rotates in a first direction of rotation about the axis of rotation, torque is transmitted from the driver to the hub sleeve via the coupling surface, and wherein, in the release position, the detent body allows rotation of the hub sleeve relative to the driver in the first direction of rotation, wherein more than half of the coupling surface is designed as a planar region.", "wherein the entire coupling surface is of planar design, and the detent body can be displaced as a detent slide in a translational movement between the locking position and the release position.", "wherein the coupling surface is composed of the planar region and a curved region, in particular a cylindrical region, wherein the curved region serves for the rotatable support of the detent body as a detent pawl during its pivoting movement between the locking position and the release position.", "wherein the planar region of the coupling surface encloses an angle of no more than 30° with the normal from the centre of the planar region to the axis of rotation.", "wherein the preloading device comprises a spring, which is configured to preload a plurality of detent bodies of the detent body arrangement towards the respective locking position.", "6 . The freewheel hub according to claim 5 , wherein the detent body arrangement, the preloading device and the component comprising the driver and the hub sleeve on which the at least one detent body recess is provided can be preassembled to form a first assembly, wherein the preloading device holds the detent body arrangement on the component.", "7 . The freewheel hub according to claim 6 , wherein the detent body is designed as a detent slide which can be displaced between the release position and the locking position in a translational movement, and wherein the detent body recess tapers radially inwards, and the preloading device preloads the detent slide radially inwards.", "8 . The freewheel hub according to claim 1 , wherein the engagement portion of the detent body has two or more arms, which are designed to engage in adjacent tooth gaps of the driving tooth system in the locking position.", "9 . The freewheel hub according to claim 1 , wherein the detent body arrangement has a plurality of groups of detent bodies, which are supported in respective detent body recesses in a manner distributed around the circumference of one component in such a way that, in the case of each of the groups, the detent bodies of the respective group engage simultaneously in the driving tooth system in the locking position when said tooth system is in a suitable rotational position, while detent bodies of different groups cannot engage simultaneously in the driving tooth system.", "10 . The freewheel hub according to claim 1 , characterized in that the planar region of the coupling surface amounts to more than twice a tooth contact region of the surface of the detent body, wherein the tooth contact region is that region of the surface of the detent body which is in surface contact in the locking position with the tooth flanks of the driving tooth system which are in the lead in the first direction of rotation.", "11 . The freewheel hub according to claim 10 , characterized in that a perpendicular to the tooth contact region through the center of the tooth contact region intersects the planar region of the coupling surface at the center of the planar region."], "bibtex": "@patent{20250010658,\n    title = {FREEWHEEL HUB FOR A BICYCLE},\n    number = {20250010658},\n    year = {2025},\n    note = {File: US20250010658A1-20250109.XML}\n    }", "classification": "B60B2704FI"}, {"title": "NUT SLEEVE", "doc_number": "20250010659", "filename": "US20250010659A1-20250109.XML", "abstract": "A socket includes a head part 1 and a body 2 , characterized in that an inside of a first socket hole 21 of the body 2 is provided with an inner plastic sleeve 3 attached to an inner wall thereof in a replaceable way, wherein, the head part 1 can dock with an internal angle head nut or a bolt to drive its rotation. The inner plastic sleeve 3 mats with a nut or bolt and drive its rotations. The inner plastic sleeve 3 , as provided inside the body 2 , not only can it increase the friction in contact with the nut or bolt, which increases the efficiency of the socket operation, the user can also replace the inner plastic sleeve 3 when the inner plastic sleeve 3 is damaged or slips after multiple uses. As the user only need to replace the inner plastic sleeve 3 instead of replacing the entire metal socket, the present invention significantly reduces the operation costs, saves social resources, and avoid unnecessary waste.", "detailed_description": ["The present disclosure is further described below in conjunction with specific embodiments and accompanying drawings. In particular, the nut sleeve is for working on the car wheels.", "", "Referring toFIGS.1to4, the socket of the present disclosure includes a head1and a body2, and the inside of a first socket hole21of the body2is equipped with an inner plastic sleeve3attached to the inner wall thereof. The inner plastic sleeve3can be easily removed away from the body2and replaced.", "", "The head part1is capable of docking with an angle wrench or spanner handle which drive the head part's rotation. The inner plastic sleeve3, as positioned within the first socket hole21, is configured to mat with a nut of bolt and drives its rotation. The inner plastic sleeve3, as provided inside the body2, not only can it increase the friction in contact with the nut or bolt, which increases the efficiency of the socket operation, the user can also replace the inner plastic sleeve3when the inner plastic sleeve3is damaged or slips after multiple uses. As the user only need to replace the inner plastic sleeve3instead of replacing the entire metal socket, the present invention significantly reduces the operation costs, saves social resources, and avoid unnecessary waste.", "", "The cross section of the first socket hole21is any one of hexagon, pentagon, and triangle, and the shape of the inner plastic sleeve3is consistent with the shape of the cross section of the first socket hole21and attached to the inner wall of the first socket hole21. The inside of the first socket hole21is provided with an inner step22adapted to position the inner plastic sleeve3, and one end of the inner plastic sleeve3is provided with an inner extension edge31for pressing against and being positioned by the inner step22. The contact of the inner step22with the inner extension edge31provides an inclined transition surface for easy pulling. The inner plastic sleeve3and the inner wall of the first socket hole21are bonded by any adhesive selected from structural glue, ab glue, and quick-drying glue.", "", "The intersection of every two adjacent edge lines of the cross section of the first socket hole21is provided with an inverted inner circular corner211, which is recessed toward the inner wall. The intersection of every two adjacent surfaces of the outer wall of the inner plastic sleeve3is provided with an inverted outer circular corner32corresponding to the inverted inner circular corner211. The first socket hole21and the inner plastic sleeve3are respectively provided with the inverted inner circular corners211and the inverted outer circular corners32. The inverted outer circular corners32is employed to prevent any breakage on the inner plastic sleeve3caused by the stress concentration at the corners between any two adjacent side surfaces of the inner plastic sleeve3. Such that it increases the usable life of the inner plastic sleeve3, and the inverted inner circular corner211further allows the inner plastic sleeve3and the first socket hole21to be attached more tightly, so as to ensure that there is no relative sliding between the inner plastic sleeve3and the body2during operations.", "", "The head part1is provided with a second socket hole11for docking and matching with the nut or bolt head, where the cross section of the second socket hole11is a hexagon, pentagon or triangle, and the second socket hole11is smaller than the first socket hole21. As the inside of the head part1is provided with the second nut sleeve hole11, it allows the head part1also performs a docking operation with a polygonal nut or bolt, such as a hexagonal nut or bolt, which it provides a socket with two connecting ends, thereby improving the scope of use and increasing versatility.", "", "The outer wall of the head part1is at least provided with a section of hexagonal head12used to dock and match with a nut or bolt head. An extended-through communication path13is provided between the first socket hole21and the second socket hole11. The head part1is provided with two sections of hexagonal heads12of different sizes. The head part1is provided the two sections of hexagonal heads12of different sizes, so that the socket can be used with inner angle nuts of different sizes, and the hexagonal head12of the head part1can enable the nut sleeves of different sizes to be stacked on top of each other for easy storage.", "", "The outer wall of the socket body2is further sleeved with an outer plastic sleeve4capable of being disassembled, assembled and replaced. The socket body2is also provided with an outer step23adapted to position the outer plastic sleeve4. The inner plastic sleeve3and the outer plastic sleeve4are made of POM. The outer plastic sleeve4is sleeved on the body2, the outer plastic sleeve4can increase friction, it provides convenience for manually twisting the socket when auxiliary tools cannot be used in a small space, thereby increasing the applicable range of the socket.", "", "In summary, when operate the socket as disclosed in the present disclosure, the socket body2is matted with the wheel bolt head of the automobile, allowing the inner plastic sleeve3to be touched the bolt head. The wrench or spanner handle is used to dock the head1. Since the head1has both a hexagonal head12and a second socket hole11, an inner hexagonal wrench or an outer hexagonal wrench can be used to connect with the head1and to rotate the socket for removing or installing the bolts. The use of the inner plastic sleeve3to contact the bolt head will increase the friction of the contact, avoid slipping, and generate greater torque on the bolt. The inner plastic sleeve3also can be replaced in time when it is broken due to stress. There is no need to replace the entire socket, such it increases the service life of the socket, reduces usage costs, and saves social resources.", "", "Of course, the above are only specific embodiments of the present disclosure and are not intended to limit the implementation scope of the present disclosure. Any equivalent changes or modifications made in accordance with the structure, features and principles described in the claims of the present disclosure should be included in the claims of the present disclosure."], "claims": ["a head part; a body with a first socket hole; and an inner sleeve positioned within said first socket hole; wherein said inner sleeve is detachable from said first socket hole; wherein said head part is configured to dock with an internal angle head nut or bolt to rotate said internal angle head nut or bolt; and wherein said inner sleeve is configured to dock with an outer angle head nut or bolt head to rotate said outer angle head nut or bolt.", "2 . The socket according to claim 1 , wherein said first socket hole and said inner sleeve have an identical shape of a hexagon, a pentagon, or a triangle.", "3 . The socket according to claim 1 , wherein said body further includes an inner step within said first socket hole fore positioning said inner sleeve, and said inner sleeve has an inner extension edge pressing against said inner step.", "4 . The socket according to claim 3 , wherein said inner step has an inclined transition surface pressing against said inner extension edge for easy pulling.", "5 . The socket according to claim 1 , wherein said inner sleeve is attached within said first socket hole by an adhesive selected from structural glue, AB glue, and quick-drying glue.", "6 . The socket according to claim 1 , wherein each corner of said first socket hole is an inverted inner circular corner, and each corner of said inner sleeve is an inverted outer circular corner corresponding to each said inverted inner circular corner of said first socket hole.", "7 . The socket according to claim 1 , wherein said head part has a second socket hole configured to dock and match with a nut or bolt head, and said second socket hole is a hexagon, a pentagon, or a triangle.", "an extended-through communication path between said first socket hole and said second socket hole.", "9 . The socket according to claim 1 , wherein said head part has an outer shape configured to dock and match with an internal angel head nut or bolt, and said outer shape is a hexagon, a pentagon, or a triangle.", "10 . The socket according to claim 9 , wherein said head part further comprises a first section with a first size and a second section with a second size, said first section is configured for an internal angel head nut or bolt with said first size, and said second section is configure for an internal angel head nut or bolt with said second size.", "11 . The socket according to claim 10 , wherein said second section is smaller than said first section, and said socket is stackable.", "12 . The socket according to claim 10 , wherein said first section is smaller than said body, and said socket is stackable.", "an outer sleeve sleeved over said body, wherein said outer sleeve is detachable from said body.", "14 . The socket according to claim 13 , wherein said body further includes an outer step for positioning said outer sleeve.", "15 . The socket according to claim 14 , wherein said inner sleeve and said outer sleeve are made of Polyoxymethylene (POM)."], "bibtex": "@patent{20250010659,\n    title = {NUT SLEEVE},\n    number = {20250010659},\n    year = {2025},\n    note = {File: US20250010659A1-20250109.XML}\n    }", "classification": "B60B2900FI"}, {"title": "DEVICE FOR ASSEMBLING THE SPOKES OF A TIRE FOR A WHEEL BY MEANS OF PUSHERS THAT ARE ACTUATED AND ELASTICALLY SUSPENDED BY LEVERS", "doc_number": "20250010660", "filename": "US20250010660A1-20250109.XML", "abstract": "A device for assembling an airless tire ( 2 ) comprising a hub ( 3 ) of central axis (Z 3 ), a peripheral annular band ( 4 ) and a plurality of spokes ( 5 ) that connect the hub ( 3 ) to the peripheral annular band ( 4 ) comprises a plurality of pressing sub-assemblies ( 10 ) each comprising pushers ( 11, 12 ) for pressing the feet ( 6, 7 ) of the spokes ( 5 ) against the hub ( 3 ) and the peripheral annular band ( 4 ) respectively, as ( 20 ) and each hold a lever ( 15, 16 ) that makes it possible to transmit a clamping force (F 15 , F 16 ) to the pusher ( 11, 12 ) while ensuring elastic radial suspension of the pusher ( 11, 12 ) vis-à-vis the traveller ( 13, 14 ) and therefore against the foot ( 6, 7 ) of the spoke and the hub ( 3 ) or the peripheral annular ring ( 4 ) well as travellers ( 13, 14 ) that are mounted radially movably under the control of a drive system respectively.", "detailed_description": [""], "claims": ["1 .- 13 . (canceled)", "a plurality of pressing sub-assemblies that are each assigned to fastening a separate spoke and each comprise at least one pusher arranged to press one of the first and second feet of a given spoke against the receiving face of the hub or the peripheral annular band respectively that corresponds to the first or second foot of the spoke, wherein each of the pressing sub-assemblies comprises at least one traveller that is mounted radially movably relative to the central axis, under the control of a drive system, and that holds a lever that extends radially from an anchor point, via which the lever is rigidly connected to the traveller, to a bearing member that is situated axially at a distance from the anchor point along the central axis, and via which the lever bears against the pusher in a contact area that is situated on a back of the pusher, radially opposite the foot and the receiving face, and that is also contained in an axial range occupied by the foot along the central axis, so that, when the drive system radially moves the traveller, the lever carried by the traveller transmits to the pusher, by means of the bearing member, a clamping force that presses the pusher, and therefore the foot of the spoke, against the receiving face, and provides through an elastic bending capacity of the lever, elastic radial suspension of the pusher vis-à-vis the traveller and therefore against the foot of the spoke and the receiving face.", "wherein the bearing member has, in a radial plane containing the central axis, a rounded profile that allows the bearing member to roll on the back of the pusher, in order to accommodate variations in orientation of the lever relative to the back of the pusher when the lever tilts and/or deforms in bending.", "16 . The assembly device according to claim 14 , wherein the anchor point is formed by a pivot connection, an axis of which is orthoradial relative to the central axis.", "17 . The assembly device according to claim 16 , wherein the lever comprises a first branch that extends on one side relative to the axis of the pivot connection, in order to connect the anchor point to the bearing member, and a second branch that extends on an opposite side relative to the axis of the pivot connection, in order to connect the anchor point to a stop member arranged to bear against the traveller, against an adjustable stop, which is held by the traveller.", "18 . The assembly device according to claim 14 , wherein the contact area that exists between the bearing member of the lever and the back of the pusher is strictly contained in a central axial range that is centered on an axial range occupied by the pusher and an axial extent of which represents less than 40% of an extent of the axial range occupied by the pusher.", "19 . The assembly device according to claim 14 , wherein the pusher is radially guided by a first guide situated at a first axial end of the pusher and by a second guide separate from the first guide and situated at a second axial end of the pusher opposite the first end, so that the contact area between the bearing member and the back of the pusher is situated between the first and second guides, at a distance from the first and second guides.", "20 . The assembly device according to claim 14 , wherein the pusher is moved by a single lever, the anchor point of which is situated axially outside an axial range occupied by the pusher.", "21 . The assembly device according to claim 14 , wherein at least some of the pressing sub-assemblies each comprise a first traveller that holds a first lever that bears against the back of a first pusher arranged to press the first foot of the given spoke against the hub, and a second traveller that holds a second lever that bears against the back of a second pusher arranged to press the second foot of the given spoke against the peripheral annular band.", "22 . The assembly device according to claim 21 , wherein the drive system is designed so as to allow selective generation of either a simultaneous movement of the first traveller and the second traveller against the first foot of the given spoke and the second foot of the given spoke respectively, or a separate movement of the first and second travellers one after the other.", "23 . The assembly device according to claim 14 , wherein the assembly device further comprises a shared drive system, common to a plurality of the pressing sub-assemblies, the shared drive system comprising a ring that is provided with a spiral guide, which is centered on and rotatably mounted about the central axis, and which interacts with a traveller of each of the pressing sub-assemblies in order to convert a rotation of the ring into a radial translation of the traveller.", "24 . The assembly device according to claim 23 , wherein the spiral guide forms a plurality of concentric guide turns, and the traveller has a base provided with a plurality of coupling tabs with a shape conjugate to the guide turns and that are radially offset from each other so as to interact with the plurality of concentric guide turns.", "wherein the drive system comprises at least one first ring provided with a spiral guide, which at least one first ring is rotatably mounted about the central axis and interacts simultaneously with the first travellers of the pressing sub-assemblies, to convert a rotation of the at least one first ring into a radial translation of the first travellers, and a second ring provided with a spiral guide, which second ring is rotatably mounted about the central axis and coaxial with the first ring, and simultaneously interacts with the second travellers of the pressing sub-assemblies to convert a rotation of the second ring into a radial translation of the second travellers.", "26 . The assembly device according to claim 14 , wherein the assembly device comprises as many pressing sub-assemblies distributed about the central axis as there are spokes in the tire."], "bibtex": "@patent{20250010660,\n    title = {DEVICE FOR ASSEMBLING THE SPOKES OF A TIRE FOR A WHEEL BY MEANS OF PUSHERS THAT ARE ACTUATED AND ELASTICALLY SUSPENDED BY LEVERS},\n    number = {20250010660},\n    year = {2025},\n    note = {File: US20250010660A1-20250109.XML}\n    }", "classification": "B60B3100FI"}, {"title": "DEVICE FOR ASSEMBLING THE SPOKES OF A TIRE FOR A WHEEL BY MEANS OF THRUST MEMBERS ACTUATED BY RAMPED PUNCHES", "doc_number": "20250010661", "filename": "US20250010661A1-20250109.XML", "abstract": "An assembly device for assembling an airless tire ( 2 ) that comprises a hub ( 3 ) having a central axis (Z 3 ), a peripheral annular band ( 4 ) and a plurality of spokes ( 5 ) that connect the hub ( 3 ) to the peripheral annular band ( 4 ), comprises a plurality of pressing sub-assemblies ( 10 ) each comprising pushers ( 11, 12 ) to press the ends ( 6, 7 ) of the spokes ( 5 ) against the hub ( 3 ) and against the peripheral annular band ( 4 ), respectively, as well as a punch ( 13 ) that is mounted movably in axial translation parallel to the central axis (Z 3 ), and provided with ramps ( 15, 16 ) arranged so that the axial movement of the punch causes the pushers ( 11, 12 ) to move radially.", "detailed_description": [""], "claims": ["1 .- 12 . (canceled)", "a plurality of pressing sub-assemblies that are each assigned to fastening a separate spoke and that each comprise at least one pusher arranged to press one of the first and second ends of a given spoke against the receiving face of the hub or of the peripheral annular band, respectively, that corresponds to the one of the first and second ends of the spoke, wherein each of the pressing sub-assemblies comprises a punch that is mounted movably in an axial direction parallel to the central axis, under control of a drive system, and that has at least one ramp which, in a radial plane containing the central axis, diverges progressively from the axial direction and collaborates with a bearing member secured to the pusher so that when the drive system moves the punch axially against the bearing member, the ramp causes the bearing member and, therefore, the pusher to move radially and thus, via the bearing member, generates a clamping force that presses the pusher and, therefore, the one of the first and second ends of the spoke radially against the receiving face.", "14 . The assembly device according to claim 13 , wherein a suspension spring is interposed axially between each punch and the drive system so as to give the punch a predetermined resilience to resistance offered by the pusher to the punch in reaction to the clamping force.", "15 . The assembly device according to claim 13 , wherein the bearing member is arranged in such a way that a contact area of contact between the ramp and the bearing member is situated on a back of the pusher radially opposite the one of the first and second ends and the receiving face and contained in an axial range that the one of the first and second ends is to occupy along the central axis.", "16 . The assembly device according to claim 13 , wherein the bearing member is formed by a roller which is rotatably mounted on an axle borne by the pusher and orthoradial with respect to the central axis, so that the roller rolls along the ramp as the punch moves axially.", "17 . The assembly device according to claim 13 , wherein the pusher has a guide barrel which delimits a through-slot into which the punch is pushed as it moves axially and an inner wall of which has the bearing member.", "18 . The assembly device according to claim 13 , wherein the pusher is radially guided by a first guide situated at a first axial end of the pusher and by a second guide separate from the first guide and situated at a second axial end of the pusher opposite the first end, so that a contact area of contact between the ramp of the punch and the bearing member of the pusher is situated between the first and second guides, at a distance from the first and second guides.", "19 . The assembly device according to claim 13 , wherein at least some of the pressing sub-assemblies each comprise a punch which is provided with a first ramp designed to engage with a first bearing member borne by a first pusher designed to press the first end of the given spoke against the hub, and with a second ramp designed to engage with a second bearing member borne by a second pusher designed to press the second end of the given spoke against the peripheral annular band.", "wherein each of the first and second pushers has a guide barrel, wherein corresponding through-slots are axially aligned so that the punch can pass through them simultaneously, and wherein the first and second bearing members are situated on radially opposite portions of the inner walls of the corresponding through-slots so as to come to bear, respectively, against the first ramp and the second ramp which are situated on radially opposite edges of the punch.", "21 . The assembly device according to claim 19 , wherein the first and second ramps and the bearing members are arranged in such a way that the drive system causes simultaneous movement of the first pusher and of the second pusher against, respectively, the first end of the spoke and the second end of the spoke.", "22 . The assembly device according to claim 13 , wherein the assembly device comprises a shared drive system, common to several of the pressing sub-assemblies, the shared drive system comprising an actuating plate which is mounted movably in axial translation along the central axis and has a series of end caps distributed about the central axis and arranged to engage a tail of a punch so as to be able to apply axial thrust to the punch.", "23 . The assembly device according to claim 13 , wherein a number of pressing sub-assemblies distributed about the central axis is equal to a number of spokes in the tire.", "24 . The assembly device according to claim 13 , wherein the assembly device comprises one or more latches arranged in such a way as to passively keep the punches in a pushed-in position after the drive system has moved the punches axially, so as to keep the ends of the spokes pressed against respective receiving faces."], "bibtex": "@patent{20250010661,\n    title = {DEVICE FOR ASSEMBLING THE SPOKES OF A TIRE FOR A WHEEL BY MEANS OF THRUST MEMBERS ACTUATED BY RAMPED PUNCHES},\n    number = {20250010661},\n    year = {2025},\n    note = {File: US20250010661A1-20250109.XML}\n    }", "classification": "B60B3100FI"}, {"title": "TWO-WHEEL CASTER", "doc_number": "20250010662", "filename": "US20250010662A1-20250109.XML", "abstract": "A two-wheel caster includes a rotation shaft component, an arm member provided with a hollow, an axle attached to the arm member, a left wheel and a right wheel attached to the axle. The arm member includes an axle supporting member which is stored in the hollow so as to be movable up and down, and which supports the axle, a compression coil spring which is stored in the hollow, and which pushes the axle supporting member, and a main rib surrounding the hollow. The axle supporting member includes an axle receiving portion which is formed in a tadpole-like shape, corresponds to a head of such a shape, and is provided with a shaft hole through which the axle is inserted, and a cantilever spring portion which corresponds to a tail of the tadpole-like shape, and which is continuous to the main rib.", "detailed_description": ["Embodiments of the present disclosure will be described in detail with reference to the accompanying figures."], "claims": ["a rotation shaft component that rotates around a vertical axis; an arm member which is provided with a hollow, and which extends obliquely downwardly from a lower end of the rotation shaft component; an axle that is horizontally attached to a lower part of the arm member; a left wheel that is attached to a left end of the axle; and a right wheel that is attached to a right end of the axle, wherein the arm member comprises: an axle supporting member which is stored in the hollow so as to be movable up and down, and which supports the axle; a compression coil spring which is stored in the hollow, and which pushes the axle supporting member; and a main rib that surrounds the hollow, wherein the axle supporting member comprises: an axle receiving portion which is formed in a tadpole-like shape, corresponds to a head of the tadpole-like shape, and is provided with a shaft hole through which the axle is inserted; and a cantilever spring portion which corresponds to a tail of the tadpole-like shape, and which is continuous to the main rib, wherein the axle receiving portion is configured to be depressed against the main rib by the compression coil spring, and the cantilever spring portion and the compression coil spring are configured to deflect and to be compressed, respectively, so as to absorb shock when the left wheel and the right wheel go over an unevenness of a floor.", "2 . The two-wheel caster according to claim 1 , wherein the hollow is hidden by the left wheel and by the right wheel.", "3 . The two-wheel caster according to claim 2 , wherein the left wheel and the right wheel are each provided with at least one window portion to make a part of the cantilever spring portion and/or a part of the compression coil spring visible."], "bibtex": "@patent{20250010662,\n    title = {TWO-WHEEL CASTER},\n    number = {20250010662},\n    year = {2025},\n    note = {File: US20250010662A1-20250109.XML}\n    }", "classification": "B60B3304FI"}, {"title": "Tire Tread Rubber Composition", "doc_number": "20250010663", "filename": "US20250010663A1-20250109.XML", "abstract": "Disclosed herein are tire tread rubber compositions comprising a specified elastomer component, reinforcing silica filler, a specified hydrocarbon resin, a cure package, and optionally oil. The elastomer component includes at least one styrene-butadiene rubber having a silica-reactive functional group; and natural rubber, polyisoprene, or a combination thereof.", "detailed_description": ["Disclosed herein are rubber compositions for use in tire treads.", "", "In a first embodiment, a tire tread rubber composition is disclosed. The composition comprises (a) 100 parts of an elastomer component comprising: (i) at least 45 parts of one or more styrene-butadiene rubbers having a silica-reactive functional group, and (ii) 10-55 parts of natural rubber, polyisoprene, or a combination thereof; (b) at least one reinforcing silica filler in an amount of 50-150 phr; (c) 11-40 phr of at least one hydrocarbon resin having a Tg of about 35 to about 60° C.; (d) less than 10 phr of oil; and (e) a cure package. According to the first embodiment, (c) and (d) are present in a total amount of less than 50 phr.", "", "In a second embodiment, a tire tread rubber composition is disclosed. The composition comprises: (a) 100 parts of an elastomer component comprising: (i) at least 50 parts of one or more styrene-butadiene rubbers having a silica-reactive functional group and a Tg of about −65 to about −40° C., and (ii) 10-50 parts of natural rubber, polyisoprene, or a combination thereof; (b) at least one reinforcing silica filler in an amount of 50-89 ph;, (c) 11-40 phr of at least one hydrocarbon resin having a Tg of about 35 to about 60° C.; (d) less than 10 phr of oil; and (e) a cure package. According to the second embodiment, (c) and (d) are present in a total amount of no more than 40 phr and the tire tread rubber composition contains no more than 20 phr of carbon black filler.", "", "In a third embodiment, a tire tread rubber composition is disclosed. The composition comprises: (a) 100 parts of an elastomer component comprising: (i) at least 50 parts of two styrene-butadiene rubbers having a silica-reactive functional group, each having a Tg of about −65 to about −40° C. and a Mw of 250,000 to 600,000 grams/mole, (ii) 10-50 parts of natural rubber, polyisoprene, or a combination thereof, and (iii) 0-5 phr of polybutadiene rubber; (b) at least one reinforcing silica filler in an amount of 50-89 phr; (c) 11-40 phr of at least one hydrocarbon resin having a Tg of about 35 to about 60° C.; (d) less than 10 phr of oil; and (e) a cure package. According to the third embodiment, (c) and (d) are present in a total amount of no more than 40 phr and the tire tread rubber composition contains no more than 20 phr of carbon black filler.", "", "In a fourth embodiment, a tire including a tread comprising the tire tread rubber composition according to the first embodiment, the second embodiment, or the third embodiment is disclosed.", "", "In a fifth embodiment, a process is provided for preparing a tire tread rubber composition according to any one of the first, second, or third embodiments, wherein the process comprises utilizing ingredients as described herein for the first, second, or third embodiment, respectively. In other words, according to the fifth embodiment, the tire tread rubber composition is made from ingredients as described herein for the first, second, or third embodiments."], "claims": ["a. 100 parts of an elastomer component comprising: i. at least 45 parts of one or more styrene-butadiene rubbers having a silica-reactive functional group, and ii. 10-55 parts of natural rubber, polyisoprene, or a combination thereof, b. at least one reinforcing silica filler in an amount of 50-150 phr, c. 11-40 phr of at least one hydrocarbon resin having a Tg of about 35 to about 60° C., d. less than 10 phr of oil, and e. a cure package, wherein (c) and (d) are present in a total amount of less than 50 phr.", "2 . The tire tread rubber composition of claim 1 , containing no more than 20 phr of carbon black filler.", "3 . The tire tread rubber composition of claim 1 , wherein (c) and (d) are present in a total amount of no more than 40 phr.", "4 . The tire rubber composition of claim 1 , wherein the styrene-butadiene rubber(s) having a silica-reactive functional group have a Tg of about −65 to about −40° C.", "5 . The tire tread rubber composition of claim 1 , wherein (i) consists of two styrene-butadiene rubbers having a silica-reactive functional group in a total amount of 50-80 phr.", "6 . The tire tread rubber composition of claim 1 , wherein (c) and (d) are present in a total amount of no more than 30 phr.", "7 . The tire tread rubber composition of claim 1 , wherein (b) is present in a total amount of 50-89 phr.", "8 . The tire tread rubber composition of claim 1 , containing no more than 10 phr of reinforcing carbon black filler.", "a. 100 parts of an elastomer component comprising: i. at least 50 parts, of one or more styrene-butadiene rubbers having a silica-reactive functional group and each having a Tg of about −65 to about −40° C., and ii. 10-50 parts of natural rubber, polyisoprene, or a combination thereof, b. at least one reinforcing silica filler in an amount of 50-89 phr, c. 11-40 phr of at least one hydrocarbon resin having a Tg of about 35 to about 60° C., d. less than 10 phr of oil, and e. a cure package, wherein (c) and (d) are present in a total amount of no more than 40 phr and the composition contains no more than 20 phr of carbon black filler.", "10 . The tire tread rubber composition of claim 9 , wherein (i) consists of two styrene-butadiene rubbers having a silica-reactive functional group in a total amount of 50-80 phr.", "11 . The tire tread rubber composition of claim 10 , wherein the styrene-butadiene rubber(s) having a silica-reactive functional group of (i) have a Mw of 250,000 to 600,000 grams/mole.", "a. 100 parts of an elastomer component comprising: i. at least 50 parts of two styrene-butadiene rubbers having a silica-reactive functional group each rubber having a Tg of about −65 to about −40° C. and a Mw of 250,000 to 600,000 grams/mole, ii. 10-50 parts of natural rubber, polyisoprene, or a combination thereof, and iii. 0-5 phr of polybutadiene rubber, b. at least one reinforcing silica filler in an amount of 50-89 phr, c. 11-40 phr of at least one hydrocarbon resin having a Tg of about 35 to about 60° C., d. less than 10 phr of oil, and e. a cure package, wherein (c) and (d) are present in a total amount of no more than 40 phr and the composition contains no more than 20 phr of carbon black filler.", "13 . The tire tread rubber composition of claim 1 , wherein the hydrocarbon resin of (c) comprises an aliphatic resin, an aromatic resin, or a combination thereof.", "14 . The tire tread rubber composition of claim 1 , wherein the elastomer component includes 1-5 phr of polybutadiene rubber.", "15 . The tire tread rubber composition of claim 14 , wherein the hydrocarbon resin of (c) comprises an aliphatic resin, an aromatic resin, or a combination thereof.", "a. has a value for tan δ at −30° C. of at least 2.5 times the tan δ at 60° C. value; b. has a value for tan δ at 0° C. of at least 2.5 times the tan δ at 60° C. value; or c. has a value for tan δ at 30° C. of at least 1.1 times the tan δ at 60° C. value.", "a. has a value for tan δ at −30° C. of at least 2.5 times the tan δ at 60° C. value; b. has a value for tan δ at 0° C. of at least 2.5 times the tan δ at 60° C. value; or c. has a value for tan δ at 30° C. of at least 1.1 times the tan δ at 60° C. value.", "19 . The tire tread rubber composition of claim 17 , wherein each of (a), (b), and (c) are met.", "20 . A tire including a tread comprising the tire tread rubber composition of claim 1 ."], "bibtex": "@patent{20250010663,\n    title = {Tire Tread Rubber Composition},\n    number = {20250010663},\n    year = {2025},\n    note = {File: US20250010663A1-20250109.XML}\n    }", "classification": "B60C100FI"}, {"title": "Aircraft Tire Carcass Reinforcements", "doc_number": "20250010664", "filename": "US20250010664A1-20250109.XML", "abstract": "An aircraft radial tire, having a radial carcass reinforcement with a plurality of carcass layers made up of textile reinforcing elements oriented substantially radially, which is to say making an angle of between 75° and 105° with the circumferential direction, the radial reinforcing elements of the carcass layers are composite cords having at least one aramid filament yarn and of which the rupture force is FR, measured in accordance with the standard D885/D885M-10A (2014) and these elements exhibit a deformation at least equal to 4.6% and at most equal to 6.5% for an applied force equal to FR/4. The tenacity of these reinforcing elements is at least equal to 80 daN/mm 2 , and the linear density of the aramid filament yarn or yarns exceeds 210 tex.", "detailed_description": [""], "claims": ["a. this radial carcass reinforcement comprising a plurality of carcass layers made up of textile reinforcing elements oriented substantially radially, which is to say making an angle of between 75° and 105° with the circumferential direction, this reinforcement being anchored to at least one circumferential reinforcement in each bead, b. wherein the radial reinforcing elements of the carcass layers of the carcass reinforcement are composite cords comprising at least one aromatic polyamide filament yarn and of which the rupture force is FR, measured in accordance with the standard D885/D885M-10A (2014) and these elements exhibit a deformation at least equal to 4.6% and at most equal to 6.5% for an applied force equal to FR/4, c. the tenacity of the reinforcing elements of the carcass layers is at least equal to 80 daN/mm the linear density of the aromatic polyamide filament yarn or yarns is at least equal to 210 tex.", "2 . The aircraft tire according to claim 1 , wherein the radial reinforcing elements of the carcass layers of the carcass reinforcement exhibit a deformation at least equal to 5% for an applied force equal to FR/4.", "3 . The aircraft tire according to claim 1 , wherein the tenacity of the reinforcing elements of the carcass layers of the carcass reinforcement is at least equal to 88 daN/mm 2 .", "4 . The aircraft tire according to claim 1 , wherein the tenacity of the reinforcing elements of the carcass layers of the carcass reinforcement is at most equal to 120 daN/mm 2 .", "5 . The aircraft tire according to claim 1 , wherein the diameter of the tire is at most equal to 1450 mm.", "6 . The aircraft tire according to claim 1 , wherein the reinforcing elements of the carcass layers are composite cords made up of two aromatic polyamide filament yarns with a linear mass comprised between 240 and 260 g per km, and of one aliphatic polyamide filament yarn with a linear mass comprised between 200 and 220 g per km, with a twist comprised between 230 and 310 twists per metre, the reinforcing elements being distributed in each carcass layer at a pitch of between 1.0 mm and 1.3 mm.", "7 . The aircraft tire according to claim 1 , wherein the reinforcing elements of the carcass layers of the carcass reinforcement are composite cords made up of one aromatic polyamide filament yarn with a linear mass comprised between 320 and 340 g per km, and of one aliphatic polyamide filament yarn with a linear mass comprised between 130 and 220 g per km, with a twist comprised between 250 and 330 twists per metre, the reinforcing elements of the carcass layers of the carcass reinforcement being arranged in said carcass layers at a pitch of between 0.9 mm and 1.2 mm."], "bibtex": "@patent{20250010664,\n    title = {Aircraft Tire Carcass Reinforcements},\n    number = {20250010664},\n    year = {2025},\n    note = {File: US20250010664A1-20250109.XML}\n    }", "classification": "B60C900FI"}, {"title": "TIRE WITH HIGH COMPRESSION SET ELASTOMER HAVING IMPROVED WEAR PERFORMANCE WITHOUT SACRIFICING HYDROPLANING PERFORMANCE OR SNOW PERFORMANCE", "doc_number": "20250010665", "filename": "US20250010665A1-20250109.XML", "abstract": "A tread design for a tire is described herein that has excellent wear properties, hydroplaning resistance, and snow grip. The combination of features also makes it suitable for use in high torque high load conditions found in modern day light truck applications. The tread ( 18 ) includes a plurality of tread features lateral sipes ( 30 ), lateral grooves ( 28 ), longitudinal sipes ( 31 ) and longitudinal grooves ( 24 ), the longitudinal grooves arranged to form a plurality of ribs ( 32 ), each rib extending annularly around the tread and where adjacent ribs are separated by one of the longitudinal grooves, the plurality of ribs including a pair of shoulder ribs and a plurality of central ribs. At least one of the plurality of central ribs is continuous in the longitudinal direction and the elastomeric material forming the tread possesses high compression set allowing the material to plastically deform creating a more rigid tread structure.", "detailed_description": ["The present disclosure provides tires characterized as having elevated wet hydro and wear performance that not only fail to sacrifice snow and dry performance but also improve snow and dry performance.", "", "For purposes of describing the invention, reference will now be made to particular exemplary embodiments, one or more examples of which are illustrated in particular figures, or in association with particular figures. Each example is provided by way of explanation of the invention, not limitation of the invention. In fact, it will be apparent to those skilled in the art that various modifications and variations can be made in the present invention without departing from the scope or spirit of the invention. For instance, features or steps illustrated or described as part of one embodiment, can be used with the features or steps of another embodiment to yield other embodiments or methods. Thus, it is intended that the present invention covers such modifications and variations as come within the scope of the appended claims and their equivalents.", "", "The following terms are defined as follows for this disclosure:", "", "“Axial direction” refers to a direction parallel to the axis of rotation A of the tire or tire carcass, and its components, such as the outer tread, when rolling along a ground surface. “Lateral direction” or “widthwise direction” or the letter LATdis synonymous with axial direction A.", "", "“Radial direction” or the letter “Rd” in the figures refers to a direction that is orthogonal to the axial direction and extends in the same direction as any radius that extends orthogonally from the axial direction. “Radially inward” means in the radial direction Rdtowards rotational axis A. “Radially inward” means in the radial direction Rdaway from rotational axis A.", "", "“Circumferential direction,” refers to a direction that is orthogonal to the axial direction and orthogonal to a radial direction. The circumferential direction is the direction of the tire along which it rolls or rotates and that is perpendicular to the axis of rotation of the tire. The circumferential direction is also referred to as a longitudinal direction LONGd.", "", "A “groove” is any elongate void or channel arranged within the tread having a pair of opposing sidewalls extending depthwise into the tread and that which are spaced apart greater than 1.6 mm or, in other variations, by at least 2.0 mm. A groove is designed to have a width, based upon the depth of the groove, to remain open as the tread rolls into, through, and out of a contact patch. A “lateral groove” is a groove that extends in a direction oblique to the longitudinal direction (the circumferential direction). A “longitudinal groove” is a groove that extends substantially in the longitudinal direction. A “circumferential groove” is synonymous with a longitudinal groove, each of which extends annularly around the tire. The grooves may be bridged. A groove may have a bridged portion and still be considered a groove, as long as the walls of the groove radially below the bridge are spaced apart greater than 1.6 mm, or in other variations, at least 2.0 mm. In such instances, the bridged portion of the groove may be split by a sipe.", "", "A “sipe” is any elongate void or incision arranged within the tread having a pair of opposing sidewalls extending depthwise into the tread and that which are spaced apart by less than 2.0 mm or 1.6 mm or less in other variations. Sidewalls of the sipe come into contact from time to time as the tread rolls into and out of the contact patch of the tire as the tire rolls on the ground. By lateral sipe, it is meant a sipe that extends in a direction that is oblique to the longitudinal direction.", "", "A “bridged groove” is a groove where a protrusion forming the bridge extends out from one wall of the groove towards the opposing wall leaving a void at the bottom of the groove under the protrusion, the bridge occurring over a portion of the length of the groove. The bridge may be continuous from one groove wall to the opposing groove wall, or the bridge may be a “split bridge groove” split by a sipe. The sipe may be positioned in the center of the bridge, or closer to one wall or the other.", "", "A “tread element” is portion of the tread defined by one or more grooves and/or sipes arranged along the outer, ground-engaging side of the tread. Examples of tread elements include tread blocks and ribs.", "", "The tire is “loaded” when the tire is subject to normal loading conditions such as found when mounted to a vehicle.", "", "A “rib” is a tread element that runs substantially in the longitudinal direction LONGdof the tire and that is bounded by a pair of longitudinal grooves or by a longitudinal groove and any of the pair of lateral sides defining a width of the tread. A rib may include any lateral features, which includes any lateral grooves and lateral sipes, as well as any arrangement of tread blocks.", "", "A “continuous rib” is a rib having substantially no lateral grooves. By “substantially” the rib has 5 or fewer lateral grooves. In other embodiments a “continuous” rib may have no lateral grooves.", "", "A “tread block” is a tread element having a perimeter that is defined by one or more grooves with or without a lateral side of the tread, thereby creating an isolated structure in the tread. A sipe does not define any portion of a tread block perimeter.", "", "A “contact patch” is the total area contained within a perimeter defining an area of contact, the area of the contact patch including the area of contact contained within the perimeter and any void arranged within the area of contact.", "", "“Elastic material” or “elastomer” as used herein refers to a polymer exhibiting rubber-like elasticity, such as a material comprising rubber, whether natural, synthetic, or a blend of both natural and synthetic rubbers.", "", "“Elastomeric” as used herein refers to a material comprising an elastic material or elastomer, such as a material comprising rubber.", "", "“Modulus of elongation” (MPa) was measured at 10% strain (MA10), at 100% strain (MA100), or at 300% strain (MA300) at a temperature of 23° C. based on ASTM Standard D412 on dumb bell test pieces. The measurements were taken in the second elongation; i.e., after an accommodation cycle. These measurements are secant moduli in MPa, based on the original cross section of the test piece.", "", "“Resilient” as used herein means configured to bend and flex elastically without plastic or permanent deformation under intended operating conditions.", "", "“Rigid” as used herein means generally unable to elastically or plastically bend or be forced out of shape under intended operating conditions, as opposed to being resilient.", "", "“Dynamic compression set measure include Goodrich, Firestone and Bridgestone Flexometers. Through imposed deformations, applied loads or periodic impacts, these devices apply cyclic compressive energy to the rubber samples for a specific period of time under controlled environmental conditions. Variations in external conditions can included the imposed stresses or strains, ambient temperature, and relative humidity. Industry standard tests include ASTM test 623A and 623B. Compression set was measured on a Goodrich Flexometer according to ASTM D623A and B with the following conditions: permanent set measured after 30 minutes at 80 C, 0.4 Mpa static pressure (10 lbs.), 17.5% cyclical stroke, and 30 Hz (sample geometry: cylinder, 24 mm long, 17 mm diameter).", "", "“Rolling width,” with reference toFIG.4, refers to a width WRWof the tread20that defines a width of the outer, ground-engaging side22of the tread20. This width WRWis defined in accordance withFIG.4, whereby a distance WB is measured along the radially outermost belt ply402to the center of the last elongate reinforcement44in said ply402at each widthwise extent of said outermost belt ply402. In this instance, ½ of WBis shown. Upon obtaining this dimension, an additional 3 mm (millimeters) is added to each widthwise extent of WB(6 mm in total) along the same curvilinear path along which WBextends, where the 3 mm addition is represented by W+. An imaginary line LNextending normal to the curvilinear path along which WB+extends at each widthwise extent of WB+intersects the outer, ground-engaging side22at point P22. At each lateral side of the tread, opposing points P22as measured in the lateral direction LATddefine the rolling width WRWof the tread20and outer, ground-engaging side22, where inFIG.4one half (½) of WRWis shown.", "", "“Skid depth” or SD20is defined as the thickness of the tread extending from the outer, ground-engaging side of the tread to the deepest tread feature (that is, any longitudinal or lateral groove or sipe) extending into the tread. Any thickness of the tread extending radially inward from the skid depth is referred to as the undertread thickness. In particular instances, with reference toFIG.1, the skid depth SD20extends along a curvilinear path laterally across the tread and between adjacent longitudinal grooves24, intersecting each longitudinal groove bottom26and extending further along an arcuate path into each shoulder rib32S1,32S2at the depth of the deepest lateral groove or sipe, where the skid depth SD20may or may not be arranged substantially the same distance from the radially outermost cap ply50or, if no cap ply is present, the radially outermost belt ply40for distance WB. The skid depth SD20defines the useful thickness of the tread intended to be worn during the life of the tire.", "", "“Contact surface ratio” (CSR) is the surface area of the parts of the tire in contact with the ground to the total area of area inside the perimeter of the contact patch. This is the total area contained within a contact patch (Ac) minus the total void area of the grooves and other voids (Av) as located along the outer, ground-engaging side of the tire tread, which extends annularly around the tire and laterally along the rolling width of the outer, ground-engaging side divided by the total area of the contact patch (Ac) that which includes the total void area of the grooves and other voids (Av). Both areas are measured in mm2. This relationship can be expressed in terms of the following equation: CSR=(Ac−Av)/Ac, where the equation yields a dimensionless number.", "", "Modulus of elongation (MPa) was measured at 10%, 100%, and 300% (MA10, MA100, MA300) at a temperature of 23° C. based on ASTM Standard D412 on dumb bell test pieces. The measurements were taken in the second elongation; i.e., after an accommodation cycle. These measurements are secant moduli in MPa, based on the original cross section of the test piece.", "", "With reference toFIG.1, a pneumatic tire10is shown to generally comprise a pair of annular bead areas12spaced apart axially along a rotational axis A of the tire10, a pair of sidewalls14spaced apart axially along the rotational axis A of the tire10, and a crown portion16arranged widthwise between the pair of sidewalls14and extending annularly around the tire10. Each sidewall14extends outwardly in a radial direction Rdfrom one bead area12of the pair of bead areas12relative to the rotational axis A. In extending widthwise between the pair of sidewalls14, it is a width W16of the crown portion16extending between the sidewalls. Rolling width WRWof the tread20and outer, ground-engaging side22is also shown. Shoulder area is generally designated as18, and includes shoulder ribs32S1,32S2.", "", "With continued reference toFIG.1, the crown portion16includes a tread20arranged annularly around the crown portion16and forming an outer, ground-engaging side22upon which the tire10is intended to roll upon. The tread20has a thickness t20extending in a direction perpendicular to the outer, ground-engaging side22and in a direction toward the rotational axis A of the tire. The tread thickness t20extends from the outer, ground-engaging side22to a skid depth SD20of the tread to define a thickness of the tread intended to be worn during the lifetime of the tire (that is, a wearing depth or thickness of the tire tread). The skid depth SD20is commonly, but not necessarily, arranged at a depth corresponding to the bottom26of the deepest longitudinal groove24. While not necessary, it is commonly the case, such as is shown, where the bottom26of all circumferential (longitudinal) grooves24is arranged at the skid depth SD20. In such instances, while each circumferential (longitudinal) groove depth D24may or may not be of the same depth D24, in the exemplary embodiment shown, all circumferential grooves24are of equal depth D24and extend to and terminate at the skid depth SD20. In certain instances, the average depth D24for all circumferential grooves24is 11 mm. This average is calculated over the full circumference of the tire10. In particular instances, the skid depth SD20is measured at a widthwise (axial) centerline CLAof the tread10, the centerline CLAextending along an equatorial plane PCL, where at this location the skid depth SD20is 11 mm, but may remain the same or vary across the width of the tread. For example, in theFIG.1the skid depth SD20remains generally constant until reaching each shoulder18, while inFIG.4the skid depth SD20gradually decreases as the tread extends laterally along its width. It is noted that the tread thickness t20may extend radially inward deeper to a depth beyond the skid depth SD20, such as is generally shown.", "", "In any embodiment contemplated herein, the tread20is formed of an elastomeric material, such as any natural or synthetic rubber, or any blend thereof. In particular instances, the tread is substantially formed of an elastomeric material to provide a high compression set material which is characterized as having a compression set greater than 4% as measured under the conditions described herein. An elastomeric material so characterized may be formed using any of a variety of formulations. An elastomeric material so characterized may be formed using any of a variety of formulations. In particular instances, the so characterized elastomeric material is a mixture including an elastomer, a filler, and a plasticizer. In this formulation, the elastomer ranges from an SBR/BR blend containing at least 55% BR to 100% BR, or in other variations a 70/30 or 85/15 blend of BR and SBR, respectively. “SBR” means styrene-butadiene rubber while “BR” means butadiene rubber. The filler in this formation comprises silica and carbon black, silica forming 30 wt % to 35.9 wt % and the carbon black forming 0-5 wt % of the total elastomeric material mixture. The High Tg Resin plasticizer in this formation forms 10 wt % to 16 wt % of the total elastomeric material mixture. The vulcanization system of this material is composed of less than 0.8 phr sulfur and less than 3.1 phr of accelerators. The activator system is composed of 1 phr of Stearic acid and 1.9 phr of ZnO. It is appreciated that other formations may be employed to achieve the desired characteristics and properties.", "", "The elastomers useful for forming the elastomeric material compositions disclosed herein, such as for the tread20, may have any microstructure, such microstructure being a function of the polymerization conditions used, in particular of the presence or absence of a modifying and/or randomizing agent and the quantities of modifying and/or randomizing agent used. The elastomers may, for example, be block, random, sequential or micro-sequential elastomers, and may be prepared in dispersion or in solution; they may be coupled and/or starred or alternatively functionalized with a coupling and/or starring or functionalizing agent.", "", "Functionalized rubbers, i.e., those appended with active moieties, are well known in the industry. The backbone or the branch ends of the elastomers may be functionalized by attaching these active moieties to the ends of the chains or to the backbone or mid-chains of the polymer. Exemplary functionalizing agents that could be included with the diene elastomers include, but are not limited to, metal halides, metalloid halides, alkoxysilanes, imine-containing compounds, esters, ester-carboxylate metal complexes, alkyl ester carboxylate metal complexes, aldehydes or ketones, amides, isocyanates, isothiocyanates and imines-all of these being well-known in the art. Particular embodiments may include non-functionalized diene elastomers while other embodiments may be limited to including functionalized elastomers.", "", "Particular embodiments of the rubber compositions disclosed herein are limited to those having at least 80 phr of the rubber components being highly unsaturated diene elastomers. Other embodiments are limited to having at least 90 phr or 100 phr of the highly unsaturated diene elastomer components.", "", "Examples of suitable highly unsaturated diene elastomers include, but are not necessarily limited to natural rubber (NR) and synthetic rubbers such as polybutadienes (BR), polyisoprenes (IR), butadiene copolymers, isoprene copolymers and mixtures of these elastomers. Such copolymers include butadiene/styrene copolymers (SBR), isoprene/butadiene copolymers (BIR), isoprene/styrene copolymers (SIR) and isoprene/butadiene/styrene terpolymers (SBIR). Any of these examples or mixtures of these examples are suitable for particular embodiments of the rubber compositions disclosed herein.", "", "In particular embodiments, useful SBR elastomers may have a bound styrene content of between 1 mol % and 45 mol % or alternatively between 15 mol % and 40 mol % or between 20 mol % and 30 mol %.", "", "With reference toFIG.3, the crown portion16further includes one or more belt plies40(generally, while more specifically showing first and second belt plies401,402) each forming a layer of elastomeric material42reinforced with a plurality of elongate reinforcements44spaced apart in an array, the one or more belt plies being arranged radially inward and below the tread. Together, the one or more belt plies form a “belt,” the belt also being referred to as a “belt structure” and forming an annular structure formed by all of the one or more belt plies40). Each elongate reinforcement44may be formed of metal or non-metal elongate reinforcements, where the elongate reinforcements44are formed of a plurality of filaments arranged lengthwise and twisted along their lengths as desired. Metal elongate reinforcements are constructed from filaments most commonly formed of steel, but may be formed any metal having desirous properties. Non-metal reinforcements are constructed from filaments formed of any fabric or textile, such as polyester, rayon, nylon, aramid, silk, and/or fiberglass. In the exemplary embodiment shown, the tire10includes a pair of belt plies40to form an annular belt structure, although any single belt ply40or three or more belt plies40may be employed to achieve the desired properties of the annular belt structure formed by any one or more belt plies40.", "", "With continued reference toFIG.3, the crown portion16of the embodiment shown further includes a cap ply50arranged radially outward from the one or more belt plies40and from the annular belt structure formed by all belt plies contained within the tire. The cap ply50is arranged between the tread20and the one or more belt plies40(that is, belt). The cap ply50extends at least partially or substantially across a full width of at least one of the belt plies40or more generally at least partially or substantially across a full width of the belt. In doing so, the cap ply50is at least partially arranged within each shoulder18or shoulder rib32S1,32S2.", "", "The cap In particular instances, each of the first and second shoulder ribs have a width ply50is formed of a layer of elastomeric material52reinforced with a plurality of elongate reinforcements54spaced apart in an array. The elongate reinforcements54are arranged to extend lengthwise substantially in a circumferential direction Cdof the tire, that is, in a direction substantially parallel to a plane PCLbisecting the tire at its equatorial centerline CLAand extending perpendicular to rotational axis A. “Substantially parallel” means that any such elongate reinforcement54extends by an angle or 0 to 5 degrees in absolute value (that is, spanning −5 degrees to 5 degrees) relative to the longitudinal direction LONGdor plane PCL.", "", "Cap ply50may be applied in any desired manner. For example, in certain exemplary instances, cap ply50is formed using one or more sheets wound once around the tire, the sheets including the elastomeric material52and elongate reinforcements54, while in other exemplary instances the cap ply50is formed using one or more strips wound multiple revolutions around the tire in a helical configuration, the strips including the elastomeric material52and elongate reinforcements54. In winding into a helical configuration, each wind of the strip is arranged to abut the adjacent wind of strip, or, in other variations, may be spaced apart from or overlap an adjacent wind by as much as a 50% (providing a spacing or overlap, where, for example, a 50% overlap forms ½ pace between winds of the strip). It is appreciated that one or more cap plies50may be employed. At each widthwise end of the belt, before beginning the helical wind at one end and after reaching the other end after making the plurality of helical winds, a full revolution of the cap strip is made. In doing so, the cap ply extends 4 mm to 14 mm beyond the belt, that is, beyond the widest of the one or more belt plies40at each widthwise extent of the belt.", "", "Each elongate reinforcement54may be formed of metal or non-metal elongate reinforcements, where elongate reinforcements are formed of a plurality of filaments arranged lengthwise and twisted along their lengths as desired. Metal elongate reinforcements are constructed from filaments most commonly formed of steel, but may be formed any metal having desirous properties. Non-metal reinforcements are constructed from filaments formed of any fabric or textile, such as polyester, rayon, nylon, aramid, silk, and/or fiberglass.", "", "For any belt or cap ply formed of elastomeric material having elongate reinforcements, the array of elongate reinforcements may be coated with the elastomeric material or skim (layers) of elastomeric may be applied to opposing sides of the array. It is appreciated, however, that any other manner may be employed for providing any such ply.", "", "With reference toFIGS.1and2, the tire tread20includes a plurality of features extending a depth within the tread thickness that include longitudinal (circumferential) grooves24, lateral sipes31, lateral grooves28, and lateral sipes30. These features are arranged along the outer, ground-engaging side22, although any such feature may be submerged below the outer, ground-engaging side22to be later exposed after a particular depth of the tread20has been worn away. In the embodiment shown, the longitudinal grooves24are arranged to form a plurality of ribs32, each rib extending annularly around the tread such that adjacent ribs are separated by one of the longitudinal grooves24. The plurality of ribs include a first shoulder rib32S1, a second shoulder rib32S2, and a plurality of central ribs32C. Each of the first and second shoulder ribs32S1,32S2are arranged along one of opposing widthwise extents of the outer, ground-engaging side22, where the plurality of central ribs32Care arranged axially (laterally) between the first and second shoulder ribs32S1,32S2. Generally, in combination with the different embodiments contemplated herein, each of the ribs32S1,32S2,32Cmay be characterized as having any desired width, where the rib widths W32may be the same or different between the ribs32S1,32S2,32C. In particular instances, each of the first and second shoulder ribs have a width W32equal to 19% to 35% of the tread width. Further, in certain instances, the width W32of each first and second shoulder rib32S1,32S2has a width W32equal to 186% to 335% of an average width of the central ribs32C. While the average width W32of each central rib32Cmay be different than any one or more of the other central ribs32C, in particular instances the average width W32of each central rib is substantially the same. It is appreciated that while any number of ribs may be employed, in certain embodiments the tread has 6 ribs (shown) or 5 ribs (not shown). In the embodiment shown, the tire tread features form an symmetrical (albeit, not “mirrored”), non-directional tire tread pattern design, where non-directional means that the tire may be mounted in to rotate in either of opposing circumferential directions. It is appreciated, however, that a directional tread pattern design may also be employed and likewise it may have a symmetrical tread pattern mirrored across the center line (CLA) or an asymmetrical tread pattern.", "", "In other embodiments the first and second shoulder ribs have a width W32equal to 19% to 25% of the tread width. Further, in these instances, the width W32of each first and second shoulder rib32S1,32S2has a width W32equal to 240% to 310% of an average width of the central ribs32C.", "", "With reference toFIGS.1and2, it is also noted that longitudinal grooves24each have a width W24defined by a pair of opposing groove sidewalls27. It is appreciated that each of the longitudinal grooves24may have the same of different widths W24, and in particular embodiments the longitudinal groove widths W24are selected to provide the contact surface ratios discussed elsewhere herein. While each groove sidewall27may extend into the tread thickness t20at any angle a relative to a direction perpendicular to the outer, ground-engaging side22, in particular exemplary instances each groove sidewall27extends at an angle α measuring 0° to 12° relative to a direction perpendicular to the outer, ground-engaging side22. As noted previously, each longitudinal groove24has a depth D24extending into the tread thickness to a bottom26, where all of the longitudinal grooves may be of the same or different depth D24. Longitudinal sipe31may be present in the tread extending into the tread thickness t20at any angle relative to the direction perpendicular to the outer ground engaging side22. In the embodiment shown, the sipes extend at an angle perpendicular to the ground engaging side22.", "", "In at least one embodiment of the present invention, a plurality of longitudinal sipes31occur between at least two adjacent central longitudinal ribs as shown inFIG.6, which is a cross section taken along line6-6ofFIG.5. The sipes occur within a bridge33over a longitudinal groove24that extends from one central rib32C to an adjacent central rib32C. Each longitudinal sipe31is shown to be positioned midway between the adjacent ribs24and extend perpendicular to the ground engaging side22in the present embodiment. A plurality of bridges33are intermittently placed longitudinally around the tire within the at least one longitudinal groove24thereby having bridged groove portions of the longitudinal groove separated by non-bridged groove portion of the longitudinal groove. The void beneath the bridge33allows water to egress from the groove as the tire rolls. The bridge provides additional surface area to make contact with the road surface and the narrow sipe31allows for additional stability when the tire is compressed in the contact patch and the two sides of he bridge33make contact with one another. In the embodiment shown, three central groves24between the four central ribs32Ceach possess a plurality of bridges33having longitudinal sipes31.", "", "With continued reference toFIG.2, it is noted as well that tread20includes lateral grooves28and lateral sipes30, all of which together are referred to as lateral features. It is noted that should any adjacent lateral features be arranged within 1 mm of one another, the adjacent features are considered a single feature. Notably, in the present embodiment, at least one of the central ribs32Care continuous ribs, that is, they lack any lateral grooves28. The shoulder ribs32S1,32S2possess a plurality of lateral grooves. This creates a higher CSR of the central portion of the tread compared to the shoulder region of the tread, and in particular increases the CSR of the central ribs32Cwhen compared to the shoulder ribs as well as increases the longitudinal rigidity of the central ribs32Ccompared to the shoulder ribs32S1,32S2.", "", "With general reference toFIG.2, it is appreciated that each lateral feature (lateral grooves28and lateral sipes30) may include a chamfer arranged at the intersection of a lateral feature28,30(a sidewall thereof) with the outer, ground-engaging side22.", "", "In any embodiment contemplated herein, the lateral grooves may have an inclination angle. With reference toFIGS.4A and4B, these angles ψ may be measured relative to the longitudinal direction LONGd, where angle ψ is measured between the longitudinal direction LONGdand a line LNextending normal to the groove length L28. InFIG.4A, each lateral groove28extends linearly. InFIG.4B, where each lateral groove extends lengthwise along a curvilinear path, the average angle may be measured differently. For example, in the figure shown, the average angle ψ is obtained by extending an imaginary line Lavgfrom the terminal ends of the lateral groove length L28at a widthwise centerline CLWof the lateral groove28, where the terminal ends here are arranged at each lateral side of the tread block although in other variations a lateral groove may terminate inward of any side edge of the tread block. In other instances, an imaginary line Lavgmay be determined using linear regression taking into account the lengthwise path of the longitudinal groove widthwise centerline CLW. Once the imaginary line Lavgis determined, angle ψ is measured relative to a line LNextending normal therefrom. In other variations, angle ψ may be measured relative to the lateral direction LATdfrom a linear longitudinal groove length L28or from the imaginary line Lavg.", "", "In any embodiment contemplated herein, an average spacing (density) is contemplated for all lateral features, that is, all lateral grooves28and all lateral sipes30. Specifically, with reference toFIGS.4A and4B, a spacing S (S1, S2, S3, S4) is provided between adjacent lateral features28,30, whether adjacent lateral features form a pair of lateral grooves28, a pair of lateral sipes30, or a lateral groove28and a lateral sipe30. It is noted that LS identifies a leading side of the tread block shown as formed by a lateral groove, while TS identifies a trailing side of the tread block as formed by a lateral groove. While the spacings S are shown to be constant, spacings S may be variable in other instances. It is appreciated that the average angle may be the same or vary amongst the various ribs32S1,32S2, and32C.", "", "With reference toFIGS.4A and4B, these spacings S are measured relative to the longitudinal direction Longd, where spacing S is measured in the direction of a line LNextending normal to the lateral feature length L28, L30. InFIG.4A, each lateral feature28,30extends linearly. InFIG.4B, where each lateral groove extends lengthwise along a curvilinear path, the spacing S (S1, S2, S3) is measured in a direction defined by a lineNextending normal to an imaginary line Lavgextending through the terminal ends of the lateral groove length L28at a widthwise centerline CLWof the lateral groove28, where the terminal ends here are arranged at each lateral side of the tread block although in other variations a lateral groove may terminate inward of any side edge of the tread block. In other instances, an imaginary line Lavgmay be determined using linear regression taking into account the lengthwise path of the longitudinal groove widthwise centerline CLW. Once the imaginary line Lavgis determined, the spacings S (S1, S2, S3) are measured in the direction of line LNextending normal to line Lavg.", "", "It is appreciated that each of the tread features, that is, each of the longitudinal grooves24, lateral grooves28, lateral sipes30, and compliance features34(partial depth grooves or sipes extending substantially in the longitudinal direction LONGd) form edges located at the intersection of the depth wise extension of each such tread feature and the outer, ground-engaging side22. In other words, an edge is formed where any sidewall of any lateral sipe or of any lateral groove intersects the outer, ground-engaging side. As noted previously, some of these tread features may include one or more chamfers60, and so the edges may be arranged at the intersection of the chamfer with the outer, ground-engaging side22. In any event, as described above in conjunction withFIG.6, a longitudinal lateral sipe edge density may be determined for the lateral sipes30, while a longitudinal non-lateral sipe edge density may be determined collectively for the other tread features, namely, for all longitudinal grooves24, lateral grooves28, and the elongate compliance features34(that is, all partial depth grooves or sipes extending in the longitudinal direction), in combination.", "", "As defined above, longitudinal contact surface ratio (longitudinal CSR) associates the total area of the outer, ground-engaging side minus all void present along the outer, ground-engaging side provided by all circumferential grooves with the total area arranged along the outer, ground-engaging side22in the form of a ratio. The total area of the outer, ground-engaging side22includes both the surface area of the tread and all void arranged along the outer, ground-engaging side, represented as surface area void along the outer, ground-engaging side.", "", "FIG.7shows a typical prior art comparative light truck tire tread20′, having five ribs32′ of tread blocks, with each rib having individual blocks separated by lateral groove28′ and each block possessing a plurality of lateral sipe features30′. The conventional wisdom of tire design of a tire having good wear was to provide a tire with each of the ribs having a similar contact surface ratio. In order to provide adequate wet hydroplane performance, large open longitudinal grooves and ample lateral grooves provided space for water egress as the tread rolls through the contact patch. Interfering with this egress, by providing longitudinal bridging or other features within these longitudinal blocks, would have been thought to impede water egress and increase the potential for tire hydroplaning (where the tire would decrease or lose its contact with the ground surface, and therefore loose traction).", "", "The novel light truck tire presented surprisingly possesses remarkably reduced wear compared to such prior art sculpture designs, while maintaining or even improving upon wet hydroplane traction, snow and dry traction performance. Such performance improvement is not anticipated by the design of a tire that occludes longitudinal groove water evacuation and limit lateral grooves in one or more central ribs. The tire's solid central rib provides a ridged rubber interface with the ground surface. Since it is understood that tire wear occurs as the tread block slips as it enters and exits the contact patch, providing a central rib lacking lateral grooves provided the expected improvement of reduced tire wear. The solid central rib, or ribs in the case of the present embodiment, help further reduce deformation of the tread rubber under the heavy loading and heavy torque of light truck tire loading. This reduces the rubber shear strain at the trialing edge of the contact patch while providing the necessary longitudinal and or transversal forces required for vehicle motion. The increased rib rigidity reduces the slip between the tire tread surface20and the ground surface as the rubber exits tire contact patch. These two effects reduce the tire tread wear as shown inFIG.8even under the demanding power and torque performances of modern light truck tires.", "", "FIG.8shows a graph of predictive tire wear based on testing of the tires under real life conditions. The data is obtained by subjecting test tires to wear on actual on-road travel over an abbreviated duration as specified in the horizontal axis and measuring tread wear periodically during the testing. Based on the rate of tread wear, as measured by the tread depth, the predictive milage, shown on the vertical axis, is calculated at which point the model predicts the tread will have reached at least 2/32 tread depth, representing the tread life of the tire. As can be seen in the figure, the witness tire (W) represents a light truck tire having a tread sculpture represented byFIG.7. The inventive tread sculpture is represented by E1of the figure. A significant increase in tread wear performance is observed, with the predictive model having a similar upward slope, representing a similar reduced tread wear rate as the tire wears. The inventive tread sculpture having a tread compound having increased compression set is represented by E2in the graph. The unexpected improvement is shown by the marked increase of slope of the wear graph line of E2. This represents that the wear rate is similar to E1initially, as would be expected, but improves dramatically as the tire tread experiences compression set. The rubber, over time, plastically deforms under dynamic conditions and due to the poison effect, the sipes' gaps in the tread close. This phenomenon causes the tread blocks to lock up and have an overall increase in effective tread stiffness, synergistically improving tread wear.", "", "The wet braking performance of a tire mounted on an automobile fitted with an ABS braking system is measured by determining the distance necessary to go from 40 mph to a complete stop upon sudden braking on a wetted (no puddles) asphalt surface. A value greater than that of the control, which is arbitrarily set to 100, indicates an improved result, i.e., a shorter braking distance indicating improved wet grip.", "", "A 5% improvement in stopping distance was observed in proprietary wet braking testing as described above using a light truck. Generally, a higher contact surface area would be expected to decrease wet braking performance. The applicant hypothesize that the increase hydro performance is due to the higher contact surface ratio in the center of the tire, and, relative to the center, a lower contact surface ratio in the shoulders, combined with lateral groove feature in the shoulders which it is hypothesized has a similar effect to that of “rounding” the contact patch. As such, the water is pushed by the tire from the centerline of the tire at the beginning of the contact patch to the outside shoulder areas where the water is evacuated by the lateral and longitudinal features. The intermittent bridges allow for limited but adequate water evacuation in the central portion of the tire toward the middle of the contact patch. This hydro-performance, however, was not anticipated, and the applicant's initial expectation was a decrease of hydro-performance due to the increased contact surface ratio and longitudinal grooves interrupted by lateral bridging.", "", "Snow performance was evaluated by a “GM spin test” and a subjective snow handling test. GM spin testing was performed to evaluate the inventive tread sculpture compared to the prior art witness sculpture. The grip on snow-covered ground is evaluated by measuring the forces on a single driven axle test in snow according to the ASTM F1805 test method. The vehicle travels at a constant 5 mph speed and the forces are measured on the single test tire at the target slip. A value greater than that of the Standard Reference Test Tire (SRTT), which is arbitrarily set to 100, indicates an improved result, i.e., improved grip on snow. Subjective snow testing was performed by a Lateral acceleration under snow conditions is measured objectively using accelerometers during vehicle testing along a testing course. During such testing, at least 5 laps along a road course were conducted by different drivers, where subjective snow handling measures were provided by the drivers according to SAE standards while accelerometers were used to measure acceleration, deceleration, and lateral accelerations along predefined segments along the testing course. The data was filtered and averaged to provide accurate results.", "", "Both the GM spin test and the subjective snow handling test showed an unexpected similar performance to that of the prior art tread sculpture. With reduced lateral voids, a tire designer would expect the ability for the tire to “bite” into the snow to be reduced. This reduced lateral void would mean less traction on snow for subjective handling and it would be expected to reduce the performance of the GM spin test. What was found during testing, however, was different than what was expected. In GM Spin testing, there was not a significant difference between the tire with the inventive sculpture and the prior art witness. During subjective snow handling, the inventive tire was credited with a 0.5-point advantage over the witness tire. In particular the bridged center section is believed to provide areas for snow packing despite the reduced lateral grooves and the bridged portions provide an additional lateral edge for additional snow traction.", "", "To the extent used, the terms “comprising,” “including,” and “having,” or any variation thereof, as used in the claims and/or specification herein, shall be considered as indicating an open group that may include other elements not specified. The terms “a,” “an,” and the singular forms of words shall be taken to include the plural form of the same words, such that the terms mean that one or more of something is provided. The terms “at least one” and “one or more” are used interchangeably. The term “single” shall be used to indicate that one and only one of something is intended. Similarly, other specific integer values, such as “two,” are used when a specific number of things is intended. The terms “preferably,” “preferred,” “prefer,” “optionally,” “may,” and similar terms are used to indicate that an item, condition or step being referred to is an optional (i.e., not required) feature of the embodiments. Ranges that are described as being “between a and b” are inclusive of the values for “a” and “b” unless otherwise specified.", "", "While various improvements have been described herein with reference to particular embodiments thereof, it shall be understood that such description is by way of illustration only and should not be construed as limiting the scope of any claimed invention. Accordingly, the scope and content of any claimed invention is to be defined only by the terms of the following claims, in the present form or as amended during prosecution or pursued in any continuation application. Furthermore, it is understood that the features of any specific embodiment discussed herein may be combined with one or more features of any one or more embodiments otherwise discussed or contemplated herein unless otherwise stated."], "claims": ["a pair of annular bead areas spaced apart axially along a rotational axis of the tire; a pair of sidewalls spaced apart axially along the rotational axis of the tire, each sidewall of the pair of sidewalls extending outwardly in a radial direction from one bead area of the pair of bead areas relative to the rotational axis; a crown portion arranged widthwise between the pair of sidewalls and extending annularly around the tire; the crown portion including a tread formed of elastomeric material arranged annularly around the crown portion and forming an outer, ground-engaging side upon which the tire is intended to roll upon, the tread having a thickness extending radially and a width extending axially, the tread forming a wearing portion the tire; the crown portion further including one or more belt plies each forming a layer of elastomeric material reinforced with a plurality of elongate reinforcements spaced apart in an array, the one or more belt plies being arranged radially inward and below the tread; the crown portion further including a pair of shoulders, each shoulder forming a portion of the crown arranged adjacent to each sidewall; the tread including a plurality of tread features extending a depth within the tread thickness which includes lateral sipes, lateral grooves, and longitudinal grooves, the longitudinal grooves arranged to form a plurality of ribs, each rib extending annularly around the tread and where adjacent ribs are separated by one of the longitudinal grooves, the plurality of ribs including a pair of shoulder ribs and a plurality of central ribs, each of the shoulder ribs arranged along one of opposing widthwise extents of the outer, ground-engaging side and within one of the shoulders and where the plurality of central ribs are arranged between the pair of shoulder ribs; the plurality of tread features extending into the tread thickness substantially to a depth defining a skid depth of the tread, the skid depth being the thickness of the tread intended to be worn during the intended life of the tire tread; wherein at least one of the plurality of central ribs is continuous in the longitudinal direction; wherein the elastomeric material forming the crown possesses a compression set of greater than 4%.", "2 . The tire of claim 1 wherein at least two of the plurality of central ribs are continuous in the longitudinal direction.", "3 . The tire of claim 2 wherein the at least two of the plurality of central ribs are separated from each other by a bridged longitudinal groove.", "4 . The tire of claim 3 wherein the bridged longitudinal groove comprises a plurality of bridged portions, each bridge possessing a longitudinal sipe.", "5 . The tire of claim 4 wherein the plurality of longitudinal ribs have a plurality of longitudinally spaced apart lateral sipes", "6 . The tire of claim 5 wherein the plurality of longitudinally spaced apart lateral sipes extend across the width of the plurality of longitudinal ribs.", "7 . The tire of claim 6 wherein the plurality of longitudinally spaced apart lateral sipes possess a pair of opposed surfaces within the sipe and the opposed surfaces make contact with each other when the tire is loaded.", "8 . The tire of claim 1 , wherein the at least one of the plurality of continuous central ribs has at least one but less than five lateral grooves.", "9 . The tire of claim 1 wherein the tread substantially formed of an elastomeric material characterized as having a compression set greater than 5%.", "10 . The tire tread of claim 9 wherein the tread is substantially formed of an elastomeric material characterized as having an (MA10) of 5.75 to 9.5 MPa and MA300 of 1.3 to 1.7 MPa.", "11 . The tire tread of claim 10 wherein the tread is substantially formed of an elastomeric material characterized as having an (MA10) of 6.1 to 6.7 Pa and MA300 of 1.4 to 1.7 MPa.", "12 . The tire tread of claim 1 , where each of the inner and outer shoulder ribs have a width equal to 19% to 35% of the tread width.", "13 . The tire tread of claim 1 , where each of the inner and outer shoulder ribs have a width equal to 19 to 25% of the tread width.", "14 . The tire tread of claim 10 further comprising a center section, the center section forming a portion of the crown extending between the pair of shoulders, the center section and shoulders, the center section having a center contact surface ratio, and the pair of shoulders having a first contact surface ratio and a second contact surface ratio, wherein the center contact surface ratio is greater than the first shoulder contact surface ratio and the center contact surface ratio is greater than the second contact surface ratio."], "bibtex": "@patent{20250010665,\n    title = {TIRE WITH HIGH COMPRESSION SET ELASTOMER HAVING IMPROVED WEAR PERFORMANCE WITHOUT SACRIFICING HYDROPLANING PERFORMANCE OR SNOW PERFORMANCE},\n    number = {20250010665},\n    year = {2025},\n    note = {File: US20250010665A1-20250109.XML}\n    }", "classification": "B60C1112FI"}, {"title": "PNEUMATIC TIRE WITH A TEXTURED SURFACE, METHOD OF MANUFACTURING, AND TEXTURED MOLD", "doc_number": "20250010666", "filename": "US20250010666A1-20250109.XML", "abstract": "A tire mold having a sidewall molding surface with a negative irregular rough surface texture pattern extending circumferentially along the sidewall molding surface so as to mold at least one annular exterior surface of a tire sidewall of a tire with an irregular rough surface texture, the negative irregular rough surface texture pattern defining recessed portions disposed non-uniformly between raised portions, the recessed portions having a depth of at least 0.1 millimeters.", "detailed_description": ["While the specification concludes with claims defining the features of the disclosure that are regarded as novel, it is believed that the disclosure will be better understood from a consideration of the following description in conjunction with the drawing figures, in which like reference numerals are carried forward. It is to be understood that the disclosed embodiments are merely exemplary and can be embodied in various forms.", "", "The present disclosure provides a novel and efficient tire mold, pneumatic tire, and method of producing the same with an irregular rough surface texture finish on the annular exterior surfaces of the tire that provides a unique textured visual appearance. Embodiments include irregular rough surface texture finishes with recessed portions non-uniformly disposed between irregular raised portions on a tire sidewall. In addition, embodiments of include the recessed portions having an irregularity depth of between 0.1 millimeters and 0.5 millimeters. As used herein, the term “between” and the ranges recited herein are intended to be inclusive of the outer limits defining the range (e.g., inclusive of 0.1 millimeters and 0.5 millimeters). In one embodiment, the rough surface texture finish may resemble rough sandpaper and, in an alternative embodiment, the rough surface texture finish may resemble a non-uniformly spaced apart pebble arrangement.", "", "Referring now toFIG.1, one embodiment is shown in a perspective view.FIG.1shows several advantageous features of the present disclosure, but, as will be described below, the embodiments can be provided in several shapes, sizes, combinations of features and components, and varying numbers and functions of the components. The first example of a tire molding surface100with a negative irregular rough surface texture pattern102, as shown inFIG.1, is provided in the form of a sidewall ring plate104.", "", "As will be discussed herein below, with reference toFIGS.8and9, a tire mold900used in accordance with the present disclosure may be a three-piece tire mold with a pair of sidewall ring plates104aand104b(for each sidewall) and a tread molding portion902(seeFIG.9). The sidewall molding surfaces in accordance with the present disclosure will be discussed with reference to the annular surface of the sidewall ring plate104; however, it should be understood that some alternative embodiments may provide for sidewall molding surfaces in other types of tire molds, such as a one-piece tire mold in which the sidewall molding surfaces and the tread molding surfaces are integral with one another.", "", "As can be seen inFIG.1, in a preferred embodiment, the negative irregular rough surface texture pattern102extends circumferentially along substantially the entire sidewall molding surface100, except for the portions of the sidewall molding surface with lettering-numbering and/or logos. Stated another way, the negative irregular rough surface texture pattern102may extend circumferentially continuously 360 degrees along the sidewall molding surface100. Accordingly, as a result of a green tire800being cured in the tire mold900(seeFIG.9), an annular exterior surface1000of a tire sidewall1002is provided with an irregular rough surface texture finish1004that extends continuously circumferentially along the tire sidewall1002(seeFIG.10). As should be apparent to those of ordinary skill in the art, the negative pattern102on the sidewall molding surface100should be a mirror image of the resulting pattern on the cured tire sidewall1002.", "", "In another embodiment, the negative irregular rough surface texture pattern102may extend circumferentially less than 360 degrees along the sidewall molding surface100, such as, for example 270 degrees, 180 degrees, or 90 degrees along the sidewall molding surface100. As should be apparent to those of ordinary skill in the art, the negative pattern102on the sidewall molding surface100should be a mirror image of the resulting pattern on the cured tire sidewall1002.", "", "In yet other embodiments, the negative irregular rough surface texture pattern102may extend discontinuously, circumferentially along the sidewall molding surface100. In other words, the negative irregular rough surface texture pattern102may have intervals or gaps between sub-sections of the negative irregular rough surface texture. The intervals or gaps may be formed as smooth surfaces to contrast with the irregular rough surface texture sub-sections. Alternatively, the intervals or gaps between sub-sections of the negative irregular rough surface texture may be formed as a different/alternating negative irregular rough surface texture sub-sections. In a further embodiment, the negative irregular rough surface texture sub-sections may be equally spaced apart from one another. As should be apparent to those of ordinary skill in the art, a discontinuous, negative pattern102on the sidewall molding surface100should be a mirror image of the resulting pattern on the cured tire sidewall1002.", "", "Referring now primarily toFIG.2, a sidewall ring plate200(similar to the sidewall ring plate104depicted inFIG.1) is shown in a front elevational view with multiple negative irregular rough surface texture patterns102a,102b,102c,and102d.Although preferred embodiments include the sidewall molding surface100with a single irregular rough surface texture pattern102extending circumferentially along the molding surface100, as illustrated inFIG.1; for illustrative purposes the sidewall ring plate200shown inFIG.2includes four patterns102a,102b,102c,102don each quarter of the molding surface100for purposes of describing the various rough surface patterns that may be provided in accordance with various embodiments of the present disclosure.", "", "In the exemplary embodiment, the negative irregular rough surface texture pattern102defined on the sidewall molding surface100may be considered a pebble pattern102a.Stated another way, the negative irregular rough surface texture pattern102may be configured to mold a pebble pattern on the annular exterior surface1000of the tire sidewall1002.", "", "Referring now specifically toFIG.4, with reference still toFIG.2, the negative irregular rough surface texture pattern102(shown inFIG.4as a cross-section of the pebble pattern102a) may define recessed portions400disposed non-uniformly between raised portions402. The raised portions402may be the irregular-shaped pebble portions of the pattern102aand the recessed portions400may be the irregular-shaped spaces between pebble portions of the pattern102a.The pebble portions may be considered generally circular or oval in overall shape, yet follow an irregular curve-shaped path/outline, similar to the irregular-shape of pebbles, hence the name “pebble pattern.” The spaces between the pebble portions may be non-linear and non-uniform in dimension in some embodiments (as shown inFIG.4).", "", "The recessed portions400and the raised portions402may be considered to vary non-uniformly in size and shape, one from another, along the sidewall molding surface100. Stated another way, the dimensions of the recessed portions400and the dimensions of the raised portions402may vary randomly along the sidewall molding surface100. In particular,FIG.4shows an embodiment in which the widths of the recessed portions400, Wa(recess)-Wn(recess), vary non-uniformly one from the other. Similarly,FIG.4shows an embodiment in which the widths of the raised portions402, Wa(raised)-Wn(raised), vary non-uniformly one from the other. The number of raised portions402and the number of recessed portions400may be any number from a to n.", "", "In one embodiment, the raised portions402may have a maximum width, Wa(raised), or diameter that is 1.5 millimeters. In another embodiment, the raised portions402may have a maximum width, Wa(raised), that is 1 millimeter. In yet another embodiment, the raised portions402may have a maximum width, Wa(raised), that is 2.5 millimeters. In yet other embodiments, the raised portions402may have a maximum width, Wa(raised), that is outside of those ranges.", "", "In some embodiments, a width and a depth of the recessed portions400may be the same across the pattern102, yet the path and shape of the recessed portions400may still be irregular and follow a non-uniform path across the pattern102. This may be the case, for example, in embodiments in which a laser beam may be used to etch an irregular pattern on a generally planar steel plate. The laser beam may create recessed portions400that have substantially the same width and depth (corresponding to the strength and size of the laser beam); however, the path that the laser beam follows should be irregular or non-uniform to create an irregular, non-uniform rough surface texture on the molding surface100.", "", "Similarly, a height of the raised portions402may, in some embodiments, be the same across the pattern102, yet the shape and/or width of the raised portions402may be irregular and non-uniform across the pattern102. In other words, the shape of one raised portion402may be different from the shape of its neighboring raised portion402, as with actual pebbles (see for exampleFIG.2pebble)", "", "The recessed portions400and raised portions402should be provided with dimensions that create an irregular rough surface texture finish1004on the tire sidewall1002(seeFIGS.10and11) that is visually discernable by an outside observer. In other words, the irregular rough surface texture finish1004(whether it resembles sandpaper or a pebble pattern) should be visually discernible as compared to the other exterior surfaces of the tire. Stated yet another way, the irregular rough surface texture finish1004should be configured as an apparent tire sidewall pattern that was intentionally created to provide a unique visual effect on the tire sidewall1002, as opposed to mere random surface defect irregularities that may only be visible by a very close-up tire inspection.", "", "In one embodiment, the negative irregular rough surface texture pattern102may be provided with dimensions to create an irregular rough surface texture finish1004on the tire sidewall1002(seeFIGS.10and11) that is visually discernible by an observer from at least 5 feet away from the tire sidewall1002. In yet another embodiment, the irregular rough surface texture finish1004may be configured to be visually discernible by an observer from at least 10 feet away from the tire sidewall1002. Importantly, the irregular rough surface texture finish1004should provide a unique look and feel to the tire sidewall1002, which departs from the conventional glossy sidewall appearance that is sought after, or the uniform regular tire sidewall patterns existing in the art today.", "", "In one embodiment, the recessed portions400have a depth404of at least 0.1 millimeters. In another embodiment, the recessed portions400may have a depth404that is 0.3 millimeters. In yet another embodiment, the recessed portions400may have a depth404that is 0.5 millimeters. In yet another embodiment, the recessed portions400may have a depth404of between 0.1 to 0.5 millimeters. The depth404of the recessed portions400may also be referred to as an irregularity depth.", "", "A height406of the raised portions402may correspond to the depth404of the recessed portions400. For example, in an embodiment where a smooth/planar sidewall molding surface is laser etched with an irregular rough surface texture pattern to create the rough textured, sidewall ring plate104, the laser beam may create the recessed portions400, which thereby define the raised portions400. In other words, the raised portions400may be considered the remaining surfaces of the planar sidewall molding surfaces that were not cut/etched by the laser beam. Accordingly, in some embodiments, the raised portions402may have a height406of at least 1 millimeter. In another embodiment, the raised portions402may have a height406that is 0.3 millimeters. In yet another embodiment, the raised portions402may have a height406that is 0.5 millimeters. In yet another embodiment, the raised portions402may have a height406of between 0.1 to 0.5 millimeters.", "", "The amount and dimensions of the raised portions402and the amount and dimensions of the recessed portions400should preferably be selected to be sufficiently substantial to be visually discernible by an outside observer, but also not too large to be susceptible to cracks in the tire sidewall. For example, while a greater depth404of the recessed portions400and a greater height406of the raised portions402may be more visually discernible to an outside observer for some patterns, if the recessed portions400are too deep over time the tire sidewall may be at an unacceptable risk of forming cracks too early in the tire life cycle.", "", "Although the description thus far has been primarily focused on describing the negative irregular rough surface texture pattern102, with reference to the pebble pattern102adepicted inFIGS.2and4, it should be understood that other embodiments may provide other types of irregular rough surface texture patterns102b,102c,and102d.The description herein above with respect to the dimensions of the raised portions402and the recessed portions400and other arrangements and configurations of the negative irregular rough surface texture pattern102apply also with respective to such alternative patterns102b,102c,and102d.", "", "Referring now again toFIG.2, the sidewall ring plate200illustrates various alternative negative irregular rough surface texture patterns102a-d.The pattern102bmay be considered an inverse pebble pattern102b.FIG.5illustrates a close-up view of a portion of the inverse pebble pattern102b.With the inverse pebble pattern102b,the recessed portions500and the raised portions502are the inverse of the pebble pattern102a.Specifically, the raised portions502correspond to the irregular-shaped spaces between the pebble portions and the recessed portions500correspond to the irregular-shaped pebble portions. As described herein above, the irregular-shaped pebble portions are considered generally circular or oval in overall shape, yet follow an irregular curve-shaped path/outline, similar to the irregular-shape of pebbles, hence the name “pebble pattern.” The description herein above with respect to the dimensions and arrangement of the pebble pattern102aapply also to the inverse pebble pattern102band therefore will not be expressly repeated.", "", "Referring again toFIG.2, with reference also toFIGS.3and6, the pattern102cmay be considered a rough sandpaper pattern102c.As with the pebble patterns102aand102b,the rough sandpaper pattern102cmay include recessed portions600disposed non-uniformly between raised portions602in a manner that resembles a sandpaper surface. In a preferred embodiment, the recessed portions600may have a depth604of 0.1 millimeters. In a further embodiment, the sidewall molding surface100may be created by laser etching a smooth sidewall ring plate with cuts 0.1 millimeters deep. In other embodiments, the depth604may be slightly greater or less than 0.1 millimeters. In yet other embodiments, the depth604of the recessed portions600may be in the range of 0.1 millimeters to 0.3 millimeters. In yet further embodiments, the depth604of the recessed portions600may be in the range of 0.1 to 0.5 millimeters. Importantly, the cuts or depth of the recessed portions600and the overall arrangement of recessed portions600and raised portions602should appear intentionally coarse, in other words, resembling rough sandpaper.FIG.3is a close-up view of the sandpaper patterns102c,102don the sidewall molding surface100.", "", "As with real sandpaper, the texture of the sandpaper pattern102c,102dcan vary in terms of its coarseness or grit. Generally, the size of the grain, or in this case the dimensions of the raised portions602, is proportional to the coarseness of the sandpaper surface. The pattern102dmay be considered a smooth sandpaper pattern102d,as compared to the rough sandpaper pattern102c.", "", "Referring now primarily toFIG.3, with reference toFIG.10, the sidewall molding surface100may also define a negative indicia pattern300overlaying the negative irregular rough surface texture patterns102c,102d.The negative indicia pattern300may include a negative space in the mold for creating sidewall lettering, manufacturer names, tire model information, and the like, and may include letters, numbers, as well, as other symbols, such as logos. In one embodiment, the negative indicia pattern300may include an indicia depth302that is greater than the depth of the recessed portions600so as to mold the annular exterior surface1000of the tire sidewall1002with sidewall indicia1006(seeFIG.10). The sidewall indicia1006preferably protrudes outwardly extending beyond the irregular rough surface texture finish1004created by the mold texture pattern102. In other words, the sidewall indicia1006preferably overlays the irregular rough surface texture finish1004.", "", "Referring now primarily toFIG.7, yet another exemplary sidewall ring plate700(similar to the sidewall ring plate104depicted inFIG.1and the sidewall ring plate200depicted inFIG.2) is shown in a front elevational view with multiple negative irregular rough surface texture patterns702a,702b,702c.The negative irregular rough surface texture pattern702amay be considered a pinch or burl effect pattern, with raised and protruding portions arranged to resemble a pinch or burl effect, as depicted inFIG.7. The negative irregular rough surface texture pattern702bmay be considered a wide pebble pattern, with protruding portions more widely spaced apart than the other pebble patterns102aand102b(FIGS.2,4, and5). The negative irregular rough surface texture pattern702cmay be considered yet another sandpaper pattern with a different coarseness, as compared to the other sandpaper patterns102cand102d(FIGS.2and6). The finish702dmay be considered a no structure, prior art pattern, having, for example, a smooth or a polished finish on the sidewall molding surface100, shown as a comparison of embodiments of the present disclosure to existing mold surfaces.", "", "Referring now primarily toFIGS.8and9, a cross-sectional view of the tire mold900is shown as a three-piece mold with the pair of sidewall ring plates104aand104b(for each sidewall) and the tread molding portion902. The general construction of tire molds is known by those of ordinary skill in the art and therefore will not be described in great detail. In the exemplary embodiment, the negative irregular rough surface texture pattern102is provided on the sidewall molding surfaces100of the sidewall ring plates104a,104b.Specifically, the negative irregular rough surface texture pattern102may extend circumferentially along each of the sidewall ring plates104a,104b.", "", "As is generally known, the tread molding portion902may include a negative tread pattern. In a further embodiment, there may also be provided a negative irregular rough surface texture pattern102on the tread molding portion902to provide a unique visual effect on the annular exterior surface1000of the tire tread1010, as well. In one embodiment, the irregular rough surface texture of the tire tread1010may be configured to resemble the irregular rough surface texture finish1004of the tire sidewall1002. In other embodiments, the tread molding portion902may not include a negative irregular rough surface texture pattern102. Because tire sidewalls are more visually prominent than the tire tread1010when installed on a vehicle, embodiments may only provide the irregular rough surface texture finish1004on the tire sidewall1002, rather than the tire tread1010.", "", "During the manufacturing process, the green tire800may be placed within the tire mold cavity904defined by the tread and sidewall molding surfaces of the tire mold900, as is generally known. After curing the green tire800, a pneumatic tire1008is formed with the irregular rough surface texture finish1004on the tire sidewall1002(seeFIG.10), the irregular rough surface texture finish1004being a mirror image of the negative irregular rough surface texture pattern102on the sidewall ring plate104(seeFIGS.1and2).", "", "As is generally known, a tire includes a pair of tire sidewalls axially spaced apart from one another and extending from respective opposite ends of the tire tread1010. Accordingly, although not shown, it should be apparent that the opposite tire sidewall (not shown inFIG.10) also includes the irregular rough surface texture finish1004.", "", "FIG.10illustrates the pneumatic tire1008made with a sidewall molding surface having the rough sandpaper pattern102cthereon, in accordance with the present disclosure.FIG.11illustrates another exemplary pneumatic tire1100made with a sidewall molding surface having the pebble pattern102athereon, in accordance with the present disclosure.", "", "By providing the tire mold900with negative irregular rough surface texture patterns102,702, the irregular rough surface texture finish1004may be formed integrally with the tire sidewall1002, rather than, for example, being molded onto the tire, after the green tire800is cured, as a separate manufacturing process. Doing so reduces the time, cost, and complexity of the manufacturing process, as compared with, for example, a process with a separate post-curing step.", "", "A novel and efficient tire mold, pneumatic tire, and method of producing the same has been disclosed to provide an irregular rough surface texture finish on the annular exterior surface of the tire that provides a unique textured visual appearance. Embodiments provide irregular rough surface texture finishes with recessed portions non-uniformly disposed between irregular raised portions on a tire sidewall. In one embodiment, the rough surface texture finish may resemble rough sandpaper and, in an alternative embodiment, the rough surface texture finish may resemble a non-uniformly spaced apart pebble arrangement."], "claims": ["a tire mold having a sidewall molding surface with a negative irregular rough surface texture pattern extending circumferentially along the sidewall molding surface so as to mold at least one annular exterior surface of a tire sidewall with an irregular rough surface texture, the negative irregular rough surface texture pattern defining recessed portions disposed non-uniformly between raised portions, the recessed portions having a depth of at least 0.1 millimeters.", "the recessed portions and the raised portions vary non-uniformly in size and shape along the sidewall molding surface.", "the recessed portions have a depth of 0.1-0.5 millimeters.", "the recessed portions have a depth of 0.3 millimeters.", "the sidewall molding surface is a surface of a sidewall ring plate.", "the negative irregular rough surface texture pattern is configured to mold a rough sandpaper pattern on the at least one annular exterior surface of the tire sidewall, the rough sandpaper pattern being visually discernible from other exterior surfaces of the tire by an observer.", "the negative irregular rough surface texture pattern is configured to mold a pebble pattern on the at least one annular exterior surface of the tire sidewall, the pebble pattern being visually discernible from other exterior surfaces of the tire by an observer.", "the sidewall molding surface defines a negative indicia pattern with an indicia depth that is greater than the depth of the recessed portions so as to mold the at least one annular exterior surface of the tire sidewall with the indicia pattern overlaying the irregular rough surface texture.", "the negative irregular rough surface texture pattern is formed by laser etching a planar sidewall molding surface in a non-uniform laser pattern to create the recessed portions, said laser-etched recessed portions thereby defining the raised portions, the raised portions being portions of the planar sidewall molding surface not laser etched.", "the tire mold includes a tread molding surface, the tread molding surface with a negative irregular rough surface texture pattern corresponding to the negative irregular rough surface texture pattern on the sidewall molding surface so as to mold at least one annular exterior surface of a tire tread with an irregular rough surface texture corresponding to the irregular rough surface texture of the tire sidewall.", "the negative irregular rough surface texture pattern extends circumferentially continuously 360 degrees along the sidewall molding surface.", "a tire mold having a sidewall molding surface with a negative irregular rough surface texture pattern extending circumferentially along the sidewall molding surface so as to mold at least one annular exterior surface of a tire sidewall with an irregular rough surface texture, the negative irregular rough surface texture pattern having an irregularity depth of at least 0.1 millimeters.", "the irregularity depth is in a range of 0.1-0.5 millimeters.", "the irregularity depth is 0.3 millimeters.", "the sidewall molding surface is a surface of a sidewall ring plate.", "the negative irregular rough surface texture pattern is configured to mold one of a rough sandpaper pattern, and a pebble pattern on the at least one annular exterior surface of the tire sidewall, the one of the rough sandpaper pattern, and the pebble pattern being visually discernible from other exterior surfaces of the tire by an observer."], "bibtex": "@patent{20250010666,\n    title = {PNEUMATIC TIRE WITH A TEXTURED SURFACE, METHOD OF MANUFACTURING, AND TEXTURED MOLD},\n    number = {20250010666},\n    year = {2025},\n    note = {File: US20250010666A1-20250109.XML}\n    }", "classification": "B60C1300FI"}]