[{"title": "RIM OF A BICYCLE WHEEL AND RELATED BICYCLE WHEEL", "doc_number": "20240416677", "filename": "US20240416677A1-20241219.XML", "abstract": "A rim of a bicycle wheel having an upper bridge configured to allow mounting a tyre, a lower bridge comprising a plurality of perforated spoke-attachment seats and two opposite sidewalls connecting the upper bridge to the lower bridge. At least one of the two sidewalls has at least one recess having an axial depth that increases along a radial direction in the recess from the upper bridge towards the lower bridge.", "detailed_description": [""], "claims": ["an upper bridge configured to allow mounting a tyre, a lower bridge comprising a plurality of perforated spoke-attachment seats, and two opposite sidewalls connecting the upper bridge to the lower bridge; wherein at least one of the two opposite sidewalls comprises at least one recess having an axial depth that increases along a radial direction in the at least one recess from the upper bridge towards the lower bridge.", "2 . The rim according to claim 1 , wherein said at least one recess is symmetrical with respect to a radial direction that crosses a portion of minimum axial depth of the at least one recess.", "3 . The rim according to claim 1 , wherein said at least one recess is asymmetrical with respect to a radial direction that crosses a portion of minimum axial depth of the at least one recess.", "4 . The rim according to claim 1 , wherein said at least one recess has a maximum axial depth at a circumferentially central portion thereof.", "5 . The rim according to claim 1 , wherein said at least one recess has a circumferential width, measured along a circumference of the at least one of the two opposite sidewalls, which increases along the radial direction in the at least one recess from the upper bridge towards the lower bridge.", "6 . The rim according to claim 5 , wherein said at least one recess extends in the radial direction up to the lower bridge, and wherein said circumferential width is maximum at the lower bridge.", "7 . The rim according to claim 1 , wherein the axial depth of said at least one recess varies gradually along the radial direction in said at least one recess and in a circumferential direction in said at least one recess, defining a valley-shaped three-dimensional area in the at least one of the two opposite sidewalls.", "8 . The rim according to claim 1 , wherein said at least one sidewall comprises a plurality of recesses.", "9 . The rim according to claim 8 , wherein the plurality of recesses are distributed on said at least one sidewall evenly in a circumferential direction.", "10 . The rim according to claim 1 , wherein the lower bridge has a constant distance from a center of the rim in a circumferential direction.", "at least one first circumferential portion having a first distance from a center of the rim, and at least one second circumferential portion having a second distance from the center of the rim different from the first distance.", "a plurality of said first circumferential portions having a first distance from a center of the rim, and a plurality of said second circumferential portions having a second distance from the center of the rim different from the first distance.", "13 . The rim according to claim 12 , wherein the first circumferential portions and second circumferential portions are alternated with one another and distributed evenly in a circumferential direction.", "14 . The rim according to claim 11 , wherein the lower bridge comprises, between said at least one first circumferential portion and said at least one second circumferential portion, a joining portion defined by a curved surface.", "15 . The rim according to claim 14 , wherein said curved surface has an S-shaped profile defined by two circumferences that are in mutual contact at an inflection point, and wherein a first circumference of the two circumferences is tangent to said at least one first circumferential portion at a first joining point and a second circumference of said two circumferences is tangent to said at least one second circumferential portion at a second joining point.", "16 . The rim according to claim 15 , wherein the inflection point is located halfway along the joining portion.", "said at least one first circumferential portion, said at least one second circumferential portion, and said joining portion.", "18 . A bicycle wheel comprising a rim according to claim 1 , a hub and a plurality of spokes connecting the hub to the rim.", "wherein the lower bridge comprises: at least one first circumferential portion having a first distance from a center of the rim, and at least one second circumferential portion having a second distance from the center of the rim different from the first distance; and wherein the plurality of spokes are connected to the lower bridge of the rim at said at least one first circumferential portion or at said at least one second circumferential portion."], "bibtex": "@patent{20240416677,\n    title = {RIM OF A BICYCLE WHEEL AND RELATED BICYCLE WHEEL},\n    number = {20240416677},\n    year = {2024},\n    note = {File: US20240416677A1-20241219.XML}\n    }", "classification": "B60B104FI"}, {"title": "VEHICULAR WHEEL BEARING COMPRISING SEALING DEVICE HAVING INTERNAL PRESSURE DISCHARGING PORTION", "doc_number": "20240416678", "filename": "US20240416678A1-20241219.XML", "abstract": "According to one embodiment, provided is a vehicular wheel bearing for rotatably mounting and supporting a vehicular wheel on a vehicle body. The vehicular wheel bearing includes a rotating element which rotates together with the vehicular wheel; a non-rotating element mounted and fixed to the vehicle body; a plurality of rolling elements disposed between the rotating element and the non-rotating element; and a sealing device installed between the rotating element and the non-rotating element to prevent an inflow of external foreign substances. The sealing device includes a first member mounted to either the rotating element or the non-rotating element of the wheel bearing; a second member mounted to the other one of the rotating element and the non-rotating element of the wheel bearing; and a negative pressure prevention member attached to the first member.", "detailed_description": ["Example embodiments of the present disclosure described herein are exemplified for the purpose of describing the technical spirit of the present disclosure. The scope of the claims according to the present disclosure is not limited to the example embodiments described below or to detailed descriptions of these example embodiments.", "", "Unless otherwise defined, all technical and scientific terms used herein have the same meaning commonly understood by those skilled in the art to which the present disclosure pertains. All terms used herein are selected for the purpose of more clearly describing the present disclosure and not limiting the scope of the present disclosure defined by appended claims.", "", "Unless the phrase or sentence clearly indicates otherwise, terms “comprising,” “including,” “having,” and the like used herein should be construed as open-ended terms encompassing the possibility of including other example embodiments.", "", "The term “axial direction” used herein may be defined as a direction extending along a rotational central axis of a wheel bearing. The term “radial direction” used herein may be defined as a direction perpendicular to the axial direction and away from the rotational central axis or approaching the rotational central axis. The term “circumferential direction” used herein may be defined as a direction rotating about the axial direction described above.", "", "Unless the phrase or sentence clearly indicates otherwise, the expression “a constituent element extends in the axial direction or the radial direction” used herein should be understood as encompassing a case where the constituent element extends parallel to the axial direction or the radial direction as well as a case where the constituent element extends obliquely with respect to the axial direction or the radial direction.", "", "The singular form described herein may include the plural form unless the context clearly dictates otherwise, and this is equally applied to the singular form set forth in the claims.", "", "Throughout the present specification, when a constituent element is referred to as being “positioned” at or “formed” on one side of another constituent element, the constituent element may be in direct contact with or directly formed on the one side of another constituent element, or may be positioned at or formed on another constituent element by intervening yet another constituent element therebetween.", "", "Hereinafter, example embodiments of the present disclosure will be described in detail with reference to the accompanying drawings at such an extent that they may be readily practiced by those ordinary skilled in the art. In the accompanying drawings, the same reference numerals are assigned to the same or corresponding components. Furthermore, in the following descriptions of the example embodiments, duplicate descriptions of the same or corresponding constituent elements may be omitted. However, even though a description(s) of a constituent element is omitted, such a constituent element is not intended to be excluded in any example embodiment.", "", "Referring toFIGS.3to9, a vehicular wheel bearing according to an example embodiment of the present disclosure and a sealing device which may be applied to such a vehicular wheel bearing are shown as examples.", "", "As shown in the drawings, a vehicular wheel bearing100according to an example embodiment of the present disclosure may be configured so that a rotating element [200; for example, wheel hub210and inner ring220] rotating together with a vehicular wheel is connected to a non-rotating element (300; for example, outer ring) mounted and fixed to a vehicle body through a plurality of rolling elements400, similar with a conventional vehicular wheel bearing.", "", "According to an example embodiment of the present disclosure, the wheel hub210constituting the rotating element200may be formed into a substantially cylindrical shape extending in an axial direction, and a wheel mounting flange (hub flange) may be provided on an outer circumferential surface of the wheel hub210. The wheel mounting flange is formed in a shape extending outward in a radial direction from the outer circumferential surface of the wheel hub210and may be used for mounting a vehicular wheel to the wheel hub210using hub bolts or the like. On the other hand, the inner ring220may be mounted to a vehicle-body-side end portion of the wheel hub210and a raceway (inner raceway) may be formed on a portion of the outer circumferential surface of the wheel hub210to support the rolling elements400from an inner side in the radial direction.", "", "According to an example embodiment of the present disclosure, at least one inner ring220may be mounted on a circumferential surface of the wheel hub210. According to an example embodiment of the present disclosure, the inner ring220may be configured so that the raceway (inner raceway) of the rolling elements is formed on the outer circumferential surface thereof to support the rolling elements400from the inner side in the radial direction. For example, the inner ring220may be configured to be press-fitted to a seating portion provided on the vehicle-body-side end portion of the wheel hub210, and may be configured to be assembled on the wheel hub210with a predetermined preload applied.", "", "According to an example embodiment of the present disclosure, the outer ring constituting the non-rotating element300may comprises, on an outer circumferential surface, a vehicle-body-side mounting flange using which the wheel bearing is mounted to the vehicle body. According to an example embodiment of the present disclosure, the outer ring may be configured to comprise, on an inner circumferential surface, a raceway (outer raceway) with which the rolling elements400is in contact. The raceway (outer raceway) formed on the inner circumferential surface of the outer ring may be configured to cooperate with the raceway (inner raceway) formed on the wheel hub210and/or the inner ring220to accommodate and support the rolling elements400between the raceways.", "", "According to an example embodiment of the present disclosure, the rolling elements400are disposed between the rotating element200and the non-rotating element300of the wheel bearing100, and may perform the function of rotatably supporting the rotating element200of the wheel bearing100with respect to the non-rotating element300.", "", "Here, the above-described configurations of the vehicular wheel bearing100according to an example embodiment of the present disclosure do not have to be limited to the structure shown in the drawings, and may be modified and formed into various structures which may be applied to vehicular wheel bearings.", "", "For example, in the case of the example embodiment shown in the drawing, the vehicular wheel bearing100is configured such that a raceway for supporting the rolling elements400is directly formed on the outer circumferential surface of the wheel hub210. However, the vehicular wheel bearing100according to an example embodiment of the present disclosure may be modified and implemented in other structures, such as a structure where two inner rings220are mounted to the wheel hub210and the rolling elements400are supported through the two inner rings220.", "", "Also, in the case of the example embodiment shown in the drawing, the rolling elements400which rotatably support the rotating element200of the wheel bearing100with respect to the non-rotating element300of the wheel bearing100are shown in the form of a tapered roller. However, the rolling elements400of the wheel bearing100may be formed of rolling elements of other shapes such as a spherical ball.", "", "According to an example embodiment of the present disclosure, a sealing device500which prevents external foreign substances from entering a bearing space portion S1, in which the rolling elements400are disposed, or prevents grease filled in the bearing space portion S1from leaking to the outside may be provided at an end portion(s) of the wheel bearing100.", "", "Referring toFIG.4, a structure of the sealing device (in the case of the example shown in the drawing, inboard-side sealing device) which may be used for the vehicular wheel bearing100according to an example embodiment of the present disclosure is exemplarily shown.", "", "According to an example embodiment of the present disclosure, the sealing device500may be configured to comprise a first member600mounted to either the rotating element200or the non-rotating element300of the wheel bearing100; and a second member700mounted to the other one of the rotating element200and the non-rotating element300of the wheel bearing100.", "", "For example, in the case of the example embodiment shown in the drawing, the first member600of the sealing device500is configured to be press-fitted and mounted to the outer ring constituting the non-rotating element300, the second member700of the sealing device500is configured to be press-fitted and mounted to the inner ring220constituting the rotating element200, and the first member600is configured to be located closer to the bearing space portion S1than the second member700.", "", "According to an example embodiment of the present disclosure, the first member600and the second member700of the sealing device500are configured to comprise a frame [frame610of the first member600and frame710of the second member700] forming a body and such a frame (frame610of the first member600and frame710of the second member700) may be configured to be press-fitted and mounted to the rotating element200or the non-rotating element300of the wheel bearing100.", "", "According to an example embodiment of the present disclosure, the frame610of the first member600and the frame710of the second member700may be configured to comprise a press-fitting portion612;712having a substantially cylindrical shape and a flange portion614;714extending radially from the press-fitting portion612;712.", "", "On the other hand, according to an example embodiment of the present disclosure, one or more of the frame610of the first member600and the frame710of the second member700may be configured to comprise a structure in which the end portion of the flange portion is bent to more effectively prevent the inflow of external foreign substances.", "", "For example, in the case of the example embodiment shown in the drawing, the frame710of the second member700is configured to comprise a bent portion716that is bent from the flange portion714and extends in the axial direction. Wherein, the bent portion716may be configured to form a labyrinth structure between the bent portion716and the press-fit portion612of the frame610of the first member600to more effectively prevent the inflow of external foreign substances.", "", "According to an example embodiment of the present disclosure, one or more of the first member600and the second member700of the sealing device500may comprise an elastic sealing portion620and may be configured to perform sealing through the elastic sealing portion620.", "", "For example, in the case of the example embodiment shown in the drawing, the first member600of the sealing device500is configured to comprise an elastic sealing portion620so that the elastic sealing portion620interacts with the second member700to perform sealing.", "", "According to an example embodiment of the present disclosure, the elastic sealing portion620may be configured to surround all or a part of the frame610from the radially inner end portion of the frame610to the radially outer end portion of the frame610.", "", "According to an example embodiment of the present disclosure, the elastic sealing portion620may be configured to comprise at least one sealing lips630so that the end of the sealing lip630is in contact with or disposed adjacent to a counterpart member to perform sealing.", "", "For example, in the case of the example embodiment shown in the drawing, the sealing device500is formed in a structure in which the elastic sealing portion620provided in the first member600comprises a plurality of sealing lips [630; a side lip which is in contact with and performs sealing together with the flange portion714of the frame710of the second member700, a grease lip which is disposed on the innermost side to prevent leakage of grease filled in the bearing space S1, or the like].", "", "According to an example embodiment of the present disclosure, the first member (600; for example, member disposed adjacent to the bearing space portion) of the sealing device500may be configured to comprise a through hole(s)640communicating with the sealing space portion S2formed inside the sealing device500.", "", "According to an example embodiment of the present disclosure, the through hole640may be configured to be formed in the flange portion of the first member600. In addition, when the first member600of the sealing device500comprises an elastic sealing portion620as shown in the drawing, the frame610of the first member600and the elastic sealing portion620may be formed to penetrate together.", "", "According to an example embodiment of the present disclosure, the sealing device500may be configured to further comprise a negative pressure prevention member800attached to the first member600(a member disposed adjacent to the bearing space portion).", "", "According to an example embodiment of the present disclosure, the negative pressure prevention member800is configured to communicate the bearing space portion S1with the sealing space portion S2so that the pressure of the bearing space portion S1may be discharged to the outside at the time of installing the sealing device500. Thus, the negative pressure prevention member800may perform the function of preventing high internal pressure from being formed in the bearing space portion S1.", "", "According to an example embodiment of the present disclosure, the negative pressure prevention member800may be formed in a substantially ring-shaped structure as shown in the drawing, and may be configured to comprise an internal pressure discharging portion P on one side of the negative pressure prevention member800.", "", "According to an example embodiment of the present disclosure, the internal pressure discharging portion P may be configured to be formed as a recess structure in one axial end surface of the negative pressure prevention member800, as shown inFIGS.4and5.", "", "According to an example embodiment of the present disclosure, the internal pressure discharging portion P may be configured to communicate with the bearing space portion S1at a the first position X and to communicate with the through hole640at a second position Y spaced apart from the first position X.", "", "According to this structure, the air in the bearing space portion S1may flow into the internal pressure discharging portion P of the negative pressure prevention member800at the first position X and the air flowing into the internal pressure discharging portion P can be discharged from the second position Y to the sealing space portion S2.", "", "Therefore, in the vehicular wheel bearing100according to an example embodiment of the present disclosure, when the sealing device500is press-fitted and installed, even when the bearing space portion S1is pressurized by the sealing device500, the increased pressure of the bearing space portion S1may be discharged through the internal pressure discharging portion P. Thus, it is possible to prevent deterioration of the installation and/or sealing performance of the sealing device500which may be caused by an increase in the pressure of the bearing space portion S1.", "", "According to an example embodiment of the present disclosure, the internal pressure discharging portion P can be formed into a structure in which the internal pressure discharging portion P communicates only with the bearing space portion S1and does not communicate with the sealing space portion S2at the first position and communicates only with the sealing space portion S2and does not communicate with the bearing space portion S1at the second position Y.", "", "According to an example embodiment of the present disclosure, the internal pressure discharging portion P may be configured to extend in various directions such as a radial direction, a circumferential direction, and/or a direction inclined thereto.", "", "According to an example embodiment of the present disclosure, the internal pressure discharging portion P may be composed of a plurality of segments extending in different directions to form a long and narrow labyrinth structure in the negative pressure prevention member800.", "", "For example, in the case of the example embodiment shown in the drawing, the internal pressure discharging portion P of the labyrinth structure is formed in the negative pressure prevention member800by combining the segments extending in the circumferential direction and the segments extending in the radial direction.", "", "According to the above-described structure, the pressure in the bearing space portion S1may be discharged to the outside through the through hole640provided in the first member600of the sealing device500and the internal pressure discharging portion P connected thereto, and at the same time, foreign substances introduced into the sealing device500may be prevented from entering the inside of the bearing space portion S1through the internal pressure discharging portion P.", "", "According to an example embodiment of the present disclosure, a negative pressure prevention member800may be formed of a material such as plastic and may be formed using a method such as injection molding.", "", "According to an example embodiment of the present disclosure, the internal pressure discharging portion P may be formed as one continuous structure as shown inFIG.5or a plurality of internal pressure discharging portions P spaced apart from each other may be provided as shown inFIG.6.", "", "According to an example embodiment of the present disclosure, the first position X communicating with the bearing space portion S1and the second position Y communicating with the sealing space portion S2may be configured to be provided at positions spaced apart in the radial and/or circumferential directions.", "", "For example, in the case of the example embodiment shown inFIGS.3to6, the first position X is configured to be located further inward in the radial direction than the second position Y and the first position X is configured to be spaced apart from the second position Y in the radial direction.", "", "On the other hand, the first position X communicating with the bearing space port S1may be configured to be located further outward in the radial direction than the second position Y communicating with the sealing space portion S2as shown inFIG.7.", "", "According to an example embodiment of the present disclosure, as shown inFIG.7, the sealing device500may be configured to comprise at least one sealing lip632,634on the radially outer and radially inner sides of the second position Y in communication with the sealing space portion S2, respectively.", "", "As shown inFIG.7, when a sealing lip(s)632is provided on the radial outer side of the second position Y in communication with the sealing space portion S2, such a sealing lip632can prevent external foreign substances from entering the inside of the second position Y part. Thus, it is possible to further prevent external foreign substances from entering the inside of the bearing space portion S1in which the rolling elements400is located.", "", "According to an example embodiment of the present disclosure, in the case of an example embodiment comprising the sealing lip632on the radially outer side of the second position Y as shown inFIG.7, it may be preferable that the sealing lip632located further outward in the radial direction than the second position Y is formed as a non-contact sealing lip not to interrupt the escape of the internal pressure discharged to the sealing space portion S2or is formed as a contact-type sealing lip with a relatively small amount of interference compared to the sealing lip634located on the radial inner side.", "", "On the other hand, in the case of the example embodiment shown in the drawing, although the internal pressure discharging portion P is configured to start at the first position X and end at the second position Y, the internal pressure discharging portion P is not necessarily limited to this structure. Alternatively, the first position X communicating with the bearing space portion S1and/or the second position Y communicating with the sealing space portion S2may be configured to be formed in the middle portion of the international press discharge portion P.", "", "According to an example embodiment of the present disclosure, the internal pressure discharging portion P may be formed to have the same depth and may be formed to have a penetrating structure only at the first position X, as shown in the drawing.", "", "However, the shape of the internal pressure discharging portion P does not need to be limited to the above-described structure. Alternatively, the internal pressure discharging portion P may be formed in a structure whose depth varies in accordance with the position or may be formed to have a communication hole formed inside the negative pressure prevention member800instead of a recess structure open on one side.", "", "Next, referring toFIG.8, another example embodiment of the sealing device500which may be used in the vehicular wheel bearing100according to an example embodiment of the present disclosure is exemplarily shown.", "", "The sealing device500shown inFIG.8may be formed to have an overall identical/similar structure to the sealing device500described above in relation toFIGS.3to7. In addition, the only difference is that the internal pressure discharging portion P is formed directly in the first member600of the sealing device500without using the negative pressure prevention member800.", "", "Specifically, like the previous example embodiment, the sealing device500of the example embodiment shown inFIG.8may be configured to comprise the first member600mounted to either the rotating element200or the non-rotating element300of the wheel bearing100; and the second member700mounted to the other one of the rotating element200and the non-rotating element300of the wheel bearing100. In addition, the first member600of the sealing device500may be configured to comprise the internal pressure discharging portion P which communicates the sealing space portion S2formed inside the sealing device500with the bearing space portion S1in which the rolling elements400are located.", "", "According to an example embodiment of the present disclosure, the internal pressure discharging portion P provided in the first member600of the sealing device500may be formed in substantially the same manner as the internal pressure discharging portion P formed in the negative pressure prevention member800of the previous example embodiment.", "", "For example, the internal pressure discharging portion P provided in the first member600of the sealing device500may be formed as a recessed structure in one axial end surface of the frame610of the first member600of the sealing device500, as shown inFIG.8and may be configured to communicate with the bearing space port S1at a first location X and to communicate with the sealing space portion S2at a second location Y apart from the first location X.", "", "According to an example embodiment of the present disclosure, in the internal pressure discharging portion P provided in the first member600of the sealing device500, the first position X and the second position Y may be configured to be provided at positions spaced apart in the radial direction and/or the circumferential direction, similar to the previous example embodiment, and the internal pressure discharge portion P may be configured to extend in various directions such as in a radial direction, in a circumferential direction, and/or in a direction inclined thereto.", "", "According to an example embodiment of the present disclosure, the internal pressure discharging portion P provided in the first member600of the sealing device500may be composed of a plurality of segments extending in different directions, similar to the previous example embodiment and may be configured to form a long and narrow labyrinth structure in the first member600.", "", "According to an example embodiment of the present disclosure, the internal pressure discharging portion P provided in the first member600of the sealing device500is formed in a structure in which the internal pressure discharging portion P communicates only with the bearing space portion S1and does not communicate with the sealing space portion S2at the first position and communicates only with the sealing space portion S2and does not communicate with the bearing space portion S1at the second position Y. In addition, the internal pressure discharging portion P provided in the first member600of the sealing device500may be configured so that the internal pressure discharging portion P is not in direct communication with the bearing space portion S1and the sealing space portion S2, but is in communication via the internal pressure discharging portion P of the labyrinth structure provided in the first member600.", "", "For example, in the case of the example embodiment shown inFIG.8, the first member600of the sealing device500has a through hole(s)650in the frame610at a first position X, such that the internal press discharge portion P communicates with the bearing space portion S1via the through hole650whereas the sealing space portion S2side is configured to be closed using the elastic sealing portion620. In addition, the first member600of the sealing device500has a recess portion660which is opened toward the sealing space portion S2[for example, a recess structure formed by combining a recess provided in the frame610of the first member600and a through hole provided in the elastic sealing portion620] at the second position Y, such that the bearing space portion S1side is closed by the bottom surface of the recess portion660whereas the internal press discharge portion P communicates with the sealing space portion S2through an opening in the recess portion660.", "", "According to this structure, similar to the previous example embodiment, the air in the bearing space portion S1may flow into the internal pressure discharging portion P formed in the first member600of the sealing device500at the first position and the air flowing into the internal pressure discharging portion P may be discharged from the second position Y to the sealing space portion S2.", "", "Therefore, similar to the previous example embodiment, the vehicular wheel bearing100shown inFIG.8may prevent the deterioration of the installing and/or sealing performance of the sealing device500due to an increase in pressure in the bearing space portion S1which occurs during the press-fitting process of the sealing device500.", "", "Also, since the first position X which communicates with the bearing space portion S1and the second position Y which communicates with the sealing space portion S2are located apart from each other, it is possible to prevent the inflow of the foreign substances flowing into the sealing device500from entering the inside of the bearing space portion S1through the internal pressure discharging portion P while discharging the pressure in the bearing space portion S1to the outside through the internal pressure discharging portion P.", "", "According to an example embodiment of the present disclosure, the first position X communicating with the bearing space port S1may be configured to be located further inward in the radial direction than the second position Y communicating with the sealing space port S2as shown inFIG.8or may be configured to be located further outward in the radial direction than the second position Y communicating with the sealing space port S2as shown inFIG.9.", "", "According to an example embodiment of the present disclosure, as shown inFIG.9, the sealing device500may be configured to comprise at least one sealing lip632,634on the radially outer and radially inner sides of the second position Y in communication with the sealing space portion S2, respectively. As such, in the case in which the sealing lip632is provided on the radially outer side of the second position Y in communication with the sealing space portion S2, it is preferable that the sealing lip632is formed as a non-contact sealing lip or a contact sealing lip which has a relatively small amount of interference compared to the sealing lip634located on the radial inner side.", "", "According to an example embodiment of the present disclosure, other configurations may be substantially the same as or may be formed in a similar manner to the example embodiment described above, so detailed description thereof will be omitted.", "", "On the other hand, it should be understood that the technical configuration provided in one example embodiment of the plurality of example embodiments described above can be easily applied and implemented in another example embodiment unless there are special circumstances.", "", "Although the present disclosure has been explained above by specific details such as specific components and limited examples, these examples are provided only to facilitate a more general understanding of the present disclosure, and the present disclosure is not limited to this. In addition, anyone with ordinary knowledge in the technical field to which the present disclosure pertains can make various modifications and changes from this description.", "", "Therefore, the idea of the present disclosure should not be limited to the embodiments described above, and the claims described later as well as all equivalent or equivalent modifications to this claim are included in the scope of the idea of the present disclosure. It will be said that it belongs."], "claims": ["a rotating element ( a non-rotating element ( a plurality of rolling elements ( a sealing device ( wherein the sealing device ( the first member ( the negative pressure prevention member ( the inner pressure discharge portion P is configured to communicate with the bearing space portion S", "2 . The vehicular wheel bearing of claim 1 , wherein the first position X is located further inward in a radial direction than the second position Y.", "3 . The vehicular wheel bearing of claim 2 , wherein the first position X is located further outward in the radial direction than the second position Y.", "4 . The vehicular wheel bearing of claim 3 , wherein at least one sealing lip is provided on radially outer and radially inner sides of the second position Y, respectively.", "5 . The vehicular wheel bearing of claim 4 , wherein a sealing lip ( 632 ) located on the radially outer side of the second position Y is a non-contact sealing lip.", "6 . The vehicular wheel bearing of claim 1 , wherein the internal pressure discharging portion P is formed as a recessed structure in one axial end surface of the negative pressure prevention member ( 800 ).", "7 . The vehicular wheel bearing of claim 6 , wherein the internal pressure discharging portion P comprises a plurality of segments extending in different directions to form a labyrinth structure.", "8 . The vehicular wheel bearing of claim 6 , wherein a plurality of the internal pressure discharging portions P are provided in the negative pressure prevention member ( 800 ).", "a rotating element ( a non-rotating element ( a plurality of rolling elements ( a sealing device ( wherein the sealing device ( the first member ( the internal pressure discharging portion P is configured to communicate with the bearing space portion S", "10 . The vehicular wheel bearing of claim 9 , wherein the first position X is located further inward in a radial direction than the second position Y.", "11 . The vehicular wheel bearing of claim 9 , wherein the first position X is located further outward in a radial direction than the second position Y.", "12 . The vehicular wheel bearing of claim 11 , wherein at least one sealing lip is provided on radially outer and radially inner sides of the second position Y, respectively.", "13 . The vehicular wheel bearing of claim 11 , wherein a sealing lip ( 632 ) located on the radially outer side of the second position Y is a non-contact sealing lip.", "14 . The vehicular wheel bearing of claim 10 , wherein the internal pressure discharging portion P is formed as a recess structure on one axial end surface of a frame ( 610 ) of the first member ( 600 ) of the sealing device ( 500 ).", "15 . The vehicular wheel bearing of claim 14 , wherein the internal pressure discharging portion P comprises a plurality of segments extending in different directions to form a labyrinth structure.", "16 . The vehicular wheel bearing of claim 14 , wherein a plurality of the internal pressure discharging portions P are provided in the first member ( 600 ) of the sealing device ( 500 )."], "bibtex": "@patent{20240416678,\n    title = {VEHICULAR WHEEL BEARING COMPRISING SEALING DEVICE HAVING INTERNAL PRESSURE DISCHARGING PORTION},\n    number = {20240416678},\n    year = {2024},\n    note = {File: US20240416678A1-20241219.XML}\n    }", "classification": "B60B2700FI"}, {"title": "AN AUXILIARY WHEEL", "doc_number": "20240416679", "filename": "US20240416679A1-20241219.XML", "abstract": "An auxiliary wheel including a wheel hub and a tire, the wheel hub includes an outer wheel hub and an inner wheel hub and the tire is mounted on the outer wall of the outer wheel hub. The outer wheel hub and the inner wheel hub are detachably connected through a first connection component. When the first connection component unlocks the connection between the outer wheel hub and the inner wheel hub, relative rotation is generated between the outer wheel hub and the inner wheel hub with bearings disposed between the inner wheel hub and the outer wheel hub to reduce friction. Friction is reduced between the outer and inner wheels, thereby increasing the upper limit of the auxiliary wheel rotation speed. A nut and bolt arrangement is disposed in the nut groove to firmly fix the ring on the outer wall of the outer wheel.", "detailed_description": ["As shown inFIGS.1-5, an auxiliary wheel includes a wheel hub1and a tire2. The wheel hub1includes an outer wheel hub3and an inner wheel hub4. The tire2is mounted on the outer wall of the outer wheel hub3and the outer wheel hub3and the inner wheel hub4are detachably connected through the first connection component5. When the first connection component5unlocks the connection between the outer wheel hub3and the inner wheel hub4, relative rotation is generated between the outer wheel hub3and the inner wheel hub4. Bearings6reduce friction between the inner wheel hub4and the outer wheel hub3.", "", "The middle section of the inner wheel hub4is equipped with a fixed clamp strip7and the bearing6has a bearing through hole10. Its inner wall is fixed on the fixed clamp strip7which increases the firmness with the inner wall of the bearing6. The outer wall of the bearing6is fixed to the outer wheel hub3.", "", "Inner wheel hub4includes ring8that is inserted into the bearing through hole10and mounting plate9extends radially from the circumference of the first end of ring8. When ring8is inserted into the bearing through hole10, mounting plate9is located on the outside of the through hole10and opposes outer wheel hub3. Mounting plate9and outer wheel hub3are detachably connected through the first connection component5and a bolt11and nut12are threaded.", "", "Outer wheel hub3is equipped with nut groove13along the circumference and fixing block14is installed in nut groove13. Fixing block14is rubber wrapped around nut12. Mounting plate9of inner wheel hub4is equipped with fixing hole15corresponding to nut groove13and bolt11passes through fixing hole15to match nut12. Fixing block14is firmly embedded in nut groove13.", "", "The second end of ring8extends out of the through hole10and ring8is sleeved with setting ring16. Setting ring16and ring8are detachably connected through second connecting component17. Second connecting component17is the second bolt which is tightly connected with ring8through setting ring16and the second bolt is threaded to threaded hole18of setting ring16and firmly supports the outer peripheral surface of ring8. Setting ring16and mounting plate9are respectively located on both sides of the bearing through hole10, and setting ring16is against outer wheel hub3. Setting ring16is attached to the opening of nut groove13to prevent fixing block14from leaving nut groove13.", "", "The central part of inner wheel hub4is formed with an installation hole19for installing the shaft. Installation hole19is a step hole which is used for installing shafts with different end diameters in the installation hole19. Installation hole19includes at least two holes that gradually increase in diameter along the axial direction of inner wheel hub4.", "", "The outer wheel hub3of wheel hub1is made of plastic with a large number of hollow areas and reinforcing ribs inside the outer wheel hub3. Without reducing its firmness, the cost is low and the weight is light making it easy for users to lift it. The inner wheel hub4provides sufficient strength for metal parts to increase its service life. The tire2is a rubber part integrally formed on the outer wheel hub3, improving the tire's torque resistance, grip, and resistance to friction.", "", "When using the auxiliary wheel, tools are needed to remove the wheel on the vehicle and install the auxiliary wheel on the wheel shaft. After installing mounting hole19into the fixed position on the wheel shaft and locking it firmly, setting ring16is removed and bolt11on inner wheel hub4and inner wheel nut12on fixing block14of outer wheel hub3are turned away to achieve the effect of loosening first connection component5which allows the inner wheel hub4and outer wheel hub3to rotate independently to avoid mutual interference. Bearing6can increase the rotational speed of outer wheel hub3and tire2, making it easier for consumers to move faulty vehicles. After bolt11of the first connecting component5is removed, the fixing block14with nuts is stuck on the nut groove. With the restriction of the setting ring16, fixing block14with nuts12will not come out of the nut groove13.", "", "Therefore, when the tire is converted from the outer wheel hub3to inner wheel hub4in the relative rotation and no rotation state, it is achieved only through the loading and unloading of the outer bolts, without having to remove the tire from the vehicle which is more convenient.", "", "The foregoing is only a preferred embodiment of the present invention and it should be noted that, for those skilled in the art, a plurality of improvements and can be made without departing from the technical principle of the present invention and these improvements are within the scope of the present invention."], "claims": ["1 . An auxiliary wheel comprises a wheel hub and a tire, the wheel hub includes an outer wheel hub and an inner wheel hub, the tire is mounted on the outer wall of the outer wheel hub, and the outer wheel hub and the inner wheel hub are detachably connected through a first connection component, when the first connection component unlocks the connection between the outer wheel hub and the inner wheel hub, relative rotation is generated between the outer wheel hub and the inner wheel hub, and a bearing is disposed between the inner wheel hub and the outer wheel hub to reduce friction.", "2 . The auxiliary wheel according to claim 1 wherein the middle section of the inner wheel hub is equipped with a fixed clamp strip, the inner wall of the bearing is fixed on the fixed clamp strip, and the outer wall of the bearing is fixed on the outer wheel hub.", "3 . The auxiliary wheel according to claim 1 wherein the inner wheel hub includes a ring that is inserted in the bearing through hole and a mounting plate that extends radially from the circumference of the first end of the ring, when the ring is inserted in the bearing through hole, the mounting plate is located outside the through hole and opposes the outer wheel hub, and the mounting plate and the outer wheel hub are detachably connected through the first connecting component.", "4 . The auxiliary wheel according to claim 3 wherein the first connecting component is a bolt and a nut that are threaded.", "5 . The auxiliary wheel according to claim 4 wherein the outer wheel hub is provided with a nut groove, a fixing block is provided in the nut groove, said fixing block is rubber wrapped around the nut, the inner wheel hub is provided with a fixing hole corresponding to the nut groove, and said bolt passes through the fixing hole and matches with said nut.", "6 . The auxiliary wheel according to claim 5 wherein the second end of the ring extends out of the bearing through hole, the ring is sleeved with a setting ring, the setting ring and the ring are detachably connected through the second connecting component, the setting ring and the mounting plate are respectively located on both sides of the bearing through hole, the setting ring is opposed to the outer wheel hub, and the setting ring is attached to the opening of the nut groove.", "7 . The auxiliary wheel according to claim 6 wherein the second connecting component is a bolt which passes through the setting ring and is tightly connected with the ring.", "8 . The auxiliary wheel according to claim 1 wherein an installation hole for installing a shaft is formed in the center of the inner wheel hub, and the installation hole is a step hole used for installing shafts with different end diameters in the installation hole.", "9 . The auxiliary wheel according to any of claim 1 wherein the installation hole comprises at least two holes gradually increasing in diameter along the axial direction of the inner wheel hub.", "10 . The auxiliary wheel according to claim 1 wherein the outer wheel hub is a plastic component and the inner wheel hub is a metal component."], "bibtex": "@patent{20240416679,\n    title = {AN AUXILIARY WHEEL},\n    number = {20240416679},\n    year = {2024},\n    note = {File: US20240416679A1-20241219.XML}\n    }", "classification": "B60B2706FI"}, {"title": "CASTER DEVICE", "doc_number": "20240416680", "filename": "US20240416680A1-20241219.XML", "abstract": "A caster device, which includes a container with a downward opening and a top plate, as well as a mounting bracket that can slide vertically inside the container. In addition, one or more casters are attached to one side of the mounting bracket and come into contact with the ground. On the other side of the mounting bracket, there is at least one elastic element pressed against the underside of the container's top plate. When a predetermined weight is applied to the object supported by the container of the caster device, the elastic element is compressed, thereby causing the bottom edge of the container to contact the ground. This increases the friction between the caster device and the ground, making the caster device not easy to move.", "detailed_description": [""], "claims": ["a container including a downward opening and a top plate; a mounting bracket, set within the container and suitable for vertical sliding within the container; at least one caster, fixed on one side of the mounting bracket and in contact with the ground surface; at least one elastic element, located on the other side of the mounting bracket, and pressed against a bottom surface of the top plate of the container; wherein, when a predetermined weight is applied to the object supported by the container, the elastic element is compressed, the bottom edge of the container contacts the ground surface, thereby increasing the friction between the caster device and the ground surface, making the caster device difficult to move.", "2 . The caster device according to claim 1 , wherein the elastic element is a spring.", "3 . The caster device according to claim 1 , wherein the container includes an upper half container and a lower half container, a side wall of the lower half container and a side wall of the upper half container each have an interlocking structure, the lower half container and the upper half container are assembled through the interlocking structure.", "4 . The caster device according to claim 3 , further including at least one rotary damper, located between the side wall of the lower half container and the side wall of the upper half container, the rotary damper includes a gear, the gear passes through a through hole in the side wall of the lower half container and cooperates with a rack on the mounting bracket.", "5 . The caster device according to claim 1 , wherein the side wall of the mounting bracket includes multiple slide rails and cooperates with corresponding multiple grooves within the container.", "6 . The caster device according to claim 1 , further including a fixing screw, the fixing screw is set on the container, used to fix the container to the bottom of the object.", "7 . The caster device according to claim 1 , further including at least one buffering mechanism.", "8 . The caster device according to claim 7 , wherein the buffering mechanism is a rotary damper.", "9 . The caster device according to claim 1 , wherein the caster is a double wheel rotating caster.", "10 . The caster device according to claim 9 , wherein the caster includes a tread made of thermoplastic rubber or polyurethane.", "11 . The caster device according to claim 1 , wherein the caster includes a tread made of thermoplastic rubber or polyurethane."], "bibtex": "@patent{20240416680,\n    title = {CASTER DEVICE},\n    number = {20240416680},\n    year = {2024},\n    note = {File: US20240416680A1-20241219.XML}\n    }", "classification": "B60B3300FI"}, {"title": "COMPOSITIONS FOR ELASTOMERIC COMPOUNDS COMPRISING A NEW SECONDARY CROSS-LINKING SYSTEM AND TIRES COMPRISING THE SAME", "doc_number": "20240416681", "filename": "US20240416681A1-20241219.XML", "abstract": "The present invention relates to compositions for elastomeric compounds of tires, comprising a new secondary cross-linking system comprising at least one methylenes donor agent and at least one methylenes acceptor agent selected from furoic acid, its esters or its salts, tire components and tires for vehicles wheels comprising them.", "detailed_description": ["The composition for tire compounds according to the present invention is characterised by one or more of the following preferred aspects taken alone or in combination with each other.", "", "The composition according to the invention comprises at least 100 phr of at least one diene polymer (A).", "", "The diene polymer (A) may be selected from those commonly used in sulphur-vulcanisable elastomeric compositions, which are particularly suitable for producing tires, i.e. from among solid elastomeric polymers or copolymers with an unsaturated chain having a glass transition temperature (Tg) generally lower than 20° C., preferably in the range from 0° C. to −110° C.", "", "These polymers or copolymers may be of natural origin or may be obtained by solution polymerization, emulsion polymerization or gas-phase polymerization of one or more conjugated dienes, optionally mixed with at least one comonomer selected from monoolefins, monovinylarenes and/or polar comonomers in an amount not exceeding 60% by weight.", "", "The conjugated dienes generally contain from 4 to 12, preferably from 4 to 8 carbon atoms and may be selected, for example, from the group comprising: 1,3-butadiene, isoprene, 2,3-dimethyl-1,3-butadiene, 1,3-pentadiene, 1,3-hexadiene, 3-butyl-1,3-octadiene, 2-phenyl-1,3-butadiene and mixtures thereof. 1,3-butadiene and isoprene are particularly preferred.", "", "The monoolefins may be selected from ethylene and α-olefins generally containing from 3 to 12 carbon atoms, such as for example propylene, 1-butene, 1-pentene, 1-hexene, 1-octene or mixtures thereof.", "", "Monovinylarenes, which may optionally be used as comonomers, generally contain from 8 to 20, preferably from 8 to 12 carbon atoms and may be selected, for example, from: styrene; 1-vinylnaphthalene; 2-vinylnaphthalene; various alkyl, cycloalkyl, aryl, alkylaryl or arylalkyl derivatives of styrene, such as, for example, α-methylstyrene, 3-methylstyrene, 4-propylstyrene, 4-cyclohexylstyrene, 4-dodecylstyrene, 2-ethyl-4-benzylstyrene, 4-p-tolyl-styrene, 4- (4-phenylbutyl)styrene, and mixtures thereof. Styrene is particularly preferred.", "", "Polar comonomers that may optionally be used, may be selected, for example, from: vinylpyridine, vinylquinoline, acrylic acid and alkylacrylic acid esters, acrylonitriles, or mixtures thereof, such as, for example, methyl acrylate, ethyl acrylate, methyl methacrylate, ethyl methacrylate, acrylonitrile and mixtures thereof.", "", "Preferably, the diene polymer (A) may be selected, for example, from among: cis-1,4-polyisoprene (natural or synthetic, preferably natural rubber), 3,4-polyisoprene, polybutadiene (in particular polybutadiene with a high content of 1,4-cis), optionally halogenated isoprene/isobutene copolymers, 1,3-butadiene/acrylonitrile copolymers, styrene/1,3-butadiene copolymers, styrene/isoprene/1,3-butadiene copolymers, styrene/1,3-butadiene/acrylonitrile copolymers, and mixtures thereof.", "", "The composition according to the invention may possibly comprise at least one polymer of one or more monoolefins with an olefinic comonomer or derivatives thereof. The monoolefins may be selected from: ethylene and α-olefins generally containing from 3 to 12 carbon atoms, such as for example propylene, 1-butene, 1-pentene, 1-hexene, 1-octene or mixtures thereof. The following are preferred: copolymers selected from ethylene and an α-olefin, optionally with a diene; isobutene homopolymers or copolymers thereof with small amounts of a diene, which are optionally at least partially halogenated. The diene possibly present generally contains from 4 to 20 carbon atoms and is preferably selected from: 1,3-butadiene, isoprene, 1,4-hexadiene, 1,4-cyclohexadiene, 5-ethylidene-2-norbornene, 5-methylene-2-norbornene, vinylnorbornene or mixtures thereof. Among them, the following are particularly preferred: ethylene/propylene (EPR) copolymers or ethylene/propylene/diene (EPDM) copolymers; polyisobutene; butyl rubber; halobutyl rubbers, in particular chlorobutyl or bromobutyl rubbers; and mixtures thereof.", "", "The composition for tires according to the present invention comprises at least 0.1 phr of at least one reinforcing filler (B), preferably at least 1 phr. Even more preferably, the composition may comprise at least 5 phr of said reinforcing filler (B). The present composition may comprise from 1 phr to 170 phr, from 5 phr to 150 phr or from 10 phr to 120 phr of at least one reinforcing filler (B).", "", "Preferably, the reinforcing filler (B) is selected from carbon black, white fillers, silicate fibres or mixtures thereof.", "", "In one embodiment, said reinforcing filler (B) is a white filler selected from among hydroxides, oxides and hydrated oxides, salts and hydrated salts of metals, silicates fibres or mixtures thereof. Preferably, said white filler is silica.", "", "Preferably, silica as reinforcing filler (B) is present in the composition according to the invention in an amount of between 1 phr and 150 phr, more preferably between 10 phr and 70 phr.", "", "Commercial examples of suitable conventional silica are Zeosil 1165 MP from Solvay, and Ultrasil 7000 GR from Evonik.", "", "In another embodiment, said reinforcing filler (B) is carbon black.", "", "Preferably, carbon black as reinforcing filler (B) is present in the composition according to the invention in an amount of between 1 phr and 120 phr, preferably between 5 phr and 100 phr.", "", "Preferably, the carbon black is selected from those having a surface area not smaller than 20 m2/g, preferably larger than 50 m2/g (as determined by STSA-statistical thickness surface area according to ISO 18852:2005).", "", "The carbon black may be, for example, N234, N326, N330, N375 or N550, N660 marketed by Birla Group (India) or by Cabot Corporation.", "", "The composition for tire compounds according to the invention may comprise from 0.1 to 20 phr of at least a vulcanising agent (C).", "", "The vulcanising agent (C) is a cross-linking agent preferably selected from sulphur-based cross-linking agents such as elemental sulphur, polymeric sulphur, sulphur donor agents such as bis[(trialkoxysilyl)propyl]polysulphides, thiurams, dithiodimorpholines and caprolactam-disulphide, peroxides, such as dialkyl peroxides R—O—O—R, wherein R is an alkyl group, alkyl-aryl peroxides R—O—O—R′, wherein R is an alkyl group and R′ aryl, diaryl peroxides R′—O—O—R′, wherein R′ is an aryl group, diacylperoxides R—C(O)—O—O—(O)C—R′, wherein R and R′ are aryl and/or alkyl groups, peroxyketals R—O—O—(R)C(R′)—O—O—R′, wherein R and R′ are aryl and/or alkyl groups, peroxyesters R—C(O)—O—O—R′, wherein R and R′ are aryl and/or alkyl groups, metal oxides, such as zinc oxide, quinones, resins and organic bases.", "", "Said at least one vulcanising agent (C) is preferably a sulphur-based vulcanising agent selected from sulphur, or alternatively, sulphur-containing molecules (sulphur donors), such as for example bis(trialcoxysilyl)propyl]polysulphides and mixtures thereof. Preferably, the vulcanising agent (C) is sulphur, even more preferably selected from soluble sulphur (crystalline sulphur), insoluble sulphur (polymeric sulphur), and oil-dispersed sulphur and mixtures thereof. Commercial example of a vulcanising agent (C) suitable for use in the composition of the invention is the Redball Superfine sulphur of International sulphur Inc.", "", "Preferably, the composition according to the invention comprises at least 0.5 phr, 0.8 phr or 1 phr of at least one vulcanising agent (C), preferably a sulphur-based cross-linking agent selected from those indicated above.", "", "Even more preferably, the composition comprises from 0.1 to 15 phr, 0.2 to 10 phr, 1 to 10 phr or 1.5 to 7 phr of at least one vulcanising agent (C), preferably a sulphur-based cross-linking agent selected from those indicated above.", "", "The composition according to the invention may further comprise adjuvants known to those skilled in the art such as vulcanisation activators, accelerants and/or retardants.", "", "The vulcanisation activating agents which may be used in the present composition are zinc compounds, in particular ZnO, ZnCO3, zinc salts of saturated or unsaturated fatty acids containing from 8 to 18 carbon atoms, which are preferably formed in situ in the composition by reaction of ZnO and of the fatty acid, as well as Bi2O3, PbO, Pb3O4, PbO2, or mixtures thereof. For example, zinc stearate is used, preferably formed in situ in the composition, by ZnO and fatty acid, or magnesium stearate, formed by MgO, or mixtures thereof. Preferred activating agents derive from the reaction of zinc oxide and stearic acid. An example of activator is the product Aktiplast ST marketed by Rheinchemie.", "", "In particular, the vulcanisation activating agents indicated above may be present in the composition of the invention in amounts preferably from 0.2 phr to 15 phr, more preferably from 1 phr to 5 phr.", "", "The composition according to the invention may further comprise at least one vulcanisation accelerant.", "", "Vulcanisation accelerants commonly used may be for example selected from dithiocarbamates, guanidines, thioureas, thiazoles, sulphenamides, sulphenimides, thiurams, amines, xanthates, or mixtures thereof. Preferably, the accelerant agent is selected from mercaptobenzothiazole (MBT), N-cyclohexyl-2-benzothiazol-sulphenamide (CBS), N-tert-butyl-2-benzothiazol-sulphenamide (TBBS) and mixtures thereof.", "", "Commercial examples of accelerants suitable for use in the present composition are N-cyclohexyl-2-benzothiazyl-sulphenamide Vulkacit@ (CBS or CZ), and N-terbutyl 2-benzothiazil sulphenamide, Vulkacit@ NZ/EGC marketed by Lanxess.", "", "In particular, the vulcanisation accelerants indicated above may be used in the present composition in an amount preferably from 0.05 phr to 10 phr, preferably from 0.1 phr to 7 phr, more preferably from 0.5 phr to 5 phr.", "", "The composition according to the invention may further comprise at least one vulcanisation retardant agent.", "", "The vulcanisation retardant agent suitable for use in the present composition is preferably selected from urea, phthalic anhydride, N-nitrosodiphenylamine N-cyclohexylthiophthalimide (CTP or PVI) and mixtures thereof. A commercial example of a suitable retardant agent is N-cyclohexylthiophthalimide VULKALENT G of Lanxess. The vulcanisation retardant agent may be present in the present composition in an amount of preferably from 0.05 phr to 2 phr.", "", "In one embodiment, the composition according to the invention may further comprise at least 0.05 phr, preferably at least 0.1 phr or 0.5 phr, more preferably at least 1 phr or 2 phr of at least one silane coupling agent.", "", "The composition for tire compounds according to the invention comprises a cross-linking system (D) which comprises at least one methylenes donor agent (D1) and at least one methylenes acceptor agent (D2) selected from furoic acid, its esters or its salts.", "", "The methylenes donor agent (D1) may be formaldehyde or a derivative thereof which, when heated during vulcanisation, can release formaldehyde in situ, forming a lattice with furoic acid, its esters or its salts in the compound.", "", "Examples of suitable methylenes donor agents (D1) include, but are not limited to, hexamethylenetetramine (HMT), hexamethoxymethylmelamine (HMMM), hexamethylol melamine, N,N′-dimethylolurea, N-methylol dicyanamide, N-allyl dioxazine, N-phenyl dioxazine, N-methylol-acetamide, N-methylol-butyramide, N-methylol-acrylamide, N-methylol-succinimide, lauriloxymethylpyridinium chloride, ethoxymethylpyridinium chloride, trioxan hexamethoxymethylmelamine, as described for example in U.S. Pat. No. 3,751,331, preferably HMMM or HMT.", "", "The methylenes donor agent (D1) is preferably present in the compound in amounts of from 0.5 to 15 phr, preferably from 0.5 to 10 phr.", "", "The cross-linking system (D) comprises at least one methylenes acceptor (D2) selected from furoic acid, its esters or its salts."], "claims": ["1 - 15 . (canceled)", "100 phr of at least one diene elastomeric polymer (A), at least 0.1 phr of at least a reinforcing filler (B), from 0.1 phr to 20 phr of a vulcanising agent (C), and at least 0.1 phr of a secondary cross-linking system (D) comprising at least one methylenes donor agent (D1) and at least one methylenes acceptor agent (D2) selected from furoic acid, esters thereof, and salts thereof.", "17 . The composition according to claim 16 , comprising at least 0.5 phr, of at least a vulcanising agent (C).", "18 . The composition according to claim 16 , comprising from 0.5 phr to 15 phr of the methylenes donor agent (D1).", "19 . The composition according to claim 16 , wherein the salts of furoic acid (D2) are selected from alkaline or alkaline earth inorganic salts, organic salts, and mixtures thereof.", "20 . The composition according to claim 16 , wherein the esters of furoic acid (D2) are selected from C 1 -C 18 alkyl esters.", "21 . The composition according to claim 16 , comprising from 0.5 phr to 15 phr of the methylenes acceptor agent (D2).", "22 . The composition according to claim 16 , wherein the methylenes donor agent (D1) is selected from hexamethylenetetramine (HMT), hexamethoxymethylmelamine (HMMM), hexamethylol melamine, N,N′-dimethylolurea, N-methylol dicyanamide, N-allyl dioxazine, N-phenyl dioxazine, N-methylol-acetamide, N-methylol-butyramide, N-methylol-acrylamide, N-methylol-succinimide, lauryloxymethylpyridinium chloride, ethoxymethylpyridinium chloride, trioxanehexamethoxymethylmelamine, and hexamethylolmelamine pentamethyl ether (HMPE).", "23 . The composition according to claim 16 , wherein the methylene donor agent (D1) and the furoic acid, esters thereof, and salts thereof (D2), are in a weight ratio ranging from 1:0.1 to 1:10.", "24 . A green or, at least partially, cross-linked elastomeric compound for tires, obtained by mixing and optionally vulcanising, at least partially, the elastomeric composition according to claim 16 .", "25 . The elastomeric compound according to claim 24 , wherein the elastomeric compound is a rubberizing compound of reinforcing elements.", "26 . A component of a tire for vehicle wheels comprising the green or at least partially cross-linked elastomeric compound according to claim 24 .", "27 . The component of a tire according to claim 26 , comprising reinforcing elements of one or more materials selected from polyamides, polyesters, and cellulose derivatives.", "28 . The component of a tire according to claim 26 , wherein the component of the tire is selected from a carcass structure, a belt structure, and protection layers (chafer) or reinforcing layers (flipper) of the bead.", "29 . A tire for vehicle wheels comprising at least one component of tire according to claim 26 .", "30 . The tire according to claim 29 , wherein the component is an unreinforced component selected from an under-layer, a sheet, a sidewall, and a tread band.", "31 . The composition according to claim 23 wherein the methylene donor agent (D1) and the furoic acid, its salts or its esters (D2), are in a weight ratio comprised between 1:0.5 and 1:5.", "32 . The composition according to claim 18 , comprising from 0.5 phr to 10 phr of the methylenes donor agent (D1).", "33 . The composition according to claim 19 , wherein the salts of furoic acid (D2) are selected from sodium furoate, potassium furoate, zinc furoate, calcium furoate, and quaternary ammonium furoate.", "34 . The composition according to claim 20 , wherein the esters of furoic acid (D2) are selected from C 1 -C 5 alkyl esters.", "35 . The composition according to claim 21 , comprising from 0.5 phr to 10 phr of the methylenes acceptor agent (D2)."], "bibtex": "@patent{20240416681,\n    title = {COMPOSITIONS FOR ELASTOMERIC COMPOUNDS COMPRISING A NEW SECONDARY CROSS-LINKING SYSTEM AND TIRES COMPRISING THE SAME},\n    number = {20240416681},\n    year = {2024},\n    note = {File: US20240416681A1-20241219.XML}\n    }", "classification": "B60C100FI"}, {"title": "SOLID TIRE AND METHOD FOR MANUFACTURING SAME", "doc_number": "20240416682", "filename": "US20240416682A1-20241219.XML", "abstract": "In a solid tire including a tread rubber layer on a road contact surface side and a base rubber layer on a rim side and having a side surface extending in a tire radial direction from the tread rubber layer to the base rubber layer, an RFID tag is embedded inside the solid tire, and the RFID tag is disposed near the side surface. When forming an unvulcanized tire by winding a rubber sheet into multiple layers, the RFID tag is inserted between layers of the rubber sheet in the middle of the winding into multiple layers, or the RFID tag and a coating layer are overlaid and attached on a side surface of the unvulcanized tire, and then the unvulcanized tire including the RFID tag is vulcanized in a mold.", "detailed_description": [""], "claims": ["1 - 15 . (canceled)", "a tread rubber layer on a road contact surface side; a base rubber layer on a rim side; and a side surface extending in a tire radial direction from the tread rubber layer to the base rubber layer; an RFID tag being embedded inside the solid tire, the RFID tag being disposed near the side surface, and a distance between the RFID tag and the side surface ranging from 0.5 mm to 10.0 mm.", "17 . The solid tire according to claim 16 , wherein the RFID tag is embedded substantially parallel to the side surface.", "18 . The solid tire according to claim 16 , wherein the RFID tag is disposed near the side surface of the solid tire that is on an outer side of a vehicle when the solid tire is mounted on the vehicle.", "19 . The solid tire according to claim 16 , wherein the RFID tag is embedded in the base rubber layer.", "20 . The solid tire according to claim 19 , wherein the RFID tag is disposed at a position deviating from a rim slippage region defined within a range of −15% to +15% of a rim flange height with an apex of a rim flange as a center.", "21 . The solid tire according to claim 19 , wherein short fibers are blended in a rubber composition constituting the base rubber layer.", "22 . The solid tire according to claim 21 , wherein the short fibers contain 1 phr to 10 phr of vinylon fibers having a fiber length of 2 mm to 10 mm and a fiber diameter of 5 μm to 50 μm.", "23 . The solid tire according to claim 16 , wherein the RFID tag is coated with an adhesive.", "24 . The solid tire according to claim 16 , wherein the RFID tag is coated with polyphenylene sulfide resin.", "25 . The solid tire according to claim 16 , wherein the RFID tag is coated with ceramic.", "26 . The solid tire according to claim 16 , wherein the RFID tag is coated with a plurality of reinforcing fiber cords.", "27 . The solid tire according to claim 16 , wherein the RFID tag is coated with a reinforcing fabric.", "when forming an unvulcanized tire by winding a rubber sheet into multiple layers, inserting an RFID tag between layers of the rubber sheet in a middle of the winding into multiple layers; and vulcanizing an unvulcanized tire comprising the RFID tag in a mold.", "when winding the rubber sheet into multiple layers, calculating a winding position of the rubber sheet in a radial direction of the unvulcanized tire in accordance with a winding length and a thickness of the rubber sheet; and inserting an RFID tag in accordance with the winding position.", "forming an unvulcanized tire by winding a rubber sheet into multiple layers; then attaching an RFID tag to a side surface of the unvulcanized tire; further overlaying and attaching a coating layer made of unvulcanized rubber having a thickness of 0.5 mm to 10 mm on the RFID tag; and then vulcanizing the unvulcanized tire comprising the RFID tag in a mold."], "bibtex": "@patent{20240416682,\n    title = {SOLID TIRE AND METHOD FOR MANUFACTURING SAME},\n    number = {20240416682},\n    year = {2024},\n    note = {File: US20240416682A1-20241219.XML}\n    }", "classification": "B60C700FI"}, {"title": "TIRE WITH A TREAD COMPRISING REINFORCING ELEMENTS", "doc_number": "20240416683", "filename": "US20240416683A1-20241219.XML", "abstract": "A tire tread comprises at least one tread pattern block having at least one circumferential reinforcing element made of a composition having a dynamic shear modulus G* at least twice the dynamic shear modulus G* of the composition of the rest of the blocks of the tread. The composition of the at least one circumferential reinforcing element is based on at least one diene elastomer, one reinforcing filler comprising a carbon black exhibiting an STSA specific surface area, measured according to the standard D6556-2016, of greater than or equal to 90 m 2 /g, one epoxy resin, one amine-comprising curing agent and one crosslinking system.", "detailed_description": [""], "claims": ["1 .- 15 . (canceled)", "wherein the composition of the at least one circumferential reinforcing element (", "17 . The tire according to claim 16 , wherein the at least one circumferential reinforcing element ( 52 ) extends radially over a height h corresponding to 50% to 100% of a thickness p of the tread.", "18 . The tire according to claim 16 , wherein the at least one circumferential reinforcing element ( 52 ) at least partially forms the axially internal lateral face ( 7 i ) or the axially external lateral face ( 7 e ) of the at least one of the tread pattern blocks ( 51 ).", "19 . The tire according to claim 16 , wherein the at least one diene elastomer is selected from the group consisting of polybutadienes, natural rubber, synthetic polyisoprenes, butadiene copolymers, isoprene copolymers and mixtures thereof.", "20 . The tire according to claim 16 , wherein the carbon black exhibits an STSA specific surface area within a range from 95 to 250 m 2 /g.", "21 . The tire according to claim 16 , wherein the carbon black exhibits a COAN number, measured according to standard ASTM D3493-2018, of greater than or equal to 75 ml/100 g.", "22 . The tire according to claim 16 , wherein the carbon black exhibits an iodine absorption number, measured according to standard ASTM D1510-2017, of greater than or equal to 100 g/kg.", "23 . The tire according to claim 16 , wherein the carbon black represents more than 50% by weight of a weight of the one reinforcing filler.", "24 . The tire according to claim 16 , wherein a content of the one reinforcing filler is within a range from 20 to 200 phr.", "25 . The tire according to claim 16 , wherein a content of the one epoxy resin is within a range from 1 to 30 phr.", "26 . The tire according to claim 16 , wherein the one epoxy resin is selected from the group consisting of aromatic epoxy resins, alicyclic novolac resins, aliphatic epoxy resins, and mixtures thereof.", "27 . The tire according to claim 16 , wherein the one epoxy resin is an aromatic epoxy resin and is selected from the group consisting of 2,2 bis[4-(glycidyloxy)phenyl]propane, poly[(o-cresyl glycidyl ether)-co-formaldehyde], poly[(phenyl glycidyl ether)-co-formaldehyde], poly[(phenyl glycidyl ether)-co-(hydroxybenzaldehyde glycidyl ether)], and mixtures thereof.", "28 . The tire according to claim 16 , wherein a content of the one amine-comprising curing agent is within a range from 1 to 15 phr.", "29 . The tire according to claim 16 , wherein the one amine-comprising curing agent is selected from the group consisting of aliphatic polyamines, alicyclic polyamines, aromatic polyamines, and mixtures thereof.", "30 . The tire according to claim 16 , wherein the composition of the remainder of the tread pattern blocks has a dynamic shear modulus G*, measured at 60° C. at 10 Hz and under an alternating shear stress of 0.7 MPa, of less than or equal to 1.3 MPa."], "bibtex": "@patent{20240416683,\n    title = {TIRE WITH A TREAD COMPRISING REINFORCING ELEMENTS},\n    number = {20240416683},\n    year = {2024},\n    note = {File: US20240416683A1-20241219.XML}\n    }", "classification": "B60C1100FI"}, {"title": "TIRE", "doc_number": "20240416684", "filename": "US20240416684A1-20241219.XML", "abstract": "A tire according to the present disclosure includes a tire body and a covered communication device at least a part of which is embedded in the tire body. The covered communication device includes a communication device and a covering body that covers the periphery of the communication device. The covering body includes a distinction portion that is distinguishable from a portion located around the covering body, of the tire body, in a cross-sectional view in a plane passing through the covered communication device.", "detailed_description": ["Embodiments of a tire according to the present disclosure will be exemplarily described below with reference to the drawings. In the drawings, the same reference signs denote common components. In this specification, a tire width direction refers to a direction parallel to the central axis of the tire. A tire radial direction refers to a radial direction that is orthogonal to the central axis of the tire and centered on the central axis. A tire circumferential direction refers to a direction in which the tire rotates about the central axis of the tire.", "", "In this specification, a “tread outer surface” means an outer circumferential surface throughout the entire circumference of the tire that is in contact with a road surface when the tire mounted on a rim and filled with a specified internal pressure is rotated under a maximum load (hereinafter also referred to as “maximum load condition”). In addition, “tread ends” mean outer ends of the tread outer surface in the tire width direction.", "", "In this specification, the “rim” means a standard rim (Measuring Rim in ETRTO's STANDARDS MANUAL and Design Rim in TRA's YEAR BOOK) of an applicable size conformable to industrial standards valid for regions in which tires are produced and used, as described in or to be described in JATMA YEAR BOOK of the Japan Automobile Tyre Manufacturers Association, Inc. (JATMA) in Japan, STANDARDS MANUAL of the European Tyre and Rim Technical Organisation (ETRTO) in Europe, YEAR BOOK of the Tire and Rim Association, Inc. (TRA) in the United States, or the like, but in the case of a size that is not listed in such industrial standards, a rim with a width corresponding to a bead width of the tire. The “rim” may be of a size that may be included in the above industrial standards in the future, as well as a current size. Examples of the “size that is included in the future” may be sizes listed as “FUTURE DEVELOPMENTS” in the 2013 edition of STANDARDS MANUAL of the ETRTO.", "", "In this specification, the “specified internal pressure” means an air pressure (maximum air pressure) corresponding to a maximum load capacity of a single wheel in an applicable size and ply rating as described in the above industrial standards such as JATMA YEAR BOOK, but in the case of a size that is not listed in the above industry standards, an air pressure (maximum air pressure) corresponding to a maximum load capacity specified for each vehicle on which the tire is mounted. In this specification, the “maximum load” means a load corresponding to the maximum load capacity of the tire of an applicable size listed in the above industrial standards, but in the case of a size that is not listed in the above industrial standards, a load corresponding to the maximum load capacity specified for each vehicle on which the tire is mounted."], "claims": ["a tire body; and a covered communication device at least a part of which is embedded in the tire body, wherein the covered communication device comprises: a communication device; and a covering body that covers a periphery of the communication device, and the covering body comprises a distinction portion that is distinguishable from a portion located around the covering body, of the tire body, in a cross-sectional view in a plane passing through the covered communication device.", "the covering body comprises a covering different-color layer having a different hue from the portion located around the covering body, of the tire body, and the distinction portion is the covering different-color layer.", "the covering body comprises: covering rubber that covers the periphery of the communication device; and a covering outer surface layer that covers a periphery of the covering rubber, and the covering different-color layer is the covering outer surface layer.", "the covering body comprises covering rubber that covers the periphery of the communication device, and the covering different-color layer is provided in the covering rubber.", "5 . The tire according to claim 1 , wherein a part of the distinction portion of the covering body is exposed from an outer surface of the tire body.", "6 . The tire according to claim 1 , wherein the distinction portion of the covering body includes a light emission area.", "7 . The tire according to claim 2 , wherein a part of the distinction portion of the covering body is exposed from an outer surface of the tire body.", "8 . The tire according to claim 2 , wherein the distinction portion of the covering body includes a light emission area.", "9 . The tire according to claim 3 , wherein a part of the distinction portion of the covering body is exposed from an outer surface of the tire body.", "10 . The tire according to claim 3 , wherein the distinction portion of the covering body includes a light emission area.", "11 . The tire according to claim 4 , wherein a part of the distinction portion of the covering body is exposed from an outer surface of the tire body.", "12 . The tire according to claim 4 , wherein the distinction portion of the covering body includes a light emission area.", "13 . The tire according to claim 5 , wherein the distinction portion of the covering body includes a light emission area.", "14 . The tire according to claim 7 , wherein the distinction portion of the covering body includes a light emission area.", "15 . The tire according to claim 9 , wherein the distinction portion of the covering body includes a light emission area.", "16 . The tire according to claim 11 , wherein the distinction portion of the covering body includes a light emission area."], "bibtex": "@patent{20240416684,\n    title = {TIRE},\n    number = {20240416684},\n    year = {2024},\n    note = {File: US20240416684A1-20241219.XML}\n    }", "classification": "B60C1300FI"}, {"title": "PNEUMATIC RADIAL TIRE FOR PASSENGER VEHICLES", "doc_number": "20240416685", "filename": "US20240416685A1-20241219.XML", "abstract": "The pneumatic radial tire for passenger vehicles of this disclosure comprises a communication device. A cross-sectional width SW and an outer diameter OD of the tire satisfy a predetermined relationship, and in a cross-sectional view in a tire width direction in a reference condition, the communication device is provided in a tire portion sandwiched between a hypothetical line extending in a tire radial direction through a ground contact edge and a hypothetical line extending in the tire width direction through a tire maximum width position.", "detailed_description": ["The following is a detailed illustration of the embodiment of the present disclosure with reference to the drawings.", "", "FIG.1is a schematic diagram illustrating the cross-sectional width SW and the outer diameter OD of the tire.", "", "A pneumatic radial tire for passenger vehicles (hereinafter referred to simply as “tire”) of one embodiment of the present disclosure has a cross-sectional width SW of less than 165 (mm) and a ratio SW/OD of the cross-sectional width SW to an outer diameter OD of the tire is 0.26 or less, forming a narrow width and large diameter. By making the cross-sectional width SW of the tire relatively narrower than the outer diameter OD of the tire, air resistance can be reduced. At the same time, by making the outer diameter OD of the tire relatively larger than the cross-sectional width SW of the tire, rolling resistance can be reduced by suppressing deformation of the tread rubber near the ground contact patch of the tire. These can improve the fuel efficiency of the tire. The above SW/OD is preferably 0.25 or less, and more preferably 0.24 or less.", "", "The above ratio is preferably satisfied when the internal pressure of the tire is 200 kPa or higher, more preferably when it is 220 kPa or higher, and even more preferably when it is 280 kPa or higher. This is because rolling resistance can be reduced. On the other hand, the above ratio is preferably satisfied when the internal pressure of the tire is 350 kPa or less. This is because ride comfort can be improved.", "", "Here, the cross-sectional width SW of the tire is preferably 105 to 145 mm, and 115 to 135 mm is more preferred.", "", "In addition, the aspect ratio of the tire is preferably 45 to 70 when the cross-sectional width SW and the outer diameter OD of the tire meet the above ratio, and 45 to 65 is more preferred.", "", "Specific tire sizes are not limited, but can be 105/50R16, 115/50R17, 125/55R20, 125/60R18, 125/65R19, 135/45R21, 135/55R20, 135/60R17, 135/60R18, 135/60R19, 135/65R19, 145/45R21, 145/55R20, 145/60R16, 145/60R17, 145/60R18, 145/60R19, 145/65R19, 155/45R18, 155/45R21, 155/55R18, 155/55R19, 155/55R21, 155/60R17, 155/65R18, 155/70R17, or 155/70R19, as an example.", "", "Alternatively, the cross-sectional width SW of the tire is less than 165 mm, and the cross-sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the relational expression:", "", "OD⁡(mm)≥-0.0187×SW⁡(mm)2+9.15×SW⁡(mm)-380,", "", "and the tire has a narrow width and a large diameter.", "", "By satisfying the above relational expression, air resistance and rolling resistance can be reduced, thereby improving the fuel efficiency of the tire.", "", "In the third form, as for the cross-sectional width SW and the outer diameter OD of the tire, the ratio SW/OD is preferably 0.26 or less, more preferably 0.25 or less, and even more preferably 0.24 or less, after satisfying the above relational expression. This is because the fuel efficiency of the tire can be further improved.", "", "The above relational expression and/or the ratio is preferably satisfied when the internal pressure of the tire is 200 kPa or higher, more preferably when it is 220 kPa or higher, and even more preferably when it is 280 kPa or higher. This is because rolling resistance can be reduced. On the other hand, the above relational expression and/or the ratio is preferably satisfied when the internal pressure of the tire is 350 kPa or less. This is because ride comfort can be improved.", "", "Here, the cross-sectional width SW of the tire is preferably 105 to 145 mm, and 115 to 135 mm is more preferred.", "", "In addition, the aspect ratio of the tire is preferably 45 to 70 when the cross-sectional width SW and the outer diameter OD of the tire satisfy the above relational expression, and 45 to 65 is more preferred.", "", "Specific tire sizes are not limited, but can be 105/50R16, 115/50R17, 125/55R20, 125/60R18, 125/65R19, 135/45R21, 135/55R20, 135/60R17, 135/60R18, 135/60R19, 135/65R19, 145/45R21, 145/55R20, 145/60R16, 145/60R17, 145/60R18, 145/60R19, 145/65R19, 155/45R18, 155/45R21, 155/55R18, 155/55R19, 155/55R21, 155/60R17, 155/65R18, 155/70R17, or 155/70R19, as an example.", "", "The tire of this embodiment is a pneumatic radial tire for passenger vehicles. This tire is particularly suitable for use as a tire mounted on a vehicle for personal mobility.", "", "FIG.2is a cross-sectional view in the tire width direction of a pneumatic radial tire for passenger vehicles according to one embodiment of this disclosure.FIG.2illustrates a cross-sectional view in the width direction of the tire under reference condition, with the tire mounted on a rim, filled to the prescribed internal pressure, and unloaded. As illustrated inFIG.2, the tire1comprises a carcass3consisting of plies of radially arranged cords that straddle toroidally between a pair of bead portions2. The tire1also comprises a belt4consisting of two belt layers4aand4bin the illustrated example, and a tread5, in this order, on the outer side of the carcass3in the tire radial direction.", "", "In this example, bead cores2aare embedded in each of the pair of bead portions2. In the present disclosure, the cross-sectional shape and material of the bead core2aare not particularly limited, and can be of the configuration normally used in pneumatic radial tires for passenger vehicles. In the present disclosure, the bead core2amay be divided into a plurality of small bead cores. Alternatively, in the present disclosure, the tire can be configured without the bead core2a.", "", "The tire1in the illustrated example has an abbreviated triangular-shaped bead filler2bin cross section on the outer side of the bead core2ain the tire radial direction. The cross-sectional shape of the bead filler2bis not limited to this example, nor is its material. Alternatively, the tire can be made lighter by not having the bead filler2b.", "", "In this embodiment, the tire1can also be configured with a rim guard. In addition, in this embodiment, the bead portion2can be further provided with an additional reinforcement member such as a reinforcement rubber or a cord layer for reinforcement or other purposes. Such additional members can be provided in various positions relative to the carcass3and the bead filler2b.", "", "In the example illustrated inFIG.2, the carcass3consists of a single carcass ply. On the other hand, the number of carcass plies in the present disclosure is not limited and can be two or more. In the example illustrated inFIG.2, the carcass3has a carcass body portion3athat straddles toroidally between the pair of bead portions2and carcass turn-up portions3bthat is folded around the bead core2afrom the carcass body portion3a. On the other hand, in the present disclosure, the carcass turn-up portions3bcan be wrapped around the bead core2a, or these can be sandwiched between a number of divided small bead cores. In the illustration, the end3cof the carcass turn-up portion3bis located on the outer side in the tire radial direction than the tire radially outer end of the bead filler2band on the inner side in the tire radial direction than the tire maximum width position. This makes it possible to reduce the weight of the tire while ensuring the rigidity of the sidewall portion. On the other hand, in the present disclosure, the end3cof the carcass turn-up portion3bmay be located on the inner side in the tire radial direction than the tire radially outer end of the bead filler2b, or on the outer side in the tire radial direction than the tire maximum width position. Alternatively, the end3cof the carcass turn-up portion3bcan be of an envelope structure, in which it is positioned between the carcass body portion2aand the belt4in the tire radial direction, and is positioned inner side in the tire width direction than the end of the belt4(e.g., the end of the belt layer4b). Furthermore, when the carcass3is constituted by a plurality of carcass plies, the position of the end3cof the carcass turn-up portions3b(e.g., in the tire radial direction) can be the same or different among the carcass plies. The number of cords in the carcass3is not particularly limited, but can be in the range of 20 to 60 cords/50 mm, for example. In addition, various structures can be used for the carcass lines. For example, in the tire radial direction, the carcass maximum width position can be moved closer to the bead portion2side or to the tread portion5side. For example, the carcass maximum width position can be provided at the position in the range of 50% to 90% of the tire cross-sectional height from the bead baseline toward the outer side in the tire radial direction. The above-mentioned “radially arranged” means at least 85° with respect to the tire circumferential direction, preferably 90° with respect to the tire circumferential direction.", "", "The tire of this embodiment preferably has one or more inclined belt layers consisting of a rubberized layer of cords extending at an angle with respect to the tire circumferential direction. It is most preferable to have two layers for the combination of weight reduction and suppression of distortion of the shape of the contact patch. From the viewpoint of weight reduction, one belt layer can be used, and from the viewpoint of suppressing distortion of the shape of the contact patch, three or more layers can be used. In the example illustrated inFIG.2, of the two belt layers4aand4b, the tire widthwise width of the belt layer4bwhich locates on the outer side in the tire radial direction is smaller than that of the belt layer4awhich is locates on the inner side in the tire radial direction. On the other hand, the tire widthwise width of the belt layer4bwhich locates on the outer side in the tire radial direction can be larger than or the same as that of the belt layer4awhich locates on the inner side in the tire radial direction. The tire widthwise width of the belt layer with the largest tire widthwise width (belt layer4ain the illustrated example) is preferably 90 to 115% of the ground contact width, and especially preferred when it is 100 to 105% of the ground contact width. Note, that the “ground contact width” refers to the distance in the tire width direction between the above-mentioned ground contact edges E.", "", "In this embodiment, metal cords, especially steel cords, are most preferred as belt cords for the belt layers4aand4b, however, non-metal, e.g., organic fiber cords (e.g., can be Kevlar® (Kevlar is a registered trademark in Japan, other countries, or both) for environmental and cost reasons) can also be used. The steel cords are primarily composed of steel and can contain various trace inclusions such as carbon, manganese, silicon, phosphorus, sulfur, copper, and chromium. In this embodiment, the belt cords of the belt layers4aand4bcan be monofilament cords, cords with multiple filaments drawn together, or cords with multiple filaments twisted together. Various twist structures can be adopted, and the cross-sectional structure, twisting pitch, twisting direction, and distance between adjacent filaments can also be varied. Furthermore, cords made of twisted filaments of different materials can also be used, and the cross-sectional structure is not limited, and various twist structures such as single twist, layer twist, and multiple twist can be used.", "", "In this embodiment, the inclination angle of the belt cords of the belt layers4aand4bis preferably 10° or more with respect to the tire circumferential direction. In this embodiment, the inclination angle of the belt cords of the belt layers4aand4bshould be at a high angle, it is specifically 20° or more with respect to the tire circumferential direction, preferably 35° or more, and especially in a range of 55° to 85° with respect to the tire circumferential direction. This is because an inclination angle of 20° or more (preferably 35° or more) increases the rigidity of the tire in the tire width direction and improves the handling stability performance, especially during cornering. In addition, this is because shear deformation of the interlayer rubber can be reduced to reduce rolling resistance.", "", "In the illustrated example, the tread rubber constituting the tread5consists of single layer. On the other hand, in this embodiment, the tread rubber constituting the tread5may be formed by a plurality of different rubber layers laminated in the tire radial direction. For the above plurality of rubber layers, rubbers with different tangent loss, modulus, hardness, glass transition temperature, material, etc. can be used. The ratio of the thicknesses in the tire radial direction of the plurality of rubber layers may vary in the tire width direction, and only the bottom of the circumferential main groove, etc. may have a different rubber layer than the surrounding area. In addition, the tread rubber constituting the tread5may be formed by a plurality of rubber layers that differ in the tire width direction. For the above plurality of rubber layers, rubbers with different tangent loss, modulus, hardness, glass transition temperature, material, etc. can be used. The ratio of the tire widthwise width of the plurality of rubber layers may vary in the tire radial direction, and only some limited areas, such as only near the circumferential main groove, only near the ground contact edge, only in the shoulder land portion, and only in the center land portion, can have a different rubber layer than the surrounding area.", "", "In the illustrated example, this tire1has three circumferential main grooves6extending in the tire circumferential direction. Specifically, the tire1has one circumferential main groove6on the tire equatorial plane CL and one circumferential main groove6on each shoulder area on both sides of the tire equatorial plane CL in the tire width direction. The width (opening width) of the circumferential main grooves6is not limited, but can be 2 mm to 5 mm, for example. In the present disclosure, the number and arrangement of the circumferential main grooves6are not particularly limited to the above examples. In addition, width direction grooves extending in the tire width direction, and sipes that is closed when touching the ground can also be provided as needed.", "", "The tire1of this embodiment has an inner liner8on the inner surface7of the tire (also referred to simply as the tire inner surface7). The thickness of the inner liner8is preferably about 1.5 mm to 2.8 mm. This is because it can effectively reduce vehicle interior noise in the 80 to 100 Hz range. The air permeability coefficient of the rubber composition constituting the inner liner8is preferably 1.0×10−14cc-cm/(cm2-s-cmHg) or higher and 6.5×10−10cc-cm/(cm2-s-cmHg) or lower.", "", "Here, as illustrated inFIG.2, the tire comprises a communication device9. The communication device9need only be capable of wireless communication with a predetermined device outside the tire1, and the configuration of the communication device9is not limited. In this embodiment, the communication device9is an RF tag. The RF tag is also referred to as an RFID (Radio Frequency Identification) tag. The communication device9may be configured to include, for example, an IC chip that constitutes a control section and a storage section, and one or more antennas connected to the IC chip. For example, the communication device9may have an overall longitudinal shape with two antennas extending in a straight, wavy, or spiral shape extending in opposite directions from the IC chip. The IC chip may also be operated by induced electromotive forces generated by electromagnetic waves received by one or more antennas. In other words, the communication device9may be a passive communication device. Alternatively, the communication device9may further comprise a battery and be able to communicate by generating electromagnetic waves with its own power. In other words, the communication device9may be an active communication device. Note, that the communication device9may be covered by coating rubber. The communication device9can be a sensor (e.g., a sensor capable of detecting tire temperature), etc., in addition to an RF tag.", "", "Here, as illustrated inFIG.2, in a cross-sectional view in the tire width direction in the above-mentioned reference condition, the communication device9is provided in a tire portion sandwiched between a hypothetical line extending in the tire radial direction through a ground contact edge E (the dashed line extending in the up-down direction in the figure) and a hypothetical line extending in the tire width direction through the tire maximum width position P (the double-dashed line extending in the left-right direction in the figure). In this embodiment, the communication device9is provided inside (built into) the tire, but it can also be bonded (for example, using an adhesive and others) to the inner surface of the tire (if the tire has an inner liner, to its inner surface).", "", "The following is an explanation of the effects of the pneumatic radial tire for passenger vehicles of this embodiment.", "", "First, in the pneumatic radial tire for passenger vehicles of this embodiment, the cross-sectional width SW is less than 165 (mm) and the ratio SW/OD of the cross-sectional width SW to the outer diameter OD of the tire is 0.26 or less (or, the relational expression, OD (mm)≥−0.0187×SW (mm)2+9.15×SW (mm)−380 (mm), is satisfied). This improves the fuel efficiency of the tire, as described above. By the way, in tires with a narrow width and a large diameter, in which SW and OD are in the above relationship, the ring rigidity of the tire is high, and the deformation in the area sandwiched between the hypothetical line extending in the tire radial direction through the ground contact edge E and the hypothetical line extending in the tire width direction through the tire maximum width position P is smaller than that in tires with a wide width and a high aspect ratio. Therefore, even if a communication device9is provided in this area, it is less likely to be subjected to large deformation, and the durability of the communication device9can be improved. Furthermore, since the communication device9is located in the above area, communication from the side of the tire becomes particularly good.", "", "Thus, the pneumatic radial tire for passenger vehicles in this embodiment allow both durability and communication performance of the communication device.", "", "Here, it is preferable that the communication device9is provided on the outer side in the tire width direction from an edge of a maximum width belt layer (the belt layer4ain the illustrated example), which has the largest width in the tire width direction of the one or more belt layers, and on the outer side in the tire radial direction from an innermost belt layer in the tire radial direction (the belt layer4ain the illustrated example) of the one or more belt layers. Although this location (the so-called buttress portion) is desirable as a location for the placement of the communication device9from the standpoint of communication performance and ease of maintenance during retreading, it is usually a location where tire deformation is large and there are issues on durability. In this example, since the above sectional width SW and the above outer diameter OD satisfy the above relationship, the ring rigidity of the tire is high and the durability of the communication device9can be improved even if the communication device9is provided at the above location (so-called buttress portion). In particular, it is excellent in both communication from the side of the tire and from the road surface.", "", "FIG.3is an enlarged view of the tire maximum width position. It is also preferable to provide a recess10in the vicinity of the tire maximum width position P (e.g., 0 to 5 mm from the tire maximum width position to the outer side in the tire radial direction along the periphery of the tire outer surface), and the communication device9should be embedded in the recess10. This configuration allows for better communication performance than when the device is embedded inside the tire (without providing a recess). The recess10can also be provided, for example, on the outer side in the tire width direction from an edge of a maximum width belt layer (the belt layer4ain the illustrated example), which has the largest width in the tire width direction of the one or more belt layers, and on the outer side in the tire radial direction from an innermost belt layer in the tire radial direction (the belt layer4ain the illustrated example) of the one or more belt layers."], "claims": ["a cross-sectional width SW of the tire is less than 165 (mm), and a ratio SW/OD of the cross-sectional width SW to an outer diameter OD of the tire is 0.26 or less, and in a cross-sectional view in a tire width direction in a reference condition, with the tire mounted on a rim, filled to prescribed internal pressure, and unloaded, the communication device is provided in a tire portion sandwiched between a hypothetical line extending in a tire radial direction through a ground contact edge and a hypothetical line extending in the tire width direction through a tire maximum width position.", "a cross-sectional width SW of the tire is less than 165 (mm), the cross-sectional width SW (mm) and an outer diameter OD (mm) of the tire satisfy a relational expression: in a cross-sectional view in a tire width direction in a reference condition, with the tire mounted on a rim, filled to prescribed internal pressure, and unloaded, the communication device is provided in a tire portion sandwiched between a hypothetical line extending in a tire radial direction through a ground contact edge and a hypothetical line extending in the tire width direction through a tire maximum width position.", "the communication device is provided on the outer side in the tire width direction from an edge of a maximum width belt layer, which has the largest width in the tire width direction of the one or more belt layers, and on the outer side in the tire radial direction from an innermost belt layer in the tire radial direction of the one or more belt layers.", "the communication device is embedded in the recess.", "5 . The pneumatic radial tire for passenger vehicles according to claim 1 , wherein the communication device is an RF tag.", "the communication device is provided on the outer side in the tire width direction from an edge of a maximum width belt layer, which has the largest width in the tire width direction of the one or more belt layers, and on the outer side in the tire radial direction from an innermost belt layer in the tire radial direction of the one or more belt layers.", "the communication device is embedded in the recess.", "8 . The pneumatic radial tire for passenger vehicles according to claim 2 , wherein the communication device is an RF tag.", "9 . The pneumatic radial tire for passenger vehicles according to claim 3 , wherein the communication device is an RF tag.", "10 . The pneumatic radial tire for passenger vehicles according to claim 4 , wherein the communication device is an RF tag.", "11 . The pneumatic radial tire for passenger vehicles according to claim 6 , wherein the communication device is an RF tag.", "12 . The pneumatic radial tire for passenger vehicles according to claim 7 , wherein the communication device is an RF tag."], "bibtex": "@patent{20240416685,\n    title = {PNEUMATIC RADIAL TIRE FOR PASSENGER VEHICLES},\n    number = {20240416685},\n    year = {2024},\n    note = {File: US20240416685A1-20241219.XML}\n    }", "classification": "B60C1900FI"}, {"title": "SOLID TIRE AND METHOD FOR MANUFACTURING SAME", "doc_number": "20240416686", "filename": "US20240416686A1-20241219.XML", "abstract": "In a solid tire including a tread rubber layer on a road contact surface side and a base rubber layer on a rim side, the base rubber layer has JIS-A hardness of 80 or higher, and an RFID tag is embedded in the base rubber layer. When forming an unvulcanized tire by winding a rubber sheet into multiple layers, the RFID tag is inserted between layers of the rubber sheet in the middle of the winding into multiple layers, or the RFID tag and a coating layer are overlaid and attached on a side surface of the unvulcanized tire, and then the unvulcanized tire including the RFID tag is vulcanized in a mold.", "detailed_description": ["Configurations of embodiments of the present technology will be described in detail below with reference to the accompanying drawings.FIG.1illustrates a solid tire (a pneumatic cushion tire for an industrial vehicle) according to an embodiment of the present technology.", "", "As illustrated inFIG.1, a solid tire10of the present embodiment has a toroidal shape and includes a tread rubber layer1positioned on a road contact surface side (outer side in the tire radial direction) and a base rubber layer2positioned on a rim side (inner side in the tire radial direction).", "", "The tread rubber layer1is formed of a rubber composition mainly composed of a diene rubber such as natural rubber, styrene-butadiene rubber, or butadiene rubber. Carbon black or silica can be added as a reinforcing agent to the rubber composition constituting the tread rubber layer1, and in the case of silica, an organic silane coupling agent or the like can be added together. Examples of the organic silane coupling agent may include bis(triethoxy-silylpropyl)tetrasulfide (TESPT). Further, the rubber composition constituting the tread rubber layer1may contain other blending agents that are generally used.", "", "The JIS-A hardness of the tread rubber layer1is not particularly limited but preferably ranges from 50 to 75, for example. If the JIS-A hardness of the tread rubber layer1is less than 50, an amount of distortion in the tire radial direction becomes too large and the horizontal rigidity becomes too small due to a reduction in rigidity. On the other hand, if the JIS-A hardness of the tread rubber layer1exceeds 75, the amount of distortion in the tire radial direction is reduced due to an increase in rigidity, and the vibration-absorbing property is lowered, thereby deteriorating the ride comfort.", "", "The base rubber layer2is formed of a rubber composition mainly composed of a diene rubber such as natural rubber, styrene-butadiene rubber, or butadiene rubber. Carbon black and further a phenol resin can be added as a reinforcing agent to the rubber composition constituting the base rubber layer2, and hexamethylenetetramine or the like can be added together as a curing agent for the phenol resin. Further, the rubber composition constituting the base rubber layer2may contain other blending agents that are generally used.", "", "JIS-A hardness of the base rubber layer2is 80 or higher. If the JIS-A hardness of the base rubber layer2is less than 80, the amount of distortion in the tire radial direction becomes too large and the horizontal rigidity becomes too small due to a reduction in rigidity. When the rigidity of the base rubber layer2is insufficient, rim slippage due to contact between the base rubber layer2and the rim flange is likely to occur during driving.", "", "Two or more bead cores3continuing annularly along a tire circumferential direction are disposed inside the base rubber layer2. The bead cores3are disposed symmetrically with respect to a tire equatorial plane. As the bead core3, a bead core formed by winding a plurality of bead wires multiple times (so-called strand bead wire), a bead core formed by winding a single bead wire multiple times, a bead core formed of a single steel ring, or the like can be used. In order to ensure adhesion to the base rubber layer2, when a bead wire is used, the surface thereof is generally subjected to zinc plating or brass plating of tin and copper, and when a steel ring is used, the surface thereof is generally coated with various vulcanizing adhesives. In addition, instead of providing the bead core3, short fibers may be blended into the rubber composition constituting the base rubber layer2. If necessary, short fibers may be blended into the rubber composition constituting the base rubber layer2simultaneously with the provision of the bead cores3. As such short fibers, short fibers made of organic fibers such as nylon, polyester, rayon, aramid and vinylon can be used.", "", "In the above-described solid tire10, an RFID tag11is embedded in the base rubber layer2. InFIG.1, the RFID tags11are embedded in a plurality of locations of the base rubber layer2, but the RFID tag11may be embedded in at least one location of the base rubber layer2. A structure of the RFID tag11is not particularly limited, but a passive type is mainly used. The RFID tag11includes an IC substrate in which data is stored and an antenna for transmitting and receiving data in a contactless manner, and has, for example, a rectangular shape or a rectangular sheet shape in which a length of one side is 7 mm to 50 mm. An appropriate RFID tag11is selected in accordance with a tire size and required sensitivity. In addition, since the RFID tag11is exposed to high temperatures during vulcanization, a heat-resistant type is preferable.", "", "As described above, in the solid tire10including the tread rubber layer1on the road contact surface side and the base rubber layer2on the rim side, the RFID tag11for product identification is embedded in the base rubber layer2, so quality control and history management for each product can be performed using the RFID tag11. That is, it is possible to perform quality control by associating an identification number stored in the RFID tag11with a manufacturing condition, and to ensure traceability after shipment by using the identification number stored in the RFID tag11. In addition, since the JIS-A hardness of the base rubber layer2in which the RFID tag11is embedded is 80 or higher, the protection effect of the RFID tag11can be sufficiently ensured, and quality control and history management for each product can be performed over a long period of time.", "", "In the solid tire10, the RFID tag11is preferably disposed near the side surface S of the base rubber layer2. More specifically, as illustrated inFIG.2, a distance T between the RFID tag11(particularly, an antenna portion) and the side surface S of the base rubber layer2preferably ranges from 0.5 mm to 10.0 mm. As a result, the data of the RFID tag11can be normally read while the protection effect of the RFID tag11is sufficiently ensured, and good response accuracy can be exhibited. Here, if the distance T between the RFID tag11and the side surface S of the base rubber layer2is less than 0.5 mm, the RFID tag11may be exposed when the side surface S of the base rubber layer2is damaged or worn during driving of the tire. On the other hand, if the distance T exceeds 10.0 mm, the reading accuracy of the RFID tag11tends to decrease. In particular, the distance T between the RFID tag11and the side surface S of the base rubber layer2preferably ranges from 0.5 mm to 6.0 mm.", "", "FIG.3illustrates a rim slippage region in a solid tire. When the RFID tag11is disposed near the side surface S of the base rubber layer2, the RFID tag11is preferably disposed at a position deviating from a rim slippage region X. That is, as illustrated inFIG.3, the solid tire10is mounted to a rim R at the time of use, but under severe use conditions such as sudden acceleration, sudden braking, and sharp turning, wear or damage due to rim slippage is likely to occur near an apex of a rim flange F. Therefore, by disposing the RFID tag11at a position deviating from the rim slippage region X defined within a range of −15% to +15% of a rim flange height H with the apex of the rim flange F as a center, the protection effect of the RFID tag11can be sufficiently ensured even when the rim slippage occurs in the solid tire10. For example, inFIG.3, an RFID tag11A disposed further on an inner side than the rim slippage region X in the radial direction and an RFID tag11C disposed further on an outer side than the rim slippage region X in the radial direction are less likely to be damaged than an RFID tag11B disposed in the rim slippage region X.", "", "In the solid tire10, the RFID tag11is preferably embedded substantially parallel to the side surface S of the base rubber layer2. As a result, the response accuracy of the RFID tag11can be improved. Note that the state in which the RFID tag11is substantially parallel to the side surface S of the base rubber layer2is a state in which an angle between the sheet-shaped RFID tag11and the side surface S of the base rubber layer2is within ±20°. If the angle deviates from the range of ±20°, the reception sensitivity tends to decrease.", "", "In the solid tire10, the RFID tag11is preferably disposed near one of both side surfaces of the base rubber layer2, which is on the outer side of the vehicle when mounted on the vehicle. In this case, since the RFID tag11is disposed on the outer side of the vehicle in a state in which the solid tire10is mounted on the vehicle, convenience of a communication work with the RFID tag11is enhanced. In the solid tire10on which a mounting direction with respect to the vehicle is designated (displayed), the RFID tag11is disposed near the side surface of the base rubber layer2that is on the outer side of the vehicle in the designated mounting state.", "", "FIG.4illustrates a solid tire according to another embodiment of the present technology. Note that inFIG.4, the same components as those in the embodiment illustrated inFIG.1are denoted by the same reference signs, and detailed descriptions thereof are omitted. InFIG.4, the RFID tag11is embedded in the base rubber layer2, and the RFID tag11is disposed near the side surface S of the base rubber layer2, but its orientation is different from that of the embodiment ofFIG.1. That is, the sheet-shaped RFID tag11is embedded so as to be oriented along a tire axial direction, and is in a relationship of intersecting the side surface S of the base rubber layer2. Such an orientation is also possible.", "", "FIG.5illustrates a solid tire according to still another embodiment of the present technology. Note that inFIG.5, the same components as those in the embodiment illustrated inFIG.1are denoted by the same reference signs, and detailed descriptions thereof are omitted. InFIG.5, an intermediate rubber layer4having a high cushioning property is inserted between the tread rubber layer1and the base rubber layer2. By adding such an intermediate rubber layer4, heat build-up of the tread rubber layer1can be suppressed, and wear resistance of the tread rubber layer1can be improved. As a rubber composition constituting the intermediate rubber layer4, it is preferable to use a rubber composition that is softer than the tread rubber layer1and the base rubber layer2and has a low loss tangent tan δ. In addition, the intermediate rubber layer4may be composed of not only one layer but also two or more layers. In the solid tire10including the tread rubber layer1on the road contact surface side, the base rubber layer2on the rim side, and the intermediate rubber layer4located between the tread rubber layer1and the base rubber layer2, the RFID tag11is embedded in the base rubber layer2whose JIS-A hardness is 80 or higher.", "", "In the above-described solid tire10, as illustrated inFIG.6, short fibers5are preferably blended in the rubber composition constituting the base rubber layer2. As a result, deformation of the base rubber layer2can be suppressed, and the protection effect of the RFID tag11can be enhanced. In addition, by blending the short fibers5in the rubber composition constituting the base rubber layer2, the rim slippage is suppressed, and from this standpoint as well, the protection effect of the RFID tag11can be enhanced. Note that when the rubber including the short fibers5blended therein is sheeted out, the short fibers5tend to be oriented in a sheet-out direction. For this reason, in the base rubber layer2, the short fibers5are preferably oriented in the tire circumferential direction. By orienting the short fibers5of the base rubber layer2in the tire circumferential direction in this way, a hoop effect on the rim is effectively exhibited, and the effect of increasing the vertical rigidity and horizontal rigidity of the tire can be enhanced in addition to the effect of preventing the rim slip.", "", "The short fibers5, which are not limited to a particular fiber, can contain, for example, 1 phr to 10 phr of vinylon fibers having a fiber length of 2 mm to 10 mm and a fiber diameter of 5 μm to 50 μm. Such a vinylon fiber is suitable as a reinforcing material for the base rubber layer2. Here, if the blending amount of the vinylon fibers is less than 1 phr, the modulus in the low-elongation region becomes small, the rigidity of the base rubber layer2decreases, and the base rubber layer2is easily bent, so that the protection effect of the RFID tag11decreases. On the other hand, if the blending amount of the vinylon fibers exceeds 10 phr, the modulus in the low-elongation region becomes too large, and mountability on rims is deteriorated. In addition, if the fiber length is less than 2 mm, the modulus in the low-elongation region becomes small, and thus the protection effect of the RFID tag11is reduced, whereas if the fiber length exceeds 10 mm, the modulus in the low-elongation region becomes excessively large, and thus mountability on rims is deteriorated. Further, if the fiber diameter is less than 5 μm, the dispersibility of the short fibers is reduced during rubber kneading, whereas if the fiber diameter exceeds 50 μm, the modulus in the low-elongation region is reduced due to a reduction in specific surface area of the vinylon fiber, and thus the protection effect of the RFID tag11is reduced. Furthermore, if the fiber diameter is too large, it becomes a foreign matter, which is not preferable.", "", "FIGS.7A to7Eeach illustrate a modified example of the RFID tag. InFIG.7A, the RFID tag11is coated with an adhesive layer12made of an adhesive. As a result, the adhesion between the RFID tag11and the rubber can be enhanced, and a tire failure caused by peeling between the RFID tag11and the rubber can be prevented. For example, a vulcanizing adhesive represented by Chemlok (trade name) 6150 manufactured by LORD CORPORATION can be used.", "", "InFIG.7B, the RFID tag11is coated with a resin layer13made of polyphenylene sulfide resin. The durability of the RFID tag11can be improved by coating the RFID tag11with the polyphenylene sulfide resin having heat resistance.", "", "InFIG.7C, the RFID tag11is coated with a resin layer13made of polyphenylene sulfide resin, and the resin layer13is further coated with an adhesive layer12made of an adhesive. In this case, the adhesion and heat resistance of the RFID tag11can be improved at the same time.", "", "InFIG.7D, the RFID tag11is coated with a ceramic layer14made of ceramic. The durability of the RFID tag11can be improved by coating the RFID tag11with ceramic having heat resistance and rigidity.", "", "InFIG.7E, the RFID tag11is coated with a ceramic layer14made of ceramic, and the ceramic layer14is further coated with an adhesive layer12made of an adhesive. In this case, the adhesion, heat resistance, and rigidity of the RFID tag11can be improved at the same time. Note that AP134 (primer), 6125 (cover) or the like of Chemlok (trade name) is preferably used as the adhesive on the ceramic layer side.", "", "FIGS.8A and8Beach illustrate a modified example of the RFID tag. InFIG.8A, the RFID tag11is coated with a plurality of reinforcing fiber cords15. The reinforcing fiber cord15is, for example, a cord fabric. By coating the RFID tag11with the reinforcing fiber cord15, the durability of the RFID tag11can be improved. In addition, since the RFID tag11is coated with the reinforcing fiber cord15, adhesion between the RFID tag11and the rubber can be enhanced. In particular, the RFID tag11is preferably coated with the reinforcing fiber cord15after applying a vulcanizing adhesive to the RFID tag11.", "", "InFIG.8B, the RFID tag11is coated with a reinforcing fabric16. By coating the RFID tag11with the reinforcing fabric16, the durability of the RFID tag11can be improved. In addition, since the RFID tag11is coated with the reinforcing fabric16, the adhesion between the RFID tag11and the rubber can be enhanced. In particular, the RFID tag11is preferably coated with the reinforcing fabric16after applying a vulcanizing adhesive to the RFID tag11.", "", "FIG.9illustrates a method (first method) for manufacturing a solid tire according to an embodiment of the present technology. InFIG.9. D denotes a cylindrical forming drum that is expandable and contractible. When manufacturing the above-described solid tire10, as illustrated inFIG.9, a rubber sheet20is wound into multiple layers around the forming drum D to form an unvulcanized tire10X. At this time, the RFID tag11is inserted between the layers of the rubber sheet20in the middle of the winding into multiple layers, whereby the RFID tag11can be embedded at a desired position of the solid tire10. InFIG.9, the RFID tag11is embedded in the base rubber layer2. The unvulcanized tire10X in which the RFID tag11is embedded as such is vulcanized in a mold having a cavity corresponding to the shape of the solid tire10.", "", "In the method for manufacturing the solid tire10described above, when winding the rubber sheet20into multiple layers, an outer diameter position of the forming drum D is used as a reference, a winding position of the rubber sheet20in the radial direction of the unvulcanized tire10X is calculated in accordance with a winding length and a thickness of the rubber sheet20, and the RFID tag11may be inserted in accordance with the winding position. That is, the RFID tag11may be inserted in the middle of the winding into multiple layers. Specifically, when a predetermined position is reached, the winding may be stopped once, the RFID tag11may be installed, and then the winding may be resumed. This operation may be performed multiple times when inserting a plurality of RFID tags11. In addition, for example, in a tire having a two-layered structure with a 5.00-8 size, the base rubber sheet has a width of 120 mm and a thickness of 8 mm, and the winding is stopped once at the time when the base rubber sheet is wound into four layers, the RFID tag11is installed, and the base rubber sheet is further wound into two layers. Thereafter, the unvulcanized tire10X with a total winding height of 110 mm of the tread rubber sheet is completed. When this is vulcanized in a predetermined mold to obtain a product, the RFID tag11is embedded at a position of about 200% of the rim flange height H. As a result, the RFID tag11can be embedded with high accuracy. In addition, when the winding position of the rubber sheet20in the radial direction of the unvulcanized tire10X is calculated in accordance with the winding length and the thickness of the rubber sheet20and the RFID tag11is inserted in accordance with the winding position, the insertion operation of the RFID tag11can also be automated.", "", "FIG.10illustrates a method (second method) for manufacturing a solid tire according to another embodiment of the present technology. InFIG.10, D denotes a cylindrical forming drum that is expandable and contractible. When manufacturing the above-described solid tire10, as illustrated inFIG.10, a rubber sheet20is wound into multiple layers around the forming drum D to form an unvulcanized tire10X, and then the RFID tag11is attached to a side surface of the unvulcanized tire10X. InFIG.10, the RFID tag11is attached to a portion corresponding to the base rubber layer2. A coating layer21made of unvulcanized rubber having a thickness of 0.5 mm to 10 mm is overlaid and attached on the RFID tag11, whereby the RFID tag11can be embedded at a desired position of the solid tire10. The unvulcanized tire10X in which the RFID tag11is embedded as such is vulcanized in a mold having a cavity corresponding to the shape of the solid tire10.", "", "In the present technology, the structure of the solid tire is not particularly limited as long as the solid tire includes the tread rubber layer on the road contact surface side and the base rubber layer on the rim side and the JIS-A hardness of the base rubber layer is 80 or higher. For example, it is also possible to adopt a structure in which an additional reinforcing member made of steel, organic fiber, or high-hardness rubber is embedded in the solid tire, or a structure in which an additional cushioning member made of low-hardness rubber is embedded in the solid tire.", "", "FIG.11illustrates a solid tire according to still another embodiment of the present technology. Note that inFIG.11, the same components as those in the embodiment illustrated inFIG.1are denoted by the same reference signs, and detailed descriptions thereof are omitted. InFIG.11, a solid tire10includes a tread rubber layer1positioned on a road contact surface side, a base rubber layer2positioned on a rim side, a pair of bead cores3disposed on an outer side in a width direction of the base rubber layer2, a side rubber layer6composed of rubber extending from each bead core3to an outer side in a tire radial direction, and a fiber-reinforced layer7embedded in the side rubber layer6so as to extend from each bead core3to an outer side in the tire radial direction. An assembly of the bead core3, the side rubber layer6and the fiber-reinforced layer7is generally called a side wall. Further, a cover rubber layer8is disposed on an outer side, in the tire width direction, of the sidewall composed of the bead core3, the side rubber layer6and the fiber-reinforced layer7. Note that the side rubber layer6may be omitted. In this case, the fiber-reinforced layers7facing each other are directly bonded to each other. The presence or absence of the side rubber layer6and the characteristics of the rubber are determined by a size, performance, and the like of the tire. In the solid tire10configured as such, the RFID tag11can be embedded in the base rubber layer2. Note that the bead core3can also be embedded in the base rubber layer2, and in this case, the effect of suppressing the rim slip can be enhanced.", "", "FIG.12illustrates the method for manufacturing a solid tire illustrated inFIG.11. InFIG.12, D denotes a cylindrical forming drum that is expandable and contractible. When manufacturing the above-described solid tire10, as illustrated inFIG.12, a rubber sheet20is wound into multiple layers around the forming drum D. At this time, the RFID tag11is inserted between the layers of the rubber sheet20in the middle of the winding into multiple layers. Subsequently, the side walls each composed of the bead core3, the side rubber layer6, and the fiber-reinforced layer7are attached to a multilayer structure of the rubber sheet20from both sides in the tire width direction, and the cover rubber lavers8are further attached from the outside thereof to form an unvulcanized tire10X. As a result, the RFID tag11can be embedded at a desired position of the solid tire10. Note that the side rubber layer6may be omitted as described above."], "claims": ["1 - 16 . (canceled)", "a tread rubber layer on a road contact surface side; and a base rubber layer on a rim side; the base rubber layer having JIS-A hardness of 80 or higher, and an RFID tag being embedded in the base rubber layer.", "18 . The solid tire according to claim 17 , wherein the RFID tag is disposed near a side surface of the base rubber layer.", "19 . The solid tire according to claim 18 , wherein a distance between the RFID tag and the side surface of the base rubber layer ranges from 0.5 mm to 10.0 mm.", "20 . The solid tire according to claim 18 , wherein the RFID tag is disposed at a position deviating from a rim slippage region defined within a range of −15% to +15% of a rim flange height with an apex of a rim flange as a center.", "21 . The solid tire according to claim 17 , wherein the RFID tag is embedded substantially parallel to a side surface of the base rubber layer.", "22 . The solid tire according to claim 17 , wherein the RFID tag is disposed near a side surface of the base rubber layer that is on an outer side of a vehicle when mounted on the vehicle.", "23 . The solid tire according to claim 17 , wherein short fibers are blended in a rubber composition constituting the base rubber layer.", "24 . The solid tire according to claim 23 , wherein the short fibers contain 1 phr to 10 phr of vinylon fibers having a fiber length of 2 mm to 10 mm and a fiber diameter of 5 μm to 50 μm.", "25 . The solid tire according to claim 17 , wherein the RFID tag is coated with an adhesive.", "26 . The solid tire according to claim 17 , wherein the RFID tag is coated with polyphenylene sulfide resin.", "27 . The solid tire according to claim 17 , wherein the RFID tag is coated with ceramic.", "28 . The solid tire according to claim 17 , wherein the RFID tag is coated with a plurality of reinforcing fiber cords.", "29 . The solid tire according to claim 17 , wherein the RFID tag is coated with a reinforcing fabric.", "when forming an unvulcanized tire by winding a rubber sheet into multiple layers, inserting an RFID tag between layers of the rubber sheet in a middle of the winding into multiple layers; and vulcanizing an unvulcanized tire comprising the RFID tag in a mold.", "when winding the rubber sheet into multiple layers, calculating a winding position of the rubber sheet in a radial direction of the unvulcanized tire in accordance with a winding length and a thickness of the rubber sheet; and inserting an RFID tag in accordance with the winding position.", "forming an unvulcanized tire by winding a rubber sheet into multiple layers; then attaching an RFID tag to a side surface of the unvulcanized tire; further overlaying and attaching a coating layer made of unvulcanized rubber having a thickness of 0.5 mm to 10 mm on the RFID tag; and then vulcanizing the unvulcanized tire comprising the RFID tag in a mold."], "bibtex": "@patent{20240416686,\n    title = {SOLID TIRE AND METHOD FOR MANUFACTURING SAME},\n    number = {20240416686},\n    year = {2024},\n    note = {File: US20240416686A1-20241219.XML}\n    }", "classification": "B60C1900FI"}]