[{"title": "MULTI-PIECE WHEEL FRAME", "doc_number": "20240100880", "filename": "US20240100880A1-20240328.XML", "abstract": "A multi-piece wheel frame includes a rim and a disc. The rim includes a barrel, and an outer rim portion protruding outwardly from the barrel. The outer rim portion forms an inclined surface, and a ring edge surface connected to an outer edge of the inclined surface and cooperating with the inclined surface to form an obtuse angle. The disc is fixed to the rim, and includes a disc core, a plurality of spoke portions extending radially outwardly from the disc core, and a reinforced ring portion connected to the spoke portions and fixed to the outer rim portion. The reinforced ring portion abuts against at least one of the inclined surface and the ring edge surface.", "detailed_description": ["Referring toFIGS.2and3, an embodiment of the multi-piece wheel frame of this disclosure includes a rim2, and a disc3fixed to the rim2through locking or other manner. The rim2is made of carbon fiber, and includes a generally straight cylindrical barrel21, an inner flange portion22connected to a periphery of the barrel21and protruding radially inwardly, and an outer rim portion23protruding outwardly from an intersection of the barrel21and the inner flange portion22. The inner flange portion22forms a planar surface221with a normal vector parallel to the central axis of the barrel21. The planar surface221faces the outside (i.e., when mounted on one side of the vehicle, faces away from the vehicle) of the multi-piece wheel frame. The outer rim portion23forms an inclined surface231connected to an outer edge of the planar surface221and cooperating with the planar surface221to form an obtuse angle, and a ring edge surface232connected to an outer edge of the inclined surface231and cooperating with the inclined surface231to form an obtuse angle. A normal vector of the ring edge surface232is substantially perpendicular to the normal vector of the planar surface221.", "", "The disc3includes a disc core31, a plurality of spoke portions32extending radially outwardly from the disc core31and annularly spaced apart from each other, and a reinforced ring portion33connected to the spoke portions32and fixed to the outer rim portion23. The disc3may be integrally formed by aluminum alloy or other metallic material through forging or casting, or assembled by multiple pieces. Alternatively, the disc core31and the spoke portions32may be integrally formed by aluminum alloy or assembled by multiple pieces, while the reinforced ring portion33is made of different materials (e.g., other metallic materials or composite materials) and is connected to the spoke portions32through soldering, adhering, inserting, encapsulating, or other means. The reinforced ring portion33has an oblique annular surface331clinging to the inclined surface231, and an annular peripheral surface332connected to an outer edge of the oblique annular surface331and clinging the ring edge surface232.", "", "When performing an impact test under Road Traffic No. 287, Section 30 StVZO Standard, the embodiment according to the disclosure can pass the test, while the conventional wheel frame structure cannot pass. In addition, Table below is the result of a radial impact test of the embodiment under TÜV (Technical Inspection Association) specification standard. Primarily, the teste simulates a rim impact when a vehicle is driving through a pit hole or an obstacle, so it is necessary for the rim to be installed on the impact testing apparatus after being mounted with a tire, so that a radial impact test in the direction of the valve hole can be performed. The rim load weight set in this embodiment is 650 kg. As can be seen from the results of the Table, in 60 seconds after impact, the internal pressure of the present disclosure does not drop to 0, which met the test criteria and passed the test.", "", "Pressuredrop in60secondsdropdropdropafterEnergyweightheightvelocityimpactdeformationforce(J)(Kg)(mm)(m/s)(bar)(mm)(kN)279521013575.22.52.866.8", "", "Referring toFIGS.4to7, the reinforced ring portion33may also have only the oblique annular surface331clinging the inclined surface231as shown inFIGS.4and5, or only the annular peripheral surface332clinging the ring edge surface232as shown inFIGS.6and7, thereby increasing the elasticity and universality of design.", "", "In summary, through the design of the reinforced ring portion33abutting against at least one of the inclined surface231and the ring edge surface232, the impacted portion is converted to a carbon fiber-aluminum composite structure, resulting in enhancing the ability to withstand impact and increasing the overall strength and durability, thereby certainly achieving the object of the present disclosure.", "", "In the present description, the terms “attached”, “connected”, “fixed”, etc. should be understood in a broad sense, and may be fixed connection, detachable connection, or be integral; may be mechanical connections or electrical connections; may be directly connected, or may also be indirectly connected through a middle medium, may be the internal connection between two elements or interaction relationship of the two elements. A person skilled in the art may appreciate the specific meaning of the foregoing terms in this disclosure. Furthermore, the specific features, structures, etc. described in the embodiments are included in at least one embodiment, such as those skilled in the art may combine features of different implementations without conflicting with each other. The scope of protection of the present disclosure is not limited to the above-described specific example approaches, following the basic technical idea according to the present disclosure, those ordinarily skilled in the art need not engage in creative labor and can reason out an implementation, all the aforementioned belong to the scope of protection of the present disclosure.", "", "However, the above is merely an embodiment of the present disclosure, and certainly the scope of practicing the present disclosure is not limited thereto. Any equivalent variation and modification made according to the claims of the present disclosure and the specification of the present disclosure should still be within the scope covered by the present disclosure."], "claims": ["a rim including a barrel, an inner flange portion connected to a periphery of said barrel and protruding radially inwardly, and an outer rim portion protruding outwardly from an intersection of said barrel and said inner flange portion, said inner flange portion forming a planar surface that has a normal vector parallel to a central axis of said barrel, said outer rim portion forming an inclined surface that is connected to an outer periphery of said planar surface and that cooperates with said planar surface to form an obtuse angle, and a ring edge surface that is connected to an outer edge of said inclined surface and that cooperates with said inclined surface to form an obtuse angle; and a disc fixed to said rim, and including a disc core, a plurality of spoke portions that extend radially outwardly from said disc core and that are annularly spaced apart from each other, and a reinforced ring portion that is connected to said spoke portions and that is fixed to said outer rim portion, said reinforced ring portion abutting against at least one of said inclined surface and said ring edge surface.", "2 . The multi-piece wheel frame as claimed in claim 1 , wherein said ring edge surface of said rim has a normal vector perpendicular to the normal vector of said planar surface.", "3 . The multi-piece wheel frame as claimed in claim 1 , wherein said reinforced ring portion of said disc abuts against said inclined surface, and has an oblique annular surface clinging to said inclined surface.", "4 . The multi-piece wheel frame as claimed in claim 1 , wherein said reinforced ring portion of said disc abuts against said ring edge surface, and has an annular peripheral surface clinging to said ring edge surface.", "5 . The multi-piece wheel frame as claimed in claim 1 , wherein said reinforced ring portion of said disc abuts against said inclined surface and said ring edge surface, and has an oblique annular surface clinging to said inclined surface, and an annular peripheral surface connected to an outer edge of said oblique annular surface and clinging to said ring edge surface.", "6 . The multi-piece wheel frame as claimed in claim 1 , wherein said rim is made of a carbon fiber material, and said disc is made of a metal material.", "7 . The multi-piece wheel frame as claimed in claim 1 , wherein said disc core and said spoke portions of said disc are made of a metal material, said reinforced ring portion being made of a material different from that of said disc core and said spoke portions."], "bibtex": "@patent{20240100880,\n    title = {MULTI-PIECE WHEEL FRAME},\n    number = {20240100880},\n    year = {2024},\n    note = {File: US20240100880A1-20240328.XML}\n    }", "classification": "B60B2310FI"}, {"title": "AIRLESS TIRE", "doc_number": "20240100881", "filename": "US20240100881A1-20240328.XML", "abstract": "It is possible to maintain high-speed durability while having a function of eliminating static electricity of a vehicle. An airless tire 1 includes a tread portion 2 , an inner circumferential portion 3 which comes into contact with a wheel 5 having conductivity, and a spoke portion 4 which connects the tread portion 2 and the inner circumferential portion 3 . The tread portion 2 includes a first portion 2 A having conductivity, and a second portion 2 B in contact with the first portion 2 A. The second portion 2 B, the spoke portion 4 , and the inner circumferential portion 3 are formed from a resin or elastomer. The resin or elastomer contains an antistatic agent. The antistatic agent is a polymer-based antistatic agent or surfactant-based antistatic agent. The antistatic agent is blended in an amount of 0.5 to 20% by mass per 100% by mass of a base component of the resin or elastomer.", "detailed_description": ["Hereinafter, one embodiment of the present invention will be described with reference to the drawings.", "", "It should be understood that the drawings contain exaggerated expressions and expressions that differ from the dimensional ratio of the actual structure in order to help the understanding of the present invention. In addition, when there are a plurality of embodiments, the same or common elements are denoted by the same reference characters throughout the description, and the redundant description thereof is omitted.", "", "FIG.1is a side view of an airless tire (hereinafter, sometimes referred to simply as “tire”)1of the present embodiment.FIG.1is a perspective view of the tire1, andFIG.3is an enlarged cross-sectional view of a main part inFIG.1. As shown inFIG.1toFIG.3, the tire1includes an annular tread portion2which comes into contact with a road surface, an annular inner circumferential portion3which is placed inward of the tread portion2in the tire radial direction, and a spoke portion4which connects the tread portion2and the inner circumferential portion3. The inner circumferential portion3is in contact with a wheel5having conductivity.", "", "The tread portion2includes a first portion2A having a ground-contact surface2aand having conductivity, and a second portion2B placed on the inner circumferential portion3side so as to be in contact with the first portion2A. The ground-contact surface2ais a surface that comes into contact with a road surface (ground) during running of a vehicle.", "", "The second portion2B, the spoke portion4, and the inner circumferential portion3are formed from a resin or elastomer (hereinafter, sometimes referred to simply as “resin or the like”)8, and the resin or the like8contains an antistatic agent. The antistatic agent is a polymer-based antistatic agent or surfactant-based antistatic agent. The antistatic agent is blended in an amount of 0.5% by mass or more per 100% by mass of a base component of the resin or the like8. Such a tire1can release static electricity of the vehicle from an axle of the vehicle through the wheel5, the inner circumferential portion3, the spoke portion4, the second portion2B, and the first portion2A to a road surface. In order to enhance the function of eliminating static electricity, the antistatic agent is blended in an amount of preferably 2% by mass or more and more preferably 5% by mass or more per 100% by mass of the base component of the resin or the like8.", "", "The antistatic agent is blended in an amount of 20% by mass or less per 100% by mass of the base component of the resin or the like8. Accordingly, a decrease in the physical properties of the base component of the resin or the like8due to the blending of the antistatic agent is suppressed, and high-speed durability can be maintained high. In order to maintain high-speed durability to be high, the antistatic agent is preferably blended in an amount of 15% by mass or less and more preferably 8% by mass or less per 100% by mass of the base component of the resin or the like8. In the case where the antistatic agent is a polymer-based antistatic agent, bleed-out of the antistatic agent onto the surfaces of members is suppressed, and the antistatic effect is continued over a long period of time. In addition, the adhesiveness between each member is enhanced by suppressing bleed-out onto the surfaces of the members. Furthermore, with a white or colorless transparent polymer-based antistatic agent, the spoke portion4and the inner circumferential portion3can be made to have a desired color other than black by adding a pigment or the like.", "", "In the present embodiment, the first portion2A is an annular rubber member. The first portion2A is formed from a vulcanized rubber, for example. The ground-contact surface2ais formed on the outer circumferential surface in the tire radial direction of the first portion2A. Various drainage grooves (not shown) may be formed on the ground-contact surface2a.", "", "In a preferable mode, a reinforcing cord layer2c(shown inFIG.3) is placed inside the first portion2A. The reinforcing cord layer2cis composed of, for example, a layer in which a plurality of organic fiber cords or steel cords are orientated in a predetermined direction. Such a reinforcing cord layer2cserves to increase the stiffness in the tire circumferential direction and/or the tire axial direction of the first portion2A and improve steering stability. In addition, a resin material may be added or composited to a part of the first portion2A.", "", "The second portion2B is formed, for example, in an annular shape. In the present embodiment, the second portion2B is joined to an inner circumferential surface2bin the tire radial direction of the first portion2A.", "", "The wheel5is fixed to the axle (not shown) of the vehicle. The wheel5of the present embodiment is made of a metal. As the metal, an iron-based metal, a magnesium-based metal, and a titanium-based metal are preferable, and an aluminum-based metal is particularly preferable. The wheel5integrally includes, for example, a disc portion5aand a cylindrical portion5bformed outward of the disc portion5ain the tire radial direction. The disc portion5ais placed concentrically with the tread portion2. For example, a center bore5c, mounting holes5d, etc., are formed in the disc portion5a. Static electricity of the vehicle can flow to the axle of the vehicle.", "", "The spoke portion4includes, for example, a plurality of elements4aarranged in the tire circumferential direction. Each element4aextends in the tire radial direction, and connects the second portion2B and the inner circumferential portion3to each other. Each element4acan, for example, alleviate the impact inputted to the tread portion2, by bending during running. The shape, etc., of each element4aare not limited to those shown, and various modes, such as an element extending in a zigzag manner in the tire radial direction or circumferential direction and an element extending in a mesh-like pattern in a cross-section in the tire circumferential direction, are adopted.", "", "The inner circumferential portion3is, for example, joined to an outer circumferential surface (more specifically, the outer circumferential surface of the cylindrical portion5b)5eof the wheel5(shown inFIG.3). The inner circumferential portion3is adjacent to the cylindrical portion5bof the wheel5on the outer side in the tire radial direction.", "", "As the surfactant-based antistatic agent, for example, nonionic, anionic, and cationic surfactants, polyethylene glycol compounds, etc., are suitable. As the surfactant-based antistatic agent, specifically, trade name “CHEMISTAT (registered trademark)”, trade name “SANSTAT (registered trademark)”, trade name “PEG”, manufactured by Sanyo Chemical Industries, Ltd., etc., are suitable.", "", "The polymer-based antistatic agent preferably contains a thermoplastic resin-based antistatic agent. Even if such a polymer-based antistatic agent bleeds out onto the surface, the polymer-based antistatic agent becomes entangled with the resin or the like8, and thus is inhibited from being removed by wiping of the surface, etc. Therefore, the polymer-based antistatic agent containing a thermoplastic resin-based antistatic agent can continue its antistatic function for a long period of time. In addition, it is also inferred that, as with the resin or the like8, such a polymer-based antistatic agent can be recycled by disassembling and pelletizing. As the polymer-based antistatic agent, for example, polymers composed of polyethylene oxide (PEO) chains, polyether-based polymers, etc., are suitable. As the polymer-based antistatic agent, specifically, trade name “PELESTAT (registered trademark)” and trade name “PELECTRON (registered trademark)” manufactured by Sanyo Chemical Industries, Ltd., etc., are suitable.", "", "The resin or the like8for the spoke portion4, the second portion2B, and the inner circumferential portion3preferably has, for example, strength capable of sufficiently exerting load bearing capacity. Accordingly, the impact inputted to the tread portion2is alleviated. The resin or the like8of the present embodiment is composed of a thermoplastic resin or thermoplastic elastomer. As the thermoplastic resin and the thermoplastic elastomer, for example, polyamide or polyurethane-based resin and elastomer are preferably used, and polyester-based resin and elastomer are particularly preferable. The resin and the elastomer are composed of polymer compounds, and the elastomer is a generic term for elastic polymers.", "", "A complex elastic modulus E* at 30° C. of the resin or the like8is preferably not less than 30 MPa and further preferably not less than 50 MPa, and is preferably not greater than 350 MPa and further preferably not greater than 300 MPa. Since the complex elastic modulus E* is not less than 30 MPa, the stiffness of the tire1is ensured, and the high-speed durability of the tire1is maintained. Since the complex elastic modulus E* is not greater than 350 MPa, the impact inputted to the tread portion2can be alleviated. In the present specification, the complex elastic modulus E* is a value measured using a viscoelasticity spectrometer under the following conditions in accordance with JISK6394 “Rubber, vulcanized or thermoplastic—Determination of dynamic properties—General guidance”.Initial strain: 5%Amplitude: ±1Frequency: 10 HzDeformation mode: tensileViscoelasticity spectrometer: “EPLEXOR (registered trademark)” manufactured by NETZSCH-Geratebau GmbH", "", "The volume resistivity of the resin or the like8is preferably not greater than 1.0×1010Ω·cm and further preferably not greater than 1.0×106Ω·cm. Since the volume resistivity of the resin or the like8is not greater than 1.0×1010Ω·cm, a sufficient antistatic function is exhibited, the bleed-out of the antistatic agent is suppressed, and the change in physical properties is maintained small. The volume resistivity is measured under the condition of a temperature of 23° C. in accordance with the Guarded-electrode system specified in JIS K6271. The volume resistivity is represented by a volume resistivity measured using a sheet (thickness=2 mm) obtained from the resin or the like8for forming the spoke portion4.", "", "Next, a method for producing such a tire1will be described. In the method for producing the tire1of the present embodiment, the first portion2A, the second portion2B, the spoke portion4, the inner circumferential portion3, and the wheel5are each prepared by a known method. Then, these members are placed in an integral molding mold having a known structure (not shown), and are each adhered with an adhesive, thereby obtaining the tire1that is integrally molded. The adhesive and the method for using the adhesive are known adhesives and methods. As the adhesive, for example, trade name “CHEMLOCK” manufactured by Lord Corporation is suitably used. In the case of a polymer-based antistatic agent, bleed-out is suppressed, so that the adhesiveness of such an adhesive is maintained high.", "", "As the method for producing the tire1, the following embodiment may be employed. In the method for producing the tire1, the first portion2A, the spoke portion4, and the wheel5are each prepared by a known method. Then, an adhesive is applied to a surface of each member to be adhered, and these members are placed in an integral molding mold having a known structure (not shown). Next, the resin or the like8for forming the inner circumferential portion3and the second portion2B is injected from an injection molding machine having a known structure into the integral molding mold. Accordingly, the tire1that is integrally molded is obtained.", "", "In such a production method, the tensile shear strength between the tread portion2and the spoke portion4and the tensile shear strength between the spoke portion4and the inner circumferential portion3are each preferably not less than 1.0 MPa in an atmosphere of 20 to 25° C. By specifying such tensile shear strength, high-speed durability is maintained high. The tensile shear strength is measured using a tensile testing machine (trade name: AUTO COM universal testing machine AC-10 kN-C, manufactured by T.S.E. Co., Ltd.) in accordance with the tensile lap-shear strength of adhesives in JIS K6850: 1999. The measurement conditions are as followsDistance between chucks: 111.5 mmTest speed: 50 mm/min", "", "The tensile shear strength between the wheel5and the inner circumferential portion3is preferably not less than 1.0 MPa in an atmosphere of 20 to 25° C. Accordingly, the above-described effects are effectively exhibited.", "", "Although the particularly preferred embodiment of the present invention has been described in detail above, the present invention is not limited to the above-described embodiment, and various modifications can be made to practice the present invention."], "claims": ["an annular tread portion configured to contact a road surface; an annular inner circumferential portion inward of the tread portion in a tire radial direction and configured to contact a wheel having conductivity; and a spoke portion which connects the tread portion and the inner circumferential portion, wherein the tread portion includes a first portion having a ground-contact surface and having conductivity, and a second portion on the inner circumferential portion side in contact with the first portion, the second portion, the spoke portion, and the inner circumferential portion include a resin or elastomer, the resin or elastomer includes an antistatic agent, the antistatic agent is a polymer-based antistatic agent or surfactant-based antistatic agent, and the antistatic agent is blended in an amount of 0.5 to 20% by mass per 100% by mass of a base component of the resin or elastomer.", "the polymer-based antistatic agent includes a thermoplastic resin-based antistatic agent.", "the resin or elastomer is a thermoplastic resin or thermoplastic elastomer.", "the resin or elastomer has a complex elastic modulus E* at 30° C. of 30 to 350 MPa.", "the resin or elastomer has a volume resistivity of 1.0×10", "a tensile shear strength between the tread portion and the spoke portion and a tensile shear strength between the spoke portion and the inner circumferential portion are each not less than 1.0 MPa in an atmosphere of 20 to 25° C.", "a tensile shear strength between the wheel and the inner circumferential portion is not less than 1.0 MPa in an atmosphere of 20 to 25° C."], "bibtex": "@patent{20240100881,\n    title = {AIRLESS TIRE},\n    number = {20240100881},\n    year = {2024},\n    note = {File: US20240100881A1-20240328.XML}\n    }", "classification": "B60C714FI"}, {"title": "TIRE BAND WITH FILAMENTS HAVING A NON-CIRCULAR CROSS SECTION", "doc_number": "20240100882", "filename": "US20240100882A1-20240328.XML", "abstract": "A non-pneumatic tire includes a lower ring having a first diameter and an upper ring having a second diameter greater than the first diameter. The upper ring is substantially coaxial with the lower ring. Support structure connects the lower ring to the upper ring. A circumferential tread is attached to the upper ring. The circumferential tread includes a tread layer and a tread band. The tread band includes a filament assembly that includes a plurality of individual filaments having a non-circular cross section. The filaments are configured and arranged such that the filaments have a packing density of at least 92% within the filament assembly.", "detailed_description": ["The following includes definitions of selected terms employed herein. The definitions include various examples or forms of components that fall within the scope of a term and that may be used for implementation. The examples are not intended to be limiting. Both singular and plural forms of terms may be within the definitions.", "", "“Axial” and “axially” refer to a direction that is parallel to the axis of rotation of a tire.", "", "“Circumferential” and “circumferentially” refer to a direction extending along the perimeter of the surface of the tread perpendicular to the axial direction.", "", "“Radial” and “radially” refer to a direction perpendicular to the axis of rotation of a tire.", "", "“Tread” as used herein, refers to that portion of the tire that comes into contact with the road or ground under normal inflation and normal load.", "", "“Packing density” as used herein, refers to a ratio of the volume occupied by the filaments to the total volume of the filament assembly.", "", "While similar terms used in the following descriptions describe common tire components, it should be understood that because the terms carry slightly different connotations, one of ordinary skill in the art would not consider any one of the following terms to be purely interchangeable with another term used to describe a common tire component.", "", "Directions are stated herein with reference to the axis of rotation of the tire. The terms “upward” and “upwardly” refer to a general direction towards the tread of the tire, whereas “downward” and “downwardly” refer to the general direction towards the axis of rotation of the tire. Thus, when relative directional terms such as “upper” and “lower” or “top” and “bottom” are used in connection with an element, the “upper” or “top” element is spaced closer to the tread than the “lower” or “bottom” element. Additionally, when relative directional terms such as “above” or “below” are used in connection with an element, an element that is “above” another element is closer to the tread than the other element.", "", "The terms “inward” and “inwardly” refer to a general direction towards the equatorial plane of the tire, whereas “outward” and “outwardly” refer to a general direction away from the equatorial plane of the tire and towards the side of the tire. Thus, when relative directional terms such as “inner” and “outer” are used in connection with an element, the “inner” element is spaced closer to the equatorial plane of the tire than the “outer” element.", "", "FIGS.1-3illustrate one embodiment of a non-pneumatic tire10. The non-pneumatic tire10is merely an exemplary illustration and is not intended to be limiting. In the illustrated embodiment, the non-pneumatic tire10includes a generally annular lower ring20. The lower ring20may engage a vehicle hub (not shown) for attaching the tire10to a vehicle. The lower ring20has an internal surface23and an external surface24, and may be made of a polymeric material, an elastomeric material, metal, or any other desired material.", "", "The non-pneumatic tire10further includes a generally annular upper ring30that is disposed above the lower ring20. The upper ring30has a diameter that is greater than a diameter of the lower ring20, and is substantially coaxial with the lower ring20. The upper ring30has an internal surface33and an external surface34, and may be made out of a polymeric material, an elastomeric material, metal, or any other desired material. A circumferential tread70is attached to the external surface34of the upper ring30. The circumferential tread70may be attached to the upper ring30adhesively or by using other methods known in the art. As shown inFIG.2, the upper ring30may be configured to deform in an area48around and including a footprint region32, which may decrease vibration and increase ride comfort.", "", "Support structure40connects the lower ring20to the upper ring30. The support structure40extends from the external surface24of the lower ring20and the internal surface33of the upper ring30. In the illustrated embodiment, the support structure40is webbing. The illustrated webbing40has at least two radially adjacent layers56,58of web elements42that define a plurality of generally polygonal openings50. In alternative embodiments, the support structure may be spokes or any other desired arrangement. In alternative embodiments that employ webbing, other web configurations may be provided. For example, the webbing may include a fewer or greater number of radially adjacent layers. As another example, the web elements may form openings of any desired shape.", "", "As shown inFIG.3, the circumferential tread70includes a tread band72and a tread layer74. The tread layer74may be made out of rubber, and may include tread elements (not shown) such as grooves, ribs, blocks, lugs, sipes, studs, or any other desired elements. The tread band72may include a filament assembly.", "", "In the illustrated embodiment, the tread band72is shown as a single layer. In an alternative embodiment (not shown), the tread band may be a multi-layer band. Such multi-layer tread bands may include one or more layers of substantially inextensible material. Such layers may be formed of a metal, such as steel. The substantially inextensible layers may be formed of a sheet of material or by cords or filaments of material. A multi-layer tread band may optionally include a layer of extensible material, such as an elastomer. For example, the tread band may include a pair of inextensible layers separated by a layer of extensible material. Tread bands may include bands that are referred to as shear bands, shear elements, or thin annular high strength band elements.", "", "FIG.4shows a cross-section of part of an exemplary filament assembly200. According to one embodiment, the filament assembly200makes up the entire tread band72. In alternative embodiments, the tread band may include other elements besides the filament assembly.", "", "The filament assembly200includes a plurality of individual filaments202. Each of the individual filaments202themselves may be a single strand of material (i.e., monofilament) or may include multiple strands of material (i.e., multi-filament). The filaments202may be made out steel, fabric, or any other desired material. According to one embodiment, each filament may have a coating that is used to secure the individual filaments202together to form the filament assembly200. In one embodiment, the coating has a thickness that is in the range of 0-10 mm. In an alternative embodiment, the thickness of the coating is in the range of 0-0.25 mm. In another alternative embodiment, the thickness of the coating is in the range of 0.025-0.25 mm. In one embodiment, the coating is rubber. In alternative embodiments, the coating may be polymers other than rubber, epoxy, or adhesives. In another alternative embodiment, the filaments may be free from a coating. In other alternative embodiments, the individual filaments may be secured together using mechanical fasteners or any other desired arrangement.", "", "In the illustrated embodiment, each of the individual filaments202has a substantially hexagonal cross section. Corners204of each filament202are rounded to improve fatigue resistance of the filaments202. In alternative embodiments, the corners may be provided as a sharp corner. In the illustrated embodiment, a central longitudinal axis206of each filament is aligned in the radial direction (R) and offset in the circumferential direction (C) relative to adjacent filaments. In alternative embodiments, the filaments may have any desired alignment. For example, the central longitudinal axis of each filament may be offset in the radial direction and aligned in the circumferential direction relative to adjacent filaments.", "", "FIG.5shows a cross-section of part of another exemplary filament assembly300. The filament assembly300ofFIG.5is substantially similar to the filament assembly200ofFIG.4, except for the differences described herein.", "", "The filament assembly300includes a plurality of individual filaments302. Each of the individual filaments302has a substantially square cross section. Corners304of each filament302are rounded to improve fatigue resistance of the filaments302. In alternative embodiments, the corners may be provided as a sharp corner. In the illustrated embodiment, a central longitudinal axis306of each filament is aligned in the radial direction (R) and also aligned in the circumferential direction (C) relative to adjacent filaments. In alternative embodiments, the filaments may have any desired alignment. For example, the central longitudinal axis of each filament may be offset in the radial direction and aligned in the circumferential direction relative to adjacent filaments. As yet another example, the central longitudinal axis of each filament may be aligned in the radial direction and offset in the circumferential direction relative to adjacent filaments.", "", "In each of the above examples, a diameter of a circle circumscribing each of the filaments202,302is, in one embodiment, in the range of 0.1-25 mm. In an alternative embodiment, the diameter is in the range of 0.35-25 mm. In another alternative embodiment, the diameter is in the range of 0.35-5 mm.", "", "Due to the specific cross sectional shape of the individual filaments202,302of the filament assemblies200,300shown inFIGS.4and5, respectively, it is possible to achieve a 100% packing density of the filaments. This is in comparison to tires having a tread band that is formed by a plurality of filaments having a circular cross section, which are only able to achieve approximately a 91% packing density. The increased packing density of the filament assemblies200,300ofFIGS.4and5may minimize rolling resistance and heat generation, thereby improving performance and robustness of the non-pneumatic tire as compared to non-pneumatic tires that use filaments with a circular cross section to form the tread band.", "", "The above discussed 100% packing density of the filaments may be achievable in filament assemblies that use mechanical fasteners to secure the individual filaments together or use filaments that are free from a coating. In filament assemblies that use a coating on each filament to secure the individual filaments together, a 100% packing density may not be possible due to the presence of the coating. In one example embodiment, the packing density of the filaments is at least 92%. In an alternative embodiment, the packing density is at least 93%. In another alternative embodiment, the packing density is at least 94%. In yet another alternative embodiment, the packing density is at least 95%. In still another alternative embodiment, the packing density is at least 96%. In yet another alternative embodiment, the packing density is at least 97%. In still another alternative embodiment, the packing density is at least 98%. In yet another alternative embodiment, the packing density is at least 99%.", "", "The individual filaments may be formed using any desired process. One nonlimiting example of a process for forming the individual filaments may include passing steel cords having a substantially circular cross section through a die to impart a different geometry on the cord, such as a hexagonal or square cross section. In one embodiment, this process is performed without applying additional heat to the cord. In an alternative embodiment, a low amount of heat may be applied. Another nonlimiting example processes for forming the individual filaments may include swaging. Depending on the process used, it may be easier to form filaments with a hexagonal cross section as compared to filaments with a square cross section.", "", "FIG.6shows another example embodiment of a non-pneumatic tire110. The non-pneumatic tire100ofFIG.6is substantially similar to the non-pneumatic tire10ofFIGS.1-3, except for the differences described herein. Accordingly, like features will be identified by like numerals increased by a value of “100.”", "", "The non-pneumatic tire110includes a generally annular lower ring120and a generally annular upper ring130. A circumferential tread170is attached to the upper ring130. Support structure140connects the lower ring120to the upper ring130.", "", "The circumferential tread170includes a tread layer174, and inextensible layers172and extensible layers176between the upper ring130and the tread layer174. In the illustrated embodiment, the circumferential tread170includes three extensible layers176a,176b,176c, that alternate between four inextensible layers172a,172b,172c,172d. The first inextensible layer172ais attached to the upper ring130and the fourth inextensible layer172dis attached to the tread layer174. In alternative embodiments, any desired arrangement of extensible layers and inextensible layers may be provided. For example, the circumferential tread may include three inextensible layers that alternate between four extensible layers, with the first extensible layer being attached to the upper ring and the fourth extensible layer being attached to the tread layer. As another example, the circumferential tread may include a fewer or greater number of extensible layers or inextensible layers than what is shown inFIG.6.", "", "Each of the inextensible layers172of the non-pneumatic tire110ofFIG.6may include a filament assembly200formed by a plurality of individual filaments202having a hexagonal cross section as shown inFIG.4, or may include a include a filament assembly300formed by a plurality of individual filaments302having a square cross section as shown inFIG.5. Additionally, the non-pneumatic tire110ofFIG.6may include different inextensible layers that include filaments having different cross sections or different alignments. For example, the first and third inextensible layers may have filament assemblies formed by filaments having a hexagonal cross section, while the second and fourth inextensible layers may have filament assemblies formed by filaments having a square cross section. As another example, the first and third inextensible layers may have filament assemblies formed by filaments with central longitudinal axes that are aligned in the circumferential direction and offset in the radial direction relative to adjacent filaments, while the second and fourth inextensible layers may have filament assemblies formed by filaments with central longitudinal axes that are offset in the circumferential direction and aligned in the radial direction relative to adjacent filaments.", "", "To the extent that the term “includes” or “including” is used in the specification or the claims, it is intended to be inclusive in a manner similar to the term “comprising” as that term is interpreted when employed as a transitional word in a claim. Furthermore, to the extent that the term “or” is employed (e.g., A or B) it is intended to mean “A or B or both.” When the applicants intend to indicate “only A or B but not both” then the term “only A or B but not both” will be employed. Thus, use of the term “or” herein is the inclusive, and not the exclusive use. See, Bryan A. Garner, A Dictionary of Modern Legal Usage624(2d. Ed. 1995). Also, to the extent that the terms “in” or “into” are used in the specification or the claims, it is intended to additionally mean “on” or “onto.” Furthermore, to the extent the term “connect” is used in the specification or claims, it is intended to mean not only “directly connected to,” but also “indirectly connected to” such as connected through another component or components.", "", "While the present application has been illustrated by the description of embodiments thereof, and while the embodiments have been described in considerable detail, it is not the intention of the applicants to restrict or in any way limit the scope of the appended claims to such detail. Additional advantages and modifications will readily appear to those skilled in the art. Therefore, the application, in its broader aspects, is not limited to the specific details, the representative apparatus and method, and illustrative examples shown and described. Accordingly, departures may be made from such details without departing from the spirit or scope of the applicant's general inventive concept. For example, while the tread band has been described with respect to non-pneumatic tires, the tread band may also be employed in pneumatic tires, such as run-flat pneumatic tires. As another example, while the tread band has been described as including a filament assembly that has individual filaments with a hexagonal or square cross section, the cross sectional shape of the filaments may be any regular geometric shape with straight sides. Nonlimiting examples of shapes for the cross section of each filament include triangular, pentagonal, heptagonal, or octagonal."], "claims": ["a lower ring having a first diameter; an upper ring having a second diameter greater than the first diameter, the upper ring being substantially coaxial with the lower ring; support structure connecting the lower ring to the upper ring; and a circumferential tread attached to the upper ring, the circumferential tread including a tread layer and a tread band, the tread band including a filament assembly that includes a plurality of individual filaments having a non-circular cross section, the filaments being configured and arranged such that the filaments have a packing density of at least 92% within the filament assembly.", "2 . The non-pneumatic tire of claim 1 , wherein each of the plurality of filaments has a square cross section.", "3 . The non-pneumatic tire of claim 1 , wherein each of the plurality of filaments has a hexagonal cross section.", "4 . The non-pneumatic tire of claim 1 , wherein each of the plurality of filaments has a central longitudinal axis, the central longitudinal axes of the filaments being aligned relative to adjacent filaments in one of a circumferential direction and a radial direction of the non-pneumatic tire and offset relative to adjacent filaments in one other of the circumferential direction and the radial direction of the non-pneumatic tire.", "5 . The non-pneumatic tire of claim 1 , wherein each of the plurality of filaments has a central longitudinal axis, the central longitudinal axes of the filaments being aligned relative to adjacent filaments in both a circumferential direction and a radial direction of the non-pneumatic tire.", "6 . The non-pneumatic tire of claim 1 , wherein corners of the individual filaments are rounded.", "7 . The non-pneumatic tire of claim 1 , wherein the individual filaments are secured together using at least one of rubber, adhesive, epoxy, and mechanical fasteners.", "8 . The non-pneumatic tire of claim 1 , wherein each of the individual filaments is formed from a cord that initially has a substantially circular cross section and is processed to give the filament the non-circular cross section.", "providing a lower ring having a first diameter and an upper ring having a second diameter that is greater than the first diameter; connecting the lower ring to the upper ring with support structure; forming a plurality of individual filaments having a non-circular cross section; assembling the plurality of individual filaments into a tread band having a packing density of at least 92%; applying a tread layer to the tread band to form a circumferential tread; and attaching the circumferential tread to the upper ring.", "10 . The method of manufacturing a non-pneumatic tire of claim 9 , further comprising the step of forming the individual filaments by processing a cord that initially has a substantially circular cross section to impart a non-circular cross section on the filament.", "11 . The method of manufacturing a non-pneumatic tire of claim 10 , wherein the imparting of a non-circular cross section on the filament includes imparting a square cross section on the filament.", "12 . The method of manufacturing a non-pneumatic tire of claim 10 , wherein the imparting of a non-circular cross section on the filament includes imparting a hexagonal cross section on the filament.", "13 . The method of manufacturing a non-pneumatic tire of claim 9 , wherein each of the plurality of filaments has a central longitudinal axis, and wherein the method further comprises the step of aligning the central longitudinal axes of adjacent filaments in one of a circumferential direction and a radial direction of the non-pneumatic tire and offsetting the central longitudinal axes of adjacent filaments in one other of the circumferential direction and the radial direction of the non-pneumatic tire.", "14 . The method of manufacturing a non-pneumatic tire of claim 9 , wherein each of the plurality of filaments has a central longitudinal axis, and wherein the method further comprises the step of aligning the central longitudinal axes of adjacent filaments in both a circumferential direction and a radial direction of the non-pneumatic tire.", "15 . The method of manufacturing a non-pneumatic tire of claim 9 , further comprising the step of rounding corners of the individual filaments.", "a lower ring having a first diameter; an upper ring having a second diameter greater than the first diameter, the upper ring being substantially coaxial with the lower ring; support structure connecting the lower ring to the upper ring; and a circumferential tread attached to the upper ring, the circumferential tread including a tread layer, at least one inextensible layer, and at least one extensible layer, the at least one inextensible layer and the at least one extensible layer being disposed between the tread layer and the upper ring along a radial direction of the non-pneumatic tire, the at least one inextensible layer including a filament assembly that includes a plurality of individual filaments having a non-circular cross section, a circle circumscribing each of the filaments having a diameter of 0.1-25 mm, each of the filaments having a coating with a thickness of 0-10 mm.", "17 . The non-pneumatic tire of claim 16 , wherein the filaments are configured and arranged such that the filaments have a packing density of at least 92% within the filament assembly.", "18 . The non-pneumatic tire of claim 16 , wherein each of the plurality of filaments has one of a square cross section and a hexagonal cross section.", "19 . The non-pneumatic tire of claim 16 , wherein each of the plurality of filaments has a central longitudinal axis, the central longitudinal axes of the filaments being aligned relative to adjacent filaments in one of a circumferential direction and a radial direction of the non-pneumatic tire and offset relative to adjacent filaments in one other of the circumferential direction and the radial direction of the non-pneumatic tire.", "20 . The non-pneumatic tire of claim 16 , wherein each of the plurality of filaments has a central longitudinal axis, the central longitudinal axes of the filaments being aligned relative to adjacent filaments in both a circumferential direction and a radial direction of the non-pneumatic tire."], "bibtex": "@patent{20240100882,\n    title = {TIRE BAND WITH FILAMENTS HAVING A NON-CIRCULAR CROSS SECTION},\n    number = {20240100882},\n    year = {2024},\n    note = {File: US20240100882A1-20240328.XML}\n    }", "classification": "B60C718FI"}, {"title": "NON-PNEUMATIC TIRE", "doc_number": "20240100883", "filename": "US20240100883A1-20240328.XML", "abstract": "Reinforcements for the annular band of a non-pneumatic tire. Different configurations and material arrangements are described. Exemplary embodiments of a non-pneumatic tire that can incorporate such annular band are also described.", "detailed_description": ["For purposes of describing the invention, reference now will be made in detail to embodiments of the invention, one or more examples of which are illustrated in the drawings. Each example is provided by way of explanation of the invention, not limitation of the invention. In fact, it will be apparent to those skilled in the art that various modifications and variations can be made in the present invention without departing from the scope or spirit of the invention. For instance, features illustrated or described as part of one embodiment, can be used with another embodiment to yield a still further embodiment. Thus, it is intended that the present invention covers such modifications and variations as come within the scope of the appended claims and their equivalents.", "", "“Axial direction” or the letter “A” in the figures refers to a direction parallel to the axis of rotation of for example, the annular band, tire, and/or wheel as it travels along a road surface.", "", "“Radial direction” or the letter “R” in the figures refers to a direction that is orthogonal to axial direction A and extends in the same direction as any radius that extends orthogonally from the axial direction.", "", "“Circumferential direction” or the letter “C” in the figures refers to a direction is orthogonal to axial direction A and orthogonal to a radial direction R.", "", "“Radial plane” or “meridian plane” means a plane that passes perpendicular to the equatorial plane and through the axis of rotation of the wheel.", "", "“Elastic material” or “Elastomer” as used herein refers to a polymer exhibiting rubber-like elasticity, such as a material comprising rubber.", "", "“Elastomeric” as used herein refers to a material comprising an elastic material or elastomer, such as a material comprising rubber.", "", "“Deflectable” means able to be bent resiliently.", "", "“Nominal load” or “desired design load” is a load for which the structure is designed to carry. More specifically, when used in the context of a wheel or tire, “nominal load” refers to the load for which the wheel or tire is designed to carry and operate under. The nominal load or desired design load includes loads up to and including the maximum load specified by the manufacturer and, in the case of a vehicle tire, often indicated by marking on the side of a the tire. A loading condition in excess of the nominal load may be sustained by the structure, but with the possibility of structural damage, accelerated wear, or reduced performance. A loading condition of less than nominal load, but more than an unloaded state, may be considered a nominal load, though deflections will likely be less than deflections at nominal load.", "", "“Modulus” or “Modulus of elongation” (MPa) was measured at 10% (MA10) at a temperature of 23° C. based on ASTM Standard D412 on dumb bell test pieces. The measurements were taken in the second elongation; i.e., after an accommodation cycle. These measurements are secant moduli in MPa, based on the original cross section of the test piece.", "", "Referring now toFIG.1, an elevation view of an exemplary embodiment of a tire100of the present invention as incorporated onto a hub108is shown.FIG.2is a cross-sectional view taken along a radial plane of tire100between resilient, composite structures102as indicated by line2-2ofFIG.1. During use, tire100rotates about an axis of rotation X that is parallel to axial direction A.", "", "Tire100includes a plurality of the deflectable, reinforced structures102that are arranged adjacent to each other along circumferential direction C. Each composite structure102has a width W extending along axial direction A between opposing lateral sides96and98. Each structure102is configured as a spoke-like or web-like component that, for this exemplary embodiment, extends along radial direction R between a resilient, annular band106and a cylindrically-shaped hub108. The construction of each composite structure102is basically identical.", "", "Tire100can be incorporated onto e.g., a wheel, hub, or other component positioned within or at opening O to allow tire100to be e.g., mounted onto an axle or other component of a vehicle so that the vehicle may roll across a ground surface. By way of non-limiting examples, such vehicle may include a passenger vehicle, heavy duty truck, light duty truck, all-terrain vehicle, bus, aircraft, agricultural vehicle, mining vehicle, bicycle, motorcycle, and others. Tire100may be attached to e.g., hub108by use of e.g., adhesives, fasteners, and combinations thereof. In still other embodiments, tire100and hub108may be integrally formed together. Other hub or wheel configurations and constructions may be used as well.", "", "An annular tread band110is incorporated with resilient annular band106. Tread band110may be e.g., adhered to annular band106or may formed integrally with annular band106. Tread band110provides an outer contact surface112for contact with the ground or other surfaces as tire100rolls across. A variety of shapes and configurations may be used for tread band100including e.g., ribs, blocks, and combinations thereof such that the present invention is not limited to the tread shown in the figures. In other embodiments, annular band106may be constructed entirely from tread band110or integrally with tread band110.", "", "Referring now toFIGS.2and3, annular band106may include a plurality of discrete, annular reinforcing elements250that each extend along circumferential direction C around tire100within an elastomeric annular shear layer252. For example, elastomeric layer252may be constructed from one or more rubber materials, polyurethanes, and combinations thereof. Reinforcing elements250may be e.g., cords or cables arranged as more fully described herein.", "", "Resilient annular band106is configured to undergo deformation as tire100rolls across a ground surface and portions of band106pass through a contact patch where outer contact surface112makes contact with the ground surface. Through such deformation, annular band106can allow outer contact surface112to become planar in the contact patch. Annular band106with e.g., reinforcement elements250also provides strength to support and carry a nominal load applied to tire100through hub108or other means of attachment to a vehicle. As will be further described, such nominal load may be applied to annular band106through compression, tension, or both, of reinforced structures102.", "", "Reinforcing elements250can be constructed from a variety of materials. For example, reinforcing elements250can be constructed from cords or cables that are constructed from polymeric monofilaments such as PET (polyethylene terephthalate), nylon, glass, metals such as, steel, aluminum, titanium, or combinations thereof. By way of additional example, reinforcing elements250could be constructed from a fiber reinforced plastic constructed from elongate composite elements of monofilament appearance made with substantially symmetrical technical fibers, the fibers being of great lengths and impregnated in a thermoset resin having an initial modulus of extension of at least 2.3 GPa, in which the fibers are all parallel to each other. In such embodiment, the elongate composite elements will deform in an elastic manner up to a compressive strain of at least equal to 2%. As used herein, an “elastic deformation” means that the material will return approximately to its original state when the stress is released. By way of example, the fibers could be constructed from glass, certain carbon fibers of low modulus, and combinations thereof. Preferably, the thermoset resin has a glass transition temperature Tggreater than 130° C. Advantageously, the initial modulus of extension of the thermoset resin is at least 3 GPa. Reinforcing elements250could also be constructed from combinations of PET and such elongate composite elements. Additionally, reinforcing elements250could be constructed from hollow tubes made from rigid polymers such as e.g., PET or nylon. Other materials may be used as well.", "", "As shown inFIGS.2,3, and4reinforcing elements250are arranged in a particular configuration for this exemplary embodiment as now more fully described with reference thereto. Reinforcing elements250are discrete in that the elastomeric material of annular shear layer252is present between reinforcing elements250to separate the same and provide that such generally do not contact each other along circumferential direction C around tire100. Reinforcing elements250have circular-cross section and are positioned along a plurality of axially-extending rows254within a radial plane of tire100. With reference toFIG.4, “axially-extending” means the geometric center G of reinforcing elements250are generally aligned along axial direction A. As used herein and the claims that follow, “circular-shaped” does not mean the cords are perfectly circular. As will be understood by a person in the art, manufacturing tolerances typically do not allow perfect circularity and the cords may otherwise be deformed slightly during manufacture.", "", "Along each row254, reinforcing elements250are uniformly spaced and alternate between reinforcing elements250D1having a first diameter D1and reinforcing elements250D2having a second diameter D2. As shown, second diameter D2is less than first diameter D1. In one exemplary aspect of the present invention second diameter D2is in the range of 25 percent to 50 percent of the first diameter D1. As shown for this exemplary embodiment, for at least a portion of annular band106, alternating rows254have the same width along axial direction A and extend almost the entire width of annular shear band106.", "", "Pairs of rows254are radially-adjacent to each other. For example, rows254Aand row254Bare radially adjacent, rows254Band row254Care radially adjacent, and so forth. Reinforcing elements250are arranged so that along radial direction R and along axial direction A, reinforcing elements250D1having a first diameter D1alternate with reinforcing elements250D2having a second diameter D2.", "", "Reinforcing elements250are positioned in relatively close proximity to each other within annular shear layer252. In one exemplary aspect, as viewed along the radial plane shown inFIGS.2and3, reinforcing elements250of adjacent rows254are “interlaced.” As used herein, “interlaced” means that an imaginary line parallel to radial direction R that is positioned between reinforcing elements250of a particular row254will intersect a reinforcing element in an adjacent row254. Alternatively or additionally, “interlaced” means that an imaginary line parallel to the axis of rotation of the tire passing through the outer extremity of a reinforcing row that is positioned between reinforcing elements250of a particular row254will intersect a reinforcing element in an adjacent column L2. For example, imaginary line L1is positioned between reinforcing elements254in row254Aand intersects a reinforcing element in row254B.", "", "For this exemplary embodiment, reinforcing elements254are also sized and positioned so that an imaginary line parallel to radial direction R and positioned between centers G of the larger reinforcing elements250D1along the same axially-extending row will always intersect at least two of the larger reinforcing elements250D1along non-adjacent, axially-oriented rows250. For example, as shown inFIG.3, line L2is between centers G of larger reinforcing elements250D1in rows254Band254Dand intersects reinforcing elements250D2in rows254Aand254Cand254E. Line L3is between centers G of larger reinforcing elements250D1in rows254Aand254Cand254Eand intersects reinforcing elements250D2in rows254Band254D.", "", "Additionally, in another exemplary aspect, annular band106is constructed with a certain volume fraction VF254of annular reinforcing elements254. More particularly, volume fraction VF254is the ratio of the total volume V254of annular reinforcing elements254to the total volume V106of annular shear layer106if no reinforcing elements254were present VF254=V254/V106. This could also be determined as the ratio of the cross-sectional area of reinforcing elements254within a radial plane to the cross-sectional area of annular layer106in the radial plane if no elements254were present. In one exemplary aspect of the invention, VF254is equal to, or greater than, 0.70 (VF254≥0.7).", "", "FIG.5provides a cross-sectional view of another exemplary embodiment of annular band106with a plurality of discrete, reinforcing elements350where the elastomeric material of annular shear layer352is present between reinforcing elements350to separate the same and provide that such generally do not contact each other along circumferential direction C around tire100. Reinforcing elements350each have a rectangular cross-section and are positioned along a plurality of axially-extending rows354within a radial plane of tire100. Along each row354, reinforcing elements350are uniformly spaced. As shown for this exemplary embodiment, for at least a portion of annular band106, alternating rows354have the same width along axial direction A and extend almost the entire width of annular shear band106.", "", "Reinforcing elements350are positioned in relatively close proximity to each other within annular shear layer352. As with the previous embodiment, adjacent rows of reinforcing elements354are interlaced. For example, imaginary line L1is positioned between reinforcing elements354in row354Dand intersects a reinforcing element354in rows354Cand354E. Additionally, in another exemplary aspect, annular band106is constructed with a certain volume fraction VF354of annular reinforcing elements354. In one exemplary aspect of the invention, VF354is equal to, or greater than, 0.70 (VF354≥0.7).", "", "FIG.6provides a cross-sectional view of another exemplary embodiment of annular band106with a plurality of discrete, reinforcing elements250and350where the elastomeric material of annular shear layer252,352is present between reinforcing elements250and350. For this exemplary embodiment, annular shear band106includes at least one set of reinforcing elements250arranged as previously described with reference toFIGS.3and4. Annular band106also includes at least one set of reinforcing elements350arranged as previously described with reference toFIG.5. The sets of reinforcing elements250and350inFIG.6alternate along radial direction R. While two sets of elements250are shown, other configurations may be use as well. For example, two sets of reinforcing elements350and one set of reinforcing elements250may be used. Other configurations may also be applied.", "", "FIG.7provides a cross-sectional view of another exemplary embodiment of annular band106with a plurality of discrete, reinforcing elements450where the elastomeric material of annular shear layer452is present between reinforcing elements450to separate the same and provide that such generally do not contact each other along circumferential direction C around tire100. Reinforcing elements450have diamond-shaped cross-section (i.e. a rhombus with two acute angles of less than 45 degrees). For this exemplary embodiment, the diamond-shaped cross-section of reinforcing elements450is horizontal—i.e. each reinforcing element450has a width along axial direction A that is greater than its height along radial direction R.", "", "Reinforcing elements450are positioned along a plurality of axially-extending rows454within a radial plane of tire100. Along each row454, reinforcing elements450are uniformly spaced. As shown for this exemplary embodiment, for at least a portion of annular band106, alternating rows454have the same width along axial direction A and extend almost the entire width of annular shear band106. In order to e.g., reduce stress concentrations, reinforcing elements450may include one or more rounded or radius corners459.", "", "Reinforcing elements450are positioned in relatively close proximity to each other within annular shear layer452. As with the previous embodiment, adjacent rows of reinforcing elements454are interlaced. For example, imaginary line L1is positioned between reinforcing elements450in row454Eand intersects a reinforcing element450in rows454Band454D. Additionally, in another exemplary aspect, annular band106is constructed with a certain volume fraction VF454of annular reinforcing elements454. In one exemplary aspect of the invention, VF454is equal to, or greater than, 0.70 (VF454≥0.7). Also, reinforcing elements450define geometric centers G. Centers G of reinforcing elements450of adjacent axially-extending rows (e.g., row454Aand454B) are offset from each other along radial direction R while centers G of reinforcing elements450of alternating rows (e.g.454Aand454C) along the radial direction R are aligned with each other along the radial direction R. Centers G of reinforcing elements450in each row are aligned along axial direction A.", "", "Each reinforcing element450includes a plurality of discrete, circular shaped cords455constructed from a first material. Cords455are surrounded by a second material457that is different than first material455. For example, in one exemplary embodiment, first material455includes a fiber reinforced plastic as previously described while second material457includes a polyethylene terephthalate (PET). Other non-metallic materials and combinations thereof may be used as well.", "", "FIG.8illustrates a cross-sectional view of another exemplary embodiment of annular band106with a plurality of discrete, reinforcing elements550where the elastomeric material of annular shear layer552is present between reinforcing elements550to separate the same and provide that such generally do not contact each other along circumferential direction C around tire100. Reinforcing elements550have a triangular cross-section and are positioned along a plurality of axially-extending rows554within a radial plane of tire100. Along each row554, reinforcing elements550are uniformly spaced. As shown for this exemplary embodiment, for at least a portion of annular band106, alternating rows554have the same width along axial direction A and extend almost the entire width of annular shear band106.", "", "Reinforcing elements550are positioned in relatively close proximity to each other within annular shear layer552. An imaginary line parallel to radial direction R will intersect adjacent rows of the plurality of axially extending rows. For example, imaginary line L1that extends within any reinforcing element550will intersect each of rows554A,554B,554C, and554D. Additionally, in another exemplary aspect, annular band106is constructed with a certain volume fraction VF554of annular reinforcing elements554. In one exemplary aspect of the invention, VF554is equal to, or greater than, 0.70 (VF554≥0.7).", "", "As shown inFIG.9, each reinforcing element550defines a geometric center G. A first material551is positioned at center G and is partially or completely surrounded by a second material253that is different than first material551. For example, in one exemplary embodiment, first material551includes a fiber reinforced plastic as previously described while second material253includes a polyethylene terephthalate (PET). Other non-metallic materials and combinations thereof may be used as well.", "", "Referring again toFIG.1, as tire100rolls across e.g., a ground surface, multiple structures102near the contact patch may flex under compression as the outer contact surface112passes through the contact patch. Structures102located elsewhere may also incur deflections but the greatest deflection of structures102will likely occur near the contact patch. At the same time, other resilient structures102located at portions along tire100away from the contact patch—such as e.g., opposite to the contact path—may also flex under tension.", "", "FIG.10provides a perspective view of a portion of an exemplary reinforced structure102whileFIG.11is a cross-sectional view thereof.FIG.12is another perspective view of structure102ofFIGS.10and11but with portions of various components removed to reveal certain features as further described herein. The cross-sectional profile inFIG.11is continuous along axial direction A as structure102extends axially over tire100from side96to opposing side98.", "", "Each structure102includes a radially-outer joint122and a radially-inner joint120. As shown, joints120and122are spaced apart from each other along radial direction R with joint120being radially inward of joint122. By way of example, joint120,122may each be constructed from an elastomeric material that extends continuously along axial direction A of tire100.", "", "For this exemplary embodiment, along one side, radially-outer joint122includes a radially-outer connecting surface130that is continuous along axial direction A and has a width along circumferential direction C. Surface130may be slightly curved along circumferential direction C. Connecting surface130can be incorporated with a first component of a tire such as resilient annular band106. For example, connecting surface130can be adhered (e.g., using a cyanoacrylate adhesive), bonded, mechanically connected, and/or integrally formed with annular band106. In other embodiments, radially-outer joint122may be incorporated with e.g., tread band110, annular band106, or combinations thereof. As shown inFIGS.3and4, surface130is slightly concave along circumferential direction C for this exemplary embodiment.", "", "Similarly, along an opposing side, radially-inner joint120includes a radially-inner connecting surface128. For this exemplary embodiment, connecting surface128is also continuous along axial direction A and has a width along circumferential direction C. Surface128may be slightly curved along circumferential direction C. Connecting surface128can be incorporated with a second component such as a hub108of a wheel. For example, connecting surface128can be adhered, bonded, mechanically connected, and/or integrally formed with hub108. In other embodiments, radially-inner joint120may be incorporated with e.g., hub108, a wheel, or combinations thereof. As shown inFIGS.10and11, surface128is slightly convex along circumferential direction C for this exemplary embodiment.", "", "In one exemplary aspect of the invention, joint120and/or122may be connected with other components of tire100(e.g., with hub108or annular band106) by creating such components from uncured rubber and then curing the rubber components together to form an integral construction. Similarly, in another exemplary aspect, one or more strips of green rubber could be placed between cured or partially cured components and used to cure them together.", "", "In another exemplary aspect of the invention, joints120and122are constructed from a relatively soft rubber. In one exemplary embodiment, a rubber having a modulus in the range of 1 MPa to 10 MPa may be used. In still another exemplary embodiment, a rubber having a modulus of about 4.8 MPa may be used.", "", "Each resilient structure102has a pair of support legs132and134. Radially-inner support leg132has a radially-inner end136to which radially-inner joint120is connected. Radially-outer support leg134has a radially-outer end138to which radially-outer joint122is connected. Along the length of radially-inner support leg132, radially-inner joint120is spaced apart and discrete from a central joint148. Similarly, along the length of radially-outer support leg134, radially-outer joint122is spaced apart and discrete from central joint148. For this exemplary embodiment, radially-outer support leg134may connected with annular band106by radially-outer joint122. Radially-inner support leg132may be connected with hub108by radially-inner joint120.", "", "In certain embodiments, radially-inner support leg132may be slightly different in length than radially-outer support leg134. More particularly, leg132may be shorter than leg134or vice-versa. Having e.g., radially-inner support leg132shorter than radially-outer support leg143may be utilized to better accommodate changes in radius as portions of structures102are affected by the passage of contact surface112through the contact patch. For example, such difference in length may facilitate adjacent structures102“nesting” or deforming together as each structure102pass through the contact patch when tire100rolls across a surface (particularly when overloaded).", "", "Legs132,134form a non-zero angle α that is less than 180 degrees when tire100is not loaded. Legs132,134form a central joint side140(same side as angle α) and an opposing leg joint side142of each resilient structure102. Radially-inner leg132extends between central joint148and a radially-inner end136at joint120. Radially-outer leg134extends between central joint148and radially-outer end138at joint122.", "", "Continuing withFIGS.10,11, and12, a support membrane104extends continuously between radially-inner support leg132and radially-outer support leg134. By way of example, support membrane104may be constructed from a plurality of reinforcements within e.g., rubber or another elastomeric material. For this exemplary embodiment, support membrane104includes a plurality of elongate, reinforcements144surrounded by a rubber material164(FIG.12). Reinforcements144and rubber material164extends continuously between legs132and134.", "", "Support membrane104has a smooth radius of curvature SMRC(FIG.11) between radially-inner support leg132and radially-outer support leg134at knee151of support102. The magnitude for radius of curvature SMRCwill depend on e.g., the overall size of tire100, the height along radial direction R of each support102, and other variables.", "", "Reinforcements144are adjacent to one another along axial direction A and extend along radial direction R between radially-outer end138of radially-outer support leg134and radially-inner end136of radially-inner support leg132. In one exemplary aspect, as depicted inFIG.11, a portion of support membrane104including reinforcements144within leg132are substantially within a first plane. Similarly, another portion of membrane104including reinforcements144within leg134are substantially within a second plane that is at a non-zero angle to the first plane. Near radially-inner end136, support membrane104may have a slight radius of curvature providing a concave shape on side140. Near radially-outer end138, support membrane104may have a slight radius of curvature providing a concave shape on side140.", "", "In one exemplary aspect, elongate reinforcements144may have a diameter of about 1 mm and may be spaced apart from each other along axial direction A at a pace of about 2 mm as measured at radially inner end136or radially outer end138. Other pacings and diameters may be used as well.", "", "In certain exemplary embodiments, reinforcements144may be e.g., constructed from filaments formed by pultrusion of a glass reinforced resin. The filaments may have a modulus in the range of 10 GPa to 100 GPa. In still another embodiment, the filaments may have a modulus e.g., approximately 40 GPa. Other materials for construction of reinforcements144may be used as well including e.g., carbon fiber such as graphite epoxy, glass epoxy, aramid reinforced resins or epoxy, and combinations thereof. Fiber-reinforced plastic reinforcements144or metallic reinforcements144may also be used provided such have sufficient flexural rigidity for the nominal loads to be supported by tire100.", "", "In still another embodiment, support membrane104could be constructed as a fiber reinforced plastic. For example, support membrane could be constructed as a layer of fiberglass reinforced resin where the fiberglass is formed of e.g., filaments created by pultrusion of a glass reinforced resin. The filaments may have a modulus in the range of 10 GPa to 100 GPa. In still another embodiment, the filaments may have a modulus e.g., approximately 40 GPa.", "", "Other constructions may also be sued for resilient structures102, including membrane104of support legs132and134. Resilient structures102are constructed and reinforced in a manner that allows flexural rigidity such that each may deform resiliently as structures102are placed under tension and compression during operation of tire100. For example, support legs132and134may have a flexural rigidity of approximately 140,000 N-mm2as measured by e.g., ASTM D709. Other values may be used as well depending upon e.g., the application for tire100.", "", "Radially-outer end138of support leg134is attached to radially-outer joint122and is allowed to compress or stretch radially-outer joint122during operation of tire100. Similarly, radially-inner end136of support leg132is attached to radially-inner joint120and is allowed to compress or stretch radially-inner joint120during operation of tire100.", "", "Each composite structure102also includes central joint148. Central joint148connects with legs132and134and is positioned between them at a bend in support membrane104. Central joint148is located on central joint side140of structures102whereas joints120,122are located on the opposing (along circumferential direction C) leg joint side142. In one exemplary embodiment, central joint148is constructed from an elastomeric material (e.g., rubber) that extends continuously along axial direction A. In one exemplary embodiment, a rubber having a modulus in the range of 1 MPa to 10 MPa can be used. In another exemplary embodiment, a rubber having a modulus of about 4.8 MPa may be used. Central joint148has a thickness along radial direction R that changes along circumferential direction C. In the embodiment of tire100shown inFIG.1, for example, the thickness along radial direction R of central joint148increases along circumferential direction C moving from leg joint side142to central joint side140.", "", "Each resilient structure102may have a covering or outer layer152made of a rubber or other elastomeric material. Outer layer152may be placed on both sides140,142of structures102. In one exemplary aspect, each covering152may have a modulus of approximately 5 MPa.", "", "Referring now toFIGS.13and14(elastomeric covering152is not shown for purposes of illustration), during operation of tire100as it rolls across a surface, some structures102may be placed in compression while other structures102may be placed in tension. The dashed lines ofFIG.13illustrate a structures102undergoing compression while the dashed lines ofFIG.14illustrate a structure102undergoing tension.", "", "While not intending to be bound to any particular theory, the action of structures102during operation of tire100will now be described. During compression as depicted inFIG.13, structure102is deformed or flexed radially inward (towards the axis of rotation X). In such state, central joint148is compressed between support legs132and134. At the same time, radially-outer joint122undergoes highest compression along a portion nearest central joint148and undergoes lowest compression or undergoes tension on an opposing portion farthest from central joint148. Similarly, during compression, radially-inner joint120undergoes compression along a portion nearest central joint148and undergoes tension on an opposing portion farthest from central joint148.", "", "Conversely, during tension as depicted inFIG.14, structures102are deformed or flexed radially outward (away from the axis of rotation X). In such state, central joint148is in tension—pulled by support legs132and134. At the same time, radially-outer joint122undergoes highest tension along a portion nearest central joint148and undergoes lowest tension or compression on an opposing portion farthest from central joint148. Similarly, during tension, radially-inner joint120undergoes highest tension along a portion nearest central joint148and undergoes lowest tension or compression on an opposing portion farthest from central joint148.", "", "For the embodiment shown, support membrane104of each support structure102is not connected directly to hub108or annular band106. During compression (FIG.13), the distance along radial direction R between radially-inner end136and138can decrease as legs132and134move closer together. During tension (FIG.14), the distance along radial direction R between radially-inner end136and138can increase as legs132and134move apart. In each such case, central joint148can also act somewhat like a hinge so that the angle α between portions of legs132and134may change as tire100rolls across a surface and support legs132and134rotate into, and out of, proximity to the contact patch.", "", "While the present subject matter has been described in detail with respect to specific exemplary embodiments and methods thereof, it will be appreciated that those skilled in the art, upon attaining an understanding of the foregoing may readily produce alterations to, variations of, and equivalents to such embodiments. Accordingly, the scope of the present disclosure is by way of example rather than by way of limitation, and the subject disclosure does not preclude inclusion of such modifications, variations and/or additions to the present subject matter as would be readily apparent to one of ordinary skill in the art using the teachings disclosed herein."], "claims": ["an annular shear band including an annular shear layer comprising an elastomeric material; and a plurality of discrete, annular reinforcing elements positioned within the shear layer along a plurality of axially-extending rows within a radial plane of the tire, the reinforcing elements having rectangular cross-sections along the radial plane of the tire, the reinforcing elements defining centers, wherein the centers of the reinforcing elements of adjacent axially-extending rows are offset from each other along the radial direction while the centers of the reinforcing elements of alternating rows along the radial direction are aligned with each other along the radial direction, wherein the reinforcing elements are non-metallic, and wherein a volume fraction VF of the reinforcement elements is greater than, or equal to 0.7.", "2 . The non-pneumatic tire of claim 1 , wherein the reinforcing elements are interlaced.", "3 . The non-pneumatic tire of claim 2 , wherein an imaginary line positioned between reinforcing elements of one of the axially-extending rows will intersect the reinforcing element of an adjacent axially extending row.", "4 . The non-pneumatic tire of claim 3 , wherein an imaginary line positioned between reinforcing elements of one of the axially-extending rows will intersect reinforcing elements of adjacent axially extending rows.", "5 . The non-pneumatic tire of claim 1 , wherein the reinforcing elements each comprise a fiber reinforced plastic.", "6 . The non-pneumatic tire of claim 1 , wherein the elastomeric material is present between the reinforcing elements.", "7 . The non-pneumatic tire of claim 1 , wherein the elastomeric material is present between the reinforcing elements and prevents contact between the reinforcing elements along the circumferential direction.", "8 . The non-pneumatic tire of claim 1 , wherein the reinforcing elements have the same width along the axial direction.", "9 . The non-pneumatic tire of claim 1 , wherein along each axially-extending row, the reinforcing elements are uniformly spaced along the axial direction.", "10 . The non-pneumatic tire of claim 1 , wherein for at least a portion of the annular band, alternating axially-extending rows have the same width along the axial direction.", "11 . The non-pneumatic tire of claim 10 , wherein the alternating axially-extending rows extend the almost the entire width of the annual shear band along the axial direction."], "bibtex": "@patent{20240100883,\n    title = {NON-PNEUMATIC TIRE},\n    number = {20240100883},\n    year = {2024},\n    note = {File: US20240100883A1-20240328.XML}\n    }", "classification": "B60C722FI"}, {"title": "Optimized Architecture of a Civil Engineering Tire", "doc_number": "20240100884", "filename": "US20240100884A1-20240328.XML", "abstract": "A radial tire ( 1 ) for a heavy-duty vehicle, in which the reinforcing elements of each hooping layer ( 331, 332, 333 ), forming an angle at most equal to 5° with the circumferential direction, and the reinforcing elements of the transverse reinforcer layers ( 321, 322, 323 ), forming an angle of between 10° and 45° with the circumferential direction, are extensible and therefore such that, in their rubberized state extracted from a polymer matrix, their structural elongation As is at least equal to 0.5%, their total elongation at break At is at least equal to 3% and their tensile Young's modulus E is at most equal to 150 GPa.", "detailed_description": [""], "claims": ["a crown reinforcement, radially inside a tread having an axial width Lbdr and radially outside a carcass reinforcement, the crown reinforcement comprising at least two transverse reinforcer layers, one with a larger axial width having an axial width Ltmax and one with a smaller axial width having an axial width Ltmin, each transverse reinforcer layer comprising metal reinforcing elements parallel to each other, forming oriented angles at least equal to 10° and at most equal to 45° with the circumferential direction, at least two angles of two transverse reinforcer layers being of opposite sign, the crown reinforcement comprising at least one hooping layer having a maximum axial width Lfmax comprising extensible metal reinforcing elements parallel to each other and forming an angle at most equal to 5° with a circumferential direction (XX′) of the tire, each reinforcing element of each of the layers of the crown reinforcement being characterized by a structural elongation As, a force at break Fm (maximum load in N), a breaking strength Rm (in MPa), a total elongation at break At and a tensile Young's modulus, these characteristics being measured in accordance with ASTM D 2696-04 of 2014, each extensible metal reinforcing element of each hooping layer having, in its rubberized state extracted from a polymer matrix, a structural elongation Asf at least equal to 0.5%, a total elongation at break Atf at least equal to 3% and a tensile Young's modulus Ef at most equal to 150 GPa, wherein the reinforcing elements of the transverse reinforcer layers are extensible and have, in their rubberized state extracted from a polymer matrix, a structural elongation Ast at least equal to 0.5%, a total elongation at break Att at least equal to 3% and a tensile Young's modulus Et at most equal to 150 GPa, and wherein all of the metal reinforcers of the crown reinforcement are extensible.", "2 . The tire as claimed in claim 1 , wherein the axial width Ltmin of the transverse reinforcer layer with a smaller axial width is at least equal to 70% of the axial width Lbdr of the tread (Ltmin≥0.7*Lbdr) and preferably at least equal to 80% of the axial width Lbdr of the tread (Ltmin≥0.8*Lbdr).", "3 . The tire ( 1 ) as claimed in claim 1 , wherein the axial width of at least one hooping layer is at least equal to 60% of the axial width Lbdr of the tread (Lfmax≥0.6*Lbdr) and preferably at least equal to 70% of the axial width Lbdr of the tread (Lfmax≥0.7*Lbdr).", "4 . The tire as claimed in claim 1 , wherein, the Young's modulus Ef of the reinforcing elements of each hooping layer and the Young's modulus Et 2 of the reinforcing elements of the second radially innermost transverse reinforcer layer are at least equal to 85% and at most equal to 110% of the Young's modulus Et 1 of the reinforcing elements of the radially innermost transverse reinforcer layer ( 321 ) (0.85*Et 1 ≤Ef≤1.10*Et 1 and 0.85*Et 1 ≤Et 2 ≤1.10*Et 1 ), each of the reinforcers being in its rubberized state extracted from a polymer matrix.", "5 . The tire as claimed in claim 1 , wherein the reinforcing elements of the two radially innermost transverse reinforcer layers and of the hooping layers have, in their rubberized state extracted from a polymer matrix, respective Young's moduli (Ef, Et) at most equal to 85 GPa and at least equal to 50 GPa.", "6 . The tire as claimed in claim 1 , wherein the reinforcing elements of the two radially innermost transverse reinforcer layers and of the hooping layers have, in their rubberized state extracted from a polymer matrix, respective structural elongations (Asf, Ast) at least equal to 1%.", "7 . The tire as claimed in claim 1 , wherein the reinforcing elements of the two radially innermost transverse reinforcer layers and of the hooping layers have, in their rubberized state extracted from a polymer matrix, respective structural elongations (Asf, Ast) at most equal to 3%.", "8 . The tire as claimed in claim 1 , wherein the structural elongation Asf of the reinforcing elements of each hooping layer and the structural elongation Ast 2 of the second radially innermost transverse reinforcer layer are at least equal to 85% and at most equal to 110% of the structural elongation Ast 1 of the reinforcing elements of the radially innermost transverse reinforcer layer (0.85*Ast≤Asf≤1.10*Ast), each of the reinforcers being in its rubberized state extracted from a polymer matrix.", "9 . The tire as claimed in claim 1 , wherein the radially outermost crown reinforcing layer is radially outside at least two transverse reinforcer layers and at least one hooping layer in which the reinforcing elements of the radially outermost crown layer have, in their rubberized state extracted from a polymer matrix, a structural elongation Asp at least equal to one percent plus the structural elongation Ast of the reinforcing elements of the radially innermost transverse reinforcer layer (Asp≥Ast+1%)."], "bibtex": "@patent{20240100884,\n    title = {Optimized Architecture of a Civil Engineering Tire},\n    number = {20240100884},\n    year = {2024},\n    note = {File: US20240100884A1-20240328.XML}\n    }", "classification": "B60C920FI"}, {"title": "Optimized Architecture of a Civil Engineering Tire", "doc_number": "20240100885", "filename": "US20240100885A1-20240328.XML", "abstract": "A radial tire ( 1 ) for a heavy-duty vehicle, with at least two working layers ( 321, 322, 323, 324 ) in which the reinforcing elements form an angle at least equal to 10° and at most equal to 45° with the circumferential direction. The metal reinforcers of all of the crown layers of the crown reinforcement are extensible and therefore have, in their rubberized state extracted from a polymer matrix, a structural elongation As at least equal to 0.5%, a total elongation at break At at least equal to 3% and a tensile Young's modulus E at most equal to 150 GPa. The narrower of the two working layers has an axial width at least equal to 60% of the width of the tread and the wider of the two working layers has an axial width at least equal to 70% of the width of the tread.", "detailed_description": [""], "claims": ["a crown reinforcement, radially inside a tread having an axial width Lbdr and radially outside a carcass reinforcement and comprising crown layers having metal reinforcing elements, the crown reinforcement comprising at least one working reinforcement, comprising at least two working layers, one with a larger axial width having an axial width Ltmax and one with a smaller axial width having an axial width Ltmin, each working layer comprising metal reinforcing elements parallel to each other, forming oriented angles at least equal to 10° and at most equal to 45° with the circumferential direction, at least two angles of two working layers being of opposite signs, each reinforcing element of each of the crown layers being characterized by a structural elongation As, a force at break Fm (maximum load in N), a breaking strength Rm (in MPa), a total elongation at break At and a tensile Young's modulus E, these characteristics being measured in accordance with ASTM D 2696-04 of 2014, wherein each metal reinforcing element of each crown layer is extensible and has, in its rubberized state extracted from a polymer matrix, a structural elongation As at least equal to 0.5%, a total elongation at break At at least equal to 3% and a tensile Young's modulus E at most equal to 150 GPa, wherein the axial width Ltmin of the working layer with a smaller axial width ( wherein the axial width Ltmax of the working layer with a larger axial width (", "2 . The tire as claimed in claim 1 , wherein the crown reinforcement consists of two working layers and a third transverse reinforcer crown layer in which the extensible metal reinforcers form an angle of between 5° and 70° with the circumferential direction.", "3 . The tire as claimed in claim 1 , wherein the crown reinforcement consists of four working layers.", "4 . The tire as claimed in claim 1 , wherein the crown reinforcement comprises three working layers and a transverse reinforcer crown layer wherein the extensible reinforcers form an angle of between 5° and 70° with the circumferential direction, the angles of the reinforcers with the circumferential direction being of opposite signs from one working layer to the next.", "5 . The tire as claimed in claim 1 , wherein the crown reinforcement consists of two working layers.", "6 . The tire as claimed in claim 1 , wherein the structural elongation at break As of the reinforcing elements of each crown layer is at least equal to 85% and at most equal to 110% of the structural elongation Ast of the reinforcing elements of the radially innermost working layer ( 321 ), each of the reinforcers being in its rubberized state extracted from a polymer matrix.", "7 . The tire as claimed in claim 1 , wherein the Young's modulus Ef of the reinforcing elements of each crown layer is preferably at least equal to 85% and at most equal to 110% of the Young's modulus Et of the reinforcing elements of the radially innermost working layer (0.85*Et≤Ef≤1.10*Et), each of the reinforcers being in its rubberized state extracted from a polymer matrix.", "8 . The tire as claimed in claim 1 , wherein each extensible metal reinforcing element of each crown layer has, in its rubberized state extracted from a polymer matrix, a structural elongation at least equal to 1% and at most equal to 3%.", "9 . The tire as claimed in claim 1 , wherein each extensible metal reinforcing element of each crown layer has, in its rubberized state extracted from a polymer matrix, Young's modulus (Ef, Et) at most equal to 85 GPa and at least equal to 50 GPa.", "10 . The tire as claimed in claim 1 , wherein the crown reinforcement comprises at least three crown layers, and the reinforcing elements of the radially outermost crown layer have a structural elongation Asp at least equal to one percent plus the structural elongation Ast of the reinforcing elements of the radially innermost working layer (Asp≥Ast+1%), each of the reinforcers being in its rubberized state extracted from a polymer matrix."], "bibtex": "@patent{20240100885,\n    title = {Optimized Architecture of a Civil Engineering Tire},\n    number = {20240100885},\n    year = {2024},\n    note = {File: US20240100885A1-20240328.XML}\n    }", "classification": "B60C920FI"}, {"title": "TIRE FOR MOTORCYCLE FOR RUNNING ON ROUGH TERRAIN", "doc_number": "20240100886", "filename": "US20240100886A1-20240328.XML", "abstract": "A tire 2 includes a tread 4 . The tread 4 includes a plurality of blocks 18 . The plurality of blocks 18 include a plurality of center blocks 28 located on an equator plane. The plurality of center blocks 28 include a main center block 28 m having, in a land surface 20 thereof, a center of gravity CG of the land surface 20 . At the center of gravity CG of the land surface 20 of the main center block 28 m , an axial length a of the main center block 28 m is not less than twice a circumferential length b thereof. The main center block 28 m has a hardness of not greater than 70. The main center block 28 m has a 300% modulus of not less than 8.5 MPa.", "detailed_description": ["The following will describe in detail the present invention based on preferred embodiments with appropriate reference to the drawings.", "", "A tire of the present disclosure is fitted on a rim. The interior of the tire is filled with air to adjust the internal pressure of the tire. The tire fitted on the rim is also referred to as tire-rim assembly. The tire-rim assembly includes the rim and the tire fitted on the rim.", "", "In the present disclosure, a state where a tire is fitted on a normal rim, the internal pressure of the tire is adjusted to a normal internal pressure, and no load is applied to the tire is referred to as a normal state.", "", "In the present disclosure, unless otherwise specified, the dimensions and angles of each component of the tire are measured in the normal state.", "", "The dimensions and angles of each component in a meridian cross-section of the tire, which cannot be measured in a state where the tire is fitted on the normal rim, are measured in a cross-section of the tire obtained by cutting the tire along a plane including the rotation axis of the tire. In this measurement, the tire is set such that the distance between right and left beads is made equal to the distance between the beads in the tire that is fitted on the normal rim.", "", "The normal rim means a rim specified in a standard on which the tire is based. The “standard rim” in the JATMA standard, the “Design Rim” in the TRA standard, and the “Measuring Rim” in the ETRTO standard are normal rims.", "", "The normal internal pressure means an internal pressure specified in the standard on which the tire is based. The “highest air pressure” in the JATMA standard, the “maximum value” recited in the “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, and the “INFLATION PRESSURE” in the ETRTO standard are normal internal pressures.", "", "A normal load means a load specified in the standard on which the tire is based. The “maximum load capacity” in the JATMA standard, the “maximum value” recited in the “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, and the “LOAD CAPACITY” in the ETRTO standard are normal loads.", "", "In the present disclosure, a rubber composition refers to a composition that is obtained by mixing a base rubber and chemicals in a kneading machine such as a Banbury mixer and that contains the uncrosslinked base rubber. A crosslinked rubber refers to a crosslinked product, of the rubber composition, obtained by pressurizing and heating the rubber composition. The crosslinked rubber contains a crosslinked product of the base rubber. The crosslinked rubber is also referred to as vulcanized rubber, and the rubber composition is also referred to as unvulcanized rubber.", "", "Examples of the base rubber include natural rubber (NR), butadiene rubber (BR), styrene-butadiene rubber (SBR), isoprene rubber (IR), ethylene-propylene rubber (EPDM), chloroprene rubber (CR), acrylonitrile-butadiene rubber (NBR), and isobutylene-isoprene-rubber (IIR). Examples of the chemicals include reinforcing agents such as carbon black and silica, plasticizers such as aromatic oil, fillers such as zinc oxide, lubricants such as stearic acid, antioxidants, processing aids, sulfur, and vulcanization accelerators. Selection of a base rubber and chemicals, the amounts of the selected chemicals, etc., are determined as appropriate according to the specifications of components such as a tread and sidewalls for which the rubber composition is used.", "", "In the present disclosure, a 300% modulus of a component formed from a crosslinked rubber, of the components included in the tire, means the tensile stress at 300% elongation specified in JIS K6251. The 300% modulus is measured according to the standards of JIS K6251. In this measurement, a test piece is sampled from the tire such that the length direction thereof coincides with the circumferential direction of the tire. When a test piece cannot be sampled from the tire, a test piece is sampled from a sheet-shaped crosslinked rubber (hereinafter, also referred to as rubber sheet) obtained by pressurizing and heating a rubber composition, which is used for forming the component to be measured, at a temperature of 170° C. for 12 minutes.", "", "In the present disclosure, the 300% modulus is represented as a 300% modulus at 75° C.", "", "In the present disclosure, the hardness of a component formed form a crosslinked rubber, from among the components included in the tire, is measured according to JIS K6253 under a temperature condition of 23° C. using a type A durometer.", "", "In the present disclosure, the land surface is a part of a tread surface other than grooves included in the tread surface. In the case of a tread having a block pattern, the top surface of each block is the land surface. Of the tread surface, a portion other than the land surface corresponds to the grooves and is also referred to as sea surface. The ratio of the total area of the land surface included in the tread surface to the area of the tread surface is a land ratio. In the present disclosure, the land ratio is calculated on the basis of a development of the tread surface. The area of the tread surface is equal to the sum of the total area of the land surface and the total area of the sea surface.", "", "In the present disclosure, a tread portion of the tire is a portion of the tire that comes into contact with a road surface. A bead portion is a portion of the tire that is fitted to a rim. A sidewall portion is a portion of the tire that extends between the tread portion and the bead portion. The tire includes a tread portion, a pair of bead portions, and a pair of sidewall portions as portions thereof."], "claims": ["the tread includes a plurality of blocks each having a land surface forming a part of the tread surface, the plurality of blocks include a plurality of center blocks located on an equator plane, the plurality of center blocks include a main center block having, in the land surface thereof, a center of gravity of the land surface, at the center of gravity of the land surface of the main center block, an axial length of the main center block is not less than twice a circumferential length thereof, the main center block has a hardness of not greater than 70, and the main center block has a 300% modulus of not less than 8.5 MPa.", "2 . The tire for a motorcycle for running on rough terrain according to claim 1 , wherein a ratio of the axial length of the main center block to the circumferential length of the main center block is not less than 2.0 and not greater than 2.9.", "3 . The tire for a motorcycle for running on rough terrain according to claim 1 , wherein half or more of the plurality of center blocks are each the main center block.", "4 . The tire for a motorcycle for running on rough terrain according to claim 1 , wherein a block height of the main center block is not less than 15 mm and not greater than 20 mm in a state where the tire is fitted on a normal rim, an internal pressure of the tire is adjusted to a normal internal pressure, and no load is applied to the tire.", "5 . The tire for a motorcycle for running on rough terrain according to claim 1 , wherein the tread surface has a land ratio of not less than 13% and not greater than 60%."], "bibtex": "@patent{20240100886,\n    title = {TIRE FOR MOTORCYCLE FOR RUNNING ON ROUGH TERRAIN},\n    number = {20240100886},\n    year = {2024},\n    note = {File: US20240100886A1-20240328.XML}\n    }", "classification": "B60C1111FI"}, {"title": "HEAVY DUTY TIRE", "doc_number": "20240100887", "filename": "US20240100887A1-20240328.XML", "abstract": "A heavy duty tire can have a tread portion that includes a plurality of circumferential grooves that zigzag, a plurality of lateral grooves connecting between zigzag vertexes of the circumferential grooves, and a plurality of hexagonal blocks formed by the circumferential grooves and the lateral grooves. A groove depth of the circumferential groove can be 21 mm or more. Each of the hexagonal blocks can include a three-dimensional sipe extending across the hexagonal block. The lateral groove can include a raised portion formed by raising a groove bottom of the lateral groove to connect between the hexagonal blocks adjacent to each other in the tire circumferential direction.", "detailed_description": ["The present disclosure has been made in view of the aforementioned circumstances in the Background section, and an object of the present disclosure, among one or more objects, can be to provide a heavy duty tire that allows enhancement of life performance and uneven wear resistance.", "", "One embodiment of the present disclosure will be described below with reference to the drawings.", "", "FIG.1is an enlarged plan view of a tread portion2of a heavy duty tire (hereinafter, may be simply referred to as “tire”)1of the present embodiment. For example, the tire1of the present embodiment can be suitably used as a long-life tire that allows 600000 to 700000 km of running.", "", "As shown inFIG.1, in the present embodiment, the tread portion2can include a plurality of circumferential grooves3, a plurality of lateral grooves4, and a plurality of hexagonal blocks5. Each circumferential groove3can zigzag in the tire circumferential direction so as to form zigzag vertexes6. In the present embodiment, the circumferential groove3can extend continuously in the tire circumferential direction. In the present embodiment, the zigzag vertex6can refer to a bent portion that is bent in a different direction relative to the tire circumferential direction. Each lateral groove4can connect between the zigzag vertexes6of the circumferential grooves3adjacent to each other in the tire axial direction. For example, the lateral groove4can linearly extend. Each hexagonal block5can be formed by the circumferential grooves3adjacent to each other in the tire axial direction, and a plurality of the lateral grooves4. In the present embodiment, the hexagonal block5can be formed in a barrel-like shape in which the block width at a mid-position5cin the tire circumferential direction is greater than each of the block widths at both ends5e,5ein the tire circumferential direction.", "", "FIG.2Ais a cross-sectional view taken along a line A-A inFIG.1, and is a transverse cross-sectional view of the circumferential groove3. As shown inFIG.2A, a groove depth D1of each of the plurality of the circumferential grooves3can be 21 mm or more, as an example. The circumferential groove3having such a structure can exhibit high life performance. In order to enhance life performance and uneven wear resistance in a well-balanced manner, the groove depth D1of the circumferential groove3can be 22 mm or more and 26 mm or less.", "", "As shown inFIG.1, at each of the hexagonal blocks5, a three-dimensional sipe7can be disposed so as to zigzag in the tire axial direction and the tire radial direction, and extend across the hexagonal block5. In the three-dimensional sipe7, wall surfaces7a(shown inFIG.3) of the sipe can mesh with each other when the tire1comes into contact with the ground, and the hexagonal block5can maintain high apparent stiffness and can inhibit slipping, and uneven wear resistance can thus be enhanced. Furthermore, since the three-dimensional sipe7can enhance apparent stiffness of the hexagonal block5, life performance can be enhanced. In the present embodiment, the three-dimensional sipe7can be disposed at the mid-position5c of the hexagonal block5in the tire circumferential direction. For example, the three-dimensional sipe7can extend between the zigzag vertexes6of the circumferential grooves3.", "", "FIG.3is a perspective view conceptually illustrating the three-dimensional sipe7according to one or more embodiments of the present disclosure. In the present embodiment, the three-dimensional sipe7can zigzag in a sipe length direction f and a sipe width direction w along the tire radial direction, and the wall surface7acan be divided into parallelogram-shaped sections7tto form a so-called Miura fold. Optionally, the wall surface7aof the three-dimensional sipe7may be, for example, divided into rectangular sections. In the description herein, sipes such as the three-dimensional sipe7each refer to a cut recess having a width of 1.5 mm or less. Grooves such as the circumferential groove3and the lateral groove4each refer to a groove-like recess having a groove width of greater than 1.5 mm.", "", "FIG.4is a cross-sectional view taken along a line B-B inFIG.1, and is a vertical cross-sectional view of the lateral groove4. As shown inFIG.1andFIG.4, each of the plurality of the lateral grooves4can include a raised portion9which can be formed by raising a groove bottom4s of the lateral groove4to connect between the hexagonal blocks5adjacent to each other in the tire circumferential direction. Such a raised portion9can further inhibit slipping of the hexagonal block5during contact with the ground. Therefore, the tire1of the present embodiment can enhance life performance and uneven wear resistance.", "", "In the present embodiment, the raised portion9can be disposed at a mid-position of the lateral groove4in the tire axial direction. The raised portion9may not be connected to both ends4e,4e(the zigzag vertexes6) of the lateral groove4in the tire axial direction. In other words, in the present embodiment, the lateral groove4can include the raised portion9, and deep bottom portions10,10each of which can have a groove depth greater than the raised portion9, and which can be disposed on both sides of the raised portion9. The deep bottom portion10can contribute to enhancement of life performance.", "", "A groove depth D3of the raised portion9can be greater than or equal to0.5times a groove depth D4of the deep bottom portion10and more preferably greater than or equal to0.55times the groove depth D4, and can be preferably less than or equal to0.7times the groove depth D4and more preferably less than or equal to 0.65 times the groove depth D4. Since the groove depth D3of the raised portion9can be greater than or equal to 0.5 times the groove depth D4of the deep bottom portion10, wet performance, which may be a basic performance required for the lateral groove4, can be maintained. Since the groove depth D3of the raised portion9can be less than or equal to0.7times the groove depth D4of the deep bottom portion10, slipping of the hexagonal block5can be effectively inhibited during contact with the ground.", "", "In each of the plurality of the lateral grooves4, a length Lb of the raised portion9in the tire axial direction can be preferably less than a length La of the lateral groove4in the tire axial direction. Thus, the deep bottom portion10of the lateral groove4can be formed and life performance can be enhanced. Furthermore, the groove volume of the lateral groove4can be ensured, and wet performance can be maintained. Meanwhile, if the length Lb of the raised portion9is excessively less than the length La of the lateral groove4, slipping of the hexagonal block5may not be inhibited during contact with the ground. From these viewpoints, the length Lb of the raised portion9can be more preferably greater than or equal to0.4times the length La of the lateral groove4and even more preferably greater than or equal to0.45times the length La, and more preferably less than or equal to 0.6 times the length La and even more preferably less than or equal to0.55times the length La.", "", "In each of the plurality of the lateral grooves4, the groove depth D3at the raised portion9can be preferably greater than or equal to0.45times the groove depth D1(shown inFIG.2A) of the circumferential groove3to which the lateral groove4is connected and more preferably greater than or equal to 0.5 times the groove depth D1, and preferably less than or equal to 0.8 times the groove depth D1and more preferably less than or equal to 0.7 times the groove depth D1. Since the groove depth D3at the raised portion9can be greater than or equal to 0.45 times the groove depth D1of the circumferential groove3, life performance enhancing effect can be maintained, and wet performance can also be maintained high. Since the groove depth D3at the raised portion9can be less than or equal to0.8times the groove depth D1of the circumferential groove3, slipping of the hexagonal block5can be effectively inhibited.", "", "FIG.5is a cross-sectional view taken along a line C-C inFIG.1, and is a transverse cross-sectional view of the lateral groove4. As shown inFIG.5, each of the plurality of the lateral grooves4can include a pair of groove walls4a, and a pair of groove edges4blocated at positions at which the pair of groove walls4aand a tread surface5a of the hexagonal blocks5intersect each other. Each of the pair of groove walls4a can be preferably inclined at an angle01from 3° to 8° relative to a normal linen passing through a corresponding one of the pair of groove edges4bso as to be normal to the tread surface5a. Since the angle θ1can be 3° or more, the hexagonal block5can be inhibited from falling down, and uneven wear resistance can be maintained. Since the angle θ1can be 8° or less, the block volume of the hexagonal block5can be maintained, and reduction of the block stiffness can be inhibited, so that uneven wear resistance and life performance can be maintained high. Furthermore, the groove volume of the lateral groove4can be maintained, and degradation of wet performance can thus be inhibited. In order to effectively exhibit such effects, the angle01can be more preferably 4° or more and more preferably 7° or less. The groove wall4ahaving the angle01can be, for example, formed at the raised portion9and the deep bottom portions10.", "", "A groove width W2(shown inFIG.1) of each of the plurality of the lateral grooves4can be preferably7mm or more and more preferably 7.5 mm or more, and preferably 9 mm or less and more preferably 8.5 mm or less. Since the groove width W2of the lateral groove4can be 7 mm or more, the basic wet performance can be maintained high. Since the groove width W2of the lateral groove4can be 9 mm or less, the pattern stiffness of the tread portion2can be inhibited from being reduced.", "", "As shown inFIG.3, a depth D5of the three-dimensional sipe7can be preferably greater than or equal to 0.5 times the groove depth D1of the circumferential groove3to which the three-dimensional sipe7is connected and more preferably greater than or equal to0.6times the groove depth D1, and preferably less than or equal to 0.8 times the groove depth D1and more preferably less than or equal to0.7times the groove depth D1. Since the depth D5of the three-dimensional sipe7can be greater than or equal to 0.5 times the groove depth D1of the circumferential groove3to which the three-dimensional sipe7is connected, an effect exhibited by the three-dimensional sipe7for maintaining high apparent stiffness can be effectively exhibited. Since the depth D5of the three-dimensional sipe7can be less than or equal to 0.8 times the groove depth D1of the circumferential groove3to which the three-dimensional sipe7is connected, block stiffness of the hexagonal block5can be maintained high, and uneven wear resistance can thus be enhanced.", "", "As shown inFIG.1, for instance, in a pair P of the lateral groove4and the hexagonal block5which are adjacent to each other in the tire circumferential direction, the groove depth D3(shown inFIG.4) at the raised portion9formed in the lateral groove4can be less than the depth D5(shown inFIG.3) of the three-dimensional sipe7formed in the hexagonal block5. Thus, an effect exhibited by the raised portion9for inhibiting slipping of the hexagonal block5in the tire circumferential direction can be exhibited. Furthermore, an effect of causing the wall surfaces7a of the three-dimensional sipe7to mesh with each other with respect to a lateral force during cornering can be exhibited. Therefore, uneven wear resistance can be further enhanced. If the groove depth D3at the raised portion9is excessively less than the depth D5of the three-dimensional sipe7, wet performance may be degraded. In order to effectively exhibit the above-described effects, the groove depth D3at the raised portion9can be preferably greater than or equal to 0.65 times the depth D5of the three-dimensional sipe7and more preferably greater than or equal to 0.7 times the depth D5, and preferably less than or equal to 0.95 times the depth D5and more preferably less than or equal to0.9times the depth D5.", "", "The hexagonal block5can be formed such that a maximum width Wm thereof in the tire axial direction is less than a maximum length Lm thereof in the tire circumferential direction. The hexagonal block5having such a structure can have high stiffness in the tire circumferential direction, and can inhibit great slipping caused by acceleration or deceleration. In order to exhibit such an effect and an effect of inhibiting slipping caused by cornering in a well-balanced manner, a ratio (Wm/Lm) of the maximum width Wm to the maximum length Lm in the hexagonal block5can be preferably 0.75 or more and more preferably 0.8 or more, and preferably 0.9 or less and more preferably 0.85 or less.", "", "FIG.6is a plan view of a portion of the tread portion2between tread ends Te and Te of the tread portion2including the circumferential grooves3, the lateral grooves4, the hexagonal blocks5, and the like of the present disclosure as described above.FIG.6shows one embodiment of the present disclosure, but the present disclosure is not limited thereto.", "", "In the description herein, the “tread end Te” can represent an outermost ground contact position in the tire axial direction as obtained when a standardized load is applied to the tire1in a standardized state and the tire1is in contact with a plane at a camber angle of θ0°. A distance in the tire axial direction between the tread ends Te on both the sides can be regarded as a tread width TW.", "", "The “standardized state” can refer to a state in which the tire is mounted on a standardized rim and is inflated to a standardized internal pressure, and no load is applied. In the description herein, unless otherwise specified, the dimension and the like of each component of the tire1can be represented by a value measured in the standardized state.", "", "The “standardized rim” can represent a rim that is defined, in a standard system including a standard on which the tire1is based, by the standard for each tire, and can be, for example, “standard rim” in the JATMA standard, “Design Rim” in the TRA standard, or “Measuring Rim” in the ETRTO standard.", "", "The “standardized internal pressure” can represent an air pressure that is defined, in a standard system including a standard on which the tire1is based, by the standard for each tire, and can be, for example, “maximum air pressure” in the JATMA standard, the maximum value recited in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, or “INFLATION PRESSURE” in the ETRTO standard.", "", "The “standardized load” can represent a load that is defined, in a standard system including a standard on which the tire1is based, by the standard for each tire, and can be, for example, “maximum load capacity” in the JATMA standard, the maximum value recited in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, or “LOAD CAPACITY” in the ETRTO standard.", "", "As shown inFIG.6, in the present embodiment, the plurality of the circumferential grooves3can include a pair of crown circumferential grooves11, and a pair of shoulder circumferential grooves12disposed outwardly of the pair of crown circumferential grooves11in the tire axial direction. The pair of crown circumferential grooves11can be, for example, disposed on both sides, respectively, of a tire equator C.", "", "Specifically,FIG.2Ais a transverse cross-sectional view of the crown circumferential groove11.FIG.2Bis a cross-sectional view taken along a line D-D inFIG.6and is a transverse cross-sectional view of the shoulder circumferential groove12. As shown inFIG.2A, each of groove walls11aof the crown circumferential groove11can include, for example, an arc portion11rthat is raised from a groove bottom11sso as to be arc-shaped, and a linear portion11tthat extends linearly so as to connect between the arc portion11r and the tread surface5a of the hexagonal block5. As shown inFIG.2B, each of groove walls12a of the shoulder circumferential groove12can include, for example, an arc portion12rthat is raised from a groove bottom12sso as to be arc-shaped, a first linear portion12tconnected to the arc portion12r, and a second linear portion12uconnected to the first linear portion12t. The second linear portion12ucan be inclined relative to the tread surface5a at a gentler angle than the first linear portion12t, and can be connected to the first linear portion12tat or almost at a mid-portion, in the groove depth, of the shoulder circumferential groove12. The second linear portion12uhaving such a structure can effectively inhibit slipping of blocks (middle block18and shoulder block19described below) which can be on both sides of the shoulder circumferential groove12and on which a high lateral force acts during cornering.", "", "As shown inFIG.6, a groove width Wc of the crown circumferential groove11can be, for example, less than a groove width Ws of the shoulder circumferential groove12. Thus, tread stiffness can be maintained high near the tire equator C on which a high ground-contact pressure acts. The groove width Wc of the crown circumferential groove11can be preferably greater than or equal to 0.55 times the groove width Ws of the shoulder circumferential groove12and more preferably greater than or equal to0.6times the groove width Ws, and preferably less than or equal to 0.75 times the groove width Ws and more preferably less than or equal to 0.7 times the groove width Ws. The groove width Ws of the shoulder circumferential groove12can be preferably greater than or equal to 2% of the tread width TW and more preferably greater than or equal to 3% of the tread width TW, and preferably less than or equal to 6% of the tread width TW and more preferably less than or equal to 5% of the tread width TW.", "", "In the present embodiment, the plurality of lateral grooves4can include a plurality of crown lateral grooves14connecting between the pair of the crown circumferential grooves11, and a plurality of middle lateral grooves15connecting between the crown circumferential groove11and the shoulder circumferential groove12which can be adjacent to each other in the tire axial direction.", "", "The hexagonal blocks5can include, for example, a plurality of crown blocks17formed between the pair of the crown circumferential grooves11, and a plurality of middle blocks18formed between the crown circumferential groove11and the shoulder circumferential groove12which can be adjacent to each other in the tire axial direction. Each crown block17can be located on the tire equator C in the present embodiment. The middle blocks18can be, for example, located on both sides, respectively, of the tire equator C.", "", "The tread portion2can include, for example, a plurality of shoulder shallow lateral grooves16connecting between the shoulder circumferential grooves12and the tread ends Te. Thus, the tread portion2can include a plurality of shoulder blocks19each demarcated by the shoulder circumferential groove12, the tread end Te, and the shoulder shallow lateral grooves16. The shoulder shallow lateral groove16can be, for example, formed so as to have a groove depth less than that of each of the plurality of the lateral grooves4.", "", "A loss tangent tans of tread rubber of the tread portion2forming the hexagonal blocks5can be preferably 0.1 or less and more preferably 0.09 or less. Since the loss tangent tans can be 0.1 or less, heat generation of the tread rubber can be inhibited, and deformation of the tread rubber can be inhibited. Thus, occurrence of uneven wear can be inhibited. The tread rubber can also form the shoulder blocks19. The loss tangent tans can be measured under the following conditions in accordance with “JIS K 6394.”Measurement device: viscoelastometerInitial strain: 10%Dynamic strain: 1%Frequency: 10 HzDeformation mode: stretchMeasurement temperature: 70° C.", "", "The three-dimensional sipes7can include a crown sipe21disposed in each of the plurality of crown blocks17, and a middle sipe22disposed in each of the plurality of middle blocks18. The crown sipe21and the middle sipe22can each extend between the zigzag vertexes6of the circumferential grooves3.", "", "The raised portions9can include crown raised portions24disposed in the crown lateral grooves14and middle raised portions26disposed in the middle lateral grooves15. Thus, the crown lateral groove14can include the crown raised portion24and crown deep bottom portions25,25disposed on both sides of the crown raised portion24. The middle lateral groove15can include the middle raised portion26and middle deep bottom portions27,27disposed on both sides of the middle raised portion26.", "", "FIG.7Ais a cross-sectional view taken along a line E-E inFIG.6, and is a transverse cross-sectional view of the crown sipe21and the crown lateral groove14.FIG.7Bis a cross-sectional view taken along a line F-F inFIG.6, and is a transverse cross-sectional view of the middle sipe22and the middle lateral groove15. As shown inFIG.7, a maximum depth D5b of the middle sipe22can be greater than a maximum depth D5a of the crown sipe21. Thus, in the middle block18on which a higher lateral force than that on the crown block17acts during cornering, a force for causing wall surfaces22aof the middle sipe22to mesh with each other can be increased, apparent stiffness of the middle block18can become higher, and slipping can be thus more effectively inhibited. The maximum depth D5b of the middle sipe22can be, but is not particularly limited to, preferably greater than or equal to 1.1 times the maximum depth D5a of the crown sipe21and more preferably greater than or equal to 1.15 times the maximum depth D5a, and preferably less than or equal to 1.3 times the maximum depth D5aand more preferably less than or equal to 1.25 times the maximum depth D5a.", "", "A groove depth D3aat the crown raised portion24can be, for example, equal to a groove depth D3bat the middle raised portion26. Thus, slipping of the crown block17and slipping of the middle block18can be inhibited in a well-balanced manner. That the groove depth D3a and the groove depth D3bcan be equal to each other can mean that an absolute value of a difference between the groove depth D3aand the groove depth D3bis 0 mm, and also can mean that the absolute value of the difference is 2 mm or less, in the description herein.", "", "In order to effectively exhibit the above-described effects, a maximum groove depth (groove depth at the crown deep bottom portion25) D4aof the crown lateral groove14can be more preferably equal to a maximum groove depth (groove depth at the middle deep bottom portion27) D4bof the middle lateral groove15. That the maximum groove depth D4a and the maximum groove depth D4bcan be equal to each other can mean that an absolute value of a difference between the maximum groove depth D4a and the maximum groove depth D4bcan be 0 mm, and also can mean that the absolute value of the difference can be 2 mm or less, in the description herein.", "", "A difference (D5a-D3a) between the maximum depth D5aof the crown sipe21and the groove depth D3aof the crown raised portion24can be, for example, less than a difference (D5b-D3b) between the maximum depth D5bof the middle sipe22and the groove depth D3b of the middle raised portion26. Thus, stiffness, in the tire circumferential direction, of the crown block17on which a high ground contact pressure acts can be maintained high, and slipping in the tire circumferential direction can be greatly reduced. If the difference (D5a-D3a) is excessively less than the difference (D5b-D3b), balance in stiffness between the crown block17and the middle block18may be degraded, and uneven wear resistance may be reduced. From such a viewpoint, the difference (D5a-D3a) can be preferably greater than or equal to 0.25 times the difference (D5b-D3b) and more preferably greater than or equal to 0.3 times the difference (D5b-D3b), and preferably less than or equal to 0.45 times the difference (D5b-D3b) and more preferably less than or equal to 0.4 times the difference (D5b-D3b).", "", "Although one embodiment of the present disclosure has been described above in detail, the present disclosure is not limited to the above-described specific embodiment, and various modifications can be made to implement the technique of the present disclosure."], "claims": ["a tread portion, wherein the tread portion includes: a plurality of circumferential grooves zigzagging in a tire circumferential direction so as to form zigzag vertexes, a plurality of lateral grooves connecting between the zigzag vertexes of the circumferential grooves adjacent to each other in a tire axial direction, and a plurality of hexagonal blocks formed by the circumferential grooves adjacent to each other in the tire axial direction and the plurality of lateral grooves, wherein the plurality of circumferential grooves each have a groove depth of 21 mm or more, wherein each of the plurality of hexagonal blocks comprises a three-dimensional sipe zigzagging in the tire axial direction and a tire radial direction and extending across the corresponding hexagonal block, and wherein each of the plurality of lateral grooves comprises a raised portion formed by raising a groove bottom of the corresponding lateral groove to connect between the hexagonal blocks adjacent to each other in the tire circumferential direction.", "2 . The heavy duty tire according to claim 1 , wherein, in each of the plurality of lateral grooves, a length of the raised portion in the tire axial direction is less than a length of the lateral groove in the tire axial direction.", "3 . The heavy duty tire according to claim 2 , wherein, in each of the plurality of lateral grooves, the length of the raised portion in the tire axial direction is 0.4 to 0.6 times the length of the lateral groove in the tire axial direction.", "4 . The heavy duty tire according to claim 1 , wherein, in each of the plurality of lateral grooves, a groove depth at the raised portion is 0.5 to 0.8 times a groove depth of each circumferential groove to which the lateral groove is connected.", "5 . The heavy duty tire according to claim 1 , wherein a depth of each three-dimensional sipe is 0.5 to 0.8 times a groove depth of each circumferential groove to which the three-dimensional sipe is connected.", "wherein each of the plurality of lateral grooves comprises a pair of groove walls, and a pair of groove edges located at positions at which the pair of groove walls and a tread surface of the hexagonal blocks intersect each other, and wherein each of the pair of groove walls is inclined at an angle from 3° to 8° relative to a normal line passing through a corresponding one of the pair of groove edges so as to be normal to the tread surface.", "7 . The heavy duty tire according to claim 1 , wherein each of the plurality of lateral grooves has a groove width of 7 to 9 mm.", "8 . The heavy duty tire according to claim 1 , wherein, in a pair of the lateral groove and the hexagonal block which are adjacent to each other in the tire circumferential direction, a groove depth at the raised portion formed in the lateral groove is less than a depth of the three-dimensional sipe formed in the hexagonal block.", "wherein the plurality of circumferential grooves comprises a pair of crown circumferential grooves, and a pair of shoulder circumferential grooves disposed outwardly of the pair of crown circumferential grooves in the tire axial direction, wherein the plurality of lateral grooves comprises a plurality of crown lateral grooves connecting between the pair of crown circumferential grooves, and a plurality of middle lateral grooves each connecting between the crown circumferential groove and the shoulder circumferential groove which are adjacent to each other in the tire axial direction, wherein the raised portion comprises a crown raised portion and a middle raised portion formed in each crown lateral groove and each middle lateral groove, respectively, and wherein a groove depth at the crown raised portion is equal to a groove depth at the middle raised portion.", "10 . The heavy duty tire according to claim 9 , wherein a maximum groove depth of the crown lateral groove is equal to a maximum groove depth of the middle lateral groove.", "wherein the hexagonal blocks comprise a plurality of crown blocks formed between the pair of crown circumferential grooves, and a plurality of middle blocks formed between the crown circumferential groove and the shoulder circumferential groove which are adjacent to each other in the tire axial direction, wherein the three-dimensional sipes comprise a crown sipe disposed in each of the plurality of crown blocks, and a middle sipe disposed in each of the plurality of middle blocks, and wherein a maximum depth of the middle sipe is greater than a maximum depth of the crown sipe.", "12 . The heavy duty tire according to claim 1 , wherein each of the lateral grooves extends from one of the circumferential grooves to another of the circumferential grooves.", "wherein the lateral grooves are linear and extend at first acute angle relative to the tire axial direction, and wherein the three-dimensional sipes extend at a second acute angle relative to the tire axial direction.", "14 . The heavy duty tire according to claim 1 , wherein, for each of the hexagonal blocks, a maximum width in the tire axial direction is less than a maximum length in the tire circumferential direction.", "15 . The heavy duty tire according to claim 14 , wherein a ratio of the maximum width to the maximum length is from 0 . 75 to 0 . 90 inclusive.", "wherein the plurality of circumferential grooves include a plurality of shoulder circumferential grooves and a plurality of crown circumferential grooves, and wherein a first maximum width of the shoulder circumferential grooves is greater than a second maximum width of the crown circumferential grooves.", "a tread portion, wherein the tread portion includes: a plurality of circumferential grooves zigzagging in a tire circumferential direction so as to form zigzag vertexes, a plurality of lateral grooves connecting between the zigzag vertexes of the circumferential grooves adjacent to each other in a tire axial direction, and a plurality of hexagonal blocks formed by the circumferential grooves adjacent to each other in the tire axial direction and the plurality of lateral grooves, wherein the plurality of circumferential grooves each have a groove depth of 21 mm or more, wherein each of the plurality of hexagonal blocks comprises a three-dimensional sipe zigzagging in the tire axial direction and a tire radial direction and extending across the corresponding hexagonal block, wherein each of the plurality of lateral grooves comprises a raised portion formed by raising a groove bottom of the corresponding lateral groove to connect between the hexagonal blocks adjacent to each other in the tire circumferential direction, wherein, in each of the plurality of lateral grooves, a length of the raised portion in the tire axial direction is less than a length of the lateral groove in the tire axial direction, wherein, in each of the plurality of lateral grooves, the length of the raised portion in the tire axial direction is 0.4 to 0.6 times the length of the lateral groove in the tire axial direction, wherein, in each of the plurality of lateral grooves, a groove depth at the raised portion is 0.5 to 0.8 times a groove depth of each circumferential groove to which the lateral groove is connected, wherein a depth of each three-dimensional sipe is 0.5 to 0.8 times a groove depth of each circumferential groove to which the three-dimensional sipe is connected, wherein each of the plurality of lateral grooves comprises a pair of groove walls, and a pair of groove edges located at positions at which the pair of groove walls and a tread surface of the hexagonal blocks intersect each other, wherein each of the pair of groove walls is inclined at an angle from 3° to 8° relative to a normal line passing through a corresponding one of the pair of groove edges so as to be normal to the tread surface, and wherein each of the plurality of lateral grooves has a groove width of 7 to 9 mm.", "wherein the lateral grooves are linear and extend at first acute angle relative to the tire axial direction, and wherein the three-dimensional sipes extend at a second acute angle relative to the tire axial direction", "wherein, for each of the hexagonal blocks, a maximum width in the tire axial direction is less than a maximum length in the tire circumferential direction, and wherein a ratio of the maximum width to the maximum length is from 0.75 to 0.90 inclusive.", "wherein the plurality of circumferential grooves include a plurality of shoulder circumferential grooves and a plurality of crown circumferential grooves, and wherein a first maximum width of the shoulder circumferential grooves is greater than a second maximum width of the crown circumferential grooves."], "bibtex": "@patent{20240100887,\n    title = {HEAVY DUTY TIRE},\n    number = {20240100887},\n    year = {2024},\n    note = {File: US20240100887A1-20240328.XML}\n    }", "classification": "B60C1113FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240100888", "filename": "US20240100888A1-20240328.XML", "abstract": "A pneumatic tire can include a pair of sidewall portions, where an outer surface of the sidewall portion can include a marking portion. The marking portion can include a first region forming a mark, a second region that is a background portion of the mark, and a fringing portion that demarcates the first region from the second region and fringes the contour of the mark. The first region can be formed as a smooth surface. The second region can be a projection-recess region where a plurality of micro projections are arranged. The fringing portion can be a rib projecting from the first region.", "detailed_description": ["The present disclosure and one or more embodiments thereof have been made in view of the above circumstances in the Background section, and an object of one or more embodiments of the present disclosure, among one or more objects, can be to provide a pneumatic tire having improved appearance of a marking portion on a sidewall portion.", "", "As a result of adopting configurations according to one or more embodiments of the present disclosure, the pneumatic tire can improve the appearance of the marking portion of the sidewall portion.", "", "Hereinafter, one embodiment of the present disclosure will be described with reference to the drawings.FIG.1is an enlarged perspective view of a sidewall portion3of one embodiment of a pneumatic tire1(hereinafter, also referred to simply as “tire1”) according to one or more embodiments of the present disclosure. The tire1can have a pair of sidewall portions3, whereFIG.1shows a part of an outer surface of one of the sidewall portions3. As shown inFIG.1, the tire1can be, for example, a pneumatic tire for a passenger car. Embodiments of present disclosure, however, may be applied to or implemented in or as a motorcycle tire or a heavy-duty tire, for example.", "", "In the description herein, unless otherwise specified, dimensions of components of the tire1are measured in the standardized state. The “standardized state” can represent a state in which a tire is fitted on a standardized rim and is inflated to a standardized internal pressure and no load is applied to the tire when the tire is a pneumatic tire for which various standards are defined. For tires for which various standards are not defined, the standardized state can represent a standard use state, corresponding to a purpose of use of the tire, in which no load is applied to the tire.", "", "The “standardized rim” can represent a rim that is defined by a standard for each tire, in a standard system including the standard on which the tire is based, and can be, for example, “standard rim” in the JATMA standard, “Design Rim” in the TRA standard, or “Measuring Rim” in the ETRTO standard.", "", "The “standardized internal pressure” can represent an air pressure that is defined by a standard for each tire, in a standard system including the standard on which the tire is based, and can be “maximum air pressure” in the JATMA standard, the maximum value recited in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, or “INFLATION PRESSURE” in the ETRTO standard.", "", "As shown inFIG.1, the sidewall portion3can have a visible outer surface. The visible outer surface can be a surface that is visible from the outside when the tire1is used. At least one of the outer surfaces of the pair of sidewall portions3can be provided with at least one marking portion5. A mark10can be formed on the marking portion5. The mark10includes at least one character, at least one graphic, or at least one symbol. The mark10of the present embodiment includes “R”, “S”, and “F” as one example, but embodiments of the present disclosure are not limited thereto. According to one or more embodiments, a plurality of marks10can be implemented, for instance, the “R”, “S”, and “F” shown inFIG.1.", "", "FIG.2is an enlarged view of the marking portion5inFIG.1. As shown inFIG.2, the marking portion5can includes a first region11forming the mark10, a second region12that is a background portion of the mark10, and a fringing portion15that demarcates the first region11from the second region12and fringes or outlines the contour of the mark10. InFIG.2, the first region11is shown as a blank region, and the second region12is dotted. The fringing portion15is shown by thin double lines.", "", "FIG.3is an enlarged perspective view of a region A inFIG.2. As shown inFIG.3, the first region11can be formed as a smooth surface. On the other hand, the second region12can be a projection-recess region where a plurality of micro projections13are arranged. The smooth surface of the first region11can mean an even surface enabling a sufficient contrast to be imparted with respect to the second region12described below. In a preferable aspect, the first region11can have an arithmetic mean roughness Ra of not greater than 50 μm, for example.", "", "The fringing portion15according to one or more embodiments of the present disclosure can be a rib16projecting from the first region11. The “rib” can be a protrusion projecting with respect to the first region11, and can means one that continuously extends along the contour of the mark10to have a longitudinal direction. Owing to the above-described configuration, embodiments of the present disclosure can improve the appearance of the marking portion5(shown inFIG.1) of the sidewall portion3. A reason for this can be as follows.", "", "As shown inFIG.2andFIG.3, according to one or more embodiments of the present disclosure, the first region11can be a smooth surface, for instance, so that more light can be reflected to cause the first region11to look pale, but the plurality of micro projections13(e.g., as shown inFIG.3) can inhibit reflection of light on the second region12, for instance, to cause the second region12to look darker. Accordingly, the contrast between the first region11and the second region12can be increased, which can improve the visibility and the appearance of the mark10. In addition to this, according to one or more embodiments of the present disclosure, the fringing portion15can be a rib projecting form the first region11, and thus can prevent the contour of the mark10from forming an irregular wavy line, which can improve the appearance of the marking portion5.", "", "In a conventional art, to prevent the contour of a mark from forming an irregular wavy line, a plurality of micro projections may be arranged at equal intervals along the contour of a first region. However, in such a method, an arrangement of the micro projections may need to be determined for each mark, which may increase cost in design or processing of a vulcanization mold for a tire. In addition, the above method, when the above method is performed on a mark including a curved line, a region where arrangement pitches of the micro projections are narrow and a region where arrangement pitches of the micro projections are wide may be generated, and thus the appearance may tend to deteriorate. According to one or more embodiments of the present disclosure, the above-described fringing portion15can be disposed, for instance, so that such a defect in the conventional art can be avoided.", "", "Hereinafter, more detailed configurations of the present embodiment will be described. The configurations described below show a specific aspect of the present embodiment. Therefore, it is needless to say that one or more embodiments of the present disclosure can achieve the above-described effect even when the configurations described below are not provided. In addition, even when any one of the configurations described below is independently applied to the tire1according to one or more embodiments of the present disclosure having the above-described characteristics, performance improvement corresponding to each configuration can be expected. Furthermore, when some of the configurations described below are applied in combination, complex performance improvement corresponding to each configuration can be expected.", "", "FIG.4is a sectional view of the marking portion5.FIG.4corresponds to a sectional view taken along a B-B line inFIG.2. As shown inFIG.4, the marking portion5can be preferably recessed with respect to a reference surface3sof the outer surface of the sidewall portion3(shown inFIG.1), for example. Accordingly, the appearance of the mark10(shown inFIG.1) can be improved, and a rubber volume of the sidewall portion3can be inhibited from increasing. However, one or more embodiments of the present disclosure are not limited thereto.", "", "From the viewpoint of ensuring the durability of the sidewall portion3, a recessed amount dl of the marking portion5with respect to the reference surface3scan be preferably not larger than 1.5 mm.", "", "FIG.5is an enlarged plan view of a part of the second region12. As shown inFIG.5, the second region12can preferably include a portion where the plurality of micro projections13are arranged so as to form closest packing in a planar view. Accordingly, the amount of light reflected on the second region12can be further decreased, the contrast with the first region11can be increased, and thus the appearance of the marking portion5can be improved.", "", "The above-described “closest packing” can at least mean that the micro projections13are densely arranged in a state in which another micro projection13cannot be additionally arranged, for instance, because the contours of the adjacent micro projections13are in contact with each other. In the present embodiment, the contour of each micro projection13can have a circular shape having a first maximum outer diameter D1, and the micro projections13can be arranged so as to form closest packing. Accordingly, in a planar view of the second region12, a virtual triangle18with centers13cof the contours of three micro projections13adjacent to each other, as apexes, can be an equilateral triangle. However, the arrangement of the micro projections13in the second region12of one or more embodiments of the present disclosure are not limited thereto.", "", "In the second region12, according to one or more embodiments of the present disclosure, less than five micro projections13can be arranged per mm2, and preferably one to four micro projections13can be arranged. Accordingly, the appearance of the marking portion5can be further improved.", "", "As shown inFIG.3andFIG.4, each micro projection13can be formed as a truncated cone in which an upper surface13a(shown inFIG.4) is composed of a curved surface. However, the micro projection13according to one or more embodiments of the present disclosure are not limited thereto, and various forms such as a cone shape and a cylinder shape can be used. In another embodiment, in the upper surface13aof the micro projection13, a local recess may be provided. Such micro projections13can further inhibit the reflection of light on the second region12.", "", "As shown inFIG.4, the first maximum outer diameter D1of each micro projection13can be, for example, 0.3 to 1.0 mm, and preferably 0.5 to 0.7 mm. A maximum height h1of the micro projection13with respect to the first region11can be preferably smaller than the recessed amount dl of the marking portion5. Specifically, the height h1is 0.3 to 1.0 mm, and preferably 0.4 to 0.8 mm. However, the micro projection13according to one or more embodiments of the present disclosure is not limited thereto.", "", "The shape of a transverse cross-section of the rib16formed as the fringing portion15can be, for example, a trapezoidal shape. However, the shape of the transverse cross-section is not limited thereto, and may be a triangular shape or a semi-circular shape, as other examples. In addition, the rib16can have a maximum rib width W1orthogonal to the longitudinal direction thereof. The rib width W1can be preferably larger than ½ of the first maximum outer diameter D1of the micro projection13. Accordingly, the rib16can be easily visually recognized, and the appearance of the mark10can be further improved. On the other hand, when the rib width W1is excessively large, the contour of the mark10may be unclear. Accordingly, the rib width W1can be preferably smaller than the first maximum outer diameter D1, and specifically not larger than 70% of the first maximum outer diameter D1.", "", "From the same viewpoint, a maximum height h2of the rib16with respect to the first region11can be preferably not smaller than 10% of the maximum height hl of the plurality of micro projections13with respect to the first region11, preferably not larger than 80% thereof, and more preferably not larger than 50% thereof.", "", "From the viewpoint of clarifying the contour of the mark10, preferably, the plurality of micro projections13adjacent to the rib16can be orderly arranged along the longitudinal direction of the rib16. However, depending on the shape of the mark10, when such an arrangement is maintained, cost in design or processing of a vulcanization mold for a tire may be increased. From the viewpoint of reducing the cost, the plurality of micro projections13may include a micro projection13that is not directly connected to the rib16, or a micro projection13that is partially connected to the rib16.", "", "FIG.6is an enlarged perspective view conceptually showing the positional relationship between the rib16and the plurality of micro projections13. InFIG.6, for easy understanding of the positional relationship, only one rib16and three micro projections13are shown, but it is needless to say that many more micro projections13can actually be arranged so as to be adjacent to the rib16. InFIG.6, the outer face of each micro projection13is dotted.", "", "As shown inFIG.6, the plurality of micro projections13may include first projections21that are not directly connected to the rib16and second projections22that are partially connected to the rib16. On the other hand, the rib16can include a first side surface26on the first region11side, a second side surface27on the second region12side, and a top face28between the first side surface26and the second side surface27. The first projection21may not be connected to any of the surfaces of the rib16. However, the smaller a gap29between the rib16and the first projection21may be, the larger the contrast between the rib16and the second region12may be. From this viewpoint, the length of the gap29(minimum length between the first projection21and the rib16at the root) can be preferably smaller than a minimum width of the top face28of the rib16.", "", "Meanwhile, each second projection22can be connected only to the second side surface27of the rib16, or to both the second side surface27and the top face28. Preferably, the second projection22can be, at least, not connected to the first side surface26. Accordingly, the first side surface26can be clearly observed as a contour line of the mark10, an increase in cost in design or processing of a vulcanization mold for a tire can be avoided, and the appearance of the mark10(shown inFIG.1) can also be improved.", "", "Embodiments of present are not limited to the above specific embodiments, and various modifications can be made."], "claims": ["a pair of sidewall portions, wherein at least one of outer surfaces of the pair of sidewall portions includes at least one marking portion, the marking portion includes: a first region forming a mark including at least one character, at least one graphic, or at least one symbol, a second region that is a background portion of the mark, and a fringing portion that demarcates the first region from the second region and fringes a contour of the mark, the first region is formed as a smooth surface, the second region is a projection-recess region where a plurality of micro projections are arranged, and the fringing portion is a rib projecting from the first region.", "2 . The pneumatic tire according to claim 1 , wherein the marking portion is recessed with respect to a reference surface of the outer surface of the sidewall portion.", "3 . The pneumatic tire according to claim 2 , wherein a recessed amount of the marking portion with respect to the reference surface is not larger than 1.5 mm.", "4 . The pneumatic tire according to claim 1 , wherein one to four micro projections are arranged per mm 2 in the second region.", "5 . The pneumatic tire according to claim 1 , wherein the second region includes a portion where the plurality of micro projections are arranged so as to form closest packing in a planar view.", "each of the plurality of micro projections has a first maximum outer diameter in a planar view, the rib has a maximum rib width orthogonal to a longitudinal direction thereof, and the rib width is larger than ½ of the first maximum outer diameter.", "7 . The pneumatic tire according to claim 6 , wherein the maximum rib width is smaller than the first maximum outer diameter.", "8 . The pneumatic tire according to claim 1 , wherein a maximum height of the rib with respect to the first region is 10% to 80% of a maximum height of the plurality of micro projections with respect to the first region.", "9 . The pneumatic tire according to claim 1 , wherein the plurality of micro projections include a first projection that is not directly connected to the rib and a second projection that is partially connected to the rib.", "the rib includes: a first side surface on the first region side, a second side surface on the second region side, and a top face between the first side surface and the second side surface, and the second projection is connected only to the second side surface of the rib, or to both the second side surface and the top face.", "11 . The pneumatic tire according to claim 10 , wherein the second projection is not connected to the first side surface.", "a reference surface is at a first height, tips of the plurality of micro projections are at a second height below the first height, an upper surface of the rib of the first region is at a third height below the second height, and an upper surface of the first region is at a fourth height below the third height.", "13 . The pneumatic tire according to claim 1 , wherein a base of at least one of the micro projections is spaced apart from the rib of the first region.", "14 . The pneumatic tire according to claim 1 , wherein a first base of a first one of the micro projections is spaced apart from a second base of a second one of the micro projections, the first and second micro projections being adjacent to each other in the second region.", "a pair of sidewall portions, wherein at least one of outer surfaces of the pair of sidewall portions includes at least one marking portion, the marking portion includes: a first region forming a mark, a second region that is a background portion of the mark, and a fringing portion that demarcates the first region from the second region and fringes a contour of the mark, the first region is formed as a smooth surface, the second region is a projection-recess region where a plurality of micro projections are arranged, the fringing portion is a rib projecting from the first region, a reference surface is at a first height, tips of the plurality of micro projections are at a second height below the first height, an upper surface of the rib of the first region is at a third height below the second height, an upper surface of the first region is at a fourth height below the third height, each micro projection is adjacent to at least two other micro projections of the plurality of micro projections.", "16 . The tire according to claim 15 , wherein a base of at least one of the micro projections is spaced apart from the rib of the first region.", "17 . The tire according to claim 15 , wherein each said micro projection touches said at least two other micro projections of the plurality of micro projections.", "18 . The tire according to claim 15 , wherein a first base of a first one of the micro projections is spaced apart from a second base of a second one of the micro projections, the first and second micro projections being adjacent to each other in the second region.", "one to four micro projections are arranged per mm the plurality of micro projections includes a first projection that is not directly connected to the rib and a second projection that is partially connected to the rib.", "the rib has a maximum width less than a maximum diameter of each of the micro projections, and the rib has a length greater than the maximum diameter of each of the micro projections."], "bibtex": "@patent{20240100888,\n    title = {PNEUMATIC TIRE},\n    number = {20240100888},\n    year = {2024},\n    note = {File: US20240100888A1-20240328.XML}\n    }", "classification": "B60C1300FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240100889", "filename": "US20240100889A1-20240328.XML", "abstract": "The present invention discloses a pneumatic tire. The pneumatic tire includes a bead portion and a rim flange provided outside the bead portion. The rim flange is made of a rubber resistant to ozone and fatigue and a hardness reinforcing rubber portion is interposed between the rim flange and the bead portion. The pneumatic tire of the present invention avoids a change in the physical properties of the flange rubber, ozone cracks caused by ozone present in the air, and fatigue cracks caused by frequent flexion and extension to achieve improved handling stability and straight ahead ability.", "detailed_description": [""], "claims": ["1 . A pneumatic tire comprising a bead portion and a rim flange provided outside the bead portion wherein the rim flange is made of a blend comprising polybutadiene rubber and natural rubber and a hardness reinforcing rubber portion is interposed between the rim flange and the bead portion.", "2 . The pneumatic tire according to claim 1 , wherein the hardness of the hardness reinforcing rubber portion is higher than that of the rim flange.", "3 . The pneumatic tire according to claim 1 , wherein the width of the hardness reinforcing rubber portion in contact with a body ply surrounding the bead portion is at least 5 mm at the end of an apex of the bead portion.", "4 . The pneumatic tire according to claim 1 , wherein the ratio of the distance to the end of the hardness reinforcing rubber portion in contact with a body ply to the distance to the end of the rim flange in contact with the body ply is at least 0.75."], "bibtex": "@patent{20240100889,\n    title = {PNEUMATIC TIRE},\n    number = {20240100889},\n    year = {2024},\n    note = {File: US20240100889A1-20240328.XML}\n    }", "classification": "B60C1502FI"}]