[{"title": "WHEEL STRUCTURE AND METHOD OF CONTROLLING WHEEL STRUCTURE", "doc_number": "20240109365", "filename": "US20240109365A1-20240404.XML", "abstract": "Disclosed is a wheel structure including a first hub member, a plurality of spokes that are provided in a circumferential direction (C 1 ) of the first hub member, protrude outward from the first hub member in an outward direction (R 1 ) intersecting the circumferential direction (C 1 ), and have sides coupled to the first hub member, guide parts to which the plurality of spokes are slidably coupled, and a second hub member to which sides of the guide parts are rotatably coupled, wherein the plurality of spokes include a rotation spoke rotatably coupled to the first hub member.", "detailed_description": ["To compensate for the disadvantages of foot-type robots and of the wheel-type robots, robots may be developed in which the advantages of the two types of robots are combined. For example, i) a wheel may be attached to a leg-shaped structure provided in the foot-type robot, or ii) a shape of the wheel provided in the wheel-type robot may be made changeable, so as to overcoming obstacles such as stairs.", "", "In the case of i) the size of the wheel attached to the leg-shaped structure may be limited, a load may be applied to a joint region formed in a leg-shaped structure due to the wheel, and thus a durability of the robot may be adversely affected. In the case of ii) the shape of the wheel may temporarily deform, e.g., in response to and/or to accommodate the shapes of obstacles, such as stairs, but may not be able to change sufficiently and/or may have further difficulty allowing the robot to traverse relatively high obstacles.", "", "Hereinafter, a wheel structure and a method of controlling the wheel structure according to the present disclosure will be described with reference to the accompanying drawings.", "", "The wheel structure according to the present disclosure has a wheel structure configured to drive on a substantially flat surface, such as the ground and configured to traverse non-flat surfaces or structures, such as stairs and/or rough and/or irregular terrain, by changing a shape according to a state (e.g., shape) of the non-flat surface and/or by performing a walking-type movement (e.g., a movement that mimics human walking).", "", "FIG.1is a perspective view illustrating a wheel structure according to an example of the present disclosure when viewed in a first direction, andFIG.2is a perspective view illustrating the wheel structure according to the example of the present disclosure when viewed in a second direction.FIG.3is a perspective view illustrating a coupling structure between a first hub member, a spoke, and a link part provided in the wheel structure according to the example of the present disclosure, andFIG.4is a front view illustrating the coupling structure between the first hub member, the spoke, and the link part provided in the wheel structure according to the example of the present disclosure.FIG.5is a perspective view illustrating a coupling structure between a guide part and a second hub member provided in the wheel structure according to the example of the present disclosure, andFIG.6is a front view illustrating the coupling structure between the guide part and the second hub member provided in the wheel structure according to the example of the present disclosure.FIG.7is an enlarged perspective view illustrating the link part provided in the wheel structure according to the example of the present disclosure.", "", "Referring toFIG.1, a wheel structure10according to the present disclosure may include a first hub member100(e.g., a hub), and a plurality of spokes200provided in a circumferential direction C1of the first hub member100. The plurality of spokes200may protrude outward from the first hub member100in an outward direction R1intersecting the circumferential direction C1of the first hub member100. One side of each of the plurality of spokes may be coupled to the first hub member100. Although 18 spokes200spaced at regular intervals in the circumferential direction C1are illustrated inFIGS.1to4, the number and arrangement of spokes200are not limited to the example of the drawings. The first hub member100may have a disk shape or a ring shape in which a hole is formed in a center thereof. In this case, the outward direction R1of the first hub member100may be a radial direction of the first hub member100.", "", "Referring toFIGS.1,2,5, and6, the wheel structure10may further include guide parts300to which the plurality of spokes200may be slidably coupled. The plurality of spokes200may be inserted into the guide parts300, and the spokes200may be able to slide relative to the guide parts300. In this case, the number of guide parts300may correspond to the number of spokes200. That is, the plurality of guide parts300may be provided to be coupled to the plurality of spokes200, respectively. For example, as illustrated inFIGS.1to6, when 18 spokes200are provided, 18 guide parts300are also provided, and the spokes200may be coupled to the guide parts300, respectively.", "", "Further, the wheel structure10may include a second hub member400(e.g., a hub) to which one side of each of the guide parts300may be rotatably coupled. In more detail, the plurality of guide parts300may be rotatably coupled to the second hub member400. That is, the wheel structure10according to the present disclosure may be understood to have a structure in which a region in which the first hub member100and the spokes200are assembled and a region in which the second hub member400and the guide parts300are assembled may move relative to each other. Meanwhile, similar to the first hub member100, the second hub member400may also have a disk shape and/or a ring shape in which a hole is formed in a center thereof.", "", "Similar to the spokes200, the plurality of guide parts300may be provided in a circumferential direction C2of the second hub member400. The plurality of guide parts300may protrude outward from the second hub member400in an outward direction R2intersecting the circumferential direction C2. The plurality of guide parts300may have sides rotatably coupled to the second hub member400. In a case that the second hub member400is a disk shape or a ring shape, the outward direction R2of the second hub member400may be a radial direction of the second hub member400.", "", "The guide parts300may be divided into a plurality of regions. As illustrated inFIGS.2,5, and6, each of the guide parts300may include an insertion member310(e.g., a cylinder member310) into which the spoke200may be inserted and which may form a through-hole for guiding movement of the spoke200. Each of the guide parts300may also include a connection member320having one side coupled (e.g., fixedly) to the insertion member310and the other side coupled (e.g., rotatably) to the second hub member400.FIGS.5and6illustrate the insertion member310and the connection member320are separate members coupled to each other. The insertion member310and the connection member320may also, or alternatively, be integrally formed (e.g., as a single structure).", "", "Further, the connection member320may be comprise a plurality of regions. The connection member320may include a covering region322, which may include a region through which the insertion member310is configured to be inserted. The covering region322may be coupled (e.g., fixedly) to the insertion member310, when inserted therein, and an extension region324extending from the covering region322toward the second hub member400and having one side rotatably coupled to the second hub member400. In an example, the covering region322and the extension region324may be integrally formed. As illustrated inFIGS.5and6, the extension region324may have a shape bent in the outward direction R2from the covering region322.", "", "As indicated inFIG.3-4, for example, one or more of the plurality of spokes200may be rotatably coupled to the first hub member100, and the other(s) thereof may be fixedly coupled to the first hub member100in a non-rotatable manner. In more detail, the plurality of spokes200may include one or more rotation spokes210rotatably coupled to the first hub member100and one or more fixed spokes220fixedly coupled to the first hub member100. As an example, a plurality of the rotation spokes210may be provided and one fixed spoke220may be provided. For example,FIGS.3and4illustrate a state in which 17 spokes200among the 18 spokes200are provided as the rotation spokes210and one spoke200is provided as the fixed spoke220. InFIGS.3and4, the rotation spokes210and the fixed spoke220are distinguished through shading.", "", "The first hub member100and the second hub member400may be configured to be driven to move relative to each other. Thus, if some of the plurality of spokes200are provided as the rotation spokes210, when the first hub member100and the second hub member400move relative to each other, the rotation spokes210rotate may relative to the first hub member100, and thus an interval between adjacent two spokes may change.", "", "Meanwhile, the second hub member400may rotate by a wheel driving motor, and accordingly, the wheel structure10may drive on the ground. In this case, when some (that is, the fixed spoke) of the plurality of spokes200are fixedly coupled to the first hub member100, a rotational force of the second hub member400may be transferred to the first hub member100via the guide part300and the fixed spoke220. Thus, the first hub member100may also rotate in conjunction with the rotation of the second hub member400.", "", "According to the present disclosure, a plane in which the plurality of spokes200are rotatably coupled to the first hub member100(e.g., a plane comprising R1and C1) and a plane in which the plurality of guide parts300are rotatably coupled to the second hub member400(e.g., a plane comprising R2and C2) may be formed parallel to each other. A first rotary central shaft may be formed in a region in which the plurality of spokes200rotate relative to the first hub member100and a second rotary central shaft may be provided in a region in which the plurality of guide parts300rotate relative to the second hub member400. The first rotary central shaft and the second rotary central shaft may be formed parallel to each other. Thus, the first hub member100and the second hub member400may be parallel to each other. In the above description, even when a shape of the wheel structure10is deformed and/or changed according to a relative movement between the first hub member100and the second hub member400, a rotational movement between the first hub member100and the rotation spoke210, a rotational movement between the guide part300and the second hub member400, and a sliding movement between the spoke200and the guide part300may be smoothly performed.", "", "Further, as illustrated inFIGS.3and4, the regions in which the plurality of spokes200are coupled to the first hub member100may be provided on a virtual first circle A1, and as illustrated inFIGS.5and6, the regions in which the plurality of guide parts300are coupled to the second hub member400may be provided on a virtual second circle A2. A size of the second circle A2may be greater than a size of the first circle A1. It may be understood that the regions in which the plurality of guide parts300are coupled to the second hub member400is provided to surround the regions in which the plurality of spokes200are coupled to the first hub member100from the outside. To achieve the above features, as illustrated in the drawings, an outer diameter of the second hub member400may be greater than an outer diameter of the first hub member100.FIGS.1and2illustrate a state in which the first hub member100is provided in a through-hole region formed in the second hub member400having a ring shape when the wheel structure10is viewed from one side of the wheel structure10in a width direction W.", "", "Referring toFIGS.1to4and7, the wheel structure10may further include a link part500having one side coupled to the first hub member100and configured to move the first hub member100relative to the second hub member400(e.g., move translationally). The link part500may be provided such that a shape thereof may be deformed. According to the shape deformation of the link part500, a relative movement between the first hub member100and the second hub member400may be performed. The other side of the link part500may be fixedly coupled to a frame part of a mobility device and/or vehicle in which the wheel structure10according to the present disclosure is provided.", "", "In more detail, the link part500may include a plurality of link members. That is, the link part500may further include a first link member510having one side coupled to the first hub member100(e.g., at and/or as part of the first central rotary shaft), and a second link member520having one side rotatably coupled to the first link member510and another side coupled to the second hub member400(e.g., at and/or as part of the second central rotary shaft). Thus, according to the present disclosure, an angle and/or position between the first link member510and the second link member520may be varied.", "", "The first link member510and the second link member520may be driven by a driving source provided in the link part500. That is, the link part500may further include a first posture control motor530that rotates the first link member510relative to the second link member520and a second posture control motor540that rotates the second link member520. That is, according to the present disclosure, the first link member510and the second link member520may rotate by driving the first posture control motor530and the second posture control motor540. Accordingly, the shape of the link part500may be changed. Accordingly, a relative position between the first hub member100and the second hub member400coupled to the link part500may be also changed. A rotary central shaft of the second link member520formed in a region in which the second link member520rotates by the second posture control motor540may be formed in parallel with a rotary central shaft formed in a region in which the plurality of spokes200rotate about the first hub member100and a rotary central shaft formed in a region in which the plurality of guide parts300rotate about the second hub member400. Also, a rotary central shaft of the first link member510formed in a region in which the first link member510is coupled to the second link member520may be formed in parallel with the rotary central shaft formed in a region in which the plurality of spokes200rotate about the first hub member100and the rotary central shaft formed in a region in which the plurality of guide parts300rotate about the second hub member400.", "", "Referring toFIGS.1and2, the link part500may be spaced apart from the first hub member100and the second hub member400in the width direction W of the wheel structure10. As an example, an interval between the link part500and the second hub member400in the width direction W may be smaller than an interval between the link part500and the first hub member100in the width direction W.", "", "The wheel structure10according to the present disclosure may further include a wheel drive motor configured to rotate the second hub member400. The wheel drive motor may rotate the second hub member400by being directly coupled to the second hub member400and/or may rotate the second hub member400through a medium member that transfers a rotational force of the wheel drive motor to the second hub member400. As an example, the medium member may be a gear member800coupled to the second hub member400and directly or indirectly engaged with the rotary shaft of the wheel drive motor or a belt member or chain member surrounding an outer circumference of the second hub member400and an outer circumference of the rotary shaft of the wheel drive motor and transferring the rotational force of the wheel drive motor toward the second hub member400. As illustrated inFIGS.5and6, the gear member800may be fixedly coupled to the second hub member400.", "", "Hereinafter, a method of controlling the wheel structure according to the present disclosure will be described with reference to the drawings and the above description of the wheel structure10.", "", "FIG.8is a view illustrating a state in which the wheel structure according to the present disclosure faces a stepped section protruding upward from the front side while driving on the ground, andFIG.9is a view illustrating a state in which a posture of the wheel structure ofFIG.8is changed by a posture control operation after a predetermined time has elapsed.FIG.10is a view illustrating a state in which the wheel structure ofFIG.9crosses the stepped section by a stepped section driving operation after a predetermined time has elapsed from the wheel structure.", "", "A method of controlling a wheel structure according to the present disclosure may include operations in which the wheel structure effectively traverses (as an example) a stepped section when the stepped section (for example, a step protruding upward) is present in front of a direction of motion of the wheel structure10during a driving process of the wheel structure10.", "", "As illustrated inFIGS.8to10, the method of controlling a wheel structure according to the present disclosure may include a stepped section reaching operation in which a front portion of the wheel structure10approaches and/or faces the stepped section, a posture control operation of moving the second hub member400with respect to the first hub member100in an upward direction, and a stepped section driving operation of allowing the second hub member400to rotate and traverse the stepped section, after the posture control operation is performed.", "", "The posture control operation may be an operation in which the second hub member400moves with respect to the first hub member100in the upward direction (e.g., away from a surface on which the wheel structure is positioned). A distance between a lower portion of the second hub member400and the first hub member100may be reduced as illustrated inFIG.9, and an interval between the spokes200traversing the guide parts300provided in a lower region of the second hub member400may increase due to a restraint relationship between the spoke200and the guide part300.", "", "Thus, according to the present disclosure, in the posture control operation, a circumferential interval between the spokes facing a region facing the ground among the plurality of spokes200increases, and thus the wheel structure may more easily traverse the stepped section. That is, when the second hub member400rotates in the stepped section driving operation after the interval between the spokes200facing the ground increases in the posture control operation, the spokes200provided in a relatively wide interval are supported by the ground, the wheel structure10may move forward, and thus the wheel structure may easily traverse the stepped section.", "", "The posture control operation may further include moving the second hub member400relative to the first hub member100in a rearward direction (e.g., relatively away from the stepped section, in the example ofFIG.11) as well as moving the second hub member400relative to the first hub member100in a relatively upward direction. This may allow the spoke200to protrude more forward from the second hub member400to easily traverse the stepped section in front of the wheel structure10. The posture control operation may be performed by controlling movement of the first link member510and/or the second link member520of the link part500. As an example, the posture control operation may include moving the first hub member100by rotating the first link member510relative to the second link member520.", "", "FIG.11is a view illustrating a state in which the first hub member100moves rearward by a rearward movement operation while simulating a walking motion by the wheel structure according to the present disclosure, andFIG.12is a view illustrating a state in which the first hub member100moves forward by a forward movement operation while simulating a walking motion by the wheel structure according to the present disclosure.", "", "Meanwhile, the wheel structure according to the present disclosure may implement a motion similar to a walking motion of a person. That is, the method of controlling a wheel structure10according to the present disclosure may include a rearward movement operation of moving the first hub member100relative to the second hub member400in a rearward direction, and a forward movement operation of moving the first hub member100relative to the second hub member400in a forward direction, after the rearward movement operation is performed.", "", "In this case, the rearward movement operation may include rotating the second hub member400in the forward direction (e.g., a clockwise direction with reference toFIG.11), and the forward movement operation may include rotating the second hub member400in the rearward direction (e.g., a counterclockwise direction with reference toFIG.12). A rotational speed of the second hub member400in the rearward movement operation may be higher than a rotational speed of the second hub member400in the forward movement operation so that the wheel structure10may move forward while the rearward movement operation and the forward movement operation are alternately performed.", "", "To simulate the walking motion of a person, the method of controlling a wheel structure according to the present disclosure may further include an upward movement operation of moving the second hub member400relative to the first hub member100in the upward direction before the rearward movement operation and the forward movement operation are performed. This may increase (e.g., maximize) the walking motion of the wheel structure10by increasing (e.g., maximizing) an interval between the spokes, of the plurality of spokes200, facing the ground. For example, the upward movement operation may correspond to increasing a stride length due to an increase in a length of the leg of a person.", "", "According to the present disclosure, a mobility device capable of fast driving on a flat ground and also walking-type motion for traversing an obstacle may comprise a wheel that may be used for a new type of mobility in which advantages of a foot-type robot and a wheel-type robot are combined can be provided.", "", "The present disclosure has been made to solve the above-mentioned problems and to achieve various advantages.", "", "An aspect of the present disclosure provides a mobility device (e.g., a robot and/or a vehicle) capable of fast driving on the flat ground and also walking exercise for traversing an obstacle may comprise a wheel that may be used for a new type of mobility in which advantages of a foot-type robot and a wheel-type robot may be combined.", "", "The technical problems to be solved by the present disclosure are not limited to the aforementioned problems, and any other technical problems not mentioned herein will be clearly understood from the following description by those skilled in the art to which the present disclosure pertains.", "", "According to an aspect of the present disclosure, there is provided a wheel structure including a first hub member, a plurality of spokes that are provided in a circumferential direction (C1) of the first hub member, protrude outward from the first hub member in an outward direction (R1) intersecting the circumferential direction (C1), and have sides coupled to the first hub member, guide parts to which the plurality of spokes are slidably coupled, and a second hub member to which sides of the guide parts are rotatably coupled, wherein the plurality of spokes include a rotation spoke rotatably coupled to the first hub member.", "", "The plurality of guide parts may be provided to be coupled to the plurality of spokes, respectively.", "", "The plurality of spokes may further include a fixed spoke fixedly coupled to the first hub member.", "", "The plurality of rotation spokes may be provided, and the one fixed spoke may be provided.", "", "The guide part may include an insertion member into which the spoke is inserted and which has a through-hole configured to guide movement of the spoke, and a connection member that has one side fixedly coupled to the insertion member and the other side rotatably coupled to the second hub member.", "", "The connection member may include a covering region which includes a region through which the insertion is inserted and is fixedly coupled to the insertion member, and an extension region extending from the covering region toward the second hub member and having one side rotatably coupled to the second hub member, and the extension region may have a shape bent from the covering region.", "", "A plane including regions in which the plurality of spokes are rotatably coupled to the first hub member and a plane including regions in which the plurality of guide parts are rotatably coupled to the second hub member may be formed parallel to each other.", "", "The first hub member and the second hub member may be provided parallel to each other.", "", "Regions in which the plurality of spokes are coupled to the first hub member may be provided on a virtual first circle (A1), and regions in which the plurality of guide parts are coupled to the second hub member may be provided on a virtual second circle shape (A2).", "", "A size of the second circle (A2) may be greater than a size of the first circle (A1).", "", "The first hub member and the second hub member may have a disk shape or a ring shape.", "", "An outer diameter of the second hub member may be greater than an outer diameter of the first hub member.", "", "The wheel structure may further include a link part having one side coupled to the first hub member and provided such that a shape thereof is deformed.", "", "The link part may include a first link member having one side coupled to the first hub member and a second link member having one side rotatably coupled to the first link member.", "", "The link part may further include a first posture control motor configured to rotate the first link member relative to the second link member, and a second posture control motor configured to rotate the second link member.", "", "The link part may be spaced apart from the first hub member and the second hub member in a width direction (W) of the wheel structure, and an interval between the link part and the second hub member in the width direction W is smaller than an interval between the link part and the first hub member in the width direction (W).", "", "According to another aspect of the present disclosure, there is provided a method of controlling the wheel structure, the method including a stepped section reaching operation of allowing a front portion of the wheel structure to face a stepped section protruding upward, a posture control operation of moving the second hub member with respect to the first hub member in an upward direction, and a stepped section driving operation of allowing the second hub member to rotate and cross the stepped section.", "", "The posture control operation may further include allowing the second hub member to move with respect to the first hub member in relatively rearward direction.", "", "According to still another aspect of the present disclosure, there is provided a method of controlling the wheel structure, the method including a rearward movement operation of moving the first hub member relative to the second hub member in a rearward direction, and a forward movement operation of moving the first hub member relative to the second hub member after the rearward movement operation, wherein the rearward movement operation further includes rotating the second hub member in a forward movement direction, and the forward movement operation further includes rotating the second hub member in a rearward movement direction.", "", "The method may further include an upward movement operation of moving the second hub member relative to the first hub member in an upward direction before the rearward movement operation and the forward movement operation are performed.", "", "As described above, although the present disclosure has been described with reference to the certain examples and drawings, the present disclosure is not limited thereto. Those skilled in the art to which the present disclosure belongs could derive various implementations, variations, and modifications from the described examples without departing from the technical spirit of the present disclosure and the equivalents of the appended claims."], "claims": ["a first hub; a plurality of spokes coupled to the first hub such that the plurality of spokes are provided along a circumferential direction of the first hub and protrude outward from the first hub; a plurality of guide parts to which the plurality of spokes are slidably coupled; and a second hub to which sides of the guide parts are rotatably coupled, wherein the plurality of spokes comprise a rotation spoke rotatably coupled to the first hub.", "2 . The wheel structure of claim 1 , wherein the plurality of guide parts are coupled to the plurality of spokes in a one-to-one fashion.", "3 . The wheel structure of claim 1 , wherein the plurality of spokes further comprise a fixed spoke fixedly coupled to the first hub.", "4 . The wheel structure of claim 3 , wherein the plurality of spokes comprise a plurality of rotation spokes.", "an insertion member that forms a through-hole into which a spoke of the plurality of spokes is inserted, wherein the through-hole is configured to guide movement of the spoke; and a connection member comprising one side fixedly coupled to the insertion member and another side rotatably coupled to the second hub.", "a covering region fixedly coupled to the insertion member and comprising a region through which the insertion member is inserted; and an extension region extending from the covering region toward the second hub and having one side rotatably coupled to the second hub, wherein the extension region has a shape bent from the covering region.", "7 . The wheel structure of claim 2 , wherein a plane comprising regions in which the plurality of spokes are rotatably coupled to the first hub is parallel to a plane comprising regions in which the plurality of guide parts are rotatably coupled to the second hub.", "8 . The wheel structure of claim 2 , wherein the first hub and the second hub are parallel to each other.", "9 . The wheel structure of claim 1 , wherein regions in which the plurality of spokes are coupled to the first hub are provided on a virtual first circle, and regions in which the plurality of guide parts are coupled to the second hub are provided on a virtual second circle.", "10 . The wheel structure of claim 9 , wherein a size of the virtual second circle is greater than a size of the virtual first circle.", "11 . The wheel structure of claim 1 , wherein the first hub and the second hub each independently have a disk shape or a ring shape.", "12 . The wheel structure of claim 11 , wherein an outer diameter of the second hub is greater than an outer diameter of the first hub.", "a link part having one side coupled to the first hub and configured to allow a shape of the wheel structure to be deformed.", "a first link having one side coupled to the first hub; and a second link having one side rotatably coupled to the first link.", "a first posture control motor configured to rotate the first link relative to the second link; and a second posture control motor configured to rotate the second link.", "wherein an interval between the link part and the second hub in the width direction is smaller than an interval between the link part and the first hub in the width direction.", "causing a front portion of a wheel structure to approach a stepped section protruding upward, wherein the wheel structure comprises: a first hub; a plurality of spokes coupled to the first hub such that the plurality of spokes are provided along a circumferential direction of the first hub and protrude outward from the first hub; a plurality of guide parts to which the plurality of spokes are slidably coupled; and a second hub to which sides of the guide parts are rotatably coupled, wherein the plurality of spokes comprise a rotation spoke rotatably coupled to the first hub; moving the second hub with respect to the first hub in an upward direction; and causing the second hub to rotate onto the stepped section.", "18 . The method of claim 17 , wherein the moving the second hub with respect to the second hub comprises moving the second hub with respect to the first hub in a rearward direction.", "a first hub, a plurality of spokes coupled to the first hub such that the plurality of spokes are provided along a circumferential direction of the first hub and protrude outward from the first hub, a plurality of guide parts to which the plurality of spokes are slidably coupled and a second hub to which sides of the guide parts are rotatably coupled, wherein the plurality of spokes comprise a rotation spoke rotatably coupled to the first hub, the method comprising: moving the first hub relative to the second hub in a rearward direction; rotating the second hub in a forward movement direction; and after the moving the first hub relative to the second hub in the rearward direction, moving the first hub relative to the second hub; and rotating the second hub in a rearward movement direction.", "moving the second hub relative to the first hub in an upward direction before the moving the first hub relative to the second hub in the rearward direction."], "bibtex": "@patent{20240109365,\n    title = {WHEEL STRUCTURE AND METHOD OF CONTROLLING WHEEL STRUCTURE},\n    number = {20240109365},\n    year = {2024},\n    note = {File: US20240109365A1-20240404.XML}\n    }", "classification": "B60B1900FI"}, {"title": "WHEEL UNIT", "doc_number": "20240109366", "filename": "US20240109366A1-20240404.XML", "abstract": "A wheel assembly includes a wheel portion and a pair of drive assemblies opposing each other with the wheel portion interposed therebetween. One of the pair of drive assemblies includes a first motor and a first deceleration assembly. The other of the pair of drive assemblies includes a second motor and a second deceleration assembly. The first deceleration assembly includes a first input shaft connected to the first output shaft. The first rotation axis and the second rotation axis are parallel to the rotation axis of the wheel portion and disposed outside the wheel portion in the radial direction of the wheel portion. The first output shaft, the first input shaft, the second output shaft, and the second input shaft extend in a direction away from the wheel portion in a direction along the rotation axis.", "detailed_description": ["Hereinafter, example embodiments of the present invention will be described with reference to the accompanying drawings. In the drawings, the same or corresponding parts are denoted by the same reference numerals, and the description will not be repeated. In the drawings, the X, Y, and Z axes of the three-dimensional orthogonal coordinate system are described as appropriate for ease of understanding.", "", "In this specification, a direction parallel to a rotation axis AX (for example,FIG.4) of a wheel assembly is described as an “axial direction AD”. That is, the direction along the rotation axis AX is described as the “axial direction AD”. The direction orthogonal to the rotation axis AX is described as a “radial direction RD”. The “radial direction RD” corresponds to an example of a “radial direction relative to the rotation axis”. The direction along an arc about the rotation axis AX is described as a “circumferential direction CD”. The “circumferential direction CD” corresponds to an example of a “circumferential direction around the rotation axis”. Note that a “parallel direction” includes a substantially parallel direction, and an “orthogonal direction” includes a substantially orthogonal direction. Further, “left and right” indicates left and right when the object is viewed from the radial direction RD.", "", "With reference toFIGS.1to12, a transport vehicle1and a wheel assembly DV according to an example embodiment of the present invention will be described. First, the transport vehicle1will be described with reference toFIGS.1and2.", "", "FIG.1is a perspective view illustrating the transport vehicle1.FIG.2is a side view illustrating the transport vehicle1.", "", "The transport vehicle1illustrated inFIGS.1and2travels on the floor surface or the ground surface. In the present example embodiment, the transport vehicle1is an automated guided vehicle (AGV).", "", "As illustrated inFIGS.1and2, the transport vehicle1has a vehicle body3. In the examples ofFIGS.1and2, the vehicle body3has a substantially rectangular parallelepiped shape. However, the shape of the vehicle body3is not particularly limited.", "", "The transport vehicle1further includes a plurality of wheel assemblies DV and a plurality of wheels7. In the present example embodiment, the transport vehicle1has a pair of wheel assemblies DV and four wheels7. The four wheels7are respectively disposed at four corners of a bottom portion3aof the vehicle body3. Each wheel7rotates with the movement of the vehicle body3. The pair of wheel assemblies DV rotate independently of each other to move the vehicle body3. The pair of wheel assemblies DV is disposed at the bottom portion3aof the vehicle body3such that the rotation axis AX of one wheel assembly DV of the pair of wheel assemblies DV and the rotation axis AX of the other wheel assembly DV are located on a straight line.", "", "The configurations of the pair of wheel assemblies DV are the same. Therefore, one wheel assembly DV of the pair of wheel assemblies DV will be described below.", "", "Next, the wheel assembly DV will be described with reference toFIGS.3and4.FIG.3is a perspective view showing the wheel assembly DV.FIG.4is a bottom view showing the wheel assembly DV. InFIG.4, the wheel assembly DV is viewed from the floor surface side or the ground surface side.", "", "As illustrated inFIGS.3and4, the wheel assembly DV includes a main wheel5and a pair of drive assemblies D. The main wheel5is an example of a “wheel portion”. One drive assembly of the pair of drive assemblies D is a first drive assembly DA. The other drive assembly of the pair of drive assemblies D is a second drive assembly DB. The pair of drive assemblies D supports the main wheels5from both sides on the rotation axis AX. In other words, the first drive assembly DA and the second drive assembly DB face each other with the main wheel5interposed therebetween.", "", "The first drive assembly DA and the second drive assembly DB drive the main wheel5. As a result, the main wheel5rotates about the rotation axis AX. Therefore, the rotation axis AX is also the rotation axis of the main wheel5. The first drive assembly DA comes into contact with the main wheel5from one side of the main wheel5in the axial direction AD to drive the main wheel5. The second drive assembly DB comes into contact with the main wheel5from the other side of the main wheel5in the axial direction AD to drive the main wheel5.", "", "The first drive assembly DA includes a first rotary drive11A, a first motor8A, a first deceleration assembly6A, a first toothed belt13A, and a first pulley15A.", "", "Next, the first motor8A will be described with reference toFIGS.3to5.FIG.5is a cross-sectional view showing the first motor8A. As illustrated inFIGS.3to5, the first motor8A includes a first output shaft81A, a body portion82A, and a brake83A. The body portion82A includes a motor rotor821A and a motor stator822A. The first output shaft81A has a substantially columnar shape. The “columnar” is, for example, “cylindrical”. The first output shaft81A rotates about a first rotation axis RA. The first rotation axis RA is parallel to the rotation axis AX of the main wheel5and is disposed outside the main wheel5in the radial direction RD of the main wheel5. In addition, the first output shaft81A extends from the body portion82A in a direction away from the main wheel5in the axial direction AD along the rotation axis AX. In other words, the first output shaft81A is disposed on a surface of the body portion82A on a side away from the main wheel5. The size of the first motor8A in the direction along the rotation axis AX of the main wheel5is a first distance LA. The size of the brake83A in the direction along the rotation axis AX of the main wheel5is a second distance LB.", "", "Next, the first deceleration assembly6A will be described with reference toFIGS.3,4, and6.FIG.6is a cross-sectional view showing the first deceleration assembly6A. As illustrated inFIGS.3,4, and6, the first deceleration assembly6A includes a first input shaft61A and a body portion62A. The first input shaft61A has a substantially columnar shape. The “columnar” is, for example, “cylindrical”. The first input shaft61A is disposed on the rotation axis AX and extends along the axial direction AD. The first deceleration assembly6A transmits power to the first rotary drive11A at an output reduced from the rotation speed of the first motor8A. The first input shaft61A extends from the body portion62A in a direction away from the main wheel5in the axial direction AD along the rotation axis AX. In other words, the first input shaft61A is disposed on the surface of the body portion62A on the side away from the main wheel5. The first input shaft61A and the first output shaft81A extend in parallel and in the same direction. The size of the first deceleration assembly6A in the direction along the rotation axis AX of the main wheel5is a third distance LC. The third distance LC is substantially the same as the difference between the first distance LA and the second distance LB.", "", "Specifically, the first pulley15A is fixed to the first output shaft81A of the first motor8A. Then, the endless first toothed belt13A is stretched across the first pulley15A and the first input shaft61A of the first deceleration assembly6A in a tensioned state. In other words, the first input shaft61A and the first output shaft81A are connected. When the first output shaft81A of the first motor8A rotates about the first rotation axis RA, the first pulley15A rotates, and the first toothed belt13A goes around. Therefore, the first input shaft61A rotates about the rotation axis AX.", "", "On the other hand, the second drive assembly DB includes a second rotary drive11B, a second motor8B, a second deceleration assembly6B, a second toothed belt13B, and a second pulley15B.", "", "The second motor8B includes a second output shaft81B, a main body, and a brake. The body portion includes a motor rotor and a motor stator. The second output shaft81B has a substantially columnar shape. The “columnar” is, for example, “cylindrical”. The second output shaft81B rotates about a second rotation axis RB. The second rotation axis RB is parallel to the rotation axis AX of the main wheel5and is disposed outside the main wheel5in the radial direction RD of the main wheel5. The second output shaft81B extends from the body portion in a direction away from the main wheel5in the axial direction AD along the rotation axis AX. In other words, the second output shaft81B is disposed on a surface of the body portion on a side away from the main wheel5. As a result, the second output shaft81B and the first output shaft81A extend in directions opposite to each other. The size of second motor8B in the direction along rotation axis AX of main wheel5is a first distance LA. The magnitude of the brake in the direction along the rotation axis AX of the main wheel5is a second distance LB.", "", "The second deceleration assembly6B includes a second input shaft61B and a body portion62B. The second input shaft61B has a substantially columnar shape. The “columnar” is, for example, “cylindrical”. The second input shaft61B is disposed on the rotation axis AX and extends along the axial direction AD. The second deceleration assembly6B transmits power to the second rotary drive11B at an output reduced from the rotation speed of the second motor8B. In addition, the second input shaft61B extends from the body portion62B in a direction away from the main wheel5in the axial direction AD along the rotation axis AX. In other words, the second input shaft61B is disposed on the surface of the body portion62B on the side away from the main wheel5. As a result, the second input shaft61B and the first input shaft61A extend in directions opposite to each other. The second input shaft61B and the second output shaft81B extend in parallel and in the same direction. The size of the second deceleration assembly6B in the direction along the rotation axis AX of the main wheel5is a third distance LC. The third distance LC is substantially the same as the difference between the first distance LA and the second distance LB.", "", "The configurations of the second motor8B, the second deceleration assembly6B, the second rotary drive11B, the second toothed belt13B, and the second pulley15B have a structure in which the first motor8A, the first deceleration assembly6A, the first rotary drive11A, the first toothed belt13A, and the first pulley15A are horizontally reversed, and the description thereof is appropriately omitted.", "", "The first motor8A is disposed closer to a first direction D1than the first deceleration assembly6A. The second motor8B is disposed closer to a second direction D2than the second deceleration assembly6B. The first direction D1and the second direction D2intersect with each other. As a result, in the axial direction AD along the rotation axis AX, the distance between the distal end of the first input shaft61A and the distal end of the second input shaft61B is substantially the same as the distance between the distal end of the first output shaft81A and the distal end of the second output shaft81B.", "", "As illustrated inFIGS.3and4, the main wheel5includes a plurality of driven rollers51and a core body53. The core body53extends along the circumferential direction CD about the rotation axis AX. The core body53has a substantially annular shape. Each of the plurality of driven rollers51has a substantially cylindrical shape. The plurality of driven rollers51are rotatably supported by the core body53. Specifically, each of the plurality of driven rollers51is rotatable about an axis along a tangential direction of the core body53at its own position. Hereinafter, rotation of the driven roller51about an axis along the tangential direction of the core body53at its own position may be described as “spinning”. The plurality of driven rollers51are disposed on the core body53at intervals along the circumferential direction CD. In other words, the plurality of driven rollers51are disposed on the circumferential line with respect to the rotation axis AX and rotate about the circumferential line as an axis.", "", "When the main wheel5rotates about the rotation axis AX, each of the plurality of driven rollers51is rotationally moved along the circumferential direction CD. Hereinafter, the position of the driven roller51in the circumferential direction CD when the driven roller51is rotationally moved along the circumferential direction CD may be described as a “rotational movement position”. Each of the plurality of driven rollers51comes into contact with the floor surface or the ground surface in accordance with the rotational movement position of the driven roller51. Hereinafter, the contact of the driven roller51with the floor surface or the ground surface may be described as “grounding”. A roller body of the driven roller51is made of rubber, for example.", "", "Next, the first rotary drive11A will be described with reference toFIGS.4and7.FIG.7is a perspective view showing the first rotary drive11A. InFIG.7, the main wheel5is shown by a two-dot chain line in order to make the drawing easier to see.", "", "As illustrated inFIGS.4and7, in the wheel assembly DV, the first rotary drive11A of the first drive assembly DA has a substantially disk shape. The first rotary drive11A is made of a highly rigid material such as, for example, metal and hard plastic. The first rotary drive11A is disposed on one side of the main wheel5in the axial direction AD. The first rotary drive11A is rotatably supported. The first rotary drive11A is driven by the rotation of the first deceleration assembly6A to rotate around the rotation axis AX. As a result, the first rotary drive11A transmits the driving force based on the rotational force to the main wheel5. That is, the first rotary drive11A comes into contact with the main wheels5from one side of the main wheels5in the axial direction AD and transmits the power of the first motor8A to the main wheels5.", "", "The first rotary drive11A and the second rotary drive11B sandwich the main wheel5from the axial direction AD. The first rotary drive11A and the second rotary drive11B are disposed symmetrically with respect to the main wheel5. Further, the first rotary drive11A and the second rotary drive11B support the main wheel5so as to be rotatable about the rotation axis AX.", "", "Specifically, the first rotary drive11A includes a plurality of drive rollers120and a driving force transmitting member110. The plurality of drive rollers120are arranged in the driving force transmitting member110. When the driving force transmitting member110rotates about the rotation axis AX, each of the plurality of drive rollers120is rotationally moved along the circumferential direction CD. Hereinafter, the position of the drive roller120in the circumferential direction CD when the drive roller120is rotationally moved along the circumferential direction CD may be described as a “rotational movement position”.", "", "Each of the plurality of drive rollers120comes into contact with any of the plurality of driven rollers51in accordance with the rotational movement position of the drive roller120. Specifically, at least, the drive roller120comes into contact with the driven roller51positioned at the lowermost part and grounded. In this case, the outer circumferential surface of the drive roller120comes into contact with the outer circumferential surface of the driven roller51. As a result, by the friction between the drive roller120and the driven roller51, the driving force based on the rotation of the driving force transmitting member110is transmitted from the drive roller120to the driven roller51. In other words, the plurality of drive rollers120transmit the driving force to the main wheel5. Moreover, in other words, the plurality of drive rollers120transmit propulsion force to the main wheel5.", "", "Specifically, each of the plurality of drive rollers120is rotatably disposed around a center axis extending in a direction that is neither orthogonal nor parallel to the rotation direction of the main wheel5about the rotation axis AX. That is, the center axis of the plurality of drive rollers120is inclined with respect to the rotation direction of the main wheel5about the rotation axis AX, and has a twisting relationship with respect to the rotation axis AX.", "", "Subsequently, the control of the movement direction of the main wheel5will be described with reference toFIGS.3and4. As shown inFIGS.3and4, the first motor8A and the second motor8B independently control the rotation direction and the rotation speed of the first rotary drive11A and the rotation direction and the rotation speed of the second rotary drive11B, thereby controlling the movement direction of the main wheel5.", "", "Specifically, when the first motor8A and the second motor8B are driven in the same rotation direction at the same rotation speed, the first rotary drive11A and the second rotary drive11B rotate at the same rotation speed in the same rotation direction, and the main wheel5rotates about the rotation axis AX. In this case, no rotation speed difference occurs between the first rotary drive11A and the second rotary drive11B, and hence the driven roller51of the main wheel5does not spin, and the main wheel5moves forward or backward straight.", "", "On the other hand, when the first motor8A and the second motor8B are driven in different rotation directions and/or at different rotation speeds, a rotation speed difference occurs between the first rotary drive11A and the second rotary drive11B.", "", "In this case, a component force orthogonal to the circumferential force generated by the rotational force of the first rotary drive11A acts on the contact surface between the drive roller120(FIG.7) of the first rotary drive11A and the driven roller51of the main wheel5. In addition, a component force orthogonal to the circumferential force generated by the rotational force of the second rotary drive11B acts on the contact surface between the drive roller120of the second rotary drive11B and the driven roller51of the main wheel5.", "", "Therefore, the driven roller51spins without the main wheel5rotating about the rotation axis AX, or the driven roller51spins with the main wheel5rotating about the rotation axis AX. As a result, the main wheel5moves in the left-right direction or the oblique direction.", "", "The first rotary drive11A and the second rotary drive11B support the main wheel5rotatably about the rotation axis AX by holding the main wheel5between the plurality of drive rollers120of the first rotary drive11A and the plurality of drive rollers120of the second rotary drive11B.", "", "As illustrated inFIG.4, the first rotation axis RA and the second rotation axis RB are disposed outside the main wheel5. As a result, the first deceleration assembly6A and the first motor8A are disposed apart from each other. The second deceleration assembly6B and the second motor8B are disposed apart from each other. In other words, the first deceleration assembly6A and the first motor8A are not aligned in the direction along the rotation axis AX. The second deceleration assembly6B and the second motor8B are not aligned in the direction along the rotation axis AX. Therefore, it is possible to suppress an increase in the size of the wheel assembly DV in the direction along the rotation axis AX.", "", "In addition, the first input shaft61A and the first output shaft81A extend in parallel and in the same direction. In addition, the second input shaft61B and the second output shaft81B extend in parallel and in the same direction. Further, the second input shaft61B and the first input shaft61A extend in directions opposite to each other. The second output shaft81B and the first output shaft81A extend in directions opposite to each other. Therefore, the size of the wheel assembly DV in the direction along the rotation axis AX can be set to a distance between the distal end of the first input shaft61A and the distal end of the second input shaft61B or a distance between the distal end of the first output shaft81A and the distal end of the second output shaft81B.", "", "In the axial direction AD along the rotation axis AX, the distance 2×LC between the distal end of the first input shaft61A and the distal end of the second input shaft61B is substantially the same as the distance between the distal end of the first output shaft81A and the distal end of the second output shaft81B. Therefore, the size of the wheel assembly DV in the direction along the rotation axis AX can be substantially halved as compared with the case where the first deceleration assembly6A, the first motor8A, the second deceleration assembly6B, and the second motor8B are arranged in the direction along the rotation axis AX.", "", "Next, the first deceleration assembly6A will be further described with reference toFIGS.6and8.FIG.8is a cross-sectional view of the first deceleration assembly6A taken along line VIII-VIII ofFIG.6.", "", "As illustrated inFIG.6, the first deceleration assembly6A includes a first sun gear151A, a plurality of first planetary gears153A, a first internal gear155A, and a first carrier156A. Specifically, the first deceleration assembly6A has two first planetary gears153A. Note that the first deceleration assembly6A may have three or more first planetary gears153A.", "", "The first deceleration assembly6A transmits power by rotating the first sun gear151A and the two first planetary gears153A while bringing them into contact with each other. That is, the first deceleration assembly6A is a so-called planetary gear type decelerator. More specifically, the first deceleration assembly6A is a planetary gear type decelerator of a star type. Specifically, the external teeth of each of the two first planetary gears153A mesh with the internal teeth of the first internal gear155A. The first internal gear155A constitutes a part of the first rotary drive11A. Therefore, when the two first planetary gears153A rotate, the first rotary drive11A rotates.", "", "The first deceleration assembly6A converts a rotation motion of a rotation number N1into a rotation motion of a rotation number N2lower than the rotation number N1. The rotation number N1and the rotation number N2indicate the rotation number of the rotation motion per unit time. In the present example embodiment, the first deceleration assembly6A reduces the rotation speed of the first sun gear151A, and rotates the first internal gear155A at the reduced rotation speed.", "", "Specifically, the first sun gear151A is disposed inside the first rotary drive11A in the radial direction RD. The first sun gear151A rotates about the rotation axis AX. The first sun gear151A has a substantially cylindrical shape. The first sun gear151A extends along the axial direction AD. The first sun gear151A is coupled with the first input shaft61A in the axial direction AD. Therefore, when the first input shaft61A rotates at the rotation number N1, the sun gear151rotates at the rotation number N1. In the present example embodiment, the first input shaft61A and the first sun gear151A are a single member. Note that the first input shaft61A and the first sun gear151A may be separate members.", "", "The two first planetary gears153A are disposed around the first sun gear151A. In the present example embodiment, the two first planetary gear153A are disposed at equal intervals along the circumferential direction CD around the first sun gear151A. The external teeth of each of the two first planetary gears153A mesh with the external teeth of the first sun gear151A. Therefore, when the first sun gear151A rotates, each of the two first planetary gears153A rotates.", "", "The two first planetary gears153A are disposed inside the first rotary drive11A in the radial direction RD. The external teeth of each of the two first planetary gears153A contact the first internal gear155A. The first internal gear155A constitutes a part of the first rotary drive11A. Therefore, when the two first planetary gears153A rotate, the first rotary drive11A rotates.", "", "The first carrier156A accommodates at least part of the first deceleration assembly6A. In the present example embodiment, the first carrier156A accommodates part of the first input shaft61A, the first sun gear151A, and the two first planetary gears153A. The first carrier156A includes a first body portion135A and a first shaft insertion portion139A. The first body portion135A has a substantially cylindrical shape. The first carrier156A supports the two first planetary gears153A so as to spin.", "", "Next, a first frame9A will be further described with reference toFIGS.3,4, and9.FIG.9is a perspective view of the first frame9A. As illustrated inFIGS.3,4, and9, the first drive assembly DA further includes a first frame9A. The second drive assembly DB further includes a second frame9B.", "", "The first motor8A and the first deceleration assembly6A are disposed in the first frame9A. The first frame9A has a substantially flat plate shape. The first motor8A is disposed in a first region91A of the first frame9A. The first deceleration assembly6A is disposed in a second region92A of the first frame. The second region92A is disposed away from the first region91A of the first frame9A. Specifically, the first region91A is disposed closer to the first direction D1than the second region92A. Therefore, when the first motor8A and the first deceleration assembly6A are disposed in the first frame9A, the rotation axis AX and the first rotation axis RA are separated from each other in the first direction D1.", "", "In the second frame9B, the second motor8B and the second deceleration assembly6B are disposed. The second frame9B has a substantially flat plate shape. The second motor8B is disposed in a third region91B of the second frame9B. The second deceleration assembly6B is disposed in a fourth region92B of the second frame. The fourth region92B is disposed away from the third region91B of the second frame9B. Specifically, the third region91B is disposed closer to the second direction D2than the fourth region92B. Therefore, when the second motor8B and the second deceleration assembly6B are arranged in the second frame9B, the rotation axis AX and the second rotation axis RB are separated in the second direction D2.", "", "The first drive assembly DA further includes the first frame9A. The second drive assembly DB further includes a second frame9B. Therefore, the first motor8A, the first deceleration assembly6A, the second motor8B, and the second deceleration assembly6B can be easily disposed in the wheel assembly DV.", "", "Next, the wheel assembly DV will be further described with reference toFIG.10.FIG.10is an exploded perspective view of the vicinity of the first carrier156A and the second carrier156B of the wheel assembly DV.FIG.10illustrates the first carrier156A, the second carrier156B, a first coupling member14A, and a second coupling member14B.", "", "The first carrier156A will be further described with reference toFIGS.11and12.FIGS.11and12are side views showing the first carrier156A. Since the first carrier156A and the second carrier156B have the same configuration, the description thereof will be omitted as appropriate.", "", "As shown inFIGS.11and12, the first carrier156A has a first body portion135A, a first protrusion portion134A, and a first shaft insertion portion139A. The first body portion135A has a substantially cylindrical shape. The first protrusion portion134A protrudes from the first body portion135A to the second carrier156B side. The first output shaft81A is inserted into the first shaft insertion portion139A.", "", "Similarly, the first carrier156A is formed with a plurality of through holes (through hole132a, through hole132b, and through hole132c) and the plurality of screw holes (screw hole136a, screw hole136b, and screw hole136c).", "", "In the present example embodiment, the first carrier156A is formed with three through holes. In the present description, the through hole132a, the through hole132b, and the through hole132cmay be collectively referred to as a through hole132. The through hole132penetrates the first body portion135A. The first coupling member14A can be inserted into the through hole132.", "", "In the present example embodiment, the first carrier156A is formed with three screw holes. Specifically, the screw hole136a, the screw hole136b, and the screw hole136care formed in the first body portion135A. In the present description, the screw hole136a, the screw hole136b, and the screw hole136cmay be collectively referred to as a screw hole136. The screw hole136is formed on the side opposite to the side where the first shaft insertion portion139A is positioned. That is, the screw hole136is formed on the side facing the second carrier156B. The screw hole136can be screwed into the second coupling member14B. The through holes132and the screw holes136are alternately disposed along the circumferential direction.", "", "Similarly, the second carrier156B is formed with the plurality of through holes (through hole132a, through hole132b, and through hole132c) and the plurality of screw holes (screw hole136a, screw hole136b, and screw hole136c).", "", "In the present example embodiment, the second carrier156B is formed with three through holes. In the present description, the through hole132a, the through hole132b, and the through hole132cmay be collectively referred to as a through hole132. The through hole132penetrates the second body portion135B. The second coupling member14B can be inserted into the through hole132.", "", "In the present example embodiment, the second carrier156B is formed with three screw holes. Specifically, the screw hole136a, the screw hole136b, and the screw hole136care formed in the second body portion135B. In the present description, the screw hole136a, the screw hole136b, and the screw hole136cmay be collectively referred to as a screw hole136. The screw hole136is formed on the side opposite to the side where a second shaft insertion portion139B is positioned. That is, the screw hole136is formed on the side facing the first carrier156A. The first coupling member14A can be screwed into the screw hole136. The through holes132and the screw holes136are alternately disposed along the circumferential direction. Therefore, the first carrier156A and the second carrier156B can be easily fixed.", "", "More specifically, the first body portion135A is further formed with a fixing hole133ato a fixing hole133d, a fixing hole138a, and a fixing hole138b. Two first planetary gears153A are rotatably supported by the fixing hole138aand the fixing hole138b.", "", "The fixing hole138a, the through hole132c, the screw hole136a, the through hole132b, the fixing hole138b, the screw hole136b, the through hole132a, and the screw hole136care disposed along the circumferential direction CD. As a result, the first planetary gear153A (second planetary gear153B), the first coupling member14A, the second coupling member14B, the first coupling member14A, the first planetary gear153A (second planetary gear153B), the second coupling member14B, the first coupling member14A, and the second coupling member14B are disposed along the circumferential direction CD. In other words, when viewed from the direction along the rotation axis AX, the three first coupling portions14A and the three second coupling portions14B are disposed at positions not overlapping the two first planetary gears153A (the two second planetary gears153B). Therefore, it is possible to further suppress an increase in the size of the wheel assembly DV in the direction along the rotation axis AX.", "", "Similarly, the second body portion135B is further formed with a fixing hole133ato a fixing hole133d, a fixing hole138a, and a fixing hole138b. The two second planetary gears153B are rotatably supported by the fixing hole138aand the fixing hole138b.", "", "A plurality of screw holes109are formed in the first frame9A. In the present example embodiment, seven screw holes109a,109b,109c,109d,109e,109f, and109gare formed in the first frame9A. For example, a screw can be inserted into each of the seven screw holes109a,109b,109c,109d,109e,109f, and109g. When the first frame9A is disposed in the wheel assembly DV, the first direction D1and the rotation axis AX are orthogonal to each other.", "", "The seven screw holes109a,109b,109c,109d,109e,109f, and109gare disposed at point-symmetrical positions about the rotation axis AX. The first frame9A and the first carrier156A are fixed by inserting screws into four screw holes selected from among the seven screw holes109a,109b,109c,109d,109e,109f, and109gand the fixing hole133ato the fixing hole133d.", "", "A plurality of screw holes109are formed in the second frame9B. In the present example embodiment, seven screw holes109a,109b,109c,109d,109e,109f, and109gare formed in the second frame9B. For example, a screw can be inserted into each of the seven screw holes109a,109b,109c,109d,109e,109f, and109g. When the second frame9B is disposed in the wheel assembly DV, the second direction D2and the rotation axis AX are orthogonal to each other.", "", "The seven screw holes109a,109b,109c,109d,109e,109f, and109gare disposed at point-symmetrical positions about the rotation axis AX. The second frame9B and the second carrier156B are fixed by inserting screws into four screw holes selected from among the seven screw holes109a,109b,109c,109d,109e,109f, and109gand the fixing hole133ato fixing hole133d.", "", "Next, the wheel assembly DV will be further described with reference toFIGS.13to15.FIG.13is a side view showing an example of the wheel assembly DV.FIG.14is a side view showing another example of the wheel assembly DV.FIG.15is a side view showing still another example of the wheel assembly DV.", "", "As illustrated inFIG.13, the first direction D1is different from a direction opposite to the second direction D2. Specifically, the angle between the first direction D1and the second direction D2is an acute angle. As a result, the first motor8A and the second motor8B are not aligned in the first direction D1or the second direction D2. Therefore, it is possible to suppress an increase in the size of the wheel assembly DV in the first direction D1or the second direction D2. In addition, it is possible to suppress an increase in the size of the wheel assembly DV in the direction along the rotation axis AX. For example, in the axial direction AD along the rotation axis AX, the distance 2×LC between the distal end of the first input shaft61A and the distal end of the second input shaft61B is substantially the same as the distance between the distal end of the first output shaft81A and the distal end of the second output shaft81B.", "", "As illustrated inFIG.14, the first direction D1and the second direction D2are the same direction. As a result, it is possible to suppress an increase in the size of the wheel assembly DV in the first direction D1or the second direction D2. InFIG.14, the first motor8A and the second motor8B have no brake. As a result, in the axial direction AD along the rotation axis AX, the distance 2×LC between the distal end of the first input shaft61A and the distal end of the second input shaft61B is substantially the same as the distance between the distal end of the first output shaft81A and the distal end of the second output shaft81B.", "", "As illustrated inFIG.15, the first direction D1and the second direction D2are opposite directions. As a result, the first motor8A and the second motor8B are arranged in the first direction D1and the second direction D2. Therefore, it is possible to suppress an increase in the size of the wheel assembly DV in the first direction D1and the direction orthogonal to the rotation axis AX. In addition, it is possible to suppress an increase in the size of the wheel assembly DV in the direction along the rotation axis AX. For example, the size of the wheel assembly DV in the direction along the rotation axis AX is a distance 2×LC between the distal end of the first input shaft61A and the distal end of the second input shaft61B.", "", "The example embodiments of the present invention have been described above with reference to the drawings (FIGS.1to15). It should be noted that the present invention is not limited to the above-described example embodiments and is implementable in various forms within a range not departing from the scope of the present invention. For easy understanding, the drawings schematically illustrate each component as the subject, and the thickness, length, number, and the like of each illustrated constituent element are different from actual ones for convenience of drawing. Additionally, the material, shape, dimension, and the like of each component illustrated in the above-described example embodiments are mere examples and are not particularly limited, and various modifications can be made without substantially departing from the effects of the present invention.(1) In the present example embodiment described with reference toFIGS.1to15, the wheel assembly DV is applied to the transport vehicle1. However, the application of the wheel assembly DV is not limited to the transport vehicle1, and the wheel assembly DV can be applied to any moving body moving on the floor surface or the ground surface. The moving body is, for example, a unicycle, a two-wheeler, a three-wheeler, or a four-wheeler. In addition, the moving body may have one wheel assembly DV, or may have two or more wheel assemblies DV.(2) In the present example embodiment described with reference toFIGS.1to15, the deceleration assembly is a planetary gear type decelerator. However, the present invention is not limited thereto. The deceleration assembly may be a worm decelerator, a gear decelerator, a bevel gear decelerator, or a traction decelerator.", "", "The present technology can also adopt the following configurations.(1) A wheel assembly including a wheel portion including a plurality of rollers arranged on a circumferential line with respect to a rotation axis, the plurality of rollers rotating about the circumferential line as an axis, and a first rotary drive and a second rotary drive that transmit power to the plurality of rollers, a pair of drive assemblies that support the wheel portion from two sides on the rotation axis and independently rotate the first rotary drive and the second rotary drive, a first frame, and a second frame, in which one drive assembly of the pair of drive assemblies and another drive assembly of the pair of drive assemblies oppose each other with the wheel portion interposed between the pair of drive assemblies, the one drive assembly of the pair of drive assemblies includes a first motor having a first output shaft that rotates about a first rotation axis, and a first deceleration assembly that rotates about the rotation axis of the wheel portion and transmit power to the first rotary drive at an output reduced from a rotation speed of the first motor, the other drive assembly of the pair of drive assemblies includes a second motor including a second output shaft that rotates about a second rotation axis, and a second deceleration assembly that rotates about the rotation axis of the wheel portion and transmits power to the second rotary drive at an output reduced from a rotation speed of the second motor, the first motor is located in a first region of the first frame, the first deceleration assembly is located in a second region of the first frame spaced away from the first region of the first frame, the second motor is located in a third region of the second frame, the second deceleration assembly is located in a fourth region of the second frame spaced away from the third region of the second frame, the first deceleration assembly includes a first input shaft connected to the first output shaft, the second deceleration assembly includes a second input shaft connected to the second output shaft, the first rotation axis and the second rotation axis are parallel to the rotation axis of the wheel portion and located outside the wheel portion in a radial direction of the wheel portion, and the first output shaft, the first input shaft, the second output shaft, and the second input shaft extend in a direction away from the wheel portion in a direction along the rotation axis.(2) The wheel assembly according to (1), in which the first deceleration assembly further includes a first carrier, the second deceleration assembly further includes a second carrier, the first carrier and the second carrier are coupled by three first coupling portions and three second coupling portions, and each of the first coupling portions and each of the second coupling portions are alternately arranged along a circumferential direction.(3) The wheel assembly according to (1) or (2), in which the first deceleration assembly further includes two first planetary gears, and the second deceleration assembly further includes two second planetary gears.(4) The wheel assembly according to (1) or (2), in which the three first coupling portions and the three second coupling portions are located at positions not overlapping the two first planetary gears and the two second planetary gears when viewed from a direction along the rotation axis.(5) The wheel assembly according to any one of (1) to (4), in which the rotation axis and the first rotation axis are separated from each other in a first direction, the rotation axis and the second rotation axis are separated from each other in a second direction, the first direction and the second direction are orthogonal to the rotation axis, the second region of the first frame or the fourth region of the second frame is rotatable about the rotation axis, and the first frame is fixed in a stationary state with respect to the second frame.(6) The wheel assembly according to (5), in which the first direction is different from a direction opposite to the second direction.(7) The wheel assembly according to (5), in which the first direction and the second direction are opposite directions.", "", "Example embodiments of the present invention can be applied to, for example, a wheel assembly.", "", "Features of the above-described example embodiments and the modifications thereof may be combined appropriately as long as no conflict arises.", "", "While example embodiments of the present disclosure have been described above, it is to be understood that variations and modifications will be apparent to those skilled in the art without departing from the scope and spirit of the present disclosure. The scope of the present disclosure, therefore, is to be determined solely by the following claims."], "claims": ["a wheel portion including a plurality of rollers located on a circumferential line with respect to a rotation axis, the plurality of rollers rotating about the circumferential line as an axis, and a first rotary drive and a second rotary drive to transmit power to the plurality of rollers; a pair of drive assemblies that support the wheel portion from two sides on the rotation axis and are operable to independently rotate the first rotary drive and the second rotary drive; a first frame; and a second frame; wherein one drive assembly of the pair of drive assemblies and another drive assembly of the pair of drive assemblies oppose each other with the wheel portion interposed between the pair of drive assemblies; the one drive assembly of the pair of drive assemblies includes: a first motor including a first output shaft that is rotatable about a first rotation axis; and a first deceleration assembly that is rotatable about the rotation axis of the wheel portion to transmit power to the first rotary drive at an output reduced from a rotation speed of the first motor; the other drive assembly of the pair of drive assemblies includes: a second motor including a second output shaft that is rotatable about a second rotation axis; and a second deceleration assembly that is rotatable about the rotation axis of the wheel portion to transmit power to the second rotary drive at an output reduced from a rotation speed of the second motor; the first motor is located in a first region of the first frame; the first deceleration assembly is located in a second region of the first frame spaced away from the first region of the first frame; the second motor is located in a third region of the second frame; the second deceleration assembly is located in a fourth region of the second frame spaced away from the third region of the second frame; the first deceleration assembly includes a first input shaft connected to the first output shaft; the second deceleration assembly includes a second input shaft connected to the second output shaft; the first rotation axis and the second rotation axis are parallel to the rotation axis of the wheel portion and located outside the wheel portion in a radial direction of the wheel portion; and the first output shaft, the first input shaft, the second output shaft, and the second input shaft extend in a direction away from the wheel portion in a direction along the rotation axis.", "the first deceleration assembly further includes a first carrier; the second deceleration assembly further includes a second carrier; the first carrier and the second carrier are coupled by three first coupling portions and three second coupling portions; and each of the first coupling portions and each of the second coupling portions are alternately arranged along a circumferential direction.", "the first deceleration assembly further includes two first planetary gears; and the second deceleration assembly further includes two second planetary gears.", "4 . The wheel assembly according to claim 3 , wherein the three first coupling portions and the three second coupling portions are located at positions not overlapping the two first planetary gears and the two second planetary gears when viewed from a direction along the rotation axis.", "the rotation axis and the first rotation axis are separated from each other in a first direction; the rotation axis and the second rotation axis are separated from each other in a second direction; the first direction and the second direction are orthogonal to the rotation axis; the second region of the first frame or the fourth region of the second frame is rotatable about the rotation axis; and the first frame is fixed in a stationary state with respect to the second frame.", "6 . The wheel assembly according to claim 5 , wherein the first direction is different from a direction opposite to the second direction.", "7 . The wheel assembly according to claim 5 , wherein the first direction and the second direction are opposite directions."], "bibtex": "@patent{20240109366,\n    title = {WHEEL UNIT},\n    number = {20240109366},\n    year = {2024},\n    note = {File: US20240109366A1-20240404.XML}\n    }", "classification": "B60B1900FI"}, {"title": "Wheel Component for a Motor Vehicle, and Method for Operating Such a Wheel Component", "doc_number": "20240109367", "filename": "US20240109367A1-20240404.XML", "abstract": "A wheel component for a motor vehicle includes a rim base, a wheel hub, a rim disc, and an aero ring. The aero ring rests on the rim base in a circumferential direction and forms a circular ring starting from the rim base radially in a direction of the wheel hub. The rim disc is displaceable in a direction of an axis of rotation of the wheel component relative to the wheel hub between an open state and a closed state. The rim disc rests with an outer end face against an inner front surface of the aero ring in a sealing manner in the closed state of the rim disc. There is larger flow cross-section through the wheel component with the rim disc in the open state than in the closed state.", "detailed_description": ["FIGS.1a-cshow a schematic depiction of an exemplary embodiment of a wheel component1, in particular a rim, and a functionality of the wheel component1, wherein a rim disc3of the wheel component1is in an open state. The wheel component1has a wheel hub5, a rim disc3and a rim disc displacement device6. The rim disc3has the open state and a closed state, in particular depicted inFIGS.2a-c, wherein the open state enables a better air flow17through the wheel component1than the closed state. The rim disc displacement device6is further equipped to displace the rim disc3in the direction of an axis of rotation7of the wheel component1relative to the wheel hub5between the open state and the closed state.", "", "The rim disc3is preferably non-rotatably connected to the wheel hub5.", "", "The wheel component1preferably has an aero ring9, wherein the aero ring9abuts on a rim base11of the wheel component1in the circumferential direction. The aero ring9is designed flat such that the aero ring9forms a ring shape starting from the rim base11radially, and in particular orthogonally to the axis of rotation7, in the direction of the wheel hub5. The aero ring9is or can in particular be connected to the rim base11. Alternatively or in addition, the aero ring9is or can preferably be connected to at least one spoke13of the wheel component1.", "", "The rim disc3and the aero ring9preferably have the same material, the rim disc3and the aero ring9in particular consist of the same material. Alternatively or in addition, the rim disc3and the rim base11preferably have the same material, the rim disc3and the rim base11in particular consist of the same material. Alternatively or in addition, the rim disc3and the at least one spoke13preferably have the same material, the rim disc3and the at least one spoke13in particular consist of the same material. Alternatively or in addition, the rim disc3and the wheel hub5preferably have the same material, the rim disc3and the wheel hub5in particular consist of the same material.", "", "FIG.1aandFIG.1bshow the wheel component1in a side view in the open state. In these views, a spacing15between the aero ring9and the rim disc3can clearly be seen, which is present in the open state and enables the air flow17through the wheel component1.", "", "FIG.1cshows a cross-section through the motor vehicle19that has the wheel component1. The motor vehicle19moves in a direction of travel21, and is thus exposed to an airstream23. The rim disc3is in the open state, whereby the air flow17through the wheel component1is enabled. A part of the airstream23is directed to a brake disc27as cold air25. The cold air25cools the brake discs27, taking in heat in the process, and is then directed away as warm air29by means of the air flow17through the wheel component1, in particular directed away from the motor vehicle19.", "", "FIGS.2a-cshow a schematic depiction of the exemplary embodiment of a wheel component1, in particular a rim, and the functionality of the wheel component1if the rim disc3is in a closed state.", "", "Identical elements and elements having identical functions are provided with the same reference numerals in all figures, such that reference is respectively made in this respect to the previous description.", "", "FIG.2aandFIG.2bshow the wheel component1in a side view in the closed state. In these views, it can be clearly seen that the rim disc3abuts on an inner circumferential surface of the aero ring9with an outer circumferential surface in a sealing manner, whereby almost no air flow17is enabled through the wheel component1.", "", "FIG.2cshows a cross-section through the motor vehicle19that has the wheel component1. The motor vehicle19moves in a direction of travel21, and is thus exposed to the airstream23. The rim disc3is in the closed state. In the closed state, the rim disc preferably abuts on the aero ring9in a sealing manner, whereby almost no air flow17is enabled through the wheel component1. Although air circulation31arises behind the brake discs27, no air can be directed away through the wheel component, and thus almost no cooling of the brake disc27is possible.", "", "A comparison ofFIGS.1a-cwithFIGS.2a-cshows that a better air flow17through the wheel component1is enabled in the open state than in the closed state.", "", "The rim disc3is displaced in the direction of the axis of rotation7relative to the wheel hub5of the wheel component1between the open state, in particular depicted inFIGS.1a-c, and the closed state, in particular depicted inFIGS.2a-c, depending on at least one parameter, wherein the open state enables a better air flow17through the wheel component1than the closed state.", "", "The at least one parameter is preferably selected from a group consisting of a rotational speed of the wheel component1, a number of activations of a brake system within a pre-determined period of time, a brake disc temperature and an input of a driver of the motor vehicle19.", "", "The rim disc3is displaced into the open state or remains in the open state if the rotational speed is less than a pre-determined first limit rotational speed. The rim disc3is further displaced into the closed state or remains in the closed state if the rotational speed is greater than or equal to a pre-determined second limit rotational speed.", "", "Alternatively or in addition, the rim disc3is displaced into the open state or remains in the open state if the number of activations of the brake system within the pre-determined period of time is greater than a pre-determined first limit number of activations. The rim disc3is additionally displaced into the closed state or remains in the closed state if the number of activations of the brake system within the pre-determined period of time is less than or equal to a pre-determined second limit number of activations.", "", "Alternatively or in addition, the rim disc3is preferably displaced into the open state or remains in the open state if the brake disc temperature is greater than a pre-determined first limit temperature. The rim disc3is additionally displaced into the closed state or remains in the closed state if the brake disc temperature is less than or equal to a pre-determined second limit temperature."], "claims": ["1 .- 10 . (canceled)", "a rim base ( a wheel hub ( a rim disc ( an aero ring ( wherein the rim disc ( wherein the rim disc rests with an outer end face against an inner front surface of the aero ring ( wherein there is larger flow cross-section through the wheel component (", "12 . The wheel component ( 1 ) according to claim 11 , wherein the wheel component ( 1 ) is a rim.", "13 . The wheel component ( 1 ) according to claim 11 , wherein the rim disc ( 3 ) is non-rotatably connected to the wheel hub ( 5 ).", "14 . The wheel component ( 1 ) according to claim 11 , wherein the rim disc ( 3 ) and the aero ring ( 9 ) consist of a same material.", "displacing the rim disc (", "16 . The method according to claim 15 , wherein the at least one parameter is a rotational speed of the wheel component ( 1 ) and/or a number of activations of a brake system within a pre-determined period of time and/or a brake disc temperature and/or an input of a driver of the motor vehicle ( 19 ).", "17 . The method according to claim 15 , wherein the at least one parameter is a rotational speed of the wheel component ( 1 ), wherein the rim disc ( 3 ) is displaced into the open state or remains in the open state when the rotational speed of the wheel component ( 1 ) is less than a pre-determined first limit rotational speed, and wherein the rim disc ( 3 ) is displaced into the closed state or remains in the closed state when the rotational speed of the wheel component ( 1 ) is greater than or equal to a pre-determined second limit rotational speed.", "18 . The method according to claim 15 , wherein the at least one parameter is a number of activations of a brake system, wherein the rim disc ( 3 ) is displaced into the open state or remains in the open state when the number of activations of a brake system within a pre-determined period of time is greater than a pre-determined first limit number of activations, and wherein the rim disc ( 3 ) is displaced into the closed state or remains in the closed state when the number of activations of the brake system within the pre-determined period of time is less than or equal to a pre-determined second limit number of activations.", "19 . The method according to claim 15 , wherein the at least one parameter is a brake disc temperature, wherein the rim disc ( 3 ) is displaced into the open state or remains in the open state when the brake disc temperature is greater than a pre-determined first limit temperature, and wherein the rim disc ( 3 ) is displaced into the closed state or remains in the closed state when the brake disc temperature is less than or equal to a pre-determined second limit temperature."], "bibtex": "@patent{20240109367,\n    title = {Wheel Component for a Motor Vehicle, and Method for Operating Such a Wheel Component},\n    number = {20240109367},\n    year = {2024},\n    note = {File: US20240109367A1-20240404.XML}\n    }", "classification": "B60B1910FI"}, {"title": "METHOD AND APPARATUS FOR HANDLING COMPONENTS OF A VEHICLE WHEEL ASSEMBLY", "doc_number": "20240109368", "filename": "US20240109368A1-20240404.XML", "abstract": "An apparatus ( 10 ) for the installation/removal of a vehicular component ( 100 ), such as a wheel adaptor/spacer. The apparatus ( 10 ) includes a support structure ( 20 ) and a mounting head ( 40 ). The support structure ( 20 ) is height adjustable. The mounting head ( 40 ) includes an arm assembly ( 41 ) which is longitudinally extendable, and, which is rotatably connected to the support structure ( 20 ). Mounting brackets ( 48, 49 ) are attached to each end of the arm assembly ( 41 ) which are adapted to releasably engage the vehicular component ( 100 ).", "detailed_description": ["Referring to the drawings, there is illustrated the apparatus, generally indicated by reference numeral10, for use with a vehicle wheel mounting assembly. An example of a vehicle wheel mounting assembly is illustrated inFIGS.8to10.", "", "An example of a component with which the apparatus is suitable for use is in the form of a wheel adaptor for a vehicle wheel mounting assembly. The assembly may be used in heavy duty vehicles such as mining vehicles such as haul trucks.", "", "The wheel adaptor component can comprise two substantially semi-circular parts which can be fitted together to form a ring or collar which is releasably securable to part of a housing of the vehicle mounting assembly.", "", "Whilst the apparatus is particularly suitable for handling a wheel adaptor of the aforementioned type, reference to this particular application is not to be considered a limitation of the disclosure, as the apparatus is also useful for handling other components and devices.", "", "As shown, the vehicle wheel mounting assembly100comprises a support member101which is secured to the vehicle body (not shown). The assembly100further includes a drive housing102, operatively connected to the support member101, for rotation relative thereto about a wheel rotation axis A-A. The drive housing102contains the drive mechanism for rotating the housing102. In this particular arrangement, the housing102is adapted to have mounted thereto a dual wheel arrangement including an inner wheel (not shown) at wheel mounting zone103, and an outer wheel (not shown) at wheel mounting zone110. A mounting ring or collar104is provided at the mounting zone103. The collar104has a series of studs or bolts105which extend around the ring or collar104to which the hub or rim of the inner wheel is mounted.", "", "The assembly100further includes a wheel adaptor component112which can be releasably secured to the drive housing102at the wheel mounting zone110for the outer wheel. The adaptor component112comprises first and second parts113and114which are semi-circular in shape and which together can be secured to the housing102, so as to form a ring or collar which, in an installed position, extends around the housing102at the outer wheel mounting zone110.", "", "The adaptor component includes a series of studs or bolts115for mounting the outer wheel. A further series of studs or bolts116are arranged to secure the adaptor component112to the housing102. Temporary attachment bolts or studs117are also provided for reasons which will become apparent. The housing102further includes a number of dowels118which extend through the parts113and114when installed.", "", "As shown inFIGS.1to9, the apparatus10comprises a main body11which includes a base12comprised by elongate side members17and panels18. The apparatus may be adapted for movement over a surface for correct positioning when required for use. As shown inFIG.11, ground engaging elements14which may be in the form of wheels or rollers may be connected to the frame12. The ground engaging elements14may form part of a trolley upon which the base12can be supported. The ground engaging elements14may be powered or freely rotatable for manual movement of the apparatus10. In another arrangement, the side members17may be hollow and least in part, so as to be able to receive the forks of a forklift truck to facilitate movement of the apparatus.", "", "The main body11of the apparatus further includes a support structure20in the form of an upright post21having a lower end secured to and extending from the base12. The post21comprises a first or lower part22and a second or upper part23which are inter-connected so as to be movable relative to one another between extended and retracted positions. To facilitate this, the first and second parts22and23may be in the form of elongated members24and25one being receivable within the other in a telescopic fashion so that they can move relative to one another in the direction of longitudinal axis X-X (FIG.3).", "", "A drive30is provided to facilitate the movement (axial movement) between members22and23. As shown, the drive30comprises two linear actuators31and32connected between the members22and23. In the form shown, the actuators31and32are electric or hydraulic devices driven by motors33and34. A stabilizing section36provides stability between the post21and base12.", "", "The apparatus10further includes a mounting head40operatively connected to the post21. As shown, the mounting head40is secured to the upper end of the upper member23of the post21. The mounting head40comprises an arm assembly41which includes a main arm43operatively mounted to the upper end of the post so as to be rotatable about a rotation axis Z-Z (FIG.3).", "", "The main arm43is secured to the post21by means of an axle or shaft55and bearing56. Rotation of the arm assembly41is effected by means of a drive70. The drive70includes a linear actuator71operatively connected to part of the fixed structure to the apparatus through a pivotally movable mounting arm72and a linkage mechanism comprising link elements73and74operatively connecting the actuator71to the axle or shaft55.FIGS.4to7illustrate how the drive70operates. The actuator71may be either electrically powered or hydraulically powered.", "", "As shown, the arm assembly41further includes end arm sections44and45mounted at respective opposite ends of the main arm43for relative movement in the direction of longitudinal axis Y-Y (FIG.3) between extended and retracted positions. The main arm43and end arm sections44and45may be interconnected in a telescopic fashion to enable the relative movement therebetween. A drive65in the form of linear actuators61and62are adapted to effect the movement. Each actuator61and62has an electric or hydraulic motor63and64associated there with.", "", "The mounting head40further includes mounting sections51and54operatively connected to respective end arm sections44and45. Each mounting section51and54includes a connector leg46and47secured to and laterally extending from respective ends of the arm sections44and45. Each leg46and47has, at its outer end, a mounting bracket48and49which are in the form of V-shaped members52having locating apertures53therein.", "", "To be able to remove the inner wheel from the housing it is necessary to remove the adaptor component112. The apparatus10as described is adapted to facilitate removal and reinstalment of the adaptor component112from the housing102.", "", "The method of use of the apparatus10with the wheel mounting assembly100referred to earlier will hereinafter be described. This can be understood by particular reference toFIGS.11to14.", "", "As an initial step, temporary attachment bolts117are fitted so that they are in a position to allow the adaptors to slide along their length while preventing the adaptor from falling. The remainder of the main adaptor mounting bolts115can be removed so that the adaptor112is only held by the temporary attachment bolts117.", "", "As shown inFIGS.11and12, adaptor dislodgement devices120are positioned on the wheel adaptor parts113and114and the housing100. As illustrated inFIG.15, the dislodgement device120comprises a U-shaped body121which can be arranged to overlie the adaptor112and a part of the housing100. The adaptor112may have a tapered body section which fits against a similarly tapered section of the housing when installed. The tapered sections can become difficult to separate from one another. The dislodgement device120includes a threaded section122which can receive a threaded bolt123. The threaded section122is positioned so as to be aligned with one of the dowels118on the housing102(the dowels118are illustrated inFIG.10). Rotation of the bolt123causes it to react against the dowel118so that the adaptor and housing can be dislodged from one another. Once dislodged, the adaptor is retained by temporary bolts only.", "", "The apparatus10is then moved into a position adjacent the drive housing100with the mounting sections51and54in an extended position relative to one another so that the mounting head can be moved so that it overlies the drive housing100. The work head40can be rotated if required and the mounting sections51and54are retracted towards one another so that locating apertures53can be aligned with and subsequently fitted to some of the wheel mounting bolts115. Once the work head40is secured to the adaptor112, the temporary attachment bolts117can be removed. The mounting sections51and54can then be moved into the extended position so that the two parts of the adaptor are separated from the housing100. The apparatus can then be moved away from the housing100with the adaptor112being held by the work head40.", "", "As shown inFIG.11, the mounting sections51and53are moved to a position in which they are sufficiently spaced apart to enable the apparatus to be moved into the position shown inFIG.12when the sections51and53can be secured to respective parts113and114of the wheel adaptor112. As shown inFIG.13, the apertures53can receive studs115. Nuts can be used to secure the brackets48and49to the respective parts113and114.", "", "FIGS.16to21illustrate a procedure for removing the wheel adaptor112from or returning it to the apparatus from a storage pallet130. The storage pallet is illustrated in FIGS.22and included a base133with a series of corner posts134and locating posts135extending therefrom. The adapters are mounted through the 8 mounting bolt holes. The posts are adapted to locate and allow the stacking of multiple pallets. As illustrated the pallet130can be lifted by a chain connected to a crane or like lifting device to a position where it can be fitted to the wheel adaptor. The pallet and adaptor can then be removed from the apparatus positioned at a storage location.", "", "In the forgoing description of preferred embodiments, specific terminology has been resorted to for the sake of clarity. However, the invention is not intended to be limited to specific terms so selected, and it is to be understood that each specific term includes all technical equivalents which operate in a similar manner to accomplish a similar technical purpose. Terms such as “front” and “rear”, “inner” and “outer”, “above”, “below”, “upper” and “lower” and the like are used as words of convenience to provide reference points and are not to be construed as limiting terms.", "", "In this specification the word “comprising” is to be understood in its “open” sense, that is, in the sense of “including”, and thus not limited to its “closed” sense, that is the sense of “consisting only of”. A corresponding meaning is to be attributed to the corresponding words “comprise”, “comprised” and “comprises” where they appear.", "", "In addition, the foregoing describes only some embodiments of the invention(s), and alterations, modifications, addition and/or changes can be made thereto without departing from the scope and spirit of the disclosed embodiments, the embodiments being illustrative and not restrictive.", "", "Furthermore, invention(s) have been described in connection with what are presently considered to be the most practical and preferred embodiments, it is to be understood that the invention is not to be limited to the disclosed embodiments, but on the contrary, is intended to cover various modifications and equivalent arrangements included within the spirit and scope of the invention(s). Also, the various embodiments described above may be implemented in conjunction with other embodiments, e.g., aspects of one embodiment may be combined with aspects of another embodiment to realise yet other embodiments. Further, each independent feature or component of any given assembly may constitute an additional embodiment.", "", "TABLE OF PARTSApparatus10Main body11Base12Frame13Side member17Cross member18Ground engaging elements14Trolley15Support structure20Post21First part22Second part23First elongated member24Second elongated member25Drive30Linear actuators31/32Hydraulic motors33/34Strut36Mounting head40Arm assembly41Main arm43End sections44/45Mounting sections51/54Connector legs46/47Mounting bracket48/49V-shaped members52Locating apertures53Axle55Bearing56Rotary Drive60Drive65Linear actuators61/62Hydraulic motors63/64Longitudinal axisX-XLongitudinal axisY-YRotation axisZ-ZDislodgement device66Dowels67Drive70Linear Actuator71Mounting Arm72Link elements73/74Wheel mounting assembly100Support member101Drive housing102Inner wheel mounting zone103Mounting ring or collar104Wheel mounting studs/bolts105Outer wheel mounting zone110Wheel Adaptor112First part113Second part114Wheel mounting studs/bolts115Attachment studs/bolts116Temporary attachment studs/bolts117Wheel rotation axisA-ADowels118Dislodgement device120Body121Threaded section122Push bolt123Pallet130Base133Corner posts134Locating posts135Hugs136"], "claims": ["(a) a height adjustable support structure; (tea mounting head which includes: (i) an arm assembly having opposed ends with a longitudinal axis extending in a longitudinally direction between the ends; (ii) the arm assembly being which is rotatably connected to the intermediate its ends to said support structure in a position intermediate its ends; (iii) the arm assembly being extendable in the longitudinal direction so that the ends can be moved away from one another; and, (iv) a mounting bracket attached to each end of the arm assembly, each mounting bracket being configured to hold a respective one of the component parts during movement of the ends of the arm assembly away from one another.", "2 . The apparatus as claimed in claim 1 , wherein said support structure includes at least two telescoping members adapted for longitudinal movement relative to one another, so as to adjust the height of the support structure, the mounting head being operatively connected to one of the telescoping members.", "3 . The apparatus as claimed in claim 2 , wherein said support structure includes a main body drive to longitudinally move said telescoping members.", "4 . The apparatus as claimed in claim 3 , wherein said main body drive includes a linear actuator.", "5 . The apparatus as claimed in claim 1 , wherein said support structure includes a base adapted to be moved over a substrate surface.", "6 . The apparatus as claimed in claim 1 , including a rotary drive for causing rotation of arm assembly relative to the support structure.", "7 . The apparatus as claimed in claim 6 , wherein said rotary drive includes a linear actuator and a pivotally movable mounting arm.", "8 . The apparatus as claimed in claim 1 , wherein the arm assembly comprises a main arm and end arm sections at respective opposite ends of the main arm, the end arm sections being connected to the main arm in a telescopic fashion to enable relative movement therebetween in the direction of the longitudinal axis.", "9 . The apparatus as claimed in claim 8 , wherein said arm assembly includes an arm drive to telescopically move each telescoping end arm section.", "10 . The apparatus as claimed in claim 9 , wherein said arm drive includes a linear actuator.", "11 . The apparatus as claimed in claim 1 , wherein each mounting bracket is attached to a respective end of said arm assembly via a mounting leg which extends transversely from said arm assembly.", "12 . The apparatus as claimed in claim 1 , wherein each mounting bracket is configured in the form of a V-shaped member.", "13 . The apparatus as claimed in claim 1 , wherein each mounting bracket includes at least one aperture therein which is adapted to be releasably engaged with a vehicular component.", "14 . The apparatus as claimed in claim 13 , wherein each mounting bracket is adapted to be releasably engaged with the vehicular component by an attachment bolt or pin being inserted in said at least one aperture.", "15 . The apparatus as claimed in claim 13 , wherein said vehicular component is a wheel spacer/adaptor.", "16 .- 18 . (canceled)", "19 . A method of handling a wheel adaptor which can be installed or removed from a vehicle wheel mounting assembly, the wheel adaptor comprising two separate component parts which together form a ring or collar which is operatively attached to the vehicle mounting assembly when installed and the two component parts can be moved away from one another when the adaptor is removed from the vehicle wheel mounting assembly, the apparatus being in accordance with claim 1 .", "20 . The method according to claim 19 , including the steps of operatively connecting each mounting bracket to a respective one of the component parts of the wheel adaptor, releasing the attachment of the adaptor from the vehicle wheel mounting assembly and causing the arm assembly to be extended in the direction of the longitudinal axis so that the component parts of the wheel adaptor can be moved away from one another so as to remove the adaptor from vehicle wheel mounting assembly.", "21 . A method of handling a wheel adaptor which can be stored on or removed from a storage pallet, the wheel adaptor comprising two separate component parts which together form a ring or collar wherein the two component parts can be moved towards or away from one another when the adaptor is removed from or stored on the storage pallet, the apparatus being in accordance with claim 1 ."], "bibtex": "@patent{20240109368,\n    title = {METHOD AND APPARATUS FOR HANDLING COMPONENTS OF A VEHICLE WHEEL ASSEMBLY},\n    number = {20240109368},\n    year = {2024},\n    note = {File: US20240109368A1-20240404.XML}\n    }", "classification": "B60B3006FI"}, {"title": "SUSTAINABLE TIRE", "doc_number": "20240109369", "filename": "US20240109369A1-20240404.XML", "abstract": "A tire having a tread comprising a tread rubber composition comprising from 10 phr to 100 phr of styrene butadiene rubber comprising monomers selected from one or more of recycled and bio-based monomers, from 0 phr to 90 phr of elastomers selected from one or more of natural rubber, polybutadiene rubber comprising monomers selected from one or more of recycled and bio-based monomers, and synthetic polyisoprene comprising monomers selected from one or more of recycled and bio-based monomers, and from 40 phr to 250 phr of a filler comprising one or more of recycled or bio-based silica, and recycled or bio-based carbon black, from 1 phr to 90 phr of hydrocarbon resin which is one or more of i) based on recycled monomers, bio-based monomers or a combination thereof, and ii) a plant resin. Furthermore, the tire comprises reinforced rubber plies, comprising cords, optionally made of a bio-based or recycled material, coated with a rubber coating composition comprising from 80 phr to 100 phr of elastomers selected from one or more of natural rubber and synthetic polyisoprene comprising monomers selected from one or more of recycled and bio-based monomers, and from 30 phr to 90 phr of a filler comprising one or more of recycled or bio-based silica and recycled or bio-based carbon black.", "detailed_description": ["FIG.1is a schematic cross-section of a tire 1 according to an embodiment of the invention. The tire 1 has a plurality of tire components such as a tread 10, an innerliner 13, a belt comprising four belt plies 11, a carcass ply 9, two sidewalls 2, and two bead regions 3, apexes 5 and beads 4. The example tire 1 is suitable, for example, for mounting on a rim of a vehicle, e.g. a truck. As shown inFIG.1, the belt plies 11 may be covered by an overlay ply 12 and/or may include one or more breaker plies. The carcass ply 9 includes a pair of axially opposite end portions 6, each of which is associated with a respective one of the beads 4. Each axial end portion 6 of the carcass ply 9 may be turned up and around the respective bead 4 to a position to anchor each axial end portion 6. The turned-up portions 6 of the carcass ply 9 may engage the axial outer surfaces of two flippers 8 and axial inner surfaces of two chippers 7 which are also considered as tire components. Moreover, each bead region 3 comprises a chafer 15. As shown inFIG.1, the example tread 10 may have circumferential grooves 20, each groove 20 essentially defining a U-shaped opening in the tread 10. The main portion of the tread 10 may be formed of one or more tread compounds.", "", "While the embodiment ofFIG.1suggests a plurality of tire components including for instance apexes 5, chippers 7, flippers 8, chafers 15 and overlay 12, such and further components are not mandatory for the invention. Also, the turned-up end of the carcass ply 9 is not necessary for the invention or may pass on the opposite side of the bead area 3 and end on the axially inner side of the bead 4 instead of the axially outer side of the bead 4. The tire could also have for instance a different number of grooves 20, e.g. less than four grooves.", "", "In one embodiment, the tread 10 comprises a tread rubber composition comprising from 70 phr to 90 phr of natural rubber, from 10 phr to 30 phr of styrene butadiene rubber comprising recycled monomers, from 45 phr to 70 phr of rice husk ash silica, from 5 phr to 10 phr of a bio-based silane, as based on bio-ethanol. In addition, the rubber composition optionally has 1 phr to 5 phr of waxes, in particular from rice bran. Moreover, the composition comprises a bio-based antidegradant based on Kraft lignin, at a range of 1 phr to 10 phr. In the present non-limiting example, said composition comprises also from 2 phr to 15 phr of a bio-based resin, as terpene resin Sylvatraxx 4150 from Arizona Chemicals. Alternative terpene resins are available from multiple resin manufacturers, including but not limited to Dercolyte A115 from DRT. In other embodiments for truck tires, the resin range is preferably from 2 phr to 40 phr, preferably from 2 phr to 15 phr or to 10 phr. In case of other embodiments for passenger car tires, the resin range is preferably from 20 phr to 80 phr, or even more preferably from 50 phr to 75 phr. In addition, the rubber composition can optionally comprise from 1 phr to 10 phr of (bio-based) stearic acid. Moreover, the rubber composition comprises 1 phr to 10 phr of curatives, such as vulcanization accelerators listed herein above, and 0.1 phr to 5 phr (preferably 0.5 phr to 4 phr) of sulfur. The tread rubber composition, and also further compositions mentioned herein, may comprise further ingredients.", "", "The belt plies 11 (which are examples of reinforced rubber plies) comprise cords, for instance preferably made of steel or textile material, which are coated with a cord coating rubber composition. In the present embodiment the cords are steel cords. In another embodiment those are made of recycled steel. The cord coating rubber composition comprises from 95 phr to 100 phr of natural rubber and from 40 phr to 70 phr of rice husk ash silica. In the present embodiment, the cord coating rubber composition further comprises a vegetable oil, herein 0.5 phr to 8 phr of a rapeseed oil. Moreover, the rubber composition comprises from 1 phr to 15 phr of a carbon black which is based on methane pyrolysis. A use of bio-methane further improves sustainability. The composition also comprises curatives within a range of 1 phr to 15 phr, antidegradants within a range of 1 phr to 10 phr which include herein the bio-based antidegradant Ligflex™ 601, silane within a range of 1 phr to 15 phr, in particular based on bio-ethanol, sulfur within a range of 4 phr to 15 phr, and zinc oxide within a range of 5 phr to 15 phr. In another embodiment, said zinc oxide is based on zinc scrap to further improve sustainability.", "", "Moreover, in an embodiment, the tire 1 comprises two sidewalls 2 comprising a sidewall rubber composition comprising in a non-limiting example from 30 phr to 55 phr of bio-based polybutadiene. Moreover, the sidewall rubber composition comprises from 45 phr to 70 phr of natural rubber. As a filler, the sidewall rubber composition comprises from 30 phr to 50 phr of a methane pyrolysis based carbon black. In addition, the rubber composition comprises from 1 phr to 10 phr of stearic acid which is also bio-based. Moreover, the rubber composition comprises from 1 phr to 10 phr of antidegradants (including the bio-based antidegradant already mentioned above), from 1 phr to 10 phr of curatives, such as vulcanization accelerators listed herein above, 0.1 phr to 10 phr of metal oxides such as zinc oxide, and 0.1 phr to 5 phr of sulfur.", "", "Said bead 4 comprises in an embodiment a bead coating (or bead filler) rubber composition comprising 100 phr of a recycled styrene butadiene rubber. Moreover the bead rubber composition comprises from 100 phr to 150 phr of a tall oil based carbon black, and from 5 phr to 30 phr of vegetable oil as rapeseed oil in the present embodiment. Moreover, the rubber composition comprises from 1 phr to 10 phr of a reactive phenol based resin. In addition, the rubber composition comprises from 1 phr to 10 phr of a said bio-based antidegradant, from 1 phr to 10 phr of curatives, such as vulcanization accelerators listed herein above, from 0.1 phr to 10 phr of metal oxides such as zinc oxide, and from 0.1 phr to 8 phr of sulfur.", "", "Said chafers 15 comprise in an embodiment a chafer rubber composition comprising from 50 phr to 95 phr of recycled polybutadiene rubber, from 5 phr to 50 phr of natural rubber, from 50 phr to 90 phr of a bio-based carbon black, and optionally from 1 phr to 10 phr of a vegetable oil. Moreover, the rubber composition comprises from 0.5 phr to 10 phr of stearic acid, from 1 phr to 10 phr of the Kraft lignin based antidegradants, from 1 phr to 10 phr of curatives, such as vulcanization accelerators listed herein above, from 0.1 phr to 10 phr of metal oxides such as zinc oxide, and from 0.1 phr to 5 phr of sulfur.", "", "The apexes 5 of the tire 1 comprise in an embodiment an apex rubber composition comprising 100 phr of natural rubber, a blend of bio-based silica as rice husk ash silica, within a range of 10 phr to 30 phr, and a recycled carbon black based on tire pyrolysis oil at a range of 30 phr to 40 phr, a vegetable oil (as rapeseed oil) within a range of 1 phr to 5 phr. Moreover, the composition comprises curatives within a range of 1 phr to 15 phr, said bio-based antidegradant within a range of 1 phr to 10 phr, silanes within a range of 1 phr to 10 phr, sulfur within a range of 2 phr to 10 phr and also zinc oxide within a range of 2 phr to 10 phr.", "", "The innerliner 13 of the example tire 1 consists in an embodiment of an innerliner rubber composition comprising at least 90 phr, preferably 100 phr of bio-based butyl rubber and from 30 phr to 70 phr of a carbon black based on methane pyrolysis. Moreover, this rubber composition comprises from 1 phr to 10 phr of a vegetable oil, as rapeseed oil, 0.5 phr to 10 phr of (bio-based) stearic acid, from 1 to 10 phr of curatives.", "", "While not shown herein, further tire components such as base tread(s), chimney(s), cushions or rubber strips may also be present and may have also rubber compositions comprising one or more of the recycled and/or bio-based ingredients disclosed herein. In general, specific examples of materials mentioned in one embodiment can also be used as materials in another embodiment disclosed herein.", "", "Variations in the present invention are possible in light of the description of it provided herein. While certain representative embodiments and details have been shown for the purpose of illustrating the subject invention, it will be apparent to those skilled in this art that various changes and modifications can be made therein without departing from the scope of the subject invention. It is, therefore, to be understood that changes can be made in the particular embodiments described which will be within the full intended scope of the invention as defined by the following appended claims."], "claims": ["A) a tread comprising a tread rubber composition comprising from 10 phr to 100 phr of styrene butadiene rubber comprising monomers selected from one or more of recycled and bio-based monomers, from 0 phr to 90 phr of elastomers selected from one or more of natural rubber, polybutadiene rubber comprising monomers selected from one or more of recycled and bio-based monomers, and polyisoprene comprising monomers selected from one or more of recycled and bio-based monomers, from 40 phr to 250 phr of a filler comprising one or more of recycled or bio-based silica, and recycled or bio-based carbon black, from 1 phr to 90 phr of hydrocarbon resin which is one or more of i) based on recycled monomers, bio-based monomers or a combination thereof, and ii) a plant resin; and B) reinforced rubber plies comprising cords coated with a rubber coating composition comprising from 80 phr to 100 phr of elastomers selected from one or more of natural rubber and polyisoprene comprising monomers selected from one or more of recycled and bio-based monomers, from 30 phr to 90 phr of a filler comprising one or more of recycled or bio-based silica and recycled or bio-based carbon black.", "a) oil which is one or more of i) based on recycled monomers, bio-based monomers or a combination thereof, and ii) vegetable oil, b) hydrocarbon resin which is one or more of i) based on recycled monomers, bio-based monomers or a combination thereof, and ii) a plant resin, and c) liquid olefinic polymers based on recycled monomers, bio-based monomers or a combination thereof.", "C) a sidewall comprising a sidewall rubber composition comprising from 60 phr to 100 phr of elastomers selected from one or more of natural rubber, polybutadiene rubber comprising monomers selected from one or more of recycled and bio-based monomers, and polyisoprene comprising monomers selected from one or more of recycled and bio-based monomers, from 20 phr to 60 phr of a filler comprising one or more of recycled or bio-based silica and recycled or bio-based carbon black; D) at least one bead comprising a bead coating rubber composition comprising from 80 phr to 100 phr of elastomers selected from one or more of natural rubber, polybutadiene rubber comprising monomers selected from one or more of recycled and bio-based monomers, polyisoprene comprising monomers selected from one or more of recycled and bio-based monomers, from 90 phr to 150 phr of recycled or bio-based carbon black, from 0.5 phr to 20 phr of plasticizers comprising one or more of a) oil which is one or more of i) based on recycled monomers, bio-based monomers or a combination thereof, ii) a vegetable oil, b) hydrocarbon resin which is one or more of i) based on recycled monomers, bio-based monomers or a combination thereof, and ii) a plant resin, and c) liquid olefinic polymers based on recycled monomers, bio-based monomers or a combination thereof; E) at least one chafer comprising a chafer rubber composition comprising from 80 phr to 100 phr of elastomers selected from one or more of natural rubber, polybutadiene rubber comprising monomers selected from one or more of recycled and bio-based monomers and polyisoprene comprising monomers selected from one or more of recycled and bio-based monomers; from 50 phr to 100 phr of a recycled or bio-based carbon black; F) at least one apex comprising an apex rubber composition comprising from 90 phr to 100 phr of one or more of natural rubber, and synthetic polyisoprene comprising monomers selected from one or more of recycled and bio-based monomers, and from 40 phr to 80 phr of a filler comprising predominantly recycled or bio-based carbon black; G) an innerliner comprising an innerliner rubber composition comprising: 90 phr to 100 phr of a butyl rubber comprising monomers selected from one or more of recycled and bio-based monomers, 30 phr to 100 phr of recycled or bio-based carbon black, from 1 phr to 30 phr of plasticizers comprising one or more of a) oil which is one or more of i) based on recycled monomers, bio-based monomers or a combination thereof, ii) a vegetable oil, b) hydrocarbon resin which is one or more of i) based on recycled monomers, bio-based monomers or a combination thereof, and ii) a plant resin, and c) liquid olefinic polymers based on recycled monomers, bio-based monomers or a combination thereof.", "4 . The tire according to claim 1 , wherein said tread rubber composition comprises from 50 phr to 90 phr of one or more of natural rubber and polyisoprene comprising recycled or bio-based monomers.", "5 . The tire according to claim 1 , wherein said tread rubber composition comprises from 50 phr to 160 phr of bio-based silica.", "6 . The tire according to claim 5 , wherein said silica is selected from rice husk ash silica and sugarcane ash silica.", "7 . The tire according to claim 5 , wherein said rubber coating composition comprises from 30 phr to 70 phr of bio-based silica.", "8 . The tire according to claim 1 , wherein one or more of the rubber compositions each comprise from 2 phr to 20 phr of a bio-based silane.", "9 . The tire according to claim 1 , wherein one or more rubber compositions comprise from 1 phr to 10 phr of at least one bio-based anti-degradant.", "10 . The tire according to claim 1 , wherein the hydrocarbon resin in the tread rubber composition is selected from one or more of terpene resins and rosin resins.", "11 . The tire according to claim 1 , wherein one or more of the rubber compositions comprise 1 phr to 10 phr of vegetable oil.", "12 . The tire according to claim 1 , wherein at least one of the rubber plies comprises cords comprising recycled metal or recycled fabric material.", "13 . The tire according to claim 12 , wherein the cords comprise one or more of recycled PET and recycled polyamide.", "14 . The tire according to claim 1 , further comprising a bead made of recycled steel.", "15 . The tire according to claim 1 , wherein at least one of said rubber plies comprises cords comprising recycled steel.", "16 . The tire according to claim 1 , wherein the tread rubber composition comprises at least 70% of ingredients selected from recycled ingredients, bio-based ingredients, or combinations thereof, all by weight.", "17 . The tire according to claim 16 , wherein the rubber coating composition comprises at least 65% of ingredients selected from recycled ingredients, bio-based ingredients, or combinations thereof, all by weight.", "wherein the tread rubber composition comprises from 80% to 95% of ingredients selected from recycled ingredients, bio-based ingredients, or combinations thereof, and wherein the rubber coating composition comprises from 75% to 90% of ingredients selected from recycled ingredients, bio-based ingredients, or combinations thereof, all by weight.", "from 60 phr to 90 phr of one or more of natural rubber and synthetic polyisoprene comprising monomers selected from one or more of recycled and bio-based monomers, from 10 phr to 40 phr of styrene butadiene rubber comprising monomers selected from one or more of recycled and bio-based monomers, from 40 phr to 70 phr of rice husk ash silica, from 1 phr to 10 phr of a terpene resin.", "from 0.1 phr to 10 phr of a recycled or bio-based carbon black, from 0.1 phr to 10 phr of a Kraft lignin based antidegradant, from 0.1 phr to 10 phr of a bio-based silane, from 0.1 phr to 4 phr of a recycled zinc oxide, from 0.1 phr to 6 phr of bio-based wax, and from 0.1 phr to 10 phr of stearic acid."], "bibtex": "@patent{20240109369,\n    title = {SUSTAINABLE TIRE},\n    number = {20240109369},\n    year = {2024},\n    note = {File: US20240109369A1-20240404.XML}\n    }", "classification": "B60C100FI"}, {"title": "LOW-NOISE TIRE AND METHOD FOR MANUFACTURING SAME", "doc_number": "20240109370", "filename": "US20240109370A1-20240404.XML", "abstract": "A tire comprises a sealing layer comprising a junction ( 21 ) extending in a main direction (D 4 ) forming, with the circumferential direction (Z) of the tire: in a portion ( 15 S) of the sealing layer extending axially in radial line with the working layer, an angle (ES) ranging, in absolute value, from 20° to 60°, and in a portion ( 15 F) of the sealing layer extending radially in each sidewall, an angle (EF), in absolute value, strictly greater than the angle (ES) of the main direction (D 4 ) of the junction ( 21 ) in the portion ( 15 S) of the sealing layer extending axially in radial line with the working layer.", "detailed_description": [""], "claims": ["1 .- 15 . (canceled)", "a tread ( a crown reinforcement ( wherein the tire further comprises a sealing layer ( in a portion ( in a portion (", "17 . The tire according to claim 16 , wherein the angle (ES), in absolute value, is greater than or equal to 25°.", "18 . The tire according to claim 16 , wherein the angle (ES), in absolute value, is less than or equal to 50°.", "19 . The tire according to claim 18 , wherein the main direction (D 4 ) of the junction ( 23 ) forms, with the circumferential direction (Z) of the tire ( 10 ), an angle, in absolute value, ranging from 80° to 90° in the portion ( 15 F) of the sealing layer ( 15 ) extending radially in each sidewall ( 22 ).", "20 . The tire according to claim 16 , wherein an average distance (Dm) between each circumferential end edge ( 23 A, 23 B) ranges from 1 to 15 mm in the portion ( 15 S) of the sealing layer ( 15 ) extending axially in radial line with the working layer ( 18 ) or the radially innermost working layer ( 18 ).", "21 . The tire according to claim 16 , wherein an average thickness (Em) of the sealing layer ( 15 ) ranges from 0.4 to 1.6 mm in the portion ( 15 S) of the sealing layer ( 15 ) extending axially in radial line with the working layer ( 18 ) or the radially innermost working layer ( 18 ).", "22 . The tire according to claim 16 , wherein the or each working layer ( 18 ) is delimited axially by two axial edges ( 18 A, 18 B) of the or each working layer ( 18 ) and comprises working filamentary reinforcing elements ( 180 ) extending axially from one axial edge ( 18 A, 18 B) to the other axial edge ( 18 A, 18 B) of the or each working layer ( 18 ) substantially parallel to one another in a main direction (D 2 ) of each working filamentary reinforcing element ( 180 ), the main direction (D 2 ) of each working filamentary reinforcing element ( 180 ) of the or each working layer ( 18 ) forming, with the circumferential direction (Z) of the tire ( 10 ), an angle (AT), in absolute value, strictly greater than 10°.", "an angle (ACS), in absolute value, strictly less than 80° in a portion ( an angle (ACF), in absolute value, ranging from 80° to 90° in at least one portion (", "24 . The tire according to claim 23 , wherein the angle (ACS), in absolute value, is greater than or equal to 10°.", "25 . The tire according to claim 16 , wherein the crown reinforcement ( 14 ) comprises a hoop reinforcement ( 17 ) arranged radially outside the working reinforcement ( 16 ), the hoop reinforcement ( 17 ) being delimited axially by two axial edges ( 17 A, 17 B) of the hoop reinforcement ( 17 ) and comprising at least one hooping filamentary reinforcing element ( 170 ) wound circumferentially helically so as to extend axially from one axial edge ( 17 A, 17 B) to the other axial edge ( 17 A, 17 B) of the hoop reinforcement ( 17 ).", "winding a sealing ply ( winding a carcass ply ( winding a working ply ( deforming the assembly ( wherein the assembly ( in a portion ( in a portion (", "27 . The method according to claim 26 , wherein the final angle (B 4 F) formed by the main direction (K 4 ) of the junction ( 73 ) with the circumferential direction (z) of the support ( 60 ) ranges, in absolute value, from 80° to 90° in the portion ( 72 F) of the wound sealing assembly ( 72 ) intended to extend radially in each sidewall ( 22 ).", "a final angle (B a final angle (B", "29 . The method according to claim 26 , wherein, the or each wound working assembly ( 50 ) being axially delimited by two axial edges ( 50 A, 50 B) of the or each wound working assembly ( 50 ) and comprising working filamentary reinforcing elements ( 180 ) extending substantially parallel to one another axially from one axial edge ( 50 A, 50 B) to the other axial edge ( 50 A, 50 B) of the or each wound working assembly ( 50 ), each working filamentary reinforcing element ( 180 ) extending, in the or each working ply ( 49 ), in a main direction (K 2 ) of each working filamentary reinforcing element ( 180 ) in the or each working ply ( 49 ), the main direction (K 2 ) of each working filamentary reinforcing element ( 180 ) in the or each working ply ( 49 ) forming, with the circumferential direction (Z) of the support ( 60 ), an initial angle (A 2 ) of each working filamentary reinforcing element ( 180 ), the assembly ( 58 ) of substantially cylindrical shape is deformed so as to obtain the assembly ( 58 ) of substantially toric shape so that the main direction (K 2 ) of each working filamentary reinforcing element ( 180 ) forms, with the circumferential direction (z) of the support ( 60 ), a final angle (B 2 ) of each working filamentary reinforcing element ( 180 ), in absolute value, strictly greater than 10°.", "winding a sealing ply ( winding a carcass ply ( deforming the assembly ( then, after the step of deforming the assembly ( wherein, during the step of forming the wound sealing assembly ( in a portion ( in a portion ( wherein the assembly ( in the portion ( in the portion ("], "bibtex": "@patent{20240109370,\n    title = {LOW-NOISE TIRE AND METHOD FOR MANUFACTURING SAME},\n    number = {20240109370},\n    year = {2024},\n    note = {File: US20240109370A1-20240404.XML}\n    }", "classification": "B60C514FI"}, {"title": "TIRE", "doc_number": "20240109371", "filename": "US20240109371A1-20240404.XML", "abstract": "A belt layer includes at least one belt ply. The belt ply includes a single-wire cord having a short diameter SD and a long diameter LD, with a ratio SD/LD between the short diameter SD and the long diameter LD being less than 1.00, and a topping rubber covering the single-wire cord. The single-wire cord is arranged so that a direction of the short diameter SD is oriented to a thickness direction of the belt ply. The topping rubber has a complex elastic modulus (E*) of less than 7 MPa under conditions of temperature of 70 degrees Celsius, initial strain of 10%, an amplitude of dynamic strain of ±1.0%, and a frequency of 10 Hz.", "detailed_description": [""], "claims": ["the at least one belt ply includes a single-wire cord having a short diameter SD and a long diameter LD, with a ratio SD/LD between the short diameter SD and the long diameter LD being less than 1.00, and a topping rubber covering the single-wire cord, the single-wire cord is arranged so that a direction of the short diameter SD is oriented to a thickness direction of the at least one belt ply, and the topping rubber has a complex elastic modulus (E*) of less than 7 MPa under conditions of temperature of 70 degrees Celsius, initial strain of 10%, an amplitude of dynamic strain of ±1.0%, and a frequency of 10 Hz.", "2 . The tire according to claim 1 , wherein the complex elastic modulus (E*) is 5 MPa or less.", "3 . The tire according to claim 1 , wherein the complex elastic modulus (E*) is 3 MPa or more.", "4 . The tire according to claim 1 , wherein the short diameter SD is 0.15 mm to 0.42 mm.", "5 . The tire according to claim 4 , wherein the short diameter SD is 0.20 mm to 0.35 mm.", "6 . The tire according to claim 1 , wherein the ratio SD/LD of the single-wire cord is 0.70 or less.", "7 . The tire according to claim 6 , wherein the ratio SD/LD of the single-wire cord is 0.50 or less.", "8 . The tire according to claim 1 , wherein the belt layer has a plurality of the belt plies.", "9 . The tire according to claim 8 , wherein a distance D between the single-wire cords between the plurality of the belt plies is 0.30 mm to 1.05 mm.", "10 . The tire according to claim 9 , wherein the distance D is 0.50 mm to 0.80 mm.", "11 . The tire according to claim 10 , wherein a difference D-SD between the distance D and the short diameter SD is 0.20 mm to 0.45 mm.", "12 . The tire according to claim 11 , wherein the difference D-SD is 0.25 mm to 0.40 mm.", "the tread portion has a tread rubber having a groove provided in an outer surface thereof, and a minimum rubber thickness from a bottom of the groove to the single-wire cord is 1.0 mm to 4.0 mm.", "14 . The tire according to claim 13 , wherein the minimum rubber thickness is 2.0 mm to 3.0 mm."], "bibtex": "@patent{20240109371,\n    title = {TIRE},\n    number = {20240109371},\n    year = {2024},\n    note = {File: US20240109371A1-20240404.XML}\n    }", "classification": "B60C900FI"}, {"title": "PNEUMATIC TIRE WITH GROOVE", "doc_number": "20240109372", "filename": "US20240109372A1-20240404.XML", "abstract": "A tire comprising a tread portion for contacting the ground and a pair of opposing sidewall portions, the tread portion extending between a pair of shoulders and having an equatorial region in between, the sidewall portions extending essentially in a radial direction from the shoulders, wherein the tread portion comprises next to the shoulder at least one circumferential groove forming a recessed rib, the recessed rib located on the side of the circumferential groove farther away from the equatorial region, said groove has adjacent groove walls with a first groove wall facing away from the equatorial region and a second groove wall facing towards the equatorial region, the second groove wall comprises a protruding portion protruding outwardly away from the equatorial region comprising two diverging regions and in between the diverging regions a non-diverging region, the diverging region on the second groove wall is non-parallel to the first groove wall.", "detailed_description": ["Hereinafter, preferred embodiments of the present invention will be described in detail with reference to the accompanying drawings, so as to assist those having ordinary skill in the art in a comprehensive understanding of the invention, and the present invention is not limited to the embodiments disclosed below. Referring to the drawings, wherein like reference signs designate like or corresponding parts throughout the several views.", "", "FIGS.1and2show a tread portion10of a tire12for contacting the ground, according to a preferred embodiment of the invention. The tread portion10extends between a pair of shoulders14and has an equatorial region16in between the shoulders. In this embodiment the tread portion10comprises two main grooves18formed in the equatorial region16forming three main ribs20. The tread portion10comprises next to the shoulder14at least one circumferential groove22forming a recessed rib24, the recessed rib24located on the side of the circumferential groove22farther away from the equatorial region16.", "", "With reference toFIGS.3and4, it can be seen that the groove22has adjacent groove walls26,28with a first groove wall26facing away from the equatorial region16and a second groove wall28facing towards the equatorial region16. The second groove wall28comprises a protruding portion30protruding outwardly away from the equatorial region16. The protruding portion30comprising two diverging regions32and in between the diverging regions32a non-diverging region34. In the diverging region32the second groove wall28is non-parallel to the first groove wall26and in the non-diverging region34the second groove wall28is essentially parallel to the first groove wall26. Furthermore, the protruding portion30is formed such that a sum of a radial extension36of the diverging regions32is in between 25% to 45% of the radial extension38of the protruding portion30. In this particular embodiment shown inFIGS.1to4the sum of the radial extension36of the diverging regions32is 31% of the radial extension38of the protruding portion30.", "", "Furthermore, as is best seen inFIG.4, the radial extension40of the groove22is determined from an exterior surface42of the recessed rib24facing in the radial direction of the tire, along a shortest line towards the bottom of the groove22and corresponds to the depth of the groove22as well as to the radial extension40of the second groove wall28. As can also be seen inFIG.4, the radial extension40of the second groove wall28is less than a radial extension44of the first groove wall26determined from the tread surface46facing in the radial direction.", "", "Furthermore, the sum of the radial extension36of diverging regions32together with the radial extension48of the non-diverging region34corresponds to the radial extension38of the protruding portion30. Also, the first groove wall26is free of a protruding portion and is formed by an even plain.", "", "A non-skid depth (NSD) of the tread portion10is defined by the depth of the grooves. If there are grooves of differing depths, the maximum groove depth will define the NSD of the tread portion. For the embodiment shown inFIGS.1to4, the NSD is defined by the depth of the main grooves18. The radial extension40of the groove22is in this embodiment 90% of the NSD. A heavy-duty tire12may have a NSD in the range of more than 12 mm to less than 19 mm. For this embodiment the NSD is 15.5 mm.", "", "Furthermore, in this embodiment a width37of the groove22is 13% of a width38of the main groove18, wherein the width38of the main groove18is determined at the surface of the tread portion10. Furthermore, the recessed rib24compared to the main rib18is recessed 10% with respect to a radial extension41of the main groove18.", "", "FIG.5shows a sectional view of a tire12according to a further embodiment of the invention. The tire12is configured as Line Haul tire, having a Size of 295/75R22.5. The tire12illustrated inFIG.1comprises at its radial outer end the tread portion10for contacting the ground. The tire12is provided with a pair of bead portions50and further with a pair of opposing sidewall portions52which extend outwardly in the tire radial direction54from the respective bead portions50towards the pair of shoulders14.", "", "The tire12is provided with a carcass56which spans the distance between the cores of the pair of bead portions50, and an inner liner58which is arranged at a location toward the interior from the carcass56and retains air pressure. The carcass56and the inner liner58are arranged in parallel fashion with respect to the inner circumferential surface of the tire12over a portion thereof that encompasses the bead portion50, the sidewall portion52, and the tread portion10. The carcass56folds back upon itself and wraps around the bead portion50in order to envelop the bead portion50. The tire12further comprises a reinforcing ply60being sandwiched between the tread portion10and the carcass56.", "", "The tread portion10is provided with a plurality of main grooves18, in this embodiment two main grooves18, forming three main ribs20. The main grooves18extend in the tire circumferential direction. Each main groove18extends continuously in the tire circumferential direction. Similar to the embodiment shown inFIGS.1to4, the tread portion10comprises next to the shoulder14a circumferential groove22forming a recessed rib24, the recessed rib24located on the side of the circumferential groove22farther away from the equatorial region16. With regard to the specific form of the groove22, the groove22of the embodiment shown inFIG.5is depicted inFIG.6and has the same form as the groove22depicted inFIGS.3and4.", "", "In other words, the groove22has adjacent groove walls26,28and the second groove wall28comprises a protruding portion30. Furthermore, the protruding portion30comprises two diverging regions32and in between the diverging regions32a non-diverging region34. The protruding portion30is formed such that the sum of the radial extension36of the diverging regions32is 31% of the radial extension38of the protruding portion30. Furthermore, the recessed rib24has a radially outer width62and a radially inner width64, and wherein the radially outer width62is greater than the radially inner width62. Furthermore, the protruding portion30may be formed such that the sum of the radial extension36of the diverging regions32varies continuously along the circumferential extension of the groove22in the range between 25% and 45% of the radial extension38of the protruding portion30.", "", "In order to explain the effect of the specific form of the groove22, having protruding portion30comprises two diverging regions32and in between the diverging regions32a non-diverging region34, wherein the protruding portion30is formed such that the sum of the radial extension36of the diverging regions34is 25% to 45% of the radial extension38of the protruding portion30, it is referred toFIGS.7A-7D.", "", "FIG.7Cshows a groove22according to a further embodiment of the invention. In this particular embodiment, the protruding portion30is formed such that the sum of the radial extension36of the diverging regions32is 45% of the radial extension38of the protruding portion30. InFIGS.7A,7B and7Dgroove22′ is formed differently such that the sum of the radial extension36′ of the diverging regions32′ is outside of 25% to 45% compared to the radial extension38′ of the protruding portion30′. InFIG.7Athe form of the groove22′ is such that the sum of the radial extension36′ of the diverging regions32′ is 75% of the radial extension38′ of the protruding portion30′; inFIG.7Bthe form of the groove is such that the sum of the radial extension36′ of the diverging regions32′ is 55% of the radial extension38′ of the protruding portion30′, and inFIG.7Dthe form of the groove22′ is such that the sum of the radial extension36′ of the diverging regions32′ is 15% of the radial extension38′ of the protruding portion30′.", "", "With regard toFIG.7Awhere the sum of the radial extension36′ of the diverging regions32′ with regard to the radial extension38′ of the protruding portion30′ is too high, the sharp connection joint between the two diverging regions32′ leads to a high point load and causes high strain that affects the lifetime of the groove22′ negatively. With regard toFIG.7Bwhere the sum of the radial extension36′ of the diverging regions32′ with regard to the radial extension38′ of the protruding portion30′ is still too high, the form of the protruding portion30′ decreases the stability of the second groove wall28′ and thus creates an instability of the recessed rib24′.", "", "With regard toFIG.7Dwhere the sum of the radial extension36′ of the diverging regions32′ with regard to the radial extension38′ of the protruding portion30′ is too low, the sharp connection joint between the diverging region32′ and the bottom of the groove22′ leads to a high strain causing failure in the structural integrity and affecting the lifetime of the groove22′ negatively."], "claims": ["the tread portion extending between a pair of shoulders and having an equatorial region in between, the sidewall portions extending essentially in a radial direction from the shoulders, wherein the tread portion comprises next to the shoulder at least one circumferential groove extending from a groove bottom toward the tread portion, the circumferential groove forming a recessed rib, the recessed rib located on the side of the circumferential groove farther away from the equatorial region, the recessed rib has a radially outer width, wherein said groove has adjacent groove walls with a first groove wall facing away from the equatorial region and a second groove wall facing towards the equatorial region, wherein the second groove wall comprises a protruding portion protruding outwardly away from the equatorial region, the protruding portion comprising two diverging regions and in between the diverging regions a non-diverging region, wherein the diverging region on the second groove wall is non-parallel to the first groove wall, wherein the non-diverging region on the second groove wall is parallel to the first groove wall, the recessed rib has a radially inner width at the non-diverging region, wherein the recessed rib has a groove bottom width at the groove bottom, the radially inner width being less than both the radially outer width and the groove bottom width to change a concentration of strain magnitude at the groove bottom, and wherein a sum of a radial extension of the diverging regions is in between 25% to 45% of the radial extension of the protruding portion.", "2 . The tire according to claim 1 , wherein a surface area of the first groove wall is less than a surface area of the second groove wall.", "3 . (canceled)", "4 . (canceled)", "5 . The tire according to claim 1 , wherein a direction of radial extension of the groove is parallel to the lateral outer surface of the recessed rib facing away from the equatorial region.", "6 . The tire according to claim 1 , wherein a form of a bottom of the groove comprises a circular arc.", "7 . The tire according to claim 1 , wherein the radial extension of the protruding portion is in between 50% to 70% of the radial extension of the second groove wall.", "a) starts at a radial position of 30% to 50% of the radial extension of the second groove wall, or b) ends at a radial position of 80% to 100% of the second groove wall, or c) a combination of a) and b).", "9 . (canceled)", "10 . The tire according to claim 1 , wherein the tread portion comprises at least one main groove next to the circumferential groove, forming a main rib located on the side of the circumferential groove closer to the equatorial region.", "11 . The tire according to claim 10 , wherein the main rib next to the recessed rib comprises several sipes extending perpendicular to the circumferential groove and being connected to the circumferential groove, wherein a radial extension of the several sipes is less than 80% of the radial extension of the circumferential groove.", "a) bald, or b) profiled and comprises alternating sections with varying radial height in the tire circumferential direction, or c) profiled and comprises a trunk groove extending from the circumferential groove in a lateral direction towards the sidewall, wherein the trunk groove comprises a varying cross section in the lateral direction, or d) a combination of b) and c).", "13 . A wheel for a vehicle comprising a tire rim for being connected to an axle of the vehicle and a tire according to claim 1 mounted to the tire rim.", "wherein the tread molding portion has an equatorial region for molding an equatorial region of the tread portion in between the pair of shoulders, wherein the groove molding portion molds a circumferential groove with a corresponding free space extending in the tire circumferential direction and a recessed rib, the recessed rib located on the side of the circumferential groove farther away from the equatorial region of the tread portion, wherein the blade of the groove molding portion has adjacent blade walls with a first blade wall facing away from the equatorial region of the tread molding portion and a second blade wall facing towards the equatorial region of the tread molding portion, wherein the second blade wall comprises a protruding portion protruding outwardly away from the equatorial region of the tread molding portion, the protruding portion comprising two diverging regions and in between the diverging regions a non-diverging region, wherein the diverging region on the second blade wall is non-parallel to the first blade wall, and wherein the non-diverging region on the second blade wall is parallel to the first blade wall, and wherein a sum of a radial extension of the diverging regions is in between 25% to 45% of the radial extension of the protruding portion.", "15 . The tire according to claim 1 , wherein the second groove wall has a first portion on a first side of the protruding portion and a second portion on a second side of the protruding portion, wherein a first width of the groove at the first portion of the second groove wall and a second width of the groove at the second portion of the groove wall are the same."], "bibtex": "@patent{20240109372,\n    title = {PNEUMATIC TIRE WITH GROOVE},\n    number = {20240109372},\n    year = {2024},\n    note = {File: US20240109372A1-20240404.XML}\n    }", "classification": "B60C1101FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240109373", "filename": "US20240109373A1-20240404.XML", "abstract": "A pneumatic tire that includes a tread surface 1 including: two or more main grooves 3 ; and a pair of middle block rows 22 , wherein one or more first middle blocks in the plurality of middle blocks each have a middle block inclined side wall surface 223 that faces an outer main groove in the pair of outer main grooves and that gradually inclines inwards in a tire radial direction as the middle block inclined side wall surface extends outwards in the tire width direction, and the middle block inclined side wall surface forms an acute angle θ 223 of 30° to 50° with respect to a normal of the tread surface at an inner end in the tire width direction of the middle block inclined side wall surface.", "detailed_description": ["A pneumatic tire according to the present disclosure can be used as any type of pneumatic tire, and it can be suitably used as a pneumatic tire for passenger vehicles, and more suitably used as a pneumatic tire for all-season passenger vehicles.", "", "In the following, an embodiment of the pneumatic tire according to the present disclosure will be illustrated with reference to the drawings.", "", "FIGS.1to6illustrate a tread surface1of the pneumatic tire according to the embodiment of the present disclosure. In addition to the tread surface1,FIG.1andFIGS.3to6also illustrate portions (groove wall surfaces, groove bottom surfaces, or the like) that are depressed inwards in a tire radial direction from the tread surface1.FIG.2illustrates only the tread surface1, and the dotted hatching indicates some portions (groove wall surfaces, groove bottom surfaces, or the like) that are depressed inwards in the tire radial direction from the tread surface1.", "", "Herein, the pneumatic tire is also referred to simply as “tire.”", "", "Herein, the “tread surface (1)” refers to an outer peripheral surface around the entire circumference of the tire that comes into contact with a road surface when the tire is rolled under the maximum load after it has been mounted on a rim and filled to a predetermined internal pressure.", "", "Herein, “ground contact ends (TE1, TE2)” refer to ends in a tire width direction of the tread surface (1).", "", "Herein, a “ground contact width” refers to the distance in the tire width direction between the pair of ground contact ends of the tread surface (1).", "", "Herein, the “rim” refers to a standard rim (which is called a measuring rim in STANDARDS MANUAL of the European Tyre and Rim Technical Organisation [ETRTO], and a design rim in YEAR BOOK of the Tire and Rim Association, Inc. [TRA]) of an applicable size that is described or will be described in industrial standards valid for a region in which the tire is produced or used. Examples of the industrial standards include JATMA YEAR BOOK of the Japan Automobile Tyre Manufacturers Association (JATMA) in Japan, STANDARDS MANUAL of the ETRTO in Europe, and YEAR BOOK of the TRA in the United States of America (that is, the “rim” includes any size currently included and any size which will be possibly included in the industrial standards. Examples of the “size which will be described” include those described as “Future Developments” in the ETRTO STANDARDS MANUAL 2013). As for sizes not described in the industrial standards, the “rim” refers to a rim having a width corresponding to the bead width of the tire.", "", "Moreover, the “predetermined internal pressure” refers to an air pressure (maximum air pressure) corresponding to the maximum load capability of a single wheel of an applicable size/ply rating specified by JATMA YEAR BOOK or the like. As for sizes not described in the industrial standards, the “predetermined internal pressure” refers to an air pressure (maximum air pressure) corresponding to the maximum load capability determined depending on a vehicle to which the tire is mounted.", "", "The “maximum load” refers to a load corresponding to the maximum load capacity described above.", "", "Additionally, air herein can be replaced by inert gas, such as nitrogen gas, or another type of gas.", "", "Herein, unless otherwise specified, the dimensions of elements, such as grooves, sipes, or blocks are measured in a later-described “reference state.” The “reference state” refers to a state in which the tire is mounted on a rim, filled to the predetermined internal pressure, subjected to no load. Herein, the dimensions of elements, such as grooves, sipes, or blocks, on the tread surface are measured in a developed view of the tread surface. Herein, the “developed view of the tread surface” refers to a plan view of the tread face in a state in which the tread surface is developed into a plane.", "", "Herein, the “grooves” refer to grooves having a width of 1.3 mm or more on the tread surface in the aforementioned reference state. In the present embodiment, main grooves3, center lateral grooves41, and lug grooves42to44are provided as the grooves. The grooves preferably has a groove width of 1.5 mm or more. The “groove width” is the distance between a pair of opposing groove wall surfaces when measured perpendicularly to the direction of extension of the groove, and it may be constant or non-constant in the tire radial direction. Each “groove” is preferably configured so that when the tire is mounted on a rim, filled to the predetermined internal pressure, and subjected to the maximum load, the pair of opposing groove wall surfaces right under the load do not contact each other. The grooves have a groove depth of preferably 3 to 20 mm, and more preferably 3 to 11 mm.", "", "Herein, the “sipes” refer to sipes having a sipe width of less than 1.3 mm on the tread surface in the aforementioned reference state. In the present embodiment, center block sipes210S, middle block sipes220S, and shoulder block sipes230S are provided as the sipes. The sipes have a sipe width of preferably 1.0 mm or less, and more preferably 0.8 mm or less. The “sipe width” is the distance between a pair of opposing sipe wall surfaces when measured perpendicularly to the direction of extension of the sipe. Each “sipe” is preferably configured so that when the tire is mounted to a rim, filled to the predetermined internal pressure, and subjected to the maximum load, the pair of opposing sipe wall surfaces right under the load are at least partially in contact with each other. The sipes have a sipe depth of preferably 3 to 20 mm, and more preferably 3 to 11 mm.", "", "Herein, for the sake of convenience, one side in a tire circumferential direction (the upper side inFIG.1) is referred to as “first side CD1in the tire circumferential direction,” and another side in the tire circumferential direction (the lower side inFIG.1) is referred to as “second side CD2in the tire circumferential direction.”", "", "Similarly, for the sake of convenience, one side in the tire width direction (the right side inFIG.1) is referred to as “first side WD1in the tire width direction,” and another side in the tire width direction (the left side inFIG.1) is referred to as “second side WD2in the tire width direction” herein.", "", "As illustrated inFIGS.1and2, the tire according to the present embodiment includes two or more main grooves3on the tread surface1. Each main groove3extends continuously in the tire circumferential direction. The two or more main grooves3include a pair of outer main grooves31, which are positioned on the outermost sides in the tire width direction, and a pair of inner main grooves32, which are positioned inwards in the tire width direction of the pair of outer main grooves31. The pair of inner main grooves32are not situated on a tire equatorial plane CL and are positioned on both sides of the tire equatorial plane CL. However, any one of the inner main grooves32may be positioned on the tire equatorial plane CL.", "", "The number of main grooves3is preferably four or more as in the present embodiment (four in the present embodiment), but it may also be two or three.", "", "The groove depth of the main grooves3is preferably 6 to 20 mm, and more preferably 7 to 11 mm.", "", "The tire according to the present embodiment includes a center block row21, a pair of middle block rows22, and a pair of shoulder block rows23on the tread surface1. These will be described below in order.", "", "First, with reference toFIGS.1to4, the center block row21will be described.FIGS.3and4illustrate the center block row21in an enlarged manner.", "", "The center block row21is provided in a center area of the tread surface1.", "", "The “center area” refers to an area of the tread surface1that is centered on the tire equatorial plane CL and that has a width in the tire width direction of 50% of the ground contact width. On the other hand, “shoulder areas” refer to a pair of areas of the tread surface1that are positioned outwards in the tire width direction of the center area.", "", "It is sufficient for the center block row21to be at least partially positioned within the center area, but preferably the entire center block row21is located within the center area, as in the present embodiment ofFIGS.1and2. Furthermore, the center block row21is preferably positioned on the tire equatorial plane CL as in the present embodiment, but it does not need not be positioned on the tire equatorial plane CL.", "", "The center block row21is defined between the pair of inner main grooves32.", "", "Each inner main groove32extends in a zigzag shape. This improves traction performance and drainage performance.", "", "The center block row21has a plurality of center blocks210arranged along the tire circumferential direction. The plurality of center blocks210are divided by center lateral grooves41. The plurality of center lateral grooves41are arranged along the tire circumferential direction. Although in the present embodiment the center lateral grooves41are positioned on the tire equatorial plane CL, the center lateral grooves41do not need not be positioned on the tire equatorial plane CL. Each center lateral groove41extends in relation to the tire width direction and the tire radial direction, and specifically, it extends more toward the first side CD1in the tire circumferential direction as it extends more toward the first side WD1in the tire width direction.", "", "The plurality of center blocks210constituting the center block row21includes a plurality of types of center blocks210, specifically, a plurality of first center blocks211and a plurality of second center blocks212. More specifically, in the present embodiment, the plurality of center blocks210constituting the center block row21includes only two types of center blocks210, that is, the first center blocks211and the second center blocks212. However, the plurality of center blocks210constituting the center block row21may include three or more types of center blocks210.", "", "As illustrated inFIG.2, the first center blocks211and the second center blocks212have polygonal shapes on the tread surface1. Here, the shape formed by each center block210(each first center block211, each second center block212, or the like) on the tread surface1refers to a shape formed by the outermost surface in the tire radial direction of the center block210in a developed view of the tread surface1.", "", "On the tread surface1, the polygonal shape formed by each second center block212has the same number of sides as, but a different shape than, the polygonal shape formed by each first center block211. More specifically, the polygonal shape formed by any second center block212has the same number of sides as, but a different shape than, the polygonal shape formed by any first center block211. Here, having “different shapes” means that they are non-congruent and dissimilar.", "", "The polygonal shapes formed by the respective first center blocks211on the tread surface1may be congruent or substantially congruent. Similarly, the polygonal shapes formed by the respective second center blocks212on the tread surface1may be congruent or substantially congruent.", "", "Thus, according to the present embodiment, because the shape of each first center block211and the shape of each second center block212have the same number of sides, they have similar shapes compared to a case in which they have different numbers of sides. This can equalize ground contact pressure along the tire circumferential direction during rolling of the tire, and thus, wear resistance performance can be improved.", "", "Furthermore, according to the present embodiment, because the shape of each first center block211and the shape of each second center block212are different, the frequencies of noise generated during rolling of the tire can be offset from one another compared to a case in which their shapes are the same, and thus, noise reduction performance can be improved.", "", "Moreover, according to the present embodiment, because the first center blocks211and the second center blocks212have polygonal shapes, it is easier to arrange the center blocks210in the center block row21such that they are at equal spacing, compared to a case in which they have non-polygonal shapes, such as circular shapes. This can equalize ground contact pressure during rolling of the tire, and thus, wear resistance performance can be improved.", "", "As illustrated inFIGS.3and4, each center block210(and thus each first center block211and each second center block212) includes one or more center block sipes (sipes)210S. Herein, the center block sipes210S included in the first center block211are referred to as “first center block sipes211S,” and the center block sipes210S included in the second center block212are referred to as “second center block sipes212S.”", "", "The number n of second center block sipes212S included in each second center block212is greater than the number m of first center block sipes211S included in each first center block211. Additionally, each first center block211has the same number m of first center block sipes211S. Similarly, each second center block212has the same number n of second center block sipes212S.", "", "In the present embodiment, a plurality of first center block sipes211S are arranged along the tire circumferential direction in each first center block211. The number m of first center block sipes211S included in each first center block211is two. Similarly, a plurality of second center block sipes212S are arranged along the tire circumferential direction in each second center block212. The number n of second center block sipes212S included in each second center block212is three.", "", "According to the present embodiment, because each center block210(and thus each first center block211and each second center block212) includes one or more center block sipes (sipes)210S, edges can be increased compared to a case in which it does not have sipes, and thus, both traction performance and steering stability performance on dry road surfaces can be better achieved.", "", "Furthermore, according to the present embodiment, because the number n of second center block sipes212S included in each second center block212is greater than the number m of first center block sipes211S included in each first center block211, that is, they are different, the frequencies of noise generated during rolling of the tire can be offset from one another compared to a case in which they were the same, and thus, noise reduction performance can be improved.", "", "As described above, according to the pneumatic tire of the present embodiment, both noise reduction performance and wear resistance performance can be better achieved.", "", "On the tread surface1, each center block210(and thus each first center block211and each second center block212) preferably has a hexagonal shape, as in the present embodiment.", "", "This improves durability of the center blocks210.", "", "On the tread surface1, however, each center block210(and thus each first center block211and each second center block212) may have any polygonal shape, such as a triangular shape or a quadrilateral shape.", "", "On the tread surface1, each center block210(and thus each first center block211and each second center block212) preferably has a polygonal shape (convex polygonal shape) with no concave portions, as in the present embodiment. This can improve the durability of the center blocks210.", "", "The number of center block sipes (sipes)210S included in each center block210(and thus each first center block211and each second center block212) is preferably one to five.", "", "This ensures the rigidity of the center blocks210and improves drainage characteristics compared to a case in which the number of center block sipes210S included in each center block210(and thus each first center block211and each second center block212) is six or more.", "", "From the same perspective, the number of center block sipes210S included in each center block210(and thus each first center block211and each second center block212) is preferably one to four.", "", "From the perspective of improving drainage characteristics, the number of center block sipes210S included in each center block210(and thus each first center block211and each second center block212) is preferably two or more.", "", "The number m of first center block sipes211S included in each first center block211and the number n of second center block sipes212S included in each second center block212preferably satisfy", "", "1.3≤n/m≤4.0.", "", "This allows both noise reduction performance and wear resistance performance to be better achieved.", "", "On the tread surface1, the total length of center block sipes210S per area in each center block210(and thus each first center block211and each second center block212) is preferably 0.02 to 0.20 mm/mm2.", "", "This allows both traction performance and steering stability performance on dry road surfaces to be better achieved.", "", "The area of each center block210on the tread surface1refers to an area of the outermost surface in the tire radial direction of the center block210in a developed view of the tread surface1. The total length of center block sipes210S refers to the total length of all the center block sipes210S provided on the center block210.", "", "On the tread surface1, the area of each center block210(and thus the area S1of each first center block211and the area S2of each second center block212) is preferably 300 to 3000 mm2, and more preferably 450 to 2500 mm2.", "", "This allows both noise reduction performance and wear resistance performance to be better achieved.", "", "On the tread surface1, the area S1of each first center block211and the area S2of each second center block212preferably satisfy", "", "0.80≤S2/S1≤1.25,", "", "more preferably satisfy", "", "0.83≤S2/S1≤1.20, and", "", "even more preferably satisfy", "", "0.90≤S2/S1≤1.10.", "", "By thus making the value of the area S1of each first center block211and the value of the area S2of each second center block212close to each other, ground contact pressure can be equalized during rolling of the tire, and thus, wear resistance performance can be further improved.", "", "Additionally, on the tread surface1, the area S1of each first center block211and the area S2of each second center block212are preferably different from each other. This allows the frequencies of noise generated during rolling of the tire to be offset from one another, and thus, noise reduction performance can be further improved. Additionally, the area S2of each second center block212is preferably greater than the area S1of each first center block211(that is, 1.0<S2/S1is preferably satisfied) on the tread surface1.", "", "On the tread surface1, each center block210(and thus each first center block211and each second center block212) preferably has an aspect ratio of 20 to 50%.", "", "This allows both noise reduction performance and wear resistance performance to be better achieved.", "", "Herein, the “aspect ratio” of a shape refers to the ratio of the length LS in a transverse direction perpendicular to a longitudinal direction to the length LL in the longitudinal direction of the shape. InFIG.3, the longitudinal length LL and the transverse length LS of a hexagon formed by a center block210are illustrated for reference. As illustrated inFIG.3, the longitudinal direction in the hexagon formed by the center block210is the direction of extension of the longest diagonal line D in the hexagon.", "", "From the same perspective, on the tread surface1, each center block210(and thus each first center block211and each second center block212) preferably has a length in the tire circumferential direction (the distance in the tire circumferential direction between a pair of outermost ends in the tire circumferential direction of the center block210) that is greater than a length in the tire width direction (the distance in the tire width direction between a pair of outermost ends in the tire width direction of the center block210).", "", "As illustrated inFIG.3, on the tread surface1, each center block210(and thus each first center block211and each second center block212) preferably forms a polygonal shape wherein the longitudinal direction is inclined with respect to the tire width direction and the tire circumferential direction. Specifically, the longitudinal direction of the polygonal shape is inclined more toward the first side CD1in the tire circumferential direction as it extends more toward the first side WD1in the tire width direction.", "", "On the tread surface1, the length in the tire circumferential direction of each second center block212is preferably greater than the length in the tire circumferential direction of each first center block211.", "", "This can further improve noise reduction performance.", "", "Additionally, on the tread surface1, the length in the tire width direction of each second center block212is preferably approximately the same as the length in the tire width direction of each first center block211.", "", "The number A of first center blocks211and the number B of second center blocks212preferably satisfy", "", "0.80≤B/A≤1.25,", "", "more preferably satisfy", "", "0.83≤B/A≤1.20, and", "", "even more preferably satisfy", "", "0.90≤B/A≤1.10.", "", "This allows the frequencies of noise generated during rolling of the tire to be offset from one another, and thus, noise reduction performance can be improved.", "", "Additionally, it is preferable for the first center blocks211and the second center blocks212to be alternately arranged along the tire circumferential direction as in the present embodiment. In this case, the number A of first center blocks211and the number B of second center blocks212satisfy", "", "B/A=1.00.", "", "This can further improve noise reduction performance.", "", "In each center block210(and thus each first center block211and each second center block212), the center block sipes210S are preferably formed over the entire width in the tire width direction of the center block210. In other words, the center block sipes210S preferably open to a pair of inner main grooves32located adjacent to and on both sides in the tire width direction of the center block210.", "", "This can increase edges, and thus, both traction performance and steering stability performance on dry road surfaces can be better achieved.", "", "As illustrated inFIG.3, in the present embodiment, the center block sipes210S of each center block210(and thus each first center block211and each second center block212) include center block first sipe portions210Sp, which open to the inner main groove32located adjacent to and on the second side WD2in the tire width direction of the center block210and which extend more toward the first side CD1in the tire circumferential direction as they extend more toward the first side WD1in the tire width direction, center block second sipe portions210Sq, which open to the inner main groove32located adjacent to and on the first side WD1in the tire width direction of the center block210and which extend more toward the first side CD1in the tire circumferential direction as they extend more toward the first side WD1in the tire width direction, and center block third sipe portions210Sr, which connect the center block first sipe portions210Sp and the center block second sipe portions210Sq. The center block first sipe portions210Sp and the center block second sipe portions210Sq are substantially parallel to each other. The center block third sipe portions210Sr extend more toward the first side CD1in the tire circumferential direction as they extend more toward the first side WD1in the tire width direction, and they form an acute angle with respect to the tire width direction that is greater than those of the center block first sipe portions210Sp and the center block second sipe portions210Sq.", "", "In this way, the center block first sipe portions210Sp and the center block second sipe portions210Sq are inclined with respect to the tire width direction and the tire radial direction, so that the center block first sipe portions210Sp and the center block second sipe portions210Sq are not substantially parallel to outer edges of a ground contact surface. This can improve noise reduction performance.", "", "Furthermore, because the center block sipes210S have a jig-zag shape due to the center block third sipe portions210Sr, block portions divided by the center block sipes210S in the center blocks210can be effectively prevented from collapsing, and thus, steering stability performance can be improved.", "", "As illustrated inFIGS.3and4, in the present embodiment, two first center block sipes211S included in a first center block211have sipe depths that gradually increase as they extend away from each other in the tire width direction. More specifically, one first center block sipe211Sa in the two first center block sipes211S included in the first center block211that is located on the first side CD1in the tire circumferential direction has a sipe depth that gradually increases as it extends toward the first side WD1in the tire width direction. The other first center block sipe211Sb in the two first center block sipes211S included in the first center block211that is located on the second side CD2in the tire circumferential direction has a sipe depth that gradually increases as it extends toward the second side WD2in the tire width direction. As a result, block portions of the first center block211that are divided by the first center block sipes211S can be prevented from interlocking too tightly with the road surface, and thus, wear resistance performance can be improved.", "", "As illustrated inFIGS.3and4, in the present embodiment, two second center block sipes212Sa and212Sc in three second center block sipes212S included in a second center block212that are located on the outermost sides in the tire circumferential direction have sipe depths that gradually increase as they extend away from each other in the tire width direction. More specifically, one second center block sipe212Sa in the three second center block sipes212S included in the second center block212that is located closest to the first side CD1in the tire circumferential direction has a sipe depth that gradually increases as it extends toward the first side WD1in the tire width direction. Another second center block sipe212Sc in the three second center block sipes212S included in the second center block212that is located closest to the second side CD2in the tire circumferential direction has a sipe depth that gradually increases as it extends toward the second side WD2in the tire width direction.", "", "Furthermore, in the present embodiment, the other second center block sipe212Sb in the three second center block sipes212S included in the second center block212that is located in the middle in the tire circumferential direction has a sipe depth that gradually increases as it extends toward both outer sides in the tire width direction.", "", "As illustrated inFIGS.3and4, in the present embodiment, in a first center block sipe211Sa in two first center block sipes211S included in a first center block211that is located on the first side CD1in the tire circumferential direction, the center block third sipe portion210Sr is located closer to the first side WD1in the tire width direction than that in a first center block sipe211Sb in the two first center block sipes211S that is located on the second side CD2in the tire circumferential direction.", "", "As illustrated inFIGS.3and4, in the present embodiment, the closer a center block third sipe portion210Sr in three second center block sipes212S included in a second center block212is located to the first side CD1in the tire circumferential direction, the closer it is located to the first side WD1in the tire width direction.", "", "As illustrated inFIG.4, in the present embodiment, each first center block211has a pair of center block stepped side wall surfaces213, each of which faces an inner main groove32and is provided with a plurality of steps. As illustrated inFIG.3, on the tread surface1, each center block stepped side wall surface213extends more toward the second side CD2in the tire circumferential direction as it extends more toward the first side WD1in the tire width direction.", "", "The center block stepped side wall surfaces213can improve stone-biting resistance.", "", "Additionally, in the present embodiment, respective sidewall surfaces in each first center block211other than the pair of center block stepped side wall surfaces213are flat, with no steps being provided.", "", "Furthermore, in the present embodiment, respective side wall surfaces in each second center block212are flat, with no steps being provided.", "", "Next, the middle block rows22will be described with reference toFIGS.1and2, andFIGS.5and6.FIGS.5and6illustrate a middle block row22in an enlarged manner.", "", "The middle block rows22are provided outwards in the tire width direction of the center block row21and inwards in the tire width direction of the shoulder block rows23. Each middle block row22includes a plurality of middle blocks220arranged along the tire circumferential direction. The plurality of middle blocks220are divided by the middle lug grooves42.", "", "In the present embodiment, the middle block rows22are defined between the inner main grooves32and the outer main grooves31, that is, they are located adjacent to and inwards in the tire width direction of the outer main grooves31.", "", "As illustrated inFIGS.5and6, one or more (in the present embodiment, a plurality of) first middle blocks221in the plurality of middle blocks220constituting the middle block row22include a middle block inclined side wall surface223, which faces the outer main groove31and which gradually inclines inwards in the tire radial direction as it extends outwards in the tire width direction. The middle block inclined side wall surface223preferably forms an acute angle θ223(FIG.6) of 30° to 50° with respect to the normal of the tread surface1at an inner end in the tire width direction of the middle block inclined side wall surface223. As can be seen from comparison betweenFIG.1andFIG.2, the middle block inclined side wall surface223is located inwards in the tire radial direction of the tread surface1. It can be said that the middle block inclined side wall surface223extends into the outer main groove31.", "", "This improves traction performance on muddy ground or the like.", "", "Furthermore, because the middle block inclined side wall surface223gradually inclines inwards in the tire radial direction as it extends outwards in the tire width direction, the outer main groove31can have a straighter shape, compared to a case in which it is parallel to the tread surface1so as to be included in the tread surface1, and thus, water drainage performance can be improved.", "", "From the same perspective, the acute angle θ223(FIG.6) that the middle block inclined side wall surface223forms with respect to the normal of the tread surface1at the inner end in the tire width direction of the middle block inclined side wall surface223is more preferably 33° to 47°.", "", "As illustrated inFIG.2, each outer main groove31extends in a substantially straight shape.", "", "As illustrated inFIGS.5and6, one or more (in the present embodiment, a plurality of) second middle blocks222in the plurality of middle blocks220constituting the middle block row22includes a middle block vertical side wall surface224, which faces the outer main groove31.", "", "The acute angle θ223(FIG.6) that the middle block inclined side wall surface223forms with respect to the normal of the tread surface1at the inner end in the tire width direction of the middle block inclined side wall surface223is greater than the acute angle θ224(FIG.6) that the middle block vertical side wall surface224forms with respect to the normal of the tread surface1at an inner end in the tire width direction of the middle block vertical side wall surface224.", "", "In this way, because the middle block row22includes the first middle blocks221, which each have a middle block inclined side wall surface223, and the second middle blocks222, which each have a middle block vertical side wall surface224, a portion of the middle block row22that faces the outer main groove31is uneven. This can improve traction performance and also improve durability of the middle block row22.", "", "As illustrated inFIGS.5and6, an outer end in the tire width direction of the middle block inclined side wall surface223is preferably positioned outwards in the tire width direction of an outer end in the tire width direction of the middle block vertical side wall surface224. This allows the middle block inclined side wall surface223to extend further into the outer main groove31. This can further improve traction performance. Furthermore, because the outer main groove31is substantially divided by the middle block inclined side wall surface223, air column resonance can be reduced, and thus, noise reduction performance can be improved.", "", "The acute angle θ224(FIG.6) that the middle block vertical side wall surface224forms with respect to the normal of the tread surface1at the inner end in the tire width direction of the middle block vertical side wall surface224is preferably 5° to 25°, and more preferably 10° to 20°.", "", "This can improve drainage characteristics while ensuring the rigidity of the second middle block222.", "", "As illustrated inFIGS.5and6, the middle block inclined side wall surface223preferably has a middle block recess225. The middle block recess225opens to the middle block inclined side wall surface223, and thus communicates to the outer main groove31.", "", "The middle block recess225makes it easier to grip snow and mud, thereby further improving traction performance when driving on snow or mud.", "", "In the developed view (FIG.5) of the tread surface1, the length in the tire circumferential direction of the middle block recess225is preferably 3 to 10 mm. This can further improve traction performance when driving on snow or mud.", "", "From the same perspective, in the developed view (FIG.5) of the tread surface1, the length in the tire width direction of the middle block recess225is preferably 3 to 10 mm.", "", "From the same perspective, the depth in the tire radial direction of the middle block recess225at the deepest portion is preferably 3.4 mm or more.", "", "Additionally, the depth in the tire radial direction of the middle block recess225at the deepest portion is preferably less than or equal to the groove depth of the outer main groove31.", "", "As illustrated inFIGS.5and6, the middle block inclined side wall surface223preferably has a bending sipe226. The bending sipe226has a bent portion226ain the middle of extension of the bending sipe226on the middle block inclined side wall surface223. In the developed views (FIGS.1and5) of the tread surface1, each bending sipe226is bent so as to be convex toward either side of the tire circumferential direction. As illustrated inFIG.1, in the present embodiment, a bending sipe226located on the first side WD1in the tire width direction relative to the tire equatorial plane CL is bent so as to be convex toward the second side CD2in the tire circumferential direction, whereas a bending sipe226located on the second side WD2in the tire width direction relative to the tire equatorial plane CL is bent so as to be convex toward the first side CD1in the tire circumferential direction. The bending sipes226are formed on the middle block inclined side wall surfaces223located inwards in the tire radial direction of the tread surface1, so that they emerge on the ground contact surface, together with the middle block inclined side wall surfaces223, when the tire wears down.", "", "The bending sipes226increase the number of sipes that emerges on the ground contact surface during wear, thereby improving snow and wet performance during wear.", "", "In the developed views (FIGS.1and5) of the tread surface1, a portion226cof a bending sipe226that extends from the bent portion226ato an outer end in the tire width direction of the bending sipe226is preferably substantially parallel to an adjacent lug groove44that is a lug groove most adjacent to the bending sipe226.", "", "This improves snow and wet performance during wear.", "", "Adjacent lug grooves44are defined between the middle block inclined side wall surfaces223and later-described shoulder block inclined side wall surfaces233. Each adjacent lug groove44is located adjacent to and on either side of the tire circumferential direction of a bending sipe226. More specifically, on the second side WD2in the tire width direction relative to the tire equatorial plane CL, an adjacent lug groove44is located adjacent to and on the first side CD1in the tire circumferential direction of a bending sipe226. Furthermore, on the first side WD1in the tire width direction relative to the tire equatorial plane CL, an adjacent lug groove44is located adjacent to and on the second side CD2in the tire circumferential direction of a bending sipe226.", "", "Each adjacent lug groove44extends outwards in the tire width direction continuously from an outer end in the tire width direction of a corresponding one of the middle lug grooves42.", "", "In the developed view (FIG.5) of the tread surface1, the central angle θ226of the bending sipe226is preferably 100° to 160°, and more preferably 114° to 141°.", "", "This improves snow and wet performance during wear.", "", "In the developed view (FIG.5) of the tread surface1, the groove width of the adjacent lug groove44is preferably 3.5 mm or less.", "", "By thus narrowing the adjacent lug groove44, noise reduction performance can be improved, and stone-biting resistance and mud-shedding performance can also be improved.", "", "Additionally, in the developed view (FIG.5) of the tread surface1, the groove width of the adjacent lug groove44is preferably 2.0 mm or more.", "", "The adjacent lug groove44preferably extends more toward the first side CD1in the tire circumferential direction as it extends more toward the first side WD1in the tire width direction, as in the present embodiment.", "", "This can improve stone-biting resistance and noise reduction performance.", "", "The adjacent lug groove44forms an acute angle of preferably 20° to 50°, and more preferably 24° to 46°, with respect to the tire width direction.", "", "This can improve stone-biting resistance and noise reduction performance.", "", "As in the present embodiment, the first middle blocks221and the second middle blocks222preferably have different shapes on the tread surface1. Here, the shape formed by each middle block220(each first middle block221, each second middle block222, or the like) on the tread surface1refers to a shape formed by the outermost surface in the tire radial direction of the middle block220in a developed view of the tread surface1. Having “different shapes” means that they are non-congruent and dis similar.", "", "The shapes formed by the respective first middle blocks221on the tread surface1may be congruent, or they may differ from each other only in terms of dimension in the tire circumferential direction. Similarly, the shapes formed by the respective second middle blocks222on the tread surface1may be congruent, or they may differ from each other only in terms of dimension in the tire circumferential dimension.", "", "According to the present embodiment, because the first middle blocks221and the second middle blocks222have different shapes, the frequencies of noise generated during rolling of the tire can be offset from one another compared to a case in which they have the same shape, and thus, noise reduction performance can be improved.", "", "On the tread surface1, the area S3of each first middle block and the area S4of each second middle block preferably satisfy", "", "0.9≤S4/S3≤1.1.", "", "By thus making the value of the first middle block221and the value of the second middle block222close to each other, ground contact pressure can be equalized during rolling of the tire, and thus, wear resistance performance can be further improved.", "", "As in the present embodiment, it is preferable for each first middle block221and each second middle block222to have polygonal shapes on the tread surface1. This makes it easier to arrange the middle blocks220in the middle block row22at equal spacing, compared to a case in which they have non-polygonal shapes, such as circular shapes. This can equalize ground contact pressure during rolling of the tire, and thus, wear resistance performance can be improved.", "", "In the present embodiment, the first middle blocks221and the second middle blocks222are arranged alternately along the tire circumferential direction.", "", "As illustrated inFIG.1, the first middle blocks221and the second center blocks212face each other in the tire width direction. The second middle blocks222and the first center blocks211face each other in the tire width direction.", "", "As illustrated inFIGS.5and6, in the present embodiment, each middle block220(and thus each first middle block221and each second middle block222) includes one or more middle block sipes (sipes)220S.", "", "According to the present embodiment, because each middle block220(and thus each first middle block221and each second middle block222) includes one or more middle block sipes (sipes)220S, edges can be increased compared to a case in which it does not have sipes, and thus, both traction performance and steering stability performance on dry road surfaces can be better achieved.", "", "In the present embodiment, a plurality of middle block sipes220S are arranged along the tire circumferential direction in each middle block220(and thus each first middle block221and each second middle block222). Each middle block220(and thus each first middle block221and each second middle block222) has the same number of middle block sipes220S. In the present embodiment, the number of middle block sipes220S included in each middle block220(and thus each first middle block221and each second middle block222) is three.", "", "As illustrated inFIG.5, in the present embodiment, the middle block sipes220S of each middle block220(and thus, each first middle block221and each second middle block222) include middle block first sipe portions220Sp, which open to the outer main groove31located adjacent to and outwards in the tire width direction of the middle block220and which extend inwards in the tire width direction and terminate within the middle block220, middle block second sipe portions220Sq, which open to the inner main groove32located adjacent to and inwards in the tire width direction of the middle block220and which extend outwards in the tire width direction and terminate within the middle block220, and middle block third sipe portions220Sr, which connect the middle block first sipe portions220Sp and the middle block second sipe portions220Sq. The middle block first sipe portions220Sp and the middle block second sipe portions220Sq are substantially parallel to each other. The middle block first sipe portions220Sp and the middle block second sipe portions220Sq extend more toward the second side CD2in the tire circumferential direction as they extend more toward the first side WD1in the tire width direction. The middle block third sipe portions220Sr extend more toward the first side CD1in the tire circumferential direction as they extend more toward the first side WD1in the tire width direction.", "", "In this way, the middle block first sipe portions220Sp and the middle block second sipe portions220Sq are inclined with respect to the tire width direction and the tire radial direction, so that the middle block first sipe portions220Sp and the middle block second sipe portions220Sq are not parallel to outer edges of the ground contact surface. This can improve noise reduction performance.", "", "Furthermore, because the middle block sipes220S have a jig-zag shape due to the middle block third sipe portions220Sr, block portions of the middle block220that are divided by the middle block sipes220S can be effectively prevented from collapsing, and thus, steering stability performance can be improved.", "", "As illustrated inFIGS.1and5, in the present embodiment, the middle block recess225in each first middle block221communicates to one of the one or more middle block sipes220S included in the first middle block221. Specifically, in a first middle block221of a middle block row22that is located on the second side WD2in the tire width direction relative to the tire equatorial plane CL, the middle block recess225communicates to a middle block sipe220S in three middle block sipes220S included in the first middle block221that is located closest to the second side CD2in the tire circumferential direction. Furthermore, in a first middle block221of a middle block row22that is located on the first side WD1in the tire width direction relative to the tire equatorial plane CL, the middle block recess225communicates to a middle block sipe220S in three middle block sipes220S included in the first middle block221that is located closest to the first side CD1in the tire circumferential direction.", "", "In the present embodiment, an outer end in the tire width direction of each middle block recess225is located inwards in the tire width direction of the outer end in the tire width direction of the middle block inclined side wall surface223.", "", "As illustrated inFIGS.1and5, in the present embodiment, the bending sipe226in each first middle block221communicates to one of the one or more middle block sipes220S included in the first middle block221. Specifically, in each first middle block221, the bending sipe226communicates to a middle block sipe220S in the three middle block sipes220S included in the first middle block221that is located in the middle in the tire circumferential direction.", "", "As illustrated inFIG.5, in the developed view of the tread surface1, a portion226bof the bending sipe226that extends from the bent portion226ato an inner end in the tire width direction of the bending sipe226is substantially parallel to the middle block first sipe portion220Sp of each middle block sipe220S.", "", "In the present embodiment, the outer end in the tire width direction of the bending sipe226is located inwards in the tire width direction of the outer end in the tire width direction of the middle block inclined side wall surface223.", "", "Next, the shoulder block rows23will be described with reference toFIGS.1and2, andFIGS.5and6.FIGS.5and6illustrate a shoulder block row23in an enlarged manner.", "", "The shoulder block rows23are defined between the ground contact ends TE and the outer main grooves31. That is, the shoulder block rows23are located adjacent to and outwards in the tire width direction of the pair of outer main grooves31. Each shoulder block row23includes a plurality of shoulder blocks230arranged along the tire circumferential direction. The plurality of shoulder blocks230are divided by shoulder lug grooves43.", "", "As illustrated inFIGS.5and6, one or more (in the present embodiment, a plurality of) first shoulder blocks231in the plurality of shoulder blocks230constituting the shoulder block row23include a shoulder block inclined side wall surface233, which faces the outer main groove31and which gradually inclines inwards in the tire radial direction as it extends inwards in the tire width direction. The shoulder block inclined side wall surface233preferably forms an acute angle θ233(FIG.6) of 30° to 50° with respect to the normal of the tread surface1at an outer end in the tire width direction of the shoulder block inclined side wall surface233. As can be seen from comparison betweenFIG.1andFIG.2, the shoulder block inclined side wall surface233is located inwards in the tire radial direction of the tread surface1. It can be said that the shoulder block inclined side wall surface233extends into the outer main groove31.", "", "This improves traction performance on muddy ground or the like.", "", "Furthermore, because the shoulder block inclined side wall surface233gradually inclines inwards in the tire radial direction as it extends inwards in the tire width direction, the outer main groove31can have a straighter shape, compared to a case in which it is parallel to the tread surface1so as to be included in the tread surface1, and thus, water drainage performance can be improved.", "", "From the same perspective, the acute angle θ233(FIG.6) that the shoulder block inclined side wall surface233forms with respect to the normal of the tread surface1at the outer end in the tire width direction of the shoulder block inclined side wall surface233is more preferably 33° to 47°.", "", "As illustrated inFIGS.5and6, one or more (in the present embodiment, a plurality of) second shoulder blocks232in the plurality of shoulder blocks230constituting the shoulder block row23include a shoulder block vertical side wall surface234, which faces the outer main groove31.", "", "The acute angle θ233(FIG.6) that the shoulder block inclined side wall surface233forms with respect to the normal of the tread surface1at the outer end in the tire width direction of the shoulder block inclined side wall surface233is greater than the acute angle θ234(FIG.6) that the shoulder block vertical side wall surface234forms with respect to the normal of the tread surface1at the outer end in the tire width direction of the shoulder block vertical side wall surface234.", "", "In this way, because the shoulder block row23includes the first shoulder blocks231, which each has a shoulder block inclined side wall surface233, and the second shoulder blocks232, which each has a shoulder block vertical side wall surface234, a portion of the shoulder block row23that faces the outer main groove31is uneven. This can improve traction performance and also improve durability of the shoulder block row23.", "", "In the present embodiment, each first shoulder block231has a shoulder block vertical side wall surface234, in addition to a shoulder block inclined side wall surface233. The shoulder block vertical side wall surface234of each first shoulder block231faces the corresponding middle block inclined side wall surface223in the tire width direction.", "", "Each second shoulder block232does not have a shoulder block inclined side wall surface233.", "", "As illustrated inFIGS.5and6, an inner end in the tire width direction of the shoulder block inclined side wall surface233is preferably located inwards in the tire width direction of an inner end in the tire width direction of the shoulder block vertical side wall surface234. This allows the shoulder block inclined side wall surface233to extend further into the outer main groove31. This can further improve traction performance. Furthermore, because the outer main groove31is substantially divided by the shoulder block inclined side wall surface233, air column resonance can be reduced, and thus, noise reduction performance can be improved.", "", "The acute angle θ234(FIG.6) that the shoulder block vertical side wall surface234forms with respect to the normal of the tread surface1at the outer end in the tire width direction of the shoulder block vertical side wall surface234is preferably 5° to 25°, and more preferably 10° to 20°.", "", "This can improve drainage characteristics while ensuring the rigidity of the shoulder block230.", "", "As illustrated inFIGS.5and6, the shoulder block inclined side wall surface233preferably has a shoulder block recess235. The shoulder block recess235opens to the shoulder block inclined side wall surface233, and thus communicates to the outer main groove31.", "", "The shoulder block recess235makes it easier to grip snow and mud, thereby further improving traction performance when driving on snow or mud.", "", "In the developed view (FIG.5) of the tread surface1, the length in the tire circumferential direction of the shoulder block recess235is preferably 3 to 10 mm. This can further improve traction performance when driving on snow or mud.", "", "From the same perspective, in the developed view (FIG.5) of the tread surface1, the length in the tire width direction of the shoulder block recess235is preferably 3 to 10 mm.", "", "From the same perspective, the depth in the tire radial direction of the shoulder block recess235at the deepest portion is preferably 3.4 mm or more.", "", "Additionally, the depth in the tire radial direction of the shoulder block recess235at the deepest portion is preferably less than or equal to the groove depth of the outer main groove31.", "", "In the present embodiment, the first shoulder blocks231and the second shoulder blocks232are arranged alternately along the tire circumferential direction.", "", "The first middles block221and the first shoulder blocks231face each other in the tire width direction. The second middle blocks222and the second shoulder blocks232face each other in the tire width direction.", "", "In the present embodiment, each shoulder block230(and thus each first shoulder block231and each second shoulder block232) includes one or more shoulder block sipes (sipes)230S.", "", "According to the present embodiment, because each shoulder block230(and thus each first shoulder block231and each second shoulder block232) includes one or more shoulder block sipes (sipes)230S, edges can be increased compared to a case in which it does not have sipes, and thus, both traction performance and steering stability performance on dry road surfaces can be better achieved.", "", "In the present embodiment, a plurality of shoulder block sipes230S are arranged along the tire circumferential direction in each shoulder block230(and thus each first shoulder block231and each second shoulder block232). Each shoulder block230(and thus each first shoulder block231and each second shoulder block232) has the same number of shoulder block sipes230S. In the present embodiment, the number of shoulder block sipes230S included in each shoulder block230(and thus each first shoulder block231and each second shoulder block232) is three.", "", "As illustrated inFIGS.1and5, in the present embodiment, the shoulder block recess235in each first shoulder block231communicates to one of the one or more shoulder block sipes230S included in the first shoulder block231. Specifically, in a first shoulder block231of a shoulder block row23that is located on the second side WD2in the tire width direction relative to the tire equatorial plane CL, the shoulder block recess235communicates to a shoulder block sipe230S in three shoulder block sipes230S included in the first shoulder block231that is located closest to the first side CD1in the tire circumferential direction. Furthermore, in a first shoulder block231of a shoulder block row23that is located on the first side WD1in the tire width direction relative to the tire equatorial plane CL, the shoulder block recess235communicates to a shoulder block sipe230S in three shoulder block sipes230S included in the first shoulder block231that is located closest to the second side CD2in the tire circumferential direction.", "", "In the present embodiment, an inner end in the tire width direction of the shoulder block recess235is located at the inner end in the tire width direction of the shoulder block inclined side wall surface233."], "claims": ["a tread surface including: two or more main grooves; and a pair of middle block rows located adjacent to and inwards in a tire width direction of a pair of outer main grooves in the two or more main grooves that are positioned on outermost sides in the tire width direction, wherein each middle block row in the pair of middle block rows includes a plurality of middle blocks arranged along a tire circumferential direction, one or more first middle blocks in the plurality of middle blocks each have a middle block inclined side wall surface that faces an outer main groove in the pair of outer main grooves and that gradually inclines inwards in a tire radial direction as the middle block inclined side wall surface extends outwards in the tire width direction, and the middle block inclined side wall surface forms an acute angle of 30° to 50° with respect to a normal of the tread surface at an inner end in the tire width direction of the middle block inclined side wall surface.", "one or more second middle blocks in the plurality of middle blocks each have a middle block vertical side wall surface that faces an outer main groove in the pair of outer main grooves, the acute angle that the middle block inclined side wall surface forms with respect to the normal of the tread surface at the inner end in the tire width direction of the middle block inclined side wall surface is greater than an acute angle that the middle block vertical side wall surface forms with respect to the normal of the tread surface at an inner end in the tire width direction of the middle block vertical side wall surface, and an outer end in the tire width direction of the middle block inclined side wall surface is positioned outwards in the tire width direction of an outer end in the tire width direction of the middle block vertical side wall surface.", "3 . The pneumatic tire according to claim 2 , wherein the acute angle that the middle block vertical side wall surface forms with respect to the normal of the tread surface at the inner end in the tire width direction of the middle block vertical side wall surface is 5° to 25°.", "4 . The pneumatic tire according to claim 1 , wherein the middle block inclined side wall surface has a middle block recess.", "the middle block inclined side wall surface has a bending sipe, and the bending sipe has a bent portion provided in a middle of extension of the bending sipe on the middle block inclined side wall surface.", "6 . The pneumatic tire according to claim 5 , wherein, in a developed view of the tread surface, a portion of the bending sipe that extends from the bent portion to an outer end in the tire width direction of the bending sipe is substantially parallel to an adjacent lug groove that is a lug groove most adjacent to the bending sipe.", "7 . The pneumatic tire according to claim 6 , wherein the adjacent lug groove forms an acute angle of 20° to 50° with respect to the tire width direction.", "the first middle blocks and the second middle blocks have different shapes on the tread surface, and an area S", "the tread surface further includes a pair of shoulder block rows located adjacent to and outwards in the tire width direction of the pair of outer main grooves, each shoulder block row in the pair of shoulder block rows includes a plurality of shoulder blocks arranged along the tire circumferential direction, one or more first shoulder blocks in the plurality of shoulder blocks each have a shoulder block inclined side wall surface that faces an outer main groove in the pair of outer main grooves and that gradually inclines inwards in the tire radial direction as the shoulder block inclined side wall surface extends inwards in the tire width direction, and the shoulder block inclined side wall surface forms an acute angle of 30° to 50° with respect to the normal of the tread surface at an outer end in the tire width direction of the shoulder block inclined side wall surface.", "10 . The pneumatic tire according to claim 9 , wherein the shoulder block inclined side wall surface has a shoulder block recess.", "11 . The pneumatic tire according to claim 2 , wherein the middle block inclined side wall surface has a middle block recess.", "12 . The pneumatic tire according to claim 3 , wherein the middle block inclined side wall surface has a middle block recess.", "the middle block inclined side wall surface has a bending sipe, and the bending sipe has a bent portion provided in a middle of extension of the bending sipe on the middle block inclined side wall surface.", "the middle block inclined side wall surface has a bending sipe, and the bending sipe has a bent portion provided in a middle of extension of the bending sipe on the middle block inclined side wall surface.", "the middle block inclined side wall surface has a bending sipe, and the bending sipe has a bent portion provided in a middle of extension of the bending sipe on the middle block inclined side wall surface.", "the tread surface further includes a pair of shoulder block rows located adjacent to and outwards in the tire width direction of the pair of outer main grooves, each shoulder block row in the pair of shoulder block rows includes a plurality of shoulder blocks arranged along the tire circumferential direction, one or more first shoulder blocks in the plurality of shoulder blocks each have a shoulder block inclined side wall surface that faces an outer main groove in the pair of outer main grooves and that gradually inclines inwards in the tire radial direction as the shoulder block inclined side wall surface extends inwards in the tire width direction, and the shoulder block inclined side wall surface forms an acute angle of 30° to 50° with respect to the normal of the tread surface at an outer end in the tire width direction of the shoulder block inclined side wall surface.", "the tread surface further includes a pair of shoulder block rows located adjacent to and outwards in the tire width direction of the pair of outer main grooves, each shoulder block row in the pair of shoulder block rows includes a plurality of shoulder blocks arranged along the tire circumferential direction, one or more first shoulder blocks in the plurality of shoulder blocks each have a shoulder block inclined side wall surface that faces an outer main groove in the pair of outer main grooves and that gradually inclines inwards in the tire radial direction as the shoulder block inclined side wall surface extends inwards in the tire width direction, and the shoulder block inclined side wall surface forms an acute angle of 30° to 50° with respect to the normal of the tread surface at an outer end in the tire width direction of the shoulder block inclined side wall surface.", "the tread surface further includes a pair of shoulder block rows located adjacent to and outwards in the tire width direction of the pair of outer main grooves, each shoulder block row in the pair of shoulder block rows includes a plurality of shoulder blocks arranged along the tire circumferential direction, one or more first shoulder blocks in the plurality of shoulder blocks each have a shoulder block inclined side wall surface that faces an outer main groove in the pair of outer main grooves and that gradually inclines inwards in the tire radial direction as the shoulder block inclined side wall surface extends inwards in the tire width direction, and the shoulder block inclined side wall surface forms an acute angle of 30° to 50° with respect to the normal of the tread surface at an outer end in the tire width direction of the shoulder block inclined side wall surface.", "the tread surface further includes a pair of shoulder block rows located adjacent to and outwards in the tire width direction of the pair of outer main grooves, each shoulder block row in the pair of shoulder block rows includes a plurality of shoulder blocks arranged along the tire circumferential direction, one or more first shoulder blocks in the plurality of shoulder blocks each have a shoulder block inclined side wall surface that faces an outer main groove in the pair of outer main grooves and that gradually inclines inwards in the tire radial direction as the shoulder block inclined side wall surface extends inwards in the tire width direction, and the shoulder block inclined side wall surface forms an acute angle of 30° to 50° with respect to the normal of the tread surface at an outer end in the tire width direction of the shoulder block inclined side wall surface.", "the tread surface further includes a pair of shoulder block rows located adjacent to and outwards in the tire width direction of the pair of outer main grooves, each shoulder block row in the pair of shoulder block rows includes a plurality of shoulder blocks arranged along the tire circumferential direction, one or more first shoulder blocks in the plurality of shoulder blocks each have a shoulder block inclined side wall surface that faces an outer main groove in the pair of outer main grooves and that gradually inclines inwards in the tire radial direction as the shoulder block inclined side wall surface extends inwards in the tire width direction, and the shoulder block inclined side wall surface forms an acute angle of 30° to 50° with respect to the normal of the tread surface at an outer end in the tire width direction of the shoulder block inclined side wall surface."], "bibtex": "@patent{20240109373,\n    title = {PNEUMATIC TIRE},\n    number = {20240109373},\n    year = {2024},\n    note = {File: US20240109373A1-20240404.XML}\n    }", "classification": "B60C1103FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240109374", "filename": "US20240109374A1-20240404.XML", "abstract": "A pneumatic tire including a center block row 21 provided in a center area of a tread surface 1 , wherein the center block row includes a plurality of center blocks 210 arranged along a tire circumferential direction, the plurality of center blocks includes a plurality of first center blocks 211 and a plurality of second center blocks 212 , the plurality of first center blocks and the plurality of second center blocks have polygonal shapes on the tread surface, the polygonal shape formed by each second center block has a same number of sides as, but a different shape than, the polygonal shape formed by each first center block, each first center block and each second center block has one or more sipes, and a number n of sipes included in each second center block is greater than a number m of sipes included in each first center block.", "detailed_description": ["A pneumatic tire according to the present disclosure can be used as any type of pneumatic tire, and it can be suitably used as a pneumatic tire for passenger vehicles, and more suitably used as a pneumatic tire for all-season passenger vehicles.", "", "In the following, an embodiment of the pneumatic tire according to the present disclosure will be illustrated with reference to the drawings.", "", "FIGS.1to6illustrate a tread surface1of the pneumatic tire according to the embodiment of the present disclosure. In addition to the tread surface1,FIG.1andFIGS.3to6also illustrate portions (groove wall surfaces, groove bottom surfaces, or the like) that are depressed inwards in a tire radial direction from the tread surface1.FIG.2illustrates only the tread surface1, and the dotted hatching indicates some portions (groove wall surfaces, groove bottom surfaces, or the like) that are depressed inwards in the tire radial direction from the tread surface1.", "", "Herein, the pneumatic tire is also referred to simply as “tire.”", "", "Herein, the “tread surface (1)” refers to an outer peripheral surface around the entire circumference of the tire that comes into contact with a road surface when the tire is rolled under the maximum load after it has been mounted on a rim and filled to a predetermined internal pressure.", "", "Herein, “ground contact ends (TE1, TE2)” refer to ends in a tire width direction of the tread surface (1).", "", "Herein, a “ground contact width” refers to the distance in the tire width direction between the pair of ground contact ends of the tread surface (1).", "", "Herein, the “rim” refers to a standard rim (which is called a measuring rim in STANDARDS MANUAL of the European Tyre and Rim Technical Organisation [ETRTO], and a design rim in YEAR BOOK of the Tire and Rim Association, Inc. [TRA]) of an applicable size that is described or will be described in industrial standards valid for a region in which the tire is produced or used. Examples of the industrial standards include JATMA YEAR BOOK of the Japan Automobile Tyre Manufacturers Association (JATMA) in Japan, STANDARDS MANUAL of the ETRTO in Europe, and YEAR BOOK of the TRA in the United States of America (that is, the “rim” includes any size currently included and any size which will be possibly included in the industrial standards. Examples of the “size which will be described” include those described as “Future Developments” in the ETRTO STANDARDS MANUAL 2013). As for sizes not described in the industrial standards, the “rim” refers to a rim having a width corresponding to the bead width of the tire.", "", "Moreover, the “predetermined internal pressure” refers to an air pressure (maximum air pressure) corresponding to the maximum load capability of a single wheel of an applicable size/ply rating specified by JATMA YEAR BOOK or the like. As for sizes not described in the industrial standards, the “predetermined internal pressure” refers to an air pressure (maximum air pressure) corresponding to the maximum load capability determined depending on a vehicle to which the tire is mounted.", "", "The “maximum load” refers to a load corresponding to the maximum load capacity described above.", "", "Additionally, air herein can be replaced by inert gas, such as nitrogen gas, or another type of gas.", "", "Herein, unless otherwise specified, the dimensions of elements, such as grooves, sipes, or blocks are measured in a later-described “reference state.” The “reference state” refers to a state in which the tire is mounted on a rim, filled to the predetermined internal pressure, subjected to no load. Herein, the dimensions of elements, such as grooves, sipes, or blocks, on the tread surface are measured in a developed view of the tread surface. Herein, the “developed view of the tread surface” refers to a plan view of the tread face in a state in which the tread surface is developed into a plane.", "", "Herein, the “grooves” refer to grooves having a width of 1.3 mm or more on the tread surface in the aforementioned reference state. In the present embodiment, main grooves3, center lateral grooves41, and lug grooves42to44are provided as the grooves. The grooves preferably has a groove width of 1.5 mm or more. The “groove width” is the distance between a pair of opposing groove wall surfaces when measured perpendicularly to the direction of extension of the groove, and it may be constant or non-constant in the tire radial direction. Each “groove” is preferably configured so that when the tire is mounted on a rim, filled to the predetermined internal pressure, and subjected to the maximum load, the pair of opposing groove wall surfaces right under the load do not contact each other. The grooves have a groove depth of preferably 3 to 20 mm, and more preferably 3 to 11 mm.", "", "Herein, the “sipes” refer to sipes having a sipe width of less than 1.3 mm on the tread surface in the aforementioned reference state. In the present embodiment, center block sipes210S, middle block sipes220S, and shoulder block sipes230S are provided as the sipes. The sipes have a sipe width of preferably 1.0 mm or less, and more preferably 0.8 mm or less. The “sipe width” is the distance between a pair of opposing sipe wall surfaces when measured perpendicularly to the direction of extension of the sipe. Each “sipe” is preferably configured so that when the tire is mounted to a rim, filled to the predetermined internal pressure, and subjected to the maximum load, the pair of opposing sipe wall surfaces right under the load are at least partially in contact with each other. The sipes have a sipe depth of preferably 3 to 20 mm, and more preferably 3 to 11 mm.", "", "Herein, for the sake of convenience, one side in a tire circumferential direction (the upper side inFIG.1) is referred to as “first side CD1in the tire circumferential direction,” and another side in the tire circumferential direction (the lower side inFIG.1) is referred to as “second side CD2in the tire circumferential direction.”", "", "Similarly, for the sake of convenience, one side in the tire width direction (the right side inFIG.1) is referred to as “first side WD1in the tire width direction,” and another side in the tire width direction (the left side inFIG.1) is referred to as “second side WD2in the tire width direction” herein.", "", "As illustrated inFIGS.1and2, the tire according to the present embodiment includes a plurality of main grooves3on the tread surface1. Each main groove3extends continuously in the tire circumferential direction. The plurality of main grooves3include a pair of outer main grooves31, which are positioned on the outermost sides in the tire width direction, and a pair of inner main grooves32, which are positioned inwards in the tire width direction of the pair of outer main grooves31. The pair of inner main grooves32are not situated on a tire equatorial plane CL and are positioned on both sides of the tire equatorial plane CL. However, any one of the inner main grooves32may be positioned on the tire equatorial plane CL.", "", "The number of main grooves3is preferably four or more as in the present embodiment (four in the present embodiment), but it may also be two or three.", "", "The groove depth of the main grooves3is preferably 6 to 20 mm, and more preferably 7 to 11 mm.", "", "The tire according to the present embodiment includes a center block row21, a pair of middle block rows22, and a pair of shoulder block rows23on the tread surface1. These will be described below in order.", "", "First, with reference toFIGS.1to4, the center block row21will be described.FIGS.3and4illustrate the center block row21in an enlarged manner.", "", "The center block row21is provided in a center area of the tread surface1.", "", "The “center area” refers to an area of the tread surface1that is centered on the tire equatorial plane CL and that has a width in the tire width direction of 50% of the ground contact width. On the other hand, “shoulder areas” refer to a pair of areas of the tread surface1that are positioned outwards in the tire width direction of the center area.", "", "It is sufficient for the center block row21to be at least partially positioned within the center area, but preferably the entire center block row21is located within the center area, as in the present embodiment ofFIGS.1and2. Furthermore, the center block row21is preferably positioned on the tire equatorial plane CL as in the present embodiment, but it does not need not be positioned on the tire equatorial plane CL.", "", "The center block row21is defined between the pair of inner main grooves32.", "", "Each inner main groove32extends in a zigzag shape. This improves traction performance and drainage performance.", "", "The center block row21has a plurality of center blocks210arranged along the tire circumferential direction. The plurality of center blocks210are divided by center lateral grooves41. The plurality of center lateral grooves41are arranged along the tire circumferential direction. Although in the present embodiment the center lateral grooves41are positioned on the tire equatorial plane CL, the center lateral grooves41do not need not be positioned on the tire equatorial plane CL. Each center lateral groove41extends in relation to the tire width direction and the tire radial direction, and specifically, it extends more toward the first side CD1in the tire circumferential direction as it extends more toward the first side WD1in the tire width direction.", "", "The plurality of center blocks210constituting the center block row21includes a plurality of types of center blocks210, specifically, a plurality of first center blocks211and a plurality of second center blocks212. More specifically, in the present embodiment, the plurality of center blocks210constituting the center block row21includes only two types of center blocks210, that is, the first center blocks211and the second center blocks212. However, the plurality of center blocks210constituting the center block row21may include three or more types of center blocks210.", "", "As illustrated inFIG.2, the first center blocks211and the second center blocks212have polygonal shapes on the tread surface1. Here, the shape formed by each center block210(each first center block211, each second center block212, or the like) on the tread surface1refers to a shape formed by the outermost surface in the tire radial direction of the center block210in a developed view of the tread surface1.", "", "On the tread surface1, the polygonal shape formed by each second center block212has the same number of sides as, but a different shape than, the polygonal shape formed by each first center block211. More specifically, the polygonal shape formed by any second center block212has the same number of sides as, but a different shape than, the polygonal shape formed by any first center block211. Here, having “different shapes” means that they are non-congruent and dissimilar.", "", "The polygonal shapes formed by the respective first center blocks211on the tread surface1may be congruent or substantially congruent. Similarly, the polygonal shapes formed by the respective second center blocks212on the tread surface1may be congruent or substantially congruent.", "", "Thus, according to the present embodiment, because the shape of each first center block211and the shape of each second center block212have the same number of sides, they have similar shapes compared to a case in which they have different numbers of sides. This can equalize ground contact pressure along the tire circumferential direction during rolling of the tire, and thus, wear resistance performance can be improved.", "", "Furthermore, according to the present embodiment, because the shape of each first center block211and the shape of each second center block212are different, the frequencies of noise generated during rolling of the tire can be offset from one another compared to a case in which their shapes are the same, and thus, noise reduction performance can be improved.", "", "Moreover, according to the present embodiment, because the first center blocks211and the second center blocks212have polygonal shapes, it is easier to arrange the center blocks210in the center block row21such that they are at equal spacing, compared to a case in which they have non-polygonal shapes, such as circular shapes. This can equalize ground contact pressure along the tire circumferential direction during rolling of the tire, and thus, wear resistance performance can be improved.", "", "As illustrated inFIGS.3and4, each center block210(and thus each first center block211and each second center block212) includes one or more center block sipes (sipes)210S. Herein, the center block sipes210S included in the first center block211are referred to as “first center block sipes211S,” and the center block sipes210S included in the second center block212are referred to as “second center block sipes212S.”", "", "The number n of second center block sipes212S included in each second center block212is greater than the number m of first center block sipes211S included in each first center block211. Additionally, each first center block211has the same number m of first center block sipes211S. Similarly, each second center block212has the same number n of second center block sipes212S.", "", "In the present embodiment, a plurality of first center block sipes211S are arranged along the tire circumferential direction in each first center block211. The number m of first center block sipes211S included in each first center block211is two. Similarly, a plurality of second center block sipes212S are arranged along the tire circumferential direction in each second center block212. The number n of second center block sipes212S included in each second center block212is three.", "", "According to the present embodiment, because each center block210(and thus each first center block211and each second center block212) includes one or more center block sipes (sipes)210S, edges can be increased compared to a case in which it does not have sipes, and thus, both traction performance and steering stability performance on dry road surfaces can be better achieved.", "", "Furthermore, according to the present embodiment, because the number n of second center block sipes212S included in each second center block212is greater than the number m of first center block sipes211S included in each first center block211, that is, they are different, the frequencies of noise generated during rolling of the tire can be offset from one another compared to a case in which they were the same, and thus, noise reduction performance can be improved.", "", "As described above, according to the pneumatic tire of the present embodiment, both noise reduction performance and wear resistance performance can be better achieved.", "", "On the tread surface1, each center block210(and thus each first center block211and each second center block212) preferably has a hexagonal shape, as in the present embodiment.", "", "This improves durability of the center blocks210.", "", "On the tread surface1, however, each center block210(and thus each first center block211and each second center block212) may have any polygonal shape, such as a triangular shape or a quadrilateral shape.", "", "On the tread surface1, each center block210(and thus each first center block211and each second center block212) preferably has a polygonal shape (convex polygonal shape) with no concave portions, as in the present embodiment. This can improve the durability of the center blocks210.", "", "The number of center block sipes (sipes)210S included in each center block210(and thus each first center block211and each second center block212) is preferably one to five.", "", "This ensures the rigidity of the center blocks210and improves drainage characteristics compared to a case in which the number of center block sipes210S included in each center block210(and thus each first center block211and each second center block212) is six or more.", "", "From the same perspective, the number of center block sipes210S included in each center block210(and thus each first center block211and each second center block212) is preferably one to four.", "", "From the perspective of improving drainage characteristics, the number of center block sipes210S included in each center block210(and thus each first center block211and each second center block212) is preferably two or more.", "", "The number m of first center block sipes211S included in each first center block211and the number n of second center block sipes212S included in each second center block212preferably satisfy", "", "1.3≤n/m≤4.0.", "", "This allows both noise reduction performance and wear resistance performance to be better achieved.", "", "On the tread surface1, the total length of center block sipes210S per area in each center block210(and thus each first center block211and each second center block212) is preferably 0.02 to 0.20 mm/mm2.", "", "This allows both traction performance and steering stability performance on dry road surfaces to be better achieved.", "", "The area of each center block210on the tread surface1refers to an area of the outermost surface in the tire radial direction of the center block210in a developed view of the tread surface1. The total length of center block sipes210S refers to the total length of all the center block sipes210S provided on the center block210.", "", "On the tread surface1, the area of each center block210(and thus the area S1of each first center block211and the area S2of each second center block212) is preferably 300 to 3000 mm2, and more preferably 450 to 2500 mm2.", "", "This allows both noise reduction performance and wear resistance performance to be better achieved.", "", "On the tread surface1, the area S1of each first center block211and the area S2of each second center block212preferably satisfy", "", "0.80≤S2/S1≤1.25,", "", "more preferably satisfy", "", "0.83≤S2/S1≤1.20, and", "", "even more preferably satisfy", "", "0.90≤S2/S1≤1.10.", "", "By thus making the value of the area S1of each first center block211and the value of the area S2of each second center block212close to each other, ground contact pressure can be equalized along the tire circumferential direction during rolling of the tire, and thus, wear resistance performance can be further improved.", "", "Additionally, on the tread surface1, the area S1of each first center block211and the area S2of each second center block212are preferably different from each other. This allows the frequencies of noise generated during rolling of the tire to be offset from one another, and thus, noise reduction performance can be further improved. Additionally, the area S2of each second center block212is preferably greater than the area S1of each first center block211(that is, 1.0<S2/S1is preferably satisfied) on the tread surface1.", "", "On the tread surface1, each center block210(and thus each first center block211and each second center block212) preferably has an aspect ratio of 20 to 50%.", "", "This allows both noise reduction performance and wear resistance performance to be better achieved.", "", "Herein, the “aspect ratio” of a shape refers to the ratio of the length LS in a transverse direction perpendicular to a longitudinal direction to the length LL in the longitudinal direction of the shape. InFIG.3, the longitudinal length LL and the transverse length LS of a hexagon formed by a center block210are illustrated for reference. As illustrated inFIG.3, the longitudinal direction in the hexagon formed by the center block210is the direction of extension of the longest diagonal line D in the hexagon.", "", "From the same perspective, on the tread surface1, each center block210(and thus each first center block211and each second center block212) preferably has a length in the tire circumferential direction (the distance in the tire circumferential direction between a pair of outermost ends in the tire circumferential direction of the center block210) that is greater than a length in the tire width direction (the distance in the tire width direction between a pair of outermost ends in the tire width direction of the center block210).", "", "As illustrated inFIG.3, on the tread surface1, each center block210(and thus each first center block211and each second center block212) preferably forms a polygonal shape wherein the longitudinal direction is inclined with respect to the tire width direction and the tire circumferential direction. Specifically, the longitudinal direction of the polygonal shape is inclined more toward the first side CD1in the tire circumferential direction as it extends more toward the first side WD1in the tire width direction.", "", "On the tread surface1, the length in the tire circumferential direction of each second center block212is preferably greater than the length in the tire circumferential direction of each first center block211.", "", "This can further improve noise reduction performance.", "", "Additionally, on the tread surface1, the length in the tire width direction of each second center block212is preferably approximately the same as the length in the tire width direction of each first center block211.", "", "The number A of first center blocks211and the number B of second center blocks212", "", "preferably satisfy", "", "0.80≤B/A≤1.25,", "", "more preferably satisfy", "", "0.83≤B/A≤1.20, and", "", "even more preferably satisfy", "", "0.90≤B/A≤1.10.", "", "This allows the frequencies of noise generated during rolling of the tire to be offset from one another, and thus, noise reduction performance can be improved.", "", "Additionally, it is preferable for the first center blocks211and the second center blocks212to be alternately arranged along the tire circumferential direction as in the present embodiment. In this case, the number A of first center blocks211and the number B of second center blocks212satisfy", "", "B/A=1.00.", "", "This can further improve noise reduction performance.", "", "In each center block210(and thus each first center block211and each second center block212), the center block sipes210S are preferably formed over the entire width in the tire width direction of the center block210. In other words, the center block sipes210S preferably open to a pair of inner main grooves32located adjacent to and on both sides in the tire width direction of the center block210.", "", "This can increase edges, and thus, both traction performance and steering stability performance on dry road surfaces can be better achieved.", "", "As illustrated inFIG.3, in the present embodiment, the center block sipes210S of each center block210(and thus each first center block211and each second center block212) include center block first sipe portions210Sp, which open to the inner main groove32located adjacent to and on the second side WD2in the tire width direction of the center block210and which extend more toward the first side CD1in the tire circumferential direction as they extend more toward the first side WD1in the tire width direction, center block second sipe portions210Sq, which open to the inner main groove32located adjacent to and on the first side WD1in the tire width direction of the center block210and which extend more toward the first side CD1in the tire circumferential direction as they extend more toward the first side WD1in the tire width direction, and center block third sipe portions210Sr, which connect the center block first sipe portions210Sp and the center block second sipe portions210Sq. The center block first sipe portions210Sp and the center block second sipe portions210Sq are substantially parallel to each other. The center block third sipe portions210Sr extend more toward the first side CD1in the tire circumferential direction as they extend more toward the first side WD1in the tire width direction, and they form an acute angle with respect to the tire width direction that is greater than those of the center block first sipe portions210Sp and the center block second sipe portions210Sq.", "", "In this way, the center block first sipe portions210Sp and the center block second sipe portions210Sq are inclined with respect to the tire width direction and the tire radial direction, so that the center block first sipe portions210Sp and the center block second sipe portions210Sq are not substantially parallel to outer edges of a ground contact surface. This can improve noise reduction performance.", "", "Furthermore, because the center block sipes210S have a jig-zag shape due to the center block third sipe portions210Sr, block portions divided by the center block sipes210S in the center blocks210can be effectively prevented from collapsing, and thus, steering stability performance can be improved.", "", "As illustrated inFIGS.3and4, in the present embodiment, two first center block sipes211S included in a first center block211have sipe depths that gradually increase as they extend away from each other in the tire width direction. More specifically, one first center block sipe211Sa in the two first center block sipes211S included in the first center block211that is located on the first side CD1in the tire circumferential direction has a sipe depth that gradually increases as it extends toward the first side WD1in the tire width direction. The other first center block sipe211Sb in the two first center block sipes211S included in the first center block211that is located on the second side CD2in the tire circumferential direction has a sipe depth that gradually increases as it extends toward the second side WD2in the tire width direction. As a result, block portions of the first center block211that are divided by the first center block sipes211S can be prevented from interlocking too tightly with the road surface, and thus, wear resistance performance can be improved.", "", "As illustrated inFIGS.3and4, in the present embodiment, two second center block sipes212Sa and212Sc in three second center block sipes212S included in a second center block212that are located on the outermost sides in the tire circumferential direction have sipe depths that gradually increase as they extend away from each other in the tire width direction. More specifically, one second center block sipe212Sa in the three second center block sipes212S included in the second center block212that is located closest to the first side CD1in the tire circumferential direction has a sipe depth that gradually increases as it extends toward the first side WD1in the tire width direction. Another second center block sipe212Sc in the three second center block sipes212S included in the second center block212that is located closest to the second side CD2in the tire circumferential direction has a sipe depth that gradually increases as it extends toward the second side WD2in the tire width direction.", "", "Furthermore, in the present embodiment, the other second center block sipe212Sb in the three second center block sipes212S included in the second center block212that is located in the middle in the tire circumferential direction has a sipe depth that gradually increases as it extends toward both outer sides in the tire width direction.", "", "As illustrated inFIGS.3and4, in the present embodiment, in a first center block sipe211Sa in two first center block sipes211S included in a first center block211that is located on the first side CD1in the tire circumferential direction, the center block third sipe portion210Sr is located closer to the first side WD1in the tire width direction than that in a first center block sipe211Sb in the two first center block sipes211S that is located on the second side CD2in the tire circumferential direction.", "", "As illustrated inFIGS.3and4, in the present embodiment, the closer a center block third sipe portion210Sr in three second center block sipes212S included in a second center block212is located to the first side CD1in the tire circumferential direction, the closer it is located to the first side WD1in the tire width direction.", "", "As illustrated inFIG.4, in the present embodiment, each first center block211has a pair of center block stepped side wall surfaces213, each of which faces an inner main groove32and is provided with a plurality of steps. As illustrated inFIG.3, on the tread surface1, each center block stepped side wall surface213extends more toward the second side CD2in the tire circumferential direction as it extends more toward the first side WD1in the tire width direction.", "", "The center block stepped side wall surfaces213can improve stone-biting resistance.", "", "Additionally, in the present embodiment, respective sidewall surfaces in each first center block211other than the pair of center block stepped side wall surfaces213are flat, with no steps being provided.", "", "Furthermore, in the present embodiment, respective side wall surfaces in each second center block212are flat, with no steps being provided.", "", "Next, the middle block rows22will be described with reference toFIGS.1and2, andFIGS.5and6.FIGS.5and6illustrate a middle block row22in an enlarged manner.", "", "The middle block rows22are provided outwards in the tire width direction of the center block row21and inwards in the tire width direction of the shoulder block rows23. Each middle block row22includes a plurality of middle blocks220arranged along the tire circumferential direction. The plurality of middle blocks220are divided by the middle lug grooves42.", "", "In the present embodiment, the middle block rows22are defined between the inner main grooves32and the outer main grooves31, that is, they are located adjacent to and inwards in the tire width direction of the outer main grooves31.", "", "Additionally, it is not essential to provide the middle block rows22.", "", "As illustrated inFIGS.5and6, one or more (in the present embodiment, a plurality of) first middle blocks221in the plurality of middle blocks220constituting the middle block row22include a middle block inclined side wall surface223, which faces the outer main groove31and which gradually inclines inwards in the tire radial direction as it extends outwards in the tire width direction. The middle block inclined side wall surface223preferably forms an acute angle θ223(FIG.6) of 30° to 50° with respect to the normal of the tread surface1at an inner end in the tire width direction of the middle block inclined side wall surface223. As can be seen from comparison betweenFIG.1andFIG.2, the middle block inclined side wall surface223is located inwards in the tire radial direction of the tread surface1. It can be said that the middle block inclined side wall surface223extends into the outer main groove31.", "", "This improves traction performance on muddy ground or the like.", "", "Furthermore, because the middle block inclined side wall surface223gradually inclines inwards in the tire radial direction as it extends outwards in the tire width direction, the outer main groove31can have a straighter shape, compared to a case in which it is parallel to the tread surface1so as to be included in the tread surface1, and thus, water drainage performance can be improved.", "", "From the same perspective, the acute angle θ223(FIG.6) that the middle block inclined side wall surface223forms with respect to the normal of the tread surface1at the inner end in the tire width direction of the middle block inclined side wall surface223is more preferably 33° to 47°.", "", "As illustrated inFIG.2, each outer main groove31extends in a substantially straight shape.", "", "As illustrated inFIGS.5and6, one or more (in the present embodiment, a plurality of) second middle blocks222in the plurality of middle blocks220constituting the middle block row22includes a middle block vertical side wall surface224, which faces the outer main groove31.", "", "The acute angle θ223(FIG.6) that the middle block inclined side wall surface223forms with respect to the normal of the tread surface1at the inner end in the tire width direction of the middle block inclined side wall surface223is greater than the acute angle θ224(FIG.6) that the middle block vertical side wall surface224forms with respect to the normal of the tread surface1at an inner end in the tire width direction of the middle block vertical side wall surface224.", "", "In this way, because the middle block row22includes the first middle blocks221, which each have a middle block inclined side wall surface223, and the second middle blocks222, which each have a middle block vertical side wall surface224, a portion of the middle block row22that faces the outer main groove31is uneven. This can improve traction performance and also improve durability of the middle block row22.", "", "As illustrated inFIGS.5and6, an outer end in the tire width direction of the middle block inclined side wall surface223is preferably positioned outwards in the tire width direction of an outer end in the tire width direction of the middle block vertical side wall surface224. This allows the middle block inclined side wall surface223to extend further into the outer main groove31. This can further improve traction performance. Furthermore, because the outer main groove31is substantially divided by the middle block inclined side wall surface223, air column resonance can be reduced, and thus, noise reduction performance can be improved.", "", "The acute angle θ224(FIG.6) that the middle block vertical side wall surface224forms with respect to the normal of the tread surface1at the inner end in the tire width direction of the middle block vertical side wall surface224is preferably 5° to 25°, and more preferably 10° to 20°.", "", "This can improve drainage characteristics while ensuring the rigidity of the second middle block222.", "", "As illustrated inFIGS.5and6, the middle block inclined side wall surface223preferably has a middle block recess225. The middle block recess225opens to the middle block inclined side wall surface223, and thus communicates to the outer main groove31.", "", "The middle block recess225makes it easier to grip snow and mud, thereby further improving traction performance when driving on snow or mud.", "", "In the developed view (FIG.5) of the tread surface1, the length in the tire circumferential direction of the middle block recess225is preferably 3 to 10 mm. This can further improve traction performance when driving on snow or mud.", "", "From the same perspective, in the developed view (FIG.5) of the tread surface1, the length in the tire width direction of the middle block recess225is preferably 3 to 10 mm.", "", "From the same perspective, the depth in the tire radial direction of the middle block recess225at the deepest portion is preferably 3.4 mm or more.", "", "Additionally, the depth in the tire radial direction of the middle block recess225at the deepest portion is preferably less than or equal to the groove depth of the outer main groove31.", "", "As illustrated inFIGS.5and6, the middle block inclined side wall surface223preferably has a bending sipe226. The bending sipe226has a bent portion226ain the middle of extension of the bending sipe226on the middle block inclined side wall surface223. In the developed views (FIGS.1and5) of the tread surface1, each bending sipe226is bent so as to be convex toward either side of the tire circumferential direction. As illustrated inFIG.1, in the present embodiment, a bending sipe226located on the first side WD1in the tire width direction relative to the tire equatorial plane CL is bent so as to be convex toward the second side CD2in the tire circumferential direction, whereas a bending sipe226located on the second side WD2in the tire width direction relative to the tire equatorial plane CL is bent so as to be convex toward the first side CD1in the tire circumferential direction. The bending sipes226are formed on the middle block inclined side wall surfaces223located inwards in the tire radial direction of the tread surface1, so that they emerge on the ground contact surface, together with the middle block inclined side wall surfaces223, when the tire wears down.", "", "The bending sipes226increase the number of sipes that emerges on the ground contact surface during wear, thereby improving snow and wet performance during wear.", "", "In the developed views (FIGS.1and5) of the tread surface1, a portion226cof a bending sipe226that extends from the bent portion226ato an outer end in the tire width direction of the bending sipe226is preferably substantially parallel to an adjacent lug groove44that is a lug groove most adjacent to the bending sipe226.", "", "This improves snow and wet performance during wear.", "", "Adjacent lug grooves44are defined between the middle block inclined side wall surfaces223and later-described shoulder block inclined side wall surfaces233. Each adjacent lug groove44is located adjacent to and on either side of the tire circumferential direction of a bending sipe226. More specifically, on the second side WD2in the tire width direction relative to the tire equatorial plane CL, an adjacent lug groove44is located adjacent to and on the first side CD1in the tire circumferential direction of a bending sipe226. Furthermore, on the first side WD1in the tire width direction relative to the tire equatorial plane CL, an adjacent lug groove44is located adjacent to and on the second side CD2in the tire circumferential direction of a bending sipe226.", "", "Each adjacent lug groove44extends outwards in the tire width direction continuously from an outer end in the tire width direction of a corresponding one of the middle lug grooves42.", "", "In the developed view (FIG.5) of the tread surface1, the central angle θ226of the bending sipe226is preferably 100° to 160°, and more preferably 114° to 141°.", "", "This improves snow and wet performance during wear.", "", "In the developed view (FIG.5) of the tread surface1, the groove width of the adjacent lug groove44is preferably 3.5 mm or less.", "", "By thus narrowing the adjacent lug groove44, noise reduction performance can be improved, and stone-biting resistance and mud-shedding performance can also be improved.", "", "Additionally, in the developed view (FIG.5) of the tread surface1, the groove width of the adjacent lug groove44is preferably 2.0 mm or more.", "", "The adjacent lug groove44preferably extends more toward the first side CD1in the tire circumferential direction as it extends more toward the first side WD1in the tire width direction, as in the present embodiment.", "", "This can improve stone-biting resistance and noise reduction performance.", "", "The adjacent lug groove44forms an acute angle of preferably 20° to 50°, and more preferably 24° to 46°, with respect to the tire width direction.", "", "This can improve stone-biting resistance and noise reduction performance.", "", "As in the present embodiment, the first middle blocks221and the second middle blocks222preferably have different shapes on the tread surface1. Here, the shape formed by each middle block220(each first middle block221, each second middle block222, or the like) on the tread surface1refers to a shape formed by the outermost surface in the tire radial direction of the middle block220in a developed view of the tread surface1. Having “different shapes” means that they are non-congruent and dissimilar.", "", "The shapes formed by the respective first middle blocks221on the tread surface1may be congruent, or they may differ from each other only in terms of dimension in the tire circumferential direction. Similarly, the shapes formed by the respective second middle blocks222on the tread surface1may be congruent, or they may differ from each other only in terms of dimension in the tire circumferential dimension.", "", "According to the present embodiment, because the first middle blocks221and the second middle blocks222have different shapes, the frequencies of noise generated during rolling of the tire can be offset from one another compared to a case in which they have the same shape, and thus, noise reduction performance can be improved.", "", "On the tread surface1, the area S3of each first middle block and the area S4of each second middle block preferably satisfy", "", "0.9≤S4/S3≤1.1.", "", "By thus making the value of the first middle block221and the value of the second middle block222close to each other, ground contact pressure can be equalized along the tire circumferential direction during rolling of the tire, and thus, wear resistance performance can be further improved.", "", "As in the present embodiment, it is preferable for each first middle block221and each second middle block222to have polygonal shapes on the tread surface1. This makes it easier to arrange the middle blocks220in the middle block row22at equal spacing, compared to a case in which they have non-polygonal shapes, such as circular shapes. This can equalize ground contact pressure along the tire circumferential direction during rolling of the tire, and thus, wear resistance performance can be improved.", "", "In the present embodiment, the first middle blocks221and the second middle blocks222are arranged alternately along the tire circumferential direction.", "", "As illustrated inFIG.1, the first middle blocks221and the second center blocks212face each other in the tire width direction. The second middle blocks222and the first center blocks211face each other in the tire width direction.", "", "As illustrated inFIGS.5and6, in the present embodiment, each", "", "middle block220(and thus each first middle block221and each second middle block222) includes one or more middle block sipes (sipes)220S.", "", "According to the present embodiment, because each middle block220(and thus each first middle block221and each second middle block222) includes one or more middle block sipes (sipes)220S, edges can be increased compared to a case in which it does not have sipes, and thus, both traction performance and steering stability performance on dry road surfaces can be better achieved.", "", "In the present embodiment, a plurality of middle block sipes220S are arranged along the tire circumferential direction in each middle block220(and thus each first middle block221and each second middle block222). Each middle block220(and thus each first middle block221and each second middle block222) has the same number of middle block sipes220S. In the present embodiment, the number of middle block sipes220S included in each middle block220(and thus each first middle block221and each second middle block222) is three.", "", "As illustrated inFIG.5, in the present embodiment, the middle block sipes220S of each middle block220(and thus, each first middle block221and each second middle block222) include middle block first sipe portions220Sp, which open to the outer main groove31located adjacent to and outwards in the tire width direction of the middle block220and which extend inwards in the tire width direction and terminate within the middle block220, middle block second sipe portions220Sq, which open to the inner main groove32located adjacent to and inwards in the tire width direction of the middle block220and which extend outwards in the tire width direction and terminate within the middle block220, and middle block third sipe portions220Sr, which connect the middle block first sipe portions220Sp and the middle block second sipe portions220Sq. The middle block first sipe portions220Sp and the middle block second sipe portions220Sq are substantially parallel to each other. The middle block first sipe portions220Sp and the middle block second sipe portions220Sq extend more toward the second side CD2in the tire circumferential direction as they extend more toward the first side WD1in the tire width direction. The middle block third sipe portions220Sr extend more toward the first side CD1in the tire circumferential direction as they extend more toward the first side WD1in the tire width direction.", "", "In this way, the middle block first sipe portions220Sp and the middle block second sipe portions220Sq are inclined with respect to the tire width direction and the tire radial direction, so that the middle block first sipe portions220Sp and the middle block second sipe portions220Sq are not parallel to outer edges of the ground contact surface. This can improve noise reduction performance.", "", "Furthermore, because the middle block sipes220S have a jig-zag shape due to the middle block third sipe portions220Sr, block portions of the middle block220that are divided by the middle block sipes220S can be effectively prevented from collapsing, and thus, steering stability performance can be improved.", "", "As illustrated inFIGS.1and5, in the present embodiment, the middle block recess225in each first middle block221communicates to one of the one or more middle block sipes220S included in the first middle block221. Specifically, in a first middle block221of a middle block row22that is located on the second side WD2in the tire width direction relative to the tire equatorial plane CL, the middle block recess225communicates to a middle block sipe220S in three middle block sipes220S included in the first middle block221that is located closest to the second side CD2in the tire circumferential direction. Furthermore, in a first middle block221of a middle block row22that is located on the first side WD1in the tire width direction relative to the tire equatorial plane CL, the middle block recess225communicates to a middle block sipe220S in three middle block sipes220S included in the first middle block221that is located closest to the first side CD1in the tire circumferential direction.", "", "In the present embodiment, an outer end in the tire width direction of each middle block recess225is located inwards in the tire width direction of the outer end in the tire width direction of the middle block inclined side wall surface223.", "", "As illustrated inFIGS.1and5, in the present embodiment, the bending sipe226in each first middle block221communicates to one of the one or more middle block sipes220S included in the first middle block221. Specifically, in each first middle block221, the bending sipe226communicates to a middle block sipe220S in the three middle block sipes220S included in the first middle block221that is located in the middle in the tire circumferential direction.", "", "As illustrated inFIG.5, in the developed view of the tread surface1, a portion226bof the bending sipe226that extends from the bent portion226ato an inner end in the tire width direction of the bending sipe226is substantially parallel to the middle block first sipe portion220Sp of each middle block sipe220S.", "", "In the present embodiment, the outer end in the tire width direction of the bending sipe226is located inwards in the tire width direction of the outer end in the tire width direction of the middle block inclined side wall surface223.", "", "Next, the shoulder block rows23will be described with reference toFIGS.1and2, andFIGS.5and6.FIGS.5and6illustrate a shoulder block row23in an enlarged manner.", "", "The shoulder block rows23are defined between the ground contact ends TE and the outer main grooves31. That is, the shoulder block rows23are located adjacent to and outwards in the tire width direction of the pair of outer main grooves31. Each shoulder block row23includes a plurality of shoulder blocks230arranged along the tire circumferential direction. The plurality of shoulder blocks230are divided by shoulder lug grooves43.", "", "As illustrated inFIGS.5and6, one or more (in the present embodiment, a plurality of) first shoulder blocks231in the plurality of shoulder blocks230constituting the shoulder block row23include a shoulder block inclined side wall surface233, which faces the outer main groove31and which gradually inclines inwards in the tire radial direction as it extends inwards in the tire width direction. The shoulder block inclined side wall surface233preferably forms an acute angle θ233(FIG.6) of 30° to 50° with respect to the normal of the tread surface1at an outer end in the tire width direction of the shoulder block inclined side wall surface233. As can be seen from comparison betweenFIG.1andFIG.2, the shoulder block inclined side wall surface233is located inwards in the tire radial direction of the tread surface1. It can be said that the shoulder block inclined side wall surface233extends into the outer main groove31.", "", "This improves traction performance on muddy ground or the like.", "", "Furthermore, because the shoulder block inclined side wall surface233gradually inclines inwards in the tire radial direction as it extends inwards in the tire width direction, the outer main groove31can have a straighter shape, compared to a case in which it is parallel to the tread surface1so as to be included in the tread surface1, and thus, water drainage performance can be improved.", "", "From the same perspective, the acute angle θ233(FIG.6) that the shoulder block inclined side wall surface233forms with respect to the normal of the tread surface1at the outer end in the tire width direction of the shoulder block inclined side wall surface233is more preferably 33° to 47°.", "", "As illustrated inFIGS.5and6, one or more (in the present embodiment, a plurality of) second shoulder blocks232in the plurality of shoulder blocks230constituting the shoulder block row23include a shoulder block vertical side wall surface234, which faces the outer main groove31.", "", "The acute angle θ233(FIG.6) that the shoulder block inclined side wall surface233forms with respect to the normal of the tread surface1at the outer end in the tire width direction of the shoulder block inclined side wall surface233is greater than the acute angle θ234(FIG.6) that the shoulder block vertical side wall surface234forms with respect to the normal of the tread surface1at the outer end in the tire width direction of the shoulder block vertical side wall surface234.", "", "In this way, because the shoulder block row23includes the first shoulder blocks231, which each has a shoulder block inclined side wall surface233, and the second shoulder blocks232, which each has a shoulder block vertical side wall surface234, a portion of the shoulder block row23that faces the outer main groove31is uneven. This can improve traction performance and also improve durability of the shoulder block row23.", "", "In the present embodiment, each first shoulder block231has a shoulder block vertical side wall surface234, in addition to a shoulder block inclined side wall surface233. The shoulder block vertical side wall surface234of each first shoulder block231faces the corresponding middle block inclined side wall surface223in the tire width direction.", "", "Each second shoulder block232does not have a shoulder block inclined side wall surface233.", "", "As illustrated inFIGS.5and6, an inner end in the tire width direction of the shoulder block inclined side wall surface233is preferably located inwards in the tire width direction of an inner end in the tire width direction of the shoulder block vertical side wall surface234. This allows the shoulder block inclined side wall surface233to extend further into the outer main groove31. This can further improve traction performance. Furthermore, because the outer main groove31is substantially divided by the shoulder block inclined side wall surface233, air column resonance can be reduced, and thus, noise reduction performance can be improved.", "", "The acute angle θ234(FIG.6) that the shoulder block vertical side wall surface234forms with respect to the normal of the tread surface1at the outer end in the tire width direction of the shoulder block vertical side wall surface234is preferably 5° to 25°, and more preferably 10° to 20°.", "", "This can improve drainage characteristics while ensuring the rigidity of the shoulder block230.", "", "As illustrated inFIGS.5and6, the shoulder block inclined side wall surface233preferably has a shoulder block recess235. The shoulder block recess235opens to the shoulder block inclined side wall surface233, and thus communicates to the outer main groove31.", "", "The shoulder block recess235makes it easier to grip snow and mud, thereby further improving traction performance when driving on snow or mud.", "", "In the developed view (FIG.5) of the tread surface1, the length in the tire circumferential direction of the shoulder block recess235is preferably 3 to 10 mm. This can further improve traction performance when driving on snow or mud.", "", "From the same perspective, in the developed view (FIG.5) of the tread surface1, the length in the tire width direction of the shoulder block recess235is preferably 3 to 10 mm.", "", "From the same perspective, the depth in the tire radial direction of the shoulder block recess235at the deepest portion is preferably 3.4 mm or more.", "", "Additionally, the depth in the tire radial direction of the shoulder block recess235at the deepest portion is preferably less than or equal to the groove depth of the outer main groove31.", "", "In the present embodiment, the first shoulder blocks231and the second shoulder blocks232are arranged alternately along the tire circumferential direction.", "", "The first middles block221and the first shoulder blocks231face each other in the tire width direction. The second middle blocks222and the second shoulder blocks232face each other in the tire width direction.", "", "In the present embodiment, each shoulder block230(and thus each first shoulder block231and each second shoulder block232) includes one or more shoulder block sipes (sipes)230S.", "", "According to the present embodiment, because each shoulder block230(and thus each first shoulder block231and each second shoulder block232) includes one or more shoulder block sipes (sipes)230S, edges can be increased compared to a case in which it does not have sipes, and thus, both traction performance and steering stability performance on dry road surfaces can be better achieved.", "", "In the present embodiment, a plurality of shoulder block sipes230S are arranged along the tire circumferential direction in each shoulder block230(and thus each first shoulder block231and each second shoulder block232). Each shoulder block230(and thus each first shoulder block231and each second shoulder block232) has the same number of shoulder block sipes230S. In the present embodiment, the number of shoulder block sipes230S included in each shoulder block230(and thus each first shoulder block231and each second shoulder block232) is three.", "", "As illustrated inFIGS.1and5, in the present embodiment, the shoulder block recess235in each first shoulder block231communicates to one of the one or more shoulder block sipes230S included in the first shoulder block231. Specifically, in a first shoulder block231of a shoulder block row23that is located on the second side WD2in the tire width direction relative to the tire equatorial plane CL, the shoulder block recess235communicates to a shoulder block sipe230S in three shoulder block sipes230S included in the first shoulder block231that is located closest to the first side CD1in the tire circumferential direction. Furthermore, in a first shoulder block231of a shoulder block row23that is located on the first side WD1in the tire width direction relative to the tire equatorial plane CL, the shoulder block recess235communicates to a shoulder block sipe230S in three shoulder block sipes230S included in the first shoulder block231that is located closest to the second side CD2in the tire circumferential direction.", "", "In the present embodiment, an inner end in the tire width direction of the shoulder block recess235is located at the inner end in the tire width direction of the shoulder block inclined side wall surface233."], "claims": ["a center block row provided in a center area of a tread surface, wherein the center block row includes a plurality of center blocks arranged along a tire circumferential direction, the plurality of center blocks includes a plurality of first center blocks and a plurality of second center blocks, the plurality of first center blocks and the plurality of second center blocks have polygonal shapes on the tread surface, the polygonal shape formed by each second center block has a same number of sides as, but a different shape than, the polygonal shape formed by each first center block, each first center block and each second center block has one or more sipes, and a number n of sipes included in each second center block is greater than a number m of sipes included in each first center block.", "2 . The pneumatic tire according to claim 1 , wherein the number of sipes included in each first center block and the number of sipes included in each second center block are 1 to 5.", "3 . The pneumatic tire according to claim 1 , wherein the plurality of first center blocks and the plurality of second center blocks have hexagonal shapes on the tread surface.", "4 . The pneumatic tire according to claim 1 , wherein the number m of sipes included in each first center block and the number n of sipes included in each second center block satisfy 1.3≤ n/m≤ 4.0.", "5 . The pneumatic tire according to claim 1 , wherein, on the tread surface, a total length of sipes per area in each first center block and a total length of sipes per area in each second center block are 0.02 to 0.20 mm/mm 2 .", "6 . The pneumatic tire according to claim 1 , wherein each first center block and each second center block has an aspect ratio of 20 to 50% on the tread surface.", "7 . The pneumatic tire according to claim 1 , wherein, on the tread surface, an area S 1 of each first center block and an area S 2 of each second center block satisfy 0.80≤ S 2/ S 1≤1.25.", "8 . The pneumatic tire according to claim 1 , wherein, on the tread surface, an area S 1 of each first center block and an area S 2 of each second center block are 300 to 3000 mm 2 .", "9 . The pneumatic tire according to claim 1 , wherein the plurality of first center blocks and the plurality of second center blocks are arranged alternately along the tire circumferential direction.", "10 . The pneumatic tire according to claim 2 , wherein the plurality of first center blocks and the plurality of second center blocks have hexagonal shapes on the tread surface.", "11 . The pneumatic tire according to claim 2 , wherein the number m of sipes included in each first center block and the number n of sipes included in each second center block satisfy 1.3≤ n/m≤ 4.0.", "12 . The pneumatic tire according to claim 3 , wherein the number m of sipes included in each first center block and the number n of sipes included in each second center block satisfy 1.3≤ n/m≤ 4.0.", "13 . The pneumatic tire according to claim 2 , wherein, on the tread surface, a total length of sipes per area in each first center block and a total length of sipes per area in each second center block are 0.02 to 0.20 mm/mm 2 .", "14 . The pneumatic tire according to claim 3 , wherein, on the tread surface, a total length of sipes per area in each first center block and a total length of sipes per area in each second center block are 0.02 to 0.20 mm/mm 2 .", "15 . The pneumatic tire according to claim 4 , wherein, on the tread surface, a total length of sipes per area in each first center block and a total length of sipes per area in each second center block are 0.02 to 0.20 mm/mm 2 .", "16 . The pneumatic tire according to claim 1 , wherein each first center block and each second center block has an aspect ratio of 20 to 50% on the tread surface.", "17 . The pneumatic tire according to claim 2 , wherein each first center block and each second center block has an aspect ratio of 20 to 50% on the tread surface.", "18 . The pneumatic tire according to claim 3 , wherein each first center block and each second center block has an aspect ratio of 20 to 50% on the tread surface.", "19 . The pneumatic tire according to claim 4 , wherein each first center block and each second center block has an aspect ratio of 20 to 50% on the tread surface.", "20 . The pneumatic tire according to claim 5 , wherein each first center block and each second center block has an aspect ratio of 20 to 50% on the tread surface."], "bibtex": "@patent{20240109374,\n    title = {PNEUMATIC TIRE},\n    number = {20240109374},\n    year = {2024},\n    note = {File: US20240109374A1-20240404.XML}\n    }", "classification": "B60C1112FI"}]