[{"title": "VEHICLE WHEEL", "doc_number": "20240165989", "filename": "US20240165989A1-20240523.XML", "abstract": "The present disclosure includes a main body outer end which is an outer end of the rim body in the axial direction, a portion of the rim composed of a portion axially outer than the main body outer end, and a ring-shaped portion located on the innermost radial direction of the inner peripheral surface of the rim outer end portion is a rim inner peripheral end, the wall portion, so as to become a wall with respect to the air flowing axially outward along the inner peripheral surface of the rim body, the air hole and the axial direction overlapping portion of the rim inner peripheral end, an opposed portion arranged axially outward spaced apart from each other in the axial direction, extending radially outward from the opposing portion, so as to form one or more openings radially outward from the rim inner peripheral end, and an outer peripheral portion defining at least a portion of the opening.", "detailed_description": ["Hereinafter, a vehicle wheel according to an embodiment of the present disclosure will be described in detail with reference to the drawings as an embodiment for carrying out the present disclosure. In addition to the embodiments described below, the present disclosure can be implemented in various forms in which various changes and improvements are made based on the knowledge of a person skilled in the art."], "claims": ["a cylindrical rim; a disk including a central connection portion connected to a vehicle body, and a plurality of spokes arranged to connect the rim and the central connection portion; and a wall portion disposed so as to partially close a plurality of air holes provided between the spokes, wherein when a radial direction of the rim is defined as a radial direction, a direction parallel to a rotation axis of the rim is defined as an axial direction, a direction away from a vehicle body center line in the axial direction is defined as an axially outward direction, and a direction toward the vehicle body center line in the axial direction is defined as an axially inward direction, the rim includes a cylindrical rim body, a ring-shaped spoke connection portion extending axially outward and radially outward from an axially outer end portion of the rim body, the spokes being connected to the spoke connection portion, a ring-shaped outer rim flange connected to an axially outer end portion of the spoke connection portion, and a ring-shaped inner rim flange connected to an axially inner end portion of the rim body for holding a tire together with the outer rim flange, and when a portion composed of a body outer end that is an axially outer end of the rim body and a portion axially outward of the body outer end of the rim is defined as a rim outer end portion, and a ring-shaped portion located on the radially innermost side of an inner peripheral surface of the rim outer end portion is defined as a rim inner peripheral end, the wall portion includes a facing portion provided so as to be spaced apart in the axially outward direction from a portion of the rim inner peripheral end that overlaps the air hole in the axial direction, the facing portion provided to face the portion in the axial direction, so as to serve as a wall with respect to air flowing axially outward along an inner peripheral surface of the rim body, and an outer peripheral portion extending radially outward from the facing portion and defining at least a part of one or more openings communicating an inside and an outside of the wall portion in the axial direction, so as to provide the one or more openings radially outward from the rim inner peripheral end.", "2 . The vehicle wheel according to claim 1 , wherein the openings are defined by the outer peripheral portion and the rim, or the outer peripheral portion, the rim, and the spokes.", "3 . The vehicle wheel according to claim 1 , further comprising a cap attached to at least one of the rim and the disk, wherein the wall portion is constituted by at least a part of the cap.", "a plurality of the openings is provided, the auxiliary cap is provided with a plurality of auxiliary openings corresponding to the plurality of the openings, and each of the auxiliary openings is located at the same radial position as the openings or is located radially outward of the openings.", "a cylindrical rim; a disk including a central connection portion connected to a vehicle body, a ring-shaped connection portion connected to the rim, and a plurality of spokes arranged to connect the central connection portion and the connection portion; and a wall portion disposed so as to partially close a plurality of air holes provided between the spokes, wherein when a radial direction of the rim is defined as a radial direction, a direction parallel to a rotation axis of the rim is defined as an axial direction, a direction away from a vehicle body center line in the axial direction is defined as an axially outward direction, a direction toward the vehicle body center line in the axial direction is defined as an axially inward direction, and a ring-shaped portion located on the radially innermost side of the inner peripheral surface of the connection portion is defined as an inner peripheral end, the wall portion includes a facing portion provided so as to be spaced apart in the axially outer direction from the inner peripheral end defining a part of the air hole, the facing portion provided to face the inner peripheral end in the axial direction, so as to serve as a wall with respect to air flowing axially outward along the inner peripheral surface of the connection portion, and an outer peripheral portion extending radially outward from the facing portion and defining at least a part of one or more openings communicating an inside and an outside of the wall portion in the axial direction, so as to provide the one or more openings radially outward from the inner peripheral end.", "6 . The vehicle wheel according to claim 5 , wherein the openings are defined by the outer peripheral portion and the rim, or the outer peripheral portion, the rim, and the spokes.", "7 . The vehicle wheel according to claim 5 , further comprising a cap attached to at least one of the rim and the disk, wherein the wall portion is constituted by at least a part of the cap.", "a plurality of the openings is provided, the auxiliary cap is provided with a plurality of auxiliary openings corresponding to the plurality of the openings, and each of the auxiliary openings is located at the same radial position as the openings or is located radially outward of the openings."], "bibtex": "@patent{20240165989,\n    title = {VEHICLE WHEEL},\n    number = {20240165989},\n    year = {2024},\n    note = {File: US20240165989A1-20240523.XML}\n    }", "classification": "B60B304FI"}, {"title": "DYNAMIC VEHICLE WHEEL BALANCE APPARATUS, VEHICLE WHEEL, POWERED VEHICLE, AND METHOD FOR MANUFACTURE THEREOF", "doc_number": "20240165990", "filename": "US20240165990A1-20240523.XML", "abstract": "A dynamic vehicle wheel balance apparatus, a vehicle wheel, a powered vehicle, and a related method for manufacture are provided. The dynamic vehicle wheel balance apparatus comprises a vehicle wheel cover and a dynamic vehicle wheel balance ring. The vehicle wheel cover comprises a first surface, a second surface, and a perimeter surface connecting the first surface to the second surface. The vehicle wheel cover is configured to removably attach to a flange of a vehicle wheel with the second surface opposing the vehicle wheel. The dynamic vehicle wheel balance ring is attached to the second surface of the vehicle wheel cover. The dynamic vehicle wheel balance apparatus dynamically balances the vehicle wheel during rotation of the vehicle wheel and reduces aerodynamic drag.", "detailed_description": ["Various embodiments are described and illustrated herein to provide an overall understanding of the structure, function, and use of the disclosed articles and methods. The various embodiments described and illustrated herein are non-limiting and non-exhaustive. Thus, an invention is not limited by the description of the various non-limiting and non-exhaustive embodiments disclosed herein. Rather, the invention is defined solely by the claims. The features and characteristics illustrated and/or described in connection with various embodiments may be combined with the features and characteristics of other embodiments. Such modifications and variations are intended to be included within the scope of this specification. As such, the claims may be amended to recite any features or characteristics expressly or inherently described in, or otherwise expressly or inherently supported by, this specification. Further, Applicant reserves the right to amend the claims to affirmatively disclaim features or characteristics that may be present in the prior art. The various embodiments disclosed and described in this specification can comprise, consist of, or consist essentially of the features and characteristics as variously described herein.", "", "Any references herein to “various embodiments,” “some embodiments,” “one embodiment,” “an embodiment,” or like phrases mean that a particular feature, structure, or characteristic described in connection with the example is included in at least one embodiment. Thus, appearances of the phrases “in various embodiments,” “in some embodiments,” “in one embodiment,” “in an embodiment,” or like phrases in the specification do not necessarily refer to the same embodiment. Furthermore, the particular described features, structures, or characteristics may be combined in any suitable manner in one or more embodiments. Thus, the particular features, structures, or characteristics illustrated or described in connection with one embodiment may be combined, in whole or in part, with the features, structures, or characteristics of one or more other embodiments without limitation. Such modifications and variations are intended to be included within the scope of the present embodiments.", "", "As used herein, a referenced element or region that is “intermediate” two other elements or regions means that the referenced element/region is disposed between, but is not necessarily in contact with, the two other elements/regions. Accordingly, for example, a referenced element that is “intermediate” a first element and a second element may or may not be immediately adjacent to or in contact with the first and/or second elements, and other elements may be disposed between the referenced element and the first and/or second elements.", "", "Typically, aerodynamic covers and wheel balance rings are independently attached to an axle of a powered vehicle and, therefore, require independent removal. A balance ring is typically mounted between two vehicle wheels in a dual wheel arrangement, or between the axle hub and the vehicle wheel in a single wheel arrangement. Attaching additional components to the hub of the vehicle wheel increases the number of interfaces in the clamped joint at the hub, which can increase the potential for joint loosening. Also, attaching both aerodynamic cover and balance ring components to the hub can increase the mass of the vehicle wheel assembly. Since components such as aerodynamic covers and vehicle wheel balance rings are typically attached to the hub of the axle, removing those components may require removing the nuts and/or bolts that attach the vehicle wheel to the hub. The components may have to be individually removed from the axle each time a vehicle wheel is replaced. The apparatus described in WO 2008/023216 A1 and WO 2003/023252A1, for example, may suffer from one or more of the foregoing disadvantages.", "", "The present disclosure provides a dynamic vehicle wheel balance apparatus comprising a vehicle wheel cover and a dynamic vehicle wheel balance ring. The vehicle wheel cover can comprise a first surface, a second surface, and a perimeter surface connecting the first surface to the second surface. The vehicle wheel cover can be adapted to removably attach to a flange of a vehicle wheel with the second surface opposing the vehicle wheel. The dynamic vehicle wheel balance ring can be attached to the second surface of the vehicle wheel cover. Embodiments of the dynamic vehicle wheel balance apparatus according to the present disclosure can: reduce the number of interfaces in the vehicle wheel/axle joint; reduce the mass required to attach a vehicle wheel cover and a vehicle wheel balance ring to the vehicle wheel; enable installation and/or removal of the vehicle wheel to/from an axle of a powered vehicle without the need to remove the dynamic vehicle wheel balance apparatus from the vehicle wheel; and increase fuel efficient and/or battery life of a vehicle that powers the vehicle wheel.", "", "Referring toFIG.1, a non-limiting embodiment of a dynamic vehicle wheel balance apparatus100is provided. The dynamic vehicle wheel balance apparatus100can comprise a vehicle wheel cover102and a dynamic vehicle wheel balance ring120. In various non-limiting embodiments in which the dynamic vehicle wheel balance apparatus100is connected to a vehicle wheel (e.g., vehicle wheel230illustrated inFIGS.2,3,4A-B, and5A-5B), the dynamic vehicle wheel balance apparatus100can both dynamically balance the vehicle wheel230during rotation of the vehicle wheel and reduce aerodynamic drag of the vehicle wheel230. The dynamic vehicle wheel balance apparatus100can be configured to attach to the vehicle wheel230without the need to attach the apparatus100to a hub of a powered vehicle. As such, in various non-limiting embodiments, installation of the dynamic vehicle wheel balance apparatus100on the vehicle wheel230can occur prior to mounting the vehicle wheel230to the hub and/or the vehicle wheel230can be removed from the hub while the dynamic vehicle wheel balance apparatus100is attached to the vehicle wheel230.", "", "Referring again toFIGS.1A-1B, the vehicle wheel cover102can comprise a first surface104, a second surface106, and a perimeter surface108connecting the first surface104to the second surface106. The vehicle wheel cover102can be adapted to removably attach to a flange of a vehicle wheel (e.g., flange232of vehicle wheel230shown inFIG.2) in an orientation as shown with the second surface106opposing the vehicle wheel. The first surface104of the vehicle wheel cover102can be configured to reduce aerodynamic drag of the vehicle wheel to which the vehicle wheel cover102is operably connected.", "", "The vehicle wheel cover102can define at least two first openings proximal to the perimeter surface108, such as first openings110a,110b,110c,110d, and110eas shown inFIGS.1A-1B. In various non-limiting embodiments, first openings110a-eare located intermediate the dynamic vehicle wheel balance ring120and the perimeter surface108. The first openings110a-110ecan extend from the first surface104to the second surface106, and each first opening110a-110ecan be configured to receive a fastener to operatively couple the vehicle wheel cover102to the flange232of the vehicle wheel230(e.g., as shown and described with respect toFIGS.4A-4B and5A-5B). In various non-limiting embodiments, at least one of the first openings110a-ecan be counter sunk. For example,FIGS.4A-4Bdepict first opening110aas countersunk. In various non-limiting embodiments, at least one of the first openings110a-eis not counter sunk and the first surface102can be substantially planar such that the head of a fastener extends beyond the first surface102. For example,FIGS.5A-5Bdepicts first opening110aas not counter sunk.", "", "Referring again to the rear plan view ofFIG.1B, the dynamic vehicle wheel balance ring120can be connected to the second surface106of the vehicle wheel cover102. For example, the dynamic vehicle wheel balance ring120may be structurally integrated with the vehicle wheel cover102, connected to the vehicle wheel cover102with fasteners, and/or bonded to the vehicle wheel cover (e.g., welded, glued). The dynamic vehicle wheel balance ring120can be configured to minimize and/or eliminate undesired mass distributions as the wheel to which the balance ring120is connected rotates. Mass imbalances in a rotating wheel can result in, for example, wheel vibrations and premature tire wear. In various non-limiting embodiments, the dynamic vehicle wheel balance ring120can comprise a circular raceway enclosing a media. The media may comprise at least one of a moveable object, a fluid (e.g., a liquid), or a combination. The moveable object may be, for example, a spheroidal object (e.g., a ball, an ovoid, a generally spherical shape), a cylinder, or another object that is configured to move within the circular raceway in response to moment of the wheel and thereby adjust the mass distribution of the vehicle wheel230and reduce imbalance. In particular, when the dynamic wheel balance ring120rotates about axis, A1, the media within the balance ring120is subjected to a centrifugal force and is dispersed around the circular raceway in positions that counteract mass imbalances in the rotating vehicle wheel, thereby reducing vibrations in the rotating vehicle wheel.", "", "Referring toFIG.2, in various non-limiting embodiments, the dynamic vehicle wheel balance apparatus100can comprise a snap ring240configured to operatively couple to a flange232of the vehicle wheel230. In various embodiments, the flange232can have any conventional configuration. For example, the flange232of the vehicle wheel230can be configured as the flange region of the vehicle wheel described and depicted in International Application No. PCT/US2020/051829, which is hereby incorporated herein by reference in its entirety. The snap ring240can directly couple the dynamic vehicle wheel balance apparatus100to the vehicle wheel230and/or the snap ring240can be configured to incorporate additional components, such as, for example, clips, adapted to couple the dynamic vehicle wheel balance apparatus100to the vehicle wheel230. For example, in various non-limiting embodiments, the dynamic vehicle wheel apparatus100can comprise at least two clips, such as for example clips244a,224b,244c,244d, and244eas shown inFIG.2, adapted to couple the dynamic vehicle wheel balance apparatus100to the vehicle wheel230.", "", "The configuration of clips244a-ewill now be described with reference to clip244a, but it is understood that any of clips244b-emay or may not, also have the features of clip244adescribed herein. Referring toFIGS.4B and5B, clip244acan comprise a first portion446and a second portion448. The first portion446can be configured to mount to the snap ring240. For example, the first portion446can be substantially J-shaped and configured to be pinned between the snap ring240and the flange232of the vehicle wheel230. The first portion446can comprise a cavity452that is sized to receive the snap ring240, and in various non-limiting embodiments the snap ring240can be press fit into the cavity452.", "", "The second portion448can comprise a bore450configured to be aligned with one of the first openings110a-110eand receive a fastener456and thereby connect the clip244ato the vehicle wheel cover102. In various non-limiting embodiments, the bore450can be threaded, comprise a quick attachment feature, and/or comprise an alternative fastening feature configured to couple to the fastener456.", "", "In the depicted non-limiting embodiments, the second portion448can be positioned offset from the first portion446. Positioning the second portion448offset from the first portion446can lessen a distance that the vehicle wheel cover102extends from the vehicle wheel230when mounted thereto. For example, in various non-limiting embodiments, when the dynamic vehicle wheel balance apparatus100is installed on the vehicle wheel230, the vehicle wheel cover120can protrude a distance, d1, no greater than 10 mm from a flange of the vehicle wheel (as illustrated inFIG.4B), can be substantially aligned with the flange232of the vehicle wheel230(as illustrated inFIG.5B), or can be recessed below the flange232of the vehicle wheel230.", "", "Referring to the non-limiting embodiments illustrated inFIGS.3,4B, and5B, the perimeter surface108can be configured to be located within the cavity234defined by the flange232of the vehicle wheel230when the dynamic vehicle wheel balance apparatus100is installed on the vehicle wheel230. That arrangement can reduce aerodynamic drag on the vehicle wheel cover102. Referring toFIG.4B, perimeter surface108can curve away from the first surface104and into the cavity234. Referring toFIG.5B, the first surface104of the vehicle wheel cover102can be substantially planar (e.g., substantially smooth without any surface projections, indentations, or recesses). However, it will be understood that in alternative non-limiting embodiments the first surface104can be non-planar, include one or more surface projections, include one or more indentations or recesses, etc.", "", "Referring again toFIGS.1A-1B,2, and3, the vehicle wheel cover102defines a second opening112extending from the first surface104to the second surface106. In various non-limiting embodiments, each of the first openings110a-ecan be located intermediate the second opening112and the perimeter surface108. As illustrated inFIG.3, for example, the second opening112can be configured to enable access to one or more stud-receiving bores354defined in the vehicle wheel230when the dynamic vehicle wheel balance apparatus100is installed on the vehicle wheel230. For example, in various embodiments the second opening112can be size to enable a lug nut, a lug bolt, other fastener, an operator's hand, a lug wrench, impact driver, or other tool to pass through the second opening112and towards stud-receiving bores354so that the lug nut and/or lug bolt can be installed on and/or removed from a hub of a powered vehicle while the dynamic vehicle wheel balance apparatus100remains installed on the vehicle wheel230. In various non-limiting embodiments, the second opening112is aligned with the stud-receiving bores354. In certain non-limiting embodiments, the second opening112can enable inspection of the vehicle wheel230or fastener used to secure the vehicle wheel230to the hub of a powered vehicle (e.g., lug nut, lug bolt, other fastener).", "", "Because the dynamic vehicle wheel balance apparatus100can be adapted to couple to the flange232of the vehicle wheel100, the first openings110a-ecan be misaligned with the stud-receiving bore354defined in the vehicle wheel230when the dynamic vehicle wheel balance apparatus100is installed on the vehicle wheel100. In various non-limiting embodiments, the vehicle wheel230can comprise a nominal rim diameter, d2, in a range of 1 inch (2.54 mm) to 200 inches (5080 mm), such as, for example, 14 inches (406.4 mm) to 25 inches (635 mm), or 19 inches (482.6 mm) to 25 inches (635 mm). In various non-limiting embodiments, the vehicle wheel230can comprise a nominal rim width, d3, in a range of 1 inch (2.54 mm) to 100 inches (2540 mm), such as, for example, 6 inches (152.4 mm) to 24 inches (609.6 mm), or 6 inches (152.4 mm) to 12 inches (304.8 mm).", "", "In various non-limiting embodiments, the vehicle wheel balance apparatus100can comprise a polymer, a metal, a metal alloy, or a combination of two or more of those materials. In various non-limiting embodiments, the vehicle wheel balance apparatus100can comprise rigid materials.", "", "A powered vehicle can comprise the vehicle wheel230and the dynamic vehicle wheel balance apparatus100. During rotation of the vehicle wheel230on the powered vehicle, the dynamic vehicle wheel balance apparatus100can dynamically balance the vehicle wheel230and reduce aerodynamic drag of the powered vehicle, resulting in increased fuel mileage for the powered vehicle. In situations in which the dynamic vehicle wheel balance apparatus of the present invention is mounted on an electrically powered vehicle, the resultant reduced aerodynamic drag that can be achieved with the present invention may increase the distance the vehicle can travel on a single vehicle battery charge.", "", "The powered vehicle can comprise a vehicle weight class in a range of 1 to 8, such as, for example, 3 to 8, as defined by the U.S. Federal Highway Administration. For example, in various non-limiting embodiments the gross weight of the vehicle can be at least 10,001 lbs. (4536.48 kg) or at least 26,000 lbs. (11,798.4 kg). The powered vehicle can be, for example, a light-duty, medium-duty, or heavy-duty vehicle, such as, for example, a medium-duty or heavy-duty vehicle. In various non-limiting embodiments, the powered vehicle can be a truck (e.g., pick-up, full-sized, tractor (e.g., semi-truck)), a van, or a bus. The powered vehicle can comprise at least two axles, such as, for example, at least three axles, at least four axles, at least five axles, or at least six axles. In various non-limiting embodiments, the powered vehicle can comprise no greater than ten axles such as, for example, no greater than six axles, no greater than five axles, no greater than four axles, or no greater than three axles. In various non-limiting embodiments, the powered vehicle can comprise a quantity of axles in a range of two to ten. In various non-limiting embodiments, the powered vehicle can be powered by a combustion engine, one or more electric batteries, or a combination thereof.", "", "Referring toFIG.6, a method for coupling the dynamic vehicle wheel balance apparatus100to the vehicle wheel230is provided. At step602, the method comprises operatively coupling the snap ring240of the dynamic vehicle wheel balance apparatus100to the vehicle wheel230, wherein the clips244a-eare pinned between the snap ring240and the flange232of the vehicle wheel230. For example, the clips244a-ecan be press fit onto the snap ring240, and the snap ring240can be configured with a first diameter suitable to be received by the cavity234of the vehicle wheel230. Thereafter, the snap ring240can be inserted into the cavity234of the vehicle wheel230and then configured with a second diameter such that the snap ring240presses the clips244a-eagainst the flange232of the vehicle wheel230, thereby securing the clips244a-eand the snap ring240to the vehicle wheel230. In various non-limiting embodiments, the snap ring240can be inserted into the cavity234of the vehicle wheel230prior to installation of a tire on the vehicle wheel210or after installation of a tire on the vehicle wheel230.", "", "At step604, the vehicle wheel cover102can be operatively coupled to clips244a-eutilizing fasteners456. For example, a fastener456can be inserted through each of the first openings110a-eand into the bores450of the clips244a-e. The fasteners456can be secured to each of clips244a-eby rotating the fasteners456. For example, in various non-limiting embodiments where the bores450comprises threads, the fasteners456can be screws and can be threaded into the bores450. In certain non-limiting embodiments in which the bores450comprise a quick attachment feature, the fasteners456can comprise a quick attachment feature fastener and can be secured to the bores450by rotating the fasteners456. For example, in various embodiments where a quick attachment feature is used, the fasteners456can be secured to the bores450by rotating each fastener456no more than 180 degrees of rotation.", "", "At step606, the vehicle wheel230can be attached to an axle of a powered vehicle while the dynamic vehicle wheel balance apparatus100is coupled to the vehicle wheel230. The axle may be, for example, a steer axle, a drive axle, or a trailer axle of the powered vehicle. Attaching the vehicle wheel230can comprise aligning the bores354with the lug bolts on a hub of the axle of the powered vehicle and inserting the lug bolts into the bores354. Thereafter, lug nuts can be inserted through the second opening112of the dynamic vehicle wheel balance apparatus100and threaded onto the lug bolts, thereby securing the vehicle wheel230to the axle.", "", "At optional step608, the vehicle wheel230can be removed from the axle of the powered vehicle while the dynamic vehicle wheel balance apparatus100remains coupled to the vehicle wheel230. In various non-limiting embodiments, the dynamic vehicle wheel balance apparatus100can be removed from the vehicle wheel230prior to attaching the vehicle wheel230to the axle and/or prior to removing the vehicle wheel230from the axle. In various non-limiting embodiments, the vehicle wheel230can be attached to the axle prior to mounting the dynamic wheel balance apparatus100.", "", "Various aspects of the invention include, but are not limited to, the aspects listed in the following numbered clauses.1. A dynamic vehicle wheel balance apparatus comprising:a vehicle wheel cover comprising a first surface, a second surface, and a perimeter surface connecting the first surface to the second surface, wherein the vehicle wheel cover is configured to removably attach to a flange of a vehicle wheel with the second surface opposing the vehicle wheel; anda dynamic vehicle wheel balance ring attached to the second surface of the vehicle wheel cover.2. The dynamic vehicle wheel balance apparatus of clause 1, wherein the vehicle wheel cover defines at least two first openings proximal to the perimeter surface, wherein each of the at least two first openings extends from the first surface to the second surface and is configured to receive a fastener to operatively couple the vehicle wheel cover to the flange of a vehicle wheel.3. The dynamic vehicle wheel balance apparatus of clause 2, further comprising:a snap ring configured to operatively couple to the flange of the vehicle wheel; andat least two clips, each clip comprising a first portion configured to mount to the snap ring and a second portion comprising a bore configured to be aligned with one of the first openings and receive a respective fastener and thereby connect the clip to the vehicle wheel cover.4. The dynamic vehicle wheel balance apparatus of clause 3, wherein the second portion is positioned offset from the first portion.5. The dynamic vehicle wheel balance apparatus of any of clauses 3-4, wherein the first portion is substantially J-shaped and is configured to be pinned between the snap ring and the flange of the vehicle wheel.6. The dynamic vehicle wheel balance apparatus of any of clauses 2-5, wherein at least one of the at least two first openings is counter sunk.7. The dynamic vehicle wheel balance apparatus of any of clauses 2-6, wherein the vehicle wheel cover defines a second opening extending from the first surface to the second surface, wherein each of the first openings is located intermediate the second opening and the perimeter surface, and wherein the second opening is configured to enable access to a stud-receiving bore defined in the vehicle wheel when the dynamic vehicle wheel balance apparatus is installed on the vehicle wheel.8. The dynamic vehicle wheel balance apparatus of clause 7, wherein each of the at least two first openings is misaligned with a stud-receiving bore defined in a vehicle wheel when the dynamic vehicle wheel balance apparatus is installed on the vehicle wheel.9. The dynamic vehicle wheel balance apparatus of any of clauses 1-8, wherein the first surface of the vehicle wheel cover is substantially flat.10. The dynamic vehicle wheel balance apparatus of any of clauses 1-9, wherein the perimeter surface curves away from the first surface.11. The dynamic vehicle wheel balance apparatus of any of clauses 1-10, wherein the perimeter surface is configured to be located within a cavity defined by the flange of the vehicle wheel when the dynamic vehicle wheel balance apparatus is installed on the vehicle wheel.12. The dynamic vehicle wheel balance apparatus of any of clauses 1-11, wherein when the dynamic vehicle wheel balance apparatus is installed on the vehicle wheel, the vehicle wheel cover protrudes no greater than 10 mm from a flange of the vehicle wheel, is substantially aligned with the flange of the vehicle wheel, or is recessed below the flange of the vehicle wheel.13. The dynamic vehicle wheel balance apparatus of any of clauses 1-12, wherein the first surface of the vehicle wheel cover is configured to reduce aerodynamic drag of the vehicle wheel.14. The dynamic vehicle wheel balance apparatus of any of clauses 1-13, wherein the dynamic vehicle wheel balance ring comprises a circular raceway enclosing media.15. The dynamic vehicle wheel balance apparatus of any of clauses 1-14, wherein each of the at least two first openings are located intermediate the dynamic vehicle wheel balance ring and the perimeter surface.16. A vehicle wheel having connected thereto the dynamic vehicle wheel balance apparatus of any of clauses 1-15, wherein the dynamic vehicle wheel balance apparatus dynamically balances the vehicle wheel during rotation of the vehicle wheel and reduces aerodynamic drag.17. The vehicle wheel of clause 16, wherein the vehicle wheel comprises a nominal rim diameter in a range of 1 inch to 200 inches and a nominal rim width in a range of 1 inch to 100 inches.18. A powered vehicle comprising the dynamic vehicle wheel balance apparatus of any of clauses 1-15 installed on a vehicle wheel of the powered vehicle or the vehicle wheel of any of clauses 16-17 installed on the powered vehicle, wherein the dynamic vehicle wheel balance apparatus dynamically balances the vehicle wheel of the powered vehicle during rotation of the vehicle wheel of the powered vehicle and reduces aerodynamic drag of the powered vehicle resulting in an increased fuel savings of the powered vehicle.19. A method comprising:operatively coupling the snap ring of the dynamic vehicle wheel balance apparatus of any of clauses 3-5 to the vehicle wheel, wherein the clips are pinned between the snap ring and the flange of the vehicle wheel; andoperatively coupling the vehicle wheel cover to the clips utilizing fasteners.20. The method of clause 19, further comprising attaching the vehicle wheel to an axle of a powered vehicle while the dynamic vehicle wheel balance apparatus is coupled to the vehicle wheel.", "", "In this specification, unless otherwise indicated, all numerical parameters are to be understood as being prefaced and modified in all instances by the term “about,” in which the numerical parameters possess the inherent variability characteristic of the underlying measurement techniques used to determine the numerical value of the parameter. At the very least, and not as an attempt to limit the application of the doctrine of equivalents to the scope of the claims, each numerical parameter described herein should at least be construed in light of the number of reported significant digits and by applying ordinary rounding techniques.", "", "Also, any numerical range recited herein includes all sub-ranges subsumed within the recited range. For example, a range of “1 to 10” includes all sub-ranges between (and including) the recited minimum value of 1 and the recited maximum value of 10, that is, having a minimum value equal to or greater than 1 and a maximum value equal to or less than 10. Also, all ranges recited herein are inclusive of the end points of the recited ranges. For example, a range of “1 to 10” includes the end points 1 and 10. Any maximum numerical limitation recited in this specification is intended to include all lower numerical limitations subsumed therein, and any minimum numerical limitation recited in this specification is intended to include all higher numerical limitations subsumed therein. Accordingly, Applicant reserves the right to amend this specification, including the claims, to expressly recite any sub-range subsumed within the ranges expressly recited. All such ranges are inherently described in this specification.", "", "The grammatical articles “a,” “an,” and “the,” as used herein, are intended to include “at least one” or “one or more,” unless otherwise indicated, even if “at least one” or “one or more” is expressly used in certain instances. Thus, the foregoing grammatical articles are used herein to refer to one or more than one (i.e., to “at least one”) of the particular identified elements. Further, the use of a singular noun includes the plural and the use of a plural noun includes the singular, unless the context of the usage requires otherwise.", "", "One skilled in the art will recognize that the herein described articles and methods, and the discussion accompanying them, are used as examples for the sake of conceptual clarity and that various configuration modifications are contemplated. Consequently, as used herein, the specific examples/embodiments set forth and the accompanying discussion are intended to be representative of their more general classes. In general, use of any specific exemplar is intended to be representative of its class, and the non-inclusion of specific components, devices, operations/actions, and objects should not be taken to be limiting. While the present disclosure provides descriptions of various specific aspects for the purpose of illustrating various aspects of the present disclosure and/or its potential applications, it is understood that variations and modifications will occur to those skilled in the art. Accordingly, the invention or inventions described herein should be understood to be at least as broad as they are claimed and not as more narrowly defined by particular illustrative aspects provided herein."], "claims": ["a vehicle wheel cover comprising a first surface, a second surface, and a perimeter surface connecting the first surface to the second surface, wherein the vehicle wheel cover is configured to removably attach to a flange of a vehicle wheel with the second surface opposing the vehicle wheel; and a dynamic vehicle wheel balance ring attached to the second surface of the vehicle wheel cover, wherein the dynamic vehicle wheel balance ring comprises a circular raceway enclosing media.", "2 . The dynamic vehicle wheel balance apparatus of claim 1 , wherein the vehicle wheel cover defines at least two first openings proximal to the perimeter surface, wherein each of the at least two first openings extends from the first surface to the second surface and is configured to receive a fastener to operatively couple the vehicle wheel cover to the flange of a vehicle wheel.", "a snap ring configured to operatively couple to the flange of the vehicle wheel; and at least two clips, each clip comprising a first portion configured to mount to the snap ring and a second portion comprising a bore configured to be aligned with one of the first openings and receive a respective fastener and thereby connect the clip to the vehicle wheel cover.", "4 . The dynamic vehicle wheel balance apparatus of claim 3 , wherein the second portion is positioned offset from the first portion.", "5 . The dynamic vehicle wheel balance apparatus of claim 3 , wherein the first portion is substantially J-shaped and is configured to be pinned between the snap ring and the flange of the vehicle wheel.", "6 . The dynamic vehicle wheel balance apparatus of claim 2 , wherein at least one of the at least two first openings is counter sunk.", "7 . The dynamic vehicle wheel balance apparatus of claim 2 , wherein the vehicle wheel cover defines a second opening extending from the first surface to the second surface, wherein each of the first openings is located intermediate the second opening and the perimeter surface, and wherein the second opening is configured to enable access to a stud-receiving bore defined in the vehicle wheel when the dynamic vehicle wheel balance apparatus is installed on the vehicle wheel.", "8 . The dynamic vehicle wheel balance apparatus of claim 7 , wherein each of the at least two first openings is misaligned with a stud-receiving bore defined in a vehicle wheel when the dynamic vehicle wheel balance apparatus is installed on the vehicle wheel.", "9 . The dynamic vehicle wheel balance apparatus of claim 1 , wherein the first surface of the vehicle wheel cover is substantially flat.", "10 . The dynamic vehicle wheel balance apparatus of claim 1 , wherein the perimeter surface curves away from the first surface.", "11 . The dynamic vehicle wheel balance apparatus of claim 1 , wherein the perimeter surface is configured to be located within a cavity defined by the flange of the vehicle wheel when the dynamic vehicle wheel balance apparatus is installed on the vehicle wheel.", "12 . The dynamic vehicle wheel balance apparatus of claim 1 , wherein when the dynamic vehicle wheel balance apparatus is installed on the vehicle wheel, the vehicle wheel cover protrudes no greater than 10 mm from a flange of the vehicle wheel, is substantially aligned with the flange of the vehicle wheel, or is recessed below the flange of the vehicle wheel.", "13 . The dynamic vehicle wheel balance apparatus of claim 1 , wherein the first surface of the vehicle wheel cover is configured to reduce aerodynamic drag of the vehicle wheel.", "14 . (canceled)", "15 . The dynamic vehicle wheel balance apparatus of claim 1 , wherein each of the at least two first openings are located intermediate the dynamic vehicle wheel balance ring and the perimeter surface.", "16 . A vehicle wheel having connected thereto the dynamic vehicle wheel balance apparatus of claim 1 , wherein the dynamic vehicle wheel balance apparatus dynamically balances the vehicle wheel during rotation of the vehicle wheel and reduces aerodynamic drag.", "17 . The vehicle wheel of claim 16 , wherein the vehicle wheel comprises a nominal rim diameter in a range of 1 inch to 200 inches and a nominal rim width in a range of 1 inch to 100 inches.", "18 . A powered vehicle comprising the dynamic vehicle wheel balance apparatus of claim 1 installed on a vehicle wheel of the powered vehicle, wherein the dynamic vehicle wheel balance apparatus dynamically balances the vehicle wheel of the powered vehicle during rotation of the vehicle wheel of the powered vehicle and reduces aerodynamic drag of the powered vehicle resulting in an increased fuel savings of the powered vehicle.", "operatively coupling the snap ring of the dynamic vehicle wheel balance apparatus of operatively coupling the vehicle wheel cover to the clips utilizing fasteners.", "20 . The method of claim 19 , further comprising attaching the vehicle wheel to an axle of a powered vehicle while the dynamic vehicle wheel balance apparatus is coupled to the vehicle wheel.", "a vehicle wheel cover comprising a first surface, a second surface, and a perimeter surface connecting the first surface to the second surface, wherein the vehicle wheel cover is configured to removably attach to a flange of a vehicle wheel with the second surface opposing the vehicle wheel, wherein the vehicle wheel cover defines at least two first openings proximal to the perimeter surface, wherein each of the at least two first openings extends from the first surface to the second surface and is configured to receive a fastener to operatively couple the vehicle wheel cover to the flange of a vehicle wheel; a dynamic vehicle wheel balance ring attached to the second surface of the vehicle wheel cover; a snap ring configured to operatively couple to the flange of the vehicle wheel; and at least two clips, each clip comprising a first portion configured to mount to the snap ring and a second portion comprising a bore configured to be aligned with one of the first openings and receive a respective fastener and thereby connect the clip to the vehicle wheel cover."], "bibtex": "@patent{20240165990,\n    title = {DYNAMIC VEHICLE WHEEL BALANCE APPARATUS, VEHICLE WHEEL, POWERED VEHICLE, AND METHOD FOR MANUFACTURE THEREOF},\n    number = {20240165990},\n    year = {2024},\n    note = {File: US20240165990A1-20240523.XML}\n    }", "classification": "B60B704FI"}, {"title": "WHEEL DEVICE FOR MOBILE ROBOT CAPABLE OF DRIVING ON ROUGH TERRAIN AND OVERCOMING OBSTACLES, AND MOBILE ROBOT INCLUDING SAME", "doc_number": "20240165991", "filename": "US20240165991A1-20240523.XML", "abstract": "An omni-wheel device is capable of driving on both flat and stepped terrains. The omni-wheel device may include an omni-wheel segment of which an area in contact with the ground includes a portion of an omni-wheel, an actuator capable of moving the omni-wheel segment in the radial direction, and a wheel drum to which one end of the actuator is fixed and in which a rotation shaft is assembled at the center thereof.", "detailed_description": ["Hereinafter, embodiments of the present invention will be described with reference to the accompanying drawings and in detail to the extent that a person with ordinary knowledge in the art to which the present invention pertains can easily implement the embodiments of the present invention. However, since the description of the present invention is provided for only an embodiment for describing structural or functional description, the scope of the claims of the present invention is not to be construed as limited by the embodiments described herein. That is, since the embodiment can be variously modified and can have various forms, the scope of the claims of the present invention is to be understood to include equivalents capable of realizing technical ideas. In addition, since objects or effects presented in the present invention do not mean that a specific embodiment is to include all of the objects or the effects or include only the effects, the scope of the claims of the present invention is not to be construed as limited thereby.", "", "Meanings of terms provided herein are to be understood as follows.", "", "Terms such as “first” and “second” are used to distinguish one configurational element from another configurational element, and the scope of the claims is not to be limited by these terms. For example, a first configurational element can be named as a second configurational element, and similarly, the second configurational element can also be named as the first configurational element. The description in which one configurational element is mentioned to be “connected to” another configurational element is to be understood to mean that the one configurational element can be directly connected to the other configurational element, or that still another configurational element can be present therebetween. On the other hand, the description in which one configurational element is “directly connected to” another configurational element is to be understood to mean that no configurational element is present therebetween. Meanwhile, the same is true of other expressions, that is, “between” and “directly between”, “adjacent” and “directly adjacent”, or the like for describing relationships between configurational elements.", "", "An expression with a singular form is construed to include a meaning of a plural form thereof, unless obviously implied otherwise in context. Terms such as “comprise” or “have” are to be construed to specify that a feature, a number, a step, an operation, a configurational element, a member, or a combination thereof described herein is present and are not to exclude presence or a possibility of addition of one or more other features, numbers, steps, operations, configurational elements, members, or combinations thereof in advance.", "", "Unless otherwise defined, all terms used herein have the same meanings as meanings generally understood by a person of ordinary skill in the art to which the present invention pertains. The same terms as those defined in a generally used dictionary are to be construed as having the same meanings as the contextual meanings in the related art. In addition, unless clearly defined in the present invention, the terms are not to be construed as having ideal or excessively formal meanings."], "claims": ["a first omni wheel provided in the mobile robot; a second omni wheel provided in the mobile robot; a middle wheel provided between the first omni wheel and the second omni wheel; wheel links connecting the first omni wheel and the middle wheel; a first suspension connected between the mobile robot and the wheel links; and a second suspension connected between the mobile robot and the wheel links in the vicinity of the first suspension.", "wherein the first omni wheel and the second omni wheel have a plurality of omni wheel segments which are arranged in a circumferential direction.", "wherein, of the omni wheel segments, five to ten segments are arranged in the circumferential direction.", "wherein the first omni wheel is a driving wheel.", "wherein the middle wheel is a driving wheel.", "wherein the first and second suspensions are installed to be relatively rotatable with respect to the mobile robot and the wheel links.", "wherein the first and second omni wheels, the wheel links, and the first and second suspensions are provided on both respective sides of the mobile robot.", "8 . A mobile robot including the wheel device according to claim 1 .", "wherein the mobile robot is one of a logistics robot, an electric cart, an automated guided vehicle, and a wheelchair."], "bibtex": "@patent{20240165991,\n    title = {WHEEL DEVICE FOR MOBILE ROBOT CAPABLE OF DRIVING ON ROUGH TERRAIN AND OVERCOMING OBSTACLES, AND MOBILE ROBOT INCLUDING SAME},\n    number = {20240165991},\n    year = {2024},\n    note = {File: US20240165991A1-20240523.XML}\n    }", "classification": "B60B1900FI"}, {"title": "TIRE HANDLER HAVING TIRE LAY FLAT CAPABILITY", "doc_number": "20240165992", "filename": "US20240165992A1-20240523.XML", "abstract": "A tire handler for handling a tire of a vehicle, comprising: a frame; a tire gripping assembly having a tilt assembly and an arm assembly coupled thereto; the arm assembly having first and second vertical telescoping arms and first and second horizontal telescoping arms; the arm assembly having first and second upper arms and first and second lower arms; and, a lifting assembly, the lifting assembly having first and second vertical lift actuators mounted on the frame and coupled to the tilt assembly; wherein the tire gripping assembly is operable to release and grip the tire; wherein the lifting assembly is operable to lower and raise the tire; and, wherein the tilt assembly is operable to stand upright and lay flat the tire.", "detailed_description": ["In the following description, details are set forth to provide an understanding of the application. In some instances, certain structures, techniques and methods have not been described or shown in detail in order not to obscure the application.", "", "FIG.1is a front perspective view illustrating a tire handler100in accordance with an embodiment of the application.FIG.2is a front perspective view illustrating the tire handler100ofFIG.1with the arm assembly320thereof shown in a vertical, lowered, and expanded position550,530,510in accordance with an embodiment of the application.FIG.3is a front view thereof.FIG.4is a rear view thereof.FIG.5is a right side view thereof, the left side view being substantially a mirror image thereof.FIG.6is a front perspective view illustrating the tire handler100ofFIG.1with the arm assembly320thereof shown in a vertical, lowered, and contracted position550,530,520in accordance with an embodiment of the application.FIG.7is a front view thereof. And,FIG.8is a top view thereof.", "", "According to one embodiment of the application, there is provided a tire handler100for handling a tire (or tire and tire rim or wheel)1010of a vehicle (e.g., a truck or large capacity truck)1000. The tire handler100includes a frame200, a tire gripping (or gripper) assembly300, and a lifting assembly400. As further described below, the tire handler100advantageously provides: 4-point contact of the tire1010(i.e., via first and second upper and lower arms371,372,373,374as described further below); pressure sensing of the grip applied to the tire1010performed using on-board pressure sensors and programed algorithms to ensure safe operation of tire handler100; reduced slipping of the tire1010and fall hazards for operators; six built-in hydraulic cylinders (all cylinders having electronic feedback)331,341,351,352,361,362which allow for grip and side shift of at least the arm assembly320of the tire gripping assembly300through programed algorithms; a frame200having a built in work platform or deck250for operators and tire technicians; and, tire lay down “tilt”555capability.", "", "According to one embodiment, the frame200has a front end210, a rear end220, a right side230, and a left side240. The frame200includes a platform or deck250for use by an operator. The tire handler100may further include a pair of omni steerable front wheels261,262mounted proximate to the front end210of the frame200. The tire handler100may further include a pair of omni steerable rear wheels271,272mounted proximate to a rear end220of the frame200. According to one embodiment, the wheels261,262,271,272may be hydraulically or electrically driven.", "", "According to one embodiment, the tire handler100may be self-propelled and has mounted on its frame200an electric motor (or optionally a diesel engine or hybrid engine)280and battery285for powering the wheels261,262,271,272, actuators (e.g.,331), and other components (e.g., sensors, communications equipment, etc.) of the tire handler100. According to one embodiment, the operation and positioning of the tire handler100is remotely controllable using a handheld remote control unit8000operated by an operator. The remote control unit8000allows for controlling the tire handler100from a location distant from the tire handler100, the tire1010, and the truck1000. According to another embodiment, the tire handler100may be controlled locally.", "", "According to one embodiment, and referring toFIGS.8and18, the frame200may be U-shaped or horseshoe shaped (or approximately U-shaped or horseshoe shaped) having a first (or right) leg or portion203on the right side230of the frame200, a second (or left) leg or portion204on the left side240of the frame200, and a central portion202at the rear end220of the frame200. The front wheels261,262may be mounted proximate the front end210of each leg203,204on the underside thereof. The rear wheels271,272may be mounted proximate right and left sides230,240of the central portion202on the underside thereof proximate the rear end220of the frame200. For improved stability, the tire gripping assembly300may extend from the lifting assembly400toward the front210of the frame200between the first and second legs203,204. Advantageously, the U-shaped design of the frame200reduces cantilever load (i.e., reduces the need for reach and loading on the first and second upper and lower arms371,372,373,374of the tire gripping assembly300) as the first and second legs203,204may be positioned on either side (i.e., toward230,240) of the tire1010during tire manipulations.", "", "FIG.9is a front perspective view illustrating the tire handler100ofFIG.1with the arm assembly320thereof shown in a vertical, raised, and contracted position550,540,520in accordance with an embodiment of the application.FIG.10is a right side view thereof, the left side view being substantially a mirror image thereof.FIG.11is a front perspective view illustrating the tire handler100ofFIG.1with the arm assembly320thereof shown in a tilted, raised, and contracted position555,540,520in accordance with an embodiment of the application.FIG.12is a right side view thereof, the left side view being substantially a mirror image thereof.FIG.13is a front perspective view illustrating the tire handler100ofFIG.1with the arm assembly320thereof shown in a horizontal, raised, and contracted position560,540,520in accordance with an embodiment of the application.FIG.14is a right side view thereof, the left side view being substantially a mirror image thereof.FIG.15is a front view illustrating the tire handler100ofFIG.1with the arm assembly320thereof shown in a vertical, lowered, and contracted position550,530,520and gripping a tire1010in accordance with an embodiment of the application.FIG.16is a rear view thereof.FIG.17is a right side view thereof, the left side view being substantially a mirror image thereof.FIG.18is a top view thereof.FIG.19is a front perspective view illustrating the tire handler100ofFIG.1with the arm assembly320thereof shown in a vertical, raised, and contracted position550,540,520and gripping a tire1010in accordance with an embodiment of the application.FIG.20is a front view thereof.FIG.21is a right side view thereof, the left side view being substantially a mirror image thereof.FIG.22is a front view illustrating the tire handler100ofFIG.1with the arm assembly320thereof shown in a tilted, raised, and contracted position555,540,520and gripping a tire1010in accordance with an embodiment of the application.FIG.23is a right side view thereof, the left side view being substantially a mirror image thereof.FIG.24is a front perspective view illustrating the tire handler100ofFIG.1with the arm assembly320thereof shown in a horizontal, raised, and contracted position560,540,520and gripping a tire1010in accordance with an embodiment of the application. And,FIG.25is a right side view thereof, the left side view being substantially a mirror image thereof.", "", "According to one embodiment, the tire gripping assembly300has a tilt assembly310and an arm assembly320coupled (e.g., one or more of attached, connected, joined, bolted, welded, screwed, pinned, hinged, etc.) thereto.", "", "According to one embodiment, the arm assembly320has first and second vertical telescoping arms330,340coupled at respective upper and lower ends3301,3401,3302,3402to respective first and second ends3501,3502,3601,3602of first and second horizontal telescoping arms350,360. The first and second horizontal telescoping arms350,360may be double-ended having a moving stage (e.g.,334) at either end of a central barrel (e.g.,335) as described further below. The arm assembly320has first and second upper arms371,372and first and second lower arms373,374mounted on the first and second vertical telescoping arms330,340proximate the respective upper and lower ends thereof3301,3401,3302,3402(or alternatively3601,3602). The first and second upper arms371,372and the first and second lower arms373,374are adapted to grip the tire1010. The first and second vertical telescoping arms330,340have respective first and second vertical arm actuators331,341mounted or coupled thereto. The first and second horizontal telescoping arms350,360have respective first and second pairs of horizontal arm actuators351,352,361,362mounted or coupled thereto.", "", "FIG.31is a rear perspective cross-sectional view illustrating the lifting assembly400of the tire handler100ofFIG.1in accordance with an embodiment of the application. And,FIG.32is a rear view thereof.", "", "According to one embodiment, the lifting assembly400is mounted on the frame200. The lifting assembly400has first and second vertical lift actuators411,421mounted on the frame200and coupled (e.g., by shaft or pin415,425, etc.) to the tilt assembly320. The first and second vertical lift actuators411,421may be housed in respective first and second masts410,420. The first and second masts410,420may be mounted at respective lower ends4102,4202thereof to a base440(which may be mounted to the frame200) and may be joined or attached at respective upper ends4101,4201thereof by a cross member430.", "", "FIG.26is a front perspective view illustrating the tire gripping assembly300of the tire handler100ofFIG.1with the arm assembly320thereof shown in a tilted position555in accordance with an embodiment of the application.FIG.27is a front view thereof.FIG.28is a right side view thereof, the left side view being substantially a mirror image thereof.FIG.29is a rear perspective view illustrating the arm assembly320of the tire handler100ofFIG.1shown in a vertical position550in accordance with an embodiment of the application. And,FIG.30is a rear view thereof.", "", "The first and second vertical arm actuators331,341and the first and second pairs of horizontal arm actuators351,352,361,362are operable (i.e., via corresponding operation of the vertical and horizontal telescoping arms330,340,350,360) to move the first and second upper and lower arms371,372,373,374between an expanded position510and a contracted position520to thereby release and grip the tire1010.", "", "The first and second vertical lift actuators411,421are operable to move the tire gripping assembly300(including the arm assembly320) between a lowered position530and a raised position540to thereby lower and raise the tire1010.", "", "The tilt assembly310is operable to move the arm assembly320between a vertical position550and a horizonal position560(through a tilt position555) to thereby stand the tire1010upright and lay the tire1010flat. The tilt assembly320may be operated by one or more tilt actuators, gears, or the like311. The arm assembly320may be coupled (e.g., rotatably coupled, etc.) to the tilt assembly310by an axle, one or more pins, or the like312.", "", "According to one embodiment, the actuators (e.g.,331) may be hydraulic cylinders or pneumatic or electric actuators. Each of the cylinders (e.g.,331) may have a piston rod end332and a cylinder barrel end333. According to one embodiment, the telescoping arms (e.g.,330) have at least one moving stage end334and a barrel end335. The piston rod end333of the cylinder331may be coupled to the moving stage end334of the telescoping arm330and the cylinder barrel end333of the cylinder331may be coupled to the barrel end335of the telescoping arm330. According to one embodiment, the actuators331may be operable simultaneously.", "", "As mentioned above, the tire handler100includes a remote control unit8000that allows an operator to maneuver the tire handler100beside a truck1000, grip and remove a tire1010from the truck1000(i.e., after the truck1000has been jacked up), or grip and replace a tire1010on the truck1000, all without the operator having to venture near the truck1000or tire1010.", "", "FIG.33is a rear perspective view illustrating the tire handler100ofFIG.1with the arm assembly320thereof shown in a vertical, lowered, and contracted position550,530,510and gripping a tire1010mounted on a truck1000in accordance with an embodiment of the application. And,FIG.34is a rear view thereof.", "", "In operation, the tire handler100is positioned in front of a tire (or wheel or tire and rim)1010mounted on a truck1000by an operator using a remote control unit8000. To grip the tire1000, the first and second upper and lower arms371,372,373,374of the arm assembly320are moved to the expanded position510and are moved over the tire1010by adjusting the position of the tire handler100. The arms371,372,373,374are then moved to the contracted position520and the tire1010is gripped and removed from the truck1010. If required, the tire gripping assembly300may be lowered530or raised540to accommodate the position of the tire1010on the truck1000or during movement of the tire handler100and the lateral position of the arms371,372,373,374may be adjusted. The tire1010may be moved to a shop or other desired location by controlling the position of the tire handler100. When the tire handler100reaches the desired location, the tilt assembly310may be used to move the arm assembly320from the vertical position550to the horizontal position560, the tire gripping assembly300may be lowered530, and the arms371,372,373,374of the arm assembly320may be moved from the contracted position520to the expanded position510to release and lay the tire1010down flat. Reverse operations may be used to grip the laid down flat tire1010and install it on a truck1000.", "", "Thus, according to one embodiment, there is provided a tire handler100for handling a tire1010of a vehicle (e.g.,1000), comprising: a frame200; a tire gripping assembly300having a tilt assembly310and an arm assembly320coupled thereto; the arm assembly320having first and second vertical telescoping arms330,340coupled at respective upper and lower ends3301,3302,3401,3402to respective first and second ends3501,3601,3502,3602of first and second horizontal telescoping arms350,360; the arm assembly320having first and second upper arms371,372and first and second lower arms373,374mounted on the first and second vertical telescoping arms330,340proximate the respective upper and lower ends3301,3401,3302,3402(or alternatively3601,3602) thereof, the first and second upper arms371,372and the first and second lower arms373,374adapted to grip the tire1010; the first and second vertical telescoping arms330,340having respective first and second vertical arm actuators331,341; the first and second horizontal telescoping arms350,360having respective first and second pairs of horizontal arm actuators351,352,361,362; and, a lifting assembly400mounted on the frame200, the lifting assembly400having first and second vertical lift actuators411,421mounted on the frame200and coupled to the tilt assembly310; wherein the first and second vertical arm actuators331,341and the first and second pairs of horizontal arm actuators351,352,361,362are operable to move the first and second upper and lower arms371,372,373,374between an expanded position510and a contracted position520to thereby release and grip the tire1010; wherein the first and second vertical lift actuators411,421are operable to move the tire gripping assembly300between a lowered position530and a raised position540to thereby lower and raise the tire1010; and, wherein the tilt assembly310is operable to move the arm assembly320between a vertical position550and a horizonal position560to thereby stand upright and lay flat the tire1010.", "", "The above tire handler100may further include a remote control unit800for remotely controlling operations of the tire handler100. The tire handler100may further include a pair of front wheels261,262mounted proximate to a front end210of the frame200and a pair of rear wheels271,272mounted proximate to a rear end220of the frame200. The tire handler100may further include a battery285mounted on the frame200for providing power to components (e.g.,261,280,331, etc.) of the tire handler100. The vehicle1000may be a truck or large capacity truck. The tire handler100may be remotely controllable. The tire handler100may be locally controllable. The frame200may include a platform or deck250for use by an operator. The actuators (e.g.,331) may be hydraulic cylinders. The tilt assembly310may include at least one tilt actuator311mounted thereto and operatively coupled to the arm assembly320, the at least one tilt actuator311operable to move the arm assembly320between the vertical position550and the horizonal position560. The arm assembly320may be coupled to the tilt assembly by an axle or by one or more pins312. The tire1010may be a wheel including the tire and a tire rim. The frame200may be U-shaped or approximately U-shaped having a first leg203, a second leg204, and a central portion202. The tire gripping assembly300may extend from the lifting assembly400mounted proximate the central portion202between the first and second legs203,204of the frame200. The tire handler100may be self-propelled having a motor or engine280mounted on the frame200. The first and second pairs of horizontal arm actuators351,352,361,362may be further operable to move the first and second upper and lower arms371,372,373,374laterally to thereby shift the tire1010laterally when gripped. And, the first and second horizontal telescoping arms350,360may be double-ended thereby allowing the first and second upper and lower arms371,372,373,374to be moved laterally.", "", "The above embodiments may contribute to an improved tire handler100for handling the tires (e.g.,1010) of large capacity trucks1000and may provide one or more advantages. First, the tire handler100reduces the shop space to equipment size problem identified above. Second, the compact design of the tire handler100allows it to fit into shop environments. Third, the tire handler100is easy to use and nimble enough to maneuver in tight spaces. Fourth, the tire handler100has omni steer capabilities allowing it to crab crawl around tight shop situations. Fifth, the tire handler100may handle a range of large capacity truck tires1010from the smallest tires (e.g., 5 tons) to the largest tires (e.g., tons). Sixth, the tire handler100is capable of laying a tire1010down flat on the ground or other surface. Seventh, the tire handler100is purposely built for tires1010and not as a forklift modification or attachment. As such, there are no forklift masts or other obstructions that an operator or tire technician must work around. Eighth, the tire handler100has a work platform or deck250for operators or tire technicians. Ninth, the tire handle100may be operated by remote control by a single operator with no need for a secondary worker on the ground to spot. Tenth, the tire handler100has a frame200that is designed to reduce cantilever load (i.e., reduces the need for reach on the gripper arms371,372,373,374). Eleventh, the tire handler100has uniquely designed robotic gripper arms371,372,373,374that provide full control over tire installation/manipulation operations. Twelfth, the tire handler100may be battery powered or hybrid diesel over electric powered for shop use and carbon footprint reduction. Thirteenth, the tire handler100supports the integration of robotic tool technology (e.g., for wheel nut removal and installation). Fourteenth, the tire handler100has wireless communication capabilities for mine ERP systems. Fifteenth, the bolted frame200with profile plating support simple shipping and parts replacement. Sixteenth, the tire handler100improves safety conditions for operators and tire service technicians. Seventeenth, the tire handler100increases truck availability. Eighteenth, the tire handler100increases shop bay use (i.e., the ability to handle tires1010with occupied adjacent bays). Nineteenth, the tire handler100reduces long-term operating costs such as damage to tires, studs, and valve stems due to the problems with using existing devises (e.g., fork lifts, large front end loaders, etc.). And, twentieth, the tire handler100reduce carbon footprint (e.g., by using a 60 hp engine or by using battery power versus large loaders having 1200 hp engines).", "", "The embodiments of the application described above are intended to be exemplary only. Those skilled in this art will understand that various modifications of detail may be made to these embodiments, all of which come within the scope of the application."], "claims": ["a frame; a tire gripping assembly having a tilt assembly and an arm assembly coupled thereto; the arm assembly having first and second vertical telescoping arms coupled at respective upper and lower ends to respective first and second ends of first and second horizontal telescoping arms; the arm assembly having first and second upper arms and first and second lower arms mounted on the first and second vertical telescoping arms proximate the respective upper and lower ends thereof, the first and second upper arms and the first and second lower arms adapted to grip the tire; the first and second vertical telescoping arms having respective first and second vertical arm actuators; the first and second horizontal telescoping arms having respective first and second pairs of horizontal arm actuators; and, a lifting assembly mounted on the frame, the lifting assembly having first and second vertical lift actuators mounted on the frame and coupled to the tilt assembly; wherein the first and second vertical arm actuators and the first and second pairs of horizontal arm actuators are operable to move the first and second upper and lower arms between an expanded position and a contracted position to thereby release and grip the tire; wherein the first and second vertical lift actuators are operable to move the tire gripping assembly between a lowered position and a raised position to thereby lower and raise the tire; and, wherein the tilt assembly is operable to move the arm assembly between a vertical position and a horizonal position to thereby stand upright and lay flat the tire.", "2 . The tire handler of claim 1 , further comprising a remote control unit for remotely controlling operations of the tire handler.", "3 . The tire handler of claim 2 , further comprising a pair of front wheels mounted proximate to a front end of the frame and a pair of rear wheels mounted proximate to a rear end of the frame.", "4 . The tire handler of claim 1 , further comprising a battery mounted on the frame for providing power to components of the tire handler.", "5 . The tire handler of claim 1 , wherein the vehicle is a truck or large capacity truck.", "6 . The tire handler of claim 1 , wherein the tire handler is remotely controllable.", "7 . The tire handler of claim 1 , wherein the tire handler is locally controllable.", "8 . The tire handler of claim 1 , wherein the frame includes a platform or deck for use by an operator.", "9 . The tire handler of claim 1 , wherein the actuators are hydraulic cylinders.", "10 . The tire handler of claim 1 , wherein the tilt assembly includes at least one tilt actuator mounted thereto and operatively coupled to the arm assembly, the at least one tilt actuator operable to move the arm assembly between the vertical position and the horizonal position.", "11 . The tire handler of claim 10 , wherein the arm assembly is coupled to the tilt assembly by an axle or by one or more pins.", "12 . The tire handler of claim 1 , wherein the tire is a wheel including the tire and a tire rim.", "13 . The tire handler of claim 1 , wherein the frame is U-shaped or approximately U-shaped having a first leg, a second leg, and a central portion.", "14 . The tire handler of claim 13 , wherein the tire gripping assembly extends from the lifting assembly mounted proximate the central portion between the first and second legs of the frame.", "15 . The tire handler of claim 1 , wherein the tire handler is self-propelled having a motor or engine mounted on the frame.", "16 . The tire handler of claim 1 , wherein the first and second pairs of horizontal arm actuators are further operable to move the first and second upper and lower arms laterally to thereby shift the tire laterally when gripped.", "17 . The tire handler of claim 1 , wherein the first and second horizontal telescoping arms are double-ended thereby allowing the first and second upper and lower arms to be moved laterally."], "bibtex": "@patent{20240165992,\n    title = {TIRE HANDLER HAVING TIRE LAY FLAT CAPABILITY},\n    number = {20240165992},\n    year = {2024},\n    note = {File: US20240165992A1-20240523.XML}\n    }", "classification": "B60B3002FI"}, {"title": "Hubcap Removal Device And Method Of Use", "doc_number": "20240165993", "filename": "US20240165993A1-20240523.XML", "abstract": "A device configured to remove a hubcap from a wheel of a vehicle without using torque or leverage applied against a component that is not the hubcap is disclosed. The device is configured to remove the hubcap by applying a force to the hubcap along a first axis that is perpendicular to the hubcap. The device comprises a shaft and a slide hammer. The shaft includes a first end and a second end. The first end includes a hook having a degree of bend greater than 90 degrees. The slide hammer is coupled to the shaft between the first end and the second end. A first force acting on the slide hammer along a first axis perpendicular to the hubcap in a first direction away from the wheel causes the hook to apply a second force to the hubcap along the first axis in the first direction.", "detailed_description": ["The present invention now will be described more fully hereinafter with reference to the accompanying drawings, in which some, but not all embodiments of the invention are shown. Indeed, this invention may be embodied in many different forms and should not be construed as limited to the embodiments set forth herein; rather, these embodiments are provided so that this disclosure will satisfy applicable legal requirements. Like numbers refer to like elements throughout. It is to be understood that this invention is not limited to the particular methodology and protocols described, as such may vary. It is also to be understood that the terminology used herein is for the purpose of describing particular embodiments only, and is not intended to limit the scope of the present invention.", "", "Many modifications and other embodiments of the invention set forth herein will come to mind to one skilled in the art to which the invention pertains having the benefit of the teachings presented in the foregoing description and the associated drawings. Therefore, it is to be understood that the invention is not to be limited to the specific embodiments disclosed and that modifications and other embodiments are intended to be included within the scope of the appended claims. Although specific terms are employed herein, they are used in a generic and descriptive sense only and not for purposes of limitation.", "", "As used herein the singular forms “a,” “an,” and “the” include plural referents unless the context clearly dictates otherwise. For example, use of the term “a force” can refer to one or more of such forces.", "", "All technical and scientific terms used herein have the same meaning as commonly understood to one of ordinary skill in the art to which this invention belongs unless clearly indicated otherwise.", "", "Ranges can be expressed herein as from “about” one particular value, and/or to “about” another particular value. When such a range is expressed, another aspect includes from the one particular value and/or to the other particular value. Similarly, when values are expressed as approximations, by use of the antecedent “about,” it will be understood that the particular value forms another aspect. It will be further understood that the endpoints of each of the ranges are significant both in relation to the other endpoint, and independently of the other endpoint. Optionally, in some aspects, when values are approximated by use of the antecedent “about,” it is contemplated that values within up to 15%, up to 10%, up to 5%, or up to 1% (above or below) of the particularly stated value can be included within the scope of those aspects. Similarly, in some optional aspects, when values are approximated by use of the terms “approximately,” “substantially,” or “generally,” it is contemplated that values within up to 15%, up to 10%, up to 5%, or up to 1% (above or below) of the particular value can be included within the scope of those aspects. When used with respect to an identified property or circumstance, “substantially” or “generally” can refer to a degree of deviation that is sufficiently small so as to not measurably detract from the identified property or circumstance, and the exact degree of deviation allowable may in some cases depend on the specific context.", "", "As used herein, the terms “optional” or “optionally” mean that the subsequently described event or circumstance may or may not occur, and that the description includes instances where said event or circumstance occurs and instances where it does not.", "", "The word “or” as used herein means any one member of a particular list and, except where the context indicates otherwise, in alternative aspects, can also include any combination of members of that list.", "", "The following description supplies specific details in order to provide a thorough understanding. Nevertheless, the skilled artisan would understand that the apparatus and associated methods of using the apparatus can be implemented and used without employing these specific details. Indeed, the apparatus and associated methods can be placed into practice by modifying the illustrated apparatus and associated methods and can be used in conjunction with any other apparatus and techniques conventionally used in the industry.", "", "Disclosed herein, and with reference toFIG.1andFIG.2, is a device10for removing a hubcap of a wheel of a vehicle. In one example, the device10may be for removing a hubcap of a wheel of a dually truck. The device10may be configured to remove a hubcap from a wheel of a vehicle without using torque or leverage applied against a component that is not the hubcap. For example, the device10may be configured to remove a hubcap without using torque or leverage applied against the inner wheel well or the tire. Further, the device10may be configured to remove the hubcap by applying a force to the hubcap along a first axis that is perpendicular to the hubcap. By applying force to only the hubcap and no other wheel components, the device10may eliminate or minimize damages, such as scratching or cracks, to other components of the wheel.", "", "As shown inFIG.1andFIG.2, the device10may include a shaft20. The shaft20may include a first end22and a second end24(shown inFIGS.4and5). The shaft20may have a first length L1between the first end22and the second end24(shown inFIG.4). The shaft20may have a second length L2between the first end22and a slide hammer30(shown inFIG.2). The first and second lengths L1, L2may be configured to allow a user of the device10to insert the first end22into a wheel well to access a hubcap slot. The lengths L1, L2may be configured to allow for using the device10in a deep wheel well, for example the wheel well of a dually truck. In one example, the first length L1may be about 11.5 to 13 inches. In one example, the second length L2may be about 7.5 to 9.5 inches when the slide hammer30is in the rested position.", "", "The first end22of the shaft20may include a hook26. The hook26may have a degree of bend B greater than 90 degrees. In one aspect, the degree of bend B may range from 130 to 200 degrees. In one example, the hook26may have a degree of bend B of 180 degrees or about 180 degrees (for example, within 5, 10, or 15 degrees of 180 degrees). The hook26may be configured to engage a hubcap of a wheel of a vehicle via a slot in the hubcap. The hook26may have a width that is small enough to ensure ease of inserting the hook26into the slot. In one example, the width W may range from about 0.4 to 0.6 inches. In another example, the width W may be less than or equal to 0.5 inches or less than or equal to 0.4 inches. The hook26may also have an inner radius R configured latch onto the inner and outer wall of the hubcap to avoid slipping. In one example, the inner radius R may range from about 0.1 to 0.3 inches. In another example, the inner radius R may be less than or equal to 0.2 inches or less than or equal to 0.15 inches. In some exemplary aspects, as shown inFIG.4, the hook26may have an inner surface80and an outer surface82that are angled (toward the second end24of the shaft20) to meet at a tip84. Optionally, in these aspects, the inner surface80and the outer surface82can include planar or substantially planar portions that intersect at the tip29. Optionally, an angle85formed between the converging inner and outer surfaces80,82may range from about 15 degrees to about 75 degrees or from about 25 degrees to about 60 degrees. It is contemplated that this tapered tip structure of the hook26can provide improved and/or easier access to the hubcap slot52(FIG.8) as further disclosed herein.", "", "In exemplary aspects, the shaft20and slide hammer30may comprise steel or steel alloy materials. With reference toFIG.3, the hook26may be coated to prevent scratching and to increase grip. In one example, the hook26may be rubber coated. Optionally, the hook can comprise steel or steel alloy that is coated with rubber or other suitable material.", "", "As shown inFIG.1andFIG.2, the slide hammer30may be coupled to the shaft20between the first end22and the second end24. A first force acting on the slide hammer30along a first axis perpendicular to a hubcap in a first direction away from the wheel may cause the hook26to apply a second force to the hubcap along the first axis in the first direction. The slide hammer30may slide along the shaft20. A force may pull the slide hammer30along the shaft20to impact a stop proximate to the second end of the shaft20. For example, a user may use a hand to pull the slide hammer30along the shaft20until the slide hammer30impacts the stop. The inertia of the weight of the slide hammer30impacting the stop may be transferred to the shaft20, pulling the hook26engaged with a hubcap in a direction perpendicular or substantially perpendicular to the hubcap to detach the hubcap from a wheel. Alternatively, as shown inFIG.5, the slide hammer30may be spring loaded so that the slide hammer30does not slide up and down the shaft20freely. As shown inFIG.5, the second end24of the shaft20may include a plate or cap25. The plate or cap25may be coupled or connected to the second end24. Optionally, the plate or cap25may be coupled or connected to the second end24with a fastener27, in this example, a screw. Optionally, the second end24may include a recess29configured to receiver the fastener27. The spring21may act between the plate or cap25and a first end31of the slide hammer30. The spring21may bias the first end31of the slide hammer30towards the first end22of the shaft20. A force acting on the slide hammer30, pulling it towards the second end24of the shaft20, compresses the spring21. When the slide hammer30reaches its maximum travel towards the second end24of the shaft20, the force is transferred to the shaft20, pulling the hook26engaged with a hubcap in a direction perpendicular or substantially perpendicular to the hubcap to detach the hubcap from a wheel.", "", "As shown inFIG.1,FIG.2, andFIG.5, the device10may also include a grip40. The grip40may be coupled to the slide hammer30. The grip40may be coupled to the second end24of the shaft20. The grip40may be coupled to the second end24of the shaft20via the slide hammer30. With reference toFIG.6andFIG.7, the grip40may include a receiving portion42configured to receive the slide hammer30and/or the second end24of the shaft20. The receiving portion42may be hollow to receive the slide hammer30and/or the second end24of the shaft20. The receiving portion42may be coupled or connected to the slide hammer30and/or the second end24of the shaft20. The receiving portion42may be coupled or connected to the slide hammer30and/or the second end24of the shaft20via fasteners, adhesive, or friction fit. The exterior surface of the receiving portion42may be configured to fit the base of a user's hand. The grip40may include a base44. In one example, the base44is elastomeric. The base44may have a diameter DBgreater than a diameter DRof the receiving portion. In one example, the base44may have a concave surface46. The shape, diameter, and/or material of the grip40may be configured to allow a user to use the grip40to attach a hubcap to a wheel. For example, a user may use the grip40to apply force to the hubcap to attach the hubcap to the wheel. The generally large surface46of the grip40may distribute the force equally across the hubcap allowing attachment of the hubcap without damaging the hubcap and/or wheel. Optionally, the grip can comprise a rubber, polymer, and/or plastic material. However, it is contemplated that any suitable materials can be used.", "", "FIGS.8-10show a method of removing a hubcap50from a wheel60with an example device10. The device10may be used to remove the hubcap50by using the device10to apply a force to the hubcap50along a first axis70. As shown inFIG.8, the first axis70may be perpendicular or substantially perpendicular to the hubcap50. The hook26of the device10may be inserted into a hubcap slot52. With reference toFIG.9, a first force72acting on the slide hammer30, such as a user pulling on the slide hammer30, along the first axis70in a first direction away from the wheel60may cause the hook26to apply a second force74to the hubcap50along the first axis70in the first direction. In one example, the user may provide pressure to the hubcap50with a first hand and pull the slide hammer30with a second hand. With reference toFIG.10, the second force74acting on the hubcap50may disengage the hubcap50from the wheel60. The user may apply pressure on the hubcap50with a hand to prevent the hubcap50from falling when disengaged from the wheel60.", "", "With reference toFIG.11, the device10may be used to attach a hubcap50to a wheel60of a vehicle. The base44of the grip40of the device10may be used to apply a force76to the hubcap50to attach the hubcap50to the wheel60. In one example, a user may use a first hand to apply pressure to the hubcap and a second hand to apply the force76via the base44of the grip40to the hubcap50.", "", "Although the foregoing invention has been described in some detail by way of illustration and example for purposes of clarity of understanding, certain changes and modifications may be practiced within the scope of the appended claims."], "claims": ["a shaft including a first end and a second end, the first end including a hook having a degree of bend greater than 90 degrees; and a slide hammer coupled to the shaft between the first end and the second end, the slide hammer being spring-loaded, wherein a first force acting on the slide hammer along a first axis perpendicular to the hubcap in a first direction away from the wheel causes the hook to apply a second force to the hubcap along the first axis in the first direction.", "2 . The device according to claim 1 , wherein the device is further configured to remove the hubcap by applying the second force to the hubcap along the first axis that is perpendicular to the hubcap.", "3 . The device according to claim 1 , wherein the shaft has a length ranging from 11.5 to 13.5 inches.", "4 . The device according to claim 1 , wherein the degree of bend of the hook ranges from 130 to 200 degrees.", "5 . (canceled)", "6 . The device according to claim 1 , wherein the hook includes a rubber coating.", "7 . The device according to claim 1 , wherein the hook has a width ranging from 0.4 to 0.6 inches.", "8 . The device according to claim 1 , wherein the hook has an inner radius ranging from 0.1 to 0.3 inches.", "9 . The device according to claim 1 further comprising a grip coupled to the second end of the shaft.", "10 . The device according to claim 9 , wherein the grip includes a receiving portion configured to receive the second end of the shaft and an elastomeric base having a diameter greater than a diameter of the receiving portion of the grip.", "removing a hubcap from a wheel of a vehicle using a device, the device having: a shaft including a first end and a second end, the first end including a hook having a degree of bend greater than 90 degrees; and a slide hammer coupled to the shaft between the first end and the second end, the slide hammer being spring-loaded, wherein a first force acting on the slide hammer along a first axis perpendicular to the hubcap in a first direction away from the wheel causes the hook to apply a second force to the hubcap along the first axis in the first direction, wherein the device removes the hubcap without using torque or leverage applied against a component that is not the hubcap.", "12 . The method according to claim 11 , wherein the hubcap is removed by using the device to apply the second force to the hubcap along the first axis that is perpendicular to the hubcap.", "inserting the hook into a slot in the hubcap; and with the hook inserted into the slot in the hubcap, applying the first force to the slide hammer by pulling on the slide hammer to cause the second force on the hubcap.", "14 . The method according to claim 13 , wherein a user of the device provides pressure to the hubcap with a first hand and pulls the slide hammer with a second hand.", "inserting the hook into a second slot in the hubcap; and with the hook inserted into the second slot in the hubcap, applying the first force to the slide hammer by pulling on the slide hammer to cause the second force on the hubcap.", "a shaft including a first end and a second end, the first end including a hook having a degree of bend greater than 90 degrees; a slide hammer coupled to the shaft between the first end and the second end, the slide hammer being spring-loaded; and a grip including a receiving portion coupled to the second end of the shaft and an elastomeric base having a diameter greater than a diameter of the receiving portion of the grip.", "17 . The method according to claim 16 , further comprising using the elastomeric base to apply a force to the hubcap to attach the hubcap to the wheel.", "18 . The method according to claim 17 , wherein a user of the device provides pressure to the hubcap with a first hand and holds the device with a second hand.", "19 . The device according to claim 1 , wherein the second end of the shaft comprises a cap, and wherein the spring of the spring-loaded slide hammer acts between the cap and a first end of the slide hammer and biases the first end of the slide hammer towards the first end of the shaft.", "20 . The device according to claim 19 , wherein the slide hammer is configured such that a force acting on the slide hammer pulls the slide hammer towards the second end of the shaft thereby compressing the spring.", "21 . The device according to claim 20 , wherein the slide hammer is configured such that upon compressing the spring and the slide hammer reaching its maximum travel towards the second end of the shaft, the force transfers to the shaft to pull the hook to apply the second force to the hubcap."], "bibtex": "@patent{20240165993,\n    title = {Hubcap Removal Device And Method Of Use},\n    number = {20240165993},\n    year = {2024},\n    note = {File: US20240165993A1-20240523.XML}\n    }", "classification": "B60B3106FI"}, {"title": "A ROLLING DEVICE FOR DISPLACING A WHEEL", "doc_number": "20240165994", "filename": "US20240165994A1-20240523.XML", "abstract": "A rolling device for a device to enable the moving of the device along a surface comprises a wheel axle carrying a wheel, a lead screw with a nut, at least one axle support member rotatably connected in one end in a fixed pivot point and in the other end connected to the lead screw nut, and a drive motor connected to the lead screw to rotate the lead screw for displacing the lead screw nut and thereby displacing the wheel between an extended position and a retracted position. Each axle support member supports an end portion of the wheel axle, and the wheel has two side faces. The lead screw is arranged tangentially to the rotational direction of the wheel between the two side faces of the wheel at a distance from the wheel axle larger than the radius of the wheel.", "detailed_description": [""], "claims": ["a wheel axle carrying a wheel, where the wheel has two side faces, a lead screw with a nut, at least one axle support member rotatably connected in one end in a fixed pivot point and in the other end connected to the lead screw nut, wherein each axle support member supports an end portion of the wheel axle, and a drive motor connected to the lead screw to rotate the lead screw for displacing the lead screw nut and thereby displacing the wheel between an extended position and a retracted position, wherein the lead screw is arranged tangentially to the rotational direction of the wheel between the two side faces of the wheel at a distance from the wheel axle larger than the radius of the wheel.", "2 . A rolling device according to claim 1 , comprising two axle support members arranged parallel to the side faces of the wheel and two spacers connecting one end of the axle support members to the lead screw nut.", "3 . A rolling device in accordance with claim 1 , wherein the drive motor has a first driving direction for displacement of the wheel into the retracted position, and a second driving direction for displacement of the wheel into the extended position.", "4 . A rolling device according to claim 1 , comprising a gear arrangement arranged in engagement with the motor and the lead screw to transferring rotation from the motor to the lead screw.", "5 . A rolling device according to claim 1 , where the lead screw is flexible connected to the housing.", "6 . A rolling device according to claim 1 , wherein a second drive motor is located within the wheel for rotation of the wheel relative to the wheel axle.", "7 . A rolling device according to claim 1 , wherein a control unit controls the rolling device and the control unit receives control signals for operation of the first and/or second drive motor from a remote control, computer, cell phone or by voice-activation.", "8 . A rolling device according to claim 1 comprising a housing and where the fixed pivot point in is accommodated in the housing.", "9 . A rolling device according to claim 8 , where the housing accommodates the wheel axle, the wheel, the lead screw, the nut, the axle support member and the motor.", "10 . A rolling device according to claim 8 , where in the extended position at least a portion of the wheel projects outside the housing."], "bibtex": "@patent{20240165994,\n    title = {A ROLLING DEVICE FOR DISPLACING A WHEEL},\n    number = {20240165994},\n    year = {2024},\n    note = {File: US20240165994A1-20240523.XML}\n    }", "classification": "B60B3306FI"}, {"title": "Gauge Wheel and Closing Wheel Retainer", "doc_number": "20240165995", "filename": "US20240165995A1-20240523.XML", "abstract": "A wheel retainer that retains a wheel on a wheel mount and prevents the wheel from being fully separated from the wheel mount in the event of a failure of a wheel bearing. In some embodiments, a wheel retainer includes a sleeve, and a retaining member coupled to the sleeve. The retaining member has a retaining diameter sized such that when a wheel bearing fails, a wheel mounted on the wheel bearing is retained at least partially on the sleeve by the retaining member.", "detailed_description": [""], "claims": ["a sleeve having an internal diameter sized to receive a shaft of a mounting bolt that engages to a wheel mount, the sleeve having an inner end configured to be positioned proximate to a wheel bearing positioned proximate to the wheel mount, and an outer end opposite from the inner end; and a retaining member coupled to the sleeve proximate to the outer end, the retaining member having a retaining diameter sized such that when the wheel bearing fails, a wheel mounted on the wheel bearing is retained at least partially on the sleeve by the retaining member.", "2 . The wheel retainer of claim 1 , wherein the retaining diameter of the retaining member is greater than a bearing diameter of the wheel bearing.", "3 . The wheel retainer of claim 1 , wherein the retaining diameter of the retaining member is larger than an inner diameter of an outer race of the wheel bearing.", "4 . The wheel retainer of claim 1 , wherein the retaining diameter of the retaining member is larger than an inner diameter of an outer race of the wheel bearing such that when the wheel bearing fails, the wheel mounted on the wheel bearing is retained at least partially on the sleeve by the retaining member and does not become fully separated from the wheel mount.", "5 . The wheel retainer of claim 1 , wherein the retaining member is coupled to the sleeve by a weldment that peripherally surrounds the outer end of the sleeve.", "6 . The wheel retainer of claim 1 , wherein the sleeve comprises a cylindrical sleeve, and wherein the retaining member is coupled to the cylindrical sleeve by a weldment that peripherally surrounds the outer end of the cylindrical sleeve, the weldment being configured to engage a head of the mounting bolt when the mounting bolt is inserted through the cylindrical sleeve into engagement with the wheel mount.", "7 . The wheel retainer of claim 1 , wherein the sleeve comprises a steel cylindrical sleeve and the retaining member comprises a steel annular member.", "8 . The wheel retainer of claim 1 , wherein the sleeve and the retaining member are integrally formed.", "a wheel bearing configured to be coupled to a wheel mount; a wheel operatively coupled to the wheel bearing; and a wheel retainer positioned proximate to at least one of the wheel or the wheel bearing, the wheel retainer including: a sleeve having an internal diameter sized to receive a shaft of a mounting bolt that engages to the wheel mount, the sleeve having an inner end configured to be positioned proximate to the wheel bearing, and an outer end opposite from the inner end; and a retaining member coupled to the sleeve proximate to the outer end, the retaining member having a retaining diameter sized such that when the wheel bearing fails, the wheel is retained at least partially on the sleeve by the retaining member.", "10 . The wheel assembly of claim 9 , wherein the retaining diameter of the retaining member is larger than a bearing diameter of the wheel bearing.", "11 . The wheel assembly of claim 9 , wherein the retaining diameter of the retaining member is larger than an inner diameter of an outer race of the wheel bearing.", "12 . The wheel assembly of claim 9 , wherein the retaining diameter of the retaining member is larger than an inner diameter of an outer race of the wheel bearing such that when the wheel bearing fails, the wheel is retained at least partially on the sleeve by the retaining member and does not become fully separated from the wheel mount.", "13 . The wheel assembly of claim 9 , wherein the retaining member is coupled to the sleeve by a weldment that peripherally surrounds the outer end of the sleeve, the weldment being configured to engage a head of the mounting bolt when the mounting bolt is inserted through the sleeve into engagement with the wheel mount.", "14 . The wheel assembly of claim 9 , wherein the retaining member comprises at least one of an annular member, a cross-shaped member, a quadrilateral-shaped member, or a polygonal-shaped member.", "a frame; and a wheel assembly operatively coupled to the frame, the wheel assembly including: a wheel mount coupled to the frame; a wheel bearing configured to be coupled to the wheel mount; a wheel operatively coupled to the wheel bearing; and a wheel retainer positioned proximate to at least one of the wheel or the wheel bearing, the wheel retainer including: a sleeve having an internal diameter sized to receive a shaft of a mounting bolt that engages to the wheel mount, the sleeve having an inner end configured to be positioned proximate to at least one of the wheel or the wheel bearing, and an outer end opposite from the inner end; and a retaining member coupled to the sleeve proximate to the outer end, the retaining member having a retaining diameter sized such that when the wheel bearing fails, the wheel is retained at least partially on the sleeve by the retaining member.", "16 . The machine of claim 15 , wherein the sleeve comprises a cylindrical sleeve and wherein the retaining diameter of the retaining member is larger than an inner diameter of an outer race of the wheel bearing such that when the wheel bearing fails, the wheel is retained at least partially on the cylindrical sleeve by the retaining member and does not become fully separated from the wheel mount.", "17 . The machine of claim 15 , wherein the retaining member is coupled to the sleeve such that the retaining member is flush with the outer end of the sleeve such that a head of the mounting bolt engages at least one of the outer end or the retaining member when the mounting bolt is inserted through the cylindrical sleeve into engagement with the wheel mount.", "18 . The machine of claim 15 , wherein the retaining member comprises at least one of an annular member, a cross-shaped member, a quadrilateral-shaped member, or a polygonal-shaped member.", "19 . The machine of claim 15 , wherein the wheel retainer is positioned laterally outwardly from the wheel bearing.", "20 . The machine of claim 15 , wherein the wheel comprises a wheel configured to engage a ground surface in at least one of a vertical orientation or a non-vertical orientation."], "bibtex": "@patent{20240165995,\n    title = {Gauge Wheel and Closing Wheel Retainer},\n    number = {20240165995},\n    year = {2024},\n    note = {File: US20240165995A1-20240523.XML}\n    }", "classification": "B60B3504FI"}, {"title": "Tire Formulations Containing Products Derived from Depolymerized Polymers", "doc_number": "20240165996", "filename": "US20240165996A1-20240523.XML", "abstract": "Tire formulations containing at least one depolymerized wax, a natural rubber, styrene butadiene rubber, zinc oxide, an anti-ageing agent, sulfur, a napthenic process oil, polybutadiene rubber, carbon black, a paraffin wax, a microcrystalline wax, a Fischer Tropsch wax, stearic acid, and/or a rubber accelerator are disclosed. The wax can be made by catalytic depolymerization and/or thermal degradation of polymeric material. The polymeric material can be polypropylene and/or polyethylene. In some embodiments, the polymeric material can contain at least partially recycled material.", "detailed_description": ["Various waxes generated from plastic feedstocks can be used to modify tire formulations containing various elements, including but not limited to at least one depolymerized wax, a natural rubber, styrene butadiene rubber, a napthenic oil, zinc oxide, an anti-ageing agent, sulfur, silica filler, polybutadiene rubber, carbon black, a paraffin wax, a microcrystalline wax, a Fischer Tropsch wax, an antioxidant, stearic acid, and/or a rubber accelerator. In some embodiments, the wax is made by catalytic depolymerization of polymeric material. In some embodiments, the wax is made by depolymerizing and/or thermally degrading polymeric material. In some embodiments, the catalyst used is a zeolite or alumina supported system or a combination of the two. In some embodiments, the catalyst is [Fe—Cu—Mo—P]/Al2O3.", "", "In some embodiments, the catalyst is prepared by binding a ferrous-copper complex to an alumina or zeolite support and reacting it with an acid comprising metals and non-metals to obtain the catalyst material. In some embodiments, the catalyst comprises Al, Fe, Cu, and O, prepared by binding ferrous and copper complexes to an alumina and/or zeolite support. Other suitable catalyst materials include, but are not limited to, zeolite, mesoporous silica, H-mordenite and alumina.", "", "In some embodiments, the wax is made by catalytically depolymerizing and/or thermally degrading polymeric material. In some embodiments, depolymerization can occur through the action of free radical initiators or the exposure to radiation.", "", "In some embodiments, the polymeric material is polyethylene. In some embodiments, the polymeric material is polypropylene. In some embodiments, the polymeric material is polystyrene. The polymeric material can be polypropylene (PP), polystyrene (PS), high-density polyethylene (HDPE), low-density polyethylene (LDPE), linear low-density polyethylene (LLDPE), and/or other variations of polyethylene.", "", "In other embodiments, the polymeric material includes both polyethylene and polypropylene material. In some embodiments, the polymeric material is divided evenly by weight between polyethylene and polypropylene. In some embodiments, the polymeric material can contain between 0% to 20% by weight PP, lower levels of polystyrene, polyethylene terephthalate (PET), ethylene-vinyl acetate (EVA), polyvinyl chloride (PVC), ethylene vinyl alcohol (EVOH), and undesirable additives and/or contaminants, such as fillers, dyes, metals, various organic and inorganic additives, moisture, food waste, dirt, and/or other contaminating particles.", "", "In some embodiments, the resulting wax includes greater than 20 ppm of iron; greater than 50 ppm of zinc; and/or greater than 20 ppm of titanium as determined by x-ray fluorescence. The presence of these metals can confirm that the waxes were derived through either post-consumer or post-industrial waste polymers. In at least some embodiments, these metals also well dispersed in the resulting waxes adding both polarity and reactivity. This can make the resulting waxes more compatible in various organic and aqueous solvent formations than traditional waxes. In addition, the added metal content can allow the resulting waxes to act as a coupling agent with other multi-polymer systems.", "", "In other embodiments, the polymeric material includes combinations of LDPE, LLDPE, HDPE, and PP.", "", "In some embodiments, the polymeric material comprises recycled plastics including, but not limited to, polyolefin, polystyrene, polyethylene, terephthalate, and/or multi-layer plastics. In other or the same embodiments, the polymeric material comprises recycled plastics and/or virgin plastics.", "", "In some embodiments, the polymeric material includes waste polymeric material feed. Suitable waste polymeric material feeds include mixed polystyrene waste, mixed polyethylene waste, mixed polypropylene waste, and/or a mixture including mixed polyethylene waste and mixed polypropylene waste. In some embodiments, the mixed polyethylene waste can include LDPE, LLDPE, HDPE, PP, or a mixture including combinations of LDPE, LLDPE, HDPE, and/or PP. In some embodiments, the mixed polyethylene waste can include film bags, milk jugs or pouches, totes, pails, caps, agricultural film, and/or packaging material. In some embodiments, the mixed polypropylene waste can include carpet fibers, bottle caps, yogurt containers, and/or bottle labels. In some embodiments, the mixed polystyrene waste can include food packaging containers, insulation, and/or electronic packaging. In some embodiments, the waste polymeric material feed includes up to 10% by weight of material other than polymeric material, based on the total weight of the waste polymeric material feed. In some embodiments, the waste polymeric material feed includes 1% to 10% by weight of material other than polymeric material, based on the total weight of the waste polymeric material feed.", "", "In some embodiments, the polymeric material is one of, or a combination of, virgin polyethylene (any one of, or combinations of, HDPE, LDPE, LLDPE and medium-density polyethylene (MDPE)), virgin polypropylene, or post-consumer, or post-industrial, polyethylene and/or polypropylene (exemplary sources including bags, jugs, bottles, pails, and/or other items containing PE and/or PP).", "", "In some embodiments, the addition of the depolymerized wax changes the physical characteristics of the tire formulations including, but not limited to:improving the lifespan of a tire by reducing the damage potential of ozone, which leads to cracking;reducing the number of additional waxes needed to be used in the formulation, for instance if both a microcrystalline and a paraffin wax are needed in a formulation, in some embodiments it is possible to substitute both with one polyethylene wax.reducing, or even eliminating, tire “blooming”, as many of the depolymerized waxes made from recycled materials are naturally darker in color;increasing the melt flow rate during manufacturing; and/orimproving the mold release during manufacturing.", "", "In some embodiments, the tire formulation can include at least one depolymerized wax, a natural rubber, styrene butadiene rubber, zinc oxide, an anti-ageing agent, sulfur, silica filler, polybutadiene rubber, carbon black, a paraffin wax, a microcrystalline wax, a Fischer Tropsch wax, stearic acid, a napthenic process oil, and/or a rubber accelerator.", "", "In some embodiments, the natural rubber can be, but is not limited to, a constant viscosity (CV) rubber such as CV60.", "", "In some embodiments, the anti-ageing agent can be, but is not limited to, a paraphenylenediamine (PPD).", "", "In some embodiments, the rubber accelerator can be, but is not limited to, N-tert-butyl-2 benzothiazolesulfenamide (BBTS).", "", "In some embodiments, the napthenic process oil can be, but is not limited to, Calsol™ M 8240.", "", "In some embodiments, the percentage of depolymerized wax in the tire formulation can be between and inclusive of 0.5 to 10 percent by weight. In some preferred embodiments, the percentage of depolymerized wax in the tire formulation can be between and inclusive of 1-5 percent by weight.", "", "In some embodiments, the percentage of the natural rubber in the tire formulation can be between and inclusive of 10-80 percent by weight. In some preferred embodiments, the percentage of the natural rubber in the tire formulation can be between and inclusive of 40-60 percent by weight.", "", "In some embodiments, the percentage of zinc oxide in the tire formulation can be between and inclusive of 1-5 percent by weight. In some preferred embodiments, the percentage of zinc oxide in the tire formulation can be between and inclusive of 2-4 percent by weight.", "", "In some embodiments, the percentage of the anti-ageing agent in the tire formulation can be between and inclusive of 0.5-10 percent by weight. In some preferred embodiments, the percentage of the anti-ageing agent in the tire formulation can be between and inclusive of 1-3 percent by weight.", "", "In some embodiments, the percentage of the sulfur in the tire formulation can be between and inclusive of 0.5 to 5 percent by weight. In some preferred embodiments, the percentage of the sulfur in the tire formulation can be between and inclusive of 1-3 percent by weight.", "", "In some embodiments, the percentage of styrene butadiene rubber in the tire formulation can be between and inclusive of 10-70 percent by weight. In some preferred embodiments, the percentage of styrene butadiene rubber in the tire formulation can be between and inclusive of 15-30 percent by weight.", "", "In some embodiments, the percentage of silica filler in the tire formulation can be between and inclusive of 20-50 percent by weight. In some preferred embodiments, the percentage of silica filler in the tire formulation can be between and inclusive of 25-30 percent by weight.", "", "In some embodiments, the percentage of polybutadiene rubber in the tire formulation can be between and inclusive of 15-70 percent by weight. In some preferred embodiments, the percentage of polybutadiene in the tire formulation can be between and inclusive of 40-50 percent by weight.", "", "In some embodiments, the percentage of carbon black in the tire formulation can be between and inclusive of 10-60 percent by weight. In some preferred embodiments, the percentage of carbon black in the tire formulation can be between and inclusive of 45-55 percent by weight.", "", "In some embodiments, the percentage of the stearic acid can be between and inclusive of 0.5 to 5 percent by weight. In some preferred embodiments, the percentage of the stearic acid in the tire formulation can be between and inclusive of 1-2 percent by weight.", "", "In some embodiments, the percentage of the rubber accelerator in the tire formulation can be between and inclusive of 0.5 to 5 percent by weight. In some preferred embodiments, the percentage of the rubber accelerator in the tire formulation can be between and inclusive of 1-2 percent by weight.", "", "In some embodiments, the percentage of the paraffin wax in the tire formulation can be between and inclusive of 1-10 percent by weight. In some preferred embodiments, the percentage of the paraffin wax in the tire formulation can be between and inclusive of 2-5 percent by weight.", "", "In some embodiments, the percentage of the microcrystalline wax in the tire formulation can be between and inclusive of 1-10 percent by weight. In some preferred embodiments, the percentage of the microcrystalline wax in the tire formulation can be between and inclusive of 2-5 percent by weight.", "", "In some embodiments, the percentage of the Fischer Tropsch wax in the tire formulation can be between and inclusive of 1-10 percent by weight. In some preferred embodiments, the percentage of the Fischer Tropsch wax in the tire formulation can be between and inclusive of 2-5 percent by weight.", "", "In some embodiments, the depolymerized wax is a polypropylene-based wax. In some embodiments, the depolymerized wax is a polyethylene-based wax.", "", "In some embodiments the waxes can have melting points between and inclusive of 100-170° C., viscosities between and inclusive of 20-10,000 cps, and/or acid numbers between and inclusive of 0-50 mg KOH/g. In some preferred embodiments, the wax(es) employed have melting points between and inclusive of 110-170° C., viscosities between and inclusive of 20-5,000 cps, and/or acid numbers between and inclusive of 0-34 mg KOH/g. In some more preferred embodiments, the wax(es) employed have melting points between and inclusive of 112-166° C., viscosities between and inclusive of 37.5-3000 cps, and/or acid numbers between and inclusive of 0-22 mg KOH/g. In some even more preferred embodiments, the waxes have viscosities between 100-350 cps. In some embodiments, the waxes have dropping points between 113-119° C.", "", "Changes in melting point, viscosity, molecular weight, and/or polymer backbone structure of the wax can change the properties of the tire formulation. In general, addition of waxes will reduce the damage from ozone and can potentially reduce the damage from heating, and aid in processing.", "", "In some embodiments, use of waxes can produce a stable tire formulation.", "", "In some embodiments, the natural rubber, styrene butadiene rubber, zinc oxide, anti-ageing agent, sulfur, silica filler, polybutadiene rubber, carbon black, stearic acid, and/or rubber accelerator and wax(es) are mixed together.", "", "In some embodiments, a banbury or similar mixer is used. In some embodiments, the mixing is conducted at temperatures between and inclusive of 120 C to 160° ° C.", "", "Changes to the wax, including but not limited to its molecular weight, and/or polymer backbone structure, can change the properties of the final tire formulation.", "", "In some embodiments the depolymerized wax offsets, if not eliminates, the use of paraffin waxes, Fischer Tropsch waxes, and/or microcrystalline waxes without negatively affecting the tire formulation.", "", "Any numerical value ranges recited herein include all values from the lower value to the upper value in increments of one unit provided that there is a separation of at least two units between any lower value and any higher value. For example, if a range is listed from 1 to 100, specifically from 30 to 70, more specifically from 40 to 50, it is intended that values such as 25 to 75, 27 to 65, 45 to 60, 32 to 37, and so on, are expressly enumerated in this specification. For values which are less than one, one unit is considered to be 0.0001, 0.001, 0.01 or 0.1 as appropriate. These are only examples of what is specifically intended and all possible combinations of numerical values between the lowest value and the highest value are to be treated in a similar manner.", "", "While particular elements, embodiments and applications of the present invention have been shown and described, it will be understood, that the invention is not limited thereto since modifications can be made without departing from the scope of the present disclosure, particularly in light of the foregoing teachings."], "claims": ["an amount of a depolymerized wax; an amount of a styrene butadiene rubber; an amount of a silica filler; an amount of a polybutadiene; and an amount of carbon black.", "2 . The tire formulation of claim 1 further comprising at least two of an amount of an antioxidant, an amount of sulfur, an amount of stearic acid, and/or an amount of a rubber accelerator.", "3 . The tire formulation of claim 1 further comprising an amount of a paraffin wax.", "4 . The tire formulation of claim 1 further comprising an amount of an antioxidant.", "5 . The tire formulation of claim 1 further comprising an amount of sulfur.", "6 . The tire formulation of claim 1 further comprising an amount of stearic acid.", "7 . The tire formulation of claim 1 further comprising an amount of a rubber accelerator.", "8 . The tire formulation of claim 1 wherein said depolymerized wax is a polypropylene-based wax.", "9 . The tire formulation of claim 1 wherein said depolymerized wax is a polyethylene-based wax.", "10 . The tire formulation of claim 1 further comprising an amount of a natural rubber.", "11 . The tire formulation of claim 1 further comprising an amount of zinc oxide.", "12 . The tire formulation of claim 1 further comprising an amount of an anti-ageing agent.", "13 . The tire formulation of claim 10 wherein said natural rubber is CV60.", "14 . The tire formulation of claim 12 wherein said anti-ageing agent is a paraphenylenediamine.", "15 . The tire formulation of claim 7 wherein said rubber accelerator is N-tert-butyl-2 benzothiazolesulfenamide.", "16 . The tire formulation of claim 1 wherein said amount of said depolymerized wax is between and inclusive of 1-5 percent by weight of said tire formulation.", "17 . The tire formulation of claim 10 wherein said amount of said natural rubber is between and inclusive of 40-60 percent by weight of said tire formulation.", "18 . The tire formulation of claim 11 wherein said amount of zinc oxide is between and inclusive of 2-4 percent by weight of said tire formulation.", "19 . The tire formulation of claim 14 wherein said amount of said anti-ageing agent is between and inclusive of 1-3 percent by weight of said tire formulation.", "an amount of a depolymerized wax; an amount of a styrene butadiene rubber; an amount of a silica filler; an amount of a polybutadiene; an amount of carbon black; an amount of an antioxidant; an amount of sulfur; an amount of stearic acid; an amount of a rubber accelerator, wherein said rubber accelerator is N-tert-butyl-2 benzothiazolesulfenamide; an amount of zinc oxide; and an amount of paraphenylenediamine; wherein said depolymerized wax is a polypropylene-based wax, wherein said amount of said depolymerized wax is between and inclusive of 1-5 percent by weight of said tire formulation, wherein said amount of zinc oxide is between and inclusive of 2-4 percent by weight of said tire formulation, wherein said amount of anti-ageing agent is between and inclusive of 1-3 percent by weight of said tire formulation, wherein said amount of sulfur is between and inclusive of 1-3 percent by weight of said tire formulation, wherein said amount of styrene butadiene rubber is between and inclusive of 15-30 percent by weight of said tire formulation, wherein said amount of silica filler is between and inclusive of 25-30 percent by weight of said tire formulation."], "bibtex": "@patent{20240165996,\n    title = {Tire Formulations Containing Products Derived from Depolymerized Polymers},\n    number = {20240165996},\n    year = {2024},\n    note = {File: US20240165996A1-20240523.XML}\n    }", "classification": "B60C100FI"}, {"title": "TIRE COMPRISING A CIRCUMFERENTIAL CUT-OUT AND A DURABLE STIFFENING STRUCTURE AND ENABLING OPTIMIZED FLATTENING OF THE TREAD", "doc_number": "20240165997", "filename": "US20240165997A1-20240523.XML", "abstract": "A tire ( 10 ) includes a stiffening structure ( 50 ) comprising stiffening elements ( 52 ) anchored in the crown ( 12 ) and extending into the toroidal cavity ( 35 ) between a radially inner anchor point ( 54 A, 54 B) and a radially outer anchor point ( 56 A, 56 B). The tread ( 14 ) has a profile height and comprises a plurality of ribs ( 102, 104, 106, 108, 110 ), two adjacent ribs being axially separated from each other by a main circumferential cut-out ( 112, 114, 116, 118 ) having a depth greater than or equal to 50% of the profile height. The radially outer anchor point ( 56 A, 56 B) is aligned with one of the ribs ( 102, 104, 106, 108, 110 ).", "detailed_description": [""], "claims": ["1 .- 13 . (canceled)", "wherein the or each stiffening element ( wherein the or each stiffening element ( wherein the or each stiffening element ( a radially inner anchor point ( a radially outer anchor point ( wherein the tread (", "wherein the radially inner reinforcing structure (", "16 . The tire ( 10 ) according to claim 14 , wherein the stiffening structure ( 50 ) comprises a plurality of stiffening elements ( 52 ; 52 A, 52 B; 53 ) circumferentially distributed in the toroidal cavity ( 35 ).", "wherein a median plane (M wherein the or each radially outer anchor point (", "wherein the or each stiffening element ( a first radially inner reinforcing structure ( the or a plurality of the radially outer reinforcing structures ( a second radially inner reinforcing structure ( so that the or each stiffening element ( wherein the or each stiffening element ( a first radially inner anchor point ( a first radially outer anchor point ( wherein the or each stiffening element ( a second radially inner anchor point ( a second radially outer anchor point ( each of the first and second radially outer anchor points (", "the first radially inner reinforcing structure ( first and second radially outer reinforcing structures ( the second radially inner reinforcing structure (", "wherein the or each first stiffening element ( a first radially inner reinforcing structure ( the or a plurality of the radially outer reinforcing structures ( wherein the or each second stiffening element is anchored in or around: a second radially inner reinforcing structure ( the or a plurality of the radially outer reinforcing structures ( so that the or each of the first and second stiffening elements ( wherein the or each first stiffening element ( a first radially inner anchor point ( a first radially outer anchor point ( wherein the or each second stiffening element ( a second radially inner anchor point ( a second radially anchor point ( each of the first and second radially outer anchor points (", "the first radially inner reinforcing structure ( a first radially outer reinforcing structure ( wherein the or each second stiffening element ( the second radially inner reinforcing structure ( a second radially outer reinforcing structure (", "22 . The tire ( 10 ) according to claim 19 , wherein the first and second radially outer reinforcing structures ( 70 A, 70 B) are axially on either side of the median plane (M) of the tire ( 10 ).", "the first radially outer anchor points ( the second radially outer anchor points ( the portion (", "wherein the first radially inner reinforcing structure ( wherein the second radially inner reinforcing structure (", "25 . The tire ( 10 ) according to claim 18 , wherein, the plurality of ribs ( 102 , 104 , 106 , 108 ) comprising at least first and second ribs separated axially by the, one of the or a plurality of the main circumferential cut-outs ( 112 , 114 , 116 , 118 ), each of the first and second radially outer anchor points ( 56 A, 56 B; 57 A, 57 B) is respectively aligned with each of the first and second ribs ( 102 , 104 , 106 , 108 ).", "26 . The tire ( 10 ) according to claim 18 , wherein each of the first and second radially outer anchor points ( 56 A, 56 B; 57 A, 57 B) is respectively aligned with the same rib ( 102 , 104 , 106 , 108 ) of the plurality of ribs ( 102 , 104 , 106 , 108 ).", "27 . The tire ( 10 ) according to claim 21 , wherein the first and second radially outer reinforcing structures ( 70 A, 70 B) are axially on either side of the median plane (M) of the tire ( 10 ).", "the first radially outer anchor points ( the second radially outer anchor points ( the portion (", "wherein the first radially inner reinforcing structure ( wherein the second radially inner reinforcing structure (", "30 . The tire ( 10 ) according to claim 20 , wherein, the plurality of ribs ( 102 , 104 , 106 , 108 ) comprising at least first and second ribs separated axially by the, one of the or a plurality of the main circumferential cut-outs ( 112 , 114 , 116 , 118 ), each of the first and second radially outer anchor points ( 56 A, 56 B; 57 A, 57 B) is respectively aligned with each of the first and second ribs ( 102 , 104 , 106 , 108 ).", "31 . The tire ( 10 ) according to claim 20 , wherein each of the first and second radially outer anchor points ( 56 A, 56 B; 57 A, 57 B) is respectively aligned with the same rib ( 102 , 104 , 106 , 108 ) of the plurality of ribs ( 102 , 104 , 106 , 108 )."], "bibtex": "@patent{20240165997,\n    title = {TIRE COMPRISING A CIRCUMFERENTIAL CUT-OUT AND A DURABLE STIFFENING STRUCTURE AND ENABLING OPTIMIZED FLATTENING OF THE TREAD},\n    number = {20240165997},\n    year = {2024},\n    note = {File: US20240165997A1-20240523.XML}\n    }", "classification": "B60C512FI"}, {"title": "TYRE FOR VEHICLE WHEELS", "doc_number": "20240165998", "filename": "US20240165998A1-20240523.XML", "abstract": "A tyre for vehicle wheels comprises at least one structural component including a plurality of textile reinforcing cords ( 10 ′), at least some of which comprise at least two yarns ( 20 a, 20 b ) twisted together. At least one of said yarns ( 20 a, 20 b ) is a texturized yarn ( 210 ) comprising a plurality of first filaments ( 201 a ) made of a recycled plastic material mixed with a plurality of second filaments ( 202 a ) made of a non-recycled plastic material.", "detailed_description": [""], "claims": ["1 - 12 . (canceled)", "at least one structural component comprising a plurality of textile reinforcing cords, wherein at least some of the textile reinforcing cords comprise at least two yarns twisted together, and wherein at least one of the at least two yarns is a texturized yarn comprising a plurality of first filaments made of a recycled plastic material mixed with a plurality of second filaments made of a non-recycled plastic material.", "14 . The tyre according to claim 13 , wherein the recycled plastic material is polyethylene terephthalate (PET).", "15 . The tyre according to claim 13 , wherein the non-recycled plastic material is PET at least partially of fossil origin, or bio-based, or nylon at least partially bio-based.", "16 . The tyre according to claim 13 , wherein the first filaments are in a proportion greater than or equal to 50% by weight with respect to the total weight of the texturized yarn.", "17 . The tyre according to claim 13 , wherein the texturized yarn has a linear density ranging from 300 dtex to 3500 dtex.", "18 . The tyre according to claim 13 , wherein the first filaments have a tenacity greater than, or equal to, 5 cN/dtex.", "19 . The tyre according to claim 13 , wherein the at least some textile reinforcing cords have an elongation at break greater than, or equal to, 12%.", "20 . The tyre according to claim 13 , wherein the at least some textile reinforcing cords have a number of twists per metre (tpm) lower than, or equal to, 350.", "21 . The tyre according to claim 13 , wherein the at least some textile reinforcing cords have a thermal shrinkage lower than, or equal to, 3%.", "22 . The tyre according to claim 13 , wherein at least another yarn of the at least two yarns is identical to the texturized yarn.", "23 . The tyre according to claim 13 , wherein the at least one structural component is a carcass ply, a zero degrees reinforcing layer, or a carcass ply and a zero degrees reinforcing layer.", "at least two yarns twisted together, wherein at least one of the at least two yarns is a texturized yarn comprising a plurality of first filaments made of a recycled plastic material partially mixed with a plurality of second filaments made of a non-recycled plastic material."], "bibtex": "@patent{20240165998,\n    title = {TYRE FOR VEHICLE WHEELS},\n    number = {20240165998},\n    year = {2024},\n    note = {File: US20240165998A1-20240523.XML}\n    }", "classification": "B60C900FI"}]