[{"title": "CONFIGURABLE WHEEL", "doc_number": "20240375429", "filename": "US20240375429A1-20241114.XML", "abstract": "A configurable wheel is provided with: a wheel drum, the wheel drum having a first rim of a first diameter on a first end of the wheel drum; a second rim of the first diameter on a second end, opposite to the first end, of the wheel drum; a facing that extends between a second diameter and a third diameter positioned concentrically to the first rim on the first end in a plane substantially perpendicular to an axis of rotation of the wheel drum; and a cavity defined inward from the second rim from the second end toward the first end; and a halo, connected to the wheel drum in an interstitial band defined on the first end between the first diameter and the second diameter.", "detailed_description": ["The present disclosure is generally related to a configurable thermoplastic wheel design. The present disclosure provides devices, systems, and methods that provide a configurable thermoplastic wheel with improved durability, airflow properties, and design modularity, among other benefits.", "", "The described wheel is made of a continuous fiber reinforced thermoplastic, which offers substantial weight reduction compared to typical aluminum or steel wheels, and is designed to improve vehicle range and ride quality. Although composite materials have been used to make high performance automotive wheels, these wheels are designed using continuous fiber reinforced thermoset composite materials with the typical ‘barrel-hub-spoke’ configuration, using an integrated spoke/mag wheel face that is either molded into the hub and drum (also referred to as a barrel), or fastened to the hub and drum with hardware.", "", "The described wheel can use a continuous fiber reinforced thermoplastic composite drum as the primary structure of the wheel, and connect various elements to the drum to provide additional structure. By using a thermoplastic composite for the drum (the largest component of the wheel), significant weight savings can be achieved in the wheel, which can lead to improved fuel or battery efficiency, but these lighter materials are more susceptible to damage than traditional alloy materials used in drums. Accordingly, the design of the drum includes various features to improve the resiliency of the drum against damage and to provide improved aerodynamics, and for the inclusions of one or more of a halo and a cap at different portions of the drum to protect the underlying drum and provide (in the event of damage) for easier repair or replacement than the drum or the wheel as a whole.", "", "The drum may be used together with an outer halo or “aero ring” that forms the radial portion of the wheel face, and can be configured for each vehicle and brake type to tailor the aerodynamic and brake cooling properties of the wheel to a particular vehicle or use case for the vehicle. The halo and a centrally positioned cap, can be made of a thermoplastic or another material, and provides a protective layer around the outward facing elements of the drum; reducing the risk of damage to the lightweight drum, and providing for adjustments to the aerodynamics, air intake/outtake properties, and aesthetics of the wheel. Accordingly, the prior designs lack a selectively replaceable outer wheel face that provides the various benefits of the wheel described herein.", "", "The described wheel includes various individual thermoplastic components, joined together to create a single, structural, lightweight wheel. The wheel uses thermoplastic composite materials, which are capable of being produced in high rates with significant automation, and are lower cost than traditional thermoset composite materials. The wheel uses an outer halo that comprises the outer portion of the wheel face surface, which includes an inner aerodynamic ‘flat’ profile. Together, these components can be designed to meet the unique aerodynamic and brake cooling requirements for specific vehicle types.", "", "In addition to customizing the halo for aerodynamic and cooling purposes, the halo and the cosmetic surface panel inside of the halo can be changed to alter the aesthetics of the wheel based on personal design preferences. The halo can be easily replaced, which keeps the wheel looking new and ‘fresh’ (e.g., after curb impact, debris strike, etc.), and protects the inner drum from damage.", "", "Additionally, the presently described wheels offer benefits in reducing vibration and sound produced by the wheels, which may be particularly important in electric vehicles (or hybrid vehicles operating in electric mode) due to the lack of engine noise compared to vehicles using internal combustion engines.", "", "FIGS.1A-1Cillustrate example designs for a wheel100, according to embodiments of the present disclosure. In each ofFIGS.1A-1C, a wheel100is shown on the same vehicle110with the same tire120, but with different designs for exterior components of a halo140a-c(generally or collectively, halo140), a facing of the drum130a-c(generally or collectively, drum130), and a cap150a-c(generally or collectively, cap150). Although at least partially obscured inFIGS.1A-1C, the interior components of the wheel100include a wheel drum130to which the tire120is affixed, and a supporting puck160to strengthen a connection with an axle of the vehicle110that is affixed to the wheel100.", "", "In various embodiments, the exterior components (e.g., the halo140, the facing170, and the cap150) are configured to selectively engage as members of the wheel100, such that a user may freely remove and reattach one or more of the exterior components as part of regular maintenance or to generally replace the parts without causing damage thereto.", "", "For example, a user may use the same tire120and wheel drum130with the same vehicle110, but replace the first halo140aand the first cap150awith the second halo140band the second cap150bto reconfigure the wheel100from the example shown inFIG.1Ato the example of the wheel100inFIG.1Bif the same wheel drum130is used. Similarly, the user may replace the first halo140aand the first cap150awith the third halo140cand the third cap150cto reconfigure the wheel100from the example shown inFIG.1Ato the example of the wheel100inFIG.1C, while still using the same tire120and wheel drum130with the same vehicle110. The user may also revert these changes-reattaching the first halo140aand the first cap150ato the wheel drum130to revert from the example shown inFIG.1BorFIG.1Cto the example shown inFIG.1A. Although not illustrated, a user may also mix and match the components in any ofFIGS.1A-1C(or other instances of the components than those illustrated) to customize the look and performance of a wheel100, and such customization is understood to be within the scope of the present disclosure.", "", "In various embodiments, the user may replace the exterior components for aesthetic reasons, to repair damage to the protective exterior components (as discussed in greater detail in regard toFIG.8), to change airflow characteristics of the wheel100(as discussed in greater detail in regard toFIGS.9A-9B), and combinations thereof.", "", "FIGS.2A and2Billustrate cross-sectional views of an example wheel100, according to embodiments of the present disclosure, withFIG.2Aidentifying different diameters of interest andFIG.2Bidentifying different planes of interest. The wheel100includes a wheel drum130, having a first diameter D1 at a first rim220a(generally or collectively, rim220) on a first end210a(generally or collectively, end210) of the wheel100and at the second rim220bon the second end210bof the wheel100, opposite to the first end210a. The rims220provide attachment points and mating surfaces to which the beads of a tire120may be secured when assembling the wheel100to affix the tire120to the wheel drum130. The rims220include various flanges and mounting humps to hold the tire onto the edges of the wheel drum130and ensure that rotational energy is transferred from the wheel drum130to the tire120when driving.", "", "Between the first rim220aand the second rim220b, the wheel drum130includes a sidewall230, on which an inner tube of a tire120may rest or with which the inner liner of a tubeless tire forms a pressurized region when the wheel100is fully assembled. In various embodiments, the sidewall230may have a variable diameter that decreases between the first end210aand the second end210b, with a diameter decreasing to a second diameter D2 before returning to the first diameter D1 at each end210(e.g., via mounting slopes).", "", "In various embodiments, the drum130is made of a thermoplastic composite that is reinforced with various materials. The drum130may be formed via injection molding, vacuum forming, additive material deposition, In various embodiments, the thermoplastic material may include an acrylic, acrylonitrile butadiene styrene (ABS), nylon (e.g., PA6, PA66, PA12, and other variants), polylactic acids (PLA), polybenzimidazole (PBI), a polycarbonate, a polysulfone, polyoxymethylene (POM), a polyaryletherketone (PAEK), polyetherimide (PEI), a polyethylene (PE), polyphenylene oxide (PPO), polyphenylene sulfide (PPS), polypropylene (PP), polyvinyl chloride (PVC), [olyvinylidene fluoride (PVDF), or polytetrafluoroethylene (PTFE) as a base resin. Various reinforcing materials may be incorporated into the base resin to add strength thereto, which may include carbon or organic-based filaments, fibers, sheets, meshes, and nanotubes; fiberglass filaments, fibers, sheets, meshes, and nanotube; metal filaments, fibers, sheets, meshes, and nanotubes; and combinations thereof. The present disclosure contemplates that other materials may be used in a composite wheel having components as described herein, and the recited materials are provided as non-limiting examples from which to make at least one component of such a wheel.", "", "Similarly to the drum130, the halos140and cap150may be made of a thermoplastic composite, but may be made of different materials (or a different construction of the same materials) than the drum130to provide greater resistance to impact than the material of the drum130. For example, the halo140and the cap150may be made of a metal (e.g., aluminum, steel, titanium, bronze, brass), a renewable organic (e.g., wood, bamboo, paper products), and may use a different combination or ratio of base resin and reinforcement materials than the drum130. Additionally or alternatively, the halos140and caps150may include various surface treatments to provide outer surfaces with different impact properties or aesthetic properties than the core materials used therein.", "", "The first end210aof the drum130includes the facing170, which is oriented substantially perpendicular to an axis of rotation for the wheel100. The facing170occupies an area between a third diameter D3 and a fourth diameter D4 (both less than the first diameter D1) in which a well260is defined. In various embodiments, the facing170may be made from a different material than the drum130, include a coating that is applied to the first end210aof the drum130, or be a sheet of another material secured to the first end210aof the drum130(e.g., via one or both of the halo140and the cap150), which can include various aesthetic designs, provide color options, or provide greater resistance against debris strikes than what is offered by the material used in the rest of the drum130.", "", "As shown inFIG.2B, the facing170is defined in a first plane P1 that is perpendicular to a rotational axis270for the drum130. In various embodiments, the first plane P1 may be a leading plane that is furthest on the first end210aof the drum130, while in other embodiments, portions of the first rim220aor the halo140may project further outward from the first plane P1. A second plant P2, parallel to the first plane P1, is defined on the second end210bof the drum130by the second rim220bdefines the opening of an attachment cavity in the drum130into which an axle seat and other components of a vehicle may be inserted into the wheel100. Other planes of interest that are parallel to the first plane and the second plane P2 include a third plane P3 that an inward side (e.g., facing the second end210bof the wheel100) of a puck160is oriented to, a fourth plane P4 that an outward side (e.g., facing the first end210aof the wheel100) of the puck160is orient to, and a fifth plane P5 to which the interstitial band240projects inward towards from the first plane P1.", "", "As used herein, unless another reference point is given or the meaning is clear from supplied context, the terms “central,” “centrally,” and similar terms shall be understood to refer to a relative position of an element as being closer to the axis270when measured in a perpendicular plane to the axis270. In contrast, the terms “radial,” “radially,” and similar terms shall be understood to refer to a relative position of an element as being further from the axis270when measured in a perpendicular plane to the axis270. For example, edge of the interstitial band240defined at the first diameter D1 may be considered more radial than the edge of the interstitial band240defined at the third diameter D3. In another example, the opening to the well260in the first plane P1 is located centrally to the facing170, and the facing170(in turn) is located radially relative to the opening of the well260.", "", "As used herein, unless another reference point is given or the meaning is clear from supplied context, the terms “inward,” “inwardly”, and similar terms shall be understood to refer to a relative position of an element as being closer to a sixth plane P6, parallel to and located equidistantly to the first plane P1 and the second plane P2. In contrast, the terms “outward,” “outwardly,” and similar terms shall be understood to refer to a relative position of an element as being further from a sixth plane P6-regardless of whether closer to the first plane P1 or the second plane P2. For example, the negative space of the well260and the interstitial band240project inward from the first plane P1 towards the second plane P2, and as shown the well260projects further inward than the interstitial band240as the fourth plane P4 is closer to the sixth plane P6 than the fifth plane P5 is. In another example, the circumference of the well260may be understood as decreasing as the well260projects further inward (e.g., tapering) or as increasing as the well260expands outward from the base to the opening in the first plane P1.", "", "The well260of the drum tapers from the fourth diameter D4 to a base of a fifth diameter D5, and captures the puck160at the base of the well260between one or more layers of material used to define the facing170and one or more layers of material on which the facing170is attached to the first end210aof the wheel100to the sidewall230of the drum130. In various embodiments, the puck160is covered by the cap150(not shown inFIG.2A or2B), which may occupy some or all of the negative space of the well260, or may project outward from the well260and provide various aesthetic designs, provide color options, or provide greater resistance against debris strikes than the inner walls of the well260. In various embodiments, the well260(or the well260and the puck160) includes a cap seat250that securing tabs of the cap150fit into to secure the cap150in the well260.", "", "When assembled, an interstitial band240between the first diameter D1 and the third diameter D3 is sized to accept the insertion of a halo140between the first rim220aand the facing170. In various embodiments, the dimensions of the third diameter D3 may be different between different wheel drums130(while maintaining the same first diameter D1) to affect the width of the interstitial band240; thereby allowing for larger or smaller halos140to be inserted in different wheels100using drums130sized for the same tires (e.g., by changing the relative ratios of surface areas of the facing170and the interstitial band240).", "", "In various embodiments, the number, size, shape, and relative locations of through holes in the halos140, and the materials selected for the halos140are designed for various purposes or vehicle models so that a user or manufacturer can easily select the appropriate halo140for a vehicle. As will be appreciated, the halos140may also incorporate different aesthetic designs in addition to the patterns created by the though holes, which a user can freely choose between.", "", "Accordingly, to meet the various mechanical and aesthetic goals of a user or manufacturer, and to improve reparability in the event that the halo140is damaged, the halo140is secured in the interstitial band240, but is selectively replaceable. In various embodiments, the halo140may be secured to the drum130via pressure mounts (e.g., being squeezed inwardly, centrally, or radially, and combinations thereof to the drum130until a releasing force is applied), paired magnets in the drum130and the halo140, the use of rotationally secured clasps (as shown inFIGS.4B and4D), or various screws/bolts that attach the halo140to the drum130.", "", "FIGS.3A-3Billustrate isometric views of example wheel drums130, according to embodiments of the present disclosure.FIG.3Ashows the example wheel drum130from a first angle, showing the portions of the drum130that face outward from a vehicle when installed thereto, andFIG.3Bshows the example wheel drum130from a second angle, showing the portions of the drum130that face inward and towards a vehicle when installed thereto.", "", "The drum130includes rims on the first end210aand the second end210bthat extend from a sidewall230used to secure a tire to the drum130. Internal to the rims, as shown inFIG.3B, the drum includes a facing170, and defines an interstitial band240between the radial rim220and the facing170that is sized to fit various halos140to the drum130. As shown inFIG.3B, the drum130defines a drum cavity330that the axle and other mounting hardware of the vehicle to which the wheel100is attached are disposed when connected to the wheel100. For example, the rotor, caliper assembly, brake pads/shoes, portions of the axle, various sensors, and the like, can be positioned within the drum cavity330.", "", "As shown inFIGS.3A and3B, one or more vents310are arranged circumferentially around the central side of the interstitial band240relative to the axis270of rotation for the wheel100and pass through to the drum cavity330, which allows air to pass between the first end210aand the second end210bof the drum130(e.g., to cool brakes held in the drum cavity330). In various embodiments, the vents310include mounting points for the halo140to clamp or clip onto the drum130. The present disclosure contemplates that more or fewer vents310of different sizes, shapes, or arrangements may be formed in the drum130than are shown in the non-limiting example ofFIGS.3A and3B.", "", "As shown inFIGS.3A and3B, one or more lug holes320are defined within the well260that pass through to the drum cavity330, which allow the lugs of the axle seat for the vehicle to pass through the drum130, which various lug nuts or the like can be used with to secure the axle to the drum130. The present disclosure contemplates that more or fewer lug holes320arranged in different patterns formed in the drum130than are shown in the non-limiting example ofFIGS.3A and3B. In various embodiments, one or more anti-rotation projections from the cap150may be secured in corresponding lug holes320in addition to or alternatively to securing tabs of the cap150that project into and are secured against the cap seat250defined concentrically within the well260.", "", "FIGS.4A-4Dillustrate example halos140a-bin various views, according to embodiments of the present disclosure.FIGS.4A and4Billustrate views of a first halo140a, whileFIGS.4C and4Dillustrate views of a second halo140b, having a different design than the first halo140a. The views shown inFIGS.4A and4Cshow the respective halos140from a first angle, showing the portions of the halo140that face outward from a vehicle when installed thereto, while views shown inFIGS.4B and4Dshow the respective halos140from a second angle, showing the portions of the halo140that face inward and towards a vehicle when installed thereto.", "", "Each halo140has a radial diameter410and a central diameter420between which an intake face430is defined. In various embodiments, the radial diameter410may be equal to, less than, or greater than the first diameter D1 of the drum130to control an amount of overlap of the halo140relative to the first rim220aof the drum130. Similarly, in various embodiments, the central diameter420may be equal to, less than, or greater than the third diameter D3 of the drum130to control an amount of overlap of the halo140relative to the facing170of the drum130.", "", "A plurality of ducts440are formed through the intake face430. As shown inFIGS.4A-4BversusFIGS.4C-4D, two halos140a-bof otherwise similar design may include respective pluralities of ducts440that differ in design based on one or more of a size, shape, number, orientation, and relative positioning of the ducts440. Each of the illustrated pluralities of ducts440are arranged circumferentially around the intake face430relative to the axis of rotation for the wheel100. In various embodiments, the number and placement of the ducts440is based on the number and placement of the vents310into the cavity330of the drum130and the cooling needs of components held within the cavity330. Accordingly, the different halos140may be used with the same drums130, to thereby provide different air through-put characteristics, damage protection characteristics, weight profiles, or aesthetics.", "", "On a back side of each halo140, as shown inFIGS.4B and4D, various engagement devices450may be provided to secure the halos140within the interstitial band240of the drum130. As illustrated, the engagement devices450include clips that are configured to engage with the vents of the drum when the halo140is rotated in a first direction while inserted in the interstitial band240, and disengage from the vents of the drum130when rotated in a second direction by a user (e.g., clockwise vs. counterclockwise) to allow a user to remove the halo140from the interstitial band240. Although shown with clips that rotate to secure the halo140with the drum130, in various embodiments, other engagement devices450may be used such as pressure mount clips, tabs, magnets (with corresponding magnets or ferromagnetic blocks within the wall of the drum130), screws/bolts, threads on an edge of the halo140to engage with threads in the interstitial band240, etc.", "", "FIGS.5A-5Cillustrates isometric views of example caps150a-b, according to embodiments of the present disclosure.FIG.5Aillustrates a view of a first cap150aandFIG.5Billustrates a view of a second cap150bshowing the portions of the respective caps150that face outward from a vehicle when installed thereto.FIG.5Cillustrates a view of a cap150(e.g., the first cap150a, the second cap150b, or another design of cap150) showing the portions of the caps150that face inward and towards a vehicle when installed thereto.", "", "The outward faces510of the caps150may include various aesthetic designs from one another, may be of different heights or dimensions (e.g., to project outward from the well260to different extents, to provide a flat face510coplanar with the facing170) while still using identical back faces520. Accordingly, a user can swap the cap150in a wheel100for a new cap150without disconnecting other components of the wheel100. The front face510covers any lugs protruding from the axle seat of a vehicle that the wheel100is connected to, provide aerodynamic improvements to the wheel100, and improves the aesthetic appeal of the wheel100.", "", "The back face520includes various hardware to connect the cap150to the drum130and prevent or reduce rotation of the cap150relative to the drum130. For example, a plurality of securing tabs530may project from the cap150and match to one or more corresponding slots for a cap seat250so that a user may push the cap150inward to the wheel100to snap the cap150in place. In an additional example, some embodiments of the cap150include one or more anti-rotation projections540that are configured to be inserted into the lug holes320of the drum130or other slots that are defined off-center to the axis270of rotation for the wheel100to thereby prevent rotation or reduce the freedom of rotation of the cap150relative to the rest of the wheel100when installed therein.", "", "FIGS.6A-6Cillustrate views of an example puck160, according to embodiments of the present disclosure.FIG.6Aillustrates a view of a puck160showing the portions of the puck160that face outward from a vehicle when installed thereto.FIG.6Billustrates a view of a puck160showing the portions of the puck160that face inward and towards a vehicle when installed thereto.FIG.6Cillustrates how the puck160is captured by the wheel drum130.", "", "Although in various embodiments the drum130is made of a fiber reinforced thermoplastic or resin material, the puck160may instead be made of a metal, such as aluminum, steel, cast iron, bronze, or the like, and is captured in place at the base of the well260by one or more layers of the drum material on an inward side of the puck160and by one or more layers of the drum material on an outward side of the puck160. Accordingly, the axle connection formed at the base of the well260with the puck160provides a metal-to-metal connection between the wheel100and an axle seat of the vehicle.", "", "The puck160includes a plurality of lug holes320that run from a first face610to a second face620. The first face610is generally flat, and when installed at the base of the well260, faces toward the first end210aof the wheel100. In contrast, when the puck160is installed at the base of the well260, the second face620faces toward the second end210bof the wheel100. Additionally, the second face620includes various indentations630that serve to ensure that the rotational energy imparted by a rotating axel connected to the puck160is transferred to the drum130with reduced or no slippage between the drum130and the puck160.", "", "The puck160serves as a connection point for the axle seat of a vehicle's axle to connect to the wheel100, which is likely made of a metal, as are the lugs of the axle. In some embodiments, by making the puck160of a different material than the drum130(e.g., a denser thermoplastic, a composite with a different ratio of resin to reinforcement material), the puck160provides a more impact-resistant and crush-resistant surface to join the axle to the wheel100than the material used by the drum130. By making the puck160of a metal, and exposing portions of the puck160from the material of the drum130, the puck160provides for metal-on-metal contact between the axle and the wheel100, rather than metal-on-plastic contact, which may damage the plastic, particularly if the lug nuts used to secure the lugs are overtightened over a plastic material or when the plastic is subject to damage during a rough installation of the drum130to the axle.", "", "Accordingly, in some embodiments the lug holes320are tapered to have a larger diameter on the first face610than on the second face620, to thereby allow the lugs to pass through the smaller opening on the second face620, and for the lug nuts that fasten around the lugs to seat in the larger opening on the first face610. Thereby, the lug nuts may avoid fastening over the material of the drum130, and be tightened down into the material of the puck160. Additionally, the lug holes320are defined in exposed surfaces640of the puck160so that when the lugs of the axle seat are secured to the lugs places through the lug holes320, the material of the exposed surfaces640contacts the axle seat, while the material of the drum130avoids contact or does not contact with axle seat.", "", "A central hole650may be defined centrally in the puck160, which is concentrically aligned with the axis270of rotation for the drum130when the puck160is installed therein. The central hole650may be formed to reduce the weight of the puck160, but also serves as a potential connection point for a cap150, which can be used to cover or otherwise hide from view any of the lugs or lug nuts used to secure the wheel100to a vehicle.", "", "Although illustrated with five lug holes320, the present disclosure contemplates that a puck160may be configured with more or fewer lug holes320than illustrated in the examples, and that the pattern of the lug holes320may also vary from what is illustrated, based on the number and placement of the lugs of a vehicle axle to which the wheel100is to be installed.", "", "FIGS.7A-7Dillustrate exploded views of a wheel100, according to embodiments of the present disclosure.FIGS.7A and7Billustrate views of a first assembly710a, whileFIGS.7C and7Dillustrate views of a second assembly710b, having a different design than the first assembly710a. The views shown inFIGS.7A and7Cshow the assemblies710a-bfrom a first angle, showing the portions of the wheel100that face outward from a vehicle when installed thereto, while views shown inFIGS.7B and7Dshow the respective assemblies710a-bfrom a second angle, showing the portions of the wheel100that face inward and towards a vehicle when installed thereto.", "", "When assembling a wheel100, the halo140is inserted into the interstitial band240and then secured to the drum130(e.g., by snapping into place via pressure mounts, via rotating engagement devices450to engage with corresponding features on the drum130, etc.). When disassembling the wheel100, to repair or replace (e.g., for aesthetic or performance purposes) a halo140, the halo140is released from the interstitial band240(e.g., by disengaging pressure mounts from constricting joints, via rotating in an opposite direction than used for assembly, etc.) and removed from the interstitial band240.", "", "When assembling a wheel100, the cap150is inserted into the well260and then secured to the drum130(e.g., by snapping into place via pressure mounts, via rotating engagement devices450to engage with corresponding features on the drum130, etc.). When disassembling the wheel100, to repair or replace (e.g., for aesthetic or performance purposes) a cap150, the cap150is released from the cap seat250(e.g., by rotating in an opposite direction than used for assembly) and removed from the well260.", "", "A user may repeat the assembly and disassembly process leaving other components of the wheel100in place. For example, a tire120connected to the drum130may remain connected to the drum130while installing or uninstalling a halo140or cap150. Similarly, a cap150may remain installed while installing or uninstalling a halo140, and a halo140may remain installed while installing or uninstalling a cap150. Additionally, after being initially installed and uninstalled, a user may reuse a halo140or a cap150; choosing to install those halos140or caps150to the same or a different wheel drum130at a later time.", "", "FIG.8illustrates a protective use case of an example wheel100, according to embodiments of the present disclosure. The tire120, the halo140, and the facing170(and in some embodiments, the cap150) obscure and protect the wheel drum130from debris820and prevent other objects from making direct contact with the structure of the wheel drum130, thereby providing a protective layer for the thermoplastic material of the wheel drum130. In various embodiments, the halo140or the cap150are made of a different material than the wheel drum130to provide a more durable exterior surface for the wheel100or an easier-to-replace component to restore functionality and appearance to the wheel100when being repaired. These different materials can including different mixtures of resin/fiber for a carbon-fiber reinforced thermoplastic that offer different mechanical properties than the thermoplastic used in the wheel drum130as well as thermoset plastics, metal alloys, or the like.", "", "In various embodiments, the halo140extends to cover the outward surfaces of the first rim220aso that the first rim220ais protected from curb strikes or debris strikes; allowing for the smaller, less expensive, and potentially more damage-resilient halo140to make contact with a curb810or debris820instead of the drum130. Because the halo140extends over the rim220a(at or beyond the first diameter D1) of the drum130and extends to the third diameter D3, any impact between the first diameter D1 and the third diameter D3 is absorbed by the halo140; preventing damage to the underlying portions of the larger and more difficult to replace drum130. Accordingly, by using the design described herein, after a driver strikes a curb810, the halo140is damaged but the drum130remains undamaged. After such a curb strike or other damage is sustained, the damaged halo140may be removed from the wheel100and be replaced with another instance of the halo140, without having to replace other components of the wheel100, thereby easing repair and replacement as an additional benefit of the present design.", "", "Similarly, by using the design described herein, after debris820strikes and damages the halo140, the damaged halo140may be removed from the wheel100and replaced with another instance of the halo140, without having to replace other components of the wheel100.", "", "Because the facing170is generally “flat” and is substantially perpendicular to an axis270of rotation for the wheel100(and therefore parallel to a direction of travel for the wheel100), any debris820that strikes the facing170is likely to do so at an oblique angle of impact; thereby avoiding full transfer of impact force to the wheel100and reducing the likelihood of the debris820causing damage to the facing170. In some embodiments, the facing170may include additional layers of material or coatings that are not present elsewhere on the drum130, to provide greater protection on the external portions of the wheel100without adding weight to portions of the wheel that do not need such protection.", "", "Although the well260provides surfaces that are angled towards the direction of travel for the wheel100that debris820may strike (e.g., not parallel to the direction of travel), the area of the well260is smaller than the wheel100as a whole (reducing the odds of a strike) and are presented at a sloped angle to the direction of travel; thereby increasing the effective thickness of the material and thereby reducing the likelihood of a direct impact for debris820. The sloped walls of the well260provided by the present design increase the odds of any debris820that does strike the well260to glance off with lower transfer of force than a direct impact, thereby improving the resiliency of the wheel100against damage. In some embodiments, the cap150extends to be flush with the facing170; thereby protecting any such surfaces of the well260from debris strikes by not exposing those surfaces.", "", "FIGS.9A-9Billustrate differences in airflows in different example wheel designs, according to embodiments of the present disclosure. As shown inFIG.9A, a first configuration of a wheel100with a first halo140aand first facing170aproduces a first airflow pattern910a(generally or collectively, airflow pattern910), while a second configuration of a wheel, as shown inFIG.9B, produces a second airflow pattern910bvia a second halo140band second facing170b.", "", "As shown, different amounts of air, at different locations on the wheels100in each of the airflow patterns910are drawn into the wheel assembly as intake air920, directed to flow past the wheel assembly as pass-by air930, or ejected from the wheel assembly as outflow air940.", "", "Because the facing170is generally perpendicular to the direction of travel and does not include any through holes into the cavity330, the surrounding air is drawn into the wheel assembly via the ducts440in the halo140forward on the vehicle in the direction of travel and routed into the cavity330via the vents310. The air drawn into the cavity300is then ejected from the cavity300, having absorbed heat from the components in the cavity330, in the reverse route-exiting the vents310and then the ducts440in the halo140rearward on the vehicle in the direction of travel. The intake air920may be draw into the forward ducts400via air intake scoops or other structures on the halo140, and ejected from the cavity300via a pressure differential (e.g., being forced out may new incoming intake air920or drawn out via a suction effect from the lower pressure pass-by air930at rearward ducts400, etc.", "", "By excluding through holes, the facing170provides fewer inlets or outlets for air, and thereby decreases the aerodynamic drag on the wheel100associated with the intake and outtake of air to/from the cavity330and turbulent effects at the intake and outtake points. As up to 30% of the aerodynamic drag of a modern vehicle can be attributed to the wheels, regulating the amount of air that is permitted to flow into the wheel assembly can noticeably improve the aerodynamic performance of the vehicle as a whole; thereby improving fuel economy or battery range, particularly when operated at higher speeds as air drag increases. However, as the wheels include components that may require cooling (e.g., brake pads, electric motors, electrical generators, wheel bearings, etc.), the improvements to aerodynamic performance may need to be balanced for competing needs for aerodynamic efficiency and cooling ability. For example, decreasing the amount of air drawn into the wheel assembly can increase aerodynamic performance, but also decreases the amount of air available for cooling (e.g., of brakes held in the cavity330of the wheel100), while increasing the amount of air drawn into the wheel assembly can decrease aerodynamic performance, but increases the amount of air available for cooling.", "", "By installing selectively configurable wheels100, as discussed in the present disclosure, a user can select a halo140with different numbers, sizes, shapes, or arrangements of ducts440, thereby affecting how much air is drawn into the cavity330of the wheel100, which may be used to cool any components (e.g., breaks) held therein, versus being directed to pass by the wheel100. These considerations may be based on the operational profile of the vehicle to adjust for the speed of travel, cooling needs of internal components, and susceptibility to damage of the wheel100in the operational environment.", "", "For example, a user of a vehicle that is primarily driven on a highway, may prefer a halo140design that helps reduce aerodynamic drag at higher speeds at the expense of less intake of cooling air, as the brakes are used less frequently on controlled access highways than in other environments, which thereby improves fuel/battery efficiency by reducing airflow through the wheel100. In contrast, that same user of the same vehicle may prefer a different design of halo140that offers a different airflow pattern910when using the vehicle off-road (e.g., emphasizing debris protection over weight and drag reduction) or driving within a city (e.g., emphasizing air through-put to the brake pads due to more frequent use in city vs. highway driving over weight and drag reduction). Additionally, that same user of the same vehicle may prefer a different design for the halo140when operating the vehicle in the winter versus the summer while primarily operating on controlled access highways, due to the air used to cool components being colder and the presence of more debris (in the form of road salt, gravel, or cinders); changing the user's relative needs for cooling and protection without affecting the driving patterns for the vehicle.", "", "The configurable wheel100of the present disclosure therefore provides several advantages to the user, allowing for the customization of the wheel100to account for differing priorities for aerodynamics, protection, and cooling capabilities via selectively removable sub-components of the wheel assembly.", "", "FIG.10is a flowchart of an example method1000for wheel configuration or repair, according to embodiments of the present disclosure.", "", "Method1000begins at block1010, where an operator attaches a tire to a sidewall230of the drum130. The operator uses the mating surfaces of the first rim220aand the second rim220b, disposed on opposing sides of the wheel drum130from one another, to secure the beads of the tire120to the rims220to secure the tire120. The operator may then inflate the tire120(or an inner tube held between the tire120and the drum130). In various embodiments, the tire120remains attached to the sidewall230when installing and uninstalling a halo140or a cap150with the drum130, or the wheel100with a vehicle (e.g., any of the operations discussed in blocks1030-1080).", "", "At block1020, the operator removes the tire from the sidewall230of the drum130, for example, when replacing a tire120with a worn tread or that has been damaged, when swapping between winter and all-weather tires120, or the like. In various embodiments, any installed halos140or caps150may remain installed with the drum130, while uninstalling a tire120per block1020. In some embodiments, the drum130may also remain installed to the vehicle while removing the tire120, although the operator may prefer to uninstall the wheel100from the vehicle to provide greater access to the second rim220bthan is afforded by a wheel well of the vehicle.", "", "After performing block1020, method1000may return to block1010for the operator to install a new (or newly repaired) tire120to the drum130, but various other operations of method1000may be performed between the completion of block1020and performance of block1010.", "", "At block1030, the operator installs the halo140. In various embodiments, the operator inserts a halo140in an interstitial band240of the drum130located between a first rim220aand a facing170of the drum130. Once inserted, the operator then secures the halo140to the wheel drum130via various devices450and corresponding features in the drum130. In various embodiments, the halo140remains installed as the operator installs or uninstalls tires120or caps150, or the wheel with a vehicle (e.g., any of the operations discussed in blocks1010-1020and1050-1080).", "", "At block1040, the operator uninstalls the halo140, for example, when replacing a halo140that has been damaged or to change a first halo140afor a second halo140bwith a different design. For example, a first halo140athat includes a first plurality of ducts440may be removed to allow for the installation of a second halo140bthat includes a second plurality of ducts440that is different based on a different design. The different design may include one or more of: a different number of ducts440in the first plurality versus the second plurality; a different cross-sectional area of each duct440in the first plurality versus the second plurality; a different orientation of each duct440through a respective halo140in the first plurality versus the second plurality; and a different cross-sectional shape of each duct440in the first plurality versus the second plurality, and combinations thereof. In various embodiments, any installed tires120or caps150may remain installed with the drum130, and the drum130may also remain installed to the vehicle while uninstalling a halo140per block1040.", "", "After performing block1040, method1000may return to block1030for the operator to install a new (or newly repaired) halo140to the drum130, but various other operations of method1000may be performed between the completion of block1040and performance of block1030.", "", "At block1050, the operator installs the cap150. In various embodiments, the operator inserts a cap150in a well260of the drum130located centrally to the facing170of the drum130. Once inserted, the operator then secures the cap150to the wheel drum130via various securing tabs530and the cap seat250in the drum130. In various embodiments, the cap150mates with various lug holes320in a puck160captured in the base of the well260, such as by inserting an anti-rotation projection540into a lug hole320or the securing tabs530through a central hole650. In various embodiments, the cap150remains installed as the operator installs or uninstalls tires120or halos140, or the wheel100with a vehicle (e.g., any of the operations discussed in blocks1010-1040and1070-1080).", "", "At block1060, the operator uninstalls the cap150, for example, when replacing a cap150that has been damaged or to change a first cap150afor a second cap150bwith a different design. For example, a first cap150athat projects a face outward to be even with the facing170may be removed to allow for the installation of a second cap150bthat includes that includes a through-hole to the axle seat. In various embodiments, any installed tires120or halos140may remain installed with the drum130, and the drum130may also remain installed to the vehicle while uninstalling a cap150per block1060.", "", "After performing block1060, method1000may return to block1050for the operator to install a new (or newly repaired) cap150to the drum130, but various other operations of method1000may be performed between the completion of block1060and performance of block1050.", "", "At block1070, the operator installs the wheel100to the axle of a vehicle. In various embodiments, the facing170defines a well260projecting inward to the wheel drum130includes a puck160at a base of the well260(defined in the facing170) that includes a plurality of lug holes320, and the operator inserts a corresponding plurality of lugs of an axle attachment seat of a vehicle through those lug holes320. Once the lugs are inserted, the operator secures the lugs to the lug holes320, such as via lug nuts, to affix the wheel drum130to the axle of the vehicle. In various embodiments, the wheel100remains installed as the operator installs or uninstalls tires120, halos140, or the cap150with a drum130(e.g., any of the operations discussed in blocks1010-1060).", "", "At block1080, the operator uninstalls the wheel100from the axle, for example, when replacing a damaged wheel, rotating the wheel among different positions on the vehicle, accessing components held in the cavity330of the drum130, or the like. In various embodiments, any installed tires120, halos140, or caps150may remain installed with the wheel100removed from the vehicle per block1080.", "", "After performing block1080, method1000may return to block1070for the operator to install the drum130or a new drum130back onto the vehicle, but various other operations of method1000may be performed between the completion of block1080and performance of block1070.", "", "AlthoughFIG.10present the flowchart of the example method1000is a set order, the present disclosure contemplates that the various operations may be performed in any order, and that various operations may be omitted based on the operational conditions. For example, an operator may perform the operations of block1060before performing any of the operations discussed in the other blocks, or may omit performing block1030and block1050(to remove halos140or cap150) during an initial installation operation, but perform blocks1030and block1050before performing block1020or block1040, respectively, in a subsequent installation operation. Accordingly, one of ordinary skill in the relevant art will understand which of the operations are to be performed, and the order in which those operations are to be performed, according to the operational conditions in which method1000is performed.", "", "The descriptions and illustrations of one or more embodiments provided in this disclosure are intended to provide a thorough and complete teaching of the full scope of the subject matter to those of ordinary skill in the relevant art and are not intended to limit or restrict the scope of the subject matter as claimed in any way. The embodiments, examples, and details provided in this disclosure are considered sufficient to convey possession and enable those of ordinary skill in the relevant art to practice the best mode of the claimed subject matter. Descriptions of structures, resources, operations, and acts considered well-known to those of ordinary skill in the relevant art may be brief or omitted to avoid obscuring lesser known or unique aspects of the subject matter of this disclosure. The claimed subject matter should not be construed as being limited to any embodiment, aspect, example, or detail provided in this disclosure unless expressly stated herein. Regardless of whether shown or described collectively or separately, the various features (both structural and methodological) are intended to be selectively included or omitted to produce an embodiment with a particular set of features. Further, any or all of the functions and acts shown or described may be performed in any order or concurrently.", "", "Having been provided with the description and illustration of the present disclosure, one of ordinary skill in the relevant art may envision variations, modifications, and alternative embodiments falling within the spirit of the broader aspects of the general inventive concept provided in this disclosure that do not depart from the broader scope of the present disclosure.", "", "As used in the present disclosure, a phrase referring to “at least one of” a list of items refers to any set of those items, including sets with a single member, and every potential combination thereof. For example, when referencing “at least one of A, B, or C” or “at least one of A, B, and C”, the phrase is intended to cover the sets of: A, B, C, A-B, B-C, and A-B-C, where the sets may include one or multiple instances of a given member (e.g., A-A, A-A-A, A-A-B, A-A-B-B-C-C-C, etc.) and any ordering thereof.", "", "As used in the present disclosure, the terms “substantially”, “approximately”, “about”, and other relative terms encompass values within +5% of a stated quantity, percentage, or range unless a different approximation is explicitly recited in relation to the stated quantity, percentage, or range or if the context of the value indicates that a different approximation would be more appropriate. For example, a value identified as about X % may be understood to include values between 0.95*X % and 1.05*X % or between X−0.05X and X+0.05X percent, but may stop at zero or one hundred percent in various contexts. In another example, a feature described as being substantially parallel or perpendicular to another feature shall be understood to be within ±9 degrees of parallel or perpendicular. Any value stated in relative terms shall be understood to include the stated value and any range or subrange between the indicated or implicit extremes.", "", "As used in the present disclosure, all numbers given in the examples (whether indicated as approximate or otherwise) inherently include values within the range of precision and rounding error for that number. For example, the number 4.5 shall be understood to include values from 4.45 to 4.54, while the number 4.50 shall be understood to include values from 4.495 to 4.504. Additionally, any number or range that explicitly or by context refers to an integer amount (e.g., approximately X users, between about Y and Z states), shall be understood to round downward or upward to the next integer value (e.g., X+1 users, γ—1 and Z+1 states).", "", "The following claims are not intended to be limited to the embodiments shown herein, but are to be accorded the full scope consistent with the language of the claims. Within the claims, reference to an element in the singular is not intended to mean “one and only one” unless specifically stated as such, but rather as “one or more” or “at least one”. Unless specifically stated otherwise, the term “some” refers to one or more. No claim element is to be construed under the provision of 35 U.S.C. § 112 (f) unless the element is expressly recited using the phrase “means for” or “step for”. All structural and functional equivalents to the elements of the various embodiments described in the present disclosure that are known or come later to be known to those of ordinary skill in the relevant art are expressly incorporated herein by reference and are intended to be encompassed by the claims. Moreover, nothing disclosed in the present disclosure is intended to be dedicated to the public regardless of whether such disclosure is explicitly recited in the claims."], "claims": ["a wheel drum, the wheel drum having a first rim of a first diameter on a first end of the wheel drum; a second rim of the first diameter on a second end, opposite to the first end, of the wheel drum; a facing that extends between a second diameter and a third diameter positioned concentrically to the first rim on the first end in a plane substantially perpendicular to an axis of rotation of the wheel drum; and a cavity defined inward from the second rim from the second end toward the first end; and a halo, connected to the wheel drum in an interstitial band defined on the first end between the first diameter and the second diameter.", "2 . The wheel of claim 1 , wherein the facing occupies between 25 and 40 percent of an area defined by a circle of the first diameter.", "an axle connection defined within a well concentrically defined in the facing, the well extending towards the second end.", "a puck secured at a base of the well in which the axle connection is defined.", "a cap secured in the well over the axle connection.", "6 . The wheel of claim 5 , wherein the cap defines a coplanar surface to the facing.", "7 . The wheel of claim 1 , wherein the halo is made of a reinforced thermoplastic.", "8 . The wheel of claim 1 , wherein the wheel drum is made of a reinforced thermoplastic.", "9 . The wheel of claim 1 , wherein the halo includes a plurality of ducts arranged circumferentially around the axis of rotation and the interstitial band includes a plurality of vents arranged circumferentially around the axis of rotation.", "a second halo, configured to selectively engage with the wheel by connecting in the interstitial band, wherein the second halo includes a second plurality of ducts different from the plurality of ducts.", "11 . The wheel of claim 1 , wherein the halo has a fourth diameter greater than the first diameter.", "12 . The wheel of claim 1 , further comprising a tire, secured to the wheel drum between the first rim and the second rim.", "a wheel drum, having: a first rim of a first diameter on a first end; a second rim of the first diameter on a second end opposite to the first end; and a sidewall connected to the first rim and the second rim, having a second diameter less than the first diameter; wherein the first end defines: an interstitial band, extending inward from the first rim toward the second end, the interstitial band positioned circumferentially between the first diameter and a third diameter, less than the first diameter; a facing, positioned extending substantially perpendicular to an axis of rotation of the wheel drum, the facing positioned circumferentially between the third diameter and a fourth diameter, less than the third diameter; and a well, extending inward from the facing toward the second end, the well positioned circumferentially within the fourth diameter; wherein the second end defines: a cavity, extending inward from the second rim towards the first end; a first halo, having: a first engagement device, configured to selectively attach to the first end of the wheel drum within the interstitial band; and a first intake face, defining a first plurality of ducts defined circumferentially around the first halo; a second halo, having: a second engagement device, configured to selectively attach to the first end of the wheel drum; and a second intake face, defining a second plurality of ducts defined circumferentially around the second halo, wherein the second plurality of ducts differs in design from the first plurality of ducts.", "a number of ducts in the first plurality of ducts versus the second plurality of ducts; a cross-sectional area of each duct in the first plurality of ducts versus the second plurality of ducts; an orientation of each duct through a respective halo in the first plurality of ducts versus the second plurality of ducts; and a cross-sectional shape of each duct in the first plurality of ducts versus the second plurality of ducts.", "a puck defined at a base of the well in which an axle connection is defined.", "a cap connected over the well coplanar with the facing.", "17 . The system of claim 13 , wherein the wheel drum is made of a fiber reinforced thermoplastic.", "18 . The system of claim 13 , wherein the first halo and the second halo are made of a fiber reinforced thermoplastic.", "19 . The system of claim 13 , wherein the facing occupies between 25 and 40 percent of an area defined by a circle of the first diameter.", "20 . The system of claim 13 , wherein the interstitial band occupies between 20 and 40 percent of an area defined by a circle of the first diameter.", "21 . The system of claim 13 , wherein the first halo has a first radial diameter greater than the first diameter and a first central diameter equal to the third diameter and the second halo has a second radial diameter equal to the first diameter and a second central diameter equal to the third diameter.", "inserting a first halo including a first plurality of ducts in an interstitial band of a wheel drum to between a first rim and a facing of the wheel drum, the first rim having a first diameter and the facing occupying a region substantially perpendicular to an axis of rotation of the wheel drum between a second diameter and a third diameter, wherein the second diameter is less than the first diameter and the third diameter is less than the second diameter; securing the first halo to the wheel drum; releasing the first halo from the wheel drum; removing the first halo from the interstitial band; inserting a second halo in the interstitial band, the second halo including a second plurality of ducts different in design from the first plurality of ducts; and securing the second halo to the wheel drum.", "attaching a tire to a sidewall of the wheel drum via a mating surface of the first rim and a second rim, disposed on an opposite end of the wheel drum from the first rim, wherein the tire remains attached to the sidewall while releasing the first halo, removing the first halo, inserting the second halo, and securing the second halo.", "inserting a corresponding plurality of lugs of an axle attachment seat of a vehicle through the lug holes; and securing the lugs to the lug holes to affix the wheel drum to an axle of a vehicle, wherein the axle remains attached to the wheel drum while releasing the first halo, removing the first halo, inserting the second halo, and securing the second halo.", "attaching a cap in the well over the lugs that project through the puck into the well."], "bibtex": "@patent{20240375429,\n    title = {CONFIGURABLE WHEEL},\n    number = {20240375429},\n    year = {2024},\n    note = {File: US20240375429A1-20241114.XML}\n    }", "classification": "B60B2102FI"}, {"title": "VEHICLE WHEEL AND METHOD FOR PRODUCING SUCH A WHEEL", "doc_number": "20240375430", "filename": "US20240375430A1-20241114.XML", "abstract": "A vehicle wheel includes an annular rim defining an axis and inboard and outboard sides. The rim includes an outboard bead seat, an inboard bead seat, an outboard well flank connected to the outboard bead seat and extending radially inwardly and towards the inboard side of the rim, and an inboard well flank connected to the inboard bead seat and extending radially inwardly and towards the outboard side of the rim. The rim further includes a well portion defined between the outboard and inboard well flanks, wherein the well portion is formed by a plurality of curved and straight portions linked together. The well portion has at least three transition portions having varying thickness cross-sectional profiles. A wheel disc is secured to the rim. The wheel disc includes a hub located centrally within the wheel disc and has a plurality of bolt holes formed therein.", "detailed_description": ["Referring now to the drawings, there is illustrated inFIGS.1-3, a vehicle wheel, indicated generally at10. The vehicle wheel10is preferably a commercial vehicle wheel type which is used for relatively large and heavy-duty commercial vehicles, such as trucks. The vehicle wheel10generally incudes a wheel disc, indicated generally at12, and an annular outer wheel rim, indicated generally at14. Although the invention is illustrated and described in conjunction with the particular vehicle wheel construction disclosed herein, it will be appreciated that the invention can be used in conjunction with other types of vehicle wheel constructions.", "", "The wheel10can be generally described as having a front or an outboard side, indicated generally at10a,on the left-hand side as viewingFIG.3. The wheel10has a rear of an inboard side, indicated generally at10b,on the right-hand side as viewingFIG.3. When mounted on the vehicle, the wheel disc12is generally on the outboard side10a.", "", "In a preferred embodiment (and as illustrated herein), the wheel disc12and the wheel rim14are produced separately and then joined together by any suitable means, such as by welding, to produce a fabricated vehicle wheel10. In a preferred embodiment, the wheel disc12and the wheel rim14are made from steel and are then welded together to form the wheel10. Of course, the wheel disc12and/or the wheel rim14may be made of any suitable materials such as for example, aluminum, magnesium, titanium, or alloys thereof, carbon fiber and/or composite materials and/or may be secured together by other suitable means, if so desired.", "", "The combination of the annularly shaped wheel disc12and the wheel rim14defines a wheel axis X for the wheel10. Referring toFIG.3, the wheel disc12generally includes a centrally located hub, indicated generally at20, an outer circumferential edge22, and an annular disc body portion, indicated generally at24. The hub20may preferably have a relatively flat circular shape and is generally defined as the central portion of the wheel disc12. The outer circumferential edge22of the wheel disc12includes a circular flange26which is welded (or otherwise attached) to a bead seat portion of the rim14, as will be discussed below.", "", "The disc body portion24is generally annulus or ring-shaped and encircles the hub20. The disc body portion24radially extends between the hub20and the outer circumferential edge22. The disc body portion24preferably includes a plurality of ventilation holes28formed therein. The vent holes28not only provide ventilation for wheel brakes (not shown) mounted adjacent to the wheel10but also help in reducing the overall weight or mass of the wheel10. The disc body portion24can have any number of ventilation holes28formed therein having any suitable shape. Alternatively, the disc body portion24can be formed with a plurality of spokes (not shown) radially extending between the hub20and the outer circumferential edge22.", "", "In the illustrated embodiment shown inFIG.3, the hub20has a front face or surface30, and a rear face or surface32. The front surface30is located on the outboard side10aof the wheel10and faces the outboard side10awhen mounted on a vehicle. The rear surface32generally faces towards the inboard side10bof the wheel10. The hub20functions as a wheel mounting portion or center mounting portion of the wheel10for connecting with an axle (not shown) via a plurality of lug bolts (not shown) and lug nuts (not shown).", "", "The hub20includes a centrally located hub hole36. The hub hole36extends through and about the wheel axis X. The hub hole36may accommodate a portion of the axle. The hub hole36may have any suitable diameter. A plurality of lug bolt receiving holes38are formed in the hub20and are circumferentially spaced around the hub hole36and the wheel axis X. For example, the hub20may include five lug bolt receiving holes38. Alternatively, the number and/or location of the lug bolt receiving holes38may be other than illustrated if so desired. The lug bolt receiving holes38receive the lug bolts (not shown) for securing the vehicle wheel10with lug nuts (not shown) on the axle of an associated vehicle.", "", "In a preferred embodiment, the wheel disc12is preferably produced from a single steel blank (not shown) which is then formed by suitable means to form the wheel disc12. The blank may be first provided as a smooth, flat annular or ring-shaped steel disc blank, and then preferably shaped such as by a flow forming process or rolling process into the final wheel disc shape. Alternatively, the blank may be formed by any suitable means, such as stamping and/or flow forming, into a wheel disc “preform” (not shown) having a particular partially formed wheel disc shape before it is formed into the final wheel disc shape, preferably by flow forming.", "", "The wheel rim14can have any suitable annular shape for receiving and supporting a tire (not shown). The wheel rim14preferably has a continuous annular shape relative to the wheel axis X for accommodating a vehicle tire (not shown) mounted thereon. As will be described in further detail below, the wheel rim14of the present invention is manufactured by first forming a cylindrical blank hoop (FIG.7) into a pre-production hoop (FIG.8) having a plurality of transition portions formed therein having varying cross-sectional thicknesses. As will be explained below, the initial formation of the hoop having varying cross-sectional thicknesses will help define and form portions of a well portion of the rim14having these varying cross-sectional thicknesses.", "", "Referring now to the schematic cross-section illustration ofFIGS.5and6, the rim14generally includes an outboard bead seat, indicated generally at40, an outboard well flank42, a drop center base or well portion44, an inboard well flank46, and an inboard bead seat, indicated generally at48. The outboard bead seat40is connected to the outboard well flank42. Similarly, the inboard bead seat48is connected to the inboard well flank46. The well portion44is disposed between the outboard and the inboard well flanks42and46. The well flanks42and46may be formed as frustoconical portions having a non-curved profile formed at the same angle A relative to the wheel axis X. In a preferred embodiment as shown inFIG.5, the angle A is about 15 degrees.", "", "Note that the portion of the rim14illustrated inFIG.6is essentially identical to the portion of the rim14illustrated inFIG.5with the exception of a lack of the bolt receiving hole38which has been removed for clarity purposes. The duplication ofFIG.6has been added to provide an additional figure so as to avoid confusion of the relatively large amount of reference numbers and dimensional referencing labeled on the rim14. It should also be understood that the drawing figures herein schematically represent the wheel10of the present invention and are not necessarily drawn to scale, drawn to scale relative to one another, and/or may have exaggerated dimensions to assist in clarity and understanding of the drawings.", "", "In general, the outboard bead seat40, the outboard well flank42, the inboard well flank46, and the inboard bead seat48are formed with a standard profile commonly used in the industry to accommodate the proper mounting of various tires used in the marketplace. Although the thickness of the rim14at these outboard and inboard portions may be generally constant, in a preferred embodiment of the invention, the thicknesses of the outboard bead seat40and the outboard well flank42are different than the thicknesses of the inboard bead seat48and the inboard well flank46, respectively, as will be discussed in detail below. As will also be discussed in detail below, the well portion44is manufactured with portions have varying thicknesses across its length. The varying thickness portions of the well portion44are specifically designed and produced to provide structural advantages for the rim14. For example, the overall weight of the wheel10can be reduced with providing portions of the rim14with reduced thicknesses at areas wherein the mass and structural rigidity may not be required compared to commercially available prior art wheels having the same cross-sectional thickness across the entire length of the rim14. The unique profile shape of the rim14having various straight and curved portions may also help to reduce stress levels within the rim14. These advantages can be obtained by the specific geometry of the illustrated well portion44.", "", "The structural details of the final produced rim14will now be explained with respect toFIGS.5and6. The outboard bead seat40and the inboard bead seat48provide a mounting and contacting surface for sealing with a tire (not shown) mounted on the wheel10. A broken line, indicated generally by BS, schematically represents the bead seat diameter or inner diameter portion of a tire that is mounted on the wheel10. The conventionally known “rim width” may be determined as the axial distance between the bead seats40and48. This rim width is labelled as RW inFIG.5. In a preferred embodiment, the rim width RW is within the range of about 133.5 millimeters to about 457 millimeters. In a more preferred embodiment and illustrated in the Figures, the rim width RW is about 230 millimeters.", "", "The wheel diameter is generally the radial diameter of the respective bead seats40and48. It should be appreciated that the rim14can have any desired diameter and/or shape. The wheel10can be manufactured to any suitable size for mounting a tire thereon. Tire sizes for conventional commercial vehicles are generally within the range of about 444.5 millimeters to about 673.1 millimeters, for example. In a preferred embodiment and illustrated in the Figures, the rim14has an outer diameter or a wheel diameter of about 570 mm.", "", "Adjacent to the outboard bead seat40is an outboard bead seat retaining flange50connected to the outboard bead seat40. The outboard bead seat retaining flange50generally has an axial width ORF. In a preferred embodiment, the axial width ORF of the outboard bead seat retaining flange50is within the range of about 15.8 millimeters to about 29 millimeters. In a more preferred embodiment and illustrated in the Figures, the axial width ORF is about 23 millimeters. The outboard bead seat retaining flange50generally provides for lateral or axial support of the tire mounted on the wheel10. The outboard bead seat retaining flange50includes a sidewall52and a curled lip portion54ending in an outer edge56. The sidewall52may be smoothly connected with the outboard bead seat40by a curved portion58. The curved portion58is connected to the outboard well flank42. The outboard well flank42generally extends radially inwardly and in a direction towards the outboard side10b.As stated above, the outboard well flank42may have a generally frustoconical shape about the wheel axis X. The outboard well flank42has an axial width OF. In a preferred embodiment, the axial width OF of the outboard well flank42is within the range of about 25 millimeters to about 40 millimeters. In a more preferred embodiment and illustrated in the Figures, the axial width OF is about 36 millimeters.", "", "The inboard side10bof the rim14is similar in structure as the outboard side10a.Adjacent to the inboard bead seat48is an inboard bead seat retaining flange60connected to the inboard bead seat40. The inboard bead seat retaining flange60generally has an axial width IRF. In a preferred embodiment, the axial width IRF of the inboard bead seat retaining flange60is within the range of about 15.8 millimeters to about 29 millimeters. In a more preferred embodiment and illustrated in the Figures, the axial width IRF is about 23 millimeters. The inboard bead seat retaining flange60generally provides for lateral or axial support of the tire mounted on the wheel10. The inboard bead seat retaining flange60includes a sidewall62and a curled lip portion64ending in an outer edge66. The sidewall62may be smoothly connected with the inboard bead seat48by a curved portion68. The curved portion68is connected to the inboard well flank46. The inboard well flank46generally extends radially inwardly and in a direction towards the inboard side10a.As stated above, the inboard well flank46may have a generally frustoconical shape about the wheel axis X. The inboard well flank46has an axial width IF. In a preferred embodiment, the axial width IF of the inboard well flank46is within the range of about 25 millimeters to about 40 millimeters. In a more preferred embodiment and illustrated in the Figures, the axial width IF is about 36 millimeters.", "", "The tire well portion44generally defines the cavity or open region between the bead seats40and48. The well portion44may be defined as the open region generally radially inwardly from (or below as viewingFIGS.5and6) the bead seat diameter BS. The well portion44has a maximum depth DD. In a preferred embodiment, the depth DD is within the range of about 30 millimeters to about 40 millimeters. In a more preferred embodiment and illustrated in the Figures, the depth DD is about 36 millimeters. The well portion44has an axial width C. In a preferred embodiment, the axial width C is within the range of about 83.5 millimeters to about 389 millimeters. In a more preferred embodiment, the axial width C is about 158 millimeters.", "", "As stated above, the well portion44generally extends between the outboard and inboard well flanks42and46. The well portion44has a varying profile shape and is generally formed from a plurality of curved and straight portions linked together, as can be seen inFIGS.5and6. The varying shaped cross-sectional profile of the well portion44provides rigidity to the rim14compared to a smooth profile shape. As will be explained below, the thicknesses at various portions of the well portion may also be thinned to reduce weight of the rim14. Although the rim14illustrated inFIGS.5and6illustrate a preferred embodiment, it should be understood that the well portion44may be formed from other various curved and straight portions and not necessary as exactly illustrated inFIGS.5and6.", "", "The structural details of a preferred embodiment of the well portion44will now be discussed. In general, the structural details will be described as portions being connected together starting from the outboard side10aof the well portion44and moving toward the inboard side10b(or towards the right as viewingFIGS.5and6). The outboard side of the well portion44includes a concave outboard curved portion70which connects the well portion44to the outboard well flank42. The outboard curved portion70is relatively small and may correspond to one the varying thickness portions, as will be described below. The terms “concave” and “convex” as used herein with respect to the well portion44define the orientation of the curves relative to the wheel axis. For example, a concave curve curves radially inwardly towards the wheel axis X such that the center point of the radius forming the curve is positioned radially outwardly (above when viewingFIGS.5and6) from the respective curve. A convex curve curves radially outwardly towards the wheel axis X such that the center point of the radius forming the curve is positioned radially inwardly (below when viewingFIGS.5and6) from the respective curve.", "", "The outboard curved portion70is connected to a convex curved portion72. The curved portion72is connected with a frustoconical bolt hole portion74which receives the plurality of lug bolt receiving holes38, as shown inFIG.5. The bolt hole portion74may be flat such that there are no curves formed in the frustoconically shaped portion. The bolt hole portion74is connected to a concave curved portion76which connects to a straight portion78. The straight portion78may have a cylindrical shape, as shown inFIGS.5and6, such that a surface of the straight portion78is parallel with the wheel axis X. The term “straight” as used herein with respect to the well portion44relates to a portion not having curves formed therein. The straight portion may be frustoconical in shape (such as the outboard well flank42or the bolt hole portion74) or may be cylindrical in shape (such as the straight portion78). The straight portion78is connected with a curved portion80which is in turn connected to an inclined portion82. The other end of the inclined portion82is connected with a slight concave curved portion84which is connected to a convex curved portion86which is in turn connected to a relatively small concave portion88. The concave portion88is connected to a relatively large radius concave curved portion90which is connected to a concave curved portion92. In a preferred embodiment, the radius forming the curved portion90is larger than the curved portion92. The other end of the curved portion92is connected with a convex curved portion94which is connected to the inboard well flank46. As stated above, the well portion44of the rim14may be formed from other various curved and straight portions and not necessary as exactly illustrated inFIGS.5and6.", "", "The structural details of the varying thicknesses of the final formed rim", "", "14will now be described. As will be discussed below, the varying thicknesses of the rim14generally correspond to the process of forming the rim14by first using a blank or hoop, as shown inFIG.8, having varying thickness. The hoop undergoes a forming process to manufacture the rim14to its final shape as illustrated inFIGS.5and6.", "", "As shown inFIG.6, the outboard bead seat retaining flange50has a thickness t1. The curved portion58of the outboard bead seat40has a thickness t2. The outboard well flank42has a thickness t3. In a preferred embodiment, the thicknesses t1, t2, and t3are generally the same. Thus, the outboard side of the rim14has a generally constant thickness in the preferred embodiment. Of course, the thicknesses t1, t2, and t3need not be the same if so desired.", "", "The inboard bead seat retaining flange60has a thickness t4. The curved portion68of the inboard bead seat48has a thickness t5. The inboard well flank has a thickness t6. In a preferred embodiment, the thicknesses t4, t5, and t6are generally the same. Thus, the inboard side of the rim14has a generally constant thickness in the preferred embodiment. Of course, the thicknesses t4, t5, and t6need not be the same if so desired. Although the thicknesses of the inboard and outboard sides of the rim may be the same, in the preferred embodiment of the rim14illustrated inFIGS.5and6, the inboard side of the rim14is greater than the thickness of the outboard side. Thus, the thicknesses t1, t2, and t3are less than the thicknesses of t4, t5, and t6. This may be desirable due to the outboard side of the rim14being physically connected to the wheel disc12in a closer manner than the inboard side of the rim14. This closer connection may provide a greater rigidity to the outboard side of the rim14compared to the inboard side, thereby permitting the thickness to be reduced at the outboard side to reduce the weight of the wheel10.", "", "In a preferred embodiment, the thicknesses t1, t2, and t3are within the range of about 2.5 millimeters to about 6.75 millimeters. In a more preferred embodiment and illustrated in the Figures, the thicknesses of t1, t2, and t3are about 3.3 millimeters. In a preferred embodiment, the thicknesses t4, t5, and t6are within the range of about 2.75 millimeters to about 7.3 millimeters. In a more preferred embodiment and illustrated in the Figures, the thicknesses of t1, t2, and t3are about 3.55 millimeters.", "", "The well portion44is preferably formed with portions have varying thicknesses, as mentioned above, which will be described as “transition” portions. In the illustrated embodiment ofFIGS.5and6, the well portion44has four transition portions100,102,104, and106. The transition portion100is generally located about the concave curved portion70. Preferably, the transition portion100reduces the thickness from the thickness t7located at the bolt hole portion74to the thickness t3of the outboard well flank42. In a preferred embodiment, the thickness t7is within the range of about 3 millimeters to about 8 millimeters. In a more preferred embodiment and illustrated in the Figures, the thickness t7is about 3.9 millimeters. A thickness t8located at the straight portion78is preferably the same as the thickness t7.", "", "The transition portion102is generally located about the curved portion80, the inclined portion82, and the curved portion86. Preferably, the transition portion102decreases the thickness from the straight portion78towards the curved portion86. As such, a thickness19located at the curved portion88is preferably less than the thickness t8. In a preferred embodiment, the thickness t9is within the range of about 2.15 millimeters to about 6 millimeters. In a more preferred embodiment and illustrated in the Figures, the thickness t9is about 2.8 millimeters.", "", "The transition portion104is generally located about the curved portion90. Preferably, the transition portion104increases the thickness of the curved portion90towards the curved portion92. As shown inFIG.6, a thickness t10located about at the junction of the curved portions90and92is greater than the thickness t9. In a preferred embodiment, the thickness t10is within the range of about 2.85 millimeters to about 7.6 millimeters. In a more preferred embodiment and illustrated in the Figures, the thickness t10is about 3.7 millimeters.", "", "The transition portion106is generally located about the curved portion94. Preferably, the transition portion106decreases the thickness of the curved portion94in the direction towards the inboard side of the rim14. As shown inFIG.6, a thickness t11is located generally on one end of the curved portion94, and a thickness t12is generally located on the other end of the curved portion94. In the preferred embodiment, the thickness t11is greater than the thickness t12. In a preferred embodiment, the thickness t11is within the range of about 3.5 millimeters to about 6.2 millimeters. In a more preferred embodiment and illustrated in the Figures, the thickness t11is about 3.7 millimeters. Note that the preferred thicknesses of t10and t11are the same. In a preferred embodiment, the thickness t12is within the range of about 2.75 millimeters to about 7.3 millimeters. In a more preferred embodiment and illustrated in the Figures, the thickness t12is about 3.55 millimeters. Note that the preferred thickness of t12is the same as the thicknesses t4, t5, and t6on the inboard side of the rim14.", "", "The rim14may be manufactured by any suitable method. In a preferred method, the rim14is at least partially formed by a rolling and forming process to obtain the desired annular shape, as shown inFIGS.5and6. Suitable methods of producing a vehicle rim are described in U.S. Pat. Nos. 5,579,578 and 4,962,587 both of which are incorporated by reference herein. There is illustrated inFIG.9a block diagram showing a sequence of steps of a suitable method for producing the rim14. Initially, a flat sheet of suitable material or blank, such as for example, steel or aluminum, is provided. In a preferred embodiment, the sheet of material is provided having a constant thickness across its length. In step200ofFIG.9, the sheet of material is formed into a generally cylindrical band or hoop wherein the ends are welded together, thereby forming the hoop.FIG.7represents a cross-sectional portion of the initial hoop, indicated generally at100. As shown inFIG.7, the initial hoop108has an initial width IW and a constant cross-sectional thickness IT. In a preferred embodiment, the width IW is within the range of about 184 millimeters to about 540 millimeters. In a more preferred embodiment and illustrated in the Figures, the width IW is about 268 millimeters. In a preferred embodiment, the thickness IT is within the range of about 3 millimeters to about 8 millimeters. In a more preferred embodiment and illustrated in the Figures, the thickness IT is about 3.9 millimeters.", "", "When the initial hoop108is welded in step200ofFIG.9, a flat surface may be created by the weld where the two ends meet. As a result of this, the initial hoop108may optionally be expanded in step202to produce a substantially cylindrical initial hoop108.", "", "The initial hoop108is then preferably subjected to a flow forming process in step204to produce a preform hoop109, as represented inFIG.8. As shown inFIG.8, the preform hoop109is flow formed into a hoop shape having a contoured cross-sectional profile such that the preform hoop109has varying thicknesses across its width. In a preferred embodiment, an inner surface110of the preform hoop109remains flat (no curves) having a flat cylindrical shape. An outer surface112of the preform hoop109is preferably shaped by the flow forming process to provide the contoured shape as shown inFIG.8. Of course, if desired the inner surface110may be contoured instead of the outer surface, or both of the surfaces110and112may be both formed having a contoured shape. In the flow forming process, the initial hoop108is formed over a mandrel by one or more rollers using pressure along the axial direction. The roller deforms at least portions of the outer surface of the initial hoop108, forcing it against the mandrel, both axially lengthening and radially thinning it to form the preform102ofFIG.8.", "", "After the flow forming operation of the step204ofFIG.9, the preform hoop109ofFIG.8is formed. The structural details of the preform hoop109will now be discussed. In general, the structural details will be described as portions changing thickness starting from the outboard side and moving toward the inboard side (or towards the right as viewingFIG.8).", "", "In a preferred embodiment, the flow forming operation will increase the width of the preform hoop109relative to the initial hoop108. The preform hoop109has a width PW which is greater than the width IW of the initial hoop108. In a preferred embodiment, the width PW is within the range of about 213 millimeters to about 525 millimeters. In a more preferred embodiment and illustrated in the Figures, the width PW is about 304 millimeters. The width PW extends between an outboard end106and an inboard end108of the preform hoop109.", "", "The preform hoop109includes a plurality of transition points on its outer surface112along its width where thickness changes occur. In the preferred embodiment as shown inFIG.8, there are eight transition points120,122,124,126,128,130,132, and134. As shown inFIG.8, the preform hoop109has a thickness T1at the outboard end106, and a thickness T2at the transition point120. In the preferred embodiment, the thicknesses TI and T2are the same such that the portion of the preform hoop109between outboard end106and the transition point120is relatively flat or parallel with the axis of the hoop109. In the preferred embodiment and illustrated in the Figures, the thicknesses T1and T2are about 3.3 millimeters.", "", "In a preferred embodiment, the thickness increases from the transition point120to the transition point122. The transition point122has a thickness T3. In the preferred embodiment and illustrated in the Figures, the thickness T3is about 3.9 millimeters. Preferably, the cross-sectional profile remains flat between the transition points122and124located at the transition point124. Thus, in the preferred embodiment and illustrated in the Figures, the thickness T4is about 3.9 millimeters.", "", "In a preferred embodiment, the thickness decreases from the transition point124to the transition point126. The transition point126has a thickness T5. In the preferred embodiment and illustrated in the Figures, the thickness T5is about 2.8 millimeters. Preferably, the cross-sectional profile remains flat between the transition points126and128located at the transition point128. Thus, in the preferred embodiment and illustrated in the Figures, the thickness T6is about 2.8 millimeters.", "", "In a preferred embodiment, the thickness increases from the transition point128to the transition point130. The transition point130has a thickness T7. In the preferred embodiment and illustrated in the Figures, the thickness T7is about 3.7 millimeters. Preferably, the cross-sectional profile remains flat between the transition points130and132located at the transition point132. Thus, in the preferred embodiment and illustrated in the Figures, the thickness T8is about 3.7 millimeters.", "", "In a preferred embodiment, the thickness decreases slightly from the transition point132to the transition point134. The transition point134has a thickness T9. In the preferred embodiment and illustrated in the Figures, the thickness T9is about 3.55 millimeters. Preferably, the cross-sectional profile remains flat between the transition point134and the inboard end108. The inboard end has a thickness T10. Thus, in the preferred embodiment and illustrated in the Figures, the thickness T10is about 3.55 millimeters.", "", "It should be understood that any number of transition points may be formed in accordance with the present invention and may have less or more than those shown in the illustrated embodiment. The transition points may be spaced across the width of the preform hoop109by any suitable manner. In the illustrated embodiment, as shown inFIG.6, the transition point120is spaced from the outboard end106by a length L1. The transition point122is spaced from the transition point120by a length L2. The transition point124is spaced from the transition point122by a length L3. The transition point126is spaced from the transition point124by a length L4. The transition point128is spaced from the transition point126by a length L5. The transition point130is spaced from the transition point128by a length L6. The transition point132is spaced from the transition point130by a length L7. The transition point134is spaced from the transition point132by a length L8. The inboard end108is spaced from the transition point134by a length L9. In the preferred embodiment and illustrated in the Figures, the length L1is about 63.15 millimeters, the length L2is about 4.4 millimeters, the length L3is about 42.3 millimeters, the length L4is about 41.4 millimeters, the length L5is about 9.0 millimeters, the length L6is about 30.5 millimeters, the length L7is about 38.5 millimeters, the length L8is about 6.7 millimeters, and the length L9is about 68.05 millimeters.", "", "The well portion44was described above as having four transition portions100,102,104, and106where portions of the well portion44have varying thicknesses. During the flow forming operation of step204, these transition portions stem from or are produced as the result of initially having these differing thicknesses formed on the preform hoop109. The transition portions100,102,104, and106are labelled inFIG.6. The transition portion100generally corresponds to the increase in thickness from the transition point120to the transition point122. The transition portion102generally corresponds to the decreases in thickness from the transition point124to the transition point126. The transition portion104generally corresponds to the increase in thickness from the transition point128to the transition point130. The transition portion106generally corresponds to the slight decrease in thickness from the transition point132to the transition point134.", "", "Referring again toFIG.9, the outboard and inboard end portions of the preform hoop109are then flared in an optional step206to generally form the outboard and inboard portions of the rim14. For example, this optional flare step206may be used to form the outboard bead seat retaining flange50, the outboard bead seat40, the inboard bead seat48, and the inboard bead seat retaining flange60.", "", "The preform hoop109is then subjected to a series of roll forming operations utilizing tools to shape the preform hoop109in a direction about the wheel axis X in steps208,210,212. These operations208,210, and212are used to obtain the contoured shape of the rim14as shown inFIGS.5and6. A series of roll forming operations are utilized since a single operation will submit too much stress on the preform hoop109in a single pass. Although three operations208,210,212are shown, any suitable number of operations can be performed. The rim14can then be secured to the wheel disc12, such as by a weld, in step214, thereby producing the finished wheel10.", "", "As can be understood, the specific numbers, ranges, dimensions and/or percentages disclosed herein can be other than illustrated and described if so desired.", "", "The principle and mode of operation of this invention have been explained and illustrated in its preferred embodiments. However, it must be understood that this invention may be practiced otherwise than as specifically explained and illustrated without departing from its spirit or scope."], "claims": ["an annular rim defining an axis and inboard and outboard sides, the rim including: an outboard bead seat; an inboard bead seat; an outboard well flank connected to the outboard bead seat and extending radially inwardly and towards the inboard side of the rim; an inboard well flank connected to the inboard bead seat and extending radially inwardly and towards the outboard side of the rim; and a well portion defined between the outboard and inboard well flanks, wherein the well portion is formed by a plurality of curved and straight portions linked together, wherein the well portion has at least three transition portions having varying thickness cross-sectional profiles; and a wheel disc secured to the rim, wherein the wheel disc includes a hub located centrally within the wheel disc and having a plurality of bolt holes formed therein.", "2 . The vehicle wheel of claim 1 , wherein the vehicle wheel is a commercial vehicle wheel.", "3 . The vehicle wheel of claim 1 , wherein the rim is produced by forming a metallic hoop.", "4 . The vehicle wheel of claim 2 , wherein the rim is formed into a final desired shape by a flow forming process.", "5 . The vehicle wheel of claim 1 , wherein the well portion has a first transition portion increasing in thickness in the direction from the outboard side to the inboard side.", "6 . The vehicle wheel of claim 5 , wherein the well portion includes a second transition portion decreasing in thickness in the direction from the outboard side to the inboard side.", "7 . The vehicle wheel of claim 6 , wherein the second transition portion includes a plurality of interconnected curved portions.", "8 . The vehicle wheel of claim 6 , wherein the well portion includes a straight cylindrical portion disposed between the first and second transition portions.", "9 . The vehicle wheel of claim 6 , wherein the well portion includes a third transition portion increasing in thickness in the direction from the outboard side to the inboard side.", "10 . The vehicle wheel of claim 9 , wherein the well portion includes a curved portion disposed between the second and third transition portions.", "11 . The vehicle wheel of claim 9 , wherein the well portion includes a fourth transition portion decreasing in thickness in the direction from the outboard side to the inboard side.", "12 . The vehicle wheel of claim 11 , wherein the fourth transition portion has a curved shape.", "a wheel disc secured to the rim, wherein the wheel disc includes a hub located centrally within the wheel disc and having a plurality of bolt holes formed therein; and an annular rim secured to the disc, wherein the rim defines an axis and inboard and outboard sides, the rim including: an outboard bead seat; an inboard bead seat; an outboard well flank connected to the outboard bead scat and extending radially inwardly and towards the inboard side of the rim; an inboard well flank connected to the inboard bead seat and extending radially inwardly and towards the outboard side of the rim; and a well portion defined between the outboard and inboard well flanks, wherein the well portion includes: a first transition portion increasing in thickness in the direction from the outboard side to the inboard side; a second transition portion decreasing in thickness in the direction from the outboard side to the inboard side; a straight cylindrical portion disposed between the first and second portions; a third transition portion increasing in thickness in the direction from the outboard side to the inboard side; a curved portion disposed between the second and third transition portions; a fourth transition portion decreasing in thickness in the direction from the outboard side to the inboard side.", "14 . The commercial vehicle wheel of claim 13 , wherein the second transition portion includes a plurality of interconnected curved portions.", "15 . The commercial vehicle wheel of claim 13 , wherein the fourth transition portion has a curved shape.", "(a) providing a blank; (b) forming the blank into a hoop defining a cylindrically shaped inner surface and a cylindrically shaped outer surface; (c) flow forming one of the inner and outer surfaces of the hoop to create at least three transition portions having a varying thickness cross-sectional profile; and (d) subsequently to step (c), performing at least one rolling operation on the hoop to form an outboard bead seat, an outboard well flank, an inboard bead seat, an inboard well flank, and a contoured well portion disposed between the outboard and inboard well flanks, wherein the well portion includes at least three transition portions having varying thickness cross-sectional profiles derived from the flow forming process of step (c), thereby forming the wheel rim.", "(e) providing a wheel disc having a hub located centrally within the wheel disc and having a plurality of bolt holes formed therein; and (f) securing the wheel disc to the wheel rim.", "18 . The method of claim 16 , wherein in step (c) a flow forming operation is performed on the outer surface of the hoop to form a plurality of transition points where changes in the thickness of the hoop occur.", "19 . The method of claim 18 , wherein the hoop defines an outboard side and an inboard side, and wherein in step (c) the flow forming operation performed on the outer surface of the hoop forms a plurality of first portions having a decreasing thickness in the direction from the outboard side to the inboard side.", "20 . The method of claim 19 , wherein the flow forming operation performed on the outer surface of the hoop forms a plurality of second portions having an increasing thickness in the direction from the outboard side to the inboard side.", "(a) providing a blank; (b) forming the blank into a hoop defining a cylindrically shaped inner surface and a cylindrically shaped outer surface, wherein the hoop defines an outboard side and an inboard side; (c) flow forming the outer surface of the hoop to form a plurality of transition points where changes in the thickness of the hoop occur such that the flow forming forms a plurality of first portions having a decreasing thickness in the direction from the outboard side to the inboard side, and forms a plurality of second portions having an increasing thickness in the direction from the outboard side to the inboard side; (d) subsequently to step (c), performing at least one rolling operation on the hoop to form an outboard bead seat, an outboard well flank, an inboard bead seat, an inboard well flank, and a contoured well portion disposed between the outboard and inboard well flanks, wherein the wheel well portion includes transition portions having varying cross-sectional profiles derived from the flow forming process of step (c); (e) providing a wheel disc; and (f) securing the wheel disc to the wheel rim, thereby forming the vehicle wheel."], "bibtex": "@patent{20240375430,\n    title = {VEHICLE WHEEL AND METHOD FOR PRODUCING SUCH A WHEEL},\n    number = {20240375430},\n    year = {2024},\n    note = {File: US20240375430A1-20241114.XML}\n    }", "classification": "B60B2102FI"}, {"title": "RIM FOR A WHEEL", "doc_number": "20240375431", "filename": "US20240375431A1-20241114.XML", "abstract": "Herein is disclosed a rim for a wheel. the rim comprising a barrel having first and second flanges extending radially outward from opposing edges of the barrel. and the barrel comprising a first bead seat and a second bead seat arranged axially inwardly. respectively. of the first and second flanges, wherein the barrel, and first and second flanges. comprise layers of structural fibres bound in a polymer matrix, wherein a pre-form insert is disposed between layers of the structural fibres. wherein the insert comprises a material which acts to absorb and/or deflect and/or dissipate energy from a load or impact applied axially and/or radially to a rim and/or acts to increase the hoop stiffness of the wheel and wherein the insert has, when viewed in cross-section (with the axis of the rim being parallel to the plane of the cross-section). two elongate portions. with a first elongate portion of the insert extending into one of the first or second flanges. and a second elongate portion of the insert extending underneath the first or second bead seat, respectively, such that first and second portions together form an approximate ‘L’ shape in cross-section.", "detailed_description": [""], "claims": ["a barrel having first and second flanges extending radially outward from opposing edges of the barrel, and the barrel comprising a first bead seat and a second bead seat arranged axially inwardly, respectively, of the first and second flanges, wherein the barrel, and first and second flanges, comprise layers of structural fibres bound in a polymer matrix, wherein a pre-formed insert is disposed between layers of the structural fibres, wherein the insert comprises a material which acts to absorb and/or deflect and/or dissipate energy from a load or impact applied axially and/or radially to a rim and/or acts to increase the hoop stiffness of the wheel and wherein the insert has, when viewed in cross-section (with the axis of the rim being parallel to the plane of the cross-section), two elongate portions, with a first elongate portion of the insert extending into one of the first or second flanges, and a second elongate portion of the insert extending underneath the first or second bead seat, respectively, such that first and second portions together form an approximate ‘L’ shape in cross-section.", "2 . A rim for a wheel according to claim 1 , wherein a first plurality of layers of structural fibres form the bead seat above (i.e. radially outward of) the second elongate portion of the insert, and a second plurality of layers of structural fibres are disposed below (i.e. radially inward of) the second elongate portion and wherein the ratio of thickness of the first plurality of layers of structural fibres to the second plurality of layers of structural fibres is from about 2:1 to about 1:2, optionally about 3:2 to about 2:3, optionally about 4:3 to about 3:4, optionally about 5:4 to about 4:5.", "3 . A rim for a wheel according to claim 2 , wherein a second plurality of layers of structural fibres is the of the same or greater thickness than the thickness of the first plurality of layers.", "4 . A rim for a wheel according to any one of the preceding claims , wherein the pre-formed insert comprises or consists of a material selected from a compressible material, an elastomeric material and a cellular material.", "5 . A rim for a wheel according to claim 4 , wherein the cellular material is an injection-moulded foam material.", "6 . A rim for a wheel according to any one of claims 1 to 3 , wherein the pre-formed insert comprises or consists of a hollow shell that forms the insert, optionally wherein the hollow shell is formed from a rigid material, optionally wherein the rigid material is selected from a metal, a plastic and compression moulded carbon fibre, optionally wherein the metal is aluminum.", "7 . A rim for a wheel according to any one of the preceding claims , wherein first and second flanges each contain an insert as defined in claim 1 , with a first insert having its first elongate portion extending into the first flange and its second elongate portion extending under the first bead seat, and a second insert having its first elongate portion extending into the second flange and its second elongate portion extending under the second bead seat.", "8 . A rim for a wheel according to any one of the preceding claims , wherein the rim is for a wheel for a four-wheeled vehicle, with the first flange being an outboard flange, when fitted to a vehicle, and the first elongate portion of the insert extending into one of the first flange, and the second elongate portion of the insert extending underneath the first bead seat.", "9 . A rim for a wheel according to any one of the preceding claims , wherein the first elongate portion of the insert extends into one of the first flange, and the second elongate portion of the insert extending underneath the first bead seat, and a first safety bead is located axially inwardly of the first bead seat, and the insert approximately follows the outer contour of the first bead seat and first safety bead.", "10 . A rim for a wheel according to any one of the preceding claims , wherein the rim comprises a third flange that extends from the barrel radially inwardly and to which wheel attachments, e.g. spokes, may be fitted, wherein the third flange is formed by further layers of structural fibres that follow the contours of the third flange and extend along a radially inner side of a barrel on both sides of the third flange, optionally such that it extends along an axially outer edge of a flange, which may be the first flange if the third flange is located on the same side of the barrel as the first flange.", "11 . A rim for a wheel according to claim 10 , wherein the further layers of structural fibres comprise tri-axial fabric.", "12 . A wheel comprising a rim according to any one of claims 1 to 11 .", "13 . A vehicle comprising a wheel according to claim 12 .", "14 . A method of making a rim according to any one of claims 1 to 11 , the method comprising assembling the structural fibres and the pre-formed insert, and binding them together by the polymer matrix, to form the rim.", "15 . A method according to claim 14 , wherein the method involves moulding a material to form the insert before assembling the insert with the structural fibres, optionally wherein the moulding is injection moulding or compression moulding."], "bibtex": "@patent{20240375431,\n    title = {RIM FOR A WHEEL},\n    number = {20240375431},\n    year = {2024},\n    note = {File: US20240375431A1-20241114.XML}\n    }", "classification": "B60B2104FI"}, {"title": "VEHICLE WHEEL RIM, VEHICLE WHEEL INCLUDING SUCH A WHEEL RIM AND METHOD FOR PRODUCING SUCH A WHEEL RIM AND VEHICLE WHEEL", "doc_number": "20240375432", "filename": "US20240375432A1-20241114.XML", "abstract": "A vehicle rim including outboard and inboard bead seats and an annular well flank connected to the outboard bead seat and extending radially inwardly and towards the inboard side of the rim. A well base is connected to the well flank, wherein the well base defines a flat profile, and wherein the well base defines the inner-most radial dimension of the rim. A transition portion is defined between the well flank and the inboard bead seat. The transition portion has a circumferential corrugated profile having a circumferentially concave-shaped outboard groove connected to the well base at a first tangency point, a circumferentially convex-shaped ridge directly connected to the outboard groove at a second tangency point, and a circumferentially concave-shaped inboard groove directly connected to the ridge at a third tangency point. The inboard groove is connected to the inboard bead seat at a fourth tangency point.", "detailed_description": ["Referring now to the drawings, there is illustrated in cross-section inFIGS.1through4a “bead seat” vehicle wheel, indicated generally at10. The vehicle wheel10generally incudes a wheel disc, indicated generally at12, and an annular outer wheel rim, indicated generally at14. Although the invention is illustrated and described in conjunction with the particular vehicle wheel construction disclosed herein, it will be appreciated that the invention can be used in conjunction with other types of vehicle wheel constructions.", "", "The wheel10can be generally described as having an outboard side, indicated generally at10a,on the left-hand side as viewingFIG.1. The wheel10has an inboard side, indicated generally at10b,on the right-hand side as viewingFIG.1. When mounted on the vehicle, the wheel disc12is on the outboard side10a.", "", "In a preferred embodiment (and as illustrated herein), the wheel disc12and the wheel rim14are produced separately and then joined together by any suitable means, such as by welding, to produce a fabricated vehicle wheel10. In a preferred embodiment, the wheel disc12and the wheel rim14are made from steel and are then welded together, such as at a weld16, to form the wheel10. Of course, the wheel disc12and/or the wheel rim14may be made of any suitable materials such as for example, aluminum, magnesium, titanium or alloys thereof, carbon fiber and/or composite materials and/or may be secured together by other suitable means, if so desired.", "", "The combination of the annularly shaped wheel disc12and the wheel rim14defines a wheel axis X for the wheel10. The wheel disc12generally includes a centrally located hub, indicated generally at20, an outer circumferential edge22, and an annular or circular disc body portion, indicated generally at24. The hub20is preferably circular and is generally defined as the central portion of the wheel disc12. The outer circumferential edge22of the “bead seat” wheel disc12includes a circular flange26which is welded (or otherwise attached) via the weld16to a bead seat portion of the rim14, as will be discussed below.", "", "The disc body portion24is generally annulus or ring-shaped and encircles the hub20. The disc body portion24radially extends between the hub20and the outer circumferential edge22. The disc body portion24preferably includes a plurality of ventilation holes28formed therein. The vent holes28not only provide ventilation for wheel brakes (not shown) mounted adjacent to the wheel10but also help in reducing the overall weight or mass of the wheel10. The disc body portion24can have any number of ventilation holes28formed therein having any suitable shape. Alternatively, the disc body portion24can be formed with a plurality of spokes (not shown) radially extending between the hub20and the outer circumferential edge22.", "", "In the illustrated embodiment shown inFIG.1, the hub20has a front face or surface30, and a rear face or surface32. The front surface30is located on the outboard side10aof the wheel10and faces the outboard side10awhen mounted on a vehicle. The rear surface32faces towards the inboard side10bof the wheel10. The hub20functions as a wheel mounting portion or center mounting portion of the wheel10for connecting with an axle (not shown) via a plurality of lug bolts (not shown) and lug nuts (not shown).", "", "The hub20includes a centrally located pilot aperture or hub hole36. The hub hole36extends through and about the wheel axis X. The hub hole36may accommodate a portion of the axle and/or receive a protective/decorative cap (not shown). The hub hole36may have any suitable diameter. A plurality of lug bolt receiving holes38are formed in the hub20and are circumferentially spaced around the hub hole36and the wheel axis X. For example, the hub20may include five lug bolt receiving holes38. Alternatively, the number and/or location of the lug bolt receiving holes38may be other than illustrated if so desired. The lug bolt receiving holes38receive the lug bolts (not shown) for securing the vehicle wheel10with lug nuts (not shown) on the axle of an associated vehicle.", "", "In a preferred embodiment, the wheel disc12is preferably produced from a single steel blank (not shown) which is then formed by suitable means to form the wheel disc12. The blank may be first provided as a smooth, flat annular or ring-shaped steel disc blank, and then preferably shaped such as by a flow forming process into the final wheel disc shape. Alternatively, the blank may be formed by any suitable means, such as stamping and/or flow forming, into a wheel disc “preform” (not shown) having a particular partially formed wheel disc shape before it is formed into the final wheel disc shape, preferably by flow forming.", "", "The wheel rim14can have any suitable annular shape for receiving and supporting a tire (not shown). The wheel rim14preferably has a continuous annular shape relative to the wheel axis X for accommodating a vehicle tire (not shown) mounted thereon. Referring now to the schematic cross-section illustration ofFIG.2, the rim14can be described as having generally three segments or regions: an outboard portion, indicated generally within broken lines40, a middle transition portion, indicated generally within broken lines42, and an inboard portion, indicated generally within broken lines44. In general, the outboard and inboard portions40and44are formed with a standard profile commonly used in the industry to accommodate the proper mounting of various tires used in the marketplace. The thickness of the rim14at these outboard and inboard portions40and44may be generally constant. However, in accordance with the present invention, the portions of the rim14within the transition portion42are specifically designed and produced to provide structural advantages for the rim14. For example, the transition portion42may be formed with undulating waved or curved portions (as will be explained in detail below) to help reduce stress levels within the rim14as well as providing for a reduction in the mass of the rim14. These advantages can be obtained by the specific geometry and number of the curves within the transition portion42. Additionally, these advantages may also be provided by optionally varying the thickness of the rim14within the transition portion42. During the design stage of the transition portion42, stress levels at critical points within the wheel10are discovered and considered in determining the final shape of the transition portion42. Thus, the shape of the rim14within the transition portion42can affect the optimization results in order to achieve desired performance requirements.", "", "The rim14may be manufactured by any suitable method. In a preferred method, the rim14is at least partially formed by a rolling and forming process to obtain the desired annular shape, as shown inFIGS.1through4. Suitable methods of producing a vehicle rim are described in U.S. Pat. Nos. 5,579,578 and 4,962,587 both of which are incorporated by reference herein. There is illustrated inFIG.5a block diagram showing a sequence of steps of a suitable method for producing the rim14. Initially, in step50, a flat sheet of suitable material or blank, such as for example, steel or aluminum, is formed into a generally cylindrical hoop or band (not shown) and welded. When the hoop is welded in step50, a flat surface may be created by the weld. As a result of this, the hoop is expanded in step52to produce a substantially cylindrical hoop. The hoop is then subjected to a flow spinning process in step54to form a preform. Outboard and inboard end portions of the preform are then flared in step56to generally form the outboard and inboard portions40and44. The rim may then be initially roll formed in step58such as to provide the desired profile of the transition portion42. The rim is then subjected to a series of roll forming operations in steps60and62. If needed, the rim may be expanded in step64to produce the finished rim14. The rim14can then be secured to the wheel disc12, such as by the weld16, in step66, thereby producing the finished wheel10.", "", "The structural details of the rim14will now be explained with respect toFIGS.3and4. It should be understood that the illustrations of the rim14shown in cross-section inFIGS.2through4lack cross-sectional lines to help with clarity and understanding of the drawings inFIGS.2through4. Additionally, only the profile or section of the portion of the rim14is illustrated and background object lines have been removed for clarity. Lastly, the details of the drawings in the Figures are not necessarily to scale and may have exaggerated dimensions to assist in clarity and understanding of the drawings.", "", "The outboard portion40includes an outboard bead seat60adjacent to and connected with an outboard bead seat retaining flange62. The outboard bead seat60(in cooperation with the inboard bead seat80) provides a mounting and contacting surface64for sealing with a tire (not shown) mounted on the wheel10. A broken line, indicated generally by BS, schematically represents the bead seat diameter or inner diameter portion of a tire that is mounted on the wheel10. The conventionally known “rim width” may be determined as the axial distance between the bead seats60and80. The wheel diameter is generally the radial diameter of the respective bead seats. It should be appreciated that the rim14can have any desired diameter and/or shape. The wheel10can be manufactured to any suitable size for mounting a tire thereon. Tire sizes for conventional vehicles are generally within the range of about 16 inches (406 mm) to about 22 inches (560 mm), for example. In a preferred embodiment, the rim14has an outer diameter or a wheel diameter within the range of about 405 millimeters (about 16 inches), to about 560 millimeters (about 22 inches).", "", "The outboard bead seat retaining flange62generally provides for lateral or axial support of the tire mounted on the wheel10. The outboard bead seat retaining flange62includes a sidewall68and a curled lip portion70ending in an outer edge72. The sidewall68may be smoothly connected with the outboard bead seat60by a curved portion74. The outboard portion40also includes a well flank or side wall76connected to the bead seat60via a curved retaining hump78. The well flank76generally extends radially inwardly and in a direction towards the inboard portion44. The well flank76may have a generally frustoconical shape about the wheel axis X. The innermost radial portion of the well flank76may end in a curved portion79. As will be discussed below, the curved portion79is connected to a well base100.", "", "The inboard portion44is similar in structure as the outboard portion40without having a well flank or side wall. The inboard portion44includes an inboard bead seat80adjacent to and connected with an inboard bead seat retaining flange82. Similar to the outboard bead seat60, the inboard bead seat80provides a mounting and contacting surface84for sealing with a tire (not shown) mounted on the wheel10. The inboard bead seat retaining flange82includes a sidewall88and a curled lip portion90ending in an outer edge92. The sidewall88may be smoothly connected with the inboard bead seat80by a curved portion94. The other side of the inboard bead seat80is connected to a curved retaining hump98. The end of the retaining hump98generally defines the inner boundary of the inboard portion40. When the wheel10is formed by joining the wheel disc12to the rim14, the wheel10defines a centerline C or center-plane that is approximately located equally spaced axially from the bead seats60and80.", "", "The rim14defines a tire well, indicated generally at99, which generally defines the cavity or open region between the bead seats60and80. The tire well99may be defined as the open region generally radially inwardly from (or below as viewingFIGS.2through4) the bead seat diameter BS.", "", "The well base100extends in a direction towards the inboard portion44from the curved portion79of the well flank78. The well base100has a first or inboard end102smoothly connected to the curved portion79. The well base100also has a second or inboard end104connected to the transition portion42, as will be described below. The well base100defines the lowest part of the well99or, in other words, the inner-most radial dimension of the rim14. In a preferred embodiment, the well base100has a relatively straight profile shape in cross-section, as shown inFIG.3. Although the well base100can be formed having a cylindrical shape about the wheel axis X, in a preferred embodiment the well base100is angled at a slight angle S relative to the wheel axis X, thereby forming a slightly angled frustoconical shape about the wheel axis X. In a preferred embodiment, the angle S is within the range of about 0 degrees to about 15 degrees. In a more preferred embodiment, the angle S is within the range of about 1 degrees to about 10 degrees. The wheel base100can have any suitable axial length. In a preferred embodiment, the wheel base100has a constant thickness tw, as shown inFIG.4. If desired, the thickness twof the wheel base100may vary in thickness across its axial length, such as for example, by a flow forming process.", "", "The details of the transition portion42will now be discussed. As shown inFIG.3, the transition portion42is formed by a plurality of undulations or curved portions having a generally smooth circumferential corrugated profile. More specifically, the transition portion42of the illustrated embodiment includes namely three curved portions: an outboard curve or groove110, a ridge112, and an inboard groove114. The outboard groove110preferably has a circumferentially concave-shape such that it dips towards the well base100radially inwardly inside the well99. The inboard groove114preferably has a circumferentially concave-shape such that it dips radially inwardly inside the well99. The ridge112preferably has a circumferentially convex-shape extending radially outwardly.", "", "Referring toFIG.3, the outboard groove110has a first end110awhich is connected to the inboard end104of the well base100at a first tangency point120. It should be understood that the first tangency point120(and others) is not a single point but a circumferential circle since the grooves and ridges110,112, and114are circumferentially and annularly shaped about the wheel axis X. The tangency points are schematically illustrated in the Figures as small circular icons indicating the location of the tangency point. The outboard groove110has a second end110bwhich is directly connected to a first end112aor the ridge112at a second tangency point122. A second end112bof the ridge112is directly connected with a first end114aof the inboard groove114at a third tangency point124. A second end114bof the inboard groove114is connected with the retaining hump98at a fourth tangency point126. Note that the connections of the various features of the rim14at the tangency points120,122,124, and126are such that they are preferably smoothly blended and connected together without any sharp bends or corners. The outboard groove110, the ridge112, and the inboard groove114preferably have a circumferential and arcuate shape such that they are connected at tangents with one another, thereby providing for a smooth transition therebetween. As discussed above, in a preferred embodiment, the profile of the transition portion42is generally formed by a flow-forming process. This flow forming process may, for example, generally start at the first tangency point120and finish at the fourth tangency point126.", "", "As shown inFIG.4, the outboard groove110has an arcuate shape generally defined by a radius RI stemming from a center point CP1. It should be understood that the center point CP1(and others) is not a single point but a circumferential circle since the grooves and ridges110,112, and114are circumferentially and annularly shaped about the wheel axis X. The ridge112has an arcuate shape generally defined by a radius R2stemming from a center point CP2. The outboard groove114has an arcuate shape generally defined by a radius R3stemming from a center point CP3. In a preferred embodiment, the radius R1is within the range of about 20 millimeters to about 120 millimeters. In a more preferred embodiment, the radius R1is within the range of about 20 millimeters to about 90 millimeters. In a preferred embodiment, the radius R2is within the range of about 10 millimeters to about 120 millimeters. In a more preferred embodiment, the radius R2is within the range of about 20 millimeters to about 90 millimeters. In a preferred embodiment, the radius R3is within the range of about 10 millimeters to about 120 millimeters. In a more preferred embodiment, the radius R3is within the range of about 20 millimeters to about 90 millimeters.", "", "In a preferred embodiment, the radius R2is greater than either of the radii R1and R3. Additionally, in a preferred embodiment, the radius RI is greater than the radius R3. It has been found that the profile of the transition portion42along with the structure of the wheel base100of the illustrated embodiment provides for a suitable reduction in stress levels of the wheel10as well as providing a reduction in mass.", "", "As shown inFIG.4, there is a reference plane P radially extending from the outboard sidewall68. The center point CP1for the radius R1may be positioned by an axially extending distance A from the plane P. In a preferred embodiment, the distance A is within the range of about 30 millimeters to about 60 millimeters. In a more preferred embodiment, the distance A is within the range of about 35 millimeters to about 55 millimeters. The center point CP2for the radius R2may be positioned by an axially extending distance B from the plane P. In a preferred embodiment, the distance B is within the range of about 20 millimeters to about 180 millimeters. In a more preferred embodiment, the distance B is within the range of about 30 millimeters to about 150 millimeters. The center point CP3for the radius R3may be positioned by an axially extending distance C from the plane P. In a preferred embodiment, the distance C is within the range of about 90 millimeters to about 200 millimeters. In a more preferred embodiment, the distance C is within the range of about 90 millimeters to about 180 millimeters.", "", "In general, the position of the first and fourth tangency points120and126generally depends on the width of the wheel disc12. For example, the first tangency point120may be axially positioned from the plane P by a distance D. In a preferred embodiment, the distance D is within the range of about 67 millimeters to about 120 millimeters. The tangency points120,122,124, and126may be positioned anywhere within the transition portion42such that they smoothly flow into the respective intersecting curves. For example, it is preferred that the inboard groove114smoothly flows into the arcuately curved retaining hump98. To accomplish this, the tangency point126can be positioned relative to the retaining hump98at an angle E with respect to a plane perpendicular to the wheel axis X. In a preferred embodiment, the angle E is within the range of about 45 degrees to about 90 degrees.", "", "In a preferred embodiment, the outboard end102of the wheel base100defines the inner-most radial dimension of the rim14or, in other words, the deepest point of the well99and closest to the wheel axis X. This distance can be generally represented by a distance F extending radially inwardly from the bead seat diameter BS, as shown inFIG.4. In a preferred embodiment, the distance F is within the range of about 15 millimeters to about 30 millimeters. In a more preferred embodiment, the distance F is within the range of about 17.5 to about 25 millimeters. The distance of the peak of the ridge112from the bead seat diameter BS is generally shown as the distance G. In a preferred embodiment, the distance G is within the range of about 3 millimeters to about 15 millimeters. In a more preferred embodiment, the distance G is within the range of about 5 to about 10 millimeters. The distance of the innermost point of the inboard groove114from the bead seat diameter BS is generally represented by the distance H. In a preferred embodiment, the distance H is within the range of about 15 millimeters to about 30 millimeters. In a more preferred embodiment, the distance H is within the range of about 17.5 to about 25 millimeters. In the illustrated and preferred embodiment, the distance F is greater than the distance H.", "", "As stated above, the rim14may have any desired thickness extending along the axial direction. For example, the portion of the rim14within the transition portion42may have a constant thickness. This thickness can correspond to or generally be the same as the thickness of the rim14within the outboard and inboard portions40and44. Alternatively, the thickness of the portion of the rim14within the transition portion42may vary in the axial direction between respective tangency points120,122,124, and126. One or more of the outboard groove110, the ridge112, and the inboard groove114can each have a different thickness, or the thickness within one or more of the outboard groove110, the ridge112, and the inboard groove114may vary. For example, the thickness of the rim14within a central region of the transition portion42may be thinner than the thickness of the outer portions adjacent the outboard and inboard portions40and44.", "", "In one preferred embodiment, the transition portion42has a varying thickness. Referring toFIG.4, the transition portion42has an outer surface130and an inner surface132defining a thickness therebetween. The thickness of the outboard groove110generally adjacent to the tangency point120is defined as a thickness t1. The thickness t1can generally be defined as being located on an outboard side (first end110a) of the outboard groove110. The thickness of the outboard groove110generally adjacent to the tangency point122is defined as a thickness t2. The thickness t2can generally be defined as being located on an inboard side (second end110b) of the outboard groove110. The thickness of the ridge112is represented as a thickness t3. The thickness of the inboard groove114generally adjacent to the tangency point124is defined as a thickness t4. The thickness t4can generally be defined as being located on an outboard side (first end114a) of the inboard groove114. The thickness of the inboard groove114generally adjacent to the tangency point126is defined as a thickness t5. The thickness t5can generally be defined as being located on an inboard side (second end114b) of the inboard groove114.", "", "In the preferred embodiment, the thickness t1is greater than the thickness t2such that the thickness of the outboard groove110narrows from the outboard towards the inboard direction. In furtherance of the preferred embodiment, the thickness t5may be greater than the thickness t4such that the thickness of the inboard groove114narrows from the inboard towards the outboard direction. The thickness of the ridge112may remain constant such that the thicknesses t2, t3, and t4are relatively the same and the thickness t3is constant between the tangency points122and124. Of course, this is just and example of one embodiment and it should be understood that the thicknesses t1, t2, t3, t4, and t5may have any suitable dimension.", "", "In a preferred embodiment, the reduction in thickness of the thicknesses t1, t2, t3, t4, and t5is within the range of about 7% to about 30% the thickness of the well flank76, for example, or any other portion of the rim14within the outboard and inboard portions40and44generally prior to a flow forming step. It has been found that one suitable example of an embodiment of the rim14provides for a thickness of the well flank76and well base100and the thicknesses t1and t5being about 2.3 millimeters. In this example, a suitable thickness for the thicknesses t2, t3, and t4is about 1.7 millimeters. Note that due to the varying thickness between the outer and inner surfaces130and132of the grooves110and114, the surfaces130and132will not be perfectly arcuate with respect to Radii R1and R3and thus are not precisely concentric with one another.", "", "There is illustrated inFIG.6an alternate embodiment of a wheel, indicated generally at150. The wheel150includes a wheel disc152and a rim154. The structure of the wheel150is commonly referred to as a “drop center” wheel such that the wheel disc152is secured, such as by a weld156, to the rim154at an inner surface of a well base158of the rim154. As shown inFIG.6, the cross-sectional profile shape of the rim154may be similar to the profile shape of the rim14of the wheel10described above in accordance with the present invention.", "", "There is illustrated inFIG.7another alternate embodiment of a wheel, indicated generally at170. The wheel170includes a wheel disc172and a rim174. The wheel170is of a type commonly referred to as a “full face” wheel. Although the cross-sectional profile of the rim174is similar to the rim14, one of the differences is that the rim174has an outboard portion180which does not include a bead seat retaining flange. Instead, the full face wheel disc172includes a bead scat retaining flange182formed on the outer circumferential edge of the wheel disc172. The outboard portion of the rim174essentially ends at a bead seat186such that a tip or end188of the bead seat186is welded or otherwise attached to a rear surface of the wheel disc172. The detail of the profile of the rim174can be seen in the enlarged schematic view ofFIG.8. Thus, the features of the rim in accordance with the present invention as described above with respect toFIGS.1through4may be used in the wheels150and170.", "", "As can be understood, the specific numbers, ranges, dimensions and/or percentages disclosed herein can be other than illustrated and described if so desired.", "", "The principle and mode of operation of this invention have been explained and illustrated in its preferred embodiments. However, it must be understood that this invention may be practiced otherwise than as specifically explained and illustrated without departing from its spirit or scope."], "claims": ["an annular rim defining an axis and inboard and outboard sides, the rim including: an outboard bead seat; an inboard bead seat; an annular well flank connected to the outboard bead seat and extending radially inwardly and towards the inboard side of the rim; a well base connected to the well flank, wherein the well base defines a flat profile, and wherein the well base defines the inner-most radial dimension of the rim; and a transition portion defined between the well flank and the inboard bead seat, wherein the transition portion has a circumferential corrugated profile having: a circumferentially concave-shaped outboard groove connected to the well base at a first tangency point; a circumferentially convex-shaped ridge directly connected to the outboard groove at a second tangency point; and a circumferentially concave-shaped inboard groove directly connected to the ridge at a third tangency point, and wherein the inboard groove is connected to the inboard bead seat at a fourth tangency point; and a wheel disc secured to the rim, wherein the wheel disc includes a hub located centrally within the wheel disc and having a plurality of bolt holes formed therein. wherein the transition portion has an outer surface and an inner surface defining a thickness therebetween such that the thickness is constant between the first and fourth tangency points.", "2 . The vehicle wheel of claim 1 , wherein the flat profile of the well base has a frustoconical shape.", "3 . The vehicle wheel of claim 2 , wherein the frustoconical shape of the well base is formed at an angle with respect to the wheel axis within the range of about 0 degrees to about 25 degrees.", "4 . The vehicle wheel of claim 1 , wherein the well base has a constant thickness.", "5 . The vehicle wheel of claim 1 , wherein the well base is smoothly connected to the well flank via a curved portion.", "6 . The vehicle wheel of claim 1 , wherein the transition portion has an outer surface and an inner surface defining a thickness therebetween such that the thickness of at least a portion of the transition portion varies between the first and fourth tangency points.", "7 . The vehicle wheel of claim 6 , wherein the at least a portion of the transition portion has a thinning between about 7% to about 30% the thickness of the well flank.", "8 . The vehicle wheel of claim 6 , wherein an outboard side of the outboard groove adjacent the first tangency point has a greater thickness than an inboard side of the outboard groove adjacent the second tangency point.", "9 . The vehicle wheel of claim 6 , wherein the ridge has a constant thickness between the second and third tangency points.", "10 . The vehicle wheel of claim 6 , wherein an inboard side of the inboard groove adjacent the fourth tangency point has a greater thickness than an outboard side of the inboard groove adjacent the third tangency point.", "11 . The vehicle wheel of claim 1 , wherein the outboard groove has an arcuate shape defined by a first radius.", "12 . The vehicle wheel of claim 11 , wherein the ridge has an arcuate shape defined by a second radius.", "13 . The vehicle wheel of claim 12 , wherein the inboard groove has an arcuate shape defined by a third radius.", "14 . The vehicle wheel of claim 13 , wherein the second radius is greater than either of the first and third radii.", "15 . The vehicle wheel of claim 13 , wherein the first radius is greater than the third radius.", "16 . The vehicle wheel of claim 1 , wherein the rim includes an inboard bead seat retaining flange connected to the inboard bead seat.", "17 . The vehicle wheel of claim 16 , wherein the rim includes an outboard bead seat retaining flange connected to the outboard bead seat.", "18 . The vehicle wheel of claim 17 , wherein the wheel is a bead seat wheel such that the wheel disc is secured to the rim at the outboard beat seat.", "19 . The vehicle wheel of claim 17 , wherein the wheel is drop center wheel such that the wheel disc is secured to the rim at the outboard groove.", "20 . The vehicle wheel of claim 16 , wherein the wheel is a full faced wheel such that the wheel disc includes an outboard bead seat retaining flange integrally formed therein, and wherein the wheel disc is connected to the rim at the outboard bead seat.", "21 . The vehicle wheel of claim 1 , wherein the rim is produced by forming a metallic blank.", "22 . The vehicle wheel of claim 21 , wherein the metallic blank is a steel blank.", "23 . The vehicle wheel of claim 22 , wherein the rim is formed into a final desired shape by a flow forming process.", "24 . The vehicle wheel of claim 23 , wherein the wheel disc is produced by forming a metallic blank by a flow forming process.", "an outboard bead seat; an inboard bead seat; an annular well flank connected to the outboard bead seat and extending radially inwardly and towards the inboard side of the rim; a well base connected to the well flank, wherein the well base defines a flat profile, and wherein the well base defines the inner-most radial dimension of the rim; and a transition portion defined between the well flank and the inboard bead seat, wherein the transition portion has a circumferential corrugated profile having: a circumferentially concave-shaped outboard groove connected to the well base at a first tangency point; a circumferentially convex-shaped ridge directly connected to the outboard groove at a second tangency point; and a circumferentially concave-shaped inboard groove directly connected to the ridge at a third tangency point, and wherein the inboard groove is connected to the inboard bead seat at a fourth tangency point.", "providing an annular rim defining an axis and inboard and outboard sides, the rim including: an outboard bead seat; an inboard bead seat; an annular well flank connected to the outboard bead seat and extending radially inwardly and towards the inboard side of the rim; a well base connected to the well flank, wherein the well base defines a flat profile, and wherein the well base defines the inner-most radial dimension of the rim; and a transition portion defined between the well flank and the inboard bead seat, wherein the transition portion is produced by a flow forming process and has a circumferential corrugated profile having: a circumferentially concave-shaped outboard groove connected to the well base at a first tangency point; a circumferentially convex-shaped ridge directly connected to the outboard groove at a second tangency point; and a circumferentially concave-shaped inboard groove directly connected to the ridge at a third tangency point, and wherein the inboard groove is connected to the inboard bead seat at a fourth tangency point; and securing a wheel disc secured to the rim to produce the vehicle wheel, wherein the wheel disc includes a hub located centrally within the wheel disc and having a plurality of bolt holes formed therein."], "bibtex": "@patent{20240375432,\n    title = {VEHICLE WHEEL RIM, VEHICLE WHEEL INCLUDING SUCH A WHEEL RIM AND METHOD FOR PRODUCING SUCH A WHEEL RIM AND VEHICLE WHEEL},\n    number = {20240375432},\n    year = {2024},\n    note = {File: US20240375432A1-20241114.XML}\n    }", "classification": "B60B2110FI"}, {"title": "VEHICLE WHEEL RIM, VEHICLE WHEEL INCLUDING SUCH A WHEEL RIM AND METHOD FOR PRODUCING SUCH A WHEEL RIM AND VEHICLE WHEEL", "doc_number": "20240375433", "filename": "US20240375433A1-20241114.XML", "abstract": "A vehicle rim having outboard and inboard bead seats and an annular well flank connected to the outboard bead seat and extending radially inwardly and towards the inboard side of the rim. A transition portion is defined between the well flank and the inboard bead seat. The transition portion has a circumferential corrugated profile having a circumferentially concave-shaped outboard groove connected to the well flank at a first tangency point, and wherein the outboard groove defines the inner-most radial dimension of the rim. The transition portion further includes a circumferentially convex-shaped ridge directly connected to the outboard groove at a second tangency point, and a circumferentially concave-shaped inboard groove directly connected to the ridge at a third tangency point, and wherein the inboard groove is connected to the inboard bead seat at a fourth tangency point.", "detailed_description": ["Referring now to the drawings, there is illustrated in cross-section inFIGS.1through4a “bead seat” vehicle wheel, indicated generally at10. The vehicle wheel10generally incudes a wheel disc, indicated generally at12, and an annular outer wheel rim, indicated generally at14. Although the invention is illustrated and described in conjunction with the particular vehicle wheel construction disclosed herein, it will be appreciated that the invention can be used in conjunction with other types of vehicle wheel constructions.", "", "The wheel10can be generally described as having an outboard side, indicated generally at10a,on the left-hand side as viewingFIG.1. The wheel10has an inboard side, indicated generally at10b,on the right-hand side as viewingFIG.1. When mounted on the vehicle, the wheel disc12is on the outboard side10a.", "", "In a preferred embodiment (and as illustrated herein), the wheel disc12and the wheel rim14are produced separately and then joined together by any suitable means, such as by welding, to produce a fabricated vehicle wheel10. In a preferred embodiment, the wheel disc12and the wheel rim14are made from steel and are then welded together, such as at a weld16, to form the wheel10. Of course, the wheel disc12and/or the wheel rim14may be made of any suitable materials such as for example, aluminum, magnesium, titanium or alloys thereof, carbon fiber and/or composite materials and/or may be secured together by other suitable means, if so desired.", "", "The combination of the annularly shaped wheel disc12and the wheel rim14defines a wheel axis X for the wheel10. The wheel disc12generally includes a centrally located hub, indicated generally at20, an outer circumferential edge22, and an annular or circular disc body portion, indicated generally at24. The hub20is preferably circular and is generally defined as the central portion of the wheel disc12. The outer circumferential edge22of the “bead seat” wheel disc12includes a circular flange26which is welded (or otherwise attached) via the weld16to a bead seat portion of the rim14, as will be discussed below.", "", "The disc body portion24is generally annulus or ring-shaped and encircles the hub20. The disc body portion24radially extends between the hub20and the outer circumferential edge22. The disc body portion24preferably includes a plurality of ventilation holes28formed therein. The vent holes28not only provide ventilation for wheel brakes (not shown) mounted adjacent to the wheel10but also help in reducing the overall weight or mass of the wheel10. The disc body portion24can have any number of ventilation holes28formed therein having any suitable shape. Alternatively, the disc body portion24can be formed with a plurality of spokes (not shown) radially extending between the hub20and the outer circumferential edge22.", "", "In the illustrated embodiment shown inFIG.1, the hub20has a front face or surface30, and a rear face or surface32. The front surface30is located on the outboard side10aof the wheel10and faces the outboard side10awhen mounted on a vehicle. The rear surface32faces towards the inboard side10bof the wheel10. The hub20functions as a wheel mounting portion or center mounting portion of the wheel10for connecting with an axle (not shown) via a plurality of lug bolts (not shown) and lug nuts (not shown).", "", "The hub20includes a centrally located pilot aperture or hub hole36. The hub hole36extends through and about the wheel axis X. The hub hole36may accommodate a portion of the axle and/or receive a protective/decorative cap (not shown). The hub hole36may have any suitable diameter. A plurality of lug bolt receiving holes38are formed in the hub20and are circumferentially spaced around the hub hole36and the wheel axis X. For example, the hub20may include five lug bolt receiving holes38. Alternatively, the number and/or location of the lug bolt receiving holes38may be other than illustrated if so desired. The lug bolt receiving holes38receive the lug bolts (not shown) for securing the vehicle wheel10with lug nuts (not shown) on the axle of an associated vehicle.", "", "In a preferred embodiment, the wheel disc12is preferably produced from a single steel blank (not shown) which is then formed by suitable means to form the wheel disc12. The blank may be first provided as a smooth, flat annular or ring-shaped steel disc blank, and then preferably shaped such as by a flow forming process into the final wheel disc shape. Alternatively, the blank may be formed by any suitable means, such as stamping and/or flow forming, into a wheel disc “preform” (not shown) having a particular partially formed wheel disc shape before it is formed into the final wheel disc shape, preferably by flow forming.", "", "The wheel rim14can have any suitable annular shape for receiving and supporting a tire (not shown). The wheel rim14preferably has a continuous annular shape relative to the wheel axis X for accommodating a vehicle tire (not shown) mounted thereon. Referring now to the schematic cross-section illustration ofFIG.2, the rim14can be described as having generally three segments or regions: an outboard portion, indicated generally within broken lines40, a middle transition portion, indicated generally within broken lines42, and an inboard portion, indicated generally within broken lines44. In general, the outboard and inboard portions40and44are formed with a standard profile commonly used in the industry to accommodate the proper mounting of various tires used in the marketplace. The thickness of the rim14at these outboard and inboard portions40and44may be generally constant. However, in accordance with the present invention, the portions of the rim14within the transition portion42are specifically designed and produced to provide structural advantages for the rim14. For example, the transition portion42may be formed with undulating waved or curved portions (as will be explained in detail below) to help reduce stress levels within the rim14as well as providing for a reduction in the mass of the rim14. These advantages can be obtained by the specific geometry and number of the curves within the transition portion42. Additionally, these advantages may also be provided by optionally varying the thickness of the rim14within the transition portion42. During the design stage of the transition portion42, stress levels at critical points within the wheel10are discovered and considered in determining the final shape of the transition portion42. Thus, the shape of the rim14within the transition portion42can affect the optimization results in order to achieve desired performance requirements.", "", "The rim14may be manufactured by any suitable method. In a preferred method, the rim14is at least partially formed by a rolling and forming process to obtain the desired annular shape, as shown inFIGS.1through4. Suitable methods of producing a vehicle rim are described in U.S. Pat. Nos. 5,579,578 and 4,962,587 both of which are incorporated by reference herein. There is illustrated inFIG.5a block diagram showing a sequence of steps of a suitable method for producing the rim14. Initially, in step50, a flat sheet of suitable material or blank, such as for example, steel or aluminum, is formed into a generally cylindrical hoop or band (not shown) and welded. When the hoop is welded in step50, a flat surface may be created by the weld. As a result of this, the hoop is expanded in step52to produce a substantially cylindrical hoop. The hoop is then subjected to a flow spinning process in step54to form a preform. Outboard and inboard end portions of the preform are then flared in step56to generally form the outboard and inboard portions40and44. The rim may then be initially roll formed in step58such as to provide the desired profile of the transition portion42. The rim is then subjected to a series of roll forming operations in steps60and62. If needed, the rim may be expanded in step64to produce the finished rim14. The rim14can then be secured to the wheel disc12, such as by the weld16, in step66, thereby producing the finished wheel10.", "", "The structural details of the rim14will now be explained with respect toFIGS.3and4. It should be understood that the illustrations of the rim14shown in cross-section inFIGS.2through4lack cross-sectional lines to help with clarity and understanding of the drawings inFIGS.2through4. Additionally, only the profile or section of the portion of the rim14is illustrated and background object lines have been removed for clarity. Lastly, the details of the drawings in the Figures are not necessarily to scale and may have exaggerated dimensions to assist in clarity and understanding of the drawings.", "", "The outboard portion40includes an outboard bead seat60adjacent to and connected with an outboard bead seat retaining flange62. The outboard bead seat60(in cooperation with the inboard bead seat80) provides a mounting and contacting surface64for sealing with a tire (not shown) mounted on the wheel10. A broken line, indicated generally by BS, schematically represents the bead seat diameter or inner diameter portion of a tire that is mounted on the wheel10. The conventionally known “rim width” may be determined as the axial distance between the bead seats60and80. The wheel diameter is generally the radial diameter of the respective bead seats. It should be appreciated that the rim14can have any desired diameter and/or shape. The wheel10can be manufactured to any suitable size for mounting a tire thereon. Tire sizes for conventional vehicles are generally within the range of about 16 inches (406 mm) to about 22 inches (560 mm), for example. In a preferred embodiment, the rim14has an outer diameter or a wheel diameter within the range of about 405 millimeters (about 16 inches), to about 560 millimeters (about 22 inches).", "", "The outboard bead seat retaining flange62generally provides for lateral or axial support of the tire mounted on the wheel10. The outboard bead seat retaining flange62includes a sidewall68and a curled lip portion70ending in an outer edge72. The sidewall68may be smoothly connected with the outboard bead seat60by a curved portion74. The outboard portion40also includes a well flank or side wall76connected to the bead seat60via a curved retaining hump78. The well flank76generally extends radially inwardly and in a direction towards the inboard portion44. The well flank76may have a generally frustoconical shape about the wheel axis X. The innermost radial portion of the well flank76may end in a curved portion79. The inboard end of the curved portion79generally defines the inner boundary of the outboard portion40.", "", "The inboard portion44is similar in structure as the outboard portion40without having a well flank or side wall. The inboard portion44includes an inboard bead seat80adjacent to and connected with an inboard bead seat retaining flange82. Similar to the outboard bead seat60, the inboard bead seat80provides a mounting and contacting surface84for sealing with a tire (not shown) mounted on the wheel10. The inboard bead seat retaining flange82includes a sidewall88and a curled lip portion90ending in an outer edge92. The sidewall88may be smoothly connected with the inboard bead seat80by a curved portion94. The other side of the inboard bead seat80is connected to a curved retaining hump98. The end of the retaining hump98generally defines the inner boundary of the inboard portion40. When the wheel10is formed by joining the wheel disc12to the rim14, the wheel10defines a centerline C or center-plane that is approximately located equally spaced axially from the bead seats60and80.", "", "The rim14defines a tire well, indicated generally at99, which generally defines the cavity or open region between the bead seats60and80. The tire well99may be defined as the open region generally radially inwardly from (or below as viewingFIGS.2through4) the bead seat diameter BS.", "", "The details of the transition portion42will now be discussed. As shown inFIG.3, the transition portion42is formed by a plurality of undulations or curved portions having a generally smooth circumferential corrugated profile. More specifically, the transition portion42of the illustrated embodiment includes namely three curved portions: an outboard groove110, a ridge112, and an inboard groove114. The outboard groove110preferably has a circumferentially concave-shape such that it dips radially inwardly inside the well99. Similarly, the inboard groove114preferably has a circumferentially concave-shape such that it dips radially inwardly inside the well99. The ridge112preferably has a circumferentially convex-shape extending radially outwardly.", "", "Referring toFIG.3, the outboard groove110has a first end110awhich is connected to the curved portion79of the well flank76at a first tangency point120. It should be understood that the first tangency point120(and others) is not a single point but a circumferential circle since the grooves and ridges110,112, and114are circumferentially and annularly shaped about the wheel axis X. The tangency points are schematically illustrated in the Figures as small circular icons indicating the location of the tangency point. The outboard groove110has a second end110bwhich is directly connected to a first end112aor the ridge112at a second tangency point122. A second end112bof the ridge112is directly connected with a first end114aof the inboard groove114at a third tangency point124. A second end114bof the inboard groove114is connected with the retaining hump98at a fourth tangency point126. Note that the connections of the various features of the rim14at the tangency points120,122,124, and126are such that they are preferably smoothly blended and connected together without any sharp bends or corners. The outboard groove110, the ridge112, and the inboard groove114preferably have a circumferential and arcuate shape such that they are connected at tangents with one another, thereby providing for a smooth transition therebetween. As discussed above, in a preferred embodiment, the profile of the transition portion42is generally formed by a flow-forming process. This flow forming process may, for example, generally start at the first tangency point120and finish at the fourth tangency point126.", "", "As shown inFIG.4, the outboard groove110has an arcuate shape generally defined by a radius R1stemming from a center point CP1. It should be understood that the center point CP1(and others) is not a single point but a circumferential circle since the grooves and ridges110,112, and114are circumferentially and annularly shaped about the wheel axis X. The ridge112has an arcuate shape generally defined by a radius R2stemming from a center point CP2. The outboard groove114has an arcuate shape generally defined by a radius R3stemming from a center point CP3. In a preferred embodiment, the radius R1is within the range of about 20 millimeters to about 120 millimeters. In a more preferred embodiment, the radius R1is within the range of about 20 millimeters to about 90 millimeters. In a preferred embodiment, the radius R2is within the range of about 10 millimeters to about 120 millimeters. In a more preferred embodiment, the radius R2is within the range of about 20 millimeters to about 90 millimeters. In a preferred embodiment, the radius R3is within the range of about 10 millimeters to about 120 millimeters. In a more preferred embodiment, the radius R3is within the range of about 20 millimeters to about 90 millimeters.", "", "In a preferred embodiment, the radius R1is greater than either of the radii R2and R3. In the illustrated embodiment shown inFIG.4, the radius R1is at least twice as greater than the radii R2or R3. Additionally, in a preferred embodiment, the radius R2is greater than the radius R3. It has been found that the profile of the transition portion42of the illustrated embodiment provides for a suitable reduction in stress levels of the wheel10as well as providing a reduction in mass.", "", "As shown inFIG.4, there is a reference plane P radially extending from the outboard sidewall68. The center point CP1for the radius RI may be positioned by an axially extending distance A from the plane P. In a preferred embodiment, the distance A is within the range of about 30 millimeters to about 60 millimeters. In a more preferred embodiment, the distance A is within the range of about 35 millimeters to about 55 millimeters. The center point CP2for the radius R2may be positioned by an axially extending distance B from the plane P. In a preferred embodiment, the distance B is within the range of about 20 millimeters to about 180 millimeters. In a more preferred embodiment, the distance B is within the range of about 30 millimeters to about 150 millimeters. The center point CP3for the radius R3may be positioned by an axially extending distance C from the plane P. In a preferred embodiment, the distance C is within the range of about 90 millimeters to about 200 millimeters. In a more preferred embodiment, the distance C is within the range of about 90 millimeters to about 180 millimeters.", "", "In general, the position of the first and fourth tangency points120and126generally depends on the width of the wheel disc12. For example, the first tangency point120may be axially positioned from the plane P by a distance D. In a preferred embodiment, the distance D is within the range of about 30 millimeters to about 45 millimeters. The tangency points120,122,124, and126may be positioned anywhere within the transition portion42such that they smoothly flow into the respective intersecting curves. For example, it is preferred that the inboard groove114smoothly flows into the arcuately curved retaining hump98. To accomplish this, the tangency point126can be positioned relative to the retaining hump98at an angle E with respect to a plane perpendicular to the wheel axis X. In a preferred embodiment, the angle E is within the range of about 45 degrees to about 90 degrees.", "", "In a preferred embodiment, the radial depth of the outboard groove110defines the inner-most radial dimension of the rim14or, in other words, the deepest point of the well99and closest to the wheel axis X. This distance can be generally represented by a distance F extending radially inwardly from the bead seat diameter BS, as shown inFIG.4. In a preferred embodiment, the distance F is within the range of about 15 millimeters to about 30 millimeters. In a more preferred embodiment, the distance F is within the range of about 17.5 to about 25 millimeters. The distance of the peak of the ridge112from the bead seat diameter BS is generally shown as the distance G. In a preferred embodiment, the distance G is within the range of about 3 millimeters to about 15 millimeters. In a more preferred embodiment, the distance G is within the range of about 5 to about 10 millimeters. The distance of the innermost point of the inboard groove114from the bead seat diameter BS is generally represented by the distance H. In a preferred embodiment, the distance H is within the range of about 15 millimeters to about 30 millimeters. In a more preferred embodiment, the distance H is within the range of about 17.5 to about 25 millimeters. In the illustrated and preferred embodiment, the distance F is greater than the distance H.", "", "As stated above, the rim14may have any desired thickness extending along the axial direction. For example, the portion of the rim14within the transition portion42may have a constant thickness. This thickness can correspond to or generally be the same as the thickness of the rim14within the outboard and inboard portions40and44. Alternatively, the thickness of the portion of the rim14within the transition portion42may vary in the axial direction between respective tangency points120,122,124, and126. One or more of the outboard groove110, the ridge112, and the inboard groove114can each have a different thickness, or the thickness within one or more of the outboard groove110, the ridge112, and the inboard groove114may vary. For example, the thickness of the rim14within a central region of the transition portion42may be thinner than the thickness of the outer portions adjacent the outboard and inboard portions40and44.", "", "In one preferred embodiment, the transition portion42has a varying thickness. Referring toFIG.4, the transition portion42has an outer surface130and an inner surface132defining a thickness therebetween. The thickness of the outboard groove110generally adjacent to the tangency point120is defined as a thickness t1. The thickness t1can generally be defined as being located on an outboard side (first end110a) of the outboard groove110. The thickness of the outboard groove110generally adjacent to the tangency point122is defined as a thickness t2. The thickness t2can generally be defined as being located on an inboard side (second end110b) of the outboard groove110. The thickness of the ridge112is represented as a thickness t3. The thickness of the inboard groove114generally adjacent to the tangency point124is defined as a thickness t4. The thickness t4can generally be defined as being located on an outboard side (first end114a) of the inboard groove114. The thickness of the inboard groove114generally adjacent to the tangency point126is defined as a thickness t5. The thickness t5can generally be defined as being located on an inboard side (second end114b) of the inboard groove114.", "", "In the preferred embodiment, the thickness t1is greater than the thickness t2such that the thickness of the outboard groove110narrows from the outboard towards the inboard direction. In furtherance of the preferred embodiment, the thickness t5may be greater than the thickness t4such that the thickness of the inboard groove114narrows from the inboard towards the outboard direction. The thickness of the ridge112may remain constant such that the thicknesses t2, t3, and t4are relatively the same and the thickness t3is constant between the tangency points122and124. Of course, this is just and example of one embodiment and it should be understood that the thicknesses t1, t2, t3, t4, and t5may have any suitable dimension.", "", "In a preferred embodiment, the reduction in thickness of the thicknesses t1, t2, t3, t4, and t5is within the range of about 7% to about 30% the thickness of the well flank76, for example, or any other portion of the rim14within the outboard and inboard portions40and44generally prior to a flow forming step. It has been found that one suitable example of an embodiment of the rim14provides for a thickness of the well flank76and the thicknesses t1and t5being about 2.3 millimeters. In this example, a suitable thickness for the thicknesses t2, t3, and t4is about 1.7 millimeters. Note that due to the varying thickness between the outer and inner surfaces130and132of the grooves110and114, the surfaces130and132will not be perfectly arcuate with respect to Radii R1and R3and thus are not precisely concentric with one another.", "", "There is illustrated inFIG.6an alternate embodiment of a wheel, indicated generally at150. The wheel150includes a wheel disc152and a rim154. The structure of the wheel150is commonly referred to as a “drop center” wheel such that the wheel disc152is secured, such as by a weld156, to the rim154at an inner surface of an outboard groove158of the rim154. As shown inFIG.6, the cross-sectional profile shape of the rim154may be similar to the profile shape of the rim14of the wheel10described above in accordance with the present invention.", "", "There is illustrated inFIG.7another alternate embodiment of a wheel, indicated generally at170. The wheel170includes a wheel disc172and a rim174. The wheel170is of a type commonly referred to as a “full face” wheel. Although the cross-sectional profile of the rim174is similar to the rim14, one of the differences is that the rim174has an outboard portion180which does not include a bead seat retaining flange. Instead, the full face wheel disc172includes a bead seat retaining flange182formed on the outer circumferential edge of the wheel disc172. The outboard portion of the rim174essentially ends at a bead seat186such that a tip or end188of the bead seat186is welded or otherwise attached to a rear surface of the wheel disc172. The detail of the profile of the rim174can be seen in the enlarged schematic view ofFIG.8. Thus, the features of the rim in accordance with the present invention as described above with respect toFIGS.1through4may be used in the wheels150and170.", "", "As can be understood, the specific numbers, ranges, dimensions and/or percentages disclosed herein can be other than illustrated and described if so desired.", "", "The principle and mode of operation of this invention have been explained and illustrated in its preferred embodiments. However, it must be understood that this invention may be practiced otherwise than as specifically explained and illustrated without departing from its spirit or scope."], "claims": ["an annular rim defining an axis and inboard and outboard sides, the rim including: an outboard bead seat; an inboard bead seat; an annular well flank connected to the outboard bead seat and extending radially inwardly and towards the inboard side of the rim; and a transition portion defined between the well flank and the inboard bead seat, wherein the transition portion has a circumferential corrugated profile having: a circumferentially concave-shaped outboard groove connected to the well flank at a first tangency point, wherein the outboard groove defines the inner-most radial dimension of the rim; a circumferentially convex-shaped ridge directly connected to the outboard groove at a second tangency point; and a circumferentially concave-shaped inboard groove directly connected to the ridge at a third tangency point, and wherein the inboard groove is connected to the inboard bead seat at a fourth tangency point; and a wheel disc secured to the rim, wherein the wheel disc includes a hub located centrally within the wheel disc and having a plurality of bolt holes formed therein.", "2 . The vehicle wheel of claim 1 , wherein the transition portion has an outer surface and an inner surface defining a thickness therebetween such that the thickness is constant between the first and fourth tangency points.", "3 . The vehicle wheel of claim 1 , wherein the transition portion has an outer surface and an inner surface defining a thickness therebetween such that the thickness of at least a portion of the transition portion varies between the first and fourth tangency points.", "4 . The vehicle wheel of claim 3 , wherein the at least a portion of the transition portion has a thinning between about 7% to about 30% the thickness of the well flank.", "5 . The vehicle wheel of claim 3 , wherein an outboard side of the outboard groove adjacent the first tangency point has a greater thickness than an inboard side of the outboard groove adjacent the second tangency point.", "6 . The vehicle wheel of claim 3 , wherein the ridge has a constant thickness between the second and third tangency points.", "7 . The vehicle wheel of claim 3 , wherein an inboard side of the inboard groove adjacent the fourth tangency point has a greater thickness than an outboard side of the inboard groove adjacent the third tangency point.", "8 . The vehicle wheel of claim 1 , wherein the outboard groove has an arcuate shape defined by a first radius.", "9 . The vehicle wheel of claim 8 , wherein the ridge has an arcuate shape defined by a second radius.", "10 . The vehicle wheel of claim 9 , wherein the inboard groove has an arcuate shape defined by a third radius.", "11 . The vehicle wheel of claim 10 , wherein the first radius is greater than either of the second and third radii.", "12 . The vehicle wheel of claim 11 , wherein the first radius is at least twice as greater than the second radius.", "13 . The vehicle wheel of claim 10 , wherein the second radius is greater than the third radius.", "14 . The vehicle wheel of claim 1 , wherein the rim includes an inboard bead seat retaining flange connected to the inboard bead seat.", "15 . The vehicle wheel of claim 14 , wherein the rim includes an outboard bead seat retaining flange connected to the outboard bead seat.", "16 . The vehicle wheel of claim 15 , wherein the wheel is a bead seat wheel such that the wheel disc is secured to the rim at the outboard beat seat.", "17 . The vehicle wheel of claim 15 , wherein the wheel is drop center wheel such that the wheel disc is secured to the rim at the outboard groove.", "18 . The vehicle wheel of claim 14 , wherein the wheel is a full face wheel such that the wheel disc includes an outboard bead seat retaining flange integrally formed therein, and wherein the wheel disc is connected to the rim at the outboard bead seat.", "19 . The vehicle wheel of claim 1 , wherein the rim is produced by forming a metallic blank.", "20 . The vehicle wheel of claim 19 , wherein the metallic blank is a steel blank.", "21 . The vehicle wheel of claim 20 , wherein the rim is formed into a final desired shape by a flow forming process.", "22 . The vehicle wheel of claim 21 , wherein the wheel disc is produced by forming a metallic blank by a flow forming process.", "an outboard bead seat; an inboard bead seat; an annular well flank connected to the outboard bead seat and extending radially inwardly and towards the inboard side of the rim; and a transition portion defined between the well flank and the inboard bead seat, wherein the transition portion has a circumferential corrugated profile having: a circumferentially concave-shaped outboard groove connected to the well flank at a first tangency point, wherein the outboard groove defines the inner-most radial dimension of the rim; a circumferentially convex-shaped ridge directly connected to the outboard groove at a second tangency point; and a circumferentially concave-shaped inboard groove directly connected to the ridge at a third tangency point, and wherein the inboard groove is connected to the inboard bead seat at a fourth tangency point.", "providing an annular rim defining an axis and inboard and outboard sides, the rim including: an outboard bead seat; an inboard bead seat; an annular well flank connected to the outboard bead seat and extending radially inwardly and towards the inboard side of the rim; and a transition portion defined between the well flank and the inboard bead seat, wherein the transition portion is produced by a flow forming process has a circumferential corrugated profile having: a circumferentially concave-shaped outboard groove connected to the well flank at a first tangency point, wherein the outboard groove defines the inner-most radial dimension of the rim; a circumferentially convex-shaped ridge directly connected to the outboard groove at a second tangency point; and a circumferentially concave-shaped inboard groove directly connected to the ridge at a third tangency point, and wherein the inboard groove is connected to the inboard bead seat at a fourth tangency point; and securing a wheel disc to the rim to produce the vehicle wheel, wherein the wheel disc includes a hub located centrally within the wheel disc and having a plurality of bolt holes formed therein."], "bibtex": "@patent{20240375433,\n    title = {VEHICLE WHEEL RIM, VEHICLE WHEEL INCLUDING SUCH A WHEEL RIM AND METHOD FOR PRODUCING SUCH A WHEEL RIM AND VEHICLE WHEEL},\n    number = {20240375433},\n    year = {2024},\n    note = {File: US20240375433A1-20241114.XML}\n    }", "classification": "B60B2110FI"}, {"title": "WHEEL HUB SYSTEM", "doc_number": "20240375434", "filename": "US20240375434A1-20241114.XML", "abstract": "A wheel hub assembly is presented by this disclosure. In one exemplary embodiment, a wheel hub apparatus includes a wheel assembly having front and back bushing plate assemblies. Each bushing plate assembly includes a cover plate attached to a bushing structure. Further, the bushing structure includes an axel aperture, positioning ridges, semi-circular notches, and bolt apertures. Each semi-circular notch corresponds to one of the bolt apertures and is configured to receive and position a bolt in that bolt aperture so that the corresponding bushing plate assembly is rotationally secured to that bolt. The apparatus further includes a wheel hub having front and back wheel hub assemblies and configured to secure a tire. Also, each wheel hub assembly includes a flanged portion forming a cavity with a wheel assembly seat positioned at the center of the cavity and configured to receive the corresponding wheel assembly.", "detailed_description": [""], "claims": ["a wheel assembly having front and back bushing plate assemblies, with each bushing plate assembly having a cover plate attached to a bushing structure, with the bushing structure having an axel aperture, positioning ridges, semi-circular notches, and bolt apertures, with each semi-circular notch corresponding to one of the bolt apertures and being configured to receive and position a bolt in that bolt aperture so that the corresponding bushing plate assembly is rotationally secured to that bolt; a wheel hub having front and back wheel hub assemblies and configured to secure a tire, with each wheel hub assembly having a flanged portion forming a cavity with a wheel assembly seat positioned at a center of the cavity and configured to receive the corresponding wheel assembly, the seat having an axel aperture disposed at the center of the cavity, arms that radially extend from the seat to a surface of the cavity, and bolt apertures circumferentially disposed about the seat, with each arm having a positioning notch circumferentially positioned about the seat; and wherein each bushing plate assembly is configured to be disposed in the seat of the corresponding wheel hub assembly with the positioning notches of that wheel hub assembly being adjoined with and rotationally secured to the positioning ridges of that bushing plate assembly such that the bolt and axle apertures of the bushing plate assemblies and the wheel hub assemblies align so as to enable a bolt to be inserted through those bolt apertures to secure the wheel hub system.", "2 . The apparatus of claim 1 , wherein the bushing structure has two semi-circular notches and each bushing plate assembly and wheel hub assembly has four bolt apertures.", "3 . The apparatus of claim 1 , wherein the wheel hub system is configured to insert an axel through the corresponding axle apertures of the bushing plate assemblies and the wheel hub assemblies.", "4 . The apparatus of claim 1 , wherein a nut is secured onto an end of each inserted bolt.", "5 . The apparatus of claim 1 , wherein the wheel hub system is configured to insert an axle through the axle apertures of the bushing plate assemblies and the wheel hub assemblies so as to facilitate rotation of the wheel hub about the axle.", "6 . The apparatus of claim 1 , wherein the wheel hub system is configured to position the front and back wheel hub assemblies at opposing sides of a tire aperture so as to secure the tire to the hub system.", "7 . The apparatus of claim 1 , wherein the wheel hub system is configured to position the front and back wheel hub assemblies at opposing sides of a tire aperture so that the front and back wheel hub assemblies are rotationally offset by ninety degrees.", "8 . The apparatus of claim 1 , wherein the tire is an inflatable rubber tire.", "9 . The apparatus of claim 8 , wherein the tire has a width of at least five inches.", "inserting a bolt through corresponding bolt apertures of the bushing plate assemblies and the wheel hub assemblies of the apparatus of claims", "a tire having a tire aperture; a wheel assembly having front and back bushing plate assemblies, with each bushing plate assembly having a cover plate attached to a bushing structure, with the bushing structure having an axel aperture, positioning ridges, semi-circular notches, and bolt apertures, with each semi-circular notch corresponding to one of the bolt apertures and being configured to receive and position a bolt in that bolt aperture so that the corresponding bushing plate assembly is rotationally secured to that bolt; a wheel hub having front and back wheel hub assemblies and configured to secure the tire, with each wheel hub assembly having a flanged portion forming a cavity with a wheel assembly seat positioned at a center of the cavity and configured to receive the corresponding wheel assembly, the seat having an axel aperture disposed at the center of the cavity, arms that radially extend from the seat to a surface of the cavity, and bolt apertures circumferentially disposed about the seat, with each arm having a positioning notch circumferentially positioned about the seat; and wherein each bushing plate assembly is configured to be disposed in the seat of the corresponding wheel hub assembly with the positioning notches of that wheel hub assembly being adjoined with and rotationally secured to the positioning ridges of that bushing plate assembly such that the bolt and axle apertures of the bushing plate assemblies and the wheel hub assemblies align so as to enable a bolt to be inserted through those bolt apertures to secure the wheel hub system.", "12 . The system of claim 11 , wherein the bushing structure has two semi-circular notches and each bushing plate assembly and wheel hub assembly has four bolt apertures.", "13 . The system of claim 11 , wherein the system is configured to insert an axel through the corresponding axle apertures of the bushing plate assemblies and the wheel hub assemblies.", "14 . The system of claim 11 , wherein a nut is secured onto an end of each inserted bolt.", "15 . The system of claim 11 , wherein the system is configured to insert an axle through the axle apertures of the bushing plate assemblies and the wheel hub assemblies so as to facilitate rotation of the wheel hub about the axle.", "16 . The system of claim 11 , wherein the system is configured to position the front and back wheel hub assemblies at opposing sides of the tire aperture so as to secure the tire to the hub system.", "17 . The system of claim 11 , wherein the system is configured to position the front and back wheel hub assemblies at opposing sides of the tire aperture so that the front and back wheel hub assemblies are rotationally offset by ninety degrees.", "18 . The system of claim 11 , wherein the tire is an inflatable rubber tire.", "19 . The system of claim 18 , wherein the tire has a width of at least five inches."], "bibtex": "@patent{20240375434,\n    title = {WHEEL HUB SYSTEM},\n    number = {20240375434},\n    year = {2024},\n    note = {File: US20240375434A1-20241114.XML}\n    }", "classification": "B60B2706FI"}, {"title": "MULTI-PEDAL-CONTROLLED CASTER AND METHOD FOR USING CASTER", "doc_number": "20240375435", "filename": "US20240375435A1-20241114.XML", "abstract": "A multi-pedal-controlled caster and a method for using the caster are provided. The multi-pedal-controlled caster includes a main body support, a connecting rod, an orientation mechanism, a braking mechanism, a reset mechanism, a first inner tooth member, a second inner tooth member, a pair of wheel members and three elastic members, where the main body support is relatively rotatable and is combined with the connecting rod, and the first inner tooth member and the second inner tooth member are fixedly mounted on the connecting rod. A multifunctional pedal is treaded to push a first warping plate to make the first warping plate clamped into a first recess portion of the first inner tooth member, so that the caster can run in an orientated manner; and the multifunctional pedal is treaded again to push an auxiliary braking member.", "detailed_description": ["A caster of the present invention is of a structure as shown inFIG.1toFIG.7, including:a main body support10, a connecting rod20, an orientation mechanism30, a braking mechanism40, a reset mechanism50, a pair of wheel members60and three elastic members70,where the main body support10has two positioning surfaces11and12, the main body support10is relatively rotatably connected and combined with the connecting rod20, one end of the connecting rod20extends into the main body support10, the end of the connecting rod20that extends into the main body support10is fixedly sleeved with a first inner tooth member21and a second inner tooth member22, a first recess portion211is formed in the first inner tooth member21, a second recess portion221is formed in the second inner tooth member22, and the upper end of the connecting rod20may be connected to the lower portion of a cart and a wheelchair.", "", "The first inner tooth member21and the second inner tooth member22may be in the shape of a round cover, the first inner tooth member21and the second inner tooth member22are arranged away from each other, rectangular penetrating holes are formed in the centers of the first inner tooth member21and the second inner tooth member22, the rectangular penetrating holes are sleeved on the connecting rod to realizing fixing of the first inner tooth member21and the second inner tooth member22relative to the connecting rod in a circumferential direction, the first inner tooth member21may be provided with two first recess portions211in the circumferential direction, and the second inner tooth member22may be provided with a plurality of second recess portions221in the circumferential direction, so as to form a serrated shape.", "", "The orientation mechanism30includes a multifunctional pedal31and a first warping plate32, one end of the multifunctional pedal31has a treading portion311, a first pushing portion312and a first abutting portion313are formed at the other end of the multifunctional pedal31, a third pivot member35is further included, and the multifunctional pedal31is pivoted to the main body support10by means of the third pivot member35.", "", "The first warping plate32is pivoted to the main body support10by means of a first pivot member34, one end of the first warping plate32is a first abutted portion321, a first clamping portion322is formed at the other end of the first warping plate32, the first pushing portion312of the multifunctional pedal31abuts against the first abutted portion321, the first clamping portion322faces the first recess211of the first inner tooth member21, when the first warping plate32swings, the first clamping portion322is clamped into or separated from the first recess portion211, and preferably, a second elastic member72is arranged on the first pivot member34of the first warping plate32such that a force can be applied to the first warping plate32by means of the elasticity of the second elastic member72when the first warping plate32resets.", "", "The braking mechanism40includes the multifunctional pedal31, an auxiliary braking member41and a second warping plate42, one end of the auxiliary braking member41has a third abutted portion411, and the third abutted portion411abuts against a third abutting portion315of the multifunctional pedal31; a second abutting portion413is formed on one side of the other end of the auxiliary braking member41, the auxiliary braking member41has a second pushing portion412located and formed on the other side of the second abutting portion413, and the auxiliary braking member41and the multifunctional pedal31are coaxial and are pivoted to the main body support10by means of the third pivot member35.", "", "The second warping plate42is also pivoted to the main body support10by means of the first pivot member34, a second abutted portion421is formed at one end of the second warping plate42, the second pushing portion412of the auxiliary braking member41abuts against the second abutted portion421, a second clamping portion422is formed at the other end of the second warping plate42, the second clamping portion422faces the second recess221of the second inner tooth member22, when the second warping plate42swings, the second clamping portion422is clamped into or separated from the second recess portion221, and each of two sides of the second warping plate42extends to form a third clamping portion423.", "", "The reset mechanism50includes an oriented reset pedal51and a brake releasing reset pedal52which are arranged side by side, the two reset pedals of the reset mechanism50are coaxial and are pivoted to the main body support10by means of a second pivot member53, a reset treading portion511and521is respectively arranged at one end of each of the two reset pedals, a fourth abutting portion512is formed at the other end of the oriented reset pedal51, a fifth abutting portion522is formed at the other end of the brake releasing reset pedal52, the fourth abutting portion512and the fifth abutting portion522face and push the first abutting portion313and the second abutting portion413until a limiting portion314of the multifunctional pedal31and a limiting portion414of the auxiliary braking member41abut against the positioning surfaces11and12of the main body support10, and penetrating grooves513and penetrating grooves523are formed on two sides of the oriented reset pedal51and the brake releasing reset pedal52respectively.", "", "The second elastic member72is further includes, one end of the second elastic member72has a sleeving portion721, each of two sides of the sleeving portion721extends to form a penetrating portion722, the other end of the second elastic member72is a limiting portion723, the sleeving portion721of the second elastic member72is sleeved on the second pivot member53, the penetrating portions722respectively penetrate into the penetrating grooves513and the penetrating grooves523on the two sides of the oriented reset pedal51and the brake releasing reset pedal52, the limiting portion723abuts above the first abutted portion321of the first warping plate32in a normal state, and an abutting force of the limiting portion723make each of the oriented reset pedal51, the brake releasing reset pedal52and the first warping plate32obtain a support force so as to keep the three balanced and not loosened.", "", "The pair of wheel members60is pivoted to two sides of the main body support10, the pair of wheel members60includes a first side wheel61and a second side wheel62, a limiting gear63is formed on each of the sides of the first side wheel61and the second side wheel62that face each other, the limiting gear63has a plurality of tooth grooves631, the third clamping portions423of the second warping plate42face the plurality of tooth grooves631, and when the second warping plate42swings to different positions, the third clamping portions423are buckled into the tooth grooves631, or the third clamping portions423are separated from the tooth grooves631.", "", "Preferably, a first elastic member71is further included, the first elastic member71is fixed to the first pivot member34in a sleeving manner, one end of the first elastic member71fixedly abuts against the second warping plate42, and the other end abuts against the fourth pivot member54, so that the second warping plate42can move and reset more smoothly by means of the elasticity of the first elastic member71during movement.", "", "The pivot members may be articulated shafts, and the elastic members may be torsional springs.", "", "Preferably, a bottom decorative cover80is further included, the bottom decorative cover80is locked to the main body support10, and the bottom decorative cover80is configured to prevent foreign matter from entering the main body support10.", "", "The third elastic member73is sleeved on a steel sleeve33, the third pivot member35penetrates through the steel sleeve33, and a round hole316allowing the steel sleeve33to penetrate through is formed in the multifunctional pedal; a penetrating hole416is formed in one side of the second pushing portion of the auxiliary braking member, the penetrating hole is configured to be sleeved on the third pivot member35, an annular groove417is formed in one side of the penetrating hole, and the annular groove417facilitates sleeving of the penetrating hole on the multifunctional pedal, thereby ensuring that the auxiliary braking member and the multifunctional pedal rotate around the same pivot member; the auxiliary braking member has an L-shaped main section; the connecting rod20is sleeved with a bearing14rotatably connected to the main body support10, and the bearing is limited and sealed by means of a sealing ring15; two connecting plates325arranged at an interval are arranged at the lower portion of the first warping plate, through holes324are formed in the connecting plates, channels425allowing the two connecting plates325to penetrate into are formed in the second warping plate, hole channels424are formed in walls on two sides of the channels425, and the first pivot member34penetrates through the through holes324and the hole channels424; and penetrating holes514,524allowing the second pivot member53to penetrate through are formed in the oriented reset pedal51and the brake releasing reset pedal52respectively.", "", "The structure of the caster of the present invention is as shown inFIG.10toFIG.14during movement; as shown inFIG.10, when a user wants to orient the caster such that the caster will not rotate at will, the user treads on the treading portion311of the multifunctional pedal31firstly to make the multifunctional pedal31rotate in a treading direction with the third pivot member35serving as a pivot, the first pushing portion312and the first abutting portion313of the multifunctional pedal31also rotate in the same direction, and the first pushing portion312abuts against the first abutted portion321of the first warping plate32in a normal state, so that the first pushing portion312pushes the first abutted portion321while rotation to make the first warping plate32rotate with the first pivot member34serving as a pivot, and the first clamping portion322of the first warping plate32also synchronously rotates and is clamped into the first recess portion211of the first inner tooth member21; the first clamping portion322of the first warping plate32is clamped in the first recess portion211, and the first warping plate32is pivoted to the main body support10by means of the first pivot member34, so that when the first clamping portion322of the first warping plate32is clamped in the first recess portion211, the main body support10cannot rotate relative to the connecting rod20, and thereby achieving the orientation purpose.", "", "Meanwhile, the first abutting portion313rotates to abut against the fourth abutting portion512of the oriented reset pedal51to make the oriented reset pedal51rotate in a pushing direction with the second pivot member53serving as a pivot and to make the oriented reset pedal51in a treading state, as shown inFIG.11.", "", "As shown inFIG.12, when the user wants to orient and brake the pair of wheel members60at the same time, as shown inFIG.11, the user continuously treads on the treading portion311of the multifunctional pedal31firstly to make the multifunctional pedal31rotate continuously in a treading direction with the third pivot member35serving as a pivot until the third abutting portion315of the multifunctional pedal31abuts against the third abutted portion411of the auxiliary braking member41, the second pushing portion412and the second abutting portion413of the auxiliary braking member41also rotate in the same direction, and the second pushing portion412abuts against the second abutted portion421of the second warping plate42, so that the second pushing portion412pushes the second abutted portion421while rotation to make the second warping plate42rotate with the first pivot member34serving as the pivot, the second clamping portion422of the second warping plate42also synchronously rotates and is clamped into the second recess portion221of the second inner tooth member22, and the third clamping portions423of the second warping plate42also synchronously rotates and are clamped into clamping grooves631of the limiting gears63of the pair of wheel members60.", "", "Meanwhile, the second abutting portion413rotates to abut against the third abutting portion522of the brake releasing reset pedal52to make the brake releasing reset pedal52rotate in a pushing direction with the second pivot member53serving as the pivot and to make the brake releasing reset pedal52in a treading state (as shown inFIG.12).", "", "The third elastic member73is further included; one end of the third elastic member73has a sleeving portion731, two sides of the sleeving portion731extend to form two limiting portions732and733respectively, the limiting portion732abuts below the second warping plate42, and the limiting portion733abuts in a clamping groove318of the multifunctional pedal31; the treading portion311of the multifunctional pedal31is loosened, under the action of the elasticity of the third elastic member73, the multifunctional pedal31rotates in a direction opposite to the treading direction with the third pivot member35serving as a pivot, and the first pushing portion312of the multifunctional pedal31abuts against the second abutted portion323of the first warping plate32, so that the first pushing portion312pushes the second abutted portion323while rotation to make the first warping plate32rotate with the first pivot member34serving as a pivot until the first pushing portion312abuts against the first abutted portion321of the first warping plate32again; and at this moment, as shown inFIG.13, the first abutting portion313of the multifunctional pedal31rotates to return to abut against the fourth abutting portion512of the oriented reset pedal51to make the oriented reset pedal51rotate in a pushing direction with the second pivot member53serving as a pivot and to make the oriented reset pedal51also in a treading state.", "", "The second clamping portion422of the second warping plate42is clamped in the second recess portion221, and the second warping plate42is pivoted to the main body support10by means of the first pivot member34, so that when the second clamping portion422of the second warping plate42is clamped in the second recess portion221, the main body support10cannot rotate relative to the connecting rod20.", "", "The third clamping portions423of the second warping plate42also synchronously rotate and are clamped into the clamping grooves631of the limiting gears63of the pair of wheel members60, so that the limiting gears63of the pair of wheel members are clamped by the third clamping portions423, then the pair of wheel members60cannot rotate, and thereby achieving the orientation and braking purposes at the same time.", "", "As shown inFIG.14andFIG.10, when the user wants to release the orientation state, the braking state or the orientation and braking state, the oriented reset pedal51and the brake releasing reset pedal52are in the treading state at this moment, so that the treading portion511of the oriented reset pedal51or/and the treading portion521of the brake releasing reset pedal52is/are treaded firstly to make the oriented reset pedal51or/and the brake releasing reset pedal52rotate in a treading direction with the third pivot member35serving as a pivot, and the fourth abutting portion512of the oriented reset pedal51or/and the fifth abutting portion522the brake releasing reset pedal52also rotate in the same direction to push the first pushing portion312and the second abutting portion313of the multifunctional pedal31or/and the second abutting portion413of the auxiliary braking member41to make the multifunctional pedal31or/and the auxiliary braking member41rotate in a pushing direction with the third pivot member35serving as a pivot.", "", "The first pushing portion312rotates synchronously while the multifunctional pedal31rotates, so that the first abutted portion321of the first warping plate32loses the pushing force and then rotates to reset; and the first clamping portion322of the first warping plate32is separated from the first recess portion211of the first inner tooth member21, the first clamping portion322is not clamped by the first recess portion211, and then the main body support10can rotate.", "", "The second pushing portion412rotates synchronously while the auxiliary braking member41rotates, so that the second abutted portion421of the second warping plate42loses the pushing force and then rotates to reset; and the second clamping portion422of the second warping plate42is separated from the second recess221of the second inner tooth member22, the second clamping portion422is not clamped by the second recess portion221, at the same time, the third clamping portions423are separated from the tooth grooves631of the limiting gears63, then the main body support10can rotate, and the pair of wheel members60can rotate.", "", "As shown inFIG.10toFIG.14, the method for using the caster of the present invention includes:treading the multifunctional pedal311of the multifunctional pedal31to make the multifunctional pedal31rotate with the third pivot member35serving as a pivot, then pushing the first warping plate32to make the first warping plate32rotate synchronously, and then making the first clamping portion322of the first warping plate32clamped into the first recess portion211of the first inner tooth member21, so that the main body support10cannot rotate relative to the connecting rod20, thereby achieving the orientation purpose;continuously treading the treading portion311of the multifunctional pedal31to make the third abutting portion315of the multifunctional pedal31abut against the third abutted portion411of the auxiliary braking member41, making the auxiliary braking member41rotate with the third pivot member35serving as a pivot, then pushing the second warping plate42to make the second warping plate42rotate synchronously, and then making the second clamping portion422of the second warping plate42clamped into the second recess portion221of the second inner tooth member22and making the third clamping portions423of the second warping plate42clamped into the tooth grooves631of the limiting gears63, so that the pair of wheel members60cannot rotate, thereby achieving the braking function;treading the oriented reset pedal51or/and treading the brake releasing reset pedal52to make the oriented reset pedal51or/and the brake releasing reset pedal52rotate with the second pivot member53serving as a pivot, then pushing the multifunctional pedal31or/and the auxiliary braking member41to make the multifunctional pedal31or/and the auxiliary braking member41reset, then making the first clamping portion322of the first warping plate32separated from the first recess portion211, or/and making the second clamping portion422of the second warping plate42separated from the second recess portion221, and making the third clamping portions423of the second warping plate42separated from the tooth grooves631of the limiting gears63, thereby returning to the oriented or full free state.", "", "It can be seen from the above that in the present invention, the multifunctional pedal31of the orientation mechanism30is treaded to push the first warping plate32to make the first warping plate32clamped into the first recess portion211of the first inner tooth member21, so that the caster can run in an orientated manner; the multifunctional pedal31is treaded again to push the auxiliary braking member41of the braking mechanism, and then the second warping plate42is pushed to make the second clamping portion422of the second warping plate42clamped into the second recess portion221of the second inner tooth member22and to make the third clamping portions423of the second warping plate42clamped into the limiting gears63of the pair of wheel members60, so that the caster can be orientated and braked; then the oriented reset pedal or/and the brake releasing reset pedal is/are treaded to reset to the orientated or full free state, and thus the caster can perform the steering, orientation and braking functions."], "claims": ["a main body support, a connecting rod, an orientation mechanism, a braking mechanism, a reset mechanism, a pair of wheel members and three elastic members, wherein the main body support is relatively rotatably connected and combined with the connecting rod, an end of the connecting rod extends into the main body support, the end, extending into the main body support, of the connecting rod t is fixedly sleeved with a first inner tooth member and a second inner tooth member, a first recess portion is formed in the first inner tooth member, and a second recess portion is formed in the second inner tooth member; the orientation mechanism comprises a multifunctional pedal and a first warping plate, a first of the multifunctional pedal has a treading portion, and a first pushing portion and a first abutting portion are formed at a second end of the multifunctional pedal; a first end of the first warping plate is a first abutted portion, a first clamping portion is formed at a second end of the first warping plate, the first pushing portion of the multifunctional pedal abuts against the first abutted portion, the first clamping portion faces the first recess portion of the first inner tooth member, and when the first warping plate swings, the first clamping portion is clamped into or separated from the first recess portion; the braking mechanism comprises the multifunctional pedal, an auxiliary braking member and a second warping plate, a first end of the auxiliary braking member has a third abutted portion, and the third abutted portion abuts against a third abutting portion of the multifunctional pedal; a second abutting portion is formed on one side of a second end of the auxiliary braking member, the auxiliary braking member has a second pushing portion located and formed on the other side of the second abutting portion, and the auxiliary braking member and the multifunctional pedal are coaxial and are pivoted to the main body support by means of a third pivot member; a second abutted portion is formed at a first end of the second warping plate, the second pushing portion of the auxiliary braking member abuts against the second abutted portion, a second clamping portion is formed at a second end of the second warping plate, the second clamping portion faces the second recess portion of the second inner tooth member, when the second warping plate swings, the second clamping portion is clamped into or separated from the second recess portion, and each of two sides of the second warping plate extends to form a third clamping portion; the reset mechanism comprises an oriented reset pedal and a brake releasing reset pedal, wherein the oriented reset pedal and the brake releasing reset pedal are arranged side by side, the oriented reset pedal and the brake releasing reset pedal of the reset mechanism are coaxial and are pivoted to the main body support by means of a second pivot member, a reset treading portion is arranged at a first end of each of the oriented reset pedal and the brake releasing reset pedal, a fourth abutting portion is formed at a second end of the oriented reset pedal, a fifth abutting portion is formed at a second end of the brake releasing reset pedal, and the fourth abutting portion and the fifth abutting portion face and push the first abutting portion and the second abutting portion; the pair of wheel members comprises a first side wheel and a second side wheel, a limiting gear is formed on each of sides of the first side wheel and the second side wheel, wherein the sides face each other, the limiting gear has a plurality of tooth grooves, the third clamping portions of the second warping plate face the plurality of tooth grooves, and when the second warping plate swings to different positions, the third clamping portions are buckled into the plurality of tooth grooves, or the third clamping portions are separated from the plurality of tooth grooves; and the three elastic members comprises a first elastic member, a second elastic member and a third elastic member, the first elastic member is coaxial with the first warping plate and the second warping plate, and one end of the first elastic member abuts against the second warping plate; the second elastic member is coaxial with the oriented reset pedal and the brake releasing reset pedal, a first end of the second elastic member penetrates through the oriented reset pedal and the brake releasing reset pedal respectively, and a second end of the second elastic member abuts against the first warping plate; and the third elastic member penetrates through the coaxial multifunctional pedal and auxiliary braking member, a first end of the third elastic member abuts against the multifunctional pedal, and a second end of the third elastic member abuts below the second warping plate.", "wherein the first warping plate, the second warping plate and the first elastic member are pivoted to the main body support by means of the first pivot member, the multifunctional pedal, the third elastic member penetrating through the multifunctional pedal, and the auxiliary braking member are pivoted to the main body support by means of the third pivot member, the oriented reset pedal, the brake releasing reset pedal and the second elastic member are pivoted to the main body support by means of the second pivot member, and the fourth pivot member is configured to abut against a second end of the first elastic member and is pivoted to the main body support.", "a first end of the second elastic member has a first sleeving portion, each of two sides of the first sleeving portion extends to form a penetrating portion, a second end of the second elastic member is a first limiting portion, the first sleeving portion of the second elastic member is sleeved on the second pivot member, the penetrating portions respectively penetrate into first penetrating grooves and second penetrating grooves on two sides of the oriented reset pedal and the brake releasing reset pedal, the first limiting portion abuts above the first abutted portion of the first warping plate in a normal state, and an abutting force of the first limiting portion make each of the oriented reset pedal, the brake releasing reset pedal and the first warping plate obtain a support force; and one end of the third elastic member has a second sleeving portion sleeved on the third pivot member, two sides of the second sleeving portion extend to form second and third limiting portions respectively, the second limiting portion abuts below the second warping plate, and the third limiting portion abuts in a clamping groove of the multifunctional pedal.", "4 . The multi-pedal-controlled caster according to claim 1 , wherein the third elastic member is sleeved on a steel sleeve, the third pivot member penetrates through the steel sleeve, and a round hole allowing the steel sleeve to penetrate through is formed in the multifunctional pedal.", "5 . The multi-pedal-controlled caster according to claim 1 , wherein a penetrating hole is formed in one side of the second pushing portion of the auxiliary braking member, the penetrating hole is configured to be sleeved on the third pivot member, an annular groove is formed in one side of the penetrating hole, and the annular groove facilitates sleeving of the penetrating hole on the multifunctional pedal, thereby ensuring that the auxiliary braking member and the multifunctional pedal rotate around the same pivot member; and the auxiliary braking member has an L-shaped main section.", "6 . The multi-pedal-controlled caster according to claim 1 , wherein the main body support has two positioning surfaces, wherein the two positioning surfaces allow a limiting portion of the multifunctional pedal and a limiting portion of the auxiliary braking member to abut against.", "7 . The multi-pedal-controlled caster according to claim 1 , wherein the first inner tooth member and the second inner tooth member are in a shape of a round cover, the first inner tooth member and the second inner tooth member are arranged away from each other, rectangular penetrating holes are formed in centers of the first inner tooth member and the second inner tooth member, the rectangular penetrating holes are sleeved on the connecting rod to realizing fixing of the first inner tooth member and the second inner tooth member relative to the connecting rod in a circumferential direction, the first inner tooth member is provided with two first recess portions in the circumferential direction, and the second inner tooth member is provided with a plurality of second recess portions in the circumferential direction, to form a serrated shape.", "8 . The multi-pedal-controlled caster according to claim 1 , wherein the multi-pedal-controlled caster further comprises a bottom decorative cover, wherein the bottom decorative cover is locked at a bottom of the main body support.", "two connecting plates arranged at an interval are arranged at a lower portion of the first warping plate, through holes are formed in the two connecting plates, channels allowing the two connecting plates to penetrate into are formed in the second warping plate, hole channels are formed in walls on two sides of the channels, and a first pivot member penetrates through the through holes and the hole channels; and penetrating holes allowing the second pivot member to penetrate through are formed in the oriented reset pedal and the brake releasing reset pedal respectively.", "realizing an orientation function: treading the multifunctional pedal to make the multifunctional pedal rotate with the third pivot member serving as a pivot, pushing the first warping plate to make the first warping plate rotate synchronously, and making the first clamping portion of the first warping plate clamped into the first recess portion of the first inner tooth member; realizing a braking function: treading the multifunctional pedal to make the multifunctional pedal rotate with the third pivot member serving as the pivot, pushing the auxiliary braking member to make the auxiliary braking member rotate synchronously with the third pivot member serving as the pivot, further pushing the second warping plate to make the second warping plate rotate synchronously, and making the second clamping portion of the second warping plate clamped into the second recess portion of the second inner tooth member and making the third clamping portions of the second warping plate clamped into the plurality of tooth grooves of the limiting gears; disabling the orientation function: after the orientation function is realized, treading the oriented reset pedal to make the oriented reset pedal rotate with the second pivot member serving as a pivot, pushing the oriented reset pedal and the multifunctional pedal to make the oriented reset pedal and the multifunctional pedal reset, and making the first clamping portion of the first warping plate separated from the first recess portion; disabling the braking function: after the braking function is realized, treading the brake releasing reset pedal to make the brake releasing reset pedal rotate with the second pivot member serving as the pivot, pushing the brake releasing reset pedal and the auxiliary braking member to make the brake releasing reset pedal and the auxiliary braking member reset, making the second clamping portion of the second warping plate separated from the second recess portion, at the same time, making the third clamping portions of the second warping plate separated from the plurality of tooth grooves of the limiting gears, at this moment, only releasing braking by this operation, and still keeping the orientation function for the multi-pedal-controlled caster; and realizing a unified reset function: after the braking function is realized, treading the oriented reset pedal and the brake releasing reset pedal at the same time to make the oriented reset pedal and the brake releasing reset pedal rotate with the second pivot member serving as the pivot, pushing the oriented reset pedal, the multifunctional pedal, the brake releasing reset pedal and the auxiliary braking member to make the oriented reset pedal, the multifunctional pedal reset, the brake releasing reset pedal and the auxiliary braking member reset, making the first clamping portion of the first warping plate separated from the first recess portion, and at the same time, making the second clamping portion of the second warping plate separated from the second recess portion, and further making the third clamping portions of the second warping plate separated from the plurality of tooth grooves of the limiting gears.", "11 . The multi-pedal-controlled caster according to claim 2 , wherein the third elastic member is sleeved on a steel sleeve, the third pivot member penetrates through the steel sleeve, and a round hole allowing the steel sleeve to penetrate through is formed in the multifunctional pedal.", "12 . The multi-pedal-controlled caster according to claim 3 , wherein the third elastic member is sleeved on a steel sleeve, the third pivot member penetrates through the steel sleeve, and a round hole allowing the steel sleeve to penetrate through is formed in the multifunctional pedal.", "13 . The multi-pedal-controlled caster according to claim 2 , wherein a penetrating hole is formed in one side of the second pushing portion of the auxiliary braking member, the penetrating hole is configured to be sleeved on the third pivot member, an annular groove is formed in one side of the penetrating hole, and the annular groove facilitates sleeving of the penetrating hole on the multifunctional pedal, thereby ensuring that the auxiliary braking member and the multifunctional pedal rotate around the same pivot member; and the auxiliary braking member has an L-shaped main section.", "14 . The multi-pedal-controlled caster according to claim 3 , wherein a penetrating hole is formed in one side of the second pushing portion of the auxiliary braking member, the penetrating hole is configured to be sleeved on the third pivot member, an annular groove is formed in one side of the penetrating hole, and the annular groove facilitates sleeving of the penetrating hole on the multifunctional pedal, thereby ensuring that the auxiliary braking member and the multifunctional pedal rotate around the same pivot member; and the auxiliary braking member has an L-shaped main section.", "15 . The multi-pedal-controlled caster according to claim 2 , wherein the main body support has two positioning surfaces, wherein the two positioning surfaces allow a limiting portion of the multifunctional pedal and a limiting portion of the auxiliary braking member to abut against.", "16 . The multi-pedal-controlled caster according to claim 3 , wherein the main body support has two positioning surfaces, wherein the two positioning surfaces allow a limiting portion of the multifunctional pedal and a limiting portion of the auxiliary braking member to abut against.", "17 . The multi-pedal-controlled caster according to claim 2 , wherein the first inner tooth member and the second inner tooth member are in a shape of a round cover, the first inner tooth member and the second inner tooth member are arranged away from each other, rectangular penetrating holes are formed in centers of the first inner tooth member and the second inner tooth member, the rectangular penetrating holes are sleeved on the connecting rod to realizing fixing of the first inner tooth member and the second inner tooth member relative to the connecting rod in a circumferential direction, the first inner tooth member is provided with two first recess portions in the circumferential direction, and the second inner tooth member is provided with a plurality of second recess portions in the circumferential direction, to form a serrated shape.", "18 . The multi-pedal-controlled caster according to claim 3 , wherein the first inner tooth member and the second inner tooth member are in a shape of a round cover, the first inner tooth member and the second inner tooth member are arranged away from each other, rectangular penetrating holes are formed in centers of the first inner tooth member and the second inner tooth member, the rectangular penetrating holes are sleeved on the connecting rod to realizing fixing of the first inner tooth member and the second inner tooth member relative to the connecting rod in a circumferential direction, the first inner tooth member is provided with two first recess portions in the circumferential direction, and the second inner tooth member is provided with a plurality of second recess portions in the circumferential direction, to form a serrated shape.", "19 . The multi-pedal-controlled caster according to claim 2 , wherein the multi-pedal-controlled caster further comprises a bottom decorative cover, wherein the bottom decorative cover is locked at a bottom of the main body support.", "20 . The multi-pedal-controlled caster according to claim 3 , wherein the multi-pedal-controlled caster further comprises a bottom decorative cover, wherein the bottom decorative cover is locked at a bottom of the main body support.", "two connecting plates arranged at an interval are arranged at a lower portion of the first warping plate, through holes are formed in the two connecting plates, channels allowing the two connecting plates to penetrate into are formed in the second warping plate, hole channels are formed in walls on two sides of the channels, and the first pivot member penetrates through the through holes and the hole channels; and penetrating holes allowing the second pivot member to penetrate through are formed in the oriented reset pedal and the brake releasing reset pedal respectively.", "two connecting plates arranged at an interval are arranged at a lower portion of the first warping plate, through holes are formed in the two connecting plates, channels allowing the two connecting plates to penetrate into are formed in the second warping plate, hole channels are formed in walls on two sides of the channels, and the first pivot member penetrates through the through holes and the hole channels; and penetrating holes allowing the second pivot member to penetrate through are formed in the oriented reset pedal and the brake releasing reset pedal respectively."], "bibtex": "@patent{20240375435,\n    title = {MULTI-PEDAL-CONTROLLED CASTER AND METHOD FOR USING CASTER},\n    number = {20240375435},\n    year = {2024},\n    note = {File: US20240375435A1-20241114.XML}\n    }", "classification": "B60B3302FI"}, {"title": "WORK VEHICLE WITH ELECTRICALLY LOCKING CASTER", "doc_number": "20240375436", "filename": "US20240375436A1-20241114.XML", "abstract": "A work vehicle has at least one caster wheel on an end of the work vehicle. In response to a caster locking signal sent via an electrical controller, a solenoid is electrically activated to reversibly move a locking pin in an axial direction, causing transitions between unlocking and locking states. In the unlocking state, the locking pin is pulled away from the engagement surface. In the locking state, the locking pin is pushed towards the pivoting support to engage the locking void when the pivoting support is oriented in a predetermined rotation angle.", "detailed_description": ["In the following detailed description of illustrative embodiments, reference is made to the accompanying figures of the drawing which form a part hereof. It is to be understood that other equivalent embodiments, which may not be described and/or illustrated herein, are also contemplated.", "", "The present disclosure relates generally to work vehicles that use a zero-turn wheel system, in which the vehicles have differentially driven rear wheels and freely rotatable front wheels, or casters. This allows the vehicle to have a tight turn radius zero when the wheels are driven in opposite directions. Zero-turn system are often used in ground care machines such as mowers. While specific embodiments below are shown and described as a mower, such a configuration is illustrative only. Systems and methods described herein may also have application to other work machines including, for example, debris blowers/vacuums/sweepers, aerators, dethatchers, material spreaders/sprayers, snow and ice treatment, weeding machines for weed remediation mobile watering/treating vehicles, indoor working vehicles such as vacuums and floor scrubbers/cleaners, construction and utility vehicles, observation vehicles, and load transportation (e.g., including people and things, such as people movers and hauling equipment). The embodiments herein may also be applicable to work machines with a non-zero turn configuration, e.g., machines that do not differentially steer the rear wheels.", "", "One issue with zero-turn mowers is navigating hills. The front caster wheels do not have much traction, which is beneficial for tight maneuvering in flat work areas, but can reduce stability on hills. The caster wheels can freely pivot, therefore have a tendency to align to the path of least resistance, which may not be the direction desired by the operator, e.g., when the mower is tilted from side-to-side on a slope. In this disclosure, methods and apparatuses are described that can facilitate manual or automatic locking of zero-turn caster wheels during operation, thereby improving stability in some situations such as navigating hills.", "", "InFIGS.1,2, and3, perspective views show details of a zero-turn work vehicle100according to one or more embodiments. As seen inFIG.1, the zero-turn work vehicle in this example is a walk behind mower, but the description ofFIG.1may be applicable to any work vehicle as described above. The zero-turn work vehicle includes two driven wheels102on a first end104of the work vehicle100(only one of the wheels102is seen in this view). A motor assembly106is coupled to rotate the two driven wheels102. The motor assembly106in this example includes an internal combustion engine (ICE) and associated components such as a fuel tank, transmission, etc. In other embodiments, the motor assembly106may include an electric motor and associated battery, power controller, etc.", "", "An electrical controller108is operable to send a caster locking signal. In this example the electrical controller108is a switch mounted on a handle110of the mower. In other embodiments, the electrical controller108may include different or additional components such as a sensor-driven controller that can send the caster locking signal in response to a sensor signal, e.g., vehicle tilt sensor. The electrical controller108may interact with other electrical devices that may enable or disable the caster locking signal, such as main power switch, dead man switch, etc.", "", "One or more caster wheels112are located on a second end114of the work vehicle100opposed to the first end104. The one or more caster wheels112are held by respective pivoting supports115rotatably coupled to a frame116of the work vehicle100. The rotation of the pivoting supports115may be described herein as a “steering rotation” to distinguish from a rolling rotation of the caster wheels112around their respective axes. While the caster wheels112do not actively steer the vehicle100, they do respond to differential steering inputs to the rear wheels102by changing their rotational angle to correspond to the steering angle. As will be described in detail below, the vehicle includes an electrically operable caster lock assembly that can lock the caster wheels112and pivoting supports115at a predetermined steering angle (e.g., aligned with longitudinal direction118) and prevent significant rotation away from that steering angle.", "", "Note that in this embodiment the driven wheels102are at the rear of the vehicle and the caster wheels112are at the front. However, the caster locking arrangements described below may be used in an opposite arrangement where front wheels are driven wheels and rear wheels are caster wheels. This may also be used in arrangements where the driven wheels are replaced with some other ground traversal mechanism such as treads.", "", "As best seen in the exploded view ofFIG.3, each pivoting support115has an engagement surface302and at least one locking void304extending through the engagement surface302. In this embodiment, the locking void304is configured as a locking slot having a major dimension312in a major direction314that extends radially from a rotational axis316of the pivoting support and a minor dimension318corresponding to a diameter319of a locking portion210aof the locking pin210. The major dimension312is larger than the minor dimension318. The rotational axis316corresponds to an axis of steering rotation as described above. By making the locking void304a slot, the assembly is less sensitive to misalignments between the locking pin210and the pivoting support115in the major direction314. The minor dimension318can be equal to the pin diameter319plus a clearance value to allow smooth engagement and disengagement while preventing excessive steering rotation of the caster wheel112when locked.", "", "Associated with each of the one or more caster wheels112is a solenoid202fixably mounted to the frame116of the work vehicle, e.g., via lock support member204and end bracket206. The solenoid202is electrically operable to reversibly move a plunger205in an axial direction308. The axial direction308is at a non-zero angle to the engagement surface302of the pivoting support115. The locking pin210may have an enlarged portion210bwith a hole211extending in the axial direction308that encompasses an end of the plunger205. The plunger205is slidably displaceable within the hole211by a predetermined free travel distance (see free travel distance406inFIG.4) before engaging the locking pin210. This is accomplished via a slot214in a wall of the hole of the enlarged portion210band a slot pin216attached to the solenoid plunger. The slot pin216extends into the slot214such that an elongated dimension of the slot214defines the free travel distance.", "", "The locking pin210is aligned with the locking void304in a predetermined rotation angle of the pivoting support115. Generally, the predetermined rotation angle results in the caster wheel112being aligned with a longitudinal axis118of the work vehicle100(seeFIG.1). As seen inFIG.2, a biasing member208(e.g., a coil spring) is between an enlarged portion210bof the locking pin210and a body203of the solenoid202. The biasing member208applies a force on the locking pin210in the axial direction308towards the locking void304. Also seen inFIG.2is a bushing212that is aligned with and encompasses the locking part210aof the locking pin210. The bushing212and the locking support member204minimize transmission of lateral forces from the pivoting support115to the plunger205. The biasing member208and bushing212are not shown inFIG.3to provide a clearer view of other components.", "", "In response to the caster locking signal, the solenoid202transitions from unlocking and locking states. In response to a repeat of the caster locking signal or in response to a caster unlocking signal, the solenoid202transitions from the locking to unlocking states. While these states are described in terms of solenoid activation, e.g., extension and retraction of the plunger205, unlocking and locking states also include states of other components, including the locking pin210, the biasing member208, and the pivoting support115. InFIGS.4-7, cross sectional views show operation of a caster locking mechanism according to an example embodiment.", "", "InFIG.4, the caster locking mechanism is shown in the unlocking state. This can be achieved by a solenoid unlocking signal404that causes the plunger205to be pulled upwards into the solenoid body203. The solenoid202in this example is a latching solenoid wherein the plunger205is magnetically held at the retracted and extended positions. Thus, the signal404only need be a momentary input of electrical current, e.g., as provided by a momentary contact switch. Note that the signal404is shown as a positive voltage pulse inFIG.4but could be a negative pulse in other embodiments.", "", "In the unlocking state, the slot pin216is engaged with a top part of the slot214such that the locking pin210is pulled toward the solenoid202and the biasing member208is compressed. This disengages the locking portion210aof the locking pin210from the locking void304, allowing the pivoting support115to rotate, indicated by side-to-side arrow405inFIG.4. InFIG.5, the pivoting support115is shown rotated away from the predetermined rotation angle, indicating that the caster wheel112is allowed to rotate (steer) freely in the unlocking state. Note that signal diagram502shows no input voltage to the solenoid202, as the internal locking mechanism of the solenoid202(e.g., magnet) can maintain the unlocking state without requiring continual application of electrical power.", "", "The diagram inFIG.6shows a transition from the unlocking state to the locking state. InFIG.6, the pivoting support115is shown oriented relative to the locking pin210the same as inFIG.5, such that the locking part210ais not aligned with the locking void304. A solenoid locking signal600is applied to the solenoid202to enter the locking state. The signal is 600 a negative pulse, which is inverse from the locking signal404seen inFIG.4, and as previously noted, the polarities of the signals may be reversed in other embodiments. The locking state pushes the locking pin210to extend towards the pivoting support115and engage the locking void304when the pivoting support115is oriented in the predetermined rotation angle as seen inFIG.7.", "", "As seen inFIG.6, when the plunger205moves downward, it moves the pin216to the bottom of the slot214, allowing the biasing member208to push the locking pin210towards the pivoting support115. Because the pivoting support115is not oriented in the predetermined rotation angle inFIG.6, the locking part210aof the locking pin210rides against the engagement surface302. This illustrates that in the locking state, the caster wheel112may not be locked unless and until the pivoting support115has become oriented in the predetermined rotation angle.", "", "Once the pivoting support115has become oriented in the predetermined rotation angle as seen inFIG.7(through movement indicated by arrow702), the biasing member208forces the locking part210athrough the locking void304and locks the pivoting support115, preventing free steering rotation of the caster wheel112. Note that signal diagram700shows no input voltage to the solenoid202, as the internal locking mechanism of the solenoid202(e.g., magnet) can maintain the locking state without requiring continual application of electrical power. The movement indicated by arrow702can be induced by the operator of the work vehicle, e.g., by steering from left to right and back again after initiating the locking state, in order to physically lock the casters.", "", "Generally, the locking pin210and the solenoid plunger205can move relative to one another over a free travel distance406(seeFIG.4) without engagement so that the solenoid plunger205can extend and be latched in place even if the locking pin210is not aligned with the locking void304. The biasing member208maintains a force on the locking pin210that pushes the locking pin210into the locking void once they come into alignment, thereby locking the caster wheel112from steering rotation. In the illustrated embodiments, this is accomplished via the slot214in the wall of the enlarged part210bof the locking pin210, which engages with slot pin216attached to the plunger205at limits of the slot214. It will be understood that other engagement means may provide a similar plunger free travel with subsequent biasing of the locking pin into the locking void304. InFIG.8, a cross-sectional diagram shows a locking pin and solenoid plunger interface according to another example embodiment.", "", "InFIG.8, a solenoid802has a plunger805with an actuated portion805aand an enlarged portion805b.The enlarged portion805bdefines a hole804in which a locking pin210can move freely. A biasing member808(e.g., a coil spring) is disposed in the hole804between the plunger805and the locking pin810. Note that this arrangement may include other components shown in other embodiments, such as bushing212and lock support member204, which are not shown here.", "", "Different from the previous embodiments, this embodiment uses a straight locking pin810and a plunger805adapted to receive an end810bof the locking pin810that is opposed to a locking portion810a.As with the previous embodiments, a slot814is formed within the locking pin810and a slot pin816is attached to the plunger805. The slot814and slot pin816can provide an equivalent free travel distance406as provided in other embodiments. Also note that in an alternate embodiment, a slot may instead be formed on a wall of the enlarged part805bof the plunger805and the slot pin attached to the locking pin810, similar to what is shown inFIGS.4-7but with the plunger205and locking pin210being reversed. The embodiments inFIGS.4-7may also be adapted to instead use a sliding interface as shown inFIG.8, with a slot in the plunger205and a pin fixed in the enlarged part210bof the locking pin210.", "", "In the lefthand view ofFIG.8, a first activation of the solenoid802transitions to and maintains the unlocking state, in which the locking pin810is pulled away from the engagement surface302. In the middle and right views, a second activation of the solenoid802transitions to and maintains the locking state in which the locking pin810is pushed towards the pivoting support115. In the righthand view, the locking pin810has engaged the locking void304when the pivoting support115is oriented in the predetermined rotation angle.", "", "InFIG.9, a perspective view shows a sliding interface900that may be implemented in a caster locking system according to another embodiment. This sliding interface uses two plates902,903, the second plate903having folded edges903athat surround edges of the first plate902. The plates902,903are attached to respective cylindrical parts904,905that could serve as (or be coupled to) any combination of a locking pin and solenoid plunger. A slot906in first plate902and slot pin907attached to second plate903can allow for a predefined free travel distance as in previous embodiments and may be reversed from what is shown here (e.g., slot906in second plate903and slot pin907attached to first plate902). A biasing member (not shown) can be configured to press against one of the plates902,903, e.g., on tabs903bon the second plate903, to provide an insertion force as in previous embodiments.", "", "In the embodiments described above, at least one solenoid and an associated mechanical interface is used to lock at least one caster wheel. Because zero turn vehicles commonly have two caster wheels, there may be one solenoid associated with each wheel. In some embodiments, one solenoid may be able to lock more than one wheel, such as if two caster wheels are coupled to rotate together via a tie rod or the like, and/or if a mechanical link is provided between two locking mechanisms. Thus, where embodiments are described below as using two or more solenoids, it is understood that such embodiments may be adaptable for use with a single solenoid.", "", "InFIG.10, a schematic diagram shows a caster locking control circuit according to an example embodiment. Two solenoids1002are shown that are associated with two different caster wheels. An electrical controller1004is configured to send a caster locking signal, which in this case are electrical outputs1005. The electrical controller1004includes a double pole, double throw switch1006that is mechanically biased to a center position. The switch1006can be momentarily held to either the unlock or lock positions, such that outputs1005will momentarily assume different polarities when in those respective positions. The switch1006will return to center position after being released removing current from the solenoids1002. Internal locking mechanisms of the solenoids1002will hold their respective plungers in the unlock or lock positions (corresponding to first and locking states, respectively) after the current has been removed. The current used to unlock and lock the solenoids1002comes from a power source1008, such as a vehicle battery or generator. Note that the illustrated circuit is a direct current (DC) circuit but this circuit (and other circuits described herein) could be adapted to use an AC power source, e.g., by adding a voltage rectifier.", "", "Note that, by itself, the switch1006will not provide indication to the operator whether the caster wheels are currently in the locked or unlocked state because it is mechanically biased to return to the center position. A two-position switch can be used instead of switch1006, although such a switch might always apply voltage to the solenoids1002. In some embodiments, a locked/unlocked indicator (e.g., indicator light, electro-mechanical indicator; not shown) may be used together with the return to center switch1006to indicate locked and unlocked states in one or more embodiments.", "", "InFIG.11, a schematic diagram shows a caster locking control circuit according to another example embodiment. An electrical controller1104in this example includes a triple pole, double throw, two position switch1106. The switch1106will remain in either the unlock or lock positions, such that the switch1106can, by itself, indicate state of the solenoids1002. To avoid constant application of current to the solenoids1002after they have latched, a timer relay1102can be used which will engage (closing switch1103) once power is supplied, then disengage (opening switch1103) after a preset amount of time. When the switch1106is transitioned between locked and unlocked states, this will momentarily remove power from the timer relay1102, causing it to reset. Note that the solenoids1002may have a build in functionality similar to the timer relay1102such that a separate timer relay1102need not be used. For example, the solenoids1002may internal components such as limit switches and diodes that remove power from a coil (or block current from flowing in one direction or another to a coil) once the solenoid1002has latched in an extended or retracted position.", "", "InFIG.12, a schematic diagram shows a caster locking control circuit according to another example embodiment. In this embodiment, an electrical controller1202includes a logic circuit1204that controls power to the solenoids1002via power interfaces1205, which will change output polarity in response to an input signal going positive or negative. A momentary switch1206and indicator1208are also shown that allow the operator to manually lock and unlock the casters and provide visual indication of the current state. Note that a two position, latching toggle switch (similar to switch1106) may be used in place of the momentary switch1206and indicator1208, and a two position, momentary switch (similar to switch1006) can be used with the indicator1208. A sensing circuit1210may instead or in addition be used to lock and unlock the casters. The sensing circuit1210may include, for example, accelerometers and/or a tilt switch that detect when the vehicle is tilted above and below a threshold value.", "", "Pressing the momentary switch1206will cause a caster locking signal to be sent to the logic circuit1204. Because the caster locking signal acts as a toggle, the caster locking signal will both lock and unlock that casters wheels via solenoids1002. The logic circuit1204may track an internal locking state of the caster wheels, and send respective solenoid locking and unlocking signals via power interfaces1205. For purposes of this disclosure, the operator may send a single signal (e.g., via a momentary switch) referred to herein as a caster locking signal. In this example, repetitions of the single signal may result in different solenoid locking and unlocking signals. In other embodiments, e.g., as shown inFIGS.10and11, the operator may also send an express caster unlocking signal in addition to the locking signal.", "", "One capability provided by a logic circuit1204as shown inFIG.11is programmability, such that operation of the system can be tailored for different scenarios, and readily changed in development and use. Fixed logic circuits could be used, e.g., collections of NAND gates assembled into a state machine. Programmable logic circuits could be used, e.g., field-programmable gate arrays (FPGAs), microcontrollers, etc.", "", "One example of how the logic circuit1204may operate is shown in the signal diagram ofFIG.13. Trace1300represents a signal measured from switch1206, which is momentarily grounded when the locking function is toggled on and off. Trace1302represents a voltage applied to the indicator1208indicating the state, e.g., a locked state. The trace1302is triggered on and off via a falling edge of trace1300. Traces1304,1306indicate a locking input (positive voltage) or unlocking input (negative input) to lock and unlock the solenoids1002. There is a delay between the pulses in traces1304,1306, which can reduce a total current load on the power supply1008. It will be understood that the pulses in these signals could be overlapping or simultaneous in other embodiments.", "", "The use of custom configurable and/or programmable logic circuit1204can simplify creating a custom system behavior as exemplified inFIG.13. For example, the positive and negative pulses in traces1304,1306are for a longer duration than the switch pulses in trace1300. In this way, the logic circuit1204can be configured make the system less sensitive to how long the user depresses the switch1206. In another example, the sensing circuit1210may provide a similar trace as trace1300, or alternately send positive and negative transitions or pulses when a triggering event occurs, e.g., exceeding a tilt angle threshold. The user input could alternatively, instead of the momentary switch1206, be a two-position toggle switch that sends two different signal levels depending on position, such that the indicator1208may not be needed.", "", "The logic circuit1204can be extended to add this and other inputs, including inputs (e.g., manual or automatic mode setting) that governs how the user inputs and sensor inputs interact. The logic circuit1204can be extended to add additional functionality using the same controls. For example, by holding down the momentary switch1206for a predetermined time, the logic circuit1204can initiate a “stuck lock” signal that repeatedly pulses the solenoids1002in case one of them becomes jammed.", "", "The electrical controller1202may provide other circuit functionality not shown here. For example, the electrical controller1202may include electrical noise filter, switch debounce circuits, fault detection, power conditioning, etc. The electrical controller1202may be a system controller that governs other operations, such as battery charging, steering controls, engine controller unit, etc.", "", "InFIG.14, a flowchart shows a method according to an example embodiment. The method takes place while steering1401a zero-turn work vehicle via two driven wheels on a first end of the work vehicle. The work vehicle has at least one caster wheel in a second end of the work vehicle opposed to the first end. At block1400, state variable is initialized, e.g., on vehicle power up. This variable “Locked” represents the locked state (Locked==TRUE) or unlocked state (Locked==FALSE) of the locking assembly. As described elsewhere herein, the casters may not be mechanically locked in the locking state until they are put in a predetermined rotation angle.", "", "At some point, either through user input or a caster locking signal is sent1402, e.g., from an electrical controller. Block1402is the entry point of an infinite loop in which the locking signal is polled. In this embodiment, the locking signal is a toggle, such that the same signal will perform different actions based on the current state, which is indicated by the value of the “Locked” state variable. In response to the caster locking signal a solenoid is electrically activated to reversibly move a locking pin in an axial direction, the axial direction is at a non-zero angle to an engagement surface of a pivoting support of the caster wheel.", "", "In response to the caster locking signal, the solenoid causes transitions between unlocking and locking states. If the current state is unlocked (block1404returns “No”), the solenoid is activated1405to push the locking pin towards the pivoting support to engage the locking void when the pivoting support is oriented in a predetermined rotation angle. The state variable is updated at block1406. If the current state is locked (block1404returns “Yes”), the solenoid is activated1408to pull the locking pin is pulled away from the engagement surface. The state variable is updated at block1409.", "", "InFIG.15, a flowchart shows a method according to another example embodiment. This is similar to the flowchart shown inFIG.14, except that the locking signal received at block1402is not a toggle but includes a specific command to lock or unlock (or may be separate caster locking and unlocking signals). This may be implemented in a circuit, for example, by using negative or positive voltages as one of the commands, and zero voltage when no command currently being issued. Therefore block1500determines which action is commanded, and then proceeds to activate the solenoid as previously described. Note that blocks1501and1502test to see if the command is the same as the current state (e.g., command is to lock when the state is locked) and skip any solenoid activation if that is the case. These decision blocks1501,1502are optional when explicit commands are used, as are blocks1400,1406, and1408which maintain the state. In the state variable is not used, this may be functionally equivalent to the switched circuits inFIGS.10and11.", "", "While the present disclosure is not so limited, an appreciation of various aspects of the disclosure will be gained through a discussion of the specific illustrative aspects provided below. Various modifications of the illustrative aspects, as well as additional aspects of the disclosure, will become apparent herein.", "", "It is noted that the terms “have,” “include,” “comprises,” and variations thereof, do not have a limiting meaning, and are used in their open-ended sense to generally mean “including, but not limited to,” where the terms appear in the accompanying description and claims. Further, “a,” “an,” “the,” “at least one,” and “one or more” are used interchangeably herein. Moreover, relative terms such as “left,” “right,” “front,” “fore,” “forward,” “rear,” “aft,” “rearward,” “top,” “bottom,” “side,” “upper,” “lower,” “above,” “below,” “horizontal,” “vertical,” and the like may be used herein and, if so, are from the perspective shown in the particular figure, or while the machine is in an operating configuration. These terms are used only to simplify the description, however, and not to limit the interpretation of any embodiment described. As used herein, the terms “determine” and “estimate” may be used interchangeably depending on the particular context of their use, for example, to determine or estimate a position or pose of a vehicle, boundary, obstacle, etc.", "", "Further, it is understood that the description of any particular element as being connected to or coupled to another element can be directly connected or coupled, or indirectly coupled/connected via intervening elements.", "", "Unless otherwise indicated, all numbers expressing feature sizes, amounts, and physical properties used in the specification and claims are to be understood as being modified in all instances by the term “about.” Accordingly, unless indicated to the contrary, the numerical parameters set forth in the foregoing specification and attached claims are approximations that can vary depending upon the desired properties sought to be obtained by those skilled in the art utilizing the teachings disclosed herein. The use of numerical ranges by endpoints includes all numbers within that range (e.g., 1 to 5 includes 1, 1.5, 2, 2.75, 3, 3.80, 4, and 5) and any range within that range.", "", "The various embodiments described above may be implemented using circuitry, firmware, and/or software modules that interact to provide particular results. One of skill in the arts can readily implement such described functionality, either at a modular level or as a whole, using knowledge generally known in the art. For example, the flowcharts and control diagrams illustrated herein may be used to create computer-readable instructions/code for execution by a processor. Such instructions may be stored on a non-transitory computer-readable medium and transferred to the processor for execution as is known in the art. The structures and procedures shown above are only a representative example of embodiments that can be used to provide the functions described hereinabove.", "", "The foregoing description of the example embodiments has been presented for the purposes of illustration and description. It is not intended to be exhaustive or to limit the embodiments to the precise form disclosed. Many modifications and variations are possible in light of the above teaching. Any or all features of the disclosed embodiments can be applied individually or in any combination and are not meant to be limiting, but purely illustrative. It is intended that the scope of the invention be limited not with this detailed description, but rather determined by the claims appended hereto."], "claims": ["two driven wheels on a first end of the work vehicle; a motor assembly coupled to rotate the two driven wheels; an electrical controller operable to send a caster locking signal; one or more caster wheels on a second end of the work vehicle opposed to the first end, the one or more caster wheels held by respective pivoting supports rotatably coupled to a frame of the work vehicle, each pivoting support comprising an engagement surface and at least one locking void extending through the engagement surface; and associated with each of the one or more caster wheels: a solenoid fixably mounted to the frame of the work vehicle and electrically operable to reversibly move a plunger in an axial direction, the axial direction being at a non-zero angle to the engagement surface of the pivoting support; a locking pin coupled to the plunger and aligned with the locking void in a predetermined rotation angle of the pivoting support; wherein, in response to the caster locking signal, the solenoid causes transitions between unlocking and locking states, wherein in the unlocking state, the locking pin is pulled away from the engagement surface, and in the locking state, the locking pin is pushed towards the pivoting support to engage the locking void when the pivoting support is oriented in the predetermined rotation angle.", "2 . The work vehicle of claim 1 , further comprising a locking support member fixably mounted to the frame, the locking support member comprising a bushing aligned with and encompassing a locking part of the locking pin, the bushing and the locking support member minimizing transmission of lateral forces from the pivoting support to the plunger.", "3 . The work vehicle of claim 1 , wherein if the pivoting support is not oriented at the predetermined rotation angle in the locking state, an end of the locking pin slides along the engagement surface in response to rotations of the pivoting frame.", "4 . The work vehicle of claim 1 , wherein the solenoid comprises a latching solenoid that latches the plunger in retracted and extended orientations in the respective unlocking and locking states, the latching solenoid holding the plunger in the retracted and extended orientations after removal of electrical power to the latching solenoid.", "5 . The work vehicle of claim 4 , wherein the locking pin is movable relative to the plunger over a free travel distance, wherein the free travel distance allows the latching solenoid to hold the plunger in the extended orientation when the pivoting support is not oriented in the predetermined rotation angle.", "6 . The work vehicle of claim 5 , further comprising a biasing member that biases the locking pin towards the engagement surface, the biasing member pushing the locking pin into the locking void when the pivoting support becomes oriented in the predetermined rotation angle.", "7 . The work vehicle of claim 6 , wherein the locking pin comprises an enlarged portion comprising a hole in the axial direction that encompasses an end of the plunger, the plunger slidably displaceable within the hole by the free travel distance before engaging the locking pin.", "8 . The work vehicle of claim 7 , wherein the enlarged portion comprises a slot in a wall of the hole of the enlarged portion and the plunger comprises a slot pin that extends into the slot, an elongated dimension of the slot defining the free travel distance.", "9 . The work vehicle of claim 7 , wherein the biasing member is between the enlarged portion and a body of the solenoid.", "10 . The work vehicle of claim 1 , wherein the locking void comprises a locking slot having a major dimension in a major direction that extends radially from a rotational axis of the pivoting support and a minor dimension corresponding to a diameter of a locking portion of the locking pin, the major dimension larger than the minor dimension.", "11 . The work vehicle of claim 1 , wherein the one or more caster wheels comprise two or more caster wheels, and wherein the two or more solenoids associated with the two or more caster wheels are transitioned together between the unlocking and locking states via the caster locking signal.", "12 . The work vehicle of claim 1 , wherein the work vehicle comprises a walk behind ground care vehicle.", "13 . The work vehicle of claim 1 , wherein the motor assembly comprises an electric motor and the work vehicle comprises a battery that powers the electric motor and the solenoid.", "14 . The work vehicle of claim 1 , wherein the electrical controller comprises a user actuated switch that provides the caster locking signal.", "measure a tilt of the work vehicle via a sensor; and send the caster locking signal based on the tilt going above or below a threshold.", "sending a caster locking signal via an electrical controller; in response to the caster locking signal, electrically activating a solenoid to reversibly move a locking pin in an axial direction to transition between unlocking and locking states, the axial direction being at a non-zero angle to an engagement surface of a pivoting support of the caster wheel, wherein: in the unlocking state, the locking pin is pulled away from the engagement surface; and in the locking state, the locking pin is pushed towards the pivoting support to engage a locking void of the pivoting support when the pivoting support is oriented in a predetermined rotation angle.", "17 . The method of claim 16 , further comprising minimizing transmission of lateral forces from the pivoting support to a plunger of the relay via a bushing aligned with and encompassing a locking part of the locking pin, the bushing mounted to a frame of the work vehicle.", "18 . The method of claim 16 , wherein if the pivoting support is not oriented at the predetermined rotation angle in the locking state, an end of the locking pin slides along the engagement surface in response to rotations of the pivoting support.", "wherein the locking pin is movable relative to the plunger over a free travel distance, the free travel distance allowing the latching solenoid to hold the plunger in the extended orientation when the pivoting support is not oriented in the predetermined rotation angle; and wherein the method further comprises biasing the locking pin towards the engagement surface in the locking state via a biasing member that pushes the locking pin into the locking void when the pivoting support becomes oriented in the predetermined rotation angle.", "measuring a tilt of the work vehicle via a sensor; and sending the caster locking signal based on the tilt going above or below a threshold."], "bibtex": "@patent{20240375436,\n    title = {WORK VEHICLE WITH ELECTRICALLY LOCKING CASTER},\n    number = {20240375436},\n    year = {2024},\n    note = {File: US20240375436A1-20241114.XML}\n    }", "classification": "B60B3302FI"}, {"title": "RECOVERY BOARD WITH INNER VALLEY", "doc_number": "20240375437", "filename": "US20240375437A1-20241114.XML", "abstract": "A recovery board for providing traction to a tire or track on a vehicle includes a main body having a leading edge and a trailing edge along a direction of travel wherein a distance between the leading edge and the trailing edge defines a length of the main body. The main body includes a top surface configured to engage the wheel or track of the vehicle having spaced apart rows of exterior gripping features and an interior row of gripping features between the spaced apart rows of exterior gripping features. Upper surfaces of the spaced apart rows of exterior gripping features are at a higher elevation relative to upper surfaces of the interior row of gripping features in a direction transverse to a direction of travel along the length of the main body such that an interior valley is formed between the spaced apart rows of exterior gripping features.", "detailed_description": ["A recovery board configured to provide traction to a tire or track of a vehicle to aid in freeing the vehicle being stuck in loose soil, mud or snow is illustrated at10inFIG.1. The recovery board10is configured to provide traction a tire or track that is otherwise stuck or without traction and move the vehicle in the direction of travel.", "", "The recovery board10includes a plurality of rows of pillars having surfaces at different elevations transverse to the direction of travel of the vehicle. The plurality of rows of pillars at different elevations increases the number of surfaces or edges that the tire or a lugged track can grip while moving along the recovery board. The recovery board10includes a leading end portion11with a concave profile along the direction of travel that aid the spinning tire to grip the pillars proximate the leading end portion11and travel along a length of the recovery board10to the trailing end13. The leading end portion11with the concave profile aids in preventing the tire from sliding off of the recovery board10during the engagement process.", "", "Referring toFIGS.1and2, the recovery board10includes outer rows of spaced apart pillars12and14along a length L proximate opposing side edges16and18that extend to base surfaces17and19having cut outs21that vary the surface of the recovery board10engaging the ground or snow. The recover board also include an interior row of spaced apart pillars20proximate a midline22that are transversely spaced from the outer rows of spaced apart pillars12and14. Referring toFIG.2and as viewed from a direction substantially orthogonal to the midline22, upper surfaces24of the interior row of pillars20are lower than upper surfaces13and15of the outer rows of spaced apart pillars12and14such that an inner valley26or concave contour between the outer pillars12and14and the interior pillars20is formed.", "", "Each of the pillars12,14and20have a similar configuration with a hexagonal prism lower portion30that has a base32that tapers to an upper edge34. A lower shoulder36extends inwardly from the upper edge34to a lower end of a middle portion38that has a hexagonal prism configuration that leads to an upper shoulder40.", "", "The pillars12,14and20include a first upper portion42having a first configuration and a second upper portion43having a second configuration that different from the first configuration where both the first and second upper portions42and43with a hexagonal base41that is substantially centrally located on the upper shoulder40. The first upper portion42includes a left inclined plane44and a right inclined plane46extending from the upper shoulder40at a first angle α. Each of the left and right inclined planes44and46have a base having a thickness a width of a front edge48and a back edge50and two side edges52,54and56,58, respectively. The left inclined plane44and the right inclined plane46extend from the upper shoulder40to an apex or upper edge60and62, respectively where the included planes44and46lower to a midline where the inclined planes44and46meet and form a line64. From the midline to the apex60and62, each inclined plane44and46includes an edge66and68that leads to a substantially vertical wall70and72that provides another surface for the tires to grip. Outer surfaces74and76of the left and right inclined planes44and46have the configuration of the side edges52,54and56,58, respectively, that also provide additional edges and surfaces for the tire to grip.", "", "The second upper portion43includes similar elements as the first upper portion42. The second upper portion43differs for the first upper portion in that an angle β of the left and right inclined planes44and46is steeper than the angle α of the first configuration which results in the apex60and62having a sharper edge than illustrated in the first configuration, where the sharper edge is configured to engage a sipe of a tread to provide additional surfaces for engagement with the tire.", "", "The row14of exterior pillars and the row of interior pillars20includes the same first and second upper portion42and44configurations. The laterally adjacent pillars of the rows14and20have the same configuration while the upper portions in the rows alternate between the first upper portion42configuration and the second upper portion44configuration. However, the row12of pillars has the opposite upper portion configuration, where the row of pillars12will have the second upper portion43relative to the adjacent pillar20having the first upper portion42. Having the different configurations of the upper portions42and43in a direction transverse to the direction of travel increases the number of different edges and surfaces, which increases the likelihood of the tire gripping the recovery board10. The hexagonal lower portion30, the middle portion38and the upper portion42or43which are connected with the lower shoulder36and the upper shoulder40provide a plurality of surfaces that a tread or sipe of the tread/and/or the side walls of the tire can grip relative to a substantially smooth pillar.", "", "Referring toFIG.3, the recovery board10is directional in nature where the leading end portion11includes a substantially concave profile while the trailing end portion13includes a substantially convex profile. The concave profile of the leading end portion11includes pillars80that have a different configuration from the other pillars12,14and20, where the pillars include a hexagonal prism base82that leads to a shoulder83from which an inclined plane84extends. A lower end86of the inclined plane84is proximate the leading edge and the raised end88is a greater distance from the leading edge relative to the lower end86. The configuration of the pillars80relative to adjacent pillars12,14and20in the exterior rows and the interior row define a concave profile that more readily accepts the convex profile of the tire and aid in retaining the spinning tire on the recovery board10.", "", "Additionally, having a larger lower portion, an intermediate sized middle portion and the upper portions of spaced apart pillars accepts lugs of tracked vehicles with different thickness. The distance D1between adjacent lower portions accepts a track with a first lug thickness. The distance D2between the adjacent middle portions accepts a lug of a track with a second lug thickness and the distance D3between the adjacent upper portions accepts a lug of a track with third lug thickness. As most tracked vehicles, such as snow machines, have one of three lug spacings, the recovery board10is configured to work with a vast majority of snow machines.", "", "As viewed from the side, the recovery board has a concave profile100proximate the leading end portion11which leads to a convex profile102that extends from the concave profile100through an apex104proximate a midpoint106along the length L to the trailing end13. The concave profile100proximate the leading end portion11aids in the convex tire to grip the recovery board10while the convex profile102aids in distancing the tire from the soil or snow in which the tire is stuck.", "", "The recovery board10is typically molded from a polymeric material having sufficient structural integrity to withstand the weight of a vehicle and also withstand the torque imparted by the rotating tires. The recovery board10includes top and bottom surfaces15and17that allows a plurality of recovery boards10to be nested together during storage as illustrated inFIG.4. The nested recovery boards can be retained together by positioning straps120between spaced apart pillars and securing the straps in a looped configuration with a buckle122.", "", "The recovery board10includes an opening130proximate the trailing end13that is configured to accept the finger of a user such that the recovery board10can be easily gripped and maneuvered. The recovery board10includes a slot132proximate the leading edge11that is configured to accept the strap120. In the event that the tire or track is sufficiently deep to require two or more recovery boards10to be linked together, the strap120can be positioned through the opening130proximate the trailing end13and the slot132in another recovery board10proximate the leading edge11such that two or more The straps can also be used to retain or tie two or more recovery boards together to provide a longer length, which may be needed depending upon the depth and length of the loose or slick soil and/or snow.", "", "Referring toFIG.6, a typical recovery board200with a convex profile202from a leading edge204to a trailing edge206is illustrated. A tire208is illustrated attempting to engage the convex leading edge204. However, the convex tire208has difficultly engaging the convex leading edge204and may spin out and not gain traction on the recovery board200. Additionally, while the convex tire208may gain some traction on the recovery board200, the tire208may not establish sufficient traction on the recovery board200and may slide off in a direction transverse to the direction of travel as the tire spins.", "", "Referring toFIG.7, the recovery board10is illustrated with the concave profile100proximate the leading edge11and the convex profile102extending from the concave profile to the trailing edge13. A convex tire208engages the concave profile100such that the tire gains traction on the recovery board. Once on the recovery board10, the tire208climbs the convex profile102and travels along the length of the recovery board10to disengage the tire208from the soil or snow.", "", "Referring toFIG.8, a typical recovery board220is illustrated where traction features224have substantially an even upper surface222in direction transverse to the direction of travel. An even upper surfaces222on the traction features224limits the number of surfaces that the tire226can engage and can limit the amount of traction that the tire226can gain on the recovery board220.", "", "Referring toFIG.9, a tire230is illustrated engaging the recovery board10having the rows of exterior pillars12and14and the lower row of inner pillars20that form the inner valley26. The tire230can have a sidewall232within the inner valley26such that the tire engages a feature of the row of pillars14and the upper surfaces of the pillars of the exterior pillars12and the inner pillars20. The inner valley26allows more surfaces and edges to be available for the tire to grip, which increases the likelihood of the tire230gripping and moving along the length of the recovery board10.", "", "Although the present invention has been described with reference to preferred embodiments, workers skilled in the art will recognize that changes may be made in form and detail without departing from the spirit and scope of the invention."], "claims": ["a main body having a leading edge and a trailing edge along a direction of travel wherein a distance between the leading edge and the trailing edge defines a length of the main body, the main body comprising: a top surface configured to engage the wheel or track of the vehicle having spaced apart rows of exterior gripping features and an interior row of gripping features between the spaced apart rows of exterior gripping features, wherein upper surfaces of the spaced apart rows of exterior gripping features are at a higher elevation relative to upper surfaces of the interior row of gripping features in a direction transverse to a direction of travel along the length of the main body such that an interior valley is formed between the spaced apart rows of exterior gripping features.", "2 . The recovery board of claim 1 , wherein the main body has a substantially concave profile proximate the leading edge and a substantially convex profile extending from the substantially concave profile to proximate the trailing edge.", "3 . The recovery board of claim 1 , wherein the main body comprises a first slot proximate the trailing edge and a second slot proximate the leading edge.", "4 . The recovery board of claim 3 , and further comprising a strap, wherein the strap is configured to be positioned thought the first and second slots such that when recovery boards are positioned adjacent each other the strap can cinch the adjacent recovery boards together.", "a bottom polygonal prism; a middle polygonal prism joined to the bottom polygonal prism with a lower shoulder; and a top gripping feature, a portion of which comprises a top polygonal prism joined to the middle polygonal prism with an upper shoulder.", "6 . The recovery board of claim 5 , wherein the bottom polygonal prism, the middle prism and the portion of which is a polygonal prism of the top gripping feature each comprises a hexagonal prism.", "7 . The recovery board of claim 5 , wherein adjacent gripping features having the bottom polygonal prism, the middle prism and the portion of which is a polygonal prism have different gaps between the bottom polygonal prisms, the middle prism sand the portions of which is a polygonal prisms such that lugs of different thickness can be positioned between adjacent gripping features to provide traction for the track of the vehicle.", "8 . The recovery board of claim 2 , wherein the gripping features of the exterior gripping features and the interior gripping features proximate the leading edge comprises an inclined ramp oriented such that a lower end is proximate the leading edge and a raised end is a distance from the leading edge.", "9 . The recovery board of claim 1 , wherein the main body comprises a bottom surface having substantially a same configuration as the top surface, such that a plurality of recovery boards can be nested on top of each other.", "10 . The recovery board of claim 1 , wherein the upper surfaces of adjacent gripping features in each of the rows of exterior gripping features are different from each other.", "11 . The recovery board of claim 1 , where the upper surfaces of aligned gripping features of the exterior rows of the gripping features in a direction transverse to the direction of travel are different from each other.", "12 . The recovery board of claim 1 , wherein at least some of the upper surfaces of the spaced apart exterior rows of gripping features and the interior row of gripping features include substantially horizontal edges configured to engage a sipe of a tread of the tire.", "a main body having a leading edge and a trailing edge along a direction of travel wherein a distance between the leading edge and the trailing edge defines a length of the main body wherein the main body has a substantially concave profile proximate the leading edge and a substantially convex profile extending from the substantially concave profile to the trailing edge, the main body comprising: a top surface configured to engage the wheel or track of the vehicle having spaced apart rows of exterior gripping features and an interior row of gripping features between the spaced apart rows of exterior gripping features.", "14 . The recovery board of claim 13 , wherein upper surfaces of the spaced apart rows of exterior gripping features are at a higher elevation relative to upper surfaces of the interior row of gripping features in a direction transverse to a direction of travel along the length of the main body such that substantially concave valley is formed between the spaced apart rows of exterior gripping features in a direction transverse to a direction of travel.", "15 . The recovery board of claim 13 , wherein the main body comprises a first slot proximate the trailing edge and a second slot proximate the leading edge.", "16 . The recovery board of claim 14 , and further comprising a strap, wherein the strap is configured to be positioned thought the first and second slots such that when recovery boards are positioned adjacent each other the strap can cinch the adjacent recovery boards together.", "a bottom polygonal prism; a middle polygonal prism joined to the bottom polygonal prism with a lower shoulder; and a top gripping feature, a portion of which comprises a top polygonal prism joined to the middle polygonal prism with an upper shoulder.", "18 . The recovery board of claim 16 , wherein the bottom polygonal prism, the middle prism and the portion of which is a polygonal prism of the top gripping feature each comprises a hexagonal prism.", "19 . The recovery board of claim 16 , wherein adjacent gripping features having the bottom polygonal prism, the middle prism and the portion of which is a polygonal prism have different gaps between the bottom polygonal prisms, the middle prism sand the portions of which is a polygonal prisms such that lugs of different thickness can be positioned between adjacent gripping features to provide traction for the track of the vehicle.", "20 . The recovery board of claim 13 , wherein the gripping features of the exterior gripping features and the interior gripping features proximate the leading edge comprises an inclined ramp oriented such that a lower end is proximate the leading edge and a raised end is a distance from the leading edge.", "21 . The recovery board of claim 13 , wherein the main body comprises a bottom surface having substantially a same configuration as the top surface, such that a plurality of recovery boards can be nested on top of each other.", "22 . The recovery board of claim 13 , wherein the upper surfaces of adjacent gripping features in each of the rows of exterior gripping features are different from each other.", "23 . The recovery board of claim 13 , where the upper surfaces of aligned gripping features of the exterior rows of the gripping features in a direction transverse to the direction of travel are different from each other."], "bibtex": "@patent{20240375437,\n    title = {RECOVERY BOARD WITH INNER VALLEY},\n    number = {20240375437},\n    year = {2024},\n    note = {File: US20240375437A1-20241114.XML}\n    }", "classification": "B60B3900FI"}, {"title": "PNEUMATIC TYRE WITH A THERMALLY ADAPTIVE UNDERLAYER", "doc_number": "20240375438", "filename": "US20240375438A1-20241114.XML", "abstract": "A pneumatic tyre contains a structure wherein a thermally adaptive underlayer is positioned beneath a tread layer. The thermally adaptive underlayer is based on a polymer system selected to contain elastomers with distinct glass transition temperatures sufficiently far apart and which exhibit low miscibility towards each other. Due to the tyre construction and the thermally adaptive underlayer, while driving a vehicle, performance characteristics of the pneumatic tyre adapt to the driving conditions on the road based on the temperature experienced by the thermally adaptive underlayer. This may be of particularly relevant during colder seasons, such as for a winter tyre, wherein the thermally adaptive underlayer may be used for an improved tread layer and for a studded pneumatic tyre, wherein the composition and thickness of the thermally adaptive underlayer may be used to control the dynamic impact of the stud on a driving surface, when the tyre is in motion.", "detailed_description": ["Within this description the term tyre refers to a pneumatic tyre for a vehicle configured to be used on a wheel of a car, especially a passenger car. A winter tyre refers to a pneumatic tyre, including a studded pneumatic tyre, which may be used in vehicles in categories M1and N1, as defined in the Consolidated Resolution on the Construction of Vehicles (R.E.3), document 15 ECE/TRANS/WP.29/78/Rev.4, para. 2. These categories are:M1: Vehicles used for the carriage of passengers and comprising not more than eight seats in addition to the driver's seat, andN1: Vehicles used for the carriage of goods and having a maximum mass not exceeding 3.5 tonnes.", "", "In line with this, within this description, a road wear of a studded tyre is defined as the road wear in the test specified in the standard SFS7503:2022:en."], "claims": ["a first elastomer having a first glass transition temperature and a second elastomer having a second glass transition temperature, the first and the second elastomer having low miscibility towards each other, and wherein: the thermally adaptive rubber component contains the first elastomer in an amount in the range of 20 to 80 parts per hundred rubber and the second elastomer in an amount equal to or higher than 20 parts per hundred rubber, the first elastomer is solution-polymerized styrene-butadiene rubber, the second elastomer is natural rubber, and a difference between the first glass transition temperature and the second glass transition temperature is equal to or larger than 20° K., the glass transition temperature referring to a derivative signal determinable by differential scanning calorimetry under nitrogen atmosphere, in a temperature range of 123° K. to 373° K., at a linear rate of 10° K./min in accordance with ISO 11357-2.", "selecting a first elastomer having a first glass transition temperature and a second elastomer having a second glass transition temperature which have low miscibility towards each other, mixing the elastomers, reinforcing filler material, additive, and curing agents together mechanically such that a rubber composition comprising a polymer system is obtained, shaping the rubber composition into a rubber component for an underlayer of a pneumatic tyre, arranging the rubber component onto a green tyre such that the rubber component becomes positioned as an underlayer between a textile component and a tread layer, and curing the green tyre, thereby obtaining a pneumatic tyre comprising a thermally adaptive underlayer, wherein: the thermally adaptive rubber component contains the first elastomer in an amount in the range of 20 to 80 parts per hundred rubber and the second elastomer in an amount equal to or higher than 20 parts per hundred rubber, the first elastomer is solution-polymerized styrene-butadiene rubber, the second elastomer is natural rubber, and a difference between the first glass transition temperature and the second glass transition temperature is equal to or larger than 20° K., the glass transition temperature referring to a derivative signal determinable by differential scanning calorimetry under nitrogen atmosphere, in a temperature range of 123° K. to 373° K., at a linear rate of 10° K./min in accordance with ISO 11357-2.", "a styrene content which is in the range of 25 to 45% by mass, and a vinyl content which is in the range of 33 to 65 mol-% relative to the butadiene, the contents being determinable by 1H-NMR method in accordance with ISO 21561-1:2015.", "the solution-polymerized polystyrene-butadiene rubber has a glass transition temperature at a temperature which is in the range of 235° K. to 260° K., and the natural rubber has a glass transition temperature at a temperature which is less than 215° K., the glass transition temperature according to a derivative signal determinable by differential scanning calorimetry under nitrogen atmosphere, in a temperature range of 123° K. to 373° K., at a linear rate of 10° K./min, is in accordance with ISO 11357-2.", "5 . The pneumatic tyre according to claim 1 , wherein the thermally adaptive underlayer component contains the reinforcing filler material in an amount equal to or higher than 30 parts per hundred rubber.", "carbon black that has a specific surface area in the range of 20 to 140 m2/g, based on multipoint nitrogen adsorption, determinable according to ASTM D6556-19a of carbon black type filler material, or silica that has a specific surface area in the range of 70 to 250 m2/g, based on multipoint nitrogen adsorption, determinable according to ASTM D1993 (2018), or any combination of carbon black and silica.", "7 . The pneumatic tyre according to claim 1 , wherein the thermally adaptive underlayer component contains polybutadiene rubber in an amount in the range of 0 to 30 parts per hundred rubber, wherein the polybutadiene rubber is cis-1,4-polybutadiene, trans-1,4-polybutadiene, or any combination of cis-1,4-polybutadiene and trans-1,4-polybutadiene, and wherein the polybutadiene rubber has a glass transition temperature at a temperature which is in the range of 160° K. to 193° K., the glass transition temperature referring to a derivative signal determinable by differential scanning calorimetry under nitrogen atmosphere, in a temperature range of 123° K. to 373° K., at a linear rate of 10° K./min in accordance with ISO 11357-2.", "aromatic resin, phenol-based resin, terpene resin, terpene phenol resin, rosin derived resins and copolymers, and any combination or modification of the above, said resin having a glass transition temperature above the freezing temperature of water, the glass transition temperature referring to a derivative signal determinable by differential scanning calorimetry under nitrogen atmosphere, in a temperature range of 123° K. to 450° K., at a linear rate of 10° K./min in accordance with ASTM D6604.", "9 . The pneumatic tyre according to claim 1 , wherein the natural rubber is polyisoprene derived from a biogenic origin, and wherein the natural rubber is not synthetic natural rubber.", "10 . The pneumatic tyre according to claim 1 , wherein thermally adaptive underlayer has a thickness in a radial direction, which is perpendicular to the direction of rotation of the tyre, wherein the thickness is equal to or less than 7 mm.", "a plurality of sipes on the tread layer, and/or a plurality of studs arranged to extend through the tread layer substantially parallel to a radial direction, which is perpendicular to the direction of rotation of the tyre, and wherein the thermally adaptive underlayer is in contact with the plurality of studs such that at least part of the thermally adaptive underlayer remains beneath the plurality of studs in a radial direction (+SR) substantially perpendicular to the direction of rotation of the tyre.", "12 . The pneumatic tyre according to claim 1 , wherein the thermally adaptive underlayer produces two peak maximums at temperatures separated by at least 35° K., wherein one peak maximum is above 273° K. and another peak maximum is below 238° K., when determined as a tangent delta from a cylindric sample in compression, using a dynamic mechanical thermal analysis and a temperature range from 213° K. to 343° K., a heating rate of 2° K./min and a 10 Hz frequency, in accordance with ISO 4664-1:2011, the cylindric sample having a diameter of 4.5 mm and a height of 5.0 mm.", "13 . The pneumatic tyre according to claim 12 , wherein the thermally adaptive underlayer produces the first peak maximum at a temperature in the range of 273° K. to 290° K. and the second peak maximum at a temperature in the range of 213° K. to 238° K., when determined as a tangent delta from a cylindric sample in compression, using a dynamic mechanical thermal analysis and a temperature range from 213° K to 343° K., a heating rate of 2° K./min and a 10 Hz frequency, in accordance with ISO 4664-1:2011, the cylindric sample having a diameter of 4.5 mm and a height of 5.0 mm.", "14 . The pneumatic tyre according to claim 1 , wherein the thermally adaptive underlayer comprises a dynamic stiffness onset point temperature which is in the range of 278° K. to 300° K., when determined from a cylindric sample in compression, using a dynamic mechanical thermal analysis and a temperature range from 213° K. to 343° K., a heating rate of 2° K./min and a 10 Hz frequency, in accordance with ISO 4664-1:2011, the cylindric sample having a diameter of 4.5 mm and a height of 5.0 mm.", "natural rubber in the range of 20 to 80 phr, solution-polymerized polystyrene-butadiene rubber in the range of 20 to 80 phr, polybutadiene rubber in the range of 0 to 30 phr, reinforcing filler material in the range of 30 to 80 phr, resin that has a high miscibility towards the first elastomer in the range of 1 to 30 phr, further additives, as needed, which comprise: oil in the range of 0 to 30 phr, antidegradants in the range of 0 to 10 phr, ZnO in an amount in the range of 2 to 4 phr, stearic acid in an amount in the range of 1 to 3 phr, and curing agents, which comprise: vulcanization accelerators in the range of 1 to 5 phr, and sulphur in an amount in the range of 1 to 5 phr.", "16 . The pneumatic tyre according to claim 1 , wherein the pneumatic tyre comprises a plurality of sipes on the tread layer."], "bibtex": "@patent{20240375438,\n    title = {PNEUMATIC TYRE WITH A THERMALLY ADAPTIVE UNDERLAYER},\n    number = {20240375438},\n    year = {2024},\n    note = {File: US20240375438A1-20241114.XML}\n    }", "classification": "B60C100FI"}]