[{"title": "VEHICLE WHEEL RIM", "doc_number": "20240300262", "filename": "US20240300262A1-20240912.XML", "abstract": "A rim for a vehicle wheel, including: an axial axis; a radial axis; a spoke bed wall having an outboard surface, an inboard surface, and a radial thickness; a spoke hole to receive a spoke having an outboard opening and a spoke hole axis. At least one of the inboard surface and outboard surface is radially variable to provide a first radial thickness region laterally surrounding said spoke hole and a second radial thickness region of reduced radial thickness relative to the first radial thickness region. The outboard surface includes a radially inwardly recessed surface within the first radial thickness region. At least a portion of the recessed surface is configured to provide a bearing surface for engagement with the spoke and to support of spoke tension forces.", "detailed_description": ["FIG.1describes the basic schematic configuration of an exemplary prior art vehicle wheel, in particular, a bicycle wheel1, as well as a description of the direction conventions used throughout this disclosure. For clarity, the bicycle frame and the quick release skewer assembly are not shown in this figure. The hub shell14is rotatable about the axle9and includes at least two axially spaced hub flanges16aand16b, each of which include a means for connecting with a multiplicity of spokes2connected thereto. Axle9includes end faces11aand11bthat define the spacing of its mounting with the frame (not shown). The axial axis28is the axial centerline of rotation of the bicycle wheel1. The hub flanges16aand16bmay be contiguous with the hub shell14or may be separately formed and assembled to the hub body12portion of the hub shell14. Each spoke2is affixed to its respective hub flange16aor16bat its first end4and extend to attach the rim8at its second ends6. The tire10is fitted to the outer periphery of the rim8. The wheel ofFIG.1is generic and may be of tension-spoke or compression-spoke design.", "", "The axial direction92is any direction parallel with the axial axis28. The radial direction93is a direction generally perpendicular to the axial direction92and extending generally from the axial axis28radially outwardly toward the rim8. The tangential direction94is a direction generally tangent to the rim at a given radius. The circumferential direction95is a cylindrical vector that wraps around the axial axis28at a given radius. A radial plane96is a plane perpendicular to the axial axis28that extends in a generally radial direction at a given axial intercept. An axial plane97is a plane that extends along the axial axis28. An orientation that is radially inboard (or inward) is nearer to the axial axis28of rotation and a radially outboard (or outward) is further from the axial axis28. An axially inboard (or inward) orientation is an orientation that is axially proximal to the axial midpoint between the two end faces11aand11b. Conversely, an axially outboard (or outward) orientation is an orientation that is axially distal to the axial midpoint between the two end faces11aand11b. A radially inboard orientation is an orientation that is radially proximal to the axial axis28and a radially outboard orientation is an orientation that is radially distal to the axial axis28. An axially inwardly facing surface is a surface that faces toward the axial midpoint between the two end faces11aand11b. Conversely, an axially outwardly facing surface is a surface that faces away from the axial midpoint between the two end faces11aand11b.", "", "The axial axis28is the central axis of rotation of the wheel. A radial axis29is an axis extending perpendicular to and intersecting with the axial axis28. A tangential axis31is an axis in the radial plane96that is perpendicular to the radial axis29and radially offset from the axial axis28.", "", "While it is most common for the hub shell14to rotate about a fixed axle9, there are some cases where it is desirable to permit the axle9to be fixed with the wheel1such as the case where the wheel1is driven by the axle9.", "", "For the purposes of using conventional terminology, the term “hub flange” is used herein to describe a region of the hub shell14to which the spokes2are joined. While the surface of the hub flange may be raised and flange-like in comparison to other surfaces of the hub shell14, this is not a requirement for the present invention and the hub flange16may alternatively be flush or recessed relative to other hub shell surfaces.", "", "As is well known in the art, a wheel1may be of tension-spoke construction, where the central hub hangs in tension by the spokes from the rim portion directly above, or it may be of compression-spoke construction, where the hub is supported by compressing the spoke directly beneath it. Since the present invention may be directed toward bicycle wheels and since the tension-spoke wheel is generally a more efficient structure than compression-spoke wheel, most of the discussion herein is focused with an eye toward tension-spoke wheel construction. However, it is anticipated that most, if not all, of the embodiments of the present invention may be adapted or otherwise applied to compression-spoke wheel construction as well. For a tension-spoke wheel, it is preferable that the wheel includes at least two hub flanges that are axially spaced on either side of the rim or, more specifically, the spoke attachment points at the rim. Thus, the spokes fixed to opposite hub flanges will converge as they extend to the rim as illustrated inFIG.2b. Additionally, a tension-spoke wheel will usually be pre-tensioned during assembly to create a pre-tensioned structure of balanced spoke tension that allows the axle supporting loads to be distributed among several, if not all, of the spokes of the wheel. It is this ability to share the stresses among its spokes that helps to make the tension-spoke wheel the highly efficient structure that it is. For a compression-spoke wheel, it is often preferable to employ at least two axially spaced hub flanges, however, in the case where the spokes have sufficient bending stiffness to support the requisite lateral or side-to-side loads, only a single hub flange may be employed.", "", "The spoke2is a generally long slender tensile element with a longitudinal axis62along its length and generally parallel to its sidewalls. The spoke2also has a tensile axis61of applied tensile load58that extends along the span portion of the spoke2between its anchor points at the rim8and hub flange16. The tensile axis61is generally collinear to the longitudinal axis62, except where the spoke2is bent to deviate from the tensile axis61. For the purposes of definition, as relating to spokes2and connections thereto, the term “longitudinal” herein refers to alignment along the longitudinal axis62. A longitudinally inboard (or inward) orientation refers to an orientation proximal the midpoint of the span portion. Conversely, a longitudinally outboard (or outward) orientation refers to an orientation distal the midpoint of the span portion. The term “lateral” herein refers to an orientation in a direction generally perpendicular to the longitudinal axis62. A laterally inboard (or inward) orientation refers to an orientation proximal the longitudinal axis. Conversely, a laterally outboard (or outward) orientation refers to an orientation distal the longitudinal axis62.", "", "FIGS.2a,2band2cdescribe the current technology in conventional bicycle wheels that most cyclists are familiar with. This prior art design includes a rim8, a hub shell14and a plurality of spokes3. The hub shell14is rotatable about the axle9and includes a pair of axially spaced hub flanges16aand16b. The wheel is assembled by first threading each individual spoke3through an axial hole17in the hub flange16until the j-bend19of the first end4is hooked within the hole17. The spoke3is then pivoted to extend in a generally radial direction toward the rim8. The enlarged portion34or “head” of the spoke3prevents the spoke3from pulling through the hole17in the hub flange16a. The second end6of each spoke3is then fixed to the rim8via spoke nipples21. The span of the spoke3is defined herein as the portion of the spoke3that spans between its connection to the hub flange (16aor16b) at its first end4and its connection to the rim8at its second end6and the span length refers to the longitudinal length of the span. Tightening the threaded engagement between the spoke nipple21and the spoke3serves to effectively shorten the span length of the spoke3. Thus, as the nipples21are threadably tightened, the spokes3are drawn up tight and a degree of pre-tension is induced in each spoke3. By selectively adjusting this threaded engagement, the spoke pre-tension may be adjusted and balanced relative to the other spokes3and to also align the trueness and roundness of the rim8. The spoke pre-tension is resisted by circumferential compression of the rim8and it is this balance of forces that imparts efficient structural integrity to the bicycle wheel1. Also shown inFIG.2b, there is lateral bracing angle38between the radial centerline plane of the rim8and the centerline62of the spoke3. As this bracing angle38is increased, the lateral or side-to-side stiffness (i.e. stiffness in the axial direction92) of the wheel1is also increased. As shown inFIG.2a, the spokes are shown with common “crossed” lacing where the spokes2span to be tangent to their corresponding hub flanges16aand16b. As such, there is a circumferential angle35between the longitudinal axis62and the radial axis29.", "", "It is noted that the threadable connection between the nipple21and its mating spoke3serves both as a pre-tensioning means and as a means to lock the second end6of the spoke3to the rim8during use of the bicycle wheel. This pre-tensioning means occurs within the spoke itself since the engagement interface (i.e. the threadable engagement) serves to both induce the pre-tension in the spoke and to maintain this pre-tension during operation of the wheel1. This requires that this threadable connection be robust enough to perform both of these functions and that the threadable engagement must operate smoothly and consistently. As such, both the spoke3and the nipple21are preferably metallic materials with sufficient strength and hardness to achieve a smooth and consistent threadable adjustment as well as having a high degree of structural strength of the threadable engagement. However, these metallic materials are generally heavy in comparison with fiber reinforced spoke materials. Further, if one attempts to incorporate such metallic threads with a fiber reinforced spoke, this is difficult to achieve and adds complexity and cost to the fiber reinforced spoke while also increasing weight.", "", "It is further noted that in a tension spoke wheel1, the pre-tension of the spokes3induce a longitudinal tensile strain and stretch in the corresponding spokes, as well as a circumferential hoop compression strain of the rim8. There may also be a strain of the hub assembly14, however such strains are commonly quite small in comparison to strain of the spoke3and/or rim8. In order for the wheel1to effectively support cycling loads, it is important to carefully balance this spoke pre-tension so that the cycling loads are evenly distributed throughout the wheel1and so that the wheel rim8rotates round and true. It is usually preferable that these strains be within the elastic limit of the corresponding spoke3and/or rim8. This is commonly achieved by adjusting the length of the spoke span to induce strain in the wheel and then locking the spoke connections at its first end4and second end6to fix the length of the spoke span therebetween and maintain the pre-tension in the spokes3while the wheel1is in its free-state (i.e. prior to loading the wheel in use).", "", "FIGS.3a-fdescribe an exemplary rim20of generally conventional geometry. As detailed inFIGS.3aand3b, rim20is of a generally hollow construction, commonly termed “double-wall” construction, and includes a radially inboard spoke bed22wall of thickness23and a radially outboard tire bed24wall and generally radially extending sidewalls26aand26bto define a generally hollow circumferential cavity27. Spoke bed22is defined by a radially inboard surface32and a radially outboard surface33. Hooked flanges30aand30bare adapted to engage the beads of a conventional tire (not shown).", "", "The spoke bed22is pierced with a plurality of spoke holes36adapted for connection with their respective spokes2via spoke nipples48. It may be seen that the spoke hole36has a radially inboard edge39at its intersection with the inboard surface32and a radially outboard edge40at its intersection with the radially outboard surface34. Further, outboard edge40may be seen to have axially spaced quadrant points42aand42bas well as circumferentially spaced quadrant points44aand44b. The tire bed24is pierced by access hole37that is aligned with spoke hole36, to permit the nipple48to be assembled as shown inFIGS.3aand3c. Note that access hole37is merely one common means to permit the nipple48to be assembled to the rim; a wide range of alternative means may be substituted, including means that do not require an access hole.", "", "It is useful to understand that it is common to manufacture the rim20by extruding the straight profile shown here and rolling the extrusion into a circumferential hoop with its ends joined by either a welded, sleeved or pinned connection. Spoke holes36and access holes37are then drilled in their proper locations.", "", "FIG.3ashows an exploded view that describes the conventional arrangement by which the second end6of the spoke2is connected to the rim20. The second end6of spoke2includes external threads46to mate with internal threads47of spoke nipple48. Spoke nipple48includes an enlarged head50and a shank52, with a generally conical tapered transition portion54extending between the underside of the head50and the shank52. Spoke nipple48also includes flats56for engagement with a mating wrench (not shown) for manual manipulation to adjust the spoke pre-tension by adjusting the threaded engagement between external threads46and internal threads47. Nipple48is considered an “external” spoke nipple, since it has a shank52that extends through the spoke hole36so that its flats56are exposed and may be manipulated externally to the rim20. A “nipple” or “spoke nipple” is defined herein as an element that is connected to the spoke and that includes a bearing surface for overlie engagement with the rim. Most commonly, the nipple is connected to the spoke by a threadable engagement. An “external nipple”, such as spoke nipple48, is defined herein as a spoke nipple that extends to a point longitudinally inwardly of the inboard surface of the spoke bed.FIGS.3c-fshows the spoke nipple48threadably assembled to the spoke2such that the transition portion54overlies and contacts the outboard edge40. The transition portion54serves as a bearing surface or engagement surface of the spoke2for bearing interface with the rim20to support spoke tension58forces. The spoke nipple48is thereby braced against the spoke bed22to resist the spoke tension58of the spoke2.", "", "It may be seen that the outboard surface34of the spoke bed22is of generally concave geometry as viewed in the cross-sectional views ofFIGS.3d-f. Thus, the intersection between the cylindrical spoke hole36and the concave outboard surface34creates a saddle-shaped outboard edge40, such that quadrant points42aand42bare spaced by radial distance60to be radially outboard of quadrant points44aand44b. With spoke nipple48aligned with angle of inclination18bas shown, it may be seen that the transition portion54contacts the outboard surface34of the spoke bed22only at the quadrant point42a, which is offset from the longitudinal axis62by distance64. Shank52also contacts inboard edge38, which restrains axial movement of the nipple48and forces the transition portion54against quadrant point42a. With the transition portion54supported only by quadrant portion42a, it may be seen that the transition portion54does not contact, and is spaced from, the outboard edge40at quadrant points42b,44aand44b.", "", "Since the spoke tension58acts along the longitudinal axis62, the offset distance64(between the longitudinal axis62and contacting quadrant point42a) tends to induce a bending moment to rotate the spoke nipple48in the direction66toward a reduced angle of inclination18bthat is no longer in alignment with the spoke centerline62or longitudinal axis62. Further, the spoke tension58tends to induce the conical transition portion54to ramp against its contact point at quadrant point42a. This, in combination with the contact between the inboard edge39and shank52at contact point45further induces the nipple48to pivot in the direction66. The result is that the spoke2tends to bend in response to the aforementioned moment, thus creating a bent region68(FIG.3f) just inboard of the spoke nipple48and thereby inducing a bending stress in the spoke2. As with all tension-spoke wheels, as the loaded wheel1is rotated along the ground, each successive spoke undergoes a cycle of reduced and increased spoke tension58. This causes the bent region68to flex with each revolution of the wheel, creating a much higher potential for fatigue failure of the spoke2as compared to a spoke without a bent region68and its associated bending stress. Further, the bending and associated flex described here tends to reduce the effective tensile stiffness of the spoke2between its attachment points, thereby reducing the overall structural stiffness of the wheel1.", "", "Additionally, since the majority of the spoke tension58is braced and resisted by the overlie engagement between the nipple48and only the single contact point at quadrant point42a, the contact load due to spoke tension58induces a very highly concentrated contact stress at this singular contact point. This high contact stress may result in localized galling as the nipple48is rotatably manipulated with in its spoke hole36. Furthermore, this high contact stress may cause excessive stress and deformation of the nipple48and/or spoke hole36. This very high localized stress also commonly causes cracking and failure of the rim due to fatigue. To resist the stress and minimize such failure, the spoke bed22needs to be very thick, which adds weight to the rim, detracting from the performance of the wheel.", "", "It is noted that the concentrated single contact point at quadrant point42ais also coincident with the edge of the spoke hole36. Thus, not only does the existence of spoke hole36create a stress riser in the spoke bed22, but the region of highest contact stress occurs right on the edge of this spoke hole to amplify this stress riser. As a result, due to high usage and fatigue loading, it is very common for cracks to form in the spoke bed22that radiate out from the spoke hole.", "", "It is noted that some have attempted to mitigate this elevated stress by drilling the spoke holes36at an angle from the radial axis29that is intended to correspond to the longitudinal axis62in a procedure known as “angled spoke drilling”. However, this angled spoke drilling does not appreciably increase the contact area of engagement between the transition surface54and the outboard edge40. Correspondingly, the contact stress at this interface remains very high. It would therefore be beneficial to mitigate these fatigue cracks is to modify the conventional design to distribute the spoke contact loads over a larger area of the rim to reduce the contact stress.", "", "FIGS.4a-cdescribe another exemplary rim70of conventional geometry. Rim70is generally identical to rim20, however the outboard surface72of spoke bed74instead has a generally flat contour defining a generally flat cylindrical surface. This means that outboard edge78of spoke hole76is a flat circular edge. However, due to the angle of inclination18bof the spoke2and spoke nipple48, the transition portion54contacts the outboard edge78at only a single contact point80, which is offset from the longitudinal axis62by offset distance82. The angle of inclination18bmay also be considered to be an axial skew angle of the longitudinal axis62relative to the radial axis29. Like the prior art embodiment ofFIGS.3a-f, this offset distance82induces a bending moment in the spoke2, including the associated bending and flex previously described herein.", "", "Thus, it may be seen that it is advantageous to reduce or eliminate the offset distance64or82to minimize the bending or flex associated with the prior-art arrangements described inFIGS.3a-fandFIGS.4a-b. The following embodiments of the present invention describe a variety of methods to reduce or eliminate this offset distance.", "", "As illustrated inFIG.2a, spokes are commonly laced such that their longitudinal axis36is radially offset from the axial axis28such that the spokes cross past each other. This well understood in industry and where the term “cross” is commonly used to describe how many spokes an individual spoke crosses within its span. This radial offset means that the spoke is commonly circumferentially skewed from a radial axis29at its intersection with the rim. This is particularly illustrated inFIG.4c, where longitudinal axis62(also considered the “longitudinal axis”) of spoke2is skewed from the radial axis29by a circumferential clockwise skew angle73and longitudinal axis62′ (also considered the “longitudinal axis”) of spoke2′ is skewed from the radial axis29by a circumferential counterclockwise skew angle73′.", "", "In contrast toFIGS.4a-c, which show the nipple48as extending through the spoke hole76to extend inboard of the spoke bed74,FIGS.5a-cdescribe an arrangement that utilizes a nipple84that is entirely radially outboard of the spoke bed89. Rim86is similar to rim70, with the exception that its spoke hole90is sized to provide clearance for only the spoke83. The rim86includes a spoke bed88with a radially outwardly facing outboard surface89. Spoke83is similar to spoke2and is of conventional configuration, including longitudinal axis85and external threads. The nipple84includes an engagement face91to bear against the outboard surface89of spoke bed88and internal threads (obscured). Such a nipple84is conventional and known in industry as a “hidden” or “internal” nipple.", "", "An “internal nipple”, such as spoke nipple84, is defined herein as a spoke nipple that is entirely longitudinally outboard of the inboard surface of the spoke bed. Most commonly, an internal nipple extends longitudinally outboard of the engagement surface or bearing surface of the nipple.FIG.5ashows the nipple84prior to its threadable assembly with the spoke83.", "", "FIG.5bshows the nipple84as next threadably assembled to the spoke83in the conventional manner until its engagement face91first contacts the outboard surface89as shown inFIG.5b. Due to the bracing angle99of the spoke83, the engagement face91does not mate squarely with the outboard face89, but instead is tilted or canted by angle87. Further threadable tightening of the nipple84, and the resulting spoke tension, causes the nipple84to rotate in direction98so that engagement face91bears squarely against the outboard surface89as shown inFIG.5c. However, this rotation results in a kink or bend93in the spoke83, resulting in increased stress and misalignment of the spoke83, as also described inFIG.3f. These figures illustrate the particular problems associated with the use of internal nipples with conventional rims.", "", "It is an object of the present invention to increase the contact area and improve the alignment between the transition portion54and the spoke hole76and/or between the engagement face91and the outboard surface89. This will serve to reduce the contact stress therebetween and result in increased fatigue resistance of the rim and spoke and also greater overall stiffness of the wheel1. This may be achieved by modifying the spoke bed74such that the outboard edge78and/or the portion of the outboard surface72surrounding the spoke hole76is more closely matched to the transition portion54. For the purposes of definition herein, the outboard edge78and/or the portion of the outboard surface72that provides blocking contact with a mating surface of the spoke, such as the transition surface54, is termed the “bearing surface”, since this is the surface and/or edge that bears against the spoke nipple48to provide connection between the spoke2and the rim70.", "", "One method for such modification of the spoke bed74is to remove material of the spoke bed74such that the outboard edge78and/or the portion of the outboard surface72surrounding the spoke hole76is more closely matched to the transition portion54. An example of such a method is described inFIGS.6a-e. As shown inFIG.6a-e, the rim100is formed such that spoke bed111includes a generally smooth circumferential outboard surface132of constant radius and a radially variable inboard surface136to provide radially inwardly thickened regions140surrounding the locations associated with spoke holes107, and a radially outwardly thinned region141(shown inFIG.6e) circumferentially positioned between adjacent thickened regions140. This results in a spoke bed111of variable thickness where thickened regions140have a thickness142greater than the thickness143of thinned region141, including a step dimension144therebetween. The thickened regions140provide structural reinforcement of the spoke bed111in the highly stressed region for connection with the mating spokes and the thinned regions141served to minimize the material of the spoke bed111for weight savings and reduction of material cost where stresses may be lower. Rim100is of double-wall construction and includes a tire bed wall113, a spoke bed wall111, and a radial gap112therebetween. The rim100may be bladder-molded of reinforced composite material or other materials and processes known in industry.", "", "The rim100is first shown inFIG.6awhere its spoke bed111wall is initially formed without any spoke holes or recesses. A step drill102is shown inFIG.6ato be aligned prior to drilling the spoke hole in the rim100. A step drill102is of a configuration known in industry and includes a cutting surface with a small-diameter portion104for piercing the spoke hole107through the spoke bed111, a large diameter portion105for piercing the spoke access hole109through the tire bed wall113, and a transition portion106therebetween. This step drill102is but one well-known and representative methods for adding a spoke hole107to a rim100. Other methods known in industry may be substituted. The step drill102may be aligned such that its drill axis103has an axial angle115and a circumferential angle (not shown) relative to the radial axis29such that the resulting spoke hole107will be angled to correspond to the bracing angle and/or the circumferential angle of the spoke. Such angled spoke hole drilling is well known in industry. The step drill102is positioned such that the resulting spoke holes107are aligned to axially and circumferentially overlap the thickened regions140. Alternatively, the spoke hole107may be drilled in alignment with the radial axis29or another angle deemed suitable.", "", "As shown inFIG.6b, the rim100has next been drilled by the step drill102in direction114in the conventional manner as described hereinabove to pierce both the tire bed wall113and the spoke bed wall111, creating the spoke hole107and spoke access hole109respectively, with both holes aligned along a hole axis108. Spoke hole107includes a radially outward entrance or outboard edge110. As shown, a rotary facing tool121is aligned such that its rotation axis123is preferably collinear with drill axis103and has an axial skew angle125and a circumferential skew angle119relative to the radial axis29. It is further preferred that rotational axis123corresponds to the bracing angle and circumferential angle of a mating spoke (not shown) and is shown here to have a flat and square cutting face129and a cylindrical pilot tip130. Cutting face129face is shown to be flat and planar and perpendicular to rotational axis123.", "", "When the facing tool121is rotated in direction122about its rotation axis123and presented to the outboard surface132of the spoke bed111in direction120, it will remove some material of the spoke bed111and create a radially inwardly recessed counterbore or spot face127of depth146therein. The pilot tip130may also be piloted within the spoke hole107to aid in alignment of the facing tool121. As shown inFIG.6c, the facing tool has next formed a recess or spot face127of radial recess depth138in the outboard surface132of the spoke bed111. The spot face127provides a bearing surface145that is flat and planar and generally perpendicular to the rotation axis123.", "", "Since Spot face127may be considered to be a revolved surface that is revolved about a revolved axis, such as face axis128, which is collinear to rotational axis123of the cutting face129. The face axis128may be considered as an axis generally perpendicular to the bearing surface145. Since bearing surface129is created with a rotary cutting tool (i.e. facing tool121), it is considered to be a revolved surface that is revolved about face axis128, which is shown here to be collinear with rotation axis123. Additionally, the spot face127creates a new outboard edge135of the spoke hole107. This describes a spot-facing machining operation that is well-known in industry. A “revolved surface” herein may be used to describe a surface that is rotationally symmetrical about a revolved axis (i.e. face axis128) and does not necessarily require that it has been formed with a rotary tool. It may be considered that the outboard surface132has thus been modified (as shown inFIG.6c) to include spot face127.", "", "It is noted that, corresponding to axial skew angle125, the bearing surface129is inclined, tilted, or canted by axial tilt angle137relative to a plane tangent to the outboard surface132. Correspondingly, the outboard edge135of spoke hole107is now also tilted by axial tilt angle137. Thus, whether a mating spoke nipple will bear against the bearing surface129or against the outboard edge135, the both geometries are skewed from the radial axis29and aligned to be square or otherwise be more closely matched to the mating bearing surface (i.e. transition surface54, for example) of the spoke nipple for greater surface contact and reduced misalignment therebetween. For this example, it is preferable that the outboard edge135be aligned to be generally matched with the transition surface54around the perimeter of the outboard edge135to maximize the mating contact therebetween, with a maximum gap therebetween of 0.1 millimeters. This is in contrast to the higher contact stresses and greater misalignment of a conventional outboard surface72and outboard edge78as illustrated inFIGS.4a-cand5a-c. For bicycle wheel applications, it is preferred that the axial skew angle125and corresponding axial tilt angle137be between 4 degrees and 12 degrees, or more preferably greater than 4 degrees. Also, for bicycle wheel applications with crossed spoke lacing (i.e. not radially laced), it is preferred that the circumferential skew angle119and corresponding circumferential tilt angle139be between 2 degrees and 10 degrees, or more preferably greater than 3 degrees.", "", "As shown inFIG.6c, the bearing surface145surrounds and circumscribes the spoke hole107about the hole axis108as is most preferred. However, it is also envisioned that less material is removed during spot facing such that the spot-faced bearing surface only partially circumscribes the spoke hole107about hole axis108, such that some original outboard surface132remains adjacent the spoke hole107. It is preferred that the spot-faced bearing surface circumscribes the spoke hole107by at least 180 degrees. The facing tool121may also be aligned such that its rotation axis123has a circumferential skew angle relative to the radial axis29such that the resulting bearing surface129will correspondingly be a revolved surface that is perpendicular to the circumferential skew angle119. As shown here inFIGS.6a-e, the longitudinal axis62, the hole axis108, and the face axis128are all collinear as is preferred.", "", "As shown inFIG.2b, the spoke2connected to hub flange16ahas an axial bracing angle38. It is also understood that the spoke2connected to hub flange16balso has an axial bracing angle in an axially opposed direction. Similarly, it is understood that the rim100may include some bearing surfaces129that have the axial tilt angle137optimized for connection with a spoke2that is connected to a first hub flange (such as hub flange16aofFIG.2b), and also include other bearing surfaces (not shown) that have a tilt angle axially opposed to tilt angle137that are optimized for connection with a spoke2that is connected to a second hub flange (such as hub flange16bofFIG.2b).", "", "The process described inFIGS.6a-cis a 2-step process, including a drilling process using step drill102and a spot-face process using facing tool121. Alternatively, the drilled spoke hole107and the spot-faced bearing surface129may be achieved in a single operation or process. For example, the transition portion106of step drill102may be configured to provide a square cutting surface like the cutting face129of the facing tool. By carefully controlling its depth-of-cut in the drilling process, this transition surface may be utilized to cut into the outboard surface132to create the bearing surface129. As a further alternative, the transition surface106and/or the cutting face129may be shaped to any desired profile to create a correspondingly profiled bearing surface. Examples of such alternatively profiled bearing surfaces are described inFIGS.6gand6h. As a still further alternative, the bearing surface129may be formed prior to the forming of the spoke hole107, where the spoke hole107may be formed by piercing through the bearing surface129.", "", "It is noted that some material is removed from the spoke bed111by spot face127reducing the spoke bed thickness142in this region to thickness148. For this reason, it is very advantageous to position the spot face127within the thickened region140to provide sufficient structural thickness and support to compensate for this removal of material. This thickened region140serves to provide additional thickness142(as compared to the thinned region141) to ensure that the material removal associated with spot face127leaves sufficient thickness148and does not adversely weaken the spoke bed111in this highly stressed region surrounding the spoke2. The step dimension144may be less than or equal to depth146or it may be greater than depth146as may be preferred to provide additional structural reinforcement at this highly stresses region surrounding the spoke hole107. Further, it is preferable to provide a lateral margin147between the thickened region140and the spot face127to ensure that sufficient structural thickness of spoke bed111material surrounds the contour of the spot face127. It may be preferable that lateral margin147be equal to or greater than 1 millimeter or more preferably equal or greater than thickness148. It is noted that the spot face127extends laterally outwardly of the spoke hole107and the thickened region140extends laterally outwardly of the spot face127.", "", "FIG.6dshows the spoke2and nipple48as next assembled to the rim100in the conventional manner. Spoke2and nipple48are identical to those described inFIGS.4a-c. The transition surface54is shown to squarely contact the outboard edge135for a full circular perimeter of contact therebetween. Thus, the outboard edge135provides a bearing surface or edge to create a blocking engagement with the nipple48and to support spoke tension58forces. As such, the outboard edge135(in addition to bearing face145) may also be considered a bearing surface, especially since outboard edge135provides blocking engagement with the nipple48to support spoke tension forces58. This is a significant improvement over the single point of contact described inFIGS.4a-cand serves to reduce bearing stress between the nipple48and the rim100. It is noted that bearing surface145and/or outboard edge135provide for an abutting and blocking overlie engagement with the mating spoke2(and nipple48).", "", "As described inFIG.4c, spokes2are commonly laced with a radial offset such that they are circumferentially skewed from a radial axis by angle73at its intersection with the rim100. This is particularly illustrated inFIG.6e, where spoke centerline133(also considered the “longitudinal axis”) of spoke2is circumferentially skewed from the radial axis29by a clockwise circumferential skew angle119, while spoke centerline133′ (also considered the “longitudinal axis”) of spoke2′ is circumferentially skewed from the radial axis by a counterclockwise circumferential skew angle119′. It is preferred that the spoke centerline133and133′ extend along the span portion of the respective spokes2and2′. During the drilling and spot facing operations described inFIGS.6b-c, the drill axis103and rotation axis123were skewed in a compound angle to also include circumferential skew angles119and119′ (in addition to axial skew angles125) such that bearing surface129is tilted by axial tilt angle137in the axial direction and by circumferential tilt angle139in the circumferential direction. Correspondingly, the outboard edge135of spoke hole107is now also tilted by both axial tilt angle137and circumferential tilt angle139. Bearing surface129and outboard edge135are preferably as close to being perpendicular to the spoke centerline133as possible, preferably within 3 degrees of each other. This perpendicularity results in the transition surface54squarely contacting the outboard edge135for a full circular perimeter of contact therebetween. This is a significant improvement over the single point of contact described inFIGS.4a-c. While this perfect perpendicularity may not always be feasible, it is understood that the skewed bearing surface129results in an improved interface with the spoke nipple48in comparison with the prior art designs shown that do not have a skewed bearing surface.", "", "It is understood that, as the nipple48is threadably tightened during assembly, the transition surface54bears against the outboard edge135, causing the two surfaces to abrade each other and to deform each other slightly. As a result, the sharp edge of outboard edge135is softened somewhat to create a lapped and matched surface interface therebetween.", "", "FIG.6fdescribes an arrangement similar to the embodiment ofFIGS.6a-e, where the rim150has been cut or machined to remove some material from its outboard surface152to create a recess159or spot face having a tilted bearing surface154that is perpendicular to face axis169. Rim150is similar to rim100ofFIGS.6c-e, with the exception that spoke hole156is smaller in diameter to provide clearance only for the spoke83. Like the rim100, rim150is initially formed such that spoke bed153includes a generally smooth circumferential outboard surface152of constant radius and a radially variable inboard surface151to provide localized thickened regions155surrounding the locations associated with spoke holes156and a thinned region157circumferentially positioned between adjacent thickened regions155. Spoke holes156and spot faces159are formed in the outboard surface152of the spoke bed153. Spoke83and nipple84are identical to those described inFIGS.5a-c, with nipple84being configured as an internal nipple as defined hereinabove.", "", "FIG.6fshows the spoke83and nipple84as assembled to the rim150. The bearing surface154is tilted to compensate for the axial skew angle158of the longitudinal axis85of the spoke83. Also, in a manner similar to that described inFIG.6e, the bearing surface154is preferably circumferentially tilted to compensate for any circumferential skew angle(s) (not shown) of the longitudinal axis85. As such, the engagement face91is shown to squarely contact the bearing surface154for a full circular face contact (about longitudinal axis85) therebetween. In contrast toFIG.5c, this provides a generous surface-to-surface contact therebetween without inducing increased stress and misalignment of the spoke83. Spot face159may be considered a revolved surface about face axis169that is shown here to be collinear with longitudinal axis85.", "", "FIG.6bshows a facing tool121with a flat planar cutting face129that is perpendicular to the rotation axis123. This produces the revolved flat planar bearing surface129shown inFIG.6cthat is recessed from the outboard face132. Alternatively, an alternate facing tool (not shown) or other means may be employed to provide a concave conical bearing surface164that is revolved and rotationally swept to be conical about a face axis169. The face axis169is skewed from the radial axis29by axial skew angle168, which may also include a circumferentially skewed orientation as described hereinabove. In contrast to the flat bearing surfaces145and154ofFIGS.6a-eand6frespectively, face axis169is not strictly perpendicular to the bearing surface, but may be considered a revolved axis about which the concave conical bearing surface164is generated. As shown in the rim160ofFIG.6g, the outboard surface162of the spoke bed161includes a localized concave conical bearing surface164(having a conical angle165) surrounding the spoke hole166. The conical angle165may be matched to the conical transition surface of a mating spoke nipple (not shown) such as the transition surface54of nipple48shown inFIG.4b. This provides a generous surface-to-surface contact between transition surface54and bearing surface164without inducing increased stress and misalignment of a spoke assembled thereto. In a manner similar to rim100, rim160is formed such that spoke bed161includes a generally smooth circumferential outboard surface162of constant radius and a radially variable inboard surface163to provide localized thickened regions167surrounding the locations associated with spoke holes166and a thinned region circumferentially spaced between adjacent thickened regions.", "", "As a further alternative, an alternate facing tool (not shown) or other means may be employed to provide a semi-spherical concave bearing surface174that is rotationally swept and/or revolve about a face axis179to provide the semi-spherical concave bearing surface174as shown inFIG.6h. The face axis179is shown to be skewed from the radial axis29by axial skew angle178, which may additionally include a circumferentially skewed orientation as described hereinabove. As shown in the rim170ofFIG.6h, the outboard surface172of the spoke bed171includes a localized concave spherical bearing surface174surrounding the spoke hole176. The spherical radius175may be matched to a spherical transition surface of a mating spoke nipple (not shown). This provides a generous surface-to-surface contact between the spherical transition surface and bearing surface174without inducing increased stress and misalignment of a spoke (not shown) assembled thereto. The spherical ball-and-socket interface between the spherical transition surface and spherical bearing surface174may be utilized to provide a swivel therebetween such that the spoke nipple may be self-aligning to accommodate a range of bracing and/or circumferential angles of the spoke. In a manner similar to rim100, rim170is formed such that spoke bed171includes a generally smooth circumferential outboard surface172of constant radius and a radially variable inboard surface177to provide localized thickened regions180surrounding the locations associated with spoke holes176and a thinned region181between adjacent thickened regions180.", "", "It is envisioned that the rim100may be bladder molded out of advanced composite material as is common. In bladder molding, it is generally easier to control the external surface of the part, since it is controlled by hard mold tooling, whereas the interior surface of the part is controlled by the bladder and the part contours are more difficult to control. Since the inboard surface136is an external surface and the outboard surface132is an interior surface, it is generally preferable to vary the thickness of the spoke bed by employing a radially variable inboard surface136, as described inFIGS.6a-h, because it is generally easier to mold and control the contour of the inboard surface. As such, it is preferable to provide a radially variable inboard surface136of the rim. Alternatively, it is also possible, but likely more difficult, to provide a radially variable outboard surface of the spoke bed to achieve a spoke bed of variable thickness. Such an alternative arrangement is described inFIGS.7a-b.", "", "FIGS.7a-bdescribe an arrangement similar to that ofFIGS.6d-e, with the exception that rim280is formed such that spoke bed281includes a generally smooth circumferential inboard surface282of constant radius and a radially variable outboard surface283to provide thickened regions284surrounding the locations associated with spoke holes285and a thinned region286between adjacent thickened regions284. This results in a spoke bed281of variable thickness where thickened region284has a thickness287that is greater than the thickness288of thinned region286, including a step dimension289therebetween. The rim280may be bladder-molded of reinforced composite material or may be formed using other materials and processes known in industry.", "", "The rim280includes spoke hole285and access hole290as described hereinabove. Outboard surface283includes a recess or spot face291positioned within thickened region284that provides a bearing surface292that is flat and planar identical to bearing surface145ofFIGS.6a-e. It is noted that, corresponding to axial skew angle293, the bearing surface292is inclined, tilted, or canted relative to the axial axis (not shown). Also, corresponding to circumferential skew angle279, the bearing surfaces292and292′ are inclined, tilted, or canted relative to a plane tangent to the outboard surface283. The outboard edge of spoke hole295is now correspondingly tilted and skewed as well. Thus, whether a spoke nipple will bear against the bearing surface292or the outboard edge295, the both geometries are aligned to be square or otherwise to be more closely matched to the mating bearing surface (for example, transition surface54) of the spoke nipple for greater surface contact and reduced misalignment therebetween.", "", "As shown inFIGS.7a-b, the bearing surface292surrounds and circumscribes the spoke hole285about the hole axis296as is most preferred. It is preferred that the spot-faced bearing surface292surrounds the spoke hole285by at least 180 degrees. As shown here, the longitudinal axis62, the hole axis296, and the face axis297are all collinear as is preferred. Spoke2and nipple48are identical to those described inFIGS.3a-fand are shown inFIGS.7a-bto be assembled to rim280in the conventional manner and as described hereinabove.", "", "Some material is removed from the spoke bed281by spot face291, creating a recess therein and reducing the spoke bed thickness in this region. For this reason, it is very advantageous to position the spot face291within the thickened region284to provide sufficient structural support to compensate for this removal of material. The step dimension289may equal depth289or it may be greater than depth289as is preferred to provide additional structural reinforcement at this highly stresses region surrounding the spoke hole285. Further, it is preferable to provide a lateral margin299between the thickened region284and the spot face291to ensure that sufficient structural thickness of spoke bed281material surrounds the contour of the spot face291. It is preferable that lateral margin299be equal to or greater than thickness300between spot face291and inboard surface282.", "", "FIG.7ashows the spoke2and nipple48as assembled to the rim280. Spoke2and nipple48are identical to those described inFIGS.4a-c. The transition surface54is shown to squarely contact the outboard edge295for a full circular perimeter of contact therebetween. This is a significant improvement over the single point of contact described inFIGS.4a-c.", "", "As described inFIG.7b, spokes2are commonly cross-laced with a radial offset at the hub such that they are circumferentially skewed from a radial axis at its intersection with the rim280. This is particularly illustrated inFIG.7b, where longitudinal axis62is skewed from the radial axis29by a circumferential clockwise circumferential skew angle279and longitudinal axis62′ is skewed from the radial axis29by a circumferential counterclockwise circumferential skew angle279′.", "", "FIGS.8a-cdescribe an embodiment similar toFIGS.6a-e, however instead of utilizing a facing tool121that cuts, abrades, or otherwise removes material from the spoke bed111to create a skewed bearing surface145,FIGS.8a-cutilizes a punch260tool to locally coin, forge, or otherwise deform the spoke bed111to create a skewed bearing surface262. Rim100is identical to that shown inFIG.6b, including tire bed wall113with access hole109, and spoke bed wall111with outboard surface132and inboard surface136and with spoke hole107therethrough having a radially outboard edge110. As shown inFIG.8a, punch tool260includes: coining face266that is circular about tool axis264, and pilot pin268that is shown to be aligned along a tool axis264. Punch260is in alignment for subsequent coining operation. Tool axis264is skewed from the radial axis29by skew angle276. The radially inboard surface136of the rim100is shown to be temporarily supported in a rigid nest die272. As shown inFIG.8b, the coining tool260is pressed in direction270along tool axis264such that pilot pin268extends though spoke hole107and is piloted therein. Coining tool260is further pressed in direction270such that coining face266impacts and presses against the outboard surface132adjacent spoke hole107, causing the spoke bed111to become locally debossed, indented, and deformed to conform to the coining face266.", "", "As shown inFIG.8c, with the coining tool260and nest die272removed, the resulting spoke bed111now includes an indent274that includes a bearing surface262that is aligned relative to the tool axis264and is tilted and skewed by skew angle276, which corresponds to tilt angle278. Indent274is radially inwardly recessed by dimension265from the adjacent outboard surface132. It is noted that outboard edge110also becomes distorted and/or displaced in this coining operation to create outboard edge110′ that is aligned with the bearing surface262. Bearing surface262and outboard edge110′ are similar in purpose and function to bearing surface129and outboard edge135respectively as described inFIGS.6c-e.", "", "The deformation of the spoke bed111described inFIG.8bdescribes a coining operation known in industry. The nest die272is shown here to support the inboard surface136so that inboard surface does not become distorted during the coining operation. Alternatively, the nest die272may include a recess that will allow the inboard surface136to also deform during coining to create a locally bulged region (not shown) of the inboard surface adjacent the spoke hole107. The preferred material for the spoke bed111in such a coining operation is a lightweight metal such as aluminum. An advantage of such a coining operation is that it may serve to locally work-harden the spoke bed, thereby advantageously increasing the strength of the spoke bed111in this highly stressed region.", "", "It is to be understood that the invention is not limited to the illustrations described and shown herein, which are deemed to be merely illustrative of the best modes of carrying out the invention, and which are susceptible of modification of form, size, arrangement of parts and details of operation. The invention rather is intended to encompass all such modifications that are within its spirit and scope as defined by the claims."], "claims": ["an axial axis; a radial axis perpendicular to said axial axis; a spoke bed wall that includes: an inboard surface facing radially inwardly; an outboard surface facing radially outwardly; and a radial thickness between said inboard surface and said outboard surface; a spoke hole extending through said spoke bed wall and configured to receive a spoke, wherein said spoke hole includes: an inboard opening at said inboard surface; an outboard opening at said outboard surface; a spoke hole sidewall extending between said inboard opening and said outboard opening; and a spoke hole axis; wherein at least one of said inboard surface and said outboard surface is radially variable to provide a first radial thickness region laterally surrounding said spoke hole and a second radial thickness region circumferentially offset from said first radial thickness region and of reduced radial thickness relative to said first radial thickness region; wherein said outboard surface includes a radially inwardly recessed surface adjacent said outboard opening and within said first radial thickness region; wherein at least a portion of said recessed surface is configured to provide a bearing surface for engagement with said spoke and to support of spoke tension forces.", "2 . The rim according to claim 1 , wherein said inboard surface is radially variable to include a radially inboard portion adjacent said first radial thickness region and a radially outboard portion adjacent second radial thickness region and radially outboard of said inboard portion.", "3 . The rim according to claim 1 , wherein said bearing surface includes a revolved surface that is revolved about a face axis and circumscribes said spoke hole axis by a circumscribing angle greater than 180 degrees.", "4 . The rim according to claim 3 , wherein said face axis is at least one of: (i) axially skewed from said radial axis by an axial skew angle; and (ii) circumferentially skewed from said radial axis by a circumferential skew angle.", "5 . The rim according to claim 4 , wherein said face axis is circumferentially skewed from said radial axis by a circumferential skew angle, wherein said circumferential angle is between two (2) degrees and ten (10) degrees.", "6 . The rim according to claim 2 , wherein said face axis is at least one of: (i) generally parallel to said spoke hole axis; and (ii) generally collinear with said face axis.", "7 . The rim according to claim 3 , wherein said face axis is axially skewed from said radial axis by an axial skew angle and said axial skew angle is at least four degrees.", "8 . The rim according to claim 1 , wherein said outboard surface is axially skewed from said radial axis by an axial skew angle, wherein said axial angle is at least four degrees.", "9 . The rim according to claim 1 , wherein said first radial thickness region extends laterally outward of said recessed surface by a lateral margin and said lateral margin is at least one millimeter.", "10 . The rim according to claim 3 , wherein said bearing surface is a flat planar surface extending perpendicular to said face axis.", "11 . The rim according to claim 3 , wherein said bearing surface fully circumscribes said spoke hole axis by 360 degrees.", "12 . The rim according to claim 3 , wherein said bearing surface is a conical surface that is revolved about said face axis.", "13 . The rim according to claim 3 wherein said bearing surface is a concave spherical surface that is revolved about said face axis.", "14 . The rim according to claim 1 , including an entrance edge at the intersection between said spoke hole and said bearing surface, wherein said entrance edge is configured to provide a bearing surface for engagement with said vehicle wheel spoke to support spoke tension forces.", "15 . The rim according to claim 1 , wherein: said spoke hole is configured to receive a spoke therein; said spoke includes an engagement surface for blocking engagement with said bearing surface to support spoke tension forces; and said bearing surface is generally matched to said engagement surface.", "16 . The rim according to claim 15 , wherein said engagement surface is in a spoke nipple connected to said spoke and said spoke nipple is an external spoke nipple.", "17 . The rim according to claim 15 , wherein said engagement surface is in a spoke nipple connected to said spoke and said spoke nipple is an internal spoke nipple.", "an axial axis; a radial axis perpendicular to said axial axis; a spoke bed wall that includes: an inboard surface facing radially inwardly; an outboard surface facing radially outwardly; and a radial thickness between said inboard surface and said outboard surface; wherein at least one of said inboard surface and said outboard surface is radially variable to provide a first radial thickness region laterally surrounding said spoke hole and a second radial thickness region circumferentially offset from said first radial thickness region and of reduced radial thickness relative to said first radial thickness region; said method comprising the steps of: (a) initially pre-forming said rim, (b) subsequently displacing and/or removing material from said spoke bed adjacent said outboard surface to form a radially inwardly recessed surface within said first radial thickness region, wherein at least a portion of said recessed surface is configured to provide a bearing surface for engagement with a vehicle wheel spoke to support spoke tension forces therebetween.", "19 . The vehicle wheel rim according to claim 18 , including a spoke hole extending through said spoke bed wall and configured to receive a spoke, wherein said spoke hole includes: an inboard opening at said inboard surface; an outboard opening at said outboard surface; and a spoke hole axis; wherein said recessed surface is adjacent said outboard opening.", "20 . The method according to claim 19 , wherein said recessed surface is formed subsequent to the forming of said spoke hole.", "21 . The method according to claim 19 , wherein said recessed surface is formed prior to the forming of said spoke hole.", "22 . The method according to claim 19 , wherein said recessed surface is formed simultaneously with the forming of said spoke hole.", "23 . The method according to claim 18 , wherein said recessed surface is formed by a rotary cutting tool that is rotated about a rotary axis to remove material from said spoke bed wall.", "24 . The method according to claim 18 , wherein said recessed surface is formed in a coining operation to displace material of said spoke bed wall."], "bibtex": "@patent{20240300262,\n    title = {VEHICLE WHEEL RIM},\n    number = {20240300262},\n    year = {2024},\n    note = {File: US20240300262A1-20240912.XML}\n    }", "classification": "B60B104FI"}, {"title": "CASTER DEVICE", "doc_number": "20240300263", "filename": "US20240300263A1-20240912.XML", "abstract": "A caster device for a pipe leg includes a caster unit, a mounting unit, and a braking unit. The caster unit includes a wheel seat subunit, a caster subunit that is rotatably connected to a bottom end of the wheel seat subunit, and a protection subunit that is located between the wheel seat subunit and the caster subunit. The mounting unit is mounted to the wheel seat subunit and is adapted to be mounted to the pipe leg. The braking unit extends through the protection subunit and the wheel seat subunit into the mounting unit, and is movable in an up-down direction between a braking position, in which the braking unit projects out of the protection subunit and is in contact with the caster subunit so that the caster subunit is refrained from rotating, and an initial position, in which the braking unit is spaced apart from the caster subunit.", "detailed_description": ["It should be noted herein that for clarity of description, spatially relative terms such as “top,” “bottom,” “upper,” “lower,” “on,” “above,” “over,” “downwardly,” “upwardly” and the like may be used throughout the disclosure while making reference to the features as illustrated in the drawings. The features may be oriented differently (e.g., rotated 90 degrees or at other orientations) and the spatially relative terms used herein may be interpreted accordingly.", "", "Referring toFIGS.3to6, an embodiment of a caster device of according to the disclosure is adapted for use with a pipe leg9of a hospital bed (not shown). However, the embodiment may not be limited to be used for the hospital bed, and may be used for any movable carrier as long as the movable carrier is provided with a pipe leg into which the embodiment may be inserted.", "", "The embodiment includes a caster unit2, a mounting unit3that is mounted to the caster unit2and that is adapted to be mounted to the pipe leg9, a braking unit4that is inserted into the mounting unit3and the caster unit2, and a control unit5that is disposed in the mounting unit3. In the following description, an advancing direction of the wheel caster device is defined as a front direction, and the front direction (F) inFIGS.3and4is defined to be the front direction.", "", "Referring toFIGS.4to6again, the caster unit2includes a wheel seat subunit21, a caster subunit22that is rotatably connected to a bottom end of the wheel seat subunit21, and a protection subunit23that is positioned in the wheel seat subunit21and that is located between the wheel seat subunit21and the caster subunit22in an up-down direction (D11).", "", "The wheel seat subunit21includes a top seat wall211, and two lateral seat walls212that respectively extend downwardly and vertically from two opposite sides of the top seat wall211in a left-right direction orthogonal to the up-down direction (D11) and the front direction (F). The top seat wall211extends in an imaginary plane perpendicular to the up-down direction (D11), and includes a top seat hole213that extends through the top seat wall211in the up-down direction (D11) and that is configured to be circular, and two engaging grooves214that respective extend radially outwardly from two opposite sides of the top seat hole213in the front direction (F). The caster subunit22is rotatably connected to the lateral seat walls212.", "", "Since the structure of the caster subunit22and the assembly of the caster subunit22and the wheel seat subunit21are widely-understood by those skilled in the art, a detailed description thereof is omitted.", "", "The protection subunit23includes a protection seat24that is positioned in the wheel seat subunit21via two first pins (P11), a resilient member25that is disposed in the protection seat24, and a protection member26and a restraining member27that are disposed on the protection seat24.", "", "Referring further toFIGS.7and8, in cooperation withFIG.4, the protection seat24includes a bottom wall241, and a surrounding wall242that extends upwardly from the bottom wall241.", "", "The bottom wall241includes a center wall portion243that is located at a center thereof and that is configured to be annular, two column wall portions244that are spaced apart from each other and that are respectively located at two opposite sides of the center wall portion243in the left-right direction, and a base wall portion245that is connected to the center wall portion243and the column wall portions244, and that extends downwardly when extending forwardly.", "", "The bottom wall241is formed with a first insertion hole246and two second insertion holes247. Specifically, the center wall portion243defines the first insertion hole246, and the first insertion hole246extends in the up-down direction (D11). The base wall portion245is formed with the second insertion holes247, and each of the second insertion holes247extends in the up-down direction (D11) and extends in a circumferential direction (hereinafter also referred to as “the circumferential direction (D12)”) of the center wall portion243(seeFIG.8). It should be noted that, a circumferential direction of the pipe leg9is defined to be identical to the circumferential direction (D12) and will also be referred to as “the circumferential direction (D12)” hereinafter. The second insertion holes247cooperatively surround the center wall portion243and the first insertion hole246. The resilient member25of the protection subunit23is disposed on the center wall portion243of the bottom wall241(seeFIG.5).", "", "Referring toFIGS.4,6, and7again, left and right sides of the surrounding wall242are respectively connected to the lateral seat walls212via the first pins (P11) (i.e., each of the first pins (P11) is inserted into a respective one of the lateral seat walls212and the surrounding wall242) so that the protection seat24is positioned in the wheel seat subunit21. A front portion of the surrounding wall242is formed with a restraining hole248(seeFIG.5) that extends through the surrounding wall242in a radial direction of the pipe leg9and that extends in the circumferential direction (D12), and two hole edges249(seeFIG.7) that are respectively located at two opposite sides of the restraining hole248in the circumferential direction (D12).", "", "Referring further toFIG.9, in cooperation withFIGS.4and7, the protection member26is made of a metal material, and includes a main plate section261that is configured to be inverted U-shaped, and two side plate sections262that respectively protrude from left and right sides of an inner part of the main plate section261and that protrude rearwardly. The main plate section261cooperates with the side plate sections262to cover the hole edges249.", "", "The restraining member27is mounted to the bottom wall241and extends into the surrounding wall242. Specifically, the restraining member27includes two wing sections271that are respectively riveted to the column wall portions244of the bottom wall241of the protection seat24, and an interconnecting plate section272that interconnects the wing sections271. Each of the wing sections271extends upwardly and forwardly from the respective one of the column wall portions244to the interconnecting plate section272. The wing sections271are concave to each other. The interconnecting plate section272is inserted into the restraining hole248and is formed with two through holes273, each of which extends through the interconnecting plate section272in the up-down direction (D11).", "", "Referring toFIGS.4to6again, the mounting unit3is adapted to be inserted into the pipe leg9(seeFIG.6), and is mounted to the pipe leg9via two second pins (P12) so that the mounting unit3is not rotatable relative to the pipe leg9in the circumferential direction (D12).", "", "The mounting unit3is mounted to the wheel seat subunit21, and includes a bearing subunit31that is disposed on a top end of the top seat wall211of the wheel seat subunit21, and a casing subunit32that is inserted into the bearing subunit31.", "", "The wheel seat subunit21is rotatable relative to the casing subunit32via the bearing subunit31.", "", "The casing subunit32is adapted to be inserted into the pipe leg9, and is irrotatable relative to the pipe leg9in the circumferential direction (D12). The casing subunit32includes an inner casing tube321and an outer casing tube322that is sleeved on a top portion of the inner casing tube321(i.e., the top portion of the inner casing tube321is inserted into the outer casing tube322).", "", "The inner casing tube321is mounted to the outer casing tube322via two third pins (P13) (seeFIG.4). A bottom portion of the inner casing tube321protrudes downwardly from the outer casing tube322and is inserted into the bearing subunit31. The bottom portion of the inner casing tube321has an inner surrounding surface that defines an inner casing hole323having a hexagonal cross section (seeFIG.4).", "", "The outer casing tube322includes two half tube sections324that cooperatively form in a shape of a hollow cylinder. Since holes that are formed at each of the outer casing tube322and the inner casing tube321for insertion of the second pins (P12) (seeFIG.6) are the design that is widely-understood by those skilled in the art, a detailed description thereof is omitted.", "", "The braking unit4extends through the protection subunit23and the wheel seat subunit21into the mounting unit3. The braking unit4includes a moving rod41that extends in the up-down direction (D11) through the wheel seat subunit21and the inner casing tube321of the mounting unit3, a brake subunit42, and a disc member43. The moving rod41is operable to move relative to the mounting unit3and the wheel seat subunit21in the up-down direction (D11). The brake subunit42abuts against a top end of the resilient member25, is inserted downwardly into the protection seat24of the protection subunit23, and is located below the moving rod41. The disc member43is mounted to a bottom portion of the moving rod41, is located between the wheel seat subunit21and the protection seat24in the up-down direction (D11), and is operable to engage the restraining member27such that the wheel seat subunit21, the protection seat24, and the caster subunit22are refrained from rotating in the circumferential direction (D12) of the pipe leg9.", "", "An outer surface of a top portion of the moving rod41is formed with a thread so as to be threadedly mounted to the control unit5. The bottom portion of the moving rod41has a cross section that is not circular (i.e., the bottom portion of the moving rod41is not cylindrical), and is inserted into the inner casing hole323of the inner casing tube321. In this embodiment, the cross section of the bottom portion of the moving rod41is hexagonal. Therefore, the moving rod41is irrotatable relative to the inner casing tube321in the circumferential direction (D12).", "", "Referring toFIGS.4,6and7again, the brake subunit42includes a brake member421, a threaded insert member422, and a stud423. The brake member421is inserted into the protection seat24. The threaded insert member422is inserted into the brake member421, and has a threaded hole that extends therethrough in the up-down direction (D11). The stud423threadably engages the threaded hole the threaded insert member422(i.e., the stud423is inserted into the brake member421), projects out of a top end of the threaded insert member422(i.e., the stud423projects out of a top end of the brake member421), and abuts against a bottom end of the moving rod41.", "", "The brake member421is located in the protection seat24, and is surrounded by the surrounding wall242of the protection seat24. The brake member421includes a top wall section424, a cylinder body section425, and two brake wall sections426. The top wall section424is configured to be annular. The cylinder body section425extends downwardly from a center of the top wall section424, and is configured to be a hollow cylinder that extends in the up-down direction (D11). The brake wall sections426are spaced apart from each other in the left-right direction and extend downwardly from the top wall section424.", "", "The top wall section424abuts against the top end of the resilient member25of the protection subunit23such that the resilient member25abuts against the top wall section424and the protection seat24in the up-down direction (D11) and resiliently biases the top wall section424upwardly away from the protection seat24. The cylinder body section425is inserted into the first insertion hole246of the protection seat24. The threaded insert member422is inserted into the cylinder body section245such that the stud423is inserted into the brake member421(i.e., the cylinder body section245accommodates the threaded insert member422and the stud423).", "", "Each of the brake wall sections426extends in the up-down direction (D11), extends in a circumferential direction of the top wall section424, and is spaced apart from the cylinder body section425in a radial direction of the top wall section424. It should be noted that, the circumferential direction of the top wall section424is defined to be identical to the circumferential direction (D12) and will also be referred to as “the circumferential direction (D12)” hereinafter, and the radial direction of the top wall section424is defined to be identical to the radial direction of the pipe leg9and will be referred to as “the radial direction” hereinafter. The brake wall sections426cooperatively surround the cylinder body section425(seeFIGS.6and7), and are respectively inserted into the second insertion holes247(seeFIGS.6and8). The stud423is threadedly inserted into the threaded insert member422, and a bottom portion thereof is formed with a hexagonal wrench hole427(seeFIG.7) and is for insertion of a hex wrench so that the stud423is operable to move relative to the threaded insert member422when the hex wrench is inserted into the wrench hole427to rotate the stud423.", "", "The disc member43includes a disc main body431, a plurality of tooth blocks432, and two engaging blocks433. The disc main body431is in a shape of a disc. The tooth blocks432extend downwardly from the disc main body431, are arranged in the circumferential direction (D12), and are spaced apart from each other. The engaging blocks433extend upwardly from the disc main body431. The disc member43is welded to the bottom portion of the moving rod41so that the disc member43is irrotatable relative to the moving rod41and the mounting unit3in the circumferential direction (D12).", "", "The control unit5includes a transmission subunit51, a cam member52, a restraining rod53, and a resilient component54. The transmission subunit51is mounted to a top end of the moving rod41via the thread formed at the top portion of the moving rod41, and is located in the outer casing tube322. The cam member52is mounted to the outer casing tube322, surrounds an axis that extends in the left-right direction, and is located above the transmission subunit51. The restraining rod53is located above the cam member52, extends in the left-right direction, and is inserted into the half tube sections324of the outer casing tube322in the left-right direction. The resilient component54abuts against the transmission subunit51and a top end of the inner casing tube321in the up-down direction (D11).", "", "The transmission subunit51includes a transmission member511that surrounds and that is threadedly mounted to the top end of the moving rod41, and a transmission rod512that extends in the left-right direction and that is mounted to a top end of the transmission member511. The cam member52is operable to push the transmission rod512downwardly such that the transmission subunit51is urged to move downwardly and urges the moving rod41to move downwardly.", "", "The cam member52is formed with a cam hole521that extends therethrough in the left-right direction, and that has a hexagonal cross section. When a driving pin (P14) (seeFIG.4) is inserted into the cam member52, the cam member52rotates upon rotation of the driving pin (P14) (i.e., the driving pin (P14) urges the cam member52to co-rotate). Since the technique for urging the moving rod41to move in the up-down direction is widely-understood by those skilled in the art, a detailed description of a shape of the cam member52is omitted. When the cam member52rotates, the cam member52pushes the transmission rod512downwardly such that the transmission rod512urges the transmission member511and the moving rod41to move downwardly. The resilient component54resiliently biases the transmission member511upwardly relative to the inner casing tube321such that the movable rod41is urged to move upwardly relative to the inner casing tube321by the transmission member511when the transmission rod512is free from a pushing force of the cam member52, or when the cam member52is rotated to a certain position that provides sufficient space for the transmission rod512to move upwardly.", "", "Referring further toFIGS.10and11, in cooperation withFIG.5, the braking unit4is movable relative to the mounting unit3, the wheel seat subunit21, and the protection subunit23in the up-down direction (D11) among an initial position (seeFIG.5), an orienting position (seeFIG.10), and a braking position (seeFIG.11).", "", "Referring toFIGS.4to6again, when the embodiment is inserted and mounted into the pipe leg9, the outer casing tube322and the pipe leg9are fixedly assembled by the second pins (P12), the inner casing tube321and the outer casing tube322are fixedly assembled by the third pins (P13), the moving rod41and the inner casing tube321are coupled to each other via non-circular structures, and the disc member43is fixedly welded to the moving rod41. Therefore, in this embodiment, the outer casing tube322, the inner casing tube321, the moving rod41, and the disc member43is irrotatable in the circumferential direction (D12) relative to the pipe leg9.", "", "Referring toFIGS.4to6again, when the braking unit4is in the initial position, the disc member43of the braking unit4is spaced apart from the top seat wall211of the wheel seat subunit21and the restraining member27of the protection subunit23in the up-down direction (D11) (i.e., the disc member43is located between the top seat wall211and the restraining member27). Thus, the engaging blocks433of the disc member43do not engage the engaging grooves214of the wheel seat subunit21(i.e., the engaging blocks433are separated from the engaging grooves214), and the tooth blocks432of the disc member43do not engage the through holes273of the restraining member27. At this time, the brake subunit42of the braking unit4is spaced apart from the caster subunit22in the up-down direction (D11). Movement of the caster unit2is not refrained by the braking unit4. Therefore, the wheel seat subunit21, the protection subunit23, and the caster subunit22are rotatable relative to the mounting unit3and the braking unit4in the circumferential direction (D12), and the caster subunit22may roll on the ground.", "", "With regard toFIGS.4,5, and10again, when the braking unit4is in the initial position, the cam member52is in a first position (seeFIG.5). Upon the rotation of the driving pin P14(seeFIG.4), the cam member52rotates accordingly. When the cam member52rotates to a second position (seeFIG.10), the resilient member25of the protection subunit23and the resilient component54of the control unit5respectively push the brake subunit42of the braking unit4and the transmission member511of the control unit5upwardly, thereby urging the braking unit4to move upwardly to the orienting position as shown inFIG.10.", "", "When the braking unit4is in the orienting position, the disc member43of the braking unit4engages the top seat wall211of the wheel seat subunit21. Specifically, the engaging blocks433of the disc member43engage the engaging grooves214of the top seat wall211such that the wheel seat subunit21is refrained from rotating relative to the disc member43in the circumferential direction (D12) by the disc member43, thereby refraining the wheel seat subunit21, the caster subunit22, and the protection subunit23from rotating relative to the mounting unit3in the circumferential direction (D12). Thus, motion of the embodiment is oriented in one direction.", "", "In addition, when the braking unit4is in the orienting position, the disc member43is spaced apart from the restraining member27of the protection subunit23. Specifically, the tooth blocks432of the disc member43do not engage the through holes273of the restraining member27. The brake subunit42of the braking unit4is spaced apart from the caster subunit22in the up-down direction, such that the caster subunit22is rollable on the ground. That is to say, when the braking unit4is in the orienting position, the embodiment is not braked but is oriented to move in a specific direction.", "", "Referring toFIGS.4,5, and11again, when the cam member52is in the first position (seeFIG.5), the cam member52may rotate reversely upon reverse rotation of the driving pin P14(seeFIG.4). When the cam member52rotates to a third position (seeFIG.11), the cam member52urges the moving rod41to move downwardly via the transmission rod512and the transmission member511, thereby urging the disc member43to move toward the restraining member27of the protection subunit23. When the moving rod41is moved downwardly, the moving rod41pushes the brake subunit42toward the caster subunit22, such that the brake member421is moved downwardly toward the caster subunit22, and that the braking unit4is urged to move to the braking position.", "", "Referring toFIGS.4,9, and11again, when the braking unit4is in the braking position, the disc member43engages the restraining member27. Specifically, two of the tooth blocks432of the disc member43are respectively inserted into the through holes273of the restraining member27. The engaging blocks433are separated from the engaging grooves214(i.e., the disc member43is spaced apart from the top seat wall211in the up-down direction (D11)). As such, because the restraining member27is riveted to the bottom wall241of the protection seat24and is inserted into the surrounding wall242of the protection seat24, the protection seat24, the wheel seat subunit21, and the caster subunit22are refrained from rotating in the circumferential direction (D12) by the disc member43. The motion of the embodiment is oriented in one direction. At this time, the brake wall sections426of the brake member421project out of the protection seat24to be in touch with the caster subunit22and to refrain the caster subunit22from rotating (i.e., the caster subunit22is refrained from rolling on the ground when the brake wall sections426abut against the caster subunit22). Therefore, when the braking unit4is in the braking position, the embodiment is not rotatable relative to the pipe leg9, and is not rollable on the ground. That is to say, the embodiment is oriented in one direction when braked.", "", "Referring toFIGS.5,10, and11again, the embodiment offers several benefits as follows. When the braking unit4is in any one of the initial position, the orienting position, and the braking position, the disc member43is covered by the protection seat24. Therefore, even the caster subunit22may be sullied by some dirty objects (e.g., hair), the disc member43may still be clear of the accumulation of the dirty objects. Furthermore, when the braking unit4is in any one of the initial position and the orienting position, the braking unit4is retracted into the protection subunit23and is spaced apart from the caster subunit22. Specifically, most of the brake member421is retracted into the protection seat24when the braking unit is in any one of the initial and orienting positions. Therefore, the objects on the caster subunit22may not easily accumulate on the brake member421. That is to say, by virtue of the protection seat24that is located between the wheel seat subunit21and the caster subunit22in the up-down direction (D11) covering the disc member43and the brake member421, the accumulation of dirty objects in the embodiment is prevented. Even if the brake wall sections426of the brake member421are stuck with the dirty objects that are on the caster subunit22when braking unit4is in the braking position, by virtue of the shapes of the second insertion holes247respectively corresponding to the shapes of the brake wall sections426, and by virtue of the brake wall sections426respectively being inserted into the second insertion holes247, the dirty objects on the brake wall sections426may be scraped off by the bottom wall241when the brake wall sections426are retracted into the protection seat24(i.e., when the braking unit4moves from the braking position to the initial position or to the orienting position). Thus, the dirty objects may not enter the protection seat24, thereby achieving prevention of the accumulation of dirty objects.", "", "Referring further toFIG.12, in cooperation withFIGS.7and11, the stud423of the brake subunit42is movable relative to the brake member421in the up-down direction (D11) when being rotated relative to the threaded insert member422. Thus, as shown inFIG.12, a distance (L11) between the top end of the brake member421and the bottom end of the moving rod41(i.e., a length that the stud423projects out of the brake member421) is adjustable according to rotational movement of the stud423relative to the brake member421. That is to say, a distance between the brake member421and the caster subunit22in the up-down direction (D11) is adjustable. Because the brake member421brakes the caster subunit22via friction when abutting against the cast subunit22, abrasion of the brake wall sections426is inevitable when the caster device has been used for a long time. Moreover, because the moving rod41may only be urged by the cam member52to move in the up-down direction (D11) within a certain range, the abrasion of the brake wall sections426may affect braking effectiveness of the embodiment. At this time, the caster subunit22may be temporarily detached from the wheel seat subunit21, and then the hex wrench may be inserted into the wrench hole427of the stud423through the first insertion hole246of the center wall portion243so that the stud423may be rotated relative to the brake member421and the threaded insert member422upon rotation of the hex wrench. Consequently, the distance (L11) may be adjusted to shorten the distance between the brake member421and the caster subunit22, thereby improving the braking effectiveness of the embodiment.", "", "Referring toFIGS.5,7and9again, by virtue of the side plate sections262of the protection member26covering the hole edges249, the hole edges249may be protected from being notched by the restraining member27when the interconnecting plate section272of the restraining member27moves relative to the protection seat24in the left-right direction.", "", "In summary, by virtue of protection provided by the protection subunit23, the dirty objects may not easily accumulate on the braking unit4. By virtue of the distance (L11) being adjustable, the braking effectiveness of the caster device may be improved even when the caster device has been used for a long time. The drawbacks of the prior art are thus alleviated.", "", "In the description above, for the purposes of explanation, numerous specific details have been set forth in order to provide a thorough understanding of the embodiment(s). It will be apparent, however, to one skilled in the art, that one or more other embodiments may be practiced without some of these specific details. It should also be appreciated that reference throughout this specification to “one embodiment,”“an embodiment,” an embodiment with an indication of an ordinal number and so forth means that a particular feature, structure, or characteristic may be included in the practice of the disclosure. It should be further appreciated that in the description, various features are sometimes grouped together in a single embodiment, figure, or description thereof for the purpose of streamlining the disclosure and aiding in the understanding of various inventive aspects; such does not mean that every one of these features needs to be practiced with the presence of all the other features. In other words, in any described embodiment, when implementation of one or more features or specific details does not affect implementation of another one or more features or specific details, said one or more features may be singled out and practiced alone without said another one or more features or specific details. It should be further noted that one or more features or specific details from one embodiment may be practiced together with one or more features or specific details from another embodiment, where appropriate, in the practice of the disclosure.", "", "While the disclosure has been described in connection with what is (are) considered the exemplary embodiment(s), it is understood that this disclosure is not limited to the disclosed embodiment(s) but is intended to cover various arrangements included within the spirit and scope of the broadest interpretation so as to encompass all such modifications and equivalent arrangements."], "claims": ["a caster unit including a wheel seat subunit, a caster subunit that is rotatably connected to a bottom end of the wheel seat subunit, and a protection subunit that is positioned in the wheel seat subunit and that is located between the wheel seat subunit and the caster subunit; a mounting unit mounted to the wheel seat subunit and adapted to be mounted to the pipe leg; and a braking unit extending through the protection subunit and the wheel seat subunit into the mounting unit, and movable relative to the mounting unit, the wheel seat subunit, and the protection subunit in an up-down direction between a braking position, in which the braking unit projects out of the protection subunit and is in contact with the caster subunit so that the caster subunit is refrained from rotating, and an initial position, in which the braking unit is retracted into the protection subunit and is spaced apart from the caster subunit.", "2 . The caster device as claimed in claim 1 , wherein the protection subunit includes a protection seat that is positioned in the wheel seat subunit, and a resilient member that is disposed in the protection seat, the braking unit including a moving rod that extends in the up-down direction and that extends through the wheel seat subunit into the mounting unit, and a brake subunit that abuts against a top end of the resilient member, that is inserted downwardly into the protection seat, and that is located below the moving rod, the moving rod being operable to move relative to the mounting unit and the wheel seat subunit in the up-down direction, when the moving rod is moved downwardly, the moving rod pushing the brake subunit toward the caster subunit so that the brake subunit projects out of the protection seat to be in contact with the caster subunit and to refrain the caster subunit from rotating, the resilient member resiliently biasing the brake subunit upwardly away from the protection seat.", "3 . The caster device as claimed in claim 2 , wherein the brake subunit includes a brake member that is inserted into the protection seat, and a stud that is inserted into the brake member, that projects out of a top end of the brake member, and that abuts against a bottom end of the moving rod, a distance between the top end of the brake member and the bottom end of the moving rod being adjustable according to rotational movement of the stud relative to the brake member.", "4 . The caster device as claimed in claim 3 , wherein the brake member includes a top wall section that is configured to be annular, a cylinder body section that extends downwardly from the top wall section, that is configured to be hollow, and that accommodates the stud, and at least one brake wall section that extends downwardly from the top wall section, the cylinder body section and the at least one brake wall section being inserted into the protection seat, when the braking unit is in the braking position, the at least one brake wall section being operable to project out of the protection seat to be in contact with the caster subunit and to refrain the caster subunit from rotating, the resilient member of the protection subunit abutting against the top wall section and the protection seat in the up-down direction, and resiliently biasing the top wall section upwardly away from the protection seat.", "5 . The caster device as claimed in claim 4 , wherein the at least one brake wall section includes a plurality of brake wall portions that cooperatively surround the cylinder body section, each of the brake wall portions extending in a circumferential direction of the top wall section, and being spaced apart from the cylinder body section in a radial direction of the top wall section, the protection seat including a bottom wall on which the resilient member is disposed, and a surrounding wall that extends upwardly from the bottom wall and that surrounds the brake member, the bottom wall being formed with a first insertion hole that extends in the up-down direction and a plurality of second insertion holes each of which extends in the up-down direction, the cylinder body section being inserted into the first insertion hole, the brake wall portions being respectively inserted into the second insertion holes.", "6 . The caster device as claimed in claim 2 , wherein the mounting unit is adapted to be irrotatable relative to the pipe leg in a circumferential direction of the pipe leg, the moving rod being irrotatable relative to the mounting unit in the circumferential direction of the pipe leg, the protection seat including a bottom wall into which the brake subunit is inserted, and a surrounding wall that extends upwardly from the bottom wall and that surrounds the brake subunit, the protection subunit further including a restraining member that is mounted to the bottom wall and that extends into the surrounding wall, the braking unit further including a disc member that is mounted to a bottom portion of the moving rod and that is irrotatable relative to the moving rod and the mounting unit in the circumferential direction of the pipe leg, the disc member being located between the wheel seat subunit and the protection seat in the up-down direction, and being operable to engage the restraining member such that the wheel seat subunit, the protection seat, and the caster subunit are refrained from rotating in the circumferential direction of the pipe leg.", "7 . The caster device as claimed in claim 6 , wherein the surrounding wall is formed with a restraining hole that extends through the surrounding wall and that extends in the circumferential direction of the pipe leg, and two hole edges that are located at two opposite sides of the restraining hole in the circumferential direction of the pipe leg, the restraining member being inserted into the restraining hole, the protection subunit further including a protection member that covers the hole edges.", "8 . The caster device as claimed in claim 6 , wherein the wheel seat subunit includes a top seat wall, and two lateral seat walls that extend downwardly from the top seat wall, the caster subunit being rotatably connected to the lateral seat walls, the braking unit being movable further to an orienting position, in which the disc member engages the top seat wall such that the wheel seat subunit and the caster subunit are refrained from rotating relative to the mounting unit in the circumferential direction of the pipe leg, the disc member being spaced apart from the top seat wall in the up-down direction when the braking unit is in any one of the braking position and the initial position.", "9 . The caster device as claimed in claim 8 , wherein the top seat wall of the wheel seat subunit has a top seat hole that extends through the top seat wall in the up-down direction, and an engaging groove that extends radially outwardly from the top seat hole, the disc member including an engaging block that extends upwardly, the engaging block engaging the engaging groove when the braking unit is in the orienting position, the engaging block being separated from the engaging groove when the braking unit is in any one of the initial position and the braking position.", "10 . The caster device as claimed in claim 2 , wherein the mounting unit includes a bearing subunit that is disposed on a top end of the wheel seat subunit, and a casing subunit that is inserted into the bearing subunit and that is adapted to be inserted into the pipe leg, the wheel seat subunit being rotatable relative to the casing subunit via the bearing subunit, the casing subunit including an inner casing tube and an outer casing tube that is sleeved on a top portion of the inner casing tube, a bottom portion of the inner casing tube protruding from the outer casing tube and being inserted into the bearing subunit, the moving rod extending through the inner casing tube, the caster device further comprising a control unit that includes a transmission subunit mounted to a top end of the moving rod and located in the outer casing tube, a resilient component abutting against the transmission subunit and the inner casing tube in the up-down direction, and a cam member mounted to the outer casing tube, surrounding an axis orthogonal to the up-down direction, and located above the transmission subunit, the cam member being operable to push the transmission subunit downwardly to urge the moving rod to move downwardly, the resilient component resiliently biasing the transmission subunit upwardly such that the moving rod is urged to move upwardly by the transmission subunit when the transmission subunit is free from a pushing force of the cam member."], "bibtex": "@patent{20240300263,\n    title = {CASTER DEVICE},\n    number = {20240300263},\n    year = {2024},\n    note = {File: US20240300263A1-20240912.XML}\n    }", "classification": "B60B3300FI"}, {"title": "SPOKE FOR NON-PNEUMATIC TIRE HAVING EXTENDED NOSE REINFORCEMENT", "doc_number": "20240300264", "filename": "US20240300264A1-20240912.XML", "abstract": "A spoke for a non-pneumatic tire is provided that has a nose that engages first and second panels that extend from the nose. An extended nose reinforcement engages the first panel, the second panel, a first foot, and a second foot. Also, the extended nose reinforcement is located between the first panel and the first foot and is located between the second panel and the second foot.", "detailed_description": ["Reference will now be made in detail to embodiments of the invention, one or more examples of which are illustrated in the drawings. Each example is provided by way of explanation of the invention, and not meant as a limitation of the invention. For example, features illustrated or described as part of one embodiment can be used with another embodiment to yield still a third embodiment. It is intended that the present invention include these and other modifications and variations.", "", "The present invention provides for a spoke12of a non-pneumatic tire10that includes an extended nose reinforcement14that is configured to avoid the introduction of a stress concentration at its radial ends. In this regard, the spoke12has first and second panels, that lay against a nose28, with feet20,22on their ends. The extended nose reinforcement14reinforces the spoke12at the nose28and extends from the first foot20across both panels16,18to the second foot22. The extended nose reinforcement14terminates at a location that is between both the first panel16and the first foot20and terminates at a location that is between both the second panel18and the second foot22. These locations of the terminal ends72,74are low stress areas in the operation of the spoke12and stress concentration cracks and failures at the terminal ends72,74of the extended nose reinforcement14are reduced or eliminated.", "", "FIG.1shows a non-pneumatic tire10. The non-pneumatic tire10has an axis34at its center about which it rotates, and a radial direction30extends from the axis34. Tread70is located on the outer exterior of a shear band38and extends all the way around the non-pneumatic tire10in the circumferential direction40. The shear band38is located inward in the radial direction30from the tread70and likewise extends 360 degrees around the axis34in the circumferential direction40. A series of spokes12engage the shear band38and extend inward in the radial direction30from the shear band38to a hub36of the non-pneumatic tire10. The hub36features a metal cage66about its outer surface and the ends of the spokes12fit into this metal cage66to cause attachment of the spokes12to the hub36. Any number of spokes12can be present, and their cross-sectional shape can be different from that shown. In some instances, between 64-80 spokes12are present in the non-pneumatic tire10. The hub36is located inward from the spokes12in the radial direction30and can be mounted onto a wheel of the vehicle. The spokes12at the top of the non-pneumatic tire10are in tension, and the spokes12at the bottom are in compression as the non-pneumatic tire10rests on the ground and as the non-pneumatic tire10turns in normal operation of the vehicle.", "", "One embodiment of the spoke12is shown inFIG.2which is a side view of one of the spokes12and portions of the hub36and shear band38. The spoke12is made of multiple components attached to one another, and these components can be made of rubber and other materials. The spoke12assumes a V-shaped configuration and extends all the way from the hub36to the shear band38in the radial direction30. The spoke12includes a pair of legs, which are referred to herein as a first panel16and a second panel18. The panels16and18may engage or not engage one another, and in some embodiments the panels16and18may be a single continuous piece in which different sections of this continuous piece are designated as a first panel16and second panel18or can be separate pieces as inFIG.2. First and second feet20,22are at the ends of the panels16,18. A nose28is located at the central body of the spoke12and has a generally triangular shaped cross-section. The spoke12can be assembled by taking uncured, multiple components and assembling them together and then subsequently curing them through heat and pressure so that the components are attached to one another. Each one of these components can include different materials or can have the same materials in different amounts or in the same amount. Rubber, fiberglass, urethane, polyurethane and other materials may be present in the components used to assemble the spoke12.", "", "The components of the spoke12include a first panel16and a second panel18that make up the legs of the spoke12. The first panel16has the first foot20located on one end that engages the first panel16and extends farther in the radial direction30than the terminal end of the first panel16. The second panel18has a second foot22on one end that engages the second panel18and extends farther inward in the radial direction30than the terminal end of the second panel18. The nose28is present on one side of the spoke12in the circumferential direction40and engages the first and second panels16,18. To reinforce the spoke12at its center section, an extended nose reinforcement14is provided and engages both the first and second panels16,18. The extended nose reinforcement14is on opposite sides of the panels16,18in the circumferential direction40from the nose28. The extended nose reinforcement14engages the body28as well as the panels16,18, but in other embodiments the extended nose reinforcement14does not engage (contact) the body28. It is to be understood that the shape and size of the spoke12can be varied in accordance with different exemplary embodiments, and that a variety of spoke12configurations are possible.", "", "The extended nose reinforcement14is a single, continuous piece that extends all the way from the first foot20to the second foot22. A terminal end72is located at the outer end of the extended nose reinforcement14in the radial direction30, and a terminal end74is located at the inner end in the radial direction30. The terminal end72is located between the first foot20and the first panel16so that it goes under the first foot20upon extension from the center of the spoke12. The extended nose reinforcement14does not go all the way to the radial end of the first panel16, but instead stops short of the radial end of the first panel16so that the first foot20does engage the first panel16. The positioning of the terminal end72may be such that a longer length of the first foot20engages the first panel16as compared to the length of engagement of the first foot20with the extended nose reinforcement14. The area of the terminal end72in the spoke12is an area of low stress in the spoke12during operation. As such, cracks and other failures of the spoke12at the terminal end72of the extended nose reinforcement14will be reduced or minimized because the terminal end72is no longer located at a high stress position in the spoke12. The arrangement of the terminal ends72,74under the feet20,22increases the endurance of the design. The placement of the terminal ends72,74under the feet20,22locates them in a low stress zone, as compared to being located on the panels16,18but not in engagement with the feet20,22closer to the nose28.", "", "The terminal end74is located between the second foot22and the second panel18so that it goes under the second foot22upon extension from the center of the spoke12. The extended nose reinforcement14does not go all the way to the radial end of the second panel18which is closest to the hub36, but instead stops short of the radial end of the second panel18so that the second foot22does engage the second panel18. The positioning of the terminal end74may be such that a longer length of the second foot22engages the second panel18as compared to the length of engagement of the second foot22with the extended nose reinforcement14. The area of the terminal end74in the spoke12is an area of low stress in the spoke12during operation. As such, cracks and other failures of the spoke12at the terminal end74of the extended nose reinforcement14will be reduced or minimized because the terminal end74is no longer located at a high stress position in the spoke12.", "", "The first foot20can be variously shaped in accordance with different exemplary embodiments. In the embodiment presented inFIG.2, the first foot20has a first foot glue surface54that engages the inner radial surface of the shear band38and may be attached thereto though the use of adhesive. A first foot first concave surface56is present on a circumferential end of the first foot20and may be defined at least partially by a lip that likewise defines a portion of the first foot glue surface54. The first foot first concave surface56may extend all the way to the first panel16or could stop short of the surface of the first foot20that engages the first panel16. The first foot20also has a first foot second concave surface58located on an opposite end of the first foot20in the circumferential direction40from the first foot first concave surface56. The first foot second concave surface58may extend all the way to the extended nose reinforcement14or could stop short of the surface of the first foot20that engages the extended nose reinforcement14. The radius of curvature of the first foot second concave surface58can be different than the radius of curvature of the first foot first concave surface56. The first foot second concave surface58may extend all the way to the shear band38or may stop short of the shear band38as shown inFIG.2. The two concave surfaces56,58may extend different lengths in the radial direction30such that the first foot first concave surface56extends a shorter length in the radial direction30than does the first foot second concave surface58.", "", "The second foot22can be arranged in the same manner as the first foot20or can be arranged in a different shape in other embodiments. In theFIG.2embodiment, the second foot22is shaped generally in the same manner as the first foot20. The second foot22has a second foot glue surface60that is concave in shape, as opposed to the convex shaped first foot glue surface54, that engages the convex shaped outer radial end of the hub36. Adhesives can be used to attach the second foot glue surface60to the hub36. A second foot first concave surface62is present on a circumferential end of the second foot22and may be defined at least partially by a lip that likewise defines a portion of the second foot glue surface60. The second foot first concave surface62may extend all the way to the second panel18or could stop short of the surface of the second foot22that engages the second panel18. The second foot22also has a second foot second concave surface64located on an opposite end of the second foot22in the circumferential direction40from the second foot first concave surface62. The second foot second concave surface64may extend all the way to the extended nose reinforcement14or could stop short of the surface of the second foot22that engages the extended nose reinforcement14. The radius of curvature of the second foot second concave surface64can be different than the radius of curvature of the second foot first concave surface62. The second foot second concave surface64may extend all the way to the hub36or may stop short of the hub36as shown inFIG.2. The two concave surfaces62,64may extend different lengths in the radial direction30such that the second foot first concave surface62extends a shorter length in the radial direction30than does the second foot second concave surface64.", "", "The spoke12will become deformed during normal operation of the tire10but can maintain a generally V shape at all points in operation. In this regard, the panels16,18are arranged in a generally V shape with the feet20,22at either ends. The first panel16has a first panel first surface46and an oppositely disposed first panel second surface48. The first panel first surface46engages the extended nose reinforcement14and the first foot20and is free from contact with the nose28, and the first panel second surface48engages the nose28and is free from contact with the first foot20and the extended nose reinforcement14. The second panel18has a second panel first surface50and an oppositely disposed second panel second surface52. The second panel first surface50engages the extended nose reinforcement14and the second foot22and does not engage the nose28, and the second panel second surface52is free from engagement with the extended nose reinforcement14and the second foot22but does engage the nose28. The first panel second surface48faces the second panel second surface52in the V shaped configuration, and the first panel first surface46and the second panel first surface50face away from one another in the V shaped configuration. As shown the extended nose reinforcement14engages the entire first panel first surface46and second panel first surface50except for the portions of these surfaces46,50that engage the feet20and22.", "", "FIG.3is a cross-sectional view taken along line3-3ofFIG.2that shows the extended nose reinforcement14including a plurality of cords42that are parallel to one another. The cords42may engage one another or can be spaced from one another. The cords42may be embedded within rubber of the extended nose reinforcement14, that makes up the rest of the extended nose reinforcement14, so that none of the cords42are present on the exterior surface of the extended nose reinforcement14. The rubber of the extended nose reinforcement14may make up all of the exterior surfaces of the extended nose reinforcement14. The cords42can be made of nylon or polyester. The cords42function to strengthen the extended nose reinforcement14and may be present in any number in other embodiments and may be absent in yet other embodiments of the spoke12. The panel18likewise has cords68that are parallel to one another and spaced from and out of engagement with one another. The cords68can also be made of nylon, polyester, or fiberglass (CVR) and may be embedded in rubber making up the rest of the second panel18so that none of the cords68form any part of the exterior surfaces of the second panel18. The cords68function to increase the strength of the second panel18but need not be present in other embodiments. Although not shown, the first panel16can likewise have parallel cords within it for added strength.", "", "The spoke12has an axial direction32that is perpendicular to the radial direction30. The components of the spoke12such as the first foot20, second foot22, first panel16, second panel18, nose28, and extended nose reinforcement14may extend along the entire axial length of the spoke12in the axial direction32. In this regard, the extended nose reinforcement14has the same length in the axial direction32as does the feet20,22and the panels16,18so that large attachment surfaces are present between the extended nose reinforcement14and these components.", "", "FIG.4is a front view of the spoke12and a cross-sectional view of the hub36, shear band38and tread70. The shear band38has multiple reinforcement elements that extend in the circumferential direction40and that are embedded within rubber of the shear band38. The tread70rests on the outer radial surface of the shear band38. The extended nose reinforcement14and the feet20,22of the spoke12are the only components of the spoke12that can be seen in theFIG.4view. The cords42are also shown inFIG.4, and these cords42again have a zero angle with respect to the radial direction30and thus extend in a direction that is parallel to the radial direction30. The cords42extend in the extended nose reinforcement14from the second foot22to the first foot20. This extension is in the radial direction30, and also in the circumferential direction40, but is not in the axial direction32. With respect to the radial direction30, the cords42are parallel to the radial direction30so that the angle44between the direction of cord42extension and the radial direction30is zero. The cords42can all be parallel to one another so that they all have an angle44that is zero.", "", "The arrangement of cords42that have an angle44that is zero degrees, hence parallel to the radial direction30, does not adversely impact the lateral stiffness of the spoke12beyond a desirable level. This is because the stiffness of the cords42will be directed in the radial direction30and not in the axial direction32because there is no component of extension of the cords42in the axial direction32. The spoke12can be arranged so that only a single extended nose reinforcement14is present, and not two or more nose reinforcements. The use of but a single extended nose reinforcement14will decrease mass of the spokes12and will improve rolling resistance performance.", "", "FIG.5is an alternative exemplary embodiment of the spoke12that includes all of the components of theFIG.2embodiment but are arranged in somewhat different manners. The first foot first and second concave surfaces56,58both extend all the way from the extended nose reinforcement14to the first foot glue surface54. Likewise, the second foot first and second concave surfaces62,64extend all the way from the extended nose reinforcement14to the second foot glue surface60. The feet20,22do not have the lips associated with the glue surfaces54,60. Also, the first and second panels16,18engage one another, and the nose28is free from engagement with the extended nose reinforcement14. The extended nose reinforcement14extends all the way to the end of the first and second panels16,18so that the terminal ends72and74are both visible and not hidden from view by the feet20,22. The extended nose reinforcement14extends along the entire lengths of the panels16,18so that the entire first panel first surface46and the entire second panel first surface50are engaged by the extended nose reinforcement14. The extended nose reinforcement14extends along and engages the feet20,22so that the foot20does not engage either of the panels16or18, and so that the foot22does not engage panel16or panel18. In this embodiment, the component of the spoke12that the feet20,22engage is the extended nose reinforcement14. In other embodiments, the extended nose reinforcement14can wrap around the ends of the first and second panels16,18so that the terminal ends72,74are located at the inside facing faces of the panels16,18. The extended nose reinforcement14if wrapping around the ends of the first and second panels16,18can stop short of contacting the nose28or the terminal ends72,74could in fact engage the nose28.", "", "A still further arrangement of the spoke12is illustrated inFIG.6in perspective view. The extended nose reinforcement14engages the panels16and18, along with the feet20and22, but does not engage the nose28. The panels16and18are shown as being a single, continuous panel in which the first and second panels16,18are defined so as to be parts of this single, continuous panel. As such, it is to be understood that the panels16and18may be separate components in some embodiments and may be parts or areas of a single component in yet other embodiments. The extended nose reinforcement14as shown has terminal ends72,74that engage the feet20,22so that the feet20,22are able to engage the panels16and18. The terminal ends72,74are arranged so that a longer engagement is between the panels16,18and the feet20,22as compared to the engagement between the extended nose reinforcement14and the feet20,22.", "", "The spoke12inFIG.6includes two additional components which are the first foot layer24and the second foot layer26. The layers24,26can be made of rubber and may have the same material compositions as other components of the spoke12or may have a unique mixture of materials from the rest of the spoke12. The first foot layer24engages the first panel second surface48and wraps around the end of the first panel16and a portion of the first foot20and engages the first foot20. The first foot layer24does not wrap around the entire first foot20, but only a portion thereof. The first foot layer24functions to increase the strength of the spoke12at its end, and the first foot layer24may engage the shear band38and be attached thereto, while none or in some instances some of the first foot20may also engage and be attached to the shear band38along with the first foot layer24. A second foot layer26engages the second panel second surface52and wraps around and engages the second foot22but does not wrap completely around the second foot22so that some of the second foot22is left exposed. The second foot layer26increases the strength of the end of the spoke12and can engage the outer radial surface of the hub36and be attached thereto. In this instance, some or none of the second foot22will also be attached to the hub36.", "", "While the present subject matter has been described in detail with respect to specific embodiments and methods thereof, it will be appreciated that those skilled in the art, upon attaining an understanding of the foregoing may readily produce alterations to, variations of, and equivalents to such embodiments. Accordingly, the scope of the present disclosure is by way of example rather than by way of limitation, and the subject disclosure does not preclude inclusion of such modifications, variations and/or additions to the present subject matter as would be apparent."], "claims": ["a nose; a first panel that engages the nose and that extends from the nose; a second panel that engages the nose and that extends from the nose, wherein the first panel and the second panel are separate pieces; a first foot; a second foot; and an extended nose reinforcement that is a single, continuous piece that engages the first panel, the second panel, the first foot, and the second foot, wherein the extended nose reinforcement is located between the first panel and the first foot, wherein the extended nose reinforcement is located between the second panel and the second foot.", "2 . The spoke as set forth in claim 1 , wherein the extended nose reinforcement has a plurality of cords that are oriented at a zero degree angle to a radial direction.", "3 . The spoke as set forth in claim 2 , wherein the plurality of cords are made of nylon.", "4 . The spoke as set forth in claim 2 , wherein the plurality of cords are made of polyester.", "a first foot layer that engages the first panel and the first foot; and a second foot layer that engages the second panel and the second foot.", "6 . The spoke as set forth in claim 1 , wherein the first panel has a first panel first surface and a first panel second surface, wherein the second panel has a second panel first surface and a second panel second surface, wherein the first panel and the second panel are oriented into a V shape, wherein the first panel first surface and the second panel first surface are oriented so as to face away from one another, wherein the first panel second surface and the second panel second surface are oriented so as to face towards one another, and wherein the extended nose reinforcement engages the first panel first surface and the second panel first surface.", "7 . The spoke as set forth in claim 6 , wherein the nose engages the first panel second surface and the second panel second surface.", "wherein the second foot has a second foot glue surface, a second foot first concave surface, and a second foot second concave surface, wherein the second foot second concave surface terminates at the extended nose reinforcement.", "9 . The spoke as set forth in claim 8 , wherein the first foot first concave surface terminates at the extended nose reinforcement, wherein the second foot first concave surface terminates at the extended nose reinforcement.", "10 . The spoke as set forth in claim 1 , wherein the first foot does not engage the first panel and does not engage the second panel, and wherein the second foot does not engage the first panel and does not engage the second panel.", "11 . The spoke as set forth in claim 1 , wherein the first foot engages the first panel and does not engage the second panel, and wherein the second foot engages the second panel and does not engage the first panel.", "12 . The spoke as set forth in claim 1 , wherein the extended nose reinforcement is a continuous piece that extends uninterrupted from the first foot to the second foot.", "13 . The spoke as set forth in claim 1 , wherein the extended nose reinforcement engages the nose.", "a nose; a first panel that engages the nose and that extends from the nose; a second panel that engages the nose and that extends from the nose; a first foot; a second foot; and an extended nose reinforcement that engages the first panel, the second panel, the first foot, and the second foot, wherein the extended nose reinforcement is located between the first panel and the first foot, wherein the extended nose reinforcement is located between the second panel and the second foot; wherein the first foot has a first foot glue surface, a first foot first concave surface, and a first foot second concave surface, wherein the first foot second concave surface terminates at the extended nose reinforcement; wherein the second foot has a second foot glue surface, a second foot first concave surface, and a second foot second concave surface, wherein the second foot second concave surface terminates at the extended nose reinforcement.", "a nose; a first panel that engages the nose and that extends from the nose; a second panel that engages the nose and that extends from the nose; a first foot; a second foot; and an extended nose reinforcement that engages the first panel, the second panel, the first foot, and the second foot, wherein the extended nose reinforcement is located between the first panel and the first foot, wherein the extended nose reinforcement is located between the second panel and the second foot; wherein the first foot engages the first panel and does not engage the second panel, and wherein the second foot engages the second panel and does not engage the first panel."], "bibtex": "@patent{20240300264,\n    title = {SPOKE FOR NON-PNEUMATIC TIRE HAVING EXTENDED NOSE REINFORCEMENT},\n    number = {20240300264},\n    year = {2024},\n    note = {File: US20240300264A1-20240912.XML}\n    }", "classification": "B60C714FI"}, {"title": "TIRE AND PRODUCTION METHOD FOR TIRE", "doc_number": "20240300265", "filename": "US20240300265A1-20240912.XML", "abstract": "A tire 2 includes a tread 4 , a belt 16 , and a band 18 . The belt 16 includes belt cords 44 . The band 18 includes band cords 60 . The band 18 is composed of a band strip 58 . The band strip 58 is a cord array in which the band cords 60 are arranged. A zone from a first end to a second end of the belt 16 is a control zone. Residual tension of the band cords 60 in the control zone is not less than 15.0 N. The control zone includes a crown zone and a pair of shoulder zones. Residual tension of the band cords 60 in the crown zone is higher than residual tension of the band cords 60 in each shoulder zone. A shape index of a reference ground-contact surface of the tire 2 is not less than 1.00 and not greater than 1.30.", "detailed_description": ["The following will describe in detail the present invention based on preferred embodiments with appropriate reference to the drawings.", "", "A tire of the present disclosure is fitted on a rim. The inside of the tire is filled with air to adjust the internal pressure of the tire. The tire fitted on the rim is also referred to as tire-rim assembly. The tire-rim assembly includes the rim and the tire fitted on the rim.", "", "In the present disclosure, a state where a tire is fitted on a normal rim, the internal pressure of the tire is adjusted to a normal internal pressure, and no load is applied to the tire is referred to as a normal state.", "", "In the present disclosure, unless otherwise specified, the dimensions and angles of each component of the tire are measured in the normal state.", "", "The dimensions and angles of each component in a meridian cross-section of the tire, which cannot be measured in a state where the tire is fitted on the normal rim, are measured in a cut plane of the tire obtained by cutting the tire along a plane including a rotation axis. In this measurement, the tire is set such that the distance between right and left beads is equal to the distance between the beads in the tire that is fitted on the normal rim. The configuration of the tire that cannot be confirmed in a state where the tire is fitted on the normal rim is confirmed in the above-described cut plane.", "", "The normal rim means a rim specified in a standard on which the tire is based. The “standard rim” in the JATMA standard, the “Design Rim” in the TRA standard, and the “Measuring Rim” in the ETRTO standard are normal rims.", "", "The normal internal pressure means an internal pressure specified in the standard on which the tire is based. The “highest air pressure” in the JATMA standard, the “maximum value” recited in the “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, and the “INFLATION PRESSURE” in the ETRTO standard are normal internal pressures.", "", "A normal load means a load specified in the standard on which the tire is based. The “maximum load capacity” in the JATMA standard, the “maximum value” recited in the “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, and the “LOAD CAPACITY” in the ETRTO standard are normal loads.", "", "In the present disclosure, a green tire is an uncrosslinked tire. The green tire is also referred to as raw cover. The tire is obtained by vulcanizing a green tire. The green tire is vulcanized by heating and pressurizing the green tire in a mold. The tire is a crosslinked molded product of the green tire.", "", "In the present disclosure, a tread portion of the tire is a portion of the tire that comes into contact with a road surface. A bead portion is a portion of the tire that is fitted to a rim. A sidewall portion is a portion of the tire that extends between the tread portion and the bead portion. The tire includes a tread portion, a pair of bead portions, and a pair of sidewall portions as portions thereof.", "", "A center portion of the tread portion is also referred to as crown portion. A portion of the tread portion at an end thereof is also referred to as shoulder portion.", "", "In the present disclosure, residual tension of a band cord is obtained from a band, which is a component of the tire, in the following manner.(1) A band test piece having a width of 10 mm is sampled from the band of a new tire, and the length of the band test piece is measured.(2) The band test piece is humidity-controlled for 21 to 27 hours in an atmosphere adjusted to have a temperature of 18 to 22° C. and a humidity of 61 to 69%, and the length of the band test piece is measured after the humidity control. The amount of change in the length of the band test piece before and after the humidity control is obtained.(3) A band cord is sampled from the band test piece whose length was measured after humidity control, and a tensile test of the band cord is conducted in accordance with JIS L 1017 to obtain a stress-strain curve of the band cord.(4) In the stress-strain curve of the band cord, the stress corresponding to the amount of change in the length of the band test piece before and after the humidity control is obtained. This stress is residual tension per band cord.", "", "In the present disclosure, the residual tension of the band cord is represented as the residual tension per band cord.", "", "In the present disclosure, an elongation rate under constant load of an organic fiber cord is represented as an elongation rate under constant load, obtained in accordance with JIS L 1017."], "claims": ["a tread configured to come into contact with a road surface; a belt located radially inward of the tread; and a band located between the tread and the belt in a radial direction and stacked on the belt, wherein the belt includes a large number of belt cords aligned with each other, each of the belt cords is tilted relative to a circumferential direction, the band includes a band cord extending substantially in the circumferential direction, the band cord is an organic fiber cord, the band is composed of a helically wound band strip, the band strip is a cord array in which a plurality of the band cords are arranged, a zone from a first end to a second end of the belt is a control zone in which tension of the band cords is controlled, residual tension of the band cords in the control zone is not less than 15.0 N, the control zone includes a crown zone and a pair of shoulder zones located axially outward of the crown zone, residual tension of the band cords in the crown zone is higher than residual tension of the band cords in each shoulder zone, a ratio of an equator ground-contact length measured along an equator plane of the tire on a reference ground-contact surface obtained by bringing the tire into contact with a flat road surface with a vertical load, which is 70% of a normal load of the tire, being applied to the tire in a state where the tire is fitted on a normal rim, an internal pressure of the tire is adjusted to a normal internal pressure, and a camber angle of the tire is set to 0°, to a reference ground-contact length at a position corresponding to a width which is 80% of a maximum ground-contact width, is defined as a shape index, and the shape index is not less than 1.00 and not greater than 1.30.", "2 . The tire according to claim 1 , wherein a ratio of the residual tension of the band cords in each shoulder zone to the residual tension of the band cords in the crown zone is not less than 0.50.", "3 . The tire according to claim 1 , wherein the residual tension of the band cords in the crown zone is not greater than 50 N.", "4 . The tire according to claim 1 , wherein an elongation rate under constant load of the band cord, obtained in accordance with JIS L 1017, is not less than 1.9% and not greater than 8.4%.", "5 . The tire according to claim 1 , wherein a width in an axial direction of each shoulder zone is not less than ⅛ and not greater than ⅜ of a width in the axial direction of the control zone.", "the tread includes a tread surface which comes into contact with the road surface, in a meridian cross-section of the tire, a contour line of the tread surface includes a plurality of arcs aligned in the axial direction, the plurality of arcs include a first arc located at the center in the axial direction, a pair of second arcs located axially outward of the first arc, and a pair of third arcs located axially outward of the second arcs, a position, on the tread surface, corresponding to the boundary between the crown zone and the shoulder zone is a boundary corresponding position, and the boundary corresponding position is located axially outward of a boundary between the first arc and the second arc.", "the boundary corresponding position is located axially inward of the boundary between the second arc and the third arc.", "the plurality of arcs include a pair of shoulder arcs located located axially outward of the third arcs, each shoulder arc has a smallest radius among the plurality of arcs included in the contour line of the tread surface, a position, on the tread surface, corresponding to the ground-contact end of the reference ground-contact surface is a reference ground-contact position, and the reference ground-contact position is located axially inward of the boundary between the third arc and the shoulder arc.", "preparing a green tire for the tire; and vulcanizing the green tire, wherein in the green tire preparation step, the band is formed by helically winding a belt-shaped band strip onto the belt while applying a load to the band strip, the band strip is a cord array in which a plurality of band cords are arranged, a zone from a first end to a second end of the belt is a control zone in which tension of the band cords is controlled, a load applied to the band cords in the control zone is not less than 15.0 N, the control zone includes a crown zone and a pair of shoulder zones located axially outward of the crown zone, and a load applied to the band cords in the crown zone is higher than a load applied to the band cords in each shoulder zone."], "bibtex": "@patent{20240300265,\n    title = {TIRE AND PRODUCTION METHOD FOR TIRE},\n    number = {20240300265},\n    year = {2024},\n    note = {File: US20240300265A1-20240912.XML}\n    }", "classification": "B60C922FI"}, {"title": "TIRE", "doc_number": "20240300266", "filename": "US20240300266A1-20240912.XML", "abstract": "The tire includes a tread portion provided with a first tread edge, a shoulder circumferential groove, and a shoulder land region. The shoulder land region includes an inner area demarcated axially inside from a center position in the tire axial direction of the shoulder land region, an outer area demarcated axially outside from the center position, and a plurality of shoulder axial grooves extending in the tire axial direction at least in the outer area. In a standard tire load loaded state, an average ground contact pressure in the outer area is larger than an average ground contact pressure in the inner area.", "detailed_description": ["An embodiment of the present disclosure will now be described in conjunction with accompanying drawings. The drawings contain exaggerated representations and representations that differ from the actual dimensional ratios of the structure in order to aid in the understanding of the present disclosure. Further, in cases where there are multiple embodiments, the identical or common elements are denoted by the same reference numerals throughout the specification, and redundant explanations will be omitted.", "", "In the present specification, unless otherwise noted, the dimensions and the like of various parts of a tire1are the values measured under a standard state. In the case of a pneumatic tire for which various standards have been established, the “standard state” refers to a state in which the tire1is assembled on a standard rim, inflated to a standard inner pressure, and loaded with no tire load. In the case of a tire for which various standards are not established, the standard sate means a state of standard usage according to the purpose of use of the tire and a state in which the tire is not mounted on a vehicle and is loaded with no tire load.", "", "The “standard rim” is a wheel rim specified for the concerned tire by a standard included in a standardization system on which the tire is based, for example, the “normal wheel rim” in JATMA, “Design Rim” in TRA, and “Measuring Rim” in ETRTO.", "", "The “standard inner pressure” is air pressure specified for the concerned tire by a standard included in a standardization system on which the tire is based, for example, the maximum air pressure in JATMA, maximum value listed in the “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” table in TRA, and “INFLATION PRESSURE” in ETRTO.", "", "FIG.1is a partial plan view of a tread portion2of the tire1showing an embodiment of the present disclosure. The tire1of the present embodiment is suitably used, for example, as a pneumatic tire for a passenger car, specifically, for an SUV that can be driven on muddy terrain. However, the present disclosure may be used, for example, for a heavy duty pneumatic tire, as well as a non-pneumatic tire that are not filled with compressed air inside.", "", "As shown inFIG.1, the tread portion2includes a first tread edge T1, a shoulder circumferential groove3adjacent to the first tread edge T1, and a shoulder land region5located and demarcated between the shoulder circumferential groove3and the first tread edge T1.", "", "The shoulder land region5includes an inner area5A located and demarcated axially inside from a center position (5c) in the tire axial direction of the shoulder land region5and an outer area5B located and demarcated axially outside from the center position (5c) of the shoulder land region5. The center position (5c) is the axial midpoint of the shoulder land region5at its maximum width (Ws) in the tire axial direction.", "", "Further, the shoulder land region5includes a plurality of shoulder axial grooves8connected to the first tread edge T1and extend in the tire axial direction at least in the outer area5B. The shoulder axial grooves8communicating with the first tread edge T1allow mud in the grooves to be smoothly discharged to the outside of the first tread edge T1. As a result, the shoulder axial grooves8can grab and compact a lot of mud when newly grounded, therefore, a large sharing force can be exerted.", "", "It is inferred that increasing the shearing force in the axially outer part of the tread portion2can stabilize driving in muddy terrain. Therefore, in the present disclosure, the average ground contact pressure (Pb) in the outer area5B is greater than the average ground contact pressure (Pa) in the inner area5A under a standard tire load loaded state. As a result, the shoulder axial grooves8arranged in the outer area5B can exert greater shearing force against mud and can discharge mud more smoothly to the outside of the first tread edge T1, therefore, the mud performance is improved. Further, in the inner area5A, where the average ground contact pressure is relatively small, the amount of heat generated in the rubber forming the inner area5A and the friction force with the road surface can be reduced, and thus the increase in rolling resistance can be suppressed. Furthermore, in this tire1, the shearing force can be increased without relying on the groove volume of the shoulder axial grooves8, and as a result, deterioration of the rolling resistance performance can be suppressed. Therefore, the tire1of the present disclosure can improve the mud performance while maintaining the rolling resistance performance.", "", "The “standard tire load loaded state” is the state in which the tire1in the standard state is in contact with a flat surface with zero camber angle. In the case of a pneumatic tire for which various standards have been established, the “standard tire load” refers to a tire load specified for the concerned tire by a standard included in a standardization system on which the tire is based, for example, the “maximum load capacity” in JATMA, maximum value listed in “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” table in TRA, and “LOAD CAPACITY” in ETRTO. Further, in the case of a tire for which various standards are not established and a non-pneumatic tire, the “standard tire load” refers to the load acting on a single tire when the tire is in a standard mounting state. The “standard mounting state” refers to a state in which the tire is mounted on a standard vehicle according to the intended use of the tire, and the vehicle is at rest on a flat road surface in a roadworthy condition.", "", "In the present specification, the “average ground contact pressure” is defined as the average of the pressure (kPa) acting on a ground contacting surface (2a) (shown inFIG.2) of the tread portion2, which can be measured, for example, by observing the ground contacting surface (2a). More specifically, the average ground contact pressure can be measured by using a pressure distribution measuring device available from Tekscan, Inc., for example. This device can measure the ground contact pressure applied to the ground contacting surface (2a) of the tire1in the standard tire load loaded state at 1.0 mm intervals in the tire circumferential direction and the tire axial direction, for example. The average ground contact pressure is a value obtained by dividing the sum of the measurement values for each area or each land region measured by the above measuring device at 1.0 mm intervals by the number of measurements.", "", "The tire1, which has such an average ground contact pressure, can be formed, for example, by manipulating or adjusting the rubber volume of the tread rubber (not shown) of the tread portion2, or by manipulating or adjusting the strength of the carcass (not shown) or other tire components distributed inside the tread portion2. The aforementioned “tread rubber” and “tire components” are made of well-known materials, so their description is omitted.", "", "In order to effectively exert such an effect, the average ground contact pressure (Pb) of the outer area5B is preferably at least 1.1 times, more preferably at least 1.2 times the average ground contact pressure (Pb) of the inner area5A, and preferably 1.4 or less times, more preferably 1.3 or less times the average ground contact pressure (Pb) of the inner area5A. Since the average ground contact pressure (Pb) of the outer area5B is 1.1 or more times the average ground contact pressure (Pa) of the inner area5A, the shearing force is increased in the outer area5B, which enables stable running in muddy terrain. Since the average ground contact pressure (Pb) in the outer area5B is 1.4 or less times the average ground contact pressure (Pa) of the inner area5A, it is possible that the deterioration of the rolling resistance performance due to the frictional force in the outer area5B becoming excessively large is suppressed.", "", "FIG.2is a plan view of the tread portion2. As shown inFIG.2, the tread portion2of the present embodiment further includes a second tread edge T2, a pair of crown circumferential grooves4adjacent to the tire equator (C) so as to sandwich the tire equator (C), and a crown land region6located and demarcated between the pair of the crown circumferential grooves4. Further, the tread portion2includes a middle land region7located and demarcated between the shoulder circumferential groove3and one of the crown circumferential grooves4adjacent to the shoulder circumferential groove3. It should be noted that the tread portion2in the present embodiment is formed by a line symmetrical pattern at the tire equator (C) or a point symmetrical pattern at an arbitrary point on the tire equator (C). Therefore, the tread portion2of the present embodiment is provided with another shoulder land region5and another middle land region7on the second tread edge T2side of the tire equator (C). And descriptions of another shoulder land region5and another middle land region7located on the second tread edge T2side are omitted. The tread portion2of the present embodiment has the point-symmetrical pattern. It should be noted that the tire1of the present disclosure is not limited to such an embodiment.", "", "The first tread edge T1and the second tread edge T2are the axially outermost ground contact positions of the tire1in the standard tire load loaded state. Further, the axial distance between the first tread edge T1and the second tread edge T2is a tread width TW.", "", "The tire1is formed so that the average ground contact pressure P1of the shoulder land region5is larger than the average ground contact pressure P2of the crown land region6. The relatively large average ground contact pressure P1as described above further improves the stability of running in muddy terrain. In order to exert such an effect more effectively, the average ground contact pressure (Pa) of the inner area5A is set larger than the average ground contact pressure P2of the crown land region6in the present embodiment.", "", "In order to improve the running stability in muddy terrain, the average ground contact pressure P1of the shoulder land region5is preferably at least 1.15 times, more preferably at least 1.2 times the average ground contact pressure P2of the crown land region6. In order to suppress the increase in the frictional force and the like of the shoulder land region5and suppress the deterioration of the rolling resistance performance, the average ground contact pressure P1of the shoulder land region5is preferably 1.35 or less times, more preferably 1.3 or less times the average ground contact pressure P2of the crown land region6.", "", "It is required to suppress the deterioration of the rolling resistance performance caused by excessively high friction forces and the like as well as to improve the running stability in muddy terrain by increasing the shearing force in the land region and/or the area located relatively outside in the tire axial direction. For this reason, the tire1is formed so that the average ground contact pressure P3of the middle land region7is smaller than the average ground contact pressure P1of the shoulder land region5, and larger than the average ground contact pressure P2of the crown land region6. Further, the average ground contact pressure (Pd) of a middle outer area7B located and demarcated on the axially outer side from a center position (7c) (shown inFIG.4) of the middle land region7is smaller than the average ground contact pressure (Pc) of a middle inner area7A located and demarcated on the axially inner side from the center position (7c) of the middle land region7.", "", "The shoulder circumferential groove3and the crown circumferential grooves4extend continuously in a zigzag shape in the tire circumferential direction, for example. As described above, the shoulder circumferential groove3and the crown circumferential groove4in the present embodiment have tire axial components, therefore, they can exert a shearing force against mud. The shoulder circumferential groove3and the crown circumferential grooves4are not limited to such an embodiment, and may extend linearly or in a wavy shape, for example.", "", "The shoulder circumferential groove3in the present embodiment includes a plurality of first parts21, a plurality of second parts22, a plurality of third parts23, and a plurality of fourth parts24. The first parts21extend parallel to the tire circumferential direction. The second parts22extend parallel to the tire circumferential direction on the axially inner side of the first parts21. Each of the third parts23connects a respective one of the first parts21with one of the second parts22adjacent thereto and is inclined with respect to the tire circumferential direction. Each of the fourth parts24connects a respective one of the first parts21with one of the second parts22adjacent thereto and is inclined to a side opposite the third parts23with respect to the tire circumferential direction. The third parts23and the fourth parts24are arranged alternately one by one in the tire circumferential direction. Therefore, the shoulder circumferential groove3in the present embodiment is formed by units each in which the first part21, the fourth part24, the second part22, and the third part23are connected in series in this order.", "", "Each of the crown circumferential grooves4includes a plurality of crown first parts25, a plurality of crown second parts26, a plurality of crown third parts27, a plurality of crown fourth parts28. The crown first parts25extend parallel to the tire circumferential direction. The crown second parts26extend parallel to the tire circumferential direction on the axially inner side of the crown first parts25. Each of the crown third parts27connects a respective one of the crown first parts25and one of the crown second parts26adjacent thereto and is inclined with respect to the tire circumferential direction. Each of the crown fourth parts28connects a respective one of the crown first parts25and one of the crown second parts26adjacent thereto and is inclined to a side opposite to the crown third parts27with respect to the tire circumferential direction. The crown third parts27and the crown fourth parts28are arranged alternately one by one in the tire circumferential direction. Therefore, the shoulder circumferential groove3in the present embodiment is formed by units each in which the crown first part25, the crown third part27, the crown second part26, and the crown fourth part28are connected in series in this order.", "", "Although not particularly limited, the groove width W1of the shoulder circumferential groove3and the groove width W2of each of the crown circumferential grooves4are preferably 5 mm or more, more preferably 6 mm or more, and 9 mm or less, more preferably 8 mm or less, for example. Further, the groove depth D1(shown in FIG.3) of the shoulder circumferential groove3and the groove depth D2(shown inFIG.3) of each of the crown circumferential grooves4are preferably 6 mm or more, more preferably 7 mm or more, and preferably 10 mm or less, more preferably 9 mm or less, for example. In the present embodiment, the groove depth D1of the shoulder circumferential groove3is smaller than the groove depth D2of each of the crown circumferential grooves4. In the present specification, the “groove width” is the average value of the opening area of the groove on the ground contacting surface (2a) divided by the length of the groove centerline.", "", "As shown inFIG.1, the shoulder axial grooves8connect the first tread edge T1and the shoulder circumferential groove3in the present embodiment. That is, each of the shoulder axial grooves8extends from the first tread edge T1to the shoulder circumferential groove3in the present embodiment. Since the shoulder axial grooves8configured as such ensure a large axial length, the shearing force against mud can be increased.", "", "Each of the shoulder axial grooves8is connected to a respective one of the third parts23in the present embodiment. To explain in detail, the shoulder axial grooves8are connected to the third parts23having tire axial components. Thereby, the shoulder axial grooves8and the third parts23are brought into contact with the ground at substantially the same time, therefore, a high shearing force can be obtained.", "", "Each of the shoulder axial grooves8together with q respective one of the third parts23form one groove-shaped body extending in the tire axial direction, for example. This further improves the mud performance. In the present specification, the term “one groove-shaped body” is defined as one in which one of groove edges (8e) of the shoulder axial groove8and one of groove edges (23e) of the third part23are smoothly connected with each other in a straight line or in an arc, excluding a mode in which the groove edge (8e) and the groove edge (23e) are connected in a bent shaped.", "", "FIG.3is a cross-sectional view taken along A-A line inFIG.2. As shown inFIG.3, the groove depth D3of each of the shoulder axial grooves8is smaller than the groove depth D1of the shoulder circumferential groove3and the groove depth D2of each of the crown circumferential grooves4. Thereby, the rigidity of the shoulder land region5is maintained high. In order to maintain the effect of increasing the shearing force of the shoulder axial grooves8, it is preferred that the difference between the groove depth D2of each of the shoulder axial grooves8and the groove depth D1of the shoulder circumferential groove3and the difference between the groove depth D2and the groove depth D1of each of the crown circumferential grooves4are 1.7 mm or less.", "", "As shown inFIG.1, the shoulder land region5includes a plurality of shoulder axial sub grooves9each having a groove width W4smaller than that of each of the shoulder axial grooves8. The shoulder axial sub grooves9configured as such help increase the shearing force against mud and improve the mud performance. In particular, since the groove width W4of the shoulder axial sub grooves9is set from 1 to 2.5 mm, the above-mentioned effect is effectively exerted.", "", "The shoulder axial sub grooves9connect the first tread edge T1and the shoulder circumferential groove3, i.e., each of the shoulder axial sub grooves9extends from the first tread edge T1to the shoulder circumferential groove3. That is to say, each of the shoulder axial sub grooves9extends from the first tread edge T1to the shoulder circumferential groove3in the present embodiment. Each of the shoulder axial sub grooves9of the present embodiment is connected to an intersection position K1where a respective one of the third parts23intersects a respective one of the second parts22. The intersection positions K1are positions where the rigidity of the shoulder land region5is relatively small. The shoulder axial sub grooves9connected to the intersection positions K1as such deform more when contacting the ground, therefore, mud in the grooves can be smoothly discharged.", "", "If the maximum width (Ws) of the shoulder land region5is excessively small, the area of the ground contacting surface (5a) of the shoulder land region5, which has a relatively large average ground contact pressure, becomes small, and therefore the mud performance may deteriorate. If the maximum width (Ws) of shoulder land region5is excessively large, the area of the ground contacting surface (7a) (shown inFIG.2) of the middle land region7and the area of the ground contacting surface (6a) (shown inFIG.2) of the crown land region6, which have a relatively small average ground contact pressure, become small, and therefore the rolling resistance performance may deteriorate. For these reasons, the maximum width (Ws) of the shoulder land region5is preferably 20% or more, more preferably 22% or more, and preferably 32% or less, more preferably 30% or less of the tread width TW.", "", "FIG.4is a plan view of the middle land region7. As shown inFIG.4, the middle land region7includes a plurality of middle axial grooves11each extending from a respective one of the third parts23to the crown circumferential grooves4. Since the middle axial grooves11configured as such also contact the ground at substantially the same time as the third parts23, large shearing forces against mud can be exerted. The middle axial grooves11are arranged so as to each form one groove-shaped body extending in the tire axial direction together with a respective one of the third parts23, for example. In the present embodiment, one of groove edges (11e) of the middle axial groove11and one of groove edges (23e) of the third part23are smoothly connected by an arc. Further, in the present embodiment, each of the middle axial grooves11is connected to an intersection position K2(crown intersection position) between a respective one of the crown second parts26and a respective one of the crown third parts27.", "", "The middle land region7includes first sipes13and second sipes14. Each of the first sipes13crosses the middle land region7. Each of the second sipes14has an end portion (14e) terminating within the middle land region7. The end portion (14e) in the present embodiment is a closed terminating end and not connected with other sipes and grooves. The second sipes14consist of outer second sipes15connected to the shoulder circumferential groove3and inner second sipes16connected to the crown circumferential groove4.", "", "Each of the first sipes13in the present embodiment extends from an intersection position (intersection) between a respective one of the first parts21and a respective one of the third parts23to an intersection position (intersection) between a respective one of the crown first parts25and a respective one of the crown third parts27. Each of the outer second sipes15in the present embodiment extends from the intersection position of a respective one of the second parts22and a respective one of the fourth parts24to have an end portion (15e) terminating axially outside the center position (7c) of the middle land region7. The end portion (15e) in the present embodiment is a closed terminating end and not connected with other sipes and grooves. Each of the inner second sipes16in the present embodiment extends from the intersection position of a respective one of the crown first parts25and a respective one of the crown fourth parts28to have an end portion (16e) terminating axially inside the center position (7c) of the middle land region7. The end portion (16e) in the present embodiment is a closed terminating end and not connected with other sipes and grooves. In the present specification, the term “sipe” refers to a cut-like body or an incision having a width of less than 1.0 mm on the ground contacting surface (2a), and is clearly distinguished from a groove having a groove width of 1 mm or more.", "", "FIG.5is a plan view of the crown land region6. As shown inFIG.5, the crown land region6includes a plurality of crown axial grooves18each extending from one of the crown circumferential grooves4toward the tire equator (C) to have an end portion (18e) terminating to have a closed end within the crown land region6. Each of the crown axial grooves18extends from an intersection position of a respective one of the crown second parts26and a respective one of the crown third parts27, for example.", "", "FIG.6is an enlarged view of the crown land region6and the middle land region7. As shown inFIG.6, each of the crown axial grooves18is connected with a respective one of the middle axial grooves11via the crown circumferential groove4. Therefore, each of the crown axial grooves18, a respective one of the crown circumferential grooves4, and the middle axial grooves11form one groove-shaped body extending in the tire axial direction, thereby, a large shearing force is exerted. The term “connected” used in the above description means that a virtual line (v1) is located within the crown axial groove18, and a virtual line (v2) is located within the middle axial groove11. The virtual line (v1) is a line segment obtained by extending a linear line (n1) connecting an axially inner end (11a) and an axially outer end (11b) of a groove centerline (11c) of the middle axial groove11while maintaining the inclination angle of the linear line (n1). The virtual line (v2) is a line segment obtained by extending a linear line (n2) connecting an axially inner end (18a) and an axially outer end (18b) of a groove centerline (18c) of the crown axial groove18while maintaining the inclination angle of the linear line (n2).", "", "As shown inFIG.5, the crown axial grooves18include first crown axial grooves18A extending from the crown circumferential groove4located on the first tread edge T1side and second crown axial grooves18B extending from the crown circumferential groove4located on the second tread edge T2side. A length (La) in the tire circumferential direction between each of the first crown axial grooves18A and one of the second crown axial grooves18B immediately adjacent thereto is preferably 15% or more, more preferably 20% or more, and preferably 35% or less, more preferably 30% or less of the maximum width (Wc) of the crown land region6. The length (La) is the distance in the tire circumferential direction between the inner end (18a) of the groove centerline (18c) of the first crown axial groove18A and the inner end (18a) of the groove centerline (18c) of the second crown axial groove18B. The maximum width (Wc) of the crown land region6is the width in the tire axial direction between a position (6e) of the crown land region6closest to the first tread edge T1and a position (6i) of the crown land region6closest to the second tread edge T2.", "", "While detailed description has been made according to an embodiment of the present disclosure, the present disclosure can be embodied in various forms without being limited to the illustrated embodiment."], "claims": ["a first tread edge; a shoulder circumferential groove adjacent to the first tread edge; and a shoulder land region demarcated between the shoulder circumferential groove and the first tread edge, wherein the shoulder land region includes an inner area, an outer area, and a plurality of shoulder axial grooves, the inner area is demarcated axially inside from a center position in the tire axial direction of the shoulder land region, the outer area is demarcated axially outside from the center position of the shoulder land region, each of the shoulder axial grooves is connected with the first tread edge and extends therefrom in the tire axial direction at least in the outer area, an average ground contact pressure in the outer area is greater than an average ground contact pressure (Pa) in the inner area under a standard tire load loaded state, and the standard tire load loaded state is the state in which the tire is assembled on a standard rim, inflated to a standard inner pressure, loaded with a standard tire load, and in contact with a flat surface with zero camber angle.", "2 . The tire according to claim 1 , wherein the average ground contact pressure in the outer area is from 1.1 times to 1.4 times the average ground contact pressure in the inner area.", "3 . The tire according to claim 2 , wherein the shoulder axial grooves connect the first tread edge and the shoulder circumferential groove.", "the tread portion includes a pair of crown circumferential grooves each adjacent to the tire equator on a respective side thereof, and a crown land region demarcated between the crown circumferential grooves, and the shoulder land region has an average ground contact pressure larger than an average ground contact pressure in the crown land region.", "5 . The tire according to claim 4 , wherein the average ground contact pressure in the shoulder land region is from 1.15 times to 1.35 times the average ground contact pressure in the crown land region.", "6 . The tire according to claim 4 , wherein each of the shoulder axial grooves has a groove depth smaller than a groove depth of the shoulder circumferential groove and a groove depth of each of the crown circumferential grooves.", "7 . The tire according to claim 6 , wherein a difference between the groove depth of each of the shoulder axial grooves and the groove depth of the shoulder circumferential groove and a difference between the groove depth of each of the shoulder axial grooves and the groove depth of each of the crown circumferential grooves are 1.7 mm or less.", "the shoulder land region includes a plurality of shoulder axial sub grooves each having a groove width smaller than a groove width of each of the shoulder axial grooves, and the shoulder axial sub grooves connect the first tread edge and the shoulder circumferential groove.", "9 . The tire according to claim 8 , wherein the groove width of each of the shoulder axial sub grooves is from 1 to 2.5 mm.", "the shoulder circumferential groove includes a plurality of first parts, a plurality of second parts, a plurality of third parts, and a plurality of fourth parts, the first parts extend parallel to the tire circumferential direction, the second parts extend parallel to the tire circumferential direction on the axially inner side of the first parts, each of the third parts connects a respective one of the first parts with one of the second parts adjacent thereto and is inclined with respect to the tire circumferential direction, each of the fourth parts connects a respective one of the first parts with one of the second parts adjacent thereto and is inclined to a side opposite to the third parts with respect to the tire circumferential direction, the third parts and the fourth parts are arranged alternately one by one in the tire circumferential direction, and each of the shoulder axial grooves is connected with a respective one of the third parts.", "the tread portion includes a pair of crown circumferential grooves and a middle land region, the crown circumferential grooves are adjacent to the shoulder circumferential groove on a side opposite to the first tread edge so as to sandwich the tire equator between the crown circumferential grooves, the middle land region is demarcated between the shoulder circumferential groove and one of the crown circumferential grooves on the first tread edge side, and the middle land region includes a plurality of middle axial grooves each extending from a respective one of the third parts of the shoulder circumferential groove to one of the crown circumferential grooves on the first tread edge side.", "the tread portion includes a crown land region demarcated between the crown circumferential grooves, the crown land region includes a plurality of crown axial grooves extending from one of the crown circumferential grooves on the first tread edge side toward the tire equator to have end portions terminating to have closed ends within the crown land region, and each of the crown axial grooves is connected with a respective one of the middle axial grooves via the crown circumferential groove.", "13 . The tire according to claim 2 , wherein the average ground contact pressure in the outer area is from 1.2 times to 1.3 times the average ground contact pressure in the inner area.", "14 . The tire according to claim 1 , wherein the average ground contact pressure in the inner area is larger than an average ground contact pressure in the crown land region.", "15 . The tire according to claim 11 , wherein an average ground contact pressure in the middle land region is smaller than an average ground contact pressure in the shoulder land region and larger than an average ground contact pressure in the crown land region.", "the middle land region consists of a middle outer area and a middle inner area, the middle outer area is demarcated on the axially outer side from a center position in the tire axial direction of the middle land region, the middle inner area is demarcated on the axially inner side from the center position of the middle land region, and the middle outer area has an average ground contact pressure smaller than an average ground contact pressure in the middle inner area.", "17 . The tire according to claim 4 , wherein the shoulder circumferential groove has a groove depth smaller than a groove depth of each of the crown circumferential grooves.", "the shoulder land region includes a plurality of shoulder axial sub grooves each having a groove width smaller than a groove width of each of the shoulder axial grooves, the shoulder circumferential groove includes a plurality of intersection positions where the third parts intersect the second parts, each of the shoulder axial sub grooves extends from the first tread edge to a respective one of the intersection positions of the shoulder circumferential groove.", "one of the crown circumferential grooves on the first tread edge side includes a plurality of crown first parts, a plurality of crown second parts, a plurality of crown third parts the crown first parts extend parallel to the tire circumferential direction, the crown second parts extend parallel to the tire circumferential direction on the axially inner side of the crown first parts, each of the crown third parts connects a respective one of the crown first parts and one of the crown second parts adjacent thereto and is inclined with respect to the tire circumferential direction, each of the crown fourth parts connects a respective one of the crown first parts and one of the crown second parts adjacent thereto and is inclined to a side opposite to the crown third parts with respect to the tire circumferential direction, the crown third parts and the crown fourth parts are arranged alternately one by one in the tire circumferential direction, and each of the middle axial grooves is connected to a respective one of the crown intersection positions.", "the tread portion includes a crown land region demarcated between the crown circumferential grooves, the crown land region includes a plurality of crown axial grooves extending from one of the crown circumferential grooves on the first tread edge side toward the tire equator to have end portions terminating to have closed ends within the crown land region, and each of the crown axial grooves extends from a respective one of the crown intersection positions."], "bibtex": "@patent{20240300266,\n    title = {TIRE},\n    number = {20240300266},\n    year = {2024},\n    note = {File: US20240300266A1-20240912.XML}\n    }", "classification": "B60C1103FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240300267", "filename": "US20240300267A1-20240912.XML", "abstract": "A pneumatic tire includes inner intermediate lug grooves having a length L 1 and outer intermediate lug grooves having a length L 2 formed in inner and outer intermediate land portions, respectively, where lengths L 1 and L 2 satisfy L 1 >L 2 . Distances W 1 , W 2 , W 3 , and W 4 from a tire equator to an inner shoulder main groove, an inner center main groove, an outer center main groove, and an outer shoulder main groove, respectively, satisfy 0.58≤W 1 /Wi≤0.62, 0.20≤W 2 /Wi≤0.24, 0.15≤W 3 /Wo≤0.19, and 0.53≤W 4 /Wo≤0.57 with respect to distances Wi, Wo from the tire equator to ground contact edges. A total value of a groove width WG 1 of the inner shoulder main groove and a groove width WG 2 of the inner center main groove is larger than a total value of a groove width WG 3 of the outer center main groove and a groove width WG 4 of the outer shoulder main groove.", "detailed_description": ["Configurations of embodiments of the present technology will be described in detail below with reference to the accompanying drawings.FIGS.1to3illustrate a pneumatic tire according to an embodiment of the present technology. This pneumatic tire has a mounting direction of tire front/back that is designated when mounted on a vehicle. InFIGS.1to3, “IN” refers to a vehicle inner side when the tire is mounted on a vehicle, “OUT” refers to a vehicle outer side when the tire is mounted on the vehicle, Ei refers to a ground contact edge on the vehicle inner side, Eo refers to a ground contact edge on the vehicle outer side, and TCW refers to a ground contact width.", "", "As illustrated inFIG.1, a pneumatic tire of the present embodiment includes an annular tread portion1extending in the tire circumferential direction, a pair of sidewall portions2,2disposed on both sides of the tread portion1, and a pair of bead portions3,3disposed on an inner side of the sidewall portions2in the tire radial direction. For example, a mounting direction indicator2A indicating the mounting direction to the vehicle is formed on at least the sidewall portion2on the vehicle outer side. The mounting direction indicator2A displays, for example, “OUTSIDE” along the tire circumferential direction on the vehicle outer side and displays, for example, “INSIDE” along the tire circumferential direction on the vehicle inner side.", "", "A carcass layer4is mounted between the pair of bead portions3,3. The carcass layer4includes a plurality of reinforcing cords extending in the tire radial direction and is folded back around a bead core5disposed in each of the bead portions3from a tire inner side to a tire outer side. A bead filler6having a triangular cross-sectional shape and formed of a rubber composition is disposed on the outer circumference of the bead core5.", "", "On the other hand, a plurality of belt layers7are embedded on the outer circumferential side of the carcass layer4in the tread portion1. The belt layers7include a plurality of reinforcing cords that are inclined with respect to the tire circumferential direction, and the reinforcing cords are disposed so as to intersect each other between the layers. In the belt layers7, the inclination angle of the reinforcing cords with respect to the tire circumferential direction is set to fall in a range from 10° to 40°, for example. Steel cords are preferably used as the reinforcing cords of the belt layers7. To improve high-speed durability, at least one belt cover layer8formed by arranging reinforcing cords at an angle of, for example, 5° or less with respect to the tire circumferential direction is disposed on an outer circumferential side of the belt layers7. Organic fiber cords such as nylon and aramid are preferably used as the reinforcing cords of the belt cover layer8.", "", "Note that the tire internal structure described above represents a typical example for a pneumatic tire, but the pneumatic tire is not limited thereto.", "", "As illustrated inFIG.2, the tread portion1is formed with four main grooves11extending in the tire circumferential direction. The four main grooves11include an inner center main groove11B located on a vehicle inner side with respect to a tire equator CL when the pneumatic tire is mounted on a vehicle, an outer center main groove11C located on a vehicle outer side with respect to the tire equator CL when the pneumatic tire is mounted on a vehicle, an inner shoulder main groove11A located on the vehicle inner side with respect to the inner center main groove11B when the pneumatic tire is mounted on a vehicle, and an outer shoulder main groove11D located on the vehicle outer side with respect to the outer center main groove11C when the pneumatic tire is mounted on a vehicle. The main grooves11have groove widths ranging from 6.5 mm to 12.0 mm and groove depths ranging from 6.5 mm to 8.5 mm, and includes a wear indicator.", "", "The tread portion1defines five rows of land portions12by the four main grooves11. The five rows of the land portions12include a center land portion12C defined between the inner center main groove11B and the outer center main groove11C, an inner intermediate land portion12B defined between the inner center main groove11B and the inner shoulder main groove11A, an outer intermediate land portion12D defined between the outer center main groove IC and the outer shoulder main groove11D, an inner shoulder land portion12A defined on the vehicle inner side with respect to the inner shoulder main groove11A, and an outer shoulder land portion12E defined on the vehicle outer side with respect to the outer shoulder main groove11D.", "", "In the inner shoulder land portion12A, a plurality of inner shoulder lug grooves13A extending in the tire width direction and having one ends extending to the vehicle inner side with respect to the ground contact edge Ei on the vehicle inner side and the other ends terminating in the inner shoulder land portion12A are formed at intervals in the tire circumferential direction. Furthermore, in the inner shoulder land portion12A, a plurality of inner shoulder sipes14A extending in the tire width direction and having one ends communicating with the inner shoulder main groove11A and the other ends terminating in the inner shoulder land portion12A are formed at intervals in the tire circumferential direction.", "", "In the inner intermediate land portion12B, a plurality of inner intermediate lug grooves13B extending in the tire width direction and having one ends communicating with the inner center main groove11B and the other ends terminating in the inner intermediate land portion12B are formed at intervals in the tire circumferential direction. In addition, on a groove wall on the vehicle outer side of the inner shoulder main groove11A (that is, a side wall on the vehicle inner side of the inner intermediate land portion12B), edge portions16B chamfered in a zigzag shape are formed.", "", "In the center land portion12C, a plurality of center lug grooves13C extending in the tire width direction and having one ends communicating with the inner center main groove11B and the other ends terminating in the center land portion12C are formed at intervals in the tire circumferential direction. In the center land portion12C, a plurality of center sipes14C extending in the tire width direction and having one ends communicating with the outer center main groove11C and the other ends terminating in the center land portion12C are formed at intervals in the tire circumferential direction.", "", "In the outer intermediate land portion12D, a plurality of outer intermediate lug grooves13D extending in the tire width direction and having one ends communicating with the outer shoulder main groove11D and the other ends terminating in the outer intermediate land portion12D are formed at intervals in the tire circumferential direction. In addition, on a groove wall on the vehicle outer side of the outer center main groove IC (that is, a side wall on the vehicle inner side of the outer intermediate land portion12D), edge portions16D chamfered in a zigzag shape are formed.", "", "In the outer shoulder land portion12E, a plurality of outer shoulder lug grooves13E extending in the tire width direction and having one ends extending to the vehicle outer side with respect to the ground contact edge Eo on the vehicle outer side and the other ends terminating in the outer shoulder land portion12E are formed at intervals in the tire circumferential direction. In the outer shoulder land portion12E, a circumferential auxiliary groove15E extending in the tire circumferential direction and mutually connecting the outer shoulder lug grooves13E is formed. In the outer shoulder land portion12E, a plurality of outer shoulder sipes14D extending in the tire width direction and having one ends communicating with the outer shoulder main groove11D and the other ends communicating with the circumferential auxiliary groove15E are formed at intervals in the tire circumferential direction.", "", "In the pneumatic tire, the length L1of the inner intermediate lug groove13B and the length L2of the outer intermediate lug groove13D satisfy the relationship L1>L2. The lengths L1, L2are measured in the tire width direction. By configuring the length L1of the inner intermediate lug groove13B larger than the length L2of the outer intermediate lug groove13D in this way, rigidity of the vehicle outer side part of the tread portion1(the outer intermediate land portion12D) on which a large lateral force acts is made larger than rigidity of the vehicle inner side part of the tread portion1(the inner intermediate land portion12B), thus allowing improving the steering stability on dry road surfaces and wet road surfaces.", "", "In the pneumatic tire, a distance W1from the tire equator CL to the center position of the inner shoulder main groove11A, a distance W2from the tire equator CL to the center position of the inner center main groove11B, a distance W3from the tire equator CL to the center position of the outer center main groove11C, and a distance W4from the tire equator CL to the center position of the outer shoulder main groove11D satisfy the relationships 0.58≤W1/Wi≤0.62, 0.20≤W2/Wi≤0.24, 0.15≤W3/Wo≤0.19, and 0.53≤W4/Wo≤0.57 with respect to distances Wi, Wo from the tire equator CL to the ground contact edges Ei, Eo on the vehicle inner side and the vehicle outer side. The respective distances Wi and Wo from the tire equator CL to the ground contact edges Ei, Eo on the vehicle inner side and the vehicle outer side are equivalent to TCW/2. The center positions of the inner shoulder main groove11A, the inner center main groove11B, the outer center main groove11C, and the outer shoulder main groove11D are center positions in a groove width direction and center positions of the groove portions excluding the chamfered portions.", "", "In the pneumatic tire in which the mounting direction to the vehicle is designated, W1/Wi, W2/Wi, W3/Wo, and W4/Wo are defined as described above, and the four main grooves are brought closer to the vehicle inner side when the tire is mounted on a vehicle, whereby it is possible to improve drainage performance while vehicle external noise is reduced. Here, when the center positions of the inner shoulder main groove11A, the inner center main groove11B, the outer center main groove11C, and the outer shoulder main groove11D are out of the ranges, it is difficult to provide noise performance and drainage performance in a compatible manner.", "", "In the pneumatic tire, the total value of the groove width WG1of the inner shoulder main groove11A and the groove width WG2of the inner center main groove11B (WG1+WG2) is set to be larger than the total value of the groove width WG3of the outer center main groove11C and the groove width WG4of the outer shoulder main groove11D (WG3+WG4). Thus, drainage performance can be improved without deteriorating noise performance. Configuring the total value of the groove width WG1of the inner shoulder main groove1A and the groove width WG2of the inner center main groove11B to be larger than the total value of the groove width WG3of the outer center main groove11C and the groove width WG4of the outer shoulder main groove11D allows increasing the rigidity of the vehicle outer side part of the tread portion1where a large lateral force acts more than the rigidity of the vehicle inner side part of the tread portion1, thus allowing improving the steering stability on dry road surfaces and wet road surfaces. In particular, the relationship WG1>WG2>WG3≥WG4is preferably satisfied.", "", "In the center land portion12C of the pneumatic tire, the plurality of center lug grooves13C extending in the tire width direction and having one ends communicating with the inner center main groove11B and the other ends terminating in the center land portion12C are preferably formed at intervals in the tire circumferential direction. By disposing the non-through center lug grooves13C in the center land portion12C, drainage performance can be improved without impairing steering stability.", "", "When the center lug grooves13C are provided, the other ends of the center lug grooves13C preferably terminate within the center land portion12C without traversing the tire equator CL. By disposing the center lug grooves13C such that the center lug grooves13C do not traverse the tire equator CL, the rigidity of the center land portion12C can be sufficiently ensured, and drainage performance can be improved without deteriorating steering stability.", "", "In the center land portion12C of the pneumatic tire, the plurality of center sipes14C extending in the tire width direction and having one ends communicating with the outer center main groove11C and the other ends terminating within the center land portion12C without traversing the tire equator CL are preferably formed at intervals in the tire circumferential direction. By disposing the center sipes14C such that the center sipes14C do not traverse the tire equator CL, the rigidity of the center land portion12C can be sufficiently ensured and drainage performance can be improved without deteriorating noise performance or steering stability.", "", "In the pneumatic tire, a width Wr1of the inner intermediate land portion12B and the length L1of the inner intermediate lug groove13B preferably satisfy the relationship 0.6≤L1/Wr1≤0.7. By properly setting the length L1of the inner intermediate lug groove13B, steering stability, noise performance, and drainage performance can be improved in a well-balanced manner. Here, the value of L1/Wr1being less than 0.6 decreases the effect of improving drainage performance and whereas the value being larger than 0.7 decreases the effect of improving steering stability due to the decrease in rigidity of the inner intermediate land portion12B and decreases the effect of improving noise performance.", "", "In the pneumatic tire, a width Wr2of the outer intermediate land portion12D and the length L2of the outer intermediate lug groove13D preferably satisfy the relationship 0.4≤L2/Wr2≤0.5. By properly setting the length L2of the outer intermediate lug groove13D, steering stability, noise performance, and drainage performance can be improved in a well-balanced manner. Here, the value of L2/Wr2being less than 0.4 decreases the effect of improving drainage performance and whereas the value being larger than 0.5 decreases the effect of improving steering stability due to the decrease in rigidity of the outer intermediate land portion12D and decreases the effect of improving noise performance.", "", "In the pneumatic tire, a width Wr3of the center land portion12C and a length L3of the center lug groove13C preferably satisfy the relationship 0.3≤L3/Wr3≤0.4. By properly setting the length L3of the center lug groove13C, steering stability, noise performance, and drainage performance can be improved in a well-balanced manner. Here, the value of L3/Wr3being less than 0.3 decreases the effect of improving drainage performance and whereas the value being larger than 0.4 decreases the effect of improving steering stability due to the decrease in rigidity of the center land portion12C and decreases the effect of improving noise performance.", "", "In the pneumatic tire, an inclination angle θ1on the acute angle side of the inner intermediate lug groove13B with respect to the tire circumferential direction is preferably set to be smaller than an inclination angle θ2on the acute angle side of the outer intermediate lug groove13D with respect to the tire circumferential direction. The inclination angle θ1is the angle formed by a straight line connecting the center position of the opening end of the inner intermediate lug groove13B and the center position of the terminal end thereof with respect to the tire circumferential direction, and the inclination angle θ2is the angle formed by a straight line connecting the center position of the opening end of the outer intermediate lug groove13D and the center position of the terminal end thereof with respect to the tire circumferential direction. By setting the inclination angle θ1of the inner intermediate lug groove13B to be smaller than the inclination angle θ2of the outer intermediate lug groove13D in this manner, the rigidity of the inner intermediate lug groove13B can be ensured while maintaining good drainage performance. As a result, the steering stability on dry road surfaces and the steering stability on wet road surfaces can be improved in a well-balanced manner. In particular, it is preferable that the inclination angle θ1of the inner intermediate lug groove13B is set in a range from 650 to 710 and the inclination angle θ2of the outer intermediate lug groove13D is set in a range from 720 to 78°.", "", "In the pneumatic tire, the edge portions16B,16D chamfered in a zigzag shape are preferably formed on the groove walls on the vehicle outer sides of the inner shoulder main groove11A and the outer center main groove IC, respectively. By providing the edge portions16B,16D where the groove walls on the vehicle outer sides of the inner shoulder main groove11A and the outer center main groove IC are chamfered in the zigzag shape, the initial groove area can be ensured and drainage performance can be improved without deteriorating noise.", "", "In the pneumatic tire, as illustrated inFIG.3, the inner intermediate lug groove13B, the center lug groove13C, and the outer intermediate lug groove13D have inclined portions17B,17C,17D inclined such that the groove depths gradually decrease from the intermediate position toward the terminal end side in the longitudinal direction. More specifically, the groove depth of the inner intermediate lug groove13B gradually shallows toward the terminal end side from a position away from the open end thereof as a point of origin by a distance L1′ equivalent to 50% to 650% of the length L1. The groove depth of the outer intermediate lug groove13D gradually shallows toward the terminal end side from a position away from the open end thereof as a point of origin by a distance L2′ equivalent to 350% to 50% of the length L2. The groove depth of the center lug groove13C gradually shallows toward the terminal end side from a position away from the open end thereof as a point of origin by a distance L3′ equivalent to 25% to 40% of the length L3. By providing the inclined portions17B,17C,17D, the decrease in rigidity of the inner intermediate lug groove13B, the center lug groove13C, or the outer intermediate lug groove13D can be avoided, thus allowing improving drainage performance without deteriorating steering stability. Here, when the distances L1′, L2′, L3′ are excessively small, the effect of improving drainage performance decreases, and when the distances L1′, L2′, L3′ are excessively large, the effect of improving steering stability decreases."], "claims": ["1 - 12 . (canceled)", "a tread portion extending in a tire circumferential direction and having an annular shape; a pair of sidewall portions disposed on both sides of the tread portion; a pair of bead portions disposed on inner sides of the sidewall portions in a tire radial direction; and a mounting direction indicator indicating a mounting direction to a vehicle, four main grooves extending in the tire circumferential direction being formed in the tread portion, the four main grooves comprising: an inner center main groove located on a vehicle inner side with respect to a tire equator when the pneumatic tire is mounted on the vehicle; an outer center main groove located on a vehicle outer side with respect to the tire equator when the pneumatic tire is mounted on the vehicle; an inner shoulder main groove located on the vehicle inner side with respect to the inner center main groove when the pneumatic tire is mounted on the vehicle; and an outer shoulder main groove located on the vehicle outer side with respect to the outer center main groove when the pneumatic tire is mounted on the vehicle, five rows of land portions being defined by the four main grooves, the five rows of the land portions comprising: a center land portion defined between the inner center main groove and the outer center main groove; an inner intermediate land portion defined between the inner center main groove and the inner shoulder main groove; an outer intermediate land portion defined between the outer center main groove and the outer shoulder main groove; an inner shoulder land portion defined on the vehicle inner side with respect to the inner shoulder main groove; and an outer shoulder land portion defined on the vehicle outer side with respect to the outer shoulder main groove, while a plurality of inner intermediate lug grooves extending in a tire width direction and having one ends communicating with the inner center main groove and other ends terminating in the inner intermediate land portion are formed at intervals in the tire circumferential direction in the inner intermediate land portion, a plurality of outer intermediate lug grooves extending in the tire width direction and having one ends communicating with the outer shoulder main groove and other ends terminating in the outer intermediate land portion are formed at intervals in the tire circumferential direction in the outer intermediate land portion, a length L a distance W a total value of a groove width WG", "in the center land portion, a plurality of center lug grooves extending in the tire width direction and having one ends communicating with the inner center main groove and other ends terminating in the center land portion are formed at intervals in the tire circumferential direction.", "the other ends of the center lug grooves terminate within the center land portion without traversing the tire equator.", "in the center land portion, a plurality of center sipes extending in the tire width direction and having one ends communicating with the outer center main groove and other ends terminating within the center land portion without traversing the tire equator are formed at intervals in the tire circumferential direction.", "a width Wr", "a width Wr", "a width Wr", "an inclination angle θ", "groove walls on the vehicle outer sides of the inner shoulder main groove and the outer center main groove have edge portions chamfered in a zigzag shape.", "the inner intermediate lug groove has an inclined portion that is inclined such that a groove depth gradually shallows toward a terminal end side from a position 50% to 65% of the length L", "the outer intermediate lug groove has an inclined portion that is inclined such that a groove depth gradually shallows toward a terminal end side from a position 35% to 50% of the length L", "the center lug groove has an inclined portion that is inclined such that a groove depth gradually shallows toward a terminal end side from a position 25% to 40% of the length L", "in the center land portion, a plurality of center sipes extending in the tire width direction and having one ends communicating with the outer center main groove and other ends terminating within the center land portion without traversing the tire equator are formed at intervals in the tire circumferential direction.", "a width Wr", "a width Wr", "a width Wr", "an inclination angle θ", "groove walls on the vehicle outer sides of the inner shoulder main groove and the outer center main groove have edge portions chamfered in a zigzag shape.", "the inner intermediate lug groove has an inclined portion that is inclined such that a groove depth gradually shallows toward a terminal end side from a position 50% to 65% of the length L", "the outer intermediate lug groove has an inclined portion that is inclined such that a groove depth gradually shallows toward a terminal end side from a position 35% to 50% of the length L"], "bibtex": "@patent{20240300267,\n    title = {PNEUMATIC TIRE},\n    number = {20240300267},\n    year = {2024},\n    note = {File: US20240300267A1-20240912.XML}\n    }", "classification": "B60C1104FI"}, {"title": "TIRE", "doc_number": "20240300268", "filename": "US20240300268A1-20240912.XML", "abstract": "A tire comprises: a projecting portion that projects outward in a tire width direction from a tire outer circumferential surface of a sidewall portion; and a communication device embedded in the projecting portion.", "detailed_description": ["Embodiments of a tire according to the present disclosure will be described below with reference to the drawings. Common members and parts in the drawings are given the same reference signs. The drawings are schematic and the ratios of dimensions and the like may differ from the actual ones. In this specification, the “tire width direction” denotes a direction parallel to the rotation axis of the tire, the “tire radial direction” denotes a direction orthogonal to the rotation axis of the tire, and the “tire circumferential direction” denotes a direction in which the tire rotates around the rotation axis of the tire.", "", "In this specification, the “tire radial inner side” denotes the side closer to the rotation axis of the tire in the tire radial direction, and the “tire radial outer side” denotes the side farther from the rotation axis of the tire in the tire radial direction. Moreover, the “tire widthwise inner side” denotes the side closer to the tire equatorial plane CL in the tire width direction, and the “tire widthwise outer side” denotes the side farther from the tire equatorial plane CL in the tire width direction.", "", "In this specification, the positional relationship between the elements of the tire is measured in a reference state, unless otherwise specified. The “reference state” is a state in which the tire is attached to a rim of a wheel, which is an applicable rim, filled to a prescribed internal pressure, and placed under no load. Both ends in the tire width direction of the contact patch that is in contact with the road surface in a state in which the tire is attached to a rim of a wheel, which is an applicable rim, filled to a prescribed internal pressure, and placed under a prescribed load are referred to as ground contact edges E. In the following description, it is assumed that the tire has its inner cavity filled with air and is mounted on a vehicle such as a passenger vehicle. However, the inner cavity of the tire may be filled with a fluid other than air, and the tire may be mounted on a vehicle other than a passenger vehicle.", "", "In this specification, the “applicable rim” is an approved rim (“measuring rim” in ETRTO (European Tyre and Rim Technical Organization) Standards Manual, “design rim” in TRA (Tire and Rim Association, Inc.) Year Book) in applicable size that is described or will be described in the future in an effective industrial standard in areas where tires are produced and used, such as JATMA (Japan Automobile Tyre Manufacturers Association) Year Book in Japan, ETRTO Standards Manual in Europe, or TRA Year Book in the United States. In the case of a size not described in the industrial standard, the “applicable rim” denotes a rim whose width corresponds to the bead width of the tire. The “applicable rim” includes not only current size but also a size that may be included in the industrial standard in the future. An example of the “size that will be described in the future” is the size described as “future developments” in ETRTO Standards Manual 2013.", "", "In this specification, the “prescribed internal pressure” denotes the air pressure (maximum air pressure) corresponding to the maximum load capability of a single wheel in applicable size and ply rating described in the industrial standard such as JATMA Year Book. In the case of a size not described in the industrial standard, the “prescribed internal pressure” denotes the air pressure (maximum air pressure) corresponding to the maximum load capability defined for each vehicle on which the tire is mounted. In this specification, the “prescribed load” denotes the load corresponding to the maximum load capability of a single wheel in applicable size and ply rating described in the industrial standard. In the case of a size not described in the industrial standard, the “prescribed load” denotes the load corresponding to the maximum load capability defined for each vehicle on which the tire is mounted."], "claims": ["a projecting portion that projects outward in a tire width direction on a tire outer circumferential surface of a sidewall portion; and a communication device embedded in the projecting portion.", "the communication device is embedded at a boundary between the at least part of the rubber chafer and the at least part of the side rubber.", "3 . The tire according to claim 1 , wherein the projecting portion is made of a different rubber material from an other portion adjacent to the projecting portion in the sidewall portion.", "4 . The tire according to claim 1 , wherein a width of the projecting portion decreases toward an outer side in a projecting direction of the projecting portion in a cross-sectional view in the tire width direction.", "5 . The tire according to claim 1 , wherein in a reference state in which the tire is attached to an applicable rim, filled to a prescribed internal pressure, and placed under no load, the projecting portion is located inward in a tire radial direction from a position of a tire maximum width.", "6 . The tire according to claim 1 , wherein in a reference state in which the tire is attached to an applicable rim, filled to a prescribed internal pressure, and placed under no load, the projecting portion projects to a position that is outward in the tire width direction from a tire widthwise outer end of the applicable rim.", "7 . The tire according to claim 1 , wherein in a reference state in which the tire is attached to an applicable rim, filled to a prescribed internal pressure, and placed under no load, the projecting portion is located outward in a tire radial direction from a position of a tire maximum width.", "8 . The tire according to claim 2 , wherein a width of the projecting portion decreases toward an outer side in a projecting direction of the projecting portion in a cross-sectional view in the tire width direction.", "9 . The tire according to claim 2 , wherein in a reference state in which the tire is attached to an applicable rim, filled to a prescribed internal pressure, and placed under no load, the projecting portion is located inward in a tire radial direction from a position of a tire maximum width.", "10 . The tire according to claim 2 , wherein in a reference state in which the tire is attached to an applicable rim, filled to a prescribed internal pressure, and placed under no load, the projecting portion projects to a position that is outward in the tire width direction from a tire widthwise outer end of the applicable rim.", "11 . The tire according to claim 2 , wherein in a reference state in which the tire is attached to an applicable rim, filled to a prescribed internal pressure, and placed under no load, the projecting portion is located outward in a tire radial direction from a position of a tire maximum width.", "12 . The tire according to claim 3 , wherein a width of the projecting portion decreases toward an outer side in a projecting direction of the projecting portion in a cross-sectional view in the tire width direction.", "13 . The tire according to claim 3 , wherein in a reference state in which the tire is attached to an applicable rim, filled to a prescribed internal pressure, and placed under no load, the projecting portion is located inward in a tire radial direction from a position of a tire maximum width.", "14 . The tire according to claim 3 , wherein in a reference state in which the tire is attached to an applicable rim, filled to a prescribed internal pressure, and placed under no load, the projecting portion projects to a position that is outward in the tire width direction from a tire widthwise outer end of the applicable rim.", "15 . The tire according to claim 3 , wherein in a reference state in which the tire is attached to an applicable rim, filled to a prescribed internal pressure, and placed under no load, the projecting portion is located outward in a tire radial direction from a position of a tire maximum width.", "16 . The tire according to claim 4 , wherein in a reference state in which the tire is attached to an applicable rim, filled to a prescribed internal pressure, and placed under no load, the projecting portion is located inward in a tire radial direction from a position of a tire maximum width.", "17 . The tire according to claim 4 , wherein in a reference state in which the tire is attached to an applicable rim, filled to a prescribed internal pressure, and placed under no load, the projecting portion projects to a position that is outward in the tire width direction from a tire widthwise outer end of the applicable rim.", "18 . The tire according to claim 4 , wherein in a reference state in which the tire is attached to an applicable rim, filled to a prescribed internal pressure, and placed under no load, the projecting portion is located outward in a tire radial direction from a position of a tire maximum width.", "19 . The tire according to claim 5 , wherein in a reference state in which the tire is attached to an applicable rim, filled to a prescribed internal pressure, and placed under no load, the projecting portion projects to a position that is outward in the tire width direction from a tire widthwise outer end of the applicable rim.", "20 . The tire according to claim 8 , wherein in a reference state in which the tire is attached to an applicable rim, filled to a prescribed internal pressure, and placed under no load, the projecting portion is located inward in a tire radial direction from a position of a tire maximum width."], "bibtex": "@patent{20240300268,\n    title = {TIRE},\n    number = {20240300268},\n    year = {2024},\n    note = {File: US20240300268A1-20240912.XML}\n    }", "classification": "B60C1302FI"}, {"title": "TUBELESS TYRE INSERT", "doc_number": "20240300269", "filename": "US20240300269A1-20240912.XML", "abstract": "This invention relates to a tyre insert comprising an inner component comprising a first foam material, and an outer component comprising a second foam material, wherein the second foam material has either a higher or lower density than the first foam material, and wherein the outer component comprises an inwardly facing channel which is shaped to accept the inner component. This invention also relates to a wheel for a vehicle comprising a tyre insert as described above, as well as to a vehicle comprising the wheel.", "detailed_description": ["FIGS.1and2show perspective and end-on views respectively of a tyre insert1according to the invention.FIG.3shows a perspective view of the tyre insert1when fitted to a wheel rim101.", "", "As shown inFIGS.1,2and3, the tyre insert1is annular in shape and comprises an inner surface5(only visible inFIG.1) and side walls10and15(only side wall10being visible inFIGS.1and3). As shown inFIGS.1,2and3, the tyre insert also comprises outer surface20.", "", "Extending from the outer surface20to the inner surface5are multiple through holes or channels, an example of which is indicated25inFIGS.1,2and3. The through holes25have a circular cross-section.", "", "The tyre insert1comprises two annular component parts, and inner component30and an outer component35. These are shown in cross-section, separated from one another, inFIG.4. The left-hand side ofFIG.4shows inner component30, and the right-hand side shows outer component35.", "", "Outer component35is approximately u-shaped, and comprises an outer surface20which faces the surface-contacting part of the tyre (not shown) and two arms45A,45B. The arms45A,45B extend from the two annular edges41A,41B of outer surface20. The arms45A,45B extend inwardly and towards each other such that they form jaws of annular inner channel50of outer component35.", "", "Inner component30has a shape substantially corresponding to that annular inner channel50of outer component35. Inner component30comprises a head55which fits into annular inner channel50and two legs60A,60B which extend inwardly from the head55. The inner ends of legs60A,60B thereby form inner surface5of tyre insert1. Both inner component30and outer component35are shown in cross-section through one of the through holes25.", "", "The inner component30is formed from a first foam material. The outer component35is formed from a second foam material. Both the first and second foam materials are closed cell foams. The inner component30is formed from a polyolefin foam12. The outer component35is formed from a polyolefin foam. In some embodiments, the first foam material can have a higher density than the second foam material. In other embodiments, the first foam material can have a lower density than the second foam material.", "", "FIGS.5and6show the inner30and outer35components that form tyre insert1when fitted together and around wheel rim101. All of the component parts fromFIG.4are present inFIGS.5and6, but for ease of reference not all are labelled. As shown inFIGS.5and6, the cross-section of wheel rim101is substantially in the form of an upside down letter “A”, although other wheel rim shapes could be used.", "", "In order to fit the inner component30into the outer component35, the head55of the inner component30is pushed into annular inner channel50of outer component35. The arms45A,45B of the outer component35deflect around the head55such that it is accepted into channel50. The legs60A,60B then extend inwardly from the channel50.", "", "The assembled tyre insert1is then fitted to the wheel rim101as shown inFIGS.5and6. The tyre insert1is pushed onto the rim and the legs60A,60B deflect in order to allow the tyre insert1to fit into the outer channel110of wheel rim101which is formed by the two legs115A,115B of the “A”.", "", "FIGS.5and6show a cross-section through one of the through holes25.FIG.6shows a inflation valve assembly120fitted through a corresponding hole125of the wheel rim101. The inflation valve assembly comprises a valve body125which is adapted for connection to an inflation device, and a valve head130which is shaped to be accepted by the through hole25.", "", "A circular hole (not visible inFIG.5) is provided in both horizontal bar105and at peak110of the “A”. Inflation valve assembly120has been inserted inwardly through the holes such that it is seated on bar105.", "", "Also shown inFIG.3is rim lock301fitted through wheel rim101on an opposite face to inflation valve201. Rim lock301is an optional feature, but is present in the embodiment in the Figures. Although not shown inFIG.3, rim lock301is fitted through tyre insert1and into one of the circular channels25. Rim lock301has a similar shape to inflation valve201, but does not include a valve. In this way, rotation of the tyre insert1relative to the wheel rim101can be substantially prevented."], "claims": ["1 . A tyre insert comprising an inner component comprising a first foam material, and an outer component comprising a second foam material, wherein the second foam material has either a higher or lower density than the first foam material, and wherein the outer component comprises an inwardly facing channel which is shaped to accept the inner component.", "2 . A tyre insert as claimed in claim 1 , wherein the first foam material comprises a closed cell foam.", "3 . A tyre insert as claimed in claim 2 , wherein the first foam material comprises a polyolefin foam.", "4 . A tyre insert as claimed in claim 1 , wherein the second foam material comprises a closed cell foam.", "5 . A tyre insert as claimed in claim 4 , wherein the second foam material comprises a polyolefin foam.", "6 . A tyre insert as claimed in claim 1 , wherein the inwardly facing channel of the outer component is formed by an outer base and two arms which extend inwardly from the outer base.", "7 . A tyre insert as claimed in claim 6 , wherein the two arms extend inwardly and towards each other from the outer base.", "8 . A tyre insert as claimed in claim 1 , wherein the inner component has a shape which substantially corresponds to that of the inwardly facing channel of the outer component.", "9 . A tyre insert as claimed in claim 1 , wherein the inner component comprises a head which is shaped to fit into the inwardly facing channel of the outer component and a two legs which extend inwardly from the head.", "10 . A tyre insert as claimed in claim 9 , wherein the two legs are shaped such that, in use, there is an annular void formed which is bounded by each leg and the head of the inner component, and a rim of a wheel to which the tyre insert is fitted.", "11 . A tyre insert as claimed in claim 1 , comprising one or more channels extending radially from an inner side of the tyre insert to an outer side of the tyre insert.", "12 . A wheel for a vehicle comprising a tyre insert comprising an inner component comprising a first foam material, and an outer component comprising a second foam material, wherein the second foam material has either a higher or lower density than the first foam material, and wherein the outer component comprises an inwardly facing channel which is shaped to accept the inner component.", "13 . A wheel for a vehicle as claimed in claim 12 , wherein the wheel comprises a rim having an inner circumference and an outer circumference, a tyre mounted around the outer circumference of the rim; and the tyre insert of any one of claims 1-11 inside the tyre.", "14 . A wheel for a vehicle as claimed in claim 12 , wherein the vehicle is a bicycle, electric bicycle, motorcycle, electric motorcycle, scooter, car, lorry, truck or plane.", "15 . A vehicle comprising a wheel comprising a tyre insert comprising an inner component comprising a first foam material, and an outer component comprising a second foam material, wherein the second foam material has either a higher or lower density than the first foam material, and wherein the outer component comprises an inwardly facing channel which is shaped to accept the inner component."], "bibtex": "@patent{20240300269,\n    title = {TUBELESS TYRE INSERT},\n    number = {20240300269},\n    year = {2024},\n    note = {File: US20240300269A1-20240912.XML}\n    }", "classification": "B60C1706FI"}, {"title": "Jack hitch system and device", "doc_number": "20240300270", "filename": "US20240300270A1-20240912.XML", "abstract": "A jack hitch system includes a jack hitch device, including an upper jack hitch assembly with an upper elongated body, left and right pivotable and extendable handlebars, an I-shaped member, a front wheel, a lifting assemblage with a interior lifting assembly, a rotatable handle and an electric engine, and a front mounting piece for connecting to a hitch mount of a vehicle, and a lower jack hitch assembly with a lower elongated body, left and right rear wheels, a rear mounting piece for mounting an accessory object. The system can include a jack hitch platform, including pivotable side panels, pivotable wheels, and a front mounting connector.", "detailed_description": ["Before describing the invention in detail, it should be observed that the present invention resides primarily in a novel and non-obvious combination of elements and process steps. So as not to obscure the disclosure with details that will readily be apparent to those skilled in the art, certain conventional elements and steps have been presented with lesser detail, while the drawings and specification describe in greater detail other elements and steps pertinent to understanding the invention.", "", "The following embodiments are not intended to define limits as to the structure or method of the invention, but only to provide exemplary constructions. The embodiments are permissive rather than mandatory and illustrative rather than exhaustive.", "", "In the following, we describe the structure of an embodiment of a jack hitch system100with reference toFIG.1, in such manner that like reference numerals refer to like components throughout; a convention that we shall employ for the remainder of this specification.", "", "In an embodiment, as shown inFIG.1andFIGS.2A-2C, a jack hitch system100can include:a) a jack hitch device110, which is configured to be connected to a hitch mount162of a vehicle160;wherein the jack hitch device110is configured to accept a detachable connection of a jack hitch accessory device, such as a jack hitch platform120.", "", "In related embodiments, the jack hitch accessory device can be configured to carry a special category of objects, such as bicycles or motorcycles.", "", "In another related embodiment, the jack hitch system100can be configured as a system kit, which can include:a) a jack hitch device110, which is configured to be connected to a hitch mount162of a vehicle160; andb) a plurality of jack hitch accessory devices, wherein the jack hitch device110is configured to accept a detachable connection of each jack hitch accessory device in the plurality of jack hitch accessory devices, wherein each jack hitch accessory device is configured in the plurality of jack hitch accessory devices is configured to carry cargo objects of a particular type or category of types.", "", "In a further related embodiment, the plurality of jack hitch accessory devices can include:a) at least one jack hitch platform120(such as a small and a large jack hitch platform120); andb) a jack hitch accessory device configured to carry bicycles.", "", "In a related embodiment, as shown inFIG.1andFIGS.2A-2C, a jack hitch system100can include:a) a jack hitch device110, which is configured to be detachably connected to a hitch mount162of a vehicle160; andb) a jack hitch platform120, which is configured to be attached to the jack hitch device110, such that the jack hitch platform120is configured to receive a cargo object170for transportation, such as a tool box, trash can, cooler, refrigerator, suitcase, luggage, tool box, moving box, general box, or other type of object, such that the cargo object170is positioned on a surface of the jack hitch platform120.", "", "In a related embodiment, as shown inFIGS.3A-3F, the jack hitch device110can include an upper jack hitch assembly302, which can include:a) an upper elongated body312, which can be hollow with an upper elongated interior388, which can be configured with an upper rectangular cross-sectional shape, as shown inFIG.3G;b) a left handlebar320, which can be pivotably382mounted to a left side of the upper elongated body312, such that the left handlebar320can be positioned in a left stowed position383along the upper elongated body312and in a folded-out configuration, perpendicular to an elongated direction of the upper elongated body312;wherein the left handlebar320can be configured to be length-adjustable and telescoping, such that the left handlebar320can further include:i. a left inner handle portion321; andii. a left outer handle portion322;such that the left inner handle portion321is hollow and configured to slidably receive the left outer handle portion322, which is configured to slide into the left inner handle portion321;c) a right handlebar325, which can be pivotably384mounted to a right side of the upper elongated body312, such that the right handlebar325can be positioned in a right stowed position385along the upper elongated body312and in a folded-out configuration, perpendicular to an elongated direction of the upper elongated body312;wherein the right handlebar325can be configured to be length-adjustable and telescoping, such that the right handlebar325can further include:i. a right inner handle portion326; andii. a right outer handle portion327;such that the right inner handle portion326is hollow and configured to slidably receive the right outer handle portion327, which is configured to be slidable into the right inner handle portion326.", "", "In a further embodiment, the left inner handle portion322and the right inner handle portion326can respectively include respectively a left plurality of handle apertures323and a right plurality of handle apertures328, such that the left outer handle portion321and the right outer handle portion327further include respectively a left spring button lock324and a right spring button lock329; such that each of the left outer handle portion321and the right outer handle portion327are detachably lockable in a selected extended position, with a corresponding spring button lock324,329protruding through a corresponding selected aperture323,328.", "", "In a further related embodiment, as shown inFIGS.3A-3F, the jack hitch device110can further include a lower jack hitch assembly304, which can include:a) a lower elongated body314, which can be configured with a lower rectangular cross-sectional shape, such that the lower elongated body314is configured to be slidable into the upper elongated interior of the upper elongated body312, such that the upper rectangular cross-sectional shape the and lower rectangular cross-sectional shape prevent rotation of the lower elongated body314inside the upper elongated interior;b) left and right wheels332,334, which can be rotatably mounted to a lower end of the lower elongated body314, on lower left and right sides of the lower elongated body314, respectively;c) a rear mounting piece336, which is hollow and comprises a rear mounting interior338, wherein the rear mounting piece336can be perpendicularly connected to a rear side of a lower end of the lower elongated body314, such that the rear mounting piece336is configured to connect to (i.e., mount) an accessory, such as the jack hitch platform120, on a rear side of the jack hitch device110.", "", "In a further related embodiment, as shown inFIGS.3A-3F, the upper jack hitch assembly302of the jack hitch device110can further include:a) an l-shaped member340, which can include:i. a horizontally protruding piece342, such that an inner end of the horizontally protruding piece342is connected to a front of a lower end of the upper elongated body312; andii. a vertically protruding piece344, such that an upper end of the vertically protruding piece344is connected to an outer end of the horizontally protruding piece242;b) a front mounting piece346, wherein the front mounting piece346can be perpendicularly connected to a front side of a lower end of the vertically protruding piece344, such that the front mounting piece346is configured to attach to a hitch mount162of a vehicle160;c) at least one front wheel348, which can be mounted on a lower end of the vertically protruding piece344, such that the jack hitch device110can be configured to stand independently on the left and right rear wheels332,334and the at least one front wheel348, with the at least one front wheel348set at level with the left and right rear wheels332,334, as shown inFIG.5A;d) a lifting assemblage350, which can include:i. an interior lifting assembly352, which is connected between the upper elongated body312and the lower elongated body314, such that the interior lifting mechanism352is configured to vertically move363,365, i.e. lift/retract363or lower/extract365, the lower elongated body314relative to the upper elongated body312;ii. a rotatable handle354, which is connected to the interior lifting assembly352, wherein the rotatable handle354is configured such that:1. rotation of the rotatable handle354in a first handle direction362causes the interior lifting assembly352to lift/retract363the lower elongated body314relative to the upper elongated body312; and2. rotation of the rotatable handle354in a second handle direction364causes the interior lifting assembly352to lower/extend365the lower elongated body314relative to the upper elongated body312;iii. an electric motor356, which comprises a rotatable shaft357, wherein the electric motor356is connected to the upper elongated body312(such as for example via a motor housing378, which is connected to the upper elongated body312, wherein the electric motor356is mounted inside the motor housing378) and the rotatable shaft357is connected to the interior lifting assembly352, wherein the electric motor356is configured such that:1. rotation of the rotatable shaft357in a first motor direction372causes the interior lifting assembly352to lift/retract363the lower elongated body314relative to the upper elongated body312; and2. rotation of the rotatable shaft357in a second motor direction374causes the interior lifting assembly352to lower/extend365the lower elongated body314relative to the upper elongated body312.", "", "In a related embodiment, the interior lifting assembly352can further include a mechanical rotational translation assembly, which can be configured to translate a handle vertical rotation orientation of the rotatable handle354to a uniform horizontal rotation orientation to match a motor horizontal rotation orientation of the rotatable shaft357of the electric motor356; or alternatively can be configured to translate a motor horizontal rotation orientation of the rotatable shaft357of the electric motor356to a uniform vertical rotation orientation to match a handle vertical rotation orientation of the rotatable handle354.", "", "In a related embodiment, the jack hitch device110, can include an electric control system600, which can include:a) the electric motor356;b) an electric socket612, which can receive a hitch power plug670of the vehicle (or a power plug from another power source), to provide power to the electric control system600via internal power wiring632of the electric control system600;c) optionally, a rechargeable battery613;d) a controller614(or control processor), which can be a simple electronic circuit or a micro-controller with an onboard controller, or another type of control circuit or computer device;e) an on/off switch616, which is configured to enable control by a user680of switching power to the electric control system on and off;f) a direction button620, which is configured to enable control of a direction of the electric motor356by a user680, such that pressing on a first side621causes a rotation of the rotatable shaft357in a first motor direction372, and such that pressing on a second side622causes a rotation of the rotatable shaft357in a second motor direction374;g) a power wiring632, which transfers electric power to the electric engine; andh) a control wiring/bus634, which transfers control signals from control buttons616,620to the controller614.", "", "In a yet further related embodiment, the front mounting piece346can be vertically adjustable, such that the front mounting piece346can be securable/lockable in a selected position along the vertically protruding piece344.", "", "In a yet further related embodiment, the front mounting piece346can further include a front mounting body390, left and right flanges392,394(attached to the front mounting body390) with corresponding left and right apertures393,395, and the vertically protruding piece344can include a plurality of mounting apertures396, such that the front mounting piece346can be secured in a selected position with at least one lock pin398protruding through the corresponding left and right apertures393,395, and a selected mounting aperture396; i.e., such that the front mounting piece346further comprises a left flange392and a right flange394, including a corresponding left aperture393and a corresponding right aperture395, respectively; and the vertically protruding piece344comprises a plurality of mounting apertures396, such that the front mounting piece346is securable in a selected position with at a lock pin398protruding through the corresponding left aperture393, the corresponding right aperture393, and a selected mounting aperture396in the plurality of mounting apertures393.", "", "In a related embodiment, the interior lifting assembly352can be configured as a linear actuator, which can be a mechanical linear actuator (note that the assembly of the interior lifting assembly352and the electric motor356is an electro-mechanical linear actuator), wherein the mechanical linear actuator converts a rotary motion into a linear motion, such that the mechanical linear actuator can include various well-known designs, including:a) Screw-based mechanical linear actuators, which can include leadscrew, screw jack, ball screw and roller screw mechanical linear actuators, wherein a rotation of the actuator's “nut” causes a linear motion of a “screw shaft”; andb) Wheel and axle based, which can include hoist, winch, rack and pinion, chain drive, belt drive, rigid chain, and rigid belt actuators, which all operate on the principle of a wheel and axle, wherein a rotating wheel moves a cable, rack, chain, or belt in a linear motion.", "", "In a related embodiment, as shown inFIGS.1,2A-2C, and4A-4E, the jack hitch platform120, can include:a) a platform surface410, as shown inFIG.4A, which can include:i. a plurality of vertically oriented longitudinal plates412;ii. a plurality of connector rods414, which laterally penetrate the vertically oriented longitudinal plates, such that the plurality of connector rods414stabilize the plurality of vertically oriented longitudinal plates412;b) a rear side panel422;c) left and right front panels424,426;d) a right side pivotable panel434, which is configured to pivot to a closed position in an upright/vertical orientation to close a circumference around the platform surface410, and pivot to a folded down configuration, with an outer end of the right side pivotable panel434resting on an adjacent ground surface180, such that the right side pivotable panel434facilitates loading of a cargo object170onto the platform surface410;e) a left side pivotable panel432, which is configured to pivot to a closed position in an upright/vertical orientation to close a circumference around the platform surface410, and pivot to a folded down configuration, with an outer end of the left side pivotable panel432resting on an adjacent ground surface180, such that the left side pivotable panel432facilitates loading of a cargo object170onto the platform surface410;f) a plurality of pivotable wheels460mounted to a bottom surface of the platform surface410, such as six pivotable wheels460as shown inFIG.2C, which can also be referred to a roller wheels or caster wheels, i.e. rotatable wheels that can pivot 360 degrees, to allow rolling in any direction; andg) a front mounting connector452, wherein the front mounting connector452can be connected to a front side of the platform surface410, such that the front mounting connector452is configured to attach to a rear mounting piece336of the jack hitch device110, for example using a pin212and mounting clip214, as shown inFIGS.2A,4A, and4D.", "", "In related embodiments, the pivotable side panel434, can be configured as left or right pivotable side panel432,434, or as a rear side pivotable panel422(which would allow loading onto a rear of the platform surface410).", "", "In a related embodiment, as shown inFIGS.4A and4B, a front-most longitudinal plate412,472can further include left and right upward protruding front mounting points473,474(each including a front mounting aperture); and a rear-most oriented longitudinal plate412,476can further include left and right upward protruding rear mounting points477,478(each including a rear mounting aperture); such that the left and right upward protruding front mounting points473,474and the left and right upward protruding rear mounting points477,478can be used as tie-down mounting points for securing a cargo object170on the platform surface410, for example by using straps or cables.", "", "In a related embodiment, as shown inFIGS.2A and4A, the platform surface410can further include:a) a plurality of m-shaped mounting clips220, each comprising:i. a first downward-facing u-shaped portion482; andii. a second downward-facing u-shaped portion484;wherein each of the pivotable wheels460, can be mounted using an m-shaped mounting clip220, such that the m-shaped mounting clip is configured to clip on top of a first vertically oriented longitudinal plate412and a second vertically oriented longitudinal plate413(with first and second u-shaped portions sliding onto the first vertically oriented longitudinal plate412and the second vertically oriented longitudinal plate413, respectively), such that a nut486secures an upward protruding bolt462of the wheel460, with the upward protruding bolt462protruding through an aperture of the m-shaped mounting clip220, i.e. such that the corresponding m-shaped mounting clip220is configured to secure a corresponding pivotable wheel460, with an upward protruding bolt462of the corresponding pivotable wheel460protruding through an aperture of the m-shaped mounting clip220.", "", "In a related embodiment, at least one side, or left and right sides of the platform surface410can be configured with a beveled cutoff442,444, which can be configured to align438with a top surface436of a respective left or right side pivotable panel432,434, such that the beveled cutoff442,444a top surface436of a respective left or right side pivotable panel432,434form combined a loading plane439, when the respective left or right side pivotable panel432,434is positioned in the folded down configuration, such that the alignment438of the top surface and the beveled cutoff442,444, facilitates loading of a cargo object170onto the platform surface410.", "", "In another related embodiment, a front side of the platform surface can be configured with a recess418, such that the front mounting connector452is connected to a bottom of the recess418, such that the front mounting connector452protrudes forward from the bottom of the recess418, to facilitate a closer mounting between the jack hitch platform120and the jack hitch device110.", "", "Thus, in an embodiment, a jack hitch system100, can include a jack hitch device110, which is configured to be connected to a hitch mount162of a vehicle160, such that the jack hitch device110is configured to accept a detachable connection of a jack hitch accessory device, such as a jack hitch platform120; wherein the jack hitch device comprises:a) an upper jack hitch assembly302, which comprises an upper elongated body312, which comprises an upper elongated interior;b) a lower jack hitch assembly304, which comprises a lower elongated body314;wherein at least an upper portion of the lower elongated body314is configured to be slidable into the upper elongated interior of the upper elongated body312.", "", "In an embodiment, as illustrated inFIGS.1,5A-5E and7, a jack hitch method700for using a jack hitch system100, can include:a) Positioning702a cargo object170onto a jack hitch device110, as shown inFIG.5A;b) Vertically aligning704a height of a rear mounting piece336of the jack hitch device110, by vertically adjusting564the lower elongated body314relative to the upper elongated body312of the jack hitch device110, such that the rear mounting piece336of the jack hitch device110is vertically aligned with the front mounting connector452of the jack hitch platform120, as shown inFIG.5B;c) Connecting706the jack hitch device110with the jack hitch platform120, by connecting the rear mounting piece336with the front mounting connector452, as shown inFIGS.5B and5C;d) Vertically aligning708a height of a front mounting piece346of the jack hitch device110, by vertically adjusting568the upper elongated body312relative to the lower elongated body314of the jack hitch device110, such that the front mounting piece346of the jack hitch device110is vertically aligned with the hitch mount162of the vehicle160, as shown inFIG.5D;e) Connecting710the jack hitch system100with the vehicle160, by connecting the front mounting piece346with the hitch mount162, as shown inFIG.5E; andf) Lifting712the jack hitch platform120(with the cargo object170) from the ground surface180, by vertically lifting572the lower elongated body314relative to the upper elongated body312of the jack hitch device110, as shown inFIG.5E, such that the vehicle160is prepared for driving with the jack hitch system100attached, as shown inFIG.1.", "", "Thus, in various related embodiments, the jack hitch system100can include:a) A foot pad with wheel support, wherein:i. At the base of the Jack Hitch is a support plate with radiused edges like the removable foot on a trailer jack preventing the jack stand from sinking into the ground. This support plate can have pre-located mounting holes integrated into the radiused edges for optional wheel installation. When installed, the user can wheel the Jack Hitch to a vehicle for transport;b) Integrated Support Plate for carrying trash cans, dirt bikes, etc., wherein:i. A trailer support plate utilizes a square metal tube that inserts into the vehicles trailer hitch. The proposed design of this support plate allows for centering the weight of the items on the plate by moving the trailer hitch assembly into the center of the support plate. It is like an interlock feature where the support plate slides further into the trailer hitch moving the center of gravity closer to the vehicle and limiting rotation and increasing the maximum supported weight;c) Integrated jack that allows weight to be lifted and locked, wherein:i. Trailer jacks are designed to lift weight by extending the piston to force up the trailer allowing for the vehicle to then receive the hitch. This design includes the opposite jack feature. The ability to now lift (retract) the piston enabling the lift of the items at a defined maximum weight. This can be achieved manually, automatically or a combination of both. For example, when the Jack Hitch is mounted into a vehicle receiver, the jack is capable of lowering the support plate to the ground to load trash cans. Then the Jack Hitch can lift the weight of the items on the support plate into position for transport. This may include a manual lock pin (clevis) to prevent accidental failure during transport;d) Anti-Spin technology for mounted products. (Square Component Design), wherein:i. The anti-spin feature is simply designing a Jack Hitch with integrated ribs, square tube stock, etc., preventing the lateral rotation of a legacy round tube jack stand. This can be accomplished again through design and manual verification similar to the use of a lock pin (clevis) to prevent accidental failure during transport;e) Lift and Level feature. (Allowing for alignment with the vehicle hitch, wherein:i. The lift and level feature uses the suggested Jack Hitch lift feature described above. Coupled with an integrated bubble level or digital level the Jack Hitch receiver can then ensure the towed accessory is leveled correctly or can be adjusted to accommodate rougher terrain. This can be integrated with a maximum level adjustment of −30 degrees to +30 degrees. (Limited to the height and weight of the items being towed);f) Mobility Wheels for the accessories and the trailer hitch, wherein:i. As described above, the primary Jack Hitch vehicle receiver can be designed with pre-located mounting holes integrated into the receiver tube for optional wheel installation. (Identical to the design of the foot pad described above) This now allows a user to install and utilize four wheels enabling the movement of the entire Jack Hitch system, thereby providing the ability to wheel the Jack Hitch into position and easily insert into the trailer hitch;g) Snap in Mobility wheels for accessories. (Mesh Towing Support Plate), wherein:i. As described for the Jack Hitch mobility wheels, this introduces the ability to install snap in, 360-degree industrial wheels into the frame of the mesh towing support plate. This allows for rolling the mesh support plate into position for the Jack Hitch receiver; andii. When using the optional mesh towing plate with the integrated mobility wheels, items like wheelchairs, dirt bikes, motorcycles, kayaks, camping gear etc. can be moved to and aligned to the vehicle receiver for ease of installation. (Move the trailer not the vehicle);h) Integrated mobility handle for wheeling the unit or accessories, wherein:i. The Jack Hitch can include a convenient ergonomic handle at the upper portion of the jack stand. This is utilized to push and pull of the Jack Hitch and any installed accessories. This can provide access similar to a hospital IV stand with wheels; andi) Integrated lighting for on road use, wherein:i. The Jack Hitch can include the option to add LED marker lights and/or integrated brake and reverse lights when utilizing the vehicle trailer light plug.", "", "In a related embodiment, as shown inFIGS.8A-8AandFIGS.2A-2C, a jack hitch system100,800can include:a) a jack hitch device110, which is configured to be detachably connected to a hitch mount162of a vehicle160; andb) a jack hitch platform820, which is configured to be attached to the jack hitch device110, such that the jack hitch platform120is configured to receive a cargo object170for transportation, such as a tool box, trash can, cooler, refrigerator, suitcase, luggage, tool box, moving box, general box, or other type of object, such that the cargo object170is positioned on a surface of the jack hitch platform120;wherein a main body of the jack hitch platform820is pivotable822between a pivoted-down position (as shown inFIG.8A) for use with a mounted cargo object170and a pivoted-up position (as shown inFIG.8B) for use during transport or storage without a mounted cargo object170.", "", "In a further related embodiment, a front mounting connector452,852can for example comprise an inner portion854and an outer portion856, which are pivotably connected with a connecting lockable pivot point/axle824, to enable a lockable pivoting826of an inner portion of the front mounting connector452,852, which enables pivoting822of the main body of the jack hitch platform820.", "", "Here has thus been described a multitude of embodiments of the jack hitch system100, and methods related thereto, which can be employed in numerous modes of usage.", "", "The many features and advantages of the invention are apparent from the detailed specification, and thus, it is intended by the appended claims to cover all such features and advantages of the invention, which fall within the true spirit and scope of the invention.", "", "Many such alternative configurations are readily apparent and should be considered fully included in this specification and the claims appended hereto. Accordingly, since numerous modifications and variations will readily occur to those skilled in the art, the invention is not limited to the exact construction and operation illustrated and described, and thus, all suitable modifications and equivalents may be resorted to, falling within the scope of the invention."], "claims": ["a) a jack hitch device, which is configured to be connected to a hitch mount of a vehicle; and b) a jack hitch platform, which is configured to be detachably connected to the jack hitch device, wherein the jack hitch platform is configured to receive a cargo object for transportation.", "a) an upper elongated body; b) a left handlebar, which is pivotably mounted to a left side of the upper elongated body, such that the left handlebar is configured to be positionable in a left stowed position along the upper elongated body, and such that the left handlebar is configured to be positionable in a left folded-out configuration, which is perpendicular to an elongated direction of the upper elongated body; and c) a right handlebar, which is pivotably mounted to a right side of the upper elongated body, such that the right handlebar is configured to be positionable in a right stowed position along the upper elongated body, and such that the right handlebar is configured to be positionable in a right folded-out configuration, which is perpendicular to the elongated direction of the upper elongated body.", "3 . The jack hitch system of claim 2 , wherein the upper elongated body is hollow and comprises an upper elongated interior.", "4 . The jack hitch system of claim 3 , wherein the upper elongated interior is configured with an upper rectangular cross-sectional shape.", "5 . The jack hitch system of claim 2 , wherein the left handlebar is configured to be length-adjustable and telescoping, and wherein the right handlebar is configured to be length-adjustable and telescoping.", "a left inner handle portion; and a left outer handle portion; such that the left inner handle portion is hollow and configured to slidably receive the left outer handle portion, which is configured to slide into the left inner handle portion; and wherein the right handlebar further comprises: a right inner handle portion; and a right outer handle portion; such that the right inner handle portion is hollow and configured to slidably receive the right outer handle portion, which is configured to be slidable into the right inner handle portion.", "a lower elongated body, which is configured with a lower rectangular cross-sectional shape, such that the lower elongated body is configured to be slidable into the upper elongated interior of the upper elongated body, such that the upper rectangular cross-sectional shape and the lower rectangular cross-sectional shape prevent rotation of the lower elongated body inside the upper elongated interior.", "a lower elongated body, which is configured to be slidable into the upper elongated interior of the upper elongated body; and left and right rear wheels, which are rotatably mounted to a lower end of the lower elongated body, on lower left and right sides of the lower elongated body, respectively.", "a rear mounting piece, which is hollow and comprises a rear mounting interior, wherein the rear mounting piece is connected to a rear side of a lower end of the lower elongated body, such that the rear mounting piece is configured to connect to the jack hitch platform on a rear side of the jack hitch device.", "a) an l-shaped member, comprising: a horizontally protruding piece, such that an inner end of the horizontally protruding piece is connected to a front of a lower end of the upper elongated body; and a vertically protruding piece, such that an upper end of the vertically protruding piece is connected to an outer end of the horizontally protruding piece; and b) at least one front wheel, which is mounted on a lower end of the vertically protruding piece, such that the jack hitch device is configured to stand independently on the left and right rear wheels and the at least one front wheel, when the at least one front wheel is at level with the left and right rear wheels.", "a front mounting piece, wherein the front mounting piece is perpendicularly connected to a front side of a lower end of the vertically protruding piece, such that the front mounting piece is configured to attach to the hitch mount of the vehicle.", "12 . The jack hitch system of claim 11 , wherein the front mounting piece is configured to be vertically adjustable, such that the front mounting piece is lockable in a selected position along the vertically protruding piece.", "13 . The jack hitch system of claim 12 , wherein the front mounting piece further comprises a left flange and a right flange, including a corresponding left aperture and a corresponding right aperture, respectively; and the vertically protruding piece comprises a plurality of mounting apertures, such that the front mounting piece is securable in a selected position with at a lock pin protruding through the corresponding left aperture, the corresponding right aperture, and a selected mounting aperture in the plurality of mounting apertures.", "an interior lifting assembly, which is connected between the upper elongated body and the lower elongated body, such that the interior lifting mechanism is configured to vertically move the lower elongated body relative to the upper elongated body.", "a rotatable handle, which is connected to the interior lifting assembly, wherein the rotatable handle is configured such that: a first rotation of the rotatable handle in a first handle direction causes the interior lifting assembly to retract the lower elongated body relative to the upper elongated body; and a second rotation of the rotatable handle in a second handle direction causes the interior lifting assembly to extend the lower elongated body relative to the upper elongated body.", "an electric motor, which comprises a rotatable shaft, wherein the electric motor is connected to the upper elongated body and the rotatable shaft is connected to the interior lifting assembly, wherein the electric motor is configured such that: a first rotation of the rotatable shaft in a first motor direction causes the interior lifting assembly retract the lower elongated body relative to the upper elongated body; and a second rotation of the rotatable shaft in a second motor direction causes the interior lifting assembly to extend the lower elongated body relative to the upper elongated body.", "a platform surface; and a right side pivotable panel, which is configured to pivot to a closed position in an upright orientation and pivot to a folded down configuration, with an outer end of the right side pivotable panel resting on an adjacent ground surface, such that the right side pivotable panel facilitates loading of the cargo object onto the platform surface.", "a plurality of pivotable wheels, which are mounted to a bottom surface of the platform surface.", "a front mounting connector, wherein the front mounting connector is connected to a front side of the platform surface, such that the front mounting connector is configured to attach to a rear mounting piece of the jack hitch device.", "20 . The jack hitch system of claim 19 , wherein a front side of the platform surface is configured with a recess, such that the front mounting connector protrudes forward from a bottom of the recess, to facilitate a closer mounting between the jack hitch platform and the jack hitch device.", "21 . The jack hitch system of claim 17 , wherein a right side of the platform surface is configured with a beveled cutoff, which is configured to align with a top surface of the right side pivotable panel, when the right side pivotable panel is positioned in the folded down configuration, such that an alignment of the top surface and the beveled cutoff facilitates the loading of the cargo object onto the platform surface.", "a plurality of vertically oriented longitudinal plates; wherein a front-most longitudinal plate further comprises left and right upward protruding front mounting points, each including a front mounting aperture; and wherein a rear-most oriented longitudinal plate further comprises left and right upward protruding rear mounting points, each including a rear mounting aperture; such that the left and right upward protruding front mounting points and the left and right upward protruding rear mounting points are configured to be used as tie-down mounting points for securing the cargo object on the platform surface.", "a) a plurality of vertically oriented longitudinal plates; b) a plurality of m-shaped mounting clips, each comprising: a first downward-facing u-shaped portion; and a second downward-facing u-shaped portion; wherein each corresponding m-shaped mounting clip is configured to clip on top of a first vertically oriented longitudinal plate and a second vertically oriented longitudinal plate, with first downward-facing u-shaped portion and the second downward-facing u-shaped portion sliding onto the first vertically oriented longitudinal plate and the second vertically oriented longitudinal plate, respectively; such that the corresponding m-shaped mounting clip is configured to secure a corresponding pivotable wheel, with an upward protruding bolt of the corresponding pivotable wheel protruding through an aperture of the m-shaped mounting clip.", "a) an upper jack hitch assembly, which comprises an upper elongated body, which comprises an upper elongated interior; and b) a lower jack hitch assembly, which comprises a lower elongated body; wherein at least an upper portion of the lower elongated body is configured to be slidable into the upper elongated interior of the upper elongated body.", "25 . The jack hitch system of claim 24 , wherein the jack hitch accessory device is a jack hitch platform, which is configured to receive a cargo object for transportation.", "a) positioning a cargo object onto a jack hitch device of the jack hitch system; b) vertically aligning a height of a rear mounting piece of the jack hitch device, by vertically adjusting a lower elongated body relative to an upper elongated body of the jack hitch device, such that the rear mounting piece of the jack hitch device is vertically aligned with a front mounting connector of a jack hitch platform; and c) connecting the jack hitch device with the jack hitch platform, by connecting the rear mounting piece with the front mounting connector.", "a) vertically aligning a height of a front mounting piece of the jack hitch device, by vertically adjusting the upper elongated body relative to the lower elongated body of the jack hitch device, such that the front mounting piece of the jack hitch device is vertically aligned with a hitch mount of a vehicle; and b) connecting the jack hitch system with the vehicle, by connecting the front mounting piece with the hitch mount of the vehicle."], "bibtex": "@patent{20240300270,\n    title = {Jack hitch system and device},\n    number = {20240300270},\n    year = {2024},\n    note = {File: US20240300270A1-20240912.XML}\n    }", "classification": "B60D146FI"}, {"title": "Tow Bar Recess Holes Protection Cover Device", "doc_number": "20240300271", "filename": "US20240300271A1-20240912.XML", "abstract": "A protective cap device is disclosed that covers recessed areas on a vehicle used for accommodating RV tow bars during flat towing. The cap device features a circular first end and a generally rectilinear second end connected by cylindrical members. When inserted into a recess hole of the vehicle, the cap device provides a secure seal, preventing the entry of water, snow, road salt, rust, and debris into the hole. The rectilinear second end ensures a stable engagement with the recess hole's interior, even under sudden braking. The cap device is easily inserted and removed, simplifying the process of attaching and detaching tow bars. Additionally, the cap device has oil-absorbing properties which prevents rusting of the tow bar during towing operations.", "detailed_description": ["The innovation is now described with reference to the drawings, wherein like reference numerals are used to refer to like elements throughout. In the following description, for purposes of explanation, numerous specific details are set forth in order to provide a thorough understanding thereof. It may be evident, however, that the innovation can be practiced without these specific details. In other instances, well-known structures and devices are shown in block diagram form in order to facilitate a description thereof. Various embodiments are discussed hereinafter. It should be noted that the figures are described only to facilitate the description of the embodiments. They are not intended as an exhaustive description of the invention and do not limit the scope of the invention. Additionally, an illustrated embodiment need not have all the aspects or advantages shown. Thus, in other embodiments, any of the features described herein from different embodiments may be combined.", "", "As noted above, there is a long felt need in the art for a cap device that serves as a protective barrier for recess holes used for accommodating RV tow bars. There is also a long felt need in the art for an RV tow bar recess holes protective device that prevents water, snow, road salt, rust, and debris from entering the recess holes and keeping them clean. Additionally, there is a long felt need in the art for a vehicle's towing recess holes protective cap that avoids the hassle and cost of cleaning the recess holes before each towing operation. Moreover, there is a long felt need in the art for a protective cap or cover that protects the recessed areas used for towing a vehicle, eliminating the need for frequent cleaning, and ensuring smoother towing experiences. Further, there is a long felt need in the art for a recess hole protective cap that prevents debris buildup in towing recess holes and prevents rusting of a tow bar used with the recess holes. Furthermore, there is a long felt need in the art for a protective cap that covers a towing recess hole while improving aesthetics of a vehicle. Finally, there is a long felt need in the art for a flat tow protection cap that saves considerable time and effort when towing vehicles with an RV.", "", "The present invention, in one exemplary embodiment, is a flat tow protection cap for an RV tow bar. The cap has a foam-like, recessed interior area and the foam material is absorbent such that the cap can receive oil to prevent rusting of the tow bar. During use, users can apply the protection cap to cover the recessed interior areas to prevent debris buildup on the vehicle and its tow bar area. The vehicle can be easily towed by an RV and the cap saves considerable time and effort when towing vehicles with an RV while improving their aesthetics.", "", "Referring initially to the drawings,FIG.1illustrates a perspective view of a flat tow recess hole protective cap of the present invention in accordance with the disclosed architecture. The flat tow recess hole protective cap100of the present invention is designed as a protective cover for covering recessed areas used for accommodating RV tow bars on a vehicle. More specifically, the recess hole cap100has a one-piece structure and is made of a flexible and oil-absorbing foam material. The protective cap device100has a circular first end102and a generally rectilinear second end104. A first cylindrical member106extends from the bottom surface108of the first end102to a second cylindrical member110. The second cylindrical member110extends between the bottom surface112of the first cylindrical member106and the top end114of the generally rectilinear second end104. The length of the first cylindrical member106is about six to twelve times the length of the second cylindrical member110. Further, diameter of the first cylindrical member106is about two to five times the diameter of the second cylindrical member110.", "", "The generally rectilinear second end104, and the cylindrical members106,110are designed to insert into a recess hole disposed in a vehicle used for flat towing and accommodating the RV tow bar as illustrated inFIG.4. The circular first end102abuts against the vehicular surface and prevents entry of water, snow, road salt, rust, and other debris inside the recess hole. Depending on design of the vehicle, length, and size of the protective cover100can be configured. Further, color of the device100can be configured to match the color of the vehicle with which the protective cap100is to be used. The device100can be easily inserted into a recess hole with the generally rectilinear second end104, the cylindrical members106,110accommodated inside the hole and the circular first end102can be used for pulling out the device100when a tow bar is to be used for towing the vehicle.", "", "FIG.2Aillustrates another perspective view showing the tapered shape of the first end of the protective cap device of the present invention in accordance with the disclosed architecture. The first end102has a generally circular shape and has a circular top surface116whose diameter is smaller than the bottom surface108. The first end102is solid and has tapered shape118between the top surface116and the bottom surface108. The first end102is designed for a user to easily hold the device100by gripping the device100along the bottom surface108. The generally rectilinear second end104in some of the embodiments can rotate relative to an axis120along the cylindrical members106,110. This enables a user to align the second end104with a recess hole for inserting the device100into the recess hole.", "", "FIG.2Billustrates a top perspective view of the recess hole protective cap of the present invention in accordance with the disclosed architecture. The top end102is circular and the bottom surface108is configured to have a diameter larger than a diameter of the recess hole which is to be covered by the device100. The top surface116of the first end102can have a diameter ranging from 50% to 75% of the diameter of the bottom surface108.", "", "FIG.3illustrates a front perspective view of a vehicle showing the flat tow recess holes and orientation of the protective cover device of the present invention for insertion into the recess holes in accordance with the disclosed architecture. As illustrated, the vehicle300includes two symmetrical and identical recess holes302,304disposed in front306of the vehicle300. The recess holes302,304are used for accommodating RV tow bars for flat towing the vehicle300. When tow bars are not used, then, the cap device100is used for protecting the recess holes302,304. The following description uses recess hole302as an example but the process remains the same for covering the other recess hole304. The cap device100is positioned horizontal (aligning with the recess hole302) with the rectilinear second end104in front of the recess hole302such that the rectilinear second end104and the cylindrical members106,110are inserted into the recess hole302and the circular end102having a diameter greater than the diameter of the recess hole302abuts against the front surface306of the vehicle300, thereby sealing the recess hole302as illustrated inFIG.4.", "", "The rectilinear second end104makes a secure engagement by abutting against the interior308of the recess hole302, thereby preventing the cap device100from falling even when a sudden brake is applied at high speed by a driver of the vehicle300.", "", "FIG.4illustrates a perspective view showing the recess hole cap device inserted into the recess holes of the vehicle in accordance with the disclosed architecture. As illustrated, the rectilinear second end104and the cylindrical members106,110are inserted into the recess holes302,304with the circular end102abutting against the front surface306of the vehicle300. The circular end102covers the holes302,304, thereby preventing entry of weather elements and debris inside the holes302,304. Further, the cap device100is designed to absorb oil present inside the holes302,304, thereby preventing rusting of a tow bar inserted inside the holes302,304during a towing operation.", "", "FIG.5illustrates a top view of another embodiment of the recess hole cap device of the present invention in accordance with the disclosed architecture. In the present embodiment, the device500includes a solar LED502disposed in the circular end504thereof. The solar LED502is configured to illuminate in dark and low light areas for enabling a user to locate recess holes disposed in the vehicle. The solar LED502recharges using solar energy and can illuminate in a single or multiple color in any conventional illumination manner such as continuous or flashing. The cap is adjustable in size to accommodate different sizes of holes and lengths, and may be stored in a convenient storage case when not in use and for easy transportation.", "", "Certain terms are used throughout the following description and claims to refer to particular features or components. As one skilled in the art will appreciate, different persons may refer to the same feature or component by different names. This document does not intend to distinguish between components or features that differ in name but not structure or function. As used herein “flat tow recess hole protective cap”, “recess hole cap”, “protective cover”, “cap device”, and “device” are interchangeable and refer to the vehicle tow bar recess holes protective device100,500of the present invention.", "", "Notwithstanding the forgoing, the vehicle tow bar recess holes protective device100,500of the present invention can be of any suitable size and configuration as is known in the art without affecting the overall concept of the invention, provided that it accomplishes the above stated objectives. One of ordinary skill in the art will appreciate that the vehicle tow bar recess holes protective device100,500as shown in the FIGS. are for illustrative purposes only, and that many other sizes and shapes of the vehicle tow bar recess holes protective device100,500are well within the scope of the present disclosure. Although the dimensions of the vehicle tow bar recess holes protective device100,500are important design parameters for user convenience, the vehicle tow bar recess holes protective device100,500may be of any size that ensures optimal performance during use and/or that suits the user's needs and/or preferences.", "", "Various modifications and additions can be made to the exemplary embodiments discussed without departing from the scope of the present invention. While the embodiments described above refer to particular features, the scope of this invention also includes embodiments having different combinations of features and embodiments that do not include all of the described features. Accordingly, the scope of the present invention is intended to embrace all such alternatives, modifications, and variations as fall within the scope of the claims, together with all equivalents thereof.", "", "What has been described above includes examples of the claimed subject matter. It is, of course, not possible to describe every conceivable combination of components or methodologies for purposes of describing the claimed subject matter, but one of ordinary skill in the art may recognize that many further combinations and permutations of the claimed subject matter are possible. Accordingly, the claimed subject matter is intended to embrace all such alterations, modifications and variations that fall within the spirit and scope of the appended claims. Furthermore, to the extent that the term “includes” is used in either the detailed description or the claims, such term is intended to be inclusive in a manner similar to the term “comprising” as “comprising” is interpreted when employed as a transitional word in a claim."], "claims": ["a protective recess hole cap having a one-piece structure including a circular first end, a generally rectilinear second end, a first cylindrical member extending from a bottom surface of said circular first end to a second cylindrical member; wherein said second cylindrical member extending between said bottom surface of said first cylindrical member and a top end of said generally rectilinear second end; wherein said first cylindrical member having a first length and said second cylindrical member having a second length; wherein said first length of said first cylindrical member from six to twelve times said second length of said second cylindrical member; and further wherein said hole cap is a protective cover for covering a recessed area used for accommodating an RV tow bar on a vehicle.", "2 . The flat tow recess hole protective cap of claim 1 , wherein said first cylindrical member having a first diameter and said second cylindrical member having a second diameter.", "3 . The flat tow recess hole protective cap of claim 2 , wherein said first diameter of said first cylindrical member from two to five times said second diameter of said second cylindrical member.", "4 . The flat tow recess hole protective cap of claim 3 , wherein said hole cap comprising a flexible and oil-absorbing foam material.", "5 . The flat tow recess hole protective cap of claim 4 , wherein said generally rectilinear second end, said first cylindrical member, and said second cylindrical member are inserted into the recessed area when said hole cap is mounted to the vehicle.", "6 . The flat tow recess hole protective cap of claim 5 , wherein said hole cap is a pair of hole caps for protecting a pair of respective recessed areas, and further wherein the recessed areas accommodate an RV tow bar.", "7 . The flat tow recess hole protective cap of claim 6 , wherein said circular first end abutting the vehicle exterior surface.", "8 . The flat tow recess hole protective cap of claim 7 , wherein said circular first end of each said hole cap used for pulling out said hole caps from the respective recessed areas when a tow bar is to be used for towing the vehicle.", "a protective recess hole cap having a one-piece structure including a first end, a generally rectilinear second end, a first cylindrical member extending from a bottom surface of said first end to a second cylindrical member; wherein said first end having a generally circular shape including a circular top surface with a top diameter and a bottom surface with a bottom diameter; wherein said top diameter is less than said bottom diameter; wherein said first end having a tapered shape between said top surface and said bottom surface; wherein said first end providing a grip for a user to hold said hole cap; wherein said second cylindrical member extending between said bottom surface of said first cylindrical member and a top end of said generally rectilinear second end; wherein said first cylindrical member having a first length and said second cylindrical member having a second length; wherein said first length of said first cylindrical member from six to twelve times said second length of said second cylindrical member; and further wherein said hole cap is a protective cover for covering a recessed area used for accommodating an RV tow bar on a vehicle.", "10 . The flat tow recess hole protective cap of claim 9 , wherein said first cylindrical member having a first diameter and said second cylindrical member having a second diameter.", "11 . The flat tow recess hole protective cap of claim 10 , wherein said first diameter of said first cylindrical member from two to five times said second diameter of said second cylindrical member.", "12 . The flat tow recess hole protective cap of claim 11 , wherein said hole cap comprising a flexible and oil-absorbing foam material.", "13 . The flat tow recess hole protective cap of claim 12 , wherein said generally rectilinear second end, said first cylindrical member, and said second cylindrical member are inserted into the recessed area when said hole cap is mounted to the vehicle.", "14 . The flat tow recess hole protective cap of claim 13 , wherein said hole cap is a pair of hole caps for protecting a pair of respective recessed areas, and further wherein the recessed areas accommodate an RV tow bar.", "15 . The flat tow recess hole protective cap of claim 14 , wherein said first end of each said hole cap used for pulling out said hole caps from the respective recessed areas when a tow bar is to be used for towing the vehicle.", "16 . The flat tow recess hole protective cap of claim 13 , wherein said generally rectilinear second end rotatable relative to a vertical axis.", "providing a pair of protective hole caps; wherein each said hole cap having a first end, a generally rectilinear second end, a first cylindrical member extending from a bottom surface of said first end to a second cylindrical member; wherein said first end having a generally circular shape including a circular top surface with a top diameter and a bottom surface with a bottom diameter; wherein said top diameter is less than said bottom diameter; wherein said first end having a tapered shape between said top surface and said bottom surface; wherein said second cylindrical member extending between said bottom surface of said first cylindrical member and a top end of said generally rectilinear second end; wherein said first cylindrical member having a first length and said second cylindrical member having a second length; wherein said first length is greater than said second length; holding said first end as a grip for a user to insert and remove said hole cap from a recessed area of a vehicle; inserting each said hole cap into a respective recessed area of the vehicle when the vehicle in not being towed; and removing each said hole cap from the respective recessed area of the vehicle for accommodating an RV tow bar when the vehicle is being towed.", "18 . The method of protecting flat tow recessed areas of claim 17 , wherein said first cylindrical member having a first diameter and said second cylindrical member having a second diameter, and further wherein said first diameter of said first cylindrical member greater than said second diameter of said second cylindrical member.", "19 . The method of protecting flat tow recessed areas of claim 17 , wherein said hole cap comprising a flexible and oil-absorbing foam material.", "20 . The method of protecting flat tow recessed areas of claim 17 , wherein removing each said hole cap comprising pulling on said first end of each said hole cap."], "bibtex": "@patent{20240300271,\n    title = {Tow Bar Recess Holes Protection Cover Device},\n    number = {20240300271},\n    year = {2024},\n    note = {File: US20240300271A1-20240912.XML}\n    }", "classification": "B60D160FI"}]