[{"title": "SPOKE REINFORCING METHOD AND REINFORCED STRUCTURE OF SPOKES", "doc_number": "20240246357", "filename": "US20240246357A1-20240725.XML", "abstract": "The present invention relates generally to a spoke reinforcing method and reinforced structure of spokes, the method includes a main body of spoke with a head end and a thread part on two ends respectively, a neck is disposed below the head end, the neck is forged at least twice to enlarge the cross-section area of the neck, and to increase the density and strength of the metal grains therein; a hexagonal columnar reinforced structure is forged below this high density neck, and the high frequency lateral stress on the lower part of the high density neck is buffered by the optimal compressive strength and flexural strength of the hexagonal column, the reinforced structure of spokes produced by this method can reduce the spoke fracture probability and prolong the spoke lifetime.", "detailed_description": ["FIGS.10˜14disclose the spoke reinforcing method in a preferred embodiment of the present invention. First, a metal material is drawn into an elbow spoke of the required diameter. The metal material includes, but not limited to stainless steel, carbon steel, titanium alloy, aluminum alloy, etc. The spoke production methods include straight-pull spoke and elbow spoke, taking the elbow spoke production method as an example, as shown inFIG.11(B), the procedure includes straightening and cutoff (001), the drawn spoke (1) is straightened and cut to the required length; first forging (002), one end of the spoke (1) is stamped by a first stamping unit to form the initial head (2) and neck (3); clamp forming (003), the head (2), neck (3) and main body of spoke (1) of the initial formed spoke (1) are clamped by a clamping die, the shape forging of the reinforced part (4) is completed during clamping, a hexagonal column is taken as an example in this embodiment (including, but not limited to triangular prism, quadrangular prism or arbitrary polygonal column); second forging (004), the spoke (1) clamped by the clamping die is stamped by a second stamping unit, so as to form the final head (2), neck (3) and reinforced part (4); bending (005), the neck (3) of the formed spoke (1) is bent; hobbing (006), the end opposite to the head (2) of said spoke (1) is hobbed to form a thread part (5), thus reinforced structure of spokes is completed, as shown inFIG.10.", "", "The straight-pull spoke production method is shown inFIG.11(A), the procedure is free of the bending (005) process, including straightening and cutoff (001), first forging (002), clamp forming (003), second forging (004) and hobbing (006).", "", "The clamp forming (003) in said reinforced spoke manufacturing method includes the second forging (004) process. It is noteworthy that the neck (3) and reinforced part (4) of the spoke (1) must be forged in the same clamping die, so as to make sure the grain density of the processed head (2), neck (3) and reinforced part (4) of the spoke (1) is continuous and unfaulted, as shown inFIG.14.", "", "As shown inFIG.10, the reinforced structure of spokes manufactured according to said spoke reinforcing method includes a main body of spoke (1), a head (2), a neck (3) and a reinforced part (4) are arranged in turn from the edge of one end of the main body of the spoke (1), the other end is provided with a thread part (5). Particularly, the cross-sectional shape of the reinforced part (4) is hexagonal (or rectangular and a polygonal) structure type, and it is experimentally proved that the optimal compressive strength and flexural strength can be achieved using minimum quantity of materials.", "", "FIG.15discloses the fatigue test results of the spoke of the present invention, conventional spoke and conventional improved spoke; the left side is the fatigue test (times), the lower PK represents conventional spoke, PSR represents the improved spoke, PHR is the reinforced structure of spokes of the present invention, the left side of each histogram is 0° (standard vertical fatigue test), the right side is 10° (tilt angle fatigue test), in the same test condition, the same raw material, the same production equipment, the same test equipment and the same fixture are used to perform fatigue test (180 Kgf, 10 Hz) for the conventional spoke, improved spoke and reinforced structure of spokes; it is observed in the chart that the data of the reinforced structure of spokes of the present invention have better performance than conventional spoke and conventional improved spoke in 0° (standard vertical fatigue test) or 10° (tilt angle fatigue test). The experiment data prove that the spoke strength can be improved greatly after the fragile part of the conventional improved spoke is improved into a hexagonal columnar reinforced part structure type according to the correct processing procedure.", "", "According to the above description, the spoke reinforcing method of the present invention proposes forging a reinforced part (hexagonal columnar or rectangular) connected to the forged neck, because the area 1˜3 mm below the neck thickened by multiple times of forge processing will become the fatigue/fracture hot zone, so as to substitute the unforged cylindrical spoke at the conventional joint, the reinforced part in this shape has the best compressive strength and flexural strength, so as to buffer the high frequency lateral stress on the joint below the neck of high density grains, and to improve the endless fracture accidents, meanwhile the spoke fracture probability is reduced, and the spoke lifetime is prolonged.", "", "Although the invention has been explained in relation to its preferred embodiment, it is to be understood that many other possible modifications and variations can be made without departing from the spirit and scope of the invention as hereinafter claimed."], "claims": ["straightening and cutoff, the drawn spoke is straightened and cut to the required length; first forging, one end of said spoke is stamped by a first stamping unit to form the initial head and neck; clamp forming, the head, neck and main body of spoke of the initial formed spoke are clamped by a clamping die, the shape of the reinforced part is forged during clamping; second forging, the spoke clamped by the same clamping die is stamped by a second stamping unit, so as to form the final head, neck and reinforced part; hobbing, the end opposite to the head of said spoke is hobbed to form a thread part.", "2 . The spoke reinforcing method defined in claim 1 , a bending step can be created between the second forging and hobbing steps to bend the neck of the formed spoke.", "3 . The spoke reinforcing method defined in claim 1 , wherein the cross-sectional shape of the reinforced part is any one of polygons.", "4 . The spoke reinforcing method defined in claim 1 , wherein the cross-sectional shape of the reinforced part is hexagonal or rectangular.", "5 . The spoke reinforcing method defined in claim 1 , wherein the length of the reinforced part is at least 5 mm.", "6 . A reinforced structure of spokes, including a main body of spoke, a head, a neck and a reinforced part are arranged in turn from the edge of one end of the main body of spoke, the other end is provided with a thread part.", "7 . The reinforced structure of spokes defined in claim 6 , wherein the cross-sectional shape of the reinforced part is hexagonal or rectangular.", "8 . The reinforced structure of spokes defined in claim 6 , wherein the spoke forms include straight-pull spoke and elbow spoke."], "bibtex": "@patent{20240246357,\n    title = {SPOKE REINFORCING METHOD AND REINFORCED STRUCTURE OF SPOKES},\n    number = {20240246357},\n    year = {2024},\n    note = {File: US20240246357A1-20240725.XML}\n    }", "classification": "B60B102FI"}, {"title": "LOCKING ASSEMBLY FOR SECURING A WHEEL RIM TO A WHEEL HUB OF A VEHICLE, WHEEL ATTACHMENT SYSTEM, AND METHOD FOR ATTACHING A WHEEL RIM TO A WHEEL HUB OF A VEHICLE", "doc_number": "20240246358", "filename": "US20240246358A1-20240725.XML", "abstract": "A locking assembly for securing a wheel rim to a wheel hub of a vehicle includes a locking screw including a sleeve body that has an external thread for engaging with an internal thread of the wheel hub and an internal thread, a flange formed at a first end of the sleeve body for abutment against the wheel rim with respect to an axial direction, and a plurality of clamping jaws formed at a second end of the sleeve body and arranged spaced to each other along a circumference of the sleeve body, each jaw being elastically deformable in a radial direction and having a radially inner surface and a radially outer surface for contacting a contact surface of the wheel hub. The assembly further has a safety screw including a shaft that has an external thread, and a head provided at a first end of the shaft.", "detailed_description": ["FIG.1schematically shows a locking assembly100for securing a wheel rim300to a wheel hub200of a vehicle in a perspective, exploded view.", "", "FIG.2shows a cross-sectional view of a wheel attachment system400that includes the locking assembly100and a wheel hub200, wherein the system400is shown in a partly assembled state and the wheel rim300is omitted inFIG.2.", "", "FIG.3shows the wheel attachment system ofFIG.2together with the wheel rim in a fully assembled state.", "", "As exemplarily shown inFIG.1, the locking assembly100includes a locking screw1and a safety screw2. The locking screw1includes a sleeve body10, a flange or collar14, and a plurality of clamping jaws16.", "", "As shown inFIGS.1and2, the sleeve body10may be realized as a hollow cylindrical part that has an inner circumferential surface limiting an inner space of the sleeve body10, and an outer circumferential surface oriented opposite to the inner circumferential surface. A first screw longitudinal axis A1may be defined by a middle axis surrounded or defined by the inner circumferential surface of the sleeve body10. A first screw radial direction extends transverse or perpendicular to the first screw longitudinal axis. As shown inFIGS.1and2, the sleeve body10extends along the first screw axis A1between a first end10A and an opposite second end10B and includes an external thread11formed at the outer circumferential surface of the sleeve body10. The external thread11of the sleeve body10, for example, may be a trapezoidal thread. Further, the sleeve body10comprises an internal thread12formed at the inner circumferential surface of the sleeve body10. The internal thread12of the sleeve body10, for example, may be an ISO metric screw thread. Optionally, the external thread11and the internal thread12of the sleeve body10of the locking screw1are counter-rotating. For example, the external thread11may be a right-hand rotating thread, and the internal thread12may be a left-hand rotating thread.", "", "As visible best inFIG.1, the flange14, for example, may be realized as a plate or disk shaped part, an outer circumference of which, for example, may be circular as shown inFIG.1. As shown inFIG.2, the flange14may comprise a first axial end face14afacing towards the second end10B of the sleeve body10, and a second axial end face14boriented opposite to the first axial end face14a. The flange14, at the second axial end face14b, optionally may include a tool interface15configured to engage with a tool T for rotating the locking screw1. As exemplarily shown inFIG.1, the tool interface15, for example, may include a plurality of pockets15A formed in the second axial end face14bof the flange14. In said pockets, complementary shaped engagement pins T15may be introduced, as can be understood fromFIG.4. As shown inFIG.1, the pockets15A may be arranged spaced or neighbored to one another along the circumference of the flange14.", "", "The flange14optionally may also include a central opening14C that forms a passage into the interior space of the sleeve body10, as visible inFIGS.1and2. The central opening14C, for example, may be a circular through hole or bore as shownFIG.1.", "", "As shown inFIGS.1and2, the collar or flange14is positioned at the first end of the sleeve body10and, in particular, may be integrally formed with the sleeve body10or being fixed thereto in a different way.", "", "The plurality of clamping jaws16are realized as members that at least partially are elastically deformable. For example, each clamping jaw16may include a clamping body16D and an elastically deformable web or connection body16C that has a smaller thickness than the clamping body16D, as shown inFIG.2. The clamping jaws16, as shown inFIGS.1and2are formed at the second end10B of the sleeve body10. As shown inFIGS.1and2, the connection body16C may interconnect the clamping body16D and the sleeve body10. For example, the jaws16and the sleeve body10may be integrally formed. The jaws16, in particular, may be arranged adjacent but spaced to one another along the circumference of the sleeve body10. For example, adjacent jaws16may be separated by a gap or slit as shown inFIG.1.", "", "As visible best inFIG.2, each jaw16includes a radially inner surface16afacing towards the first screw longitudinal axis A1and a radially outer surface16bthat is oriented opposite to the radially inner surface16a. The radially inner surface16aof each jaw16may be substantially planar. Optionally, the radially inner surface16aof each jaw16may be conical or extend inclined relative to the first screw longitudinal axis A1, as exemplarily shown inFIG.2. In particular, the radially inner surface16aof each jaw16may be conical or extend inclined relative to the first screw longitudinal axis A1such that it approaches the first screw longitudinal axis A1when comparing a first position of the radially inner surface16awith a second position of the radially inner surface16acloser to the sleeve body10than the first position. The radially outer surface16b, for example, may be substantially planar or conical as shown inFIGS.1and2. When the radially outer surfaces16bare conical, as exemplarily shown inFIG.2, they may define a maximum or greatest outer diameter d16in the radial direction. As visible best inFIG.2, the radially inner and outer surfaces16a,16b, preferably, are provided on the clamping body16D of each jaw16. As the clamping jaws16at least partially are elastically deformable, the clamping jaws16can be bent or spread outwards with respect to the first screw radial direction. For example, by applying a radial force to the clamping body16D, the connection body16C may be elastically deformable such that the clamping body16D is enabled to move outwards in the radial direction.", "", "The safety screw2, as exemplarily shown inFIG.1, comprises a shaft20, an external thread21, and a head22. Optionally, the safety screw2may further include a tool interface25.", "", "As shown inFIGS.1and2, the shaft20of the safety screw2may, for example, be realized as a generally cylindrical body. Optionally, the shaft20may be realized as a hollow shaft as shown inFIGS.1and2. Generally, the shaft20defines a second screw longitudinal axis A2and extends along said axis A2between a first end20A and an opposite second end. A second screw radial direction extends transverse or perpendicular to the second screw longitudinal axis A2.", "", "The external thread21of the safety screw2is formed on an outer circumferential surface of the shaft20and configured for being engaged with or screwed into the internal thread12of the locking screw1, as shown inFIG.2. The external thread21, thus, may also be formed as an ISO metric screw thread, for example. As shown inFIG.2, the external thread21may be formed in a region closer to the second end20B than to the first end20A of the shaft.", "", "The head22of the safety screw2is formed on the first end20A of the shaft20and may, for example, be formed as a substantially circular collar protruding in the second screw radial direction from the outer circumferential surface of the shaft20, as exemplarily shown inFIGS.1and2. As further shown inFIGS.1and2, the head22includes a radially outer surface22afacing away from the second screw longitudinal axis A2. As visible best inFIG.2, the radially outer surface22amay, optionally, be conical or inclined relative to the second screw longitudinal axis A2. In particular, the radially outer surface22aof the head22may extend inclined relative to the second screw longitudinal axis A2such that it approaches the second screw longitudinal axis A2when comparing a first position of the radially outer surface22awith a second position of the radially inner surface22acloser to the shaft20than the first position.", "", "The optional tool interface25is configured to engage with a tool (not shown) for rotating the safety screw2and is formed at a second end20B of the shaft20. As exemplarily shown inFIG.1, the tool interface25of the shaft20may be formed by the axial end region of an inner circumferential surface of the shaft20which, for example, may define a hexagon or similar shape.", "", "As visible further inFIG.2, the safety screw2may, optionally, include a second engagement structure26which, for example, may be realized as a recess or groove formed in the region of the axial end of the inner circumferential surface of the shaft20.", "", "The locking assembly100shown inFIG.1is configured or provided as one single, central securing device for securing a wheel rim300(FIG.3) to a wheel hub200. The wheel hub200is only schematically shown inFIG.2and, generally, includes a central hub205and a collar215.", "", "As shown inFIG.2, the central hub205may be formed as a generally cylindrical part having an outer circumferential surface205afor receiving the wheel rim300thereon and an inner circumferential surface205boriented opposite to the outer circumferential surface205a. Further, the central hub205extends a longitudinal axis between an inner and205C and an opposite outer end205D. As shown inFIG.2, an internal thread210is provided on the inner circumferential surface205b, in particular, in a region adjacent to the outer end205D, as schematically shown inFIG.2. Further, a portion of the inner circumferential surface205barranged distanced to the internal thread210in the direction towards the inner end205D forms a contact surface216a. The contact surface216aof the central hub205, for example, may be cylindrical or conical, as exemplarily shown inFIG.2. In the latter case, a slope of the contact surface may, for example, lie in a range between 1:20 to 1:5. In this case, the contact surface216amay define a minimum or smallest inner diameter d216.", "", "The collar215, as shown inFIG.2, is arranged at the inner end205C of the central hub205and protrudes radially from the outer circumferential surface205aof the central hub205.", "", "As shown inFIG.2, the safety screw2, with its external thread21, can be engaged with or screwed into the internal thread12of the sleeve body10of the locking screw1. In this case, the first and second screw longitudinal axes A1, A2are collinear or coaxial to each other. Further, the locking screw2, with the external thread11of the sleeve body10can be engaged with or screwed into the internal thread210of the wheel hub200. Thus, the internal thread210of the wheel hub200may, for example, also be realized as a trapezoidal thread. Further, as visible inFIG.2, a middle axis or rotational axis of the wheel hub as well as the first and second screw longitudinal axes A1, A2are collinear or coaxial to each other. In the following, therefore, only an axial or longitudinal direction or central axis A100will be referred to. A radial direction R1is transverse or perpendicular to the central axis A100.", "", "FIG.2shows the locking assembly100in a partly assembled state on a wheel hub200. In this state, the radially outer surfaces16bof the jaws16, with respect to the longitudinal direction A100, are arranged spaced to the contact surface216aof the wheel hub210. The safety screw2, with respect to the longitudinal direction A100, may positioned in a pre-assembled position such that, in the radial direction R1, a gap is formed between the radially outer surface22aof the head22and the radially inner surfaces16aof the jaws16. Further, in the pre-assembled position, the safety screw2, with the second end20B of the shaft20, may protrude through the central opening14C of the flange, i.e. by a predefined first length so that the second end20B is positioned in a first distance d1to the second end face14bof the flange14.", "", "In order to rigidly attach the locking screw1to the wheel hub200, the locking screw1, with the external thread11of the sleeve body10, is further screwed into the internal thread210of the wheel hub200until the radially outer surfaces16bof the jaws16, with respect to the longitudinal or axial direction A100partially or fully overlap with the contact surface216aof the wheel hub200, as shown inFIG.3. For example, with respect to the axial direction A100, an overlap between the outer surfaces16bof the jaws16and the contact surface216amay lie in the range between 0.05 mm and 3 mm. Moreover, the radially outer surfaces16bof the jaws16may become in frictional contact with the contact surface216aof the wheel hub200to achieve a friction fit and, optionally, a form fit. Further, the safety screw2, with its external thread21, is screwed into the internal thread12of the sleeve body10of the locking screw1to a locking position, as shown inFIG.3. In said locking position, the radially outer surface22aof the head22of the safety screw2contacts the radially inner surface16a. Since at least one of the radially inner surfaces16aof the jaws16and the radially outer surface22aof the head22of the safety screw2is conical or inclined with respect to the axial direction A100, moving the head22relative to the jaws by screwing the safety screw2further into the internal thread12of the sleeve body10causes the jaws16to be spread or pushed outwards in the radial direction R1. Thereby, a clamping force is generated between the jaws16and the contact surface216aof the hub200. Thus, a friction fit is achieved or the friction force is further increase. Optionally, if the contact surface216ais conical, a form fit may be achieved additionally. In particular, when the radially outer surfaces16band the contact surface216aof the wheel hub200, as mentioned above, are conical, the greatest outer diameter d16defined by the radially outer surfaces16bof the clamping jaws16may be greater than the smallest inner diameter d216defined by the contact surface216aof the wheel hub200. Thus, the jaws16, even with the safety screw2not being in the locking position, are elastically preloaded and a form fit in the axial direction A100is achieved. It should be mentioned that, also in the case that the contact surface216aand/or the radially outer surfaces16bof the jaws16are not conical, the outer diameter d16defined by the radially outer surfaces16bof the clamping jaws16may be greater than the inner diameter d216defined by the contact surface216aof the wheel hub200. For example, due to the positioning the safety screw2in the locking position, a torque required for loosening the locking screw1may be increased by at least 70 Nm. As is further shown inFIG.3, the shaft20of the safety screw2may protrude into the central opening14C of the locking screw1by a predefined second length so that so that the second end20B is positioned in a second distance d2to the second end face14bof the flange14, said second distance d2being smaller than the first distance d1.", "", "As shown inFIG.3, to attach a wheel rim300to the wheel hub200, rim300may be arranged at the central hub205such that the central hub205protrudes through a central opening305of the rim300. The rim300, at least with regard to the axial direction A100, is fixed or clamped with regard to the axial direction A100between the flange14, i.e. the first end face14aof the flange14, and the collar215of the wheel hub200. Optionally, the wheel hub200may be provided with multiple studs220axially protruding from the collar215that extend into corresponding receiving holes320of the rim300, as exemplarily shown inFIG.3.", "", "FIG.4shows the locking assembly100in the partially assembled state again, however, the safety screw2is positioned in the locking position, that is, it protrudes through the central opening14C of the flange14by the second length. Thus, the second end20B is positioned in the second distance d2to the second end face14bof the flange14. The tool T for rotating the locking screw1may include a centering body T14configured to be introduced into the opening14C of the flange14. As shown inFIG.4, the centering body T14and the engagement pins T15of the tool T may be dimensioned such that, when the safety screw2is positioned in the locking position, the centering body T14rests against the second end20B of the shaft20of the safety screw2and the centering pins15are prevented from being fully engaged with the pockets15A, as schematically shown inFIG.3. Thereby, unintended securing or loosening of the locking screw1, which could damage the hub200and/or the locking screw1, can be prevented, when the safety screw2is positioned in the locking position.", "", "FIG.5shows the locking assembly100and the wheel hub200, again, in a fully assembled state, i.e. with the safety screw2being positioned in the locking position. As exemplarily shown inFIG.5, the optional cover3may include a cover plate30and a pillar31. The cover plate30may be disk shaped. The pillar31protrudes from the plate30and includes a first engagement structure32which may, for example, be realized as a protrusion provided at an end of the pillar30opposite to the cover plate30. Generally, the first engagement structure32is positioned on the pillar31in a predefined axial distance d30of the cover plate30. As shown inFIG.5, the axial distance d30may be dimensioned such that the first engagement structures32of the pillar31and the second engagement structure26of the shaft20of the safety screw2are positioned at substantially the same axial position when the safety screw2is in the locking position and when the cover plate30abuts or rests against the second axial end face14bof the flange14. Thus, the first and second engagement structures32,26, preferably, are only engageable when the cover plate30abuts the surface14bof the flange14and when the safety screw2is in the locking position.", "", "FIG.6schematically shows a flow diagram of a method M for attaching a wheel rim300to a wheel hub200of a vehicle. The method M, by way of example only and without limitation, will be explained by referring to the wheel attachment system400discussed above.", "", "As shown inFIG.6, in a first step, the wheel rim300is positioned on the outer circumferential surface205aof the central hub205of the wheel hub200such that the central hub205protrudes through the receiving opening305of the wheel rim300.", "", "In step M2, the locking screw1is threadingly engaged with or screwed into the inner thread210of the central hub205, so that the wheel rim300is clamped between the flange14of the locking screw1the collar215of the wheel hub200. Moreover, by screwing the locking screw1into the inner thread210of the central hub205in step M2, the clamping jaws16, i.e. the radially outer surfaces16aof the jaws16come into frictional contact with the contact surface216aof the wheel hub210. During step M2, the safety screw2, for example, may already be engaged with the locking screw1via the external thread21of the safety screw2and the internal thread12of the locking screw1, as shown inFIG.2. For example, the safety screw2, with respect to the axial direction A100, may be positioned in the pre-assembled position.", "", "In step M3, the safety screw2is further screwed into the internal thread12of the locking screw1, e.g. until it assumes the locking position. That is, in step M2, the head22of the safety screw2is moved into contact with the radially inner surfaces16aof the jaws16, and the jaws16are spread outwards in the radial direction R) to generate a clamping force between the clamping jaws16and the contact surface216aof the wheel hub200. For example, a clamping force of at least 80 KN may be achieved.", "", "Before engaging the locking screw1with the wheel hub200and the safety screw2with the locking screw, the threads11,12,21may be treated with a lubricant.", "", "The locking screw1and/or the safety screw2, generally, may be manufacture from steel, aluminum, or a similar metal material. Optionally, the surfaces of the locking screw1and/or the safety screw2may be coated with a chemical nickel coating. Generally, the surfaces of the locking screw1and/or the safety screw2may have a surface hardness of at least 680 HV.", "", "Although specific embodiments have been illustrated and described herein, it will be appreciated by those of at least ordinary skill in the art that a variety of alternate and/or equivalent implementations exist. It should be appreciated that the exemplary embodiment or exemplary embodiments are only examples, and are not intended to limit the scope, applicability, or configuration in any way. Rather, the foregoing summary and detailed description will provide those skilled in the art with a convenient road map for implementing at least one exemplary embodiment, it being understood that various changes may be made in the function and arrangement of elements described in an exemplary embodiment without departing from the scope as set forth in the appended claims and their legal equivalents. Generally, this application is intended to cover any adaptations or variations of the specific embodiments discussed herein."], "claims": ["a locking screw ( a safety screw ( wherein at least one of the radially inner surfaces (", "2 . The locking assembly ( 100 ) according to claim 1 , wherein the flange ( 14 ) of the locking screw ( 1 ) includes a tool interface ( 15 ) configured to engage with a tool (T) for rotating the locking screw ( 1 ).", "3 . The locking assembly ( 100 ) according to claim 2 , wherein the tool interface ( 15 ) includes a plurality of pockets ( 15 A) formed at an axial end face ( 14 b ) of the flange ( 14 ).", "4 . The locking assembly ( 100 ) according to claim 1 , wherein the external thread ( 11 ) and the internal thread ( 12 ) of the sleeve body ( 10 ) of the locking screw ( 1 ) are counter-rotating.", "5 . The locking assembly ( 100 ) according to claim 1 , wherein the external thread ( 11 ) of the sleeve body ( 10 ) of the locking screw ( 1 ) is a trapezoidal thread.", "6 . The locking assembly ( 100 ) according to claim 1 , wherein the internal thread ( 12 ) of the sleeve body ( 10 ) of the locking screw ( 1 ) is an ISO metric screw thread.", "7 . The locking assembly ( 100 ) according to claim 1 , wherein the shaft ( 20 ) of the safety screw ( 2 ) is formed as a hollow shaft.", "8 . The locking assembly ( 100 ) according to claim 1 , wherein the safety screw ( 2 ) includes a tool interface ( 25 ) configured to engage with a tool for rotating the safety screw ( 2 ), and wherein the tool interface ( 25 ) is formed at a second end ( 20 B) of the shaft ( 20 ).", "9 . The locking assembly ( 100 ) according to claim 1 , wherein the flange ( 14 ) of the locking screw ( 1 ) includes a central opening ( 14 C) forming a passage into the sleeve body ( 10 ), wherein the safety screw ( 2 ), with its external thread ( 21 ), is screwable into the internal thread ( 12 ) of the sleeve body ( 10 ) of the locking screw ( 1 ) to a locking position in which the jaws ( 16 ) are spread outwards in the radial direction (R 1 ) and in which the shaft ( 20 ) of the safety screw ( 2 ) protrudes into the central opening ( 14 C) of the locking screw ( 1 ) by a predefined length.", "a cover ( wherein the shaft ( wherein the axial distance (d", "a wheel hub ( a locking assembly ( wherein the inner circumferential surface ( wherein the locking screw ( wherein the safety screw (", "12 . The wheel attachment system ( 400 ) according to claim 11 , wherein the radially outer surfaces ( 16 b ) of the clamping jaws ( 16 ) and the contact surface ( 216 a ) of the wheel hub ( 200 ) are conical, and wherein a greatest outer diameter (d 16 ) defined by the radially outer surfaces ( 16 b ) of the clamping jaws ( 16 ) is greater than a smallest inner diameter (d 216 ) defined by the contact surface ( 216 a ) of the wheel hub ( 200 ).", "positioning (M screwing (M screwing (M"], "bibtex": "@patent{20240246358,\n    title = {LOCKING ASSEMBLY FOR SECURING A WHEEL RIM TO A WHEEL HUB OF A VEHICLE, WHEEL ATTACHMENT SYSTEM, AND METHOD FOR ATTACHING A WHEEL RIM TO A WHEEL HUB OF A VEHICLE},\n    number = {20240246358},\n    year = {2024},\n    note = {File: US20240246358A1-20240725.XML}\n    }", "classification": "B60B316FI"}, {"title": "APPARATUS, SYSTEM, AND METHOD OF PROVIDING A STABILIZING DRIVE SYSTEM FOR A ROBOTIC VEHICLE", "doc_number": "20240246359", "filename": "US20240246359A1-20240725.XML", "abstract": "An apparatus, system and method capable of providing a stabilizing drive system for a robotic vehicle. The apparatus, system and method may include at least a robot body base; at least two drive wheels within the robot body base; a processing system having non-transitory computing code associated therewith which, when executed by the processing system, causes to be driven the at least two drive wheels; and a plurality of ball casters within the robot body base, wherein the ball caster are positioned relative to the robot base and to the at least two drive wheels so as to lower a center of gravity of the robot and provide stabilization of the driving.", "detailed_description": ["The figures and descriptions provided herein may have been simplified to illustrate aspects that are relevant for a clear understanding of the herein described devices, systems, and methods, while eliminating, for the purpose of clarity, other aspects that may be found in typical similar devices, systems, and methods. Those of ordinary skill may recognize that other elements and/or operations may be desirable and/or necessary to implement the devices, systems, and methods described herein. But because such elements and operations are well known in the art, and because they do not facilitate a better understanding of the present disclosure, a discussion of such elements and operations may not be provided herein. However, the present disclosure is deemed to inherently include all such elements, variations, and modifications to the described aspects that would be known to those of ordinary skill in the art.", "", "The terminology used herein is for the purpose of describing particular example embodiments only and is not intended to be limiting. For example, as used herein, the singular forms “a”, “an” and “the” may be intended to include the plural forms as well, unless the context clearly indicates otherwise. The terms “comprises,” “comprising,” “including,” and “having,” are inclusive and therefore specify the presence of stated features, integers, steps, operations, elements, and/or components, but do not preclude the presence or addition of one or more other features, integers, steps, operations, elements, components, and/or groups thereof. The method steps, processes, and operations described herein are not to be construed as necessarily requiring their performance in the particular order discussed or illustrated, unless specifically identified as an order of performance. It is also to be understood that additional or alternative steps may be employed.", "", "When an element or layer is referred to as being “on”, “engaged to”, “connected to” or “coupled to” another element or layer, it may be directly on, engaged, connected or coupled to the other element or layer, or intervening elements or layers may be present. In contrast, when an element is referred to as being “directly on,” “directly engaged to”, “directly connected to” or “directly coupled to” another element or layer, there may be no intervening elements or layers present. Other words used to describe the relationship between elements should be interpreted in a like fashion (e.g., “between” versus “directly between,” “adjacent” versus “directly adjacent,” etc.). As used herein, the term “and/or” includes any and all combinations of one or more of the associated listed items.", "", "Although the terms first, second, third, etc., may be used herein to describe various elements, components, regions, layers and/or sections, these elements, components, regions, layers and/or sections should not be limited by these terms. These terms may be only used to distinguish one element, component, region, layer or section from another element, component, region, layer or section. That is, terms such as “first,” “second,” and other numerical terms, when used herein, do not imply a sequence or order unless clearly indicated by the context. Thus, a first element, component, region, layer or section discussed below could be termed a second element, component, region, layer or section without departing from the teachings of the exemplary embodiments.", "", "Processor-implemented modules, systems and methods of use are disclosed herein that may provide access to and transformation of a plurality of types of digital content, including but not limited to video, image, text, audio, metadata, algorithms, interactive and document content, and which track, deliver, manipulate, transform and report the accessed content. Described embodiments of these modules, systems and methods are intended to be exemplary and not limiting. As such, it is contemplated that the herein described systems and methods may be adapted and may be extended to provide enhancements and/or additions to the exemplary modules, systems and methods described. The disclosure is thus intended to include all such extensions.", "", "The embodiments include at least an improved drive mechanism for an autonomous mobile robot. The improved drive system improves the ability of the robot to overcome and/or avoid obstacles that might otherwise cause the robot to tip over. This may be accomplished by a number of aspects provided in the embodiments, including improving the center of gravity of even a tall mobile robot by lowering the center of gravity, and providing stabilizing, substantially cornered caster ball wheels, in addition to the drive train wheels typically provided in most mobile robots.", "", "More particularly, the provided embodiments, in part through the provision of the aforementioned additional corner casters, may lower the center of gravity of a tall robot by adding distributed weight about the base of the robot, thereby providing a more stable base upon which the mobile robot operates. Further, at least four ball casters may be provided, such as one ball caster proximate to each corner of a rectangular robot base, in addition to the at least two drive wheels that drive the robot. Drive wheels may operate through the use of dual simultaneous forward rotation to move the robot forward, dual simultaneous reverse operation to move the robot backwards, and staggered rotational operation to turn the robot left and right, as will be understood to the skilled artisan.", "", "Of note, the placement of the ball casters within the base proximate to the corners of the mobile robot does not necessitate that any extra space be devoted to the casters, contrary to the added stabilizing wheels in the known art, which are placed external to the base, thereby increasing the robot's footprint. In operation, the ball caster corners may allow for the robot to scoot in a forward, backward, left, right, or corner direction in order to avoid tip over, even if either or both of the drive wheels lose traction. Further, the presence of ball casters at the corners allows for rotation of the base of the robot about any one or more of the corner ball casters, consequently making the base more stable than in the known art.", "", "For example, the aforementioned stability may allow a tall robot's upper stalk to tip by up to 45°, with only one ball caster still in contact with the floor, without tipping over. By way of further example, the presence of the ball casters may prevent tipping of a mobile robot having the disclosed corner ball casters, as long as two of the ball casters are present in contact with floor level, even if the upper portion of the robot is tipped by 60° or more.", "", "Yet further, the chances that an undetected obstacle on the floor would tip the robot are appreciably decreased in the embodiments. This is the case at least because the casters provide additional degrees of freedom for the robot to rise and fall over obstacles without tipping, and allows for the robot to scoot over or angularly slide (such as wherein a corner is lifted) around obstacles at or near floor level.", "", "It may be noted that, in some embodiments, the casters may be in different positions within the base based on where the casters are in relation to the typical forward and reverse motion of the robot. By way of example, casters at the “rear” of the robot may be farther towards the outer perimeter of the base of the robot than are the casters associated with the “front” of the robot. This may be the case because casters in the front of the robot may need to move inwardly along the base to account for the outward extension of a bumper or similar safety mechanism from the base of the robot at the front portion thereof. In any case, ball casters may be placed as close to the corners of the base of the robot as is possible in order to maximize stability of the drive system of the robot.", "", "FIG.1illustrates an exemplary robot100in accordance with the embodiments. The illustrated robot100has a tall robot stalk102associated with a robot midsection104, and a robot base106having therewithin a drive system108to move the robot100at least in the forward or reverse directions. Of course, it will be appreciated that the drive system108may also move the robot in both forward and reverse, and/or may move the robot left and/or right, without departing from this disclosure.", "", "Associated with the stalk102of the robot, and/or the midsection104of the robot, may be one or more drive assistance systems112, such as may include one or more sensors, cameras, or the like170, which provide data that allows for the robot100to navigate autonomously. Further associated with the stalk102and/or the midsection104of the robot100may be one or more processing systems312that may, as part of the drive assistance system112and in conjunction with the referenced sensing systems170, navigate or otherwise safely operate the robot100based on one or more operational algorithms. These one or more processing systems312may be fully on board the robot100, may perform shared processing with processing systems off-board the robot, such as via wireless communication between the robot processing system312and the off board processing system, or may be fully off board the robot, as is discussed further hereinbelow.", "", "As referenced, the robot base106may include at least one drive system108for the robot100. As part of this drive system108, the illustrated robot base106includes corner casters120proximate to the four corners of the substantially rectangular robot base106, and two drive wheels122, one on the left side and one on the right side of the forward motion axis of the robot. It will be understood that additional casters may be included beyond the four corner casters120illustrated inFIG.1, and the number of casters may be dependent upon the shape of the robot base. Moreover, it will be understood that more than two drive wheels122may be associated with the robot, such as in embodiments having two wheels to drive forward and reverse, and two or more turning wheels suitable to provide an improved turning radius to the robot.", "", "It will be appreciated that the drive wheels122will typically be affirmatively mechanically rotated, such as at the command of processing system312. So, too, may be the ball casters120or similar stabilizing wheels or casters in accordance with the embodiments, although, in typical embodiments, the ball casters120may be passive, i.e., solely reactive, in nature.", "", "Also evident inFIG.1is a bumper mechanism128at the “front” of the robot base106. This bumper128may improve the safety of operation of the robot100in the forward direction, such as by limiting damage to the robot in the event an obstacle is encountered for both static and dynamic obstacles. However, it will be understood that a robot100in accordance with the disclosure needn't include such a bumper128.", "", "FIG.2illustrates a bottom view from beneath the base106, i.e., the base106is viewed upwardly from the floor surface on which the robot operates, for the robot100illustrated inFIG.1. As is evident inFIG.2, the rectangular base106(shown by way of example) has four ball casters120associated with the base106substantially at the corners thereof, and has two drive wheels122proximate to the left and right sides of forward direction for the robot100. As shown, the drive system108may have one or more electrical, mechanical, and/or electromechanical elements associated therewith to allow for affirmative actuation of at least the drive wheels122for the robot100provided within the base106.", "", "The embodiments are further illustrated with respect to the exemplary embodiment ofFIG.3. The illustrated embodiment again shows the association of four ball casters120proximate to the corners of the rectangular base106of the robot100, and two drive wheels122having associated mechanicals and electricals connected thereto suitable to drive the robot100.", "", "As is again apparent in the illustration ofFIG.3, the “front” ball casters120amay be more substantially inset from the front of the base106than are the rear ball casters120bfrom the rear of the base106, such as to accommodate a safety bumper mechanism128with the front of the robot base106. Also evident is one or more frames202in which the ball casters120may ride, and such frames202may allow not only for rotation of the ball casters120therewithin, but may also allow for an upward and downward movement of the ball casters120in the Z axis direction within each respective frame202. In embodiments wherein the ball casters120may move upward and downward, it will be understood that a suspension system302may be provided in association with the frame(s)202, such as in the way of “shock absorbers”, such that the ball casters120may move more readily in the Z axis.", "", "FIG.4illustrates an exemplary suspension system302suitable to hold therein one or more frames202into which the disclosed ball casters120may be placed. As shown, the suspension system302that allows for movement of the ball casters120in the Z axis may be spring-based, although it will be understood that other suspension system types, such as hydraulic- or pneumatic-based suspension systems, may be employed without departing from the disclosure.", "", "Further and as illustrated, the suspension system302provided for each ball caster120and associated frame202may operate independently from other suspension systems, or may be operationally associated with the suspension systems of other ball casters. Such an operational association may include, by way of non-limiting example, a distribution of the ball caster frames202across a unitary underbody frame306at the lowermost portion of the robot's underside. Of course, this unitary underbody frame306may perform other functions, such as protecting the underside of the robot from damage, particulate, moisture, and so on.", "", "FIG.5illustrates the exemplary association of one or more ball casters120with ball caster frames202that respectively may or may not ride within a unitary base frame306. Ones of the ball caster frames202may have associated therewith a suspension system302. By way of example, only the “front” ball casters120may have Z-axis suspension system302associated therewith, although it will be understood that the “rear” wheels may additionally have a suspension associated therewith.", "", "FIG.6illustrates a ball caster120, in accordance with the embodiments, within a ball caster frame202that allows for multidirectional operation of the ball caster120. As illustrated, the ball caster120may reside within an enclosed or partially enclosed frame202. The frame202may have a sufficiently low coefficient of friction so as to allow free rotation of the ball caster120therewithin. Of course, it will be understood that any of numerous mechanisms to allow for free rotation of the ball caster120within the frame202may be provided by the frame202without departing from the disclosure, such as the use of ball bearings within the frame202, by way of non-limiting example.", "", "FIG.7depicts an exemplary computer processing system312for use in association with the embodiments, by way of non-limiting example. Processing system312is capable of executing software, such as an operating system (OS) and one or more computing algorithms/applications490, such as those for the processing of inputs received from sensors170. The operation of exemplary processing system312is controlled primarily by these computer readable instructions/code490, such as instructions stored in a computer readable storage medium, such as hard disk drive (HDD)415, optical disk (not shown) such as a CD or DVD, solid state drive (not shown) such as a USB “thumb drive,” or the like. Such instructions may be executed within central processing unit (CPU)410to cause system312to perform the disclosed operations, comparisons and navigation calculations. In many known computer servers, workstations, personal computers, and the like, CPU410is implemented in an integrated circuit called a processor.", "", "It is appreciated that, although exemplary processing system312is shown to comprise a single CPU410, such description is merely illustrative, as processing system312may comprise a plurality of CPUs410. Additionally, system312may exploit the resources of remote CPUs (not shown) through communications network470or some other data communications means480, as discussed above.", "", "In operation, CPU410fetches, decodes, and executes instructions from a computer readable storage medium such as HDD415. Such instructions may be included in software such as an operating system (OS), executable programs/applications490, and the like. Information, such as computer instructions and other computer readable data, is transferred between components of system312via the system's main data-transfer path. The main data-transfer path may use a system bus architecture405, although other computer architectures (not shown) can be used.", "", "Memory devices coupled to system bus405may include random access memory (RAM)425and/or read only memory (ROM)430, by way of example. Such memories include circuitry that allows information to be stored and retrieved. ROMs430generally contain stored data that cannot be modified. Data stored in RAM425can be read or changed by CPU410or other hardware devices. Access to RAM425and/or ROM430may be controlled by memory controller420.", "", "In addition, processing system312may contain peripheral communications controller and bus435, which is responsible for communicating instructions from CPU410to, and/or receiving data from, peripherals, such as peripherals440,445, and450, which may include printers, keyboards, and/or the elements discussed herein throughout. An example of a peripheral bus is the Peripheral Component Interconnect (PCI) bus that is well known in the pertinent art.", "", "Display460, which is controlled by display controller455, may be used to display visual output and/or presentation data generated by or at the request of processing system312, responsive to operation of the aforementioned computing programs/applications490. Such visual output may include text, graphics, animated graphics, and/or video, for example. Display460may be implemented with a CRT-based video display, an LCD or LED-based display, a gas plasma-based flat-panel display, a touch-panel display, or the like. Display controller455includes electronic components required to generate a video signal that is sent to display460.", "", "Further, processing system312may contain network adapter465which may be used to couple to external communication network470, which may include or provide access to the Internet, an intranet, an extranet, or the like. Communications network470may provide access for processing system312with means of communicating and transferring software and information electronically. Additionally, communications network470may provide for distributed processing, which involves several computers and the sharing of workloads or cooperative efforts in performing a task, as discussed above. Network adaptor465may communicate to and from network470using any available wired or wireless technologies. Such technologies may include, by way of non-limiting example, cellular, Wi-Fi, Bluetooth, infrared, or the like.", "", "In the foregoing Detailed Description, it can be seen that various features are grouped together in a single embodiment for the purpose of clarity and brevity of the disclosure. This method of disclosure is not to be interpreted as reflecting an intention that the embodiments require more features than are expressly recited herein. Rather, the disclosure is to encompass all variations and modifications to the disclosed embodiments that would be understood to the skilled artisan in light of the disclosure."], "claims": ["a robot body base; at least two drive wheels within the robot body base; a processing system having non-transitory computing code associated therewith which, when executed by the processing system, causes to be driven the at least two drive wheels; and a plurality of ball casters within the robot body base, wherein the ball casters are positioned relative to the robot base and to the at least two drive wheels so as to lower a center of gravity of the robot and provide stabilization of the driving; and a plurality of frames mounted within the robot body base for receiving the plurality of ball casters.", "2 . The drive system of claim 1 , wherein the plurality of ball casters comprises four ball casters, and wherein the positioning of the ball casters comprises proximate to corners of the robot body base.", "3 . (canceled)", "4 . The drive system of claim 1 , wherein the plurality of frames comprise low coefficients of friction so as to allow free rotation of the plurality of ball casters.", "5 . The drive system of claim 4 , wherein the low coefficients of friction are provided by one of a smooth surface and ball bearings.", "6 . The drive system of claim 1 , further comprising a unitary under-body frame, wherein ones of the plurality of frames are physically associated with the unitary under-body frame.", "7 . The drive system of claim 1 , further comprising one or more suspension systems physically associated with ones of the plurality of frames.", "8 . The drive system of claim 7 , wherein the one or more suspension systems are spring-based.", "9 . The drive system of claim 7 , wherein one or more of the suspension systems are hydraulics-based.", "10 . The drive system of claim 1 , wherein the robot body base further comprises a front bumper, and wherein at least ones of the plurality of ball casters at a front of the robot body base are inset from the front bumper.", "11 . The drive system of claim 1 , wherein the stabilizing comprises a tip by up to 45° without destabilization with at least one of the plurality of ball casters still in contact with a floor surface.", "12 . The drive system of claim 1 , wherein the stabilizing comprises a tip by up to 60° without destabilization with at least two of the plurality of ball casters still in contact with a floor surface.", "13 . The drive system of claim 1 , wherein the driving comprises forward and reverse.", "14 . The drive system of claim 1 , wherein the plurality of ball casters is passively driven.", "15 . The drive system of claim 1 , wherein the plurality of ball casters is actively driven.", "16 . The drive system of claim 1 , further comprising a plurality of sensors to which the processing system is responsive.", "17 . The drive system of claim 16 , wherein the plurality of sensors comprise at least cameras.", "18 . The drive system of claim 1 , wherein the driving comprises an autonomous navigation.", "19 . The drive system of claim 1 , wherein the processing system is partially off-board the robot.", "20 . The drive system of claim 1 , wherein the at least two drive wheels comprise two forward and reverse drive wheels, and two turning drive wheels."], "bibtex": "@patent{20240246359,\n    title = {APPARATUS, SYSTEM, AND METHOD OF PROVIDING A STABILIZING DRIVE SYSTEM FOR A ROBOTIC VEHICLE},\n    number = {20240246359},\n    year = {2024},\n    note = {File: US20240246359A1-20240725.XML}\n    }", "classification": "B60B1914FI"}, {"title": "AXLE ASSEMBLY WITH DISCONNECT SYSTEM", "doc_number": "20240246360", "filename": "US20240246360A1-20240725.XML", "abstract": "A wheel hub system. The wheel hub system includes, in one example, includes an outer bearing assembly with an inner race coupled to a hub body, a wheel flange configured to removably coupled to the hub body, and an inner bearing including an outer race that is coupled to the hub body and an inner race that is coupled to a shaft. In the wheel hub system, the hub body includes interior splines which circumferentially surround exterior splines on the shaft.", "detailed_description": ["A wheel hub system in an axle assembly is described herein which achieves increased adaptability by enabling the wheel hub system to be quickly and efficiently adapted for both continuous torque lock and wheel end disconnect capabilities. To achieve this functionality, the wheel hub system includes a hub body with a female spline that surrounds male splines on a shaft. A gap formed between the female splines and the male splines allows the system to be effectively coupled to torque couplings and hub locker devices, in different configurations. The wheel hub system may further include a fastener joint that allows fasteners to securely and removably attach the torque couplings and the hub locker devices to the hub body. The fastener joint may be positioned at an outboard side of the system, allowing for simplified tooling when installing and removing the torque couplings and the hub locker devices.", "", "FIG.1shows a schematic illustration of a vehicle100. The vehicle100may be a passenger vehicle, a commercial vehicle, an on-highway vehicle, or an off-highway vehicle, in different examples.", "", "The vehicle100includes a powertrain102with a prime mover106(e.g., an internal combustion engine and/or an electric motor) and a transmission104(e.g., gearbox), in some instances. Specifically, in one example, the vehicle may be an electric vehicle (EV) such as an all-electric vehicle or a hybrid electric vehicle (HEV). In either EV example, the powertrain102includes an electric drive unit with a traction motor. To elaborate, the electric drive unit may be an electric axle, in one specific example, which is expanded upon herein.", "", "In the illustrated example, the prime mover106delivers mechanical power to the transmission104during powertrain operation. In the EV example, power may flow from the transmission to the electric motor while the motor is operated as a generator during regeneration operation. In other examples, the prime mover106may deliver power directly to one or more drive axles.", "", "Further, in the illustrated example, the transmission104is mechanically coupled to a drive axle assembly110. In the illustrated example, the drive axle assembly110may include a differential112, shafts122and124(e.g., intermediate shafts), joints150and152(e.g., constant velocity (CV) joints), shafts154and156(e.g., stub shafts), wheel hub systems158and160, and/or drive wheels126and128. Specifically, the differential112is rotationally coupled to the shafts122and124. The shafts122and124are rotationally coupled to the joints150and152, in the illustrated example. Further, in the illustrated example, the joints150and152are rotationally coupled to the shafts154and156which are rotationally coupled to the wheel hub systems158and160. However, in other examples, the shafts122and124may be directly coupled to the wheel hub systems158and160. It will be understood that the drive wheels126and128may be removably coupled to the wheel hub systems158and160when the vehicle axle is assembled.", "", "The shafts122and124may be housed via an axle tube assembly162. A steering system164which may include a steering knuckle, yoke, steering cylinder, and the like may be coupled to the axle tube assembly162and the wheel hub systems158and160.", "", "The wheel hub systems158and160may be coupled to the drive wheels126and128, respectively using multiple types of coupling devices. These devices are discussed in greater detail herein. Using multiple wheel end coupling devices allows the drivetrain's modularity to be increased, thereby enabling the vehicle's applicability to be expanded to a wider variety of vehicle platforms.", "", "The transmission104may include gears, shafts, and the like which may function to alter the speed of the mechanical input from the prime mover for speed changes at the transmission output. The transmission104may be a multi-speed transmission which includes clutches, a continuously variable transmission, or a single speed transmission in different examples. However, as discussed above, the transmission may be omitted from the drivetrain, in other examples.", "", "The differential112may be an open differential, a locking differential, a limited slip differential, and the like. In the example illustrated inFIG.1, the prime mover106, the transmission104, and the drive axle assembly110are spaced away from one another. However, it will be appreciated that one or more of these components may be collocated in an axle assembly in other examples. For instance, when the vehicle is an EV, the electric motor, the transmission (e.g., the gearbox), and the axle assembly may form an electric axle, in a use-case example. In such an example, components in the electric drive unit such as the traction motor, the gearbox, and in some cases the inverter are packaged into the axle assembly.", "", "The wheel hub systems158and160include attachment interfaces that are configured to attach to torque couplings163as well as hub lock devices165. Arrows166indicate the different mechanical connections that may be formed between the wheel hub systems158and160and the torque couplings163or the hub lock devices165. The torque couplings163are each configured to continuously transfer mechanical power between the corresponding shaft and drive wheel, during axle operation. Axle operation includes an operating condition where power is transferred to the axle shafts from the upstream powertrain components such as the transmission and the prime mover. Axle operation also includes an operating condition where torque is transferred to the drive wheel from the road such as during towing operation, for instance. The hub lock devices165are configured to selectively transfer mechanical power from the shafts154and156to the drive wheels126and128, respectively. To elaborate, when the hub lock devices165are locked the devices continuously transfer mechanical power between the respective shaft and drive wheel. Conversely, when the hub lock devices165are unlocked, mechanical power transfer through the hub lock devices165is inhibited. the hub lock devices165may be actuated via electro-mechanical, hydraulic, or pneumatic actuators168(either via operator input or automatically via a controller which is elaborated upon herein). In other examples, the hub lock devices165may be manually actuated via manual mechanical actuators170. Thus, both manually actuated hub lockers and remotely actuated hub lockers may be removably coupled to the wheel hub systems158and160. A detailed example of a wheel hub system is shown inFIGS.2,4, and5, a detailed example of a torque coupling is shown inFIGS.6-8, and a detailed example of a hub lock device is shown inFIG.9, all of which are discussed in greater detail herein.", "", "The vehicle100shown inFIG.1may further include a control system190with a controller191, as shown inFIG.1. The controller191may include a microcomputer with components such as a processor192(e.g., a microprocessor unit), input/output ports, an electronic storage medium194for executable programs and calibration values (e.g., a read-only memory chip, random access memory, keep alive memory, a data bus, and the like). The storage medium may be programmed with computer readable data representing instructions that are executable by the processor for performing the methods and control techniques described herein as well as other variants that are anticipated but not specifically listed. As such, the control techniques, methods, and the like expanded upon herein may be stored as instructions in non-transitory memory.", "", "The controller191may receive various signals from sensors195coupled to various regions of the vehicle100. For example, the sensors195may include a pedal position sensor designed to detect a depression of an operator-actuated pedal such as an accelerator pedal and/or a brake pedal, speed sensor(s) at the transmission input and/or output shaft, gear selector sensor, clutch position sensors, and the like. An input device198(e.g., accelerator pedal, brake pedal, drive mode selector, gear selector, combinations thereof, and the like) may further provide input signals indicative of an operator's intent for vehicle control.", "", "Upon receiving the signals from the various sensors195ofFIG.1, the controller191processes the received signals, and employs various actuators196of system components to adjust the components based on the received signals and instructions stored on the memory of controller191. For example, the controller191may be designed to engage and disengage the hub lock devices165. For instance, the controller191may automatically determine that the hub lock devices165should be unlocked such that torque transfer from the stub shafts to the drive wheels is inhibited. Responsive to determining that the hub lock devices should be unlocked, the controller may send control commands to the actuators168in the hub lock devices165that trigger unlocking of the devices. The other controllable components in the system may function in a similar manner with regard to sensor signals, control commands, and actuator adjustment, for example. Alternatively, the hub lock devices165may be electronically disconnected in response to user interaction with the input device198or may be designed for manual release at the hub lock devices165via the manual mechanical actuators170.", "", "An axis system is provided inFIG.1as well asFIGS.2-9, for reference. The z-axis may be a vertical axis (e.g., parallel to a gravitational axis), the x-axis may be a lateral axis (e.g., horizontal axis), and/or the y-axis may be a longitudinal axis, in one example. However, the axes may have other orientations, in other examples.", "", "FIG.2shows a detailed illustration of an example of wheel hub system200. The wheel hub system200include a shaft202which is configured to rotationally coupled to upstream driveline components (e.g., a joint, a shaft, and the like). To elaborate, the shaft202is a stub shaft in the illustrated example. The stub shaft202at its inboard side204includes a mechanical interface206which is a yoke that is configured to couple to a joint (e.g., a constant velocity (CV) joint) in the illustrated example However, other suitable attachment interfaces may be formed in the inboard side of the stub shaft202such as male spline. The stub shaft202further includes exterior splines208(e.g. male splines) on an outboard side210of the shaft. These exterior splines208on the shaft202are profiled to mate with female splines in torque couplings and hub lock devices discussed in greater detail herein with regard toFIGS.6-9. As described herein splines include ridges and grooves that axially extend down a component.", "", "An inner bearing212is further included in the wheel hub system200. Specifically, an inner race214of the bearing is coupled to the shaft202at a location inboard of the exterior splines208. The inner bearing212is a ball bearing in the illustrated example which allows the bearing to manage radial loads. Further, an outer race216of the inner bearing212is coupled to a hub body218. An outer bearing assembly220is coupled to an outer circumference222of the hub body218. The outer bearing assembly220is a thrust bearing assembly designed to manage axial and radial loads in the illustrated example. Thus, the thrust bearing assembly includes tapered rollers224, an inner race226in face sharing contact with the hub body218, and an outer race228. The outer race228may be coupled to a steering knuckle230in a steering system or other suitable axle component. In the illustrated example, the outer bearing assembly220is positioned within a recess232in the hub body218to increase the system's space efficiency, although other hub body contours have been contemplated.", "", "A snap ring234is coupled to an interior235of the hub body218. Further, a circlip236is coupled to an outer surface238of the shaft202. To expound, the circlip236is positioned on an outboard side240of the inner bearing212and the snap ring234is positioned on an inboard side242of the inner bearing212. In this way, the circlip236and the snap ring234axially delimit the inner bearing212, allowing the bearing to be retained in a desired axial position.", "", "In the illustrated example, the hub body218further includes a flange244that is removably attached to a wheel flange246via fasteners248or other suitable attachment devices. The wheel flange246is profiled to attach to a drive wheel via fasteners250.", "", "The hub body218further includes interior splines252(e.g., female splines) that circumferentially surround the exterior splines208on the shaft202. Therefore, a diameter254of the interior splines252is greater than a diameter256of the exterior splines208. A gap258is formed between the interior splines252and the exterior splines208. This gap allows for the torque couplings and the hub lock devices (which are expanded upon herein) to be effectively attached to the wheel hub system200.", "", "The hub body218further includes a fastener joint260at an outboard side262. The fastener joint260is profiled to receive fasteners which allow the torque couplings and the hub lock devices to be removably attached to the wheel hub system200. A rotational axis270of the wheel hub system200is provided inFIG.2as well asFIGS.2-9for reference.", "", "It will be understood that the wheel hub system200may be incorporated into an axle assembly.FIG.3shows an axle assembly300with a differential302that connects to upstream driveline components via an input gear304(e.g., ring gear) and to axle shafts306. It will be appreciated that the axle shafts306may be coupled to joints (e.g., CV joints) which are in turn coupled to the stub shaft202in the wheel hub system200, shown inFIG.2. Thus, the axle assembly300may be a steering axle, in one example. To elaborate, the axle assembly300may be a solid beam steering axle. A solid beam steering axle is an axle with mechanical components structurally supporting one another and extending between drive wheels. For instance, the beam axle may be a structurally continuous structure that spans the drive wheels on a lateral axis, in one embodiment. Thus, wheels coupled to the beam axle substantially move in unison when articulating, during, for example, vehicle travel on uneven road surfaces. To elaborate, the camber angle of the wheels may remain substantially constant as the suspension moves through its travel. The solid beam steering axle may be coupled to a dependent suspension system308, in one example. Therefore, the solid beam axle may be an unsprung mass. Alternatively, the axle shafts306may be the shaft which is included in the wheel hub system and splined at an outboard end in the case of a non-steering axle.", "", "FIG.4shows a detailed illustration of the shaft202(e.g., stub shaft) with the exterior splines208at the outboard side210and the mechanical interface206at the other opposing side which is in the form of a yoke, in the illustrated example The inner bearing212is shown coupled to the shaft202with the circlip236which is removably coupled to the shaft202and allows the inner bearing to be retained in a desired axial position. The diameter400of the exterior splines208is less than the diameter of the section of the shaft which the inner bearing is attached to allow the snap ring to be efficiently installed and removed from the shaft.", "", "FIG.5shows a detailed view of the hub body218. The interior splines252are again depicted along with the flange244that allows the wheel flange246, shown inFIG.2, to be removably attached thereto. The hub body218may include a tapered surface500at the outboard side502of the interior splines252. The tapered surface500allows the torque couplings and the hub lock devices to be more easily aligned and mated with the female splines in the hub body218. Openings504in the flange244are specifically depicted which may receive fasteners or other suitable attachment devices.", "", "FIG.6shows a cross-sectional view of the wheel hub system200with a torque coupling600removably attached thereto. To elaborate, female splines602on an interior opening604of the torque coupling600mate with the exterior splines208on the shaft202and male splines606on an exterior of the torque coupling600mate with the interior splines252in the hub body218. These splined interfaces allow the torque coupling to be efficiently installed and removed from the hub system.", "", "Additionally, fasteners608extend through openings610in the torque coupling600and extend into the fastener joint260in the hub body218to allow the torque coupling600to be removably secured to the wheel hub system200. The torque coupling600is therefore positioned in an interior opening612of the hub body218as well as in an opening614of the wheel flange246.", "", "FIG.7shows a detailed view of the torque coupling600. The female splines602and the male splines606in the torque coupling600are again depicted inFIG.7. The female splines602have a greater pitch than the male splines606. However, other torque coupling configurations have been contemplated. A flange700which interfaces with the fastener joint260, shown inFIG.6, is further depicted inFIG.7. In particular, the openings610in the flange700are illustrated inFIG.7.", "", "FIG.8shows another view of the torque coupling600. A recess800may be included in the outboard side802of the torque coupling600. The flange700with the openings610and the male splines606are again depicted.", "", "FIG.9shows a hub lock device900removably coupled to the wheel hub system200. As shown, female splines902in the hub lock device900are mated with the exterior splines208on the shaft202and male splines904in the hub lock device900are mated with the interior splines252in the hub body218. Further, a flange906in the hub lock device900is coupled to the fastener joint260via fasteners908. In this way, the wheel hub system200is able to be quickly adapted for both the hub lock device900shown inFIG.9and the torque coupling600, depicted inFIGS.6-8. Consequently, the wheel hub system is able to be reconfigured for a wide range of vehicle platforms, thereby increasing customer appeal. Further, it will be understood, that due to this adaptability, end-users are able to modify the wheel end assembly according to their predilection.", "", "The hub lock device900includes a manual actuator910in the illustrated example. The manual actuator910allows a vehicle operator to manually lock and unlock the wheel hub system. For instance, the hub lock device may be unlocked for towing or when all wheel drive operation is not desired. Alternatively, the hub lock device may be configured to be hydraulically or pneumatically actuated, for instance.", "", "FIGS.2-9are drawn approximately to scale, aside from the schematically depicted components, although other relative component dimensions may be used, in other embodiments.FIGS.1-9show example configurations with relative positioning of the various components. If shown directly contacting each other, or directly coupled, then such elements may be referred to as directly contacting or directly coupled, respectively, at least in one example Similarly, elements shown contiguous or adjacent to one another may be contiguous or adjacent to each other, respectively, at least in one example. As an example, components laying in face-sharing contact with each other may be referred to as in face-sharing contact. As another example, elements positioned apart from each other with only a space there-between and no other components may be referred to as such, in at least one example. As yet another example, elements shown above/below one another, at opposite sides to one another, or to the left/right of one another may be referred to as such, relative to one another. Further, as shown in the figures, a topmost element or point of element may be referred to as a “top” of the component and a bottommost element or point of the element may be referred to as a “bottom” of the component, in at least one example. As used herein, top/bottom, upper/lower, above/below, may be relative to a vertical axis of the figures and used to describe positioning of elements of the figures relative to one another. As such, elements shown above other elements are positioned vertically above the other elements, in one example. As yet another example, shapes of the elements depicted within the figures may be referred to as having those shapes (e.g., such as being circular, straight, planar, curved, rounded, chamfered, angled, or the like). Additionally, elements co-axial with one another may be referred to as such, in one example. Further, elements shown intersecting one another may be referred to as intersecting elements or intersecting one another, in at least one example. Further still, an element shown within another element or shown outside of another element may be referred as such, in one example. In other examples, elements offset from one another may be referred to as such.", "", "The invention is further described in the following paragraphs. In one aspect, a wheel hub system is provided that comprises an outer bearing assembly with an inner race coupled to a hub body; a wheel flange configured to removably coupled to the hub body; an inner bearing including an outer race that is coupled to the hub body and an inner race that is coupled to a shaft; wherein the hub body includes interior splines which circumferentially surround exterior splines on the shaft. In one example, the interior splines may be configured to removably couple to: in a first configuration, a hub lock device configured to inhibits mechanical power transfer therethrough when unlocked; and in a second configuration, a torque coupling that during axle operation continuously transfers mechanical power between the shaft and a wheel. Further, in one example, the exterior splines on the shaft may be configured to mate with interior splines in both the hub lock device and the torque coupling in the first configuration and the second configuration, respectively. In one example, the hub body may include a fastener joint that is configured to receive multiple fasteners that extend through the hub lock device in the first configuration, and through the torque coupling in the second configuration. Still further, in one example, the hub lock device may be configured for manual engagement and disengagement. In one example, the hub lock device may be configured for electronic engagement and disengagement. In one example, the wheel hub system may further comprise a circlip removably coupled to the shaft adjacent to an outboard side of the inner bearing. In one example, the wheel hub system may further comprise a snap ring removably coupled to the hub body adjacent to an inboard side of the inner bearing, wherein the circlip and the snap ring axially delimit the inner bearing. In one example, the shaft may be a stub shaft in a steering axle. Still further in one example, the steering axle may be a rigid beam steering axle. In one example, the shaft may be coupled to an electric powertrain. In one example, the inner bearing may be a ball bearing.", "", "In another aspect, a wheel hub system is provided that comprises an outer bearing assembly with an inner race coupled to a hub body; a wheel flange configured to removably coupled to the hub body; an inner bearing including an outer race that is coupled to the hub body and an inner race that is coupled to a shaft which includes male splines; wherein the hub body includes female splines; wherein the female splines have a larger diameter than the male splines; wherein the female splines and the male splines are configured to attach to a hub lock device and a torque coupling in different configurations. Further in one example, the hub body may include a fastener joint that is configured to receive multiple fasteners that extend through the hub lock device in the first configuration, and through the torque coupling in the second configuration. In one example, an inner diameter of the fastener joint may be larger than the diameter of the female splines. In one example, the wheel hub system may further comprise a circlip and a snap ring each which are positioned at opposing sides of the inner bearing and axially capture the inner bearing. In one example, the inner bearing may be a ball bearing and wherein the outer bearing assembly is a thrust bearing assembly. Still further in one example, the shaft may be a stub shaft configured to attach to an axle joint. In one example, the axle joint may be rotationally coupled to an electric powertrain. In one example, the wheel hub system may further comprise a steering knuckle attached to the outer bearing assembly.", "", "While various embodiments have been described above, it should be understood that they have been presented by way of example, and not limitation. It will be apparent to persons skilled in the relevant arts that the disclosed subject matter may be embodied in other specific forms without departing from the spirit of the subject matter. The embodiments described above are therefore to be considered in all respects as illustrative, not restrictive. As such, the configurations and routines disclosed herein are exemplary in nature, and that these specific examples are not to be considered in a limiting sense, because numerous variations are possible. For example, the above technology can be applied to powertrains that include different types of propulsion sources including different types of electric machines and/or internal combustion engines. The subject matter of the present disclosure includes all novel and non-obvious combinations and sub-combinations of the various systems and configurations, and other features, functions, and/or properties disclosed herein.", "", "As used herein, the term “approximately” is construed to mean plus or minus five percent of the range, unless otherwise specified.", "", "The following claims particularly point out certain combinations and sub-combinations regarded as novel and non-obvious. These claims may refer to “an” element or “a first” element or the equivalent thereof. Such claims should be understood to include incorporation of one or more such elements, neither requiring nor excluding two or more such elements. Other combinations and sub-combinations of the disclosed features, functions, elements, and/or properties may be claimed through amendment of the present claims or through presentation of new claims in this or a related application. Such claims, whether broader, narrower, equal, or different in scope to the original claims, also are regarded as included within the subject matter of the present disclosure."], "claims": ["an outer bearing assembly with an inner race coupled to a hub body; a wheel flange configured to removably coupled to the hub body; and an inner bearing including an outer race that is coupled to the hub body and an inner race that is coupled to a shaft; wherein the hub body includes interior splines which circumferentially surround exterior splines on the shaft.", "in a first configuration, a hub lock device configured to inhibits mechanical power transfer therethrough when unlocked; and in a second configuration, a torque coupling that during axle operation continuously transfers mechanical power between the shaft and a wheel.", "3 . The wheel hub system of claim 2 , wherein the exterior splines on the shaft are configured to mate with interior splines in both the hub lock device and the torque coupling in the first configuration and the second configuration, respectively.", "4 . The wheel hub system of claim 2 , wherein the hub body includes a fastener joint that is configured to receive multiple fasteners that extend through the hub lock device in the first configuration, and through the torque coupling in the second configuration.", "5 . The wheel hub system of claim 2 , wherein the hub lock device is configured for manual engagement and disengagement.", "6 . The wheel hub system of claim 2 , wherein the hub lock device is configured for electronic engagement and disengagement.", "7 . The wheel hub system of claim 1 , further comprising a circlip removably coupled to the shaft adjacent to an outboard side of the inner bearing.", "8 . The wheel hub system of claim 7 , further comprising a snap ring removably coupled to the hub body adjacent to an inboard side of the inner bearing, wherein the circlip and the snap ring axially delimit the inner bearing.", "9 . The wheel hub system of claim 1 , wherein the shaft is a stub shaft in a steering axle.", "10 . The wheel hub system of claim 9 , wherein the steering axle is rigid beam steering axle.", "11 . The wheel hub system of claim 1 , wherein the shaft is coupled to an electric powertrain.", "12 . The wheel hub system of claim 1 , wherein the inner bearing is a ball bearing.", "an outer bearing assembly with an inner race coupled to a hub body; a wheel flange configured to removably coupled to the hub body; and an inner bearing including an outer race that is coupled to the hub body and an inner race that is coupled to a shaft which includes male splines; wherein the hub body includes female splines; wherein the female splines have a larger diameter than the male splines; and wherein the female splines and the male splines are configured to attach to a hub lock device and a torque coupling in different configurations.", "14 . The wheel hub system of claim 13 , wherein the hub body includes a fastener joint that is configured to receive multiple fasteners that extend through the hub lock device in a first configuration, and through the torque coupling in a second configuration.", "15 . The wheel hub system of claim 14 , wherein an inner diameter of the fastener joint is larger than the diameter of the female splines.", "16 . The wheel hub system of claim 13 , further comprising a circlip and a snap ring positioned on opposing sides of the inner bearing and axially capturing the inner bearing.", "17 . The wheel hub system of claim 13 , wherein the inner bearing is a ball bearing and wherein the outer bearing assembly is a thrust bearing assembly.", "18 . The wheel hub system of claim 13 , wherein the shaft is a stub shaft configured to attach to an axle joint.", "19 . The wheel hub system of claim 18 , wherein the axle joint is rotationally coupled to an electric powertrain.", "20 . The wheel hub system of claim 13 , further comprising a steering knuckle attached to the outer bearing assembly."], "bibtex": "@patent{20240246360,\n    title = {AXLE ASSEMBLY WITH DISCONNECT SYSTEM},\n    number = {20240246360},\n    year = {2024},\n    note = {File: US20240246360A1-20240725.XML}\n    }", "classification": "B60B3514FI"}, {"title": "NONWOVEN BODY AND TIRE", "doc_number": "20240246361", "filename": "US20240246361A1-20240725.XML", "abstract": "A nonwoven body according to the disclosure includes a plurality of metal fibers each having a cross section orthogonal to a longitudinal direction, the cross section having a profile that is convex polygonal.", "detailed_description": ["An embodiment of a nonwoven body and a tire according to the disclosure will be exemplarily described below with reference to the drawings. The same components in the drawings are denoted by the same reference numerals. In the present specification, the tire width direction refers to a direction parallel to the rotation axis of the tire. The tire radial direction refers to a radial direction orthogonal to the rotation axis of the tire and centering the rotation axis. The tire circumferential direction refers to a direction in which the tire rotates centering the rotation axis of the tire.", "", "FIG.1is an external perspective view of a tire1according to an embodiment of the disclosure. The tire1according to the present embodiment includes a skeleton portion2that defines the structure of the tire1and tread members300mounted on the skeleton portion2.", "", "<Skeleton portion2>", "", "FIG.2is an external perspective view of the skeleton portion2of the tire1. As illustrated inFIG.2, the skeleton portion2of the tire1of the present embodiment includes a wheel portion10as a rim member and a grounding deformable portion20that is deformable while being grounded.", "", "FIG.3is an external perspective view of the wheel portion10of the skeleton portion2of the tire1. The wheel portion10is provided with a plurality of rim portions. As illustrated inFIGS.2and3, the wheel portion10of the present embodiment is provided with two rim portions. More specifically, the wheel portion10of the present embodiment is provided with a first rim portion101and a second rim portion102. The wheel portion10of the present embodiment is further provided with a plurality of connection portions103that connect between the first rim portion101and the second rim portion102. The number of the rim portions provided in the wheel portion10is not particularly limited. The wheel portion10may be provided with, for example, three or more rim portions. A wheel portion provided with three rim portions and a wheel portion provided with four rim portions will be described later (seeFIGS.22to24).", "", "The first rim portion101and the second rim portion102are made of metal or resin. The first rim portion101and the second rim portion102are each formed in an annular shape. The first rim portion101and the second rim portion102are disposed at different positions in a tire width direction A so as to have the same central axis. In the present embodiment, the first rim portion101and the second rim portion102are configured to have the same size and shape. However, as long as the tire1can perform functions as a tire, the first rim portion101and the second rim portion102may be configured in different sizes or shapes. The outer diameter of the first rim portion101and the second rim portion102may be determined as appropriate according to the size of the tire1required.", "", "The connection portions103connect between the first rim portion101and the second rim portion102. The connection portions103are made of metal or resin. As illustrated inFIG.3, the wheel portion10of the present embodiment is provided with six connection portions103, but the number of the connection portions103provided in the wheel portion10is not limited thereto. The plurality of connection portions103are each attached to one side of the annular first rim portion101and one side of the annular second rim portion102. This causes the connection portions103to be integrated with the first rim portion101and the second rim portion102. In this specification, in the wheel portion10, the side on which the connection portions103are attached to the first rim portion101and the second rim portion102is referred to as an “inner side in the tire width direction A”, and the side on which the connection portions103are not attached is referred to as an “outer side in the tire width direction A”.", "", "In the present embodiment, the first rim portion101and the second rim portion102include, in inner surfaces in the tire width direction A, fit receiving portions105(seeFIG.6) to which body springs201of the grounding deformable portion20can be fitted. Details of the fit receiving portions and an aspect of fitting will be described later. In this specification, “fitting” refers to being fitted together, and “latching” refers broadly to being fastened together, including being fitted together.", "", "As illustrated inFIG.3, the wheel portion10as the rim member of the present embodiment further includes support members104that maintain a state of fitting the grounding deformable portion20to the fit receiving portions105(seeFIG.6). The support members104of the present embodiment are attached to the first rim portion101and the second rim portion102. The support members104may be secured to the inner side of the first rim portion101and the second rim portion102in the tire width direction A using, for example, bolts.", "", "The grounding deformable portion20of the present embodiment is configured elastically deformable in a tire radial direction B. As illustrated inFIG.2, the grounding deformable portion20of the present embodiment includes body springs201and interlink springs211. The body springs201and the interlink springs211are made of metal.", "", "FIG.4is a schematic diagram illustrating an example of the body spring201that constitutes the grounding deformable portion20illustrated inFIG.2. The body springs201connect between the plurality of rim portions. In the present embodiment, the body springs201connect between the first rim portion101and the second rim portion102.FIG.22is a diagram illustrating a skeleton portion2including three rim portions501to503. As illustrated inFIG.22, in a case in which the wheel portion10as the rim member of the skeleton portion2has the three rim portions501to503, it is preferable that the body springs201connect between all pairs of two adjacent rim portions out of the three rim portions501to503in a manner similar to the manner of connecting between the first rim portion101and the second rim portion102described above.FIG.24is a diagram illustrating a skeleton portion2including four rim portions. Although the details are not illustrated, also in the example illustrated inFIG.24, the body springs201as inFIG.22connect between all pairs of two adjacent rim portions out of the four rim portions. However, the skeleton portion2including three or more rim portions may also have a configuration of connecting between at least one pair of any two rim portions.", "", "As illustrated inFIG.4, the body spring201includes an elastic deformable portion202and latch portions203. In the present embodiment, the elastic deformable portion202is constituted of a coil spring. Here, the coil spring refers to a spring that deforms elastically in response to a load and is coiled (spirally wound) around a predetermined axis. The elastic deformable portion202that is made of a suitable material and has appropriate elasticity can be used according to the size and weight of a desired tire1, required properties of the grounding deformable portion20, and the like.", "", "The latch portions203are provided at both ends of the elastic deformable portion202. The latch portions203latch the body spring201on the wheel portion10as the rim member. The latch portions203have a different shape from that of the elastic deformable portion202. That is, in the present embodiment, the latch portions203have a shape different from a coil shape.", "", "In the present embodiment, the latch portions203are constituted of members integral with the elastic deformable portion202. As illustrated in FIG.4, the latch portions203of the present embodiment are constituted of extending portions that are parts made by extending a material composing the elastic deformable portion202from both ends of the elastic deformable portion202.", "", "As illustrated inFIG.4, the latch portions203of the present embodiment have straight portions203athat are continuous with both ends of the elastic deformable portion202and extend in a linear shape. Also as illustrated inFIG.4, the latch portions203of the present embodiment include bent portions203bthat are continuous with tip ends opposed to base ends continuous with the elastic deformable portion202of the straight portions203aand are bent with respect to the straight portions203a. In the present embodiment, the bent portions203bare bent orthogonally with respect to the straight portions203ain a side view of the body spring201(seeFIG.4). In other words, the bent portions203bof the present embodiment are bent orthogonally with respect to the straight portions203ain a plane containing the axis of the body spring201.", "", "Referring toFIGS.5to7, an aspect of latching the body springs201on the wheel portion10according to the present embodiment will be described in detail. One of the latch portions203provided at both ends of the body spring201is fitted into the first rim portion101, and the other latch portion203is fitted into the second rim portion102, thus causing the body spring201to be latched on the wheel portion10as the rim member. An example of a case in which one of the latch portions203is latched on the wheel portion10in a state fitted into the first rim portion101will be described here, while the other latch portion203is latched on the wheel portion10in a state fitted into the second rim portion102in the same manner.", "", "FIG.5is a schematic diagram illustrating an example of an aspect of latching the body springs201to the wheel portion10, in which a latched state of the body springs201to the wheel portion10is viewed from the inner side of the first rim portion101in the tire width direction A.FIG.5partially illustrates a part where ones of the latch portions203of the body springs201are latched. However, actually, ones of the latch portions203of the body springs201are latched as illustrated inFIG.5over the entire circumference of the first rim portion101.", "", "FIG.6is a cross sectional view taken on the line I-I ofFIG.5. Specifically,FIG.6is a cross sectional view of the first rim portion101at a point including the fit receiving portion105. As illustrated inFIG.6, the body spring201of the present embodiment is latched on the wheel portion10in a state where the latch portion203is fitted into the fit receiving portion105provided on the inner surface of the first rim portion101in the tire width direction A. In the present embodiment, the fit receiving portion105is configured as a hole into which the bent portion203bof the latch portion203is insertable. More specifically, the fit receiving portion105of the present embodiment is configured as a bottomed hole. The length of the hole (depth of the hole) of the fit receiving portion105in an extending direction is preferably longer than the length of the bent portion203b. As a result, the entire bent portion203bcan be inserted into the fit receiving portion105, and the fitting state becomes more stable. However, the fit receiving portion105may be configured as a through hole, a bottomless hole.", "", "The shape of cross section of the hole of the fit receiving portion105is not limited as long as the bent portion203bis insertable thereinto, and may be, for example, an ellipse, an oval, a rectangle, a polygon, or the like. In order to latch the elastic deformable portion202more reliably, it is preferable that the shape and size of cross section of the hole are approximately the same as the shape and size of cross section of the bent portion203b.", "", "As illustrated inFIG.6, the body spring201is arranged such that, in a state where the bent portion203bhas been inserted into the fit receiving portion105, the elastic deformable portion202is positioned, except for at least part, at the outer side (upper side inFIGS.6and7) of the annular first rim portion101in the tire radial direction B. In this state, the support member104is attached to the inner side (left side inFIGS.6and7) of the first rim portion101in the tire width direction A. As illustrated inFIG.6, the support member104is attached to such a position as to retain the bent portion203binserted into the hole of the fit receiving portion105, i.e., such a position as to prevent the bent portion203bfrom slipping out of the hole of the fit receiving portion105. The support member104is preferably attached to such a position as to block the hole of the fit receiving portion105in a state of not inserting the body spring201. In addition, as illustrated inFIG.6, the support member104sandwiches the straight portion203aof the latch portion203with the inner surface of the first rim portion101in the tire width direction A. In other words, the support member104is secured to the first rim portion101so as to sandwich the straight portion203aof the latch portion203with the inner surface of the first rim portion101in the tire width direction A. In this way, the body spring201of the present embodiment is latched on the wheel portion10such that the straight portion203aand the bent portion203bof the latch portion203are sandwiched between the inner surface of the first rim portion101in the tire width direction A and the support member104, in a state where the bent portion203bof the latch portion203is fitted into the fit receiving portion105.", "", "The support member104of the present embodiment is attached to the first rim portion101using, for example, a bolt106.FIG.7is a cross sectional view taken on the line II-II ofFIG.5. More specifically,FIG.7is a cross sectional view at a point including the bolt106for securing the support member104to the first rim portion101. As illustrated inFIG.7, the support member104is secured to the first rim portion101by the bolt106. As illustrated inFIG.5, the support member104may be secured to the first rim portion101at a position between two body springs201. That is, in the first rim portion101, one bolt hole107for securing the bolt106is formed between two fit receiving portions105adjacent in a tire circumferential direction C of the annular first rim portion101. Thereby, it is possible to secure the support member104to the first rim portion101without interfering with latched positions of the body springs201.", "", "As illustrated inFIGS.5to7, the bolt106may be provided such that a threaded end of the bolt106protrudes inward in the tire width direction A, relative to an inner surface of the support member104in the tire width direction A. The threaded end of the bolt106, which protrudes inward in the tire width direction A relative to the inner surface of the support member104in the tire width direction A, may be used to secure a secured portion of a tread member300described below.", "", "The support member104may be constituted of a single annular member or as a plurality of divided members that form an annular shape in their entirety. In such a case, the plurality of support members104may be arranged such that two support members104adjacent in the tire circumferential direction C contact or overlap each other at their ends in the tire circumferential direction C. Two support members104adjacent in the tire circumferential direction C may be arranged with leaving appropriate clearances in the tire circumferential direction C. In a case in which the support member104is constituted of the plurality of divided members, each member may have, for example, the shape of a sector.", "", "A plurality of body springs201are arranged throughout in the tire circumferential direction C with leaving predetermined clearances in the tire circumferential direction C. One of the latch portions203of each of these plurality of body springs201is latched on the wheel portion10with the above-described latching aspect using the fit receiving portion105of the first rim portion101. The other latch portion203of each of the body springs201is also latched on the wheel portion10with the above-described latching aspect using the fit receiving portion105of the second rim portion102in the same manner. In the present embodiment, one latch portion203and the other latch portion203of one body spring201may be fitted into the fit receiving portions105of the first rim portion101and the second rim portion102that are positioned on one straight line approximately parallel to the tire width direction A, with respect to the first rim portion101and the second rim portion102. In other words, in the present embodiment, two latch portions203of one body spring201may be secured to the first rim portion101and the second rim portion102at the same position in the tire circumferential direction C. However, the two latch portions203of the one body spring201may be secured to the first rim portion101and the second rim portion102at different positions in the tire circumferential direction C.", "", "The number and intervals in the tire circumferential direction C of the body springs201to be fitted into the first rim portion101and the second rim portion102may be determined as appropriate according to the size and weight of the tire1, required properties of the grounding deformable portion20, and the like. The number and intervals in the tire circumferential direction C of the bolts106used to attach the support members104to the first rim portion101and the second rim portion102may also be determined as appropriate. For example, the bolt106does not necessarily have to be attached to every space between two fit receiving portions105adjacent in the tire circumferential direction C as in the present embodiment.", "", "In the skeleton portion2of the tire1according to the present embodiment, the plurality of body springs201, which are latched on the wheel portion10in this manner, are interlinked with the interlink springs211to form the grounding deformable portion20. In other words, in the present embodiment, the interlink spring211functions as an interlink member to interlink adjacent body springs201.FIG.8is a schematic diagram illustrating an example of the interlink spring211that constitutes the grounding deformable portion20ofFIG.2. In the present embodiment, as illustrated inFIG.8, the interlink spring211includes an elastic deformable portion212and a limitation portion213. The interlink spring211is disposed between two body springs201adjacent in the tire circumferential direction C, which are latched on the wheel portion10. The interlink spring211is interlaced with the two body springs201so as to be interlinked with the body springs201.", "", "In the present embodiment, the elastic deformable portion212is constituted of a coil spring. The elastic deformable portion212that is made of a suitable material and has appropriate elasticity can be used according to the size and weight of a desired tire1, required properties of the grounding deformable portion20, and the like. It is preferable that the diameter of the coil spring constituting the elastic deformable portion212is close to the diameter of the coil spring constituting the elastic deformable portion202of the body spring201. Here, the diameter of the coil spring is the diameter of a circumscribed circle in the case of viewing the coil spring from the axial direction, and the same applies hereinafter. The closer the diameter of the coil spring constituting the elastic deformable portion212is to the diameter of the coil spring constituting the elastic deformable portion202of the body spring201, the more evenly force is applied to the grounding deformable portion20that is formed by interlinking the coil springs constituting the elastic deformable portions202with the coil springs constituting the elastic deformable portions212as described below. For example, both the diameter of the coil spring constituting the elastic deformable portion202and the diameter of the coil spring constituting the elastic deformable portion212can be 15 mm to 25 mm, e.g., 20 mm or the like.", "", "In the present embodiment, the limitation portion213is provided at one end of the elastic deformable portion212. No other mechanism is provided at the other end of the elastic deformable portion212where the limitation portion213is not provided. Thus, the elastic deformable portion212has an open shape at the other end. The limitation portion213limits displacement of the interlink spring211, which is to be interlinked with the body springs201, with respect to the body springs201. The limitation portion213only has to limit displacement of the interlink spring211in at least one direction relative to the body springs201. In this way, by limiting displacement of the interlink spring211relative to the body springs201by the limitation portion213, in interlinking the interlink spring211with the body springs201, as described with reference toFIGS.9A and9Bbelow, the interlinked position of the interlink spring211is determined and secured. That is, the interlinked state of the interlink spring211with respect to the body springs201is positioned and secured. The limitation portion213has a different shape from the elastic deformable portion212. That is, in the present embodiment, the limitation portion213has a different shape from a coil shape.", "", "In the present embodiment, the limitation portion213is constituted of a member integral with the elastic deformable portion212. As illustrated inFIG.8, the limitation portion213of the present embodiment is an extending portion constituted of a part made by extending a material composing the elastic deformable portion212from one end of the elastic deformable portion212. In the example illustrated inFIG.8, the limitation portion213has a ring-shaped portion formed with a wire, which forms the elastic deformable portion212, being bent into a ring shape. The ring-shaped portion is formed such that a direction intersecting with a central axis direction D parallel to a central axis O of the elastic deformable portion212is a central axis direction E. The ring-shaped portion of the limitation portion213may be of any size capable of limiting displacement of the interlink spring211. For example, the ring-shaped portion of the limitation portion213may be configured to have a diameter of 0.5 to 1.0 times the diameter of the elastic deformable portion212.", "", "Here, the function of the limitation portion213will be described together with a method for interlinking the interlink spring211with the body springs201.FIGS.9A and9Bare schematic diagrams for explaining an example of the method for interlinking the interlink spring211with the body springs201.", "", "As illustrated inFIG.9A, the interlink spring211is interlinked with two adjacent body springs201by hooking the elastic deformable portion212on the elastic deformable portions202of the body springs201, which are latched on the wheel portion10, in such a manner as to be interlaced with the two adjacent body springs201. Specifically, the interlink spring211is interlinked with the body springs201so as to limit the relative displacement between the two body springs201adjacent in the tire circumferential direction C. At this time, the interlink spring211is gradually interlaced with the two adjacent body springs201by being inserted into the body springs201in such a manner as to move forward while rotating, from the side of the other end on which the limitation portion213is not provided.", "", "As the entire elastic deformable portion212of the interlink spring211is interlaced with the body springs201, as illustrated inFIG.9B, the limitation portion213eventually comes into a state in contact with the body spring201. The limitation portion213, due to its shape, cannot be interlaced with the body springs201. Therefore, the interlink spring211does not move in an insertion direction beyond the position at which the limitation portion213contacts the body spring201. In particular, the interlink spring211does not move forward (move in the insertion direction) after the ring-shaped portion of the limitation portion213contacts the body spring201, even if the interlink spring211is attempted to be moved forward while being rotated. In such a manner, the limitation portion213limits displacement of the interlink spring211in at least one direction relative to the body springs201. In this manner, the limitation portion213positions and secures the interlinked state of the interlink spring211with respect to the body springs201. In addition, the interlink spring211interlinked with the body springs201is prevented from coming off from the body springs201.", "", "It is preferable that at least one of the two ends of the interlink spring211is not secured to the wheel portion10. In the present embodiment, neither of the ends of the interlink spring211is secured to the wheel portion10. In other words, in the present embodiment, the interlink spring211is not secured at both ends. However, only one of the ends of the interlink spring211may be secured to the wheel portion10. In this case, the other end of the interlink spring211, which is opposite to the one end of the interlink spring211on which the limitation portion213is provided, is secured to the rim member.", "", "In the present embodiment, all the body springs201, which are latched on the wheel portion10, are interlinked with each of two adjacent body springs201with the interlink springs211. In the present embodiment, the skeleton portion2is configured in this manner. In other words, in the present embodiment, every body spring201of the grounding deformable portion20of the skeleton portion2is interlinked with two interlink springs211, and every interlink spring211of the grounding deformable portion20of the skeleton portion2is interlinked with two body springs201. Accordingly, the interlink springs211are each interlinked between two adjacent body springs201, so even in the case of applying a load to the skeleton portion2, the distance between the body springs201does not widen too much, and the function as the tire1can be easily maintained.", "", "The interlink spring211that joins two body springs201may be inserted from the side of the first rim portion101toward the side of the second rim portion102or may be inserted from the side of the second rim portion102toward the side of the first rim portion101, in the tire width direction A. It is preferable that half of the plurality of interlink springs211provided in the skeleton portion2are inserted from the side of the first rim portion101toward the side of the second rim portion102in the tire width direction A, and the other half thereof are inserted from the side of the second rim portion102toward the side of the first rim portion101in the tire width direction A. This means that the limitation portions213of the interlink springs211are evenly arranged on both sides of the skeleton portion2in the tire width direction A, thus easily striking a balance of the skeleton portion2. This can also prevent the limitation portions213from being congested in only one side of the skeleton portion2in the tire width direction A. In particular, the plurality of interlink springs211are more preferably inserted such that two interlink springs211adjacent to each other in the tire circumferential direction C are inserted from different directions. This further facilitates striking a balance of the skeleton portion2.", "", "The skeleton portion2may also be provided with a connection member that connects the ring-shaped portions of the limitation portions213of the plurality of interlink springs211. The connection member may be constituted of a wire, for example. For example, suppose that half of the plurality of interlink springs211are inserted from the side of the first rim portion101toward the side of the second rim portion102and the other half thereof are inserted from the side of the second rim portion102toward the side of the first rim portion101. In this case, the limitation portions213of the interlink springs211inserted from the side of the first rim portion101toward the side of the second rim portion102are located on the side of the first rim portion101in the tire width direction A, and the limitation portions213of the interlink springs211inserted from the side of the second rim portion102toward the side of the first rim portion101are located on the side of the second rim portion102in the tire width direction A. In this case, the skeleton portion2may have two wires, that is, a wire for connecting the ring-shaped portions of the plurality of limitation portions213located on the side of the first rim portion101in the tire width direction A and a wire for connecting the ring-shaped portions of the plurality of limitation portions213located on the side of the second rim portion102in the tire width direction A.", "", "The wire for connecting the ring-shaped portions of the plurality of limitation portions213located on the side of the first rim portion101is provided, for example, along the tire circumferential direction C so as to pass through central openings of all the ring-shaped portions of the plurality of limitation portions213located on the side of the first rim portion101. Similarly, the wire for connecting the ring-shaped portions of the plurality of limitation portions213located on the side of the second rim portion102is provided, for example, along the tire circumferential direction C so as to pass through central openings of all the ring-shaped portions of the plurality of limitation portions213located on the side of the second rim portion102. Provision of such wires can connect the limitation portions213of the plurality of interlink springs211each other. Thus, such wires limit displacement of the relative positional relationship between the limitation portions213. As a result, the interlink springs211that are interlinked with the body springs201are further prevented from coming off from the body springs201.", "", "However, the connection member for connecting the ring-shaped portions of the limitation portions213of the plurality of interlink springs211need not necessarily be configured to pass through central openings of the ring-shaped portions of the plurality of limitation portions213as described above, and the limitation portions213may be connected to each other by any form. In this case, for example, the connection member may be secured to each of the ring-shaped portions of the plurality of limitation portions213to be connected, thereby connecting the ring-shaped portions of the plurality of limitation portions213. By providing at least the wire for connecting the limitation portions213of the plurality of interlink springs211, displacement of the relative positional relationship between the interlink springs211connected by the wire is limited.", "", "In the above embodiment, it is described that the ring-shaped portion of the limitation portion213has the central axis direction E intersecting with the central axis direction D parallel to the central axis O of the elastic deformable portion212, but the shape of the limitation portion213is not limited thereto. The limitation portion213may have any configuration capable of limiting displacement of the interlink spring211in at least one direction relative to the body springs201.", "", "In the present embodiment, the limitation portion213is constituted of a member integral with the elastic deformable portion212, but the limitation portion213does not have to be constituted of a member integral with the elastic deformable portion212. For example, as schematically illustrated inFIG.10, a limitation portion213that is constituted of a member different from and independent of the interlink spring211may limit displacement of the interlink spring211relative to the body springs201. In the example illustrated inFIG.10, the limitation portion213is configured as a member different from and independent of the interlink spring211, for limiting displacement of a contact point between the body spring201and the interlink spring211that are interlaced with each other.", "", "The length of the interlink spring211may be determined as appropriate according to the size and weight of a desired tire1, the required properties of the grounding deformable portion20, and the like. The interlink spring211is preferably configured to have a length of the elastic deformable portion212that is shorter than the length of the elastic deformable portion202of the body spring201. The interlink spring211preferably has a length such that the elastic deformable portion212extends throughout the tire width direction A. Thereby, the elastic deformable portions202of the body springs201are interlinked with the elastic deformable portions212of the interlink springs211in at least a grounding area in the tire width direction A."], "claims": ["1 . A nonwoven body comprising a plurality of metal fibers each having a cross section orthogonal to a longitudinal direction, the cross section having a profile that is convex polygonal.", "2 . The nonwoven body according to claim 1 , wherein the profile of the cross section orthogonal to the longitudinal direction of each of the metal fibers is rectangle.", "3 . The nonwoven body according to claim 1 , wherein the metal fibers are made of austenite stainless steel or aluminum alloy.", "4 . The nonwoven body according to claim 1 , constituted of only the plurality of metal fibers.", "5 . The nonwoven body according to claim 1 , wherein the plurality of metal fibers mechanically tangle each other to be integrated.", "a skeleton portion including a rim member, a plurality of body springs latched on the rim member, and a plurality of interlink springs interlaced with the body springs; and a tread member disposed on at least an outer periphery of the skeleton portion, wherein the tread member includes the nonwoven body according to", "the nonwoven fabric is disposed on the outer periphery of the skeleton portion in such a manner that the nonwoven fabric is at least partially embedded in grooves sectioned by the body springs and the interlink springs in a rounded rod shape.", "8 . The tire according to claim 7 , wherein the nonwoven fabric is rounded in such a manner that a plurality of layers are laminated in a radial direction.", "9 . The nonwoven body according to claim 2 , wherein the metal fibers are made of austenite stainless steel or aluminum alloy.", "10 . The nonwoven body according to claim 2 , constituted of only the plurality of metal fibers.", "11 . The nonwoven body according to claim 2 , wherein the plurality of metal fibers mechanically tangle each other to be integrated.", "a skeleton portion including a rim member, a plurality of body springs latched on the rim member, and a plurality of interlink springs interlaced with the body springs; and a tread member disposed on at least an outer periphery of the skeleton portion, wherein the tread member includes the nonwoven body according to", "13 . The nonwoven body according to claim 3 , constituted of only the plurality of metal fibers.", "14 . The nonwoven body according to claim 3 , wherein the plurality of metal fibers mechanically tangle each other to be integrated.", "a skeleton portion including a rim member, a plurality of body springs latched on the rim member, and a plurality of interlink springs interlaced with the body springs; and a tread member disposed on at least an outer periphery of the skeleton portion, wherein the tread member includes the nonwoven body according to", "16 . The nonwoven body according to claim 4 , wherein the plurality of metal fibers mechanically tangle each other to be integrated.", "a skeleton portion including a rim member, a plurality of body springs latched on the rim member, and a plurality of interlink springs interlaced with the body springs; and a tread member disposed on at least an outer periphery of the skeleton portion, wherein the tread member includes the nonwoven body according to", "a skeleton portion including a rim member, a plurality of body springs latched on the rim member, and a plurality of interlink springs interlaced with the body springs; and a tread member disposed on at least an outer periphery of the skeleton portion, wherein the tread member includes the nonwoven body according to", "19 . The nonwoven body according to claim 9 , constituted of only the plurality of metal fibers.", "20 . The nonwoven body according to claim 9 , wherein the plurality of metal fibers mechanically tangle each other to be integrated."], "bibtex": "@patent{20240246361,\n    title = {NONWOVEN BODY AND TIRE},\n    number = {20240246361},\n    year = {2024},\n    note = {File: US20240246361A1-20240725.XML}\n    }", "classification": "B60C706FI"}, {"title": "PNEUMATIC VEHICLE TIRE HAVING A BELT BANDAGE HAVING AT LEAST ONE BELT PLY", "doc_number": "20240246362", "filename": "US20240246362A1-20240725.XML", "abstract": "A pneumatic vehicle tire with a belt assembly with at least one belt ply reinforced with steel cords embedded in rubber material. The steel cords each having the same number of steel filaments, are arranged parallel to one another and at at least substantially equal distances apart within each belt ply, have rubber coating layers on both sides, the layer thicknesses of which in total are 0.10 mm to 2.00 mm, when viewed in cross section are flattened open steel cords composed of four to six steel filaments periodically twisted together, at least two of which, when viewed in cross section, are flat-deformed, have a first larger diameter and a second smaller diameter perpendicular thereto, the ratio of which is between 1.10 and 3.00, and are embedded in the belt ply with their first, larger diameter lying largely flat and are at largely equal clear distances from one another, which are 0.10 mm to 1.00 mm.", "detailed_description": ["The present invention is concerned with the arrangement of flattened, cross-sectionally non-circular steel cords composed of four to six steel filaments in at least one of the belt plies of pneumatic vehicle tires of a radial design and of any type, preferably tires for passenger cars, light trucks or heavy-duty vehicles.", "", "All dimensions specified in the description should be understood taking into account the usual production-related deviations.", "", "The four to six steel filaments of the flattened steel cords are periodically twisted together or intertwined, so that an open steel cord is present in such a way that, when embedding the steel cords in a belt rubber coating compound, the material of the compound can penetrate into the gaps between the steel filaments, thereby filling them. Individual steel filaments may in this case also contact one another without affecting the penetrability. The steel filaments of the flattened steel cords have a common tensile strength of 2,500 N/mm2to 4,500 N/mm2, the tensile strengths are therefore substantially in the range from NT (Normal Tensile) to UT (Ultra Tensile).", "", "FIG.1shows a schematic cross section of a flattened steel cord1with five steel filaments2,FIG.3shows a schematic cross section of a flattened steel cord1with six steel filaments2. The production of the flattened steel cords1is performed in such a way that five or up to six steel filaments2′ of the same design and circular in cross section, with a diameter d of 0.10 mm to 0.60 mm, in particular of 0.18 mm to 0.45 mm, are twisted together so that the steel cords1′, that are round in cross section inFIG.2andFIG.4are formed as “original cords”. These “original cords” are deformed, for example by a rolling operation, so that in each case at least two steel filaments2′ are locally flattened or deformed, in particular in the region of their mutual contact points, and an irregularly flattened cross-sectional form is thereby at least partially obtained, with also the steel cord1being given overall a flattened cross-sectional shape. Due to the twisting of the steel filaments2, when viewed in different cross sections over the length of the steel cord1, steel filaments2are differently deformed; some may even not be deformed and then locally have their originally circular cross section.FIG.5shows this on the basis of a representation of a realistic cross section of a flattened steel cord1with five largely irregularly deformed steel filaments2. The same applies to flattened steel cords composed of four steel filaments.", "", "The flattened steel cords1have a larger diameter D1and a diameter D2at right angles to it, smaller compared to D1. The diameters D1and D2are the largest diameters in each case and are therefore determined at the locations with the largest “widths” of the steel cords1. D1is in this case>0.2 mm, in particular D1>0.26 mm, and the ratio of D1to D2is 1.10 to 3.00, preferably 1.20 to 1.90, particularly preferably 1.40 to 1.80. For the deformed, flattened steel cords1, the relationship 1.60 d≤D2≤2.40 d applies with respect to the smaller diameter D2, where d is the diameter of the cross-sectionally circular steel filaments of the undeformed steel cords. The deformation or compression of the “original cords” is performed in particular in such a way that the deformed steel filaments2have their largest diameter d1substantially parallel to the diameter D1and a further smaller diameter d2at right angles to it at its widest point, where the ratio of d2to d1is in the range of about 0.70 to about 0.98.", "", "The flat-deformed steel filaments2each have a cross-sectional surface area which corresponds or largely corresponds to that of the originally circular steel filaments2, because minor material shifts in the longitudinal direction of the steel filaments can take place locally in the deformation process.", "", "FIG.6shows by way of example a cross section through a portion of a belt ply3of a pneumatic vehicle tire, the belt ply3being reinforced with schematically shown steel cords1with five steel filaments2. Instead of the steel cords composed of five filaments shown, as described, steel cords of four or six filaments may also be contained in the belt ply3. The clear distance Rgbetween the steel cords1depends on the diameter D1and the cord density (epdm, number of cords per decimeter belt ply) and ranges between 0.10 mm, in particular 0.30 mm, and 1.00 mm, where:", "", "D1=100/epdm-Rg,where⁢D1>0,2⁢mm,as⁢mentioned⁢above.", "", "If, according to a preferred embodiment, the flattened steel cords have five steel filaments and a diameter D1of 0.50 mm to 0.70 mm, the clear distance Rgbetween the steel cords is 0.35 mm to 0.70 mm. If the diameter D1of the flattened steel cords is >0.50 mm to 1.35 mm, the steel cords1are embedded in the belt ply3in such a way that their clear distance Rgapart is 0.50 mm to 0.90 mm.", "", "The overall thickness La of the belt ply3is the sum of the aforementioned smaller diameter D2of the steel cords1contained in the belt ply3and the layer thicknesses Rcand Rbof the rubber coating layers present above and below the steel cords1. The layer thicknesses Rcand Rbare in each case determined as the smallest clear distances between the steel cords1and the outer and inner outer surfaces of the belt ply3. The sum of the two layer thicknesses Rcand Rbfor flattened steel cords composed of four to six steel filaments is at least 0.10 mm and at most 2.00 mm, in particular up to 1.00 mm, preferably up to 0.70 mm, particularly preferably up to 0.60 mm. Rcand Rbmay be the same size (on average) or of different sizes, so that there is an asymmetric rubber coating. A preferred range for the sum of Rcand Rblies in the range from 0.20 mm to 0.60 mm.", "", "Table 1, Table 2 and Table 3 contain data on preferred variants VAR1.1, VAR1.2, VAR2.1, VAR 2.2, VAR3 and VAR4 of an embodiment of belt plies with flattened steel cords1composed of five steel filaments2and comparative examples REF1.1, REF1.2, REF2 and REF3 of belt plies with steel cords that are known steel cords made according to the prior art. REF1.1 is the comparative example for the variants VAR1.1 and VAR2.1; REF1.2 is the comparative example for the variants VAR1.2 and VAR2.2. REF2 is the comparative example for the variant VAR3, and REF3 is the comparative example for the variant VAR4.", "", "The comparative examples REF1.1, REF1.2, REF2 and REF3 contain steel cords of the constructions 2×0.30 mm HT, 2+2×0.32 mm HT and 3×0.2 mm+6×0.35 mm HT with cross-sectionally circular steel filaments.", "", "The steel cords in the belt plies made according to the invention (VAR1.1 to VAR4) are flattened steel cords, for which, in the absence of better terminology, the originally circular diameter of the steel filaments is indicated in the steel cord construction; therefore 0.185 mm (construction referred to as 5×1.85 mm ST), also 0.20 mm (construction referred to as 5×0.20 mm ST), 0.28 mm (construction referred to as 5×0.28 mm ST) and 0.40 mm (construction referred to as 5×0.40 mm ST).", "", "Other parameters in the tables are the cord diameter (REF1.1 to REF3), the diameter D1, the diameter D2, the ratio D1to D2, the breaking force that can be withstood by the respective steel cord, determined according to ASTM D2969 and ASTM D4975, the tensile strength of the belt ply in kN/dm (calculated from the epdm and the breaking force that can be withstood by the respective cord), the belt thickness in mm, the clear distance between cords Rgin mm and the number of cords per 10 cm of belt ply (epdm).", "", "In the comparative examples REF1.1 to REF3, the belt ply weight is set to 100%, in the examples according to the invention VAR1.1 to VAR4 respectively in % and in relation to the respective comparative examples REF1.1 to REF3.", "", "TABLE 1REF1.1REF1.2VAR1.1VAR1.2VAR2.1VAR2.2Cord construction2 × 0.30 mm HT5 × 0.185 mm ST5 × 0.20 mm STCord diameter [mm]0.600.60Diameter D1[mm]0.600.600.660.66Diameter D2[mm]0.400.400.440.44Ratio of D1to D21.51.51.51.5Breaking force (N)445445460460505505Tensile strength [kN/dm]35.642.336.843.740.448.0Clear distance between0.650.450.650.450.590.39cords Rg[mm]Belt ply weight [%]100.0%100.0%85.0%85.7%87.6%88.1%Belt ply thickness [mm]0.900.900.700.700.740.74epdm809580958095", "", "TABLE 2REF2VAR3Cord construction2 + 2 × 0.325 × 0.28mm HTmm STCord diameter [mm]0.83Diameter D1[mm]0.94Diameter D2[mm]0.53Ratio of D1to D21.77Breaking force (N)1010980Tensile strength [kN/dm]65.763.7Clear distance between cords Rg[mm]0.710.60Belt ply weight [%]100.0%79.0%Belt ply thickness [mm]1.300.83epdm6565", "", "TABLE 3REF3VAR4Cord construction3 × 0.2 mm +5 × 0.406 × 0.35 mm HTmm STCord diameter [mm]1.13Diameter D1[mm]1.30Diameter D2[mm]0.75Ratio of D1to D21.74Breaking force (N)1980.01931.7Tensile strength [kN/dm]81.290.8Clear distance between cords Rg[mm]1.310.83Belt ply weight [%]100.0%86.1%Belt ply thickness [mm]1.601.05epdm4147"], "claims": ["are arranged parallel to one another and at at least substantially equal distances apart within at least one belt ply, have rubber coating layers on both sides, the layer thicknesses of which in total are 0.10 mm to 2.00 mm, when viewed in cross section are flattened open steel cords composed of four to six steel filaments periodically twisted together, at least two of which, when viewed in cross section, are flat-deformed, have a first larger diameter and a second smaller diameter perpendicular thereto, the ratio of the first diameter to the second diameter is between 1.10 and 3.00, are at equal distances from one another, which the equal distances are from 0.10 mm to 1.00 mm.", "2 . The pneumatic vehicle tire as claimed in claim 1 , wherein, when viewed in any cross section along the steel cords, in each case at least one steel filament is circular.", "the steel cords are composed of five steel filaments and when viewed in any cross section along the steel cords, at least three of the steel filaments are flat-deformed, or the steel cords are composed of six steel filaments, d when viewed in any cross section along the steel cords, at least four steel filaments are flat-deformed.", "the steel cords are composed of five steel filaments, and when viewed in any cross section along the steel cords, exactly one of the steel filaments is circular, or the steel cords are composed of four or six steel filaments, and when viewed in any cross section along the steel cords, exactly two steel filaments are circular.", "where D1 is the first larger diameter of the steel cords and D1>0.20 mm, and where Rg is the clear distance between adjacent steel cords and epdm is the number of cords per 10 cm of belt ply width.", "6 . The pneumatic vehicle tire as claimed in claim 1 , wherein the ratio (D1/D2) of the larger diameter (D1) to the smaller diameter (D2) of the steel cord is 1.20 to 1.90.", "7 . The pneumatic vehicle tire as claimed in claim 1 , wherein the layer thicknesses of the rubber coating layers in total are 0.20 mm to −1.00 mm.", "8 . The pneumatic vehicle tire as claimed in claim 1 , wherein the layer thickness of the rubber coating layers are the same size or of different sizes, the layer thicknesses being at least 0.05 mm in each case.", "9 . The pneumatic vehicle tire as claimed in one of claim 1 , wherein the belt ply contains flattened steel cords composed of five steel filaments.", "10 . The pneumatic vehicle tire as claimed in claim 1 , wherein the belt ply contains flattened steel cords composed of five steel filaments and with a larger diameter of 0.50 mm to 0.70 mm, with the clear distance between the steel cords being 0.35 mm to 0.70 mm.", "11 . The pneumatic vehicle tire as claimed in claim 9 , wherein the ratio of the larger diameter to the smaller diameter of the steel cords is 1.40 to 1.60.", "12 . The pneumatic vehicle tire as claimed in claim 1 , wherein the belt ply contains flattened steel cords composed of five steel filaments and with a larger diameter>0.50 mm to 1.35 mm, with the clear distance between the steel cords being 0.50 mm to 0.90 mm.", "13 . The pneumatic vehicle tire as claimed in claim 9 , wherein the ratio of the larger diameter to the smaller diameter of the steel cords is 1.70 to 1.80.", "14 . The pneumatic vehicle tire as claimed in claim 1 , wherein the flattened steel cords are produced by deforming steel cords of cross-sectionally circular steel filaments with matching diameters of 0.18 mm to 0.45 mm.", "15 . The pneumatic vehicle tire as claimed in claim 1 , wherein the flattened steel cords are produced by deforming steel cords of cross-sectionally circular steel filaments with diameters of 0.185 mm, 0.20 mm, 0.22 mm, 0.28 mm or 0.40 mm.", "where d is the diameter of the cross-sectionally circular steel filaments of the undeformed steel cords and D", "17 . The pneumatic vehicle tire of claim 1 , in which the steel cords when viewed in cross-section are flat deformed in an irregular manner.", "18 . The pneumatic vehicle tire of claim 5 , where D1>0.26 mm.", "19 . The pneumatic vehicle tire of claim 6 , wherein the ratio (D1/D2) of the larger diameter (D1) to the smaller diameter (D2) of the steel cords is 1.40 to 1.80.", "20 . The pneumatic vehicle tire of claim 7 , wherein the layer thicknesses of the rubber coating layers in total are 0.20 mm to 0.70 mm."], "bibtex": "@patent{20240246362,\n    title = {PNEUMATIC VEHICLE TIRE HAVING A BELT BANDAGE HAVING AT LEAST ONE BELT PLY},\n    number = {20240246362},\n    year = {2024},\n    note = {File: US20240246362A1-20240725.XML}\n    }", "classification": "B60C900FI"}, {"title": "TIRE", "doc_number": "20240246363", "filename": "US20240246363A1-20240725.XML", "abstract": "A tire according to the present disclosure includes a carcass comprising a carcass body portion that extends toroidally between a pair of bead cores and a carcass foldback portion that extends from the carcass body portion and folds back around a perimeter of the bead cores from a tire width direction inner side to a tire width direction outer side, and a communication device embedded on the tire width direction outer side of the carcass foldback portion, wherein, when in a standard state in which the tire is fitted to an applicable rim, a prescribed internal pressure is applied, and no load is applied, a cord extension direction of the carcass foldback portion is inclined with respect to a tire radial direction when viewed in a tire width direction.", "detailed_description": ["The following describes embodiments of a tire according to the present disclosure with reference to the drawings. Members and portions common to each drawing use the same reference numerals. Note, however, that the drawings are schematic and that the proportions of each dimension and the like may differ from those in reality.", "", "In the present specification, “tire width direction” refers to a direction parallel to a rotation axis of the tire. “Tire radial direction” refers to a direction perpendicular to the rotation axis of the tire. “Tire circumferential direction” refers to a direction in which the tire rotates centered on the rotation axis of the tire. In the drawings, the tire width direction, the tire radial direction, and the tire circumferential direction are denoted as DW, DR, and DC, respectively.", "", "Further, in the present specification, “tire radial direction inner side” refers to a side along the tire radial direction closer to the rotation axis of the tire, and “tire radial direction outer side” refers to a side along the tire radial direction farther from the rotation axis of the tire. On the other hand, “tire width direction inner side” refers to a side along the tire width direction closer to a tire equatorial plane, denoted as CL, and “tire width direction outer side” refers to a side along the tire width direction farther from the tire equatorial plane CL.", "", "Unless otherwise noted, in the present specification, the positional relationship, etc. of each element of the tire is measured in a standard state. The “standard state” is a state in which the tire is fitted to an applicable rim, a prescribed internal pressure is applied, and no load is applied. The following describes a tire that has a cavity filled with air and is installed on a vehicle such as a passenger vehicle. However, the cavity of the tire may be filled with a fluid other than air, and the tire may be installed on a vehicle other than a passenger vehicle.", "", "In the present specification, “applicable rim” (Measuring Rim in the STANDARDS MANUAL of ETRTO and Design Rim in the YEAR BOOK of TRA) refers to an approved rim of an applicable size as described by, or as described in the future by, valid industrial standards for the region in which a tire is produced or used, such as the JATMA YEAR BOOK of JATMA (the Japan Automobile Tyre Manufacturers Association) in Japan, the STANDARDS MANUAL of ETRTO (European Tyre and Rim Technical Organization) in Europe, and the YEAR BOOK of TRA (The Tire and Rim Association, Inc.) in the U.S. In a case in which a rim size is not described in the industrial standards, the “applicable rim” refers to a rim with a width corresponding to a bead width of the pneumatic tire. The “applicable rim” includes current sizes as well as sizes that will be included in the future in the above industrial standards. Examples of “sizes described in the future” may include sizes described in “FUTURE DEVELOPMENTS” in the 2013 edition of the STANDARDS MANUAL of ETRTO.", "", "In the present specification, “prescribed internal pressure” refers to an air pressure (maximum air pressure) corresponding to the maximum load capability of a single wheel in an applicable size and ply rating as described in the JATMA YEAR BOOK or other industrial standards. In case of a size not described in the above industrial standard, the “prescribed internal pressure” refers to an air pressure (the maximum air pressure) corresponding to the maximum load capability prescribed for each vehicle on which the tire is installed. Furthermore, in the present specification, “prescribed load” refers to a load corresponding to the maximum load capability of a single wheel in an applicable size and ply rating as described in the above industrial standards. In case of a size not described in the above industrial standards, the “prescribed load” refers to a load corresponding to the maximum load capability prescribed for each vehicle on which the tire is installed."], "claims": ["a carcass comprising a carcass body portion that extends toroidally between a pair of bead cores and a carcass foldback portion that extends from the carcass body portion and folds back around a perimeter of the bead cores from a tire width direction inner side to a tire width direction outer side; and a communication device embedded on the tire width direction outer side of the carcass foldback portion, wherein, when in a standard state in which the tire is fitted to an applicable rim, a prescribed internal pressure is applied, and no load is applied, a cord extension direction of the carcass foldback portion is inclined with respect to a tire radial direction when viewed in a tire width direction.", "2 . The tire according to claim 1 , wherein a lengthways direction of the communication device is inclined with respect to the cord extension direction of the carcass foldback portion when viewed in the tire width direction in the standard state.", "the cord extension direction of the carcass body portion and the cord extension direction of the carcass foldback portion are reversed in inclination across the tire radial direction.", "4 . The tire according to claim 1 , wherein the cord extension direction of the carcass foldback portion is inclined in a range from 3 degrees to 10 degrees with respect to the tire radial direction when viewed in the tire width direction in the standard state.", "wherein, in the standard state, an end of the tire radial direction outer side of the carcass foldback portion is positioned further to the tire width direction outer side than an end of a tire width direction outer side of the belt.", "6 . The tire according to claim 5 , wherein, in the standard state, the end of the tire radial direction outer side of the carcass foldback portion is positioned near a position of a tire maximum width.", "wherein, in the standard state, an end of the tire radial direction outer side of the carcass foldback portion is positioned further to the tire width direction inner side than an end of a tire width direction outer side of the belt.", "the cord extension direction of the carcass body portion and the cord extension direction of the carcass foldback portion are reversed in inclination across the tire radial direction.", "9 . The tire according to claim 2 , wherein the cord extension direction of the carcass foldback portion is inclined in a range from 3 degrees to 10 degrees with respect to the tire radial direction when viewed in the tire width direction in the standard state.", "wherein, in the standard state, an end of the tire radial direction outer side of the carcass foldback portion is positioned further to the tire width direction outer side than an end of a tire width direction outer side of the belt.", "wherein, in the standard state, an end of the tire radial direction outer side of the carcass foldback portion is positioned further to the tire width direction inner side than an end of a tire width direction outer side of the belt.", "12 . The tire according to claim 3 , wherein the cord extension direction of the carcass foldback portion is inclined in a range from 3 degrees to 10 degrees with respect to the tire radial direction when viewed in the tire width direction in the standard state.", "wherein, in the standard state, an end of the tire radial direction outer side of the carcass foldback portion is positioned further to the tire width direction outer side than an end of a tire width direction outer side of the belt.", "wherein, in the standard state, an end of the tire radial direction outer side of the carcass foldback portion is positioned further to the tire width direction inner side than an end of a tire width direction outer side of the belt.", "wherein, in the standard state, an end of the tire radial direction outer side of the carcass foldback portion is positioned further to the tire width direction outer side than an end of a tire width direction outer side of the belt.", "wherein, in the standard state, an end of the tire radial direction outer side of the carcass foldback portion is positioned further to the tire width direction inner side than an end of a tire width direction outer side of the belt.", "17 . The tire according to claim 8 , wherein the cord extension direction of the carcass foldback portion is inclined in a range from 3 degrees to 10 degrees with respect to the tire radial direction when viewed in the tire width direction in the standard state.", "wherein, in the standard state, an end of the tire radial direction outer side of the carcass foldback portion is positioned further to the tire width direction outer side than an end of a tire width direction outer side of the belt.", "wherein, in the standard state, an end of the tire radial direction outer side of the carcass foldback portion is positioned further to the tire width direction inner side than an end of a tire width direction outer side of the belt.", "wherein, in the standard state, an end of the tire radial direction outer side of the carcass foldback portion is positioned further to the tire width direction outer side than an end of a tire width direction outer side of the belt."], "bibtex": "@patent{20240246363,\n    title = {TIRE},\n    number = {20240246363},\n    year = {2024},\n    note = {File: US20240246363A1-20240725.XML}\n    }", "classification": "B60C907FI"}, {"title": "TIRE, RETREADED TIRE, AND RETREADED TIRE PRODUCTION METHOD", "doc_number": "20240246364", "filename": "US20240246364A1-20240725.XML", "abstract": "A tire comprises: a belt composed of one or more belt layers; a main groove on a tread surface; and a communication device embedded at a position that is inward in a tire radial direction from a groove bottom of the main groove, outward in the tire radial direction from an inner surface of an innermost belt layer in the belt, and outward in a tire width direction from a minimum width belt layer in the belt, wherein a tire radial outer side of the communication device is not covered with the belt.", "detailed_description": ["An embodiment of a tire according to the present disclosure will be described below with reference to the drawings. Common members and parts in the drawings are given the same reference signs. The drawings are schematic and the ratios of dimensions and the like may differ from the actual ones.", "", "In this specification, a “tire” may be a tire that has never been retreaded or a tire that has been retreaded one or more times. In this specification, a tire that has been retreaded one or more times is also referred to as “retreaded tire” to distinguish it from a tire that has never been retreaded.", "", "In this specification, the “tire width direction” denotes a direction parallel to the rotation axis of the tire, the “tire radial direction” denotes a direction orthogonal to the rotation axis of the tire, and the “tire circumferential direction” denotes a direction in which the tire rotates around the rotation axis of the tire.", "", "In this specification, the “tire radial inner side” denotes the side closer to the rotation axis of the tire in the tire radial direction, and the “tire radial outer side” denotes the side farther from the rotation axis of the tire in the tire radial direction. Moreover, the “tire widthwise inner side” denotes the side closer to the tire equatorial plane CL in the tire width direction, and the “tire widthwise outer side” denotes the side farther from the tire equatorial plane CL in the tire width direction.", "", "In this specification, the positional relationship between the elements of the tire is measured in a reference state, unless otherwise specified. The “reference state” is a state in which the tire is attached to a rim of a wheel, which is an applicable rim, filled to a prescribed internal pressure, and placed under no load.", "", "The contact patch that contacts the road surface in a state in which the tire is attached to a rim of a wheel, which is an applicable rim, filled to a prescribed internal pressure, and placed under a prescribed load is referred to as a tread surface T. Both ends in the tire width direction of the contact patch that contacts the road surface in a state in which the tire is attached to a rim of a wheel, which is an applicable rim, filled to a prescribed internal pressure, and placed under a prescribed load are referred to as tread edges TE. In the following description, it is assumed that the tire has its inner cavity filled with air and is mounted on a vehicle such as a truck or a bus. However, the inner cavity of the tire may be filled with a fluid other than air, and the tire may be mounted on a vehicle other than a truck or a bus.", "", "In this specification, the “applicable rim” is an approved rim (“measuring rim” in ETRTO (European Tyre and Rim Technical Organization) Standards Manual, “design rim” in TRA (Tire and Rim Association, Inc.) Year Book) in applicable size that is described or will be described in the future in an effective industrial standard in areas where tires are produced and used, such as JATMA (Japan Automobile Tyre Manufacturers Association) Year Book in Japan, ETRTO Standards Manual in Europe, or TRA Year Book in the United States. In the case of a size not described in the industrial standard, the “applicable rim” denotes a rim whose width corresponds to the bead width of the tire. The “applicable rim” includes not only current size but also a size that may be included in the industrial standard in the future. An example of the “size that will be described in the future” is the size described as “future developments” in ETRTO Standards Manual 2013.", "", "In this specification, the “prescribed internal pressure” denotes the air pressure (maximum air pressure) corresponding to the maximum load capability of a single wheel in applicable size and ply rating described in the industrial standard such as JATMA Year Book. In the case of a size not described in the industrial standard, the “prescribed internal pressure” denotes the air pressure (maximum air pressure) corresponding to the maximum load capability defined for each vehicle on which the tire is mounted. In this specification, the “prescribed load” denotes the load corresponding to the maximum load capability of a single wheel in applicable size and ply rating described in the industrial standard. In the case of a size not described in the industrial standard, the “prescribed load” denotes the load corresponding to the maximum load capability defined for each vehicle on which the tire is mounted.", "", "A tire1according to an embodiment of the present disclosure will be described below with reference to the drawings.", "", "FIG.1is a cross-sectional view of the tire1according to an embodiment of the present disclosure, taken along the tire width direction.FIG.1illustrates the tire1in the reference state in which the tire1is attached to a rim R of a wheel, which is the applicable rim, filled to the prescribed internal pressure, and placed under no load.", "", "The tire1includes a pair of bead portions2, a pair of sidewall portions3, and a tread portion4. Each sidewall portion3extends between the tread portion4and the corresponding bead portion2. A communication device11is embedded in the tire1, which will be described in detail later.", "", "Although this embodiment describes the case where the tire1is symmetrical with respect to the tire equatorial plane CL except for the communication device11embedded in the tire1and a rubber member12in which the communication device11is embedded, the tire1may be asymmetrical with respect to the tire equatorial plane CL.", "", "The tire1includes a pair of bead cores5located in the bead portions2, a carcass6composed of one or more plies toroidally extending between the pair of bead cores5, and a belt7composed of one or more belt layers located on the tire radial outer side of the crown region of the carcass6.", "", "Each bead core5is composed of an annular cable bead extending in the tire circumferential direction. In this embodiment, the cross-sectional shape of the bead core5in a plane orthogonal to its extending direction (cross-sectional shape in the tire width direction) is hexagonal or approximately hexagonal. The cross-sectional shape of the bead core5in the tire width direction may be, however, any shape such as a circle or a quadrangle. The cable bead is formed by coating a high carbon steel wire with rubber, for example. A bead filler8made of a rubber material or the like is provided on the tire radial outer side of the bead core5.", "", "The carcass6is composed of one or more plies (one ply in this embodiment) toroidally extending between the pair of bead cores5. The ply is formed by coating an organic fiber cord such as a nylon cord with rubber, for example. The ends of the carcass6are locked by the bead cores5. Specifically, the carcass6includes a carcass body portion6A located between the bead cores5, and carcass folded portions6B each folded back from inside to outside in the tire width direction around the corresponding bead core5. The carcass folded portion6B may have any length. The carcass6may have a structure in which the carcass folded portion6B is folded back from outside to inside in the tire width direction around the bead core5or a structure in which the carcass folded portion6B is wound around the bead core5, or may include no carcass folded portion6B.", "", "The belt7is located on the tire radial outer side of the crown region of the carcass6. The belt7is composed of one or more belt layers laminated in the tire radial direction in the tire equatorial plane CL.", "", "In this embodiment, the belt7is composed of four belt layers7A to7D. More specifically, the four belt layers7A to7D are arranged in this order from the tire radial outer side. A belt under-cushion rubber9is located on the widthwise outer side of the belt layer7D.", "", "In this specification, the belt layer located outermost in the tire radial direction is referred to as “outermost belt layer”. The belt layer7A is the outermost belt layer in this embodiment. The belt layer located innermost in the tire radial direction is referred to as “innermost belt layer”. The belt layer7D is the innermost belt layer in this embodiment. The belt layer longest in the tire width direction is referred to as “maximum width belt layer”. The belt layer7C is the maximum width belt layer in this embodiment. The belt layer shortest in the tire width direction is referred to as “minimum width belt layer”. The belt layer7A is the minimum width belt layer in this embodiment. One belt layer may correspond to two or more of the outermost belt layer, the innermost belt layer, the maximum width belt layer, and the minimum width belt layer. For example, in the case where the belt7is composed of one belt layer, the one belt layer constituting the belt7corresponds to all of the outermost belt layer, the innermost belt layer, the maximum width belt layer, and the minimum width belt layer.", "", "The belt7may be made of a material that does not interfere with wireless communication of the communication device11. In this embodiment, the belt7is a non-metal belt. Specifically, the belt cords included in each of the belt layers7A to7D constituting the belt7are made of a non-metal material. The non-metal material may be, for example, a material such as glass or plastic. A decrease in the communicability of the communication device11caused by embedding the communication device11near the belt7can thus be prevented. Hence, the communication device11can be embedded in a part with little distortion near the belt7. Alternatively, the belt7may be a metal belt including, for example, a steel cord.", "", "At least one main groove is provided on the tread surface T of the tread portion4. In this specification, the main groove is a groove whose groove bottom is located innermost in the tire radial direction out of the one or more grooves provided on the tread surface T. In this embodiment, four circumferential main grooves10extending in the tire circumferential direction are provided on the tread surface T as main grooves. The number of main grooves may be, however, any number. Moreover, the main grooves are not limited to circumferential grooves.", "", "The tire1is provided with the communication device11.", "", "The communication device11performs wireless communication. For example, the communication device11is a radio frequency (RF) tag. The RF tag is also referred to as a radio frequency identification (RFID) tag. The communication device11includes an integrated circuit (IC) chip including a controller and a storage, and one or more antennas connected to the IC chip. The IC chip may store any information about the tire1, such as the identification information and manufacturing date of the tire1or the number of times the tire1has been retreaded. For example, the communication device11may have a long shape as a whole, with two linearly, wavily, or spirally extending antennas extending in opposite directions from the IC chip. The communication device11may be embedded in the tire1so that the longitudinal direction of the communication device11will be approximately parallel to the circumferential direction of the tire1. Each antenna, however, may have any shape and may be located within the IC chip.", "", "The IC chip may be operated by induced electromotive force generated by electromagnetic waves received by the one or more antennas. That is, the communication device11may be a passive type communication device. Alternatively, the communication device11may further include a battery and be capable of communication by generating electromagnetic waves using its own power. That is, the communication device11may be an active type communication device.", "", "The communication device11is embedded at a position that is inward in the tire radial direction from the groove bottom of the circumferential main groove10and outward in the tire radial direction from the inner surface of the innermost belt layer7D in the belt7. In this specification, the “inner surface” of each of the belt layers7A to7D denotes the surface of the belt layer on the tire radial inner side. Accordingly, when the tire1is retreaded, the communication device11is not cut off and remains in the base tire1A as illustrated inFIG.2, so that the communication device11can be continuously used.FIG.2is a cross-sectional view in the tire width direction of the tire1illustrated inFIG.1in a state in which the base tire1A and the tread member1B are separated during retreading.", "", "Moreover, the communication device11is embedded at a position that is outward in the tire width direction from the minimum width belt layer7A in the belt7. Thus, when the communication device11communicates with an electronic device installed outward in the tire width direction from the communication device11, the belt7is less likely to interfere with the communication of the communication device11.", "", "For example, the communication device11may store “the number of times the tire1has been retreaded”. By updating “the number of times the tire1has been retreaded” stored in the communication device11through wireless communication when the tire1is retreaded, the communication device11can continue to store “the number of times the tire1has been retreaded”. Furthermore, embedding the communication device11near the surface S of the base tire1A on the tire radial outer side, which is exposed during retreading of the tire1, allows the communication device11to be easily extracted from the base tire1A during retreading of the tire1. This improves the maintainability of the communication device11in the event of failure of the communication device11.", "", "Referring again toFIG.1, the tire radial outer side of the communication device11is not covered with the belt7. Thus, when the communication device11communicates with an electronic device installed outward in the tire radial direction from the communication device11, the belt7is less likely to interfere with the communication of the communication device11. Moreover, the belt7is less likely to hinder embedding the communication device in the base tire1A or extracting the communication device from the base tire1A during retreading of the tire1. Alternatively, the tire radial outer side of the communication device11may be covered with at least one of the belt layers7A to7D in the belt7. Thus, the communication device11is less likely to be damaged even in the case where a foreign object such as a nail gets stuck in the tire1when the vehicle is running.", "", "In this embodiment, the communication device11may be embedded at a position that is outward in the tire radial direction from the inner surface of the maximum width belt layer7C in the belt7. Thus, the belt7is less likely to hinder embedding the communication device11in the base tire1A or extracting the communication device11from the base tire1A during retreading of the tire1.", "", "The communication device11may be embedded at a position that is inward in the tire radial direction from the outer surface of the outermost belt layer7A in the belt7. In this specification, the “outer surface” of each of the belt layers7A to7D denotes the surface of the belt layer on the tire radial outer side. Hence, when the tread member1B is removed from the tire1by a polishing device during retreading of the tire1, the outermost belt layer7A located outward in the tire radial direction from the communication device11can prevent the polishing device from reaching the communication device11. The communication device11is therefore less likely to be damaged.", "", "The communication device11may be embedded at a position that is outward in the tire width direction from the maximum width belt layer7C in the belt7. Thus, when the communication device11communicates with an electronic device installed outward in the tire width direction from the communication device11, the belt7is less likely to interfere with the communication of the communication device11. The communicability of the communication device11in both the tire radial direction and the tire width direction can therefore be achieved.", "", "The communication device11may be embedded at a position that is outward in the tire width direction from the tread edge TE. As a result of the communication device11being located at such a position that is away from the tread surface T which contacts the road surface and therefore is highly likely to have a foreign object such as a nail stuck therein, the probability of damage of the communication device11can be reduced.", "", "A production method for the retreaded tire1according to an embodiment of the present disclosure will be described below, with reference toFIGS.2,3, and4.FIG.3is a flowchart illustrating a production method for the retreaded tire1according to an embodiment of the present disclosure.FIG.4is a schematic view of the rubber member12in which the communication device11is embedded. In the following description of the production method, it is assumed that, when retreading the tire1in which the communication device11is embedded in advance, the communication device11is extracted from the tire1, a new communication device11is embedded, and a retreaded tire1in which the new communication device11is embedded is produced. However, the production method may be used to, when retreading the tire1in which the communication device11is not embedded, embed the communication device11and produce a retreaded tire1in which the communication device11is embedded. Alternatively, the production method may be used to retread the tire1in which the communication device11is embedded while leaving the communication device11in the tire1and produce a retreaded tire1in which the communication device11is embedded.", "", "Step S101: From the tire1including the belt7composed of one or more belt layers7A to7D, a tire radial outer part is removed from a position that is outward in the tire radial direction from the outer surface of the outermost belt layer7A in the belt7to produce the base tire1A.", "", "Specifically, the tread rubber is polished (buffed) from the tire radial outer side to a predetermined position in the tire1using a polishing device to produce the base tire1A. The communication device11is embedded in the tire1at a position that is inward in the tire radial direction from the predetermined position. The predetermined position is a position within the range that is inward in the tire radial direction from the groove bottom of the circumferential main groove10provided on the tread surface T of the tread portion4and is outward in the tire radial direction from the outer surface of the outermost belt layer7A in the belt7.", "", "Step S102: The communication device11is extracted from the base tire1A.", "", "Specifically, the communication device11embedded in the base tire1A is extracted from the surface S of the base tire1A on the tire radial outer side using an extraction device. In this embodiment, the communication device11is extracted together with the rubber located around the communication device11. Alternatively, only the communication device11may be extracted. The extracted communication device11is repaired or replaced with a new communication device11. In the case where the communication device11is operating normally, steps S102and S103may be omitted.", "", "Step S103: The communication device11is installed in the base tire1A at a position that is outward in the tire radial direction from the inner surface of the innermost belt layer7D in the belt7and outward in the tire width direction from the minimum width belt layer7A in the belt7so that the tire radial outer side of the communication device11will not be covered with the belt7.", "", "In this embodiment, the communication device11is embedded in part of the annular rubber member12extending in the tire circumferential direction, as illustrated inFIG.4. The rubber member12in which the communication device11is embedded is wound around the base tire1A from the tire radial outer side of the base tire1A using an attachment device. Here, the rubber member12may be placed in the part of the surface S of the base tire1A on the tire radial outer side where rubber has been removed when extracting the communication device11from the base tire1A. Preparing the rubber member12in which the communication device11is embedded in advance in this way enables stable placement of the communication device11in the base tire1A, with it being possible to improve the productivity of the retreaded tire1. The rubber member12may be band-shaped instead of annular. The communication device11not embedded in the rubber member12may be installed in the base tire1A.", "", "The rubber material forming the rubber member12may be the same rubber material as the rubber material located around the rubber member12in the base tire1A. This facilitates adhesion between the base tire1A and the rubber member12during vulcanization. Alternatively, the rubber material forming the rubber member12may be a highly conductive rubber material lower in carbon content than the rubber material located around the rubber member12in the base tire1A. In this way, the communicability of the communication device11embedded in the retreaded tire1can be improved.", "", "Step S104: The tread member1B is adhered to the base tire1A from the tire radial outer side of the base tire1A.", "", "In this embodiment, the tread member1B is vulcanized before being adhered to the base tire1A in order to ease the adhesion to the base tire1A. This production method is a pre-cure production method (pre-curing). Alternatively, the tread member1B may be unvulcanized. That is, the production method may be a remold production method. An adhesive rubber is placed on the surface S of the base tire1A on the tire radial outer side and the tread member1B is attached using an attachment device.", "", "After this, the base tire1A to which the tread member1B is attached via the adhesive rubber is vulcanized using a vulcanizing device (for example, a vulcanizing can) to adhere the tread member1B to the base tire1A.", "", "With this production method, the retreaded tire1in which the communication device11is embedded can be obtained. More specifically, with this production method, it is possible to obtain the retreaded tire1including: the base tire1A that includes the belt7composed of one or more belt layers7A to7D and is obtained as a result of removing a tire radial outer part from a position that is outward in the tire radial direction from the outer surface of the outermost belt layer7A in the belt7; the communication device11embedded in the base tire1A at a position that is outward in the tire radial direction from the inner surface of the innermost belt layer7D in the belt7and outward in the tire width direction from the minimum width belt layer7A in the belt7; and the tread member1B adhered to the tire radial outer side of the base tire1A. In the retreaded tire1, the tire radial outer side of the communication device11is not covered with the belt7.", "", "As described above, the tire1according to an embodiment of the present disclosure comprises: the belt7composed of one or more belt layers7A to7D; a main groove (circumferential main groove10) on the tread surface T; and the communication device11embedded at a position that is inward in the tire radial direction from the groove bottom of the main groove (circumferential main groove10), outward in the tire radial direction from the inner surface of the innermost belt layer7D in the belt7, and outward in the tire width direction from the minimum width belt layer7A in the belt7, wherein the tire radial outer side of the communication device11is not covered with the belt7. With this structure, when the tire1is retreaded, the communication device11is not cut off, so that the communication device11can be continuously used. Moreover, when the tire1is retreaded, the belt7is less likely to hinder embedding the communication device11in the tire1or extracting the communication device11from the tire1. Furthermore, embedding the communication device11near the surface S of the base tire1A on the tire radial outer side, which is exposed during retreading of the tire1, improves the maintainability of the communication device11. The usefulness of the tire1is thus improved.", "", "In the tire1according to an embodiment of the present disclosure, preferably, the communication device11is embedded at a position that is outward in the tire radial direction from the inner surface of the maximum width belt layer7C in the belt7. With this structure, the belt7is less likely to hinder embedding the communication device11in the tire1or extracting the communication device11from the tire1during retreading of the tire1.", "", "In the tire1according to an embodiment of the present disclosure, preferably, the communication device11is embedded at a position that is inward in the tire radial direction from the outer surface of the outermost belt layer7A in the belt7. With this structure, the communication device11is less likely to be damaged during retreading of the tire1.", "", "In the tire1according to an embodiment of the present disclosure, preferably, the communication device11is embedded at a position that is outward in the tire width direction from the maximum width belt layer7C in the belt7. With this structure, the communicability of the communication device11in both the tire radial direction and the tire width direction can be achieved.", "", "In the tire1according to an embodiment of the present disclosure, preferably, the belt7is a non-metal belt. With this structure, a decrease in the communicability of the communication device11caused by embedding the communication device11near the belt7can be prevented.", "", "The retreaded tire1according to an embodiment of the present disclosure comprises: the base tire1A that includes the belt7composed of one or more belt layers7A to7D and is obtained as a result of removing a tire radial outer part from a position that is outward in the tire radial direction from the outer surface of the outermost belt layer7A in the belt7; the communication device11embedded in the base tire1A at a position that is outward in the tire radial direction from the inner surface of the innermost belt layer7D in the belt7and outward in the tire width direction from the minimum width belt layer7A in the belt7; and the tread member1B adhered to the tire radial outer side of the base tire1A, wherein the tire radial outer side of the communication device11is not covered with the belt7. With this structure, when the retreaded tire1is retreaded again, the communication device11is not cut off, so that the communication device11can be continuously used. Moreover, when the retreaded tire1is retreaded again, the belt7is less likely to hinder embedding the communication device11in the retreaded tire1or extracting the communication device11from the retreaded tire1. Furthermore, embedding the communication device11near the surface S of the base tire1A on the tire radial outer side, which is exposed when the retreaded tire1is retreaded again, improves the maintainability of the communication device11. The usefulness of the retreaded tire1is thus improved.", "", "In the retreaded tire1according to an embodiment of the present disclosure, preferably, the communication device11is embedded in part of the annular rubber member12extending in the tire circumferential direction. With this structure, the communication device11can be stably placed in the base tire1A during the production of the retreaded tire1, with it being possible to improve the productivity of the retreaded tire1.", "", "The production method for the retreaded tire1according to an embodiment of the present disclosure is a retreaded tire production method of obtaining the retreaded tire1in which the communication device11is embedded, the retreaded tire production method comprising: removing, from the tire1including the belt7composed of one or more belt layers7A to7D, a tire radial outer part from a position that is outward in the tire radial direction from the outer surface of the outermost belt layer7A in the belt7to produce the base tire1A; installing the communication device11in the base tire1A at a position that is outward in the tire radial direction from the inner surface of the innermost belt layer7D in the belt7and outward in the tire width direction from the minimum width belt layer7A in the belt7so that the tire radial outer side of the communication device11will not be covered with the belt7; and adhering the tread member1B to the base tire1A from the tire radial outer side of the base tire1A. With this structure, when the retreaded tire1is retreaded again, the communication device11is not cut off, so that the retreaded tire1in which the communication device11can be continuously used can be produced. Moreover, when the retreaded tire1is retreaded again, the belt7is less likely to hinder embedding the communication device11in the retreaded tire1or extracting the communication device11from the retreaded tire1. Furthermore, embedding the communication device11near the surface S of the base tire1A on the tire radial outer side, which is exposed when the retreaded tire1is retreaded again, improves the maintainability of the communication device11. The usefulness of the retreaded tire1is thus improved.", "", "In the production method for the retreaded tire1according to an embodiment of the present disclosure, preferably, the communication device11is embedded in part of the annular rubber member12, and the installing of the communication device11includes winding the rubber member12around the base tire1A from the tire radial outer side of the base tire1A. With this structure, the communication device11can be stably placed in the base tire1A during the production of the retreaded tire1, with it being possible to improve the productivity of the retreaded tire1.", "", "While the presently disclosed techniques have been described above by way of embodiments and drawings, various changes and modifications can be made by those of ordinary skill in the art based on the present disclosure. Such changes and modifications are therefore included in the scope of the present disclosure. For example, the structures, functions, etc. included in each embodiment may be rearranged without logical inconsistency. The structures, functions, etc. included in each embodiment may be used in combination with any other embodiment, and a plurality of structures, functions, etc. may be combined into one structure, function, etc., one structure, function, etc. may be divided into a plurality of structures, functions, etc., or part of the structures, functions, etc. may be omitted."], "claims": ["a belt composed of one or more belt layers; a main groove on a tread surface; and a communication device embedded at a position that is inward in a tire radial direction from a groove bottom of the main groove, outward in the tire radial direction from an inner surface of an innermost belt layer in the belt, and outward in a tire width direction from a minimum width belt layer in the belt, wherein a tire radial outer side of the communication device is not covered with the belt.", "2 . The tire according to claim 1 , wherein the communication device is embedded at a position that is outward in the tire radial direction from an inner surface of a maximum width belt layer in the belt.", "3 . The tire according to claim 1 , wherein the communication device is embedded at a position that is inward in the tire radial direction from an outer surface of an outermost belt layer in the belt.", "4 . The tire according to claim 1 , wherein the communication device is embedded at a position that is outward in the tire width direction from a maximum width belt layer in the belt.", "5 . The tire according to claim 1 , wherein the belt is a non-metal belt.", "a base tire that includes a belt composed of one or more belt layers and is obtained as a result of removing a tire radial outer part from a position that is outward in a tire radial direction from an outer surface of an outermost belt layer in the belt; a communication device embedded in the base tire at a position that is outward in the tire radial direction from an inner surface of an innermost belt layer in the belt and outward in a tire width direction from a minimum width belt layer in the belt; and a tread member adhered to a tire radial outer side of the base tire, wherein a tire radial outer side of the communication device is not covered with the belt.", "7 . The retreaded tire according to claim 6 , wherein the communication device is embedded in part of an annular rubber member extending in a tire circumferential direction.", "removing, from a tire including a belt composed of one or more belt layers, a tire radial outer part from a position that is outward in a tire radial direction from an outer surface of an outermost belt layer in the belt to produce a base tire; installing a communication device in the base tire at a position that is outward in the tire radial direction from an inner surface of an innermost belt layer in the belt and outward in a tire width direction from a minimum width belt layer in the belt so that a tire radial outer side of the communication device will not be covered with the belt; and adhering a tread member to the base tire from a tire radial outer side of the base tire.", "the installing of the communication device includes winding the rubber member around the base tire from the tire radial outer side of the base tire.", "10 . The tire according to claim 2 , wherein the communication device is embedded at a position that is inward in the tire radial direction from an outer surface of an outermost belt layer in the belt.", "11 . The tire according to claim 2 , wherein the communication device is embedded at a position that is outward in the tire width direction from a maximum width belt layer in the belt.", "12 . The tire according to claim 2 , wherein the belt is a non-metal belt.", "13 . The tire according to claim 3 , wherein the communication device is embedded at a position that is outward in the tire width direction from a maximum width belt layer in the belt.", "14 . The tire according to claim 3 , wherein the belt is a non-metal belt.", "15 . The tire according to claim 4 , wherein the belt is a non-metal belt.", "16 . The tire according to claim 10 , wherein the communication device is embedded at a position that is outward in the tire width direction from a maximum width belt layer in the belt.", "17 . The tire according to claim 10 , wherein the belt is a non-metal belt.", "18 . The tire according to claim 11 , wherein the belt is a non-metal belt.", "19 . The tire according to claim 13 , wherein the belt is a non-metal belt.", "20 . The tire according to claim 16 , wherein the belt is a non-metal belt."], "bibtex": "@patent{20240246364,\n    title = {TIRE, RETREADED TIRE, AND RETREADED TIRE PRODUCTION METHOD},\n    number = {20240246364},\n    year = {2024},\n    note = {File: US20240246364A1-20240725.XML}\n    }", "classification": "B60C1102FI"}, {"title": "MOTORCYCLE TIRE SET", "doc_number": "20240246365", "filename": "US20240246365A1-20240725.XML", "abstract": "A motorcycle tire set S includes a front wheel tire S 1 and a rear wheel tire S 2 each provided with a plurality of inclined grooves 3 . Each inclined groove 3 includes a first portion 11 extending in a crown region Cr, a second portion 12 extending in a shoulder region Sh, and a third portion 13 connecting the first portion 11 and the second portion 12 . Each third portion 13 includes a first groove edge 20 e located on a leading edge side in a tire rotation direction R, and a second groove edge 20 i located on a trailing edge side in the tire rotation direction R. The first groove edge 20 e of the front wheel tire S 1 is provided with a chamfered portion 10 , and the second groove edge 20 i of the rear wheel tire S 2 is provided with a chamfered portion 10.", "detailed_description": ["Hereinafter, one embodiment of the present invention will be described with reference to the drawings. The drawings contain exaggerated expressions and expressions that differ from the dimensional ratio of the actual structure in order to help the understanding of the present invention. In addition, when there are a plurality of embodiments, the same or common elements are denoted by the same reference characters throughout the description, and the redundant description thereof is omitted.", "", "FIG.1is a plan view in which a tread portion2of a front wheel tire S1of a motorcycle tire set (hereinafter, simply referred to as “tire set”) S according to the present embodiment is developed in a flat surface.FIG.2is a plan view in which a tread portion2of a rear wheel tire S2of the tire set S according to the present embodiment is developed in a flat surface. The tire set S is composed of the front wheel tire S1and the rear wheel tire S2. In the present specification, each of the tires S1and S2is sometimes referred to as tire1.", "", "In the present specification, unless otherwise specified, dimensions and the like of components of the tire1are values measured in a standardized state. The “standardized state” is a state where the tire1is fitted on a standardized rim (not shown) and inflated to a standardized internal pressure and no load is applied to the tire1.", "", "The “standardized rim” is a rim that is defined, in a standard system including a standard on which the tire1is based, by the standard for each tire, and is, for example, the “standard rim” in the JATMA standard, the “Design Rim” in the TRA standard, or the “Measuring Rim” in the ETRTO standard.", "", "The “standardized internal pressure” is an air pressure that is defined, in a standard system including a standard on which the tire1is based, by the standard for each tire, and is the “maximum air pressure” in the JATMA standard, the maximum value indicated in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, or the “INFLATION PRESSURE” in the ETRTO standard.", "", "As shown inFIG.1andFIG.2, each of the front wheel tire S1and the rear wheel tire S2includes a tread portion2having a designated tire rotation direction R. In the present embodiment, the tread portions2of the front wheel tire S1and the rear wheel tire S2come into contact with the ground from the upper side toward the lower side in the respective drawings based on the tire rotation direction R.", "", "Each of the tread portions2of the front wheel tire S1and the rear wheel tire S2has a plurality of inclined grooves3provided so as to be inclined with respect to the tire circumferential direction. Each of the plurality of inclined grooves3includes a first portion11extending in a crown region Cr, a second portion12extending in a shoulder region Sh, and a third portion13connecting the first portion11and the second portion12.", "", "The third portion13has a smaller groove width We (shown inFIG.3B) than the first portion11and the second portion12. Such a third portion13suppresses a decrease in the stiffness of a middle portion3cin the longitudinal direction of the inclined groove3in which relatively large deformation is likely to occur. The third portion13also suppresses slipping of the first portion11and the second portion12mainly in the tire circumferential direction during contact with the ground. Accordingly, occurrence of uneven wear is suppressed.", "", "The first portion11, the second portion12, and the third portion13are inclined in the same direction with respect to the tire circumferential direction. Such an inclined groove3reduces a change in tread stiffness to suppress occurrence of uneven wear and suppress deterioration of appearance due to uneven wear.", "", "FIG.3Ais an enlarged view of a third portion13inFIG.1, and is a plan view of a third portion13of the front wheel tire S1.FIG.3Bis a cross-sectional view taken along a line A-A inFIG.1.FIG.4Ais an enlarged view of a third portion13inFIG.2, and is a plan view of a third portion13of the rear wheel tire S2.FIG.4Bis a cross-sectional view taken along a line B-B inFIG.2. As shown inFIG.3andFIG.4, each third portion13includes a pair of groove edges20. The pair of groove edges20include a first groove edge20elocated on the leading edge side in the tire rotation direction R, and a second groove edge20ilocated on the trailing edge side in the tire rotation direction R. The first groove edge20eof the present embodiment is located on the outer side in the tire axial direction with respect to the second groove edge20i.", "", "In the tire set S, the front wheel tire S1is mainly affected by a braking force, so that wear is likely to occur at each groove edge on the trailing edge side in the tire rotation direction R. In addition, the rear wheel tire S2is mainly affected by a driving force, so that wear is likely to occur at each groove edge on the leading edge side in the tire rotation direction R. In the present invention, the first groove edge20eof the front wheel tire S1is provided with a chamfered portion10. In addition, the second groove edge20ion the trailing edge side of the rear wheel tire S2is provided with a chamfered portion10. Accordingly, even when more wear occurs at the second groove edge20iin the front wheel tire S1, the appearance of the first groove edge20ewhich is provided with the chamfered portion10and the appearance of the second groove edge20iat which the wear has occurred become similar to each other, so that the uneven wear of the third portion13is made less noticeable in appearance. Even when more wear occurs at the first groove edge20ein the rear wheel tire S2, the appearance of the second groove edge20iwhich is provided with the chamfered portion10and the appearance of the first groove edge20eat which the wear has occurred become similar to each other, so that the uneven wear of the third portion13is made less noticeable in appearance. Therefore, the tire set S according to the present invention makes uneven wear less noticeable and can have improved appearance.", "", "In the case where the first groove edge20eor the second groove edge20iis provided with a chamfered portion10, each groove edge20eor20iis specified by the point of intersection of a first virtual line v1and a second virtual line v2. The first virtual line v1is a line obtained by smoothly extending a groove wall13aof the third portion13to the outer side in the tire radial direction. The second virtual line v2is a line obtained by smoothly extending a tread surface2ato the groove width center line side. The groove width We of the third portion13is the shortest distance between the first groove edge20eand the second groove edge20i.", "", "In the front wheel tire S1and the rear wheel tire S2, a width Wd of the chamfered portion10is preferably not less than 40% and further preferably not less than 45% of the groove width We of the third portion13, and is preferably not greater than 90% and further preferably not greater than 85% of the groove width We of the third portion13. A length Dd in the tire radial direction of the chamfered portion10is preferably not less than 10% and further preferably not less than 15% of a groove depth Dc (shown inFIG.7) of the third portion13, and is preferably not greater than 35% and further preferably not greater than 30% of the groove depth Dc of the third portion13.", "", "As shown inFIG.1andFIG.2, in the present specification, the crown region Cr is a region that comes into contact with a flat surface when the tire1in the standardized state is brought into contact with the flat surface with the standardized load at a camber angle of 0 degrees. The length in the tire axial direction between both ends Ce in the tire axial direction of the crown region Cr is defined as a tread ground-contact width TW. In addition, each shoulder region Sh is a region between the crown region Cr and a tread end Te. Each shoulder region Sh is a region that comes into contact with the ground when a camber angle is given to the tire1.", "", "The tread ends Te correspond to both ends in the tire axial direction of the tread portion2, and are, for example, ends that can come into contact with the ground during cornering around a maximum camber angle. In the present specification, the distance in the tire axial direction between the tread ends Te when the tread portion2is developed in a flat surface is defined as a tread development width Tx. A tire equator C is the midpoint between the tread ends Te.", "", "The “standardized load” is a load that is defined, in a standard system including a standard on which the tire1is based, by the standard for each tire, and is the “maximum load capacity” in the JATMA standard, the maximum value indicated in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, or the “LOAD CAPACITY” in the ETRTO standard.", "", "In the tire1, the inclined grooves3include, for example, first inclined grooves3A arranged between the tire equator C and one tread end (right side in the drawing) Te, and second inclined grooves3B arranged between the tire equator C and the other tread end Te. In the present embodiment, the first inclined grooves3A and the second inclined grooves3B are alternately arranged in the tire circumferential direction. The first inclined grooves3A and the second inclined grooves3B have a line symmetrical shape with respect to the tire equator C, for example.", "", "Each inclined groove3extends without crossing the tire equator C. Such an inclined groove3serves to suppress a decrease in the tread stiffness on the tire equator C to which a large ground-contact pressure is applied, and to suppress occurrence of uneven wear. In order to suppress occurrence of uneven wear and maintain the basic performance of the tire1, a shortest distance Lm (shown inFIG.1) between the inclined groove3and the tire equator C is preferably not greater than 10% and further preferably not greater than 8% of the tread ground-contact width TW.", "", "FIG.5is a plan view of an inclined groove3of the rear wheel tire S2. As represented inFIG.5, in the rear wheel tire S2and the front wheel tire S1, the third portion13includes an inner end13iconnected to the first portion11and an outer end13econnected to the second portion12. In addition, the third portion13includes a first tapered portion13A having a groove width that decreases from the inner end13itoward the second portion12, and an equal width portion13B extending with a constant groove width. In the present embodiment, the third portion13also includes a second tapered portion13C having a groove width that decreases from the outer end13etoward the first portion11. The equal width portion13B includes not only a mode in which the groove width is uniform along the longitudinal direction but also a mode in which the difference between the maximum groove width and the minimum groove width is not greater than 2 mm. The difference between the maximum groove width and the minimum groove width of the equal width portion13B is preferably not greater than 1 mm. In addition, in the present embodiment, the inner end13iand the outer end13eare ends located on the second groove edge20i.", "", "A shortest distance Ls along a tread surface2abetween the inner end13iand the tire equator C is preferably not less than 30% and further preferably not less than 35% of the tread ground-contact width TW (shown inFIG.1), and is preferably not greater than 55% and further preferably not greater than 50% of the tread ground-contact width TW (shown inFIG.1). Since the shortest distance Ls is not less than 30% of the tread ground-contact width TW, the first portion11can be positioned on the tire equator C side on which it is difficult to drain water, and drainage performance can be maintained at a high level. Since the shortest distance Ls is not greater than 55% of the tread ground-contact width TW, the inner end13ican be located away from the outer side of the ground-contact width where slipping is likely to occur due to the difference in tread outer diameter, so that occurrence of uneven wear can be suppressed.", "", "A length Lt in the tire axial direction of the third portion13is preferably not less than 5% of the tread development width Tx (shown inFIG.1). Such a third portion13keeps the tread stiffness of the shoulder region Sh at a high level and exhibits excellent uneven wear resistance. In consideration of suppressing a decrease in the basic performance of the tire1, the length Lt of the third portion13is further preferably not less than 10% of the tread development width Tx, and is preferably not greater than 23% and further preferably not greater than 20% of the tread development width Tx.", "", "As for the groove width, the third portion13is preferably not greater than 55% and further preferably not greater than 45% of the first portion11and the second portion12. Since the groove width We of the third portion13is not greater than 55% of a groove width Wa of the first portion11and a groove width Wb of the second portion12, the tread stiffness can be increased. If, as for the groove width, the third portion13is excessively smaller than the first portion11and the second portion12, drainage performance may deteriorate. Therefore, the groove width We of the third portion13is preferably not less than 15% and further preferably not less than 20% of the groove width Wa of the first portion11and the groove width Wb of the second portion12. The groove width We of the third portion13is preferably, for example, 1.2 to 3.5 mm. The groove width Wa of the first portion11, the groove width Wb of the second portion12, and the groove width We of the third portion13are each a groove width at the midpoint in the longitudinal direction.", "", "A groove volume V3per unit area (not shown) on the tread surface2aof the third portion13is preferably not less than 70% and further preferably not less than 75% of a groove volume V1per unit area on the tread surface2aof the first portion11and a groove volume V2per unit area on the tread surface2aof the second portion12. Accordingly, smooth passage of water between the first portion11and the second portion12is maintained. In consideration of the viewpoint of maintaining the stiffness in the vicinity of the third portion13at a high level, the groove volume V3of the third portion13is preferably not greater than 120% and further preferably not greater than 115% of the groove volume V1of the first portion11and the groove volume V2of the second portion12. Each groove volume (V1, V2and V3) per unit area is a value obtained by dividing the groove volume of each portion by the area (surface area) of each portion on the tread surface2a.", "", "FIG.6is a plan view (tread plan view) of the inclined groove3of the rear wheel tire S2. As represented inFIG.6, in the front wheel tire S1and the rear wheel tire S2, the first groove edge20eincludes a first equal width edge portion21eforming the equal width portion13B. In addition, the second groove edge20iincludes a second equal width edge portion21iforming the equal width portion13B. Furthermore, the first portion11includes a first leading groove edge18elocated on the leading edge side in the tire rotation direction R, and a first trailing groove edge18ilocated on the trailing edge side in the tire rotation direction R with respect to the first leading groove edge18e. In addition, the second portion12includes a second leading groove edge19elocated on the leading edge side in the tire rotation direction R, and a second trailing groove edge19ilocated on the trailing edge side in the tire rotation direction R with respect to the second leading groove edge19e.", "", "The chamfered portion10includes an outer edge10aon the tread surface2aside. In the present embodiment, the outer edge10ais smoothly connected to the first trailing groove edge18i. In addition, the outer edge10ais smoothly connected to the second trailing groove edge19i, for example. As shown inFIG.1, in the front wheel tire S1, the outer edge10aof the chamfered portion10is smoothly connected to the first leading groove edge18eand the second leading groove edge19e.", "", "As shown inFIG.6, in the front wheel tire S1and the rear wheel tire S2, the third portion13extends in a straight manner in the present embodiment. Such a third portion13has low drainage resistance and serves to maintain drainage performance at a high level. In the present specification, the “straight manner” includes not only a mode in which the first equal width edge portion21eand the second equal width edge portion21iare formed only by straight lines, but also a mode in which, for example, the edge portions21eand21iare each formed by an arc having a radius of curvature r exceeding 200 mm. The third portion13may, for example, extend in a curved manner in which the edge portions21eand21iare each formed by an arc having a radius of curvature r of 20 to 200 mm.", "", "In the present embodiment, the third portion13extends in the crown region Cr and the shoulder region Sh. A midpoint13sof the third portion13is located in the shoulder region Sh. The shoulder region Sh is a region that has a smaller tire circumferential length than the crown region Cr and in which slipping is likely to occur. Therefore, slipping in the shoulder region Sh is suppressed, and the difference in the amount of wear between the shoulder region Sh and the crown region Cr becomes smaller, so that occurrence of uneven wear is suppressed.", "", "An angle θ1of the inclined groove3with respect to the tire circumferential direction is preferably not less than 5 degrees and further preferably not less than 7 degrees, and is preferably not greater than 15 degrees and further preferably not greater than 13 degrees. The angle θ1of the inclined groove3is specified by a virtual line va connecting both ends e1and e2in the tire circumferential direction of the inclined groove3.", "", "FIG.7is a cross-sectional view taken along a line D-D inFIG.2. As shown inFIG.7, as for the groove depth, the third portion13is preferably not less than 70% and further preferably not less than 75% of the first portion11and the second portion12, and is preferably not greater than 120% and further preferably not greater than 115% of the first portion11and the second portion12. Since the groove depth Dc of the third portion13is not less than 70% and not greater than 120% of a groove depth Da of the first portion11and a groove depth db of the second portion12, a change in the stiffness in the vicinity of the first portion11, the second portion12, and the third portion13can be reduced. Therefore, occurrence of uneven wear is suppressed, and appearance is improved. The groove depth Da of the first portion11and the groove depth db of the second portion12are preferably, for example, 3.5 to 9.5 mm. Such a groove depth of the inclined groove3is applied to each of the front wheel tire S1and the rear wheel tire S2.", "", "As shown inFIG.1andFIG.2, each of the tread portions2of the front wheel tire S1and the rear wheel tire S2is provided with first sub-inclined grooves4and second sub-inclined grooves5in the present embodiment. The first sub-inclined grooves4are, for example, located on the outer side in the tire axial direction with respect to the inclined grooves3. The second sub-inclined grooves5are, for example, located on the outer side in the tire axial direction with respect to the first sub-inclined grooves4. Each of the first sub-inclined grooves4and the second sub-inclined grooves5is not provided with a chamfered portion10.", "", "FIG.8is a plan view of a tread portion2of a front wheel tire S1according to another embodiment.FIG.9is a plan view of a tread portion2of a rear wheel tire S2according to the other embodiment. As shown inFIG.8, in this embodiment, each of the first groove edge20eand the second groove edge20iof the front wheel tire S1is provided with a chamfered portion10. As shown inFIG.9, in this embodiment, each of the first groove edge20eand the second groove edge20iof the rear wheel tire S2is provided with a chamfered portion10. In such an embodiment as well, appearance can be improved.", "", "FIG.10is a plan view of a tread portion2of a front wheel tire S1according to still another embodiment. In this embodiment as well, in the front wheel tire S1, the first groove edge20eis provided with a chamfered portion10. In this embodiment, the second groove edge20iis not provided with a chamfered portion10. The second groove edge20imay be provided with a chamfered portion10(not shown).", "", "FIG.11is a plan view of a tread portion2of a rear wheel tire S2according to still another embodiment. In this embodiment as well, in the rear wheel tire S2, the second groove edge20iis provided with a chamfered portion10. In addition, in this embodiment, the first groove edge20eis not provided with a chamfered portion10. The first groove edge20emay be provided with a chamfered portion10(not shown).", "", "Although the motorcycle tire set according to the embodiments of the present invention has been described in detail above, the present invention is not limited to the above specific embodiments, and various modifications can be made to implement the present invention."], "claims": ["each of the front wheel tire and the rear wheel tire includes a tread portion having a designated tire rotation direction, each of the tread portions of the front wheel tire and the rear wheel tire has a plurality of inclined grooves provided so as to be inclined with respect to a tire circumferential direction, each of the plurality of inclined grooves includes a first portion extending in a crown region, a second portion extending in a shoulder region, and a third portion connecting the first portion and the second portion, the third portion has a smaller groove width than the first portion and the second portion, the first portion, the second portion, and the third portion are inclined in the same direction with respect to the tire circumferential direction, the third portion includes a pair of groove edges, the pair of groove edges include a first groove edge located on a leading edge side in the tire rotation direction, and a second groove edge located on a trailing edge side in the tire rotation direction, the first groove edge of the front wheel tire is provided with a chamfered portion, and the second groove edge of the rear wheel tire is provided with a chamfered portion.", "2 . The motorcycle tire set according to claim 1 , wherein the second groove edge of the front wheel tire is provided with a chamfered portion.", "3 . The motorcycle tire set according to claim 1 , wherein the first groove edge of the rear wheel tire is provided with a chamfered portion.", "the third portion includes an inner end connected to the first portion, and a shortest distance along a tread surface between the inner end and a tire equator is 30% to 55% of a tread ground-contact width.", "5 . The motorcycle tire set according to claim 1 , wherein, in a tread plan view in which the tread portion is developed in a flat surface, the third portion extends in a straight manner.", "6 . The motorcycle tire set according to claim 1 , wherein, in a tread plan view in which the tread portion is developed in a flat surface, the third portion extends in a curved manner.", "7 . The motorcycle tire set according to claim 1 , wherein, as for a groove depth, the third portion is 70% to 120% of the first portion and the second portion.", "8 . The motorcycle tire set according to claim 1 , wherein, as for a groove width, the third portion is not greater than 60% of the first portion and the second portion.", "9 . The motorcycle tire set according to claim 1 , wherein a length in a tire axial direction of the third portion is not less than 5% of a tread development width.", "10 . The motorcycle tire set according to claim 1 , wherein a groove volume per unit area on a tread surface of the third portion is not less than 70% of a groove volume per unit area on the tread surface of the first portion and a groove volume per unit area on the tread surface of the second portion.", "a width of the chamfered portion in the rear wheel tire is not less than 40% and not greater than 90% of a groove width of the third portion.", "a length of the chamfered portion in the rear wheel tire is not less than 10% and not greater than 35% of a groove depth of the third portion.", "the plurality of first inclined grooves and the plurality of second inclined grooves have a line symmetrical shape with respect to the tire equator.", "14 . The motorcycle tire set according to claim 1 , wherein each of the plurality of inclined grooves extends without crossing a tire equator.", "15 . The motorcycle tire set according to claim 1 , wherein a shortest distance between each of the plurality of inclined grooves and a tire equator is less than 10% of a tread ground-contact width.", "16 . The motorcycle tire set according to claim 1 , wherein the third portion extends in the crown region and the shoulder region, and a midpoint of the third portion is located in the shoulder region.", "17 . The motorcycle tire set according to claim 1 , wherein a virtual line is formed by connecting a first end and a second end of one of the plurality of inclined grooves in the tire circumferential direction, and an angle of the one of the plurality of inclined grooves with respect to the tire circumferential direction is not less than 5 degrees.", "an inner end connected to the first portion and an outer end connected to the second portion, a first tapered portion having a groove width that decreases from the inner end of the third portion as the first tapered portion extends towards the second portion, an equal width portion extending at a constant groove width, and a second tapered portion having a groove width that decreases from the outer end towards the first portion.", "19 . The motorcycle tire set according to claim 18 , wherein a maximum groove width and a minimum groove width of the equal width portion is less than 1 mm."], "bibtex": "@patent{20240246365,\n    title = {MOTORCYCLE TIRE SET},\n    number = {20240246365},\n    year = {2024},\n    note = {File: US20240246365A1-20240725.XML}\n    }", "classification": "B60C1103FI"}, {"title": "MOTORCYCLE TIRE SET", "doc_number": "20240246366", "filename": "US20240246366A1-20240725.XML", "abstract": "A motorcycle tire set S includes a front wheel tire S 1 and a rear wheel tire S 2 each provided with a plurality of inclined grooves 3 . Each inclined groove 3 includes a first portion 11 extending in a crown region Cr, a second portion 12 extending in a shoulder region Sh, and a third portion 13 connecting the first portion 11 and the second portion 12 . The third portion 13 has a smaller groove width than the first portion 11 and the second portion 12 . The first portion 11 , the second portion 12 , and the third portion 13 are inclined in the same direction with respect to a tire circumferential direction. Each inclined groove 3 of the rear wheel tire S 2 comes into contact with the ground from the first portion 11 toward the third portion 13 based on a tire rotation direction R.", "detailed_description": ["Hereinafter, one embodiment of the present invention will be described with reference to the drawings. The drawings contain exaggerated expressions and expressions that differ from the dimensional ratio of the actual structure in order to help the understanding of the present invention. In addition, when there are a plurality of embodiments, the same or common elements are denoted by the same reference characters throughout the description, and the redundant description thereof is omitted.", "", "FIG.1is a plan view in which a tread portion2of a front wheel tire S1of a motorcycle tire set (hereinafter, simply referred to as “tire set”) S according to the present embodiment is developed in a flat surface.FIG.2is a plan view in which a tread portion2of a rear wheel tire S2of the tire set S according to the present embodiment is developed in a flat surface. The tire set S is composed of the front wheel tire S1and the rear wheel tire S2. In the present specification, each of the tires S1and S2is sometimes referred to as tire1.", "", "In the present specification, unless otherwise specified, dimensions and the like of components of the tire1are values measured in a standardized state. The “standardized state” is a state where the tire1is fitted on a standardized rim (not shown) and inflated to a standardized internal pressure and no load is applied to the tire1.", "", "The “standardized rim” is a rim that is defined, in a standard system including a standard on which the tire1is based, by the standard for each tire, and is, for example, the “standard rim” in the JATMA standard, the “Design Rim” in the TRA standard, or the “Measuring Rim” in the ETRTO standard.", "", "The “standardized internal pressure” is an air pressure that is defined, in a standard system including a standard on which the tire1is based, by the standard for each tire, and is the “maximum air pressure” in the JATMA standard, the maximum value indicated in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, or the “INFLATION PRESSURE” in the ETRTO standard.", "", "The tread portion2of the front wheel tire S1does not have a designated tire rotation direction R. On the other hand, as shown inFIG.2, the tread portion2of the rear wheel tire S2has a designated tire rotation direction R. Preferably, the tread portion2of the front wheel tire S1shown inFIG.1comes into contact with the ground from the upper side toward the lower side inFIG.1based on the tire rotation direction R.", "", "As shown inFIG.1andFIG.2, each of the front wheel tire S1and the rear wheel tire S2has a plurality of inclined grooves3provided on the tread portion2so as to be inclined with respect to the tire circumferential direction. Each of the plurality of inclined grooves3includes a first portion11extending in a crown region Cr, a second portion12extending in a shoulder region Sh, and a third portion13connecting the first portion11and the second portion12.", "", "The third portion13has a smaller groove width Wc than the first portion11and the second portion12. Such a third portion13suppresses a decrease in the stiffness of a center portion in the longitudinal direction of the inclined groove3in which relatively large deformation is likely to occur. The third portion13also suppresses slipping of the first portion11and the second portion12mainly in the tire circumferential direction during contact with the ground. Accordingly, uneven wear resistance is enhanced.", "", "The first portion11, the second portion12, and the third portion13are inclined in the same direction with respect to the tire circumferential direction. Such an inclined groove3reduces drainage resistance and improves drainage performance.", "", "In a motorcycle, the rear wheel tire S2is mainly affected by a driving force. The direction of a resultant force F1of the driving force and a lateral force during cornering is inclined from a tire equator C to a tread end Te side, toward the trailing edge side in the tire rotation direction R. Therefore, as shown inFIG.2, in the rear wheel tire S2, each inclined groove3is formed so as to come into contact with the ground from the first portion11toward the third portion13based on the tire rotation direction R. Accordingly, the directions of the resultant force F1and the inclined groove3are the same, and the tread stiffness in the vicinity of the inclined groove3is maintained at a high level. Therefore, uneven wear resistance can be further enhanced. In addition, each inclined groove3of such a rear wheel tire S2can smoothly drain water in line with the tire rotation direction R, so that drainage performance can also be maintained at a high level.", "", "In a motorcycle, the front wheel tire S1is mainly affected by a braking force. As shown inFIG.1, the direction of a resultant force F2of the braking force and a lateral force during cornering is inclined from the tread end Te to the tire equator C side, toward the trailing edge side in the tire rotation direction R. Therefore, in the present embodiment, in the front wheel tire S1, each inclined groove3is formed so as to come into contact with the ground from the second portion12toward the third portion13based on the tire rotation direction R. Accordingly, the directions of the resultant force F2and the inclined groove3are the same, and the tread stiffness in the vicinity of the inclined groove3can be maintained at a high level, so that uneven wear resistance can be further enhanced.", "", "Each tread end Te corresponds to an outer end in the tire axial direction of the tread portion2, and is, for example, an end that can come into contact with the ground during cornering around a maximum camber angle. In the present specification, the distance in the tire axial direction between the tread ends Te when the tread portion2is developed in a flat surface is defined as a tread development width Tx. The tire equator C is the midpoint between the tread ends Te.", "", "In the present specification, the crown region Cr is a region that comes into contact with a flat surface when the tire1in the standardized state is brought into contact with the flat surface with the standardized load at a camber angle of 0 degrees. The length in the tire axial direction between both ends Ce in the tire axial direction of the crown region Cr is defined as a tread ground-contact width TW. In addition, each shoulder region Sh is a region between the crown region Cr and a tread end Te. Each shoulder region Sh is a region that comes into contact with the ground when a camber angle is given to the tire1.", "", "The “standardized load” is a load that is defined, in a standard system including a standard on which the tire1is based, by the standard for each tire, and is the “maximum load capacity” in the JATMA standard, the maximum value indicated in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, or the “LOAD CAPACITY” in the ETRTO standard.", "", "In the tire1, the inclined grooves3include, for example, first inclined grooves3A arranged between the tire equator C and one tread end (right side in the drawing) Te, and second inclined grooves3B arranged between the tire equator C and the other tread end Te. In the present embodiment, the first inclined grooves3A and the second inclined grooves3B are alternately arranged in the tire circumferential direction. The first inclined grooves3A and the second inclined grooves3B have a line symmetrical shape with respect to the tire equator C, for example.", "", "Each inclined groove3extends without crossing the tire equator C. Such an inclined groove3suppresses a decrease in the tread stiffness on the tire equator C to which a large ground-contact pressure is applied, and maintains uneven wear resistance. In order to enhance uneven wear resistance and maintain drainage performance at a high level, a shortest distance Lm between the inclined groove3and the tire equator C is preferably not greater than 10% and further preferably not greater than 8% of the tread ground-contact width TW.", "", "FIG.3is an enlarged view of an inclined groove3of the rear wheel tire S2. As represented inFIG.3, in the front wheel tire S1and the rear wheel tire S2, each inclined groove3has a pair of groove edges20extending in the longitudinal direction. The pair of groove edges20are composed of an inner groove edge20ion the tire equator C side and an outer groove edge20elocated on the tread end Te side with respect to the inner groove edge20i. The inner groove edge20iand the outer groove edge20eare connected at both ends e1and e2in the tire circumferential direction of the inclined groove3.", "", "The third portion13includes an inner end13iconnected to the first portion11and an outer end13econnected to the second portion12. The third portion13includes a first tapered portion13A having a groove width that decreases from the inner end13itoward the second portion12, and an equal width portion13B extending with a constant groove width. In the present embodiment, the third portion13also includes a second tapered portion13C having a groove width that decreases from the outer end13etoward the first portion11. The equal width portion13B includes not only a mode in which the groove width is uniform along the longitudinal direction but also a mode in which the difference between the maximum groove width and the minimum groove width is not greater than 2 mm. The difference between the maximum groove width and the minimum groove width of the equal width portion13B is preferably not greater than 1 mm. In addition, the inner end13iand the outer end13eare ends located on the inner groove edge20ion the tire equator C side of the inclined groove3.", "", "A shortest distance Ls along a tread surface2abetween the inner end13iand the tire equator C is preferably not less than 30% and further preferably not less than 35% of the tread ground-contact width TW (shown inFIG.1), and is preferably not greater than 55% and further preferably not greater than 50% of the tread ground-contact width TW (shown inFIG.1). Since the shortest distance Ls is not less than 30% of the tread ground-contact width TW, the first portion11can be positioned on the tire equator C side on which it is difficult to drain water, and drainage performance can be maintained at a high level. Since the shortest distance Ls is not greater than 55% of the tread ground-contact width TW, the inner end13ican be located away from the outer side of the ground-contact width where slipping is likely to occur due to the difference in tread outer diameter, so that occurrence of uneven wear can be suppressed.", "", "A length Lt in the tire axial direction of the third portion13is preferably not less than 7% of the tread development width Tx (shown inFIG.1). Such a third portion13maintains the tread stiffness of the shoulder region Sh at a high level and exhibits excellent uneven wear resistance. In consideration of suppressing a decrease in drainage performance, the length Lt of the third portion13is further preferably not less than 10% of the tread development width Tx, and is preferably not greater than 23% and further preferably not greater than 20% of the tread development width Tx.", "", "As for the groove width, the third portion13is preferably not greater than 55% and further preferably not greater than 45% of the first portion11and the second portion12. Since the groove width Wc of the third portion13is not greater than 55% of a groove width Wa of the first portion11and a groove width Wb of the second portion12, the tread stiffness can be increased. If, as for the groove width, the third portion13is excessively smaller than the first portion11and the second portion12, drainage performance may deteriorate. Therefore, the groove width Wc of the third portion13is preferably not less than 15% and further preferably not less than 20% of the groove width Wa of the first portion11and the groove width Wb of the second portion12. The groove width Wc of the third portion13is preferably, for example, 1.2 to 3.5 mm. The groove width Wa of the first portion11, the groove width Wb of the second portion12, and the groove width Wc of the third portion13are each a groove width at the midpoint in the longitudinal direction.", "", "On the tread surface2a, a groove volume V3per unit area (not shown) of the third portion13is preferably not less than 70% and further preferably not less than 75% of a groove volume V1per unit area of the first portion11and a groove volume V2per unit area of the second portion12. Accordingly, smooth passage of water between the first portion11and the second portion12is maintained. In consideration of the viewpoint of maintaining the stiffness in the vicinity of the third portion13at a high level, the groove volume V3of the third portion13is preferably not greater than 120% and further preferably not greater than 115% of the groove volume V1of the first portion11and the groove volume V2of the second portion12. Each groove volume (V1, V2, and V3) per unit area is a value obtained by dividing the groove volume of each portion by the area (surface area) of each portion on the tread surface2a.", "", "FIG.4is an enlarged view of the inclined groove3of the rear wheel tire S2. As represented inFIG.4, in the front wheel tire S1and the rear wheel tire S2, the inner groove edge20iincludes an inner third edge portion21iforming the equal width portion13B of the third portion13. The outer groove edge20eincludes an outer third edge portion21eforming the equal width portion13B of the third portion13.", "", "In a tread plan view, the third portion13extends in a straight manner in the present embodiment. Such a third portion13has low drainage resistance and serves to maintain drainage performance at a high level. In the present specification, the “straight manner” includes not only a mode in which the inner third edge portion21iand the outer third edge portion21eof the third portion13are formed only by straight lines, but also a mode in which, for example, the edge portions21iand21eare each formed by an arc having a radius of curvature r exceeding 200 mm. The third portion13may, for example, extend in a curved manner in which the edge portions21iand21eare each formed by an arc having a radius of curvature r of 20 to 200 mm.", "", "In the present embodiment, the third portion13extends in the crown region Cr and the shoulder region Sh. A midpoint13sof the third portion13is located in the shoulder region Sh. The shoulder region Sh is a region that has a smaller tire circumferential length than the crown region Cr and in which slipping is likely to occur. Therefore, slipping in the shoulder region Sh is suppressed, and the difference in the amount of wear between the shoulder region Sh and the crown region Cr becomes smaller, so that uneven wear resistance can be enhanced.", "", "An angle θ1of the inclined groove3with respect to the tire circumferential direction is preferably not less than 5 degrees and further preferably not less than 7 degrees, and is preferably not greater than 15 degrees and further preferably not greater than 13 degrees. The angle θ1of the inclined groove3is specified by a virtual line va connecting both ends e1and e2in the tire circumferential direction of the inclined groove3.", "", "FIG.5is a cross-sectional view taken along a line A-A inFIG.2. As shown inFIG.5, as for the groove depth, the third portion13is preferably not less than 70% and further preferably not less than 75% of the first portion11and the second portion12, and is preferably not greater than 120% and further preferably not greater than 115% of the first portion11and the second portion12. Since a groove depth Dc of the third portion13is not less than 70% and not greater than 120% of a groove depth Da of the first portion11and a groove depth Db of the second portion12, an excessive change in the stiffness in the vicinity of the first portion11, the second portion12, and the third portion13can be reduced. Therefore, uneven wear resistance is enhanced. The groove depth Da of the first portion11and the groove depth Db of the second portion12are preferably, for example, 3.5 to 9.5 mm. Such a groove depth of the inclined groove3is applied to each of the inclined grooves3of the front wheel tire S1and the rear wheel tire S2.", "", "FIG.6is an enlarged view of an inclined groove3inFIG.2.FIG.6shows an inclined groove3of the rear wheel tire S2. In general, in the rear wheel tire S2which is mainly affected by a driving force, in each inclined groove3, wear is likely to occur at the groove edge on the leading edge side in the tire rotation direction R. In the present embodiment, the groove edge on the leading edge side in the tire rotation direction R of the inclined groove3is the outer groove edge20eon the tread end Te side. Meanwhile, the groove edge on the trailing edge side in the tire rotation direction R of the inclined groove3is the inner groove edge20ion the tire equator C side. The inclined groove3comes into contact with the ground from the outer groove edge20eon the tread end Te side toward the inner groove edge20ion the tire equator C side based on the tire rotation direction R.", "", "As shown inFIG.6, in each inclined groove3of the rear wheel tire S2, a virtual line v1obtained by extending a groove width center line c3of the equal width portion13B to the first portion11is located on the outer side in the tire axial direction with respect to a groove width center line c1of the first portion11in the present embodiment. Accordingly, in the rear wheel tire S2, the stiffness of a tread land portion connected to the outer groove edge20eon the tread end Te side (leading edge side in the tire rotation direction R) of the inclined groove3is kept higher than the stiffness of a tread land portion connected to the inner groove edge20ion the tire equator C side of the inclined groove3. Therefore, the rear wheel tire S2has further enhanced uneven wear resistance. In addition, a virtual line v2obtained by extending the groove width center line c3of the equal width portion13B to the second portion12is, for example, located on the outer side in the tire axial direction with respect to a groove width center line c2of the second portion12. Accordingly, the above-described effects are further effectively exhibited.", "", "In the present embodiment, in the rear wheel tire S2, the outer groove edge20eon the tread end Te side of the inclined groove3extends smoothly without having any bent portions. In addition, the inner groove edge20ion the tire equator C side of the inclined groove3extends including bent portions K located on both sides in the longitudinal direction of the third portion13. The bent portions K are formed in the first tapered portion13A and the second tapered portion13C.", "", "FIG.7is an enlarged view of an inclined groove3inFIG.1.FIG.7shows an inclined groove3of the front wheel tire S1. In general, in the front wheel tire S1which is mainly affected by a braking force, in each inclined groove3, wear is likely to occur at the groove edge on the trailing edge side in the tire rotation direction R. In the present embodiment, the groove edge on the trailing edge side of the inclined groove3is the outer groove edge20eon the tread end Te side. Meanwhile, the groove edge on the leading edge side in the tire rotation direction R of the inclined groove3is the inner groove edge20ion the tire equator C side. The inclined groove3comes into contact with the ground from the inner groove edge20ion the tire equator C side toward the outer groove edge20eon the tread end Te side based on the tire rotation direction R. In addition, the inclined groove3comes into contact with the ground from the second portion12toward the third portion13based on the tire rotation direction R.", "", "As shown inFIG.7, in each inclined groove3of the front wheel tire S1, a virtual line v3obtained by extending the groove width center line c3of the equal width portion13B to the first portion11is located on the outer side in the tire axial direction with respect to the groove width center line c1of the first portion11in the present embodiment. Accordingly, in the front wheel tire S1, the stiffness of a tread land portion connected to the outer groove edge20eon the tread end Te side (trailing edge side in the tire rotation direction R) of the inclined groove3is kept higher than the stiffness of a tread land portion connected to the inner groove edge20ion the tire equator C side of the inclined groove3. Therefore, the front wheel tire S1can have further enhanced uneven wear resistance. In addition, a virtual line v4obtained by extending the groove width center line c3of the equal width portion13B to the second portion12is, for example, located on the outer side in the tire axial direction with respect to the groove width center line c2of the second portion12. Accordingly, the above-described effects are further effectively exhibited.", "", "In the present embodiment, in the front wheel tire S1, the outer groove edge20eon the tread end Te side of the inclined groove3extends smoothly without having any bent portions. In addition, the inner groove edge20ion the tire equator C side of the inclined groove3extends including bent portions K located on both sides in the longitudinal direction of the third portion13. The bent portions K are formed in the first tapered portion13A and the second tapered portion13C.", "", "As shown inFIG.1andFIG.2, each of the tread portions2of the front wheel tire S1and the rear wheel tire S2is provided with first sub-inclined grooves4and second sub-inclined grooves5in the present embodiment. The first sub-inclined grooves4are, for example, located on the outer side in the tire axial direction with respect to the inclined grooves3. The second sub-inclined grooves5are, for example, located on the outer side in the tire axial direction with respect to the first sub-inclined grooves4.", "", "The first sub-inclined grooves4and the second sub-inclined grooves5are each inclined in the same direction as the inclined groove3. In addition, a groove edge4eon the tread end Te side of each first sub-inclined groove4and a groove edge5eon the tread end Te side of each second sub-inclined groove5extend smoothly without having any bent portions as in the outer groove edge20eon the tread end Te side of the inclined groove3. In addition, a groove edge4ion the tire equator C side of each first sub-inclined groove4and a groove edge5ion the tire equator C side of each second sub-inclined groove5each have a bent portion K as in the inner groove edge20ion the tire equator C side of the inclined groove3.", "", "FIG.8is a plan view of a tread portion2of a front wheel tire S1according to another embodiment. The tread portion2of this embodiment has, for example, a designated tire rotation direction R. In addition, the tread portion2is provided with a plurality of inclined grooves3. Each of the inclined grooves3comes into contact with the ground from the first portion11toward the third portion13based on the tire rotation direction R.", "", "As shown inFIG.8, in each inclined groove3of the front wheel tire S1, a virtual line v5obtained by extending the groove width center line c3of the equal width portion13B to the first portion11is located on the tire equator C side with respect to the groove width center line c1of the first portion11in the present embodiment. Accordingly, in the front wheel tire S1, the stiffness of a tread land portion connected to the inner groove edge20ion the tire equator C side (trailing edge side in the tire rotation direction R) of the inclined groove3is kept higher than the stiffness of a tread land portion connected to the outer groove edge20eon the tread end Te side of the inclined groove3. Therefore, the front wheel tire S1can have further enhanced uneven wear resistance. In addition, a virtual line v6obtained by extending the groove width center line c3of the equal width portion13B to the second portion12is, for example, located on the inner side in the tire axial direction with respect to the groove width center line c2of the second portion12. Accordingly, the above-described effects are further effectively exhibited.", "", "In the present embodiment, in the front wheel tire S1, the inner groove edge20ion the tire equator C side of the inclined groove3extends smoothly without having any bent portions. In addition, the outer groove edge20eon the tread end Te side of the inclined groove3extends including bent portions K located on both sides in the longitudinal direction of the third portion13. The bent portions K are formed in the first tapered portion13A and the second tapered portion13C.", "", "Although the motorcycle tire set according to the embodiments of the present invention has been described in detail above, the present invention is not limited to the above specific embodiments, and various modifications can be made to implement the present invention."], "claims": ["each of the front wheel tire and the rear wheel tire has a plurality of inclined grooves provided on a tread portion thereof so as to be inclined in a tire circumferential direction, each of the plurality of inclined grooves includes a first portion extending in a crown region, a second portion extending in a shoulder region, and a third portion connecting the first portion and the second portion, the third portion has a smaller groove width than the first portion and the second portion, the first portion, the second portion, and the third portion are inclined in the same direction with respect to the tire circumferential direction, the tread portion of the rear wheel tire has a designated tire rotation direction, and each of the plurality of inclined grooves of the rear wheel tire comes into contact with ground from the first portion toward the third portion based on the tire rotation direction.", "the third portion includes an inner end connected to the first portion, and a shortest distance along a tread surface between the inner end and a tire equator is 30% to 55% of a tread ground-contact width.", "3 . The motorcycle tire set according to claim 1 , wherein, in a tread plan view in which the tread portion is developed in a flat surface, the third portion extends in a straight manner.", "4 . The motorcycle tire set according to claim 1 , wherein, in a tread plan view in which the tread portion is developed in a flat surface, the third portion extends in a curved manner.", "in each of the plurality of inclined grooves of the rear wheel tire, the third portion includes a first tapered portion having a groove width that decreases from the inner end toward the second portion, and an equal width portion extending with a constant groove width, and a virtual line obtained by extending a groove width center line of the equal width portion to the first portion is located on an outer side in a tire axial direction with respect to a groove width center line of the first portion.", "6 . The motorcycle tire set according to claim 5 , wherein the third portion includes a second tapered portion having a groove width that decreases from an outer end connected to the second portion, toward the first portion.", "7 . The motorcycle tire set according to claim 5 , wherein a virtual line obtained by extending the groove width center line of the equal width portion to the second portion is located on the outer side in the tire axial direction with respect to a groove width center line of the second portion.", "8 . The motorcycle tire set according to claim 1 , wherein, as for a groove depth, the third portion is 70% to 120% of the first portion and the second portion.", "9 . The motorcycle tire set according to claim 1 , wherein, as for a groove width, the third portion is not greater than 55% of the first portion and the second portion.", "10 . The motorcycle tire set according to claim 1 , wherein a length in a tire axial direction of the third portion is not less than 7% of a tread development width.", "11 . The motorcycle tire set according to claim 1 , wherein, on the tread surface, a groove volume per unit area of the third portion is not less than 70% of a groove volume per unit area of the first portion and a groove volume per unit area of the second portion.", "wherein the first inclined grooves and the second inclined grooves are arranged alternately in the tire circumferential direction, and wherein the first inclined grooves and the second inclined grooves have a line symmetrical shape with respect to the tire equator.", "13 . The motorcycle tire set according to claim 1 , wherein each of the plurality of inclined grooves extends without crossing a tire equator.", "14 . The motorcycle tire set according to claim 1 , wherein a shortest distance between each of the plurality of inclined grooves and a tire equator is less than 10% of a tread ground-contact width.", "15 . The motorcycle tire set according to claim 10 , wherein the length in the tire axial direction of the third portion is not greater than 23% of the tread development width.", "in each of the plurality of inclined grooves of the rear wheel tire, the third portion extends in the crown region and the shoulder region, and a midpoint of the third portion is located in the shoulder region.", "in each of the plurality of inclined grooves of the rear wheel tire, a virtual line is obtained by connecting both a first end and a second end of one of the plurality of inclined grooves in the tire circumferential direction, and an angle of the one of the plurality of inclined grooves with respect to the tire circumferential direction is not less than 5 degrees.", "in each of the plurality of inclined grooves of the front wheel tire, the third portion includes a first tapered portion having a groove width that decreases from the inner end toward the second portion, and an equal width portion extending with a constant groove width, and a virtual line obtained by extending a groove width center line of the equal width portion to the first portion is located on an outer side in a tire axial direction with respect to a groove width center line of the first portion.", "19 . The motorcycle tire set according to claim 18 , wherein the third portion includes a second tapered portion having a groove width that decreases from an outer end connected to the second portion, toward the first portion.", "20 . The motorcycle tire set according to claim 19 , wherein a virtual line obtained by extending the groove width center line of the equal width portion to the second portion is located on the outer side in the tire axial direction with respect to a groove width center line of the second portion."], "bibtex": "@patent{20240246366,\n    title = {MOTORCYCLE TIRE SET},\n    number = {20240246366},\n    year = {2024},\n    note = {File: US20240246366A1-20240725.XML}\n    }", "classification": "B60C1103FI"}]