[{"title": "WHEELS WITH CONTROLLABLE SUCTION DEVICES FOR ADHESION ON SURFACES", "doc_number": "20240326511", "filename": "US20240326511A1-20241003.XML", "abstract": "Wheels have controllable suction devices for adhesion on surfaces. The wheel has an axle and an outer circumferential surface. The outer circumferential surface has a plurality of apertures and a plurality of stretchable materials. Each aperture has a respective stretchable material therein. Rotating the wheel moves a first stretchable material adjacent to a surface of a structure. A portion of the first stretchable material moves in the direction radial to the axle, to control adhesion of a portion of the outer circumferential surface to the surface of the structure. A method implements use of the wheel to adhere to the surface of the structure.", "detailed_description": ["Example embodiments consistent with the teachings included in the present disclosure are directed to wheels with controllable suction devices for adhesion on surfaces.", "", "In a first embodiment shown inFIGS.1-4, a wheel10has an outer ring12with a plurality of apertures14in which are disposed a stretchable material16. The stretchable material16can be composed of natural rubber. Alternatively, the stretchable material16can be composed of synthetic rubber. In a further alternative embodiment, the stretchable material16can be composed of any known resilient material which can deform in response to suction of gases such as air, or liquids. Such a resilient material can return to a non-deformed state in response to removal of the suction effect of the gases. Accordingly, in response to control of the suction of the gases, the stretchable material16acts as a suction cup to create a vacuum between the suction cup and a surface18. Thus, the deformed stretchable material16can have an adhesion effect between the wheel10and a portion of a surface18adjacent to the deformed stretchable material16. The surface18can be a non-metallic surface of a structure, and so the wheel10does not require magnetic attraction to adhere to the surface18. Alternatively, the surface18can be a metallic surface.", "", "Referring toFIGS.1-2, the outer ring12has brackets20,22extending from a central region24having an axle26and a motor driving gear28. An inner ring30has an inner gear32on a sleeve bearing34, to which is connected at one end36of a linear actuator38. The linear actuator38can be a telescoping pair of rods40,42. The inner gear32engages the motor driving gear28to rotate the inner ring30on roller bearings44within the inner periphery of the outer ring12. The inner ring30has a diaphragm46coupled to the other end48of the linear actuator38. A pair of diaphragm holding bars50,52are disposed on either side of a portion54of the diaphragm46. When the telescoping pair of rods40,42of the linear actuator38operate to have the lower rod42extend into the upper rod40, the linear actuator38pulls and lifts the portion54of the diaphragm46away from the stretchable material56,58below the portion54. The portion54then balloons and lifts the stretchable material56,58upwards by a vacuum effect. Therefore, in conjunction with the linear action of the rod42of the linear actuator38and the lifted stretchable material56,58, a suction effect occurs at the location of the outer ring12adjacent to the surface18below the location of the lifted stretchable material56,58. Accordingly, the wheel10adheres to the surface18of a structure.", "", "In order to adhere the wheel10to the surface18, the linear actuator38is controlled by code stored in a memory and executing in a hardware processor to move the rod42away from the surface18, and so to lift and balloon the portion54of the diaphragm46. Alternatively, the linear actuator38is electrically operated, and is independent of the motor driving gear28. The motor driving gear28operates to keep the wheel inner ring30and the linear actuator38, which is mounted rigidly on the inner ring30, perpendicular to the surface18in order to create the adhesion. The center motor driving gear28and the linear actuator38are parts of the inner ring30and coupled together.", "", "In a further alternative embodiment, the actuator38is controlled to extend or retract the rod42by a gear assembly connected to the motor driving gear28such that rotation of the wheel10causes the rod42to move towards the longitudinal axis, causing the adhesion of the wheel10to the surface18, and ceasing of the rotation of the wheel10causes the rod42to move away from the longitudinal axis, which reduces or eliminates the adhesion of the wheel10to the surface18.", "", "When the portion54of the diaphragm46is lifted, a vacuum is created between the portion54and the stretchable material56,58. The stretchable material56,58deforms to create the suction effect and adhesion of the wheel10to the surface18. To release the wheel10from the surface18, such as when a crawler having the wheel10disengages from the surface18, the code executing in the hardware processor moves the rod42towards the surface18. Such movement of the rod42removes the biasing force of the rod42from the portion54of the diaphragm46, which restores the diaphragm46to the unstretched configuration. In turn, the vacuum between the portion54of the diaphragm46and the stretchable materials56,58is reduced or ceases, which restores the stretchable materials56,58to the undeformed state. Therefore, the suction effect is reduced or eliminated, and so the adhesion between the wheel10and the surface18is reduced or eliminated, allowing the wheel10to disengage from the surface18.", "", "It is to be understood that the suction effect is not limited to providing adhesion between the wheel12and a non-metallic surface18. In addition, the suction effect can provide adhesion between the wheel12and a metallic surface, or between the wheel12and a hybrid surface composed of portions of both non-metallic material and metallic material.", "", "During rotation of the wheel10, including the outer ring12, adjacent to the surface18, the linear actuator38can stay substantially perpendicular to the portion of the surface18being traversed. As the wheel10rotates, the suction effect of the stretchable material56,58reduces or ceases with contacting portion of the surface18as the stretchable material56,58moves away from the contacting portion of the surface18. However, since the linear actuator38remains substantially perpendicular to the portion of the surface18being traversed, additional stretchable material60,62arrives under the ballooned portion54of the diaphragm46, so that such stretchable material60,62generates a suction effect with the portion of the surface18being traversed. Accordingly, during actuation of the linear actuator38, the portion54of the diaphragm maintains a continuous suction effect between the surface18and the wheel10, and so the wheel10adheres to the surface18in any orientation.", "", "In an alternative embodiment shown inFIG.5, a wheel70has a compressor or pump72connected by a tubular line74to a tube76connected at one end78to the portion54of the diaphragm46. The pump72can be a pneumatic pump. The pump72moves gases, such as air, or liquids into or out of the tubular line74and the tube76. By controlling the flow of gases or liquids, the pump72can maintain a negative pressure on the portion54of the diaphragm46to balloon the portion54. In addition, by controlling the flow of gases or liquids, the pump72can maintain zero or positive pressure on the portion54to restore the portion54of the diaphragm46to the unstretched state.", "", "In order to adhere the wheel70to the surface18, the pump72is controlled by code stored in a memory and executing in a hardware processor to establish a negative pressure or a vacuum on the portion54of the diaphragm46, and so to lift and balloon the portion54of the diaphragm46. Alternatively, the tube76can be replaced by a linear actuator. The pump72can be utilized to operate the linear actuator movement. The pump72is directly withdrawing or supplies air, another gas, or a liquid to the inside of the linear actuator to provide linear movement which causes suction to the balloon diaphragm46and cause adhesion. The pump72is not mechanically coupled to the motor driving gear28.", "", "In a further alternative embodiment, the pump72is controlled to be turned on or off by a gear assembly connected to the motor driving gear28such that rotation of the wheel10causes the pump72to establish the negative pressure, and so increasing the adhesion of the wheel10to the surface18. The ceasing of the rotation of the wheel10causes the pump72to establish the positive or zero pressure, which reduces or eliminates the adhesion of the wheel10to the surface18.", "", "When the portion54of the diaphragm46is lifted, a vacuum is created between the portion54and the stretchable material56,58. The stretchable material56,58deforms to create the suction effect and adhesion of the wheel70to the surface18. To release the wheel70from the surface18, such as when a crawler having the wheel70disengages from the surface18, the code executing in the hardware processor establishes a zero or positive pressure on the portion54of the diaphragm46, which removes the biasing force of the vacuum or negative pressure from the portion54of the diaphragm46, which restores the diaphragm46to the unstretched configuration. In turn, the vacuum between the portion54of the diaphragm46and the stretchable materials56,58is reduced or ceases, which restores the stretchable materials56,58to the undeformed state. Therefore, the suction effect is reduced or eliminated, and so the adhesion between the wheel70and the surface18is reduced or eliminated, allowing the wheel70to disengage from the surface18.", "", "In another alternative embodiment shown inFIGS.6-11, a wheel80has an outer ring82having an outer circumferential surface84with apertures86therethrough. A stretchable material88is disposed in the apertures86which act as suction cups, as described in greater detail below. An inner sleeve90is coupled to the outer ring82by the brackets92,94from which an axle96extends. A plurality of springs98,100,102bias a plurality of bars104,106,108, respectively, inward towards the longitudinal axis of the wheel80coincident with the axle96. As shown inFIG.6, the springs98,100,102are elongated and in a state of tension due to interaction between a respective bar104,106,108and wedges and latching mechanisms as shown inFIG.7-12, as described in greater detail below. However, the spring114inFIG.6is in its non-tension state with a stretchable material116pulled to create a suction effect on the surface18adjacent to the wheel80at the location of the stretchable material116. Accordingly, the wheel80has adhesion to the surface18at the location of the stretchable material116.", "", "As shown inFIG.6, an activator switch118extends through a slot120in the outer circumferential surface84. As the wheel80rotates to traverse the surface18, when a given activator switch118is adjacent to the surface18, pressure from the surface18moves the activator switch118into the slot120and activates a latching mechanism associated with the activator switch118and adjacent stretchable materials. Referring toFIG.7, the activator switch118extends out of the slot120. The activator switch118has a pair of arms122,124extending from a pivot126. An end of the arm122extends out of the slot120and engages the surface18as the wheel80rotates. An end of the arm124engages a latch member128. When the surface pushes the end of the arm122into the slot120, the activator switch118rotates about the pivot126, and moves the end of the arm124away from the latch member128, as shown inFIG.8.", "", "With the arm124pivoted away from the latch member128, the spring102returns to the non-tensioned state by the restorative force of the spring102, as shown inFIG.9. Such a restorative force causes the spring102to pull the bar108and the associated stretchable material116inward towards the longitudinal axis. The pulled stretchable material116creates a suction effect on the location of the surface18adjacent to the stretchable material116. Thus, the pulled stretchable material116acts as a suction cup configured to create adhesion between the wheel80and the adjacent location on the surface18.", "", "As shown inFIGS.10-11, the wheel80also includes a pair of stationary wedges130,132on either side of the bar108which is adjacent to the surface18. As the wheel80rotates, the inclined sides of the wedges130,132act to reset the latching mechanism associated with the bar108and re-tension the spring102in the elongated configuration, as shown inFIG.7. Referring toFIGS.7-9in conjunction withFIGS.10-11, as the wheel80rotates, for example, clockwise relative to the front view inFIGS.10-11, the arm124pivots away from the latch member128as described above, and a left side of the bar108slides up the inclined surface134as the spring102moves to its non-tensioned state. The pulled stretchable material116creates a suction effect on the location of the surface18adjacent to the stretchable material116. Thus, the pulled stretchable material116acts as a suction cup configured to create adhesion between the wheel80and the adjacent location on the surface18.", "", "As the wheel80further rotates clockwise, the right side of the bar108slides down the inclined surface136as the spring102moves to a tensioned state. The arm124pivots towards the latch member128while the activator switch118extends its arm122out of the slot120. When the activator switch118is pressed against the surface18, the activator switch118unleashes the bar108which leads to expanding the stretchable material116, creating suction and adhesion to the surface18. Alternatively, the activator switch118can have a resilient member, such as a leaf spring, which biases the activator switch118to extend out of the slot120when the surface18no longer applies pressure to the arm122of the activator switch118. The activator switch118is extended out of the slot120and hinged around the pivot126.", "", "Accordingly, the stretchable material116is no longer pulled, and so the suction effect on the location of the surface18adjacent to the stretchable material116is reduced or eliminated. Thus, the stretchable material116no longer acts as a suction cup, and the adhesion between the wheel80and the adjacent location on the surface18is reduced or eliminated.", "", "As shown inFIGS.6and11, the wheel80can have multiple stretchable materials disposed in multiple apertures arranged in rows which are commonly controlled by a single associated bar, such as the bar108and the materials116,134shown inFIG.11. Such multiple stretchable materials provide increased suction effects and greater adhesion of the wheel80to a surface18. In a further alternative embodiment, shown inFIG.12, the wheel140can have a single stationary wedge142configured to reset the latching mechanism associated with the bar108and an activator switch.", "", "In another embodiment, a method includes providing a wheel with an axle and an outer circumferential surface having a plurality of apertures and a plurality of stretchable materials. Each aperture has a respective stretchable material therein. The method further includes rotating the wheel to move a first stretchable material adjacent to a surface of a structure, and moving a portion of the first stretchable material in the direction radial to the axle, thereby controlling adhesion of a portion of the outer circumferential surface to the surface of the structure. The surface of the structure is non-metallic or metallic. The portion of the first stretchable material can be moved by a linear actuator controlled by code stored in a memory and executing in a hardware processor to move a telescoping rod away from the surface, and so to lift and balloon the portion of the first stretchable material. Alternatively, the linear actuator can be electrically operated, and is independent of a motor driving gear rotating the wheel. The motor driving gear can operate to keep a wheel inner ring and the linear actuator, which is mounted rigidly on the inner ring, perpendicular to the surface in order to create the adhesion. The center motor driving gear and the linear actuator can be parts of the inner ring and coupled together.", "", "In another embodiment, a pump can be utilized to operate the portion of the first stretchable material. The pump can control movement of a linear actuator. The pump is directly withdrawing or supplies air, another gas, or a liquid to the inside of the linear actuator to provide linear movement which causes suction to the balloon diaphragm and cause adhesion. The pump can be independent and not mechanically coupled to a motor driving gear. In a further alternative embodiment, the pump is controlled to be turned on or off by a gear assembly connected to the motor driving gear such that rotation of the wheel causes the pump to establish the negative pressure, and so increasing the adhesion of the wheel to the surface. The ceasing of the rotation of the wheel causes the pump to establish the positive or zero pressure, which reduces or eliminates the adhesion of the wheel to the surface.", "", "In a further alternative embodiment, the portion of the first stretchable material can be controlled by a bar attached to a spring. An activator switch extends out of the wheel. When the activator switch is pressed against the surface, the activator switch unleashes the bar which leads to expanding the stretchable material, creating suction and adhesion to the surface. Alternatively, the activator switch can have a resilient member, such as a leaf spring, which biases the activator switch to extend out of a slot when the surface no longer applies pressure to the arm of the activator switch. The activator switch is extended out of the slot and hinged around a pivot.", "", "Portions of the methods described herein can be performed by software or firmware in machine readable form on a tangible (e.g., non-transitory) storage medium. For example, the software or firmware can be in the form of a computer program including computer program code adapted to cause the system to perform various actions described herein when the program is run on a computer or suitable hardware device, and where the computer program can be embodied on a computer readable medium. Examples of tangible storage media include computer storage devices having computer-readable media such as disks, thumb drives, flash memory, and the like, and do not include propagated signals. Propagated signals can be present in a tangible storage media. The software can be suitable for execution on parallel hardware processors or serial hardware processors such that various actions described herein can be carried out in any suitable order, or simultaneously.", "", "It is to be further understood that like or similar numerals in the drawings represent like or similar elements through the several figures, and that not all components or steps described and illustrated with reference to the figures are required for all embodiments or arrangements.", "", "The terminology used herein is for the purpose of describing particular embodiments only and is not intended to be limiting of the invention. As used herein, the singular forms “a,” “an,” and “the” are intended to include the plural forms as well, unless the context clearly indicates otherwise. It will be further understood that the terms “contains”, “containing”, “includes”, “including,” “comprises”, and/or “comprising,” and variations thereof, when used in this specification, specify the presence of stated features, integers, steps, operations, elements, and/or components, but do not preclude the presence or addition of one or more other features, integers, steps, operations, elements, components, and/or groups thereof.", "", "Terms of orientation are used herein merely for purposes of convention and referencing and are not to be construed as limiting. However, it is recognized these terms could be used with reference to an operator or user. Accordingly, no limitations are implied or to be inferred. In addition, the use of ordinal numbers (e.g., first, second, third) is for distinction and not counting. For example, the use of “third” does not imply there is a corresponding “first” or “second.” Also, the phraseology and terminology used herein is for the purpose of description and should not be regarded as limiting. The use of “including,” “comprising,” “having,” “containing,” “involving,” and variations thereof herein, is meant to encompass the items listed thereafter and equivalents thereof as well as additional items.", "", "While the disclosure has described several exemplary embodiments, it will be understood by those skilled in the art that various changes can be made, and equivalents can be substituted for elements thereof, without departing from the spirit and scope of the invention. In addition, many modifications will be appreciated by those skilled in the art to adapt a particular instrument, situation, or material to embodiments of the disclosure without departing from the essential scope thereof. Therefore, it is intended that the invention not be limited to the particular embodiments disclosed, or to the best mode contemplated for carrying out this invention, but that the invention will include all embodiments falling within the scope of the appended claims.", "", "The subject matter described above is provided by way of illustration only and should not be construed as limiting. Various modifications and changes can be made to the subject matter described herein without following the example embodiments and applications illustrated and described, and without departing from the true spirit and scope of the invention encompassed by the present disclosure, which is defined by the set of recitations in the following claims and by structures and functions or steps which are equivalent to these recitations."], "claims": ["an axle; an outer circumferential surface having a plurality of apertures and a plurality of stretchable materials, wherein each aperture has a respective stretchable material therein, wherein a portion of the outer circumferential surface is adjacent to a surface of a structure; a bracket coupling the outer circumferential surface to the axle; a portion of a diaphragm adjacent to the portion of the outer circumferential surface; and a diaphragm moving device configured to move the portion of the diaphragm in a direction radial to the axle, wherein a first aperture of the plurality of apertures and a respective first stretchable material of the plurality of stretchable materials are adjacent to the surface of the structure, and wherein the moved portion of the diaphragm moves a portion of the first stretchable material in the direction radial to the axle, thereby controlling adhesion of the portion of the outer circumferential surface to the surface of the structure.", "2 . The wheel of claim 1 , wherein movement of the portion of the first stretchable material radially towards the axle increases adhesion of the portion of the outer circumferential surface to the surface of the structure.", "3 . The wheel of claim 1 , wherein movement of the portion of the first stretchable material radially away from the axle decreases adhesion of the portion of the outer circumferential surface to the surface of the structure.", "4 . The wheel of claim 1 , wherein the diaphragm moving device is a linear actuator.", "wherein the rod moves in the direction radial to the axle to move the portion of the diaphragm in the direction radial to the axle.", "a motor driving gear configured to rotate or to not rotate the outer circumferential surface, wherein the linear actuator is coupled to the motor driving gear by a gear assembly, and wherein gear assembly moves the rod in the direction radial to the axle to move the portion of the diaphragm in the direction radial to the axle.", "7 . The wheel of claim 1 , wherein the diaphragm moving device is a pump.", "wherein the pump moves a substance in the direction radial to the axle to move the portion of the diaphragm in the direction radial to the axle, and wherein the substance is a gas or a liquid.", "a motor driving gear configured to rotate or to not rotate the outer circumferential surface, wherein the pump is coupled to the motor driving gear by a gear assembly, and wherein gear assembly controls the pump to move the substance in the direction radial to the axle to move the portion of the diaphragm in the direction radial to the axle.", "10 . The wheel of claim 1 , wherein the surface of the structure is composed of a non-metallic material.", "11 . The wheel of claim 1 , wherein the surface of the structure is composed of a metallic material.", "an axle; an outer circumferential surface having a plurality of slots, a plurality of activator switches, a plurality of apertures and a plurality of stretchable materials, wherein each activator switch extends through a respective slot, wherein each aperture has a respective stretchable material therein, wherein a portion of the outer circumferential surface is adjacent to a surface of a structure; an inner sleeve; a bracket coupling the outer circumferential surface and the inner sleeve to the axle; a plurality of springs coupled to the inner sleeve, wherein each spring extends in a direction radial to the axle; and a plurality of bars each coupled to a respective spring, and each coupled to a stretchable material, wherein a first aperture of the plurality of apertures and a respective first stretchable material of the plurality of stretchable materials are adjacent to the surface of the structure, and wherein rotation of the outer circumferential surface causes a first activator switch to be disposed adjacent to the surface of the structure, to control the first activator switch to move into or out of a first respective slot, to move a respective first bar in a direction radial to the axle, and to move a portion of the first stretchable material in the direction radial to the axle, thereby controlling adhesion of the portion of the outer circumferential surface to the surface of the structure.", "13 . The wheel of claim 12 , wherein movement of the portion of the first stretchable material radially towards the axle increases adhesion of the portion of the outer circumferential surface to the surface of the structure.", "14 . The wheel of claim 12 , wherein movement of the portion of the first stretchable material radially away from the axle decreases adhesion of the portion of the outer circumferential surface to the surface of the structure.", "a latch member, wherein the activator switch includes: a first arm configured to engage the surface of the structure; and a second arm configured to engage the latch member, wherein the first and second arms are coupled at a pivot point, wherein engagement of the first arm with the surface of the structure pivots the activator switch to move an end of the second arm away from the latch member, to move the respective first bar associated with the activator switch radially towards the axle, to move the portion of the first stretchable material radially towards the axle, thereby increasing adhesion of the portion of the outer circumferential surface to the surface of the structure.", "16 . The wheel of claim 15 , wherein disengagement of the first arm from the surface of the structure pivots the activator switch to move the end of the second arm to engage the latch member, to move the respective first bar associated with the activator switch away from the axle, and to move the portion of the first stretchable material radially away from the axle, thereby decreasing adhesion of the portion of the outer circumferential surface to the surface of the structure.", "a first wedge having a first inclined surface configured to slidably engage the first bar, wherein rotation of the outer circumferential surface in a first rotational direction causes the first bar to slide along the first inclined surface to move radially towards the axle, thereby to decrease a tension of a respective first spring associated with the first bar, wherein the decreased tension of the first spring cause the portion of the first stretchable material to move radially towards the axle, thereby increasing adhesion of the portion of the outer circumferential surface to the surface of the structure.", "a second wedge having a second inclined surface configured to slidably engage the first bar, wherein rotation of the outer circumferential surface in a first rotational direction causes the first bar to slide along the second inclined surface to move radially away from the axle, thereby to increasing the tension of the respective first spring associated with the first bar, wherein the increased tension of the first spring causes the portion of the first stretchable material to move radially away from the axle, thereby decreasing adhesion of the portion of the outer circumferential surface to the surface of the structure.", "providing a wheel with an axle and an outer circumferential surface having a plurality of apertures and a plurality of stretchable materials, wherein each aperture has a respective stretchable material therein; rotating the wheel to move a first stretchable material adjacent to a surface of a structure; and moving a portion of the first stretchable material in the direction radial to the axle, thereby controlling adhesion of a portion of the outer circumferential surface to the surface of the structure.", "20 . The method of claim 19 , wherein the surface of the structure is non-metallic or metallic."], "bibtex": "@patent{20240326511,\n    title = {WHEELS WITH CONTROLLABLE SUCTION DEVICES FOR ADHESION ON SURFACES},\n    number = {20240326511},\n    year = {2024},\n    note = {File: US20240326511A1-20241003.XML}\n    }", "classification": "B60B1526FI"}, {"title": "OMNIDIRECTIONAL ROLLER WHEEL WITH SOLID BUSHING AND SYMMETRICAL AXLE", "doc_number": "20240326512", "filename": "US20240326512A1-20241003.XML", "abstract": "A wheel and a method for its manufacture are disclosed herein. The wheel includes a wheel hub including a main axle bore rotatable around a main axis. The wheel also includes a plurality of cross roller sub-assemblies comprising a plurality of pre-roller assemblies. The pre-roller assemblies include a plurality of symmetrical axles, and a plurality of axle bushings, each axle bushing configured to receive one symmetrical axle in a central longitudinal bore. The cross roller sub-assemblies also include a plurality of peripheral rollers, each pre-roller assembly overmolded with one peripheral roller. The wheel also includes a peripheral axle ring adapted about the wheel and radially spaced from the main axis, the wheel having the plurality of cross roller sub-assemblies overmolded with the wheel hub, where the overmolded cross roller sub-assemblies form the peripheral axle ring.", "detailed_description": ["The disclosure relates to a new product design that employs a solid bushing, precision assembly, and an advanced overmolding technique used in plastic injection molding, to efficiently produce a robust omnidirectional wheel. It allows for the pre-assembly of symmetrical axles and solid axle bushings into pre-roller assemblies that may then be overmolded into a completed wheel.", "", "This multi-roller omnidirectional wheel may comprise a pre-produced inner wheel hub, pre-produced symmetrical axles (also referred to as axles, roller pins, cross symmetrical axles, or cross roller pins), pre-produced solid axle bushings, polyurethane peripheral rollers overmolded onto the axle bushings, an overmolded wheel hub, and in one embodiment a pre-produced inner wheel hub.", "", "The symmetrical axle may be made of metal or may be extruded or molded from plastic materials. In one embodiment, the symmetrical axle may be linearly symmetrical around a midline normal to its rotational axis, in addition to having rotational symmetry around that axis. (I.e., an elevation or plan view of the long side of such a symmetrical axle may show that the two halves on either side of the midpoint are either identical or mirror images, in contrast to asymmetrical axles for which the two halves on either side of the midline have different geometry or features.)", "", "The solid axle bushings may be extruded, molded, or otherwise produced before wheel assembly. Alignment features may be configured to maintain the symmetrical axle in a centered position with respect to the axle bushing.", "", "During the pre-assembly process into the mold, the symmetrical axles and axle bushings may be assembled together and then overmolded with polyurethane peripheral rollers. These cross roller sub-assemblies may then be placed into a mold along with the inner wheel hub where one is provided. Some of the positional tolerance may be taken up by the urethane wheel. During the final overmold, shut-off regions may be presented to prevent the overmolded plastic from interfering with the symmetrical axles, axle bushings, and/or polyurethane peripheral rollers.", "", "The process of overmolding polyurethane peripheral rollers to the symmetrical axles and axle bushings may also be performed in an alternative sequence. The symmetrical axles and axle bushings may first be assembled into pre-roller assemblies. These pre-roller assemblies may be organized and placed into a mold for a desired number of peripheral rollers. A wheel hub may then be injection overmolded, enclosing the pre-roller assemblies. Finally, the polyurethane peripheral rollers may be overmolded onto the pre-roller assemblies.", "", "In one embodiment, the peripheral rollers may be overmolded onto the axle bushings. A mold may be developed that accepts the peripheral roller and axle bushing units and allows for the overmolding of the symmetrical axles in place and in connection with the wheel hub, which may be molded separately or at the same time as the symmetrical axles.", "", "The configuration and techniques disclosed herein may provide a much stronger wheel design and may support quicker, simpler automated manufacturing and assembly of the disclosed omnidirectional wheel. It solves the problem of needing to assemble a split bushing onto a plastic hub over a roller pin axle and the subsequent need for a challenging overmold technique in the final molding operation. This disclosure allows for the difficult-to-manufacture parts to be made separately, along with one final overmold technique that would allow the hub to be overmolded rather than the polyurethane bushing.", "", "The advantages and improvements of this disclosure include the greater strength of the composite wheel and the ability to fully automate the process through the use of simple automation sortation tooling. While full automation may not be needed from the creation of the primary parts to finished composite part manufacturing, the disclosed solution provides a scall-invariant product design and greatly facilitates the application of automation and closed-loop control of the assembly. This disclosure greatly simplifies assembly by reducing the complexity of each individual part and subassembly and by employing overmolding to join all of the wheel components, essentially potting them together.", "", "FIG.1illustrates conventional components and techniques100in accordance with one embodiment. First, a hub or axle102may be injection molded in its final form. Then the separate components of bushings such as the split bushing with a spherical outer diameter104, split bushing with a cylindrical outer diameter108, or clamshell bushing112, may be injection molded. The component part106aand component part106bof the split bushing with a spherical outer diameter104, the identical component half110aand identical component half110bof the split bushing with a cylindrical outer diameter108, or the joined half114aand the joined half114bof the clamshell bushing112may next be clipped, snapped, or otherwise connected or engaged around the axle102or hub. The axle/bushing sub-assemblies may then be inserted into an overmolding process where the polyurethane cross rollers are processed. One wheel or multiple wheels joined together may create a conventional omnidirectional wheel assembly.", "", "Existing products may use such clamshell bushings or split bushings to provide the bearing surface between a polyurethane cross roller and hub or axle. Under extreme loading conditions, split- or clamshell-style bushings may exhibit weakness in compressive loading due to their split lines and non-homogeneous material. Additionally, two parts must be made separately and then assembled for such bushings, making them more complex parts to manufacture and assemble.", "", "FIG.2Aillustrates an omnidirectional wheel200ain accordance with one embodiment. The omnidirectional wheel200acomprises a wheel hub202having a main axle bore204and a main axis206, cross roller sub-assemblies208that include pre-roller assemblies210each comprising a symmetrical axle212and an axle bushing214, and a peripheral roller216, the wheel hub202comprising an inner wheel hub218and an outer wheel hub220, a peripheral axle ring222, and spokes224of the wheel hub202.", "", "The omnidirectional wheel200amay have a wheel hub202that includes a main axle bore204at its center, rotatable around a main axis206. The periphery of the wheel hub202may include a plurality of cross roller sub-assemblies208. The cross roller sub-assemblies208may each include a pre-roller assembly210comprising a symmetrical axle212and an axle bushing214. Each axle bushing214may be configured to receive one symmetrical axle212in a central longitudinal bore. The symmetrical axles212and axle bushings214may be pre-produced parts. They may be injection molded from plastic materials. The symmetrical axles212may be formed from metal in one embodiment. The cross roller sub-assemblies208may each further include a peripheral roller216. Each pre-roller assembly210may be overmolded with its peripheral roller216.", "", "In one embodiment, the wheel hub202may comprise an inner wheel hub218and an outer wheel hub220. The inner wheel hub218may be a pre-produced part, constructed of injection molded plastic materials. The outer wheel hub220may be overmolded onto the inner wheel hub218and pre-roller assemblies210or cross roller sub-assemblies208as described herein. The wheel hub202, and/or in one embodiment the outer wheel hub, may comprise a plurality of spokes224. Each cross roller sub-assembly208may be secured between two spokes of the overmolded wheel hub (i.e., the wheel hub202or outer wheel hub220).", "", "In this manner, a peripheral axle ring222adapted about the wheel and radially spaced from the main axis206may be formed, the omnidirectional wheel200ahaving the plurality of cross roller sub-assemblies208overmolded with the wheel hub202, to form the peripheral axle ring222.", "", "FIG.2Billustrates an omnidirectional wheel200bin accordance with one embodiment. The omnidirectional wheel200bcomprises a wheel hub202having a main axle bore204and a main axis206, cross roller sub-assemblies208that include pre-roller assemblies210each comprising a symmetrical axle212, an axle bushing214, and two washers226, and a peripheral roller216, the wheel hub202comprising spokes224, and the cross roller sub-assemblies208forming a peripheral axle ring222.", "", "The omnidirectional wheel200bmay have a wheel hub202that includes a main axle bore204at its center, rotatable around a main axis206. The periphery of the wheel hub202may include a plurality of cross roller sub-assemblies208. The cross roller sub-assemblies208may each include a pre-roller assembly210comprising a symmetrical axle212, an axle bushing214, and two washers226. Each axle bushing214may be configured to receive one symmetrical axle212in a central longitudinal bore. The symmetrical axles212and axle bushings214may be pre-produced parts. They may be injection molded from plastic materials. The symmetrical axles212may be formed from metal in one embodiment. The washers226may be disposed upon both ends of the assembled symmetrical axles212and axle bushings214. The cross roller sub-assemblies208may each further include a peripheral roller216. Each pre-roller assembly210may be overmolded with its peripheral roller216.", "", "The wheel hub202may comprise a plurality of spokes224. Each cross roller sub-assembly208may be secured between two spokes of the overmolded wheel hub202. In this manner, a peripheral axle ring222adapted about the wheel and radially spaced from the main axis206may be formed, the omnidirectional wheel200ahaving the plurality of cross roller sub-assemblies208overmolded with the wheel hub202, to form the peripheral axle ring222.", "", "FIG.3illustrates omnidirectional wheel movement degrees of freedom300in accordance with one embodiment. The omnidirectional wheels200amay roll in an in-line motion302as conventional wheels do, in a roll rotation around the main axis206that runs through the center of the main axle bore204. However, if in-line motion302of the wheel hub202around the main axis206is arrested, or the desired movement of equipment configured with the omnidirectional wheels200ais perpendicular to the in-line motion302, the omnidirectional wheels200amay also be capable of side-to-side or transverse motion304, due to the pitch rotation of the cross roller sub-assemblies208of the peripheral axle ring222configured along the perimeter of the inner wheel hub218.", "", "Note that the omnidirectional wheels200adisclosed herein may be prevented from moving in a swivel motion306(yaw rotation) to allow quicker and more secure stacking of equipment configured with such wheels. The primary benefit of omnidirectional wheels200amay be their maneuverability in tight spaces, even when swivel motion306is prevented.", "", "FIG.4A-FIG.4Cillustrate omnidirectional wheel pre-produced components400in accordance with one embodiment.FIG.4Aprovides isometric views of the omnidirectional wheel pre-produced components400,FIG.4Bprovides front elevation views, andFIG.4Cprovides side elevation views. The omnidirectional wheel pre-produced components400may comprise the symmetrical axles212, axle bushings214, peripheral rollers216, and inner wheel hub218introduced inFIG.2A.", "", "In one embodiment, the symmetrical axles212may have chamfered sides402which are symmetrical across a midline normal to their axis of rotation. This is illustrated in greater detail inFIG.7AandFIG.7B. The axle bushing214may include a central longitudinal bore404configured to accept the symmetrical axle212. As may be seen readily in the symmetrical axle212and axle bushing214ofFIG.4C, the central longitudinal bore404of the axle bushing214may have an inner diameter that is slightly larger than the outer diameter of the symmetrical axle212.", "", "The central longitudinal bore404may additionally include alignment features406to maintain the symmetrical axle212centered within the central longitudinal bore404, such that the symmetrical axle212and the axle bushing214may be maintained coaxial with each other, and with respect to their cross roller sub-assembly axis of rotation as part of the peripheral axle ring222. In one embodiment, the alignment features406may be additionally configured to maintain the symmetrical axle212and axle bushing214centered along a common midline normal to their axes of rotation. This geometry is illustrated in greater detail with respect toFIG.7AandFIG.7B. Such features may include low-friction protrusions within the central longitudinal bore404as shown by the alignment features406illustrated, or may be formed through other techniques that will be readily apprehended by one of ordinary skill in the art.", "", "FIG.5A-FIG.5Cillustrate an omnidirectional wheel assembly flow diagram500in accordance with one embodiment. The omnidirectional wheel pre-produced components400may be assembled as shown to form the omnidirectional wheel200a.", "", "Symmetrical axles212may be inserted into axle bushings214to form pre-roller assemblies210at step502. The pre-roller assemblies210together may be overmolded to form peripheral rollers216and complete the cross roller sub-assemblies208at step504a.", "", "The inner wheel hub218and a number of the cross roller sub-assemblies208, such as the twelve cross roller sub-assemblies208shown, may be placed in a mold600aat step506a. It will be readily understood by one of ordinary skill in the art that differing sizes of omnidirectional wheels200amay utilize more or fewer cross roller sub-assemblies208. While the illustrated example uses twelve cross roller sub-assembly208, an omnidirectional wheel200amay use four, five, six, eight, sixteen, or a variety of other cross roller sub-assembly208quantities as needed for the desired final design.", "", "The outer wheel hub220may then be overmolded around and among the omnidirectional wheel pre-produced components400at step508a. The wheel hub overmolding volume510may flow into the mold600ato form the spokes of the outer wheel hub220, each spoke encapsulating the ends of the symmetrical axles212of the cross roller sub-assemblies208to either side of it. In this manner, the peripheral axle ring may be formed, with the cross roller sub-assemblies208each centered between the spokes of the outer wheel hub220to create the finished omnidirectional wheel200a.", "", "Alternatively, the cross roller sub-assemblies208created in step504amay be placed in a mold600bin step506b, with no pre-produced inner wheel hub218. This is illustrated inFIG.5B. In such an embodiment, the wheel hub overmolding volume510may be molded into a solid, single-part wheel hub overmolding volume510within and among the cross roller sub-assemblies208in step508bto create the finished omnidirectional wheel200a.", "", "In each case above, the cross roller sub-assemblies208may be carefully aligned in the molds and may have overmolding shutout regions present such as those shown for mold600aand mold600binFIG.6AandFIG.6B. This may produce an overmolded outer wheel hub220or wheel hub overmolding volume510that securely captures the ends of the symmetrical axles212while still permitting rotation of the peripheral rollers216and axle bushings214.", "", "As an additional alternative, the desired number of pre-roller assemblies210created in step502may be placed into mold600cwithout yet being overmolded with their peripheral rollers in step504b, shown inFIG.5C. Optionally, an inner wheel hub218may be placed into an embodiment of mold600cconfigured to accommodate this component.", "", "In step506c, a wheel hub overmolding volume510, which may include an optional inner overmolding fill512where an inner wheel hub218is not present in mold600c, may be overmolded within mold600cto form a pre-roller peripheral axle ring514around and connected to a wheel hub202. The wheel hub202and pre-roller peripheral axle ring514may in step508cbe placed in a mold600d, as illustrated inFIG.6D. A peripheral roller overmolding volume516may then be overmolded to form the cross roller sub-assemblies208enclosed in the wheel hub202to form the omnidirectional wheel200aas shown.", "", "FIG.6Aillustrates a mold600ain accordance with one embodiment. The mold600amay include seats for cross roller sub-assemblies602, a seat for an inner wheel hub604, an outer wheel hub overmolding volume606, and shut-off regions608.", "", "Each seat for a cross roller sub-assembly602may accept a cross roller sub-assembly208assembled as described with respect to step506aillustrated inFIG.5A. The seat for an inner wheel hub604may accept the pre-produced inner wheel hub218introduced inFIG.2A.", "", "While one half of the mold600ais illustrated herein, it will be readily understood by one of ordinary skill in the art that an additional, covering half, incorporating appropriate seats for cross roller sub-assemblies602, seat for an inner wheel hub604, and outer wheel hub overmolding volume606may be placed above the half shown, enclosing the cross roller sub-assemblies208, the inner wheel hub218, and the entire depth of the outer wheel hub overmolding volume606. In some embodiments, the two halves may be symmetrical. In other embodiments, one half may include profile differences from its mate that accommodate design asymmetrics in the pre-produced components and/or the intended outer wheel hub220.", "", "During the overmolding process, the outer wheel hub overmolding volume606may be filled with the selected overmolding material, and may securely capture the inner wheel hub218and the symmetrical axles212of the cross roller sub-assemblies208. Shut-off regions608may be presented during the overmolding process such that an overmolding material does not interfere with at least one of the symmetrical axles212, axle bushings214, and peripheral rollers216of the cross roller sub-assemblies208introduced inFIG.2A.", "", "In one embodiment, the shut-off regions608may prevent the overmolding material from interfering with the symmetrical axles212. In another embodiment, the shut-off regions608may prevent interference of overmolding material with the axle bushings214. In another embodiment, the shut-off region608may prevent interference of overmolding material with the peripheral rollers216. Other embodiments may incorporate shut-off regions608that prevent interference of overmolding material with any combination of these components. In embodiments wherein the pre-roller assemblies210include washers226, the shut-off regions608may incorporate the washers226or may be configured to prevent interference of overmolding material with the washers226.", "", "For example, in one embodiment, the shut-off regions608may prevent interference of overmolding material with the pre-roller assemblies210introduced inFIG.2A(i.e., the symmetrical axles212and axle bushings214assembled together). In another embodiment, the shut-off regions608may prevent interference of the overmolding material with the axle bushings214and overmolded peripheral rollers216. In another embodiment, the shut-off regions608may prevent the overmolding material from interfering with any components of the cross roller sub-assemblies208(i.e., shutting out all of the symmetrical axles212, axle bushings214, and peripheral rollers216).", "", "FIG.6Billustrates a mold600bin accordance with one embodiment. The mold600bmay include seats for cross roller sub-assemblies602and shut-off regions608similar to those described for the mold600aofFIG.6A. However, the mold600bmay omit the seat for an inner wheel hub604, and may include a wheel hub overmolding volume610supporting the formation of a solid, single-piece wheel hub overmolding volume510as described with respect to steps506band508billustrated inFIG.5B. As described with respect to the mold600a, an overlying half of the mold600b, while not illustrated, may be understood to be provided, either symmetrical in profile with the mold600bshown or differing in profile.", "", "It may be well understood by one of ordinary skill in the art that, while the mold configurations illustrated herein are shown as separate molds for simplicity, a single mold may be used incorporating the features and capabilities of both mold600aand mold600b. The inner wheel hub may have the same profile as is desired for the corresponding portion of a single-piece overmolded wheel hub, and so a pre-produced inner wheel hub may be seated in a mold that is also suitable for forming a single-piece overmolded wheel hub, the process difference being the amount of overmold material used. Similarly, a single mold may have a portion accepting inserts that form, accommodate, or mask features desired to be varied among wheel designs.", "", "FIG.6Cillustrates a mold600cin accordance with one embodiment. The mold600cmay include seats for pre-roller assemblies616, and in one embodiment may include an optional seat for an inner wheel hub618, which may be placed in the mold600cas shown with respect to step506c, illustrated inFIG.5C. The mold600cmay also include a wheel hub overmolding volume612which may include or exclude a volume otherwise occupied by the inner wheel hub, as appropriate to the desired design.", "", "First shut-off regions620may be provided as shown, such that the symmetrical axles of each pre-roller assembly may be overmolded with the wheel hub overmolding volume612while the overmolding material may be prevented from interfering with at least one of the symmetrical axles and the axle bushings of the pre-roller assemblies. In one embodiment, the first shut-off regions620may prevent interference of overmolding material with the symmetrical axles. In one embodiment, the first shut-off regions620may prevent interference of overmolding material with the axle bushings. In one embodiment, the first shut-off regions620may prevent interference of overmolding material with both the symmetrical axles and the axle bushings. In embodiments wherein the pre-roller assemblies210include washers226, the first shut-off regions620may incorporate the washers226or may be configured to prevent interference of overmolding material with the washers226.", "", "As described with respect to the mold600a, an overlying half of the mold600c, while not illustrated, may be understood to be provided, either symmetrical in profile with the mold600cshown or differing in profile.", "", "FIG.6Dillustrates a mold600din accordance with one embodiment. The mold600dmay include a seat for an overmolded wheel hub and pre-roller assemblies614, configured to accept the pre-roller peripheral axle ring and wheel hub as shown in step508cofFIG.5C. The mold600dmay further include peripheral roller overmolding volumes622such that the peripheral rollers may be overmolded onto the pre-roller assemblies.", "", "Second shut-off regions624may be provided as shown, such that the overmolding material of the peripheral roller overmolding volume622may be molded onto the axle bushings of the pre-roller assembly210to form the peripheral rollers without interfering with the symmetrical axles or the spokes of the wheel hub. In another embodiment, the second shut-off regions624may prevent interference of the overmolding material with the wheel hub, the symmetrical axles, and the axle bushings. In embodiments wherein the pre-roller assemblies210include washers226, the second shut-off regions624may incorporate the washers226or may be configured to prevent interference of overmolding material with the washers226.", "", "As described with respect to the mold600a, an overlying half of the mold600d, while not illustrated, may be understood to be provided, either symmetrical in profile with the mold600dshown or differing in profile.", "", "In one embodiment, the mold600cmay be a first mold used during a process or routine for manufacturing the omnidirectional wheel200a, such as is illustrated by the omnidirectional wheel assembly flow diagram500ofFIG.5A-FIG.5Cand/or the routine800ofFIG.8, and the mold600dmay be a second mold used during a later step of that process or routine. It may be well understood by one of ordinary skill in the art, however, that, while the mold configurations illustrated herein are shown as separate molds for simplicity, a single mold may be used incorporating the features and capabilities of both mold600cand mold600d. The inner wheel hub may have the same profile as is desired for the corresponding portion of a single-piece overmolded wheel hub, and so a pre-produced inner wheel hub may be seated in a mold that is also suitable for forming a single-piece overmolded wheel hub, the process difference being the amount of overmold material used.", "", "Similarly, a single mold may have a portion accepting inserts that form, accommodate, or mask features desired to be varied among wheel designs. Thus, one mold may be configured to accept an insert allowing the pre-roller assemblies to seat and having suitable shut-off regions and overmolding volume for molding the wheel hub. The underlying mold may, when such an insert is removed, include seating, shut-off regions, and overmolding volumes suitable for overmolding the peripheral rollers. The configurations shown inFIG.6A-FIG.6Dare intended to illustrate exemplary molds for use in the disclosed methods, but other configurations will immediately present themselves to one of ordinary skill in the art.", "", "FIG.7AandFIG.7Billustrate a peripheral axle ring configuration700in accordance with one embodiment.FIG.7Ashows the entirety of the peripheral axle ring222andFIG.7Bshows a detailed view centered on the topmost cross roller sub-assembly208, which may be considered representative of all cross roller sub-assemblies208configured in the peripheral axle ring222.", "", "The dashed lines inFIG.7Ashow the wheel hub spoke bisectors, such as wheel hub spoke bisector702aand wheel hub spoke bisector702b. The wheel hub spoke bisectors are geometric lines that each run through the main axis206and divide each spoke224in half. Adjacent wheel hub spoke bisectors, such as wheel hub spoke bisector702aand wheel hub spoke bisector702b, may meet at the main axis206to form a central angle704. The central angle704may be measured in degrees and may be determined by dividing the full 360 degrees of the wheel hub by the number of spokes224. In the example illustrated, the twelve spokes of the wheel hubs202divide the 360 degrees of the wheel hub202periphery by twelve, giving a central angle704, as defined by wheel hub spoke bisector702aand wheel hub spoke bisector702b, of 30 degrees.", "", "Each cross roller sub-assembly208may have a cross roller sub-assembly axis of rotation706. The cross roller sub-assembly axis of rotation706may be colinear with a latitudinal midline of the symmetrical axle212of the cross roller sub-assembly208, as shown by the heavier dotted lines that bisect each cross roller sub-assembly208illustrated inFIG.7A. The cross roller sub-assembly axes of rotation706may tangentially define a pitch circle708of the peripheral axle ring222, depicted here with a heavy solid line. This pitch circle708may be centered on the main axis206and may provide a continuous rotational axis in support of the rotational motion about the y-axis (pitch), normal to roll rotation about the main axis206in the x dimension. This in turn provides the transverse motion304illustrated inFIG.3, regardless of the orientation of the cross roller sub-assemblies208with respect to a surface of movement (e.g., a floor or ground surface). This may be seen in particular with regard to the double omnidirectional wheels902and triple omnidirectional wheels904discussed below with respect toFIG.9-FIG.10C.", "", "InFIG.7B, a cross roller sub-assembly208is shown in detail secured between spokes224of the wheel hub202previously introduced. The components of the cross roller sub-assembly208(i.e., the symmetrical axle212, axle bushing214, and peripheral roller216) may be centered in the z dimension (and in the x dimension, though this is not shown) at the cross roller sub-assembly axis of rotation706, and may be centered in the y dimension at a cross roller sub-assembly midline710. The cross roller sub-assembly midline710may be considered as the geometrical line dividing the cross roller sub-assembly208in half longitudinally. The cross roller sub-assembly midline710may be a bisector of the central angle704formed by the wheel hub spoke bisector702aand wheel hub spoke bisector702bat the main axis206. Thus, within a reasonable manufacturing tolerance, the cross roller sub-assemblies208of a completed omnidirectional wheel200amay be considered as being centered between adjacent spokes224of the wheel hub202.", "", "The shut-off regions608, first shut-off regions620, and/or second shut-off regions624ofFIG.6A-FIG.6Dmay provide a gap712between each spoke224and the side of the adjacent cross roller sub-assembly208. In this manner, the wheel hub202may securely capture the symmetrical axle212while allowing the peripheral roller216and axle bushing214to roll freely. In one embodiment, where washers226are included in the pre-roller assemblies210, the washers226may inhabit this gap as illustrated herein. The overmolding of the wheel hub202may be performed with shut-off regions that prevent impingement of the overmold material upon the washers226, or the washers226may act to shut off material from interfering with the symmetrical axle212, the axle bushing214, and/or the peripheral roller216of the cross roller sub-assembly208.", "", "The cross roller sub-assembly208may be dimensioned and disposed such that the chamfered side402of the symmetrical axle212may be aligned with the wheel hub spoke bisector702aas shown while providing clearance714ato prevent interference between the symmetrical axle212of the cross roller sub-assembly208and an adjacent symmetrical axle of an adjacent cross roller sub-assembly716. Similarly, the opposite chamfered side402may be aligned with the wheel hub spoke bisector702bwhile providing clearance714b. These clearances between the chamfered sides402of the symmetrical axle212and the corresponding chamfered sides402of adjacent symmetrical axles of adjacent cross roller sub-assemblies716may be uniform along their lengths in alignment with their intervening wheel hub spoke bisectors, as shown here by the clearance714abetween the symmetrical axle212and the adjacent symmetrical axle of an adjacent cross roller sub-assembly716. In one embodiment, the chamfered sides402of the symmetrical axle212may include indentations or protrusions, rather than a uniformly flat surface. In such an embodiment, clearance714amay not be uniform along the wheel hub spoke bisector702a, but adjacent chamfered sides402may exhibit a symmetrical, mirrored clearance profile.", "", "FIG.8illustrates a routine800for manufacturing an omnidirectional wheel200ain accordance with one embodiment. Although the example routine800depicts a particular sequence of operations, the sequence may be altered without departing from the scope of the present disclosure. For example, some of the operations depicted may be performed in parallel or in a different sequence that does not materially affect the function of the routine800. In other examples, different components of an example device or system that implements the routine800may perform functions at substantially the same time or in a specific sequence.", "", "According to some examples, the method includes providing a plurality of pre-roller assemblies, such as the pre-roller assemblies210introduced inFIG.2A, at block802. Each pre-roller assembly may include a symmetrical axle and an axle bushing, such as the symmetrical axle212and axle bushing214previously described. The symmetrical axles may be injection molded from plastic materials or may be formed from metal. They may have a chamfered side on each end. Each symmetrical axle may be oriented with each chamfered side aligned with a wheel hub spoke bisector of the overmolded wheel hub formed as described with respect toFIG.7B. Each chamfered side may be spaced the same distance from the wheel hub spoke bisector as the chamfered side of an adjacent symmetrical axle of an adjacent cross roller sub-assembly. Each axle bushing may be configured to receive one symmetrical axle in a central longitudinal bore. The axle bushings may be injection molded with an inside diameter of the central longitudinal bore being slightly larger than the diameter of the symmetrical axles. The axle bushings may have a cylindrical outer diameter in one embodiment. The axle bushings may have a spherical outer diameter in one embodiment.", "", "Alignment features may be provided on the symmetrical axles and/or the axle bushings that permit free rotation of the axle bushings with respect to the symmetrical axles, but maintain both components with their axes of rotation colinear, as described with respect toFIG.7B. Alignment features may also maintain the symmetrical axles and axle bushings centered with respect to a cross roller sub-assembly midline as shown inFIG.7B. If the manufacturing process involves next forming the cross roller sub-assemblies, as indicated at decision block804, the routine800may proceed to block806. Otherwise, the routine800may proceed to block812. According to some examples, the method includes overmolding each axle bushing of the pre-roller assemblies with a peripheral roller to form cross roller sub-assemblies at block806, such as the peripheral rollers216and cross roller sub-assemblies208introduced with respect toFIG.2A.", "", "According to some examples, the method includes placing each cross roller sub-assembly in a mold configured to form a peripheral axle ring adapted about the wheel and radially spaced from a main axis at block808. According to some examples, the method includes overmolding at least a portion of the cross roller sub-assemblies in the mold with a wheel hub, such as the wheel hub202ofFIG.2A, to form the peripheral axle ring at block810. The wheel hub may include a main axle bore rotatable around the main axis. The wheel hub may comprise a number of spokes. Each cross roller sub-assembly may be secured between two spokes of the overmolded wheel hub. The wheel hub may comprise an inner wheel hub and an outer wheel hub, such as the inner wheel hub218and outer wheel hub220illustrated inFIG.2A. The inner wheel hub may be pre-produced, such as the inner wheel hub218introduced inFIG.2A, and may be placed in the mold with the cross roller sub-assemblies in block808. The inner wheel hub and the symmetrical axles of the cross roller sub-assemblies may both then be overmolded with the outer wheel hub to form the wheel hub in block810. Shut-off regions such as those described with respect toFIG.6A-FIG.6Dmay be provided in the mold. Overmolding material may thereby be prevented from interfering with at least one of the plurality of symmetrical axles, the plurality of axle bushings, and the plurality of peripheral rollers of the cross roller sub-assemblies.", "", "According to some examples, the method includes placing each pre-roller assembly in a mold configured to form a peripheral axle ring adapted about the wheel and radially spaced from a main axis at block812. This may be performed before the peripheral rollers are molded onto the pre-roller assemblies to form the cross roller sub-assemblies.", "", "According to some examples, the method includes overmolding the symmetrical axles of the pre-roller assemblies in the mold with a wheel hub to form the pre-roller peripheral axle ring at block814. The wheel hub may include a main axle bore rotatable around the main axis. The wheel hub may comprise a number of spokes. Each pre-roller assembly may be secured between two spokes of the overmolded wheel hub. The wheel hub may comprise an inner wheel hub and an outer wheel hub. The inner wheel hub may be pre-produced, such as the inner wheel hub218introduced inFIG.2A, and may be placed in the mold with the pre-roller assemblies at block812. The inner wheel hub and the symmetrical axles of the pre-roller assemblies may both then be overmolded with the outer wheel hub to form the wheel hub in block814. First shut-off regions, such as the first shut-off regions620described with respect toFIG.6C, may be provided in the mold, thereby preventing the overmolding material from interfering with at least one of the plurality of symmetrical axles, and the plurality of axle bushings of the pre-roller assemblies.", "", "According to some examples, the method includes placing the pre-roller peripheral axle ring and overmolded wheel hub in a mold configured to form peripheral rollers at block816. According to some examples, the method includes overmolding each axle bushing of the pre-roller assemblies with a peripheral roller to form cross roller sub-assemblies at block818. Second shut-off regions, such as the second shut-off regions624described with respect toFIG.6D, may be provided in the mold for overmolding each axle bushing of the plurality of pre-roller assemblies with the peripheral roller.", "", "FIG.9illustrates exemplary omnidirectional wheel configurations900in accordance with one embodiment. The exemplary omnidirectional wheel configurations900may include a double omnidirectional wheel902, similar to a Rotacaster R2 wheel, and a triple omnidirectional wheel904, similar to a Rotacaster R3 wheel, and wheel brackets906for each configuration. An isometric view908, a side elevation view910, a front elevation view912, and a plan view of the wheel bracket914are shown for each of the exemplary omnidirectional wheel configurations900.", "", "The exemplary omnidirectional wheel configurations900may have several steel mounts available for each example. These wheels may be manufactured with a slimmer profile than is possible when using plastic. This may make them easier to nest and may improve nesting density for nestable equipment using the omnidirectional wheels200a. One downside to using this type of wheel is that they may need additional assembly and hardware to attach them to the cart deck using the wheel brackets906.", "", "FIG.10A-FIG.10Cillustrate omnidirectional wheel configuration cross sections1000in accordance with one embodiment.FIG.10Ashows an omnidirectional wheel200ain cross-section,FIG.10Bshows two omnidirectional wheels200aassembled as a double omnidirectional wheel902in cross-section, andFIG.10Cshows three omnidirectional wheels200aassembled as a triple omnidirectional wheel904in cross-section.", "", "In one embodiment, the inner wheel hub218of the omnidirectional wheel200amay have a smooth side1002and a raised side1004. When assembled to form the double omnidirectional wheel902, the smooth sides1002of the two wheels may face each other as shown inFIG.10B, with both outer-facing sides of the joined wheels being their raised sides1004. In one embodiment, wheels having two smooth sides1002may be configured between wheels having outer-facing raised sides1004as shown inFIG.10C. One of ordinary skill in the art will readily apprehend that the two wheels of the double omnidirectional wheel902and the three wheels of the triple omnidirectional wheel904may all have one smooth side1002and one raised side1004, oriented all right-facing, all left-facing, or any combination thereof, or may have interlocking features that support solid and steady contact among the wheels, preventing independent in-line motion302of any wheel with respect to the others.", "", "As shown inFIG.10BandFIG.10C, omnidirectional wheels200aplaced side by side to form the double omnidirectional wheel902and the triple omnidirectional wheel904may be rotated with respect to each other so as to align the cross roller sub-assembly midlines of one omnidirectional wheel200awith the wheel hub spoke bisectors between cross roller sub-assemblies208of the adjacent omnidirectional wheel200a, such that the circumferences of the double omnidirectional wheel902and the triple omnidirectional wheel904contain no gaps between cross roller sub-assemblies208in contact with a surface of motion (e.g., floor or ground surface), supporting case of transverse motion304of the omnidirectional wheel as shown inFIG.3. For example, with omnidirectional wheels200ahaving twelve cross roller sub-assemblies208, a rotation of 15 degrees from one omnidirectional wheel200ato the next omnidirectional wheel200amay allow the peripheral rollers of one wheel to be centered in the gaps between peripheral rollers of the next wheel, providing an overall circumference with no gaps between cross roller sub-assemblies208.", "", "FIG.11AandFIG.11Billustrate an omnidirectional wheel in a drop test rig1100in accordance with one embodiment. The test rig1102may maintain a test bracket1104at a test drop height1106above a test rig base1108until a test bracket release1110is activated. A wheel assembly1112may be attached to the test bracket1104to undergo drop testing. The impact forces applied to the wheel assembly1112may be varied by adjusting the test drop height1106or by applying weights to the test bracket1104, as will be readily understood by one of ordinary skill in the art.", "", "FIG.11Bprovides a detailed view of the wheel in the drop test rig. When the test bracket release1110is pushed1114or otherwise activated, the test bracket1104and wheel assembly1112drop1116, impacting the test rig base1108with gravity-induced forces determined by the test drop height1106and the weight of the test bracket1104.", "", "FIG.12illustrates drop test results for a conventional wheel1200. The drop tests were performed using the omnidirectional wheel in a drop test rig1100illustrated inFIG.11AandFIG.11B. On the first test, after a drop from the test height, the conventional wheel1202bounced on its resilient tire and did not suffer any visual damage. However, on rotating it, minor bearing damage could be detected. On the second test, with approximately 25 KN of force applied, the wheel plate failed, and the damage1204rendered the conventional wheel1202completely unusable.", "", "FIG.13illustrates drop test results for an omnidirectional wheel1300in accordance with one embodiment. The drop tests were performed using the omnidirectional wheel in a drop test rig1100illustrated inFIG.11AandFIG.11B. After three drops from the test height with 50 KN of force, the omnidirectional wheel200awas still operational with some light damage1302, as indicated inFIG.13.", "", "Within this disclosure, different entities (which may variously be referred to as “units,” “circuits,” other components, etc.) may be described or claimed as “configured” to perform one or more tasks or operations. This formulation-[entity] configured to [perform one or more tasks]—is used herein to refer to structure (i.e., something physical, such as an electronic circuit). More specifically, this formulation is used to indicate that this structure is arranged to perform the one or more tasks during operation. A structure may be said to be “configured to” perform some task even if the structure is not currently being operated. Thus, an entity described or recited as “configured to” perform some task refers to something physical. The term “configured to” is not intended to mean “configurable to.” Reciting in the appended claims that a structure is “configured to” perform one or more tasks is expressly intended not to invoke 35 U.S.C. § 112 (f) for that claim element. Accordingly, claims in this application that do not otherwise include the “means for” [performing a function] construct should not be interpreted under 35 U.S.C § 112 (f).", "", "As used herein, the term “based on” is used to describe one or more factors that affect a determination. This term does not foreclose the possibility that additional factors may affect the determination. That is, a determination may be solely based on specified factors or based on the specified factors as well as other, unspecified factors. Consider the phrase “determine A based on B.” This phrase specifies that B is a factor that is used to determine A or that affects the determination of A. This phrase does not foreclose that the determination of A may also be based on some other factor, such as C. This phrase is also intended to cover an embodiment in which A is determined based solely on B. As used herein, the phrase “based on” is synonymous with the phrase “based at least in part on.”", "", "As used herein, the phrase “in response to” describes one or more factors that trigger an effect. This phrase does not foreclose the possibility that additional factors may affect or otherwise trigger the effect. That is, an effect may be solely in response to those factors or may be in response to the specified factors as well as other, unspecified factors. Consider the phrase “perform A in response to B.” This phrase specifies that B is a factor that triggers the performance of A. This phrase does not foreclose that performing A may also be in response to some other factor, such as C. This phrase is also intended to cover an embodiment in which A is performed solely in response to B.", "", "As used herein, the terms “first,” “second,” etc. are used as labels for nouns that they precede and do not imply any type of ordering (e.g., spatial, temporal, logical, etc.), unless stated otherwise. For example, in a register file having eight registers, the terms “first register” and “second register” can be used to refer to any two of the eight registers, and not, for example, just logical registers 0 and 1.", "", "When used in the claims, the term “or” is used as an inclusive or and not as an exclusive or. For example, the phrase “at least one of x, y, or z” means any one of x, y, and z, as well as any combination thereof.", "", "As used herein, a recitation of “and/or” with respect to two or more elements should be interpreted to mean only one element or a combination of elements. For example, “element A, element B, and/or element C” may include only element A, only element B, only element C, element A and element B, element A and element C, element B and element C, or elements A, B, and C. In addition, “at least one of element A or element B” may include at least one of element A, at least one of element B, or at least one of element A and at least one of element B. Further, “at least one of element A and element B” may include at least one of element A, at least one of element B, or at least one of element A and at least one of element B.", "", "The subject matter of the present disclosure is described with specificity herein to meet statutory requirements. However, the description itself is not intended to limit the scope of this disclosure. Rather, the inventors have contemplated that the claimed subject matter might also be embodied in other ways, to include different steps or combinations of steps similar to the ones described in this document, in conjunction with other present or future technologies. Moreover, although the terms “step” and/or “block” may be used herein to connote different elements of methods employed, the terms should not be interpreted as implying any particular order among or between various steps herein disclosed unless and except when the order of individual steps is explicitly described.", "", "Having thus described illustrative embodiments in detail, it will be apparent that modifications and variations are possible without departing from the scope of this disclosure as claimed. The scope of disclosed subject matter is not limited to the depicted embodiments but is rather set forth in the following Claims."], "claims": ["a wheel hub including a main axle bore rotatable around a main axis; a plurality of cross roller sub-assemblies comprising: a plurality of pre-roller assemblies including: a plurality of symmetrical axles; and a plurality of axle bushings, each axle bushing configured to receive one symmetrical axle in a central longitudinal bore; and a plurality of peripheral rollers, each pre-roller assembly overmolded with one peripheral roller; a peripheral axle ring adapted about the wheel and radially spaced from the main axis, the wheel having the plurality of cross roller sub-assemblies overmolded with the wheel hub, wherein the overmolded cross roller sub-assemblies form the peripheral axle ring.", "2 . The wheel of claim 1 , wherein the wheel hub comprises an inner wheel hub and an outer wheel hub, wherein the inner wheel hub is overmolded with the outer wheel hub.", "3 . The wheel of claim 1 , wherein the overmolded wheel hub comprises a plurality of spokes, and each cross roller sub-assembly is secured between two spokes of the overmolded wheel hub.", "4 . The wheel of claim 1 , wherein the symmetrical axles have a chamfered side on each end.", "wherein each symmetrical axle is oriented with each chamfered side aligned with a wheel hub spoke bisector, and wherein each chamfered side is spaced the same distance from the wheel hub spoke bisector as the chamfered side of an adjacent symmetrical axle of an adjacent cross roller sub-assembly.", "6 . The wheel of claim 1 , wherein the plurality of axle bushings each have a cylindrical outer diameter.", "7 . The wheel of claim 1 , wherein the plurality of axle bushings each have a spherical outer diameter.", "8 . The wheel of claim 1 , wherein the symmetrical axles are cross rolling pins.", "9 . The wheel of claim 1 , wherein the symmetrical axles are made of at least one of metal and plastic materials.", "10 . The wheel of claim 1 , wherein shut-off regions are presented during the overmolding of the plurality of cross roller sub-assemblies with the wheel hub such that an overmolding material does not interfere with at least one of the plurality of symmetrical axles, the plurality of axle bushings, and the plurality of peripheral rollers of the cross roller sub-assemblies.", "providing: a plurality of pre-roller assemblies including: a plurality of symmetrical axles; and a plurality of axle bushings, each axle bushing configured to receive one symmetrical axle in a central longitudinal bore; overmolding each axle bushing of the plurality of pre-roller assemblies with a peripheral roller to form a plurality of cross roller sub-assemblies; on condition the cross roller sub-assemblies have been formed: placing, in a mold, each cross roller sub-assembly, the mold configured to form a peripheral axle ring adapted about the wheel and radially spaced from a main axis; and overmolding at least a portion of the cross roller sub-assemblies in the mold with a wheel hub to form the peripheral axle ring, wherein the wheel hub includes a main axle bore rotatable around the main axis; on condition the cross roller sub-assemblies have not been formed: placing, in the mold, each pre-roller assembly, the mold configured to form a pre-roller peripheral axle ring adapted about the wheel and radially spaced from the main axis; and overmolding the symmetrical axles of the pre-roller assemblies in the mold with the wheel hub to form the pre-roller peripheral axle ring, wherein the wheel hub includes the main axle bore rotatable around the main axis.", "12 . The method of claim 11 , wherein the overmolding of each pre-roller assembly with the peripheral roller occurs after the overmolding of the symmetrical axles of the pre-roller assemblies.", "placing the inner wheel hub in the mold with the cross roller sub-assemblies; overmolding the inner wheel hub and the symmetrical axles of the cross roller sub-assemblies with the outer wheel hub.", "providing shut-off regions in the mold, for the overmolding of at least portions of the cross roller sub-assemblies in the mold, with the wheel hub, to form the peripheral axle ring, wherein an overmolding material does not interfere with at least one of the plurality of symmetrical axles, the plurality of axle bushings, and the plurality of peripheral rollers of the cross roller sub-assemblies.", "providing first shut-off regions in the mold, for overmolding of the symmetrical axles of the pre-roller assemblies with the wheel hub, wherein an overmolding material does not interfere with at least one of the plurality of symmetrical axles, and the plurality of axle bushings of the pre-roller assemblies, and providing second shut-off regions in the mold, for overmolding each axle bushing of the plurality of pre-roller assemblies with the peripheral roller, wherein the overmolding of each axle bushing of the plurality of pre-roller assemblies with the peripheral roller occurs after the overmolding of the symmetrical axles with the wheel hub.", "16 . The method of claim 11 , wherein the overmolded wheel hub comprises a plurality of spokes and each cross roller sub-assembly is secured between two spokes of the overmolded wheel hub.", "orienting each symmetrical axle with each chamfered side aligned with a wheel hub spoke bisector; and spacing each chamfered side the same distance from the wheel hub spoke bisector as the chamfered side of an adjacent symmetrical axle of an adjacent cross roller sub-assembly.", "18 . The method of claim 11 , further comprising injection molding the plurality of axle bushings with an inside diameter slightly larger than the symmetrical axles, each axle bushing having a cylindrical outer diameter.", "19 . The method of claim 11 , further comprising injection molding the plurality of axle bushings with an inside diameter slightly larger than the symmetrical axles, each axle bushing having a spherical outer diameter.", "20 . The method of claim 11 , further comprising injection molding the symmetrical axles with a chamfered side on each end."], "bibtex": "@patent{20240326512,\n    title = {OMNIDIRECTIONAL ROLLER WHEEL WITH SOLID BUSHING AND SYMMETRICAL AXLE},\n    number = {20240326512},\n    year = {2024},\n    note = {File: US20240326512A1-20241003.XML}\n    }", "classification": "B60B1900FI"}, {"title": "SUSTAINABLE TIRE PRODUCED WITH HIGH RECYCLED/RENEWABLE RAW MATERIAL CONTENT", "doc_number": "20240326513", "filename": "US20240326513A1-20241003.XML", "abstract": "It has been found that a pneumatic tire comprising non-ground contacting tire components each independently formed from a rubber composition comprising greater than 89% sustainable material content can be manufactured. In one scenario the pneumatic tire is comprised of bio-renewable organic materials, wherein the bio-based content of the organic materials is verifiable, and wherein radiocarbon 14 C dating according to ASTM method D6866 shows the level of bio-based content of the organic materials to be at least 40%. In a preferred embodiment the tire has an RFID tag affixed to the innerliner of the tire, wherein the RFID tag designates the level of bio-renewable organic materials in the tire.", "detailed_description": ["The present disclosure relates to a vehicle tire containing a majority weight percent of sustainable content. The disclosure further relates to reinforcements and rubber compounds and, more particularly, to a combination of such, incorporated in the tire. In rubber tire compounds, each material and additive are combined with elastomers to impart specific properties in the resulting rubber. There is a desire to reduce, or altogether exclude, from tires the parts and/or materials that originate from nonrenewable sources. Disclosed herein is a tire being formed from a majority content of sustainable material and parts and that replicates or exceeds the performance of a conventional tire.", "", "As used herein, the term “sustainable material” encompasses raw materials made from processes or technologies that reduce carbon emissions and/or resource consumption, and/or recycled, renewable, bio-based, bio-derived and mass balanced raw materials.", "", "As used herein, the term “bio-based” or “bio-derived” refers to a circular material or a material derived from a renewable or sustainable resource or natural source, and may even include an industrial source when, for example, a byproduct or waste product is being captured and reused (recycled) to reduce or eliminate emissions and/or landfill waste that is harmful to the environment. One non-limiting example is the sequestration of carbon oxides for use as feedstock.", "", "It partially, and more preferably fully, excludes radiocarbon and fossil carbon materials derived from petroleum, coal, or a natural gas source. Examples of resources from which the bio-based material can be derived include, but are not limited to, fresh (or from the fermentation) of biomass material, such as corn, vegetable oils, etc.", "", "As used herein “mass balanced” means that at least a portion of the feedstock used to synthesize a material, such as a rubber polymer, resin or filler, is circular or bio-based. In practice, the production of carbon black or polymers can be certified as using mass-balanced principles. Carbon black can be synthesized using a percentage of circular tire pyrolysis oil (TPO) and traditional petroleum-based feedstock. Likewise, in the contemplated embodiment, at least 0.1%, and more preferably at least 1%, and most preferably at least 5%, of the feedstock to produce the polymer is circular or bio-based. In other words, a contemplated polymer or filler is produced from a mass balance of bio-based feedstock and traditional feedstock. One non-limiting example of a bio-based feedstock includes tall oil but may also include biomass, byproduct and waste products discussed supra. The term “mass-balanced” may also refer to carbon black and other byproducts obtained from the pyrolysis of scrap tires. A mass-balanced material is typically certified to the International Sustainability & Carbon Certification (ISCC) standard.", "", "As used herein, the terms “compounded rubber”, “rubber compound” and “compound” refer to rubber compositions containing elastomers which have been compounded, or blended, with appropriate rubber compounding ingredients. The terms “rubber” and “elastomer” and “polymer” may be used interchangeably unless otherwise indicated. It is believed that such terms are well known to those having skill in the art.", "", "As used herein, except where context requires otherwise, the term “comprise” and variations of the term, such as “comprising”, “comprises” and “comprised”, are not intended to exclude further additives, components, integers, or steps. As used herein, the words “from about” means approximately and can includes values±1 beyond the ones listed herein.", "", "A key aspect of the disclosure is the percent weight content of sustainable content in the tire achieved using a combination of various renewable, bio-based, bio-derived, recycled, and/or mass balanced materials, and/or materials made from processes or technologies that reduce carbon emissions and/or resource consumption.", "", "It is envisioned that the rubber compositions for these, inter alia, tire components may be formed from a combination of materials that create a final tire having between 50 weight percent (wt %) to 100 wt % sustainable content. In the contemplated embodiment, a combination of tire components is assembled to form greater than 50 wt % sustainable tire. The rubber compositions of individual tire components may each be independently formed from 0.01 to 100 wt % sustainable content but assembled in a tire to achieve a sustainable tire having at least 50 weight percent (wt %) and, more preferably, at least 60 wt % and, most preferably, at least 80 wt % of sustainable content measured relative to 100 wt % of a tire. In the working samples shown infra, one embodiment of the invention is a tire that achieves at least 88 wt % of sustainable content measured relative to 100 wt % of a tire.", "", "Example materials that can be employed in the tire components can include, without limiting said materials to those disclosed below, natural rubber and synthetic polymers; fillers; plasticizers; vulcanizers; accelerators; and other additives."], "claims": ["wherein the tire parts are each formed from a diene rubber composition comprising a mass-balance synthetic polymer; wherein the diene rubber is present at greater than 35% by weight in the tire; and wherein the tire is formed from greater than about 85% by weight of content made from processes or technologies that reduce carbon emissions and/or resource consumption, and/or recycled, renewable, bio-based, bio-derived, and mass balance raw materials; wherein the bio-based content of the tire is verifiable, and wherein radiocarbon", "2 . The tire of claim 1 , wherein each tire component is further formed from or coated with a rubber composition comprising at least one material selected from a group consisting of: natural rubbers; fatty acids; bio-based resins such as terpene and/or rosin-based resins; bio-based coupling agents and/or systems; vegetable triglyceride oil; fillers including carbon black derived from bio-derived, bio-recycled, recycled (circular) feedstocks, or produced from technologies that reduce carbon emissions/conserve resources and/or rice husk ash silica; recycled materials such as zinc oxide, steel and/or polyester; and lignin-based antiozonant or antioxidant.", "3 . The tire of claim 1 further comprising at least one reinforcement characterized by greater than or equal to 65 percent by weight recycled and/or renewable content.", "the belt wire being characterized by greater than or equal to 85 percent by weight sustainable material content; the bead wire being characterized by greater than or equal to 85 percent by weight sustainable material content; the gum strip being characterized by greater than or equal to 89 percent by weight sustainable material content; the wire coat characterized by greater than or equal to 90 percent by weight sustainable material content; the apex being characterized by greater than or equal to 90 percent by weight sustainable material content; the bead coat being characterized by greater than or equal to 91 percent by weight sustainable material content; the base being characterized by greater than or equal to 93 percent by weight sustainable material content; the plycoat being characterized by greater than or equal to 93 percent by weight sustainable material content; the tread characterized by greater than or equal to 93 percent by weight sustainable material content; the sidewall being characterized by greater than or equal to 93 percent by weight sustainable material content; the overlay being characterized by greater than or equal to 94 percent by weight sustainable material content; the toeguard being characterized by greater than or equal to 95 percent by weight sustainable material content; and the chafer being characterized by greater than or equal to 95 percent by weight sustainable material content.", "5 . The pneumatic tire of claim 2 , wherein the tire components are selected from the group comprising: bead coat; apex; tread base; wire coat; gum strip; inline overlay; plycoat; sidewall; inner liner; and chafer or toe guard.", "the at least one liner providing greater than or equal to 2.0% of the overall sustainable material content in the tire; the at least one gum strip providing greater than or equal to 1.0% of the overall sustainable material content in the tire; the at least one wire coat providing greater than or equal to 5.5% of the overall sustainable material content in the tire; the at least one apex providing greater than or equal to 2.0% of the overall sustainable material content in the tire; the at least one bead coat providing greater than or equal to 0.3% of the overall sustainable material content in the tire; the at least one base providing greater than or equal to 4.0% of the overall sustainable material content in the tire; the at least one plycoat providing greater than or equal to 10.0% of the overall sustainable material content in the tire; the at least one tread providing greater than or equal to 28.0% of the overall sustainable material content in the tire; the at least one sidewall providing greater than or equal to 9.0% of the overall sustainable material content in the tire; the at least one overlay providing greater than or equal to 1.75% of the overall sustainable material content in the tire; the at least one toeguard providing greater than or equal to 3.0% of the overall sustainable material content in the tire; the at least one chafer providing greater than or equal to 3.25% of the overall sustainable material content in the tire; the at least one polyester providing greater than or equal to 4.0% of the overall sustainable material content in the tire; the at least one polyamide providing greater than or equal to 0.6% of the overall sustainable material content in the tire; and a combination of the above.", "a belt wire providing greater than or equal to 5.0% weight of the overall sustainable material content in the tire; and a bead wire providing greater than or equal to 4.5% weight of the overall sustainable material content in the tire.", "at least one polyester providing greater than or equal to 4.0% weight of the overall sustainable material content in the tire; and at least one polyamide providing greater than or equal to 0.6% weight of the overall sustainable material content in the tire.", "9 . The tire of claim 1 , wherein the beadcoat coats two spaced apart beads, wherein the beads and the sidewall extend radially from and connect a tread to the beads, the tire being formed from rubber compositions comprising at least one of a mass-balanced SBR and/or polybutadiene in the tread, the sidewall and the bead coat.", "at least a mass-balanced SSBR in the tread; at least a mass-balanced polybutadiene in the sidewall; and at least a mass-balanced ESBR in the beadcoat.", "a carbon black derived from a CO a carbon black derived from end-of-life (ELT) pyrolysis oil in the sidewall; a carbon black derived from methane pyrolysis in the sidewall; and a carbon black derived from plant-based oil in the beadcoat, wherein the diene rubber composition comprising a mass-balance synthetic polymer is void of isoprene-butadiene rubbers.", "12 . The tire of claim 4 , wherein the bead coat is comprised of emulsion styrene-butadiene rubber, soybean oil, and carbon black from plant based oil, and wherein the bead coat is characterized by having a verifiable bio-based content by radiocarbon 14 C dating according to ASTM method D6866 of than greater than or equal to 91 percent.", "13 . The tire of claim 4 , wherein the apex is comprised of natural rubber and carbon black from plant based oil, and wherein the apex is characterized by having a verifiable bio-based content by radiocarbon 14 C dating according to ASTM method D6866 of than greater than or equal to 90 percent.", "14 . The tire of claim 4 , wherein the tread is comprised of polybutadiene rubber, natural rubber, and carbon black from ELT pyrolysis oil, and wherein the tread is characterized by having a verifiable bio-based content by radiocarbon 14 C dating according to ASTM method D6866 of than greater than or equal to 93 percent.", "15 . The tire of claim 4 , wherein the sidewall is comprised of polybutadiene rubber, natural rubber, soybean oil, and carbon black from ELT pyrolysis oil, and wherein the sidewall is characterized by having a verifiable bio-based content by radiocarbon 14 C dating according to ASTM method D6866 of than greater than or equal to 93 percent.", "16 . The tire of claim 4 , wherein the bead coat is comprised of emulsion styrene-butadiene rubber, soybean oil, and carbon black from plant based oil, wherein the bead coat is characterized by having a verifiable bio-based content by radiocarbon 14 C dating according to ASTM method D6866 of than greater than or equal to 91 percent, wherein the apex is comprised of natural rubber and carbon black from plant based oil, wherein the apex is characterized by having a verifiable bio-based content by radiocarbon 14 C dating according to ASTM method D6866 of than greater than or equal to 90 percent, wherein the tread is comprised of polybutadiene rubber, natural rubber, and carbon black from ELT pyrolysis oil, wherein the tread is characterized by having a verifiable bio-based content by radiocarbon 14 C dating according to ASTM method D6866 of than greater than or equal to 93 percent, wherein the sidewall is comprised of polybutadiene rubber, natural rubber, soybean oil, and carbon black from ELT pyrolysis oil, and wherein the sidewall is characterized by having a verifiable bio-based content by radiocarbon 14 C dating according to ASTM method D6866 of than greater than or equal to 93 percent.", "17 . A pneumatic tire which is comprised of a supporting carcass with an outer circumferential tread, two spaced beads, at least one ply extending from bead to bead, and sidewalls extending radially from and connecting said tread to said beads, wherein said circumferential tread is adapted to be ground-contacting, wherein said tire is comprised of bio-renewable organic materials, wherein the bio-based content of the organic materials is verifiable, and wherein radiocarbon 14 C dating according to ASTM method D6866 shows the level of bio-based content of the organic materials to be at least 40%.", "18 . The pneumatic tire of claim 17 wherein said tire has an RFID tag affixed thereto, wherein the RFID tag designates the level of bio-renewable organic materials in the tire.", "19 . The pneumatic tire of claim 18 wherein the tire includes an innerliner which is disposed inwardly from the supporting carcass of the tire and wherein the RFID tag is affixed to innerliner at a position in the sidewall area of the tire.", "20 . A method of separating used or flawed tires in a recycle stream based upon their content of bio-renewable organic materials which comprises passing a stream of tires containing the tires of claim 19 through a separator system which is comprised of a tire fed line, an interrogator, a separator, a diverter, and at least two recycle conveyance lines, wherein the tires are separated based upon the bio-based content of the organic materials in the tires."], "bibtex": "@patent{20240326513,\n    title = {SUSTAINABLE TIRE PRODUCED WITH HIGH RECYCLED/RENEWABLE RAW MATERIAL CONTENT},\n    number = {20240326513},\n    year = {2024},\n    note = {File: US20240326513A1-20241003.XML}\n    }", "classification": "B60C100FI"}, {"title": "TIRE COMPRISING A TREAD", "doc_number": "20240326514", "filename": "US20240326514A1-20241003.XML", "abstract": "The present invention is directed to a tire having a tread, wherein the tread comprises a rubber composition comprising from 80 phr to 100 phr of one or more solution-polymerized styrene butadiene rubbers; from 80 phr to 200 phr of filler comprising at least 40 phr of carbon black; from 10 phr to 100 phr of one or more liquid diene-based polymers; and from 10 phr to 80 phr of a terpene resin.", "detailed_description": ["FIG.1shows a nonlimiting embodiment of a tire tread 10 supported by reinforcing rubber plies. The tread 10 comprises a tread center portion 2 which is arranged between two outer tread shoulder portions 3. Each tread shoulder portion 3 has a tread cap shoulder portion 4 and a tread base shoulder portion 5 arranged below the tread cap shoulder portion 4. A pair of breaker plies comprises a first breaker ply 6 covered by a second breaker ply 7. Both breaker plies 6, 7 are covered by a radially wound ply strip 8 contacting the tread shoulder portion 3 (particularly the tread base shoulder portion 5) and the tread center portion 2.", "", "In accordance with the present embodiment of the tire tread 10, the tread cap shoulder portions 4 comprise a rubber composition as shown in the third column of below Table 1 (i.e. the Inventive Example).", "", "While only the tread cap shoulder portion 4 has in this embodiment the Inventive Example compound in accordance with an embodiment of the present invention, it is also possible that the whole tread or multiple portions of the tread comprise such a rubber compound. In the present embodiment, it is preferred that the tread center portion 2 has a further rubber composition having a higher abrasion resistance than the rubber composition of the tread cap shoulder portion 4. It is also possible, that the tread shoulder portion 3 has only one compound, i.e. without a tread cap/base construction. In the present embodiment, the rubber composition of the tread base shoulder portion 5 is preferably softer than the composition of the tread cap shoulder portion 4, which helps warming up the tire to reach the desired performance as early as possible. However, such a feature is not essential to the present invention which focuses rather on the rubber composition in the cap shoulder area contacting the road when driving, particularly when driving in curves. The shown tread 10 is an example of a rear tire tread of a motorcycle race tire which does not have circumferential grooves. The circumferential direction of the tread 10 and tire is indicated inFIG.1by the letter “c”. The radial direction of the tread 10 or tire is indicated by “r”. It extends perpendicularly from the axis of rotation of the tire (not shown). An axial direction, not depicted herein, extends perpendicularly to the radial direction r and the circumferential direction c. The axial direction can also be described as lateral direction. It can also be understood as being in parallel to the axis of the tire.", "", "The ply strip 8 is preferably a spirally wound ply strip 8 which is wound about the breakers 6, 7 with an angle of less than 5° with respect to the circumferential direction of the tire (or, in other words, with respect to the equatorial plane of the tire, which is known to the person skilled in the art). Preferably, such an angle is smaller than 2° or even smaller than 1º. Sometimes reference is also made in this context to a zero-degree ply strip, or overlay ply strip.", "", "TABLE 1Comparative ExampleInventive ExampleIngredientsAmounts in phrSSBR18383SSBR21717Liquid polymers35151Carbon Black4106106Oils54343Resin 16200Resin 27020Resin 3866Process Aids92.32.3Antidegradants104.64.6Stearic acid3.03.0Zinc oxide3.13.1Sulfur1.41.4Accelerators11881Solution-polymerized styrene butadiene rubber having 40% styrene and 14% vinyl and a Tg of −29° C.;2Solution-polymerized styrene butadiene rubber having 40% styrene and 39% vinyl and a Tg of −5° C.;3Liquid styrene butadiene rubber including 10 phr of a liquid styrene butadiene rubber having a Tg of minus 15° C. and 41 phr of a second liquid styrene butadiene rubber having a Tg of minus 21° C.;4Carbon black having an iodine adsorption number of 202 g/kg as Propel X14 from Cabot;5Oils including a blend of TDAE, SRAE and RAE oils;6Coumarone indene resin as Novares C120 from Rain Carbon;7Alpha pinene based terpene resin as Dercolyte A115 from DRT;8Alkylphenol resin as Koresin from BASF;9Fatty acid soaps as WB16 from Struktol;10Dihydroquinoline types and phenylenediamine types;11Accelerators including TBBS and TBzTD", "", "The rubber compositions shown in Table 1 can preferably be used as a tread or tread cap composition for a race tire, e.g., as a tread cap shoulder compound of the motorcycle tire tread 10 shown inFIG.1. The difference between the Comparative Example and the Inventive Example is that the Inventive Example comprises a terpene resin instead of a coumarone indene resin present in the Comparative Example, each at an amount of 20 phr. After testing, the inventors have unexpectedly discovered that the terpene resin surprisingly improves the warmup behavior of the tire, i.e., decreases the time the tire needs to provide good performance after the vehicle has started driving. While it may have been known in the art that the utilized terpene resin can provide an improved wet traction compared to some other resin types, the effect of improving warmup behavior compared to the comparative resin, in particular under dry conditions, has been newly identified.", "", "Further details in relation to the physical properties of both compounds are shown below in Table 2.", "", "TABLE 2PropertyComparative ExampleInventive ExampleE* at 30° C.a8.66.9E* at 50° C.a4.03.3E* at 70° C.a2.62.2E* at 90° C.a2.11.8aElastic modulus E* (in MPa), measured for cured rubber samples with an Eplexor 150N device by Netzsch, at 10% pre-strain, 2.5% dynamic strain, and a frequency of 10 Hz.", "", "As derivable from Table 2, the elastic modulus E* has been determined at different temperatures for the rubber compositions of the Comparative Example and the Inventive Example. All values of E* are lower at the same temperature for the Inventive Example compared to the Comparative Example. This indicates a reduced stiffness of the compound in accordance with the Inventive Example, which also indicates an improved dry grip. Notably, the difference in E* between the Comparative Example and the Inventive Example is even higher at low temperatures than at high temperatures so that the Inventive Example provides much better grip at low rubber composition temperatures than the Comparative Example. Moreover, it is remarkable that the difference between the E* values at 30° C. and the E* values at 70° C. is much lower for the Inventive Example than for the Comparative Example. For instance, the difference in E* between 30° C. and 70° C. of the Comparative Example is 6 MPa, whereas the corresponding value is only 4.7 MPa for the Inventive Example for the same temperatures. This means that the consistency of the inventive compound has also been improved over the Comparative Example. In other words, the grip and/or stiffness properties of the relatively cold rubber composition and of the warmed-up rubber composition are more similar in the Inventive Example than in the Comparative Example.", "", "Such a behavior has also been confirmed by additional tire testing, where it has been confirmed by test riders that the dry grip level of a tire using the Inventive Example as tread cap shoulder compound is overall improved compared to the dry grip level of a tire having the same construction but the Comparative Example as tread cap shoulder compound. Moreover, also improved performance consistency has been observed in test driving by the test riders.", "", "Another remarkable result consists in that the stiffness of the Inventive Example at very high temperatures, such as at 90° C., does not reduce too much compared to the value of the Comparative Example at the same temperature, which is also desirable. In other words, it is also advantageous that the stiffness does not drop too much at very high temperatures which is fulfilled by the Inventive Example as well.", "", "Variations in the present invention are possible in light of the description of it provided herein. While certain representative embodiments and details have been shown for the purpose of illustrating the subject invention, it will be apparent to those skilled in this art changes can be made in the particular embodiments described which will be within the full intended scope of the invention as defined by the following appended claims."], "claims": ["from 80 phr to 100 phr of one or more solution-polymerized styrene butadiene rubbers; from 80 phr to 200 phr of filler comprising at least 40 phr of carbon black; from 10 phr to 100 phr of one or more liquid diene-based polymers; and from 10 phr to 80 phr of a terpene resin.", "2 . The tire according to claim 1 , wherein the one or more solution-polymerized styrene butadiene rubbers have a glass transition temperature within a range of −1° C. to −45° C.", "from 80 phr to 150 phr of carbon black; predominantly carbon black; a carbon black having an iodine number of at least 180 g/kg; less than 20 phr of silica.", "4 . The tire according to claim 1 , wherein the rubber composition comprises from 15 phr to 45 phr of the terpene resin.", "5 . The tire according to claim 1 , wherein the resin is an alpha-pinene terpene resin.", "a softening point within a range of 100° C. to 150° C.; a glass transition temperature within a range of 50° C. to 100° C.; a weight average molecular weight within a range of 200 g/mol to 900 g/mol; an aromatic proton content of less than 5%.", "7 . The tire according to claim 1 , wherein the rubber composition further comprises from 5 phr to 70 phr of oil.", "8 . The tire according to claim 7 , wherein the rubber composition comprises from 25 phr to 60 phr of the oil.", "9 . The tire according to claim 1 , wherein the rubber composition comprises from 95 phr to 100 phr of the one or more solution-polymerized styrene butadiene rubbers.", "10 . The tire according to claim 1 , wherein the rubber composition further comprises from 1 phr to 10 phr of an alkylphenol resin, optionally having a softening point within a range of 120° C. to 170° C.", "a glass transition temperature within a range of −1° C. to −30° C.; a number molecular weight Mn within a range of 2000 g/mol and 15,000 g/mol; one or more of butadiene repeat units and styrene repeat units; a homopolymer structure.", "12 . The tire according to claim 1 , wherein the rubber composition has less than 5 phr of coumarone indene resin.", "13 . The tire according to claim 1 , wherein the tire is a motorcycle tire.", "14 . The tire according to claim 13 , wherein the tread has two tread shoulder portions and a tread center portion arranged between the two tread shoulder portions, and wherein at least one of the tread shoulder portions comprises the rubber composition, whereas the tread center portion is essentially free of the rubber composition.", "15 . The tire according to claim 14 , wherein the tread center portion comprises a different rubber composition than said at least one tread shoulder portion, and wherein the rubber composition of the tread center portion has an at least 5% higher abrasion resistance than the rubber composition of the at least one tread shoulder portion.", "a motorcycle tire; a motorcycle race tire; a motorcycle rear tire; a slick tire; a pneumatic tire; free of grooves entirely surrounding the tire in a circumferential direction; a motorcycle tire comprising two fabric reinforced breaker plies radially covered by at least one spirally wound ply strip; a motorcycle tire comprising a split tread comprising two circumferential tread shoulder portions, each comprising the rubber composition, at least a circumferential tread center portion comprising another rubber composition, wherein both rubber compositions are different from each other.", "17 . The tire according to claim 13 , wherein the tire has two tread shoulder portions having each a tread cap shoulder portion and a tread base shoulder portion below the respective tread cap shoulder portion, and wherein at least one tread cap shoulder portion comprises the rubber composition.", "18 . The tire according to claim 17 , wherein the tread base shoulder portion has another rubber composition which has an at least 5% lower stiffness G′ (1%) than the rubber composition of the tread cap shoulder portion.", "19 . The tire according to claim 18 , wherein a tread center portion is provided between the two tread shoulder portions, and wherein the tread center portion has a tread center portion rubber composition which has an at least 5% higher abrasion resistance than the rubber composition of the tread cap shoulder portion.", "20 . The tire according to claim 13 , wherein the motorcycle tire is a slick tire."], "bibtex": "@patent{20240326514,\n    title = {TIRE COMPRISING A TREAD},\n    number = {20240326514},\n    year = {2024},\n    note = {File: US20240326514A1-20241003.XML}\n    }", "classification": "B60C100FI"}, {"title": "NON-PNEUMATIC WHEEL", "doc_number": "20240326515", "filename": "US20240326515A1-20241003.XML", "abstract": "A non-pneumatic wheel includes an outboard annular bead and an inboard annular bead axially spaced from the outboard annular bead. The inboard annular bead is connected to the outboard annular bead by a plurality of circumferentially spaced supports. The inboard annular bead includes a radially inwardly extending face having a plurality of mounting apertures.", "detailed_description": ["Example embodiments are provided so that this disclosure will be thorough, and will fully convey the scope to those who are skilled in the art. Numerous specific details are set forth such as examples of specific components, devices, and methods, to provide a thorough understanding of embodiments of the present disclosure. It will be apparent to those skilled in the art that specific details need not be employed, that example embodiments may be embodied in many different forms and that neither should be construed to limit the scope of the disclosure. In some example embodiments, well-known processes, well-known device structures, and well-known technologies are not described in detail.", "", "With reference toFIG.1, a non-pneumatic wheel10is shown including an outboard annular bead12and an inboard annular bead14axially spaced from the outboard annular bead12. The inboard annular bead14is connected to the outboard annular bead12by a plurality of circumferentially spaced supports16. The plurality of circumferentially spaced supports16can include between three and eight supports. The plurality of circumferentially spaced supports16can include a plurality of rods, although other types of supports16such as arms and beams can be used. The plurality of circumferentially spaced supports16can be welded, fastened or otherwise connected to the outboard bead12and the inboard bead14.", "", "The inboard annular bead14includes a radially inwardly extending face14A having a plurality of mounting apertures18therein. The radially inwardly extending face14A of the inboard annular bead14includes a first center opening20having a first diameter and the outboard annular bead12includes a second center opening22having a second diameter that can be larger than the first diameter. The first center opening20is configured to receive a portion of an electric motor therein. The radially inwardly extending face is configured to be mounted to a drive element of the electric motor.", "", "With reference toFIGS.2and3, an electric motor24is mounted to the inboard bead14by a plurality of wheel nuts26extending through the mounting apertures18in the face14A with a portion of the electric motor24received in the first center opening20in the face14A of the inboard bead14. The non-pneumatic wheel10can be connected to a drive shaft of the electric motor24. With continued reference toFIG.3, a non-pneumatic tire28is shown mounted to the outboard bead12and the inboard bead14.", "", "With reference toFIG.4, a brake component30is shown mounted to the inboard bead14by a plurality of wheel nuts32extending through openings in the face14A. The brake component30can be part of a disk or drum brake assembly.", "", "The non-pneumatic wheel10can be made from aluminum, steel, other engineering materials and combinations thereof. The present disclosure provides a non-pneumatic wheel10that does not require an annular barrel portion between the two beads12,14of the wheel and therefore allows for a significant weight reduction for each wheel. The radially extending face portion14A protects critical components, while the supports16connect the outboard bead12to the inboard bead to reduce the weight of the wheel10. The non-pneumatic tire28can be of any known type.", "", "The terminology used herein is for the purpose of describing particular example embodiments only and is not intended to be limiting. As used herein, the singular forms “a,” “an,” and “the” may be intended to include the plural forms as well, unless the context clearly indicates otherwise. The terms “comprises,” “comprising,” “including,” and “having,” are inclusive and therefore specify the presence of stated features, integers, steps, operations, elements, and/or components, but do not preclude the presence or addition of one or more other features, integers, steps, operations, elements, components, and/or groups thereof. The method steps, processes, and operations described herein are not to be construed as necessarily requiring their performance in the particular order discussed or illustrated, unless specifically identified as an order of performance. It is also to be understood that additional or alternative steps may be employed.", "", "When an element or layer is referred to as being “on,” “engaged to,” “connected to,” or “coupled to” another element or layer, it may be directly on, engaged, connected or coupled to the other element or layer, or intervening elements or layers may be present. In contrast, when an element is referred to as being “directly on,” “directly engaged to,” “directly connected to,” or “directly coupled to” another element or layer, there may be no intervening elements or layers present. Other words used to describe the relationship between elements should be interpreted in a like fashion (e.g., “between” versus “directly between,” “adjacent” versus “directly adjacent,” etc.). As used herein, the term “and/or” includes any and all combinations of one or more of the associated listed items.", "", "Although the terms first, second, third, etc. may be used herein to describe various elements, components, regions, layers and/or sections, these elements, components, regions, layers and/or sections should not be limited by these terms. These terms may be only used to distinguish one element, component, region, layer or section from another region, layer or section. Terms such as “first,” “second,” and other numerical terms when used herein do not imply a sequence or order unless clearly indicated by the context. Thus, a first element, component, region, layer or section discussed below could be termed a second element, component, region, layer or section without departing from the teachings of the example embodiments.", "", "Spatially relative terms, such as “inner,” “outer,” “beneath,” “below,” “lower,” “above,” “upper,” and the like, may be used herein for ease of description to describe one element or feature's relationship to another element(s) or feature(s) as illustrated in the figures. Spatially relative terms may be intended to encompass different orientations of the device in use or operation in addition to the orientation depicted in the figures. For example, if the device in the figures is turned over, elements described as “below” or “beneath” other elements or features would then be oriented “above” the other elements or features. Thus, the example term “below” can encompass both an orientation of above and below. The device may be otherwise oriented (rotated 90 degrees or at other orientations) and the spatially relative descriptors used herein interpreted accordingly."], "claims": ["an outboard annular bead; and an inboard annular bead axially spaced from the outboard annular bead, the inboard annular bead connected to the outboard annular bead by a plurality of circumferentially spaced supports, the inboard annular bead including a radially inwardly extending face having a plurality of mounting apertures.", "2 . The non-pneumatic wheel according to claim 1 , wherein the radially inwardly extending face of the inboard annular bead includes a first center opening having a first diameter and the outboard annular bead includes a second center opening having a second diameter larger than the first diameter.", "3 . The non-pneumatic wheel according to claim 2 , wherein the first center opening is configured to receive an electric motor therein.", "4 . The non-pneumatic wheel according to claim 1 , wherein the inboard annular bead is connected to an electric motor.", "5 . The non-pneumatic wheel according to claim 1 , wherein the plurality of circumferentially spaced supports include between three and eight supports.", "6 . The non-pneumatic wheel according to claim 1 , wherein the plurality of circumferentially spaced supports include between three and eight rods.", "7 . The non-pneumatic wheel according to claim 1 , further comprising a brake mechanism connected to a brake mechanism.", "an outboard annular bead; an inboard annular bead axially spaced from the outboard annular bead, the inboard annular bead connected to the outboard annular bead by a plurality of circumferentially spaced supports, the inboard annular bead including a radially inwardly extending face having a plurality of mounting apertures; and a non-pneumatic tire mounted to the outboard annular bead and the inboard annular bead.", "9 . The non-pneumatic wheel according to claim 8 , wherein the radially inwardly extending face of the inboard annular bead includes a first center opening having a first diameter and the outboard annular bead includes a second center opening having a second diameter larger than the first diameter.", "10 . The non-pneumatic wheel according to claim 9 , wherein the first center opening is configured to receive an electric motor therein.", "11 . The non-pneumatic wheel according to claim 8 , wherein the inboard annular bead is connected to an electric motor.", "12 . The non-pneumatic wheel according to claim 8 , wherein the plurality of circumferentially spaced supports include between three and eight supports.", "13 . The non-pneumatic wheel according to claim 8 , wherein the plurality of circumferentially spaced supports include between three and eight rods.", "14 . The non-pneumatic wheel according to claim 8 , further comprising a brake mechanism connected to the inboard annular rim.", "an outboard annular bead; an inboard annular bead axially spaced from the outboard annular bead, the inboard annular bead connected to the outboard annular bead by a plurality of circumferentially spaced supports, the inboard annular bead including a radially inwardly extending face having a plurality of mounting apertures; a non-pneumatic tire mounted to the outboard annular bead and the inboard annular bead; and an electric motor connected to the inboard annular bead.", "16 . The non-pneumatic wheel according to claim 15 , wherein the radially inwardly extending face of the inboard annular bead includes a first center opening having a first diameter and the outboard annular bead includes a second center opening having a second diameter larger than the first diameter.", "17 . The non-pneumatic wheel according to claim 16 , wherein the first center opening is configured to receive the electric motor therein.", "18 . The non-pneumatic wheel according to claim 15 , wherein the inboard annular bead is connected to an electric motor.", "19 . The non-pneumatic wheel according to claim 15 , wherein the plurality of circumferentially spaced supports include between three and eight supports.", "20 . The non-pneumatic wheel according to claim 15 , wherein the plurality of circumferentially spaced supports include between three and eight rods."], "bibtex": "@patent{20240326515,\n    title = {NON-PNEUMATIC WHEEL},\n    number = {20240326515},\n    year = {2024},\n    note = {File: US20240326515A1-20241003.XML}\n    }", "classification": "B60C710FI"}, {"title": "NON-PNEUMATIC TIRE WITH Y-SHAPED SPOKE STRUCTURE", "doc_number": "20240326516", "filename": "US20240326516A1-20241003.XML", "abstract": "The present disclosure regards Y-shaped spokes for non-pneumatic tires. Various embodiments described herein include a non-pneumatic tire that comprises a spoke extending along a radial direction between a shear band and a hub. The spoke comprising a first leg and a second leg extending from the shear band to an intersection point. The spoke further comprises a third leg extending from the hub to the intersection point. The first leg and the third leg are oriented along the same direction, which is oriented at an angle to an orientation of the second leg. Further, the first leg, the second leg, and the third leg meet at the intersection point to form a Y-shaped architecture.", "detailed_description": ["Embodiments of the present disclosure will now be described in detail with reference to the accompanying figures. Like elements in the various figures may be denoted by like reference numerals for consistency. Further, in the following detailed description of embodiments of the present disclosure, numerous specific details are set forth in order to provide a more thorough understanding of the claimed subject matter. However, it will be apparent to one of ordinary skill in the art that the embodiments disclosed herein may be practiced without these specific details. In other instances, well-known features have not been described in detail to avoid unnecessarily complicating the description. Additionally, it will be apparent to one of ordinary skill in the art that the scale of the elements presented in the accompanying Figures may vary without departing from the scope of the present disclosure.", "", "FIG.1depicts a side view of an example non-pneumatic tire100comprising a plurality of spokes102in accordance with various embodiments described herein. As shown inFIG.1, the spokes102can be attached between a shear band103and hub106to form a portion of the tire100. Further, a tread band104can be positioned on the shear band103define a radially outer tread surface105. The tire100may be incorporated into a wheel for use in various vehicles, including, but not limited to: passenger vehicles, cars, trucks, trailers, off-road vehicles, all-terrain vehicles, buses, aircraft, bicycles, motorcycles, agricultural equipment, and/or the like.", "", "In various embodiments, the spokes102can be attached to a radially outward surface of the hub106and a radially inward surface of the shear band103. Further, the tire100can revolve around a central axis108to enable a wheel incorporating the tire100to roll across the ground. The spokes102can be attached to the shear band103and/or the hub106via a variety of fixation means, such as: mechanical fasteners (e.g., screws, bolts, clamps, interconnecting slots), adhesives (e.g., cyanoacrylates, polyurethane adhesives), bonding materials, a combination thereof, and/or the like. For some examples, the spokes102can be attached to the shear band103by adhering the elastomeric materials together using, for example: green rubber and curing the rubber components together, or using a strip of green rubber between cured or partially cured rubber components. Likewise, the shear band103can be fixed to the tread band104via a mechanical fixation, adhesion, and/or bonding.", "", "As the tire100rotates about the central axis108, the radially outer tread surface105of the tread band104can interface with the ground. In some examples, the tread band104can be composed of an elastomeric material that can at least partially flatten upon contacting the ground (e.g., to form a planar footprint for the tire100). Further, the tread band104can be a multi-layered structure comprising one or more reinforcement layers. In one or more embodiments, the spokes102can act as an elastomeric supporting element for the tread band104. As portions of the radially outer tread surface105engage and disengage the ground, a nominal load exerted on the tire100can cause the tire100to flex and the adjacent spokes102to experience deflection. In one or more embodiments, the adjacent spokes102can be spaced from each other along the circumferential direction C such that the spokes102can deflect under load without contacting another spoke102.", "", "As shown inFIG.1, the shear band103can have an annular structure extending along the circumferential direction C of the tire100. In various embodiments, the shear band103can be composed of one or more rubber layers and/or elastomeric materials. In addition, the shear band103can include one or more reinforcement layers and/or reinforcement cords. The shear band103can function to transfer a load from the bottom of the tire100(e.g., where the tread band104is in contact with the ground) to the spokes102and hub106. For example, the plurality of spokes102can extend from the hub106to the shear band103along a radial direction R of the tire100. The spokes102can function to carry the load transmitted from the shear band103, such that the spokes102are primarily loaded in tension and carry no load in compression. When the tire100is loaded, the spokes102can deform passing through the contact patch (e.g., a region where the tread band104interfaces with the ground) with substantially no compressive resistance, thereby supplying a negligible compressive force to the load bearing. Thus, the predominant load of the spokes102is carried through tension and/or shear, rather than compression. Thereby, the tire100is considered a top loader pneumatic tire100. For instance, the Y-shape architecture embodied by the spokes102described herein can substantially mitigate an amount of bottom loading experienced by the tire100. Further, the Y-shape architecture can exhibit greater bottom loading mitigation than spokes comprising a greater number of legs.", "", "FIG.2Adepicts an exemplary embodiment of a spoke102of the present disclosure. In various embodiments, the spoke102can maintain a similar cross-section profile in the axial direction “A” of the spoke102. As shown inFIG.2A, the spoke102can include a first outer leg202and a second outer leg204. Further, both the first outer leg202and the second outer leg204are integrally connected to an inner leg206. Thereby, the spoke102can have a “Y-shape” defined by the first outer leg202, the second outer leg204, and the inner leg206.", "", "The first outer leg202, the second outer leg204, and the inner leg206can be composed of substantially the same material. For example, as described further herein, the first outer leg202, the second outer leg204, and the inner leg206can be have a multi-layer structure of rubber, thermoplastic elastomer materials, and/or polymer materials.", "", "The first outer leg202and/or the second outer leg204can have a thickness ranging from, for example, greater than or equal to about 1 millimeter (mm) and less than or equal to about 4 mm. In some embodiments, the first outer leg202and/or the second outer leg204can have substantially the same thickness as each other. The inner leg206can have a thickness ranging from, for example, greater than or equal to about 2 mm and less than or equal to about 8 mm. In some embodiments, the inner leg206can have a thickness that is about twice as thick as the first outer leg202or the second outer leg204.", "", "As shown inFIG.2A, the first outer leg202and the second outer leg204can be positioned at an angle to each other (e.g., along non-parallel orientations), such that the first outer leg202and the second outer leg204meet at an intersection point208with the inner leg206. For example, the first outer leg202and the second outer leg204can form a “V-shape” configuration of the Y-shape. For instance, the first outer leg202and the second outer leg204can define a first angle “01”, while the spoke102is not under load, ranging from, for example, greater than or equal to about 20 degrees and less than or equal 90 degrees (e.g., about 36 degrees). The inner leg206can extend from the intersection point208along the same, or substantially the same, orientation as the first outer leg202(e.g., as shown inFIG.2A) or the second outer leg204. For instance, in some embodiments the inner leg206can be substantially aligned with the first outer leg202such that a second angle “02” between the second outer leg204and the inner leg206is supplementary to the first angle “01”. In one or more embodiments, the first outer leg202and the inner leg206can extend along the same plane in the radial direction R (e.g., as shown inFIGS.2A and/or3A).", "", "In an example embodiment shown inFIG.2A, the first outer leg202and the second outer leg204can both terminate to a radially outer surface210. In various embodiments, the radially outer surface210can be a surface for attachment (e.g., can provide a means for attachment) to the shear band103. Further, the inner leg206can terminate to a radially inner surface212. In various embodiments, the radially inner surface212can be a surface for attachment (e.g., can provide a means for attachment) to the hub106. In one or more embodiments, the radially outer surface210and/or the radially inner surface212can be slightly curved along the circumferential direction C to match the radius of curvature of the shear band103and/or hub106where the spoke102is attached. Alternatively, the radially outer surface210and/or the radially inner surface212can be flat, as shown.", "", "Alternatively,FIG.3Adepicts another example embodiment of the spoke102in which the radially outer surface210includes the side surface of a bridge302that extends between the first outer leg202and the second outer leg204. For example, the first outer leg202and the second outer leg204can extend from the intersection point208and terminate at the bridge302. As shown inFIG.3A, the bridge302can connect the first outer leg202and the second outer leg204over the intersection point208. The bridge302can have a third length L3, extending along the circumferential direction C, that is a function of the lengths of the first outer leg202, the second outer leg204, and the first angle θ1.", "", "Referring again toFIG.2A, the first outer leg202and the second outer leg204can have a substantially equal first length L1extending along the radial direction “R” (e.g., extending from the radially outer surface210to the intersection point208). Additionally, in one or more embodiments, the inner leg206can have a second length L2, extending along the radial direction R, that is substantially equal to the first length L1. In some embodiments, the second length L2can be shorter than the first length L1. In some embodiments, the first length L1of the first outer leg202may slightly differ from the first length L1of the second outer leg204to accommodate the change in radius as the spoke102extends between the shear band103and the hub106. In one or more embodiments the first length L1of the first outer leg202and/or the second outer leg204can be 50% or more of the total length of the spoke102(e.g., extending from the hub106to the shear band103), and the second length L2of the inner leg206can be less than 50% of the total length of the spoke102.", "", "In various embodiments, a first outer foot214can be positioned at a distal end of the first outer leg202. Additionally a second outer foot216can be positioned at a distal end of the second outer leg204. For instance,FIG.2Adepicts an example embodiment of the spoke102in which the first outer foot214is positioned on a side surface of the first outer leg202that faces the second outer leg204. Likewise, the example embodiment depicted inFIG.2Aincludes the second outer foot216positioned on a side surface of the second outer leg204that faces the first outer leg202. Example materials that can compose the first outer foot214and/or the second outer foot include, but are not limited to, thermoplastic elastomer materials and/or polymer materials. In one or more embodiments, the first outer foot214and/or the second outer foot216can have a substantially triangular shape. Additionally, the first outer foot214and/or the second outer foot216can be composed of a relatively stiff rubber material having a modulus ranging from, for example, greater than or equal to about 2 megapascal (MPa) and less than or equal to about 30 MPa.", "", "Alternatively, in the example embodiment depicted inFIG.3A, the first outer foot214can be positioned adjacent to a connection between the bridge302and the first outer leg202. Likewise, the second outer foot216can be positioned adjacent to a connection between the bridge302and the second outer leg204. For instance, as shown inFIG.3A, the bridge302can include bent portions that connect with the first outer leg202and the second outer leg204, where the first outer foot214and the second outer foot216can be positioned adjacent to the bent portions of the bridge302.", "", "In either illustrated embodiment, the first outer foot214and the second outer foot216can further facilitate attachment of the first outer leg202and the second outer leg204to the shear band103. For example, a surface area of the radially outer surface210of the spoke102can encompass a side of the first outer foot214and a side of the second outer foot216. With the increase in surface area provided by the first outer foot214and the second outer foot216(e.g., in comparison to merely the distal ends of the first outer leg202and the second outer leg204or in comparison to merely a side surface of the bridge302), an amount of fixation between the spoke102and the shear band103can also increase. For instance, the first outer foot214and/or the second outer foot216can widen the radially outer surface210along the circumference direction C to facilitate attachment of the spoke102to the shear band103via adhesives, mechanical fasteners, and/or bonding techniques.", "", "Also, the spoke102can comprise a inner foot218positioned at a distal end of the inner leg206. For instance, the inner foot218can be positioned at an end of the inner leg206nearest the radially inner surface212. As shown inFIGS.2A and3A, the inner foot218can be positioned on a side surface of the inner leg206, such that the inner foot218extends in a direction towards the intersection point208(e.g., the inner foot218can be positioned on a side of the inner leg206that is nearest the intersection point208). In some embodiments, the inner foot218can be positioned on an opposite side surface of the inner leg206, such that the inner foot218extends in a direction away from the intersection point208(not shown). Example materials that can compose the inner foot218can include, but are not limited to, thermoplastic elastomer materials and/or polymer materials. In one or more embodiments, the inner foot218can have a substantially triangular shape. Additionally, the inner foot218can be composed of a relatively stiff rubber material having a modulus ranging from, for example, greater than or equal to about 2 MPa and less than or equal to about 30 MPa. For instance, the inner foot218can have the same material composition, or substantially the same material composition, as the first outer foot214and/or the second outer foot216.", "", "The inner foot218can further facilitate attachment of the inner leg206to the hub106, as described further herein. For example, a surface area of the radially inner surface212of the spoke102can encompass a side of the inner foot218. With the increase in surface area provided by the inner foot218(e.g., in comparison to merely the distal end of the inner leg206), an amount of fixation between the spoke102and the hub106can also increase. For instance, the inner foot218can widen the radially inner surface212along the circumference direction C to facilitate attachment of the spoke102to the hub106via adhesives, mechanical fasteners, and/or bonding techniques.", "", "The spoke102can further include one or more joint portions220. In various embodiments, the one or more joint portions220can be composed of a stiff rubber having a modulus ranging from, for example, greater than or equal to about 2 MPa and less than or equal to about 30 MPa. As shown inFIGS.2A and3A, the one or more joint portions220can positioned above the intersection point208between the first outer leg202and the second outer leg204along the circumferential direction C. Additionally, the one or more joint portions220can extend along the entire length, or near entire length, of the spoke102along the axial direction A. The one or more joint portions220can have substantially triangular shape that complements a void defined by the first outer leg202and the second outer leg204. In one or more embodiments, the one or more joint portions220can have the same, or nearly the same, material composition as the first outer foot214, the second outer foot216, and/or the inner foot218. As shown, the one or more joint portions220can thicken a portion of the spoke102along the circumferential direction C near the intersection point208. Thereby, the one or more joint portions220can enhance structural integrity of the spoke102at the intersection point208.", "", "In the example embodiment shown inFIG.2A, the spoke102can also comprise a dampener222positioned adjacent to the intersection point208and between the outer leg that is oriented at an angle with the inner leg206. For instance, the dampener222can be positioned between the second outer leg204and the inner leg206. The dampener222can be composed of a relatively soft rubber having a modulus ranging from, for example, greater than or equal to about 2 MPa and less than or equal to about 30 MPa (e.g., 4.8). Alternatively, as shown inFIG.2A, embodiments of the spoke102that are absent the dampener222are also envisaged.", "", "FIG.2Billustrates a first side224of the spoke102, as the spoke102extends in the axial direction A. The first side224of the spoke102can be, for example, a side where one of the radially outer legs is oriented at an angle to the inner leg206. For instance, the first side224of the spoke102depicted inFIG.2Bincludes the second outer leg204positioned at an angle (e.g., non-parallel) to the inner leg206, as exemplified inFIG.2A.FIG.3Billustrates a second side304of the spoke102, as the spoke102extends in the axial direction A. The second side304of the spoke102can be, for example, a side where one of the outer legs is oriented along the same trajectory as the inner leg206. For instance, the second side304of the spoke102depicted inFIG.3Bincludes the first outer leg202positioned in-line with the orientation of the inner leg206.", "", "In various embodiments, the spokes102can be formed of an elastic material such as rubber or a thermoplastic elastomer. For example, a suitable thermoplastic elastomer material can be characterized by the following properties. A tensile (Young's) modulus of the material is preferably greater than or equal to 45 MPa and less than or equal to 650 MPa (e.g., from about 85 MPa to about 300 MPa), using the ISO 527-1/−2 standard test method. The glass transition temperature of the material is preferably less than −25 degree Celsius (° C.) (e.g., less than −35° C.). The elongation of the material at break is between 100 and 400% (e.g., more than 200%). The heat deflection temperature of the material is more than 40° C., under 0.45 MPa (e.g., preferably more than 50° C.). Additionally, the material preferably exhibits no break result for the Izod and Charpy notched test at 23° C. using the ISO 179/SIO180 test method.", "", "In various embodiments, the spokes102can be formed of rubber used in conventional tire construction. For example, the spokes102can be formed of a rubber with: polyester cord material, fiberglass reinforced resins, aramid, cotton, nylon, rayon, a combination thereof, and/or the like. The cord density or spacing of the cord material in each layer of the spokes102can be selected depending on the desired spoke102stiffness. In one example, layers made of nylon cord can have a density of 32 ends per inch (EPI). In another example, aramid layers could have a density of 16 EPI. For instance, the first outer leg202, the second outer leg204, and/or the inner leg206can have a single layer or multi-layer structure, where each layer is defined by a cord material orientation. In some embodiments, the first outer leg202and the second outer leg204can have n number of layers of reinforced rubber (e.g., comprising a cord material such as nylon or aramid) or thermoplastic material, and the inner leg206can have 2 times n (2n) number of layers.", "", "FIG.4depicts an example spoke102with 0° and 90° orientations to be referenced in describing various cord orientations that can be embodied by the one or more material layers of the first outer leg202, the second outer leg204, and/or the inner leg206. As shown inFIG.4the 0° reference orientation can travel along a longitudinal axis of the first outer leg202, the second outer leg204, and/or the inner leg206(e.g., in substantially the radial direction R). Additionally, the 90° reference orientation can travel along the axial direction A of the spoke102. While the example embodiment of the spoke102depicted inFIG.3Ais represented inFIG.4, the single or multi-layer architecture described herein is also applicable to the example embodiment depicted inFIG.2A.", "", "FIGS.5A-5Fdepict example cord orientations that define respective layers of the first outer leg202, the second outer leg204, and/or the inner leg206. For instance,5A depicts an example embodiment in which the first outer leg202, the second outer leg204, and/or the inner leg206can have a single layer structure comprising cords oriented along the 0° reference orientation.FIG.5Bdepicts an example embodiment in which the first outer leg202, the second outer leg204, and/or the inner leg206can have a two-layer structure, where each layer comprises cords oriented along the 0° reference orientation.FIG.5Cdepicts an example embodiment in which the first outer leg202, the second outer leg204, and/or the inner leg206can have a two-layer structure; where a first layer502comprises cords oriented along a +45° orientation, and a second layer504comprises cords oriented along a −45° orientation.FIG.5Ddepicts an example embodiment in which the first outer leg202, the second outer leg204, and/or the inner leg206can have a three-layer structure; where the first layer502and the second layer504comprise cords oriented along the 90° reference orientation, and a third layer506comprises cords oriented along the 0° reference orientation. In some embodiments, the third layer506can be primarily responsible for the load carrying function of the tire100, while the first layer502and/or the second layer504can be primarily responsible for protecting the third layer506from extraneous damage.FIG.5Edepicts an example embodiment in which the first outer leg202, the second outer leg204, and/or the inner leg206can have a three-layer structure; where the first layer502can be oriented along a +45° orientation, the second layer504can be oriented along a −45° orientation, and the third layer506can be oriented along the 0° reference orientation.FIG.5Fdepicts an example embodiment in which the first outer leg202, the second outer leg204, and/or the inner leg206can have a four-layered structure; where the first layer502can be oriented along a +45° orientation, the second layer504can be oriented along a −45° orientation, and the third layer506and a fourth layer508can be oriented along the 0° reference orientation.", "", "One of ordinary skill in the art will recognize that the cord orientations depicted inFIGS.5A-5Fare exemplary, and additional cord orientation are envisaged (e.g., orientations along +/−30° or) +/−60°. Additionally, the cord orientations are approximate and may vary by, for example, up to 10°. In some embodiments, the cord material composition can be the same, or substantially the same, amongst each layer. In other embodiments, the cord material composition of one layer can differ from the cord material composition of another layer.", "", "As exemplified inFIGS.6A and6B, the plurality of spokes102can be positioned as a single set along the circumferential direction C, or as multiple sets along the circumferential direction C. For instance,FIG.6Adepicts an example embodiment in which the plurality of spokes102are positioned as a single set, where the spokes102extend along the entire, or nearly entire, length of the tire100along the axial direction A. In another instance,FIG.6Bdepicts an example embodiment in which the plurality of spokes102are positioned as two sets of spokes102; where a first set of the spokes102extend along about half of the length of the tire100along the axial direction A, and the second set of spokes102extend along the remaining half of the length of the tire100along the axial direction A. In some embodiments, the number of sets of spokes102can range from, for example, greater than or equal to one and less than or equal to eight.", "", "The number of spoke102sets can vary based on the application and/or dimensions of the tire100. For example, as the length of the tire100increases along the axial direction A, the tire100can readily accommodate more sets of spokes102. Likewise, the number of spokes102per set can also vary based on the application and/or dimensions of the tire100. WhileFIGS.6A and6Bdepict thirty-six spokes102per set along the circumferential direction C, embodiments comprising fewer or more spokes102per set are also envisaged. For example, as the circumference of the tire100increases, the tire100can readily accommodate more spokes102per set. In some embodiments, the number of spokes102per set can range from, for example, greater than or equal to about 30 and less than or equal to about 60.", "", "FIG.6Bdepicts an example multi-set spoke layout in which a first spoke102aof the first set is aligned with the adjacent second spoke102bof the second set along the axial direction A. For example, form a side perspective, the example multi-set spoke layout depicted inFIG.6Bwould appear as shown inFIG.1, where the second spokes102bof the second set would not be visible past the first spokes102aof the first set. However, alternate multi-set spoke layouts are also envisaged.", "", "For example, whereas the spoke sets shown inFIG.6Bare aligned in the axial direction A, in one or more embodiments adjacent spoke sets can be staggered along the axial direction A.FIG.7depicts a side perspective of an example tire100comprising a plurality of spokes102positioned in a multi-set spoke layout comprising two sets of spokes102staggered in their respective positions along the axial direction A. Due the staggered positioning, one or more first spokes102afrom the first set and one or more second spokes102bfrom the second set are both visible from the side of the tire100. As shown inFIG.7, the one or more first spokes102aof the first set can be offset from the one or more second spokes102bof the second set along the circumferential direction C. WhileFIG.7illustrates the example staggered multi-set spoke layout with regards to the example spoke102shown inFIG.2A, the architecture can also be embodied by with the example spoke102shown inFIG.3A.", "", "Additionally, while the example multi-set spoke layouts shown inFIGS.6B and7comprise spokes102that are likewise oriented along the circumferential direction C. For instance, inFIG.6Bthe spokes102are oriented such that a side of each spoke102comprising the dampener222is facing clock-wise. However, the spokes102can also be positioned in opposing orientations to each other, in an aligned or staggered position along the axial direction A. For example,FIG.8depicts a side perspective of an example tire100comprising a plurality of spokes102positioned in a multi-set spoke layout comprising two sets of spokes102, where the spokes102of one set are reflections of the spokes102of another set about the radial direction R. For instance, as shown inFIG.8, a first set can comprise one or more first spokes102aand a second set can comprise one or more second spokes102bhaving a flipped orientation in reference to the set of first spokes102a. For instance, the set of first spokes102acan have a first side124that faces clock-wise along the circumferential direction C; whereas the set of second spokes102bcan have the first side124face counter-clockwise along the circumferential direction C (e.g., as shown inFIG.8). In some embodiments, spokes102having the flipped orientation can have portions aligned with adjacent spokes102and other portions staggered with adjacent spokes102. For instance, as shown inFIG.8, the outer legs of the non-flipped (e.g., first spokes102a) and flipped (e.g. second spokes102b) spokes102can be staggered along the circumferential direction C, while the inner legs206can be at least partially aligned in the circumferential direction C.", "", "Due the flipped and staggered positioning, one or more first spokes102afrom the first set and one or more second spokes102bfrom the second set are both visible from the side of the tire100. As shown inFIG.8, the one or more first spokes102aof the first set can be offset from the one or more second spokes102bof the second set along the circumferential direction C. WhileFIG.8illustrates the example flipped and staggered multi-set spoke layout with regards to the example spoke102shown inFIG.2A, the architecture can also be embodied by with the example spoke102shown inFIG.3A.", "", "In accordance with various embodiments described herein, various multi-set spoke layout arrangements are envisaged as a function of one or more: non-flipped (e.g., along the radial direction R) aligned (e.g., along the axial direction A) spoke102sets, flipped aligned spoke102sets, non-flipped staggered spoke102sets, flipped staggered spoke102sets, and/or combinations thereof. Similarly, in accordance with various embodiments described herein, various single set spoke layout arrangements are envisaged as function of one or more non-flipped (e.g., along the radial direction R) aligned (e.g., along the axial direction A) spokes102, flipped aligned spokes102, non-flipped staggered spokes102, flipped staggered spokes102, and/or combinations thereof. In some embodiments, the spoke layout arrangement (e.g., the position, number, and/or orientation of spokes102between the hub106and shear band103) can be designed and/or adjusted to tune a noise exhibited by the tire100during operation of the incorporated vehicle.", "", "In various embodiments, the hub106can be attached to a wheel body902, which can facilitate incorporation of the tire100onto an axil of a vehicle. In some embodiments, the hub106can be integrally formed with the wheel body902or fixed to the wheel body902via an adhesive and/or bonding material. In one or more embodiments, the hub106can also, or alternatively, be fixed to the wheel body902via a mechanical connection. For instance,FIG.9depicts an example embodiment of the tire100in which the hub106can comprise a plurality of projections904extending from an inner surface906of the hub106. As shown inFIG.9, the inner surface906can be opposite a surface of the hub106attached to the plurality of spokes102. In particular, the inner surface906can face the central axis108of the tire100. Further, the projections904can extend from the inner surface906into one or more channels within the wheel body902. For example, the hub106, and thereby the projections904, can slide into the channels along the axial direction A of the tire100. As shown inFIG.9, the projections904can be shaped to inhibit movement of the hub106away from the wheel body902along the radial direction R.", "", "FIG.10illustrates an exploded view of a mold1000that can be used to manufacture a spoke102in accordance with one or more embodiments described herein. For example,FIG.10depicts the manufacturing of the spoke102exemplified inFIG.3A. As shown inFIG.10, the components of the spoke102are illustrated separately as they are placed into the mold1000. The mold1000can comprise a front wall1002, a back wall1004, a first sidewall1006, a second sidewall1008, a bottom wall1010, and a top wall1012.", "", "During the manufacturing process, the first outer foot214can be positioned on the bottom wall1010and adjacent to the second sidewall1008. For instance, the first outer foot214can be positioned on a first sloped surface1014of the bottom wall1010, which extends along a parallel orientation as the desired orientation for the first outer leg202. Additionally, the inner foot218can be positioned on the bottom wall1010and adjacent the first sidewall1006. For instance, the inner foot218can be positioned on a second sloped surface1016of the bottom wall1010, which extends along a parallel orientation as the desired orientation for the inner foot218.", "", "Next, an elastomer material1018can be positioned on top of the first outer foot214, the inner foot218, and the first sloped surface1014of the bottom wall1010. The elastomer material1018can form the first outer leg202, the second outer leg204, and/or the inner leg206. For instance, the portion of the elastomer material1018in contact with the first outer foot214, the inner foot218, and the first sloped surface1014can form the first outer leg202and the inner leg206.", "", "Subsequently, a middle mold portion1020can be positioned on the elastomer material1018and over the first outer foot214. As shown inFIG.10, the elastomer material1018can travel up the second sidewall1008to wrap around the middle mold portion1020; thereby a portion of the elastomer material1018can be positioned between the second sidewall1008and the middle mold portion1020to form the bridge302. Additionally, the joint portion220can be positioned on the elastomer material1018adjacent to the middle mold portion1020and over the first sloped surface1014. As described above and depicted inFIG.10, the elastomer material1018can be wrapped around the middle mold portion2020so as to cover the joint portion220and further reside on top of itself over the first sloped surface1014and the inner foot218.", "", "Further, the second outer foot216can be positioned onto the elastomer material1018adjacent the second sidewall1008and over the middle mold portion1020. Lastly, the top wall1012can be positioned onto the second outer foot216and the elastomer material1018. As shown inFIG.10, the top wall1012can have a first slanted surface1022that can extend in a parallel orientation as the desired orientation of the second outer leg204. In addition, the top wall1012can have a second slanted surface1024that can extend in a parallel orientation as the desired orientation of the inner leg206.", "", "Once the uncured components of the spoke102are placed within the mold1000, the front wall1002, back wall1004, first sidewall1006, second sidewall1008, bottom wall1010, and top wall1012are closed and secured together. For instance, the respective walls can be tightened together to exert a pressure that presses the uncured components against each other and the middle mold portion1020. Next, the mold1000can be heated to cure the elastomer components, thereby adhering the components together to form a composite spoke102structure. For instance, the mold1000can be heated to a temperature of at least 140° C. to cure the components of the spoke102.", "", "One of ordinary skill in the art will understand that the manufacturing and/or mold1000features exemplified inFIG.10can be slightly modified to reach the various embodiments described herein, including the example spoke102structure shown inFIG.2A. For instance, a plurality of elastomer materials1018can be employed (e.g., as opposed to the single elastomer material1018approach shown inFIG.10) to achieve a multi-layered structure and/or an architecture absent the bridge302. Additionally, the order in which the components are placed in the mold1000can be varied to adjust the positioning of the first outer foot214and/or the second outer foot216."], "claims": ["a spoke comprising a first leg extending from a shear band to a hub, wherein the spoke further comprises a second leg extending from the shearband to the first leg.", "2 . The non-pneumatic tire of claim 1 , wherein the spoke further comprises a first foot secured to the first leg at a position adjacent to the shear band to provide surface area to an interface between the shear band and the spoke.", "3 . The non-pneumatic tire of claim 1 , wherein the spoke further comprises a second foot secured to the second leg at a position adjacent to the shear band so as to provide further surface area to the interface between the shear band and the spoke.", "4 . The non-pneumatic tire of claim 1 , wherein the spoke further comprise a third leg and a third foot cured to the third leg at a position adjacent to the hub to provide surface area to an interface between the hub and the spoke.", "5 . The non-pneumatic tire of claim 4 , wherein the third foot is positioned at a side of the third leg that is nearest the intersection point.", "6 . The non-pneumatic tire of claim 1 , wherein the spoke further comprises a dampener positioned adjacent an intersection point of the first leg and the second leg.", "7 . The non-pneumatic tire of claim 6 , wherein the first leg and the second leg are composed of a first elastomer material and the dampener is composed of a second elastomer material having a different material composition than the first elastomer material.", "8 . The non-pneumatic tire of claim 1 , wherein the spoke further comprises a bridge that extends from the first leg to the second leg.", "9 . The non-pneumatic tire of claim 8 , wherein the spoke is fixed to the shear band via an interface between a side surface of the bridge and an inner surface of the shear band.", "a first foot positioned adjacent to a first portion of the bridge that meets the first leg, wherein the first foot is fixed to the shear band; a second foot positioned adjacent to a second portion of the bridge that meets the second leg, wherein the second foot is fixed to the shear band; and a third foot positioned adjacent to the third leg and the hub, wherein the third foot is fixed to the hub.", "a plurality of spokes positioned between a shear band and a hub, wherein the plurality of spokes each have a Y-shaped architecture composed of: a first side comprising a first leg and a second leg extending along the same plane in a radial direction of the non-pneumatic tire, and a second side comprising a third leg that is oriented at an angle to the second leg, and wherein a first spoke from the plurality of spokes and a second spoke from the plurality of spokes are orientated likewise along a circumferential direction of the non-pneumatic tire.", "12 . The non-pneumatic tire of claim 11 , wherein the second side of the first spoke and the second spoke face clockwise along the circumferential direction, and wherein the second side of a third spoke from the plurality of spokes faces counter-clockwise along the circumferential direction.", "13 . The non-pneumatic tire of claim 11 , wherein the second side of the first spoke and the second spoke face counter-clockwise along the circumferential direction, and wherein the second side of a third spoke from the plurality of spokes faces clockwise along the circumferential direction.", "14 . The non-pneumatic tire of claim 11 , wherein the non-pneumatic tire is a top loader non-pneumatic tire.", "a first set of spokes extending between a shear band and a hub, wherein the spokes of the first set have three legs positioned in a Y-shaped architecture; and a second set of spokes extending between the shear band and the hub, wherein the spokes of the second set also have three legs positioned in the Y-shaped architecture, wherein the second set of spokes is positioned adjacent to the first set of spokes along a axial direction that is perpendicular to a radial direction of the non-pneumatic tire.", "16 . The non-pneumatic tire of claim 15 , wherein a first spoke from the first set of spokes is positioned adjacent to a second spoke from the second set of spokes along the axial direction.", "17 . The non-pneumatic tire of claim 16 , wherein the first spoke is aligned with the second spoke along the axial direction.", "18 . The non-pneumatic tire of claim 16 , wherein the first spoke is offset from the second spoke along the axial direction.", "19 . The non-pneumatic tire of claim 16 , wherein a first side of the first spoke comprises two legs of the first spoke oriented at an angle to each other, and wherein a second side of the second spoke comprises two legs of the second spoke oriented at an angle to each other, wherein the first side of the first spoke faces clockwise along a circumferential direction of the non-pneumatic tire, and wherein the second side of the second spoke faces counter-clockwise along the circumferential direction of the non-pneumatic tire.", "20 . The non-pneumatic tire of claim 16 , wherein a first side of the first spoke comprises two legs of the first spoke oriented at an angle to each other, and wherein a second side of the second spoke comprises two legs of the second spoke oriented at an angle to each other, wherein the first side of the first spoke face and the second side of the second spoke are likewise oriented along a circumferential direction of the non-pneumatic tire."], "bibtex": "@patent{20240326516,\n    title = {NON-PNEUMATIC TIRE WITH Y-SHAPED SPOKE STRUCTURE},\n    number = {20240326516},\n    year = {2024},\n    note = {File: US20240326516A1-20241003.XML}\n    }", "classification": "B60C714FI"}, {"title": "ADHESION DEVICES FOR TRANSPORT ASSEMBLIES TO ENGAGE NON-METALLIC SURFACES", "doc_number": "20240326517", "filename": "US20240326517A1-20241003.XML", "abstract": "Adhesion devices for transport assemblies are configured to engage non-metallic surfaces. The transport assemblies can be wheels, such as omni-directional wheels, or can be a tractor tread assembly. The transport assembly is configured to move adjacent to a non-metallic surface of a structure. The transport assembly comprises an outer surface disposed adjacent to the non-metallic surface as the transport assembly moves, and a plurality of adhesion devices are each mounted to the outer surface and extend at least in a normal direction away from the outer surface. Each adhesion device is responsive to proximity to the non-metallic surface to adhere to the non-metallic surface. The adhesion devices in one or more embodiments include a Van der Waals-type adhesion device, a micro spine-type adhesion device, a suction cup-type adhesion device, or a combination of such devices.", "detailed_description": ["Example embodiments consistent with the teachings included in the present disclosure are directed to adhesion devices for transport assemblies to engage non-metallic surfaces. As shown inFIGS.1-11, the adhesion devices can be mounted on the outer surface of a transport assembly such as a wheel, as shown inFIGS.5-9and11-11A, or a tractor tread as shown inFIG.10-10A.", "", "Referring toFIGS.1-3, one type of adhesion device employs a member extending from the outer surface of the transport assembly to engage a non-metallic surface using Van der Waals attraction, with a shape and configuration that mimics the spatula pads of a gecko. As understood, a gecko's feet comprises microscopical arrays of hairs called setae. Each setae has a cluster of smaller hairs called spatulas, and each spatula is around 150 nanometers in diameter. The spatula shape, as described inFIG.1provides anisotropic adhesion to a surface. It is to be appreciated, however, that changing the spatula shape can yield multi directional adhesion. In this regard, the adhesion employed is to harness the Van der Waals forces to adhere wheels of a vehicle to surfaces with a combination of adhesion methods described herein, such as micro spinal claws, suction cups and magnetic forces. The particular size of the spatula, if utilized, can be varied within a range that still supports Van der Waals attraction. As well, a combination of shapes like circular or rectangular head shapes can be included as the other structure utilized for such adhesion.", "", "Such Van der Waals attraction is a distance-dependent interaction between atoms or molecules, instead of ionic or chemical bonds, and so provides attraction without the use or reliance on magnetic properties between surfaces. The Van der Waals attraction is strong enough to allow the adhesion devices inFIGS.1-3to adhere to the non-metallic surface, but is weak enough to provide releasable adhesion, so that the transport assembly with such adhesion devices can releasably adhere to non-metallic surfaces as the transport assembly moves adjacent to such surfaces. In addition, the Van der Waals attraction is non-destructive in that the attraction does not disrupt or rely on ionic or chemical bonds with atoms or molecules of the non-metallic surface during adhesion. Accordingly, the integrity of non-metallic surfaces of structures, such as oil or gas pipelines, is not compromised by the transport assembly crawling on such surfaces of structures.", "", "As shown inFIG.1, the adhesion device10includes a member12extending in a normal or perpendicular direction from the outer surface14of the transport assembly, with a top portion16shaped so as to engage the non-metallic surface by using Van der Waals attraction. The surface14can be planar. Alternatively, the surface14can be curved. In a further embodiment, the surface14can be curved but can be substantially planar in a small region about the base of the member12. In the adhesion device10, a tab18extends from the top portion16to allow anisotropic adhesion to the non-metallic surface. A top surface of the top portion16can be substantially trapezoidal, including rectangular-shaped. Alternatively, the top surface of the top portion16can be substantially triangular, with a vertex of the triangular top portion16being the tab18. Accordingly, the adhesion device10is a directional device configured to provide adhesion in the direction of extension of the tab18from the top portion16, but no adhesion is provided in other directions relative to a longitudinal axis of the member12.", "", "As shown inFIG.2, in an alternative adhesion device30also shaped and configured to employ Van der Waals attraction, a member32extends in a normal or perpendicular direction from the outer surface14of the transport assembly, with a top portion36engaging the non-metallic surface using Van der Waals attraction. The surface14can be planar. Alternatively, the surface14can be curved. In a further embodiment, the surface14can be curved but can be substantially planar in a small region about the base of the member32. In the adhesion device10, a pair of tabs38,40extend from the top portion36to allow bi-directional adhesion to the non-metallic surface. A top surface of the top portion36can be substantially trapezoidal, including rectangular-shaped. Alternatively, the top surface of the top portion36can be substantially kite-shaped, including rhombus-shaped, with vertices of the kite-shaped top portion36being the tabs38,40. Accordingly, the adhesion device30is a bi-directional device configured to provide adhesion in the directions of extension of the tabs38,40from the top portion36, but no adhesion is provided in other directions relative to a longitudinal axis of the member32.", "", "As shown inFIG.3, in another alternative adhesion device50shaped and configured to use Van der Waals attraction, a member52extends in a normal or perpendicular direction from the outer surface14of the transport assembly, with a top portion56engaging the non-metallic surface using Van der Waals attraction. The surface14can be planar. Alternatively, the surface14can be curved. In a further embodiment, the surface14can be curved but can be substantially planar in a small region about the base of the member52. In the adhesion device50, a top surface of the top portion56has an elliptical shape, such as a circular shape, to allow multi-directional adhesion to the non-metallic surface. Accordingly, the adhesion device50is a multi-directional device configured to provide adhesion in all radial directions relative to a longitudinal axis of the member52.", "", "In the embodiments of the adhesion devices10,30,50shown inFIGS.1-3, respectively, the adhesion devices10,30,50can be fabricated using known microscale fabrication techniques. In addition, at least the top portions16,36,56of the adhesion devices10,30,50, respectively, can be fabricated from carbon nanotubes which generate the Van der Waals attraction between the top portions16,36,56and the non-metallic surfaces.", "", "In another type of adhesion device60, as shown inFIG.4, at least one micro spinal claw62has at least one micro spine64extending in a generally normal or perpendicular direction from an outer surface of the adhesion device60. The micro spine64is configured to releasably engage irregularities and miniscule material voids in the non-metallic surface66of the structure. The micro spine64releasably engages such voids by hooking into the voids without creating any damage to the non-metallic surface66.", "", "In a further type of adhesion device, as shown inFIGS.5-5A, a transport assembly70such as a wheel has an outer surface72upon which at least one suction cup74,76is mounted as the adhesion device. The suction cup74,76extends in a normal or perpendicular direction from the outer surface72. In operation, when the transport assembly70with the suction cup74engages a non-metallic surface, and the suction cup74is further pressed onto the non-metallic surface, air or other trapped gases are removed from inside the suction cup74. Such gas removal generates a vacuum between the suction cup74and the non-metallic surface, which creates adhesion between the transport assembly70and the non-metallic surface. As the wheel is rotated or otherwise when the transport assembly70moves adjacent to the non-metallic surface, the portion of the transport assembly having the suction cup74is pulled away from the non-metallic surface. Such a pulling away action eliminates the vacuum between the suction cup74and the non-metallic surface, which reduces and then cancels the adhesion between the suction cup74and the non-metallic surface. Accordingly, the suction cup74provides releasable adhesion between the transport assembly70and the non-metallic surface. The movement of the transport assembly70adjacent to the non-metallic surface can then bring another suction cup76towards the non-metallic surface to engage and releasably adhere to the non-metallic surface. Such additional engagement of other suction cups to the non-metallic surface allows the transport assembly70to continuously and releasably adhere to the non-metallic surface as the transport assembly70moves adjacent to the non-metallic surface.", "", "As shown inFIGS.6-7, a transport assembly80, such as a wheel, has an outer surface upon which a plurality of adhesion devices82,84,86are mounted. The adhesion devices82,84,86extend in a normal or perpendicular direction from the outer surface88of the transport assembly80. The adhesion device82can be at least one of the adhesion devices10,30,50shown inFIGS.1-3, shaped and configured to use Van der Waals attraction, as described above. The adhesion device84can be the adhesion device60shown inFIG.4using a micro spine claw. The adhesion device86can be the adhesion device70shown inFIGS.5-5Ausing a suction cup.", "", "As shown inFIGS.8-9, in an alternative embodiment, the transport assembly80with releasable adhesion to non-metallic surfaces can be combined with magnetic members to constitute a transport assembly90which can also adhere to metallic surfaces, or to adhere to structure having both metallic and non-metallic portions. For example, a structure composed of non-metallic materials can be reinforced with metallic materials. Accordingly, the transport assembly90has adhesion to non-metallic surfaces with auxiliary adhesion to metallic surfaces to strengthen the adhesion of the transport assembly to the overall structure having both metallic and non-metallic portions. In one embodiment, the transport assembly90has the transport assembly form an outer ring, with an inner ring92mounted therein. The inner ring92has an aperture94which holds a magnetic adhesion device96,98. The magnetic adhesion device96,98can be a permanent magnet. Alternatively, the magnetic adhesion device96,98can be an electromagnet.", "", "As shown inFIGS.10-10B, in another alternative embodiment, the transport assembly100can be a tractor tread mechanism, having a plurality of substantially planar treads102,104which move in conjunction with the rotation of at least one wheel106,108in a manner known in the art. The treads102,104can be planar. Alternatively, the treads102,104can be curved. As shown in greater detail inFIG.10B, each tread102,104includes an adhesion device110which can be at least one of the adhesion devices10,30,50shown inFIGS.1-3, using Van der Waals attraction. The adhesion device112can be the adhesion device60shown inFIG.4using a micro spine claw. The adhesion device114can be the adhesion device70shown inFIGS.5-5Ausing a suction cup. Accordingly, the adhesion devices110,112,114on a first tread102provide releasable adhesion between the transport assembly100and the non-metallic surface. The movement of the transport assembly100adjacent to the non-metallic surface can then move the first tread102away from the non-metallic surface, while also moving the second tread104towards the non-metallic surface to engage and releasably adhere to the non-metallic surface. Such additional engagement of other adhesion devices110,112,114from the second tread104to the non-metallic surface allows the transport assembly100to continuously and releasably adhere to the non-metallic surface as the transport assembly100moves adjacent to the non-metallic surface.", "", "As shown inFIGS.11-11A, in a further alternative embodiment, the transport assembly is an omni-directional wheel or omni-wheel120. The omni-directional wheel120can be a mecanum wheel. The omni-directional wheel120has an outer circumferential surface. The outer circumferential surface includes adhesion devices122,124,126extending in a normal or perpendicular direction from the outer circumferential surface. The adhesion device122can be at least one of the adhesion devices10,30,50shown inFIGS.1-3, using Van der Waals attraction. The adhesion device124can be the adhesion device60shown inFIG.4using a micro spine claw. The adhesion device126can be the adhesion device70shown inFIGS.5-5Ausing a suction cup. Accordingly, the adhesion devices122,124,126on a first portion of the omni-directional wheel120provide releasable adhesion between the omni-directional wheel120and the non-metallic surface. The movement of the omni-directional wheel120adjacent to the non-metallic surface can then move a first portion of the omni-directional wheel120away from the non-metallic surface, while also moving a second portion of the omni-directional wheel120towards the non-metallic surface to engage and releasably adhere to the non-metallic surface. Such additional engagement of other adhesion devices122,124,126from the second portion of the omni-directional wheel120to the non-metallic surface allows the omni-directional wheel120to continuously and releasably adhere to the non-metallic surface as the omni-directional wheel120moves adjacent to the non-metallic surface.", "", "Portions of the methods described herein can be performed by software or firmware in machine readable form on a tangible (e.g., non-transitory) storage medium. For example, the software or firmware can be in the form of a computer program including computer program code adapted to cause the system to perform various actions described herein when the program is run on a computer or suitable hardware device, and where the computer program can be embodied on a computer readable medium. Examples of tangible storage media include computer storage devices having computer-readable media such as disks, thumb drives, flash memory, and the like, and do not include propagated signals. Propagated signals can be present in a tangible storage media. The software can be suitable for execution on a parallel processor or a serial processor such that various actions described herein can be carried out in any suitable order, or simultaneously.", "", "It is to be further understood that like or similar numerals in the drawings represent like or similar elements through the several figures, and that not all components or steps described and illustrated with reference to the figures are required for all embodiments or arrangements.", "", "The terminology used herein is for the purpose of describing particular embodiments only and is not intended to be limiting of the invention. As used herein, the singular forms “a,” “an,” and “the” are intended to include the plural forms as well, unless the context clearly indicates otherwise. It will be further understood that the terms “contains”, “containing”, “includes”, “including,” “comprises”, and/or “comprising,” and variations thereof, when used in this specification, specify the presence of stated features, integers, steps, operations, elements, and/or components, but do not preclude the presence or addition of one or more other features, integers, steps, operations, elements, components, and/or groups thereof.", "", "Terms of orientation are used herein merely for purposes of convention and referencing and are not to be construed as limiting. However, it is recognized these terms could be used with reference to an operator or user. Accordingly, no limitations are implied or to be inferred. In addition, the use of ordinal numbers (e.g., first, second, third) is for distinction and not counting. For example, the use of “third” does not imply there is a corresponding “first” or “second.” Also, the phraseology and terminology used herein is for the purpose of description and should not be regarded as limiting. The use of “including,” “comprising,” “having,” “containing,” “involving,” and variations thereof herein, is meant to encompass the items listed thereafter and equivalents thereof as well as additional items.", "", "While the disclosure has described several exemplary embodiments, it will be understood by those skilled in the art that various changes can be made, and equivalents can be substituted for elements thereof, without departing from the spirit and scope of the invention. In addition, many modifications will be appreciated by those skilled in the art to adapt a particular instrument, situation, or material to embodiments of the disclosure without departing from the essential scope thereof. Therefore, it is intended that the invention not be limited to the particular embodiments disclosed, or to the best mode contemplated for carrying out this invention, but that the invention will include all embodiments falling within the scope of the appended claims.", "", "The subject matter described above is provided by way of illustration only and should not be construed as limiting. Various modifications and changes can be made to the subject matter described herein without following the example embodiments and applications illustrated and described, and without departing from the true spirit and scope of the invention encompassed by the present disclosure, which is defined by the set of recitations in the following claims and by structures and functions or steps which are equivalent to these recitations."], "claims": ["an outer surface disposed adjacent to the non-metallic surface as the transport assembly moves; and a plurality of adhesion devices each mounted to the outer surface and extending at least in a normal direction away from the outer surface, wherein each adhesion device, responsive to proximity to the non-metallic surface, is configured to adhere to the non-metallic surface, wherein the plurality of adhesion devices include a first adhesion device and a second adhesion device different from the first adhesion device, and wherein the first and second adhesion devices are selected from the group consisting of: a Van der Waals-type adhesion device, a micro spine-type adhesion device, and a suction cup-type adhesion device.", "2 . The transport assembly of claim 1 , wherein each adhesion device is configured to releasably adhere to the non-metallic surface.", "3 . The transport assembly of claim 1 , wherein a top surface of the Van der Waals-type adhesion device is trapezoidally shaped.", "4 . The transport assembly of claim 1 , wherein a top surface of the Van der Waals-type adhesion device has anisotropic adhesion in a single direction.", "5 . The transport assembly of claim 1 , wherein a top surface of the Van der Waals-type adhesion device is elliptically shaped.", "6 . The transport assembly of claim 1 , wherein the outer surface is a portion of a tractor tread.", "7 . The transport assembly of claim 1 , wherein the outer surface is a portion of a circumferential surface of a wheel.", "8 . The transport assembly of claim 7 , wherein the wheel is an omni-directional wheel.", "an inner ring disposed within the circumferential surface, wherein a magnetic member is disposed on the inner ring and configured to magnetically attract a metallic surface.", "10 . The transport assembly of claim 9 , wherein the magnetic member is a permanent magnet.", "11 . The transport assembly of claim 9 , wherein the magnetic member is an electromagnet.", "an outer circumferential surface disposed adjacent to the non-metallic surface as the wheel moves on the non-metallic surface; and a plurality of adhesion devices each mounted to the outer circumferential surface and extending at least in a normal direction away from the outer circumferential surface, wherein each adhesion device, responsive to proximity to the non-metallic surface, is configured to adhere to the non-metallic surface, wherein the plurality of adhesion devices include a Van der Waals-type adhesion device, a micro spine-type adhesion device, and a suction cup-type adhesion device.", "13 . The wheel of claim 12 , wherein each adhesion device is configured to releasably adhere to the non-metallic surface.", "14 . The wheel of claim 12 , wherein a top surface of the Van der Waals-type adhesion device is trapezoidally shaped.", "15 . The wheel of claim 12 , wherein a top surface of the Van der Waals-type adhesion device has anisotropic adhesion in a single direction.", "16 . The wheel of claim 12 , wherein a top surface of the Van der Waals-type adhesion device is elliptically shaped.", "a plurality of wheels; a plurality of tractor treads configured to move about the plurality of wheels, each tractor tread having an outer planar surface disposed adjacent to the non-metallic surface as the tractor tread assembly moves; and a plurality of adhesion devices each mounted to the outer planar surface and extending at least in a normal direction away from the outer planar surface, wherein each adhesion device, responsive to proximity to the non-metallic surface, is configured to adhere to the non-metallic surface, wherein the plurality of adhesion devices include a Van der Waals-type adhesion device, a micro spine-type adhesion device, and a suction cup-type adhesion device.", "18 . The tractor tread assembly of claim 17 , wherein each adhesion device is configured to releasably adhere to the non-metallic surface.", "19 . The tractor tread assembly of claim 17 , wherein a top surface of the Van der Waals-type adhesion device is trapezoidally shaped.", "20 . The tractor tread assembly of claim 17 , wherein a top surface of the Van der Waals-type adhesion device is elliptically shaped."], "bibtex": "@patent{20240326517,\n    title = {ADHESION DEVICES FOR TRANSPORT ASSEMBLIES TO ENGAGE NON-METALLIC SURFACES},\n    number = {20240326517},\n    year = {2024},\n    note = {File: US20240326517A1-20241003.XML}\n    }", "classification": "B60C1111FI"}, {"title": "Method for monitoring the wear of a motor vehicle tire and tire pressure monitoring module for implementing said method", "doc_number": "20240326518", "filename": "US20240326518A1-20241003.XML", "abstract": "The invention relates to a method for monitoring the wear of a motor vehicle tire. According to the invention, the method comprises the following steps of: acquiring (step E1) acceleration gradient measurements of the tire to be monitored, performing (step E2) processing of said gradient measurements acquired, comparing (step E3) said processed measurements to a predetermined threshold value, transmitting a warning (step E4) when the predetermined threshold value is reached. The invention also relates to a tire pressure monitoring module, comprising hardware and/or software means for implementing said method, said hardware and/or software means being implemented in an integrated circuit.", "detailed_description": ["In the description hereinafter, elements with an identical structure or similar functions are denoted by the same reference sign.", "", "Reference is made toFIG.1, which shows a tire1of a motor vehicle wheel according to an aspect of the invention.", "", "The tire1, mounted on a motor vehicle wheel (not shown) rests on the ground3.", "", "The tire1comprises a nominal radius Rndefined by the radius of the tire1when the wheel is unladen, that is, not mounted on the vehicle.", "", "The laden tire1is deformed in the contact zone5between the tire1and the ground3, on its tread.", "", "In this contact zone, the radius of the tire1is defined by the laden radius Rc, which corresponds to the distance between the axis of rotation7of the wheel and the ground3.", "", "The tire1comprises a tire pressure monitoring system, or TPMS, module9according to an aspect of the invention, which makes it possible to acquire the tire pressure.", "", "The TPMS module9according to an aspect of the invention comprises hardware and software means capable of implementing the method of an aspect of the invention. The software means comprise computer program code means, comprising in particular the algorithm implemented to execute the method of an aspect of the invention, while the hardware means comprise an electronic module comprising a tire pressure sensor and a radial accelerometer capable of monitoring the acceleration of the wheel.", "", "In one embodiment of the invention, the hardware and/or software means for implementing the method according to an aspect of the invention may be implemented in an integrated circuit.", "", "In the position of the wheel illustrated inFIG.1, the TPMS module9is in contact with the ground3.", "", "FIG.2depicts the curve showing an example of a radial acceleration value Z perceived by the TPMS module9as a function of time t, for one complete rotation of the wheel on which the tire1is mounted.", "", "The periodic signal representing the acceleration curve fluctuates around a static value Z0equal to the product of the nominal radius Rndefined by the following formula:", "", "Z0=Rn·ω2", "", "where:Z0is a static value of the acceleration of the wheel,Rnis the nominal radius of the wheel,ω is the rotation speed of the wheel.", "", "At the moment when the TPMS module9arrives almost in contact with the ground when the tire1is rotating in the direction of the arrow shown inFIG.1, a pinching zone11of the tire1(visible inFIG.1) is generated between the tire1and the ground3.", "", "This pinching zone11is reflected in a local reduction in the nominal radius Rnof the tire1.", "", "Since the TPMS module9continues to rotate at the rotation speed ω, the local reduction in the nominal radius Ry of the tire1in the pinching zone11causes an increase in the radial acceleration Z perceived by the TPMS module9.", "", "This increase in the radial acceleration Z perceived by the TPMS module9is represented inFIG.2by a local peak in radial acceleration Z1perceived by the TPMS module9in the pinching zone11.", "", "Once the TPMS module9has gone through the pinching zone11and arrived in the contact zone5with the ground3, the acceleration Z2perceived by the TPMS module9is zero, as the TPMS module9is no longer in motion.", "", "Likewise, when the TPMS module9leaves the contact zone5with the ground3, a pinching zone13of the tire1(visible inFIG.1) is generated between the tire1and the ground3. This pinching zone13is also reflected in a local reduction in the nominal radius Rnof the tire1, causing an increase in the radial acceleration Z perceived by the TPMS module9, represented inFIG.2by a local peak in radial acceleration Z3in the pinching zone13.", "", "The peaks in radial acceleration Z1or Z3perceived by the TPMS module9are reflected in a phenomenon commonly referred to as “overshoot”.", "", "The portion15of the acceleration curve between Z1and Z2defines an entry acceleration gradient Gradentrywith respect to the contact zone5with the ground3and the portion17of the acceleration curve between Z2and Z3defines an exit acceleration gradient Gradexitwith respect to the contact zone5with the ground3.", "", "The acceleration gradient in the contact zone defines a signal commonly referred to as a “footprint” signal.", "", "Reference is made toFIG.3, which shows a comparison between a “footprint” signal S1of a first tire, shown in bold, and a “footprint” signal S2of a second tire, having greater wear than the first tire.", "", "The entry Gradentryand exit Gradexitacceleration gradients of the second tire each have a slope greater than the slopes obtained for the first, less worn tire.", "", "As the second tire is thinner than the first tire due to its greater wear, the radius of curvature of the second tire in the pinching zones11,13is smaller than that of the first tire.", "", "Note that other parameters can however influence the acceleration gradient. These parameters are, for example, the tire pressure, the load applied to the tire, and the speed of the vehicle.", "", "In the context of an aspect of the present invention, the acceleration gradient value used is a compensated value, in other words the value of the gradient used only reflects the wear of the tire.", "", "The method implemented to compensate the acceleration gradient with the other parameters does not form part of an aspect of the present invention and is therefore not described in greater detail.", "", "Reference is made toFIG.4, which shows the steps of the method for monitoring the wear of a motor vehicle tire according to an aspect of the invention.", "", "The monitoring method according to an aspect of the invention is implemented by the TPMS module9of the tire1and comprises the following steps of:step E1: acquiring acceleration gradient measurements of the tire1,step E2: performing processing of the gradient measurements acquired during step E1,step E3: comparing said processed measurements to a predetermined threshold value,step E4: transmitting a warning when the predetermined threshold value is reached.", "", "The method according to an aspect of the invention thus aims to monitor the changes in the acceleration gradient over time and transmit a warning signal when the gradient exceeds a certain threshold.", "", "The monitoring method according to an aspect of the invention thus makes it possible to deduce a significant state of wear of the monitored tire on the basis of the monitoring of changes in its acceleration gradient.", "", "An aspect of the present invention thus provides a solution for monitoring tire wear carried out solely by the TPMS module9of the tire1.", "", "The acceleration gradient measurements acquired in the context of an aspect of the present invention are:the entry acceleration gradient Gradentry, orthe exit acceleration gradient Gradexit, orthe relative difference between the entry acceleration gradient Gradentryand the exit gradient Gradexit.", "", "Reference is made toFIG.5describing a first embodiment of the monitoring method of the invention.", "", "The acquisition step E1 comprises a first sub-step E11 of learning initial conditions.", "", "The learning step E11 is typically initiated when the tire to be monitored is new.", "", "The purpose of the learning step E11 is to determine a reference acceleration gradient Grad0.", "", "To this end, in the learning phase E11, acceleration gradient measurements of the tire1are acquired, which may be entry acceleration gradient Gradentrymeasurements or exit acceleration gradient Gradexitmeasurements or entry Gradentryand exit Gradexitacceleration gradient measurements in order to deduce therefrom a relative difference between the entry Gradentryand exit Gradexitacceleration gradient.", "", "A reference acceleration gradient Grad0is determined, which may be the initial reference acceleration gradient averaged over a predetermined number of kilometers in the life of the tire1to be monitored.", "", "The reference gradient Grad0may be equal to the mean of the acceleration gradients measured for example over the first thousand kilometers in the life of the tire1.", "", "The learning phase thus makes it possible to indicate the value of the gradient that the monitored tire is supposed to have at the start of its life.", "", "As a variant, the learning step E11 may be omitted and the reference gradient value Grad0may be determined by any other means. In particular, the reference gradient value Grad0may be read from charts and entered into the algorithm for implementing the method of an aspect of the invention.", "", "The acquisition step E1 then comprises a second sub-step E12 of acquiring continuous measurements of acceleration gradients, initiated when the reference gradient Grad0has been set.", "", "The sub-step, step E12, of acquiring continuous measurements comprises in a first embodiment the acquisition of instantaneous gradient Grad(t) measurements.", "", "In a second embodiment of the sub-step, step E12, the acquisition of continuous measurements is carried out by finding the mean of consecutive gradient measurements.", "", "For example, a series of measurements is taken over a predetermined number of kilometers, and the mean of these measurements is found in order to deduce a mean gradient Gradmean. therefrom.", "", "The consecutive measurements with a view to calculating the mean thereof may be taken over a distance range, for example equal to around 50 kilometers.", "", "The step E2 of processing the gradient measurements acquired in step E1 is carried out using an “identity” function, which is an affine function of the changes in gradient over time.", "", "On the basis of this identity function, in step E2 the difference is calculated, as an absolute value, between the instantaneous gradient Grad(t) and the reference gradient Grad0, or between the mean gradient Gradmeanand the reference gradient Grad0.", "", "In step E3, the value obtained in the processing step E2 is compared to a predetermined threshold value Gradthreshold 1.", "", "If |Grad(t)−Grad0|>Gradthreshold 1, then a tire wear warning is generated (step E4).", "", "The warning may be transmitted by radiofrequency, for example.", "", "If the gradient threshold value Gradthreshold 1is exceeded, this means that the gradient has increased relative to the reference gradient Grad0, and therefore that the tire is worn.", "", "Since the acceleration gradient value used is a compensated value that only reflects the wear of the tire, the other parameters that can influence the acceleration gradient value (in particular the tire pressure, the load applied to the tire, and the speed of the vehicle) do not affect the triggering of the steps of the method of an aspect of the invention, particularly step E4 for transmitting a warning when the predetermined threshold value Gradthreshold 1is reached.", "", "In this first embodiment of the method according to the invention, a step E5 of predicting the distance remaining before a predetermined level of wear of the monitored tire is reached may be initiated.", "", "The predetermined level of wear may for example correspond to a level of complete wear of the monitored tire.", "", "Step E5 may be implemented before the gradient threshold value Gradthreshold 1is reached, that is, at any time after step E2 of processing the gradient measurements acquired during step E1 is finished, and before the warning transmission step E4 is initiated. A message to the central processing unit is then regularly transmitted without the gradient threshold value Gradthreshold 1necessarily being reached.", "", "As a variant, step E5 may be initiated when the gradient threshold value Gradthreshold 1is reached, that is, following step E4.", "", "In one exemplary embodiment, step E5 of predicting the distance remaining before a predetermined level of wear of the monitored tire is reached may be implemented periodically.", "", "Reference is made toFIG.6, which shows an exemplary embodiment of step E5 of predicting the distance remaining before the monitored tire becomes completely worn.", "", "In this exemplary embodiment of step E5, we go from a gradient Grad1having a slope a to a gradient Grad2having a slope b after having traveled a distance D1.", "", "The assumption is that the evolution between the curve Grad1and the curve Grad2takes place linearly.", "", "Based on this assumption, it is considered that to reach the value Grad3having a slope c and representing a predetermined level of wear of the monitored tire, for example complete wear, the distance D2to be traveled is equal to the distance D1.", "", "The distance remaining may be extrapolated using the following formula:", "", "K⁢mr⁢e⁢m⁢a⁢i⁢n⁢i⁢n⁢g=K⁢m⁡(t)·(Gradthreshold⁢1❘\"\\[LeftBracketingBar]\"Grad⁡(t)-Grad0❘\"\\[RightBracketingBar]\"-1)", "", "where:Kmremainingis the value of the distance remaining before the predetermined level of wear is reached,Km(t) is the value of the current distance traveled.", "", "The monitoring method of an aspect of the invention may be implemented by a second embodiment.", "", "It has been observed that, as the tire wears, the gradient stiffens substantially linearly as a function of the loss of thickness of the tire tread.", "", "It has also been observed that, approaching a maximum gradient value corresponding to a highly advanced or terminal state of wear of the tire, the variations in gradient become much more dynamic. These variations in gradient are characterized by the derivative of the gradient relative to time.", "", "Unlike in the first embodiment, the second embodiment does not comprise a step of learning a reference gradient Grad0(step E11 of the first embodiment) or entering the reference gradient Grad0read from charts into the algorithm for implementing the method of an aspect of the invention.", "", "In the execution of the method according to the second embodiment of the invention, step E1 of acquiring acceleration gradient measurements may be carried out cyclically by taking a plurality of acceleration gradient measurements over a current cycle.", "", "For example, for an iteration i performed over a predetermined distance window, the instantaneous gradient Grad(t) is measured periodically on a time basis.", "", "The distance window may for example be equal to 100 kilometers.", "", "The time base selected may for example be a minute, that is, a measurement is taken every minute.", "", "As a variant, the instantaneous gradient Grad(t) may be measured periodically, over the aforementioned predetermined distance window, on a distance basis, for example every kilometer.", "", "Given that there is a running-in phase during which certain parameters specific to the vehicle are set up, step E1 may be initiated after a predetermined number of kilometers has been traveled by the tire to be monitored.", "", "Step E2 of processing the gradient measurements deduces a mean value of the gradient Gradmeanion iteration i and a mean value of the gradient Gradmeani-1on iteration i−1.", "", "Step E2 of processing the gradient measurements then calculates the derivative in time of the mean gradient values Gradmeaniacquired for each iteration i and i−1.", "", "FIG.7shows an example of the evolution of the derivative in time of the mean gradient values for iterations i=1 to i=6.", "", "In the exemplary embodiment shown, the value of the derivative of the gradient in time is zero over iterations i=1 to i=3.", "", "From iteration i=4, the derivative increases until, between iteration i=5 and iteration i=6, it exceeds the predetermined threshold value Gradthreshold 2.", "", "In step E3, the values Gradmeaniobtained upon iterations i=1 to i=6 in processing step E2 are compared to the predetermined threshold value Grad threshold2.", "", "If", "", "❘\"\\[LeftBracketingBar]\"ddt⁢Gradmeani-ddt⁢Gradm⁢e⁢a⁢ni-1❘\"\\[RightBracketingBar]\">Gradthreshold⁢2,", "", "then a tire wear warning is generated (step E4) and transmitted by radiofrequency.", "", "According to a variant embodiment, step E2 of processing the gradient measurements deduces a mean value of the gradient Gradmeanion iteration i and a mean value of the gradient Gradmeani-kon iteration i−k, with k>1.", "", "The tire wear warning may thus be generated (step E4) not by comparison between iterations i and i−1 but by comparison between iterations i and i−2, i−3, etc.", "", "By virtue of this second embodiment, the significant variations in gradient are detected, which makes it possible to deduce that the tire has exceeded its maximum wear level and therefore that the tire is close to the end of its life.", "", "Of course, aspects of the present invention are not limited solely to the embodiments of this method for monitoring the wear of a motor vehicle tire and of this tire pressure monitoring module for implementing said method, which are described above purely by way of illustrative example, and it encompasses all variants involving technical equivalents of the means described."], "claims": ["said module comprising a pressure sensor and a radial accelerometer, said method comprising: acquiring acceleration gradient measurements of the tire to be monitored, performing processing of said gradient measurements acquired, comparing said processed measurements to a predetermined threshold value, and transmitting a warning when the predetermined threshold value is reached.", "2 . The monitoring method as claimed in claim 1 , wherein the acquisition step comprises a sub-step of learning initial conditions aiming to determine an initial reference acceleration gradient (Grad 0 ).", "3 . The monitoring method as claimed in claim 2 , wherein the initial reference acceleration gradient (Grad 0 ) is equal to the mean of the acceleration gradients measured over a predetermined number of kilometers traveled by the monitored tire.", "4 . The monitoring method as claimed in claim 2 , wherein the acquisition step comprises a sub-step subsequent to said sub-step of learning initial conditions and comprising the acquisition of measurements of instantaneous gradients Grad(t) or the acquisition of a mean gradient Grad mean equal to the mean of acceleration gradients measured over a predetermined number of kilometers traveled by the monitored tire.", "the difference, as an absolute value, between the instantaneous gradient Grad(t) and the reference gradient Grad the difference, as an absolute value, between the mean gradient Grad", "6 . The monitoring method as claimed in claim 5 , wherein the comparison step is performed by comparing the gradient value obtained at the end of the processing step to a predetermined threshold value (Grad threshold 1 ).", "7 . The monitoring method as claimed in claim 6 , wherein if said gradient value obtained at the end of the processing step is greater than said predetermined threshold value (Grad threshold 1 ), then the warning transmission step is triggered.", "8 . The monitoring method as claimed in claim 5 , further comprising aiming to predict the distance remaining before a predetermined level of wear of the monitored tire is reached.", "9 . The monitoring method as claimed in claim 8 , wherein said step aiming to predict the distance remaining before a predetermined level of wear of the monitored tire is reached is implemented following the warning transmission step.", "10 . The monitoring method as claimed in claim 8 , wherein said step aiming to predict the distance remaining before a predetermined level of wear of the monitored tire is reached is implemented before the warning transmission step is reached.", "11 . The monitoring method as claimed in claim 1 , wherein the acceleration gradient measurement acquisition step is carried out by periodically measuring the instantaneous acceleration gradient Grad (t) for an iteration i and for an iteration i−k, k>0, each of said iterations being carried out over a predetermined distance window.", "a mean gradient value Grad a mean gradient value Grad", "13 . The monitoring method as claimed in claim 12 , wherein the processing step is carried out by applying a derivative function on the basis of which a derivative gradient value is calculated, equal to the difference, as an absolute value, between the derivative relative to time of the mean gradient value Grad mean i on iteration i and the derivative relative to time of the mean gradient value Grad mean i-k on iteration i−k, k>0.", "14 . The monitoring method as claimed in claim 13 , wherein the comparison step is performed by comparing said derivative gradient value obtained at the end of the processing step to a predetermined threshold value (Grad threshold 2 ).", "15 . The monitoring method as claimed in claim 14 , wherein if said derivative gradient value obtained at the end of the processing step is greater than said predetermined threshold value (Grad threshold 2 ), then the warning transmission step is triggered.", "16 . The monitoring method as claimed in claim 11 , wherein said acquisition step of acquiring the acceleration gradient measurements of the tire to be monitored is initiated after a predetermined number of kilometers has been traveled by said tire to be monitored.", "17 . The monitoring method as claimed in claim 1 , wherein the acceleration gradient value of the tire to be monitored is a compensated value.", "the entry acceleration gradient (Grad the exit acceleration gradient (Grad the relative difference between the entry acceleration gradient (Grad", "19 . A tire pressure monitoring module, comprising hardware and/or software for implementing the method as claimed in claim 1 , wherein said hardware and/or software are implemented in an integrated circuit."], "bibtex": "@patent{20240326518,\n    title = {Method for monitoring the wear of a motor vehicle tire and tire pressure monitoring module for implementing said method},\n    number = {20240326518},\n    year = {2024},\n    note = {File: US20240326518A1-20241003.XML}\n    }", "classification": "B60C1124FI"}, {"title": "Method for monitoring the wear of a motor vehicle tire and tire pressure monitoring module for implementing said method", "doc_number": "20240326519", "filename": "US20240326519A1-20241003.XML", "abstract": "The invention relates to a method for monitoring the wear of a motor vehicle tire. According to the invention, the method comprises the following steps of: acquiring (step E 1 ), from a tangential acceleration signal of said monitoring module, measurements of a variable in the group comprising a maximum tangential acceleration peak and a minimum tangential acceleration peak, performing (step E 2 ) processing of said measurements of said acquired variable, comparing (step E 3 ) said processed measurements to a predetermined maximum variation threshold value, transmitting a warning (step E 4 ) when said predetermined maximum variation threshold value is reached. The invention also relates to a tire pressure monitoring module for implementing said method.", "detailed_description": ["In the description hereinafter, elements with an identical structure or similar functions are denoted by the same reference sign.", "", "Reference is made toFIG.1, which shows a tire1of a motor vehicle wheel according to an aspect of the invention.", "", "The tire1, mounted on a motor vehicle wheel (not shown) rests on the ground3.", "", "The tire1comprises a nominal radius Rndefined by the radius of the tire1when the wheel is unladen, that is, not mounted on the vehicle.", "", "The laden tire1is deformed in the contact zone5between the tire1and the ground3, on its tread.", "", "In this contact zone, the radius of the tire1is defined by the laden radius Rc, which corresponds to the distance between the axis of rotation7of the wheel and the ground3.", "", "The tire1comprises a tire pressure monitoring system, or TPMS, module9according to an aspect of the invention, which makes it possible to acquire the tire pressure.", "", "The TPMS module9according to an aspect of the invention comprises hardware and software means capable of implementing the method of an aspect of the invention. The software means comprise computer program code means, comprising in particular the algorithm implemented to execute the method of an aspect of the invention, while the hardware means comprise an electronic module comprising a tire pressure sensor and a tangential accelerometer capable of monitoring the tangential acceleration of the wheel.", "", "In one embodiment of the invention, the hardware and/or software means for implementing the method according to an aspect of the invention can be implemented in an integrated circuit.", "", "In the position of the wheel illustrated inFIG.1, the TPMS module9is in contact with the ground3.", "", "FIG.2depicts the curve showing an example of a tangential acceleration signal Z perceived by the TPMS module9as a function of time t, for one complete rotation of the wheel on which the tire1is mounted.", "", "Considering that the tire1rotates at a constant speed, the periodic signal representing the tangential acceleration curve therefore fluctuates around a zero value.", "", "At the moment when the TPMS module9arrives almost in contact with the ground when the tire1is rotating in the direction of the arrow shown inFIG.1, a pinching zone11of the tire1(visible inFIG.1) is generated between the tire1and the ground3.", "", "This pinching zone11is reflected in a local reduction in the nominal radius Rnof the tire1.", "", "Given that the TPMS module9continues to rotate at the rotation speed ω, the local reduction in the nominal radius Rnof the tire1in the pinching zone11causes an increase in the tangential acceleration Z perceived by the TPMS module9.", "", "When the TPMS module9has passed through the pinching zone11, the TPMS module9undergoes a strong deceleration as it goes from a positive speed to a zero speed when it arrives in the contact zone5with the ground3.", "", "This deceleration continues until it reaches a minimum tangential acceleration peak Zminbefore returning, via a strong acceleration, to its zero value representing the tangential acceleration perceived by the TPMS module9in the contact zone5with the ground3.", "", "When the TPMS module9comes back out of the contact zone5with the ground3and resumes its rotational movement, the TPMS module9undergoes a strong acceleration that continues until it reaches a maximum tangential acceleration peak Zmaxbefore returning, via a strong deceleration, to its zero value representing the tangential acceleration perceived by the TPMS module9when the tire1continues its rotation at constant speed.", "", "In the context of an aspect of the present invention and as will be seen hereinafter in the description, the method according to an aspect of the invention provides for the monitoring of changes in variables V in the group comprising at least the maximum tangential acceleration peak Zmaxand the minimum tangential acceleration peak Zmin.", "", "Reference is made toFIG.3, which shows a comparison of a tangential acceleration signal S1of a first tire, shown in bold, and a tangential acceleration signal S2of a second tire, having greater wear than the first tire.", "", "The tangential acceleration signal of the second tire has a maximum tangential acceleration peak Z′maxand a minimum tangential acceleration peak Z′minboth respectively greater, as an absolute value, than the maximum tangential acceleration peak Zmaxof the first tire and the minimum tangential acceleration peak Zminof the first tire.", "", "As the second tire is thinner than the first tire due to its greater wear, the radius of curvature of the second tire in the pinching zones11,13is smaller than that of the first tire.", "", "It will be noted that other parameters can however influence the tangential acceleration signal. These parameters are, for example, the tire pressure, the load applied to the tire, and the speed of the vehicle.", "", "In the context of an aspect of the present invention, the variables V that are used can be compensated values, that is, the values of the maximum tangential acceleration peak Zmax, Z′maxand the values of the minimum tangential acceleration peak Zmin, Z′minonly reflect the wear of the tire.", "", "The method implemented to compensate the values of the maximum tangential acceleration peak Zmaxand the minimum tangential acceleration peak Zminwith the other parameters does not form part of an aspect of the present invention and is therefore not described in greater detail.", "", "Reference is made toFIG.4, which shows the steps of the method for monitoring the wear of a motor vehicle tire according to an aspect of the invention.", "", "The monitoring method according to an aspect of the invention is implemented by the TPMS module9of the tire1and comprises the following steps of:", "", "step E1: acquiring, from the tangential acceleration signal of the TPMS module, measurements of at least one variable in the group comprising a maximum tangential acceleration peak Zmaxand a minimum tangential acceleration peak Zmin,", "", "step E2: performing processing of the measurements of said variables acquired during step E1,", "", "step E3: comparing said processed measurements to a predetermined threshold value,", "", "step E4: transmitting a warning when said predetermined threshold value is reached.", "", "The method according to an aspect of the invention thus aims to monitor the changes in the tangential acceleration over time and transmit a warning signal when the monitored variables V exceed a certain threshold that corresponds to a maximum variation value.", "", "More specifically, the method according to an aspect of the invention aims to monitor the changes in tangential acceleration over time and transmit a warning signal when a maximum tangential acceleration peak Zmaxor a minimum tangential acceleration peak Zminexceeds a certain threshold, which corresponds to a maximum variation value for the maximum peak or for the minimum peak.", "", "From the monitoring of the changes in tangential acceleration of the TPMS module9, the monitoring method according to an aspect of the invention makes it possible to deduce a state of significant wear of the monitored tire.", "", "An aspect of the present invention thus provides a solution for monitoring the wear of the tire carried out solely by the TPMS module9of the tire1.", "", "Reference is made toFIG.5to describe a first embodiment of the monitoring method of the invention.", "", "The acquisition step E1can comprise a first sub-step E11of learning initial conditions.", "", "The learning step E11is typically initiated when the tire to be monitored is new.", "", "The aim of the learning step E11is to determine a reference value Vrefof the variable under consideration, which can be the maximum tangential acceleration peak Zmaxor the minimum tangential acceleration peak Zmin.", "", "To this end, in the learning phase E11, the tangential acceleration signal of the TPMS module9of the tire1is monitored.", "", "The reference value Vrefof the variable under consideration can be averaged over a predetermined number of kilometers of the life of the tire1to be monitored.", "", "For example, the reference value Vrefof the variable under consideration can be equal to the mean of the values of the maximum tangential acceleration peak Zmaxor the mean of the values of the minimum tangential acceleration peak Zmin, for example measured over the first one thousand kilometers of the life of the tire1.", "", "The learning phase thus makes it possible to determine the value of the maximum tangential acceleration peak Zmaxor of the minimum tangential acceleration peak Zminthat the monitored tire is supposed to meet in a predetermined period, for example at the beginning of its life.", "", "As a variant, the learning step E11can be omitted and the reference value Vrefof the maximum tangential acceleration peak Zmaxor of the minimum tangential acceleration peak Zmincan be determined by any other means.", "", "In particular, the reference value Vrefof the maximum tangential acceleration peak Zmaxor of the minimum tangential acceleration peak Zmincan be read from charts and entered into the algorithm for implementing the monitoring method of an aspect of the invention.", "", "The acquisition step E1then comprises a second sub-step E12of acquiring measurements of the monitored variables V, initiated when the reference value Vrefhas been fixed.", "", "In a first embodiment, the sub-step E12of acquiring measurements comprises the acquisition of measurements of instantaneous variables V(t) corresponding to the instantaneous value of the maximum tangential acceleration peak Zmaxor to the instantaneous value of the minimum tangential acceleration peak Zmin.", "", "In a second embodiment, the sub-step E12of acquiring measurements is carried out by finding the mean Vfilt(t) of the consecutive measurements of the monitored variables V.", "", "For example, a series of measurements of the monitored variables V is taken over a predetermined number of kilometers, and the mean of these measurements is found in order to deduce a mean value Vfilt(t) of the monitored variable V.", "", "The consecutive measurements with a view to calculating the mean thereof can be taken over a distance range, for example equal to around 50 kilometers.", "", "The step E2of processing the measurements of the variables V acquired during step E1is for example carried out using a so-called “identity” function, which is an affine function of the changes in the variables V over time.", "", "On the basis of this identity function, in step E2the difference is calculated, as an absolute value, between the instantaneous variable V(t) and the reference value Vref, or between the mean value Vfilt(t) and the reference value Vref.", "", "Reference is made toFIG.6, which sets out the execution of step E3of the method according to an aspect of the invention.", "", "The signal S1shown in bold illustrates a tangential acceleration signal of a reference tire, and the signal S2is a tangential acceleration signal of a tire being monitored.", "", "During step E3, the value obtained during the processing step E2is compared to a predetermined maximum variation threshold value Vseuil.", "", "When the variable monitored is the maximum tangential acceleration peak Zmax, the predetermined maximum variation threshold value Vseuilthus corresponds to a maximum threshold.", "", "Likewise, when the variable monitored is the minimum tangential acceleration peak Zmin, the predetermined maximum variation threshold value Vseuilcorresponds to a minimum threshold.", "", "According to step E4of the monitoring method of an aspect of the invention, if |V(t)−Vref|>Vseuil, then a tire wear warning is generated.", "", "Likewise, if |Vfilt(t)−Vref|>Vseuil, then a tire wear warning is generated (step E4).", "", "In the illustration shown inFIG.6, if the difference between the value of the minimum tangential acceleration peak Z′minof the signal S2and the reference value Vrefof the variable under consideration (here equal to the value of the minimum tangential acceleration peak Zminof the signal S1) is greater, as an absolute value, than the predetermined maximum variation threshold Vseuil, then a tire wear warning is generated (step E4).", "", "The warning can be transmitted by radiofrequency, for example.", "", "If the predetermined maximum variation threshold value Vseuilis exceeded, this means that the monitored variable V (Zmaxor Zmin) has increased as an absolute value relative to its reference value Vref, and therefore that the tire is worn.", "", "Given that the value of the monitored variable V being used is a compensated value that only reflects the wear of the tire, the other parameters that can influence its variation (in particular the tire pressure, the load applied to the tire, and the speed of the vehicle) do not affect the triggering of the steps of the method of an aspect of the invention, particularly the warning transmission step E4.", "", "Reference is made toFIG.7, which shows a variant of the first embodiment.", "", "In this variant, a step E5of predicting the distance remaining before a predetermined wear level of the monitored tire is reached can be initiated.", "", "Step E5can be implemented before the predetermined maximum variation threshold value Vseuilis reached, that is, at any time after step E2of processing the measurements of the variables V acquired during step E1is complete, and before the warning transmission step E4is initiated. A message to the central processing unit is then regularly transmitted without the predetermined maximum variation threshold value Vseuilnecessarily being reached.", "", "As a variant, step E5can be initiated when the predetermined maximum variation threshold value Vseuilis reached, that is, following step E4.", "", "In one embodiment, step E5of predicting the distance remaining before a predetermined wear level of the monitored tire is reached can be implemented periodically.", "", "The predetermined wear level can for example correspond to a total wear level of the monitored tire.", "", "The distance remaining can be extrapolated using the following formula:", "", "Kmrestant=Km⁡(t)·(Vseuil❘\"\\[LeftBracketingBar]\"V⁡(t)-Vref❘\"\\[RightBracketingBar]\"-1)", "", "where:Kmrestantis the value of the distance remaining until the predetermined wear level is reached,Km(t) is the value of the current distance traveled.", "", "Alternatively, the distance remaining can be extrapolated using the following formula:", "", "Kmrestant=Km⁡(t)·(Vseuil❘\"\\[LeftBracketingBar]\"Vfilt(t)-Vref❘\"\\[RightBracketingBar]\"-1)", "", "The monitoring method of an aspect of the invention can be implemented by a second embodiment.", "", "It has been observed that as the tire wears, the value of the variable V monitored using the method of an aspect of the invention increases as an absolute value.", "", "It has also been observed that as the predetermined maximum variation threshold value Vseuilcorresponding to a very advanced or terminal state of wear of the tire is approached, the variations in the monitored variable V(value of the minimum tangential acceleration peak Zminor value of the maximum tangential acceleration peak Zmax) are much more dynamic.", "", "This is reflected in an increase in the speed at which the value of the monitored variable V approaches the predetermined maximum variation threshold value Vseuil.", "", "These variations are characterized by the derivative of the monitored variable V relative to time.", "", "Unlike in the first embodiment, the second embodiment does not comprise a step of learning a reference value Vrefof the variable under consideration (step E11of the first embodiment) or entering the reference value Vrefof the variable under consideration known from charts into the algorithm for implementing the method of an aspect of the invention.", "", "In the execution of the method according to the second embodiment of the invention, step E1of acquiring measurements of the variables V can be carried out cyclically by taking a plurality of measurements of the monitored variable V over a current cycle.", "", "For example, for an iteration i performed over a predetermined distance window, the monitored variable V is measured periodically on a time basis.", "", "The distance window can for example be equal to 100 kilometers.", "", "The time basis selected can for example be a minute, that is, a measurement is taken every minute.", "", "As a variant, the monitored variable V can be measured periodically, over the aforementioned predetermined distance window, on a distance basis, for example every kilometer.", "", "Given that there is a running-in phase during which certain parameters specific to the vehicle are set up, step E1can be initiated after a predetermined number of kilometers has been traveled by the tire to be monitored.", "", "Step E2of processing the measurements of the acquired variables deduces a mean value of the monitored variables Vmoyion iteration i and a mean value of the monitored variables Vmoy-1on iteration i-1.", "", "Step E2of processing the measurements of the acquired variables then calculates the derivative in time of the mean values of the acquired variables Vmoyiand Vmoyi-1for each iteration i and i-1.", "", "During step E3, the values", "", "ddt⁢Vmoyi", "", "and", "", "ddt⁢Vmoyi-1,", "", "obtained during the processing step E2, are compared to a predetermined threshold value Vseuil2.", "", "If", "", "❘\"\\[LeftBracketingBar]\"ddt⁢Vmoyi-ddt⁢Vmoyi-1❘\"\\[RightBracketingBar]\">Vseuil2,", "", "then a tire wear warning is generated (step E4) and transmitted by radiofrequency.", "", "According to one variant embodiment, step E2of processing the measurements of the variables calculates a derivative in time of the mean values of the acquired variables Vmoyion iteration i and of the mean values of the acquired variables Vmoyi-kon iteration i-k, where k>1.", "", "The tire wear warning can thus be generated (step E4) not by comparison between iterations i and i-1 but by comparison between iterations i and i-2, i-3, etc.", "", "Using this second embodiment, the significant variations in the monitored variable V are detected, which makes it possible to deduce that the tire has exceeded its maximum wear level and therefore that the tire is close to the end of its life.", "", "Of course, aspects of the present invention are not limited solely to the embodiments of this method for monitoring the wear of a motor vehicle tire and of this tire pressure monitoring module for implementing said method, which are described above by way of illustrative example only, and it encompasses all variants involving technical equivalents of the means described."], "claims": ["acquiring, from a tangential acceleration signal of said tire pressure monitoring module, measurements of at least one variable (V) in the group comprising a maximum tangential acceleration peak (Z performing processing of said measurements of said at least one acquired variable (V), comparing said processed measurements to a predetermined maximum variation threshold value (V transmitting a warning when said predetermined maximum variation threshold value (V", "2 . The monitoring method as claimed in claim 1 , wherein said acquisition step comprises a sub-step of learning initial conditions aiming to determine a reference value (V ref ) of said at least one variable (V).", "3 . The monitoring method as claimed in claim 2 , wherein said reference value (V ref ) of said at least one variable (V) is equal to the mean of the values of said at least one variable (V) measured over a predetermined number of kilometers traveled by the monitored tire.", "4 . The monitoring method as claimed in claim 2 , wherein said acquisition step comprises a sub-step subsequent to said sub-step of learning initial conditions and comprising the acquisition of measurements of instantaneous variables (V(t)) or the acquisition of a mean value (V filt (t)) equal to the mean of the values of consecutive measurements of said at least one variable (V) over a predetermined number of kilometers traveled by the monitored tire.", "the difference, as an absolute value, between one of said instantaneous variables V(t) and said reference value (V the difference, as an absolute value, between said mean value (V", "6 . The monitoring method as claimed in claim 5 , further comprising a step aiming to predict the distance remaining before a predetermined wear level of the monitored tire is reached.", "7 . The monitoring method as claimed in claim 6 , wherein said step of aiming to predict the distance remaining before a predetermined wear level of the monitored tire is reached is implemented following the warning transmission step.", "8 . The monitoring method as claimed in claim 6 , wherein said step aiming to predict the distance remaining before a predetermined wear level of the monitored tire is reached is implemented before the warning transmission step is reached.", "9 . The monitoring method as claimed in claim 1 , wherein said acquisition step is carried out by periodically measuring said at least one variable (V) for an iteration i and for an iteration i-k, k>0, each of said iterations being carried out on a predetermined distance window.", "a mean value of said at least one variable (V a mean value of said variable (V", "11 . The monitoring method as claimed in claim 10 , wherein said processing step is carried out by applying a derivative function on the basis of which a derivative value of the mean values of said at least one variable (V) is calculated that is equal to the difference, as an absolute value, between the derivative relative to time of the mean value of said at least one variable (V moy i ) on iteration i and the derivative relative to time of the mean value of said at least one variable (V moy i-k ) on iteration i-k, k>0.", "12 . The monitoring method as claimed in claim 9 , wherein said acquisition step is initiated after a predetermined number of kilometers has been traveled by said tire to be monitored.", "13 . The monitoring method as claimed in claim 1 , wherein said at least one variable (V) is a compensated value.", "14 . A tire pressure monitoring module, comprising hardware and/or software means for implementing the method as claimed in claim 1 , wherein said hardware and/or software means are implemented in an integrated circuit."], "bibtex": "@patent{20240326519,\n    title = {Method for monitoring the wear of a motor vehicle tire and tire pressure monitoring module for implementing said method},\n    number = {20240326519},\n    year = {2024},\n    note = {File: US20240326519A1-20241003.XML}\n    }", "classification": "B60C1124FI"}, {"title": "TIRE INCLUDING A PATTERN FORMING AREA WITH A UNIT PATTERN", "doc_number": "20240326520", "filename": "US20240326520A1-20241003.XML", "abstract": "Proposed is a tire including a pattern forming area provided on a sidewall to display a pattern of predetermined shape, wherein the pattern forming area is formed by continuously arranging a plurality of hexagon-shaped unit patterns, and the unit patterns existing on the edges of the pattern forming area are cut off in shapes to correspond to the shape of the pattern forming area.", "detailed_description": ["The present invention is disclosed with reference to the attached drawings wherein the corresponding parts in the embodiments of the present invention are indicated by corresponding reference numerals and the repeated explanation on the corresponding parts will be avoided. If it is determined that the detailed explanation on the well known technology related to the present invention makes the scope of the present invention not clear, the explanation will be avoided for the brevity of the description.", "", "When it is said that one element is described as being “connected” or “coupled” to the other element, one element may be directly connected or coupled to the other element, but it should be understood that another element may be present between the two elements. In contrast, when it is said that one element is described as being “directly connected” or “directly coupled” to the other element, it should be understood that another element is not present between the two elements.", "", "Terms used in this application are used to only describe specific exemplary embodiments and are not intended to restrict the present invention. An expression referencing a singular value additionally refers to a corresponding expression of the plural number, unless explicitly limited otherwise by the context. In this application, terms, such as “comprise”, “include”, or ‘have”, are intended to designate those characteristics, numbers, steps, operations, elements, or parts which are described in the specification, or any combination of them that exist, and it should be understood that they do not preclude the possibility of the existence or possible addition of one or more additional characteristics, numbers, steps, operations, elements, or parts, or combinations thereof.", "", "Hereinafter, an embodiment of the present invention will be explained in detail with reference to the attached drawings.", "", "FIG.2shows a tire according to the present invention that has a pattern forming area formed on a sidewall thereof, andFIG.3is an enlarged view showing the pattern forming area formed on the sidewall of the tire of the present invention.", "", "As shown inFIGS.2and3, a tire5according to the present invention includes a pattern forming area10provided on a sidewall to display a pattern of predetermined shape. In this case, a general structure of the tire5excepting the pattern forming area10is obvious to those skilled in the art, and therefore, an explanation of the general structure will be avoided.", "", "According to the present invention, the pattern forming area10has a plurality of hexagon shaped unit patterns100arranged continuously thereon, and accordingly, the pattern forming area10is filled with the unit patterns100, without any empty space. Each unit pattern100may have the shape of a regular hexagon.", "", "However, the unit patterns100existing on the edges of the pattern forming area10are cut off in shapes to correspond to the shape of the pattern forming area10.", "", "That is, the tire5according to the present invention is provided with the pattern forming area10having a new shape, while not having the patterns represented with planar contrast in the conventional practices, thereby greatly improving an outer appearance quality thereof.", "", "Now, an explanation of the unit patterns100will be given in more detail below.", "", "FIGS.4and5show the unit patterns100of the pattern forming area10formed on the sidewall of the tire of the present invention.", "", "As shown inFIGS.4and5, the unit pattern100includes a plurality of concaved portions110arranged side by side in a predetermined shape thereon and a plurality of protruding portions130formed between the neighboring concaved portions110.", "", "Further, the unit pattern100includes outer edge portions120protruding more than the concaved portions110. According to the present invention, the sides of the unit pattern100are closed by means of the outer edge portions120, and the concaved portions110are formed inside the outer edge portions120. Otherwise, the outer edge portions120may have the same heights as the concaved portions110, and even in this case, the unit pattern100may be kept in shape, without any change.", "", "According to the present invention, the unit pattern100is divided into a center area R1and a pair of side areas R2located on both sides of the center area R1with respect to a pair of imaginary extension lines extending from both peaks of a first side101as any one of six sides thereof to separated points on a second side102located on the opposite side to the first side101.", "", "In this case, each concave portion110may extend long over the center area R1and the pair of side areas R2.", "", "In specific, each concave portion110has a shape bent along an outer shape of the unit pattern100on the boundaries between the center area R1and the pair of side areas R2. According to the present invention, the tire5represents the unit patterns100three-dimensionally by the optical illusion of the concave portions110because of the bent shapes of the concave portions110.", "", "Further, the concave portions110are formed such that angle bent on the center area R1and the pair of side areas R2gradually decreases from the first side101to the second side102of the unit pattern100. Accordingly, the unit pattern100is filled with the concave portions110, without any empty space.", "", "According to the present invention, further, the unit patterns100are arranged in the pattern forming area10in different directions from one another. That is, the concave portions110of the plurality of unit patterns100are arranged side by side, and otherwise, they may be arranged at different angles from one another.", "", "As shown inFIG.5, further, the neighboring unit patterns100are connected to each other, without any stepped portion, because their outer edge portions120are continuously connected to each other. In specific, the neighboring unit patterns100are formed to share their outer edge portions120with each other, thereby improving the tire's beauty. InFIG.5, the outer edge portion120protrudes more than the concave portion110, but it is possible that the outer edge portion120may have the same height as the concave portion110.", "", "As described above, the tire according to the present invention allows the pattern forming area to be located on the sidewall thereof to continuously arrange the unit patterns with hexagonal shapes thereon, thereby improving an outer appearance quality thereof to ensure a high degree of beauty.", "", "Further, the tire according to the present invention allows a degree of dirtiness occurring while a vehicle is driven to be not remarkably visible on the outer appearance thereof and allows the surface of the pattern forming area to be sophisticatedly formed thereon when seen, thereby greatly reducing a surface dirtiness speed caused by the vehicle's driving.", "", "As mentioned above, the preferred embodiment of the present invention has been disclosed in the specification and drawings. Therefore, persons skilled in the relevant art can appreciate that many modifications and variations are possible in light of the above teachings. It is not intended to be exhaustive or to limit the invention to the precise forms disclosed. For example, the parts expressed in a singular form may be dispersedly provided, and in the same manner as above, the parts dispersed may be combined with each other.", "", "Thus, although the invention has been described with respect to specific embodiments, it will be appreciated that the invention is intended to cover all modifications and equivalents within the scope of the following claims."], "claims": ["1 . A tire comprising a pattern forming area positioned on a sidewall to display a pattern of predetermined shape, wherein the pattern forming area is formed by continuously arranging a plurality of hexagon-shaped unit patterns, and the unit patterns existing on edges of the pattern forming area are cut off in shapes to correspond to a shape of the pattern forming area.", "2 . The tire according to claim 1 , wherein each unit pattern comprises a plurality of concaved portions arranged side by side in predetermined shapes thereon.", "3 . The tire according to claim 2 , wherein each unit pattern is divided into a center area and a pair of side areas located on both sides of the center area with respect to a pair of imaginary extension lines extending from both peaks of a first side thereof to separated points on a second side located on an opposite side to the first side, and each concaved portion extends long over the center area and the pair of side areas.", "4 . The tire according to claim 3 , wherein each concave portion has a shape bent along an outer shape of the unit pattern on boundaries between the center area and the pair of side areas.", "5 . The tire according to claim 4 , wherein the plurality of concaved portions are formed such that an angle bent on the center area and the pair of side areas gradually decreases from the first side to the second side of the unit pattern.", "6 . The tire according to claim 2 , wherein each unit pattern has outer edge portions protruding more than the concaved portions.", "7 . The tire according to claim 6 , wherein neighboring unit patterns of the plurality of unit patterns have a shape formed by continuously connecting the outer edge portions to each other."], "bibtex": "@patent{20240326520,\n    title = {TIRE INCLUDING A PATTERN FORMING AREA WITH A UNIT PATTERN},\n    number = {20240326520},\n    year = {2024},\n    note = {File: US20240326520A1-20241003.XML}\n    }", "classification": "B60C1300FI"}]