[{"title": "ECCENTRIC JOUNCE TRAVELLING MECHANISM FOR CHILDREN'S TOY VEHICLE AND TRAVELLING METHOD", "doc_number": "20240174022", "filename": "US20240174022A1-20240530.XML", "abstract": "The present disclosure is an eccentric jounce travelling mechanism for a children's toy vehicle and a travelling method. The mechanism includes a vehicle frame, and a front wheel component and a rear wheel component arranged at a bottom of the vehicle frame for supporting the vehicle frame, and an eccentric adjustment mechanism is arranged at an interior of the front wheel component. By arranging the eccentric adjustment mechanism, the position of a positioning shaft can be controlled, and whether the front wheel component is eccentrically mounted or not can be controlled by the relative position between flat grooves on the positioning shaft and limit blocks, to cause the children's toy vehicle to smoothly travel and jounce upwards and downwards, increasing the interestingness of the children's toy vehicle.", "detailed_description": ["Technical solutions in the examples of the present disclosure will be described clearly and completely in the following with reference to the attached drawings in the examples of the present disclosure. Obviously, all the described examples are only some, rather than all examples of the present disclosure.", "", "Referring toFIGS.1-10, an eccentric jounce travelling mechanism for a children's toy vehicle includes a vehicle frame1, and further includes a front wheel component2and a rear wheel component3arranged at a bottom of the vehicle frame1for supporting the vehicle frame1. A seat shell4with an animal-shaped structure is clamped with an exterior of the vehicle frame1, pedals5convenient for retracting feet of a child are fixedly mounted on two sides of a middle part of the seat shell4via bolts, and an eccentric adjustment mechanism for controlling a moving track of a front end of the vehicle frame1is arranged at an interior of the front wheel component2.", "", "The eccentric adjustment mechanism includes an eccentric box6sleeved inside the front wheel component2. In order to adjust the mounting position between the vehicle frame1and the front wheel component2and realize the eccentric mounting of the front wheel component2, an inner wall of one side of the eccentric box6is arranged with a movable piece61for adjusting the mounting position between the vehicle frame1and the front wheel component2. Further, in order to adjust the position of the movable piece61, an inner wall of the other side of the eccentric box6is arranged with a positioning shaft62for limiting and locking the movable piece61, and the eccentric box6is designed to be formed by splicing a rear mounting cover63and a front mounting cover64to facilitate the maintenance and replacement of the eccentric adjustment mechanism at a later stage. Further, the front wheel component2is designed to be formed by slidably clamping a left cover of front wheel65and a right cover of front wheel66. Outer surfaces of the left cover of front wheel65and the right cover of front wheel66are both disposed with guide sliding grooves606, and the rear mounting cover63and the front mounting cover64are spliced and fixedly connected via bolts, so that the front wheel component2can be disassembled at the later stage to facilitate the maintenance and replacement of the eccentric adjustment mechanism, and since the front mounting cover64and the rear mounting cover63are connected via the bolts, an inner structure of the eccentric box6is facilitated to being maintained and replaced at the later stage.", "", "Further, in order to guide the movement track of the movable piece61, coaxial straight notches67are disposed on surfaces of one side of the rear mounting cover63and the front mounting cover64, and two convex rings68slidably connected to inner walls of the two straight notches67are fixedly connected to surfaces of two ends of the movable piece61. The movable piece61can be supported by the cooperation of the two convex rings68and the straight notches67, and the position of the movable piece61can be adjusted by changing the relative position between the convex rings68and the straight notches67. Further, in order to better connect the vehicle frame1to the front wheel component2, the front end of the vehicle frame1is sequentially sleeved with the convex rings68and the movable piece61via a pin shaft to mount the front wheel component2, and in order to adjust the position of the movable piece61, limit blocks69are fixedly connected to a surface of one side of the movable piece61.", "", "In order to adjust the concentric mounting and eccentric mounting of the front wheel component2, two matching grooves610movably inserted with an outer surface of the positioning shaft62are disposed on a surface of one side of the limit block69, an axis of one of the matching grooves610and an axis of the front wheel component2being on the same horizontal center line. When the positioning shaft62is matched with the matching grooves610coaxially arranged with the front wheel component2, the children's toy vehicle is in a stable travelling state, and it is possible to control whether the front wheel component2is mounted eccentrically through the position between the positioning shaft62and the two matching grooves610of the limit blocks69, thereby controlling the travelling state of the children's toy vehicle.", "", "In order to push and reset the positioning shaft62through the spring611after the button614loses the pressing force, a driving port612for placing a spring611is disposed on an inner wall of the front mounting cover64. In order to stably mount the positioning shaft62and control the positioning shaft62to move along the axial direction by means of pressing, an outer surface of one end of the positioning shaft62is movably inserted with an inner wall of the driving port612. Further, in order to change the relative position between the movable piece61and the front wheel component2by adjusting the position of the positioning shaft62when it is required to adjust the position of the movable piece61, a flat groove613matching with the limit block69is disposed on a surface of one side of a middle part of the positioning shaft62. When the flat groove613of the positioning shaft62is flush with the limit block69, the position between the positioning shaft62and the movable piece61can be adjusted, and the blocking between the positioning shaft62and the movable piece61is lost by the flat groove613to facilitate the relative displacement between the movable piece61and the positioning shaft62.", "", "Further, in order to control the positioning shaft62, a button614for pressing and controlling the positioning shaft62to move along an axial direction towards the rear mounting cover63is movably sleeved on an outer surface of the other end of the positioning shaft62. Further, in order to better control the positioning shaft62, a pressing port615movably sleeved on an outer surface of the button614is disposed on a surface of one side of the front mounting cover64. A socket617adapted to the pressing port615is disposed on a surface of one side of the right cover of front wheel66, so that the button614can be guided by the pressing port615. The button614is pressed to control the positioning shaft62to move to cause the flat groove613of the positioning shaft62to interface with the limit block69.", "", "In order to prevent the positioning shaft62from rotating circumferentially, top walls and bottom walls of interiors of the driving port612and the pressing port615are planar to prevent the positioning shaft62from rotating circumferentially when the front wheel component2moves. In order to prevent the button614from falling out of the pressing port615, a limit ring616for preventing the button614from falling out of the pressing port615is fixedly connected to a peripheral side surface of one end of the button614. The button614is prevented from sliding out of the pressing port615by the limit ring616; and it is possible to prevent the positioning shaft62from rotating due to the jounce generated when the front wheel component2is operated by the shape features of the driving port612and the pressing port615, so that the eccentric adjustment mechanism can be normally used.", "", "By arranging the eccentric adjustment mechanism, the position of the positioning shaft62can be controlled by the button614, and whether the front wheel component2is eccentrically mounted or not can be controlled by the relative position between flat grooves613on the positioning shaft62and limit blocks69, to cause the children's toy vehicle to smoothly travel and jounce upwards and downwards, increasing the interestingness of the children's toy vehicle.", "", "Working principles are as follows. A guardian presses the button614towards one side of the front wheel component2when it is required to change the children's toy vehicle from a normal and steady travelling state to a travelling state of a vehicle head reciprocating upwards and downwards. The positioning shaft62presses the spring611to cause the positioning shaft62to slide in the matching groove610of the limit block69, and to cause the flat groove613of the positioning shaft62to be flush with the limit block69. The seat shell4is pressed downwards to cause the movable piece61to move downwards, the position of the positioning shaft62is unchanged to cause the movable piece61to move downwards. The positioning shaft62is clamped into the matching groove610eccentric to the front wheel component2, and the button614is released, the spring611generates a thrust force on the positioning shaft62to cause the positioning shaft62to drive the button614to reset, and to cause the mismatch occurring between the flat groove613of the positioning shaft62and the limit block69, thereby realizing the eccentric mounting of the front wheel component2. The vehicle head part of the children's toy vehicle jounces upwards and downwards when the children's toy vehicle moves due to the eccentric mounting of the front wheel component2, increasing the interestingness of the children's toy vehicle.", "", "The above is only the preferred example of the present disclosure, but the protection scope of the present disclosure is not limited to this. Within the technical scope disclosed by the present disclosure, any equivalent substitution or change made by a person familiar with the technical field according to the technical solution and the inventive concept of the present disclosure shall be covered by the protection scope of the present disclosure."], "claims": ["the eccentric adjustment mechanism comprises an eccentric box (", "2 . The eccentric jounce travelling mechanism for a children's toy vehicle according to claim 1 , wherein the eccentric box ( 6 ) is formed by splicing a rear mounting cover ( 63 ) and a front mounting cover ( 64 ), the front wheel component ( 2 ) is formed by slidably clamping a left cover of front wheel ( 65 ) and a right cover of front wheel ( 66 ), and the rear mounting cover ( 63 ) and the front mounting cover ( 64 ) are fixedly connected via bolts after being spliced.", "3 . The eccentric jounce travelling mechanism for a children's toy vehicle according to claim 2 , wherein coaxial straight notches ( 67 ) are disposed on surfaces of one side of the rear mounting cover ( 63 ) and the front mounting cover ( 64 ), and two convex rings ( 68 ) slidably connected to inner walls of the two straight notches ( 67 ) are fixedly connected to surfaces of two ends of the movable piece ( 61 ).", "4 . The eccentric jounce travelling mechanism for a children's toy vehicle according to claim 3 , wherein the front end of the vehicle frame ( 1 ) is sequentially sleeved with the convex rings ( 68 ) and the movable piece ( 61 ) via a pin shaft to mount the front wheel component ( 2 ), limit blocks ( 69 ) are fixedly connected to a surface of one side of the movable piece ( 61 ), and two matching grooves ( 610 ) movably inserted with an outer surface of the positioning shaft ( 62 ) are disposed on a surface of one side of the limit block ( 69 ), an axis of one of the matching grooves ( 610 ) and an axis of the front wheel component ( 2 ) being on the same horizontal center line.", "5 . The eccentric jounce travelling mechanism for a children's toy vehicle according to claim 2 , wherein a driving port ( 612 ) for placing a spring ( 611 ) is disposed on an inner wall of the front mounting cover ( 64 ), an outer surface of one end of the positioning shaft ( 62 ) is movably inserted with an inner wall of the driving port ( 612 ), and a flat groove ( 613 ) matching with the limit block ( 69 ) is disposed on a surface of one side of a middle part of the positioning shaft ( 62 ).", "6 . The eccentric jounce travelling mechanism for a children's toy vehicle according to claim 5 , wherein a button ( 614 ) for pressing and controlling the positioning shaft ( 62 ) to move along an axial direction towards the rear mounting cover ( 63 ) is movably sleeved on an outer surface of the other end of the positioning shaft ( 62 ), and a pressing port ( 615 ) movably sleeved on an outer surface of the button ( 614 ) is disposed on a surface of one side of the front mounting cover ( 64 ).", "7 . The eccentric jounce travelling mechanism for a children's toy vehicle according to claim 6 , wherein top walls and bottom walls of interiors of the driving port ( 612 ) and the pressing port ( 615 ) are planar to prevent the positioning shaft ( 62 ) from rotating circumferentially when the front wheel component ( 2 ) moves, and a limit ring ( 616 ) for preventing the button ( 614 ) from falling out of the pressing port ( 615 ) is fixedly connected to a peripheral side surface of one end of the button ( 614 ).", "8 . A travelling method based on an eccentric jounce travelling mechanism for a children's toy vehicle according to claim 1 , comprising the steps of: pressing, by a guardian, a button ( 614 ) towards one side of a front wheel component ( 2 ) when it is required to change a children's toy vehicle from a normal and steady travelling state to a travelling state of a vehicle head reciprocating upwards and downwards, a positioning shaft ( 62 ) pressing a spring ( 611 ) to cause the positioning shaft ( 62 ) to slide in a matching groove ( 610 ) of a limit block ( 69 ), and to cause a flat groove ( 613 ) of the positioning shaft ( 62 ) to be flush with the limit block ( 69 ); pressing a seat shell ( 4 ) downwards to cause a movable piece ( 61 ) to move downwards, the position of the positioning shaft ( 62 ) being unchanged to cause the movable piece ( 61 ) to move downwards; and clamping the positioning shaft ( 62 ) into the matching groove ( 610 ) eccentric to the front wheel component ( 2 ), and releasing the button ( 614 ), the spring ( 611 ) generating a thrust force on the positioning shaft ( 62 ) to cause the positioning shaft ( 62 ) to drive the button ( 614 ) to reset, and to cause the mismatch occurring between the flat groove ( 613 ) of the positioning shaft ( 62 ) and the limit block ( 69 ), thereby realizing the eccentric mounting of the front wheel component ( 2 ), and a vehicle head part of the children's toy vehicle jouncing upwards and downwards when the children's toy vehicle moves due to the eccentric mounting of the front wheel component ( 2 ), increasing the interestingness of the children's toy vehicle.", "9 . A travelling method based on an eccentric jounce travelling mechanism for a children's toy vehicle according to claim 2 , comprising the steps of: pressing, by a guardian, a button ( 614 ) towards one side of a front wheel component ( 2 ) when it is required to change a children's toy vehicle from a normal and steady travelling state to a travelling state of a vehicle head reciprocating upwards and downwards, a positioning shaft ( 62 ) pressing a spring ( 611 ) to cause the positioning shaft ( 62 ) to slide in a matching groove ( 610 ) of a limit block ( 69 ), and to cause a flat groove ( 613 ) of the positioning shaft ( 62 ) to be flush with the limit block ( 69 ); pressing a seat shell ( 4 ) downwards to cause a movable piece ( 61 ) to move downwards, the position of the positioning shaft ( 62 ) being unchanged to cause the movable piece ( 61 ) to move downwards; and clamping the positioning shaft ( 62 ) into the matching groove ( 610 ) eccentric to the front wheel component ( 2 ), and releasing the button ( 614 ), the spring ( 611 ) generating a thrust force on the positioning shaft ( 62 ) to cause the positioning shaft ( 62 ) to drive the button ( 614 ) to reset, and to cause the mismatch occurring between the flat groove ( 613 ) of the positioning shaft ( 62 ) and the limit block ( 69 ), thereby realizing the eccentric mounting of the front wheel component ( 2 ), and a vehicle head part of the children's toy vehicle jouncing upwards and downwards when the children's toy vehicle moves due to the eccentric mounting of the front wheel component ( 2 ), increasing the interestingness of the children's toy vehicle."], "bibtex": "@patent{20240174022,\n    title = {ECCENTRIC JOUNCE TRAVELLING MECHANISM FOR CHILDREN'S TOY VEHICLE AND TRAVELLING METHOD},\n    number = {20240174022},\n    year = {2024},\n    note = {File: US20240174022A1-20240530.XML}\n    }", "classification": "B60B1900FI"}, {"title": "Bicycle Rim Structure", "doc_number": "20240174023", "filename": "US20240174023A1-20240530.XML", "abstract": "A bicycle rim structure includes a rim. The rim has two side portions, an inner annular portion, and an outer annular portion. The two side portions, the inner annular portion and the outer annular portion surround a hollow area. The inner annular portion has a thickness greater than that of the side portions to form an inner raised portion extending toward the hollow ara. An arc-shaped abutting groove is formed on the inner raised portion. The arc-shaped abutting groove is formed with a plurality of equally spaced spoke holes each configured to receive a spoke nipple. The spoke nipple has a head portion and a neck portion. One end of a spoke is connected to the neck portion. A surface of the curved abutting groove supports two sides of the head portion.", "detailed_description": ["Embodiments of the present invention will now be described, by way of example only, with reference to the accompanying drawings.", "", "As shown inFIG.1throughFIG.4, the present invention discloses a bicycle rim structure, comprising a rim20. The rim20is integrally made, and has two side portions21, an inner annular portion22, and an outer annular portion23. The left and right sides of the inner annular portion22are integrally connected to the bottom edges of the two side portions21, respectively. The left and right sides of the outer annular portion23are integrally connected to the top edges of the two side portions21, respectively. A predetermined distance is defined between the inner annular portion22and the outer annular portion23. The two side portions21, the inner annular portion22and the outer annular portion23jointly surround a hollow area24. The thickness of the inner annular portion22is greater than that of the side portions21to form an inner raised portion25extending toward the hollow area24. An arc-shaped abutting groove26is formed on the circumference of the inner raised portion25. The inner raised portion25enables the arc-shaped abutting groove26to be recessed. The arc-shaped abutting groove26is formed with a plurality of equally spaced spoke holes27. Each of the spoke holes27is arranged at a set angle as required, and configured to receive a spoke nipple30. The spoke nipple30has a head portion31and a neck portion32. One end of a spoke33is connected to the neck portion32. The cross section of the arc-shaped abutting groove26has a curved segment S. The curved segment S has a center O. The spoke hole27has a central axis N. The center O serves as a reference point for the central axis N to radially pass through the inner annular portion22in a fan shape. When the central axis N at a right angle is set as 0 degrees, the length of the curved segment S is greater than the range of every adjacent two of the spoke holes27at an angle of 45° relative to the left and right sides of the central axis N, so that the surface of the curved abutting groove26can support both sides of the head portion31of the spoke nipple30. The thickness of the inner annular portion22, in a position where the central axis N perpendicularly passes through the inner annular portion22, is between 2.0 mm and 2.5 mm. With the above structure, the concave surface of the arc-shaped abutting groove26can support the head portion31of the spoke nipple30in a wide range, so that the spoke nipple30with a larger installation angle can be evenly supported and stressed, thereby avoiding damage.", "", "The assembly, function and effect of the above-mentioned embodiment are described in detail below. Referring toFIGS.4to7, the rim20of the present invention is preferably made of metal by extrusion. Except the spoke holes27, each section of the rim20shows a consistent thickness. The center O of the curved arc segment S serves as a reference point for the spoke hole27to pass through the surface of the arc-shaped abutting groove26at a set angle, that is, the central axis N is the normal of the curved segment S. In other words, both sides of the spoke hole27are symmetrical relative to the central axis N. Therefore, when the spoke nipple30is installed in the spoke hole27, the bottom edge of the head portion31is in contact with both sides of the edge of the spoke hole27. In this way, the spoke head30bears the tension of the spoke33. The arc-shaped abutting groove26enables both sides of the spoke head30to be supported and stressed evenly, so that the spoke nipple30and the spoke33can be stabilized to avoid the concentrated stress (shear force) at the junction of the spoke nipple30and the spoke33, so as to prevent the spoke nipple30and the spoke33from being damaged or to prevent the spoke33from breaking. Furthermore, the head portion31of the spoke nipple30can be stressed stably and evenly. Thus, the tensile strength that the spoke nipple30and the spoke33can bear is greater, and the rigidity effect is better. Because the spoke hole27can be arranged at any angle in the arc-shaped abutting groove26, both sides of the head portion31of the spoke nipple30can be supported and stressed evenly. The curved segment S of the arc-shaped abutting groove26is designed for drilling a hole angled at an angle of 45° (90° relative to the left and right sides of the central axis N. Therefore, it can meet the requirements for the spokes to be mounted between the rim and the wheel drum of the electric bicycle, so that the rim provided by the present invention can be used widely. Besides, the thickness of the inner annular portion22, in a position where the central axis N perpendicularly passes through the inner annular portion22, is between 2.0 mm and 2.5 mm. This ensures that the rim20remains rigid and its weight is under control.", "", "According to the above-mentioned creative idea, the present invention may implement and present the aspect as shown inFIG.8. An outer raised portion28protrudes from one side of the inner annular portion22away from the hollow area24. The outer raised portion28enables the rim20to be in a different shape, and enables the arc-shaped abutting groove26to be recessed inwardly. The radian of the arc-shaped abutting groove26may be larger, and the length of the curved segment S may be longer. Thus, the spoke nipple30with a larger inclination angle can be supported, so that the spoke nipple30with a large inclination angle can be supported evenly to avoid damage.", "", "Although particular embodiments of the present invention have been described in detail for purposes of illustration, various modifications and enhancements may be made without departing from the spirit and scope of the present invention. Accordingly, the present invention is not to be limited except as by the appended claims."], "claims": ["1 . A bicycle rim structure, comprising a rim, the rim having two side portions, an inner annular portion and an outer annular portion; left and right sides of the inner annular portion being connected to bottom edges of the two side portions respectively, left and right sides of the outer annular portion being connected to top edges of the two side portions respectively, a predetermined distance being defined between the inner annular portion and the outer annular portion, the two side portions, the inner annular portion and the outer annular portion surrounding a hollow area; the inner annular portion having a thickness greater than that of the side portions to form an inner raised portion extending toward the hollow area, an arc-shaped abutting groove being formed on the inner raised portion, the arc-shaped abutting groove being formed with a plurality of equally spaced spoke holes each configured to receive a spoke nipple, the spoke nipple having a head portion and a neck portion, one end of a spoke being connected to the neck portion; a cross-section of the arc-shaped abutting groove having a curved segment, the curved segment having a center, the spoke holes each having a central axis, the center serving as a reference point for the central axis to radially pass through the inner annular portion in a fan shape, the neck portion being assembled in a corresponding one of the spoke holes, a surface of the curved abutting groove supporting two sides of the head portion.", "2 . The bicycle rim structure as claimed in claim 1 , wherein when the central axis at a right angle is set as 0 degrees, a length of the curved segment is greater than a range of every adjacent two of the spoke holes at an angle of 45° relative to left and right sides of the central axis.", "3 . The bicycle rim structure as claimed in claim 1 , wherein the thickness of the inner annular portion, in a position where the central axis perpendicularly passes through the inner annular portion, is between 2.0 mm and 2.5 mm.", "4 . The bicycle rim structure as claimed in claim 1 , wherein an outer raised portion protrudes from one side of the inner annular portion away from the hollow area."], "bibtex": "@patent{20240174023,\n    title = {Bicycle Rim Structure},\n    number = {20240174023},\n    year = {2024},\n    note = {File: US20240174023A1-20240530.XML}\n    }", "classification": "B60B2106FI"}, {"title": "COMPOSITE COMPRISING A METAL REINFORCING ELEMENT AND AN ELASTOMER COMPOSITION CONTAINING AN ADHESION PROMOTING RESIN", "doc_number": "20240174024", "filename": "US20240174024A1-20240530.XML", "abstract": "A composite comprises at least one reinforcing element exhibiting a surface comprising an alloy of copper and zinc, the reinforcing element being embedded in an elastomeric composition based on at least a diene elastomer, a reinforcing filler, a sulfur crosslinking system and a phenol/aldehyde resin based on at least one aromatic polyphenol and on at least one dialdehyde compound comprising two aldehyde functions, in which the content of phenol/aldehyde resin is less than 10 phr.", "detailed_description": ["The invention relates to at least one of the following implementations:", "", "1. Composite comprising at least one reinforcing element exhibiting a surface comprising an alloy of copper and zinc, said reinforcing element being embedded in an elastomeric composition based on at least a diene elastomer, a reinforcing filler, a sulfur crosslinking system and a phenol/aldehyde resin based:on at least one aromatic polyphenol comprising at least one aromatic nucleus bearing at least two hydroxyl functions in the meta position with respect to each other, the two positions ortho to at least one of the hydroxyl functions being unsubstituted, andon at least one dialdehyde compound comprising two aldehyde functions, in which the content of phenol/aldehyde resin is less than 10 phr, preferably less than 6 phr.", "", "2. Composite according to the preceding implementation, in which the dialdehyde compound comprises at least one aromatic nucleus, which is optionally substituted.", "", "3. Composite according to the preceding implementation, in which the two positions meta to at least one aldehyde function are unsubstituted.", "", "4. Composite according to either of the two preceding implementations, in which the dialdehyde compound is chosen from the compounds comprising an aromatic nucleus having 6 carbon atoms, preferentially chosen from 1,4-benzenedicarboxaldehyde and 1,3-benzenedicarboxaldehyde.", "", "5. Composite according to any one of the preceding implementations, in which the crosslinking system comprises a metal oxide, a stearic acid derivative and a vulcanization accelerator, the sulfur content being between 1 and 5 phr, and the ratio by weight of metal oxide to stearic acid derivative being less than 3.", "", "6. Composite according to any one of the preceding implementations, in which the surface of the reinforcing element comprises from 55% to 75% by weight of copper.", "", "7. Composite according to any one of the preceding implementations, in which the elastomeric composition comprises at least 50 phr, preferentially at least 70 phr, preferably at least 90 phr, of at least one isoprene elastomer and very preferentially 100 phr of at least one isoprene elastomer.", "", "8. Composite according to the preceding implementation, in which the isoprene elastomer is selected from the group consisting of synthetic polyisoprenes, natural rubber, isoprene copolymers and their mixtures, preferentially selected from the group consisting of natural rubber and polyisoprenes comprising a content by weight of cis-1,4-bonds of at least 90%, more preferentially of at least 98%, with respect to the weight of isoprene elastomer, and their mixtures.", "", "9. Composite according to any one of the preceding implementations, in which the elastomeric composition comprises from 1 to 4 phr of sulfur.", "", "10. Composite according to any one of the preceding implementations, in which the sulfur/vulcanization accelerator ratio by weight is less than or equal to 5, preferably less than or equal to 4.", "", "11. Composite according to any one of the preceding implementations, in which the metal oxide of the crosslinking system is zinc oxide.", "", "12. Composite according to any one of the preceding implementations, in which the elastomeric composition does not comprise cobalt salts or comprises less than 1 phr, preferably less than 0.5 phr, thereof.", "", "13. Composite according to any one of the preceding implementations, in which the reinforcing filler of the elastomeric composition predominantly comprises carbon black.", "", "14. Composite according to any one of implementations 1 to 12, in which the reinforcing filler of the elastomeric composition predominantly comprises silica.", "", "15. Composite according to the preceding implementation, in which the elastomeric composition comprises an agent for coupling the silica, the content of coupling agent being in a range extending from 5% to 18% by weight, with respect to the amount of silica, preferentially in a range extending from 8% to 12% by weight, with respect to the amount of silica.", "", "16. Finished or semi-finished article comprising a composite according to any one of the preceding implementations.", "", "17. Pneumatic tyre comprising a composite according to any one of implementations 1 to 15."], "claims": ["1 .- 15 . (canceled)", "at least one aromatic polyphenol comprising at least one aromatic nucleus bearing at least two hydroxyl functions in a meta position with respect to each other, the two positions ortho to at least one of the hydroxyl functions being unsubstituted, and at least one dialdehyde compound comprising two aldehyde functions, in which a content of phenol/aldehyde resin is less than 10 phr.", "17 . The composite according to claim 16 , wherein the at least one dialdehyde compound comprises at least one aromatic nucleus, which is optionally substituted.", "18 . The composite according to claim 17 , wherein two positions meta to at least one aldehyde function are unsubstituted.", "19 . The composite according to claim 17 , wherein the at least one dialdehyde compound is selected from compounds comprising an aromatic nucleus having 6 carbon atoms.", "20 . The composite according to claim 16 , wherein the sulfur crosslinking system comprises a metal oxide, a stearic acid derivative and a vulcanization accelerator, a sulfur content being between 1 and 5 phr, and a ratio by weight of metal oxide to stearic acid derivative being less than 3.", "21 . The composite according to claim 16 , wherein the surface of the at least one reinforcing element comprises from 55% to 75% by weight of copper.", "22 . The composite according to claim 16 , wherein the elastomeric composition comprises at least 50 phr of at least one isoprene elastomer.", "23 . The composite according to claim 16 , wherein the elastomeric composition comprises from 1 to 4 phr of sulfur.", "24 . The composite according to claim 20 , wherein a sulfur/vulcanization accelerator ratio by weight is less than or equal to 5.", "25 . The composite according to claim 16 , wherein the elastomeric composition does not comprise cobalt salts or comprises less than 1 phr thereof.", "26 . The composite according to claim 16 , wherein the reinforcing filler of the elastomeric composition predominantly comprises carbon black.", "27 . The composite according to claim 16 , wherein the reinforcing filler of the elastomeric composition predominantly comprises silica.", "28 . The composite according to claim 27 , wherein the elastomeric composition comprises an agent for coupling the silica, a content of coupling agent being in a range extending from 5% to 18% by weight, with respect to an amount of silica.", "29 . A finished or semi-finished article comprising the composite according to claim 16 .", "30 . A pneumatic tire comprising the composite according to claim 16 ."], "bibtex": "@patent{20240174024,\n    title = {COMPOSITE COMPRISING A METAL REINFORCING ELEMENT AND AN ELASTOMER COMPOSITION CONTAINING AN ADHESION PROMOTING RESIN},\n    number = {20240174024},\n    year = {2024},\n    note = {File: US20240174024A1-20240530.XML}\n    }", "classification": "B60C900FI"}, {"title": "TIRE COMPRISING A DURABLE STIFFENING STRUCTURE", "doc_number": "20240174025", "filename": "US20240174025A1-20240530.XML", "abstract": "The tire ( 10 ) comprises a crown ( 12 ), two sidewalls ( 30 A, 30 B), two beads ( 32 A, 32 B), an inner surface ( 33 ) delimiting a toroidal cavity ( 35 ), and a stiffening structure ( 50 ) comprising a stiffening element ( 52 ) extending continuously into the toroidal cavity ( 35 ) from at least one of the sidewalls ( 30 A, 30 B) or one of the beads ( 32 A, 32 B) to the crown ( 12 ). The stiffening element ( 52 ) is anchored in or around: a radially inner reinforcing structure ( 60 A, 60 B) arranged in the sidewall ( 30 A, 30 B) and/or the bead ( 32 A, 32 B), the radially inner reinforcing structure ( 60 A, 60 B) being distinct from the circumferential reinforcing element ( 40 A, 40 B) situated on the same side of the median plane (M) of the tire ( 10 ) as the sidewall ( 30 A, 30 B) and/or the bead ( 32 A, 32 B), and a radially outer reinforcing structure ( 70 A, 70 B) arranged in the crown ( 12 ).", "detailed_description": [""], "claims": ["1 .- 14 . (canceled)", "wherein the or each stiffening element ( at least one radially inner reinforcing structure ( at least one radially outer reinforcing structure (", "16 . The tire ( 10 ) according to claim 15 , wherein the stiffening structure ( 50 ) comprises a plurality of stiffening elements ( 52 ; 52 A, 52 B; 53 ) circumferentially distributed in the toroidal cavity ( 35 ).", "a first radially inner reinforcing structure ( a second radially inner reinforcing structure ( so that the or each stiffening element (", "the first radially inner reinforcing structure ( first and second radially outer reinforcing structures ( the second radially inner reinforcing structure (", "19 . The tire ( 10 ) according to claim 18 , wherein the first and second radially outer reinforcing structures ( 70 A, 70 B; 73 ) are axially on either side of the median plane (M) of the tire ( 10 ).", "a first radially inner anchor point ( a first radially outer anchor point ( wherein the or each stiffening element ( a second radially inner anchor point ( a second radially outer anchor point ( wherein each of the first and second radially inner anchor points ( the first radially outer anchor points and radially inner anchor points ( the second radially outer anchor points and radially inner anchor points ( wherein the portion (", "21 . The tire ( 10 ) according to claim 17 , wherein the stiffening structure ( 50 ) comprises multiple stiffening elements ( 52 ; 53 ) forming a continuous stiffening element so as to describe a boustrophedonic trajectory between the first sidewall ( 30 A) and/or the first bead ( 32 A) and the second sidewall ( 30 B) and/or the second bead ( 32 B), passing through the crown ( 12 ).", "22 . The tire ( 10 ) according to claim 15 , wherein the or each stiffening element ( 52 ; 52 A, 52 B; 53 ) passes through the inner surface ( 33 ) so as to be anchored in or around the or one of the radially inner reinforcing structures ( 60 A, 60 B; 61 A, 61 B) at a radially inner anchor point ( 54 A, 54 B; 55 A, 55 B) arranged radially at a radial distance (B 1 , B 2 ) ranging from 0.10×H to 0.50×H from a radially innermost point of the tire ( 10 ), H being a section height of the tire ( 10 ).", "23 . The tire ( 10 ) according to claim 15 , wherein the or each stiffening element ( 52 ; 52 A, 52 B; 53 ) passes through the inner surface ( 33 ) so as to be anchored in or around the or one of the radially outer reinforcing structures ( 70 A, 70 B; 73 ) at a radially outer anchor point ( 56 A, 56 B; 57 A, 57 B) arranged axially at an axial distance (D 1 , D 2 ) at most equal to 0.45×SW from the median plane (M) of the tire ( 10 ), SW being a nominal section width of the tire ( 10 ).", "24 . The tire ( 10 ) according to claim 15 , wherein the or each stiffening element ( 52 ; 52 A, 52 B; 53 ) is a filamentary stiffening element.", "25 . The tire ( 10 ) according to claim 15 , wherein the or each radially inner reinforcing structure ( 60 A, 60 B; 61 A, 61 B) and/or the or each radially outer reinforcing structure ( 70 A, 70 B; 73 ) comprises at least one filamentary reinforcing element ( 62 A, 62 B, 72 A, 72 B; 63 A, 63 B) extending along a main direction forming an angle less than or equal to 10° with a circumferential direction (X) of the tire ( 10 ).", "wherein the filamentary reinforcing element (", "wherein the filamentary reinforcing element (", "28 . The tire ( 10 ) according to claim 25 , wherein the or each stiffening element ( 52 ; 52 A, 52 B; 53 ) is wound at least partially around the or each filamentary reinforcing element ( 62 A, 62 B, 72 A, 72 B; 63 A, 63 B)."], "bibtex": "@patent{20240174025,\n    title = {TIRE COMPRISING A DURABLE STIFFENING STRUCTURE},\n    number = {20240174025},\n    year = {2024},\n    note = {File: US20240174025A1-20240530.XML}\n    }", "classification": "B60C908FI"}, {"title": "TWO-PIECE TIRES WITH REPLACEABLE TREAD BELTS AND RELATED METHODS", "doc_number": "20240174026", "filename": "US20240174026A1-20240530.XML", "abstract": "A two-piece tire of the present disclosure may include a tread belt and a body capable of being connected by a plurality of locking mechanisms. The locking mechanisms may include a protrusion capable of extending into a lockable cavity via an opening defined by a lip that protrudes into the lockable cavity. For an individual locking mechanism, the protrusion may be integral with the tread belt or the body, and the lockable cavity integral to the other.", "detailed_description": [""], "claims": ["a tread belt and a body connected by a plurality of locking mechanisms, the tread belt comprising a tread at an outer surface of the tread belt, and the body comprising a rubber cap located at an outermost portion of the body along a radial direction of the two-piece tire; wherein each of the plurality of locking mechanisms comprises a protrusion that extends into a lockable cavity via an opening, each lockable cavity being at least partially defined by a lip that protrudes into the lockable cavity; wherein the lip defines the opening of the lockable cavity; wherein, for at least one of the plurality of locking mechanisms, either (i) the protrusion is integral to an inner surface of the tread belt and the lockable cavity is integral to an outer surface of the rubber cap or (ii) the protrusion is integral to the outer surface of the rubber cap and the lockable cavity is integral to the inner surface of the tread belt; and wherein the inner surface of the tread and the outer surface of the rubber cap form a direct contact interface.", "2 . The two-piece tire of claim 1 , wherein each of the plurality of protrusions fill at least 90 percent of a volume each of the plurality of lockable cavities corresponding thereto.", "3 . The two-piece tire of claim 1 , wherein no adhesive is present at the direct contact interface.", "4 . The two-piece tire of claim 1 , wherein, for at least one of the plurality of locking mechanisms, the lockable cavity has a radial cross-sectional shape of: a minor-arc, a semi-circle, a major-arc, a trapezoid, a squared-trapezoid, or a diamond.", "5 . The two-piece tire of claim 1 , wherein, for at least one of the plurality of locking mechanisms, the protrusion has a radial cross-sectional shape, when separated from the tread belt, of: a minor-arc, a semi-circle, a major-arc, a rectangle, a rounded-rectangle, or a trapezoid.", "6 . The two-piece tire of claim 1 , wherein the tread belt has a maximum thickness of about 1 inch to about 3 inches.", "7 . The two-piece tire of claim 1 , wherein a maximum diameter of the protrusion is 0.5 cm to 3 cm.", "8 . The two-piece tire of claim 1 , wherein a diameter of an opening of the lockable cavity is 0.5 cm to 2 cm.", "9 . The two-piece tire of claim 1 , wherein a maximum diameter of the lockable cavity is 0.6 cm to 3 cm.", "10 . The two-piece tire of claim 1 , wherein a maximum depth of the lockable cavity is 0.5 cm to 3 cm.", "11 . The two-piece tire of claim 1 , wherein the body further comprises: a supporting carcass positioned inward along the radial direction from the rubber cap and abutting the rubber cap, two sidewalls that extend inward along the radial direction from axial outer edges of the rubber cap, and a rubber innerliner positioned inward along the radial direction from the supporting carcass and inward along an axial direction of the two-piece tire from the two sidewalls.", "12 . The two-piece tire of claim 1 , wherein the body further comprises a supporting carcass positioned inward along the radial direction from the rubber cap and abutting the rubber cap, two sidewalls that extend inward along the radial direction from axial outer edges of the rubber cap, and a barrier layer positioned inward along the radial direction from the supporting carcass and inward along an axial direction along an axial direction of the two-piece tire from the two sidewalls.", "a rubber cap located in an outermost portion of the body along a radial direction of the two-piece tire, the rubber cap comprising (i) a plurality of protrusions at an outer surface of the rubber cap and integral to the rubber cap, (ii) a plurality of lockable cavities at the outer surface of the rubber cap and integral to the rubber cap, or (iii) a combination of (i) and (ii), wherein each lockable cavity is at least partially defined by a lip that protrudes into the lockable cavity, and wherein the lip defines an opening of the lockable cavity; a supporting carcass positioned inward from the rubber cap along the radial direction; and two sidewalls that extend inward along the radial direction from axial outer edges of the rubber cap.", "14 . The body of claim 13 , wherein at least one of the plurality of protrusions have a radial cross-sectional shape, when separated from the tread belt, of: a minor-arc, a semi-circle, a major-arc, a rectangle, a rounded-rectangle, or a trapezoid.", "15 . The body of claim 13 , wherein at least one of the plurality of lockable cavities have a radial cross-sectional shape of: a minor-arc, a semi-circle, a major-arc, a trapezoid, a squared-trapezoid, or a diamond.", "16 . The body of claim 13 further comprising a rubber innerliner positioned inward along the radial direction from the supporting carcass and inward along an axial direction of the two-piece tire from the two sidewalls.", "17 . The body of claim 13 further comprising a barrier layer positioned inward along the radial direction from the supporting carcass and positioned inward along an axial direction of the two-piece tire from the two sidewalls.", "an outer surface and an inner surface as opposing surfaces of the tread belt; a tread at the outer surface of the tread belt; and (i) a plurality of protrusions at the inner surface of the tread belt and integral to the tread belt, (ii) a plurality of lockable cavities at the inner surface of the tread belt and integral to the tread belt, or (iii) a combination of (i) and (ii), wherein each lockable cavity is at least partially defined by a lip that protrudes into the lockable cavity, and wherein the lip defines an opening of the lockable cavity.", "19 . The tread belt of claim 18 , wherein at least one of the plurality of protrusions have a radial cross-sectional shape, when separated from the tread belt, of: a minor-arc, a semi-circle, a major-arc, a rectangle, a rounded-rectangle, or a trapezoid.", "20 . The tread belt of claim 18 , wherein at least one of the plurality of lockable cavities have a radial cross-sectional shape of: a minor-arc, a semi-circle, a major-arc, a trapezoid, a squared-trapezoid, or a diamond."], "bibtex": "@patent{20240174026,\n    title = {TWO-PIECE TIRES WITH REPLACEABLE TREAD BELTS AND RELATED METHODS},\n    number = {20240174026},\n    year = {2024},\n    note = {File: US20240174026A1-20240530.XML}\n    }", "classification": "B60C1102FI"}, {"title": "TIRE", "doc_number": "20240174027", "filename": "US20240174027A1-20240530.XML", "abstract": "A tire includes first blocks with zigzag first sipes. Each first sipe includes a tie-bar locally raising radially outwardly from the sipe bottom to divide the first sipe into first and second portions. The sipe bottoms of the first and second portions extend in a zigzag shape in a cross-section parallel to the ground contact surface. The sipe bottom of the first portion communicates with a first widening portion having a circular cross-sectional shape with a groove width greater than a width of the first portion and extending in a zigzag shape along the first portion. The sipe bottom of the second portion communicates with a second widening portion having a circular cross-sectional shape with a groove width greater than a width of the second portion and extending in a zigzag shape along the second portion. The first and second widening portions do not communicate with each other.", "detailed_description": ["One or more embodiments of the present disclosure will be described below with reference to the drawings.", "", "FIG.1is a development view of a tread portion2of a tire1according to an embodiment. As illustrated inFIG.1, the tire1according to the present disclosure is designed for use in winter. The tire1according to the present embodiment is used, for example, as a pneumatic tire for passenger cars. However, the present invention is not limited to such an aspect, and may be applied, for example, to heavy-duty tires.", "", "The tread portion2includes a pair of tread edges Te, a plurality of circumferential grooves3continuously extending in the tire circumferential direction between the tread edges Te, and a plurality of land portions4divided by the plurality of circumferential grooves3.", "", "The tread edges Te are the axial outermost edges of the ground contacting patch of the tire1which occur under the condition such that the tire1under a normal state is grounded on a plane with 70% of a standard tire load at zero camber angles.", "", "As used herein, when a tire is a pneumatic tire based on a standard, the “normal state” is such that the tire1is mounted onto a standard wheel rim with a standard pressure but loaded with no tire load. If a tire is not based on the standards, or if a tire is a non-pneumatic tire, the normal state is a standard state of use according to the purpose of use of the tire and means a state of no load. As used herein, unless otherwise noted, dimensions of portions of the tire are values measured under the normal state. Furthermore, unless otherwise noted, any of the known methods can be applied to the measurement of the aforementioned dimensions.", "", "As used herein, the “standard wheel rim” is a wheel rim officially approved for each tire by the standard organization on which the tire is based. For example, the standard wheel rim is the “standard rim” specified in JATMA, the “Design Rim” in TRA, and the “Measuring Rim” in ETRTO.", "", "As used herein, the “standard pressure” is a standard pressure officially approved for each tire by the standard organization on which the tire is based. For example, the standard pressure is the “maximum air pressure” in JATMA, the maximum pressure given in the “Tire Load Limits at Various Cold Inflation Pressures” table in TRA, and the “Inflation Pressure” in ETRTO.", "", "As used herein, when a tire is a pneumatic tire based on a standard, the “standard tire load” is a tire load officially approved for each tire by the standard organization on which the tire is based. For example, the standard tire load is the “maximum load capacity” in JATMA, the maximum value given in the above-mentioned table in TRA, and the “Load Capacity” in ETRTO. If a tire is not based on the standards, the “standard tire load” refers to the maximum load that can be applied to the tire in accordance with the above-mentioned standards.", "", "In the present embodiment, the tread portion2is provided with four circumferential grooves3. These circumferential grooves3include two crown circumferential grooves5and two shoulder circumferential grooves6. The crown circumferential grooves5are arranged such that the tire equator C is located therebetween. The shoulder circumferential grooves6are arranged such that the crown circumferential grooves5are located therebetween. However, the present disclosure is not limited to such an aspect.", "", "The circumferential grooves3may extend linearly or in a zigzag shape in the tire circumferential direction.", "", "FIG.2illustrates a cross-sectional view of the tread portion2.FIG.2shows a conceptual cross-section of the tread portion2, and the cross sections of the sipes and lateral grooves observed in the plan view of the tread portion2are omitted inFIG.2. As illustrated inFIG.2, a groove width of the circumferential grooves3is preferably equal to or more than 3 mm. The maximum groove width W1of the circumferential grooves3is, for example, in a range from 2.0% to 5.0% of the tread width TW (shown inFIG.1). Further, the maximum groove depth dl of the circumferential grooves3is, for example, in a range from 5 to 15 mm. Note that the tread width TW corresponds to the distance in the tire axial direction from one of the tread edges Te to the other tread edge Te in the normal state described above.", "", "As illustrated inFIG.1, in the present embodiment, the tread portion2is divided into five land portions4by the circumferential grooves3. These land portions4include a crown land portion7, two middle land portions8, and two shoulder land portions9. The crown land portion7is defined between the crown circumferential grooves5. In each side of the tire equator C, the middle land portion8is defined between the crown circumferential groove5and the shoulder circumferential groove6. In each side of the tire equator C, the shoulder land portion9is located outwardly in the tire axial direction of the shoulder circumferential groove6and include the respective tread edge Te.", "", "In the present disclosure, the tread portion2is further provided with a plurality of lateral grooves10. Thus, the land portions4are formed into block rows each including a plurality of blocks11divided by the lateral grooves10. Further, the tread portion2includes a plurality of first blocks13. In the present embodiment, the plurality of first blocks13is included in the pair of shoulder land portions9. Accordingly, each block rows of the plurality of first block13constitutes the respective tread edges Te.", "", "FIG.3illustrates an enlarged plan view of two first blocks13. The first blocks13shown inFIG.3are those included in the left side shoulder land portion9shown inFIG.1. As illustrated inFIG.3, each first block13is provided with at least one the first sipe15. As a preferred embodiment, each first block13according to the present embodiment is provided with a plurality of first sipes15.", "", "As used herein, “sipe” refers to an incision with a narrow width, where the width between the two inner walls facing each other is equal to or less than 1.5 mm. The opening of a sipe may be provided with a chamfer. In addition, as described below, a widened portion is connected to the bottom of each first sipe15.", "", "FIG.4is an enlarged perspective view conceptually showing the space defined by one of the first sipes15. InFIG.4, the above space is thinly dotted.FIG.5is a cross-sectional view perpendicular to the sipe length direction.FIG.5is a cross-sectional view including a first widening portion21, which is described later, and corresponds to the A-A cross section ofFIG.3.FIG.6is a cross-sectional view of one first sipe inFIG.3parallel to the ground contact surface of one of the first blocks13. As illustrated inFIGS.4to6, each first sipe15according to the present disclosure extends in a zigzag shape in both of a cross-section perpendicular to the sipe length direction and a cross-section parallel to the ground contact surface of the respective first block13.", "", "FIG.7illustrates a cross-sectional view along the sipe length direction of one of the first sipes15.FIG.7corresponds to the B-B cross section ofFIG.3. Note that inFIG.7, the ridgelines20that demarcate the unevenness of the sipe wall are shown conceptually as two dotted lines. As illustrated inFIG.7, each first sipe15is divided into, at least, a first portion16and a second portion17in the sipe length direction by at least one tie-bar18. The tie-bar18locally raises outwardly in the tire radial direction from the sipe bottom and terminates without reaching the ground contact surface13sof the first block13. Note that in the area between the tie-bar18and the ground contact surface13sof the first block13, an imaginary line (not shown) that extends the center line in the width direction of the tie-bar18to the outside in the tire radial direction is the boundary between the first portion16and the second portion17.", "", "As illustrated inFIG.4, the sipe bottoms16dand17dof the first portion16and the second portion17, respectively, extend in a zigzag shape in a cross section parallel to the ground contact surface13s(shown inFIG.5) of the first block13. In addition, as illustrated inFIG.4andFIG.5, the sipe bottom16dof the first portion16communicates with a first widening portion21having a circular shape in a cross-section. Further, the first widening portion21has a groove width greater than a width of the first portion16. Furthermore, as illustrated inFIG.4andFIG.5, the first widening portion21extends in a zigzag shape along the sipe bottom16dof the first portion16.", "", "Similarly, as illustrated inFIG.4, the sipe bottom17dof the second portion17communicates with a second widening portion22having a circular shape in a cross-section. The second widening portion22has a groove width greater than a width of the second portion17. In addition, as illustrated inFIG.4andFIG.5, the second widening portion22extends in a zigzag shape along the sipe bottom17dof the second portion17. Furthermore, the first widening portion21does not communicate with the second widening portion22. The tire1according to the present disclosure employs the configuration described above, and this makes it possible to improve the on-ice performance, the load durability and the noise performance. The reasons are as follows.", "", "Each first sipe15of the tire1according to the present disclosure extends in a zigzag shape as described above. In addition, each first sipe15is divided into the first portion16and the second portion17by the tie-bar18. In such a first sipe15, when the ground load is applied to the first block13, the sipe walls of each first sipe15facing each other are tightly engaged to maintain the rigidity of the first block13. Furthermore, each tie-bar18also helps maintain the rigidity of the first block13. As a result, the deformation of the first block13can be effectively suppressed, and the strain at the bottom of each first sipe15can be suppressed, improving the load durability.", "", "In addition, as illustrated inFIG.4, each first sipe15according to the present disclosure communicates with the first widening portion21and the second widening portion22each having a circular cross section, and the first widening portion21and the second widening portion22do not communicate with each other. Thus, even if the first blocks13deform, the strain can be dispersed at the sipe bottom of each first sipe15, and the damage thereto can be suppressed.", "", "Further, due to the above-mentioned mechanism, the deformation of each first block13can be suppressed, ensuring a large contact area when driving on ice, and the edge effect of the first sipes15can provide a large frictional force. Furthermore, since each first sipe15includes the first widening portion21and the second widening portion22, each first sipe15exhibits excellent water absorption performance and can further enhance the on-ice performance.", "", "Moreover, since the first widening portion21and the second widening portion22extend in a zigzag shape in the present disclosure, air movement within these widening portions can be inhibited, and thus the noise associated with the opening and closing of the sipe can be reduced. For the reasons described above, the tire1according to the present disclosure can improve the on-ice performance, load durability and noise performance.", "", "Hereinafter, a more detailed configuration of the present embodiment will be described. Note that each configuration described below shows a specific aspect of the present embodiment. Thus, the present disclosure can exert the above-mentioned effects even if the tire does not include the configuration described below. Further, if any one of the configurations described below is applied independently to the tire of the present disclosure having the above-mentioned characteristics, the performance improvement according to each additional configuration can be expected. Furthermore, when some of the configurations described below are applied in combination, it is expected that the performance of the additional configurations will be improved.", "", "As illustrated inFIG.1, the tread portion2is divided into five regions in the tire axial direction including two outer regions2A on the respective tread edge Te side, and three inner regions2B therebetween. It is preferable that the first blocks13are included in the outer regions2A. In the present embodiment, the first blocks13are included in the shoulder land portions9, and the plurality of first blocks13constitute the respective tread edges Te. As a result, since each first sipe15is arranged in the shoulder land portions9where ground contact pressure tends to increase, the load durability can reliably be improved.", "", "As illustrated inFIG.3, it is preferable that each first block13is provided with a plurality of first sipes15. In the present embodiment, each first block13is provided with four first sipes15, and each first sipe15traverses the first blocks13in the tire axial direction. In addition, each first block13is not provided with any sipes or grooves other than the first sipes15. However, the present disclosure is not limited to such an aspect. For example, one or some first blocks13may be provided with a circumferential narrow groove extending in the tire circumferential direction. Note that although each figure herein describes the configuration of a single first sipe15, these configurations can be expanded to each of the first sipes15described above.", "", "A distance ta between two adjacent first sipes15in the tire circumferential direction (corresponding to the circumferential distance between the sipe centerlines) is, for example, in a range from 3.0 to 7.0 mm, preferably 4.0 to 6.0 mm. This allows for excellent on-ice performance w % bile suppressing the uneven wear of the first blocks13.", "", "As illustrated inFIG.5, each first sipe15, in a cross-sectional view perpendicular to the sipe length direction, extends in the tire radial direction with a constant width W2. In addition, as illustrated inFIG.6, each first sipe15extends in the sipe length direction while maintaining the constant width W2. That is, each first sipe15according to the present embodiment extends with a constant width W2over the entire length and depth thereof. The width W2, for example is preferably equal to or less than 1.0 mm, more preferably in a range from 0.2 to 0.7 mm. Thus, both the load durability and the on-ice performance can be improved in a well-balanced manner. However, the present disclosure is not limited to such an aspect, and the inevitable errors in rubber products such as tires can be tolerated. Therefore, the width of each first sipe15may vary depending on its measurement position. In this case, the ratio W2M/W2mbetween the maximum value W2M and the minimum value W2m(not shown) of the widths of each first sipe15is preferably equal to or less than 2.0. The maximum value of W2M is preferably in a range from 0.4 to 0.7 mm. The minimum value of W2mis preferably in a range from 0.2 to 0.4 mm.", "", "As illustrated inFIG.7, in each first block13, a maximum depth d3from the ground contact surface13sof the first block13to a bottom of the first widening portion21is in a range from 4.0 to 9.0 mm. Similarly, in each first block13, a maximum depth d4from the ground contact surface13sof the first block13to a bottom of the second widening portion22is in a range from 4.0 to 9.0 mm. This structure can improve both the load durability and the on-ice performance in a well-balanced manner. As a preferred aspect, in this embodiment, the depth d3and d4are the same.", "", "Each tie-bar18is located, for example, in the central region of the respective first sipe15when the first sipe15is divided into three equal parts in the sipe length direction. In some more preferred aspects, each tie-bar18in this embodiment is preferably arranged to include the central position of the respective first sipe15in the sipe length direction. This can prevent local deformation of the respective first sipe15and can provide excellent load durability.", "", "In the present embodiment, each tie-bar18extends in the tire radial direction with a constant width, for example. The outermost end18ain the tire radial direction of each tie-bar18has an arcuate outer surface convex toward the ground contact surface13s. The maximum width W5of each tie-bar18in the section along the sipe length direction of the first sipe15is, for example, in a range from 0.5 to 5.0 mm.", "", "In at least one of the first sipes15, a height h1from a bottom of the first widening portion21to the outermost end of the tie-bar18in the tire radial direction is preferably equal to or more than 30% of the maximum depth d3from the ground contact surface13sof the first block13to the bottom of the first widening portion21, more preferably equal to or more than 40%, but preferably equal to or less than 80%, more preferably equal to or less than 70%. The tie-bar18like this can help to balance the load durability and the on-ice performance.", "", "As illustrated inFIG.4, the first widening portion21extends in a zigzag shape in the sipe length direction of the first sipe15while maintaining a circular cross-sectional shape. Further the first widening portion21extends in the zigzag shape over the entire length. As a result, each first widening portion21has a cylindrical shape extending in the zigzag shape, except for the portion that is connected to the first sipe15. In addition, the set of circular centers in the cross section of the first widening portion21becomes the central axis of the first widening portion21, and this central axis extends in the zigzag shape. The same applies to the second widening portion22.", "", "As illustrated inFIG.6, the first widening portion21includes zigzag corners28in a cross-section parallel to the ground contact surface13sof the first block13. Each zigzag corner28has an obtuse angle. However, the present disclosure is not limited to such an aspect, but the zigzag shapes of the first widening portion21and the second widening portion22may include arc-shaped zigzag corners. Such first widening portion21and second widening portion22make it difficult for the zigzag corner to become a starting point for cracks and further improve the load durability.", "", "In the present embodiment, the first widening portion21and the second widening portion22have substantially the same configuration. For this reason, the zigzag pitch of the first widening portion21is equal to the zigzag pitch of the second widening portion22. However, when the zigzag pitch of the first portion16is different from that of the second portion17, the zigzag pitch of the first widening portion21may be different from the zigzag pitch of the second widening portion22. In this way, the water absorption and the degree of engagement of the two sipe walls can be different in the first portion16and the second portion17, allowing a fine-tuning of the balance between the on-ice performance and the load endurance.", "", "As illustrated inFIG.5, in a cross-section perpendicular to the sipe length direction of each first sipe15, a diameter L1of the first widening portion21is preferably equal to or more than 2.0 times a width of the first sipe15, more preferably equal to or more than 3.0 times, but preferably equal to or less than 6.0 times, more preferably equal to or less than 5.0 times. As a result, the above-mentioned effects can be obtained while demonstrating excellent demoldability during tire production. The above-mentioned “the width of the first sipe15” means a constant width W2in this embodiment, and if the width varies depending on the measurement position, it means the maximum width.", "", "In the same point of view, in a cross-section perpendicular to the sipe length direction of each first sipe15, a diameter of the second widening portion22is preferably equal to or more than 2.0 times a width of the first sipe15, more preferably equal to or more than 3.0 times, but preferably equal to or less than 6.0 times, more preferably equal to or less than 5.0 times.", "", "As illustrated inFIG.4, in each first sipe15, it is preferable that the ratio V1/V2between the volume V1of the first widening portion21and the volume V2of the second widening portion22is in a range from about 0.8 to 1.2, and in this embodiment, these volumes are substantially the same.", "", "In another embodiment, in at least one of the first sipes15, the first widening portion21may be arranged on the tread edge Te side with respect to the second widening portion22, and the volume V1of the first widening portion21may be greater than the volume V2of the second widening portion22. In this case, the volume V1is preferably in a range from 120% to 150% of the volume V2. In this embodiment, since each first widening portion21near the tread edge Te can exhibit excellent water absorption, the on-ice performance can be improved, and an improvement in wandering performance can also be expected.", "", "In yet another embodiment, in at least one of the first sipes15, the first widening portion21may be arranged on the tread edge Te side with respect to the second widening portion22, and the volume V1of the first widening portion21may be smaller than the volume V2of the second widening portion22. In this case, the volume V1is preferably in a range from 50% to 80% of the volume V2. In this embodiment, since each first widening portion21near the tread edge Te has relatively small volume, the uneven wear around the tread edge Te can be suppressed.", "", "As illustrated inFIG.2, the tread portion2of the present embodiment includes a cap rubber layer Cg and a base rubber layer Bg. The cap rubber layer Cg constitutes the ground contact surface of the tread portion2. The base rubber layer Bg is disposed inwardly in the tire radial direction of the cap rubber layer Cg. A rubber hardness of the cap rubber layer Cg is, for example, in a range from 40 to 65 degrees. The base rubber layer Bg has a rubber hardness greater than that of the cap rubber layer Cg. The rubber hardiness of the base rubber layer Bg is, for example, in a range from 50 to 75 degrees. As used herein, rubber hardness is the hardness measured by durometer type A in an environment of 23 degrees C. in accordance with JIS-K6253.", "", "In the present embodiment, a distance t2from the ground contact surface of the tread portion2to the boundary25between the cap rubber layer Cg and the base rubber layer Bg is in a range from 30% to 70% of the total thickness t1of the tread rubber. On the other hand, as illustrated inFIG.5, the minimum distance t3in the tire radial direction from the boundary25to the bottom of the first widening portions21and the second widening portions22is preferably equal to or more than 0.5 mm, more preferably in a range from 1.0 to 4.0 mm. This effectively suppresses the peeling of the rubber at the boundary25caused by the deformation of the first widening portions21and the second widening portions22.", "", "While the particularly preferred embodiments of the tire according to the present disclosure have been described in detail, the present disclosure is not limited to the above specific embodiments, but may be modified and implemented in various ways."], "claims": ["a tread portion being provided with a plurality of circumferential grooves continuously extending in a tire circumferential direction, a plurality of lateral grooves extending in a tire axial direction, and a plurality of first blocks, wherein each of the plurality of first blocks is provided with at least one first sipe, in each first block, the at least one first sipe extends in a zigzag shape in both of a cross-section perpendicular to a sipe length direction and a cross-section parallel to a ground contact surface of the first block, in each first block, the at least one first sipe comprises a sipe bottom, and a tie-bar locally raising outwardly in a tire radial direction from the sipe bottom and terminating without reaching the ground contact surface of the first block to divide the at least one first sipe into a first portion and a second portion in the sipe length direction, in each first block, the sipe bottom of the first portion and the sipe bottom of the second portion extend in a zigzag shape in a cross-section parallel to the ground contact surface of the first block, the sipe bottom of the first portion communicates with a first widening portion having a circular shape in a cross-section perpendicular to the sipe length direction, the first widening portion has a groove width greater than a width of the first portion, the first widening portion extends in a zigzag shape along the sipe bottom of the first portion, the sipe bottom of the second portion communicates with a second widening portion having a circular shape in a cross-section perpendicular to the sipe length direction, the second widening portion has a groove width greater than a width of the second portion, the second widening portion extends in a zigzag shape along the sipe bottom of the second portion, and the first widening portion does not communicate with the second widening portion.", "in each first block, the zigzag shapes of the first widening portion and the second widening portion comprise arc-shaped zigzag corners in a cross-section parallel to the ground contact surface of the first block.", "a zigzag pitch of the first widening portion is equal to a zigzag pitch of the second widening portion.", "a zigzag pitch of the first widening portion is different from a zigzag pitch of the second widening portion.", "the first widening portion extends in the zigzag shape over an entire length thereof.", "the tread portion comprises a tread edge, and the plurality of first blocks constitutes the tread edge.", "in at least one of the plurality of first blocks, a height from a bottom of the first widening portion to an outermost end of the tie-bar in the tire radial direction is in a range from 30% to 80% of a maximum depth from the ground contact surface of the first block to the bottom of the first widening portion.", "the tie-bar has a width in a range from 0.5 to 5.0 mm in a cross-section parallel to the sipe length direction.", "the tread portion comprises a cap rubber layer forming the ground contact surface, and a base rubber layer disposed inwardly in the tire radial direction of the cap rubber layer and having a hardness greater than that of the cap rubber layer, and at least a part of the first widening portion and the second widening portion is located in the base rubber layer.", "a minimum distance in the tire radial direction from a boundary between the cap rubber layer and the base rubber layer to a bottom of the first widening portion and a bottom of the second widening portion is equal to or more than 0.5 mm.", "the tread portion comprises a tread edge, the first widening portion is arranged on a tread edge side with respect to the second widening portion, and a volume of the first widening portion is greater than a volume of the second widening portion.", "the volume of the first widening portion is in a range from 120% to 150% of the volume of the second widening portion.", "the first widening portion and the second widening portion have a same length in the sipe length direction with each other.", "the tread portion comprises a tread edge, the first widening portion is arranged on a tread edge side with respect to the second widening portion, and a volume of the first widening portion is smaller than a volume of the second widening portion.", "the volume of the first widening portion is in a range from 50% to 80% of the volume of the second widening portion.", "the first widening portion and the second widening portion have a same length in the sipe length direction with each other.", "the tie-bar is arranged to include a central position of each first sipe in the sipe length direction.", "the tie-bar is arranged to include a central position of each first sipe in the sipe length direction.", "the at least one first sipe comprises a plurality of first sipes.", "the at least one first sipe comprises a plurality of first sipes."], "bibtex": "@patent{20240174027,\n    title = {TIRE},\n    number = {20240174027},\n    year = {2024},\n    note = {File: US20240174027A1-20240530.XML}\n    }", "classification": "B60C1112FI"}, {"title": "TIRE", "doc_number": "20240174028", "filename": "US20240174028A1-20240530.XML", "abstract": "A tire includes first blocks each with a zigzag first sipe. The first sipe includes a sipe bottom and a tie-bar locally raising outwardly in a tire radial direction from the sipe bottom so as not to reach the ground contact surface to divide the first sipe into first and second portions. The sipe bottom of the first portion communicates with a first widening portion which has a circular cross-section and has a groove width greater than that of the first portion. The first widening portion extends linearly over the entire length. The sipe bottom of the second portion communicates with a second widening portion which has a circular cross-section and has a groove width greater than that of the second portion. The second widening portion extends linearly over the entire length. The first widening portion does not communicate with the second widening portion.", "detailed_description": ["One or more embodiments of the present disclosure will be described below with reference to the drawings.", "", "FIG.1is a development view of a tread portion2of a tire1according to an embodiment. As illustrated inFIG.1, the tire1according to the present disclosure is designed for use in winter. The tire1according to the present embodiment is used, for example, as a pneumatic tire for passenger cars. However, the present invention is not limited to such an aspect, and may be applied, for example, to heavy-duty tires.", "", "The tread portion2includes a pair of tread edges Te, a plurality of circumferential grooves3continuously extending in the tire circumferential direction between the tread edges Te, and a plurality of land portions4divided by the plurality of circumferential grooves3.", "", "The tread edges Te are the axial outermost edges of the ground contacting patch of the tire1which occur under the condition such that the tire1under a normal state is grounded on a plane with 70% of a standard tire load at zero camber angles.", "", "As used herein, when a tire is a pneumatic tire based on a standard, the “normal state” is such that the tire1is mounted onto a standard wheel rim with a standard pressure but loaded with no tire load. If a tire is not based on the standards, or if a tire is a non-pneumatic tire, the normal state is a standard state of use according to the purpose of use of the tire and means a state of no load. As used herein, unless otherwise noted, dimensions of portions of the tire are values measured under the normal state. Furthermore, unless otherwise noted, any of the known methods can be applied to the measurement of the aforementioned dimensions.", "", "As used herein, the “standard wheel rim” is a wheel rim officially approved for each tire by the standard organization on which the tire is based. For example, the standard wheel rim is the “standard rim” specified in JATMA, the “Design Rim” in TRA, and the “Measuring Rim” in ETRTO.", "", "As used herein, the “standard pressure” is a standard pressure officially approved for each tire by the standard organization on which the tire is based. For example, the standard pressure is the “maximum air pressure” in JATMA, the maximum pressure given in the “Tire Load Limits at Various Cold Inflation Pressures” table in TRA, and the “Inflation Pressure” in ETRTO.", "", "As used herein, when a tire is a pneumatic tire based on a standard, the “standard tire load” is a tire load officially approved for each tire by the standard organization on which the tire is based. For example, the standard tire load is the “maximum load capacity” in JATMA, the maximum value given in the above-mentioned table in TRA, and the “Load Capacity” in ETRTO. If a tire is not based on the standards, the “standard tire load” refers to the maximum load that can be applied to the tire in accordance with the above-mentioned standards.", "", "In the present embodiment, the tread portion2is provided with four circumferential grooves3. These circumferential grooves3include two crown circumferential grooves5and two shoulder circumferential grooves6. The crown circumferential grooves5are arranged such that the tire equator C is located therebetween. The shoulder circumferential grooves6are arranged such that the crown circumferential grooves5are located therebetween. However, the present disclosure is not limited to such an aspect.", "", "The circumferential grooves3may extend linearly or in a zigzag shape in the tire circumferential direction.", "", "FIG.2illustrates a cross-sectional view of the tread portion2.FIG.2shows a conceptual cross-section of the tread portion2, and the cross sections of the sipes and lateral grooves observed in the plan view of the tread portion2are omitted inFIG.2. As illustrated inFIG.2, a groove width of the circumferential grooves3is preferably equal to or more than 3 mm. The maximum groove width W1 of the circumferential grooves3is, for example, in a range from 2.0% to 5.0% of the tread width TW (shown inFIG.1). Further, the maximum groove depth d1of the circumferential grooves3is, for example, in a range from 5 to 15 mm. Note that the tread width TW corresponds to the distance in the tire axial direction from one of the tread edges Te to the other tread edge Te in the normal state described above.", "", "As illustrated inFIG.1, in the present embodiment, the tread portion2is divided into five land portions4by the circumferential grooves3. These land portions4include a crown land portion7, two middle land portions8, and two shoulder land portions9. The crown land portion7is defined between the crown circumferential grooves5. In each side of the tire equator C, the middle land portion8is defined between the crown circumferential groove5and the shoulder circumferential groove6. In each side of the tire equator C, the shoulder land portion9is located outwardly in the tire axial direction of the shoulder circumferential groove6and include the respective tread edge Te.", "", "In the present disclosure, the tread portion2is further provided with a plurality of lateral grooves10. Thus, the land portions4are formed into block rows each including a plurality of blocks11divided by the lateral grooves10. Further, the tread portion2includes a plurality of first blocks13. In the present embodiment, the plurality of first blocks13is included in the pair of shoulder land portions9. Accordingly, each block rows of the plurality of first block13constitutes the respective tread edges Te.", "", "FIG.3illustrates an enlarged plan view of two first blocks13. The first blocks13shown inFIG.3are those included in the left side shoulder land portion9shown inFIG.1. As illustrated inFIG.3, each first block13is provided with at least one the first sipe15. As a preferred embodiment, each first block13according to the present embodiment is provided with a plurality of first sipes15.", "", "As used herein, “sipe” refers to an incision with a narrow width, where the width between the two inner walls facing each other is equal to or less than 1.5 mm. The opening of a sipe may be provided with a chamfer. In addition, as described below, a widened portion is connected to the bottom of each first sipe15.", "", "FIG.4is an enlarged perspective view conceptually showing the space defined by one of the first sipes15. InFIG.4, the above space is thinly dotted.FIG.5is a cross-sectional view perpendicular to the sipe length direction.FIG.5is a cross-sectional view including a first widening portion21, which is described later, and corresponds to the A-A cross section ofFIG.3.FIG.6is a cross-sectional view of one first sipe inFIG.3parallel to the ground contact surface of one of the first blocks13. As illustrated inFIGS.4to6, each first sipe15according to the present disclosure extends in a zigzag shape in both of a cross-section perpendicular to the sipe length direction and a cross-section parallel to the ground contact surface of the respective first block13.", "", "FIG.7illustrates a cross-sectional view along the sipe length direction of one of the first sipes15.FIG.7corresponds to the B-B cross section ofFIG.3. Note that inFIG.7, the ridgelines20that demarcate the unevenness of the sipe wall are shown conceptually as two dotted lines. As illustrated inFIG.7, each first sipe15is divided into, at least, a first portion16and a second portion17in the sipe length direction by at least one tie-bar18. The tie-bar18locally raises outwardly in the tire radial direction from the sipe bottom and terminates without reaching the ground contact surface13sof the first block13. Note that in the area between the tie-bar18and the ground contact surface13sof the first block13, an imaginary line (not shown) that extends the center line in the width direction of the tie-bar18to the outside in the tire radial direction is the boundary between the first portion16and the second portion17.", "", "As illustrated inFIG.4, the sipe bottom16dof the first portion16communicates with a first widening portion21having a circular shape in a cross-section. Further, as illustrated inFIG.5, the first widening portion21has a groove width greater than a width of the first portion16. Furthermore, as illustrated inFIG.4, the first widening portion21extends linearly over the entire length thereof along the sipe length direction of the first portion16.", "", "Similarly, as illustrated inFIG.4andFIG.5, the sipe bottom17dof the second portion17communicates with a second widening portion22having a circular shape in a cross-section. The second widening portion22has a groove width greater than a width of the plurality second portion17. In addition, the second widening portion22extends linearly over the entire length thereof along the sipe length direction of the second portion17. Furthermore, the first widening portion21does not communicate with the second widening portion22. Unless otherwise noted, the configuration described for the first widening portion21in the specification can be applied to the second widening portion22. The tire1according to the present disclosure employs the configuration described above, and this makes it possible to improve the on-ice performance and the load durability. The reasons are as follows.", "", "Each first sipe15of the tire1according to the present disclosure extends in a zigzag shape as described above. In addition, each first sipe15is divided into the first portion16and the second portion17by the tie-bar18. In such a first sipe15, when the ground load is applied to the first block13, the sipe walls of the first sipe15facing each other are tightly engaged to maintain the rigidity of the first block13. Furthermore, the tie-bar18also helps maintain the rigidity of the first block13. As a result, the deformation of the first block13can be effectively suppressed, and the strain at the bottom of the sipe15can be suppressed, improving the load durability.", "", "In addition, as illustrated inFIG.4, each first sipe15according to the present disclosure communicates with the first widening portion21and the second widening portion22each having a circular cross section, and the first widening portion21and the second widening portion22do not communicate with each other. Thus, even if the first blocks13deform, the strain can be dispersed at the sipe bottom of each first sipe15, and the damage thereto can be suppressed.", "", "Further, due to the above-mentioned mechanism, the deformation of the first block13can be suppressed, ensuring a large contact area when driving on ice, and the edge effect of the first sipes15can provide a large frictional force. Furthermore, since each first sipe15includes the first widening portion21and the second widening portion22, each first sipe15exhibits excellent water absorption performance and can further enhance the on-ice performance. For the reasons described above, the tire1according to the present disclosure can improve the on-ice performance and the load durability.", "", "Hereinafter, a more detailed configuration of the present embodiment will be described. Note that each configuration described below shows a specific aspect of the present embodiment. Thus, the present disclosure can exert the above-mentioned effects even if the tire does not include the configuration described below. Further, if any one of the configurations described below is applied independently to the tire of the present disclosure having the above-mentioned characteristics, the performance improvement according to each additional configuration can be expected. Furthermore, when some of the configurations described below are applied in combination, it is expected that the performance of the additional configurations will be improved.", "", "As illustrated inFIG.1, the tread portion2is divided into five regions in the tire axial direction including two outer regions2A on the respective tread edge Te side, and three inner regions2B therebetween. It is preferable that the first blocks13are included in the outer regions2A. In the present embodiment, the first blocks13are included in the shoulder land portions9, and the plurality of first blocks13constitute the respective tread edges Te. As a result, since each first sipe15is arranged in the shoulder land portions9where ground contact pressure tends to increase, the load durability can reliably be improved.", "", "As illustrated inFIG.3, it is preferable that each first block13is provided with a plurality of first sipes15. In the present embodiment, each first block13is provided with four first sipes15, and each first sipe15traverses the first blocks13in the tire axial direction. In addition, each first block13is not provided with any sipes or grooves other than the first sipes15. However, the present disclosure is not limited to such an aspect. For example, one or some first blocks13may be provided with a circumferential narrow groove extending in the tire circumferential direction. Note that although each figure herein describes the configuration of a single first sipe15, these configurations can be expanded to each of the first sipes15described above.", "", "A distance ta between two adjacent first sipes15in the tire circumferential direction (corresponding to the circumferential distance between the sipe centerlines) is, for example, in a range from 3.0 to 7.0 mm, preferably 4.0 to 6.0 mm. This allows for excellent on-ice performance while suppressing the uneven wear of the first blocks13.", "", "As illustrated inFIG.5, each first sipe15, in a cross-sectional view perpendicular to the sipe length direction, extends in the tire radial direction with a constant width W2. In addition, as illustrated inFIG.6, each first sipe15extends in the sipe length direction while maintaining the constant width W2. That is, each first sipe15according to the present embodiment extends with a constant width W2 over the entire length and depth thereof. The width W2, for example is preferably equal to or less than 1.0 mm, more preferably in a range from 0.2 to 0.7 mm. Thus, both the load durability and the on-ice performance can be improved in a well-balanced manner. However, the present disclosure is not limited to such an aspect, and the inevitable errors in rubber products such as tires can be tolerated. Therefore, the width of each first sipe15may vary depending on its measurement position. In this case, the ratio W2M/W2m between the maximum value W2M and the minimum value W2m (not shown) of the widths of each first sipe15is preferably equal to or less than 2.0. The maximum value of W2M is preferably in a range from 0.4 to 0.7 mm. The minimum value of W2m is preferably in a range from 0.2 to 0.4 mm.", "", "As illustrated inFIG.7, in each first block13, a maximum depth d3 from the ground contact surface13sto a bottom of the first widening portion21is in a range from 4.0 to 9.0 mm. Similarly, in each first block13, a maximum depth d4 from the ground contact surface13sto a bottom of the second widening portion22is in a range from 4.0 to 9.0 mm. This structure can improve both the load durability and the on-ice performance in a well-balanced manner. As a preferred aspect, in this embodiment, the depth d3 and d4 are the same.", "", "Each tie-bar18is located, for example, in the central region of the respective first sipe15when the first sipe15is divided into three equal parts in the sipe length direction. In some more preferred aspects, each tie-bar18in this embodiment is preferably arranged to include the central position of the respective first sipe15in the sipe length direction. This can prevent local deformation of the respective first sipe15and can provide excellent load durability.", "", "In the present embodiment, each tie-bar18extends in the tire radial direction with a constant width, for example. The outermost end18ain the tire radial direction of each tie-bar18has an arcuate outer surface convex toward the ground contact surface13s. The maximum width W5 of each tie-bar18in the section along the sipe length direction of the first sipe15is, for example, in a range from 0.5 to 5.0 mm.", "", "In at least one of the first sipes15, a height h1 from a bottom of the first widening portion21to the outermost end of the tie-bar18in the tire radial direction is preferably equal to or more than 30% of the maximum depth d3 from the ground contact surface13sof the first block13to the bottom of the first widening portion21, more preferably equal to or more than 40%, but preferably equal to or less than 80%, more preferably equal to or less than 70%. The tie-bar18like this can help to balance the load durability and the on-ice performance.", "", "As illustrated inFIG.4, each first widening portion21extends linearly in the sipe length direction of the first sipe15while maintaining a circular cross-sectional shape. As a result, each first widening portion21has a cylindrical shape, except for the portion that is connected to the first sipe15. In addition, the set of circular centers in the cross section of the first widening portion21becomes the central axis of the first widening portion21, and this central axis extends linearly. The same applies to the second widening portion22.", "", "As illustrated inFIG.5, in a cross-section perpendicular to the sipe length direction of each first sipe15, a diameter LI of the first widening portion21is preferably equal to or more than 2.0 times a width of the first sipe15, more preferably equal to or more than 3.0 times, but preferably equal to or less than 6.0 times, more preferably equal to or less than 5.0 times. As a result, the above-mentioned effects can be obtained while demonstrating excellent demoldability during tire production. The above-mentioned “the width of the first sipe15” means a constant width W2 in this embodiment, and if the width varies depending on the measurement position, it means the maximum width.", "", "In the same point of view, in a cross-section perpendicular to the sipe length direction of each first sipe15, a diameter of the second widening portion22is preferably equal to or more than 2.0 times a width of the first sipe15, more preferably equal to or more than 3.0 times, but preferably equal to or less than 6.0 times, more preferably equal to or less than 5.0 times.", "", "As illustrated inFIG.4, in each first sipe15, it is preferable that the ratio V1/V2 between the volume V1 of the first widening portion21and the volume V2 of the second widening portion22is in a range from about 0.8 to 1.2, and in this embodiment, these volumes are substantially the same.", "", "In another embodiment, in at least one of the first sipes15, the first widening portion21may be arranged on the tread edge Te side with respect to the second widening portion22, and the volume V1 of the first widening portion21may be greater than the volume V2 of the second widening portion22. In this case, the volume V1 is preferably in a range from 120% to 150% of the volume V2. In this embodiment, since each first widening portion21near the tread edge Te can exhibit excellent water absorption, the on-ice performance can be improved, and an improvement in wandering performance can also be expected.", "", "In yet another embodiment, in at least one of the first sipes15, the first widening portion21may be arranged on the tread edge Te side with respect to the second widening portion22, and the volume V1 of the first widening portion21may be smaller than the volume V2 of the second widening portion22. In this case, the volume V1 is preferably in a range from 50% to 80% of the volume V2. In this embodiment, since each first widening portion21near the tread edge Te has relatively small volume, the uneven wear around the tread edge Te can be suppressed.", "", "As illustrated inFIG.2, the tread portion2of the present embodiment includes a cap rubber layer Cg and a base rubber layer Bg. The cap rubber layer Cg constitutes the ground contact surface of the tread portion2. The base rubber layer Bg is disposed inwardly in the tire radial direction of the cap rubber layer Cg. A rubber hardness of the cap rubber layer Cg is, for example, in a range from 40 to 65 degrees. The base rubber layer Bg has a rubber hardness greater than that of the cap rubber layer Cg. The rubber hardiness of the base rubber layer Bg is, for example, in a range from 50 to 75 degrees. As used herein, rubber hardness is the hardness measured by durometer type A in an environment of 23 degrees C. in accordance with JIS-K6253.", "", "In the present embodiment, a distance t2 from the ground contact surface of the tread portion2to the boundary25between the cap rubber layer Cg and the base rubber layer Bg is in a range from 30% to 70% of the total thickness t1 of the tread rubber. On the other hand, as illustrated inFIG.5, the minimum distance t3 in the tire radial direction from the boundary25to the bottom of the first widening portions21and the second widening portions22is preferably equal to or more than 0.5 mm, more preferably in a range from 1.0 to 4.0 mm. This effectively suppresses the peeling of the rubber at the boundary25caused by the deformation of the first widening portions21and the second widening portions22.", "", "While the particularly preferred embodiments of the tire according to the present disclosure have been described in detail, the present disclosure is not limited to the above specific embodiments, but may be modified and implemented in various ways."], "claims": ["a tread portion being provided with a plurality of circumferential grooves continuously extending in a tire circumferential direction, a plurality of lateral grooves extending in a tire axial direction, and a plurality of first blocks, wherein each of the plurality of first blocks is provided with at least one first sipe, the at least one first sipe extends in a zigzag shape in both of a cross-section perpendicular to a sipe length direction and a cross-section parallel to a ground contact surface of the respective first block, the at least one first sipe comprises a sipe bottom, and a tie-bar locally raising outwardly in a tire radial direction from the sipe bottom and terminating without reaching the ground contact surface of the respective first block to divide the at least one first sipe into a first portion and a second portion in the sipe length direction, the sipe bottom of the first portion communicates with a first widening portion having a circular shape in a cross-section perpendicular to the sipe length direction, the first widening portion has a groove width greater than a width of the first portion, the first widening portion extends linearly over an entire length thereof along the sipe length direction of the first portion, the sipe bottom of the second portion communicates with a second widening portion having a circular shape in a cross-section perpendicular to the sipe length direction, the second widening portion has a groove width greater than a width of the second portion, the second widening portion extends linearly over its entire length along the sipe length direction of the second portion, and the first widening portion does not communicate with the second widening portion.", "the tread portion comprises a tread edge, and the plurality of first blocks constitutes the tread edge.", "in each first block, a maximum depth from the ground contact surface to a bottom of the first widening portion or the second widening portion is in a range from 4.0 to 9.0 mm.", "the at least one first sipe has a width in a range from 0.2 to 0.7 mm in a cross-section perpendicular to the sipe length direction.", "a diameter of the circular shape of the first widening portion is in a range from 2.0 to 6.0 times a width of the at least one first sipe in a cross-section perpendicular to the sipe length direction.", "a diameter of the circular shape of the second widening portion is in a range from 2.0 to 6.0 times a width of the at least one first sipe in a cross-section perpendicular to the sipe length direction.", "in at least one of the plurality of first blocks, a height from a bottom of the first widening portion to an outermost end of the tie-bar in the tire radial direction is in a range from 30% to 80% of a maximum depth from the ground contact surface of the first block to the bottom of the first widening portion.", "the tie-bar has a width in a range from 0.5 to 5.0 mm in a cross-section parallel to the sipe length direction.", "the tread portion comprises a cap rubber layer forming the ground contact surface, and a base rubber layer disposed inwardly in the tire radial direction of the cap rubber layer and having a hardness greater than that of the cap rubber layer, and at least a part of the first widening portion and the second widening portion is located in the base rubber layer.", "a minimum distance in the tire radial direction from a boundary between the cap rubber layer and the base rubber layer to a bottom of the first widening portion and a bottom of the second widening portion is equal to or more than 0.5 mm.", "the tread portion comprises a tread edge, the first widening portion is arranged on a tread edge side with respect to the second widening portion, and a volume of the first widening portion is greater than a volume of the second widening portion.", "the volume of the first widening portion is in a range from 120% to 150% of the volume of the second widening portion.", "the tread portion comprises a tread edge, the first widening portion is arranged on a tread edge side with respect to the second widening portion, and a volume of the first widening portion is smaller than a volume of the second widening portion.", "the volume of the first widening portion is in a range from 50% to 80% of the volume of the second widening portion.", "the first widening portion and the second widening portion have a same length in the sipe length direction with each other.", "the first widening portion and the second widening portion have a same length in the sipe length direction with each other.", "the tie-bar is arranged to include a central position of each first sipe in the sipe length direction.", "the tie-bar is arranged to include a central position of each first sipe in the sipe length direction.", "the at least one first sipe comprises a plurality of first sipes.", "the at least one first sipe comprises a plurality of first sipes."], "bibtex": "@patent{20240174028,\n    title = {TIRE},\n    number = {20240174028},\n    year = {2024},\n    note = {File: US20240174028A1-20240530.XML}\n    }", "classification": "B60C1112FI"}, {"title": "TIRE", "doc_number": "20240174029", "filename": "US20240174029A1-20240530.XML", "abstract": "A tire comprises a tread portion provided with a first block provided with a first sipe which extends zigzag in a cross section orthogonal to the sipe length direction, and extends zigzag in a cross section parallel to the ground contacting top surface of the first block. The first sipe is divided into a first portion and a second portion by a tie bar. The sipe bottom in the first portion communicates with a first wide portion. The sipe bottom in the second portion communicates with a second wide portion. The first wide portion comprises an outer portion and an inner portion. The outer portion is formed by a pair of first arcuate groove wall portions. The inner portion is formed by a pair of second arcuate groove wall portions. The first wide portion and the second wide portion do not communicate with each other.", "detailed_description": ["An embodiment of the present disclosure will now be described in detail in conjunction with accompanying drawings.", "", "FIG.1is a developed partial view of a tread portion2of a tire1as an embodiment of the present disclosure.", "", "The tire1of the present disclosure shown inFIG.1is intended for use in winter.", "", "In the present embodiment, the tire1is designed as a pneumatic tire for passenger cars.", "", "The present disclosure is however, not limited to such pneumatic tire, and may be applied, for example, to heavy duty tires.", "", "The tread portion2comprises a plurality of circumferential grooves3continuously extending in the tire circumferential direction between two tread edges Te, and a plurality of land portions4axially divided by these circumferential grooves3.", "", "The tread edge Te corresponds to the outermost contact position in the tire axial direction when the tire1in its normal state is contact with a flat horizontal surface at a camber angle of 0 degrees and loaded with 70% of a normal load therefor.", "", "In the case of pneumatic tires for which various standards have been established, the “normal state” is a state of a tire in which the tire is mounted on a regular rim, inflated to a normal internal pressure, and loaded with no tire load.", "", "In the case of tires or non-pneumatic tires for which various standards are not defined, the “normal state” means a standard usage state according to the purpose of use of the tire, and a state in which the tire is not mounted on the vehicle and no load is applied.", "", "In this specification, unless otherwise noted, dimensions, positions and the like of each part or portion of the tire refer to those under the normal state.", "", "In addition, in the present specification, known methods can be appropriately applied to the method for measuring the dimensions, positions and the like unless otherwise noted.", "", "The “regular rim” means a wheel rim specified for the tire by a standard system including standards on which the tire is based, for example, “Standard Rim” in JATMA, “Design Rim” in TRA and “Measuring Rim” in ETRTO.", "", "The “normal internal pressure” is the air pressure specified for the tire by a standard system including standards on which the tire is based, for example, the maximum air pressure in JATMA, the maximum value listed in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in TRA, and the “Inflation Pressure” in ETRTO.", "", "In the case of a pneumatic tire for which various standards have been established, the “normal load” is a tire load specified for the tire by a standard system including standards on which the tire is based, for extreme, the maximum load capacity in JATMA, the maximum value listed in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in TRA, and the load capacity in ETRTO.", "", "In the case of a tire for which various standards have not yet been established, the “normal load” is the maximum load which can be applied to the tire when used.", "", "The tread portion2in the present embodiment is provided with four circumferential grooves3: two crown circumferential grooves5and two shoulder circumferential grooves6.", "", "The two crown circumferential grooves5are arranged so as to sandwich the tire equator C.", "", "The two shoulder circumferential grooves6are arranged so as to sandwich the two crown circumferential grooves5.", "", "The present disclosure is however, not limited to such groove arrangement.", "", "For the circumferential grooves3, various mode, for example, straight grooves, zigzag grooves and the like may be adopted.", "", "FIG.2conceptually shows a cross section of the tread portion2, and cross sections of sipes and lateral grooves observed in a plan view of the tread portion2are omitted inFIG.2.", "", "As shown inFIG.2, the groove widths of the circumferential grooves3are preferably at least 3 mm.", "", "The maximum groove width W1 among the circumferential grooves3is, for example, 2.0% to 5.0% of the tread width TW (shown inFIG.1).", "", "The maximum depth d1among the circumferential grooves3is, for example, 5 to 15 mm.", "", "The tread width TW corresponds to the distance in the tire axial direction from one tread edge Te to the other tread edge Te under the normal state.", "", "As shown inFIG.1, by the four circumferential grooves3, the tread portion2in the present embodiment is axially divided into five land portions4: one crown land portion7, two middle land portions8, and two shoulder land portions9.", "", "The crown land portion7is defined between the two crown circumferential grooves5.", "", "Each of the middle land portion8is defined between one of the two crown circumferential groove5and one of the two shoulder circumferential groove6.", "", "Each of the shoulder land portion9is defined between one of the shoulder circumferential grooves6and the adjacent tread edge Te.", "", "The tread portion2in the present embodiment is provided with a plurality of lateral grooves10.", "", "By the lateral grooves10, each of the land portions4is circumferentially divided into a row of plurality of blocks11.", "", "The blocks11include first blocks13in the shoulder land portions9forming the tread edges Te.", "", "Each of the first blocks13is provided with at least one first sipe15.", "", "In the present embodiment, each of the first blocks13is provided with a plurality of first sipes15as shown inFIG.3which shows, for example, two of the circumferentially adjacent first blocks13in the shoulder land portion9on the left side ofFIG.1.", "", "The term “sipe” refers to means a narrow groove having a width not more than 1.5 mm between two opposite inner walls inclusive of a cut having no substantial width.", "", "Such a sipe however, may be provided with a chamfer at one of or each of the opening edges.", "", "In the present embodiment, at the bottom of the first sipe15, the first sipe15communicates with a wide portion as described later.", "", "FIG.4conceptually shows the interior space of the first sipe15, wherein the interior space is lightly dotted.", "", "FIG.5shows a cross section of the first sipe15and a cross section of a first wide portion21taken orthogonal to the sipe length direction, corresponding to a cross-sectional view taken along line AA inFIG.3.", "", "FIG.6shows a cross section of the first sipe shown inFIG.3taken along a plane parallel to the ground contacting top surface of the first block13.", "", "As shown inFIGS.4to6, the first sipe15in the present embodiment extends in a zigzag shape in a cross section orthogonal to the sipe length direction, and extends in a zigzag shape in a cross section parallel to the ground contacting top surface of the first block13.", "", "FIG.7shows a cross section of the first sipe15taken along its length direction, corresponding to a cross-sectional view taken along line BB ofFIG.3.", "", "InFIG.7, ridge and valley lines20partitioning convexes and concaves formed in the two opposite inner walls are shown by two-dot chain lines.", "", "As shown inFIG.7, the first sipe15is provided with at least one tie bar18, and thereby partially divided (near the bottom) in the length direction of the sipe into at least a first portion16and a second portion17.", "", "The tie bar18locally protrudes outward in a tire radial direction from the sipe bottom (in this example, from the bottoms of the wide portions21and22) and terminates without reaching the ground contacting top surface13sof the first block13.", "", "By an imaginary line (not shown) obtained by radially outwardly extending the center line in the sipe length direction of the tie bar18, the portion of the first sipe15between the radially outer end of the tie bar18and the ground contacting top surface13sof the first block13, is virtually divided into two portions which is explained hereunder as being included in the first portion16and the second portion, respectively.", "", "As shown inFIG.4, the first wide portion21communicates with the sipe bottom16dof the first portion16.", "", "As shown inFIG.5, the first wide portion21has a groove width larger than the sipe width in the first portion16.", "", "Further, as shown inFIG.4, a second wide portion22communicates with the sipe bottom17dof the second portion17.", "", "The second wide portion22has a groove width larger than the sipe width in the second portion17.", "", "In the present embodiment, unless otherwise noted, the configuration of the first wide portion21can be applied to the second wide portion22.", "", "FIG.8is an enlarged cross-sectional view of the first wide portion21shown inFIG.5.", "", "As shown inFIG.8, the first wide portion21comprises an outer portion31in the tire radial direction and an inner portion32in the tire radial direction at least.", "", "Further, in the cross-sectional view of the first wide portion21, the outer portion31is formed by a pair of opposite first arcuate groove wall portions31awhich are convex toward a center line15cof the first sipe15so that the groove width of the outer portion31continuously increases inward in the tire radial direction from the sipe bottom16dof the first portion16.", "", "The center line15cis a center line in the width direction of the first sipe15which is extended to the bottom of the first wide portion21.", "", "The inner portion32is formed by a pair of opposite second arcuate groove wall portions32aconvex toward the opposite side to the center line15cof the first sipe15so that the groove width continuously decreases inward in the tire radial direction to the bottom of the first wide portion21.", "", "Further, as shown inFIG.4, in the present embodiment, the first wide portion21and the second wide portion22do not communicate with each other.", "", "By adopting the above-described configuration, the tire1of the present embodiment can be improve in on-ice performance and loading durability while ensuring the mold releasability. The reason is as follows.", "", "The first sipe15extends zigzag as described above. Further, the first sipe15is divided into the first portion16and the second portion17by the tie bar18.", "", "In such first sipe15, when a load at the time of contacting with the ground acts on the first block13, the sipe walls facing each other are strongly engaged with each other, and the rigidity of the first block13is maintained.", "", "Further, the tie bars18helps to maintain the rigidity of the first block13.", "", "As a result, the collapse of the first block13is effectively suppressed; the strain at the sipe bottom of the first sipe15can be suppressed; and the loading durability is improved.", "", "Further, as shown inFIG.4, the first sipe15communicates with the first wide portion21and the second wide portion22which are not in communication with each other.", "", "As a result, even if the first block13falls down, the strain is dispersed at the sipe bottom of the first sipe15, and the damage can be suppressed.", "", "Furthermore, since the first block13is prevented from collapsing by the mechanism described above, it is possible to ensure a large ground contact area when traveling on ice, and to obtain a large frictional force on ice due to the edge effect of the first sipe15.", "", "In addition, since the first sipe15communicates the first wide portion21and the second wide portion22, the first sipe15exhibits excellent water absorption performance, which further enhances on-ice performance.", "", "Furthermore, since the outer portion31is formed by the first arcuate groove wall portions31aand the inner portion32is formed by the second arcuate groove wall portions32a, the thick tip portion of a knife blade which forms the first wide portion21can be smoothly taken out from through the sipe during vulcanization molding, therefore, the mold releasability can be ensured.", "", "For the above reasons, the tire1of the present embodiment can be improved in on-ice performance and loading durability while ensuring mold releasability.", "", "A more detailed configuration of the present embodiment will be described below. Each configuration described below represents a specific aspect of the present embodiment. Therefore, the present disclosure can exhibit the above effects even if it does not have the configuration described below. Further, even if any one of the configurations described below is applied singly to the tire of the present disclosure having the features described above, an improvement in performance corresponding to each configuration can be expected. Furthermore, when some of the respective configurations described below are applied in combination, it is possible to expect a combined improvement in performance according to each configuration.", "", "When the tread portion2is axially divided into four equal parts, namely, two axially outer parts2A and two axially inner parts2B, it is preferable that the above-described first blocks13disposed in the land portion4included in the axially outer parts2A as shown inFIG.1.", "", "In the present embodiment, the first blocks13are disposed in the shoulder land portion9as the blocks11thereof, and the first blocks13forms the tread edges Te.", "", "Thus, as the first sipes15are formed in the shoulder land portions9where the ground contact pressure tends to increase, the loading durability is reliably improved.", "", "It is preferable that a plurality of the first sipes15are provided per first block13as shown inFIG.3.", "", "In the present embodiment, four first sipes15are provided per first block13.", "", "Each of the four first sipes15extends across the first block13in the tire axial direction. Further, in the present embodiment, except for the first sipes15, no sipe or groove is provided in the first block13.", "", "However, the present disclosure is not limited to such example. For example, the first block13may be provided with a narrow grooves extending in the tire circumferential direction.", "", "The interval “ta” between the circumferentially adjacent first sipes15(corresponds to the distance in the tire circumferential direction between the sipes' center lines) is, for example, set in a range from 3.0 to 7.0 mm, preferably from 4.0 to 6.0 mm.", "", "Thereby, it is possible to exhibit excellent on-ice performance while suppressing uneven wear of the first blocks13.", "", "As shown inFIG.5, the first sipe15extends in the tire radial direction with a constant width W2 in its cross section.", "", "Further, as shown inFIG.6, the first sipe15extends in its length direction with the constant width W2.", "", "That is, the first sipe15in the present embodiment extends with the constant width W2 over its entirety.", "", "For example, the width W2 is 1.0 mm or less, preferably 0.2 to 0.7 mm. Thereby, the loading durability and on-ice performance are improved in a well-balanced manner.", "", "The present disclosure is however, not limited to such a dimension. The dimension may include inevitable errors in rubber products such as tires, therefore, in this context, the width of the first sipe15may vary depending on its measurement position.", "", "Even in such case, however, it is preferable that the ratio W2M/W2m between the maximum value W2M and the minimum value W2m of the width of the first sipe15is 2.0 or less. The maximum value W2M is preferably 0.4 to 0.7 mm. The minimum value W2m is desirably 0.2 to 0.4 mm.", "", "As shown inFIG.7, the maximum depth d3from the ground contacting top surface13sof the first block13to the bottom of the first wide portion21is from 4.0 to 9.0 mm.", "", "The maximum depth d4from the ground contacting top surface13sof the first block13to the bottom of the second wide portion22is from 4.0 to 9.0 mm.", "", "Thereby, the loading durability and on-ice performance can be improved in a well-balanced manner.", "", "In the present embodiment, as a preferable arrangement, the depth d3and the depth d4are the same.", "", "The above-mentioned tie bar18is arranged, for example, in a central part when the first sipe15is divided into three equal parts in the sipe length direction.", "", "In the present embodiment, as a preferable arrangement, the tie bar18is arranged so as to include the center position of the first sipe15in the longitudinal direction. Thereby, local deformation of the first sipe15is suppressed, and excellent loading durability is exhibited.", "", "In the present embodiment, the tie bar18extends in the tire radial direction with a constant width, and a radially outer end18aof the tie bar18has an arcuate outer surface which is convex toward the ground contacting top surface13sof the first block13.", "", "In the cross section of the first sipe15along its length direction, the maximum width W5 of the tie bar18is, for example, in a range from 0.5 to 5.0 mm.", "", "The height h1 from the bottom of the first wide portion21to the radially outer extreme end of the tie bar18is preferably not less than 30%, more preferably not less than 40%, but preferably not more than 80%, more preferably not more than 70% of the maximum depth d3from the ground contacting top surface13sof the first block13to the bottom of the first wide portion21.", "", "Such tie bars18serve to improve the loading durability and on-ice performance in a well-balanced manner.", "", "As shown inFIG.4, the first wide portion21extends linearly in the length direction of the first sipe15while maintaining the shape and area in the cross section of the first wide portion21.", "", "Thereby, except for the portion communicating with the first sipe15, the first wide portion21has a columnar shape extending in the length direction of the sipe with a constant cross-sectional shape.", "", "The central axis of the first wide portion21, which can be defined by a set of centroids of the cross sectional shapes of the first wide portion21at positions along the length thereof, extends linearly.", "", "As shown inFIG.5, the maximum width L1 in the cross section of the first wide portion21is preferably not less than 2.0 times, more preferably not less than 3.0 times, but preferably not more than 6.0 times, more preferably not more than 5.0 times the width of the first sipe15in the cross section.", "", "Thereby, the above-described effects can be obtained while demonstrating excellent mold releasability during tire production.", "", "Here, the width of the first sipe15in the cross section means the constant width W2 in the present embodiment, and when the width varies depending on the measurement position, it means the maximum width.", "", "It is preferable that, in the first wide portion21, as shown inFIG.8, the curvature radius r1of the first arcuate groove wall portions31ais larger than the curvature radius r2of the second arcuate groove wall portions32a.", "", "The curvature radius r1is preferably not more than 5.0 times the curvature radius r2. the curvature radius r2is preferably 1.2 to 2.0 times the width between the two inner walls of the sipe. This will reliably improve the mold releasability.", "", "FIG.9is an enlarged cross-sectional view of the second wide portion22corresponding to the cross-sectional view taken along line CC inFIG.3.", "", "As shown, the second wide portion22comprises a radially outer portion41and a radially inner portion42.", "", "In the cross-sectional view of the second wide portion22, the outer portion41is formed by a pair of opposite first arcuate groove wall portions41aeach convex toward the sipe center line15cof the first sipe15, so that the groove width increases continuously and inwardly in the tire radial direction from the sipe bottom17din the second portion17.", "", "The inner portion42is formed by a pair of opposite second arcuate groove wall portions42aeach convex toward the opposite side to the sipe center line15cof the first sipe15so that the groove width decreases continuously toward the radially inside. Thereby, the thick tip end portion of the knife blade forming the second wide portion22can be smoothly taken out from through the sipe, and the mold releasability can be ensured more reliably.", "", "The second wide portion22has the same configuration as the first wide portion21. That is, the above-described configuration of the first wide portion21can also be applied to the second wide portion22.", "", "Therefore, as shown inFIG.4, the second wide portion22extends linearly along the length direction of the second portion17over its entire length.", "", "Further, as shown inFIG.9, in the second wide portion22, the curvature radius r3of the first arcuate groove wall portions41ais larger than the curvature radius r4of the second arcuate groove wall portions42a.", "", "The curvature radius r1of the first wide portion21described above can be applied to the curvature radius r3.", "", "The curvature radius r2of the first wide portion21described above can be applied to the curvature radius r4.", "", "Therefore, description of the numerical ranges for the curvature radii r3and r4is omitted.", "", "The maximum width L2 of the second wide portion22in its cross section is preferably not less than 2.0 times, more preferably not less than 3.0 times, but preferably not more than 6.0 times, more preferably not more than 5.0 times the width of the first sipe15in its cross section.", "", "As shown inFIG.4, the ratio V1/V2 between the volume V1 of the first wide portion21and the volume V2 of the second wide portion22is about 0.8 to 1.2. Namely, these volumes are substantially the same.", "", "As a modified example, it may be possible that the first wide portion21is arranged on the tread edge Te side of the second wide portion22, and the volume V1 of such axially outer first wide portion21is larger than the volume V2 of the axially inner second wide portion22.", "", "In this case, the volume V1 is preferably set in a range from 120% to 150% of the volume V2.", "", "In this example, since the first wide portion21arranged near the tread edge Te can exhibit excellent water absorbency, it is possible to focus on improving the on-ice performance. Further, an improvement in wandering performance can be expected.", "", "As still another example, it may be possible that the first wide portion21is arranged on the tread edge Te side of the second wide portion22, and the volume V1 of such axially outer first wide portion21is smaller than the volume V2 of the axially inner second wide portion22.", "", "In this case, the volume V1 is preferably set in a range from 50% to 80% of the volume V2.", "", "In this example, since the volume of the first wide portion21arranged near the tread edge Te is small, uneven wear near the tread edge Te can be suppressed.", "", "In the present embodiment, as shown inFIG.2, the tread portion2comprises a cap tread rubber layer Cg and a base tread rubber layer Bg.", "", "The cap tread rubber layer Cg forms the ground contacting surface of the tread portion2.", "", "The base tread rubber layer Bg is arranged radially inside the cap tread rubber layer Cg.", "", "The cap tread rubber layer Cg has a rubber hardness in a range from 40 to 65 degrees, for example.", "", "The base tread rubber layer Bg has a rubber hardness larger than that of the cap tread rubber layer Cg.", "", "The rubber hardness of the base tread rubber layer Bg is, for example, in a range from 50 to 75 degrees.", "", "In this application, the rubber hardness means a type-A durometer hardness measured at 23 degrees C. according to JIS-K6253.", "", "In the present embodiment, the distance t2from the ground contacting surface of the tread portion2to the boundary25between the cap tread rubber layer Cg and the base tread rubber layer Bg is in a range from 30% to 70% of the total thickness11of the cap tread rubber layer Cg and the base tread rubber layer Bg.", "", "As shown inFIG.5, a minimum distance t3in the tire radial direction from the boundary25to the bottoms of the first wide portion21and the second wide portion22is not less than 0.5 mm, preferably not less than 1.0 mm and not more than 4.0 mm.", "", "Thereby, the rubber separation at the boundary25due to deformation of the first wide portion21and the second wide portion22, can be effectively suppressed.", "", "While detailed description has been made of a preferable embodiment of the present disclosure, the present disclosure can be embodied in various forms without being limited to the illustrated embodiment."], "claims": ["a plurality of circumferential grooves extending continuously in a tire circumferential direction, a plurality of lateral grooves extending in a tire axial direction, and a plurality of first blocks, wherein each of the first blocks is provide with at least one first sipe which extends zigzag in a cross section perpendicular to the length direction thereof, and extends zigzag in a cross section parallel with the ground contacting top surface of the first block, each of the first sipes is provided with at least one tie bar which is locally raised outward in a tire radial direction from the sipe bottom, and terminated without reaching the ground contacting top surface of the first block so that the first sipe is partially divided in the length direction of the sipe by the above-said at least one tie bar into at least a first portion and a second portion, in each of the first sipes, the sipe bottom of the first portion communicates with a first wide portion having a groove width larger than the sipe width of the first portion, and the sipe bottom of the second portion communicates with a second wide portion having a groove width larger than the sipe width of the second portion, the above-said first wide portion comprises, in its cross section, an outer portion in the tire radial direction formed by a pair of first arcuate groove wall portions each convex toward a center line of the first sipe so that the groove width continuously increases from the sipe bottom toward the inner side in the tire radial direction, and an inner portion in the tire radial direction formed by a pair of second arcuate groove wall portions each convex toward the opposite side to the center line of the first sipe so that the groove width continuously decreases inward in the tire radial direction to the bottom of the first wide portion, and the first wide portion and the second wide portion do not communicate with each other.", "the first wide portion extends linearly along the length direction of the first portion over its entire length.", "the curvature radius of the first arcuate groove wall portion is larger than the curvature radius of the second arcuate groove wall portion.", "the curvature radius of the first arcuate groove wall portion is larger than the curvature radius of the second arcuate groove wall portion.", "the second wide portion comprises a radially outer portion and a radially inner portion, in a cross section of the second wide portion, the radially outer portion is formed by a pair of opposite first arcuate groove wall portions each convex toward a center line of the first sipe, so that the second wide portion has a groove width continuously increasing from the bottom of the first sipe toward the inside in the tire radial direction, and the radially inner portion is formed by a pair of opposite second arcuate groove wall portions each convex toward the opposite side to the center line of the first sipe, so that the second wide portion has a groove width continuously decreasing toward a bottom of the second wide portion.", "the second wide portion comprises a radially outer portion and a radially inner portion, in a cross section of the second wide portion, the radially outer portion is formed by a pair of opposite first arcuate groove wall portions each convex toward a center line of the first sipe, so that the second wide portion has a groove width continuously increasing from the bottom of the first sipe toward the inside in the tire radial direction, and the radially inner portion is formed by a pair of opposite second arcuate groove wall portions each convex toward the opposite side to the center line of the first sipe, so that the second wide portion has a groove width continuously decreasing toward a bottom of the second wide portion.", "the second wide portion comprises a radially outer portion and a radially inner portion, in a cross section of the second wide portion, the radially outer portion is formed by a pair of opposite first arcuate groove wall portions each convex toward a center line of the first sipe, so that the second wide portion has a groove width continuously increasing from the bottom of the first sipe toward the inside in the tire radial direction, and the radially inner portion is formed by a pair of opposite second arcuate groove wall portions each convex toward the opposite side to the center line of the first sipe, so that the second wide portion has a groove width continuously decreasing toward a bottom of the second wide portion.", "the second wide portion comprises a radially outer portion and a radially inner portion, in a cross section of the second wide portion, the radially outer portion is formed by a pair of opposite first arcuate groove wall portions each convex toward a center line of the first sipe, so that the second wide portion has a groove width continuously increasing from the bottom of the first sipe toward the inside in the tire radial direction, and the radially inner portion is formed by a pair of opposite second arcuate groove wall portions each convex toward the opposite side to the center line of the first sipe, so that the second wide portion has a groove width continuously decreasing toward a bottom of the second wide portion.", "the second wide portion extends linearly along the length direction of the first sipe in the second portion over its entire length.", "in the second wide portion, the curvature radius of the first arcuate groove wall portions is larger than the curvature radius of the second arcuate groove wall portions.", "the maximum width of the first wide portion in its cross section is 2.0 to 6.0 times the width of the first sipe in its cross section.", "the maximum width of the second wide portion in its cross section is 2.0 to 6.0 times the width of the first sipe in its cross section.", "the plurality of first blocks constitutes tread edges of the tread portion.", "a height in the tire radial direction from the bottom of the first wide portion to a radially outer end of the tie bar is 30% to 80% of a maximum depth from the ground contacting top surface of the first block to the bottom of the first wide portion.", "a width of the tie bar in a cross section along the length direction of the first sipe is 0.5 to 5.0 mm."], "bibtex": "@patent{20240174029,\n    title = {TIRE},\n    number = {20240174029},\n    year = {2024},\n    note = {File: US20240174029A1-20240530.XML}\n    }", "classification": "B60C1112FI"}, {"title": "TIRE TREAD INCLUDING A DECOUPLING GROOVE", "doc_number": "20240174030", "filename": "US20240174030A1-20240530.XML", "abstract": "A tire including a decoupling groove is provided, the tire comprising: a body, a shoulder, a tread surface including at least one decoupling groove extending radially inwardly into the body from the tread surface, and a plurality of parallel sipes, wherein the decoupling groove is oriented adjacent to the shoulder, wherein the decoupling groove is defined by an axially outer groove sidewall and an axially inner groove sidewall, has a width W 1 , and has a centerline, wherein the plurality of parallel sipes extend axially into the inner groove sidewall, wherein the decoupling groove has a radially inner groove base defined by a curvilinear base surface, has a width W 2 , and has a center, wherein the width W 2 is greater than the width W 1 , and wherein a centerline of the decoupling groove intersects the center of the groove base.", "detailed_description": ["FIG.1illustrates a perspective view of a tire100having a decoupling groove108. Tire100includes a tread surface104, which is the radially outermost portion of the tire and that portion of the tire that contacts a roadway or other surface upon which the tire operates. Tire100includes a shoulder106, which is a transition zone between tread104and the tire's sidewall118.", "", "As illustrated, tread surface104is featureless (except for decoupling groove108). It is understood that such an arrangement is for simplicity in illustration only, and that in practice, tread surface104may include grooves forming ribs, grooves and slots forming tread blocks, and combinations thereof.", "", "As illustrated, tire100includes an axial direction A, a circumferential direction C, and a radial direction R. Axial direction A is parallel to the axis of rotation of the tire. Circumferential direction C is parallel to the circumference of the tire. Radial direction R is parallel to the direction of radius of the tire.", "", "Decoupling groove108may extend circumferentially completely around tire100, and may extend radially inwardly from tread surface104. Decoupling groove108may be oriented at axially outward portions of tread surface104. Decoupling groove108may be oriented at one axially outward portion of tread surface104. Decoupling groove108may be oriented at both axially outward portions of tread surface104. “Axially outward” is understood to mean those portions of tread surface104outward from the centerline of tread surface104.", "", "Decoupling groove108may be oriented at one axially outwardmost portion of tread surface104, at or near where tread surface104meets shoulder106. Decoupling groove108may be oriented at both axially outwardmost portions of tread surface104, at or near where tread surface104meets shoulder106. This area, where tread surface104meets shoulder106may be referred to as the shoulder edge of tread surface104. This portion or these portions of tread surface104form the lateral edges of tire100's footprint when loaded to standard operating pressure.", "", "FIGS.2A and2Billustrate partial perspective views of a tire200having a decoupling groove208. Tread surface204includes decoupling groove208oriented adjacent to, at, or near a shoulder206. Decoupling groove208extends circumferentially.", "", "Decoupling groove208includes an axially inner groove sidewall212. Decoupling groove208includes a radially inner groove base214with a curvilinear base surface216. As further described below, decoupling groove208and radially inner groove base214together form a keyhole shaped groove.", "", "A plurality of parallel sipes220extend into groove sidewall212. Sipes220are open to tread surface204and decoupling groove208. Sipes220may include axially inner sipe bases222. Sipes220extend substantially radially and axially, but may be biased from that plane as further described below.", "", "FIGS.3A-3Gillustrate a tire300having a decoupling groove308. Tire300includes a body302, having a tread surface304and an inner surface305, and a shoulder306.", "", "Tire300includes a decoupling groove308extending radially inwardly from tread surface304adjacent to, at, or near shoulder306. Decoupling groove308is defined by an axially outer groove sidewall310and an axially inner groove sidewall312. Groove sidewalls310and312maybe parallel to one another. Decoupling groove includes a radially inner groove base314defined by a curvilinear base surface316. Curvilinear base surface316may include part of a circle.", "", "As illustrated inFIG.3B, decoupling groove308has a width W1defined as the width between axially outer groove sidewall310and axially inner groove sidewall312. Width W1is greater than about 2.0 mm. Width W1is greater than 2.0 mm. Width W1is about 2.5 mm. Width W1is 2.5 mm. Width W1is about 3.0 mm. Width W1is 3.0 mm. Width W1is between about 2.0 mm and about 3.0 mm. Width W1is between 2.0 mm and 3.0 mm. Width W1is about 3.5 mm. Width W1is 3.5 mm. Width W1is between about 2.0 mm and about 3.5 mm. Width W1is between 2.0 mm and 3.5 mm. Decoupling groove308includes a centerline CL extending down the center of decoupling groove308between groove sidewall310and groove sidewall312.", "", "As illustrated inFIG.3B, radially inner groove base314has a width W2defined as the axial width. Groove base314may have a circular cross-section, and a diameter D, which is equal to width W2. Width W2is about twice the value of width W1. Width W2is twice the value of width W1. Width W2may be 1.5 times the value of W1, 1.75 times the value, 2.0 times the value, 2.25 time the value, 2.5 times the value, 2.75 times the value, or 3.0 times the value. Width W2is greater than about 4.0 mm. Width W2is greater than 4.0 mm. Width W2is about 5.0 mm. Width W2is 5.0 mm. Width W2is about 6.0 mm. Width W2is 6.0 mm. Width W2is between about 4.0 mm and about 6.0 mm. Width W2is between 4.0 mm and 6.0 mm. Width W2is about 7.0 mm. Width W2is 7.0 mm. Width W2is between about 4.0 mm and about 7.0 mm. Width W2is between 4.0 mm and 7.0 mm. Base314may have a circular cross-section, and a center C. Centerline CL intersects center C. Alternatively, base314has an axial center point C halfway between the axially innermost and outermost sides of base314, and centerline CL passes through that center point C.", "", "As illustrated inFIG.3B, decoupling groove308has a height H defined as the height between tread surface304axially inward of decoupling groove308and the radially innermost portion of groove base314. Height H may be between about 7.0 mm and about 12.0 mm. Height H may be between 7.0 mm and 12.0 mm. Height H may be between about 8.0 mm and about 11.0 mm. Height H may be between 8.0 mm and 11.0. mm. Height H may be between about 8.15 mm and about 10.45 mm. Height H may be between 8.15 mm and 10.45 mm.", "", "As illustrated inFIG.3B, tread surface304may be radially offset from shoulder306by an offset distance O. Offset distance O may be about 0.5 mm, 1.0 mm, 1.5 mm, 2.0 mm, or 2.5 mm. Offset distance O may be between about 1.0 mm and about 2.0 mm. Offset distance O may be between about 0.5 mm and about 1.5 mm.", "", "As illustrated inFIG.3C, tire300includes a plurality of parallel sipes320extending into groove sidewall312. Sipes320are open to tread surface304and decoupling groove308. Sipes320may include axially inner sipe bases322. Sipes320extend substantially radially and axially, but may be biased from that plane. Specifically, sipes320may be angled from axis A by a sipe angle SA1. Angle SA1is an angle in the C-A plane. For clarity, angle SA1is biased when looking down upon tread surface304from above. Angle SA1may be about 25.0 degrees from the A axis. Angle SA1may be 25.0 degrees from the A axis. Angle SA1may be between about 20.0 degrees and about 30.0 degrees from the A axis. Angle SA1may be between 20.0 degrees and 30.0 degrees from the A axis. Angle SA1may be between about 15.0 degrees and about 35.0 degrees from the A axis. Angle SA1may be between 15.0 degrees and 35.0 degrees from the A axis.", "", "As illustrated inFIG.3D, sipes320may be angled from axis R by a sipe angle SA2. Angle SA2is an angle in the C-R plane. For clarity, angle SA2is biased when looking at tread surface304from an axial side. Angle SA2may be about 10.0 degrees from the R axis. Angle SA2may be 10.0 degrees from the R axis. Angle SA2may be between about 5.0 degrees and about 15.0 degrees from the R axis. Angle SA2may be between 5.0 degrees and 15.0 degrees from the R axis. Angle SA2may be between about 5.0 degrees and about 20.0 degrees from the A axis. Angle SA1may be between 5.0 degrees and 20.0 degrees from the A axis.", "", "Sipes320may be angled with both sipe angles SA1and SA2simultaneously. In another aspect, sipes320are angled with both sipe angles SA1and SA2simultaneously.", "", "FIGS.4A-4Eillustrate images and graphs related to a prior art tire400.FIGS.5A-5Eillustrate images and graphs related to tire300including decoupling groove308. As illustrated inFIG.4A, tire400includes a decoupling groove430having a groove base432. Groove base432is axially offset from decoupling groove430, such that the centerline of decoupling groove430does not intersect, or pass through, the center of groove base432.", "", "As illustrated inFIG.5A, tire300, on the other hand, includes decoupling groove308with a centerline that intersects the center of groove base314, forming a keyhole shape, along with parallel sipes320. This combination of the keyhole shape arrangement and parallel sipes320provides surprisingly good results as compared to the prior art (tire400) that: (1) reduce stress concentration, (2) reduce variation in contact pressure across the wear surface (tread surface304) by reducing pressure concentration at the tread edge (in the region of decoupling groove308) caused by rubber compression, (3) reduce concentration of strain as the tread edge is deformed (in the region of decoupling groove308), and/or (4) reduce concentration of strain at the radially inner portion of groove base314as body302and tread surface304deform, which increases resistance to tearing and/or cracking of the base surface316. This combination of the keyhole groove base314in decoupling groove308and sipes320as discussed leads to increased resistance to irregular wear in tread surface304. Additionally, the keyhole groove base314of decoupling groove308may remove contact pressure of tread surface304.", "", "FIG.4Billustrates a strain graph of prior art tire400having decoupling groove430.FIG.5Billustrates a strain graph of tire300having decoupling groove308. As illustrated, increased strain is experienced at the tread edge of tire400illustrated in the strain graph inFIG.4Bas compared to the strain graph inFIG.5B.", "", "FIG.4Cillustrates increased tread edge wear and tearing in the vicinity of decoupling groove430.FIG.5C, on the other hand, illustrates comparatively reduced tread edge wear and tearing in the vicinity of decoupling groove308. Tires300and400were subjected to the same use and testing to generate the illustrated wear and tearing.", "", "FIG.4Dillustrates a physical test wear energy graph of prior art tire400having decoupling groove430.FIG.5Dillustrates a physical test wear energy graph of tire300having decoupling groove308. A comparison of the two graphs illustrates that wear energy on the wear surface of tire300(FIG.5D) is reduced/redistributed from the outer and inner shoulder shoulders (the leftmost and rightmost peaks) as compared to tire400(FIG.4D). Further, as illustrated inFIG.5D, the maximum wear energy experienced by tire300including decoupling groove308is more than 20% less than the maximum wear energy experienced by tire400including decoupling groove430.", "", "FIG.4Eillustrates a virtual test wear energy intensity summary graph of prior art tire400having decoupling groove430.FIG.5Eillustrates a virtual test wear energy intensity summary graph of tire300having decoupling groove308. A comparison of the two graphs illustrates that wear energy intensity on the wear surface of tire300(FIG.5E) is reduced/redistributed from the outer and inner shoulder shoulders (the leftmost and rightmost peaks) as compared to tire400(FIG.4E). Further, as illustrated inFIG.5E, the maximum wear energy intensity experienced by tire300including decoupling groove308is more than 33% less than the maximum wear energy intensity experienced by tire400including decoupling groove430.", "", "FIGS.6A-6Dillustrate shear force graph plotting the free rolling and −2.5% lateral force profiles of two tires. In each graph illustrated inFIGS.6A-6D, it is desirable to shift the plots in the positive direction of the vertical axis (in other words, shift the plot vertically up) to increase the tire's irregular wear resistance. Stated differently, a plot shifted in the positive direction in the aforementioned graphs indicates a tire having an increased resistance to irregular wear, as opposed to a tire having a plot that is shifted in the negative (vertically down) direction, which would have a relatively lower resistance to regular wear.", "", "The vertical axis of the plots illustrates the shear force, while the horizontal axis of the plots illustrates the position on the tire tested. Those portions of the plot in the extreme left and right ends (the negative-most and positive-most directions of the horizontal axis), where the value is shown as 0, are indicative of positions that are beyond the sensor's ability to detect shear force.", "", "In each graph illustrated inFIGS.6A-6D, the shear forces for the outside shoulder rib of the tires is the subject of the plots. The values shown correspond to shear forces at the axial center of each tire's outside shoulder rib, so as to provide a predicted average shear force across the subject shoulder rib.", "", "FIG.6Aillustrates a shear force graph measuring the fore-aft (circumferential) shear force experienced in the outside shoulder rib of two tires. The shear force is measured in a free rolling scenario, where no lateral force is intentionally applied to the tire during testing. The two tires tested are the conventional tire (prior art tire400) and the new design (tire300). Fore-aft (circumferential) shear force for each of the conventional tire (400) and the new design (300) was measured twice, labeled “1” and “2” for each of tires400and300. Fore-aft (circumferential) shear force for each of the conventional tire (400) and the new design (300) was measured in the center (that is, the axial center) of the outside shoulder rib of each tire.", "", "As is illustrated, the new design plots (tire300) are shifted in the positive direction (vertically up) relative to the conventional tire plots (tire400). This vertical positive shift indicates that new design tire300has an improved or increased irregular wear resistance relative to the conventional tire400.", "", "FIG.6Billustrates a shear force graph measuring the lateral (axial) shear force experienced in the outside shoulder rib of two tires. The shear force is measured in a free rolling scenario, where no lateral force is intentionally applied to the tire during testing. The two tires tested are the conventional tire (prior art tire400) and the new design (tire300). Lateral (axial) shear force for each of the conventional tire (400) and the new design (300) was measured twice, labeled “1” and “2” for each of tires400and300. Lateral (axial) shear force for each of the conventional tire (400) and the new design (300) was measured in the center (that is, the axial center) of the outside shoulder rib of each tire.", "", "As is illustrated, the new design plots (tire300) are shifted in the positive direction (vertically up) relative to the conventional tire plots (tire400). This vertical positive shift indicates that new design tire300has an improved or increased irregular wear resistance relative to the conventional tire400.", "", "FIG.6Cillustrates a shear force graph measuring the fore-aft (circumferential) shear force experienced in the outside shoulder rib of two tires. The shear force is measured with a −2.5% lateral force, where lateral force is intentionally applied to the tire during testing. The intent of applying the −2.5% lateral force is to replicate the lateral force that a tire experiences counteracting the road crown in the average roadway. That is, a driver may impart a small amount of steering angle to a vehicle's wheels, toward the road's crown, to maintain the vehicle's trajectory along the lane of travel. This steering angle is approximated by the −2.5% lateral force input The two tires tested are the conventional tire (prior art tire400) and the new design (tire300). Fore-aft (circumferential) shear force for each of the conventional tire (400) and the new design (300) was measured twice, labeled “1” and “2” for each of tires400and300. Fore-aft (circumferential) shear force for each of the conventional tire (400) and the new design (300) was measured in the center (that is, the axial center) of the outside shoulder rib of each tire.", "", "As is illustrated, the new design plots (tire300) are shifted in the positive direction (vertically up) relative to the conventional tire plots (tire400). This vertical positive shift indicates that new design tire300has an improved or increased irregular wear resistance relative to the conventional tire400.", "", "FIG.6Dillustrates a shear force graph measuring the lateral (axial) shear force experienced in the outside shoulder rib of two tires. The shear force is measured with a −2.5% lateral force, where lateral force is intentionally applied to the tire during testing, as described above with respect toFIG.6C. The two tires tested are the conventional tire (prior art tire400) and the new design (tire300). Lateral (axial) shear force for each of the conventional tire (400) and the new design (300) was measured twice, labeled “1” and “2” for each of tires400and300. Lateral (axial) shear force for each of the conventional tire (400) and the new design (300) was measured in the center (that is, the axial center) of the outside shoulder rib of each tire.", "", "As is illustrated, the new design plots (tire300) are shifted in the positive direction (vertically up) relative to the conventional tire plots (tire400). This vertical positive shift indicates that new design tire300has an improved or increased irregular wear resistance relative to the conventional tire400.", "", "As evidenced by the graphs ofFIGS.6A-6D, the combination of the keyhole groove base314in decoupling groove308, and sipes320, leads to increased resistance to irregular wear in tread surface304of tire300relative to conventional tire400.", "", "To the extent that the term “includes” or “including” is used in the specification or the claims, it is intended to be inclusive in a manner similar to the term “comprising” as that term is interpreted when employed as a transitional word in a claim. Furthermore, to the extent that the term “or” is employed (e.g., A or B) it is intended to mean “A or B or both.” When the applicants intend to indicate “only A or B but not both” then the term “only A or B but not both” will be employed. Thus, use of the term “or” herein is the inclusive, and not the exclusive use. See Bryan A. Garner, A Dictionary of Modern Legal Usage624(2d. Ed. 1995). Also, to the extent that the terms “in” or “into” are used in the specification or the claims, it is intended to additionally mean “on” or “onto.” To the extent that the term “substantially” is used in the specification or the claims, it is intended to take into consideration the degree of precision available in tire manufacturing. To the extent that the term “selectively” is used in the specification or the claims, it is intended to refer to a condition of a component wherein a user of the apparatus may activate or deactivate the feature or function of the component as is necessary or desired in use of the apparatus. To the extent that the term “operatively connected” is used in the specification or the claims, it is intended to mean that the identified components are connected in a way to perform a designated function. As used in the specification and the claims, the singular forms “a,” “an,” and “the” include the plural. Finally, where the term “about” is used in conjunction with a number, it is intended to include ±10% of the number. In other words, “about 10” may mean from 9 to 11.", "", "As stated above, while the present application has been illustrated by the description of embodiments and aspects thereof, and while the embodiments and aspects have been described in considerable detail, it is not the intention of the applicants to restrict or in any way limit the scope of the appended claims to such detail. Additional advantages and modifications will readily appear to those skilled in the art, having the benefit of the present application. Therefore, the application, in its broader aspects, is not limited to the specific details, illustrative examples shown, or any apparatus referred to. Departures may be made from such details, examples, and apparatuses without departing from the spirit or scope of the general inventive concept."], "claims": ["a body, a shoulder, a tread surface including at least one decoupling groove extending radially inwardly into the body from the tread surface, and a plurality of parallel sipes, wherein the decoupling groove is oriented adjacent to the shoulder, wherein the decoupling groove is defined by an axially outer groove sidewall and an axially inner groove sidewall, has a width W wherein the plurality of parallel sipes extend axially into the inner groove sidewall, wherein the decoupling groove has a radially inner groove base defined by a curvilinear base surface, has a width W wherein the width W wherein a centerline of the decoupling groove intersects the center of the groove base.", "2 . The tire of claim 1 , wherein the tire has an axial axis A, a radial axis R, and a circumferential axis C, and wherein the sipes are angled in a plane formed by the circumferential and axial axes.", "wherein SA", "wherein SA", "5 . The tire of claim 1 , wherein the tire has an axial axis A, a radial axis R, and a circumferential axis C, and wherein the sipes are angled in a plane formed by the circumferential and radial axes.", "wherein SA", "wherein SA", "8 . The tire of claim 1 , wherein the tire has an axial axis A, a radial axis R, and a circumferential axis C, wherein the sipes are angled in a plane formed by the circumferential and axial axes, and wherein the sipes are angled in a plane formed by the circumferential and radial axes.", "9 . The tire of claim 8 , wherein the sipes are angled by a sipe angle SA 1 in the plane formed by the circumferential and axial axes, wherein the sipes are angled by a sipe angle SA 2 in the plan formed by the circumferential and radial axes, wherein SA 1 is 25.0 degrees from the axial axis A, and wherein SA 2 is 10.0 degrees from the radial axis R.", "10 . The tire of claim 1 , wherein the width W 1 is 2.5 mm.", "11 . The tire of claim 1 , wherein the width W 1 is greater than 2.0 mm.", "12 . The tire of claim 1 , wherein the width W 2 is 2.0 times the value of the width W 1 .", "13 . The tire of claim 1 , wherein the groove base comprises circular cross-section having a diameter D, and wherein the diameter D is equal to the width W 2 .", "14 . The tire of claim 1 , wherein the sipes are open to the tread surface and the decoupling groove.", "a body, a shoulder, a tread surface including at least one decoupling groove extending radially inwardly into the body from the tread surface, and a plurality of parallel sipes, wherein the decoupling groove is oriented adjacent to the shoulder, wherein the decoupling groove is defined by an axially outer groove sidewall and an axially inner groove sidewall, has a width W wherein the plurality of parallel sipes extend axially into the inner groove sidewall, wherein the decoupling groove has a radially inner groove base defined by a curvilinear base surface, has a width W wherein the width W wherein a centerline of the decoupling groove intersects the center of the groove base, wherein the tire has an axial axis A, a radial axis R, and a circumferential axis C, wherein the sipes are angled in a plane formed by the circumferential and axial axes, and wherein the sipes are angled in a plane formed by the circumferential and radial axes, wherein the sipes are angled by a sipe angle SA wherein the sipes are angled by a sipe angle SA wherein SA wherein SA", "16 . The tire of claim 15 , wherein SA 1 is 25.0 degrees from the axial axis A.", "17 . The tire of claim 15 , wherein SA 2 is 10.0 degrees from the radial axis R.", "18 . The tire of claim 15 , wherein the width W 1 is 2.5 mm.", "19 . The tire of claim 15 , wherein the width W 2 is 2.0 times the value of the width W 1 .", "20 . The tire of claim 15 , wherein the groove base comprises circular cross-section having a diameter D, and wherein the diameter D is equal to the width W 2 ."], "bibtex": "@patent{20240174030,\n    title = {TIRE TREAD INCLUDING A DECOUPLING GROOVE},\n    number = {20240174030},\n    year = {2024},\n    note = {File: US20240174030A1-20240530.XML}\n    }", "classification": "B60C1113FI"}, {"title": "TIRE WITH IMPROVED SNOW PERFORMANCE", "doc_number": "20240174031", "filename": "US20240174031A1-20240530.XML", "abstract": "The present invention relates to a tire ( 1 ) having an external surface ( 10 ) with innovative profile at perimetral walls ( 2, 3, 4, 5 ) of the tread blocks (a, b), for Improving snow performances. The perimetral walls present a 3-dimensional voids/protrusions ( 9, 8 ) pattern, configured to improve snow digging and snow trapping effects.", "detailed_description": ["Hereinafter, several embodiments and variations of the invention will be described, with reference to the Figures introduced above.", "", "Moreover, the different embodiments and variants described in the following are possibly employed in combination, when they are compatible.", "", "With reference toFIG.4a, a preferred embodiment of a tire1according to the present invention is shown, including an external tread portion P, which comprises at least a tread block a.", "", "According to the present disclosure, it is intended that a tread portion could refer to, or comprise, a central, middle or/and shoulder land portion of a tread. Still according to the present disclosure, all the features of the invention which in the following are referred to a tread block exemplary provided with a prismatic shape, are intended to be applied also to tread blocks, or more in general to tread land portions, provided with different and even more complex shapes, e.g. provided with V-shaped (“palm” shaped) profiles.", "", "The tire1presents a circumferential direction C, a radial direction R and a transversal direction T, said transversal direction being a direction parallel to the rotation axis A of the tire. For better clarity, an arrow indicates the rolling direction of the tire1.", "", "In the exemplary view ofFIG.4a, the transversal direction T and the rotation axis A are represented as being coincident.", "", "Furthermore, to ease the following description of the tread block geometry, inFIG.4aa Cartesian coordinate system is given, which is intended to be the local reference system of the tread block, defined by a longitudinal axis x, a transversal axis y and a sagittal axis z. The longitudinal axis x is locally tangent to the circumferential direction C, the transversal axis y is parallel to the rotation axis A and the sagittal axis z is locally coincident with the radial direction R.", "", "The tread portion P, or in particular, according to the present example, the tread block a, comprises a plurality of lateral perimetral faces or walls, which according to the present disclosure are intended to be external walls of the block a, for example walls facing macro-voids or facing other blocks, and not inner walls of the tread block facing micro-voids such as, for example, sipes' walls. The perimetral walls are those which penetrate and engage with the snow, or, more in general, with the ground, when the tire1is in use.", "", "According to the invention, at least a portion of an external surface of one of said perimetral walls bears a 3-dimensional (3D) pattern of recesses and/or protrusions.", "", "According to the invention, also embodiments comprising a 3D only-recesses pattern and a 3D only-protrusions pattern are foreseen.", "", "In other words, the 3D pattern comprises recesses and/or protrusions alternating to each other according to at least two spatial directions, preferably perpendicular to each other, of the same external surface. Preferably, recesses and/or protrusions alternate to each other according to two main directions which are perpendicular to each other and define the extension, according to a plan view, of the concerned external surface. As way of example, with reference to the above Cartesian coordinate system, such two directions could be a transversal/longitudinal direction and a sagittal direction. Said 3D pattern is configured to improve snow digging and snow trapping effects, as the snow is trapped and compacted inside the 3D recesses, and/or between the 3D protrusions, when the tire1is in use.", "", "Preferably, each of said alternating recesses and/or protrusions is shaped as a double-curved element but, according to preferred embodiments of the inventions, it can present also a prismatic shape (embodiment ofFIG.4be4c) or a pyramidal shape. Otherwise, various regions of external surface, each presenting different shapes of recesses and/or protrusions, could be provided at the same block wall.", "", "As way of example,FIGS.4be4cshow a plan view and a lateral view of a preferred embodiment of a tread block a according to the present invention, respectively. The tread block a presents a prismatic shape defined by four perimetral walls, namely a first couple of longitudinal perimetral walls, and a second couple of transversal perimetral walls. Preferably, all external surfaces of the four perimetral walls bear alternating recesses and/or protrusions presenting a prismatic shape, creating a 3D pattern.", "", "More in general, the alternation of recesses and/or protrusions realizes a sort of 3D checkerboard pattern on the external surface of a tread land portion, in particular of a tread block.", "", "According to other embodiments of the invention, a 3D pattern according to what already described could be provided to the external surface of only one perimetral wall, or two opposite perimetral walls (preferably, a couple of transversal perimetral walls), or—of course—all the perimetral walls of the tread block, as already said. The 3D pattern could be provided to a whole external surface of a respective perimetral wall, or only to a limited portion thereof.", "", "Preferably, the distance between consecutive recesses and/or protrusions, measured according a direction parallel to the external surface of the perimetral wall on which they are provided to, is constant.", "", "With reference toFIG.5, another preferred embodiment of a tread portion P according to the present invention is shown. For better clarity, an arrow indicates the rolling direction of the tire comprising the tread portion P (the tire is not represented inFIG.5). The tread portion P comprises, as way of example, two tread blocks respectively designed by reference letters a and b, but the following description will refer to tread block a only. However, all the following considerations about tread block a are to be intended as extended to tread block b, too (or to any other tread block comprised in a tire according to the present invention).", "", "As can be clearly seen inFIG.5, the 3D pattern of the invention is intended to be provided to external, perimetral faces or walls which define the tread portion or more in particular the tread block, which faces or walls are not intended to comprise inner walls provided within tread block body, such as walls defining the sipes11.", "", "The tread block a has preferably a prismatic shape and comprises four perimetral walls, namely a first couple3,5ad a second couple2,4of perimetral walls, wherein in general the walls of each couple are substantially opposite to each other. In particular, tread block a comprises two longitudinal perimetral walls2,4extending according said circumferential and radial directions C, R and two transversal perimetral walls3,5extending according said transversal and radial directions T, R.", "", "Preferably, a whole external surface10of each of the two perimetral walls of the first couple3,5, or of the second couple2,4, is provided with the 3D pattern of alternating recesses6and/or protrusions7.", "", "That is, according to a preferred embodiment, a whole external surface10of both said two transversal perimetral walls3,5bears the 3D pattern of alternating recesses6and/or protrusions7, as can be seen also inFIGS.6and7. An increased view of the 3D patterned external surface10is shown inFIG.8.", "", "According to another preferred embodiment of the invention, a whole external surface10of two consecutive perimetral walls of tread block a (with reference toFIGS.6and7, consecutive perimetral walls being denoted by the numeral references2,3or3,4or4,5or5,2) could bear the 3D pattern of alternating recesses and/or protrusions.", "", "Alternatively, a whole external surface10of three perimetral walls of tread block a could bear the 3D pattern of alternating recesses and/or protrusions.", "", "Preferably, the 3D pattern of alternating recesses and/or protrusions is realized by means of a wavy generatrix G swept along a wavy directrix D path, the preferred embodiments of lines G and D being shown inFIGS.10and9, respectively. The generatrix G and directrix D both comprise crest points8, which are most external points of a respective external surface10, and trough points9, which are most internal points of a respective external surface10.", "", "It is to be noted that, in the present disclosure, also a zigzag line which presents a bend radius different than zero at its crest points and trough points is intended to be a wavy line.", "", "With reference toFIG.9, the directrix D is shown, corresponding to the external profile of the tread block 3D patterned surface according to a x-z plane section. With reference toFIG.10, the generatrix G is shown, corresponding to the external profile of the tread block 3D patterned surface according to a x-y plane section.", "", "In particular, the 3D pattern has been generated by means of the generatrix G profile (on plane x-y, as shown inFIG.10) swept along the directrix D profile (on plane x-z, as shown inFIG.9).", "", "According to a preferred embodiment of the invention, the distance between consecutive crest points8and trough points9, measured according to the longitudinal direction x, which is a direction parallel to said external surface10, is constant. Preferably, the height xhout, xwoutof the crest points8with respect to the external surface10, measured according to the transversal direction y, is constant. The depth xhin, xwinof the trough points9with respect to the external surface10can be constant, too.", "", "More particularly, the height xhout, xwoutof the crest points8with respect to the external surface10can be comprised between 0 and 4 mm, preferably between 0.5 and 3 mm. On the other side, the depth xhin, xwinof the trough points9with respect to the external surface10can be comprised between 0 and 4 mm, preferably between 0.5 and 3 mm.", "", "Preferably, the distance yh3, yw3between consecutive crest points8and trough points9, measured according a transversal direction y parallel to said external surface10, is comprised between 0.5 and 7.5 mm, preferably between 0.5 and 5 mm. Still preferably, the distance between each of the crest points8and trough points9, measured according a longitudinal direction x orthogonal to said external surface10is equal at most to 8 mm, preferably comprised between 0.5 and 6 mm.", "", "In particular, the wavy generatrix G and/or the wavy directrix D present a bend radius equal to 0.2 mm at each of crest points8and trough points9(not shown inFIGS.9and10). According to other embodiments, the bend radius could be at most equal to 2 mm, more preferably comprised between 0.2 and 1.5 mm.", "", "According to other embodiments of the invention, the 3D pattern of alternating recesses and/or protrusions could be realized by means of a zigzag generatrix swept along a zigzag directrix (wherein the zigzag generatrix and directrix have bend radius different than zero at their crest points and trough points). In such a case, the recesses and/or protrusions generated would have a pyramidal shape.", "", "The aim of the introduction of a complex 3D pattern is to maximize the presence of grooves/cuts/voids (properly shaped and spaced) on tread land portions (in particular tread block) walls, in order to get snow trapped in them. Trapped snow will be compacted, resulting in increasing longitudinal shear forces and in turn the overall gripping effect.", "", "The more external surface of the tread blocks is provided with a 3D pattern of recesses and/or protrusions according to the invention, the more the snow performance is improved. As intended by those skilled in the art that, depending on the selection of the external surfaces of the tread land portions provided with the 3D-pattern, it is possible to improve traction and/or braking and/or cornering on snow, and even all of said features at the same time.", "", "Referring toFIGS.5,9and10, preferred dimensional values of the generatrix G and directrix D lines are reported below (aw and ah indicate the original quote of a flat external surface10, with no recesses and protrusions applied thereon).", "", "Preferred rangeMin.Max.Min.Max.DimensionDimensionDimensionDimensionRange[mm][mm][mm][mm]xhout040.253xhin040.253yh102.50.32yh20402.5yh30.57.50.55yh402.50.32xwout040.253xwin040.253yw102.50.32yw20402.5yw30.57.50.55yw402.50.32xlout040.253xlin040.253yl102.50.32yl20402.5yl30.57.50.55yl402.50.32"], "claims": ["1 - 19 . (canceled)", "an external tread portion which comprises a tread block, the tread block comprising a plurality of lateral perimetral walls; wherein at least a portion of an external surface of one of the perimetral walls bears a three-dimensional pattern of recesses and/or protrusions; and wherein the recesses and/or protrusions alternate to each other according to at least two spatial directions of the external surface.", "21 . The tire of claim 20 , wherein the at least two spatial directions are perpendicular to each other.", "22 . The tire of claim 20 , wherein a distance between consecutive recesses and/or protrusions, measured according to a direction parallel to the external surface, is constant.", "23 . The tire of claim 20 , wherein a whole external surface of one of the perimetral walls bears the three-dimensional pattern of alternating recesses and/or protrusions.", "24 . The tire of claim 20 , wherein a whole external surface of two opposing ones of the perimetral walls bears the three-dimensional pattern of alternating recesses and/or protrusions.", "25 . The tire of claim 20 , wherein a whole external surface of two consecutive ones of the perimetral walls bears the three-dimensional pattern of alternating recesses and/or protrusions.", "26 . The tire of claim 20 , wherein a whole external surface of three of the perimetral walls bears the three-dimensional pattern of alternating recesses and/or protrusions.", "27 . The tire of claim 20 , wherein a whole external surface of all the perimetral walls bears the three-dimensional pattern of alternating recesses and/or protrusions.", "28 . The tire of claim 20 , wherein the three-dimensional pattern of alternating recesses and/or protrusions is realized using a wavy generatrix swept along a wavy directrix, the wavy generatrix and the wavy directrix each comprising crest points, which are most external points of a respective external surface, and trough points, which are most internal points of the respective external surface.", "29 . The tire of claim 28 , wherein a distance between consecutive crest points and trough points, measured according to a direction parallel to the external surface, is constant.", "30 . The tire of claim 28 , wherein a height of the crest points with respect to the external surface is constant.", "31 . The tire of claim 28 , wherein a depth of the trough points with respect to the external surface is constant.", "32 . The tire of claim 28 , wherein a height of the crest points with respect to the external surface is from 0 to 4 mm.", "33 . The tire of claim 32 , wherein the height of the crest points with respect to the external surface is from 0.25 to 3 mm.", "34 . The tire of claim 28 , wherein a depth of the trough points with respect to the external surface is from 0 to 4 mm.", "35 . The tire of claim 28 , wherein a distance between consecutive crest points and trough points, measured according to a direction parallel to the external surface, is from 0.5 to 7.5 mm.", "36 . The tire of claim 28 , wherein a height of the crest points with respect to the trough points, measured according to a direction orthogonal to the external surface, is equal to or less than 8 mm.", "37 . The tire of claim 28 , wherein the wavy generatrix and/or the wavy directrix present a bend radius equal to 0.2 mm at each of the crest points and trough points.", "38 . The tire of claim 20 , wherein the alternating recesses and/or protrusions presents a prismatic or pyramidal shape.", "39 . The tire of claim 20 , wherein the three-dimensional pattern of alternating recesses and/or protrusions is realized via a zigzag generatrix swept along a zigzag directrix."], "bibtex": "@patent{20240174031,\n    title = {TIRE WITH IMPROVED SNOW PERFORMANCE},\n    number = {20240174031},\n    year = {2024},\n    note = {File: US20240174031A1-20240530.XML}\n    }", "classification": "B60C1113FI"}]