[{"title": "ASSEMBLY FOR VEHICLE DRIVING DEVICE", "doc_number": "20240408912", "filename": "US20240408912A1-20241212.XML", "abstract": "An assembly for a vehicle driving device includes a hub configured to rotate about a rotary axis and one or more first fastening members configured to couple the hub and a rim of a wheel for a vehicle, wherein one end portion of the hub includes a first facing surface facing one surface of the rim, wherein the first facing surface includes a portion having an inclination angle with respect to the rotary axis, and the first fastening member is inserted into one portion of the one surface of the rim facing the portion having the inclination angle of the first facing surface and the portion having the inclination angle of the first facing surface in a perpendicular direction to couple the hub and the rim.", "detailed_description": ["Like reference numerals denote like elements throughout the specification. In the specification, all elements of the embodiments are not described, and general contents in the art or repeated contents between the embodiments will not be described. Terms such as parts, modules, members, and blocks may be realized using a software or hardware, and a plurality of parts, modules, members, and blocks are realized in a single element, or one part, module, member, or block may also include a plurality of elements.", "", "Throughout the specification, when a part is referred to as being “connected” to another part, it includes “directly connected” to another part and “indirectly connected” to another part, and the “indirectly connected” to another part includes “connected” to another part through a wireless communication network.", "", "In addition, when a part “includes” an element, another element may be further included, rather than excluding the existence of another element, unless otherwise described.", "", "Throughout the specification, when a member is referred to as being “on” another member, the member is in contact with another member or yet another member is interposed between the two members.", "", "Terms such as first, second, and the like are used herein to distinguish one element from another element, and the elements are not limited to the above-described terms.", "", "As used herein, singular forms “a” and “an” are intended to include the plural forms as well, unless the context clearly indicates otherwise.", "", "Reference numerals in operations are used for the sake of convenience in description and do not describe an order of the operations, and the operations may be performed through an order different from the described order unless the context clearly indicates a specific order.", "", "The disclosure is based on a fact that it will be easier to suppress and/or eliminate low-frequency noise generated during travel of a vehicle by changing some configuration (and/or some structure) around an axle of a vehicle rather than changing some configuration (and/or some structure) of a brake device.", "", "Some of the low-frequency noise (for example, a howl noise) generated during the travel of the vehicle may be generated from a rim and/or a disc. Accordingly, when static and dynamic torsion behaviors of the rim and the disc are improved, the low-frequency noise generated during the travel of the vehicle can be suppressed and/or eliminated.", "", "In order to improve the static and dynamic torsion behaviors of the rim and the disc, that is, to increase torsional stiffness of the rim and the disc, bolt circle diameters of the rim and/or the disc need to be large.", "", "Accordingly, in an embodiment of the disclosure, a new assembly for a vehicle driving device in which bolt circle diameters of a rim and/or a disc may be greater than those of the conventional assembly structure is proposed.", "", "Hereinafter, an operational principle and embodiments of the disclosure will be described with reference to the accompanying drawings.", "", "FIG.1is a schematic cross-sectional view illustrating an axle, a wheel and a brake device of a conventional vehicle which are coupled,FIG.2is a view illustrating coupling of the axle and the wheel as illustrated inFIG.1, andFIG.3is a view illustrating coupling of the axle and the brake device as illustrated inFIG.1.", "", "Referring toFIGS.1,2, and/or3, a first surface of an axle1and one surface of a wheel2may be in contact with each other, and a second surface of the axle1and one surface of a brake device3may be in contact with each other.", "", "Referring toFIGS.2and3, the axle1may include a hub101.", "", "Referring toFIG.2, one end portion (or, referred to as a first axial direction outer end portion)1011of the hub101and a rim201of the wheel2may be in contact with each other. Accordingly, the hub101may rotate about a rotary axis RA while transmitting power provided through the axle1to the wheel2.", "", "Referring toFIG.3, the other end portion (or, referred to as a second axial direction outer end portion)1013of the hub101and a disc301of the brake device3may be in contact with each other. Accordingly, the hub101may rotate about the rotary axis RA while transmitting power provided through the axle1to the disc301.", "", "FIG.4is a view for describing conventional coupling of the hub and the rim using a bolt.", "", "Referring toFIG.4, through holes41and43are formed in two end portions of the hub101disposed in a direction perpendicular to the rotary axis RA. The through holes41and43are formed in end portions of the hub101to be parallel to the rotary axis RA. In addition, a bolt401is inserted into the through hole41, and a bolt403is inserted into the through hole43so that the rim201of the wheel2and the hub101are coupled using the bolt401and the bolt403.", "", "According to a conventional coupling structure of the rim201and the hub101as illustrated inFIG.4, there has been a problem that low-frequency noise is generated during travel of the vehicle.", "", "Accordingly, in an embodiment of the present disclosure, in order to suppress and/or eliminate low-frequency noise, a new coupling structure, that is, assembly structure, in which a bolt circle diameter of the through hole43is increased, is proposed to increase a torsion eigen frequency of the rim201.", "", "FIG.5is a view for illustrating conventional coupling of a hub and a disc using the bolt.", "", "Referring toFIG.5, conventionally, through holes45and47are formed in two end portions of the hub101in a direction perpendicular to the rotary axis RA and portions of the disc301in contact with the two end portions. In addition, the through holes45and47are formed to be parallel to the rotary axis RA in the two end portions of the hub101and the portions of the disc301in contact with the two end portions. In addition, a bolt405is inserted into the through hole45and a bolt407is inserted into the through hole47so that the disc301and the hub101of the brake device3are coupled using the bolt405and the bolt407.", "", "According to the conventional coupling structure of the disc301and the hub101as illustrated inFIG.5, there has been a problem that low-frequency noise is generated during travel of the vehicle.", "", "Accordingly, in an embodiment of the present disclosure, in order to suppress and/or eliminate low-frequency noise, a new coupling structure, that is, an assembly structure, in which a bolt circle diameter5is increased, is proposed to increase a torsion eigen frequency of the disc301of the brake device3.", "", "FIG.6is a schematic cross-sectional view illustrating an assembly of a vehicle driving device6including a hub, a rim, and a disc according to one embodiment.", "", "Referring toFIG.6, an end portion (or, referred to as one surface in a first outer axial direction L) of a hub610disposed in one direction L may include a facing surface (or, referred to as a first facing surface) facing one surface of a rim630. In addition, the facing surface may include portions having inclination angles with respect to a rotary axis RA.", "", "For example, the facing surface may include a first portion611, a second portion612, and/or a third portion613, and the portions having the inclination angles may correspond to the second portion612and the third portion613.", "", "A first bolt671corresponding to a first fastening member may be inserted into one portion of one surface of the rim630facing the second portion612of the hub610, that is, a second portion633, and the second portion612.", "", "A second bolt673corresponding to a first fastening member may be inserted into one portion of one surface of the rim facing the third portion613of the hub610, that is, a third portion635, and the third portion613.", "", "Then, the first fastening member (the first bolt671and/or the second bolt673) may have an inclination (referred to as a first inclination) with respect to the rotary axis RA. In other words, the first fastening member (the first bolt671and/or the second bolt673) may be disposed not parallel to the rotary axis RA.", "", "An end portion (also referred to as one surface of a second outer axial direction R) of the hub610disposed in the other direction R may include a facing surface (referred to as a second facing surface) facing one surface of a disc650. In addition, the facing surface may include portions having inclination angles with respect to the rotary axis RA.", "", "For example, the facing surface may include a fourth portion614, a fifth portion615, and/or a sixth portion616, and the portions having the inclination angles may correspond to the fifth portion615and the sixth portion616.", "", "A third bolt675corresponding to a second fastening member may be inserted into one portion of one surface of the disc650facing the fifth portion615of the hub610, that is, a second portion653, and the fifth portion615.", "", "A fourth bolt677corresponding to a second fastening member may be inserted into one portion of one surface of the disc650facing the sixth portion616of the hub610, that is, a third portion655, and the sixth portion616.", "", "Then, the second fastening member (the third bolt675and/or the second bolt677) may have an inclination (referred to as a second inclination) with respect to the rotary axis RA. In other words, the second fastening member (the third bolt675and/or the fourth bolt677) may be disposed not parallel to the rotary axis RA.", "", "More specifically, the end portion of the hub610disposed in one direction L may include the first portion611extending around the rotary axis RA in a first direction U perpendicular to the rotary axis RA and a second direction D opposite to the first direction U.", "", "In addition, the end portion of the hub610disposed in one direction L may include the second portion612extending from the first portion611at a predetermined first inclination angle and the third portion613extending from the first portion611at a predetermined second inclination angle.", "", "The predetermined first inclination angle may be an angle greater than 90 degrees, and the second inclination angle may be an angle greater than 180 degrees.", "", "The rim630may include a first portion631extending around the rotary axis RA in the first direction U and the second direction D which are perpendicular the rotary axis RA. In addition, the rim630may include a second portion633extending from the first portion631at a predetermined third inclination angle, and a third portion635extending from the first portion631at a predetermined fourth inclination angle.", "", "The predetermined third inclination angle may be an angle greater than 90 degrees, and the fourth inclination angle may be an angle greater than 180 degrees. For example, the third inclination angle may be the same as the first inclination angle, and the fourth inclination angle may be the same as the second inclination angle.", "", "The first portion611of the hub610may be formed to have a length greater than a length of the first portion631of the rim630, and a first axial direction outer end portion621of the hub610may be in contact with one surface of the first portion631of the rim630. Accordingly, an empty region having a predetermined gap may be formed between the second portion612of the hub610and the second portion633of the rim630. In addition, an empty region having a predetermined gap may be formed between the third portion613of the hub610and the third portion635of the rim630.", "", "Through holes through which the first bolt671may pass may be formed in the second portion633of the rim630and the second portion612of the hub610, respectively. For example, the through holes of the second portion633of the rim630and the second portion612of the hub610may be formed to be straightly colinear with each other to be perpendicular to a longitudinal direction of each of the second portion633and the second portion612.", "", "The bolt671may be inserted into the through holes of the second portion633of the rim630and the second portion612of the hub610to couple the rim630and the hub610.", "", "Through holes through which the second bolt673may pass may be formed in the third portion635of the rim630and the third portion613of the hub610, respectively. For example, the through holes of the third portion635of the rim630and the third portion613of the hub610may be formed to be straightly colinear with each other to be perpendicular to a longitudinal direction of each of the third portion635and the third portion613.", "", "The second bolt673may be inserted into the through holes of the third portion635of the rim630and the third portion613of the hub610to couple the rim630and the hub610.", "", "According to a coupling structure of the hub610and the rim630described above, it may be seen that each of the bolts671and673has a predetermined angle (or, referred to as a predetermined inclination) with respect to the rotary axis RA.", "", "Accordingly, when compared to the conventional hub and rim coupling structure as illustrated inFIG.4, a distance between the bolts671and673, that is, a bolt circle diameter61, becomes larger, and thus a torsional stiffness of the rim630can increase.", "", "In addition, the end portion of the hub610disposed in the other direction R opposite to the end portion in one direction L may include the fourth portion614extending around the rotary axis RA in the first direction U and the second direction D which are perpendicular to the rotary axis RA.", "", "In addition, the end portion of the hub610disposed in the other direction R may include the fifth portion615extending from the fourth portion614at a predetermined fifth inclination angle and the fifth portion615extending from the fourth portion614at a predetermined sixth inclination angle.", "", "The predetermined fifth inclination angle may be an angle greater than 90 degrees, and the sixth inclination angle may be an angle greater than 180 degrees.", "", "The disc650may include a first portion651extending around the rotary axis RA in the first direction U perpendicular to the rotary axis RA and the second direction D opposite the first direction U. In addition, the disc650may include a second portion653extending from the first portion651at a predetermined seventh inclination angle and a third portion655extending from the first portion651at a predetermined eighth inclination angle.", "", "The predetermined seventh inclination angle may be an angle greater than 90 degrees, and the eighth inclination angle may be an angle greater than 180 degrees. For example, the seventh inclination angle may be the same as the fifth inclination angle, and the eighth inclination angle may be the same as the sixth inclination angle.", "", "The fourth portion614of the hub610may be formed to have a length smaller than a length of the first portion651of the disc650, and a second axial direction outer end portion624of the hub610may be in contact with one surface of the first portion651of the disc650. Accordingly, an empty region having a predetermined gap may be formed between the fifth portion615of the hub610and the second portion653of the rim630. In addition, an empty region having a predetermined gap may be formed between the sixth portion616of the hub610and the third portion655of the disc650.", "", "Through holes through which the third bolt675may pass may be formed in the second portion653of the disc650and the fifth portion615of the hub610, respectively. For example, through holes of the second portion653of the disc650and the fifth portion615of the hub610may be formed to be straightly colinear with each other to be perpendicular to a longitudinal direction of each of the second portion653and the fifth portion615.", "", "The third bolt675may be inserted into the through hole of the second portion653of the disc650of the rim630and the through holes of the fifth portion615of the hub610to couple the disc650and the hub610.", "", "Through holes through which one fourth bolt677may pass may be formed in the third portion655of the disc650and the sixth portion616of the hub610. For example, the through holes of the third portion655of the disc650and the sixth portion616of the hub610may be formed to be colinear with each other to be perpendicular to a longitudinal direction of each of the third portion655and the sixth portion616.", "", "The fourth bolt677may be inserted into the through holes of the third portion655of the disc650and the sixth portion616of the hub610to couple the rim630and the disc650.", "", "According to the coupling structure of the hub610and the disc650described above, it may be seen that each of the bolt675and677has a predetermined angle (or, referred to as a predetermined inclination) with respect to the rotary axis RA.", "", "Accordingly, when compared to the conventional hub and disc coupling structure as illustrated inFIG.5, a distance between the bolts675and677, that is, a bolt circle diameter63, becomes larger, and thus a torsional stiffness of the disc650can increase.", "", "FIG.7is a schematic cross-sectional view illustrating the conventional assembly structure of the rim and the disc.", "", "Referring toFIG.7, in the conventional structure, one surface of the rim710and one surface of the disc730are in contact with each other and coupled to each other using a bolt750. For example, conventionally, through holes are formed to be straightly colinear with each other to be perpendicular to one surface of the rim710and one surface of the disc730, and the bolt750is inserted into the through holes to couple the rim710and the disc730.", "", "According to a coupling structure ofFIG.7, a first distance Ds from any one portion of a lower end of one surface of the rim710and one surface of the disc730to a head center of the bolt750and a second distance De from the any one portion of the lower end of one surface of the rim710and one surface of the disc730to a center of a body of the bolt750are the same. Accordingly, a vehicle having the corresponding structure has a problem that low-frequency noise is generated during travel.", "", "In order to suppress and/or eliminate the low-frequency noise generated according to the coupling structure as illustrated inFIG.7, an embodiment of the present disclosure proposes to change a structure of portion71ofFIG.7so that a first distance Ds and a second distance De should be different as illustrated inFIG.8.", "", "FIG.8is a schematic cross-sectional view illustrating an assembly structure of a rim and a disc according to one embodiment.", "", "Referring toFIG.8, a rim810may include a first portion811extending in a vertical direction U of a coordinate system, a second portion813extending from the first portion811at a predetermined first inclination angle, and a third portion815extending from the second portion813at a predetermined second inclination angle.", "", "For example, the predetermined first inclination angle may be an angle greater than 90 degrees and may be smaller than the predetermined second inclination angle.", "", "In addition, the disc830may include a first portion831extending in the vertical direction U of the coordinate system, a second portion833extending from the first portion831at a predetermined third inclination angle, and a third portion835extending from the second portion833at a predetermined fourth inclination angle.", "", "For example, the predetermined third inclination angle may be the same angle as the predetermined first inclination angle and may be greater than the predetermined fourth inclination angle.", "", "One surface of the first portion811of the rim810and one surface of the first portion831of the disc830may be in contact with each other, and one surface of the second portion813of the rim810and one surface of the second portion833of the disc830may be in contact with each other. In addition, the third portion815of the rim810and the third portion835of the disc830may not be in contact with each other.", "", "Through holes may be formed in the second portion813of the rim810and the second portion833of the disc830. For example, the through holes of the second portion813of the rim810and the second portion813of the disc830may be formed to be straightly colinear with each other to be perpendicular to a longitudinal direction of each of the second portion813and the second portion813.", "", "A fastening member850(for example, a bolt) may be inserted into the through holes to couple the second portion813of the rim810and the second portion813of the disc830using the fastening member850.", "", "According to the new coupling structure ofFIG.8, it may be seen that a second distance De from any one portion of a lower end of one surface of the rim810and one surface of the disc830to a center of a body of the fastening member850is greater than a first distance Ds from the any one portion of the lower end of one surface of the rim810and one surface of the disc830to a head center of the fastening member850. This increases a torsional stiffness of the rim810and/or the disc830compared to the conventional coupling structure of the rim710and disc730as illustrated inFIG.7, and thus there is an advantage of minimizing or eliminating low-frequency noise.", "", "According to one aspect of the disclosed disclosure, an assembly for a vehicle driving device can suppress and/or eliminate low-frequency noise generated during travel of a vehicle.", "", "For example, the assembly for a vehicle driving device according to one aspect of the disclosed disclosure can provide a new assembly capable of minimizing low-frequency noise generated from the assembly of a hub of a conventional axle, a disc of a brake device, and a wheel.", "", "The disclosed embodiments have been described with reference to the accompanying drawings as described above. It may be understood by those skilled in the art that the disclosure may be performed in other concrete forms without changing the technological scope and essential features. The disclosed embodiments are exemplary and should not be interpreted as purposes of limitation."], "claims": ["a hub configured to rotate about a rotary axis; and one or more first fastening members configured to couple the hub and a rim of a wheel for a vehicle, wherein one end portion of the hub includes a first facing surface facing one surface of the rim, wherein the first facing surface includes a portion having an inclination angle with respect to the rotary axis, and the first fastening member is inserted into one portion of the one surface of the rim facing the portion having the inclination angle of the first facing surface and the portion having the inclination angle of the first facing surface in a perpendicular direction to couple the hub and the rim.", "the inclination angle includes a first inclination angle; and the one end portion of the hub includes a first portion extending in a first direction perpendicular to the rotary axis and a second portion extending from the first portion in the first direction at the first inclination angle.", "the first fastening member includes a first bolt; and the first bolt is inserted into one portion of the one surface of the rim facing the second portion and the second portion in a perpendicular direction to couple to the hub and the rim.", "the inclination angle includes a second inclination angle; the first portion further includes a portion extending in a second direction opposite to the first direction; and the one end portion of the hub includes a third portion extending from the first portion in the second direction at the second inclination angle.", "the first fastening member includes a second bolt; and the second bolt is inserted into one portion of one surface of the rim facing the third portion and the third portion in a perpendicular direction to couple the hub and the rim.", "wherein the other end portion of the hub includes a second facing surface facing one surface of the disc, the second facing surface includes a portion having an inclination angle with respect to the rotary axis, and the second fastening member is inserted into one portion of the one surface of the disc facing the portion having the inclination angle of the second facing surface and the portion having the inclination angle of the second facing surface to couple the hub and the disc.", "the inclination angle of the second facing surface includes a first inclination angle; and the other end portion of the hub includes a fourth portion extending in a first direction perpendicular to the rotary axis and a fifth portion extending from the fourth portion in the first direction at the first inclination angle.", "the second fastening member includes a third bolt; and the third bolt is inserted into one portion of the disc facing the fifth portion and the fifth portion in a perpendicular direction to couple the disc and the rim.", "the inclination angle includes a second inclination angle; the fourth portion further includes a portion extending in a second direction opposite to the first direction; and the other end portion of the hub includes a sixth portion extending from the fourth portion in the second direction at the second inclination angle.", "the second fastening member includes a fourth bolt; and the fourth bolt is inserted into one portion of the one surface of the disc facing the sixth portion and the sixth portion in a perpendicular direction to couple the disc and the rim.", "a hub configured to rotate about a rotary axis; a wheel coupled to one end portion of the hub; and one or more first fastening members, wherein the one end portion of the hub includes a first facing surface facing one surface of a rim, and the first fastening member is inserted into one portion of the one surface of the rim and one portion of the first facing surface to couple the hub and the rim and has a first inclination with respect to the rotary axis.", "the first facing surface includes a portion having an inclination angle with respect to the rotary axis; and the first fastening member is inserted into the one portion of the one surface of the rim facing the portion having the inclination angle of the first facing surface and the portion having the inclination angle of the first facing surface and has the first inclination.", "the inclination angle includes a first inclination angle; and the one end portion of the hub includes a first portion extending in a first direction perpendicular to the rotary axis and a second portion extending from the first portion in the first direction at the first inclination angle.", "the inclination angle includes a second inclination angle; the first portion further includes a portion extending in a second direction opposite to the first direction; and the one end portion of the hub includes a third portion extending from the first portion in the second direction at the second inclination angle.", "the first fastening members include a first bolt and a second bolt; the first bolt is inserted into the one portion of one surface of the rim facing the second portion and the second portion in a perpendicular direction; and the second bolt is inserted into in one portion of the one surface of the rim facing the third portion and the third portion in a perpendicular direction.", "one or more second fastening members, wherein the other end portion of the hub includes a second facing surface facing one surface of the disc, and the second fastening member is inserted into one portion of the one surface of the disc and one portion of the second facing surface to couple the hub and the disc and has a second inclination with respect to the rotary axis.", "the second facing surface includes a portion having an inclination angle with respect to the rotary axis; and the second fastening member is inserted into the one portion of the one surface of the disc facing the portion having the inclination angle of the second facing surface and the portion having the inclination angle in a perpendicular direction to have the second inclination angle.", "the inclination angle of the second facing surface includes a first inclination angle; and the other end portion of the hub includes a fourth portion extending in a first direction perpendicular to the rotary axis and a fifth portion extending from the fourth portion in the first direction at the first inclination angle.", "the inclination angle includes a second inclination angle; the fourth portion further includes a portion extending to in a second direction opposite to the first direction; and the other end portion of the hub includes a sixth portion extending from the fourth portion in the second direction at the second inclination angle.", "the second fastening members include a third bolt and a fourth bolt; the third bolt is inserted into one portion of the one surface of the disc facing the fifth portion and the fifth portion in a perpendicular direction; and the fourth bolt is inserted into one portion of the one surface of the disc facing the sixth portion and the sixth portion in a perpendicular direction to couple the disc and the rim, and wherein:materials of the first bolt, the second bolt, the third bolt, and the fourth bolt are different from a material of the rim."], "bibtex": "@patent{20240408912,\n    title = {ASSEMBLY FOR VEHICLE DRIVING DEVICE},\n    number = {20240408912},\n    year = {2024},\n    note = {File: US20240408912A1-20241212.XML}\n    }", "classification": "B60B2700FI"}, {"title": "WHEEL BEARING ARRANGEMENT AND METHOD FOR MOUNTING SUCH A WHEEL BEARING ARRANGEMENT", "doc_number": "20240408913", "filename": "US20240408913A1-20241212.XML", "abstract": "A wheel bearing arrangement, preferably for a motor vehicle, with a cardan shaft, a wheel hub, a screw with a screw head, and a pretensioning element. The wheel hub is connected to the cardan shaft by the screw. The pretensioning element is arranged and/or braced between the screw head, preferably a head underside of the screw head, and the wheel hub.", "detailed_description": ["FIG.1shows a wheel bearing arrangement1for a motor vehicle (not shown), preferably for a passenger car, in a final mounted state. The wheel bearing arrangement1has a, preferably forged, wheel hub3, a cardan shaft5, a pretensioning element7and a screw9with a longitudinal screw axis A. The positive longitudinal screw axis direction is marked with an arrowhead inFIG.1. The positive longitudinal screw axis direction corresponds to the screw-in direction of the screw9.", "", "The wheel hub3has a wheel hub spur toothing11on the cardan shaft side and the cardan shaft5has a cardan shaft spur toothing13on the wheel hub side. The wheel hub spur toothing11and the cardan shaft spur toothing13correspond to each other and are in meshing engagement with each other in the final mounted state of the wheel bearing arrangement1. In the final mounted state of the wheel bearing arrangement1, the wheel hub3and the cardan shaft5are positively connected to each other via the wheel hub spur toothing11and the cardan shaft spur toothing13.", "", "The screw9has an external thread14, with which the screw9is screwed into an internal thread10of the cardan shaft5in the final mounted state of the wheel bearing arrangement1and turned tight and/or tightened with a predefined tightening torque. In the final mounted state of the wheel bearing arrangement1, the wheel hub3is non-positively connected and/or braced to the cardan shaft5by means of the screw9. In the final mounted state, there is both a non-positive and a positive connection between the wheel hub3and the cardan shaft5, so that even large torques can be transmitted from the cardan shaft5to the wheel hub3and vice versa. In other words, the connection between the cardan shaft5and the wheel hub3is made up of at least two types of connection, namely on the one hand by the positive connection via the spur toothing11and13and on the other hand—with the wheel hub3and the pretensioning element7in between-via the force-fit connection between the screw9and the cardan shaft5.", "", "The pretensioning element7is interposed between an underside15of a screw head17of the screw9and a centering contour19of the wheel hub3. The pretensioning element7lies radially on the outside of the centering contour19, so that the pretensioning element7is centered relative to the wheel hub3in the final mounted state of the wheel bearing arrangement1and is arranged concentrically to it.", "", "In the illustrated embodiment, the pretensioning element7is made of a thin deep-drawn sheet of stainless spring steel, merely as an example. At this point, it should be explicitly pointed out that the pretensioning element7can alternatively also be made of other materials, such as plastic. It also does not necessarily have to be a metal sheet made of stainless steel and/or spring steel.", "", "As shown inFIGS.5to7, the pretensioning element7is formed by a composite body that is formed in one piece and of one material. The body has a resilient spring portion21, a base portion23, a substantially cone-shaped cone portion25, a sleeve portion27and a fold portion29. The sleeve portion27has the shape of a straight and circular hollow cylinder. The sleeve portion27is thin-walled and radially outwards defines a receiving space for the screw head17.", "", "An outer circumferential surface of the sleeve portion27forms a centering surface on which a wheel rim (not shown) of a vehicle wheel can be pushed onto and/or centered with respect to the wheel hub, preferably with a positive fit and/or a precise fit. The wheel rim is centered and/or concentrically aligned to the wheel hub via the centering surface. In the wheel mounting arrangement1shown, the wheel and/or rim is therefore not centered via the wheel hub3itself, but by means of a separate component, namely the pretensioning element7, specifically by means of the outer circumferential surface of the sleeve portion27of the pretensioning element7.", "", "On its side facing away from the wheel hub3, the sleeve portion27merges directly into the fold portion29. In the fold portion29, the deep-drawn sheet is folded radially inwards and in the direction of the wheel hub3, forming a sheet fold, specifically a parallel open sheet fold. The sheet metal wrap contributes to the mechanical stability of the pretensioning element7. Preferably slot-shaped recesses can be provided in the area of the sleeve portion27and/or the fold portion29, through which water can run off, which can collect radially on the inside of the sleeve portion27and/or the fold portion29. The recesses are shown inFIGS.5to7.", "", "The sleeve portion27merges directly into the cone portion25on the wheel hub side. In the cone portion25, the pretensioning element7tapers, starting from the sleeve portion27and in the direction of the wheel hub3up to the base portion23, into which base portion23the cone portion25merges directly. On the outer circumference, the cone portion25is in direct contact with the centering contour19of the wheel hub3, by way of example only.", "", "The base portion23has the shape of a perforated disk, which delimits a circular passage arranged centrally to the perforated disk in a radially outward direction. The base portion23is, preferably directly, in contact with the centering contour19of the wheel hub3. The base portion23merges directly into the spring portion21. In the embodiment shown, the spring portion21is formed by several spring tabs33, as shown inFIGS.5to7, merely as an example. The spring tabs33each extend from the base portion23with their free end radially inwards, i.e., in the direction of the passage, and additionally in the direction of the underside of the head15. The spring tabs33are spaced apart from one another by slot-shaped recesses35, as shown inFIGS.5to7.", "", "The spring tabs33delimit a pretensioning element passage associated with the pretensioning element7radially outwards and lie directly against the underside of the head15. In the final mounted state of the wheel bearing arrangement1, the spring plates33are braced under mechanical pretensioning between the base portion23and the underside of the head15. The spring tabs33are supported via the base portion23on the centering contour19of the wheel hub3and exert an axial force on the underside of the head15, preferably in relation to the longitudinal screw axis A, during assembly and/or installation of the wheel bearing arrangement, against the positive longitudinal screw axis direction and thus against the screw-in direction of the screw9. The axial force also acts on the cardan shaft5in such a way that the cardan shaft5is pressed against the wheel hub3under the effect of the axial force when the screw9is partially or fully screwed in. This means that once the spur toothing11and13have been brought into meshing engagement during mounting, the spur toothing11and13are pressed against each other under the effect of the axial force and held in meshing engagement.", "", "The spring tabs33are very mildly attached to the base portion23. Thus, when screwing in and/or tightening the screw9, it can be achieved that only or almost exclusively only the spring tabs33deform elastically, with the other portions of the pretensioning element7remaining undeformed. In particular, the sleeve portion27should neither change its position nor its orientation when the screw9is screwed in and/or tightened. This behavior is also favored in particular by the provision of the slot-shaped recesses35. Of course, in addition or as an alternative to the slot-shaped recesses35, a material jump and/or a cross-sectional jump can also be provided in order to achieve the described isolated deformation of the spring tabs33.", "", "The wheel bearing arrangement1has an entrainment means which, in the embodiment shown, is associated with the screw9, only by way of example. The entrainment means is formed by a screw locking lacquer37, only by way of example, which is applied to the external thread14of the screw9. The thread friction between the external thread14and the internal thread10is increased by the entrainment means, specifically by the screw locking lacquer37. As a result, a frictional force builds up between the external thread14and the internal thread10when the screw9is screwed in and the internal thread10comes into contact with the screw locking lacquer37, which causes the cardan shaft5to rotate together with the screw9from this point onwards. The entrainment means is arranged on the external thread14in such a way that the cardan shaft5only rotates with the screw9when the tooth tips of the cardan shaft spur toothing lie in a common plane with the tooth tips of the wheel hub spur toothing and/or when the tooth tips of the cardan shaft spur toothing project at least partially into the tooth gaps of the wheel hub spur toothing.", "", "The cardan shaft5thus rotates with the screw9under the simultaneous effect of the axial force until the cardan shaft spur toothing13engages with the wheel hub spur toothing11. As described above, the axial force then holds the cardan shaft spur toothing13in meshing engagement with the wheel hub spur toothing11.", "", "After the cardan shaft spur toothing13has meshed with the wheel hub spur toothing11, the frictional force is overcome when the screw9is screwed in further and the screw9is tightened with the predefined tightening torque in the internal thread10without the cardan shaft5rotating with the screw9. Once established, the meshing between the cardan shaft spur toothing13and the wheel hub spur toothing11thus remains reliable throughout the entire assembly process of the wheel bearing arrangement1.", "", "As an alternative to the screw locking lacquer37, any other measure can also be used and form the entrainment means which builds up such a high frictional force between the external thread14of the screw9and the internal thread10of the cardan shaft5that the cardan shaft5rotates together with the screw9until the spur toothing11and13are in meshing engagement for the first time and/or come into meshing engagement for the first time. For example, an outer diameter of the external thread14can be slightly larger than an inner diameter of the internal thread. For example, the external thread14and the internal thread10can also form a correspondingly dimensioned fit and/or mating fit. For example, the external thread14and the internal thread10can also have different thread pitches. This means that the thread pitch of the external thread14deviates from the thread pitch of the internal thread10by a pitch deviation of, for example, 0.01 mm. The screw locking lacquer37thus represents only one of many examples, in particular examples of a coating, in order to enable and/or promote the build-up of a correspondingly high frictional force between the external thread14and the internal thread10when screwing in the screw9. To put it another way: the entrainment means, however it is specifically designed, is such that the screw9can only be screwed into the internal thread10of the cardan shaft5with difficulty in some portions—i.e., with high thread friction.", "", "The entrainment means, specifically the screw locking lacquer37, are spaced at least far enough away from a screw tip of the screw9in the negative longitudinal axis direction of the screw so that the high frictional force only builds up as soon as there is contact between the end spur toothing11and13. This prevents the cardan shaft5from rotating out together with the screw9beyond the nearest tooth-on-gap position when it is turned in.", "", "The wheel hub3has a wheel flange39to which the vehicle wheel (not shown) is attached. In addition, the wheel hub3is assigned a wheel hub passage, which is limited radially outwards by the wheel hub3and through which the screw9extends.", "", "A method for mounting the wheel bearing arrangement1is described in detail below with reference toFIGS.1to4.", "", "The method has a preparation step (seeFIG.2), a pre-assembly step (FIG.3) and a final mounting step (seeFIG.4). The preparation step is carried out before the pre-assembly step. The pre-assembly step is carried out before the final mounting step.", "", "In the preparation step, the cardan shaft5, the wheel hub3, the pretensioning element7and the screw9are prepared. In addition, the screw9is guided with its shaft through the pretensioning element passage and through the wheel hub passage, as shown inFIG.2. The spring tabs33are mechanically relaxed and initially lie force-free against the underside of the head15. The base portion23and the cone portion25of the pretensioning element7are initially in force-free contact with the centering contour19. The external thread14of the screw9is still out of threaded engagement with the internal thread10of the cardan shaft5. The spur toothing11and13are not yet in contact. The screw9, the pretensioning element7and the wheel hub3form a preassembled assembly after completion of the preparation step.", "", "The pre-assembly step is then carried out, as shown inFIG.3. In the pre-assembly step, the preassembled assembly and the cardan shaft5are guided towards each other and the screw9is screwed into the internal thread10of the cardan shaft5until the external thread14of the screw9and the internal thread10of the cardan shaft5are in at least slight threaded engagement. After completion of the pre-assembly step, the spur toothing11and13are still out of meshing engagement. The screw locking lacquer37is still outside the internal thread10of the cardan shaft5and the spring tabs33are still in force-free contact with the underside of the head15.", "", "After completion of the pre-assembly step, the final mounting step is carried out, as illustrated inFIG.4. In the final mounting step, the screw9is first screwed further into the internal thread10of the steering shaft5. As the screw9is further screwed into the internal thread10of the cardan shaft5, the axial distance between the underside of the head15and the cardan shaft5is shortened in relation to and/or parallel to the longitudinal axis of the screw A. As a result of the shortening of the axial distance, the spur toothing11and13come into contact when the screw9is screwed in. The contact can be formed by the spur toothing11and13touching each other in a tooth-on-tooth position or being in a tooth-on-gap position.", "", "If the spur toothing11and13touch in a tooth-on-tooth position, the axial distance between the underside of the head15and the cardan shaft5is further reduced, whereby the spring tabs33between the underside of the head15on the one hand and the base portion23and/or the centering contour19on the other hand are elastically prestressed, building up the axial force. This axial force also acts on the face toothing11and13and presses them against each other in the tooth-on-tooth position.", "", "If the screw locking lacquer37now reaches the internal thread10during further screwing in and is screwed into it, a high frictional force builds up, preferably abruptly, between the screw9and the internal thread10of the cardan shaft5. Due to the high frictional force, the cardan shaft5is rotated together with the screw9as the screw9is screwed in further. Since the axial force also acts on the underside of the head15, the cardan shaft5rotates together with the screw9from the tooth-on-tooth position to the nearest and/or adjacent tooth-on-gap position. This causes the teeth of the cardan shaft spur toothing13to slip into the tooth gaps of the wheel hub spur toothing11, with only a slight and intermediate reduction in the axial force. If the screw9is then screwed in further, the teeth of the cardan shaft spur toothing13are supported in the circumferential direction on tooth flanks of the teeth of the wheel hub spur toothing11, so that the screw9can continue to be screwed in even under the effect of the high frictional force without the spur toothing11and13leaving the tooth-on-gap position and/or the cardan shaft5continuing to rotate with the screw9. When the screw9is further screwed in under the effect of the high frictional force, the axial force increases again and the tooth-on-gap position is also maintained when the screw9is further screwed in, namely until the screw9is screwed into the internal thread10with the predefined tightening torque and the final mounted state of the wheel bearing arrangement1is reached. In the final mounted state of the wheel bearing arrangement9, the underside of the head15lies flat on the base portion23.", "", "It is of course also conceivable that the spur toothing11and13do not happen to be in the tooth-on-tooth position at any time during the final mounting step. In this case, the teeth of the cardan shaft spur toothing13are immediately supported in the circumferential direction on the tooth flanks of the teeth of the wheel hub spur toothing11when the screw9is screwed in and the screw9can be screwed in under the effect of the high frictional force without the spur toothing11and13leaving the tooth-on-tooth position. Furthermore, in this case there is no temporary, slight reduction in the axial force and the screw9can be screwed into the internal thread10with the predefined tightening torque and the final mounted state of the wheel bearing arrangement1(seeFIG.1) can be achieved."], "claims": ["a cardan shaft, a wheel hub, a screw with a screw head, and a pretensioning element, wherein the wheel hub is connected to the cardan shaft by the screw, wherein the pretensioning element is arranged and/or braced between the screw head, preferably a head underside of the screw head, and the wheel hub.", "and/or the cardan shaft has a cardan shaft spur toothing which is in meshing engagement with a wheel hub spur toothing of the wheel hub.", "3 . The wheel bearing arrangement according to claim 1 , wherein the pretensioning element, preferably a spring portion of the pretensioning element, is supported on the wheel hub, preferably on a centering contour of the wheel hub, and exerts an axial force on the screw head, preferably on a head underside of the screw head, during assembly and/or mounting of the wheel bearing arrangement, wherein it is preferably provided that the pretensioning element exerts the axial force, preferably in relation to a longitudinal screw axis of the screw, against a screw-in direction of the screw.", "4 . The wheel bearing arrangement according to claim 1 , wherein the pretensioning element has a sleeve portion, and the sleeve portion, preferably an outer circumferential surface of the sleeve portion, forms a wheel centering surface for a vehicle wheel, preferably for a rim of a vehicle wheel, and/or a brake disc.", "5 . The wheel bearing arrangement according to claim 1 , wherein the spring portion is formed by spring tabs, which are arranged distributed in the circumferential direction around a pretensioning element passage and are spaced apart from one another with interposition of slot-shaped recesses.", "6 . The wheel bearing arrangement according to claim 1 , wherein the pretensioning element has a base portion and a, preferably conical, cone portion, and the base portion and/or the cone portion and/or the sleeve portion are in abutment connection with the wheel hub, preferably with a centering contour of the wheel hub.", "7 . The wheel bearing arrangement according to claim 1 , wherein the wheel bearing arrangement has an entrainment means and/or an entrainment means is assigned to the wheel bearing arrangement, wherein it is preferably provided that the entrainment means causes a thread friction between an external thread of the screw and an internal thread of the cardan shaft to increase with respect to an external thread of the screw, at least in portions.", "and/or the entrainment means is formed in that a diameter of the external thread, preferably a core diameter, external diameter and/or pitch diameter of the external thread, is larger than a diameter of the internal thread, preferably a core diameter, external diameter and/or pitch diameter of the internal thread, and/or the entrainment means is formed in that a thread pitch of an external thread of the screw deviates by a pitch deviation from a thread pitch of the internal thread of the cardan shaft.", "9 . A vehicle with a wheel bearing arrangement according to claim 1 .", "a preparation step, in which the cardan shaft, the wheel hub, the pretensioning element and the screw are provided, a pre-assembly step, in which the wheel hub and the cardan shaft are guided towards each other and/or brought closer together, and in which the screw is partially screwed into the internal thread of the cardan shaft, and a final mounting step in which the screw is screwed further into the internal thread and tightened with a predefined tightening torque, wherein the pretensioning element is arranged and/or braced between the screw head, preferably a head underside of the screw head, and the wheel hub.", "11 . The wheel bearing arrangement according to claim 2 , wherein the pretensioning element, preferably a spring portion of the pretensioning element, is supported on the wheel hub, preferably on a centering contour of the wheel hub, and exerts an axial force on the screw head, preferably on a head underside of the screw head, during assembly and/or mounting of the wheel bearing arrangement, wherein it is preferably provided that the pretensioning element exerts the axial force, preferably in relation to a longitudinal screw axis of the screw, against a screw-in direction of the screw.", "12 . The wheel bearing arrangement according to claim 2 , wherein the pretensioning element has a sleeve portion, and the sleeve portion, preferably an outer circumferential surface of the sleeve portion, forms a wheel centering surface for a vehicle wheel, preferably for a rim of a vehicle wheel, and/or a brake disc.", "13 . The wheel bearing arrangement according to claim 3 , wherein the pretensioning element has a sleeve portion, and the sleeve portion, preferably an outer circumferential surface of the sleeve portion, forms a wheel centering surface for a vehicle wheel, preferably for a rim of a vehicle wheel, and/or a brake disc.", "14 . The wheel bearing arrangement according to claim 2 , wherein the spring portion is formed by spring tabs, which are arranged distributed in the circumferential direction around a pretensioning element passage and are spaced apart from one another with interposition of slot-shaped recesses.", "15 . The wheel bearing arrangement according to claim 3 , wherein the spring portion is formed by spring tabs, which are arranged distributed in the circumferential direction around a pretensioning element passage and are spaced apart from one another with interposition of slot-shaped recesses.", "16 . The wheel bearing arrangement according to claim 4 , wherein the spring portion is formed by spring tabs, which are arranged distributed in the circumferential direction around a pretensioning element passage and are spaced apart from one another with interposition of slot-shaped recesses.", "17 . The wheel bearing arrangement according to claim 2 , wherein the pretensioning element has a base portion and a, preferably conical, cone portion, and the base portion and/or the cone portion and/or the sleeve portion are in abutment connection with the wheel hub, preferably with a centering contour of the wheel hub.", "18 . The wheel bearing arrangement according to claim 3 , wherein the pretensioning element has a base portion and a, preferably conical, cone portion, and the base portion and/or the cone portion and/or the sleeve portion are in abutment connection with the wheel hub, preferably with a centering contour of the wheel hub.", "19 . The wheel bearing arrangement according to claim 4 , wherein the pretensioning element has a base portion and a, preferably conical, cone portion, and the base portion and/or the cone portion and/or the sleeve portion are in abutment connection with the wheel hub, preferably with a centering contour of the wheel hub.", "20 . The wheel bearing arrangement according to claim 5 , wherein the pretensioning element has a base portion and a, preferably conical, cone portion, and the base portion and/or the cone portion and/or the sleeve portion are in abutment connection with the wheel hub, preferably with a centering contour of the wheel hub."], "bibtex": "@patent{20240408913,\n    title = {WHEEL BEARING ARRANGEMENT AND METHOD FOR MOUNTING SUCH A WHEEL BEARING ARRANGEMENT},\n    number = {20240408913},\n    year = {2024},\n    note = {File: US20240408913A1-20241212.XML}\n    }", "classification": "B60B2706FI"}, {"title": "UNIVERSAL WHEEL", "doc_number": "20240408914", "filename": "US20240408914A1-20241212.XML", "abstract": "The invention discloses a universal wheel including a support base, the support base including a top portion connected with a steering assembly that enables 360° rotation of the universal wheel, and a rolling assembly, the rolling assembly including an axle and a roller rotatably connected to the axle. A coordinate system is constructed with a center of the roller as an origin, a traveling direction of the roller as a negative direction of an abscissa, and a direction perpendicular to the abscissa and extending upward as a positive direction of an ordinate, the support base has a chute located in a first quadrant, and the axle is slidably connected to the chute along a radial direction of the roller. This apparatus has good shock absorbing performance and a strong obstacle-crossing ability.", "detailed_description": [""], "claims": ["a support base, the support base including a top portion connected with a steering assembly that enables 360° rotation of the universal wheel; a rolling assembly, the rolling assembly including an axle and a roller rotatably connected to the axle, a coordinate system being constructed with a center of the roller as an origin, a traveling direction of the roller as a negative direction of an abscissa, and a direction perpendicular to the abscissa and extending upward as a positive direction of an ordinate, the support base having a chute located in a first quadrant, and the axle being slidably connected to the chute along a radial direction of the roller; and a shock-absorbing assembly, the shock-absorbing assembly including a damped stretchable element having a lower end connected to the axle and an upper end connected to the support base, a component force of a force applied by the stretchable element on the axle, which is applied to the axle along a moving direction of the axle, being defined as a first component force, a component force of a maximum bearable load force of the axle, which is applied to the axle along the moving direction of the axle, being defined as a second component force, and the first component force being greater than the second component force to force the axle to always be located at a bottom end of the chute without an external force.", "2 . The universal wheel according to claim 1 , wherein a direction of the force is parallel to the moving direction of the axle.", "3 . The universal wheel according to claim 1 , wherein the stretchable element is a spring, a gas spring or a hydraulic rod.", "4 . The universal wheel according to claim 3 , wherein the support base includes a fixed plate connected to an upper end of the stretchable element.", "5 . The universal wheel according to claim 4 , wherein when the stretchable element is a spring, the fixed plate has a through hole in which a support rod is slidably connected, a lower end of the support rod is fixedly connected to the axle, and the spring is fitted onto the support rod and located between the axle and the fixed plate.", "6 . The universal wheel according to claim 5 , wherein an upper end of the support rod includes a nut that prevents the support rod from being separated from the through hole.", "7 . The universal wheel according to claim 5 , wherein the fixed plate is perpendicular to the support rod.", "8 . The universal wheel according to claim 1 , wherein the chute is an oblong hole, and a center of a bottom portion of the chute is the origin of the coordinate system.", "9 . The universal wheel according to claim 1 , wherein the support base includes two wing plates, each of the wing plates is provided with a chute, and two ends of the axle are slidably connected to the chutes, respectively."], "bibtex": "@patent{20240408914,\n    title = {UNIVERSAL WHEEL},\n    number = {20240408914},\n    year = {2024},\n    note = {File: US20240408914A1-20241212.XML}\n    }", "classification": "B60B3304FI"}, {"title": "PNEUMATIC RADIAL TIRE FOR PASSENGER VEHICLES", "doc_number": "20240408915", "filename": "US20240408915A1-20241212.XML", "abstract": "A pneumatic radial tire for passenger vehicles that satisfies a defined relationship between sectional width SW and outer diameter OD of the tire, and includes only one circumferential main groove extending in a tire circumferential direction on a tread contact surface, the circumferential main groove being provided to a half portion of the tire on a vehicle-mounted outward side, which is one side of the tire in a tread width direction with a tire equatorial plane as a boundary. A drop height (or ground contact length relationship, or tread gauge relationship) is also defined.", "detailed_description": ["Hereinafter, embodiments of the present disclosure are illustratively described in detail, with reference to the drawings.", "", "FIG.1is a schematic diagram illustrating sectional width SW and outer diameter OD of a tire.", "", "The pneumatic radial tire for passenger vehicles (hereinafter also referred to simply as “tire”) according to an embodiment of the present disclosure has a sectional width SW of less than 165 (mm), and a ratio SW/OD of the sectional width SW to the outer diameter OD of the tire is 0.26 or less, forming a narrow width and large diameter shape. By making the sectional width SW of the tire narrow, relative to the outer diameter OD of the tire, air resistance may be reduced, and by making the outer diameter OD of the tire large, relative to the sectional width SW of the tire, deformation of tread rubber in the vicinity of the contact patch of the tire may be controlled and rolling resistance may be reduced. Accordingly, fuel efficiency of the tire may be improved. The ratio SW/OD is preferably 0.25 or less, and more preferably 0.24 or less.", "", "The ratio above is preferably satisfied when the internal pressure of the tire is 200 kPa or greater, more preferably satisfied when the internal pressure of the tire is 220 kPa or greater, and even more preferably satisfied when the internal pressure of the tire is 280 kPa or greater. This allows rolling resistance to be reduced. On the other hand, the ratio above is preferably satisfied when the internal pressure of the tire is 350 kPa or less. This allows ride comfort to be improved.", "", "Here, the sectional width SW of the tire is preferably 105 mm to 145 mm, and more preferably 115 mm to 135 mm.", "", "Further, an aspect ratio of the tire when the sectional width SW and the outer diameter OD of the tire satisfy the ratio above is preferably 45 to 70, and more preferably 45 to 65.", "", "The tire is not particularly limited to a specific size. Example tire sizes include 105/50R16, 115/50R17, 125/55R20, 125/60R18, 125/65R19, 135/45R21, 135/55R20, 135/60R17, 135/60R18, 135/60R19, 135/65R19, 145/45R21, 145/55R20, 145/60R16, 145/60R17, 145/60R18, 145/60R19, 145/65R19, 155/45R18, 155/45R21, 155/55R18, 155/55R19, 155/55R21, 155/60R17, 155/65R18, 155/70R17, and 155/70R19.", "", "Alternatively, the sectional width SW of the tire is less than 165 mm, and the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the following relational equation:", "", "OD⁢(mm)≥-0.0187×SW⁢(mm)2+9.15×SW⁢(mm)-380", "", "That is, the tire has a narrow width and a large diameter.", "", "Satisfying the relational equation above reduces air resistance and reduces rolling resistance, thereby improving fuel efficiency of the tire.", "", "According to a third aspect, the sectional width SW and the outer diameter OD of the tire, in addition to satisfying the relational equation above, are such that the ratio SW/OD is preferably 0.26 or less, more preferably 0.25 or less, and even more preferably 0.24 or less. This allows fuel efficiency of the tire to be further improved.", "", "The relational equation and/or the ratio are preferably satisfied when the internal pressure of the tire is 200 kPa or greater, more preferably when the internal pressure of the tire is 220 kPa or greater, and even more preferably when the internal pressure of the tire is 280 kPa or greater. This allows rolling resistance to be reduced. On the other hand, the relational equation and/or the ratio are preferably satisfied when the internal pressure of the tire is 350 kPa or less. This allows ride comfort to be improved.", "", "Here, the sectional width SW of the tire is preferably 105 mm to 145 mm, and more preferably 115 mm to 135 mm.", "", "Further, the aspect ratio of the tire when the sectional width SW and the outer diameter OD of the tire satisfy the relational equation above is preferably 45 to 70, and more preferably 45 to 65.", "", "The tire is not particularly limited to a specific size. Example tire sizes include 105/50R16, 115/50R17, 125/55R20, 125/60R18, 125/65R19, 135/45R21, 135/55R20, 135/60R17, 135/60R18, 135/60R19, 135/65R19, 145/45R21, 145/55R20, 145/60R16, 145/60R17, 145/60R18, 145/60R19, 145/65R19, 155/45R18, 155/45R21, 155/55R18, 155/55R19, 155/55R21, 155/60R17, 155/65R18, 155/70R17, and 155/70R19.", "", "The tire according to the present embodiment is a pneumatic radial tire for passenger vehicles. This tire is particularly suitable for use as a tire mounted on a vehicle for personal mobility.", "", "FIG.2is a tire width direction cross-section diagram of the pneumatic radial tire for passenger vehicles according to an embodiment of the present disclosure.FIG.2illustrates a tire width direction cross-section under reference conditions, where the tire is mounted on a rim, filled to a prescribed internal pressure, and unloaded. As illustrated inFIG.2, the tire1includes a carcass3consisting of plies of radially arranged cords toroidally extending between a pair of bead portions2. Further, the tire1includes a belt4consisting of two belt layers4a,4bin the illustrated example, and a tread5, in this order, outward from the carcass3in the tire radial direction.", "", "In this example, a bead core2ais embedded in each of the pair of the bead portions2. According to the present disclosure, a cross-sectional shape and material of the bead core2aare not particularly limited, and may have a structure normally used in a pneumatic radial tire for passenger vehicles. According to the present disclosure, the bead core2amay be divided into a plurality of small bead cores. Alternatively, according to the present disclosure, the structure need not include the bead core2a.", "", "The tire1in the illustrated example includes a bead filler2bthat has an approximately triangular shape in cross-section, disposed outward from the bead core2ain the tire radial direction. The cross-sectional shape of the bead filler2bis not limited to this example, and the material of the bead filler2bis also not particularly limited. Alternatively, the tire may be made lighter by not including the bead filler2b.", "", "According to the present embodiment, the tire1may have a structure that includes a rim guard. Further, according to the present embodiment, the bead portion2may further include an additional member such as a rubber layer, a cord layer, or the like for reinforcement or other purposes. Such an additional member may be provided at various positions with respect to the carcass3and the bead filler2b.", "", "In the example illustrated inFIG.2, the carcass3consists of a single carcass ply. However, according to the present disclosure, the number of carcass plies is not particularly limited and may be two or more. Further, in the example illustrated inFIG.2, the carcass3includes a toroidally extending carcass body portion3athat spans between the pair of the bead portions2and turn-up portions3bthat are turned up from the carcass body portion3aaround the bead cores2a. However, according to the present disclosure, the carcass turn-up portions3bmay be wrapped around the bead cores2a, or may be sandwiched between a number of divided small bead cores. According to the illustrated example, ends3cof the carcass turn-up portions3bare positioned outward in the tire radial direction from an outermost end in the tire radial direction of the bead fillers2band inward in the tire radial direction from a tire maximum width position. This allows reduction of the weight of the tire while maintaining rigidity of the sidewall portion. However, according to the present disclosure, the ends3cof the carcass turn-up portions3bmay be positioned inward in the tire radial direction from the outermost end in the tire radial direction of the bead filler2b, or outward in the tire radial direction from the tire maximum width position. Alternatively, the ends3cof the carcass turn-up portions3bmay be an envelope structure, positioned inward in the tire width direction of ends of the belt4(for example, ends of the belt layer4b) between the carcass body portion3aand the belt4in the tire radial direction. Further, in a case where the carcass3is formed of a plurality of carcass plies, the positions of the ends3cof the carcass turn-up portions3b(for example, in the tire radial position) may be the same or different among the carcass plies. The number of cords in the carcass3is not particularly limited, and may be in a range of 20 cords to 60 cords per 50 mm, for example. Further, a carcass line may adopt various structures. For example, a carcass maximum width position in the tire radial direction may be closer to either the bead portions2or the tread5. For example, the carcass maximum width position may be in a range of 50% to 90% of a tire section height, outward in the tire radial direction from a bead base line. The above term “radially arranged” indicates at least 85° to the tire circumferential direction, preferably 90° to the tire circumferential direction.", "", "The tire according to the present embodiment preferably includes at least one inclined belt layer consisting of a rubberized layer of cords extending at an angle to the tire circumferential direction, and two layers is most preferable for the combination of weight reduction and suppression of contact patch distortion. From the viewpoint of weight reduction, one belt layer may be used, and from the viewpoint of suppressing distortion of the contact patch, three or more layers may be used. In the example illustrated inFIG.2, of the two belt layers4aand4b, the width in the tire width direction of the belt layer4boutward in the tire radial direction is smaller than the width in the tire width direction of the belt layer4ainward in the tire radial direction. However, the width in the tire width direction of the belt layer4boutward in the tire radial direction may be greater than or the same as the width in the tire width direction of the belt layer4ainward in the tire radial direction. The width in the tire width direction of the belt layer that has the greatest width in the tire width direction (the belt layer4ain the illustrated example) is preferably 90% to 115% of the ground contact width, and more preferably 100% to 105% of the ground contact width. Here, “ground contact width” refers to the distance in the tire width direction between the ground contact edges E described above.", "", "According to the present embodiment, metal cords, in particular steel cords, are most preferable as belt cords of the belt layers4a,4b, but non-metal, for example, organic fiber cords (such as Kevlar® (Kevlar is a registered trademark in Japan, other countries, or both)) may be used. The steel cords may include steel as a main component, and may contain various micro inclusions such as carbon, manganese, silicon, phosphorus, sulfur, copper, and chromium. According to the present embodiment, the belt cords of the belt layers4a,4bmay be monofilament cords, cords with a plurality of filaments drawn together, or cords with a plurality of filaments twisted together. Various twist structures may be adopted, including cross-section structure, twist pitch, twist direction, and distance between adjacent filaments. Cords obtained by twisting filaments of different materials may also be used, which may employ various twist structures such as single twist, layer twist, and multi twist, without being limited to any particular cross-section structure.", "", "According to the present embodiment, an inclination angle of the belt cords of the belt layers4a,4bis preferably 10° or more with respect to the tire circumferential direction. According to the present embodiment, the inclination angle of the belt cords of the belt layers4a,4bis preferably a high angle, specifically 20° or more, preferably 35° or more, and more preferably in a range of 55° to 85° with respect to the tire circumferential direction. By setting the inclination angle to 20° or more (preferably 35° or more), the rigidity with respect to the tire width direction may be increased, and steering stability, particularly when cornering, may be improved. Further, shearing deformation of the inter-layer rubber may be reduced, and rolling resistance may be reduced.", "", "In the illustrated example, the tread rubber of the tread5consists of one layer. However, according to the present embodiment, the tread rubber of the tread5may be formed by a plurality of different rubber layers stacked in the tire radial direction. The plurality of rubber layers may be different from one another in terms of tangent loss, modulus, hardness, glass transition temperature, material, or the like. Further, ratios of thicknesses of the plurality of rubber layers in the tire radial direction may vary in the tire width direction. Further, the circumferential main groove bottom and the like may be composed of a rubber layer different from that in a surrounding region. Further, the tread rubber of the tread5may be formed by a plurality of different rubber layers in the tire width direction. The plurality of rubber layers may be different from one another in terms of tangent loss, modulus, hardness, glass transition temperature, material, or the like. Further, ratios of thicknesses of the plurality of rubber layers in the tire width direction may vary in the tire radial direction. Further, rubber layers in a limited region, such as in the vicinity of the circumferential main groove alone, in the vicinity of the ground contact edges E alone, in the shoulder land portions alone, or in the center land portion, may be formed as rubber layers different from the surroundings.", "", "FIG.3is a developed view illustrating a tread pattern of the pneumatic radial tire for passenger vehicles according to an embodiment of the present disclosure.", "", "As illustrated inFIG.2andFIG.3, in this example, the tire1has only one circumferential main groove6extending in the tire circumferential direction on the contact surface of the tread5. In this example, the circumferential main groove6extends straight in the tire circumferential direction, but may extend in a zigzag shape or curved shape. The groove width (opening width) of the circumferential main groove6is not particularly limited, and may be 2 mm to 5 mm, for example. The groove depth (maximum depth) of the circumferential main groove6is not particularly limited, and may be 3 mm to 6 mm, for example. Here, according to the present embodiment, the circumferential main groove6is provided to a half portion of the tire on a vehicle-mounted outward side, which is one side of the tire in the tread width direction with the tire equatorial plane CL as a boundary.", "", "In the illustrated example, the tire1does not have a width direction groove extending in the tire width direction on the contact surface of the tread5, but the tire1may have one or more width direction grooves.", "", "The tire1according to the present embodiment includes an inner liner8on an inner surface7of the tire (also referred to simply as the tire inner surface7). Thickness of the inner liner8is preferably about 1.5 mm to 2.8 mm. This may effectively reduce cabin noise in a range of 80 Hz to 100 Hz. An air permeability coefficient of a rubber composition of the inner liner8is preferably 1.0×10−14cc·cm/(cm2·s·cmHg) or greater and 6.5×10−10cc·cm/(cm2·s·cmHg) or less.", "", "As illustrated inFIG.2, according to the present embodiment, in the tire width direction cross-section, under the reference conditions described above, when a straight line passing through a point on the tread surface on the tire equatorial plane CL and parallel to the tire width direction is m1, a straight line passing through the ground contact edges E and parallel to the tire width direction is m2, a distance between the straight line m1 and the straight line m2 in the tire radial direction is a drop height LCR, and the tread width of the tire1is TW, a ratio LCR/TW is greater than 0.045 (Configuration 1).", "", "The following is an explanation of effects of the pneumatic radial tire for passenger vehicles according to the present embodiment.", "", "The pneumatic radial tire for passenger vehicles according to the present embodiment has a narrow sectional width SW of less than 165 mm, even among narrow width, large diameter tires for which the sectional width SW and the outer diameter satisfy the relational equation described above. According to such a tire, air resistance in particular may be reduced, and rolling resistance may also be reduced, thereby improving the fuel efficiency of the tire.", "", "However, as schematically illustrated on a left side of the arrow inFIG.4, with such a tire, the ground contact area may become too elongated when the camber angle changes, such as during cornering, and the ground contact area may deteriorate, resulting in reduced steering stability and the like.", "", "To address this, first, in the tire according to the present embodiment, the ratio LCR/TW is greater than 0.045. This results in a tire that has a relatively round crown shape, and therefore a rounded ground contact area, with the shoulder portion having a shorter ground contact length relative to the center portion. This inhibits the ground contact area from becoming too elongated when the camber angle changes, as illustrated schematically on the right side of the arrow inFIG.4, and suppresses deterioration of the ground contact area.", "", "Further, the narrow width tire described above has excellent drainage to the side of the tire, and therefore even when the tire has only one circumferential main groove6, drainage performance may be sufficiently secured. The circumferential main groove6is provided to the half portion of the tire on the vehicle-mounted outward side, which is one side of the tire in the tread width direction with the tire equatorial plane CL as a boundary, and therefore the width of the land portion on the vehicle-mounted inward side is sufficiently secured to reduce the load burden and to suppress uneven wear caused by localized wear of the land portion. Further, having the circumferential main groove on the vehicle-mounted outward side also has an effect of securing flowability (escape area) of the rubber when lateral force is generated, thereby suppressing the occurrence of buckling.", "", "The ratio LCR/TW is more preferably 0.05 or greater. This is to further suppress deterioration of the ground contact area. On the other hand, from the viewpoint of reducing rolling resistance, the ratio LCR/TW is preferably 0.1 or less.", "", "Further, the groove width (opening width) of the circumferential main groove6is preferably 20% or less of the ground contact width, and more preferably 15% or less of the ground contact width. This is to secure the area of the land portion on the tire equatorial plane, and further suppress uneven wear. For the same reason, a negative ratio of the contact surface of the tread is preferably 20% or less, and more preferably 15% or less.", "", "Here, “negative ratio” refers to a ratio of an area of grooves having a groove width of 2 mm or greater (circumferential main groove and width direction groove) to an area of the contact surface of the tread in the tread developed view.", "", "Further, on the vehicle-mounted outward side, the width in the tire width direction of the land portion demarcated by the tread edge and the circumferential main groove6is preferably 20% or greater of the ground contact width, and more preferably 25% or greater of the ground contact width. This allows steering stability to be improved. Further, buckling in the vicinity of the circumferential main groove6may be suppressed, which has an effect of improving grounding property.", "", "FIG.5is a schematic diagram for explanation of the ground contact area. As another aspect, a ground contact length L1 on the tire equatorial plane CL is longer than an average value of ground contact lengths L2 and L3 ((L2+L3)/2) at tire width direction positions P1 and P2, which are spaced 20% of the ground contact width inward in the tire width direction from both ground contact edges E (Configuration 2). Even in this case, the ground contact area may be rounded, with the shoulder portion having a shorter ground contact length relative to the center portion. This inhibits the ground contact area from becoming too elongated when the camber angle changes, as illustrated schematically on the right side of the arrow inFIG.4, and suppresses deterioration of the ground contact area. The ground contact length L1 is preferably 1.1 times the average of the ground contact lengths L2 and L3 or greater. On the other hand, from the viewpoint of uneven wear mitigation performance, the ground contact length L1 is preferably 1.5 times the average of the ground contact lengths L2 and L3 or less.", "", "Further, as another aspect, as illustrated inFIG.2, a gauge G1 of the tread on the tire equatorial plane is greater than an average value ((G2+G3)/2) of gauges G2 and G3 of the tread at positions P1 and P2, which are spaced 20% of the ground contact width inward in the tire width direction from both ground contact edges E (Configuration 3). This results in a tire that has a relatively round crown shape, and therefore a rounded ground contact area, with the shoulder portion having a shorter ground contact length relative to the center portion. This inhibits the ground contact area from becoming too elongated when the camber angle changes, as illustrated schematically on the right side of the arrow inFIG.4, and suppresses deterioration of the ground contact area. Further, the thinner gauges at the positions P1 and P2 provide greater tread rigidity at these positions, which is advantageous for improving steering stability when cornering. The gauge G1 is preferably 1.1 times the average of the gauges G2 and G3 or greater. On the other hand, from the viewpoint of uneven wear mitigation performance, the gauge G1 is preferably 1.5 times the average value of the gauges G2 and G3 or less.", "", "According to the present disclosure, it suffices that any one or more of the above Configurations 1 to 3 are satisfied, and any two or all three may be satisfied.", "", "FIG.6is a developed view illustrating another example of a tread pattern. According to this example, one or more width direction sipes9(9a) extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to the land portion intersected by the tire equatorial plane CL and demarcated by the circumferential main groove6and the tread edge (in the illustrated example, the width direction sipes9(9a) are provided).", "", "According to this configuration, the compressive rigidity of the land portion intersected by the tire equatorial plane CL may be somewhat reduced to equalize the ground contact pressure.", "", "Here, a “sipe” of the width direction sipes has a sipe width (opening width) of less than 2 mm.", "", "FIG.7is a developed view illustrating another example of a tread pattern. According to this example, one or more width direction sipes9(9b) extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to the land portion on a vehicle-mounted outward side that is demarcated by the circumferential main groove6and the tread edge (in the illustrated example, the width direction sipes9(9b) are provided).", "", "This configuration is able to mitigate input of force from road surface irregularities and improve noise, vibration, and harshness (NVH) performance.", "", "The sipe depth (maximum depth) of the width direction sipes9a,9band hole-shaped sipes is not particularly limited, and may be 2 mm to 6 mm, for example. The pitch interval of the width direction sipes9a,9bin the tire circumferential direction is not particularly limited, and may be 10 mm to 40 mm, for example."], "claims": ["sectional width SW of the tire is less than 165 mm, a ratio SW/OD of the sectional width SW to outer diameter OD of the tire is 0.26 or less, or the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the relational equation OD (mm)≥−0.0187×SW (mm) in a tire width direction cross-section, under reference conditions where the tire is mounted on a rim, filled with a prescribed internal pressure, and unloaded, when a straight line passing through a point on a tread surface on a tire equatorial plane and parallel to a tire width direction is m1, a straight line passing through ground contact edges E and parallel to the tire width direction is m2, a distance between the straight line m1 and the straight line m2 in a tire radial direction is a drop height L a contact surface of the tread has only one circumferential main groove extending in a tire circumferential direction, and the circumferential main groove is provided to a half portion of the tire on a vehicle-mounted outward side, which is one side of the tire in a tread width direction with the tire equatorial plane as a boundary.", "sectional width SW of the tire is less than 165 mm, a ratio SW/OD of the sectional width SW to outer diameter OD of the tire is 0.26 or less, or the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the relational equation OD (mm)≥−0.0187×SW (mm) ground contact length on a tire equatorial plane is longer than an average value of ground contact lengths at positions 20% of ground contact width inward in a tire width direction from both ground contact edges, a contact surface of the tread has only one circumferential main groove extending in a tire circumferential direction, and the circumferential main groove is provided to a half portion of the tire on a vehicle-mounted outward side, which is one side of the tire in a tread width direction with the tire equatorial plane as a boundary.", "sectional width SW of the tire is less than 165 mm, a ratio SW/OD of the sectional width SW to outer diameter OD of the tire is 0.26 or less, or the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the relational equation OD (mm)≥−0.0187×SW (mm) gauge of the tread on a tire equatorial plane is greater than an average value of gauges of the tread at positions 20% of ground contact width inward in a tire width direction from both ground contact edges, a contact surface of the tread has only one circumferential main groove extending in a tire circumferential direction, and the circumferential main groove is provided to a half portion of the tire on a vehicle-mounted outward side, which is one side of the tire in a tread width direction with the tire equatorial plane as a boundary.", "4 . The pneumatic radial tire for passenger vehicles according to claim 1 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion intersected by the tire equatorial plane and demarcated by the circumferential main groove and a tread edge.", "5 . The pneumatic radial tire for passenger vehicles according to claim 1 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted outward side that is demarcated by the circumferential main groove and a tread edge.", "6 . The pneumatic radial tire for passenger vehicles according to claim 2 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion intersected by the tire equatorial plane and demarcated by the circumferential main groove and a tread edge.", "7 . The pneumatic radial tire for passenger vehicles according to claim 3 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion intersected by the tire equatorial plane and demarcated by the circumferential main groove and a tread edge.", "8 . The pneumatic radial tire for passenger vehicles according to claim 2 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted outward side that is demarcated by the circumferential main groove and a tread edge.", "9 . The pneumatic radial tire for passenger vehicles according to claim 3 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted outward side that is demarcated by the circumferential main groove and a tread edge.", "10 . The pneumatic radial tire for passenger vehicles according to claim 4 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted outward side that is demarcated by the circumferential main groove and a tread edge.", "11 . The pneumatic radial tire for passenger vehicles according to claim 6 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted outward side that is demarcated by the circumferential main groove and a tread edge.", "12 . The pneumatic radial tire for passenger vehicles according to claim 7 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted outward side that is demarcated by the circumferential main groove and a tread edge."], "bibtex": "@patent{20240408915,\n    title = {PNEUMATIC RADIAL TIRE FOR PASSENGER VEHICLES},\n    number = {20240408915},\n    year = {2024},\n    note = {File: US20240408915A1-20241212.XML}\n    }", "classification": "B60C1103FI"}, {"title": "PNEUMATIC RADIAL TIRE FOR PASSENGER VEHICLES", "doc_number": "20240408916", "filename": "US20240408916A1-20241212.XML", "abstract": "A pneumatic radial tire for passenger vehicles that satisfies a defined relationship between sectional width SW and outer diameter OD of the tire, grooves in a contact patch consisting only of grooves having a groove width of 2 mm or less, and the contact patch includes one or more block-shaped land portion defined by two or more circumferential grooves and two or more width direction grooves. A drop height (or ground contact length relationship, or tread gauge relationship) is also defined.", "detailed_description": ["Hereinafter, embodiments of the present disclosure are illustratively described in detail, with reference to the drawings.", "", "FIG.1is a schematic diagram illustrating sectional width SW and outer diameter OD of a tire.", "", "The pneumatic radial tire for passenger vehicles (hereinafter also referred to simply as “tire”) according to an embodiment of the present disclosure has a sectional width SW of less than 165 (mm), and a ratio SW/OD of the sectional width SW to the outer diameter OD of the tire is 0.26 or less, forming a narrow width and large diameter shape. By making the sectional width SW of the tire narrow, relative to the outer diameter OD of the tire, air resistance may be reduced, and by making the outer diameter OD of the tire large, relative to the sectional width SW of the tire, deformation of tread rubber in the vicinity of the contact patch of the tire may be controlled and rolling resistance may be reduced. Accordingly, fuel efficiency of the tire may be improved. The ratio SW/OD is preferably 0.25 or less, and more preferably 0.24 or less.", "", "The ratio above is preferably satisfied when the internal pressure of the tire is 200 kPa or greater, more preferably satisfied when the internal pressure of the tire is 220 kPa or greater, and even more preferably satisfied when the internal pressure of the tire is 280 kPa or greater. This allows rolling resistance to be reduced. On the other hand, the ratio above is preferably satisfied when the internal pressure of the tire is 350 kPa or less. This allows ride comfort to be improved.", "", "Here, the sectional width SW of the tire is preferably 105 mm to 145 mm, and more preferably 115 mm to 135 mm.", "", "Further, an aspect ratio of the tire when the sectional width SW and the outer diameter OD of the tire satisfy the ratio above is preferably 45 to 70, and more preferably 45 to 65.", "", "The tire is not particularly limited to a specific size. Example tire sizes include 105/50R16, 115/50R17, 125/55R20, 125/60R18, 125/65R19, 135/45R21, 135/55R20, 135/60R17, 135/60R18, 135/60R19, 135/65R19, 145/45R21, 145/55R20, 145/60R16, 145/60R17, 145/60R18, 145/60R19, 145/65R19, 155/45R18, 155/45R21, 155/55R18, 155/55R19, 155/55R21, 155/60R17, 155/65R18, 155/70R17, and 155/70R19.", "", "Alternatively, the sectional width SW of the tire is less than 165 mm, and the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the following relational equation:", "", "OD (mm)≥−0.0187×SW (mm)2+9.15×SW (mm)−380", "", "That is, the tire has a narrow width and a large diameter.", "", "Satisfying the relational equation above reduces air resistance and reduces rolling resistance, thereby improving fuel efficiency of the tire.", "", "According to a third aspect, the sectional width SW and the outer diameter OD of the tire, in addition to satisfying the relational equation above, are such that the ratio SW/OD is preferably 0.26 or less, more preferably 0.25 or less, and even more preferably 0.24 or less. This allows fuel efficiency of the tire to be further improved.", "", "The relational equation and/or the ratio are preferably satisfied when the internal pressure of the tire is 200 kPa or greater, more preferably when the internal pressure of the tire is 220 kPa or greater, and even more preferably when the internal pressure of the tire is 280 kPa or greater. This allows rolling resistance to be reduced. On the other hand, the relational equation and/or the ratio are preferably satisfied when the internal pressure of the tire is 350 kPa or less. This allows ride comfort to be improved.", "", "Here, the sectional width SW of the tire is preferably 105 mm to 145 mm, and more preferably 115 mm to 135 mm.", "", "Further, the aspect ratio of the tire when the sectional width SW and the outer diameter OD of the tire satisfy the relational equation above is preferably 45 to 70, and more preferably 45 to 65.", "", "The tire is not particularly limited to a specific size. Example tire sizes include 105/50R16, 115/50R17, 125/55R20, 125/60R18, 125/65R19, 135/45R21, 135/55R20, 135/60R17, 135/60R18, 135/60R19, 135/65R19, 145/45R21, 145/55R20, 145/60R16, 145/60R17, 145/60R18, 145/60R19, 145/65R19, 155/45R18, 155/45R21, 155/55R18, 155/55R19, 155/55R21, 155/60R17, 155/65R18, 155/70R17, and 155/70R19.", "", "The tire according to the present embodiment is a pneumatic radial tire for passenger vehicles. This tire is particularly suitable for use as a tire mounted on a vehicle for personal mobility.", "", "FIG.2is a tire width direction cross-section diagram of the pneumatic radial tire for passenger vehicles according to an embodiment of the present disclosure.FIG.2illustrates a tire width direction cross-section under reference conditions, where the tire is mounted on a rim, filled to a prescribed internal pressure, and unloaded. As illustrated inFIG.2, the tire1includes a carcass3consisting of plies of radially arranged cords toroidally extending between a pair of bead portions2. Further, the tire1includes a belt4consisting of two belt layers4a,4bin the illustrated example, and a tread5, in this order, outward from the carcass3in the tire radial direction.", "", "In this example, a bead core2ais embedded in each of the pair of the bead portions2. According to the present disclosure, a cross-sectional shape and material of the bead core2aare not particularly limited, and may have a structure normally used in a pneumatic radial tire for passenger vehicles. According to the present disclosure, the bead core2amay be divided into a plurality of small bead cores. Alternatively, according to the present disclosure, the structure need not include the bead core2a.", "", "The tire1in the illustrated example includes a bead filler2bthat has an approximately triangular shape in cross-section, disposed outward from the bead core2ain the tire radial direction. The cross-sectional shape of the bead filler2bis not limited to this example, and the material of the bead filler2bis also not particularly limited. Alternatively, the tire may be made lighter by not including the bead filler2b.", "", "According to the present embodiment, the tire1may have a structure that includes a rim guard. Further, according to the present embodiment, the bead portion2may further include an additional member such as a rubber layer, a cord layer, or the like for reinforcement or other purposes. Such an additional member may be provided at various positions with respect to the carcass3and the bead filler2b.", "", "In the example illustrated inFIG.2, the carcass3consists of a single carcass ply. However, according to the present disclosure, the number of carcass plies is not particularly limited and may be two or more. Further, in the example illustrated inFIG.2, the carcass3includes a toroidally extending carcass body portion3athat spans between the pair of the bead portions2and turn-up portions3bthat are turned up from the carcass body portion3aaround the bead cores2a. However, according to the present disclosure, the carcass turn-up portions3bmay be wrapped around the bead cores2a, or may be sandwiched between a number of divided small bead cores. According to the illustrated example, ends3cof the carcass turn-up portions3bare positioned outward in the tire radial direction from an outermost end in the tire radial direction of the bead fillers2band inward in the tire radial direction from a tire maximum width position. This allows reduction of the weight of the tire while maintaining rigidity of the sidewall portion. However, according to the present disclosure, the ends3cof the carcass turn-up portions3bmay be positioned inward in the tire radial direction from the outermost end in the tire radial direction of the bead filler2b, or outward in the tire radial direction from the tire maximum width position. Alternatively, the ends3cof the carcass turn-up portions3bmay be an envelope structure, positioned inward in the tire width direction of ends of the belt4(for example, ends of the belt layer4b) between the carcass body portion3aand the belt4in the tire radial direction. Further, in a case where the carcass3is formed of a plurality of carcass plies, the positions of the ends3cof the carcass turn-up portions3b(for example, in the tire radial position) may be the same or different among the carcass plies. The number of cords in the carcass3is not particularly limited, and may be in a range of 20 cords to 60 cords per 50 mm, for example. Further, a carcass line may adopt various structures. For example, a carcass maximum width position in the tire radial direction may be closer to either the bead portions2or the tread5. For example, the carcass maximum width position may be in a range of 50% to 90% of a tire section height, outward in the tire radial direction from a bead base line. The above term “radially arranged” indicates at least 85° to the tire circumferential direction, preferably 90° to the tire circumferential direction.", "", "The tire according to the present embodiment preferably includes at least one inclined belt layer consisting of a rubberized layer of cords extending at an angle to the tire circumferential direction, and two layers is most preferable for the combination of weight reduction and suppression of contact patch distortion. From the viewpoint of weight reduction, one belt layer may be used, and from the viewpoint of suppressing distortion of the contact patch, three or more layers may be used. In the example illustrated inFIG.2, of the two belt layers4aand4b, the width in the tire width direction of the belt layer4boutward in the tire radial direction is smaller than the width in the tire width direction of the belt layer4ainward in the tire radial direction. However, the width in the tire width direction of the belt layer4boutward in the tire radial direction may be greater than or the same as the width in the tire width direction of the belt layer4ainward in the tire radial direction. The width in the tire width direction of the belt layer that has the greatest width in the tire width direction (the belt layer4ain the illustrated example) is preferably 90% to 115% of the ground contact width, and more preferably 100% to 105% of the ground contact width. Here, “ground contact width” refers to the distance in the tire width direction between the ground contact edges E described above.", "", "According to the present embodiment, metal cords, in particular steel cords, are most preferable as belt cords of the belt layers4a,4b, but non-metal, for example, organic fiber cords (such as Kevlar& (Kevlar is a registered trademark in Japan, other countries, or both)) may be used. The steel cords may include steel as a main component, and may contain various micro inclusions such as carbon, manganese, silicon, phosphorus, sulfur, copper, and chromium. According to the present embodiment, the belt cords of the belt layers4a,4bmay be monofilament cords, cords with a plurality of filaments drawn together, or cords with a plurality of filaments twisted together. Various twist structures may be adopted, including cross-section structure, twist pitch, twist direction, and distance between adjacent filaments. Cords obtained by twisting filaments of different materials may also be used, which may employ various twist structures such as single twist, layer twist, and multi twist, without being limited to any particular cross-section structure.", "", "According to the present embodiment, an inclination angle of the belt cords of the belt layers4a,4bis preferably 10° or more with respect to the tire circumferential direction. According to the present embodiment, the inclination angle of the belt cords of the belt layers4a,4bis preferably a high angle, specifically 20° or more, preferably 35° or more, and more preferably in a range of 55° to 85° with respect to the tire circumferential direction. By setting the inclination angle to 20° or more (preferably 35° or more), the rigidity with respect to the tire width direction may be increased, and steering stability, particularly when cornering, may be improved. Further, shearing deformation of the inter-layer rubber may be reduced, and rolling resistance may be reduced.", "", "In the illustrated example, the tread rubber of the tread5consists of one layer. However, according to the present embodiment, the tread rubber of the tread5may be formed by a plurality of different rubber layers stacked in the tire radial direction. The plurality of rubber layers may be different from one another in terms of tangent loss, modulus, hardness, glass transition temperature, material, or the like. Further, ratios of thicknesses of the plurality of rubber layers in the tire radial direction may vary in the tire width direction. Further, a circumferential main groove bottom and the like may be composed of a rubber layer different from that in a surrounding region. Further, the tread rubber of the tread5may be formed by a plurality of different rubber layers in the tire width direction. The plurality of rubber layers may be different from one another in terms of tangent loss, modulus, hardness, glass transition temperature, material, or the like. Further, ratios of thicknesses of the plurality of rubber layers in the tire width direction may vary in the tire radial direction. Further, rubber layers in a limited region, such as in the vicinity of a circumferential main groove alone, in the vicinity of the ground contact edges E alone, in the shoulder land portions alone, or in the center land portion, may be formed as rubber layers different from the surroundings.", "", "The tire1according to the present embodiment includes an inner liner8on an inner surface7of the tire (also referred to simply as the tire inner surface7). Thickness of the inner liner8is preferably about 1.5 mm to 2.8 mm. This may effectively reduce cabin noise in a range of 80 Hz to 100 Hz. An air permeability coefficient of a rubber composition of the inner liner8is preferably 1.0×10−14cc·cm/(cm2·s·cmHg) or greater and 6.5×10−10cc·cm/(cm2·s·cmHg) or less.", "", "FIG.3is a diagram illustrating a groove pattern arranged on the contact patch of the pneumatic radial tire for passenger vehicles according to an embodiment of the present disclosure.", "", "As illustrated inFIG.3, in this example, when the tire1is mounted on the rim, filled with the prescribed internal pressure, and subjected to a maximum load, the tire1is configured so that grooves6a,6bin the contact patch consist only of grooves6having a groove width of 2 mm or less. According to the present embodiment, the grooves6a,6bare sipes having a groove width (opening width) of 2 mm or less, but may be narrow grooves.", "", "As illustrated inFIG.3, the tire1includes, in the contact patch, two or more circumferential grooves6aextending in the tire circumferential direction or at an inclination angle of less than 45° to the tire circumferential direction and two or more width direction grooves6bextending in the tire width direction or at an inclination angle of 45° or less to the tire width direction. According to the present embodiment, the circumferential grooves6aare circumferential sipes each having a groove width of 2 mm or less, and the width direction grooves6bare width direction sipes each having a groove width of 2 mm or less. In this example, the circumferential sipes6aand the width direction sipes6bare flat plate-like sipes. Here, “flat plate-like” means that the groove width is substantially constant from the groove opening to the groove bottom, but the groove bottom may have curvature, or the groove may be a so-called flask-shaped sipe with a widened groove bottom. Further, the sipes may be at least partially closed in the depth direction of the sipes when in ground contact. For example, either or both of the circumferential sipes6aand the width direction sipes6bmay be so-called three-dimensional sipes where the inner wall of the sipe has a uneven shape along the depth direction.", "", "In the illustrated example, the circumferential sipes6aextend in the tire circumferential direction, but the circumferential sipes6amay extend at an angle to the tire circumferential direction. Further, in the illustrated example, the width direction sipes6bextend in the tire width direction, but the width direction sipes6bmay extend at an angle to the tire width direction.", "", "In the illustrated example, there are four circumferential sipes6aand three width direction sipes6bin the contact patch, but the number of the circumferential sipes6aneed only be two or more in the contact patch, and the number of the width direction sipes6balso need only be two or more in the contact patch.", "", "In this example, there are two or more circumferential grooves6athat extend across and intersect two or more width direction grooves6b, and two or more width direction grooves6bthat extend across and intersect two or more circumferential grooves6a.", "", "The tire1according to the present embodiment includes one or more (six in the illustrated example) block-shaped land portions9that are defined by two or more circumferential grooves (circumferential sipes in this example)6aand two or more width direction grooves (width direction sipes in this example)6b. In the illustrated example, the block-shaped land portions9are rectangular (in the developed view).", "", "As illustrated inFIG.2, according to the present embodiment, in the tire width direction cross-section, under the reference conditions described above, when a straight line passing through a point on the tread surface on the tire equatorial plane CL and parallel to the tire width direction is m1, a straight line passing through the ground contact edges E and parallel to the tire width direction is m2, a distance between the straight line m1 and the straight line m2 in the tire radial direction is a drop height LCR, and the tread width of the tire1is TW, a ratio LCR/TW is greater than 0.045 (Configuration 1).", "", "The following is an explanation of effects of the pneumatic radial tire for passenger vehicles according to the present embodiment.", "", "The pneumatic radial tire for passenger vehicles according to the present embodiment has a narrow sectional width SW of less than 165 mm, even among narrow width, large diameter tires for which the sectional width SW and the outer diameter satisfy the relational equation described above. According to such a tire, air resistance in particular may be reduced, and rolling resistance may also be reduced, thereby improving the fuel efficiency of the tire.", "", "However, as schematically illustrated on a left side of the arrow inFIG.6, with such a tire, the ground contact area may become too elongated when the camber angle changes, such as during cornering, and the ground contact area may deteriorate, resulting in reduced steering stability and the like.", "", "To address this, first, in the tire according to the present embodiment, the ratio LCR/TW is greater than 0.045. This results in a tire that has a relatively round crown shape, and therefore a rounded ground contact area, with the shoulder portion having a shorter ground contact length relative to the center portion. This inhibits the ground contact area from becoming too elongated when the camber angle changes, as illustrated schematically on the right side of the arrow inFIG.6, and suppresses deterioration of the ground contact area.", "", "Further, the narrow width tire described above has excellent drainage to the side of the tire, and therefore even when the tire has only the grooves6a,6bwith the groove width of 2 mm or less, drainage performance may be sufficiently secured.", "", "As mentioned above, such a pattern with few grooves may worsen the ability to follow uneven road surfaces.", "", "To address this, according to the present embodiment, the contact patch includes one or more block-shaped land portions9defined by two or more circumferential grooves6aextending in a tire circumferential direction or at an inclination angle of less than 45° to the tire circumferential direction and two or more width direction grooves6bextending in a tire width direction or at an inclination angle of 45° or less to the tire width direction. Accordingly, compressive rigidity may be reduced (compared to a pattern without grooves).", "", "Further, in the tire1according to the present embodiment, the grooves in the contact patch consist only of grooves having the groove width of 2 mm or less, thus securing a footprint area and reducing average ground contact pressure on tread rubber (compared to a pattern of grooves having a groove width greater than 2 mm). A low-loss rubber compound commonly used for eco-friendly tires is preferably used for the tread rubber compound.", "", "Thus, the tire's ability to follow the road surface may be improved by reducing the compressive rigidity while maintaining a low ground contact pressure. This may further improve fuel efficiency by practically reducing the rolling resistance. Further, this may also suppress degradation of ride comfort.", "", "In this example, the circumferential sipes6aand the width direction sipes6bare provided, but the same effect is obtainable even with narrow grooves.", "", "Further, as mentioned above, each block-shaped land portion need not only be completely demarcated by two circumferential grooves and two width direction grooves, and may include interrupted sections where the two circumferential grooves and the two width direction grooves extend intermittently. For example, this includes cases where a block-shaped land portion is completely demarcated by a virtual line that continues an extension of a groove.", "", "The ratio LCR/TW is more preferably 0.05 or greater. This is because deterioration of the ground contact area may be further suppressed. On the other hand, from the viewpoint of reducing rolling resistance, the ratio LCR/TW is preferably 0.1 or less.", "", "FIG.7is a schematic diagram for explanation of the ground contact area. As another aspect, a ground contact length L1on the tire equatorial plane CL is longer than an average value of ground contact lengths L2and L3((L2+L3)/2) at tire width direction positions P1and P2, which are spaced 20% of the ground contact width inward in the tire width direction from both ground contact edges E (Configuration 2). Even in this case, the ground contact area may be rounded, with the shoulder portion having a shorter ground contact length relative to the center portion. This inhibits the ground contact area from becoming too elongated when the camber angle changes, as illustrated schematically on the right side of the arrow inFIG.6, and suppresses deterioration of the ground contact area. The ground contact length L1is preferably 1.1 times the average of the ground contact lengths L2and L3or greater. On the other hand, from the viewpoint of uneven wear mitigation performance, the ground contact length L1is preferably 1.5 times the average of the ground contact lengths L2and L3or less.", "", "Further, as another aspect, as illustrated inFIG.2, a gauge G1of the tread on the tire equatorial plane is greater than an average value ((G2+G3)/2) of gauges G2and G3of the tread at positions P1and P2, which are spaced 20% of the ground contact width inward in the tire width direction from both ground contact edges E (Configuration 3). This results in a tire that has a relatively round crown shape, and therefore a rounded ground contact area, with the shoulder portion having a shorter ground contact length relative to the center portion. This inhibits the ground contact area from becoming too elongated when the camber angle changes, as illustrated schematically on the right side of the arrow inFIG.6, and suppresses deterioration of the ground contact area. Further, the thinner gauges at the positions P1and P2provide greater tread rigidity at these positions, which is advantageous for improving steering stability when cornering. The gauge G1is preferably 1.1 times the average of the gauges G2and G3or greater. On the other hand, from the viewpoint of uneven wear mitigation performance, the gauge G1is preferably 1.5 times the average value of the gauges G2and G3or less.", "", "According to the present disclosure, it suffices that any one or more of the above Configurations 1 to 3 are satisfied, and any two or all three may be satisfied.", "", "An area of the block-shaped land portions9(one block-shaped land portion) is preferably 1/10 or less of the area of the contact patch. More preferably, there is a plurality of block-shaped land portions9and for 80% or more of the block-shaped land portions9, the area of one block-shaped land portion9is 1/10 or less of the area of the contact patch. Even more preferably, the area of the block-shaped land portion9having the largest area among the plurality of block-shaped land portions9is 1/10 or less of the area of the contact patch. This is because the area of each individual block-shaped land portion9may be made smaller and the blocks may be densely packed together, further improving the ability to follow the road surface and more effectively realizing the effects described above.", "", "Although narrow tires are advantageous for macro drainage phenomena such as hydroplaning, local drainage performance of the block contact patch, so-called micro drainage performance, is difficult to ensure when the volume of the grooves is reduced, and further improvement of wet performance is required.", "", "According to the present embodiment, as illustrated inFIG.3, the width direction grooves are connected to the ground contact edge on one or the other side in the tire width direction (in this example, connected to the ground contact edges on both sides). This improves the local drainage of the ground surface, the so-called micro drainage performance, and further improves wet performance.", "", "Further, it is preferable to have a width direction sipe or a hole-shaped sipe having a diameter of 2 mm or less on a vehicle-mounted outward side, which is a tire width direction half portion with the tire equatorial plane as a boundary. This is because the compressive rigidity of the vehicle-mounted outward side block-shaped land portion may be appropriately reduced to make the ground contact pressure more uniform.", "", "FIG.4is a diagram illustrating a groove pattern arranged on the contact patch of the pneumatic radial tire for passenger vehicles according to another embodiment of the present disclosure. In the example illustrated inFIG.4, the circumferential grooves (circumferential sipes)6aextend at an angle to the tire circumferential direction, and the width direction grooves (width direction sipes)6bextend at an angle to the tire width direction. In this example, the circumferential grooves and the width direction grooves intersect at approximately right angles, and therefore the block-shaped land portions9are rectangular (in this developed view), but this is merely an example and not limiting. On one hand, two or more circumferential grooves parallel to each other and two or more width direction grooves parallel to each other preferably make the block-shaped land portions9rectangular (in this developed view), but the block-shaped land portions9may have a parallelogram shape, for example (in this developed view). In such a case, the angle of the smallest of the four corners is preferably 45° or more to prevent the corners from becoming too sharp.", "", "FIG.5is a diagram illustrating a groove pattern arranged on the contact patch of the pneumatic radial tire for passenger vehicles according to another embodiment of the present disclosure. In the example illustrated inFIG.5, the circumferential grooves6aextend in the tire circumferential direction, but the width direction grooves differ from the pattern illustrated inFIG.4in that there are two different width direction grooves6b1,6b2that have different directions of inclination relative to the tire width direction and intersect each other. In this example, the block-shaped land portions9are triangular (in this developed view). According to the pattern illustrated inFIG.5, the block-shaped land portions may be more densely arranged to further improve the ability to follow the road surface, and more effectively realize the effects described above.", "", "Here, for example, when the block-shaped land portions9are rectangular or parallelogram shaped, a ratio of the shortest side to the longest side of the block-shaped land portions9is preferably 0.7 or greater. This is because, particularly when there is a plurality of the block-shaped land portions9in the contact patch, the effect of the block-shaped land portions9supporting each other is more uniformly obtainable in each direction."], "claims": ["sectional width SW of the tire is less than 165 mm, a ratio SW/OD of the sectional width SW to outer diameter OD of the tire is 0.26 or less, or the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the relational equation OD (mm)≥−0.0187×SW (mm) in a tire width direction cross-section, under reference conditions where the tire is mounted on a rim, filled with a prescribed internal pressure, and unloaded, when a straight line passing through a point on a tread surface on a tire equatorial plane and parallel to a tire width direction is m1, a straight line passing through ground contact edges E and parallel to the tire width direction is m2, a distance between the straight line m1 and the straight line m2 in a tire radial direction is a drop height L when the tire is mounted on the rim, filled with the prescribed internal pressure, and subjected to a maximum load, grooves in a contact patch consist only of grooves having a groove width of 2 mm or less, and the contact patch includes one or more block-shaped land portions defined by two or more circumferential grooves extending in a tire circumferential direction or at an inclination angle of less than 45° to the tire circumferential direction and two or more width direction grooves extending in a tire width direction or at an inclination angle of 45° or less to the tire width direction.", "sectional width SW of the tire is less than 165 mm, a ratio SW/OD of the sectional width SW to outer diameter OD of the tire is 0.26 or less, or the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the relational equation OD (mm)≥−0.0187×SW (mm) ground contact length on a tire equatorial plane is longer than an average value of ground contact lengths at positions 20% of ground contact width inward in a tire width direction from both ground contact edges, when the tire is mounted on the rim, filled with the prescribed internal pressure, and subjected to a maximum load, grooves in a contact patch consist only of grooves having a groove width of 2 mm or less, and the contact patch includes one or more block-shaped land portions defined by two or more circumferential grooves extending in a tire circumferential direction or at an inclination angle of less than 45° to the tire circumferential direction and two or more width direction grooves extending in a tire width direction or at an inclination angle of 45° or less to the tire width direction.", "sectional width SW of the tire is less than 165 mm, a ratio SW/OD of the sectional width SW to outer diameter OD of the tire is 0.26 or less, or the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the relational equation OD (mm)≥−0.0187×SW (mm) gauge of the tread on a tire equatorial plane is greater than an average value of gauges of the tread at positions 20% of ground contact width inward in a tire width direction from both ground contact edges, the contact patch includes one or more block-shaped land portions defined by two or more circumferential grooves extending in a tire circumferential direction or at an inclination angle of less than 45° to the tire circumferential direction and two or more width direction grooves extending in a tire width direction or at an inclination angle of 45° or less to the tire width direction.", "4 . The pneumatic radial tire for passenger vehicles according to claim 1 , wherein the circumferential grooves are circumferential sipes each having a groove width of 2 mm or less, the width direction grooves are width direction sipes each having a groove width of 2 mm or less, and the width direction sipes are flat plate-like sipes.", "5 . The pneumatic radial tire for passenger vehicles according to claim 1 , wherein an area of at least one of the one or more block-shaped land portions is 1/10 or less of an area of the contact patch.", "6 . The pneumatic radial tire for passenger vehicles according to claim 5 , wherein the one or more block-shaped land portions is a plurality of block-shaped land portions, and the area of each of 80% or more of the block-shaped land portions is 1/10 or less of the area of the contact patch.", "7 . The pneumatic radial tire for passenger vehicles according to claim 6 , wherein a largest area among the block-shaped land portions is 1/10 or less of the area of the contact patch.", "8 . The pneumatic radial tire for passenger cars according to claim 1 , wherein the width direction grooves are connected to the ground contact edges on one side or the other side in the tire width direction.", "9 . The pneumatic radial tire for passenger vehicles according to claim 4 , wherein the width direction sipes or hole-shaped sipes having a diameter of 2 mm or less are provided to a vehicle-mounted outward side, which is a tire width direction half portion with the tire equatorial plane as a boundary.", "10 . The pneumatic radial tire for passenger vehicles according to claim 2 , wherein the circumferential grooves are circumferential sipes each having a groove width of 2 mm or less, the width direction grooves are width direction sipes each having a groove width of 2 mm or less, and the width direction sipes are flat plate-like sipes.", "11 . The pneumatic radial tire for passenger vehicles according to claim 3 , wherein the circumferential grooves are circumferential sipes each having a groove width of 2 mm or less, the width direction grooves are width direction sipes each having a groove width of 2 mm or less, and the width direction sipes are flat plate-like sipes.", "12 . The pneumatic radial tire for passenger vehicles according to claim 2 , wherein an area of at least one of the one or more block-shaped land portions is 1/10 or less of an area of the contact patch.", "13 . The pneumatic radial tire for passenger vehicles according to claim 3 , wherein an area of at least one of the one or more block-shaped land portions is 1/10 or less of an area of the contact patch.", "14 . The pneumatic radial tire for passenger vehicles according to claim 4 , wherein an area of at least one of the one or more block-shaped land portions is 1/10 or less of an area of the contact patch.", "15 . The pneumatic radial tire for passenger vehicles according to claim 12 , wherein the one or more block-shaped land portions is a plurality of block-shaped land portions, and the area of each of 80% or more of the block-shaped land portions is 1/10 or less of the area of the contact patch.", "16 . The pneumatic radial tire for passenger vehicles according to claim 13 , wherein the one or more block-shaped land portions is a plurality of block-shaped land portions, and the area of each of 80% or more of the block-shaped land portions is 1/10 or less of the area of the contact patch.", "17 . The pneumatic radial tire for passenger vehicles according to claim 14 , wherein the one or more block-shaped land portions is a plurality of block-shaped land portions, and the area of each of 80% or more of the block-shaped land portions is 1/10 or less of the area of the contact patch.", "18 . The pneumatic radial tire for passenger vehicles according to claim 15 , wherein a largest area among the block-shaped land portions is 1/10 or less of the area of the contact patch.", "19 . The pneumatic radial tire for passenger vehicles according to claim 16 , wherein a largest area among the block-shaped land portions is 1/10 or less of the area of the contact patch.", "20 . The pneumatic radial tire for passenger vehicles according to claim 17 , wherein a largest area among the block-shaped land portions is 1/10 or less of the area of the contact patch."], "bibtex": "@patent{20240408916,\n    title = {PNEUMATIC RADIAL TIRE FOR PASSENGER VEHICLES},\n    number = {20240408916},\n    year = {2024},\n    note = {File: US20240408916A1-20241212.XML}\n    }", "classification": "B60C1103FI"}, {"title": "PNEUMATIC RADIAL TIRE FOR PASSENGER VEHICLES", "doc_number": "20240408917", "filename": "US20240408917A1-20241212.XML", "abstract": "A pneumatic radial tire for passenger vehicles that satisfies a defined relationship between sectional width SW and outer diameter OD of the tire, and includes only two circumferential main grooves extending in a tire circumferential direction on a tread contact surface, a barycenter of the circumferential main grooves being provided to a half portion of the tire on a vehicle-mounted inward side, which is one side of the tire in a tread width direction with a tire equatorial plane as a boundary. A drop height (or ground contact length relationship, or tread gauge relationship) is also defined.", "detailed_description": ["Hereinafter, embodiments of the present disclosure are illustratively described in detail, with reference to the drawings.", "", "FIG.1is a schematic diagram illustrating sectional width SW and outer diameter OD of a tire.", "", "The pneumatic radial tire for passenger vehicles (hereinafter also referred to simply as “tire”) according to an embodiment of the present disclosure has a sectional width SW of less than 165 (mm), and a ratio SW/OD of the sectional width SW to the outer diameter OD of the tire is 0.26 or less, forming a narrow width and large diameter shape. By making the sectional width SW of the tire narrow, relative to the outer diameter OD of the tire, air resistance may be reduced, and by making the outer diameter OD of the tire large, relative to the sectional width SW of the tire, deformation of tread rubber in the vicinity of the contact patch of the tire may be controlled and rolling resistance may be reduced. Accordingly, fuel efficiency of the tire may be improved. The ratio SW/OD is preferably 0.25 or less, and more preferably 0.24 or less.", "", "The ratio above is preferably satisfied when the internal pressure of the tire is 200 kPa or greater, more preferably satisfied when the internal pressure of the tire is 220 kPa or greater, and even more preferably satisfied when the internal pressure of the tire is 280 kPa or greater. This allows rolling resistance to be reduced. On the other hand, the ratio above is preferably satisfied when the internal pressure of the tire is 350 kPa or less. This allows ride comfort to be improved.", "", "Here, the sectional width SW of the tire is preferably 105 mm to 145 mm, and more preferably 115 mm to 135 mm.", "", "Further, an aspect ratio of the tire when the sectional width SW and the outer diameter OD of the tire satisfy the ratio above is preferably 45 to 70, and more preferably 45 to 65.", "", "The tire is not particularly limited to a specific size. Example tire sizes include 105/50R16, 115/50R17, 125/55R20, 125/60R18, 125/65R19, 135/45R21, 135/55R20, 135/60R17, 135/60R18, 135/60R19, 135/65R19, 145/45R21, 145/55R20, 145/60R16, 145/60R17, 145/60R18, 145/60R19, 145/65R19, 155/45R18, 155/45R21, 155/55R18, 155/55R19, 155/55R21, 155/60R17, 155/65R18, 155/70R17, and 155/70R19.", "", "Alternatively, the sectional width SW of the tire is less than 165 mm, and the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the following relational equation:", "", "OD(mm)≥−0.0187×SW(mm)2+9.15×SW(mm)−380", "", "That is, the tire has a narrow width and a large diameter.", "", "Satisfying the relational equation above reduces air resistance and reduces rolling resistance, thereby improving fuel efficiency of the tire.", "", "According to a third aspect, the sectional width SW and the outer diameter OD of the tire, in addition to satisfying the relational equation above, are such that the ratio SW/OD is preferably 0.26 or less, more preferably 0.25 or less, and even more preferably 0.24 or less. This allows fuel efficiency of the tire to be further improved.", "", "The relational equation and/or the ratio are preferably satisfied when the internal pressure of the tire is 200 kPa or greater, more preferably when the internal pressure of the tire is 220 kPa or greater, and even more preferably when the internal pressure of the tire is 280 kPa or greater. This allows rolling resistance to be reduced. On the other hand, the relational equation and/or the ratio are preferably satisfied when the internal pressure of the tire is 350 kPa or less. This allows ride comfort to be improved.", "", "Here, the sectional width SW of the tire is preferably 105 mm to 145 mm, and more preferably 115 mm to 135 mm.", "", "Further, the aspect ratio of the tire when the sectional width SW and the outer diameter OD of the tire satisfy the relational equation above is preferably 45 to 70, and more preferably 45 to 65.", "", "The tire is not particularly limited to a specific size. Example tire sizes include 105/50R16, 115/50R17, 125/55R20, 125/60R18, 125/65R19, 135/45R21, 135/55R20, 135/60R17, 135/60R18, 135/60R19, 135/65R19, 145/45R21, 145/55R20, 145/60R16, 145/60R17, 145/60R18, 145/60R19, 145/65R19, 155/45R18, 155/45R21, 155/55R18, 155/55R19, 155/55R21, 155/60R17, 155/65R18, 155/70R17, and 155/70R19.", "", "The tire according to the present embodiment is a pneumatic radial tire for passenger vehicles. This tire is particularly suitable for use as a tire mounted on a vehicle for personal mobility.", "", "FIG.2is a tire width direction cross-section diagram of the pneumatic radial tire for passenger vehicles according to an embodiment of the present disclosure.FIG.2illustrates a tire width direction cross-section under reference conditions, where the tire is mounted on a rim, filled to a prescribed internal pressure, and unloaded. As illustrated inFIG.2, the tire1includes a carcass3consisting of plies of radially arranged cords toroidally extending between a pair of bead portions2. Further, the tire1includes a belt4consisting of two belt layers4a,4bin the illustrated example, and a tread5, in this order, outward from the carcass3in the tire radial direction.", "", "In this example, a bead core2ais embedded in each of the pair of the bead portions2. According to the present disclosure, a cross-sectional shape and material of the bead core2aare not particularly limited, and may have a structure normally used in a pneumatic radial tire for passenger vehicles. According to the present disclosure, the bead core2amay be divided into a plurality of small bead cores. Alternatively, according to the present disclosure, the structure need not include the bead core2a.", "", "The tire1in the illustrated example includes a bead filler2bthat has an approximately triangular shape in cross-section, disposed outward from the bead core2ain the tire radial direction. The cross-sectional shape of the bead filler2bis not limited to this example, and the material of the bead filler2bis also not particularly limited. Alternatively, the tire may be made lighter by not including the bead filler2b.", "", "According to the present embodiment, the tire1may have a structure that includes a rim guard. Further, according to the present embodiment, the bead portion2may further include an additional member such as a rubber layer, a cord layer, or the like for reinforcement or other purposes. Such an additional member may be provided at various positions with respect to the carcass3and the bead filler2b.", "", "In the example illustrated inFIG.2, the carcass3consists of a single carcass ply. However, according to the present disclosure, the number of carcass plies is not particularly limited and may be two or more. Further, in the example illustrated inFIG.2, the carcass3includes a toroidally extending carcass body portion3athat spans between the pair of the bead portions2and turn-up portions3bthat are turned up from the carcass body portion3aaround the bead cores2a. However, according to the present disclosure, the carcass turn-up portions3bmay be wrapped around the bead cores2a, or may be sandwiched between a number of divided small bead cores. According to the illustrated example, ends3cof the carcass turn-up portions3bare positioned outward in the tire radial direction from an outermost end in the tire radial direction of the bead fillers2band inward in the tire radial direction from a tire maximum width position. This allows reduction of the weight of the tire while maintaining rigidity of the sidewall portion. However, according to the present disclosure, the ends3cof the carcass turn-up portions3bmay be positioned inward in the tire radial direction from the outermost end in the tire radial direction of the bead filler2b, or outward in the tire radial direction from the tire maximum width position. Alternatively, the ends3cof the carcass turn-up portions3bmay be an envelope structure, positioned inward in the tire width direction of ends of the belt4(for example, ends of the belt layer4b) between the carcass body portion3aand the belt4in the tire radial direction. Further, in a case where the carcass3is formed of a plurality of carcass plies, the positions of the ends3cof the carcass turn-up portions3b(for example, in the tire radial position) may be the same or different among the carcass plies. The number of cords in the carcass3is not particularly limited, and may be in a range of 20 cords to 60 cords per 50 mm, for example. Further, a carcass line may adopt various structures. For example, a carcass maximum width position in the tire radial direction may be closer to either the bead portions2or the tread5. For example, the carcass maximum width position may be in a range of 50% to 90% of a tire section height, outward in the tire radial direction from a bead base line. The above term “radially arranged” indicates at least 85° to the tire circumferential direction, preferably 90° to the tire circumferential direction.", "", "The tire according to the present embodiment preferably includes at least one inclined belt layer consisting of a rubberized layer of cords extending at an angle to the tire circumferential direction, and two layers is most preferable for the combination of weight reduction and suppression of contact patch distortion. From the viewpoint of weight reduction, one belt layer may be used, and from the viewpoint of suppressing distortion of the contact patch, three or more layers may be used. In the example illustrated inFIG.2, of the two belt layers4aand4b, the width in the tire width direction of the belt layer4boutward in the tire radial direction is smaller than the width in the tire width direction of the belt layer4ainward in the tire radial direction. However, the width in the tire width direction of the belt layer4boutward in the tire radial direction may be greater than or the same as the width in the tire width direction of the belt layer4ainward in the tire radial direction. The width in the tire width direction of the belt layer that has the greatest width in the tire width direction (the belt layer4ain the illustrated example) is preferably 90% to 115% of the ground contact width, and more preferably 100% to 105% of the ground contact width. Here, “ground contact width” refers to the distance in the tire width direction between the ground contact edges E described above.", "", "According to the present embodiment, metal cords, in particular steel cords, are most preferable as belt cords of the belt layers4a,4b, but non-metal, for example, organic fiber cords (such as Kevlar® (Kevlar is a registered trademark in Japan, other countries, or both)) may be used. The steel cords may include steel as a main component, and may contain various micro inclusions such as carbon, manganese, silicon, phosphorus, sulfur, copper, and chromium. According to the present embodiment, the belt cords of the belt layers4a,4bmay be monofilament cords, cords with a plurality of filaments drawn together, or cords with a plurality of filaments twisted together. Various twist structures may be adopted, including cross-section structure, twist pitch, twist direction, and distance between adjacent filaments. Cords obtained by twisting filaments of different materials may also be used, which may employ various twist structures such as single twist, layer twist, and multi twist, without being limited to any particular cross-section structure.", "", "According to the present embodiment, an inclination angle of the belt cords of the belt layers4a,4bis preferably 10° or more with respect to the tire circumferential direction. According to the present embodiment, the inclination angle of the belt cords of the belt layers4a,4bis preferably a high angle, specifically 20° or more, preferably 35° or more, and more preferably in a range of 55° to 85° with respect to the tire circumferential direction. By setting the inclination angle to 20° or more (preferably 35° or more), the rigidity with respect to the tire width direction may be increased, and steering stability, particularly when cornering, may be improved. Further, shearing deformation of the inter-layer rubber may be reduced, and rolling resistance may be reduced.", "", "In the illustrated example, the tread rubber of the tread5consists of one layer. However, according to the present embodiment, the tread rubber of the tread5may be formed by a plurality of different rubber layers stacked in the tire radial direction. The plurality of rubber layers may be different from one another in terms of tangent loss, modulus, hardness, glass transition temperature, material, or the like. Further, ratios of thicknesses of the plurality of rubber layers in the tire radial direction may vary in the tire width direction. Further, circumferential main groove bottoms and the like may be composed of a rubber layer different from that in a surrounding region. Further, the tread rubber of the tread5may be formed by a plurality of different rubber layers in the tire width direction. The plurality of rubber layers may be different from one another in terms of tangent loss, modulus, hardness, glass transition temperature, material, or the like. Further, ratios of thicknesses of the plurality of rubber layers in the tire width direction may vary in the tire radial direction. Further, rubber layers in a limited region, such as in the vicinity of the circumferential main grooves alone, in the vicinity of the ground contact edges E alone, in the shoulder land portions alone, or in the center land portion, may be formed as rubber layers different from the surroundings.", "", "FIG.3is a developed view illustrating a tread pattern of the pneumatic radial tire for passenger vehicles according to an embodiment of the present disclosure.", "", "As illustrated inFIG.2andFIG.3, in this example, the tire1has only two circumferential main grooves6extending in the tire circumferential direction on the contact surface of the tread5. In this example, the circumferential main grooves6extend straight in the tire circumferential direction, but may extend in a zigzag shape or curved shape. The groove width (opening width) of the circumferential main grooves6is not particularly limited, and may be 2 mm to 5 mm, for example. The groove depth (maximum depth) of the circumferential main grooves6is not particularly limited, and may be 3 mm to 6 mm, for example. Here, according to the present embodiment, the barycenter of the circumferential main grooves6is positioned in the half portion of the tire on the vehicle-mounted inward side, which is one side of the tire in the tread width direction with the tire equatorial plane CL as a boundary. In the illustrated example, one circumferential main groove6ais provided on one side in the tire width direction (vehicle-mounted inward side) and the other circumferential main groove6bis provided on the other side in the tire width direction (vehicle-mounted outward side). The circumferential main groove6aand the circumferential main groove6bhave the same groove width, and a clearance distance between the circumferential main groove6aand the tire equatorial plane in the tire width direction is greater than a clearance distance between the circumferential main groove6band the tire equatorial plane in the tire width direction, and therefore the barycenter of the two circumferential main grooves6is positioned on the vehicle-mounted inward side.", "", "In the illustrated example, the tire1does not have a width direction groove extending in the tire width direction on the contact surface of the tread5, but the tire1may have one or more width direction grooves.", "", "The tire1according to the present embodiment includes an inner liner8on an inner surface7of the tire (also referred to simply as the tire inner surface7). Thickness of the inner liner8is preferably about 1.5 mm to 2.8 mm. This may effectively reduce cabin noise in a range of 80 Hz to 100 Hz. An air permeability coefficient of a rubber composition of the inner liner8is preferably 1.0×10−14cc·cm/(cm2·s·cmHg) or greater and 6.5×10−10cc·cm/(cm2·s·cmHg) or less.", "", "As illustrated inFIG.2, according to the present embodiment, in the tire width direction cross-section, under the reference conditions described above, when a straight line passing through a point on the tread surface on the tire equatorial plane CL and parallel to the tire width direction is m1, a straight line passing through the ground contact edges E and parallel to the tire width direction is m2, a distance between the straight line m1 and the straight line m2 in the tire radial direction is a drop height LCR, and the tread width of the tire1is TW, a ratio LCR/TW is greater than 0.045 (Configuration 1).", "", "The following is an explanation of effects of the pneumatic radial tire for passenger vehicles according to the present embodiment.", "", "The pneumatic radial tire for passenger vehicles according to the present embodiment has a narrow sectional width SW of less than 165 mm, even among narrow width, large diameter tires for which the sectional width SW and the outer diameter satisfy the relational equation described above. According to such a tire, air resistance in particular may be reduced, and rolling resistance may also be reduced, thereby improving the fuel efficiency of the tire.", "", "However, as schematically illustrated on a left side of the arrow inFIG.4, with such a tire, the ground contact area may become too elongated when the camber angle changes, such as during cornering, and the ground contact area may deteriorate, resulting in reduced steering stability and the like.", "", "To address this, first, in the tire according to the present embodiment, the ratio LCR/TW is greater than 0.045. This results in a tire that has a relatively round crown shape, and therefore a rounded ground contact area, with the shoulder portion having a shorter ground contact length relative to the center portion. This inhibits the ground contact area from becoming too elongated when the camber angle changes, as illustrated schematically on the right side of the arrow inFIG.4, and suppresses deterioration of the ground contact area.", "", "Further, the narrow width tire described above has excellent drainage to the side of the tire, and therefore even when the tire has only two circumferential main grooves6, drainage performance may be sufficiently secured. The barycenter of the two circumferential main grooves6is positioned in the half portion of the tire on the vehicle-mounted inward side, which is one side of the tire in the tread width direction with the tire equatorial plane CL as a boundary, and therefore a distance until an air column resonance sound generated in the circumferential main grooves6reaches the outside of the vehicle is farther (compared to a case where the barycenter of the two circumferential main grooves6is positioned on the vehicle-mounted outward side), enabling improvement in low-noise performance due to noise attenuation.", "", "The ratio LCR/TW is more preferably 0.05 or greater. This is because deterioration of the ground contact area may be further suppressed. On the other hand, from the viewpoint of reducing rolling resistance, the ratio LCR/TW is preferably 0.1 or less.", "", "Further, the groove width (opening width) of the circumferential main grooves6is preferably 20% or less of the ground contact width, and more preferably 15% or less of the ground contact width. This is to secure an area of a land portion. For the same reason, a negative ratio of the contact surface of the tread is preferably 20% or less, and more preferably 15% or less.", "", "Here, “negative ratio” refers to a ratio of an area of grooves having a groove width of 2 mm or greater (circumferential main groove and width direction groove) to an area of the contact surface of the tread in the tread developed view.", "", "Further, on the vehicle-mounted inward side, the width in the tire width direction of the land portion demarcated by the tread edge and the circumferential main grooves6is preferably 20% or greater of the ground contact width, and more preferably 25% or greater of the ground contact width. This is to mitigate a load-bearing rate and ground contact pressure concentration in the land portion and suppress uneven wear. Further, buckling in the vicinity of the circumferential main grooves6may be suppressed, which has an effect of improving grounding property.", "", "FIG.5is a schematic diagram for explanation of the ground contact area. As another aspect, a ground contact length L1 on the tire equatorial plane CL is longer than an average value of ground contact lengths L2 and L3 ((L2+L3)/2) at tire width direction positions P1 and P2, which are spaced 20% of the ground contact width inward in the tire width direction from both ground contact edges E (Configuration 2). Even in this case, the ground contact area may be rounded, with the shoulder portion having a shorter ground contact length relative to the center portion. This inhibits the ground contact area from becoming too elongated when the camber angle changes, as illustrated schematically on the right side of the arrow inFIG.4, and suppresses deterioration of the ground contact area. The ground contact length L1 is preferably 1.1 times the average of the ground contact lengths L2 and L3 or greater. On the other hand, from the viewpoint of uneven wear mitigation performance, the ground contact length L1 is preferably 1.5 times the average of the ground contact lengths L2 and L3 or less.", "", "Further, as another aspect, as illustrated inFIG.2, a gauge G1 of the tread on the tire equatorial plane is greater than an average value ((G2+G3)/2) of gauges G2 and G3 of the tread at positions P1 and P2, which are spaced 20% of the ground contact width inward in the tire width direction from both ground contact edges E (Configuration 3). This results in a tire that has a relatively round crown shape, and therefore a rounded ground contact area, with the shoulder portion having a shorter ground contact length relative to the center portion. This inhibits the ground contact area from becoming too elongated when the camber angle changes, as illustrated schematically on the right side of the arrow inFIG.4, and suppresses deterioration of the ground contact area. Further, the thinner gauges at the positions P1 and P2 provide greater tread rigidity at these positions, which is advantageous for improving steering stability when cornering. The gauge G1 is preferably 1.1 times the average of the gauges G2 and G3 or greater. On the other hand, from the viewpoint of uneven wear mitigation performance, the gauge G1 is preferably 1.5 times the average value of the gauges G2 and G3 or less.", "", "According to the present disclosure, it suffices that any one or more of the above Configurations 1 to 3 are satisfied, and any two or all three may be satisfied.", "", "FIG.6is a developed view illustrating another example of a tread pattern. According to this example, one or more width direction sipes9(9a) extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to the land portion on a vehicle-mounted outward side that is demarcated by one of the circumferential main grooves6and the tread edge (in the illustrated example, the width direction sipes9(9a) are provided).", "", "According to this configuration, the compressive rigidity of the land portion may be somewhat reduced to equalize the ground contact pressure.", "", "Here, a “sipe” of the width direction sipes has a sipe width (opening width) of less than 2 mm.", "", "FIG.7is a developed view illustrating another example of a tread pattern. According to this example, one or more width direction sipes9(9b) extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to the land portion on a vehicle-mounted inward side that is demarcated by one of the circumferential main grooves6and the tread edge (in the illustrated example, the width direction sipes9(9b) are provided).", "", "This configuration is able to mitigate input of force from road surface irregularities and improve noise, vibration, and harshness (NVH) performance.", "", "The sipe depth (maximum depth) of the width direction sipes9a,9band hole-shaped sipes is not particularly limited, and may be 2 mm to 6 mm, for example. The pitch interval of the width direction sipes9a,9bin the tire circumferential direction is not particularly limited, and may be 10 mm to 40 mm, for example.", "", "FIG.8is a diagram illustrating a variation of circumferential main groove arrangement. In the example illustrated inFIG.8, the two circumferential main grooves6a,6bare both provided to one half portion in the tire width direction (vehicle-mounted inward side) with the tire equatorial plane CL as a boundary. In such a case, the barycenter of the two circumferential main grooves is of course positioned on the vehicle-mounted inward side.", "", "As a further variation, any one of the circumferential main grooves may be positioned on the tire equatorial plane. In this case, the barycenter of the two circumferential main grooves may be positioned on the vehicle-mounted inward side by providing the other circumferential main groove to one half portion in the tire width direction (vehicle-mounted inward side) with the tire equatorial plane CL as a boundary."], "claims": ["sectional width SW of the tire is less than 165 mm, a ratio SW/OD of the sectional width SW to outer diameter OD of the tire is 0.26 or less, or the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the relational equation OD (mm)≥−0.0187×SW (mm) in a tire width direction cross-section, under reference conditions where the tire is mounted on a rim, filled with a prescribed internal pressure, and unloaded, when a straight line passing through a point on a tread surface on a tire equatorial plane and parallel to a tire width direction is m1, a straight line passing through ground contact edges E and parallel to the tire width direction is m2, a distance between the straight line m1 and the straight line m2 in a tire radial direction is a drop height L a contact surface of the tread has only two circumferential main grooves extending in a tire circumferential direction, and a barycenter of the two circumferential main grooves is positioned in a half portion of the tire on a vehicle-mounted inward side, which is one side of the tire in a tread width direction with the tire equatorial plane as a boundary.", "sectional width SW of the tire is less than 165 mm, a ratio SW/OD of the sectional width SW to outer diameter OD of the tire is 0.26 or less, or the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the relational equation OD (mm)≥−0.0187×SW (mm) ground contact length on a tire equatorial plane is longer than an average value of ground contact lengths at positions 20% of ground contact width inward in a tire width direction from both ground contact edges, a contact surface of the tread has only two circumferential main grooves extending in a tire circumferential direction, and a barycenter of the two circumferential main grooves is positioned in a half portion of the tire on a vehicle-mounted inward side, which is one side of the tire in a tread width direction with the tire equatorial plane as a boundary.", "sectional width SW of the tire is less than 165 mm, a ratio SW/OD of the sectional width SW to outer diameter OD of the tire is 0.26 or less, or the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the relational equation OD (mm)≥−0.0187×SW (mm) gauge of the tread on a tire equatorial plane is greater than an average value of gauges of the tread at positions 20% of ground contact width inward in a tire width direction from both ground contact edges, a contact surface of the tread has only two circumferential main grooves extending in a tire circumferential direction, and a barycenter of the two circumferential main grooves is positioned in a half portion of the tire on a vehicle-mounted inward side, which is one side of the tire in a tread width direction with the tire equatorial plane as a boundary.", "4 . The pneumatic radial tire for passenger vehicles according to claim 1 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted outward side that is demarcated by one of the circumferential main grooves and a tread edge.", "5 . The pneumatic radial tire for passenger vehicles according to claim 1 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted inward side that is demarcated by one of the circumferential main grooves and a tread edge.", "6 . The pneumatic radial tire for passenger vehicles according to claim 2 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted outward side that is demarcated by one of the circumferential main grooves and a tread edge.", "7 . The pneumatic radial tire for passenger vehicles according to claim 3 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted outward side that is demarcated by one of the circumferential main grooves and a tread edge.", "8 . The pneumatic radial tire for passenger vehicles according to claim 2 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted inward side that is demarcated by one of the circumferential main grooves and a tread edge.", "9 . The pneumatic radial tire for passenger vehicles according to claim 3 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted inward side that is demarcated by one of the circumferential main grooves and a tread edge.", "10 . The pneumatic radial tire for passenger vehicles according to claim 4 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted inward side that is demarcated by one of the circumferential main grooves and a tread edge.", "11 . The pneumatic radial tire for passenger vehicles according to claim 6 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted inward side that is demarcated by one of the circumferential main grooves and a tread edge.", "12 . The pneumatic radial tire for passenger vehicles according to claim 7 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted inward side that is demarcated by one of the circumferential main grooves and a tread edge."], "bibtex": "@patent{20240408917,\n    title = {PNEUMATIC RADIAL TIRE FOR PASSENGER VEHICLES},\n    number = {20240408917},\n    year = {2024},\n    note = {File: US20240408917A1-20241212.XML}\n    }", "classification": "B60C1112FI"}, {"title": "THREE-DIMENSIONAL TIRE SIPE WITH VARIABLE CROSS-SECTION", "doc_number": "20240408918", "filename": "US20240408918A1-20241212.XML", "abstract": "Various aspects of a tire having a three-dimensional tire sipe with a variable cross-section are disclosed. In one aspect, a tire having a sipe is provided, the tire comprising: wherein the sipe is a three-dimensional sipe extending radially inwardly into the tire from a tread surface of the tire, wherein the sipe includes a horizontal undulating portion having at least one horizontal midpoint portion and at least one horizontal peak portion, wherein the sipe includes a radial undulating portion having a vertical amplitude VA 1 in the at least one horizontal midpoint portion and a vertical amplitude VA 2 in the at least one horizontal peak portion, and wherein the vertical amplitude VA 1 is greater than the vertical amplitude VA 2.", "detailed_description": ["Tires not intended for operation on smooth, dry surfaces typically comprise a tread pattern, including a least one groove, at least one rib, and/or a plurality of tread blocks. Tires intended for operation in inclement conditions, including for example icy or snowy conditions, may additionally comprise a plurality of sipes in the tire tread. The addition of sipes in the tire tread may result in more surface edges in the tire tread for engagement with the icy or snowy roadway.", "", "Increasing the length of a sipe, such as providing the sipe with a three-dimensional pattern, may increase the amount and length of cutting edges available to engage snowy, icy, and/or wet road surfaces.", "", "Providing the sipe with a three-dimensional pattern in at least one of the lateral direction of the tire and the radial direction of the tire, may allow opposing walls of the sipe to at least partially engage one another in a high friction, or locking, manner to maintain a desired stiffness of the tire tread block or tire tread rib. Maintaining a specified level of stiffness in the tire tread may mitigate or eliminate irregular wear patterns. Maintaining a specified level of stiffness in the tire tread may improve stopping distance of the tire. Maintaining a specified level of stiffness in the tire tread may improve traction of the tire.", "", "Providing interlocking three-dimensional sipes that are as thin as possible in their interlocking regions may be advantageous. Thus, sipe thicknesses (and thus sipe blade thicknesses) of 0.3 mm or less may provide advantageous results. Further, sipe thicknesses (and thus sipe blade thicknesses) below 0.3 mm may be more advantageous.", "", "However, sipe blades used to form sipes having the desired traction while maintaining the desired block stiffness are often made as thin as possible, which may lead to sipe blade durability issues.", "", "FIGS.1A-1Dillustrate a three-dimensional sipe120with a variable cross-section.", "", "FIG.1Aillustrates a tire tread100having a tread surface102and at least one rib/block row104,106,108,110, separated by at least one groove112,114,116. At least one rib/block row104,106,108,110includes at least one three-dimensional sipe120. At least one rib/block row104,106,108,110may include at least one slot118.", "", "For consistency, the X-axis is oriented in the circumferential direction of the tire, the Y-axis is oriented in the axial direction of the tire, and the Z-axis is oriented in the radial direction of the tire.", "", "FIG.1Billustrates a plan view of three-dimensional sipe120. Sipe120extends radially inwardly from tread surface102. Sipe120may include terminal ends122, which may be the axially outmost ends of sipe120. Sipe120may include a horizontal undulating portion124. Horizontal undulating portion124is oriented between horizontal non-undulating portions126, which extend to terminal ends122.", "", "Horizontal undulating portion124may form, at tread surface102, a wave, which may be a sinusoidal wave. Horizontal undulating portion124may instead be linear elements angled relative to one another and connected by curves/filets. Horizontal undulating portion124of sipe120includes horizontal peak portions128and horizontal midpoint portions130. A sectional view of sipe120at horizontal midpoint portion130(taken about section A-A) is illustrated inFIG.1C, while a sectional view of sipe120at horizontal peak portion128(taken about section B-B) is illustrated inFIG.1D. These sectional views of sipe120include radial undulating portions136having differing vertical amplitudes VA1, VA2as described further below.", "", "Horizontal undulating portion124may have a surface thickness TS. Surface thickness TS may range between the value of the internal thickness TI (seeFIGS.1C and1D) and 1.50 mm. Surface thickness TS may be between 0.05 mm and 1.50 mm. Surface thickness TS may be 0.60 mm.", "", "At least a portion of horizontal non-undulating portions126may intersect groove112,114,116and wherein horizontal non-undulating portions126may include a sipe thickness equal to surface thickness TS, throughout the radial depth of sipe120. Terminal ends122may include a sipe thickness equal to surface thickness TS, throughout the radial depth of sipe120.", "", "Horizontal undulating portion124may have a horizontal period HP. Horizontal period HP may be between 4.50 mm and 15.00 mm. Horizontal period HP may be 7.50 mm, 6.64 mm, or 10.40 mm.", "", "Horizontal undulating portion124may have a horizontal amplitude HA. Horizontal amplitude HA is measured from the centerline of sipe120at horizontal peak portions128. Horizontal amplitude HA may be between 1.50 mm and 3.50 mm. Horizontal amplitude HA may be 2.40 mm or 2.11 mm.", "", "Horizontal undulating portion124may have a horizontal angle A1measured between a centerline of sipe120(e.g., a line parallel to and extending longitudinally down the middle of horizontal non-undulating portions126) and the centerline of a horizontal midpoint portion130. Horizontal angle A1may be between 35 degrees and 55 degrees. Horizontal angle A1may be 45 degrees.", "", "FIG.1Cillustrates sipe120taken about section A-A illustrated inFIG.1BandFIG.1Dillustrates sipe120taken about section B-B illustrated inFIG.1B. Sipe120may include a radially outer portion132, which may include sloped walls transitioning between surface thickness TS and internal thickness TI, or parallel walls (where TS=TI). Sipe120may include a radially inner portion134that may include sloped walls transitioning between internal thickness TI and a base thickness TB, or parallel walls (where TI=TB). Sipe120may include radial undulating portion136oriented between radially outer portion132and radially inner portion134. Radially inner portion134may have a rounded base.", "", "Internal thickness TI may be between 0.05 mm and surface thickness TS. Internal thickness TI may be between 0.05 mm and 1.50 mm. Internal thickness TI may be 0.15 mm or 0.30 mm.", "", "Base thickness TB may range between the value of the internal thickness TI and 1.50 mm. Base thickness TB may be between 0.05 mm and 1.50 mm. Base thickness TB may be 0.60 mm. Base thickness TB may be equal to surface thickness TS.", "", "Radial undulating portion136may form a wave, which may be a sinusoidal wave. Radial undulating portion136may instead be linear elements angled relative to one another and connected by curves/filets.", "", "The overall depth D of sipe120may be between 4.50 mm and 20.00 mm. Depth D may be 6.30 mm, 6.80 mm, 6.70 mm, or 11.18 mm.", "", "The first radially inward peak of radial undulating portion136may have a depth P1from tread surface102of between about 1.20 mm and 2.40 mm. Depth P1may be 1.70 mm.", "", "Radial undulating portion136may include a vertical period VP. Vertical period VP may be between 1.60 mm and 3.50 mm. Vertical period VP may be 2.30 mm or 2.50 mm.", "", "Referring specifically toFIG.1Cand sipe120at a horizontal midpoint portion130, radial undulating portion136may include a vertical amplitude VA1. Vertical amplitude VA1may be between vertical amplitude VA2and 1.50 mm. Vertical amplitude VA1may be 0.82 mm or 1.00 mm. Vertical amplitude VA1is greater than vertical amplitude VA2.", "", "Sipe120at a horizontal midpoint portion130, may include a radial undulating portion136with a radius R1. Radius R1may be between 0.15 mm and 1.50 mm. Radius R1may be 0.15 mm.", "", "Radial undulating portion136may have a radial angle RA1measured between a sipe120(e.g., a line parallel the radial, Z-axis) and the centerline of a sipe120. Radial angle RA1may be between radial angle RA2and 45 degrees. Radial angle RA1may be 41 degrees.", "", "Referring specifically toFIG.1Dand sipe120at a horizontal peak portion128, radial undulating portion136may include a vertical amplitude VA2. Vertical amplitude VA2may be between vertical amplitude 0.00 mm and VA1. Vertical amplitude VA2may be 0.23 mm or 0.70 mm. Vertical amplitude VA2is less than vertical amplitude VA1.", "", "Sipe120at a horizontal peak portion128, may include a radial undulating portion136with a radius R2. Radius R2is greater than radius R1. Radius R2may be 0.63 mm or 4.45 mm.", "", "Radial undulating portion136may have a radial angle RA2measured between a sipe120(e.g., a line parallel the radial, Z-axis) and the centerline of a sipe120. Radial angle RA2may be between 0 degrees and angle RA1. Radial angle RA2may be 13 degrees or 4 degrees.", "", "Between horizontal midpoint portion130and horizontal peak portion128, sipe120has a smooth, blended transition between the two sipe profiles illustrated inFIGS.1C and1D, with vertical amplitudes transitioning between vertical amplitudes VA1and VA2, and back.", "", "FIGS.2A and2Billustrate a sectional view of a three-dimensional sipe220having a vertical undulating portion236with 1.5 radial periods (FIG.2A) and 2.5 radial periods (FIG.2B). Sipes220may extend radially inwardly from a tread surface202and may include a radially outer portion232, a radially inner portion234, and a radial undulating portion236.", "", "Radial undulating portion236may include one or more full period portion240and/or one or more half period portion242. Radial undulating portion236may include between 1.0 and 8.0 periods. Radial undulating portion236may include 1.5 periods, 2.5 periods, or 3.5 periods.", "", "The varying amplitude (VA1and VA2) as described herein may act to improve the strength of a sipe blade used to make sipes120,220, while allowing the thickness of the sipe blade (and sipes120,220) to be minimized without concerns regarding blade durability. Sipe blades used to make sipe120,220may be able to be made radially “taller,” for deeper overall depths D without concerns regarding blade durability. Sipes120,220may exhibit improvement in dry braking (2.5% improvement versus prior art sipes) and improvement in wet performance (2.0% improvement versus prior art sipes).", "", "To the extent that the term “includes” or “including” is used in the specification or the claims, it is intended to be inclusive in a manner similar to the term “comprising” as that term is interpreted when employed as a transitional word in a claim. Furthermore, to the extent that the term “or” is employed (e.g., A or B) it is intended to mean “A or B or both.” When the applicants intend to indicate “only A or B but not both” then the term “only A or B but not both” will be employed. Thus, use of the term “or” herein is the inclusive, and not the exclusive use. See Bryan A. Garner, A Dictionary of Modern Legal Usage 624 (2d. Ed. 1995). Also, to the extent that the terms “in” or “into” are used in the specification or the claims, it is intended to additionally mean “on” or “onto.” To the extent that the term “substantially” is used in the specification or the claims, it is intended to take into consideration the degree of precision available or prudent in manufacturing. To the extent that the term “selectively” is used in the specification or the claims, it is intended to refer to a condition of a component wherein a user of the apparatus may activate or deactivate the feature or function of the component as is necessary or desired in use of the apparatus. To the extent that the term “operatively connected” is used in the specification or the claims, it is intended to mean that the identified components are connected in a way to perform a designated function. As used in the specification and the claims, the singular forms “a,” “an,” and “the” include the plural. Finally, where the term “about” is used in conjunction with a number, it is intended to include ±10% of the number. In other words, “about 10” may mean from 9 to 11. Cartesian coordinates referenced herein are intended to comply with the SAE tire coordinate system.", "", "As stated above, while the present application has been illustrated by the description of aspects thereof, and while the aspects have been described in considerable detail, it is not the intention of the applicants to restrict or in any way limit the scope of the appended claims to such detail. Additional advantages and modifications will readily appear to those skilled in the art, having the benefit of the present application. Therefore, the application, in its broader aspects, is not limited to the specific details, illustrative examples shown, or any apparatus referred to. Departures may be made from such details, examples, and apparatuses without departing from the spirit or scope of the general inventive concept."], "claims": ["wherein the sipe is a three-dimensional sipe extending radially inwardly into the tire from a tread surface of the tire, wherein the sipe includes a horizontal undulating portion having at least one horizontal midpoint portion and at least one horizontal peak portion, wherein the sipe includes a radial undulating portion having a vertical amplitude VA wherein the vertical amplitude VA", "2 . The tire of claim 1 , wherein the value of the vertical amplitude VA 1 is between the value of the vertical amplitude VA 2 and 1.50 mm.", "3 . The tire of claim 1 , wherein the value of the vertical amplitude VA 2 is between 0.00 mm and the value of the vertical amplitude VA 1 .", "4 . The tire of claim 1 , wherein the radial undulating portion has a thickness between 0.05 mm and 1.50 mm.", "5 . The tire of claim 1 , wherein the sipe includes a radially outer portion that intersects the tread surface, wherein the radially outer portion has a thickness that is greater than a thickness of the radial undulating portion.", "6 . The tire of claim 1 , wherein the sipe includes a radially inner portion, wherein the radially inner portion has a thickness that is greater than a thickness of the radial undulating portion.", "7 . The tire of claim 1 , wherein the radial undulating portion includes a vertical period, wherein the vertical period is between 1.60 mm and 3.50 mm.", "8 . The tire of claim 1 , wherein the radial undulating portion includes between 1.0 and 8.0 periods.", "9 . The tire of claim 5 , wherein the sipe includes horizontal non-undulating portions oriented on each side of the horizontal undulating portion, and wherein the horizontal non-undulating portions have a thickness that is equal to the radially outer portion thickness.", "wherein the sipe is a three-dimensional sipe extending radially inwardly into the tire from a tread surface of the tire, wherein the sipe includes a horizontal undulating portion having at least one horizontal midpoint portion and at least one horizontal peak portion, wherein the sipe includes a radial undulating portion having a vertical amplitude VA wherein the vertical amplitude VA wherein the value of the vertical amplitude VA wherein the value of the vertical amplitude VA", "11 . The tire of claim 10 , wherein the radial undulating portion has a thickness between 0.05 mm and 1.50 mm.", "12 . The tire of claim 10 , wherein the sipe includes a radially outer portion that intersects the tread surface, wherein the radially outer portion has a thickness that is greater than a thickness of the radial undulating portion.", "13 . The tire of claim 10 , wherein the sipe includes a radially inner portion, wherein the radially inner portion has a thickness that is greater than a thickness of the radial undulating portion.", "14 . The tire of claim 10 , wherein the radial undulating portion includes a vertical period, wherein the vertical period is between 1.60 mm and 3.50 mm.", "15 . The tire of claim 10 , wherein the radial undulating portion includes between 1.0 and 8.0 periods.", "16 . The tire of claim 12 , wherein the sipe includes horizontal non-undulating portions oriented on each side of the horizontal undulating portion, and wherein the horizontal non-undulating portions have a thickness that is equal to the radially outer portion thickness."], "bibtex": "@patent{20240408918,\n    title = {THREE-DIMENSIONAL TIRE SIPE WITH VARIABLE CROSS-SECTION},\n    number = {20240408918},\n    year = {2024},\n    note = {File: US20240408918A1-20241212.XML}\n    }", "classification": "B60C1112FI"}, {"title": "DIRECTIONAL INTERLOCKING SIPE AND/OR SLOT", "doc_number": "20240408919", "filename": "US20240408919A1-20241212.XML", "abstract": "In one aspect, a tire is provided, the tire comprising: a tread portion comprising at least one of a tread rib or a tread block, a sipe included in the tread rib or the tread block, wherein the sipe includes a central s-shaped portion located axially between opposing laterally extending straight portions, wherein the sipe includes a plurality of key portions angled in a first circumferential direction, wherein the sipe includes a plurality of return portions angled in a second circumferential direction, wherein the return portions connect the key portions, and wherein a first key portion intersects a tread surface of the tread rib or the tread block. The plurality of key portions are angled at an angle KA, the plurality of return portions are angled at an angle RA, and the ratio of the angle KA to the angle RA is at least 5:1.", "detailed_description": ["Axes and planes described herein are illustrated in the figures and include a circumferential axis C oriented in the circumferential direction of the tire, a radial axis R oriented in the radial direction of the tire, and an axial axis A oriented in the axial direction of the tire.", "", "FIG.1illustrates a tire tread100having a tread block106with a directional interlocking sipe and/or slot110. Tread100includes a tread surface101, which is the radially outer surface of tread100that contacts the driving surface. Tread100may include a plurality of blocks106oriented in block rows defined by one or more circumferential groove104, including for example, shoulder rows160, intermediate rows162, and one or more center row164. Alternatively, tire tread100may include ribs (defined by one or more circumferential grooves104) instead of independent blocks106, the ribs being oriented in the aforementioned shoulder, intermediate, and center orientations.", "", "Tire tread100includes one or more directional interlocking sipes and/or slots110. Sipes and/or slots110may include a central s-shaped portion112oriented axially between laterally extending straight portions114. Sipes and/or slots110may include only straight portions114, as illustrated for example only in shoulder rows160of the example tire tread100. Tire tread100may include sipes and/or slots110of each arrangement (with a central s-shaped portion112, or without a central s-shaped portion112). It is contemplated that these alternative sipe and/or slot arrangements110may be contained in differing block rows160,162,164as illustrated, or may be intermixed within the same block row160,162,164or even the same block106.", "", "For brevity and readability, the term “sipe” as used herein is intended to refer a sipe and/or slot, which may refer to any small incision within a tread block or rib and/or any small lateral groove circumferentially separating tread blocks or breaking up a tread rib. The use of the term “sipe” is not intended as excluding slots as used herein.", "", "FIGS.2A-2Fillustrate various possible aspects of sipe blade230for forming a directional interlocking sipe and/or slot, including for example sipe and/or slot110illustrated inFIG.1.", "", "Sipe blade230includes an upper mold insertion portion232, and a lower sipe forming portion234.", "", "Upper portion232includes a centerline CL. Upper portion232includes a circumferential tread surface sipe width TSW, which is the width of the sipe (e.g., sipe and/or slot110) at the tread surface (e.g., tread surface101). Width TSW may be about 0.60 mm. Width TSW may be 0.60 mm. Width TSW may be between about 0.50 mm and about 0.70 mm. Width TSW may be between 0.50 mm and 0.70 mm. Width TSW may be between about 0.40 mm and about 0.80 mm. Width TSW may be between 0.40 mm and 0.80 mm. Width TSW may be between about 0.30 mm and about 0.90 mm. Width TSW may be between 0.30 mm and 0.90 mm.", "", "Lower portion234includes a plurality of key portions236. A first key portion236is radially inward of and directly connected to upper portion232. Each key portion236is connected to another key portion236by a return portion238.", "", "In one aspect, lower portion234includes at its radially outermost position (immediately radially inward of upper portion232) a first key portion236, with a first return portion238extending radially inwardly therefrom, a second key portion236extending radially inwardly from the first return portion238, with a second return portion238extending radially inwardly therefrom, and finally a third key portion236extending radially inwardly from the second return portion238.", "", "Each key portion236is angled at an angle KA from the circumferential direction, measured tangential to the tread surface (e.g., tread surface101). Each key portion236is angled in the same direction (e.g., in a first circumferential direction). Angle KA may be about 60 degrees. Angle KA may be 60 degrees. Angle KA may be between about 55 degrees and about 65 degrees. Angle KA may be between 55 degrees and 65 degrees. Angle KA may be between about 50 degrees and about 70 degrees. Angle KA may be between 50 degrees and 70 degrees. Angle KA may be between about 45 degrees and about 75 degrees. Angle KA may be between 45 degrees and 75 degrees.", "", "Each return portion238is angled at an angle RA from the circumferential direction, measured tangential to the tread surface (e.g., tread surface101). Each return portion238is angled in the same direction (e.g., in a second circumferential direction), opposite that of each key portion236(e.g., the first circumferential direction). Angle RA may be about 11 degrees. Angle RA may be 11 degrees. Angle RA may be between about 9 degrees and about 15 degrees. Angle RA may be between 9 degrees and 15 degrees. Angle RA may be between about 7 degrees and about 19 degrees. Angle RA may be between 7 degrees and 19 degrees. Angle RA may be between about 5 degrees and about 23 degrees. Angle RA may be between 5 degrees and 23 degrees.", "", "Wherein the ratio of angle KA to angle RA is at least 5:1. Wherein the ratio of angle KA to angle RA is between 5:1 and 6:1.", "", "Each key portion236includes a width KW. Width KW is measured transversely (90 degrees from) the longitudinal direction of each key portion236. Width KW may be about 0.30 mm. Width KW may be 0.30 mm. Width KW may be between about 0.25 mm and about 0.40 mm. Width KW may be between 0.25 mm and 0.40 mm. Width KW may be between about 0.20 mm and about 0.50 mm. Width KW may be between 0.20 mm and 0.50 mm. Width KW may be between about 0.15 mm and about 0.60 mm. Width KW may be between 0.15 mm and 0.60 mm.", "", "Each return portion238includes a width RW. Width RW is measured transversely (90 degrees from) the longitudinal direction of each return portion238. Width RW may be about 0.40 mm. Width RW may be 0.40 mm. Width RW may be between about 0.35 mm and about 0.50 mm. Width RW may be between 0.35 mm and 0.50 mm. Width RW may be between about 0.30 mm and about 0.60 mm. Width RW may be between 0.30 mm and 0.60 mm. Width RW may be between about 0.25 mm and about 0.70 mm. Width RW may be between 0.25 mm and 0.70 mm.", "", "The ratio of the width KW to the width RW may be 3:4.", "", "First key portion236joins first return portion238at a first vertex that is a radial height KH1from the tread surface (the junction between upper portion232and lower portion234), such as tread surface101.", "", "In the aspect illustrated inFIG.2A, height KH1may be about 2.76 mm. Height KH1may be 2.76 mm. Height KH1may be between about 2.50 mm and about 3.00 mm. Height KH1may be between 2.50 mm and 3.00 mm. Height KH1may be between about 2.00 mm and about 3.50 mm. Height KH1may be between 2.00 mm and 3.50 mm. Height KH1may be between about 1.50 mm and about 4.00 mm. Height KH1may be between 1.50 mm and 4.00 mm.FIG.2Amay be, for example, a sipe blade230for forming a sipe and/or slot in a shoulder rib or shoulder block row (e.g., shoulder row160).", "", "In the aspect illustrated inFIG.2B, height KH1may be about 2.17 mm. Height KH1may be 2.17 mm. Height KH1may be between about 2.00 mm and about 2.50 mm. Height KH1may be between 2.00 mm and 2.50 mm. Height KH1may be between about 1.50 mm and about 3.00 mm. Height KH1may be between 1.50 mm and 3.00 mm. Height KH1may be between about 1.00 mm and about 3.5 mm. Height KH1may be between 1.00 mm and 3.50 mm.FIG.2Bmay be, for example, a sipe blade230for forming a sipe and/or slot in an intermediate rib or intermediate block row (e.g., intermediate row162).", "", "In the aspect illustrated inFIG.2C, height KH1may be about 1.48 mm. Height KH1may be 1.48 mm. Height KH1may be between about 1.25 mm and about 1.75 mm. Height KH1may be between 1.25 mm and 1.75 mm. Height KH1may be between about 1.00 mm and about 2.00 mm. Height KH1may be between 1.00 mm and 2.00 mm. Height KH1may be between about 0.75 mm and about 2.25 mm. Height KH1may be between 0.75 mm and 2.25 mm.FIG.2Cmay be, for example, a sipe blade230for forming a sipe and/or slot in a center rib or center block row (e.g., center row164).", "", "Second key portion236joins second return portion238at a second vertex that is a radial height KH2from the first vertex.", "", "In the aspect illustrated inFIG.2A, height KH2may be about 2.17 mm. Height KH2may be 2.17 mm. Height KH2may be between about 2.00 mm and about 2.50 mm. Height KH2may be between 2.00 mm and 2.50 mm. Height KH2may be between about 1.50 mm and about 3.00 mm. Height KH2may be between 1.50 mm and 3.00 mm. Height KH2may be between about 1.00 mm and about 3.5 mm. Height KH2may be between 1.00 mm and 3.50 mm. The ratio of KH1to KH2may be about 1.27, may be 1.27, may be between about 1.20 and about 1.30, may be between 1.20 and 1.30, may be between about 1.15 and about 1.35, may be between 1.15 and 1.35, may be between about 1.10 and about 1.40, and may be between 1.10 and 1.40.", "", "In the aspect illustrated inFIG.2B, height KH2may be about 2.17 mm. Height KH2may be 2.17 mm. Height KH2may be between about 2.00 mm and about 2.50 mm. Height KH2may be between 2.00 mm and 2.50 mm. Height KH2may be between about 1.50 mm and about 3.00 mm. Height KH2may be between 1.50 mm and 3.00 mm. Height KH2may be between about 1.00 mm and about 3.5 mm. Height KH2may be between 1.00 mm and 3.50 mm. The ratio of KH1to KH2may be about 1.00, may be 1.00, may be between about 0.95 and about 1.05, may be between 0.95 and 1.05, may be between about 0.90 and about 1.10, may be between 0.90 and 1.10, may be between about 0.85 and about 1.15, and may be between 0.85 and 1.15.", "", "In the aspect illustrated inFIG.2C, height KH2may be about 2.17 mm. Height KH2may be 2.17 mm. Height KH2may be between about 2.00 mm and about 2.50 mm. Height KH2may be between 2.00 mm and 2.50 mm. Height KH2may be between about 1.50 mm and about 3.00 mm. Height KH2may be between 1.50 mm and 3.00 mm. Height KH2may be between about 1.00 mm and about 3.5 mm. Height KH2may be between 1.00 mm and 3.50 mm. The ratio of KH1to KH2may be about 0.68, may be 0.68, may be between about 0.65 and about 0.70, may be between 0.65 and 0.70, may be between about 0.60 and about 0.75, may be between 0.60 and 0.75, may be between about 0.55 and about 0.80, and may be between 0.55 and 0.80.", "", "Sipe blade230terminates radially inwardly in a terminal portion239. In one aspect, centerline CL extends through terminal portion239. In another aspect, centerline CL may extend through terminal portion239. Terminal portion239may include a circumferential width that is one half of width TSW.", "", "FIG.2Dillustrates sipe blades230A (FIG.2A),230B (FIG.2B), and230C (FIG.2C) in juxtaposition. The heights of the first and second vertices, and the values of KH1and KH2are different between each sipe blade. The key edge (e.g., key edge350) formed in the tread by the sipe blades exists while the tread wears along key portion236but does not exist for the brief period that the tread wears through return portion238. As illustrated, the sipe blades may be configured such that the heights of the first and second vertices and the values of KH1and KH2are offset to ensure the existence of a key edge during wear of the tire.", "", "As illustrated inFIG.2E, sipe blade230may include a central s-shaped portion242oriented axially between laterally extending straight portions244.", "", "As illustrated inFIG.2F, sipe blade230may include no central s-shaped portion and may include only laterally extending straight portions244.", "", "FIGS.3A-3Eillustrate a tread block306with a directional interlocking sipe and/or slot310.", "", "Sipe and/or slot310extends radially inwardly into tread block306from a tread surface301. Sipe and/or slot310may include a central s-shaped portion312oriented axially between laterally extending straight portions314. Sipe and/or slot310may include only straight portions314, as illustrated for example only inFIG.1, shoulder rows160of the example tire tread100.", "", "Sipe and/or slot310includes key portions346and return portions348as described above in reference to sipe blade230's key portions236and return portions238.", "", "Key portions346form a sharp (acute) key edge350where key portion346meets tread surface301. Key edge350provides increased traction when tread block306engages a roadway in the direction of rolling DR. Key edge350provides increased snow and/or ice traction by increasing the friction between tread surface301and the snow and/or ice-covered running surface. Key edge350may provide increased traction benefits by “biting” into snow and ice surfaces to increase the traction on those surfaces during acceleration in direction of rolling DR. Key edge350forms an angle KA (as referenced above inFIGS.2A-2C) relative to tread surface301.", "", "FIGS.4A-4Dillustrate a tread block406with a directional interlocking sipe and/or slot410in various stages of wear.", "", "FIGS.4A and4Billustrate tread block406's tread surface401wearing through a first key portion446. A key edge450is present in these stages of wear of tread block406. That is, as tread block406wears, tread surface401moves radially inwardly and intersects different portions of sipe and/or slot410.", "", "FIG.4Cillustrates tread surface401wearing through a first return portion448, which does not include a key edge450.", "", "FIG.4Dillustrates tread surface401wearing through a second key portion446, in which state key edge450is again present.", "", "Due to the difference in the angle of key portions446(e.g., angle KA) and return portions448(e.g., angle RA), as tread surface401wears radially inwardly, sipe and/or slot410intersects tread surface401in key portion446for greater periods of that wear than in return portions448. As illustrated, sipe and/or slot410includes key edge450while key portion446intersects tread surface401.", "", "With respect to the various aspects described above, a tire tread having a sipe and/or slot with a key edge as described herein has improved traction in snow and/or ice versus tire tread lacking such a feature. Tread having the key edge described herein may have an increased snow traction benefit in the forward direction (accelerating) of rolling DR relative to a standard snow tire. Alternatively, the key edge described may have an increased snow traction benefit in the rearward direction (braking) of rolling DR relative to a standard snow tire, depending upon the orientation of the sipe and/or slot.", "", "Prior art designs sought to increase snow traction through tread patterns having a very high lateral edge density and void patterns (that is, extending in the axial direction), which results in decreased dry roadway performance. The sipe and/or slots described herein significantly increase snow performance and allow for tread pattern modifications to reduce lateral edge density, thus reducing and/or eliminating detrimental effects to dry performance. The result is a tread pattern with the aforementioned sipes and/or slots with additional snow performance and dry performance compared to a tread pattern without the aforementioned sipes and/or slots. Additionally, with the differing values of KH1and KH2between various sipes and/or slots, the improved snow traction may be present at any wear state of the tread pattern.", "", "Additionally, the alternating shape of key portions and return portions of the sipes and/or slots described herein create interlocking sipe sidewalls that self-contact (interlock) under braking, acceleration, and lateral maneuvers. This interlocking aspect of the tread block may act to increase block rigidity under braking, acceleration, and/or lateral maneuvers.", "", "To the extent that the term “includes” or “including” is used in the specification or the claims, it is intended to be inclusive in a manner similar to the term “comprising” as that term is interpreted when employed as a transitional word in a claim. Furthermore, to the extent that the term “or” is employed (e.g., A or B) it is intended to mean “A or B or both.” When the applicants intend to indicate “only A or B but not both” then the term “only A or B but not both” will be employed. Thus, use of the term “or” herein is the inclusive, and not the exclusive use. See Bryan A. Garner, A Dictionary of Modern Legal Usage 624 (2d. Ed. 1995). Also, to the extent that the terms “in” or “into” are used in the specification or the claims, it is intended to additionally mean “on” or “onto.” To the extent that the term “substantially” is used in the specification or the claims, it is intended to take into consideration the degree of precision available in tire manufacturing. To the extent that the term “selectively” is used in the specification or the claims, it is intended to refer to a condition of a component wherein a user of the apparatus may activate or deactivate the feature or function of the component as is necessary or desired in use of the apparatus. To the extent that the term “operatively connected” is used in the specification or the claims, it is intended to mean that the identified components are connected in a way to perform a designated function. As used in the specification and the claims, the singular forms “a,” “an,” and “the” include the plural. Finally, where the term “about” is used in conjunction with a number, it is intended to include ±10% of the number. In other words, “about 10” may mean from 9 to 11.", "", "As stated above, while the present application has been illustrated by the description of embodiments and aspects thereof, and while the embodiments and aspects have been described in considerable detail, it is not the intention of the applicants to restrict or in any way limit the scope of the appended claims to such detail. Additional advantages and modifications will readily appear to those skilled in the art, having the benefit of the present application. Therefore, the application, in its broader aspects, is not limited to the specific details, illustrative examples shown, or any apparatus referred to. Departures may be made from such details, examples, and apparatuses without departing from the spirit or scope of the general inventive concept."], "claims": ["a tread portion comprising at least one of a tread rib or a tread block, a sipe included in the tread rib or the tread block, wherein the sipe includes a central s-shaped portion located axially between opposing laterally extending straight portions, wherein the sipe includes a plurality of key portions angled in a first circumferential direction, wherein the sipe includes a plurality of return portions angled in a second circumferential direction, wherein the return portions connect the key portions, and wherein a first key portion intersects a tread surface of the tread rib or the tread block.", "2 . The tire of claim 1 , wherein the plurality of key portions are angled at an angle KA from the circumferential direction tangential to the tread surface, wherein the plurality of return portions are angled at an angle RA from the circumferential direction tangential to the tread surface, and wherein the ratio of the angle KA to the angle RA is at least 5:1.", "3 . The tire of claim 2 , wherein the ratio of the angle KA to the angle RA is between 5:1 and 6:1.", "4 . The tire of claim 1 , wherein each key portion has a width KW, each return portion has a width RW, and wherein the ratio of the width KW to the width RW is 3:4.", "5 . The tire of claim 1 , wherein the sipe has a radially outermost tread surface sipe width TSW, wherein the sipe has a radially innermost terminal portion having a circumferential width, and wherein the terminal portion circumferential width is one half of the width TSW.", "6 . The tire of claim 1 , wherein the first key portion intersects the tread surface to form a key edge.", "7 . The tire of claim 1 , further comprising a sipe including no central s-shaped portion only laterally extending straight portions, wherein the sipe includes a plurality of key portions angled in a first circumferential direction, wherein the sipe includes a plurality of return portions angled in a second circumferential direction, wherein the return portions connect the key portions, and wherein a first key portion intersects a tread surface of the tread rib or the tread block.", "a tread portion comprising at least one of a tread rib or a tread block, a sipe included in the tread rib or the tread block, wherein the sipe includes a plurality of key portions angled in a first circumferential direction at an angle KA from the circumferential direction tangential to a tread surface, wherein the sipe includes a plurality of return portions angled in a second circumferential direction at an angle RA from the circumferential direction tangential to the tread surface, wherein the return portions connect the key portions, wherein a first key portion intersects the tread surface of the tread rib or the tread block, and wherein the ratio of the angle KA to the angle RA is at least 5:1.", "9 . The tire of claim 8 , wherein the ratio of the angle KA to the angle RA is between 5:1 and 6:1.", "10 . The tire of claim 8 , wherein the sipe includes a central s-shaped portion located axially between opposing laterally extending straight portions.", "11 . The tire of claim 8 , wherein each key portion has a width KW, each return portion has a width RW, and wherein the ratio of the width KW to the width RW is 3:4.", "12 . The tire of claim 8 , wherein the sipe has a radially outermost tread surface sipe width TSW, wherein the sipe has a radially innermost terminal portion having a circumferential width, and wherein the terminal portion circumferential width is one half of the width TSW.", "13 . The tire of claim 8 , wherein the first key portion intersects the tread surface to form a key edge.", "14 . The tire of claim 8 , further comprising a sipe including no central s-shaped portion only laterally extending straight portions, wherein the sipe includes a plurality of key portions angled in a first circumferential direction, wherein the sipe includes a plurality of return portions angled in a second circumferential direction, wherein the return portions connect the key portions, and wherein a first key portion intersects a tread surface of the tread rib or the tread block.", "an upper mold insertion portion, a lower sipe forming portion including: a plurality of key portions angled in a first circumferential direction at an angle KA, a plurality of return portions angled in a second circumferential direction at an angle RA, wherein the return portions connect the key portions, wherein a first key portion connects to the upper mold insertion portion, and wherein the ratio of the angle KA to the angle RA is at least 5:1.", "16 . The tire sipe blade of claim 15 , wherein the ratio of the angle KA to the angle RA is between 5:1 and 6:1.", "17 . The tire sipe blade of claim 15 , wherein the tire sipe blade includes a central s-shaped portion located axially between opposing laterally extending straight portions.", "18 . The tire sipe blade of claim 15 , wherein each key portion has a width KW, each return portion has a width RW, and wherein the ratio of the width KW to the width RW is 3:4.", "19 . The tire sipe blade of claim 15 , wherein the tire sipe blade has a radially outermost tread surface sipe width TSW, wherein the tire sipe blade has a radially innermost terminal portion having a circumferential width, and wherein the terminal portion circumferential width is one half of the width TSW.", "20 . The tire sipe blade of claim 19 , wherein the upper mold insertion portion has a centerline CL, and wherein the centerline CL extends through the terminal portion."], "bibtex": "@patent{20240408919,\n    title = {DIRECTIONAL INTERLOCKING SIPE AND/OR SLOT},\n    number = {20240408919},\n    year = {2024},\n    note = {File: US20240408919A1-20241212.XML}\n    }", "classification": "B60C1112FI"}, {"title": "SYSTEMS AND METHODS FOR TIRE TREADWEAR SENSING", "doc_number": "20240408920", "filename": "US20240408920A1-20241212.XML", "abstract": "Disclosed are various embodiments for sensing wear of a tire tread. A tire comprises an innerliner, a plurality of belts layered adjacent to the innerliner, a tread adjacent to the plurality of belts opposite the innerliner and a treadwear sensor positioned in the innerliner. The treadwear sensor comprises a base plate on an interior side of the innerliner and a tube extending from the base plate through the innerliner and the plurality of belts to a first wear depth in the tread. When the tread is worn to the first wear depth, an end of the tube is exposed through the tire.", "detailed_description": ["With particular reference toFIG.1, a vehicle100is shown having one or more tires103. Each tire103includes a treadwear sensor106which is capable of indicating the wear on the tire103. According to various embodiments, each one of the tires103on the vehicle100may include one or more of the treadwear sensors106. While the vehicle100is depicted as a commercial truck, the vehicle100may comprise any other type of vehicle which employs tires, where the commercial truck is presented as an example. To this end, the vehicle100may comprise other vehicles falling into various categories such as passenger vehicles, off-road vehicles, and the like, in which such vehicles may include a greater or lesser number of tires103than are shown inFIG.1.", "", "Turning toFIG.2, shown is a cross sectional view of the tire103according to various embodiments. The tire103includes a pair of bead areas109, each one of which is formed with a bead core113that is embedded in the respective bead areas109. Each one of a pair of sidewalls116extends radially outwardly from a respective bead area109to a ground-contacting tread119. The tread119is formed with multiple tread elements123or tread blocks and defines a radially outer surface126. The tire103is reinforced by a carcass129that toroidally extends from one bead area109to the other bead area109. An innerliner133is formed on the inner or inside surface of the carcass129. The tire103is mounted on the flange of a wheel or rim forming an internal cavity136.", "", "According to one embodiment, at least one treadwear sensor106is inserted in the tire103. The treadwear sensor106detects certain real-time parameters of the tire103and is preferably coupled with a pressure sensor to sense the inflation pressure within a cavity136of the tire103. The treadwear sensor106may be included in a commercially-available tire pressure monitoring system (TPMS) module or sensing unit. The treadwear sensor106may be comprised of metal, rubber, or some other material. In some embodiments, the friction force between the material of the treadwear sensor106and the rubber of the tire103is enough to keep the treadwear sensor106in place while the tire103is in use. In other embodiments, an adhesive is used to secure the treadwear sensor106in the tire103. In some embodiments, multiple treadwear sensors106are included in the tire103at various locations in the tread119. Having multiple treadwear sensors106allows for detection of wear even in the case of uneven treadwear. For example, uneven treadwear may result in one treadwear sensor106being triggered while others are not.", "", "The treadwear sensor106is installed in the tire103before the tire103is mounted on the wheel. In some embodiments, the treadwear sensor106is inserted in a green tire and cured into place. In other embodiments, the treadwear sensor106is inserted into the tire103after it is cured. Each treadwear sensor106includes a base plate139and a tube143. The tube143of the treadwear sensor106is inserted into the tire103from the direction of the cavity136through the innerliner133and the carcass129and into the tread element123. In some embodiments, the treadwear sensor106may be integrally molded as part of the innerliner133of the tire103. Once the tube143is inserted into the innerliner133, the base plate139engages a radially inward side of the innerliner133to provide a positive mechanical stop for the treadwear sensor106. The base plate139also provides a seal about the treadwear sensor106to prevent the treadwear sensor106from dislodging.", "", "In some embodiments, the tube143extends through the tread element123and may have an end which is flush with the outer surface126of the tread element123. In other embodiments, an end of the tube143is not flush with the outer surface126of the tread element123but is disposed at a wear depth within the tread119. In some embodiments, the tube143is formed of a material which has an air barrier greater than or equal to that of the innerliner133, is a durable material, and is capable of bonding with the rubber components of the tire103. In some embodiments, the tube143is formed of a material that includes mechanical properties, such as shear modulus, which are similar to those of the material of the tread119. Such similarity ensures that there are no rigid components within the structure of the tire103, thereby enabling the tube143of the treadwear sensor106to behave like a compatible plug in the tread element123. However, in other embodiments, the tube143is formed of a metal or other dissimilar material.", "", "The treadwear sensor106is designed such that the end of the tube143wears with the tread119until the tread119reaches a wear depth. The wear depth on the tube143coincides with the beginning of the channel146. Thus, when the tread119is worn down to the wear depth, the channel146of the treadwear sensor106becomes exposed to the air, and air begins to leak through the treadwear sensor106. The leak of the treadwear sensor106is designed to be slow and unique compared to other common tire leaks, such as punctures or tears. The treadwear sensor106can be designed such that the leak changes with the degree of wear on the tire103. In some embodiments, a pressure sensor can detect the leak signature of the treadwear sensor106and work with other systems to alert a user that the tread119is worn. In some embodiments, the leak of the treadwear sensor106causes the tire103to go flat before the treadwear causes hazardous driving conditions.", "", "Turning toFIG.3, shown is cross-sectional view of the treadwear sensor106in the tread119of a tire103. InFIG.3A, the tread119is in an unworn state. InFIG.3B, the tread119is in a worn state. The treadwear sensor106is inserted through the innerliner133of the tire103and may extend to the radially outer surface126of the tire103. In this respect, the tube143extends through various components such as a belt package, the undertread, and other components of the tire103. The treadwear sensor106comprises a base plate139and a tube143extending from the base plate139. The base plate139lays flush against a radially inward side of the innerliner133. In some embodiments, the base plate139is connected to a pressure sensor. In some embodiments, the tube143extends away from the base plate139in a substantially perpendicular direction. In other embodiments, the tube143extends away from the base plate139at an angle between 80 and 45 degrees.", "", "As shown inFIG.3A, the tube143extends through the innerliner133and may extend through the tread element123to the radially outer surface126of the tire103. The tube143includes a channel146which extends at least partially through the tube143. In some embodiments, the channel146extends through the tube143to a wear depth. The wear depth can be indicative of the level of treadwear which has occurred. For example, the wear depth can be the depth in the tread119that, when reached, signifies the need to replace the tire103.", "", "In some embodiments, the channel146is at least partially filled with a semi-permeable filler149. The semi-permeable filler149can have a lower air permeability than a hollow channel146to allow for a slow leak. The semi-permeable filler149can be a polymer, foam, plastic, or some other material which is permeable to air. In other embodiments, the channel146is hollow. In such embodiments, the diameter of the channel146can be optimized to result in a leaking rate (", "", "Δ⁢PΔ⁢t,", "", "where ΔP is the change in pressure (P) and Δt is the change in time (t)) based on the following equation:", "", "Δ⁢P⁢1Δ⁢t≤R⪡Δ⁢P⁢2Δ⁢t", "", "In this equation,", "", "Δ⁢P⁢1Δ⁢t", "", "is the minimum pressure drop rate that a pressure sensor can detect. A sensor detects the limitation of pressure change (ΔP1=P0−P1) over a period of time Δt. In this equation,", "", "Δ⁢P⁢2Δ⁢t", "", "is an unsafe leaking rate for a tire103. R is a design range of a detected leaking rate for detecting a worn tire103safely. R is related to the diameter, length, and semi-permeable filler149of the channel146.", "", "The tube143includes a solid end153which may be flush with the radially outer surface126of the tread119. In some embodiments, the solid end153is located within the tread119at a wear depth. The solid end153of the tube143wears at the same rate as the tread119. When the tread119wears beyond the wear depth, the solid end153is worn away, and the channel146is exposed. In some embodiments, the solid end153of the tube143is made of the same rubber as the tread119.", "", "InFIG.3B, the tread119of the tire103is worn such that the solid end153of the tube143has been eroded down to the channel146. When the tread119is worn and the channel146is exposed to air through the tire103, air will begin to leak through channel146. In some embodiments, air leaks slowly through the semi-permeable filler149disposed inside the channel146. A pressure sensor coupled with the treadwear sensor106can detect the leak signature produced by the treadwear sensor106.", "", "Moving on toFIG.4, shown is a treadwear sensor106in a worn state.FIG.4Ashows a perspective view of the worn treadwear sensor106.FIG.4Bshows a cross-sectional side view of the treadwear sensor106.FIG.4Cshows a bottom view of the treadwear sensor106. The treadwear sensor106includes a base plate139and a tube143which has a hollow channel146. While depicted inFIG.4as separate components, the base plate139and the tube143may be formed as one contiguous piece. In the worn state, the channel146extends from a hole in the base plate139through the tube143allowing air to flow through the treadwear sensor106. WhileFIG.4depicts the base plate139, the tube143, and the channel146as circular or cylindrical, many other shapes may be possible in other embodiments. For example, the tube143and/or channel146can be rectangular, conical, triangular, or any other similar shape as can be appreciated. Similarly, the base plate139may be circular, oblong, rectangular, triangular, or any other similar shape as can be appreciated.", "", "Referring next toFIG.5, shown are cross-sectional side views of various embodiments of the treadwear sensor106. According to one embodiment, shown inFIG.5A, the treadwear sensor106includes a first semi-permeable filler149aand a second semi-permeable filler149b, where the first semi-permeable filler149ais a different material than the second semi-permeable filler149b. In some embodiments, the first semi-permeable filler149asurrounds the second semi-permeable filler149band both fillers extend the length of the channel146. In other embodiments, the first semi-permeable filler149aand the second semi-permeable filler149bare layered throughout the channel146. Further embodiments may include third, fourth, or more semi-permeable fillers149as well.", "", "According to another embodiment, shown inFIG.5B, the tube143includes a first tube portion143aand a second tube portion143b, where the first tube portion143ahas a different diameter than the second tube portion143b. In some embodiments, the channel146has a first diameter in the first tube portion143aand a second diameter in the second tube portion143b. In further embodiments, the channel146in the first tube portion143ais filled with a first semi-permeable filler149aand the channel146in the second tube portion143bis filled with a second semi-permeable filler149b. In some embodiments, both the first tube portion143aand the second tube portion143bare filled with the same semi-permeable filler149. Further embodiments may include having third, fourth, or more tube portions143with channels146of varying diameters and potentially various semi-permeable fillers149as well.", "", "According to another embodiment shown inFIG.5C, the first tube portion143ais longer than the second tube portion143b. In some embodiments, the second tube portion143bis longer than the first tube portion143a. WhileFIGS.5A-Cdepict various embodiments of the treadwear sensor106, the treadwear sensor106is not limited to these embodiments. Any combination of tube portions143a,143b, channel146diameters, semi-permeable fillers149, or other features which generate a unique leak signature, distinct from that of a typical tire puncture or tear, can be used to form the treadwear sensor106.", "", "In the embodiments shown inFIGS.5A-Cas well as other embodiments, the leak signature of air flowing through the channel146changes as treadwear progresses. For example, when the second tube portion143bof a treadwear sensor is exposed through the tread119, the leak through the channel146will be a first value. However, when the wear progresses such that the first tube portion143ais exposed through the tread119, the leak through the channel will increase in value. In this manner, the first leak value, the second leak value, and/or a change in leak values could be detected to inform a user that the tread119is too low.", "", "Moving on toFIG.6, as the tread119wears, the tube143of the treadwear sensor106also wears. When the tread119and the tube143wear down to the wear depth, the distal end of the tube143is eroded to the beginning of the channel146, creating a passageway for air to flow from the cavity136of the tire103out through the channel146. The predefined wear depth can be the minimum recommended tread depth of the tire103. The leak caused by the treadwear sensor106signifies that the minimum tread depth has been reached, and thus indicates when replacement or retreading of the tire103should take place.", "", "In this manner, the tire103with a treadwear sensor106indicates tire wear with components that are mounted within the tire103and does not require sensors that are external to the tire103. The tire103with a treadwear sensor106provides a direct wear sensor system for a vehicle tire103that includes a structure which is easy to install in the tire103, withstands the operating environment of the tire103, and accurately indicates tire wear in a repeatable manner.", "", "The present disclosure also includes a method of determining wear of a tire using a treadwear sensor106. This method includes steps in accordance with the description that is presented above and shown inFIGS.1through5.", "", "It is to be understood that the structure of the above-described tire with a treadwear sensor106may be altered or rearranged, or components or steps known to those skilled in the art omitted or added, without affecting the overall concept or operation of the various embodiments. For example, a single treadwear sensor106may be disposed in the tread119of the tire103, or multiple treadwear sensors106may be disposed in the tread119about the tire103. In addition, the treadwear sensor106may be inserted into the tread element123before or after curing of the tire103.", "", "The tire103includes a predefined minimum tread depth. As a tire103is put into service on a vehicle over time, the tread119will wear down. The predefined minimum tread depth is a minimum recommended tread depth at which the tire103can be placed into service. Once the tread119wears below the predefined minimum tread depth, then the tire103should be taken out of service. The tread119of the tire103thus includes a sacrificial portion that is expected to wear away over time while the tire103is in service.", "", "In addition, the treadwear sensor106may be located at any lateral position on the tread119of the tire103. For example, the treadwear sensor106may be placed at positions across the tread119from each other or any other position on the tread119or in a given tread element123as shown. In this manner, the treadwear sensors106may be positioned to detect treadwear at any lateral location on the tread119of a tire103. For example, it may be desirable to detect various levels of wear of a tread119at different lateral locations on the tread119to determine whether uneven treadwear is occurring.", "", "With reference toFIGS.1through6, in view of the foregoing discussion, below is a description of the various embodiments of the present disclosure. It is understood that the below embodiments are not an exhaustive recitation of the possible embodiments of the present disclosure and that other embodiments are described herein.", "", "Embodiment 1 is a tire comprising an innerliner, a plurality of belts layered adjacent to the innerliner, a tread adjacent to the plurality of belts opposite the innerliner, and a treadwear sensor positioned in the innerliner. The treadwear sensor comprises a base plate on an interior side of the innerliner, and a tube extending from the base plate through the innerliner and the plurality of belts to a first wear depth in the tread. When the tread is worn to the first wear depth, an end of the tube is exposed through the tire.", "", "Embodiment 2 is the tire of embodiment 1 further comprising a plurality of the treadwear sensors dispersed throughout the innerliner.", "", "Embodiment 3 is the tire of embodiments 1 or 2, wherein the treadwear sensor further comprises a channel extending through the tube from a hole in the base plate to a distal end of the tube. When the tread is worn to the first wear depth, an amount of air passes through the channel.", "", "Embodiment 4 is the tire of embodiments 2 or 3 wherein the treadwear sensor further comprises a semi-permeable filler within the channel. When the tread is worn to the first wear depth, a reduced amount of air passes through the semi-permeable filler within the channel.", "", "Embodiment 5 is the tire of embodiments 2 through 4 wherein the channel further comprises at least a first portion having a first diameter and at least a second portion having a second diameter.", "", "Embodiment 6 is the tire of embodiment 5 wherein the treadwear sensor further comprises a first semi-permeable filler within the first portion of the channel.", "", "Embodiment 7 is the tire of embodiment 6 wherein the treadwear sensor further comprises a second semi-permeable filler within the second portion of the channel.", "", "Embodiment 8 is a method comprising providing a treadwear sensor having a tube and a base plate disposed at a first end of the tube, where the treadwear sensor configured to produce a unique leak signature when a tread is worn to a wear depth. The method further comprises inserting the tube of the treadwear sensor through an innerliner of a tire such that a second end of the tube is disposed in a tread of the tire at the wear depth and the base plate is adjacent to the innerliner.", "", "Embodiment 9 is the method of embodiment 8 wherein the tire is a green tire. The method of embodiment 9 further comprises curing the green tire around the tube of the treadwear sensor.", "", "Embodiment 10 is the method of embodiments 8 or 9 further comprising filling at least a portion of the tube with a semi-permeable filler.", "", "Embodiment 11 is the method of embodiments 8 through 10 further comprising positioning the treadwear sensor adjacent to a pressure sensor on the innerliner of the tire.", "", "Embodiment 12 is the method of embodiments 8 through 11 further comprising attaching a pressure sensor to the base plate of the treadwear sensor.", "", "Embodiment 13 is the method of embodiments 8 through 12 wherein the treadwear sensor is one of a plurality of treadwear sensors. The method of embodiment 13 further comprises inserting the plurality of treadwear sensors in the tire such that the plurality of treadwear sensors are dispersed across the tread.", "", "Embodiment 14 is an apparatus comprising a base having a hole, an elongated member extending from the base, and a channel connecting the hold of the base to a distal end of the elongated member.", "", "Embodiment 15 is the apparatus of embodiment 14 further comprising a first semi-permeable filler within the channel.", "", "Embodiment 16 is the apparatus of embodiments 14 or 15 further comprising a second semi-permeable filler extending through the channel and being disposed within the first semi-permeable filler.", "", "Embodiment 17 is the apparatus of embodiments 14 through 16 further comprising a pressure sensor attached to the base.", "", "Embodiment 18 is the apparatus of embodiments 14 through 17 wherein the channel comprises at least a first portion having a first diameter and at least a second portion having a second diameter.", "", "Embodiment 19 is the apparatus of embodiment 18 further comprising a first semi-permeable filler in the first portion of the channel.", "", "Embodiment 20 is the apparatus of embodiment 18 or 19 further comprising a second semi-permeable filler in the second portion of the channel.", "", "In the present disclosure, disjunctive language such as the phrase “at least one of X, Y, or Z,” unless specifically stated otherwise, is otherwise understood with the context as used in general to present that an item, term, etc., may be either X, Y, or Z, or any combination thereof (e.g., X, Y, and/or Z). Thus, such disjunctive language is not generally intended to, and should not, imply that certain embodiments require at least one of X, at least one of Y, or at least one of Z to each be present.", "", "It should be emphasized that the above-described embodiments of the present disclosure are merely possible examples of implementations set forth for a clear understanding of the principles of the disclosure. Many variations and modifications may be made to the above-described embodiment(s) without departing substantially from the spirit and principles of the disclosure. All such modifications and variations are intended to be included herein within the scope of this disclosure and protected by the following claims."], "claims": ["an innerliner; a plurality of belts layered adjacent to the innerliner; a tread adjacent to the plurality of belts opposite the innerliner; and a treadwear sensor positioned in the innerliner, the treadwear sensor comprising: a base plate on an interior side of the innerliner; and a tube extending from the base plate through the innerliner and the plurality of belts to a first wear depth in the tread such that an end of the tube is exposed through the tire when the tread is worn to the first wear depth.", "2 . The tire of claim 1 , further comprising a plurality of the treadwear sensors dispersed throughout the innerliner.", "3 . The tire of claim 1 , wherein the treadwear sensor further comprises a channel extending through the tube from a hole in the base plate to a distal end of the tube such that an amount of air passes through the channel when the tread is worn to the first wear depth.", "4 . The tire of claim 3 , wherein the treadwear sensor further comprises a semi-permeable filler within the channel such that a reduced amount of air passes through the semi-permeable filler within the channel when the tread is worn to the first wear depth.", "5 . The tire of claim 3 , wherein the channel further comprises at least a first portion having a first diameter and at least a second portion having a second diameter, where the first diameter is greater than the second diameter.", "6 . The tire of claim 5 , wherein the treadwear sensor further comprises a first semi-permeable filler within the first portion of the channel.", "7 . The tire of claim 6 , wherein the treadwear sensor further comprises a second semi-permeable filler within the second portion of the channel.", "providing a treadwear sensor having a tube and a base plate disposed at a first end of the tube, the treadwear sensor configured to produce a unique leak signature when a tread is worn to a wear depth; and inserting the tube of the treadwear sensor through an innerliner of a tire such that a second end of the tube is disposed in the tread of the tire at the wear depth and the base plate is adjacent to the innerliner.", "9 . The method of claim 8 , wherein the tire is a green tire, and further comprising curing the green tire around the tube of the treadwear sensor.", "10 . The method of claim 8 , further comprising filling at least a portion of the tube with a semi-permeable filler.", "11 . The method of claim 8 , further comprising positioning the treadwear sensor adjacent to a pressure sensor on the innerliner of the tire.", "12 . The method of claim 8 , further comprising attaching a pressure sensor to the base plate of the treadwear sensor.", "13 . The method of claim 8 , wherein the treadwear sensor is one of a plurality of treadwear sensors, and further comprising inserting the plurality of treadwear sensors in the tire such that the plurality of treadwear sensors are dispersed across the tread.", "a base, having a hole; an elongated member extending from the base; and a channel connecting the hole of the base to a distal end of the elongated member.", "15 . The apparatus of claim 14 , further comprising a first semi-permeable filler within the channel.", "16 . The apparatus of claim 15 , further comprising a second semi-permeable filler extending through the channel and being disposed within the first semi-permeable filler.", "17 . The apparatus of claim 14 , further comprising a pressure sensor attached to the base.", "18 . The apparatus of claim 14 , wherein the channel comprises at least a first portion having a first diameter and at least a second portion having a second diameter.", "19 . The apparatus of claim 18 , further comprising a first semi-permeable filler in the first portion of the channel.", "20 . The apparatus of claim 19 , further comprising a second semi-permeable filler in the second portion of the channel."], "bibtex": "@patent{20240408920,\n    title = {SYSTEMS AND METHODS FOR TIRE TREADWEAR SENSING},\n    number = {20240408920},\n    year = {2024},\n    note = {File: US20240408920A1-20241212.XML}\n    }", "classification": "B60C1124FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240408921", "filename": "US20240408921A1-20241212.XML", "abstract": "In a pneumatic tire of this disclosure, in the reference condition, mass of a sidewall portion in a tire radial region between positions each spaced apart, from a tire maximum width position, by 15% of tire cross-sectional height to inner side and outer side in the tire radial direction is 1.5% to 5% of overall mass of the pneumatic tire.", "detailed_description": ["Hereinafter, embodiments of the present disclosure will be described in detail with reference to the drawings.", "", "FIG.1is a partial cross-sectional view in the tire width direction of a pneumatic tire according to an embodiment of this disclosure.FIG.1illustrates only one half of the tire in the tire width direction bounded by the tire equatorial plane CL, but the same configuration is used for the other half.FIG.1is a partial cross-sectional view in the tire width direction in the above-mentioned reference condition.", "", "As illustrated inFIG.1, this pneumatic tire (hereinafter referred to simply as “tire”)1has a pair of bead portions2, a pair of sidewall portions6connected to the bead portions2, and a tread portion5connected to the sidewall portions6.", "", "In this example, the bead portion2has a bead core2aand a bead filler2b. The bead core2a, in this example, comprises a plurality of bead wires whose surroundings are coated with rubber. The bead wire, in this example, is formed by steel cords. The bead filler2bis made of rubber or other materials and is located on the outer side of bead core2ain the tire radial direction. In this example, the bead filler2bhas an abbreviated triangular cross-sectional shape with a decreasing thickness toward the outer side in the tire radial direction. On the other hand, the bead core2aand the bead filler2bare not limited to the above examples and can be configured in various ways, and the tire can be configured without the bead core2aor the bead filler2b.", "", "As illustrated inFIG.1, the tire1has a carcass3consisting of one or more carcass plies that straddle the pair of bead portions2in a toroidal manner. The carcass3has a carcass body portion3adisposed between the bead cores2a, and carcass turn-up portions3bthat are folded around the bead core2afrom the inner side to the outer side in the tire width direction. In this example, the end of the carcass turn-up portion3bis located on the inner side in the tire radial direction from the tire maximum width position, but the extending length of the carcass turn-up portion3bfrom the inner side to the outer side in the tire width direction can be set as desired. The carcass3can be configured without the carcass turn-up portion3b, or the carcass turn-up portion3bcan be wrapped around the bead core2a. The carcass ply can be formed by coating organic fibers with rubber.", "", "On the outer side in the tire radial direction of the crown portion of the carcass3, a belt4and tread rubber that constitute a tread portion5are provided. The belt4, for example, can be constituted by a plurality of belt layers stacked in the tire radial direction. In this example, the belt4is an inclined belt, consisting of two belt layers where the belt cords cross each other between the layers. For example, a steel cord can also be used as the belt cords. Note, that the number of belt layers, the inclined angle of belt cords, the width of each belt layer in the tire width direction, etc. are not limited and can be set as needed.", "", "The tire1has an inner liner (not illustrated) on the tire inner surface8.", "", "Here, as illustrated inFIG.1, R is the tire radial region between positions each spaced apart, from a tire maximum width position, by 15% of tire cross-sectional height SH to inner side and outer side in the tire radial direction. The mass of the sidewall portion in the tire radial region R is 1.5% to 5% of the overall mass of the pneumatic tire1. In this example, a rubber member (in this example, a rubber sheet)7is attached to the surface of the sidewall portion in the tire radial region R (only in the tire radial region R) to achieve the above mass range.", "", "The following is a description of the effects of this pneumatic tire.", "", "The inventors studied the phenomenon of noise generation due to tire vibration and found that the tire maximum width position and its vicinity is the main point (the area where the amount of amplitude displacement increases) at 800 Hz to 1000 Hz. Then, the inventors found that by locally increasing the mass in the tire radial region R between positions each spaced apart, from the tire maximum width position P, by 15% of the tire cross-sectional height SH to inner side and outer side in the tire radial direction (in the figure, 0.15×SH each upward and downward), the amplitude of 800 Hz to 1000 Hz can be reduced to improve the quietness of the tire, and the increase in mass can be localized to minimize the increase in tire weight.", "", "If the position where the weight is increased is outer side or inner side in the tire radial direction than the above tire radial region R, the effect of improving the quietness of the tire by reducing the amplitude of 800 Hz to 1000 Hz cannot be fully obtained.", "", "Also, if the mass of the sidewall portion in the above tire radial region R is less than 1.5% of the overall mass of the pneumatic tire, the effect of suppressing vibration described above cannot be fully demonstrated and the quietness of the tire cannot be sufficiently improved. On the other hand, if the mass of the sidewall portion in the above tire radial region R is more than 5% of the overall mass of the pneumatic tire, the weight near the tire maximum width position P may become locally too large, resulting in a large weight bias, which may cause that part to flow or shift during vulcanization. For the same reason, it is more preferable that the mass of the sidewall portion in the tire radial region R is 1.8% to 4.5% of the overall mass of the pneumatic tire.", "", "It is more preferable that in the reference condition, the mass of the sidewall portion in the tire radial region R (10%) between positions each spaced apart, from the tire maximum width position P, by 10% of tire cross-sectional height to inner side and outer side in the tire radial direction is 1.5% to 5% of the overall mass of the pneumatic tire. This is because the vibration can be reduced more effectively, further improving the quietness of the tire.", "", "In this case, for the same reason, it is more preferable that the mass of the sidewall portion in the tire radial region R (10%) is 1.8% to 4.5% of the overall mass of the pneumatic tire.", "", "FIG.2is a partial cross-sectional view in the tire width direction of a pneumatic tire according to an example of the first variant.FIG.3is a partial cross-sectional view in the tire width direction of a pneumatic tire according to an example of the second variant. In increasing mass locally in the tire radial region R (or R (10%)), a rubber member (rubber sheet)7can be disposed inside the sidewall portion6, as illustrated inFIG.2, or the rubber member (rubber sheet)7can be attached to the tire inner surface8(in the case of a tire with an inner liner, it can be attached to the inner side or outer side of the inner liner), as illustrated inFIG.3. However, it is more preferable that the rubber member (rubber sheet)7is attached to the outer surface of the tire or disposed inside the sidewall portion (within the sidewall rubber), because attaching the rubber member (rubber sheet)7to the inner surface8of the tire will increase the energy loss of the inner liner.", "", "InFIGS.1to3, the rubber member is illustrated as a rubber sheet, but it is not limited to a sheet-shaped rubber member, and can be of various forms, such as a semicircular cross-sectional or rectangular cross-sectional protrusion.", "", "Here, the thickness of the sidewall portion in the above tire radial region R (or R (10%)) is preferably 1.0 to 4 mm thicker than the thickness of the thinnest part of the sidewall portion. By increasing the thickness by 1.0 mm or more, the vibration suppression effect described above can further be enhanced to further improve the quietness of the tire, on the other hand, by increasing the thickness by 4 mm or less, it can be prevented that the thickness near the tire maximum width position P become locally too large, resulting in a large weight bias, which may cause that part to flow or shift during vulcanization.", "", "Here, the “thickness of the sidewall portion” means the thickness when measured in the direction perpendicular to the carcass line in the cross section in the tire width direction.", "", "In addition, the thickness of the sidewall portion in the tire radial region R (or R (10%)) is “1.0 to 4 mm thicker than the thickness of the thinnest part of the sidewall portion” means that the average thickness of the sidewall portion in the tire radial region is “1.0 to 4 mm thicker than the thickness of the thinnest part of the sidewall portion”. Note, that if a protrusion is formed in the tire radial region, the thickness shall include the height of the protrusion.", "", "For the same reason, the thickness of the sidewall portion in the above tire radial region R (or R (10%)) is more preferably 1.5 to 4 mm thicker than the thickness of the thinnest part of the sidewall portion.", "", "It is preferable to change the weight by changing the specific gravity of the material in the tire radial region R (or R (10%)). This is because by creating a localized weight-added region only by specific gravity, it is possible to reduce structural stress concentration areas by reducing unevenness, thereby improving tire durability.", "", "In addition, the thickness of the sidewall portion at the tire maximum width position P can be 120% to 200% of the thickness of the thinnest part of the sidewall portion. By setting it to 120% or more, the vibration suppression effect described above can further be enhanced to further improve the quietness of the tire, on the other hand, by setting it 200% or less, it can be prevented that the thickness near the tire maximum width position P become locally too large, resulting in a large weight bias, which may cause that part to flow or shift during vulcanization.", "", "In the above-mentioned tire radial region R (or R (10%)), the thickness of the sidewall portion is preferably 5 mm to 15 mm. By setting it to 5 mm or more, the vibration suppression effect can further be enhanced to further improve the quietness of the tire, on the other hand, by setting it to 15 mm or less, weight increase can be suppressed as much as possible.", "", "The specific gravity of the rubber member (e.g., rubber sheet)7is preferably at least 1.05 times the specific gravity of the sidewall rubber, and more preferably at least 1.1 times the same. This is because it is suitable for locally increasing weight. On the other hand, to prevent the weight bias from becoming too large, the specific gravity of the rubber member (e.g., rubber sheet)7is preferably 1.3 times or less the specific gravity of the sidewall rubber. The specific gravity can be adjusted, for example, by adjusting the amount of filler. The Filler is not limited, but silica, aluminum hydroxide, calcium carbonate, basic magnesium carbonate, clay, diatomaceous earth, recycled and powdered rubber, carbon black, and others can be used.", "", "In the above example, a rubber member was disposed to locally increase the weight of the above radial region R, however, various other methods are also possible. For example, in the above tire radial region R, it is also preferable to have a weighting member made of metal or fiber (metallic or non-metallic fiber). The metal and fiber may consist of steel (a linear metal that is primarily composed of iron (more than 50% by mass of iron to the total mass of the metal filament) or iron alone, or may contain metals other than iron, such as zinc, copper, aluminum, tin, etc. Examples include steel, copper, and alloys containing them. Plating treatment may be applied to strengthen adhesion to rubber.", "", "Note, that according to the above-mentioned embodiment in which the rubber member is disposed in the above tire radial region R, it has the advantage of high durability against repeated deformation.", "", "Here, the gauge of the tread rubber is preferably 2 to 30 mm, and more preferably 2 to 15 mm. By setting it to 2 mm or more, the quietness of can be further improved, while by setting it to 30 mm or less, it is possible to reduce rolling resistance due to weight reduction.", "", "The “tread rubber gauge” is the thickness in the tire radial direction from the tread surface to the outermost reinforcement member in the tire radial direction (e.g., the outermost belt layer in the tire radial direction, and if the belt reinforcement layer is disposed on the outer side in the tire radial direction of the belt, the outermost belt reinforcement layer in the tire radial direction) at the tire equatorial plane, under the reference condition. However, if grooves are disposed on the tire equatorial plane, it shall be assumed that there are no grooves.", "", "The tire aspect ratio is preferably between 20 and 80, 20 to 65 is more preferred, and 35 to 55 is even more preferred. This is because tires with aspect ratios in the above range can have relatively thin sidewall portions, and it is particularly suitable for both: reducing rolling resistance by thinning the sidewall portion, and reducing vibration and thus noise due to the local weight increase in the above tire radial region R. In other words, by having the tire aspect ratio of 20 (preferably 35) or more, the noise emission can be reduced, on the other hand, by having the tire aspect ratio of 80 (preferably 65, more preferably 55) or less, the tire weight can be easily reduced and rolling resistance can be reduced. Note, that it is preferable to use a configuration without side-reinforcing rubber.", "", "EXAMPLES of this disclosure are described below, however, the present disclosure is not limited in any way to the following examples."], "claims": ["when a condition in which the pneumatic tire is mounted on an applicable rim, filled to prescribed internal pressure, and unloaded is defined as a reference condition, in the reference condition, mass of a sidewall portion in a tire radial region between positions each spaced apart, from a tire maximum width position, by 15% of tire cross-sectional height to inner side and outer side in the tire radial direction is 1.5% to 5% of overall mass of the pneumatic tire.", "2 . The pneumatic tire according to claim 1 , wherein in the reference condition, mass of a sidewall portion in a tire radial region between positions each spaced apart, from a tire maximum width position, by 10% of tire cross-sectional height to inner side and outer side in the tire radial direction is 1.5% to 5% of overall mass of the pneumatic tire.", "3 . The pneumatic tire according to claim 1 , wherein a rubber member is disposed in the tire radial region.", "4 . The pneumatic tire according to claim 3 , wherein the specific gravity of the rubber member is at least 1.05 times the specific gravity of sidewall rubber.", "5 . The pneumatic tire according to claim 1 , having a weighting member made of metal or fiber in the tire radial region.", "6 . The pneumatic tire according to claim 2 , wherein a rubber member is disposed in the tire radial region.", "7 . The pneumatic tire according to claim 6 , wherein the specific gravity of the rubber member is at least 1.05 times the specific gravity of sidewall rubber.", "8 . The pneumatic tire according to claim 2 , having a weighting member made of metal or fiber in the tire radial region."], "bibtex": "@patent{20240408921,\n    title = {PNEUMATIC TIRE},\n    number = {20240408921},\n    year = {2024},\n    note = {File: US20240408921A1-20241212.XML}\n    }", "classification": "B60C1900FI"}]