[{"title": "DECORATIVE SECURITY WHEEL FASTENER", "doc_number": "20250074106", "filename": "US20250074106A1-20250306.XML", "abstract": "A security fastener assembly is provided with a cap having a decorative bearing surface and a lower retention portion. A fastener body has: a threaded portion or securing the fastener assembly to a corresponding threaded feature on a vehicle; a stem opposite the threaded portion for receiving the cap, the stem having a security protrusion defining a distal end, an undercut formed adjacent the stem for cooperating with the lower retention portion of the cap, where the lower retention portion of the cap is secured in the undercut to maintain the cap on the fastener body; a keyed security drive feature formed between the threaded portion the stem portion where the fastener body is removable with the keyed security feature. Engaging the decorative bearing surface of the cap and rotating does not rotate the threaded portion of the fastener body.", "detailed_description": ["As required, detailed embodiments of the present invention are disclosed herein; however, it is to be understood that the disclosed embodiments are merely exemplary of the invention that may be embodied in various and alternative forms. The figures are not necessarily to scale; some features may be exaggerated or minimized to show details of particular components. Therefore, specific structural and functional details disclosed herein are not to be interpreted as limiting, but merely as a representative basis for teaching one skilled in the art to variously employ the present invention.", "", "The application relates to security wheel fasteners that have the same styling, tension and friction performance as the existing wheel fasteners.", "", "Available security fasteners may not have matching styling, size, form, or fit of existing wheel fasteners. Available security fasteners also may not meet tension and friction requirements of existing wheel fasteners.", "", "A decorative security fastener deters the theft of automotive wheels, through performing as a security fastener, without sacrificing styling or performance of the original equipment wheel fastener.", "", "FIG.1is side view of the decorative security fastener assembly10shown in a section view of a mounting location and shown in use with an installation tool20.FIGS.2-3show the side view and top view of the decorative security fastener10in more detail and having a decorative cap12and a fastener body14.", "", "The decorative security fastener10has a threaded portion16with internal or external threads. As shown in the Figures, the decorative security fastener10may be a bolt having external threads. The decorative wheel fastener may also be formed as a nut with internal threads. The decorative wheel fastener10matches the styling and performance of a standard wheel fastener. For example, the decorative security fastener assembly10includes a decorative fastener cap12coupled to a security fastener body14. The fastener cap12has a wrenching surface22being common with the wrenching surfaces of other wheel fasteners on the vehicle. As shown in the Figures, the decorative fastener cap12may have a hexagonal wrenching surface22. The cap12may have six wrenching surfaces oriented in a hexagonal shape. However, it is possible for the cap12to have a different polygonal shape with a different number of wrenching surfaces or, any suitable shape, configuration or standard of tool wrenching surface may be used. For example, a fastener cap having a three-pointed tool wrenching surface may be used, such as U.S. patent application Ser. No. 15/487,805 by Larry Wilson et al., or a hybrid wrenching surface, such as in U.S. patent application Ser. No. 15/872,386 by Steven Tomaszewski et al., the disclosures of which are hereby incorporated by reference herein.", "", "The threaded portion16of the fastener body14has standard thread specifications allowing for standard torque specifications. However, while the decorative cap12appears the same as a standard fastener, when the cap is engaged by a standard tool, the cap12would spin freely or rotate without affecting the threaded portion and clamping forces.", "", "The decorative security fastener is installed and removed using a special matching tool20that engages on the keyed security drive feature30. The matching keyed security tool20is required to remove the fastener body14from the wheel W and the drive feature30is not able to be gripped by a standard tool to apply enough torque to remove the fastener body14. As shown, the keyed security drive feature30may be formed on a flange24of the fastener body and may be formed as a plurality of security notches formed along the periphery of the flange24. The plurality of notches30may have any suitable shape, number or spacing along the flange24. Alternatively, the keyed security drive feature30may be formed as a unique shaped recess on the top surface32of the flange24or other portion of the fastener body14. The security drive feature30may have different undulating, serpentine, irregular or unique shaped recess, or plurality of recesses that are not able to be gripped by a standard tool to transmit sufficient torque to unseat the fastener body14from the vehicle. The security drive feature30may be positioned in various locations on the fastener body14in combination with the decorative cap12as discussed in International Application No. PCT/US20/66090 filed Dec. 18, 2020, and U.S. provisional application Ser. No. 62/950,096 filed Dec. 18, 2019, the disclosures of which are hereby incorporated in their entirety by reference herein.", "", "The fastener body14may also have a tapered, spherical or frustoconical bearing surface26that is formed between the flange24and the threaded portion16. The bearing surface26may also be defined by a washer in combination with the fastener body. When the threads are fully seated at standard torque levels, the bearing surface26may be compressed and in tension with a corresponding surface to reduce the tendency for the bolt to loosen, thereby maintaining the fastener10securely seated. The fastener body may have a coating, or multi-layer coatings, that provide corrosion resistance and also provide a desired coefficient of friction. For example, the fastener body may have a coating such as described in U.S. patent application Ser. No. 17/716,979, the disclosure of which is hereby incorporated in its entirety by reference herein.", "", "The cap12has a decorative wrenching surface that matches the size and styling of the existing wheel fasteners. The cap12will rotate separately to the fastener and will not remove the fastener or affect tension in the joint. The cap may be secured to the fastener body after any coating is applied to the fastener body so the cap does not have a coating or has a coating different than the fastener body. For example, the cap12may be formed of stainless steel and may be polished, and not require additional coatings. The cap12may also have a decorative coating, such as black coating as described in International Patent Application No. PCT/US22/22811 by MacLean Fogg Company, the disclosure of which is hereby incorporated by reference herein.", "", "As shown in the Figures, the decorative cap12may have a decorative hexagonal shape to have the same styling as standard hexagonal fasteners. The cap12is formed of metal, such as stainless steel. By forming the cap12of metal, the cap will have the same aesthetic and durability of the standard fasteners. The cap12may also have a decorative finish and can be bright, black, variations of DLC colors, and have logos and/or branding etched and/or annealed onto the exposed surfaces. A decorative cap12can match the styling of the existing wheel fasteners that can be customized with different finishes, colors, logos, and branding.", "", "The decorative cap12is placed over a stem40on the fastener body14. The stem40defines a security protrusion shaped to prevent a standard tool or an extractor tool from being able to grip or engage the security protrusion to apply torque to remove the fastener from the wheel if the cap is removed. The geometry of the security protrusion of the stem40may have several different configurations. As shown inFIGS.5-6, the stem40may be round forming a circular cylinder protrusion that extends from the flange24of the fastener body14. The stem40may generally be the same size as the inside dimension of the polygon shaped decorative cap12. The inside shape of the cap12is different than the outer shape of the stem40. The different shapes provide reduced contact surface between the cap12and the stem40and allow the cap to rotate relative to the fastener body14. A polygon shaped cap is fitted to the fastener stem40so that the cap12will rotate when a torque that is less than the torque necessary to loosen the fastener is applied.", "", "FIG.5is a section view of the decorative security fastener like that shown inFIGS.1-4according to one embodiment.FIG.6is a top perspective view of the fastener body of the security fastener assembly inFIG.5shown with the cap removed.", "", "The decorative cap12may be attached to the fastener body14with various attachment methods that displace a lower retention portion42of the cap12into a retention feature44on the fastener body14. The retention feature44retains the cap12to the fastener body14while still allowing the cap12to rotate relative to the fastener body14. As shown in detail inFIGS.7-9, the retention feature44has a diameter and width that is less than the stem40of the fastener body14and forms a groove, or undercut, for example.", "", "As shown inFIGS.7-8, the decorative cap12may be attached to the retention feature44by various attachment methods such as swagging, crimping, staking, rolling, metal working tooling and machine tools that displace the lower portion of the cap into the retention feature44on the fastener body14. The cap forming methods may allow the cap attachment method feature to be a separate manufacturing process, or part of the fastener forming process. For example, the retention feature44adjacent the fastener stem, or formed as part of the stem, allows displacement of the cap by swagging, crimping, staking, rolling, or other forms of metal cold-working, in order to secure the cap to the fastener.", "", "The decorative cap12may be attached to the fastener body64with various attachment methods that displace a lower retention portion42of the cap12into a retention feature44on the fastener body64. The attachment methods or manufacturing process may use compressive forces to deform the cap12along the lower retention portion42. The manufacturing method may shape or deform the lower retention portion42inward into the undercut or groove to create an attachment joint that retains the cap12to the fastener body14with a process such as swagging, stacking, crimping, roll-forming or other cold-working or forging process. The attachment joint may allow the cap12to rotate relative to the fastener body14. As shown in detail inFIG.4, the decorative cap12may be attached to the retention feature44by crimping the cap12into the retention feature44on the fastener body64along each of the flat portions72. Therefore, in the embodiment illustrated, the cap12is crimped to the fastener body64in three places adjacent each of the flat portions72of the stem70. The crimping process includes applying a radial force to the cap12. For example, as shown inFIG.4, the cap12may be crimped in up to in three crimp-locations80, however, any number of crimp locations may be provided.", "", "The cap12may be retained to the fastener body10by swagging or forming the cap to the fastener body continuously along the circumference of the undercut retention feature44. The cap forming methods may allow the cap attachment method feature to be a separate manufacturing process, or part of the fastener forming process. As shown inFIG.7, the cap12may be a straight cap that has a swage, stake, roll-form, crimp or other suitable attachment method to the cap. As shown inFIG.8, the lower retention portion42of the decorative cap12may have an extended shoulder46that extends toward the security drive feature.", "", "Some cap forming methods allow the cap shoulder to engage into the retention feature44on the fastener body14during cap assembly without requiring crimping, staking, rolling, metal working tooling and machine tools to displace a portion of the cap. As shown inFIG.9, a folded portion48of the cap12may be created that will engage into the retention feature44on the fastener body14with an interference fit such as a snap-fit or snap-lock. For example, the lower retention portion42of the cap12may engage the retention feature44on the fastener body12with an interference fit. The folded portion48may be formed with the cap12and may not require a separate process to attach the cap12to the fastener body14, such as swagging, crimping, staking, rolling, metal working tooling and machine tools to displace a portion of the cap.", "", "The retention feature44of the fastener body14can also act as a breakaway feature where the stem40detaches from the fastener body14under excess force. When the stem40detaches it prevents removal of the fastener if a thief manages to pry away the rotating cap then wants to try and use an easy out fastener removal tool.", "", "The installation and removal tool20can be designed to not damage wheel surfaces. The tool has a cavity to receive the cap12and flange24of the fastener body14, as shown inFIG.1. The tool20has a corresponding keyed security element to engage the keyed security drive30on the fastener body14. For example, the corresponding keyed security elements may be pin or protrusion that engages the grooves on the flange24of the fastener body14. As shown inFIG.1, the tool20may bottom on the flange24but have no contact with the wheel. The tool20may have a clearance to the wheel of 1 mm, for example.", "", "FIGS.10-12illustrate a decorative security fastener assembly60having a fastener body64according to another embodiment. The security fastener60may use the decorative cap12, as discussed above. The decorative security fastener60has a threaded portion16with internal or external threads. As shown in the Figures, the decorative security fastener60may be a bolt having external threads. The decorative wheel fastener may also be formed as a nut with internal threads. The decorative wheel fastener60matches the styling and performance of a standard wheel fastener and includes the decorative fastener cap12coupled to the security fastener body64.", "", "The decorative cap12is placed over a stem70the forms a protrusion on the fastener body64. As shown inFIGS.10-12, the stem70may have flat portions72and arc segments74. The arc segments74may be tangential to flats sides on the cap12, such as hexagonal sides, as shown inFIG.12. The flat portions72reduce the material or the weight and may provide material cost savings as well as lightweighting of the fastener. The inside shape of the cap12only contacts the stem70along the arc segments74so the cap12spins freely with little friction so that the cap12will rotate when a torque that is less than the torque necessary to loosen the fastener is applied.", "", "The threaded portion16of the fastener body64has standard thread specifications allowing for standard torque specifications. However, while the decorative cap12appears the same as a standard fastener, when the cap is engaged by a standard tool, the cap12would spin freely or rotate without affecting the threaded portion and clamping forces.", "", "FIGS.13-14illustrate a decorative security fastener assembly100having a fastener body104according to another embodiment. The security fastener100may use the decorative cap12, as discussed above.", "", "The decorative cap12is placed over a stem110on the fastener body104. As shown inFIGS.13-14, the stem110may have thin side walls112. The stem110may crumple or deform if a torque that is less than the fastener breakaway clam load is applied to the stem110.", "", "FIG.15-17illustrate decorative security fastener assemblies with a fastener body and stem according to other embodiments. As shown, the stem may have a distal end being sloped or pointed. The protrusion formed by the stem has insufficient length and is too short for gripping by an extractor or removal tool. In addition, the distal end does not provide a surface that can easily be engaged by a screw-extractor tool, such as an easy-out tool. The protrusion may be a domed surface, a conical surface, or other shaped surface that slopes radially outward and away from a distal end.", "", "InFIG.15, a fastener assembly160has a fastener body164with the stem170with protrusion having a pointed distal end174having a sloped surface being conical. The security fastener160may use the decorative cap12, as discussed above. The decorative cap12is placed over the stem170on the fastener body164. The lower retention portion64is deformed inward into an undercut176being an angled groove and asymmetrical. As shown, the undercut176extends at an angle from the base of the conical surface. The undercut176is formed below the conical stem and has a radius and/or diameter less than a base of the stem170.", "", "FIGS.16-17illustrate a fastener assembly190having a fastener body194with the stem192with protrusion having a pointed distal end196having a conical surface. An undercut198is defined by a groove that is generally symmetrical in the axial direction. The undercut198may be taller to define a larger groove between the stem170and the flange24. For example, the undercut198may have a dimension of 2-4 mm, or larger. The security fastener190may use the decorative cap12, as discussed above. The undercut198may allow for the cap to be deformed inward by swagging the cap12around a majority of the circumference at the undercut198.", "", "The decorative wheel fastener may also be formed as a nut with internal threads, as shown inFIGS.18-21. As shown inFIG.18, a fastener assembly260has a fastener body264formed as a nut body having internal threads266. Similar toFIGS.15-17, the fastener body264being a nut inFIGS.18-21has a stem270defined by a protrusion having a distal end274having a conical surface272. The fastener body264being a nut may have an opening268that extends through the distal end. As such, the conical surface276may be a truncated by the opening268. The stem270may have a distal end surface274being sloped or pointed. The protrusion formed by the stem270has insufficient length and is too short for gripping by an extractor or removal tool. In addition, the distal end does not provide a surface that can easily be engaged by a screw-extractor tool, such as an easy-out tool. The protrusion may be a rounded or domed surface, a conical surface, or other shaped surface that slopes radially outward.", "", "The security fastener260may use the decorative cap12, as discussed above. The decorative cap12is placed over the stem270on the fastener body264and cover the opening268. The lower retention portion64of the cap12is deformed inward into an undercut276. As shown, the undercut276may be a groove that has a dimension of 2-4 mm, or larger. The undercut276may also be a angled groove, or asymmetrical that extends at an angle from the base of the conical surface. The undercut276is formed below the conical stem270and has a radius and/or diameter less than a base of the stem270.", "", "FIG.22illustrates a fastener assembly200according to another embodiment. The fastener assembly has a fastener body304with a stem302. The stem302may have a protrusion forming the distal end that is cylindrical, conical, or other suitable shape. The security fastener300also has a washer310. The washer310is positioned between the flange24and the threaded portion16and defines the bearing surface26. The washer310abuts the flange24and may be compressed and in tension with a corresponding surface in the wheel to reduce the tendency for the bolt to loosen, thereby maintaining the fastener assembly200securely seated. The washer310may rotate on the fastener body304. As discussed above, the fastener body304has a keyed security feature30formed along the flange24. The security fastener assembly300may use the decorative cap12that can be cold-worked and deformed to be retained on the fastener body304in a retention feature44such as an undercut, as discussed above.", "", "While exemplary embodiments are described above, it is not intended that these embodiments describe all possible forms of the invention. Rather, the words used in the specification are words of description rather than limitation, and it is understood that various changes may be made without departing from the spirit and scope of the invention. Additionally, the features of various implementing embodiments may be combined to form further embodiments of the invention."], "claims": ["a cap shaped with a standard tool bearing surface and a lower retention portion; a fastener body having: a threaded portion for securing the security fastener assembly to a corresponding threaded segment on a vehicle; a sloped stem opposite the threaded portion and defining a distal end, wherein the cap conceals the sloped stem, an undercut formed below the sloped stem and having a radius less than a base of the sloped stem, wherein the lower retention portion of the cap is deformed inward into the undercut with a cold-working process to maintain the cap on the fastener body; and a keyed security drive feature formed between the threaded portion and the sloped stem and not concealed by the cap for engagement by a corresponding security tool, wherein rotating the cap does not rotate the threaded portion of the fastener body, wherein the fastener body is removable from the corresponding threaded segment with the keyed security drive feature.", "2 . The security fastener assembly of claim 1 , wherein the lower retention portion is swagged to deform the lower retention portion into the undercut continuously along at least a portion of a circumference of the undercut.", "3 . The security fastener assembly of claim 1 , wherein the cold-working processes forms a plurality of retention locations that deform the lower retention portion into the undercut at each of the plurality of retention locations.", "4 . The security fastener assembly of claim 1 , wherein the cold-working process applies an inward radial force to deform the lower retention portion into the undercut such that an inner surface of the cap faces an outer surface of the undercut.", "5 . The security fastener assembly of claim 7 , wherein the undercut comprises an angled groove having an asymmetric cross-section.", "6 . The security fastener assembly of claim 1 , further comprising the corresponding security tool having a cavity to receive the cap and flange of the fastener body and having a corresponding keyed security element to engage the keyed security drive feature on the fastener body.", "7 . The security fastener assembly of claim 1 , wherein the fastener body comprises a bolt having an external threaded portion.", "8 . The security fastener assembly of claim 1 , wherein the fastener body comprises a nut with an opening having an internal threaded portion.", "9 . The security fastener assembly of claim 1 , wherein the sloped stem comprises at least a portion of a conical surface.", "10 . The security fastener assembly of claim 7 , further comprising a washer secured to the fastener body.", "providing a fastener body having a threaded portion and a security protrusion defining a distal end opposite the threaded portion, wherein an undercut is formed below the security protrusion, and wherein a keyed security drive feature is formed between the threaded portion and the security protrusion for engagement by a corresponding security drive tool; providing a cap having a standard tool bearing surface and a lower retention portion; placing the cap on the fastener body to cover the security protrusion; cold-working the cap to deform the lower retention portion into the undercut thereby retaining the cap on the fastener body.", "12 . The method of claim 11 , wherein the cold-working comprises applying an inward radial force with a tool to deform the lower retention portion into the undercut such that an inner surface of the cap faces an outer surface of the undercut.", "13 . The method of claim 11 , wherein the cold-working comprises swagging the lower retention portion into the undercut continuously along at least a portion of a circumference of the undercut.", "14 . The method of claim 11 , wherein the cold-working comprises crimping the lower retention portion into the undercut to form a plurality of retention locations.", "15 . The method of claim 11 , wherein the security protrusion comprises a sloped surface.", "16 . The method of claim 11 , wherein, wherein the security protrusion comprises a circular cylinder with a circular inner opening.", "17 . The method of claim 16 , wherein the circular cylinder has a plurality of flat portions spaced apart along an outer circumference by circular cylinder portions, wherein an inner surface of the cap contacts the security protrusion only along the circular cylinder portions.", "18 . The method of claim 16 , wherein the circular cylinder has a thin wall having a thickness less than a radial depth of the undercut."], "bibtex": "@patent{20250074106,\n    title = {DECORATIVE SECURITY WHEEL FASTENER},\n    number = {20250074106},\n    year = {2025},\n    note = {File: US20250074106A1-20250306.XML}\n    }", "classification": "B60B316FI"}, {"title": "MULTIPLE COMPOSITE BICYCLE RIM", "doc_number": "20250074107", "filename": "US20250074107A1-20250306.XML", "abstract": "A rim for a bicycle wheel includes a radially inner portion disposed along an inner circumference of the rim, a first sidewall, a second sidewall spaced apart from the first sidewall, a radially outer tire engaging portion disposed along an outer circumference of the rim, and an opening. The first sidewall, the second sidewall, the radially outer tire engaging portion, the radially inner portion, or any combination thereof includes a composite laminate. The composite laminate includes one or more compressed layers of a first composite material, which includes a matrix of a polymer-based material and natural fibers for a reinforcing material, and one or more compressed layers of a second composite material that is different than the first composite material. The opening extends through at least one layer of the one or more compressed layers of the second composite material, such that the second composite material surrounds the opening.", "detailed_description": ["The use of sheets or strips of carbon fiber, for example, to manufacture a composite rim of the prior art provides a number of advantages compared to traditional bicycle rims formed of extruded metals or other materials. For example, carbon fiber based bicycle rims have a high tensile strength, a low weight, and a low thermal expansion compared to traditional bicycle rims.", "", "Carbon fiber composite bicycle parts, however, have a high specific stiffness, which is unfavorable for a rider of a bicycle in certain applications. This may result in undesirable locomotive energy losses due to vibrations transmitted from road asperities through components of the bicycle, to the rider. This may lead to physiological fatigue and compensation by the rider. Carbon is also an electrical conductor that may shield wireless signals used by electronic components of the bicycle. Carbon fibers may thus act as a Faraday cage that blocks wireless signals.", "", "The present disclosure provides examples of bicycle parts, such as rims and wheels, made of thin ply low density cellulose composites (e.g., flax composites) that solve or improve upon one or more of the above-noted and/or other disadvantages with bicycle parts made entirely of carbon fiber composite or other non-traditional materials. The disclosed rims, for example, made at least partially of flax composites provide superior vibration damping, sound attenuation, and more ductile failures, while keeping a unique balance between stiffness, weight, and processability. The disclosed rims, for example, may also be, at least in part, non-electrically conductive, allowing wireless signals to pass through. The ability to be processed like carbon fiber composites provides that the cellulose fiber composite (e.g., flax composite) may also be used in a hybrid layup with carbon and/or other engineered fibers.", "", "Rims and wheels made of flax composites may, however, perform poorly in wet and damp conditions. Most of a flax composite wheel, for example, can be sealed using paint, extra resin films, or barrier plies on a surface. Holes cut or drilled through the rim (e.g., the laminate) to form spoke and access holes, for example, expose fibers to the elements and, due to wear, may be difficult to keep sealed. Spoke holes are also adjacent to some of the most heavily prestressed areas of the rim. Therefore, any degradation in strength at the spoke holes due to moisture may lead to failures.", "", "Moisture degradation at drilled holes in the rim, for example, may be reduced or prevented (e.g., the drilled holes may remain sealed) with the use of inherently solid and non-moisture wicking material at the drilled holes. For example, a fully sealed rim may be provided with a laminate in which natural fibers (e.g., flax fibers) are used in easily sealed locations, and other materials (e.g., materials that do not wick or absorb water or moisture, such as carbon fiber and/or fiberglass) are used in locations where sealing is difficult. The locations where sealing is difficult may include, for example, spoke holes, access holes, valve holes, and other holes/openings that support sensors and electronics.", "", "As an example, for a wheel with spokes or nipples that extend through holes in a laminate forming an innermost surface of a rim (e.g., a radially inner portion of the rim), the laminate may include carbon or fiberglass, for example, around the holes. This may be provided by replacing natural fibers in the laminate around the holes with an alternate material (e.g., carbon or fiberglass), positioning patches including the alternate material at the holes, respectively, or positioning full circumferential plies of the alternate material at the radially inner portion of the rim.", "", "As another example, for a rim with access holes (e.g., within the radially outer tire engaging portion of the rim) for lacing, truing, or servicing a wheel, the laminate may include carbon or fiberglass, for example, around the access holes. This may be provided by replacing natural fibers in the laminate around the access holes with an alternate material (e.g., carbon or fiberglass), positioning patches including the alternate material at the access holes, respectively, or positioning full circumferential plies including the alternate material at the radially outer tire engaging portion of the rim.", "", "As yet another example, electronics or other devices may be housed within a cavity formed in a rim, and the cavity (e.g., a hole or a pocket) may be sealed through the use of an inherently sealed laminate including, for example, carbon or fiberglass around the cavity. This may be provided locally to avoid degrading the transmissivity of radio waves through the natural fiber laminate for wireless electronics.", "", "Composites may require deflashing or removal of unwanted resin from a molding process. This process may expose fibers, and, for example, carbon fiber, fiberglass, or another inherently sealed material may be used locally to seal the laminate.", "", "Common manufacturing processes used for manufacturing carbon composite bicycle parts such as rims, for example, may be used to manufacture natural fiber (e.g., flax fiber) and carbon fiber composite rims (e.g., flax carbon hybrid rims). For example, manufacturing processes such as press curing, autoclave curing, oven curing, and/or resin transfer molding may be used. The flax carbon hybrid rims may also be shaped using, for example, a bladder or a material that applies pressure to a laminate due to heat growth (e.g., silicone in a constricted mold tool).", "", "Natural fiber composites have an advantageous combination of low material density, an appropriate range of specific stiffness, and signal transmissivity. An advantage of using a disclosed natural fiber composite for a bicycle part is that the weight of the bicycle part may be reduced for structures that are not heavily dependent on specific fiber tensile strength. Another advantage is an increase in vibration damping in bicycle parts, which reduces locomotive energy losses while increasing comfort and control. Other advantages are a reduction in noise from the bicycle parts due to an increase in sound attenuation, and more ductile failure responses being created, which leads to less catastrophic failures often associated with carbon composites.", "", "The disclosed laminate includes both a natural fiber composite material and an inherently solid and non-moisture wicking composite material. The natural fiber composite material may be used in easily sealed areas of the rim (e.g., sidewalls that do not include any openings or holes), and the inherently solid and non-moisture wicking composite material may be used in areas of the rim that are difficult to seal (e.g., at holes through the radially inner portion of the rim and/or the radially outer tire engaging portion of the rim). Such a laminate includes the benefits of natural fiber composites (e.g., an advantageous combination of low material density, an appropriate range of signal stiffness, and signal transmissivity), while preventing or slowing moisture degradation.", "", "Turning now to the drawings,FIG.1generally illustrates a bicycle50that employs rims constructed in accordance with the teachings of the present disclosure. The bicycle50includes a frame52, a front wheel54and a rear wheel56each rotatably attached to the frame52, and a drivetrain58. A front brake60is provided for braking the front wheel54, and a rear brake62is provided for braking the rear wheel56. The bicycle50also generally has a seat64near a rear end of the frame52and carried on an end of a seat post66connected to the frame52. The bicycle50also has handlebars68near a forward end of the frame52. A brake lever70is carried on the handlebars68for actuating the front brake60, the rear brake62, or both the front brake60and the rear brake62. If the brake lever70actuates only one of the front brake60and the rear brake62, a second brake lever (not shown) may also be provided to actuate the other brake. A front and/or forward riding direction or orientation of the bicycle50is indicated by the direction of the arrow A inFIG.1. As such, a forward direction for the bicycle50is indicated by the direction of arrow A. While the illustrated bicycle50depicted inFIG.1is a road bike having drop-style handlebars68, the present disclosure may be applicable to bicycles of any type, including mountain bikes with full or partial suspensions.", "", "The drivetrain58has a chain C and a front sprocket assembly72, which is coaxially mounted with a crank assembly74having pedals76. The drivetrain58also includes a rear sprocket assembly78coaxially mounted with the rear wheel56and a rear gear change mechanism, such as a rear derailleur80.", "", "As is illustrated inFIG.1, the front sprocket assembly72may include one or more coaxially mounted chainrings, gears, or sprockets. In this example, the front sprocket assembly72has one sprocket F. The one sprocket F has teeth82around a respective circumference. As shown inFIG.1, the rear sprocket assembly78may include a plurality of coaxially mounted gears, cogs, or sprockets G. Each sprocket G1-G11also has teeth84arranged around a respective circumference. The number of teeth84on the rear sprockets G1-G11may gradually decrease from the largest diameter rear sprocket G1to the smallest diameter sprocket G11. Though not described in any detail herein, a front gear changer85may be operated to move from a first operating position to a second operating position to move the chain C between front sprockets F. Likewise, the rear derailleur80may be operable to move between different operating positions to switch the chain C to a selected one of the rear sprockets G1-G11. In an embodiment, the rear sprocket assembly78may have more or fewer sprockets G. For example, in an embodiment, the rear sprocket assembly78may have twelve or thirteen sprockets. Dimensions and configuration of the rear derailleur80may be modified to accommodate a specific implemented plurality of sprockets. For example, an angle and length of a linkage and/or a configuration of a cage of the rear derailleur80may be modified to accommodate specific sprocket combinations.", "", "The rear derailleur80is depicted as a wireless, electrically actuated rear derailleur mounted or mountable to the frame52, or frame attachment, of the bicycle50. The electric rear derailleur80has a base member86(e.g., a b-knuckle) that is mounted to the bicycle frame52. A linkage88has two links L that are pivotally connected to the base member86at a base member linkage connection portion. A movable member90(e.g., a p-knuckle) is connected to the linkage88at a moveable member linkage connection portion. A chain guide assembly92(e.g., a cage) is configured to engage and maintain tension in the chain and has one or more cage plates93with a proximal end that is pivotally connected to a part of the movable member90. The cage plate93may rotate or pivot about a cage rotation axis in a damping direction and a chain tensioning direction. Other gear changing systems, such as mechanically or hydraulically controlled and/or actuated systems may also be used.", "", "A motor module may be carried on the electric rear derailleur80with a battery. The battery supplies power to the motor module. In one example, the motor module is located in the movable member90. However, the motor module may instead be located elsewhere, such as in one of the links L of the linkage88or in the base member86. The motor module may include a gear mechanism or transmission. As is known in the art, the motor module and gear mechanism may be coupled with the linkage88to laterally move the cage plate93and thus switch the chain C among the rear sprockets (e.g., G1-G11) on the rear sprocket assembly78.", "", "The cage plate93also has a distal end that carries a tensioner cog or wheel. The wheel also has teeth around a circumference. The cage plate93is biased in a chain tensioning direction to maintain tension in the chain C. The chain guide assembly92may also include a second cog or wheel, such as a guide wheel disposed nearer the proximal end of the cage plate93and the movable member90. In operation, the chain C is routed around one of the rear sprockets (e.g., G1-G11). An upper segment of the chain C extends forward to the front sprocket assembly72and is routed around the one front sprocket F. A lower segment of the chain C returns from the front sprocket assembly72to the tensioner wheel and is then routed forward to the guide wheel. The guide wheel directs the chain C to the rear sprockets (e.g., G1-G11). Lateral movement of the cage plate93, the tensioner wheel, and the guide wheel may determine the lateral position of the chain C for alignment with a selected one of the rear sprockets (e.g., G1-G11).", "", "The bicycle50may include one or more bicycle control devices mounted to handlebars68. The bicycle control devices may include one or more types of bicycle control and/or actuation systems. For example, the bicycle control devices may include brake actuation systems to control the front brake60and/or the rear brake62, and/or gear shifting systems to control the drivetrain58. Other control systems may also be included. For example, the system may be applied, in some embodiments, to a bicycle where only a front or only a rear gear changer is used. Also, the one or more bicycle control devices may also include suspension, seat post, and/or other control systems for the bicycle50.", "", "The front wheel54and/or the rear wheel56of the bicycle50may include a tire120attached to a radially outer tire engaging portion of a rim122. As shown inFIGS.1and2, a plurality of spokes124are attached directly to the rim122. Alternatively, the spokes124may be attached and/or secured to the rim122with other structural components. The spokes124extend from the rim122and attach to a central hub126. The spokes124are maintained with a tension between the rim122and the central hub126to provide the respective wheel54,56with an operational rigidity for use on the bicycle50. The central hub126is configured for rotational attachment to the bicycle frame52.", "", "FIG.2illustrates a bicycle wheel having a rim122, spokes124, and a central hub126, such as the front wheel54ofFIG.1, removed from the rest of the bicycle50and without a tire attached. The rim122includes a tire engaging portion130to engage with the tire120, as is shown inFIG.1. The tire engaging portion130is configured radially outward of a spoke receiving surface132that is disposed along an inner circumference134of the rim122. In other words, the tire engaging portion130is a radially outer tire engaging portion. In an embodiment, the tire engaging portion130is disposed along an outer circumference135of the rim122. The tire engaging portion130is configured for attachment to tires using clincher tire attachment configurations for tires including beaded interlock attachments. Other configurations of the tire engaging portion130may also be provided to allow for the use of other types of tires on the rim122. For example, tubeless tires including beaded interlock attachment types may be used.", "", "The rim122provides structure for attachment of the spokes124to the rim122at a receiving portion of the rim122, proximate to the spoke receiving surface132. As such, the spoke receiving surface132is part of a spoke engaging portion136(e.g., a radially inner portion) of the rim122. In an embodiment, the spoke engaging portion136of the rim122is disposed along the inner circumference134of the rim122. In another embodiment, the spoke receiving surface132and the spoke engaging portion136may be separate parts and/or portions of the rim122. For example, the spokes124may pass through the spoke receiving surface132, and the structure for attachment to the rim122may be provided proximate to the tire engaging portion130.", "", "The rim122includes a first sidewall138and a second sidewall that extend between the tire engaging portion130and the spoke engaging portion136. For example, the first sidewall138and the second sidewall extend radially outward from the spoke engaging portion136to the tire engaging portion130. The first sidewall138is spaced apart from the second sidewall.", "", "At least part of the rim122(e.g., the spoke engaging portion136and/or the tire engaging portion130) is formed by one or more composite materials. In one embodiment, the entire rim122is formed by two or more composite materials. Other configurations may also be provided. For example, a combination of natural fiber reinforced plastic and carbon-fiber reinforced plastic forms a one-piece unitary rim of a collection of natural fiber layers and carbon-fiber layers including the tire engaging portion130, the first sidewall138, the second sidewall, and the spoke engaging portion136.", "", "The front wheel54and the rear wheel56may include rims122configured for any size wheel. In an embodiment, the rims122are configured for use in wheels conforming to a 700 C (e.g., a 622 millimeter diameter clincher and/or International Standards Organization 622 mm) bicycle wheel standard.", "", "The front wheel54and the rear wheel56may rotate about the central hub126in either direction. For example, as shown inFIG.2, the front wheel54and the rear wheel56may be configured to rotate in a particular rotational direction about the central hub126. In another example, the front wheel54and the rear wheel56may be configured to rotate in a direction opposite the particular rotational direction.", "", "In one embodiment, the first sidewall138, the second sidewall, the spoke engaging portion136, and the tire engaging portion130of the front wheel54and/or the rear wheel56of the bicycle50(e.g., the front wheel54and the rear wheel56in the example ofFIG.1) are at least partially formed by one or more layers of the one or more composite materials (e.g., layers of composite materials). Each of the one or more layers may include one or more fabric plies (e.g., pieces) of the respective composite material. Different layers of different composite materials may include different numbers of plies or pieces of the composite materials, respectively. At least some of the layers of composite material may be of different shapes and/or sizes. Alternatively, all of the layers of the composite material may be a same shape and/or size.", "", "In one embodiment, at least some of the layers of composite material are shaped as strips. For example, strips of the one or more composite materials may form the first sidewall138and the second sidewall of the front wheel54. The strips of the one or more composite materials may be disposed about the central hub126of the front wheel54, respectively, and the central hub126of the rear wheel56, respectively, to form the first sidewall138and the second sidewall of the front wheel54and the rear wheel56, respectively.", "", "In a manufacturing process, the layers of the front wheel54and the rear wheel56, respectively, are integrated with the spoke engaging portion136and the tire engaging portion130(e.g., layers of composite material forming the spoke engaging portion136and the tire engaging portion130) of the respective wheel54,56by, for example, a curing process, such that a one-piece unitary rim122is formed. The rims122of the front wheel54and rear wheel56, respectively, may be formed with other manufacturing processes.", "", "FIGS.3-7show a first embodiment of a composite rim200formed by layers of multiple composite materials. A layup pattern of layers of composite material for the rim is provided prior to a curing process, for example, to form the rim200. The layers of the multiple composite materials, after the curing process, may be part of a one-piece unitary rim200. The resultant one-piece unitary rim200may be formed by a composite laminate that includes one or more compressed layers of one or more composite materials.", "", "Any number of composite materials may be included within the composite laminate. For example, the one or more composite materials of the composite laminate may include a first composite material, a second composite material, a third composite material, or any combination thereof. The composite laminate may include more or fewer composite materials. For example, the composite laminate may include only the first composite material and the second composite material, or may include only the second composite material and the third composite material.", "", "A number of natural fibers provide a combination of low material density (e.g., compared to fiberglass) with a sufficient range of specific stiffness for a number of different types of bicycle components (e.g., bicycle rims, crankarms, handlebars, stems, seat posts, seat rails, shifting levers, brake levers, derailleur cages, suspension fork components). For example, flax has a density of less than 1.5 g/cm3(e.g., compared to a density of more than 2.5 g/cm3for fiberglass), a specific modulus of 43 GPa/(g/cm3) (e.g., compared to 28 GPa/(g/cm3) for fiberglass), and a specific ultimate strength of 500 MPa/(g/cm3) (e.g., compared to 1,390 MPa/(g/cm3) for fiberglass). As another example, hemp has a density of less than 1.5 g/cm3, a specific modulus of 30 GPa/(g/cm3), and a specific ultimate strength of 372 MPa/(g/cm3).", "", "The combination of a cellulose structure with unique specific stiffness properties, specific modulus properties, and processability characteristics damp vibrations, increase sound attenuation, and provide for a more ductile failure compared to composites used in the prior art (e.g., fiberglass). Low-density cellulose composites (e.g., flax fiber composites) are non-conductive, which allow for electrical signals to pass through the composite, unlike carbon fiber composites, which act as a Faraday cage blocking signals.", "", "Referring toFIGS.3,6, and7, the composite rim200includes a radially outer tire engaging portion202(e.g., disposed along an outer circumference of the composite rim200), a radially inner portion204(e.g., a spoke engaging portion), a first sidewall206, and a second sidewall208spaced apart from the first sidewall206. The first sidewall206and the second sidewall208extend radially outward from the radially inner portion204, to the radially outer tire engaging portion202. The radially outer tire engaging portion202extends from the first sidewall206to the second sidewall208, respectively.", "", "The radially outer tire engaging portion202of the composite rim200includes a first tire retaining portion210and a second tire retaining portion212spaced apart from the first tire retaining portion210. The first tire retaining portion210extends from the first sidewall206, and the second tire retaining portion212extends from the second sidewall208.", "", "The first tire retaining portion210includes a first tire retaining wall214. In one embodiment, the first tire retaining portion210also includes a first protrusion (e.g., a first tire retaining feature) (not shown). The first protrusion may extend away from the first tire retaining wall214. The first protrusion may be any number of shapes including, for example, a shape having a cross-section that is rectangular with a semi-circle cap. The first protrusion may extend circumferentially around the composite rim200.", "", "The second tire retaining portion212includes a second tire retaining wall216. The second tire retaining wall216is opposite and spaced apart from the first tire retaining wall214. In one embodiment, the second tire retaining portion212also includes a second protrusion (e.g., a second tire retaining feature) (not shown). The second protrusion may extend away from the second tire retaining wall216, towards the first tire retaining portion210. The second protrusion may be any number of shapes including, for example, a shape having a cross-section that is rectangular with a semi-circle cap. The second protrusion may extend circumferentially around the composite rim200. The first protrusion and the second protrusion may be other shapes.", "", "The composite rim200may seat a tire120(seeFIG.1) that is, for example, a tubeless clincher tire. The tire120includes beads that interact with the radially outer tire engaging portion202(e.g., the first tire retaining portion210and the second tire retaining portion212) of the composite rim200to attach the tire120to and maintain the tire120on the composite rim200. The beads may include any number of materials within the beads, such as, for example, a steel wire or aramid (e.g., Kevlar™) fiber, to prevent the tire120from moving off of the composite rim200. Due to the reinforcement with the steel wire or the Kevlar™ fiber, for example, the beads resist stretching from internal air pressure. Alternatively, the beads may be made of a same material as the tire120(e.g., rubber).", "", "The radially outer tire engaging portion202also includes a well218positioned between the first tire retaining portion210and the second tire retaining portion212of the composite rim200. The well218provides a volume into which the beads of the tire120may be placed when the tire120is being attached to the composite rim200. As the tire120is inflated, the beads of the tire120move away from each other until the beads interact with the first tire retaining portion210and the second tire retaining portion212, respectively. When inflated, the beads of the tire120abut the first tire retaining wall214and the second tire retaining wall216, respectively. In one embodiment, the first tire retaining feature and the second tire retaining feature, for example, keep the beads of the tire120positioned within the radially outer tire engaging portion202(e.g., keep the beads of the tire120engaged with the first tire retaining wall214and the second tire retaining wall216) and thus keep the tire120from blowing off the composite rim200. The contact between the beads and the first tire retaining wall214and the second tire retaining wall216, respectively, forms a seal between the inflated tire120and the composite rim200.", "", "The radially outer tire engaging portion202may also include ridges (e.g., bead bumps; a first bead bump and a second bead bump) on opposite sides of the well218, respectively. A first shelf220(e.g., a first bead shelf) extends away from the first tire retaining wall214(e.g., between the first tire retaining wall214and the first bead bump), and a second shelf222(e.g., a second bead shelf) extends away from the second tire retaining wall216(e.g., between the second tire retaining wall216and the second bead bump). In one embodiment, curved transition regions224extend between the first shelf220and the first tire retaining wall214, and the second shelf222and the second tire retaining wall216, respectively. The bead bumps may be positioned on opposite sides of the well218, respectively, and may be raised relative to the first shelf220and the second shelf222, respectively. The bead bumps may help retain the tire120on the composite rim200if the tire120loses pressure.", "", "Referring toFIGS.3-7, at least part of the first sidewall206and part of the second sidewall208may be made of the first composite material. In one embodiment, at least part of the radially outer tire engaging portion202(e.g., the first tire retaining portion210and the second tire retaining portion212) is also made of the first composite material. In one embodiment, at least part of the radially inner portion204is made of the first composite material.", "", "The first composite material may include a matrix of a first polymer-based material and natural fibers of a first reinforcing material. In one example, the first reinforcing material has a specific modulus between 24 and 60 GPa/(g/cm3) and a specific strength below 600 MPa/(g/cm3). Alternatively, or additionally, the first reinforcing material may have a cellulose content above 40% and a hemicellulose content above 4%. The first polymer-based material may be any number of materials including, for example, a thermoplastic, a thermoset matrix, another polymer-based material, or any combination thereof, and the natural fibers of the first reinforcing material may be any number of materials including, for example, flax fibers. Other reinforcing materials may be used. For example, in other embodiments, kenaf fibers, hemp fibers, jute fibers, sisal fibers, one or more other natural fibers, or any combination thereof may be used.", "", "FIG.8illustrates one embodiment of a layer250of the first composite material shaped as a strip. The first composite material includes a matrix252of a polymer-based material (e.g., the first polymer-based material) and fibers254of a reinforcing material (e.g., the first reinforcing material). In one embodiment, the first polymer-based material is, for example, a thermoplastic or a thermoset. In one embodiment, the fibers254of the first reinforcing material are, for example, flax fibers. Other polymer-based materials and/or other reinforcing fibers may be used.", "", "The fibers254extend along a finite length L of the strip250. In one embodiment, the fibers254extend in a primary strength direction of the strip250(e.g., along the length L of the strip250). For example, the strip250has unidirectional fiber orientation along the length L. In another embodiment, some of the fibers254do not extend in the primary strength direction (e.g., less than 20 percent of the fibers, less than 10 percent of the fibers, or less than 5 percent of the fibers).", "", "The strip250may be any number of shapes and/or sizes. For example, the strip250is rectangular in shape. Other shapes such as, for example, square shaped strips and non-rectangular parallelogram shaped strips, may be provided. The strip250also includes a width W that is perpendicular to the length L. The length L may be defined by a size of, for example, the radially outer tire engaging portion202, the first sidewall206, the second sidewall208, and/or the radially inner portion204of the composite rim200. In other words, the length L may be at least as tall or wide as the radially outer tire engaging portion202, the first sidewall206, the second sidewall208, and/or the radially inner portion204of the composite rim200. In one embodiment, the width W of the strip250is between 10 mm and 50 mm. For example, the width W of the strip250is 30 mm. In other embodiments, the strip250is wider or narrower (e.g., 60 mm). Smaller strip widths better optimize fiber orientation but come with a cost of added manufacturing complexity. In one embodiment, the width W of the strip250is as wide as a radial width of the composite rim200.", "", "Layers250of different shapes, greater width, and/or greater length may be used. For example, at least some of the layers of the first composite material may extend a quarter, half, or all the way around the rim. Different sized and/or shaped layers of the first composite material may be used depending on the application within the rim (e.g., forming an outer surface, providing strength and stiffness at a high load location within the rim).", "", "The layer250of the first composite material may have any number of thicknesses. For example, the thickness of the layer250of the first composite material may be 0.4 mm or thinner (e.g., 0.25 mm or thinner). Other thicknesses of the layer250of the first composite material may be provided.", "", "The layers250, for example, provide ultimate strength in a direction of fiber grain. Accordingly, fiber alignment relative to an inner diameter of the composite rim200may be provided for increasing strength of the composite rim200. The width W of the layer250is a variable in maximizing fiber alignment relative to a prescribed orientation. The further the fibers are from a center of the composite rim200, the more the angle of the fiber relative to the rim tangent changes, which reduces the ability of the fiber to support stresses and load.", "", "Referring toFIGS.3-7, at least part of the first sidewall206and part of the second sidewall208may be made of the first composite material. At least part of the radially outer tire engaging portion202(e.g., the well218, the first shelf220, and the second shelf222) and at least part of the radially inner portion204of the composite rim200may be made of the second composite material. In one embodiment, at least part of the first sidewall206and/or at least part of the second sidewall208is also made of the second composite material.", "", "In one embodiment, a layer of the second composite material is shaped as a strip. The strip of the second composite material may be similar to the strip250of the first composite material shown inFIG.8. For example, the second composite material also includes a matrix of a polymer-based material (e.g., the second polymer-based material) and fibers of a reinforcing material (e.g., the second reinforcing material). The second polymer-based material may be any number of materials including, for example, a plastic, an acrylic, a resin, an epoxy, or any combination thereof, and the fibers of the second reinforcing material may be any number of materials including, for example, carbon. Other polymer-based materials and/or other reinforcing fibers may be used.", "", "The second reinforcing material may be denser and may have a greater specific modulus and specific ultimate strength compared to the first reinforcing material. For example, carbon has a density of, more than 2.5 g/cm3, but a specific modulus of 162 GPa/(g/cm3) and a specific strength of 2,952 MPa/(g/cm3). While carbon is heavier than the first reinforcing material, carbon and/or other denser but stronger reinforcing materials may be used to reinforce particular areas of the rim and prevent or reduce degradation of strength of the composite rim200(e.g., at the radially inner portion204of the composite rim200). In one embodiment, the second composite material has a lower porosity than the first composite material and/or the third composite material.", "", "Like the fibers254shown inFIG.8, the fibers of the second reinforcing material may extend along a finite length of the strip. In one embodiment, the fibers of the second reinforcing material extend in a primary strength direction of the strip. For example, the strip of the second composite material has unidirectional fiber orientation along the length of the strip. In another embodiment, some of the fibers of the second reinforcing material do not extend in the primary strength direction (e.g., less than 20 percent of the fibers, less than 10 percent of the fibers, or less than 5 percent of the fibers).", "", "The strip of the second composite material may be any number of shapes and/or sizes. For example, the strip of the second composite material is rectangular in shape. Other shapes such as, for example, square shaped strips and non-rectangular parallelogram shaped strips, may be provided.", "", "The strip of the second composite material also includes a width W that is perpendicular to a length L. The width W may be defined by a size of, for example, the radially inner portion204of the composite rim200. In one embodiment, the width W of the strip of the second composite material is between 10 mm and 50 mm. For example, the width W of the strip of the second composite material is 30 mm. In other embodiments, the strip of the second composite material is wider or narrower. The strip of the second composite material may have any number of thicknesses.", "", "Layers of the second composite material of different shapes, greater width, and/or greater length may be used. For example, at least some of the layers of the second composite material may extend a quarter, half, or all the way around the composite rim200(e.g., as a portion of the radially inner portion204). Different sized and/or shaped layers of the second composite material may be used depending on the application within the composite rim200(e.g., providing strength and stiffness at a high load location within the rim).", "", "In one embodiment, at least part of the radially outer tire engaging portion202(e.g., the first tire retaining portion210and the second tire retaining portion212) is also made of the third composite material. In one embodiment, at least part of the radially inner portion204is made of the third composite material.", "", "The third composite material may include a matrix of a third polymer-based material and natural fibers of a third reinforcing material. In one example, the third reinforcing material has a specific modulus between 24 and 60 GPa/(g/cm3) and a specific strength below 600 MPa/(g/cm3). Alternatively, or additionally, the third reinforcing material may have a cellulose content above 40% and a hemicellulose content above 4%. The third polymer-based material may be any number of materials including, for example, a resin, an epoxy, or a combination thereof, and the natural fibers of the reinforcing material may be any number of materials including, for example, flax fibers. Other natural fibers of the reinforcing material such as, for example, kenaf fibers, hemp fibers, jute fibers, sisal fibers, one or more other natural fibers, or any combination thereof may be used. In one embodiment, the third reinforcing material is the same as the first reinforcing material (e.g., flax).", "", "FIG.9illustrates one embodiment of a layer260of the third composite material shaped as a strip. The third composite material includes a matrix262of a polymer-based material (e.g., the third polymer-based material) and fibers264of a reinforcing material (e.g., the third reinforcing material). In one embodiment, the third polymer-based material is a resin, and the fibers of the third reinforcing material are flax fibers.", "", "The fibers264are woven within the matrix262of the polymer-based material of the strip260. Accordingly, at least some of the fibers264are at angles relative to others of the fibers264. For example, at least some of the fibers264form a checkered pattern. In one embodiment, at least some of the fibers264extend along a length L of the strip260. For example, less than 20 percent of the fibers264, less than 10 percent of the fibers264, or less than 5 percent of the fibers264extend along the length L of the strip260. In an alternate embodiment, the fibers264of the strip260may be oriented in any direction. When flax is used as a low-density filler, the orientation of the fibers may be less significant. The fibers may not be oriented in the primary direction of the strip. In another alternate embodiment, the fibers264may be aligned with a load path that is different than the orientation of the strip.", "", "The strip260may be any number of shapes and/or sizes. For example, the strip260is rectangular in shape. Other shapes such as, for example, square shaped strips and non-rectangular parallelogram shaped strips, may be provided. The strip260may include a width W that is perpendicular to a length L. The length L may be defined by a size of, for example, the radially outer tire engaging portion202, the first sidewall206, the second sidewall208, and/or the radially inner portion204of the composite rim200. In other words, the length L may be at least as tall or wide as the radially outer tire engaging portion202, the first sidewall206, the second sidewall208, and/or the radially inner portion204of the composite rim200. In one embodiment, the width W of the strip260is between 10 mm and 50 mm. For example, the width W of the strip260is 30 mm. In other embodiments, the strip260is wider or narrower (e.g., 60 mm). In one embodiment, the width W of the strip260is as wide as a radial width of the composite rim200.", "", "Layers260of different shapes, greater width, and/or greater length may be used. For example, at least some of the layers260of the third composite material may extend a quarter, half, or all the way around the rim (e.g., forming part of the well218). Different sized and/or shaped layers260of the third composite material may be used depending on the application within the rim (e.g., providing thickness and stiffness at a high load location within the composite rim200).", "", "The layer260of the third composite material may have any number of thicknesses. In one embodiment, the layer260includes a number of plies of material and is thicker than the layer250of the first composite material. Each of the number of plies of material of the layer260of the third composite material may be unidirectional and may be stacked and sewn together, such that a checkered or hash pattern is formed. In other words, at least some of the number of plies of material of the layer260of the third composite material are unidirectional in different directions, respectively. For example, the thickness of the layer260of the third composite material may be 1.2 mm or thicker. Other thicknesses of the layer260of the third composite material may be provided.", "", "Referring toFIGS.3,4, and7, the radially inner portion204of the composite rim200includes a plurality of openings280that extend through the radially inner portion204of the composite rim200. At least some openings of the plurality of openings280are, for example, spoke holes, through which spokes (e.g., the spokes124) extend and at which the spokes are attached to the composite rim200.", "", "Any number of spoke holes280may be provided through the radially inner portion204of the composite rim200. For example, the composite rim200may include 34 or 36 spoke holes280that extend through the radially inner portion204of the composite rim200. In other embodiments, the composite rim200includes more or fewer spoke holes280. The spoke holes280, for example, may be any number of shapes (e.g., circular) and sizes (e.g., sized based on a size of a spoke and/or a spoke nipple to be attached to the composite rim200at the spoke holes280).", "", "The spoke holes280may be circumferentially distributed uniformly about the radially inner portion204of the composite rim200, such that an arc length between adjacent spoke holes280is the same for each adjacent pair of spoke holes280. In one embodiment, the distribution of the spoke holes280is varied (e.g., circumferentially or axially) about the radially inner portion204of the composite rim200.", "", "In one embodiment, all of the spoke holes280are centered within the radially inner portion204of the composite rim200. In another embodiment, some or all of the spoke holes280are offset relative to a center of the radially inner portion204of the composite rim200.", "", "At least one first layer282of the second composite material forms at least part of the radially inner portion204of the composite rim200, such that the second composite material (e.g., not the first composite material or the third composite material) surrounds each opening of the plurality of openings280. In the embodiment shown inFIGS.3-7, the at least one first layer282of the second composite material extends circumferentially, such that the at least one first layer282of the second composite material forms at least part of the radially inner portion204all of the way around the composite rim200.", "", "The at least one first layer282of the second composite material may be any number of shapes and/or sizes. For example, the at least one first layer282of the second composite material may be rectangular in shape and may extend all of the way around an inner circumference of the composite rim200. As such, a length of the at least one first layer282of the second composite material may correspond to an inner circumference of the composite rim200, and a width of the at least one first layer282of the second composite material may correspond to a width of the radially inner portion204of the composite rim200. A thickness of the at least one first layer282of the second composite material may be uniform or may vary across the length and/or the width of the at least one first layer282of the second composite material. Other shapes and/or sizes may be provided.", "", "In other embodiments, the radially inner portion204of the composite rim200includes additional openings. For example, the composite rim200includes a valve opening and/or one or more openings in which one or more electronic components for a bicycle (e.g., the bicycle50) are respectively supportable. The at least one first layer282of the second composite material may also surround such openings through the radially inner portion204of the composite rim200.", "", "As shown inFIGS.3-7, at least two layers284a,284bof the first composite material may form at least part of the first sidewall206and the second sidewall208, respectively. The at least two layers284a,284bof the first composite material may also form part of the radially outer tire engaging portion202. For example, a first layer284aof the first composite material may at least partially form the first tire retaining portion210(e.g., the first tire retaining wall214), and a second layer284bof the first composite material may at least partially form the second tire retaining portion212(e.g., the second tire retaining wall216).", "", "Each of the at least two layers284a,284bof the first composite material may be any number of shapes and/or sizes. For example, each of the at least two layers284a,284bof the first composite material may be annular in shape and may extend all of the way around the composite rim200. As such, a width of the respective layer284a,284bof the first composite material may correspond to a height of the first sidewall206or the second sidewall208. In one embodiment, the width of the respective layer284a,284bof the first composite material may correspond to a height of the first tire retaining wall214or the second tire retaining wall216added to the height of the first sidewall206or the second sidewall208, respectively. A thickness of each of the at least two layers284a,284bof the first composite material may be uniform or may vary around and/or across the width of the respective layer284a,284bof the first composite material. Other shapes and/or sizes may be provided.", "", "Referring toFIGS.3,4, and7, the radially outer tire engaging portion202of the composite rim200includes a plurality of openings290that extend through the radially outer tire engaging portion202of the composite rim200. At least some openings of the plurality of openings290are, for example, access holes, through which the spokes (e.g., the spokes124) may be accessed (e.g., tightened and loosened). The spokes may be accessed with, for example, a tool via the access holes290", "", "Any number of access holes290may be provided through the radially outer tire engaging portion202of the composite rim200. The number of access holes290may correspond to the number of spoke holes280. For example, the composite rim200may include 34 or 36 access holes290that extend through the radially outer tire engaging portion202of the composite rim200. In other embodiments, the composite rim200includes more or fewer access holes290. The access holes290, for example, may be any number of shapes (e.g., circular) and sizes (e.g., sized based on a size of the tool with which the spokes may be tightened or loosened).", "", "The access holes290may be circumferentially distributed uniformly about the radially outer tire engaging portion202of the composite rim200, such that an arc length between adjacent access holes290is the same for each adjacent pair of access holes290. In one embodiment, the distribution of the access holes290is varied (e.g., circumferentially or axially) about the radially outer tire engaging portion202of the composite rim200(e.g., corresponding to a varied distribution of the spoke holes280).", "", "In one embodiment, all of the access holes290are centered within the radially outer tire engaging portion202of the composite rim200. For example, all of the access holes290are located within the well218(e.g., partially within the well218and partially within the first shelf220and the second shelf222) of the radially outer tire engaging portion202of the composite rim200. In another embodiment, some or all of the access holes290are offset relative to a center of the radially outer tire engaging portion202of the composite rim200.", "", "Referring toFIGS.3,4,6, and7, at least one second layer292of the second composite material forms at least part of the radially outer tire engaging portion202of the composite rim200, such that the second composite material (e.g., not the first composite material or the third composite material) surrounds each opening of the plurality of openings290. In the embodiment shown inFIGS.3-7, the at least one second layer292of the second composite material extends circumferentially, such that the at least one second layer292of the second composite material forms at least part of the radially outer tire engaging portion202all of the way around the composite rim200.", "", "The at least one second layer292of the second composite material may be any number of shapes and/or sizes. For example, the at least one second layer292of the second composite material may be rectangular in shape prior to curing of the composite laminate and may be u-shaped after curing of the composite laminate. The second layer292of the second composite material may extend all of the way around an outer circumference of the composite rim200. As such, a length of the at least one second layer292of the second composite material may correspond to an outer circumference of the composite rim200, and a width of the at least one second layer292of the second composite material may correspond to a width of at least part of the radially outer tire engaging portion202(e.g., the well218, the first shelf220, and the second shelf222) of the composite rim200. A thickness of the at least one second layer292of the second composite material may be uniform or may vary across the length and/or the width of the at least one second layer292of the second composite material. Other shapes and/or sizes may be provided.", "", "In other embodiments, the radially outer tire engaging portion202of the composite rim200includes additional openings. The at least one second layer292of the second composite material may also surround such openings through the radially outer tire engaging portion202of the composite rim200.", "", "Within a layup pattern prior to curing, for example, the at least one first layer282of the second composite material may abut the at least two layers284a,284bof the first composite material, and the at least one second layer292of the second composite material may abut the at least two layers284a,284bof the first composite material, such that after curing, for example, a one-piece unitary rim200is formed. In one embodiment, prior to curing, portions on opposite sides of the at least one first layer282of the second composite material may overlap the at least two layers284a,284bof the first composite material, respectively, and portions on opposite sides of the at least one second layer292of the second composite material may overlap the at least two layers284a,284bof the first composite material, respectively.", "", "In one embodiment, one or more layers of the third composite material may be included within the composite laminate of the composite rim200to provide thickness and stiffness at a lower cost compared to only using layers of the first composite material. In one embodiment, the layers of the third composite material may not form any outer surfaces of the composite rim200(e.g., except for outermost portions of the first tire retaining wall214and the second tire retaining wall216, respectively). For example, a first layer of the third composite material partially forms the first sidewall206and abuts the first layer284aof the first composite material, and a second layer of the third composite material partially forms the second sidewall208and abuts the second layer284bof the first composite material.", "", "Surrounding holes (e.g., the spoke holes280and the access holes290) through the composite rim200with the second composite material (e.g., a carbon fiber composite) reduces or prevents moisture degradation of the composite rim200at the holes. The second composite material (e.g., the carbon fiber composite) is an inherently solid and non-moisture wicking material.", "", "Other configurations may be provided. For example, the composite laminate of the composite rim200may include more, fewer, and/or different composite materials. As another example, the composite laminate of the composite rim200may include more, fewer, and/or different layers. The composite laminate of the composite rim200for the front wheel54, for example, may be the same as the composite laminate for the composite rim200for the rear wheel56, for example. Alternatively, the composite laminates for the composite rims200for the front wheel54and the rear wheel56, respectively, for example, may be different.", "", "Each layer (e.g., first, second, etc.) of composite material (e.g., first, second, third, etc. composite materials) of the previous embodiment shown inFIGS.3-7may be made up of multiple plies of strips. The plies of strips of each layer of composite material are connected. For example, the plies of strips of each layer of composite material may be connected in an overlapping pattern, or an interleaving pattern, forming the composite rim200shown inFIG.3. Other patterns known by those of skill in the art may be used to form the composite rim200.", "", "FIGS.17-18depict the construction of a rim600using an overlapping pattern. For example, the rim200in the embodiment ofFIGS.3-7may be constructed using this overlapping pattern. Specifically, a first layer604of the second composite material may be attached to a first layer607of the first composite material at an overlapping joint1000. The first layer604of the second composite material may be attached to a second layer608of the first composite material at an overlapping joint1100. A second layer602of the second composite material may be attached to the first layer607of the first composite material at an overlapping joint1010. The second layer602of the second composite material may be attached to the second layer608of the first composite material at an overlapping joint1110.", "", "The first layer604of the second composite material forms at least part of the radially inner portion204of the composite rim600. The first layer604of the second composite material surrounds each opening of the plurality of openings280. The first layer604of the second composite material consists of three plies of strips. The plies of strips include a first ply604a, a second ply604b, and a third ply604c. The first ply604ais the inner most ply. The first ply604ais further from the outside surface of the rim600than the second ply604band the third ply604c. The third ply604cis the outermost ply. The third ply604cforms at least a portion of the outer surface of the rim600. The second ply604bis located between the first ply604aand the third ply604c.", "", "In the example embodiment, as shown inFIGS.17-18, the two layers607,608of the first composite material may form at least part of the first sidewall206and the second sidewall208, respectively. The two layers607,608of the first composite material may also form part of the radially outer tire engaging portion202. For example, the first layer607of the first composite material may at least partially form the first tire retaining portion210(e.g., the first tire retaining wall214). The second layer608of the first composite material may at least partially form the second tire retaining portion212(e.g., the second tire retaining wall216).", "", "In the example embodiment shown inFIGS.17-18, the first layer607consists of three plies of strips. The plies of strips include a first ply607a, a second ply607b, and a third ply607c. The first ply607ais the innermost ply. The first ply607ais further from the outside of the rim600than the second ply607band the third ply607c. The third ply607cis the outermost ply. The third ply607cforms at least a portion of the outer surface of the rim600. The second ply607bis located between the first ply607aand the third ply607c.", "", "The second layer608consists of three plies of strips. The plies of strips include a first ply608a, a second ply608b, and a third ply608c. The first ply608ais the innermost ply. The first ply608ais further from the outside of the rim600than the second ply608band the third ply608c. The third ply608cis the outermost ply. The third ply608cforms at least a portion of the outer surface of the rim600. A second ply608bis located between the first ply608aand the third ply608c.", "", "In the example embodiment shown inFIGS.17-18, the second layer602of the second composite material forms at least part of the radially outer tire engaging portion202of the composite rim600. The second layer602of the second composite material surrounds each opening of the plurality of openings290. The second layer602of the second composite material includes three plies of strips. The three plies of strips consist of a first ply602a, a second ply602b, and a third ply602c. The first ply602ais the innermost ply. The first ply602ais further from the outside surface of the rim600than the second ply602band the third ply602c. The third ply602cis the outermost ply. The third ply602cforms at least a portion of the outer surface of the rim600. The second ply602bis located between the first ply602aand the third ply602c.", "", "The example embodiment shown inFIGS.17-18depicts an overlapping construction of composite material plies. Generally, the rim600includes four overlapping joints1000,1100,1010,1110that extend circumferentially around the rim. The joints1000,1100,1010,1110are formed by the interconnection of two different materials. In the overlapping configuration, the joints form a stepped configuration. The two materials are inversely proportional in the stepped configuration. For example, as the first layer elongates the second layer recedes in the stepped configuration, and vise versa. This is made possible through the configuration shown in the embodiment. For example, the first ply604ais longer than the second ply604b. The second ply604bis longer than the third ply604c. The two first plies607a,608aare shorter than the two second plies607b,608b. The two second plies607b,608bare shorter than the two third plies607c.608c. The first ply602ais longer than the second ply602b. The second ply602bis longer than the third ply602c.", "", "A first overlapping joint1000is now described. Specifically, the left end of the first ply604aextends onto and sits on top of the end of the first ply607a. The left end of the second ply604bextends onto and sits on top of the end of the second ply607b. The left end of the second ply604balso aligns with the end of the first ply607a. The left end of the third ply604csits on top of and next to the third ply607c. The left end of the third ply604calso aligns with the end of the second ply607b.", "", "A second overlapping joint1100is now described. The right end of the first ply604aextends onto and sits on top of the end of the first ply608a. The right end of the second ply604bextends onto and sits on top of the end of the second ply608b. The right end of the second ply604balso aligns with the end of the first ply608a. The right end of the third ply604csits on top of and next to the third ply608c. The right end of the third ply604calso aligns with the end of the second ply608b.", "", "For joints1000and1100, the first ply604ais further from the outside of the radially inner portion204of the rim600than the two first plies607a,608a. The first ply604ais the innermost ply for joints1000,1100. The ends of the second ply604bare further from the outside of the radially inner portion204of the rim600than the ends of the two second plies607b,608bwhere they overlap. The second ply604band the two first plies607a,608aare equidistant to the outside of the rim600at the point where they meet. The third ply604cis further from the outside of the radially inner portion204of the rim600than the two third plies607c.608cwhere they overlap. The ends of the third ply604cand the ends of the two third plies607c,608care equidistant to the outside of the rim600at the point where they meet. The ends of the third ply604cand the ends of the two third plies607b,608bare equidistant to the outside of the rim600at the point where they meet. All the plies of the two first plies607,608cut off before the opening280and/or the center of the radially inner portion204of the rim600. Therefore, the first layer604of the second composite material is the only layer surrounding opening280and/or the center of the radially inner portion204of the rim600.", "", "As can be seen inFIGS.17and18, the plies604a, to604b, to604cof the first layer604recede in length from604ato604cwhen viewed from top to bottom. In this case, the top is the ply closest to the tire engaging portion202. The ply604chaving the shortest length. Thus, in the example, the first layer604depicts a receding stepped configuration at joints1000and1100. Inversely, the plies607a,607b,607c,608a,608b, and608cof the first and second layers607and608of the first composite material elongate from607ato607cand608ato608cat joints1000and1100. Thus, in the example, the first and second layers607and608have an elongating stepped configuration.", "", "A third overlapping joint1010is now described. Specifically, the left end of the first ply602aextends under and sits below the end of the first ply607a. The left end of the second ply602bextends under and sits below the end of the second ply607b. The left end of the second ply602balso aligns with the end of the first ply607a. The left end of the third ply third ply602csits below and next to the end of the third ply607c. The left end of the third ply602calso aligns with the end of the second ply607b.", "", "A fourth overlapping joint1110is now described. The right end of the first ply602aextends under and sits below the end of the first ply608a. The right end of the second ply602bextends under and sits below the end of the second ply608b. The right end of the second ply602balso aligns with the end of the first ply608a. The right end of the third ply602csits below and next to the end of the third ply608c. The right end of the third ply602calso aligns with the end of the second ply608b.", "", "For joints1010and1110, the first ply602ais further from the outside of the radially outer tire engaging portion202of the rim600than the two first plies607a,608awhere they overlap. The second ply602bis further from the outside of the radially outer tire engaging portion202of the rim600than the two second plies607b,608bwhere they overlap. The second ply602band the two first plies607a,608aare equidistant to the outside of the rim600where they meet. The third ply602cis further from the outside of the radially outer tire engaging portion202of the rim600than the two third plies607c.608cwhere they overlap. The ends of the third ply602cand the ends of the two third plies607c,608care equidistant to the outside of the rim600where they meet. The third ply602cand the two second plies607b,608bare equidistant to the outside of the rim600where they meet. The plies607,608cut off towards opening290and/or the center of the radially outer tire engaging portion202of the rim600. Therefore, the second layer602of the second composite material is the only layer surrounding the opening290and/or the center of the radially outer tire engaging portion202of the rim600.", "", "As can be seen inFIGS.17and18, the plies602c,602b,602aof the second layer602elongate in length from602cto602awhen viewed from top to bottom. In this case, the bottom is the ply closest to radially inner portion204. The ply602chas the shortest length. Thus, in the example, the second layer602depicts an elongating stepped configuration at joints1010and1110. Inversely, plies of the first and second layers607and608of the first composite material recede at joints1000and1100. The plies607a,607b,607c,608a,608b, and608cof the first and second layers607and608of the first composite material recede from607cto607aand608cto608aat joints1010and1110. Third plies607c,608c, second plies607b,608b, and first plies607a,608adecrease in length in a stepped manner at joints1010and1110. Thus, in the example, the first and second layers607and608have a receding stepped configuration.", "", "In the embodiment shown inFIGS.17-18, the first layer604of the second composite material extends circumferentially, such that the first layer604of the second composite material forms at least part of the radially inner portion204all the way around the composite rim600. Further, the second layer602of the second composite material extends circumferentially, such that the second layer602of the second composite material forms at least part of the radially outer tire engaging portion202all of the way around the composite rim600.", "", "In an alternate embodiment, more than one layer of the second composite material may be used and each layer may consist of more or less than three plies. In a further alternate embodiment, more or less than two layers of the first composite material may be used and each layer may consist of more or less than three plies. In an alternate embodiment, the third composite material may be used instead of the first composite material.", "", "An example of an overlapping joint800can be seen inFIG.21. InFIGS.21.802a,802b, and802care first, second, and third plies of the first composite material, and801a,801b, and801c, are first, second, and third plies of the second composite material, respectively. Ply801aof the second composite material extends onto ply802aof the first composite material by a distance X3. The distance X3is a distance bound by dashed lines808and810. Ply801bextends onto ply802bby a distance X2. The distance X2is bounded by dashed lines806and808. The ply801bmeets the ply802aat dashed line808. The ply801cextends onto ply802cby a distance X1. The distance X1is bounded by the dashed lines804and806. The ply801cmeets the ply802bat dashed like806. The distance X1, X2, and X3are not the same. As disclosed in the figures, distance X3is greater than distance X1and X2. Distance X2and X1are the same. In an alternate embodiment, distance X1, X2, and X3may be the same distance. In a further alternate embodiment, distances X1, X2, and X3may all be different distances. In the figure, the first composite material802is shown as a elongating stepped configuration from802ato802cfrom top to bottom. Inversely, the second composite material is shown as having a receding stepped configuration from801ato801cat the joint800from top to bottom. In an alternate embodiment, more than one layer of each composite material may be used and each layer may consist of more or less than three plies.", "", "FIGS.19-20show an embodiment of a rim700depicting an interleaving pattern. For example, the rim200in the embodiment ofFIGS.3-7may be constructed using this interleaving pattern. Specifically, a first layer704of the second composite material may be attached to a first layer707of the first composite material at an interleaving joint2000. The first layer704of the second composite material may be attached to a second layer708of the first composite material at an interleaving joint2100. A second layer702of the second composite material may be attached to the first layer707of the first composite material at an interleaving joint2010. The second layer702of the second composite material may be attached to the second layer708of the first composite material at an interleaving joint2110.", "", "A first layer704of the second composite material forms at least part of the radially inner portion204of the composite rim700. The first layer704of the second composite material surrounds each opening of the plurality of openings280. The first layer704of the second composite material consists of three plies of strips. The three plies of strips include a first ply704a, a second ply704b, and a third ply704c. The first ply704abeing the innermost ply. The first ply704ais further from the outside of the rim700than the second ply704band the third ply704c. The third ply704cis the outermost ply. The third ply704cforms at least a portion of the outer surface of the rim700. The second ply704bis located between the first ply704aand the third ply704c.", "", "In the example embodiment, as shown inFIGS.19-20, the two layers707,708of the first composite material may form at least part of the first sidewall206and the second sidewall208, respectively. The two layers707,708of the first composite material may also form part of the radially outer tire engaging portion202. For example, the first layer707of the first composite material may at least partially form the first tire retaining portion210(e.g., the first tire retaining wall214). The second layer708of the first composite material may at least partially form the second tire retaining portion212(e.g., the second tire retaining wall216).", "", "The first layer707consists of three plies of strips. The plies of strips include a first ply707a, a second ply707b, and a third ply707c. The first ply707ais the innermost ply. The first ply707ais further from the outside of the rim700than the second ply707band the third ply707c. The third ply707cis the outermost ply. The third ply707cforms at least a portion of the outer surface of the rim700. A second ply707bis located between the first ply707aand the third ply707c.", "", "The second layer708consists of three plies of strips. The plies of strips include a first ply708a, a second ply708b, and a third ply708c. A first ply708ais the innermost ply. The first ply708ais further from the outside of the rim700than the second ply708band the third ply708c. The third ply708cis the outermost ply. The third ply708cforms at least a portion of the outer surface of the rim700. A second ply708bis located between the first ply708aand the third ply708c.", "", "In the example embodiment, as shown inFIGS.19-20, a second layer702of the second composite material forms at least part of the radially outer tire engaging portion202of the composite rim700. The second layer702of the second composite material surrounds each opening of the plurality of openings290. The second layer702of the second composite material consists of three plies of strips. The three plies of strips include a first ply702a, a second ply702b, and a third ply702c. The first ply702ais the innermost ply. The first ply702ais further from the outside surface of the rim700than the second ply702band the third ply702c. The third ply702cis the outermost ply. The third ply702cforms at least a portion of the outer surface of the rim700. The second ply702bis located between the first ply702aand the third ply702c.", "", "The example embodiment shown inFIGS.19-20depicts an interleaving construction of composite material plies. Generally, the rim700includes four interleaving joints2000,2100,2010,2110that extend circumferentially around the rim. The joints2000,2100,2010,2110are formed by two different materials that interleave. The joints2000,2100,2010,2110may be stepped in configuration. The joints2000,2100,2010,2110depict a tapering of the first composite material. Further, the joints2000,2100,2010,2110depict the second composite material starting off in a splayed configuration. In the splayed configuration, the first composite material is thicker and sandwiched between the second composite material, spacing out the second composite material. The second composite material's spacing narrows as the first composite material tapers. This is made possible through the configuration shown in the embodiment. For example, the first ply704ais longer than the second ply704b. The second ply704bis longer than the third ply704c. The two first plies707a,708aare longer than the two second plies707b.708b. The two second plies707b,708bare longer than the two third plies707c.708con the radially outer tire engaging portion202of the rim700, and the two second plies707b,708bare shorter than the two third plies707c.708con the radially inner portion204of the rim700. The first ply702ais shorter than the second ply702b. The second ply702bis shorter than the third ply702c.", "", "The first interleaving joint2000is described herein. Specifically, the left end of the first ply704aextends onto and sits on top of the end of the first ply707a. The left end of the second ply704bis located between the first ply707aand the third ply707cof the first composite material. Additionally, the left end of the second ply704baligns with the end of the second ply707b. The left end of the second ply704bextends onto and sits on top of the end of the third ply707c. The left end of the third ply704cextends under and sits below the end of the third ply707c.", "", "The second interleaving joint2100is described herein. The right end of the first ply704aextends onto and sits on top of the end of the first ply708a. The right end of the second ply704bis located between the first ply708aand third ply708cof the first composite material. The right end of the second ply704baligns with the end of the second ply708b. The right end of the second ply704bextends onto and sits on top of the end of the third ply708c. The right end of the third ply704cextends under and sits below the end of the third ply708c.", "", "For joints2000and2100, the first ply704ais further from the outside of the radially inner portion204of the rim700than the two first plies707a.708awhere they overlap. The ends of the two first plies707a,708aare located between the ends of the first ply704aand the second ply704b. The ends of the two third plies707c,708care located between the ends of the second ply704band704c. The ends of the second ply704band the ends of the two second plies707b,708bare equidistant to the outside of the rim700where they meet. The second ply704bis further from the outside of the radially inner portion204of the rim700than the third plies707c.708cwhere they overlap. The third ply704cis closer to the outside of the radially inner portion204of the rim700than the two third plies707c.708cwhere they overlap.", "", "The plies (e.g.,707a,707b,707c,708a,708b, and708c) of the first and second layer of the first composite material707,708taper off and gradually decrease in thickness as they move towards opening280and/or the center of the radially inner portion204of the rim700. Therefore, the first layer704of the second composite material is the only layer surrounding the opening280and/or the center of the radially inner portion204of the rim700.", "", "In the example, the ends of the plies704a,704b, and704cof the first layer704of the second composite material are splayed. As plies704a,704b, and704cmove towards the inner portion204, plies704a,704b, and704cnarrow inwards. The rate of narrowing may correlate with the rate of tapering of the first and second layers707,708of the first composite material, and/or with a desired shape of the rim700. The first layer704is most compressed at the center of the radially inner portion204where none of the first composite material is present.", "", "A third overlapping joint2010is now described. The left end of the first ply702aextends under and sits below the end of the first ply707a. The left end of the second ply702bis located between the first ply707aand the second ply707bof the first composite material. The left end of the second ply702bextends under and sits below the end of the second ply707b. The left end of the third ply702cis located between the second ply707band the third ply707cof the first composite material. The left end of the third ply702cextends under and sits below the end of third ply707c.", "", "A fourth overlapping joint2110is now described. The right end of the first ply702aextends under and sits below the end of the first ply708a. The right end of the second ply702bis located between the first ply708aand the second ply708bof the first composite material. The right end of the second ply702bextends under and sits below the end of the second ply708b. The right end of third ply702cis located between the second ply708band the third ply708cof the first composite material. The right end of the third ply702cextends under and sits below the end of the third ply708c.", "", "For joints2010and2110, the first ply702ais further from the outside of the radially outer tire engaging portion202of the rim700than the two first plies707a,708awhere they overlap. The ends of the two first plies707a.708aare located between the ends of the first ply702aand the second ply702b. The ends of the two second plies707b,708bare located between the ends of the third ply702cand the second ply702b. The second ply702bis further from the outside of the radially outer tire engaging portion202of the rim700than the two second plies707b.708bwhere they overlap. The third ply702cis further from the outside of the radially outer tire engaging portion202of the rim700than the two third plies707c.708cwhere they overlap.", "", "The plies (e.g.,707a,707b,707c,708a,708b, and708c) of the first and second layer of the first composite material707,708taper off and gradually decrease in thickness as they move towards the opening290and/or the center of the radially outer tire engaging portion202of the rim700. Therefore, the second layer702of the second composite material is the only layer surrounding the opening290and/or the center of the radially outer tire engaging portion202of the rim700.", "", "In the example, the ends of the plies702a,702b, and702cof the second layer702of the second composite material are splayed. As plies702a.702b, and702cmove towards the center of the engaging portion202, plies702a,702b, and702cnarrow inwards. The rate of narrowing may correlate with the rate of tapering of the first and second layers707,708of the first composite material, and/or with a desired shape of the rim700. The second layer702is most compressed at the center of the radially engaging portion202where none of the first composite material is present.", "", "In the embodiment shown inFIGS.19-20, the first layer704of the second composite material extends circumferentially, such that the first layer704of the second composite material forms at least part of the radially inner portion204all the way around the composite rim700. Further, the second layer702of the second composite material extends circumferentially, such that the second layer702of the second composite material forms at least part of the radially outer tire engaging portion202all of the way around the composite rim700.", "", "In an alternate embodiment, more than one layer of the second composite material may be used and each layer may consist of more or less than three plies. In a further alternate embodiment, more or less than two layers of the first composite material may be used and each layer may consist of more or less than three plies. In an alternate embodiment, the third composite material may be used instead of the first composite material.", "", "An example of an interleaving joint900can be seen inFIG.22. InFIGS.22,902a,902b, and902care first, second, and third plies of the first composite material, and901a,901b, and901c, are first, second, and third plies of the second composite material, respectively. Ply901aof the second composite material extends between plies902aand902bof the first composite material. Ply901aextends below ply902aby a distance Y3. The distance Y3is bounded by dashed lines910and908. The ply901aextends onto and above ply902bof the second composite material by a distance of Y2plus Y3(Y2+Y3). Y2is bounded by dashed lines906and908. Thus, the total extension of ply901aonto and/or over ply902bis between dashed lines906and910.", "", "Ply901bof the second composite material extends between plies902band902cof the first composite material. Ply901bextends below ply902bby a distance Y2. Ply901bextends onto and above ply902cby a distance of Y1plus Y2(Y1+Y2). The distance Y1is bounded by dashed lines904and906. Thus, the total extension of ply901bonto and/or over ply902cis bounded between dashed lines904to908.", "", "Ply901cof the second composite material is located below ply902cby a distance of Y1. In the embodiment, and as disclosed in the figures, distances Y1, Y2and Y3are equal distances. In an alternate embodiment, Y1, Y2and Y3are not equal distances.", "", "Further, in the embodiment shown, the first composite material902is shown as a elongating stepped configuration from902ato902cfrom top to bottom. Inversely, the second composite material901is shown as having a receding stepped configuration from901ato901cat the joint900from top to bottom. In an alternate embodiment, more than one layer of each composite material may be used and each layer may consist of more or less than three plies.", "", "As an example of another configuration,FIGS.10-14show a second embodiment of a composite rim300formed by layers of multiple composite materials. The composite rim300again includes a plurality of openings302(e.g., spoke holes) that extend through a radially inner portion304of the composite rim300, and a plurality of openings306(e.g., access holes) that extend through a radially outer tire engaging portion308. A first sidewall310and a second sidewall312are spaced apart from each other and extend between the radially inner portion304and the radially outer tire engaging portion308.", "", "The spoke holes302and the access holes306are surrounded by the second composite material. Instead of at least one first layer of the second composite material extending all the way around the composite rim300and forming at least part of the radially inner portion304, as shown in the first embodiment ofFIGS.3-7, the composite laminate of the composite rim300includes a plurality of first layers314of the second composite material at the plurality of openings302(e.g., the spoke holes), respectively, and a plurality of second layers316of the second composite material at the plurality of openings306(e.g., the access holes). In other words, the plurality of first layers314of the second composite material act as first patches that surround the spoke holes302(e.g., without the first composite material or the third composite material surrounding the holes302), and the plurality of second layers316of the second composite material act as second patches that surround the access holes306(e.g., without the first composite material or the third composite material surrounding the access holes306).", "", "The first patches314may be any number of different shapes and/or sizes. For example, the first patches314may be square-shaped or rectangular (e.g., prior to curing). A width of the first patches314may correspond to a width of the radially inner portion304of the composite rim300. In one embodiment, the width of the first patches314may be less than the width of the radially inner portion304of the composite rim300. A length of the first patches314may be the same as, less than, or greater than the width of the first patches314.", "", "The second patches316may be any number of different shapes and/or sizes. For example, the second patches316may be square-shaped or rectangular (e.g., prior to curing). A width of the second patches316may correspond to a width of a portion of the radially outer tire engaging portion308(e.g., a well318, a first shelf320, and a second shelf322of the radially outer tire engaging portion308) of the composite rim300. In one embodiment, the width of the second patches316may be less than the width of the portion of the radially outer tire engaging portion308(e.g., may correspond to a width of only the well318) of the composite rim300. A length of the second patches316may be the same as, less than, or greater than the width of the second patches316.", "", "In one embodiment, a remainder of the composite rim300is formed by at least one layer of the first composite material. For example, first layers324of the first composite material are disposed between adjacent pairs of the first patches314, respectively, and form part (e.g., a remainder) of the radially inner portion304of the composite rim300. Second layers326of the first composite material are disposed between adjacent pairs of the second patches316, respectively, and form part (e.g., a remainder) of the radially outer tire engaging portion308of the composite rim300. One or more third layers328of the first composite material form the first sidewall310, which extends between the radially inner portion304and the radially outer tire engaging portion308of the composite rim300, and one or more fourth layers330of the first composite material form the second sidewall312, which extends between the radially inner portion304and the radially outer tire engaging portion308of the composite rim300. The composite rim300may include more, fewer, and/or different layers, and/or may include more and/or different composite materials (e.g., the third composite material).", "", "The composite layers that make up the embodiment shown inFIGS.10-14, can be configured in the same way depicted inFIGS.17-22. The plies of each layer can be configured in an overlapping pattern (seeFIGS.17-18) or an interleaving pattern (seeFIGS.19-20). When applying the interleaving or overlapping patterns ofFIGS.17-22to the embodiment shown inFIGS.10-14, the layers may not extend all the way around the rim like they do inFIGS.17-20, but may exist only locally where the patches are, in accordance withFIGS.10-14. Other patterns known by those of skill in the art may be used to form the composite rim300.", "", "As yet another example of a configuration,FIG.15shows a third embodiment of a composite rim500formed by layers of multiple composite materials. The composite rim500again includes a plurality of openings502(e.g., spoke holes) that extend through a radially inner portion504of the composite rim500, and a plurality of openings506(e.g., access holes) that extend through a radially outer tire engaging portion508. A first sidewall510and a second sidewall512are spaced apart from each other and extend between the radially inner portion504and the radially outer tire engaging portion508.", "", "The composite rim500of the third embodiment shown inFIG.15is similar to the composite rim300of the second embodiment shown inFIGS.10-14. For example, the composite laminate of the composite rim500includes first patches514of the second composite material that form part of the radially inner portion504of the composite rim500, and includes second patches516of the second composite material that form part of the radially outer tire engaging portion508of the composite rim500. The spoke holes502extend through the first patches514, respectively, and the access holes506extend through the second patches516, respectively.", "", "The composite rim500also includes an opening518that forms a recess in which a device (e.g., an electronic device such as a sensor device) of a bicycle is positionable and attachable to the composite rim500. The opening518may be any number of shapes and/or sizes. For example, the opening518may be shaped and sized to correspond to a shape and a size of the electronic device to be positioned within the opening518. The opening518may be larger than the spoke holes502and the access holes506.", "", "The composite laminate of the composite rim500further includes a third layer520of the second composite material (e.g., a third patch), and the opening518extends through the third patch520. The third patch520may be larger (e.g., have a larger width and/or length) than the first patches514and the second patches516to accommodate the larger opening518. The formation (e.g., cutting) of the opening518through the third patch520may leave a border522of the second composite material around the opening518, such that the second composite material surrounds the opening518. The border522of the second composite material may seal the opening518, such that moisture degradation is reduced or prevented.", "", "Composite materials may require deflashing or removal of unwanted resin from a molding process. The process may expose fibers (e.g., fibers of the first composite material). In one embodiment, an inherently sealed material (e.g., the second composite material, fiberglass) may be used locally to seal the composite laminate at the opening518(e.g., forming the border522).", "", "The composite layers that make up the embodiment shown inFIG.15, can be configured in the same way depicted inFIGS.17-22. The plies of each layer can be configured in an overlapping pattern (seeFIGS.17-18) or an interleaving pattern (seeFIGS.19-20). When applying the interleaving or overlapping patterns ofFIGS.17-22to the embodiment shown inFIG.15, the layers may not extend all the way around the rim like they do inFIGS.17-20, but may exist only locally where the patches are, in accordance withFIG.15. Other patterns known by those of skill in the art may be used to form the composite rim500.", "", "FIG.16illustrates a method1800for manufacturing a bicycle component (e.g., the rim122) of a bicycle (e.g., the bicycle50). The acts of the method1800presented below are intended to be illustrative. In some embodiments, the method1800may be accomplished with one or more additional acts not described, and/or without one or more of the acts described. Additionally, the order in which the acts of the method1800are illustrated inFIG.16and described below is not intended to be limiting.", "", "In act1802, at least one layer (e.g., a layer) of a first composite material is positioned within a mold. The first composite material includes a matrix of a first polymer-based material and natural fibers of a first reinforcing material. In one embodiment, fiber orientation of the natural fibers of the first reinforcing material of the layer of the first composite material is unidirectional in a direction along a length of the respective layer.", "", "The layer of the first composite material may be any number of shapes and/or sizes. For example, the layer of the first composite material may be rectangular in shape and may have a width at least as large as a height of a sidewall of a rim to be manufactured. Other shapes and/or sizes may be provided.", "", "The first polymer-based material may be or include any number of polymer-based materials including, for example, a thermoplastic, a thermoset matrix, or a combination thereof. The fibers of the first reinforcing material may be or include any number of different types of natural fibers including, for example, flax fibers, kenaf fibers, hemp fibers, jute fibers, sisal fibers, or any combination thereof. Other polymer-based materials and/or other reinforcing materials may be used for the first composite material.", "", "In one embodiment, the layer of the first composite material is positioned within the mold, such that the layer of the first composite material forms at least part of one of two sidewalls of the rim to be manufactured. In other embodiments, the layer of the first composite material is positioned within the mold, such that the layer of the first composite material forms at least part of another portion of the rim to be manufactured (e.g., a radially inner portion of the rim to be manufactured).", "", "In act1804, at least one layer (e.g., a layer) of a second composite material is positioned within the mold, such that the layer of the second composite material abuts the layer of the first composite material. The second composite material includes a matrix of a second polymer-based material and fibers of a second reinforcing material. The second polymer-based material may be or include any number of polymer-based materials including, for example, a plastic, an acrylic, a resin, an epoxy, or any combination thereof. The fibers of the second reinforcing material may be or include any number of different types of fibers including, for example, carbon fibers. The second composite material may have a lower porosity than the first composite material. Other polymer-based materials and/or other reinforcing materials may be used for the second composite material.", "", "The layer of the second composite material may be any number of shapes and/or sizes. For example, the layer of the second composite material may be rectangular in shape and may have a width at least as large as a width of the radially inner portion of a rim to be manufactured. Other shapes and/or sizes may be provided. In one embodiment, the layer of the second composite material is thicker than the layer of the first composite material. In another embodiment, the layer of the second composite material is thinner than the layer of the first composite material.", "", "In one embodiment, the layer of the second composite material is positioned within the mold, such that the layer of the second composite material forms at least part of the radially inner portion of the rim to be manufactured. In other embodiments, the layer of the second composite material is positioned within the mold, such that the layer of the second composite material forms at least part of another portion of the rim to be manufactured (e.g., a radially outer tire engaging portion).", "", "Acts1802and1804may be repeated any number of times to form a layup pattern for the bicycle component. In one embodiment, acts1802and1804may be repeated with one or more additional acts, in which one or more layers of other composite materials are positioned any number of times to, for example, form a layup pattern.", "", "In one embodiment, act1802is repeated, and another layer of the first composite material is positioned within the mold, such that the other layer of the first composite material forms at least part of the other of the two sidewalls of the rim to be manufactured. Act1804is also repeated, and another layer of the second composite material is positioned within the mold, such that the other layer of the second composite material forms at least part of the radially outer tire engaging portion of the rim to be manufactured.", "", "In another embodiment, act1804is repeated, and another layer of the second composite material is positioned within the mold, such that the other layer of the second composite material also abuts (e.g., overlaps) the layer of the first composite material. For example, the layer of the first composite material is disposed between the layer of the second composite material and the other layer of the second composite material (e.g., the layer of the first composite material abuts the layer of the second composite material and the other layer of the second composite material on opposite sides of the layer of the first composite material), and the layer of the first composite material, the layer of the second composite material, and the other layer of the second composite material form part of the radially inner portion or the radially outer tire engaging portion of the rim to be manufactured. Acts1802and1804may be repeated around the inner circumference and/or the outer circumference of the rim to be manufactured, for example, to form a layup pattern corresponding to the composite laminate shown in, for example, the second embodiment ofFIGS.10-14.", "", "The layup pattern, once formed into a composite laminate, may correspond to the composite laminate shown in the first embodiment ofFIGS.3-7, the second embodiment ofFIGS.10-14, the third embodiment ofFIG.15, or another composite laminate.", "", "In act1806, the bicycle component is formed. Forming the bicycle component includes forming a composite laminate (e.g., lamination) that includes at least the layer of the first composite material and the layer of the second composite material within the mold. In one embodiment, forming the bicycle component includes forming the composite laminate that includes at least the layer of the first composite material, the layer of the second composite material, and the layer of the third composite material within the mold.", "", "The mold may be used to form all or part of the bicycle component. For example, for a rim, the mold may be broken up into multiple parts to allow access to the mold when positioning at least the layer of the first material in act1802and the layer of the second material in act1804. For example, the mold may be broken up into multiple circumferential portions (e.g., four circumferential portions) and/or multiple pieces (e.g., a first sidewall piece, a second sidewall piece, and a radially outer piece).", "", "Forming the composite laminate may include shaping and curing the composite laminate within, for example, the mold. For example, at least the layer of the first composite material and the layer of the second composite material may be positioned within the mold and shaped using a bladder inflated within the mold. The composite laminate may be shaped in other ways.", "", "Once shaped, the composite laminate may be cured in any number of ways including, for example, by press curing, autoclave curing, or oven curing the composite laminate that includes at least the layer of the first composite material and the layer of the second composite material. Other types of curing may be used.", "", "In act1808, an opening is formed through the layer of the second composite material of the composite laminate, such that the second composite material surrounds the opening (e.g., without the first composite material surrounding the opening). The opening may be formed through the layer of the second composite material of the composite laminate in any number of ways including, for example, by drilling the opening through the layer of the second composite material. The opening may be formed through the layer of the second composite material in any number of other ways. For example, the opening may be formed through the layer of the second composite material by cutting the opening out of the layer of the second composite material. The opening may be any number of different types of openings including, for example, a spoke hole, a valve hole, an access hole, a recess in which a device (e.g., an electronic device) for a bicycle may be positionable and attachable, or another type of opening.", "", "Act1808may be repeated any number of times. For example, act1808may be repeated for the other layer of the second composite material (e.g., as another valve hole or an access hole) and any other layers of the second composite material through which an opening is to extend (e.g., for spoke holes or access holes).", "", "In one embodiment, in which the layer of the second composite material extends all the way around the composite laminate of the rim to form at least part of the radially inner portion of the rim or the radially outer tire engaging portion of the rim, act1808may be repeated any number of times (e.g., 34 or 36 times), such that a plurality of openings (e.g., spoke holes or access holes) are formed through the layer of the second composite material.", "", "The plurality of openings may be formed through the layer of the second composite material in any number of configurations. For example, the plurality of openings may be formed through the layer of the second composite material, such that the plurality of openings are distributed uniformly around the rim (e.g., around the radially inner portion of the rim). Other configurations of the plurality of openings may be provided.", "", "The method1800may be used to manufacture any number of different bicycle components. For example, in addition to bicycle rims, the method1800may be used to manufacture crankarms, handlebars, stems, seat posts, seat rails, shifting levers, brake levers, derailleur cages, suspension fork components, and/or other bicycle components.", "", "The illustrations of the embodiments described herein are intended to provide a general understanding of the structure of the various embodiments. The illustrations are not intended to serve as a complete description of all of the elements and features of apparatus and systems that utilize the structures or methods described herein. Many other embodiments may be apparent to those of skill in the art upon reviewing the disclosure. Other embodiments may be utilized and derived from the disclosure, such that structural and logical substitutions and changes may be made without departing from the scope of the disclosure. Additionally, the illustrations are merely representational and may not be drawn to scale. Certain proportions within the illustrations may be exaggerated, while other proportions may be minimized. Accordingly, the disclosure and the figures are to be regarded as illustrative rather than restrictive.", "", "While this specification contains many specifics, these should not be construed as limitations on the scope of the invention or of what may be claimed, but rather as descriptions of features specific to particular embodiments of the invention. Certain features that are described in this specification in the context of separate embodiments can also be implemented in combination in a single embodiment.", "", "Conversely, various features that are described in the context of a single embodiment can also be implemented in multiple embodiments separately or in any suitable sub-combination. Moreover, although features may be described above as acting in certain combinations and even initially claimed as such, one or more features from a claimed combination can in some cases be excised from the combination, and the claimed combination may be directed to a sub-combination or variation of a sub-combination.", "", "Similarly, while operations and/or acts are depicted in the drawings and described herein in a particular order, this should not be understood as requiring that such operations be performed in the particular order shown or in sequential order, or that all illustrated operations be performed, to achieve desirable results. In certain circumstances, multitasking and parallel processing may be advantageous. Moreover, the separation of various system components in the embodiments described above should not be understood as requiring such separation in all embodiments, and it should be understood that any described program components and systems can generally be integrated together in a single software product or packaged into multiple software products.", "", "One or more embodiments of the disclosure may be referred to herein, individually and/or collectively, by the term “invention” merely for convenience and without intending to voluntarily limit the scope of this application to any particular invention or inventive concept. Moreover, although specific embodiments have been illustrated and described herein, it should be appreciated that any subsequent arrangement designed to achieve the same or similar purpose may be substituted for the specific embodiments shown. This disclosure is intended to cover any and all subsequent adaptations or variations of various embodiments. Combinations of the above embodiments, and other embodiments not specifically described herein, are apparent to those of skill in the art upon reviewing the description.", "", "The Abstract of the Disclosure is provided to comply with 37 C.F.R. § 1.72 (b) and is submitted with the understanding that it will not be used to interpret or limit the scope or meaning of the claims. In addition, in the foregoing Detailed Description, various features may be grouped together or described in a single embodiment for the purpose of streamlining the disclosure. This disclosure is not to be interpreted as reflecting an intention that the claimed embodiments require more features than are expressly recited in each claim. Rather, as the following claims reflect, inventive subject matter may be directed to less than all of the features of any of the disclosed embodiments. Thus, the following claims are incorporated into the Detailed Description, with each claim standing on its own as defining separately claimed subject matter.", "", "It is intended that the foregoing detailed description be regarded as illustrative rather than limiting and that it is understood that the following claims including all equivalents are intended to define the scope of the invention. The claims should not be read as limited to the described order or elements unless stated to that effect. Therefore, all embodiments that come within the scope and spirit of the following claims and equivalents thereto are claimed as the invention."], "claims": ["a radially inner portion disposed along an inner circumference of the rim; a first sidewall; a second sidewall spaced apart from the first sidewall, wherein the first sidewall and the second sidewall extend radially outward from the radially inner portion; and a radially outer tire engaging portion disposed along an outer circumference of the rim, the radially outer tire engaging portion extending from the first sidewall and the second sidewall, respectively; an opening that extends through the radially inner portion, the first sidewall, the second sidewall, the radially outer tire engaging portion, or any combination thereof, wherein the first sidewall, the second sidewall, the radially outer tire engaging portion, the radially inner portion, or any combination thereof includes a composite laminate, the composite laminate including one or more compressed layers of a first composite material and one or more compressed layers of a second composite material, the second composite material being different than the first composite material and having a lower porosity compared to the first composite material, wherein the first composite material includes a matrix of a polymer-based material and natural fibers for a reinforcing material, and wherein the opening extends through at least one layer of the one or more compressed layers of the second composite material, such that the second composite material surrounds the opening.", "wherein the natural fibers of the reinforcing material are flax fibers.", "wherein the second composite material includes a matrix of a second polymer-based material and fibers for a second reinforcing material, wherein the second polymer-based material is a plastic, an acrylic, a resin, an epoxy, or any combination thereof, and wherein the fibers of the second reinforcing material are carbon fibers.", "wherein the rim further comprises a second opening that extends through the radially outer tire engaging portion, wherein the at least one layer of the second composite material is at least one first layer of the second composite material, and wherein the second opening extends through at least one second layer of the one or more compressed layers of the second composite material, such that the second composite material surrounds the second opening.", "5 . The rim of claim 4 , wherein the first opening is a spoke hole, a valve hole, or an opening in which an electronic component of the bicycle is supportable, and wherein the second opening is an access hole.", "6 . The rim of claim 4 , wherein the at least one first layer of the second composite material forms at least part of the radially inner portion, the part of the radially inner portion extending all of the way around the radially inner portion.", "7 . The rim of claim 6 , wherein the at least one second layer of the second composite material forms at least part of the radially outer tire engaging portion, the part of the radially outer tire engaging portion extending all of the way around the radially outer tire engaging portion.", "wherein the rim further comprises a second opening that extends through the radially inner portion, the second opening being at a distance away from first opening along the radially inner portion.", "wherein the second opening extends through at least one second layer of the one or more compressed layers of the second composite material, such that the second composite material surrounds the second opening.", "10 . The rim of claim 9 , wherein at least one layer of the one or more compressed layers of the first composite material partially forms the radially inner portion, the at least one layer of the first composite material being disposed between the at least one first layer of the second composite material and the at least one second layer of the second composite material.", "11 . The rim of claim 8 , wherein the first opening and the second opening are spoke holes, respectively.", "positioning a layer of a first composite material within a mold, the first composite material including natural fibers of a first reinforcing material; positioning a layer of a second composite material within the mold, such that a portion of the layer of the second composite material abuts, overlaps, or abuts and overlaps the layer of the first composite material, the second composite material including fibers of a second reinforcing material, the second reinforcing material being different than the first reinforcing material and having a lower porosity compared to the first composite material; forming the bicycle component, forming the bicycle component comprising forming a composite laminate that includes the layer of the first composite material and the layer of the second composite material within the mold; and forming an opening through the layer of the second composite material of the composite laminate, such that the second composite material surrounds the opening.", "wherein the fibers of the second reinforcing material are carbon fibers.", "14 . The method of claim 12 , wherein forming the opening through the layer of the second composite material of the composite laminate comprises drilling the opening through the layer of the second composite material of the composite laminate.", "15 . The method of claim 12 , wherein the layer of the first composite material and the layer of the second composite material form portions of a radially inner portion of the rim or a radially outer tire engaging portion of the rim, respectively.", "wherein the method further comprises: positioning a second layer of the second composite material within the mold, such that a portion of the second layer of the second composite material abuts, overlaps, or abuts and overlaps the layer of the first composite material and the layer of the first composite material is between the first layer of the second composite material and the second layer of the second composite material; and forming a second opening through the composite laminate, the forming of the second opening comprising forming the second opening through the second layer of the second composite material of the composite laminate, such that the second composite material surrounds the second opening.", "wherein the layer of the second composite material extends all of the way around the rim and forms at least part of a radially inner portion disposed along an inner circumference of the rim, or at least part of a radially outer tire engaging portion disposed along an outer circumference of the rim.", "wherein the method further comprises positioning a second layer of the second composite material within the mold, such that the layer of the first composite material is between the first layer of the second composite material and the second layer of the second composite material, and wherein the second layer of the second composite material forms at least part of the radially outer tire engaging portion.", "19 . The method of claim 18 , wherein the layer of the first composite material forms at least part of a sidewall of the rim.", "a radially inner portion disposed along an inner circumference of the rim; a first sidewall; a second sidewall spaced apart from the first sidewall, wherein the first sidewall and the second sidewall extend radially outward from the radially inner portion; and a radially outer tire engaging portion disposed along an outer circumference of the rim, the radially outer tire engaging portion extending from the first sidewall and the second sidewall, respectively; a number of openings that extend through the radially inner portion, the number of openings being spoke holes and being spaced apart from each other around the radially inner portion, wherein at least the radially inner portion includes a composite laminate, the composite laminate including one or more compressed layers of a first composite material and one or more compressed layers of a second composite material, the second composite material being different than the first composite material and having a lower porosity compared to the first composite material, wherein the compressed layers of the first composite material and the second composite material each consist of plies of strips of corresponding composite material, wherein the first composite material includes a matrix of a polymer-based material and natural fibers for a reinforcing material, and wherein the number of openings extend through at least one layer of the one or more compressed layers of the second composite material, such that the second composite material surrounds the number of openings."], "bibtex": "@patent{20250074107,\n    title = {MULTIPLE COMPOSITE BICYCLE RIM},\n    number = {20250074107},\n    year = {2025},\n    note = {File: US20250074107A1-20250306.XML}\n    }", "classification": "B60B502FI"}, {"title": "MOVABLE WHEEL COVER APPARATUS AND RELATED ACTUATION SYSTEMS FOR AERODYNAMIC EFFICIENCIES", "doc_number": "20250074108", "filename": "US20250074108A1-20250306.XML", "abstract": "The present disclosure relates to apparatus for covering wheel components, and related wheel modules and vehicles. In one or more embodiments, a wheel module includes a wheel component including a plurality of wheel openings, and a cover frame. The cover frame includes a plurality of openings, and a plurality of divider sections at least partially dividing the plurality of openings. The wheel module includes an actuation system configured to rotationally drive the cover frame relative to the wheel component in response to centrifugal force to at least partially cover the wheel opening. The wheel module includes a retraction spring configured to bias the cover frame to rotationally drive the cover frame relative to the wheel component to at least partially uncover the wheel openings.", "detailed_description": ["The present disclosure relates to apparatus for covering wheel components, and related wheel modules and vehicle components. In one or more embodiments, a wheel module includes a wheel component and a cover frame. The cover frame includes a plurality of openings and a plurality of divider sections. The wheel module includes an actuation system configured to rotationally drive the cover frame relative to the wheel component and in a first rotational direction in response to centrifugal force generated by spinning of the wheel component and the actuation system. The wheel module includes a retraction spring configured to bias the cover frame in response to the rotation of the cover frame relative to the wheel component in the first rotational direction, where the bias rotationally drives the cover frame relative to the wheel component and in a second rotational direction that is opposite of the first rotational direction. Rotation of the cover frame in the first rotational direction at least partially covers wheel openings of the wheel component, and rotation of the cover frame in the second rotational direction at least partially uncovers the wheel openings of the wheel component.", "", "The subject matter facilitates brake cooling and reduced wheel pressure at low speeds, and increased aerodynamic efficiencies at higher speeds. The subject matter facilitates such benefits while maintaining design modularity and aesthetic appeal.", "", "The disclosure contemplates that terms used herein such as “couples,” “coupling,” “couple,” and “coupled” may include but are not limited to welding, fusing, melting together, interference fitting, and/or fastening such as by using bolts, threaded connections, pins, and/or screws. The disclosure contemplates that terms such as “couples,” “coupling,” “couple,” and “coupled” may include but are not limited to integrally forming. The disclosure contemplates that terms such as “couples,” “coupling,” “couple,” and “coupled” may include but are not limited to direct coupling and/or indirect coupling, such as indirect coupling through components such as links, blocks, and/or frames.", "", "FIG.1is a schematic perspective view of a vehicle100, according to one or more embodiments. The vehicle100may include multiple sensors101and/or multiple cameras102. The vehicle100includes one or more wheel modules110. In the implementation shown inFIG.1, the vehicle100is a truck. The present disclosure contemplates that the subject matter described herein can be used in any other type of vehicle having any numbers of wheels, such as vans and/or sport-utility vehicles (SUVs).", "", "FIG.2is a schematic partial front view of a wheel module200in a first position, according to one or more embodiments.FIG.3is a schematic partial front view of the wheel module200shown inFIG.2in a second position, according to one or more embodiments. In one or more embodiments, each of the one or more wheel modules110of the vehicle100shown inFIG.1can include wheel module200.", "", "The wheel module200includes a cover frame210. In one or more embodiments, the cover frame210is disc-shaped. The cover frame210includes a first opening211(e.g., a central opening), a plurality of second openings212(e.g., outer openings), and a plurality of divider sections214at least partially dividing the plurality of second openings212. In one or more embodiments, the cover frame210includes a plurality of third openings213. The cover frame210includes an outer section215. In one or more embodiments, the outer section215is arcuate, such as in the shape of a ring. In one or more embodiments, the outer section215surrounds the second openings212and the divider sections214, and the outer section215defines an outer perimeter of the cover frame210. The plurality of second openings212are aligned radially between the first opening211and the outer section215, and the divider sections214are aligned radially between the first opening211and the outer section215.", "", "The wheel module200includes a wheel component240. The wheel component240can be, for example, a hub cap or a rim. Other wheel components are contemplated. The wheel component240includes a first wheel opening241(e.g., a central wheel opening) and a plurality of second wheel openings242(e.g., outer wheel openings). In one or more embodiments, the wheel component240includes a plurality of third wheel openings243. The wheel component240includes an outer wheel section245, and a plurality of spokes246at least partially dividing the plurality of second wheel openings242. The plurality of second wheel openings242are aligned radially between the first wheel opening241and the outer wheel section245.", "", "A center rod215is received in the first wheel opening241, and the center rod215is received in the first opening211. In the first position shown inFIG.2, the second wheel openings241are completely uncovered by the cover frame210. In the second position shown inFIG.3, the divider sections214of the cover frame210at least partially cover the second wheel openings241(the second wheel openings241are shown as partially covered inFIG.3). A plurality of fasteners244extend into the third wheel openings243. The fasteners244can include, for example, lug nuts and/or wheel studs. Other fasteners are contemplated.", "", "FIG.4is a schematic front view of the wheel module200shown inFIGS.2and3, according to one or more embodiments. The cover frame210is not shown inFIG.4for purposes of visual clarity.", "", "An actuation system400is configured to rotationally drive the cover frame210relative to the wheel component240in response to centrifugal force F1to at least partially cover the second wheel openings242(e.g., in the second position). In one or more embodiments, the actuation system400is configured to rotationally drive the cover frame210in a first rotational direction RD1in response to the centrifugal force F1. The centrifugal force F1is generated by spinning of the actuation system400and/or the wheel component240. The actuation system400can spin, for example, with the wheel component240by an axle driving the wheel component240. The axle can be turned, for example, by a motor of the vehicle100during driving of the vehicle100. The axle can be supported by a frame (such as a steel beam frame) of the vehicle100, and the frame of the vehicle100can support the motor (such as an electric motor and/or a combustion motor).", "", "The wheel component240includes a retention opening249formed in at least one of the plurality of spokes246. The actuation system400includes an actuation housing410including a base411and a plurality of sidewalls412defining a housing pocket413. The actuation housing410is positioned in the retention opening249of the wheel component240. A pivot arm414is positioned in the housing pocket413and pivotably coupled to the base411. One or more magnets415are coupled to the pivot arm414. One or more movable masses419are coupled to the pivot arm414. The pivot arm414is pivotable between an inward position (shown in solid inFIG.4) and an outward position (shown in ghost inFIG.4). In one or more embodiments, the actuation system400includes a cartridge disposable at least partially in the cover frame210.", "", "As the pivot arm414pivots between the inward position and the outward position, an attractive magnetic force AF1between the one or more magnets415and a metallic structure251pulls the metallic structure251(and the cover frame210) to follow the one or more magnets415. When the one or more magnets415are moved to the outward position, the metallic structure251is pulled to position471shown inFIG.4. The pulling of the metallic structure251and the cover frame210toward the outward position magnetically drives the cover frame210in the first rotational direction RD1and relative to the wheel component240to at least partially cover the second wheel openings242. The pulling of the metallic structure251and the cover frame210toward the inward position magnetically drives the cover frame210in the second rotational direction RD2and relative to the wheel component240to at least partially uncover the second wheel openings242. In one or more embodiments, the metallic structure251has a length that is equal to or greater than a radial distance RD1between the inward position and the outward position of the one or more magnets415.", "", "The present disclosure contemplates that a size (such as length, diameter, and/or width) of the metallic structure251and/or the one or more magnets415can be increased or decreased to increase or decrease a magnitude of the attractive magnetic force AF1(or repelling magnetic force, if used). A shape of the metallic structure251and/or the one or more magnets415can be altered to increase or decrease a magnitude of the attractive magnetic force AF1(or repelling magnetic force, if used).", "", "In the inward position, the one or more magnets415are aligned with the metallic structure251coupled to the cover frame210. The actuation system400includes a shaft416coupling the pivot arm414to the actuation housing410. A retraction spring417is configured to bias the cover frame210to rotationally drive the cover frame210relative to the wheel component240to at least partially uncover the second wheel openings242(e.g., in the first position). The retraction spring417is configured to bias the cover frame210in response to the centrifugal force F1that pivots the pivot arm414toward the outward position. In one or more embodiments, a spring constant of the retraction spring417is sufficient to overcome gravitational forces acting on the pivot arm414, the one or more magnets415, and/or the one or more movable masses419. The retraction spring417is disposed about the shaft416and is configured to bias the pivot arm414toward the inward position. The biasing of the cover frame210using the retraction spring417rotationally drives the cover frame210in a second rotational direction RD2that is opposite of the first rotational direction RD1. In one or more embodiments, the metallic structure251includes one or more arcuate segments or one or more linear segments. In one or more embodiments, the metallic structure251includes a single segment, such as a single linear segment (as shown inFIG.4). In one or more embodiments, the metallic structure251includes a complete ring, such as if a repelling magnetic force is used (as described below). In one or more embodiments, a bearing418is disposed about the shaft416and is disposed within the pivot arm414.", "", "A retraction spring248is configured to bias the cover frame210to rotationally drive the cover frame210relative to the wheel component240to at least partially uncover the second wheel openings242(e.g., in the first position). The retraction spring248is positioned between the cover frame210and the wheel component240. In one or more embodiments, the retraction spring248is positioned about the center rod215. The retraction spring248is configured to bias the cover frame210in response to rotation of the cover frame210in the first rotational direction RD1. The biasing of the cover frame210using the retraction spring248rotationally drives the cover frame210in a second rotational direction RD2that is opposite of the first rotational direction RD1.", "", "In one or more embodiments, both of the retraction spring248and the retraction spring417are included for the wheel module200. In one or more embodiments, one of the retraction spring248or the retraction spring417is included for the wheel module200, and the other of the retraction spring248or the retraction spring is omitted from the wheel module200.", "", "The covering and uncovering of the second wheel openings242can be controlled by a rotation speed (e.g., in rotations-per-minute (RPMs)) of the actuation system400and/or the wheel component240. When the rotation speed is below a threshold speed, the centrifugal force F1is low enough such that gravity and/or the second spring417biases the pivot arm414, the one or more movable mases419, and the one or more magnets415into the inward position such that the metallic structure251and the cover frame210are pulled toward the first position shown inFIG.2using the attractive magnetic force AF1(oriented similar to a direction that is opposite of the direction shown inFIG.4) that drives (e.g., in the second rotational direction RD2) the cover frame210.", "", "When the rotation speed is at or above the threshold speed, the pivot arm414undergoes sufficient centrifugal force F1to pivot the pivot arm414and the one or more magnets415into the outward position such that the attractive magnetic force F1(oriented similar to the direction shown inFIG.4) drives the cover frame210into the second position shown inFIG.3. The biasing (e.g., using the retraction spring417) of the pivot arm414and the one or more magnets415into the inward position causes the attractive magnetic force AF1(oriented similar to a direction that is opposite of the direction shown inFIG.4) acting on the cover frame210to bias the cover frame210into the first position shown inFIG.2. The threshold speed can be pre-set, for example, by a spring constant of the retraction spring248; a spring constant of the retraction spring417; masses and/or sizes of the pivot arm414, the movable mass(es)419, the magnet(s)415, the bearing418, and/or the cover frame210; and/or a magnitude of the magnetic interaction between the magnet(s)415and the metallic structure251(which can be controlled by the materials, sizes, and/or masses of the magnet(s)415and/or the metallic structure251). In one or more embodiments, the threshold speed is within a range of 600 rotations-per-minute to 1,500 rotations-per-minute. In one or more embodiments, the threshold speed is within a range of 675 rotations-per-minute to 1,000 rotations-per-minute, such as about 840 rotations-per-minute. The threshold speed can be a rotation speed of the wheel component240. In one or more embodiments, the threshold speed is selected such that the vehicle100drives at a speed within a range of 45 miles-per-hour to 70 miles-per-hour, such as about 45 miles-per-hour. In one or more embodiments, the threshold speed is selected such that the vehicle100drives at a speed of about 50 miles-per-hour.", "", "The metallic structure251can be magnetic (such as ferromagnetic) or non-magnetic. In one or more embodiments, the metallic structure251is formed of iron, steel, and/or aluminum. In one or more embodiments, the one or more magnets415are ferromagnetic to generate the attractive magnetic force AF1. In one or more embodiments, the one or more magnets415include iridium (Ir), such as an iridium manganese (IrMn) alloy. The present disclosure contemplates that the described material(s) of the metallic structure251and the one or more magnets451can be swapped with each other such that structure251is a magnet and the one or more magnets451are replaced with a metallic mass that can be magnetic or non-magnetic. In such an embodiment, the pivoting of the metallic mass pulls the magnetic structure251using the attractive magnetic force AF1.", "", "In one or more embodiments, the cover frame210and/or the actuation housing410is formed of a non-metallic material, for example including one or more polymers (such as plastic(s) including but not limited to acrylonitrile butadiene styrene (ABS)) and/or one or more composites (such as carbon fiber and/or fiberglass).", "", "The one or more movable masses419have a mass that is larger than a mass of the one or more magnets415, and is larger than a mass of the pivot arm414. The one or more movable masses419facilitate pivoting the pivot arm414between the inward position and the outward position. In one or more embodiments, the one or more movable masses419have a density larger than a density of the one or more magnets415, and the pivot arm414has a density lower than the density of the one or more movable masses419. In one or more embodiments, the density of the pivot arm414is lower than the density of the one or more magnets415.", "", "In addition to the above, other materials are contemplated for the subject matter described herein.", "", "The present disclosure contemplates that a repelling magnetic force can be used in place of the attractive magnetic force AF1to bias the cover frame210.", "", "As the pivot arm414moves between the inward position and the outward position, the pivot arm414can follow a path431. The path431can be arcuate or linear. In one or more embodiments, the metallic structure251is aligned with an entirety of the path431. In such an embodiment, the movement of the magnets415along the path431can increase a magnetic force acting on the metallic structure251, which rotationally drives the cover frame210relative to the wheel component240.", "", "In one or more embodiments, the metallic structure251is aligned with a portion of the path431(as shown inFIG.4). In the inward position, at least one of the one or more magnets415aligns with at least part of the metallic structure251. The attractive magnetic force AF1facilitates maintaining alignment and/or realignment of the metallic structure251with the at least one of the one or more magnets415as the one or more magnets415move between the inward position and the outward position. The attractive magnetic force AF1can be oriented tangentially to a center of the cover frame210. The direction of the attractive magnetic force AF1can change between the inward position and the outward position.", "", "The metallic structure251can include an end portion that aligns with the portion of the path431, as shown inFIG.4. If a repelling magnetic force is used in place of the attractive magnetic force AF1, the repelling magnetic force can be stronger when the one or more magnets415are aligned with the metallic structure251, and the repelling magnetic force can be reduced or eliminated when the one or more magnets415are misaligned from the metallic structure251.", "", "FIG.5is a schematic perspective view of the actuation system400shown inFIG.4, according to one or more embodiments.", "", "FIG.6is a schematic partial front view of a wheel module600in a first position, according to one or more embodiments.FIG.7is a schematic partial front view of the wheel module600shown inFIG.6in a second position, according to one or more embodiments.", "", "The wheel module600may be similar to the wheel module200and includes one or more of the aspects, features, components, operations, and/or properties thereof. In the first position shown inFIG.6, the second wheel openings241are completely uncovered by the cover frame210. In the second position shown inFIG.7, the divider sections214of the cover frame210at least partially cover the second wheel openings241(the second wheel openings241are shown as completely covered inFIG.7). A tire601is coupled to the wheel component240.", "", "The cover frame210includes a guide channel232. The actuation system610includes a retention frame611pivotably coupled to the center rod215, a pivot arm612pivotably coupled to the retention frame611, and a movable mass613coupled to the pivot arm612. In response to the centrifugal force F1acting on the movable mass613, the movable mass613is configured to slide along the guide channel232to mechanically drive the cover frame210in a first rotational direction RD1relative to the wheel component240.FIG.6shows the movable mass613in an inward position along the guide channel232, andFIG.7shows the movable mass613in an outward position along the guide channel232.", "", "The cover frame210includes a pair of rails233,234extending relative to at least one of the divider sections214. The guide channel232is defined at least partially between the pair of rails233,234. The movable mass613is configured to abut against one of the rails233,234(such as rail234) as the movable mass613slides along the guide channel232to mechanically drive the cover frame210in the first rotational direction RD1.", "", "FIG.8is a schematic perspective front view of the wheel module600shown in the first position ofFIG.6, according to one or more embodiments. The actuation system610includes a shaft614coupling the pivot arm612to the retention frame611. In one or more embodiments, the retraction spring248is disposed about the shaft614to bias the cover frame210in a second rotational direction RD2. In one or more embodiments, the movable mass613includes a plurality of washers615disposed about a second shaft619. The present disclosure contemplates that other objects may be used in place of the washers615. A head620of the second shaft619is disposed in the guide channel232.", "", "The cover frame210includes a locating tab237extending relative to at least one of the divider sections214and into at least one of the second wheel openings242of the wheel component240. The locating tab(s)237can limit rotation of the cover frame210relative to the wheel component240by abutting against respective sides of two adjacent divider sections214. A recess247can be formed in the side of at least one of the two adjacent divider sections214. In one or more embodiments, the cover frame210is rotatable relative to the wheel component240by an angle A1between an open position (where the second wheel openings242are completely uncovered) and a closed position (where the second wheel openings242are completely covered). In one or more embodiments, the angle A1is less than 60 degrees.", "", "In the implementation shown inFIG.8, the angle A1is limited by the locating tab(s)237. In one or more embodiments, the angle A1is limited by a spring constant of the retraction spring248, a length of the pivot arm612, a position of the guide channel232, a length of the retention frame611, and/or a mass of the movable mass613. In one or more embodiments, the retraction spring248(if used) and/or the retraction spring417(if used) includes a torsion spring. Other springs can be used for the retraction spring248and/or the retraction spring417.", "", "As described above in relation toFIG.4, the implementation shown inFIG.8for covering and uncovering of the second wheel openings242can be controlled based on the threshold speed. The threshold speed can be pre-set, for example, by the spring constant of the retraction spring248; the length of the pivot arm612; the position of the guide channel232; the length of the retention frame611; and/or masses and/or sizes of the movable mass613, the pivot arm612, and/or the cover frame210.", "", "FIG.9is a schematic side view of the wheel module600shown inFIG.8, according to one or more embodiments. A receptacle901is disposed about the center rod215, and the receptacle901is disposed through the cover frame210and through the wheel component240.", "", "FIG.10is a schematic partial back view of the cover frame210and the metallic structure251shown inFIG.4, according to one or more embodiments. The wheel component240and the actuation system400are not shown inFIG.10for purposes of visual clarity.", "", "The metallic structure251(which is shown as a single linear segment, for example a single linear strip) is coupled to the cover frame210. In one or more embodiments, the metallic structure251is molded into, fastened to, and/or press-fit into an opening1001formed in one of the divider sections214.", "", "Benefits of the present disclosure include cooling of vehicle components (such as brake components, e.g. brake pads); reduced fluid pressure (e.g., air pressure) acting on vehicle components; reduced wind noise; and increased aerodynamic efficiencies (e.g., due to air flow in relation to wheel modules). Benefits of the present disclosure also include reduced wear and/or increased operational lifespans of vehicle components; enhanced aesthetic appeal for wheel designs; and modularity of use across a variety of wheel designs (e.g., modularity across rim designs). As an example, wheel modules can be configured to at least partially cover wheel openings of the wheel component at higher speeds to facilitate increased aerodynamic efficiencies, and can be configured to at least partially uncover the wheel openings at lower speeds to facilitate brake cooling and reduced wheel pressure at low speeds. Such wheel modules can maintain design modularity and aesthetic appeal.", "", "It is contemplated that one or more aspects disclosed herein may be combined. As an example, one or more aspects, features, components, operations and/or properties of the embodiments of the vehicle100, the wheel module200, the actuation system400, the wheel module600, and/or the actuation system610may be combined. Moreover, it is contemplated that one or more aspects disclosed herein may include some or all of the aforementioned benefits.", "", "As an example, one or more aspects, features, components, operations and/or properties of the wheel module600can be used in the wheel module200. For example, the pivot arm414, the one or more magnets415, the one or more movable masses419, and/or the metallic structure251can be omitted; and at least part of the actuation system610can be disposed in the housing pocket413. In such an implementation, the retention frame611can be pivotably coupled to the shaft416, and the pair of rails233,234can extend relative to the base411. In such an implementation, the retention frame611, the shaft614, the pivot arm612, the movable mass613, and the pair of rails233,234can be disposed in the housing pocket413.", "", "While the foregoing is directed to embodiments of the present disclosure, other and further embodiments of the disclosure may be devised without departing from the basic scope thereof, and the scope thereof is determined by the claims that follow."], "claims": ["a wheel component comprising a plurality of wheel openings: a cover frame comprising: a plurality of openings, and a plurality of divider sections at least partially dividing the plurality of openings, and an actuation system configured to rotationally drive the cover frame relative to the wheel component in response to centrifugal force to at least partially cover the wheel opening; and a retraction spring configured to bias the cover frame to rotationally drive the cover frame relative to the wheel component to at least partially uncover the wheel openings.", "2 . The wheel module of claim 1 , wherein the actuation system is configured to rotationally drive the cover frame in a first rotational direction, and the retraction spring is configured to bias the cover frame in response to rotation of the cover frame in the first rotational direction to rotationally drive the cover frame in a second rotational direction that is opposite of the first rotational direction.", "3 . The wheel module of claim 1 , wherein the centrifugal force is generated by spinning of the wheel component and the actuation system.", "the wheel component further comprises: a central wheel opening, an outer wheel section, the plurality of wheel openings aligned radially between the central wheel opening and the outer wheel section, and a plurality of spokes at least partially dividing the wheel openings; and the cover frame further comprises: a central opening, an outer section, the plurality of openings aligned radially between the central opening and the outer section, and the divider sections aligned radially between the central opening and the outer section.", "5 . The wheel module of claim 1 , wherein the cover frame comprises a locating tab extending relative to at least one of the divider sections and into at least one of the wheel openings of the wheel component.", "an actuation housing comprising a base and a plurality of sidewalls defining a housing pocket, wherein the actuation housing is positioned in the retention opening of the wheel component; a pivot arm positioned in the housing pocket and pivotably coupled to the base, wherein the pivot arm is pivotable between an inward position and an outward position.", "one or more magnets coupled to the pivot arm; and one or more movable masses coupled to the pivot arm, wherein the one or more movable masses have a first mass that is larger than a second mass of the one or more magnets.", "8 . The wheel module of claim 7 , wherein the one or more magnets are aligned with a metallic structure coupled to the cover frame to magnetically drive the cover frame relative to the wheel component.", "9 . The wheel module of claim 6 , wherein the retraction spring is positioned between the cover frame and the wheel component.", "a shaft coupling the pivot arm to the actuation housing, and the retraction spring is disposed about the shaft and configured to bias the cover frame by biasing the pivot arm toward the inward position.", "a retention frame; a pivot arm pivotably coupled to the retention frame; and a shaft coupling the pivot arm to the retention frame, the retraction spring disposed about the shaft; a movable mass coupled to the pivot arm and configured to slide along the guide channel, wherein the movable mass is configured to abut against one of the rails as the movable mass slides along the guide channel to mechanically drive the cover frame in a first rotational direction.", "a cover frame comprising: a plurality of openings, and a plurality of divider sections at least partially dividing the plurality of openings; and an actuation system configured to rotationally drive the cover frame in a first rotational direction in response to centrifugal force generated by spinning of the actuation system; and a retraction spring configured to bias the cover frame in response to rotation of the cover frame in the first rotational direction to rotationally drive the cover frame in a second rotational direction that is opposite of the first rotational direction.", "a central opening, and an outer section, the plurality of openings aligned radially between the central opening and the outer section, and the divider sections aligned radially between the central opening and the outer section.", "an actuation housing comprising a base and a plurality of sidewalls defining a housing pocket; a pivot arm positioned in the housing pocket and pivotably coupled to the base, wherein the pivot arm is pivotable between an inward position and an outward position.", "15 . The apparatus of claim 14 , wherein the actuation system further comprises one or more magnets coupled to the pivot arm, wherein the one or more magnets are aligned with a metallic structure coupled to the cover frame to magnetically drive the cover frame.", "a shaft coupling the pivot arm to the actuation housing; and the retraction spring is disposed about the shaft and is configured to bias the cover frame by biasing the pivot arm toward the inward position.", "a retention frame; a pivot arm pivotably coupled to the retention frame; and a movable mass coupled to the pivot arm and configured to slide along the guide channel to mechanically drive the cover frame in the first rotational direction.", "the actuation system further comprises a shaft coupling the pivot arm to the retention frame; the retraction spring is disposed about the shaft; the cover frame comprises a pair of rails extending relative to at least one of the divider sections; the guide channel is defined at least partially between the pair of rails; and the movable mass is configured to abut against one of the rails as the movable mass slides along the guide channel to mechanically drive the cover frame in the first rotational direction.", "one or more wheel modules comprising: a wheel component comprising a first wheel opening and a plurality of second wheel openings, and a cover frame comprising: a first opening, a plurality of second openings, and a plurality of divider sections at least partially dividing the plurality of second outer openings; and an actuation system configured to rotationally drive the cover frame relative to the wheel component in response to centrifugal force to at least partially cover the plurality of second wheel openings; and a retraction spring configured to bias the cover frame to rotationally drive the cover frame relative to the wheel component to at least partially uncover the plurality of second wheel openings.", "20 . The vehicle of claim 19 , wherein the retraction spring is disposed about a center rod and is positioned between the cover frame and the wheel component, wherein the center rod is received in the first opening."], "bibtex": "@patent{20250074108,\n    title = {MOVABLE WHEEL COVER APPARATUS AND RELATED ACTUATION SYSTEMS FOR AERODYNAMIC EFFICIENCIES},\n    number = {20250074108},\n    year = {2025},\n    note = {File: US20250074108A1-20250306.XML}\n    }", "classification": "B60B720FI"}, {"title": "OMNIDIRECTIONAL ROTATION DRIVE DEVICE", "doc_number": "20250074109", "filename": "US20250074109A1-20250306.XML", "abstract": "An omnidirectional rotation drive device includes a knuckle connected to a vehicle body, a wheel body configured to rotate around the knuckle, a plurality of sub-wheel units rotatably supported on the wheel body, and a bevel gear located in the wheel body and configured to rotate around the knuckle. The plurality of sub-wheel units is rotated depending on a difference between an angular speed of the wheel body and an angular speed of the bevel gear.", "detailed_description": ["Hereinafter, reference is made in detail to various embodiments of the present disclosure, examples of which are illustrated in the accompanying drawings and described below. While the technical concepts of the present disclosure are described in conjunction with various embodiments, it should be understood that the present description is not intended to limit the disclosure to the embodiments described herein. On the contrary, the present disclosure is intended to cover not only the disclosed embodiments, but also various alternatives, modifications, equivalents, and other embodiments, which may be included within the spirit and scope of the disclosure as defined by the appended claims. The present embodiments are provided to more fully explain the disclosure to those of ordinary knowledge in the art.", "", "Terms such as “part”, “unit”, and “module” described in the specification mean a unit configured to process at least one function or operation, and the unit may be implemented by hardware or software or a combination of hardware and software. When a component, device, element, or the like of the present disclosure is described as having a purpose or performing an operation, function, or the like, the component, device, or element should be considered herein as being “configured to” meet that purpose or perform that operation or function. Further, the device may include or be controlled by one or more controllers having one or more processors and one or more memories, such as non-transitory memories, to store and execute instructions as described herein.", "", "The terms used in the present application are used only to describe specific embodiments and are not intended to limit the present disclosure. Singular forms are intended to include plural forms as well, unless the context clearly indicates otherwise.", "", "Meanwhile, in this specification, terms such as “first” and “second” are used to describe various components having the same names, and the terms are used only for the purpose of distinguishing one component from other components. The components are not limited by the terms in the following description.", "", "In this specification, a first direction refers to a forward-and-rearward direction of a vehicle. Further, a width direction of the vehicle, which is perpendicular to the first direction, is hereinafter referred to as a second direction. In addition, when one direction of the first direction and the second direction is referred to as a positive direction, a negative direction may be interpreted as referring to a direction opposite or reverse of the positive direction.", "", "Hereinafter, embodiments are described in detail with reference to the accompanying drawings. In describing the embodiments with reference to the accompanying drawings, the same or corresponding components are denoted by the same reference numerals and redundant description thereof have been omitted.", "", "The present disclosure relates generally to an omnidirectional rotation drive device. More particularly, the present disclosure relates to an omni-structure drive device capable of moving in all directions by providing a wheel body20that can rotate in the first direction and a sub-wheel unit100that can rotate in the second direction.", "", "As shown inFIGS.1and2, the omnidirectional rotation drive device of the present disclosure includes a knuckle10. At least a part of the knuckle10is disposed in a vehicle. The drive device also includes a first motor30located on the knuckle10with the knuckle10as the central axis and configured to rotate the wheel body20. In one example, the wheel body20is located around the outer peripheral surface of the knuckle10and is formed to extend outward from the outer peripheral surface thereof. The first motor30has a stator located in the knuckle10and a rotor integrally rotated with the wheel body20.", "", "In addition, when the stator of the first motor30is fixed to the knuckle10and current is applied to rotate the rotor, the rotor and the wheel body20are configured to be integrally rotated. Further, the wheel body20is configured to be rotated in the first direction, and drive force of the vehicle in the forward-and-rearward direction is configured to be applied through the first motor30. As an embodiment of the present disclosure, the wheel body20and the rotor of the first motor30are interpreted as the same concept.", "", "The wheel body20is configured to be rotated in the first direction with respect to a central portion21having the knuckle10located therethrough. The wheel body20is also formed to extend outward from the central portion21in the radial direction of the knuckle10and is configured to allow the sub-wheel unit100to be coupled thereto. In the embodiment of the present disclosure, the bridge parts22are formed to extend in two rows along the outside, i.e., the radial outer side, of the central portion21in the side cross section, and sub-wheels110are respectively coupled to the outer sides or ends of the bridge parts22. In one embodiment, two adjacent sub-wheels110may be located in each row of the sub-wheel units100arranged in two rows so as to have the same central axis. Additionally, the central axis of rotation of each of the sub-wheels110formed in two row is formed in a direction perpendicular to the central axis of rotation of the wheel body20.", "", "The knuckle10penetrates one side of the wheel body20, and one end thereof is coupled to a wheel drive shaft bearing23located on the other side of the wheel body20. Here, the wheel drive shaft bearing23is configured to fix one end of the knuckle10in response to rotation of the wheel body20.", "", "The bridge parts22of the wheel body20each include at least two rows of the sub-wheel units100disposed on the outer peripheral surface thereof and located in the second direction. The sub-wheel units100are located at the outer end or circumference of the wheel body20. Here, two rows of the sub-wheel units100are located at the end of the wheel body20in the second direction. Further, the sub-wheel units100are respectively located inside, i.e., at the inner side, and outside, at the outer side, of the wheel body20and are configured to have overlapping intervals on each side of the wheel body20. Additionally, each sub-wheel unit100located in each row includes two sub-wheels110adjacent to each other. Here, two sub-wheels110forming one sub-wheel unit100are constrained to the same axis by one drive unit200and are simultaneously rotated. The sub wheel units100, including the sub-wheels110define the outer contact surface of the wheel body20.", "", "In other words, the sub-wheel unit100has two sub-wheels110having the same central axis. Here, two sub-wheels110are arranged in two rows on the bridge part22. Two adjacent sub-wheels110rotated by one drive shaft230form a first row inside the wheel body20. Further, two adjacent sub-wheels110rotated by another adjacent drive shaft230form a second row outside the wheel body20. In other words, each drive shaft230is located to be meshed between a bevel gear210and the paired sub-wheels110so that the number thereof is equal to the number of two adjacent sub-wheels110.", "", "FIG.1is a front cross-sectional view of the rotation drive device. InFIG.1, two sub-wheels110are coupled to the opposite ends of one drive shaft230. In other words,FIG.1shows one row forming a sub-wheel unit100, and two sub-wheels110, the central axes of which are constrained to one drive shaft230, are located in the sub-wheel unit100.", "", "In addition,FIG.2is a side cross-sectional view of the rotation drive device.FIG.2shows a configuration of the sub-wheel units100formed in two rows at the outer end of the wheel body20. The drive unit200is configured to rotate the sub-wheel units100. Here, the drive unit200includes a second motor220having a stator coupled to the knuckle10, the bevel gear210configured to correspond to the stator, and the drive shafts230configured to connect the bevel gear210to the sub-wheel units100.", "", "Further, each drive shaft230is configured to be coupled to the outer surface of the bevel gear210. In other words, the sub-wheel units100formed in two rows are configured to be respectively coupled to two drive shafts230coupled to the outer surface of the bevel gear210at a predetermined angle.", "", "Therefore, each of the sub-wheel units100of the present disclosure has a configuration in which the central axes of a pair of adjacent sub-wheels110are coupled to the end of one drive shaft230. The sub-wheel units100are formed in two rows in the second direction.", "", "The drive unit200coupled to the sub-wheel units100is configured to transmit drive force from the second motor220located in the knuckle10to the sub-wheel units100. In one embodiment, the second motor220is fixed to the wheel body20and includes the bevel gear210to which rotational force of the second motor220is applied. A drive shaft230that contacts the outer surface of the bevel gear210and transmits rotational force of the bevel gear210is provided between the bevel gear210and a sub-wheel unit100. The drive shafts230are configured to apply rotational force to each of the plurality of sub-wheel units100.", "", "The bevel gear210is formed in a circular shape to surround the knuckle10. When viewed from the side, the bevel gear210is configured to have a tapered shape so as to have a predetermined bevel angle. Here, the predetermined angle is formed as the bevel gear210moves away from the knuckle10from a position at which the bevel gear210is in contact with the knuckle10. In one embodiment, opposite side surfaces near the end or circumferential edge of the bevel gear210, i.e., the opposite side surfaces respectively facing one end of the drive shafts230, may be formed to have a narrower cross-sectional width than that of the area of the bevel gear210in contact with the knuckle10.", "", "The sub-wheel unit100, which receives drive force from the second motor220, is configured to calculate a second directional movement speed according to an angular speed W1 of the wheel body20and an angular speed W2 of the bevel gear210rotated by the second motor220. In other words, the second motor220includes a stator coupled to the knuckle10, and the bevel gear210is provided as a rotor. Therefore, the wheel body20is rotated according to the rotational angular speed of the first motor30. Here, when the second motor220is rotated at the same rotational angular speed as that of the first motor30, the sub-wheels110are switched to a non-rotating state. Accordingly, rotation of the wheel body20is applied to perform first directional movement of the vehicle.", "", "Furthermore, the movement speed of the sub-wheel units100is set in response to drive force (angular speed) of the first motor30and the second motor220.", "", "In other words, the stator of the first motor30is disposed in the knuckle10. The drive shafts230are rotated in response to a difference between the rotational angular speed of the wheel body20according to driving of the first motor30and the rotational angular speed of the bevel gear210according to driving of the second motor220. Accordingly, the sub-wheel units100are rotated in the second direction in response to whether rotation of the drive shafts230are performed. Here, when the wheel body20is rotated in a state in which the first motor30and the second motor220are coupled to the knuckle10, the second motor220needs to be driven at a speed higher or lower than the rotational angular speed of the wheel body20so as to generate a difference in the angular speed of the wheel body20and the bevel gear210, thereby enabling the sub-wheel unit100to be rotated. In other words, the rotational speed of the sub-wheel units100is set according to the difference between the angular speed of the wheel body20and the angular speed of the bevel gear210.", "", "The drive shafts230have one end coupled to the side surface of the bevel gear210and the other end coupled to a sub-wheel worm gear120located on the central axes of the two sub-wheels110. In one embodiment, each drive shaft230includes a drive worm gear232located at one end of the drive shaft230and coupled to the sub-wheel worm gear120located on the central axes of the plurality of sub-wheels110. Each drive shaft230also includes a drive bevel gear233located at the other end of the drive shaft230and coupled to the bevel gear210.", "", "Furthermore, the drive shafts230are respectively disposed on the opposite sides of the bevel gear210in a state of being inclined at a predetermined angle with respect to the height direction in the first direction. In other words, each drive shaft230is configured not to be parallel to the first direction and is disposed not to be parallel to the rotation axis of the bevel gear.", "", "Accordingly, the sub-wheel units100arranged in two rows may be formed by the drive shafts230that are coupled to one bevel gear210. Also, the sub-wheel units100are arranged in two rows in the second direction to couple the drive shafts230such that the drive shafts are arranged to be inclined to the left side and the right side, i.e., the inner and outer side of the wheel body20.", "", "In this manner, each drive shaft230is fixed to a drive shaft bearing231located in the wheel body20, and each drive shaft230is rotated in response to a difference in rotational angular speed between the bevel gear210and the wheel body20. In other words, the drive shafts230are rotated according to the difference in rotational angular speed between the bevel gear210and the wheel body20and the drive shafts230are configured to apply rotational force to the sub-wheel units100.", "", "According to one embodiment of the present disclosure,FIG.3shows a coupling relationship between the bevel gear210and the drive shafts230. Further, inFIG.3, the movement speed of the wheel body20and the sub-wheel unit100are depicted according to the difference in rotational angular speed between the bevel gear210and the wheel body20.", "", "The bevel gear210is driven as a rotor of the second motor220and is configured to be rotated in the first direction inside the wheel body20. The drive shafts230are coupled to the outer surface of the bevel gear210so as to have a predetermined angle. In one embodiment, each drive shaft230is coupled to the side surface of the bevel gear210with respect to the height direction in the first direction and forms an angle so that one end thereof coupled to the sub-wheels110is spaced outside the central axis of the wheel body20.", "", "In other words, the position of the sub-wheels110coupled to one end of the drive shaft230is set depending on the angle formed by the drive bevel gears233respectively coupled to the bevel gear210. In one embodiment, the angle between the drive shafts230respectively coupled to the opposite surfaces of the bevel gear210and configured to face each other is set so that the sub-wheels110, each of which is located in a corresponding row of the bridge part22formed in two rows, are prevented from interfering with each other.", "", "The drive shafts230are coupled to the bevel gear210located in the central portion21and are coupled to the sub-wheel units100located in the bridge part22. In one embodiment, the drive shafts230each have one end including the drive worm gear232coupled to the sub-wheel unit100located in the bridge part22, and the other end including the drive bevel gear233coupled to the bevel gear210located in the central portion21.", "", "In the drawings, the bottom of the wheel body20may be rotated in the incoming direction with respect to the plane of the drawing. The bevel gear210is then rotated in the same direction. When the bevel gear210is rotated at a relatively faster angular speed than the angular speed of the wheel body20, the drive bevel gears233located on the drive shafts230located at the same height in the first direction are rotated in a direction away from each other. The sub-wheel units100are then rotated in the counterclockwise direction of the drawing.", "", "Conversely, the top of the wheel body20may be rotated in the incoming direction with respect to the plane of the drawing. When the angular speed of the bevel gear210is faster than the angular speed of the wheel body20, the drive shafts230located to correspond to the opposite sides of the bevel gear210are rotated in a direction approaching each other. The sub-wheel units100are then rotationally driven in the clockwise direction of the drawing.", "", "In other words, based on the mathematical formulae or equations shown below, when the angular speed of the bevel gear210driven by the second motor220is faster than the angular speed of the wheel body20rotated by the first motor30, the sub-wheel units100are configured to have a negative speed in the second direction. As such, the sub-wheel units100are rotated in the negative direction of Vy. Additionally, when the angular speed of the bevel gear210is slower than the angular speed of the wheel body20, the sub-wheel units100are configured to have a positive speed in the second direction. As such, the sub-wheel units100are configured to have a movement speed in the positive direction of Vy.", "", "According to an embodiment of the present disclosure, in the case of movement speed in the first direction, calculation is performed based on the angular speed of the wheel body20. Also, Vx is calculated as follows through a distance R from the central axis of the knuckle10to the end of the sub-wheels110and the angular speed W1 of the wheel body20.", "", "The first directional movement speed is calculated according to a mathematical formula or equation shown below:", "", "Vx=R×W⁢1", "", "In addition, the second directional speed of the sub-wheels110is calculated in consideration of the rotation amount of the drive shafts230based on the rotational angular speed of the wheel body20. In other words, the second directional speed is calculated by multiplying a gear ratio N at the opposite ends of the drive shafts230(where n1 is a gear ratio of the bevel gear to the drive bevel gear and n2 is a gear ratio of the sub-wheel worm gear to the drive worm gear) and r (the radius of the sub-wheel110) by a difference between the angular speed W1 of the wheel body20and the angular speed W2 of the bevel gear210.", "", "The second directional movement speed is calculated according to a mathematical formula or equation shown below:", "", "Vy=n⁢1×n⁢2×r×W⁢1-n⁢1×n⁢2×r×W⁢2", "", "In other words, the second directional speed is calculated based on the difference between the angular speed of the wheel body20and the angular speed of the bevel gear210by the bevel gear210integrally rotated with the wheel body20.", "", "Here, when the difference between the angular speed of the wheel body20and the angular speed of the bevel gear210is 0 in the state in which an absolute value of the angular speed of the wheel body20is greater than 0, the drive device is moved in the first forward-and-rearward direction. In addition, when an absolute value of the angular speed of the bevel gear210is greater than 0 in the state in which the angular speed of the wheel body20is 0, the drive device is moved in the second forward-and-rearward direction.", "", "Meanwhile, when the difference between the angular speed of the wheel body20and the angular speed of the bevel gear210is greater than 0 in the state in which the angular speed of the wheel body20is greater than 0, the drive device is moved in a direction having positive values of the first direction and the second direction. When the difference between the angular speed of the wheel body20and the angular speed of the bevel gear210is less than 0 in the state in which the angular speed of the wheel body20is greater than 0, the drive device is moved in a direction having a positive value in the first direction and a negative value in the second direction.", "", "Furthermore, when the difference between the angular speed of the wheel body20and the angular speed of the bevel gear210is greater than 0 in the state in which the angular speed of the wheel body20is less than 0, the drive device is moved in a direction having a negative value in the first direction and a positive value in the second direction.", "", "In other words, omnidirectional movement of the wheel in the first direction and/or the second direction is performable through control of the angular speed of the wheel body20and the angular speed of the bevel gear210.", "", "Additionally, when the difference between the angular speed of the wheel body20and the angular speed of the bevel gear210is less than 0 in the state in which the angular speed of the wheel body20is less than 0, the drive device is moved in a direction having a negative value in the first direction and a negative value in the second direction.", "", "Here, the front in each of the first and second directions is expressed as a positive value, and the rear in each of the first and second directions is expressed as a negative value, but the direction is not limited thereto.", "", "Further, as shown inFIGS.4A and4B, the drive radius of the rotation drive device may vary depending on the application of the first motor30and the second motor220of the present disclosure.", "", "FIG.4Ashows an area in which the drive device is movable in the first direction and the second direction according to the embodiment of the present disclosure. As an example, the first motor30may be formed as a hollow type, an outer type, and a large diameter type, and the same is configured in a low RPM type and a high torque (in-wheel drive) type. In addition, the second motor220may be formed of a hollow and outer type motor so as to enable a brake to be mounted therein. Further, a motor capable of being driven at a relatively high RPM compared to the first motor30may be applied to the second motor220.", "", "In other words, W2 may be configured to have a relatively high RPM compared to W1, and the speed of W2 may be relatively large in the state in which the speed of Vx is constant. Therefore, as shown inFIG.4A, in an embodiment of the present disclosure, the movement speed is configured so that the maximum speed in the first and second directions has a relatively wide area.", "", "In comparison,FIG.4Bshows the movement direction of the drive device in a case where motors having the same drive RPM are respectively applied to the first motor30and the second motor220.", "", "As shown inFIG.4B, W2 has the same maximum RPM as that of W1. Thus, the angular speed of W1 decreases and the speed of W2 is maintained. Accordingly, as shown inFIG.4B, the movement speed is configured to have a relatively small area compared toFIG.4A.", "", "In other words, according to another embodiment of the present disclosure, when the first motor30and the second motor220are the same, control is performed such that the first motor30is decelerated in response to the diagonal movement of the drive device and the drive device is moved in the second direction.", "", "As is apparent from the above description, the present disclosure may achieve the following effects by combining the embodiments with the above-described configuration, combination, and use relationship.", "", "The present disclosure has an effect of providing an omnidirectional rotation drive device with a bevel gear coupled to the inside of a wheel body and a drive unit disposed so as to have a predetermined angle with the bevel gear and configured to apply drive force to sub-wheel units formed in two rows.", "", "In addition, the present disclosure has an effect of freely and selectively setting the drive direction of a vehicle through the omnidirectional rotation drive device having an omni-wheel structure capable of being driven in the first direction and/or the second direction.", "", "Furthermore, the present disclosure provides drive conditions for the sub-wheel units using the bevel gear, thereby having an effect of compactly designing the size of the drive device.", "", "The technical concepts of the present disclosure have been described in detail with reference to various embodiments thereof. However, the present disclosure may be used in various other combinations, modifications, and environments. Thus, it should be appreciated by those having ordinary skill in the art that changes may be made in these embodiments without departing from the principles and spirit of the disclosure, the scope of which is defined in the appended claims and equivalents thereto. The embodiments describe examples to implement the technical idea of the present disclosure, and various changes required in specific application fields and uses of the present disclosure are also possible. Accordingly, the detailed description of the present disclosure is not intended to limit the present disclosure to the disclosed embodiments. Additionally, the scope of the appended claims should be construed as including other embodiments as well.", "", "Reference numerals set forth in the drawings include reference to the following elements as further discussed above:", "", "10: Knuckle20: Wheel body21: Central portion22: Bridge part23: Wheel drive shaft bearing30: First motor100: Sub-wheel unit110: Sub-wheel120: Sub-wheel worm gear200: Drive unit210: Bevel gear220: Second motor230: Drive shaft231: Drive shaft bearing232: Drive worm gear233: Drive bevel gear"], "claims": ["a knuckle connected to a vehicle body; a wheel body configured to rotate around the knuckle; a plurality of sub-wheel units rotatably supported on the wheel body; and a bevel gear located in the wheel body and configured to rotate around the knuckle, wherein the plurality of sub-wheel units are configured to rotate depending on a difference between an angular speed of the wheel body and an angular speed of the bevel gear.", "2 . The omnidirectional rotation drive device of claim 1 , wherein a central axis of rotation of the plurality of sub-wheel units is perpendicular to a central axis of rotation of the wheel body.", "3 . The omnidirectional rotation drive device of claim 1 , further comprising a plurality of drive shafts rotatably supported on the wheel body and configured to connect the bevel gear to the plurality of sub-wheel units.", "4 . The omnidirectional rotation drive device of claim 3 , wherein each of the plurality of drive shafts has one end meshed with a corresponding one of opposite side surfaces of the bevel gear, and wherein each of the plurality of drive shafts has another end meshed with a corresponding one of the plurality of sub-wheel units formed in two rows on the opposite side surfaces of the bevel gear.", "5 . The omnidirectional rotation drive device of claim 3 , wherein each of the plurality of drive shafts has one end formed of a drive bevel gear meshed with the bevel gear, and wherein each of the plurality of drive shafts has another end formed of a drive worm gear meshed with a sub-wheel worm gear of each of the plurality of sub-wheel units.", "the wheel body is configured to rotate in a first direction; the plurality of sub-wheel units is configured to rotate in a second direction; a speed of the first direction is calculated by as Vx=R×W1; and a speed of the second direction is calculated as Vy=n1×n2×r×W1−n1×n2×r×W2, wherein, W1 is an angular speed of the wheel body, R is a radius from a central axis of the wheel body to the sub-wheel unit, W2 is an angular speed of the bevel gear, n1 is a gear ratio of the bevel gear to the drive bevel gear, and n2 is a gear ratio of the sub-wheel worm gear to the drive worm gear.", "a central portion surrounding the knuckle; and a bridge part formed to extend outward from the central portion, wherein the bridge part has the sub-wheel units formed in two rows and located therein.", "a first motor configured to rotatably drive the wheel body; and a second motor configured to rotatably drive the bevel gear.", "only the wheel body is rotatably driven when the first motor and the second motor rotate at the same angular speed; the wheel body and the plurality of sub-wheel units are simultaneously rotatably driven when the first motor rotates and the second motor stops; and only the plurality of sub-wheel units are rotatably driven when the first motor stops and the second motor rotates.", "a knuckle connected to a vehicle body; a wheel body configured to rotate around the knuckle; a plurality of sub-wheel units rotatably supported on the wheel body; a bevel gear located in the wheel body and configured to rotate around the knuckle; and a plurality of drive shafts rotatably supported on the wheel body and configured to connect the bevel gear to the plurality of sub-wheel units, wherein the plurality of drive shafts is configured and arranged not to be parallel to the bevel gear.", "11 . The omnidirectional rotation drive device of claim 10 , wherein a central axis of rotation of the plurality of sub-wheel units is perpendicular to a central axis of rotation of the wheel body.", "a first motor configured to rotatably drive the wheel body; and a second motor configured to rotatably drive the bevel gear.", "13 . The omnidirectional rotation drive device of claim 10 , wherein each of the plurality of drive shafts has one end meshed with a corresponding one of opposite side surfaces of the bevel gear, and wherein each of the plurality of drive shafts has another end meshed with a corresponding one of the plurality of sub-wheel units formed in two rows on the opposite side surfaces of the bevel gear.", "14 . The omnidirectional rotation drive device of claim 10 , wherein each of the plurality of drive shafts has one end formed of a drive bevel gear meshed with the bevel gear, and wherein each of the plurality of drive shafts has another end formed of a drive worm gear meshed with a sub-wheel worm gear of each of the plurality of sub-wheel units.", "the wheel body rotates in a first direction; each of the plurality of sub-wheel units rotates in a second direction; a speed of the first direction is calculated as Vx=R×W1; and a speed of the second direction is calculated as Vy=n1×n2×r×W1−n1×n2×r×W2, wherein W1 is an angular speed of the wheel body, R is a radius from a central axis of the wheel body to the sub-wheel unit, W2 is an angular speed of the bevel gear, n1 is a gear ratio of the bevel gear to the drive bevel gear, and n2 is a gear ratio of the sub-wheel worm gear to the drive worm gear.", "a central portion surrounding the knuckle; and a bridge part formed to extend outward from the central portion, wherein the bridge part has the sub-wheel units formed in two rows and located therein.", "17 . The omnidirectional rotation drive device of claim 10 , wherein the plurality of sub-wheel units is rotated depending on a difference between an angular speed of the wheel body and an angular speed of the bevel gear."], "bibtex": "@patent{20250074109,\n    title = {OMNIDIRECTIONAL ROTATION DRIVE DEVICE},\n    number = {20250074109},\n    year = {2025},\n    note = {File: US20250074109A1-20250306.XML}\n    }", "classification": "B60B1912FI"}, {"title": "BICYCLE HUB SYSTEM, METHOD AND DEVICE INCLUDING AN INTERCHANGEABLE HUB LOCKING MECHANISM", "doc_number": "20250074110", "filename": "US20250074110A1-20250306.XML", "abstract": "A bicycle hub system, method and device including rear and front hub assemblies. Both the rear and front hub assemblies include locking mechanisms with matching undulating splined coupling faces that correspond to complementary undulating splined coupling faces of a wheel hub.", "detailed_description": ["Embodiments of the application are directed to a bicycle hub system, method and device including rear and front hub assemblies, wherein both the rear and front hub assemblies include locking mechanisms with matching undulating splined coupling faces that correspond to complementary undulating splined coupling faces of a wheel hub. As a result, the wheel hub is able to be easily coupled/decoupled from either the front locking mechanism or the rear locking mechanism as desired. Indeed, when the wheel is changed, the drive and/or brake components of the hub assemblies stay in the frame, thus removing the need for careful disengaging or lining up movements to be made by a person. The drive also does not need to be geared down or up and thus stays in the gear the cyclist was in. This reduces the wheel change time immensely.", "", "Reference will now be made in detail to implementations of a bicycle hub system, method and device including a hub locking mechanism, such as illustrated in the accompanying drawings. The same reference indicators will be used throughout the drawings and the following detailed description to refer to the same or like parts. In the interest of clarity, not all of the routine features of the implementations described herein are shown and described. It will be appreciated that in the development of any such actual implementation, numerous implementation-specific decisions can be made in order to achieve the developer's specific goals, such as compliance with application and business related constraints, and that these specific goals will vary from one implementation to another and from one developer to another. Moreover, it will be appreciated that such a development effort might be complex and time-consuming, but would nevertheless be a routine undertaking of engineering for those of ordinary skill in the art having the benefit of this disclosure. Additionally, for the sake of clarity within the Figures, threaded portions of the components shown in the Figures are indicated by grey portions.", "", "FIGS.1A-1Fillustrate a bicycle hub system100according to some embodiments. As shown inFIGS.1A-1F, the bicycle hub system100comprises a bicycle frame (or frameset)102having front fork ends104coupled to a front hub assembly106and rear fork ends (or drop out)108coupled to a rear hub assembly110. The front hub assembly106is able to comprise a front hub locking mechanism112detachably coupled to a front wheel/hub114and the rear hub assembly110is able to comprise a rear hub locking mechanism116detachably coupled to a rear wheel/hub118. The bicycle hub system100is able to comprise one or more additional components of the bicycle that are well known in the art (e.g. seat, drive mechanism, brake mechanism, handle bars) and not described in detail herein for the sake of brevity."], "claims": ["a bicycle frame including rear fork ends; and a rear hub assembly including: a rear locking mechanism coupled to the rear fork ends, wherein the rear locking mechanism has a pair of rear faces that each include waved locking splines, wherein a shape of the rear waved locking splines is the same for both of the pair of rear faces; and a wheel hub including a pair of flanges, wherein each of the flanges includes an outer flange face having waved hub splines that complement the rear waved locking splines; wherein the wheel hub is able to be removably coupled between the pair of rear faces by compressing the rear waved locking splines against the waved hub splines.", "a front locking mechanism coupled to front fork ends of the bicycle frame, wherein the front locking mechanism has a pair of front faces that each include front waved locking splines.", "3 . The bicycle system of claim 2 , wherein the waved hub splines of the wheel hub complement both the front waved locking splines and the rear waved locking splines.", "4 . The bicycle system of claim 3 , wherein the wheel hub is able to be removably coupled between the pair of front faces by compressing the front waved locking splines against the waved hub splines.", "5 . The bicycle system of claim 2 , wherein the front waved locking splines protrude out from the pair of rear faces and the waved hub splines of the wheel hub are recessed into the outer flange faces.", "6 . The bicycle system of claim 2 , wherein the front waved locking splines are non-perpendicular to a central axis of central rear axle apertures of the rear faces such that the front waved locking splines taper from an inside end proximate the central rear axle apertures to an outside end distal from the central rear axle apertures.", "7 . The bicycle system of claim 6 , wherein a thickness of the front waved locking splines increases in a direction of a center of the central rear axle apertures from the outside end to the inside end.", "8 . The bicycle system of claim 7 , wherein a thickness of the waved hub splines increases in a direction of a center of central flange apertures of the flanges from an outer end distal from the central flange apertures to an inner end proximate the central flange apertures.", "9 . The bicycle system of claim 1 , wherein the flanges each include a plurality of spoke faces having spoke apertures for coupling with spokes of a wheel.", "10 . The bicycle system of claim 9 , wherein a portion of the spoke faces are perpendicular to a central axis of the wheel hub and a remainder of the spoke faces are non-perpendicular to the central axis.", "a rear locking mechanism, wherein the rear locking mechanism has a pair of rear faces that each include rear waved locking splines, wherein a shape of the rear waved locking splines is the same for both of the pair of rear faces; and a wheel hub including a pair of flanges, wherein each of the flanges includes an outer flange face having waved hub splines that complement the rear waved locking splines; wherein the wheel hub is able to be removably coupled between the pair of rear faces by compressing the rear waved locking splines against the waved hub splines.", "a front locking mechanism, wherein the front locking mechanism has a pair of front faces that each include front waved locking splines.", "13 . The hub assembly of claim 12 , wherein the waved hub splines of the wheel hub complement both the front waved locking splines and the rear waved locking splines.", "14 . The hub assembly of claim 13 , wherein the wheel hub is able to be removably coupled between the pair of front faces by compressing the front waved locking splines against the waved hub splines.", "15 . The hub assembly of claim 12 , wherein the front waved locking splines protrude out from the pair of rear faces and the waved hub splines of the wheel hub are recessed into the outer flange faces.", "16 . The hub assembly of claim 12 , wherein the front waved locking splines are non-perpendicular to a central axis of central rear axle apertures of the rear faces such that the front waved locking splines taper from an inside end proximate the central rear axle apertures to an outside end distal from the central rear axle apertures.", "17 . The hub assembly of claim 16 , wherein a thickness of the front waved locking splines increases in a direction of a center of the central rear axle apertures from the outside end to the inside end.", "18 . The hub assembly of claim 17 , wherein a thickness of the waved hub splines increases in a direction of a center of central flange apertures of the flanges from an outer end distal from the central flange apertures to an inner end proximate the central flange apertures.", "19 . The hub assembly of claim 11 , wherein the flanges each include a plurality of spoke faces having spoke apertures for coupling with spokes of a wheel.", "20 . The hub assembly of claim 19 , wherein a portion of the spoke faces are perpendicular to a central axis of the wheel hub and a remainder of the spoke faces are non-perpendicular to the central axis.", "positioning a wheel hub between a pair of rear faces of a rear locking mechanism, the rear faces each including rear waved locking splines, wherein a shape of the rear waved locking splines is the same for both of the pair of rear faces; and coupling the wheel hub to the rear locking mechanism by compressing the rear waved locking splines against waved hub splines of the outer flange faces, wherein the waved hub splines complement the rear waved locking splines.", "22 . The method of claim 21 , further comprising decoupling the wheel hub from the rear locking mechanism by removing the wheel hub from between the pair of rear faces.", "positioning the wheel hub between a pair of front faces of a front locking mechanism, the front faces each including front waved locking splines; and coupling the wheel hub to the front locking mechanism by compressing the front waved locking splines against the waved hub splines, wherein the waved hub splines complement both the rear waved locking splines and the front waved locking splines.", "24 . The method of claim 23 , wherein the front waved locking splines protrude out from the pair of rear faces and the waved hub splines of the wheel hub are recessed into the outer flange faces.", "25 . The method of claim 23 , wherein the front waved locking splines are non-perpendicular to a central axis of central rear axle apertures of the rear faces such that the front waved locking splines taper from an inside end proximate the central rear axle apertures to an outside end distal from the central rear axle apertures.", "26 . The method of claim 25 , wherein a thickness of the front waved locking splines increases in a direction of a center of the central rear axle apertures from the outside end to the inside end.", "27 . The method of claim 26 , wherein a thickness of the waved hub splines increases in a direction of a center of central flange apertures of the flanges from an outer end distal from the central flange apertures to an inner end proximate the central flange apertures.", "28 . The method of claim 21 , wherein the flanges each include a plurality of spoke faces having spoke apertures for coupling with spokes of a wheel.", "29 . The method of claim 28 , wherein a portion of the spoke faces are perpendicular to a central axis of the wheel hub and a remainder of the spoke faces are non-perpendicular to the central axis."], "bibtex": "@patent{20250074110,\n    title = {BICYCLE HUB SYSTEM, METHOD AND DEVICE INCLUDING AN INTERCHANGEABLE HUB LOCKING MECHANISM},\n    number = {20250074110},\n    year = {2025},\n    note = {File: US20250074110A1-20250306.XML}\n    }", "classification": "B60B2702FI"}, {"title": "BICYCLE HUB SYSTEM, METHOD AND DEVICE INCLUDING A REAR HUB LOCKING MECHANISM", "doc_number": "20250074111", "filename": "US20250074111A1-20250306.XML", "abstract": "A bicycle hub system, method and device including rear and front hub assemblies. Both the rear and front hub assemblies include locking mechanisms with matching undulating splined coupling faces that correspond to complementary undulating splined coupling faces of a wheel hub.", "detailed_description": ["Embodiments of the application are directed to a bicycle hub system, method and device including rear and front hub assemblies, wherein both the rear and front hub assemblies include locking mechanisms with matching undulating splined coupling faces that correspond to complementary undulating splined coupling faces of a wheel hub. As a result, the wheel hub is able to be easily coupled/decoupled from either the front locking mechanism or the rear locking mechanism as desired. Indeed, when the wheel is changed, the drive and/or brake components of the hub assemblies stay in the frame, thus removing the need for careful disengaging or lining up movements to be made by a person. The drive also does not need to be geared down or up and thus stays in the gear the cyclist was in. This reduces the wheel change time immensely.", "", "Reference will now be made in detail to implementations of a bicycle hub system, method and device including a hub locking mechanism, such as illustrated in the accompanying drawings. The same reference indicators will be used throughout the drawings and the following detailed description to refer to the same or like parts. In the interest of clarity, not all of the routine features of the implementations described herein are shown and described. It will be appreciated that in the development of any such actual implementation, numerous implementation-specific decisions can be made in order to achieve the developer's specific goals, such as compliance with application and business related constraints, and that these specific goals will vary from one implementation to another and from one developer to another. Moreover, it will be appreciated that such a development effort might be complex and time-consuming, but would nevertheless be a routine undertaking of engineering for those of ordinary skill in the art having the benefit of this disclosure. Additionally, for the sake of clarity within the Figures, threaded portions of the components shown in the Figures are indicated by a cross-hatch pattern.", "", "FIGS.1A-1Fillustrate a bicycle hub system100according to some embodiments. As shown inFIGS.1A-1F, the bicycle hub system100comprises a bicycle frame (or frameset)102having front fork ends104coupled to a front hub assembly106and rear fork ends (or drop out)108coupled to a rear hub assembly110. The front hub assembly106is able to comprise a front hub locking mechanism112detachably coupled to a front wheel/hub114and the rear hub assembly110is able to comprise a rear hub locking mechanism116detachably coupled to a rear wheel/hub118. The bicycle hub system100is able to comprise one or more additional components of the bicycle that are well known in the art (e.g. seat, drive mechanism, brake mechanism, handle bars) and not described in detail herein for the sake of brevity."], "claims": ["a rear locking mechanism including a wave face axle and a rotor mount housing, the wave face axle having a hollow shaft coupled to a splined head face and the rotor mount housing having a splined housing face, wherein the splined housing face faces the splined head face; a rear hub positioned between the splined housing face and the splined head face; and a through axle positioned through the hollow shaft of the wave face axle and a central channel of the rear hub and detachably coupled within a central aperture of the rotor mount housing; wherein when the locking mechanism is coupled to the hub, the wave face axle, the rear hub and the through axle are all able to rotate together.", "2 . The bicycle rear hub system of claim 1 , wherein when positioned through the hollow shaft, the through axle has a protruding lip that abuts an inner ledge of the hollow shaft of the wave face axle.", "3 . The bicycle rear hub system of claim 1 , further comprising one or more wave face axle bearings positioned around the hollow shaft of the wave face axle and within a non-rotor housing surrounding a perimeter of the wave face axle proximate the splined head face.", "4 . The bicycle rear hub system of claim 3 , wherein rotation of the non-rotor housing in a first direction causes the wave face axle and the hub to correspondingly rotate in the first direction such that the wave face axle bearings do not rotate with respect to the wave face axle.", "5 . The bicycle rear hub system of claim 4 , wherein an outer surface of the hollow shaft of the wave face axle has a plurality of axle splines for receiving rotational force from the non-rotor housing caused by rotation of the non-rotor housing in the first direction.", "6 . The bicycle rear hub system of claim 3 , wherein an exterior surface of the non-rotor housing has a plurality of housing splines for coupling a gear cassette around the non-rotor housing.", "7 . The bicycle rear hub system of claim 1 , further comprising a hanger bearing and a hanger housing, the hanger housing having an inner chamber and an exterior coupling mechanism for detachably coupling with a derailleur, wherein the hanger bearing is positioned within the inner chamber around the hollow shaft of the wave face axle.", "8 . The bicycle rear hub system of claim 7 , wherein the exterior coupling mechanism comprises a detachable hanger that is able to selectively detach from the hanger housing.", "9 . The bicycle rear hub system of claim 3 , wherein an exterior surface of the non-rotor housing has a plurality of housing splines, further comprising a gearbox interface gear having a central aperture and a plurality of interface gear splines along the perimeter of the central aperture, wherein the gearbox interface gear is removably positioned around the non-rotor housing such that the housing splines slide between the interface gear splines.", "10 . The bicycle rear hub system of claim 9 , further comprising a gearbox housing lock ring threadably coupled to a threaded portion of the exterior surface of the non-rotor housing such that the gearbox housing lock ring blocks the interface gear splines from sliding out from between the housing splines.", "a wave face axle having a splined head face; a rotor side bearing axle; a rotor mount bearing; and a rotor mount housing having a central aperture, a splined housing face and a rotor mount inner cavity, wherein an end of the rotor side bearing axle faces towards the central aperture within the rotor mount inner cavity and the rotor mount bearing is positioned around a perimeter of the end of the rotor side bearing axle within the rotor mount inner cavity and the splined housing face faces the splined head face.", "12 . The rear hub locking mechanism of claim 11 , wherein the wave face axle has a hollow shaft including an inner ledge that narrows a circumference of the hollow shaft.", "13 . The rear hub locking mechanism of claim 11 , further comprising one or more wave face axle bearings positioned around a hollow shaft of the wave face axle and within a non-rotor housing surrounding a perimeter of the wave face axle proximate the splined head face.", "14 . The rear hub locking mechanism of claim 13 , wherein rotation of the non-rotor housing in a first direction causes the wave face axle to correspondingly rotate in the first direction such that the wave face axle bearings do not rotate with respect to the wave face axle.", "15 . The rear hub locking mechanism of claim 14 , wherein an outer surface of the hollow shaft of the wave face axle has a plurality of axle splines for receiving rotational force from the non-rotor housing caused by rotation of the non-rotor housing in the first direction.", "16 . The rear hub locking mechanism of claim 13 , wherein an exterior surface of the non-rotor housing has a plurality of housing splines for coupling a gear cassette around the non-rotor housing.", "17 . The rear hub locking mechanism of claim 11 , further comprising a hanger bearing and a hanger housing, the hanger housing having an inner chamber and an exterior coupling mechanism for detachably coupling with a derailleur, wherein the hanger bearing is positioned within the inner chamber around a hollow shaft of the wave face axle.", "18 . The rear hub locking mechanism of claim 17 , wherein the exterior coupling mechanism comprises a detachable hanger that is able to selectively detach from the hanger housing.", "19 . The rear hub locking mechanism of claim 13 , wherein an exterior surface of the non-rotor housing has a plurality of housing splines, further comprising a gearbox interface gear having a central gear aperture and a plurality of interface gear splines along the perimeter of the central gear aperture, wherein the gearbox interface gear is removably positioned around the non-rotor housing such that the housing splines slide between the interface gear splines.", "20 . The rear hub locking mechanism of claim 19 , further comprising a gearbox housing lock ring threadably coupled to a threaded portion of the exterior surface of the non-rotor housing such that the gearbox housing lock ring blocks the interface gear splines from sliding out from between the housing splines.", "providing a rear locking mechanism including a wave face axle and a rotor mount housing, the wave face axle having a hollow shaft coupled to a splined head face and the rotor mount housing having a splined housing face, wherein the splined housing face faces the splined head face; positioning a rear hub between the splined housing face and the splined head face; and positioning a through axle through the hollow shaft of the wave face axle and a central channel of the rear hub and detachably coupled within a central aperture of the rotor mount housing; wherein when the locking mechanism is coupled to the hub, the wave face axle, the rear hub and the through axle are all able to rotate together.", "22 . The method of claim 21 , wherein when positioned through the hollow shaft, the through axle has a protruding lip that abuts an inner ledge of the hollow shaft of the wave face axle.", "23 . The method of claim 21 , wherein the rear locking mechanism further comprises one or more wave face axle bearings positioned around the hollow shaft of the wave face axle and within a non-rotor housing surrounding a perimeter of the wave face axle proximate the splined head face.", "24 . The method of claim 23 , wherein rotation of the non-rotor housing in a first direction causes the wave face axle and the hub to correspondingly rotate in the first direction such that the wave face axle bearings do not rotate with respect to the wave face axle.", "25 . The method of claim 24 , wherein an outer surface of the hollow shaft of the wave face axle has a plurality of axle splines for receiving rotational force from the non-rotor housing caused by rotation of the non-rotor housing in the first direction.", "26 . The method of claim 23 , wherein an exterior surface of the non-rotor housing has a plurality of housing splines for coupling a gear cassette around the non-rotor housing.", "27 . The method of claim 21 , wherein the rear locking mechanism further comprises a hanger bearing and a hanger housing, the hanger housing having an inner chamber and an exterior coupling mechanism for detachably coupling with a derailleur, wherein the hanger bearing is positioned within the inner chamber around the hollow shaft of the wave face axle.", "28 . The method of claim 27 , wherein the exterior coupling mechanism comprises a detachable hanger that is able to selectively detach from the hanger housing.", "29 . The method of claim 23 , wherein an exterior surface of the non-rotor housing has a plurality of housing splines and the locking mechanism further comprises a gearbox interface gear having a central aperture and a plurality of interface gear splines along the perimeter of the central aperture, further comprising removably positioning the gearbox interface gear around the non-rotor housing such that the housing splines slide between the interface gear splines.", "30 . The method of claim 29 , further comprising threadably coupling a gearbox housing lock ring to a threaded portion of the exterior surface of the non-rotor housing such that the gearbox housing lock ring blocks the interface gear splines from sliding out from between the housing splines."], "bibtex": "@patent{20250074111,\n    title = {BICYCLE HUB SYSTEM, METHOD AND DEVICE INCLUDING A REAR HUB LOCKING MECHANISM},\n    number = {20250074111},\n    year = {2025},\n    note = {File: US20250074111A1-20250306.XML}\n    }", "classification": "B60B2702FI"}, {"title": "BICYCLE HUB SYSTEM, METHOD AND DEVICE INCLUDING A FRONT HUB LOCKING MECHANISM", "doc_number": "20250074112", "filename": "US20250074112A1-20250306.XML", "abstract": "A bicycle hub system, method and device including rear and front hub assemblies. Both the rear and front hub assemblies include locking mechanisms with matching undulating splined coupling faces that correspond to complementary undulating splined coupling faces of a wheel hub.", "detailed_description": ["Embodiments of the application are directed to a bicycle hub system, method and device including rear and front hub assemblies, wherein both the rear and front hub assemblies include locking mechanisms with matching undulating splined coupling faces that correspond to complementary undulating splined coupling faces of a wheel hub. As a result, the wheel hub is able to be easily coupled/decoupled from either the front locking mechanism or the rear locking mechanism as desired. Indeed, when the wheel is changed, the drive and/or brake components of the hub assemblies stay in the frame, thus removing the need for careful disengaging or lining up movements to be made by a person. The drive also does not need to be geared down or up and thus stays in the gear the cyclist was in. This reduces the wheel change time immensely.", "", "Reference will now be made in detail to implementations of a bicycle hub system, method and device including a hub locking mechanism, such as illustrated in the accompanying drawings. The same reference indicators will be used throughout the drawings and the following detailed description to refer to the same or like parts. In the interest of clarity, not all of the routine features of the implementations described herein are shown and described. It will be appreciated that in the development of any such actual implementation, numerous implementation-specific decisions can be made in order to achieve the developer's specific goals, such as compliance with application and business related constraints, and that these specific goals will vary from one implementation to another and from one developer to another. Moreover, it will be appreciated that such a development effort might be complex and time-consuming, but would nevertheless be a routine undertaking of engineering for those of ordinary skill in the art having the benefit of this disclosure. Additionally, for the sake of clarity within the Figures, threaded portions of the components shown in the Figures are indicated by a cross-hatch pattern.", "", "FIGS.1A-1Fillustrate a bicycle hub system100according to some embodiments. As shown inFIGS.1A-1F, the bicycle hub system100comprises a bicycle frame (or frameset)102having front fork ends104coupled to a front hub assembly106and rear fork ends (or drop out)108coupled to a rear hub assembly110. The front hub assembly106is able to comprise a front hub locking mechanism112detachably coupled to a front wheel/hub114and the rear hub assembly110is able to comprise a rear hub locking mechanism116detachably coupled to a rear wheel/hub118. The bicycle hub system100is able to comprise one or more additional components of the bicycle that are well known in the art (e.g. seat, drive mechanism, brake mechanism, handle bars) and not described in detail herein for the sake of brevity."], "claims": ["a front locking mechanism including a non-rotor-side bearing housing, a non-rotor-side bearing, a splined face plate, a rotor mount bearing and a rotor mount housing, the non-rotor-side bearing positioned around a base of the splined face plate and the rotor mount housing having a splined housing face and a rotor mount housing inner cavity, wherein the rotor mount bearing is positioned within the rotor mount housing inner cavity and the splined housing face faces the splined face plate; and a front hub positioned between the splined housing face and the splined face plate; wherein when the front locking mechanism is coupled to the front hub, the splined face plate rotates with the front hub as the front hub rotates.", "2 . The bicycle front hub system of claim 1 , wherein when positioned through the splined housing face, a through axle has a protruding lip that abuts an inner surface of the rotor mount housing inner cavity.", "3 . The bicycle front hub system of claim 1 , further comprising a face plate lock ring threaded onto a stem extending from a base of the splined face plate, wherein the face plate lock ring blocks the non-rotor-side bearing from sliding off the base of the splined face plate.", "4 . The bicycle front hub system of claim 3 , further comprising a non-rotor side bearing housing lock ring coupled to the non-rotor bearing housing thereby holding the non-rotor-side bearing, as coupled with the splined face plate and the splined face plate lock ring, within an inner chamber of the non-rotor-side bearing housing.", "5 . The bicycle front hub system of claim 4 , wherein a splined face of the splined face plate protrudes from a middle aperture of the non-rotor-side bearing housing lock ring toward the splined housing face.", "6 . The bicycle front hub system of claim 1 , wherein the hub comprises a tube coupled between a pair of flanges, wherein each of the flanges includes an outer flange face having a central flange aperture and hub splines.", "7 . The bicycle front hub system of claim 6 , wherein the flanges each include a plurality of spoke faces having spoke apertures for coupling with spokes of a wheel.", "8 . The bicycle front hub system of claim 7 , wherein a portion of the spoke faces are perpendicular to a central axis of the tube and a remainder of the spoke faces are non-perpendicular to the central axis of the tube.", "a splined face plate having a splined surface; a non-rotor-side bearing housing; a non-rotor-side bearing positioned around of the splined face plate; a rotor mount bearing; and a rotor mount housing having a splined housing face and a rotor mount housing inner cavity, wherein the rotor mount bearing is positioned within the rotor mount housing inner cavity and the splined housing face faces the splined surface.", "10 . The front locking mechanism of claim 9 , further comprising a face plate lock ring threaded onto a stem extending from a base of the splined face plate, wherein the face plate lock ring blocks the non-rotor-side bearing from sliding off the base of the splined face plate.", "11 . The front locking mechanism of claim 10 , further comprising a non-rotor side bearing housing lock ring coupled to the non-rotor bearing housing thereby holding the non-rotor-side bearing, as coupled with the splined face plate and the splined face plate lock ring, within an inner chamber of the non-rotor-side bearing housing.", "12 . The front locking mechanism of claim 11 , wherein a splined surface of the splined face plate protrudes from a middle aperture of the non-rotor-side bearing housing lock ring toward the splined housing face.", "a pair of flanges each including a flange end and an outer flange face, the outer flange face having a central flange aperture and a plurality of flange splines; and a hollow tube having a first tube end coupled with the flange end of a first of the flanges and a second tube end coupled with the flange end of a second of the flanges.", "14 . The front hub of claim 13 , wherein the flange splines of each of the flanges are recessed into the outer flange faces.", "15 . The front hub of claim 14 , wherein the flange splines of each of the flanges are non-perpendicular to a central axis of the central flange apertures such that the flange splines taper from an inside end proximate the central flange apertures to an outside end distal from the central flange apertures.", "16 . The front hub of claim 15 , wherein a thickness of the flange splines of each of the flanges decreases in a direction of a center of the central flange apertures from the outside end to the inside end.", "17 . The front hub of claim 13 , wherein the flanges each include a plurality of spoke faces having spoke apertures for coupling with spokes of a wheel.", "18 . The front hub of claim 17 , wherein a portion of the spoke faces are perpendicular to a central axis of the tube and a remainder of the spoke faces are non-perpendicular to the central axis of the tube.", "providing a front locking mechanism including a non-rotor-side bearing housing, a non-rotor-side bearing, a splined face plate, a rotor mount bearing and a rotor mount housing, the non-rotor-side bearing positioned around of the splined face plate and the rotor mount housing having a splined housing face and a rotor mount housing inner cavity, wherein the rotor mount bearing is positioned within the rotor mount housing inner cavity and the splined housing face faces the splined face plate; and coupling a front hub with the front locking mechanism between the splined housing face and the splined face plate; wherein when the front locking mechanism is coupled to the front hub, the splined face plate rotates with the front hub as the front hub rotates.", "20 . The method of claim 19 , wherein when positioned through the splined housing face, a through axle has a protruding lip that abuts an inner surface of the rotor mount housing inner cavity.", "21 . The method of claim 19 , further comprising threading a face plate lock ring onto a stem extending from a base of the splined face plate, wherein the face plate lock ring blocks the non-rotor-side bearing from sliding off the base of the splined face plate.", "22 . The method of claim 21 , further comprising threading a non-rotor side bearing housing lock ring onto the non-rotor bearing housing thereby holding the non-rotor-side bearing, as coupled with the splined face plate and the splined face plate lock ring, within an inner chamber of the non-rotor-side bearing housing.", "23 . The method of claim 22 , wherein a splined face of the splined face plate protrudes from a middle aperture of the non-rotor-side bearing housing lock ring toward the splined housing face.", "24 . The method of claim 19 , wherein the hub comprises a tube coupled between a pair of flanges, wherein each of the flanges includes an outer flange face having a central flange aperture and hub splines.", "25 . The method of claim 24 , wherein the flanges each include a plurality of spoke faces having spoke apertures for coupling with spokes of a wheel.", "26 . The method of claim 25 , wherein a portion of the spoke faces are perpendicular to a central axis of the tube and a remainder of the spoke faces are non-perpendicular to the central axis of the tube."], "bibtex": "@patent{20250074112,\n    title = {BICYCLE HUB SYSTEM, METHOD AND DEVICE INCLUDING A FRONT HUB LOCKING MECHANISM},\n    number = {20250074112},\n    year = {2025},\n    note = {File: US20250074112A1-20250306.XML}\n    }", "classification": "B60B2702FI"}, {"title": "BICYCLE HUB SYSTEM, METHOD AND DEVICE INCLUDING A REAR HUB LOCKING MECHANISM", "doc_number": "20250074113", "filename": "US20250074113A1-20250306.XML", "abstract": "A bicycle hub system, method and device including rear and front hub assemblies. Both the rear and front hub assemblies include locking mechanisms with matching undulating splined coupling faces that correspond to complementary undulating splined coupling faces of a wheel hub.", "detailed_description": ["Embodiments of the application are directed to a bicycle hub system, method and device including rear and front hub assemblies, wherein both the rear and front hub assemblies include locking mechanisms with matching undulating splined coupling faces that correspond to complementary undulating splined coupling faces of a wheel hub. As a result, the wheel hub is able to be easily coupled/decoupled from either the front locking mechanism or the rear locking mechanism as desired. Indeed, when the wheel is changed, the drive and/or brake components of the hub assemblies stay in the frame, thus removing the need for careful disengaging or lining up movements to be made by a person. The drive also does not need to be geared down or up and thus stays in the gear the cyclist was in. This reduces the wheel change time immensely.", "", "Reference will now be made in detail to implementations of a bicycle hub system, method and device including a hub locking mechanism, such as illustrated in the accompanying drawings. The same reference indicators will be used throughout the drawings and the following detailed description to refer to the same or like parts. In the interest of clarity, not all of the routine features of the implementations described herein are shown and described. It will be appreciated that in the development of any such actual implementation, numerous implementation-specific decisions can be made in order to achieve the developer's specific goals, such as compliance with application and business related constraints, and that these specific goals will vary from one implementation to another and from one developer to another. Moreover, it will be appreciated that such a development effort might be complex and time-consuming, but would nevertheless be a routine undertaking of engineering for those of ordinary skill in the art having the benefit of this disclosure. Additionally, for the sake of clarity within the Figures, threaded portions of the components shown in the Figures are indicated by a cross-hatch pattern.", "", "FIGS.1A-1Fillustrate a bicycle hub system100according to some embodiments. As shown inFIGS.1A-1F, the bicycle hub system100comprises a bicycle frame (or frameset)102having front fork ends104coupled to a front hub assembly106and rear fork ends (or drop out)108coupled to a rear hub assembly110. The front hub assembly106is able to comprise a front hub locking mechanism112detachably coupled to a front wheel/hub114and the rear hub assembly110is able to comprise a rear hub locking mechanism116detachably coupled to a rear wheel/hub118. The bicycle hub system100is able to comprise one or more additional components of the bicycle that are well known in the art (e.g. seat, drive mechanism, brake mechanism, handle bars) and not described in detail herein for the sake of brevity."], "claims": ["1 - 30 . (canceled)", "a rear locking mechanism including a derailleur mounting base having a pair of mounting arms, derailleur coupling housing, a derailleur bearing, a wave face axle and a rotor mount housing, the wave face axle having a splined head face, the rotor mount housing having a splined housing face and each of the mounting arms having a mounting aperture, wherein the derailleur coupling housing is positioned at least partially through both of the mounting apertures and the derailleur bearing is positioned within the derailleur coupling housing; and a rear hub positioned between the splined housing face and the splined head face.", "32 . The bicycle rear hub system of claim 31 , wherein one of the mounting arms of the derailleur mounting base has a housing slot that extends from the mounting aperture along a length of the one of the mounting arms.", "33 . The bicycle rear hub system of claim 32 , wherein the derailleur coupling housing has a first end with a first opening surrounded by a first rim and a second end with a second opening opposite the first opening surrounded by a second rim, the first rim being larger than the second rim and having a protruding lip that protrudes out from the first rim away from the first opening.", "34 . The bicycle rear hub system of claim 33 , wherein when the derailleur coupling housing is positioned at least partially through both the of the mounting apertures, the protruding lip is positioned within the housing slot such that the housing slot prevents the derailleur coupling housing from rotating within the mounting apertures.", "35 . The bicycle rear hub system of claim 34 , further comprising a tension setter having a ridged top surface and positioned between an exterior surface of the derailleur coupling housing and a ramp of one of the mounting arms, wherein a ridged portion of the exterior surface of the derailleur coupling housing intermittently interlocks with the ridged top surface as the tension setter is slid along the exterior surface.", "36 . The bicycle rear hub system of claim 31 , wherein when positioned through a hollow shaft of the wave face axle, a through axle has a protruding ledge that abuts an inner ledge of the hollow shaft of the wave face axle.", "37 . The bicycle rear hub system of claim 31 , further comprising one or more wave face axle bearings positioned around a hollow shaft of the wave face axle and within a non-rotor housing surrounding a perimeter of the wave face axle proximate the splined head face.", "38 . The bicycle rear hub system of claim 37 , wherein rotation of the non-rotor housing in a first direction causes the wave face axle and the hub to correspondingly rotate in the first direction such that the wave face axle bearings do not rotate with respect to the wave face axle.", "39 . The bicycle rear hub system of claim 38 , wherein an outside surface of the hollow shaft of the wave face axle has a plurality of axle splines for receiving rotational force from the non-rotor housing caused by rotation of the non-rotor housing in the first direction.", "40 . The bicycle rear hub system of claim 37 , wherein an exterior surface of the non-rotor housing has a plurality of housing splines for coupling a gear cassette around the non-rotor housing.", "a derailleur mounting base having a pair of mounting arms, the mounting arms each including a mounting aperture; a derailleur coupling housing positioned at least partially through both of the mounting apertures; a derailleur bearing; and a wave face axle having a splined head face, wherein the derailleur bearing is positioned within the derailleur coupling housing.", "42 . The rear hub locking mechanism of claim 41 , wherein one of the mounting arms of the derailleur mounting base has a housing slot that extends from the mounting aperture along a length of the one of the mounting arms.", "43 . The rear hub locking mechanism of claim 42 , wherein the derailleur coupling housing has a first end with a first opening surrounded by a first rim and a second end with a second opening opposite the first opening surrounded by a second rim, the first rim being larger than the second rim and having a protruding lip that protrudes out from the first rim away from the first opening.", "44 . The rear hub locking mechanism of claim 43 , wherein when the derailleur coupling housing is positioned at least partially through both the of the mounting apertures, the protruding lip is positioned within the housing slot such that the housing slot prevents the derailleur coupling housing from rotating within the mounting apertures.", "45 . The rear hub locking mechanism of claim 44 , further comprising a tension setter having a ridged top surface and positioned between an exterior surface of the derailleur coupling housing and a ramp of one of the mounting arms, wherein a ridged portion of the exterior surface of the derailleur coupling housing intermittently interlocks with the ridged top surface as the tension setter is slid along the exterior surface.", "46 . The rear hub locking mechanism of claim 41 , further comprising a through axle having a protruding ledge that abuts an inner ledge of a hollow shaft of the wave face axle when positioned through the hollow shaft.", "47 . The rear hub locking mechanism of claim 41 , further comprising one or more wave face axle bearings positioned around a hollow shaft of the wave face axle and within a non-rotor housing surrounding a perimeter of the wave face axle proximate the splined head face.", "48 . The rear hub locking mechanism of claim 47 , wherein rotation of the non-rotor housing in a first direction causes the wave face axle to correspondingly rotate in the first direction such that the wave face axle bearings do not rotate with respect to the wave face axle.", "49 . The rear hub locking mechanism of claim 48 , wherein an outside surface of the hollow shaft of the wave face axle has a plurality of axle splines for receiving rotational force from the non-rotor housing caused by rotation of the non-rotor housing in the first direction.", "50 . The rear hub locking mechanism of claim 47 , wherein an exterior surface of the non-rotor housing has a plurality of housing splines for coupling a gear cassette around the non-rotor housing.", "providing a rear locking mechanism including a derailleur mounting base having a pair of mounting arms, derailleur coupling housing, a derailleur bearing, a wave face axle and a rotor mount housing, the wave face axle having a splined head face, the rotor mount housing having a splined housing face and each of the mounting arms having a mounting aperture, wherein the derailleur bearing is positioned within the derailleur coupling housing; positioning the mounting arms on either side of a rear fork end of a bicycle frame such that the mounting apertures align with a hole in the rear fork end; and sliding the derailleur coupling housing at least partially through the hole and both of the mounting apertures.", "52 . The method of claim 51 , wherein one of the mounting arms of the derailleur mounting base has a housing slot that extends from the mounting aperture along a length of the one of the mounting arms.", "53 . The method of claim 52 , wherein the derailleur coupling housing has a first end with a first opening surrounded by a first rim and a second end with a second opening opposite the first opening surrounded by a second rim, the first rim being larger than the second rim and having a protruding lip that protrudes out from the first rim away from the first opening.", "54 . The method of claim 53 , wherein sliding the derailleur coupling housing at least partially through the hole and both of the mounting apertures comprises positioning the protruding lip within the housing slot such that the housing slot prevents the derailleur coupling housing from rotating within the mounting apertures.", "55 . The method of claim 54 , wherein the rear hub locking mechanism include a tension setter having a ridged top surface, further comprising positioning the tension setter between an exterior surface of the derailleur coupling housing and a ramp of one of the mounting arms and sliding the ridged surface along the exterior surface such that a ridged portion of the exterior surface of the derailleur coupling housing intermittently interlocks with the ridged top surface.", "56 . The method of claim 51 , wherein when positioned through a hollow shaft of the wave face axle, a through axle has a protruding ledge that abuts an inner ledge of the hollow shaft of the wave face axle.", "57 . The method of claim 51 , wherein the rear locking mechanism further comprises one or more wave face axle bearings positioned around a hollow shaft of the wave face axle and within a non-rotor housing surrounding a perimeter of the wave face axle proximate the splined head face.", "58 . The method of claim 57 , wherein rotation of the non-rotor housing in a first direction causes the wave face axle and the hub to correspondingly rotate in the first direction such that the wave face axle bearings do not rotate with respect to the wave face axle.", "59 . The method of claim 58 , wherein an outer surface of the hollow shaft of the wave face axle has a plurality of axle splines for receiving rotational force from the non-rotor housing caused by rotation of the non-rotor housing in the first direction.", "60 . The method of claim 57 , wherein an exterior surface of the non-rotor housing has a plurality of housing splines for coupling a gear cassette around the non-rotor housing."], "bibtex": "@patent{20250074113,\n    title = {BICYCLE HUB SYSTEM, METHOD AND DEVICE INCLUDING A REAR HUB LOCKING MECHANISM},\n    number = {20250074113},\n    year = {2025},\n    note = {File: US20250074113A1-20250306.XML}\n    }", "classification": "B60B2702FI"}, {"title": "BICYCLE HUB SYSTEM, METHOD AND DEVICE INCLUDING A REAR HUB LOCKING MECHANISM", "doc_number": "20250074114", "filename": "US20250074114A1-20250306.XML", "abstract": "A bicycle hub system, method and device including rear and front hub assemblies. Both the rear and front hub assemblies include locking mechanisms with matching undulating splined coupling faces that correspond to complementary undulating splined coupling faces of a wheel hub.", "detailed_description": ["Embodiments of the application are directed to a bicycle hub system, method and device including rear and front hub assemblies, wherein both the rear and front hub assemblies include locking mechanisms with matching undulating splined coupling faces that correspond to complementary undulating splined coupling faces of a wheel hub. As a result, the wheel hub is able to be easily coupled/decoupled from either the front locking mechanism or the rear locking mechanism as desired. Indeed, when the wheel is changed, the drive and/or brake components of the hub assemblies stay in the frame, thus removing the need for careful disengaging or lining up movements to be made by a person. The drive also does not need to be geared down or up and thus stays in the gear the cyclist was in. This reduces the wheel change time immensely.", "", "Reference will now be made in detail to implementations of a bicycle hub system, method and device including a hub locking mechanism, such as illustrated in the accompanying drawings. The same reference indicators will be used throughout the drawings and the following detailed description to refer to the same or like parts. In the interest of clarity, not all of the routine features of the implementations described herein are shown and described. It will be appreciated that in the development of any such actual implementation, numerous implementation-specific decisions can be made in order to achieve the developer's specific goals, such as compliance with application and business related constraints, and that these specific goals will vary from one implementation to another and from one developer to another. Moreover, it will be appreciated that such a development effort might be complex and time-consuming, but would nevertheless be a routine undertaking of engineering for those of ordinary skill in the art having the benefit of this disclosure. Additionally, for the sake of clarity within the Figures, threaded portions of the components shown in the Figures are indicated by a cross-hatch pattern.", "", "FIGS.1A-1Fillustrate a bicycle hub system100according to some embodiments. As shown inFIGS.1A-1F, the bicycle hub system100comprises a bicycle frame (or frameset)102having front fork ends104coupled to a front hub assembly106and rear fork ends (or drop out)108coupled to a rear hub assembly110. The front hub assembly106is able to comprise a front hub locking mechanism112detachably coupled to a front wheel/hub114and the rear hub assembly110is able to comprise a rear hub locking mechanism116detachably coupled to a rear wheel/hub118. The bicycle hub system100is able to comprise one or more additional components of the bicycle that are well known in the art (e.g. seat, drive mechanism, brake mechanism, handle bars) and not described in detail herein for the sake of brevity."], "claims": ["1 - 30 . (canceled)", "a drive mechanism for driving the bicycle; and a ratchet mechanism coupled with the drive mechanism, the rachet mechanism comprising: a ratchet housing having a central axis; a double-sided gear aligned with the central axis within the housing and having a first side, a second side opposite the first side, a first set of ramps and a second set of ramps, wherein the first set of ramps radially taper clockwise about the central axis on the first side of the double-sided gear and the second set of ramps radially taper counter-clockwise about the central axis on the second side of the double-sided gear; a pair of single-sided gears aligned with the central axis and straddling the double-sided gear within the ratchet housing and each having a racheting side and a non-ratcheting side, wherein a first of the single-sided gears has a first set of teeth that radially taper counter-clockwise about the central axis on the racheting side and a second of the single-sided gears has a second set of teeth that radially taper clockwise about the central axis on the racheting side; and a ratchet axle positioned along the central axis through the at least one double-sided gear and the single-sided gears, wherein the axle is coupled with one of the double-sided gear and the pair of single-sided gears and the housing is coupled with another of the double-sided gear and the pair of single-sided gears; wherein the first set of teeth are positioned adjacent to the first set of ramps and the second set of teeth are positioned adjacent to the second set of ramps, and further wherein when rotating in a first direction about the central axis via the drive mechanism, the first set of teeth slide past the first set of ramps and the second set of teeth slide past the second set of ramps such that the ratchet housing is able to rotate independent of the axle, and when rotating a second direction opposite the first direction, the first set of teeth interlock with the first set of ramps and the second set of teeth interlock with the second set of ramps such that the ratchet housing causes the axle to correspondingly rotate in the second direction.", "32 . The bicycle system of claim 31 , wherein the ratchet mechanism further comprises an additional double-sided gear aligned with the central axis within the housing and having an additional first side, an additional second side opposite the additional first side, an additional first set of ramps and an additional second set of ramps, wherein the additional first set of ramps radially taper clockwise about the central axis on the additional first side and the additional second set of ramps radially taper counter-clockwise about the central axis on the additional second side.", "33 . The bicycle system of claim 32 , wherein the additional double-sided gear is positioned within the double-sided gear with the additional first set of ramps radially offset from the first set of ramps and the additional second set of ramps radially offset from the second set of ramps.", "34 . The bicycle system of claim 31 , wherein the axle includes a hollow stem coupled to a base having a radially undulating face that faces away from the stem.", "35 . The bicycle system of claim 34 , wherein the ratchet mechanism further comprises a plurality of bearings positioned within the ratchet housing around the stem of the axle.", "36 . The bicycle system of claim 35 , wherein the rachet housing has a discontinuous rim that protrudes from an inner surface of the housing and blocks one of the bearing from moving away from the base.", "37 . The bicycle system of claim 34 , wherein an outer surface of the hollow stem of the axle includes a plurality axle splines.", "38 . The bicycle system of claim 37 , wherein the pair of single-sided gears each include a set of inner splines that are detachably interlocked with the axle splines such that rotation of the single sided gears causes corresponding rotation of the axle while interlocked.", "39 . The bicycle system of claim 31 , wherein the rachet housing has a set of housing splines that protrude inward from an inner surface of the ratchet housing.", "40 . The bicycle system of claim 39 , wherein the double-sided gear includes a set of outer splines that are detachably interlocked with the housing splines such that rotation of the ratchet housing causes corresponding rotation of the double-sided gear while interlocked.", "a ratchet housing having a central axis; a double-sided gear aligned with the central axis within the housing and having a first side, a second side opposite the first side, a first set of ramps and a second set of ramps, wherein the first set of ramps radially taper clockwise about the central axis on the first side of the double-sided gear and the second set of ramps radially taper counter-clockwise about the central axis on the second side of the double-sided gear; a pair of single-sided gears aligned with the central axis and straddling the double-sided gear within the ratchet housing and each having a racheting side and a non-ratcheting side, wherein a first of the single-sided gears has a first set of teeth that radially taper counter-clockwise about the central axis on the racheting side and a second of the single-sided gears has a second set of teeth that radially taper clockwise about the central axis on the racheting side; and a ratchet axle positioned along the central axis through the at least one double-sided gear and the single-sided gears, wherein the axle is coupled with one of the double-sided gear and the pair of single-sided gears and the housing is coupled with another of the double-sided gear and the pair of single-sided gears; wherein the first set of teeth are positioned adjacent to the first set of ramps and the second set of teeth are positioned adjacent to the second set of ramps, and further wherein when rotating in a first direction about the central axis, the first set of teeth slide past the first set of ramps and the second set of teeth slide past the second set of ramps such that the ratchet housing is able to rotate independent of the axle, and when rotating a second direction opposite the first direction, the first set of teeth interlock with the first set of ramps and the second set of teeth interlock with the second set of ramps such that the ratchet housing causes the axle to correspondingly rotate in the second direction.", "42 . The ratchet mechanism of claim 41 , further comprising an additional double-sided gear aligned with the central axis within the housing and having an additional first side, an additional second side opposite the additional first side, an additional first set of ramps and an additional second set of ramps, wherein the additional first set of ramps radially taper clockwise about the central axis on the additional first side and the additional second set of ramps radially taper counter-clockwise about the central axis on the additional second side.", "43 . The ratchet mechanism of claim 42 , wherein the additional double-sided gear is positioned within the double-sided gear with the additional first set of ramps radially offset from the first set of ramps and the additional second set of ramps radially offset from the second set of ramps.", "44 . The ratchet mechanism of claim 41 , wherein the axle includes a hollow stem coupled to a base having a radially undulating face that faces away from the stem.", "45 . The ratchet mechanism of claim 44 , further comprising a plurality of bearings positioned within the ratchet housing around the stem of the axle.", "46 . The ratchet mechanism of claim 45 , wherein the rachet housing has a discontinuous rim that protrudes from an inner surface of the housing and blocks one of the bearing from moving away from the base.", "47 . The ratchet mechanism of claim 44 , wherein an outer surface of the hollow stem of the axle includes a plurality axle splines.", "48 . The ratchet mechanism of claim 47 , wherein the pair of single-sided gears each include a set of inner splines that are detachably interlocked with the axle splines such that rotation of the single sided gears causes corresponding rotation of the axle while interlocked.", "49 . The ratchet mechanism of claim 41 , wherein the rachet housing has a set of housing splines that protrude inward from an inner surface of the ratchet housing.", "50 . The ratchet mechanism of claim 49 , wherein the double-sided gear includes a set of outer splines that are detachably interlocked with the housing splines such that rotation of the ratchet housing causes corresponding rotation of the double-sided gear while interlocked.", "providing a ratchet housing having a central axis; aligning a double-sided gear with the central axis within the housing, the double-sided gear having a first side, a second side opposite the first side, a first set of ramps and a second set of ramps, wherein the first set of ramps radially taper clockwise about the central axis on the first side of the double-sided gear and the second set of ramps radially taper counter-clockwise about the central axis on the second side of the double-sided gear; positioning a pair of single-sided gears within the ratchet housing such that the pair both align with the central axis and straddle the double-sided gear, the pair of single-sided gears each having a racheting side and a non-ratcheting side, wherein a first of the single-sided gears has a first set of teeth that radially taper counter-clockwise about the central axis on the racheting side and a second of the single-sided gears has a second set of teeth that radially taper clockwise about the central axis on the racheting side; positioning a ratchet axle along the central axis through the at least one double-sided gear and the single-sided gears; and coupling the axle with one of the double-sided gear and the pair of single-sided gears and coupling the housing with another of the double-sided gear and the pair of single-sided gears; wherein the first set of teeth are positioned adjacent to the first set of ramps and the second set of teeth are positioned adjacent to the second set of ramps, and further wherein when rotating in a first direction about the central axis, the first set of teeth slide past the first set of ramps and the second set of teeth slide past the second set of ramps such that the ratchet housing is able to rotate independent of the axle, and when rotating a second direction opposite the first direction, the first set of teeth interlock with the first set of ramps and the second set of teeth interlock with the second set of ramps such that the ratchet housing causes the axle to correspondingly rotate in the second direction.", "52 . The method of claim 51 , further comprising providing an additional double-sided gear aligned with the central axis within the housing and having an additional first side, an additional second side opposite the additional first side, an additional first set of ramps and an additional second set of ramps, wherein the additional first set of ramps radially taper clockwise about the central axis on the additional first side and the additional second set of ramps radially taper counter-clockwise about the central axis on the additional second side.", "53 . The method of claim 52 , further comprising sliding the additional double-sided gear into the double-sided gear with the additional first set of ramps radially offset from the first set of ramps and the additional second set of ramps radially offset from the second set of ramps.", "54 . The method of claim 51 , wherein the axle includes a hollow stem coupled to a base having a radially undulating face that faces away from the stem.", "55 . The method of claim 54 , further comprising positioning a plurality of bearings within the ratchet housing around the stem of the axle.", "56 . The method of claim 55 , wherein the rachet housing has a discontinuous rim that protrudes from an inner surface of the housing and blocks one of the bearing from moving away from the base.", "57 . The method of claim 54 , wherein an outer surface of the hollow stem of the axle includes a plurality axle splines.", "58 . The method of claim 57 , wherein the pair of single-sided gears each include a set of inner splines that are detachably interlocked with the axle splines such that rotation of the single sided gears causes corresponding rotation of the axle while interlocked.", "59 . The method of claim 51 , wherein the rachet housing has a set of housing splines that protrude inward from an inner surface of the ratchet housing.", "60 . The method of claim 59 , wherein the double-sided gear includes a set of outer splines that are detachably interlocked with the housing splines such that rotation of the ratchet housing causes corresponding rotation of the double-sided gear while interlocked."], "bibtex": "@patent{20250074114,\n    title = {BICYCLE HUB SYSTEM, METHOD AND DEVICE INCLUDING A REAR HUB LOCKING MECHANISM},\n    number = {20250074114},\n    year = {2025},\n    note = {File: US20250074114A1-20250306.XML}\n    }", "classification": "B60B2702FI"}, {"title": "VEHICLE, AXLE ASSEMBLY, AND METHOD OF MODULATING A TEMPERATURE OF LUBRICANT IN A VEHICLE AXLE ASSEMBLY", "doc_number": "20250074115", "filename": "US20250074115A1-20250306.XML", "abstract": "An axle assembly includes an axle configured for rotation by receiving rotational power from the power source and an axle housing containing the axle. The axle assembly further includes a brake disk disposed in the axle housing, coupled to the axle, and configured for rotation upon the rotation of the axle, a lubricant circuit extending from a lubricant circuit inlet axially aligned with the brake disk to a lubricant circuit outlet in the axle housing, and a heat exchanger disposed in the lubricant circuit to exchange heat between lubricant in the lubricant circuit and coolant circulating through the heat exchanger.", "detailed_description": ["Referring toFIG.1, a vehicle10is provided having a front end12and a rear end14located at an opposite end of the vehicle10from the front end12. The vehicle10includes a power source16, such as a diesel or gasoline internal combustion engine, electric or hydraulic motor or machine, or any combination thereof, in non-limiting examples, that is configured to provide motive power to the vehicle10.", "", "As shown in further detail inFIGS.3and5, the vehicle10further includes at least one axle assembly22having an axle18configured for rotation by receiving rotational power from the power source16. The vehicle10in the embodiment illustrated inFIG.1includes two axle assemblies22located at the rear end14of the vehicle10, but the vehicle10may include any number of axle assemblies22located at the front end12and/or the rear end14in additional embodiments of the present disclosure. The vehicle10and the axle assembly22further include an axle housing20that contains the axle18. In the present disclosure, the axle assembly22and the axle18may be used and referenced interchangeably. The axle housing20is disposed at the rear end14of the vehicle10and the power source16is located at the front end12of the vehicle10in the illustrated embodiment.", "", "The vehicle10ofFIG.1includes one or more drive shafts extending from the power source16to the axle assemblies22to transfer torque from the power source16to the axle(s)18in the illustrated embodiment. The vehicle10may further include one or more transmissions, gearboxes, or other drivetrain components to transfer power from the power source16to the axle assemblies22.", "", "Referring now toFIG.2with continuing reference toFIG.1, the vehicle10and the axle assembly22include a heat exchanger36. In the illustrated embodiment ofFIG.2, the heat exchanger36is mounted to the axle housing20. The heat exchanger36includes a heat exchanger core44that is spaced apart from the axle housing20in the illustrated embodiment. As shown in further detail inFIG.4, an air gap46exists between the core44and the axle housing20in an embodiment to allow airflow across and/or around the core44.FIG.1illustrates that, in an embodiment, the heat exchanger36is positioned at an upper end88and/or rear end90of the axle housing20.", "", "Referring now toFIG.3, the vehicle10and the axle assembly22further include a brake assembly24. The brake assembly24includes a brake disk26. Although the illustrated embodiment includes a single brake disk26on each side of the axle assembly22, the brake assembly24may include a plurality of brake disks26and may further include a plurality of separator plates separating adjacent brake disks26in additional embodiments not illustrated. The brake disk26is disposed in the axle housing20, coupled to the axle18, and configured for rotation upon the rotation of the axle18. The brake assembly24further includes a piston28configured to move axially to engage the brake disk26and resist, slow, or stop movement of the brake disk26to enable braking of the vehicle10.", "", "The vehicle10and the axle assembly22further include a lubricant circuit30extending from a lubricant circuit inlet32axially aligned with the brake disk26, as illustrated inFIGS.2,3, and5, to a lubricant circuit outlet34in the axle housing20, as illustrated inFIGS.2and5. As shown inFIGS.3and4, the lubricant circuit30includes two lubricant circuit inlets32and a lubricant circuit upstream junction60upstream of the heat exchanger36. The lubricant circuit30includes a lubricant inlet74at an inlet side78of the heat exchanger36and a lubricant outlet76at an outlet side80of the heat exchanger36. As shown inFIGS.4and5, the lubricant circuit30includes two lubricant circuit outlets34and a lubricant circuit downstream junction62downstream of the heat exchanger36. In the illustrated embodiment ofFIGS.2and5, the lubricant circuit outlet34is axially spaced from or disposed axially outside of the brake disk26.", "", "As illustrated inFIG.3, a second brake disk50is disposed in the axle housing20, coupled to the axle18, and configured for rotation upon the rotation of the axle18. The lubricant circuit30includes a lubricant circuit second inlet52in an embodiment that is axially aligned with the second brake disk50. A lubricant circuit second outlet54in the axle housing20is axially spaced from or disposed axially outside of the second brake disk50in the illustrated embodiment. The lubricant circuit outlet34and/or the lubricant circuit second outlet54ofFIG.5is/are disposed at one or both outer end(s)58of the axle housing20. In additional embodiments not illustrated, the lubricant circuit outlet34and/or the lubricant circuit second outlet54is/are located inward of the brake disk26and/or the second brake disk50and/or at another location of the axle housing20or another component of the vehicle10. The brake disk26and/or second brake disk50of the illustrated embodiments act to pump the lubricant38through the lubricant circuit30.", "", "Referring toFIG.4, the heat exchanger36is disposed in the lubricant circuit30to exchange heat between lubricant38in the lubricant circuit30and coolant40circulating through the heat exchanger36. As shown inFIGS.2and4, the heat exchanger36includes two brackets56to mount the heat exchanger36to the axle housing20and position the heat exchanger core44spaced apart from the axle housing20. The heat exchanger36is mounted to the axle housing20such that the core44is parallel or substantially parallel with the axle18and/or perpendicular or substantially perpendicular to a direction of forward travel of the vehicle10, which may increase the surface area of the core44impinged upon by air and improve airflow across or around the heat exchanger36, thereby improving cooling of both the lubricant38and the coolant40. In additional embodiments, the heat exchanger36includes a single bracket56or any other number of brackets56and/or another structure to mount the heat exchanger36to the axle housing20. In additional embodiments not illustrated, the heat exchanger36is integrated into or contained inside the axle assembly22and/or the axle housing20.", "", "With reference toFIGS.1and4, the vehicle10and the axle assembly22further include a coolant circuit42extending from the power source16and through the heat exchanger36. The coolant circuit42includes a coolant inlet70and a coolant outlet72at an outlet side80of the heat exchanger36that is opposite from the inlet side78of the heat exchanger36. In the illustrated embodiment, the power source16is an internal combustion engine and the coolant40circulating through the heat exchanger36is an internal combustion engine coolant configured to cool the internal combustion engine. The vehicle10of an embodiment includes a coolant pump (not shown) configured to pump the coolant40between an engine radiator or heat exchanger (not shown) and the internal combustion engine and may be configured to also pump the coolant40between the engine heat exchanger and the heat exchanger36. The axle housing20of an embodiment is disposed at the rear end14of the vehicle10and the power source16is located at the front end12of the vehicle10opposite from the rear end14of the vehicle10. In one or more embodiments not illustrated, one or more of the power source16, the axle assembly22, and/or the heat exchanger36are located elsewhere on the vehicle10.", "", "Referring now toFIG.6, a method100includes modulating a temperature of the lubricant38in the axle assembly22and/or the vehicle10is provided. The method100includes sending, at step110, the lubricant38in a radially outward direction in the axle housing20to the lubrication circuit inlet32using rotation of the brake disk26that is coupled to the axle18and configured for rotation upon the rotation of the axle18.", "", "The method100further includes circulating, at step112, the lubricant38from the lubrication circuit inlet32to the lubricant circuit outlet34in the axle housing20. The method100further includes circulating, at step114, the lubricant38through the heat exchanger36disposed in the lubrication circuit30to modulate the temperature of the lubricant38by exchanging heat between the lubricant38and the coolant40in the heat exchanger36.", "", "In one or more embodiments, the method100includes circulating the lubricant38from the brake disk26in the axle housing20to the heat exchanger36disposed outside of the axle housing20. The method100may further include facilitating airflow around the heat exchanger core44of the heat exchanger36by spacing the heat exchanger core44apart from the axle housing20. The method100may further include circulating the coolant40from the power source16and through the heat exchanger36. The method100may further include cooling the power source16with the coolant and cooling the lubricant38with the coolant40using the heat exchanger36. The method100may further include cooling the lubricant38with the coolant40using the heat exchanger36when a lubricant temperature is higher than a coolant temperature.", "", "The method100may further include heating the lubricant38with the coolant40using the heat exchanger36, such as upon initial rotation of the axle18. In non-limiting examples, heating the lubricant38with the coolant40may occur after the vehicle10has been immobile and/or the axle18has not rotated for a period of time sufficient to reduce the temperature of the lubricant38. Heating the lubricant38with the coolant40in such cases is beneficial to increase flow of the relatively viscous, cool lubricant38to circulate the lubricant38more quickly to parts requiring lubrication and reduce wear, improve durability, and improve efficiency.", "", "Without in any way limiting the scope, interpretation, or application of the claims appearing below, a technical effect of one or more of the example embodiments disclosed herein is cooling or modulating the temperature of the lubricant38to reduce degradation of the lubricant38and improve the durability and efficiency of the axle assembly22and/or the vehicle10. Another technical effect of one or more of the example embodiments disclosed herein is cooling or heating the lubricant38without the need for a separate pump, valving, long lubricant or coolant lines and/or other component to circulate the lubricant38, which reduces cost and complexity and increases the efficiency and packaging of the axle assembly22and the vehicle10. Further, the lubricant38is circulated using and/or flowing directly from the brake disk(s), which is a significant source of heat in the axle assembly22, toward the heat exchanger36to improve heat rejection of the axle assembly22. Even further, because maximum heat is generated upon braking or decelerating from a relatively high speed of the vehicle10, and the lubricant-pumping brake disk(s) rotate at relatively high speed during such conditions, improved lubricant cooling occurs when there would be an increased need for cooling of the lubricant38. Another technical effect of one or more of the example embodiments disclosed herein is to more quickly cool or heat the lubricant38such that the lubricant38may reach and maintain a desired temperature range for maximum benefit of lubrication and cooling of the components of the axle assembly22and the vehicle10.", "", "As used herein, “e.g.” is utilized to non-exhaustively list examples and carries the same meaning as alternative illustrative phrases such as “including,” “including, but not limited to,” and “including without limitation.” Unless otherwise limited or modified, lists with elements that are separated by conjunctive terms (e.g., “and”) and that are also preceded by the phrase “one or more of” or “at least one of” indicate configurations or arrangements that potentially include individual elements of the list, or any combination thereof. For example, “at least one of A, B, and C” or “one or more of A, B, and C” indicates the possibilities of only A, only B, only C, or any combination of two or more of A, B, and C (e.g., A and B; B and C; A and C; or A, B, and C).", "", "Those having ordinary skill in the art will recognize that terms such as “above,” “below,” “upward,” “downward,” “top,” “bottom,” etc., are used descriptively for the figures, and do not represent limitations on the scope of the disclosure, as defined by the appended claims. Furthermore, the teachings may be described herein in terms of functional and/or logical block components and/or various processing steps. It should be realized that such block components may be comprised of any number of hardware, software, and/or firmware components configured to perform the specified functions.", "", "Terms of degree, such as “generally”, “substantially” or “approximately” are understood by those of ordinary skill to refer to reasonable ranges outside of a given value or orientation, for example, general tolerances or positional relationships associated with manufacturing, assembly, and use of the described embodiments.", "", "While the above describes example embodiments of the present disclosure, these descriptions should not be viewed in a limiting sense. Rather, other variations and modifications may be made without departing from the scope and spirit of the present disclosure as defined in the appended claims."], "claims": ["a power source configured to provide motive power to the vehicle; an axle configured for rotation by receiving rotational power from the power source; an axle housing containing the axle; a brake disk disposed in the axle housing, coupled to the axle, and configured for rotation upon the rotation of the axle; a lubricant circuit extending from a lubricant circuit inlet axially aligned with the brake disk to a lubricant circuit outlet in the axle housing; and a heat exchanger disposed in the lubricant circuit to exchange heat between lubricant in the lubricant circuit and coolant circulating through the heat exchanger.", "2 . The vehicle of claim 1 , further comprising a coolant circuit extending from the power source and through the heat exchanger.", "3 . The vehicle of claim 2 , wherein the axle housing is disposed at the rear end of the vehicle and the power source is located at the front end of the vehicle.", "4 . The vehicle of claim 2 , wherein the power source is an internal combustion engine and the coolant circulating through the heat exchanger is an internal combustion engine coolant configured to cool the internal combustion engine.", "an axle configured for rotation; an axle housing containing the axle; a brake disk disposed in the axle housing, coupled to the axle, and configured for rotation upon the rotation of the axle; a lubricant circuit extending from a lubricant circuit inlet axially aligned with the brake disk to a lubricant circuit outlet in the axle housing; and a heat exchanger disposed in the lubricant circuit to exchange heat between lubricant in the lubricant circuit and coolant circulating through the heat exchanger.", "6 . The assembly of claim 5 , wherein the heat exchanger is mounted to the axle housing.", "7 . The assembly of claim 6 , wherein the heat exchanger comprises a heat exchanger core that is spaced apart from the axle housing.", "8 . The assembly of claim 5 , wherein the lubricant circuit outlet is axially spaced from the brake disk.", "9 . The assembly of claim 5 , further comprising a second brake disk disposed in the axle housing, coupled to the axle, and configured for rotation upon the rotation of the axle, wherein the lubricant circuit comprises a lubricant circuit second inlet axially aligned with the second brake disk.", "10 . The assembly of claim 9 , further comprising a lubricant circuit second outlet in the axle housing that is axially spaced from the second brake disk.", "11 . The assembly of claim 5 , further comprising a coolant circuit extending from the power source and through the heat exchanger.", "12 . The assembly of claim 11 , wherein the axle housing is disposed at a rear end of the vehicle and the power source is located at a front end of the vehicle opposite from the rear end of the vehicle.", "13 . The assembly of claim 11 , wherein the power source is an internal combustion engine and the coolant circulating through the heat exchanger is an internal combustion engine coolant configured to cool the internal combustion engine.", "sending the lubricant in a radially outward direction in the axle housing to a lubrication circuit inlet using rotation of a brake disk that is coupled to the axle and configured for rotation upon the rotation of the axle; circulating the lubricant from a lubrication circuit inlet to a lubricant circuit outlet in the axle housing; and circulating the lubricant through a heat exchanger disposed in the lubrication circuit to modulate the temperature of the lubricant by exchanging heat between the lubricant and a coolant in the heat exchanger.", "15 . The method of claim 14 , further comprising circulating the lubricant from the brake disk in the axle housing to the heat exchanger disposed outside of the axle housing.", "16 . The method of claim 15 , further comprising facilitating airflow around a heat exchanger core of the heat exchanger by spacing the heat exchanger core apart from the axle housing.", "17 . The method of claim 14 , further comprising circulating the coolant from the power source and through the heat exchanger.", "18 . The method of claim 17 , further comprising cooling the power source with the coolant and cooling the lubricant with the coolant using the heat exchanger.", "19 . The method of claim 14 , further comprising cooling the lubricant with the coolant using the heat exchanger when a lubricant temperature is higher than a coolant temperature.", "20 . The method of claim 14 , further comprising heating the lubricant with the coolant using the heat exchanger upon an initial rotation of the axle."], "bibtex": "@patent{20250074115,\n    title = {VEHICLE, AXLE ASSEMBLY, AND METHOD OF MODULATING A TEMPERATURE OF LUBRICANT IN A VEHICLE AXLE ASSEMBLY},\n    number = {20250074115},\n    year = {2025},\n    note = {File: US20250074115A1-20250306.XML}\n    }", "classification": "B60B3512FI"}]