[{"title": "Spinner Cap", "doc_number": "20240239135", "filename": "US20240239135A1-20240718.XML", "abstract": "The spinner cap is a device intended to enhance the appearance of an automotive wheel by giving a visual effect of a slowly rotating wheel even when the vehicle is no longer in motion. To accomplish this, the device includes a unique arrangement of parts including a spinner, a spindle, a bearing, and a cap base. The spindle connects the spinner to the bearing. The bearing enables the spinner to rotate independently of the cap base. When fully assembled, the cap base is inserted into the center bore of the wheel and secured by a plurality of spring clips that engage with the center bore. Once in place, the cap base rotates with the wheel and the spinner freely rotates independently of the wheel's rotation.", "detailed_description": [""], "claims": ["a spinner; an aperture disposed in a center of the spinner; a cap base; a bearing housing; a bearing; a spindle; a spindle nut; the cap base comprising a base outer surface, a base inner surface, a plurality of spring clips, and a cap bore; the cap bore being centrally disposed on the cap base; the bearing housing comprising a housing outer surface, a housing inner surface, a cavity, and a housing bore; the housing bore being centrally disposed on the bearing housing; the bearing being disposed in the cavity; the bearing housing being concentrically connected to the cap base; the spindle being inserted through the aperture of the spinner, through the cap bore, through the bearing, and through the housing bore; the spindle securing the spinner to the bearing via the spindle nut; the cap base being concentrically attached to a center bore of the wheel by means of the plurality of spring clips engaging with the center bore; and the spinner freely rotates independently of the wheel.", "the cap base being disk-shaped; the plurality of spring clips being distributed about the periphery of the base inner surface; and each of the plurality of spring clips positioned perpendicular to the base inner surface.", "each of the plurality of spring clips comprising a tab and a retainer nub; the tab being terminally connected to the base inner surface; the tab extending outward to a predefined length; the retainer nub being terminally connected to the tab; and the retainer nub extending radially outward.", "the cap base comprising a centering ring; the centering ring being concentrically disposed on the base inner surface; the centering ring extending outward; and the bearing housing slidably engaging with the centering ring.", "the bearing housing being cylindrically-shaped; the cavity being a cylindrically recessed space; and the cavity traversing axially inward from the housing outer surface.", "a plurality of hardware holes, a plurality of fasteners, and a plurality of hardware nuts; the plurality of hardware holes being distributed about the periphery of the cap base and the periphery of the bearing housing; the plurality of fasteners extending through the plurality of hardware holes; and the plurality of fasteners attaching the bearing housing to the cap base via the plurality of hardware nuts.", "a spacer; the spacer being cylindrically-shaped; the spindle being inserted through the spacer; and the spacer being positioned between the spinner and the bearing.", "the spindle comprising a head, a shank, and a threaded end; the shank having a smooth journal portion; the shank extending from the head and through the bearing; and the threaded end extending from the shank.", "the bearing being a ball-type bearing; the bearing comprising an inner ring and an outer ring; and the inner ring rotating independently of the outer ring.", "a spinner; an aperture disposed in a center of the spinner; a cap base; a bearing housing; a bearing; a spindle; a spindle nut; the cap base comprising a base outer surface, a base inner surface, a plurality of spring clips, and a cap bore; the cap base being disk-shaped; the plurality of spring clips being distributed about the periphery of the base inner surface; each of the plurality of spring clips positioned perpendicular to the base inner surface; the cap bore being centrally disposed on the cap base; the bearing housing comprising a housing outer surface, a housing inner surface, a cavity, and a housing bore; the bearing housing being cylindrically-shaped; the cavity being a cylindrically recessed space; the cavity traversing axially inward from the housing outer surface; the housing bore being centrally disposed on the bearing housing; the bearing being disposed in the cavity; the bearing housing being concentrically connected to the cap base; the spindle being inserted through the aperture of the spinner, through the cap bore, through the bearing, and through the housing bore; the spindle securing the spinner to the bearing via the spindle nut; the cap base being concentrically attached to a center bore of the wheel by means of the plurality of spring clips engaging with the center bore; and the spinner freely rotates independently of the wheel.", "each of the plurality of spring clips comprising a tab and a retainer nub; the tab being terminally connected to the base inner surface; the tab extending outward to a predefined length; the retainer nub being terminally connected to the tab; and the retainer nub extending radially outward.", "the cap base comprising a centering ring; the centering ring being concentrically disposed on the base inner surface; the centering ring extending outward; and the bearing housing slidably engaging with the centering ring.", "a plurality of hardware holes, a plurality of fasteners, and a plurality of hardware nuts; the plurality of hardware holes being distributed about the periphery of the cap base and the periphery of the bearing housing; the plurality of fasteners extending through the plurality of hardware holes; and the plurality of fasteners attaching the bearing housing to the cap base via the plurality of hardware nuts.", "a spacer; the spacer being cylindrically-shaped; the spindle being inserted through the spacer; and the spacer being positioned between the spinner and the bearing.", "the spindle comprising a head, a shank, and a threaded end; the shank having a smooth journal portion; the shank extending from the head and through the bearing; and the threaded end extending from the shank.", "the bearing being a ball-type bearing; the bearing comprising an inner ring and an outer ring; and the inner ring rotating independently of the outer ring.", "a spinner; an aperture disposed in a center of the spinner; a cap base; a bearing housing; a bearing; a spindle; a spindle nut; a spacer; the cap base comprising a base outer surface, a base inner surface, a plurality of spring clips, a cap bore, and a centering ring; the cap base being disk-shaped; the plurality of spring clips being distributed about the periphery of the base inner surface; each of the plurality of spring clips positioned perpendicular to the base inner surface; the cap bore being centrally disposed on the cap base; the centering ring being concentrically disposed on the base inner surface; the centering ring extending outward; the bearing housing slidably engaging with the centering ring; the bearing housing comprising a housing outer surface, a housing inner surface, a cavity, and a housing bore; the bearing housing being cylindrically-shaped; the cavity being a cylindrically recessed space; the cavity traversing axially inward from the housing outer surface; the housing bore being centrally disposed on the bearing housing; the bearing being disposed in the cavity; the bearing housing being concentrically connected to the cap base; the spacer being cylindrically-shaped; the spacer being positioned between the spinner and the bearing; the spindle being inserted through the aperture of the spinner, through the spacer, through the cap bore, through the bearing, and through the housing bore; the spindle securing the spinner to the bearing via the spindle nut; the cap base being concentrically attached to a center bore of the wheel by means of the plurality of spring clips engaging with the center bore; and the spinner freely rotates independently of the wheel.", "each of the plurality of spring clips comprising a tab and a retainer nub; the tab being terminally connected to the base inner surface; the tab extending outward to a predefined length; the retainer nub being terminally connected to the tab; and the retainer nub extending radially outward.", "a plurality of hardware holes, a plurality of fasteners, and a plurality of hardware nuts; the plurality of hardware holes being distributed about the periphery of the cap base and the periphery of the bearing housing; the plurality of fasteners extending through the plurality of hardware holes; and the plurality of fasteners attaching the bearing housing to the cap base via the plurality of hardware nuts.", "the spindle comprising a head, a shank, and a threaded end; the shank having a smooth journal portion; the shank extending from the head and through the bearing; the threaded end extending from the shank; the bearing being a ball-type bearing; the bearing comprising an inner ring and an outer ring; and the inner ring rotating independently of the outer ring."], "bibtex": "@patent{20240239135,\n    title = {Spinner Cap},\n    number = {20240239135},\n    year = {2024},\n    note = {File: US20240239135A1-20240718.XML}\n    }", "classification": "B60B720FI"}, {"title": "WHEEL ASSEMBLY", "doc_number": "20240239136", "filename": "US20240239136A1-20240718.XML", "abstract": "Disclosed is a wheel assembly including a driving rotation part being rotatable about a driving rotation axis that is a rotation axis that extends in one direction, and a variable rotation part being rotatable about a variable rotation axis that is an imaginary rotation axis, of which a relative location to the driving rotation axis is variable, and being movable relative to the driving rotation part along a direction that is not parallel to the one direction, wherein a relative location of the variable rotation axis to the driving rotation axis is variable when the variable rotation part is moved relative to the driving rotation part.", "detailed_description": ["Hereinafter, some implementations of the present disclosure will be described in detail with reference to the exemplary drawings. Throughout the specification, it is noted that the same or like reference numerals denote the same or like components even though they are provided in different drawings. Further, in the following description of the present disclosure, a detailed description of known functions and configurations incorporated herein will be omitted when it may make the subject matter of the present disclosure rather unclear.", "", "In addition, terms, such as first, second, “A”, “B”, (a), (b) or the like may be used herein when describing components of the present disclosure. The terms are provided only to distinguish the components from other components, and the essences, sequences, orders, and the like of the components are not limited by the terms.", "", "Hereinafter, a robot1according to the present disclosure will be described with reference to the drawings.", "", "The robot1according to the present disclosure may travel on a ground surface, and may be moved to a targeted location through the travel. A shape of the robot1may be deformed according to a state of the ground surface such that the robot1may effectively pass on the ground surface having a step, such as a stair. Furthermore, the robot1may realize a motion that simulates a walk of a person. The robot1may include a wheel assembly10a,a seat20, and a frame30.", "", "Referring toFIGS.1to8, the wheel assembly10aaccording to a first implementation of the present disclosure may travel to move toward a targeted location together with the frame30while being supported by the frame30. The wheel assembly10amay include a driving rotation part100a,a variable rotation part200a,a rotation driving part300a,and a variable driving part400a.", "", "Referring toFIG.3, the driving rotation part100amay be rotated about a driving rotation axis X1that is a rotation axis that extends in one direction. The driving rotation axis X1may be defined as an imaginary line that passes through a driving center “M” that is a center of the driving rotation part100a.A relative location of the driving rotation axis X1to the frame30may be fixed. For example, when the frame30is moved by a first distance in a first direction, the driving rotation part100amay be moved by the first distance in the first direction. The driving rotation part100amay be supported by the frame30. The driving rotation part100amay include a guide unit110aand an outer ring part120a.", "", "The guide unit110amay guide movement of the variable rotation part200a.The guide unit110amay include a cylinder111a. The cylinder111amay support the variable rotation part200a.The cylinder111amay have a shape that surrounds a spoke221athat will be described below. A cylinder hole111a1and a separation preventing hole111a2may be formed in the cylinder111a.", "", "A portion of the variable rotation part200amay be inserted into the cylinder hole111a1. For example, the spoke221athat will be described below may be inserted into the cylinder hole111a1. As a more detailed example, the spoke221amay be moved along a direction, in which the cylinder hole111a1extends, in a state, in which the spoke221ais inserted into the cylinder hole111a1. The cylinder hole111a1may extend along a driving radial direction R1. The driving radial direction R1may be defined as a direction that is perpendicular to the one direction and faces the outer ring part120afrom the driving center “M”.", "", "Furthermore, the separation preventing hole111a2may prevent or otherwise restrict a movement path of the spoke221afrom deviating in a direction that is not parallel to the driving radial direction R1. For example, even in an insertion release state that deviates from an insertion state, in which the spoke221ais inserted into the cylinder hole111a1, the separation preventing hole111a2may guide movement of the spoke221asuch that the spoke221ais moved along the driving radial direction R1. The insertion state may be defined as a state, in which at least a portion of the spoke221ais inserted into the cylinder hole111a1. Furthermore, the insertion release state may be defined as a state, in which the spoke221ais spaced apart from the cylinder hole111a1in the driving radial direction R1. When the spoke221ais in the insertion state, a movement path of the spoke221amay be determined by the cylinder hole111a1. Furthermore, when the spoke221ais in the insertion release state, the movement path of the spoke221amay be determined by the separation preventing hole111a2.", "", "A separation preventing member222athat will be described below may be inserted into the separation preventing hole111a2. The separation preventing member222amay be moved along a direction, in which the separation preventing hole111a2extends. The separation preventing hole111a2may extend along the driving radial direction R1. Furthermore, the separation preventing hole111a2may be disposed on a side that is close to a periphery of the separation preventing hole111a2. For example, when the cylinder hole111a1is viewed in the driving radial direction R1, the separation preventing hole111a2may be disposed to be adjacent to the periphery of the cylinder hole111a1. The separation preventing hole111a2may be communicated with the cylinder hole111a1.", "", "Furthermore, a plurality of cylinders111amay be provided. The plurality of cylinders111amay be arranged on an inner peripheral surface of the outer ring part120ato be spaced apart from each other in the driving radial direction R1. An outer circle that is an imaginary circle that passes through outer ends of the plurality of cylinders111ain the driving radial direction R1may be larger than an inner circle that is an imaginary circle that passes through inner ends of the plurality of cylinders111ain the driving radial direction R1. In other words, a radius of the outer circle, which is a spacing distance between the driving center “M” and the outer circle in the driving radial direction R1, may be larger than a radius of the inner circle, which is a spacing distance between the driving center “M” and the inner circle in the driving radial direction R1.", "", "The outer ring part120amay be connected to outer ends of the plurality of cylinders111ain the driving radial direction R1. The outer ring part120a,for example, may be integrally formed with the plurality of cylinders111a.The outer ring part120amay have an annular ring shape, a center of which is the driving center “M”. For example, when the outer ring part120ais viewed in one direction, the outer ring part120amay have a circular shape that extends along a driving circumferential direction C1that is a direction, in which the driving rotation part100ais rotated.", "", "The wheel assembly10amay further include a fixing part. The fixing part may fix a relative location of the outer ring part120ato the frame30of the driving center “M”. In other words, the fixing part may restrict the driving center “M” of the outer ring part120afrom being moved with respect to the frame30. Through the fixing part, the outer ring part120amay be rotated about the driving rotation axis X1, and a relative location thereof to the frame30may be fixed. The fixing part, for example, may include one or more bearings that are attached to one or more of an inner peripheral surface and an outer peripheral surface of the outer ring part120a. Referring toFIG.4, the variable rotation part200amay be moved relative to the driving rotation part100a.For example, the variable rotation part200amay be moved with respect to the driving rotation part100aalong a relative movement direction that deviates from the one direction. The relative movement direction, for example, may be a direction that is perpendicular to the one direction. In a more detailed example, it may be understood that, when the one direction is a leftward/rightward direction as an example, the relative movement direction is a concept including directions of a forward/rearward vector, an upward/downward vector, and all vectors that may be defined through combination thereof. However, this is a simple example, and it may be understood that the one direction of the present disclosure is not limited to the leftward/rightward direction and may be the leftward/rightward direction and an arbitrary direction that is a direction that deviates from the leftward/rightward direction.", "", "Furthermore, the variable rotation part200amay be rotated through rotation of the driving rotation part100a.For example, the variable rotation part200amay be rotated together with the driving rotation part100awhile being supported by the driving rotation part100a.The variable rotation part200amay be rotated about a variable rotation axis X2that is an imaginary rotation axis, of which a relative location to the driving rotation axis X1may be changed. A relative location of the variable rotation axis X2to the frame30may be changed. In this regard, it may be understood that the ‘imaginary rotation axis’ in the specification is an imaginary line, of which a relative location to the frame30is changed.", "", "The variable rotation axis X2may extend along the one direction. Furthermore, when the variable rotation part200ais moved relative to the driving rotation part100a,the variable rotation axis X2may overlap the driving rotation axis X1or be spaced apart from the driving rotation axis X1. Furthermore, the variable rotation part200amay be in any one of an overlapping state, in which the variable rotation axis X2and the driving rotation axis X1overlap each other, and a spacing state, in which the variable rotation axis X2and the driving rotation axis X1are spaced apart from each other.", "", "When the variable rotation part200ais in the overlapping state, a repulsive force of the ground surface due to a load of the robot1may be applied to the driving rotation part100a.The variable rotation part200amay be configured to be in the overlapping state when the ground, on which the robot1travels, is flat. Furthermore, when the variable rotation part200ais in the spacing state, a repulsive force of the ground surface due to a load of the robot1may be applied to the variable rotation part200a.The variable rotation part200amay be configured to be in the spacing state when the ground, on which the robot1travels, is stepped. In this way, through the variable rotation part200athat may be in various states according to situations, a travel efficiency of the robot1may be maximized when the ground surface is flat and an obstacle to the robot may be easily overcome when a step is formed on the ground surface. The variable rotation part200amay include a variable disk210a,a spoke unit220a,and a power transmission part230a.", "", "The variable disk210amay be rotated about the variable rotation axis X2. The variable disk210amay have a disk shape. A radius of the variable disk210amay be smaller than a radius of the inner circle.", "", "The spoke unit220amay be connected to the variable disk210a.The spoke unit220amay be connected to a periphery of the variable disk210a.Furthermore, a plurality of spoke units220amay be provided. The plurality of spoke units220amay be arranged at the periphery of the variable disk210ato be spaced apart from each other along a variable circumferential direction C2. The variable circumferential direction C2may be defined as a direction, in which the variable rotation part200ais rotated. For example, the plurality of spoke units220amay be alternately arranged at a periphery of the outer surface and a periphery of the inner surface of the variable disk210a.For example, when any one of the plurality of spoke units220ais disposed at the periphery of the outer surface of the variable disk210a,the spoke unit220athat is closest to the any one of the plurality of spoke units220amay be disposed at the periphery of the inner surface of the variable disk210a.The outer surface of the variable disk210amay be defined as a part of the variable disk210a,which faces an outside of the robot1when the variable disk210ais viewed in the one direction. Furthermore, the inner surface of the variable disk210amay be defined as a part of the variable disk210a,which faces the driving rotation part100awhen the variable disk210ais viewed in the one direction. In other words, the outer surface or the variable disk210amay mean an opposite surface to the inner surface of the variable disk210a. Through arrangement of the plurality of spoke units220a,two adjacent spoke units220amay be restricted from being interfered with each other.", "", "Furthermore, referring toFIG.7, a spoke circumferential angle “b” that is a circumferential angle defined by, among the plurality of spoke units220a,arbitrary two adjacent spoke units220amay be the same as a cylinder circumferential angle “a” defined by, among the plurality of cylinders111a,arbitrary two adjacent cylinders111a.The cylinder circumferential angle “a” may be defined by an angle defined by two imaginary lines that extend from two adjacent cylinders111ain the driving radial direction R1to the driving center “M”. Furthermore, the spoke circumferential angle “b” may be defined as an angle defined by two imaginary lines that extend from two adjacent spoke units220ain a variable radial direction R2and pass through the driving center “M”. The plurality of spoke units220amay include a first spoke unit220a1and a second spoke unit220a2.", "", "The first spoke unit220a1may be connected to the variable disk210ato be fixed. One first spoke unit220a1may be provided. The first spoke unit220a1, for example, may be integrally formed with the variable disk210a.Furthermore, the second spoke unit220a2may be connected to the variable disk210ato be rotatable. A plurality of second spoke units220a2may be provided.", "", "Furthermore, each of the plurality of spoke units220amay include the spoke221a,the separation preventing member222a,and a spoke link223a.", "", "The spoke221amay be inserted into the cylinder hole111a1. The spoke221amay be moved along the cylinder hole111a1in a state, in which the spoke221ais inserted into the cylinder hole111a1. In other words, the spoke221amay reciprocate along the driving radial direction R1with respect to the cylinder111a.For example, the spoke221amay be moved inwards in the driving radial direction R1with respect to the cylinder111aor may be moved outwards in the driving radial direction R1. An inward direction in the driving radial direction R1is defined as a direction that becomes farther away from the driving center “M” along the driving radial direction R1, and an outward direction in the driving radial direction R1is defined as a direction that becomes closer to the driving center “M” along the driving radial direction R1.", "", "The spoke221amay be connected to the spoke link223ato be rotatable. For example, the spoke221aand the spoke link223amay be rotated with respect to each other. In a more detailed example, the spoke221amay be rotated about an imaginary rotation center that extends in one direction in an area, in which the spoke221aand the spoke link223aare connected to each other.", "", "For clarity, in the specification, a rotation center may mean a center axis of a revolution of a configuration having a center that is spaced apart from the rotation center, and a rotation axis may mean a center axis of a rotation of a configuration having a center that overlaps the rotation axis. Furthermore, it may be understood that the ‘imaginary rotation center’ in the specification mean an imaginary line, of which a relative location to the frame30may be changed. Furthermore, a variable rotation center CX1that will be described below may be defined as an ‘imaginary rotation center’, a motor rotation center CX may be defined as a ‘rotation center’, end rotation centers CX31and CX32may be defined as ‘imaginary rotation centers’, a spoke rotation center CX4may be defined as an ‘imaginary rotation center’, and a disk rotation center CX5may be defined as an ‘imaginary rotation center’.", "", "Furthermore, the variable rotation center CX1may be defined as an imaginary rotation center that extends along the variable rotation axis X2. The motor rotation centers CX21and CX22may be defined as rotation centers that extend along the motor rotation axis that will be described below. The end rotation centers CX31and CX32may be defined as imaginary rotation centers that extend on one direction in an area, in which a second end412aand a fourth end422aare connected to each other. The spoke rotation center CX4may be defined as an imaginary rotation center that extends on one direction in an area, in which the spoke221aand the spoke link223aare connected to each other. The disk rotation center CX5may be defined as an imaginary rotation center that extends in one direction in an area, in which the spoke link223aand the variable disk210aare connected to each other.", "", "The spoke221amay include a first spoke221a1and a second spoke221a2. The first spoke221a1may be provided in the first spoke unit220a1. Furthermore, the second spoke221a2may be provided in the second spoke unit220a2. A description of the first spoke221a1and the second spoke221a2will be replaced by the description of the spoke221a.", "", "The separation preventing member222amay be connected to a periphery of the spoke221a.The separation preventing member222amay extend along the variable radial direction R2. The variable radial direction R2may be defined as a direction that is perpendicular to the variable rotation axis X2. An imaginary line that extends along the variable radial direction R2may be perpendicular to the variable rotation axis X2. A length of the separation preventing member222ain the variable radial direction R2may be larger than a length of the spoke221ain the variable radial direction R2. For example, an inner end of the separation preventing member222ain the variable radial direction R2may be disposed on an inner side of an inner end or the spoke221ain the variable radial direction R2. In a more detailed example, the separation preventing member222amay have a shape that protrudes from the inner end of the spoke221ain the variable radial direction R2to an inner side in the variable radial direction R2when the variable rotation part200ais viewed along one direction.", "", "The separation preventing member222amay be inserted into the separation preventing hole111a2. The separation preventing member222amay be supported by the cylinder111awhen the spoke221ais in the insertion release state. For example, when the spoke221ais in the insertion release state, the separation preventing member222amay be in a state, in which it is inserted into the separation preventing hole111a2. The separation preventing member222a,for example, may be integrally formed with the spoke221a.", "", "The separation preventing member222amay include a first separation preventing member222a1and a second separation preventing member222a2. The first separation preventing member222a1may be provided in the first spoke unit220a1. Furthermore, the second separation preventing member222a2may be provided in the second spoke unit220a2. A description of the first separation preventing member222a1and the second separation preventing member222a2will be replaced by the description of the separation preventing member222a.", "", "The spoke link223amay connect the variable disk210aand the spoke221a.For example, one end of the spoke link223amay be connected to the variable disk210a,and an opposite end thereof may be connected to the spoke221ato be rotatable. The spoke link223amay include a first spoke link223a1and a second spoke link223a2.", "", "One end of the first spoke link223a1may be connected to a periphery of the variable disk210ato be fixed. An opposite end of the first spoke link223a1may be connected to the first spoke221a1to be rotatable. One end of the first spoke link223a1may be rotated about the spoke rotation center CX4.", "", "One end of the second spoke link223a2may be connected to a periphery of the variable disk210ato be rotatable. An opposite end of the second spoke link223amay be rotated about the disk rotation center CX5. Furthermore, an opposite end of the second spoke link223a2may be connected to the second spoke221a2to be rotatable. An opposite end of the second spoke link223amay be rotated about the spoke rotation center CX4.", "", "The power transmission part230amay transmit a driving force of the variable driving part400ato the variable rotation part200awhen the variable driving part400ais driven. Furthermore, the variable rotation axis X2may be provided in the variable rotation part200a.The power transmission part230amay extend along a direction of the variable rotation axis X2. The power transmission part230amay be connected to the variable disk210aand the variable driving part400a.For example, the power transmission part230amay be connected to at least one of the variable disk210a,the variable driving part400a,or a combination thereof to be rotatable. In other words, the power transmission part230amay transmit a driving force of the variable driving part400ato the variable rotation part200aregardless of rotation of the variable rotation part200a.The power transmission part230amay be connected to an inner surface of the variable disk210a.", "", "The rotation driving part300amay provide a rotational force to the driving rotation part100a.The rotation driving part300amay be supported by the frame30. The rotation driving part300amay include a rotation motor310aand a rotation member320a.The rotation motor310amay provide a rotational force to the rotation member320a.The rotation member320amay be adhered to an inner surface of the outer ring part120a.", "", "A plurality of rotation driving parts300a,for example, may be provided. A plurality of rotation driving parts300amay include a first rotation driving part and a second rotation driving part.", "", "For example, the first rotation driving part and the second rotation driving part may be disposed to be symmetrical to each other with respect to the driving center “M”. For example, the first rotation driving part may be adhered to an upper end of an inner peripheral surface of the outer ring part120a,and the second rotation driving part may be adhered to a lower end of the inner peripheral surface of the outer ring part120a.The first rotation driving part and the second rotation driving part may support the driving rotation part100asuch that a relative location of the driving center “M” to the frame30is fixed. In other words, the first rotation driving part and the second rotation driving part may fix a relative location of the driving rotation axis X1to the frame30.", "", "The present disclosure is not limited to the above example, and the plurality of rotation driving parts300amay be n (n>2) rotation driving parts. For example, when n rotation driving parts300aare provided, the weight center of the n rotation driving parts300amay be disposed to be the same as the driving center “M”.", "", "Referring toFIG.5, the variable driving part400amay move the variable rotation part200arelative to the driving rotation part100a.The variable driving part400amay include a first variable link410a,a second variable link420a,and a variable motor430. The first variable link410amay connect the second variable link420aand the variable motor430. The first variable link410amay include a first end411aand a second end412a.", "", "The first end411amay be connected to the variable motor430to be fixed. Furthermore, when the variable motor430is driven, the first end411amay be rotated about the motor rotation axis. The motor rotation axis may be defined as an imaginary line that extends along one direction and passes through the variable motor430.", "", "The second end412amay be connected to the second variable link420ato be rotatable. The second end412amay be rotated about the motor rotation centers CX21and CX22when the variable motor430is driven.", "", "The second variable link420amay connect the first variable link410aand the power transmission part230a.The second variable link420amay include a third end421aand a fourth end422a.The third end421amay be connected to the power transmission part230ato be rotatable. The third end421amay be rotated about the variable rotation axis X2. Furthermore, the first end411aand the third end421amay be rotated about the end rotation centers CX31and CX32with respect to each other.", "", "Furthermore, the fourth end422amay be rotated about the variable rotation center CX1. The fourth end422aand the second end412amay be connected to be rotatable with respect to each other. A hinge pin that provides the end rotation centers CX31and CX32, for example, may be provided between the fourth end422aand the second end412a.", "", "The variable motor430may provide a rotational force to the first variable link410a.When the variable motor430is driven, the first variable link410amay be rotated, and the second variable link420amay be rotated through rotation of the first variable link410a.", "", "Referring toFIGS.6and7, a plurality of variable driving parts400amay be provided. The plurality of variable driving parts400amay include a first variable driving part401aand a second variable driving part402a.In some cases, the above-described motor rotation centers CX21and CX22may include a first motor rotation center CX21and a second motor rotation center CX22. The first motor rotation center CX21may provide a rotation center in the second end412aof the first variable driving part401a.Furthermore, the second motor rotation center CX22may provide a rotation center in the second end412aof the second variable driving part402a.Furthermore, the end rotation centers CX31and CX32may include a first end rotation center CX31and a second end rotation center CX32. The first end rotation center CX31may provide rotation centers in the first end411aand the third end421aof the first variable driving part401a.Furthermore, the second end rotation center CX32may provide rotation centers in the first end411aand the third end421aof the second variable driving part402a.", "", "The first variable driving part401aand the second variable driving part402amay be driven independently. For example, when the first end411aof the first variable driving part401aand the first end411aof the second variable driving part402aare rotated in different directions, the variable rotation part200amay be moved along the upward/downward direction. As another example, when the first end411aof the first variable driving part401aand the first end411aof the second variable driving part402aare rotated in the same direction, the variable rotation part200amay be moved in a direction that is perpendicular to the one direction and is different from the upward/downward direction. In this way, because the first variable driving part401aand the second variable driving part402amay be driven independently, the variable rotation part200amay be moved along the relative movement direction to the driving rotation part100a.Furthermore, relative locations of the first variable driving part401aand the second variable driving part402awith respect to the frame30may be fixed.", "", "A user or an object may be seated on the seat20. The seat20may be connected to the frame30. The driving rotation part100a, the variable rotation part200a,and the rotation driving part300amay be connected to the frame30. The frame30may fix relative locations of the driving rotation part100a,the variable rotation part200a,and the rotation driving part300ato the frame30.", "", "Hereinafter, a wheel assembly10baccording to a second implementation of the present disclosure will be described with reference toFIGS.9to17. In a description of the second implementation of the present disclosure, a difference from the first implementation of the present disclosure will be mainly described. The wheel assembly10bmay include the driving rotation part100b, the variable rotation part200b,the rotation driving part300b,and a variable driving part400b.The driving rotation part100bmay include a guide unit110band a driving body120b.", "", "Referring toFIGS.9to11, the guide unit110bmay include a spoke111b.The spoke111bmay guide movement of a portion of the variable rotation part200b.For example, the spoke111bmay guide movement of a cylinder221bthat will be described below along the driving radial direction R1. The spoke111bmay support the variable rotation part200b.A plurality of spokes111bmay be provided. The plurality of spokes111bmay be arranged on an outer peripheral surface of the driving body120balong the driving circumferential direction C1. Furthermore, an outer circle that is an imaginary circle that passes through outer ends of the plurality of spokes111bin the driving radial direction R1may be larger than an inner circle that is an imaginary circle that passes through inner ends of the plurality of spokes111bin the driving radial direction R1.", "", "The driving body120bmay be connected to inner ends of the plurality of spokes111bin the driving radial direction R1. The driving body120b,for example, may be integrally formed with the plurality of spokes111b.", "", "Referring toFIG.12, the variable rotation part200bmay include a variable disk210b,a cylinder unit220b,and the power transmission part230b.A description of the variable disk210bwill be replaced by the description of the variable disk210adescribed in the first implementation.", "", "The cylinder unit220bmay be connected to the variable disk210b.The cylinder unit220bmay be connected to a periphery of the variable disk210b.Furthermore, a plurality of cylinder units220bmay be provided. The plurality of cylinder units220bmay be arranged at the periphery of the variable disk210bto be spaced apart from each other along the variable circumferential direction C2. The variable circumferential direction C2may be defined as a direction, in which the variable rotation part200ais rotated. For example, the plurality of cylinder units220bmay be alternately arranged at a periphery of the outer surface and a periphery of the inner surface of the variable disk210b.For example, when any one of the plurality of cylinder units220bis disposed at a periphery of the outer surface of the variable disk210b,a cylinder unit220bthat is closest to the any one of the plurality of cylinder units220bmay be disposed at a periphery of an inner surface of the variable disk210b.The plurality of cylinder units220bmay include a first cylinder unit220b1and a second cylinder unit220b2.", "", "The first cylinder unit220b1may be connected to the variable disk210bto be fixed. One first cylinder unit220b1may be provided. The first cylinder unit220b1, for example, may be integrally formed with the variable disk210b.Furthermore, the second cylinder unit220b2may be connected to the variable disk210bto be rotatable. One second cylinder unit220b2may be provided.", "", "Furthermore, each of the plurality of cylinder units220bmay include the cylinder221band a cylinder link222b.", "", "A cylinder hole222b-1may be formed in the cylinder221b. The spoke111bmay be inserted into the cylinder hole222b-1. The cylinder221bmay have a shape that surrounds the spoke111binserted into the cylinder hole222b-1. The cylinder221bmay be moved with respect to the spoke111balong the driving radial direction R1while surrounding the spoke111b.The cylinder221bmay reciprocate in the driving radial direction R1with respect to the spoke111b.For example, the cylinder221bmay be moved inwards in the driving radial direction R1with respect to the spoke111bor may be moved outwards in the driving radial direction R1.", "", "The cylinder221bmay be connected to the cylinder link222bto be rotatable. For example, the cylinder221band the cylinder link222bmay be rotated with respect to each other. In a more detailed example, the cylinder221bmay be rotated about a cylinder rotation center CX6. The cylinder rotation center CX6may be defined as an imaginary rotation center that extends in one direction in an area, in which the cylinder221band the cylinder link222bare connected to each other.", "", "The cylinder221bmay include a first cylinder221b1and a second cylinder221b2. The first cylinder221b1may be provided in the first cylinder unit220b1. Furthermore, the second cylinder221b2may be provided in the second cylinder unit220b2. A description of the first cylinder221b1and the second cylinder221b2will be replaced by the description of the cylinder221b.", "", "The cylinder link222bmay connect the variable disk210band the cylinder221b.For example, one end of the cylinder link222bmay be connected to the variable disk210b,and an opposite end thereof may be connected to the cylinder221bto be rotatable. The cylinder link222bmay include a first cylinder link222b1and a second cylinder link222b2.", "", "One end of the first cylinder link222b1may be connected to a periphery of the variable disk210bto be fixed. An opposite end of the first cylinder link222b1may be connected to the first cylinder221b1to be rotatable. One end of the first cylinder link222b1may be rotated about the cylinder rotation center CX6.", "", "One end of the second cylinder link222b2may be connected to a periphery of the variable disk210bto be rotatable. An opposite end of the second cylinder link222b2may be rotated about the disk rotation center CX5. Furthermore, an opposite end of the second cylinder link222b2may be connected to the second cylinder221b2to be rotatable. An opposite end of the second cylinder link222b2may be rotated about the cylinder rotation center CX6.", "", "The power transmission part230bmay be connected to an outer surface of the variable disk210b.A third end421band a fourth end422b,which will be described below, may be connected to an outer side of the power transmission part230bin one direction. When the power transmission part230bis viewed in the one direction, an outer side of the power transmission part230bin the one direction may be defined as a part of the power transmission part230b,which faces an outer side of the robot1.", "", "The rotation driving part300bmay include a rotation motor and a rotation member320b.The rotation member320bmay be rotated about the driving rotation axis X1when the rotation motor of the rotation driving part300bis driven. The rotation member320bmay be connected to an inner surface of the driving body120b.Furthermore, the inner surface of the driving body120bmay be defined as a part of the driving body120b,which faces the driving rotation part100bwhen the driving body120bis viewed in the one direction.", "", "Referring toFIGS.13to16, the variable driving part400bmay include a first variable link410b,a second variable link420b, and the variable motor430. Furthermore, the first variable link410bmay include a first end411band a second end412b.Furthermore, the second variable link420bmay include the third end421band the fourth end422b.Furthermore, the first variable link410band the second variable link420bmay be disposed on an outer side of the driving rotation part100bin the one direction. The outer side in the one direction may be defined as a direction that faces an outer side of the robot1.", "", "Furthermore, the first end411bmay have a shape that protrudes inwards in the one direction. The inner side in the one direction may mean an opposite side to the outer side in the one direction. Furthermore, the second end412bmay have a shape that protrudes outwards in the one direction. For example, an inner end of the first end411bin the one direction and an outer end of the second end412bin the one direction may be spaced apart from each other along the one direction. Furthermore, the third end421band the fourth end422bmay be disposed on an outer side of the variable disk210bin the one direction. In other words, the second variable link420bmay be disposed on an outer side of the variable disk210bin the one direction.", "", "A description related to connection relationships and rotations of the first end411b,the second end412b,the third end421b,and the fourth end422b,except for the features of the first end411b,the second end412b,the third end421b,and the fourth end422b,will be replaced by the description related to the first end411a,the second end412a,the third end421a,and the fourth end422aaccording to the first implementation.", "", "Furthermore, a plurality of variable driving parts400bmay be provided. The plurality of variable driving parts400bmay include a first variable driving part401band a second variable driving part402b.A description of the first variable driving part401band the second variable driving part402bwill be replaced by the description of the first variable driving part401aand the second variable driving part402aaccording to the first implementation.", "", "Hereinafter, a method for overcome an obstacle by the robot1according to the second implementation of the present disclosure will be described with reference toFIG.17.", "", "Referring toFIG.17, the robot1may smoothly pass through a stair3having a step while an object2is seated on the seat20. For example, the robot1may be driven such that the variable rotation part200bis in a spaced state to pass through the stair3having the step. In a more detailed example, according to the robot1, the first variable driving part401and the second variable driving part402may be driven such that the spoke111bprotrudes from the cylinder221bto an outer side in the driving radial direction R1. As the protruding spoke111bpresses an upper surface of the step of the stair3, the robot1ascends over the step. Through the process, the robot1may pass through the obstacle, such as the stair3having the step.", "", "According to the wheel assembly of the present disclosure, a rapid travel on a flat ground surface may be allowed and a walk for easy passing of an obstacle also may be allowed.", "", "Although it may have been described until now that all the components constituting the implementations of the present disclosure are coupled to one or coupled to be operated, the present disclosure is not essentially limited to the implementations. That is, without departing from the purpose of the present disclosure, all the components may be selectively coupled into one or more components to be operated. Furthermore, because the terms, such as “comprising”, “including”, or “having” may mean that the corresponding component may be included unless there is a specially contradictory description, it should be construed that another component is not extruded but may be further included. In addition, unless defined otherwise, all terms used herein, including technical or scientific terms, have the same meanings as those generally understood by those skilled in the art to which the present disclosure pertains. The terms, such as the terms defined in dictionaries, which are generally used, should be construed to coincide with the context meanings of the related technologies, and are not construed as ideal or excessively formal meanings unless explicitly defined in the present disclosure.", "", "The above description is a simple exemplification of the technical spirits of the present disclosure, and the present disclosure may be variously corrected and modified by those skilled in the art to which the present disclosure pertains without departing from the essential features of the present disclosure. Accordingly, the implementations disclosed in the present disclosure is not provided to limit the technical spirits of the present disclosure but provided to describe the present disclosure, and the scope of the technical spirits of the present disclosure is not limited by the implementations. Accordingly, the technical scope of the present disclosure should be construed by the attached claims, and all the technical spirits within the equivalent ranges fall within the scope of the present disclosure."], "claims": ["a driving rotation part configured to rotate about a driving rotation axis that is a rotation axis that extends in a first direction; and a variable rotation part configured to rotate about a variable rotation axis that is variable relative to the driving rotation axis, the variable rotation part being movable relative to the driving rotation part along a direction that is not parallel to the first direction, wherein the variable rotation axis is configured to, based on the variable rotation part moving relative to the driving rotation part, vary relative to the driving rotation axis.", "2 . The wheel assembly of claim 1 , wherein the variable rotation axis extends along the first direction and is configured to overlap the driving rotation axis or to be spaced apart from the driving rotation axis.", "3 . The wheel assembly of claim 1 , wherein the variable rotation part is movable relative to the driving rotation part along a relative movement direction that is perpendicular to the first direction.", "a rotation driving part configured to rotate the driving rotation part along the driving rotation axis; and a variable driving part configured to move the variable rotation part relative to the driving rotation part along the relative movement direction.", "a power transmission part defining the variable rotation axis and configured to receive power from the variable driving part, wherein the variable driving part includes: a variable motor configured to provide a motor rotation axis that extends in the first direction, a first variable link connected to the variable motor and configured to rotate, and a second variable link connected to the power transmission part and configured to rotate, and wherein the first variable link and the second variable link are connected to each other and configured to rotate relative to each other.", "wherein the first variable link includes: a first end being rotatable about the motor rotation axis based on the variable motor being driven; and a second end being rotatable about a motor rotation center that extends along the motor rotation axis, wherein the second variable link includes: a third end being rotatable about the variable rotation axis based on the variable rotation part being moved relative to the driving rotation part; and a fourth end connected to the second end and configured to rotate relative to the second end, the fourth end being rotatable about a variable rotation center that extends along the variable rotation axis, and wherein the first end and the third end are rotatable relative to each other about an end rotation center that extends in the first direction at an area in which the second end and the fourth end are connected to each other.", "a first variable driving part and a second variable driving part that are configured to be driven independently from each other, wherein locations of the first variable driving part and the second variable driving part are fixed relative to the rotation driving part.", "a guide unit extending in a driving radial direction that is perpendicular to the driving rotation axis, the guide unit being configured to guide movement of the variable rotation part along the driving radial direction based on the variable rotation part being moved relative to the driving rotation part.", "a variable disk being rotatable about the variable rotation axis, and a spoke unit connected to the variable disk, wherein the guide unit includes a cylinder having a cylinder hole, the cylinder hole extending in the driving radial direction and being configured to receive the spoke unit, and wherein the spoke unit is configured to be moved along the cylinder hole with respect to the cylinder based on the variable rotation part being moved relative to the driving rotation part.", "wherein the driving rotation part further includes an outer ring part having an annular shape that surrounds the driving rotation axis, and wherein a plurality of cylinders are provided at an inner peripheral surface of the outer ring part and arranged along a driving circumferential direction in which the driving rotation part is rotated.", "wherein the variable rotation axis and the driving rotation axis are spaced apart from each other in the spacing state.", "wherein a spoke circumferential angle that is defined by outer ends of two adjacent spoke units of the plurality of spoke units in a variable radial direction is the same as the cylinder circumferential angle, the variable radial direction being perpendicular to the variable rotation axis.", "a spoke inserted into the cylinder hole and being movable in the driving radial direction relative to the cylinder; and a spoke link having one end connected to the variable disk and an opposite end connected to the spoke, the spoke link being configured to rotate.", "wherein the plurality of spoke units include a first spoke unit and a second spoke unit, wherein one end of a first spoke link of the first spoke unit is fixed to the variable disk, and wherein one end of a second spoke link of the second spoke unit is connected to the variable disk and configured to rotate.", "wherein the second spoke unit is provided as a plurality of second spoke units.", "wherein the guide unit includes a spoke connected to the driving body and extending along the driving radial direction, wherein the variable rotation part includes a variable disk being rotatable about the variable rotation axis and a cylinder unit connected to the variable disk, wherein the cylinder unit includes a cylinder having a cylinder hole, the cylinder hole extending in the driving radial direction and being configured to receive the spoke, and wherein the cylinder is configured to be moved along the driving radial direction with respect to the spoke based on the variable rotation part being moved relative to the driving rotation part.", "wherein a plurality of spokes are provided at an outer peripheral surface of the driving body and arranged along a driving circumferential direction in which the driving rotation part is rotated.", "a cylinder link having one end connected to the variable disk and an opposite end connected to the cylinder, the cylinder link being configured to rotate.", "wherein the plurality of cylinder units include a first cylinder unit and a second cylinder unit, wherein one end of a first cylinder link of the first cylinder unit is fixed to the variable disk, and wherein one end of a second cylinder link of the second cylinder unit is connected to the variable disk and configured to rotate.", "wherein the second cylinder unit is provided as a plurality of second cylinder units."], "bibtex": "@patent{20240239136,\n    title = {WHEEL ASSEMBLY},\n    number = {20240239136},\n    year = {2024},\n    note = {File: US20240239136A1-20240718.XML}\n    }", "classification": "B60B1900FI"}, {"title": "HUB, IN PARTICULAR FOR BICYCLES", "doc_number": "20240239137", "filename": "US20240239137A1-20240718.XML", "abstract": "A bicycle hub with a hub axle, a hub shell, a rotor and a freewheel device, the hub shell rotates with a rotor-side hub bearing, and an outer hub bearing. The rotor rotates with a hub-side rotor bearing disposed closer to the hub shell and an outer rotor bearing further from the hub shell. The freewheel device includes hub-side and rotor-side toothed disk devices, each toothed and biased for engagement with one another. The toothing of the hub-side toothed disk device is axially oriented to the rotor. The rotor-side toothed disk device is accommodated radially within the rotor and is coupled to move with the rotor. The inner diameter of the rotor-side toothed disk device is larger than that of the hub-side rotor bearing. The biasing device includes a coil spring with a winding wire, extending around a spring axis and whose winding ends are disposed diagonally opposite one another.", "detailed_description": ["TheFIGS.1and2illustrate a mountain bike respectively a racing bicycle100which are each equipped with a hub1according to the invention. The mountain bike or racing bicycle100is provided with a front wheel101and a rear wheel102. The hub1according to the invention is used with the rear wheel102. The two wheels101,102comprise spokes109and a rim110and a sprocket assembly111. Basically, conventional caliper brakes or other brakes such as for example disk brakes may be provided.", "", "A bicycle100comprises a frame103, a handlebar106, a saddle107, a fork or suspension fork104and in the case of the mountain bike, a rear wheel damper105may be provided. A pedal crank112with pedals allows for driving. Optionally the pedal crank112and/or the wheels may be provided with an electrical auxiliary drive. The hub1of the wheels may be attached to the frame by means of a clamping mechanism58(for example a through axle or quick release).", "", "The hubs1inserted in the rear wheels102in the bicycles according toFIGS.1and2are shown inFIG.3in perspective, and inFIG.4in a front view.", "", "The hub1comprises a hub shell2and a rotor10, and a brake disk accommodation38. The outer surface of the rotor10is provided with a sprocket accommodation10bto accommodate a sprocket cluster having an appropriate quantity of sprockets. The two ends of the hub1are provided with limit stops50,51, presently shown pushed on, but they may optionally be pushed in or screw-fastened. As can be seen, the limit stops50,51are configured hollow and serve to accommodate a clamping axle59with which to fasten the hub1to the frame.", "", "FIG.5shows the cross section A-A ofFIG.4. The hub1presently has a fitted length25of 148 mm. The hub1comprises the hollow hub axle5, on which the hub shell2is supported for rotation by way of the hub bearings6and7. The rotor10is presently supported for rotation immediately on the hub axle5, likewise by way of the roller bearings16and17.", "", "On the hub axle5, closer to the rotor10, a bulge54with a radial shoulder54ais configured, and at the outer end beneath the hub flange2b, a bulge55with a radial shoulder55ais configured. The rotor-side hub bearing6rests against the radial shoulder54a, and the outer hub bearing7disposed at the other end of the hub shell2rests against the shoulder55aof the hub axle5. Axially outwardly, the limit stop50follows the outer hub bearing7, which is presently pushed onto the hub axle5, and seals the hub shell to the outside by means of a double flange protruding outwardly.", "", "Toward the rotor10, the rotor-side hub bearing6is followed by a (thin, and presently disk-shaped) spacer53and thereafter, by the hub-side rotor bearing16. Between the hub-side rotor bearing16and the outer rotor bearing17, a sleeve52acting as a spacer is pushed onto the hub axle5. Axially outwardly, the limit stop51follows the outer rotor bearing17. The hub1is fixedly clamped into the frame.", "", "The hollow hub axle5shows an inner clear diameter5awhich, depending on the configuration, may be 12 mm, 15 mm, or 16 mm or 17 mm or more. A clamping axle59of a clamping mechanism58can be pushed through the hollow hub axle5for attaching the hub1to the frame of a bicycle. At one of its ends, the clamping axle59may comprise for example an end piece59awith an external thread, with which to screw the clamping axle59into a suitable thread on the frame. At the other of its ends, a corresponding clamping mechanism may be provided, to reliably accommodate and clamp the hub1to a frame.", "", "The outer diameter59bof the clamping axle59and the inner diameter5aof the hollow hub axle5are matched to one another such that on the one hand, a (relatively) unimpeded passage of the clamping axle through the hollow hub axle5is enabled, while on the other hand, the hollow hub axle5can also be supported on the clamping axle59in operation, if the loads applied result in local deflection. In this way, the stability of the hub1on the whole is increased.", "", "Alternately it is also possible to omit this additional support. Then, a clamping axle59is employed, showing a noticeable radial distance between the hub axle5and the clamping axle59over large parts of the hub axle5, to not at all, or to a very minor extent, affect the insertion or removal of the clamping axle.", "", "According to the application, the hub bearings6and7and also the rotor bearings16and17are each configured as roller bearings8, each comprising a plurality of rolling members8. In this exemplary embodiment, all the roller bearings are configured as deep-groove ball bearings.", "", "The hub1is fixedly clamped into the frame in the axial direction. Then, the force flow runs for example from what is the left end inFIG.5, through the limit stop50, the inner bearing ring of the outer hub bearing7, and over the shoulder55aof the bulge55into the hollow hub axle5. From there, the introduced force is guided over the shoulder54aof the bulge54into the inner bearing ring of the hub bearing6and through the spacer53between the rotor-side hub bearing and the hub-side rotor bearing16. From there, the force enters into the inner bearing ring of the hub-side rotor bearing16and is guided over the sleeve52to the inner bearing ring of the outer rotor bearing17and from there through the limit stop51, back into the frame. The hub shell2and the rotor10are radially and axially retained by way of the deep-groove ball bearings.", "", "On the rotor side, the hub shell2has a hub flange2a, and on the other side, a hub flange2b. The spokes can be attached to the hub flanges2a,2b. Opposite the rotor10, the other, outer hub end is provided with the brake disk accommodation38.", "", "Radially within the rotor-side hub flange2a, a threaded ring40is screwed into the hub shell, comprising an inner radial toothing43in which the hub-side toothed disk device30is inserted. On the hub-side end of the rotor10, radially within the end portion60, the rotor-side toothed disk device20of the freewheel device9is inserted. The end portion60extends from the hub-side end60aon the hub-side end face10aaxially outwardly, through to the other, outer end60b.", "", "Both the rotor-side toothed disk device20and the hub-side toothed disk device30comprise an outer radial toothing23,33each, meshing with corresponding inner radial toothings43in the threaded ring40and in the interior of the end portion60. Thus, the rotor-side toothed disk device20and the hub-side toothed disk device30are non-rotatably coupled with the rotor10respectively the hub shell2.", "", "At the same time, both of the toothed disk devices20,30can each be moved in the axial direction between an engagement position E (FIG.5) and a freewheel position F (FIG.11a). Due to the end toothing respectively helical toothing, the oblique tooth faces of the end toothing slip off each other during backpedaling, urging the toothed disk devices20,30apart in the axial direction. When driving force is applied, the end toothings re-engage with one another.", "", "The toothed disk device20is biased by way of the biasing device24, presently in the shape of a cylindrical coil spring, in the engagement position E illustrated. Correspondingly, the toothed disk device30is axially biased in the engagement position E, by way of a biasing device or pre-tensioning device34, which is presently again configured as a cylindrical coil spring. Presently, this means that the hub-side toothed disk device30is biased in the direction toward the rotor, while the rotor-side toothed disk device20is biased in the direction toward the hub shell2, by means of the biasing device or pre-tensioning device24. The action of the biasing device can be effected by means of mechanical springs, or magnetic springs, or pneumatically.", "", "The rotor10comprises a rotor body11, extending from the hub-side end11ato the opposite, outer end11b. On the outer surface of the rotor body11the sprocket accommodation10bis provided. This is where a sprocket or several sprockets, or a sprocket cluster can be attached.", "", "On the hub-side end11a, the end portion60having an enlarged diameter is configured. Inside of the end portion60the rotor-side toothed disk device20is accommodated, which comprises an outer diameter20awhich is larger than the outer diameter10cof the sprocket accommodation10bof the rotor body11. The outer diameter30acorresponds to the outer diameter20a. The axial widths20band30bare likewise identical.", "", "As can be clearly seen inFIG.5, the planes of rolling member respectively planes of cross section3,4extending transversely to an axis defined by the axle each also intersect the toothed disk devices20,30(through the rolling members8aof the rotor-side hub bearing6and the hub-side rotor bearing16). It can be seen that the plane of rolling member respectively plane of cross section4runs through the hub-side rotor bearing16, the biasing device24, and the radial toothing of the rotor-side toothed disk device20, and through the hub flange2aof the hub shell. Furthermore, a sealing unit68disposed radially outwardly on the end portion60is intersected by the plane of cross section respectively plane of rolling member4.", "", "Such a configuration, in which the planes of cross section respectively planes of rolling member3and4intersect the engaging portions of the radial toothings of the two toothed disk devices and each of the assigned roller bearings6,16, offers an optimal transfer of the loads occurring in operation. The distance26of the two rotor bearings16,17may be selected very large, since the rotor-side toothed disk device20is disposed radially outwardly of the hub-side rotor bearing16, surrounding it radially. The distance27of the two hub bearings6,7may likewise be selected very large, since the hub-side toothed disk device30is also disposed radially outwardly of the rotor-side hub bearing6, surrounding it radially.", "", "The clear inner diameters20c,30cof the two toothed disk devices are (considerably) larger than the outer diameters of the pertaining roller bearings6,16. The clear inner diameters20c,30c(seeFIG.6) are considerably larger, since on the outer diameters6b,16b, the roller bearings6,16each support an inner wall18,36of the rotor10respectively the hub shell2, which extend toward one another finger-like beneath the accommodations15,35.", "", "The accommodation15, in which the rotor-side toothed disk device20is non-rotatably received, is configured radially outside of the inner wall18at the rotor. The accommodation35, in which the hub-side toothed disk device30is non-rotatably received on the threaded ring40, is configured radially outside of the inner wall36in the hub shell.", "", "When the mounting width25is for example 148 mm, this structural design allows a distance27of the two hub bearings between 55 mm and 60 mm, and presently specifically for example 57 mm. The distance3aof the two planes of cross section3,4may be very narrow, and may presently be for example 7 mm, 8 mm or 9 mm. The distance26of the two rotor bearings16,17may be between 27 mm and 35 mm, and presently it is for example 32 mm. The distance28may be 18 mm, and the distance29may be 33 mm.", "", "FIG.6ashows the enlarged detail X fromFIG.5. On the hub axle5one can recognize the rotor-side hub bearing6having a width6aand its hub-side rotor bearing16having a width16a, between which a thin spacer53can be seen. The spacer53decouples from one another the two outer bearing rings of the bearings6,16. The width of the spacer53is narrower than half or a quarter or an eighth of the axial width16aof the hub-side rotor bearing16.", "", "The rotor-side hub bearing6supports a wall36of the hub shell2, which extends finger-like and, in particular, wedge-like or tapered toward the rotor10, surrounding the rotor-side hub bearing6radially outwardly. The hub shell2is supported by the wall36. The accommodation35is configured radially around, accommodating the hub-side toothed disk device30. The hub-side toothed disk device30is biased by the biasing device34in the engagement position E.", "", "The toothed disk device30comprises an outer radial toothing33(seeFIG.11b), which meshes with an inner radial toothing43(seeFIG.12a) in the threaded ring40. The threaded ring40is screwed into the internal thread48in the hub shell2by way of the external thread41.", "", "On the hub-side end face10of the rotor10, an accommodation15is configured in which the rotor-side toothed disk device20is accommodated. The rotor-side toothed disk device20comprises an end toothing22oriented to the hub shell. The end toothing22meshes with the end toothing32on the hub-side toothed disk device30. The toothed disk devices20,30are each axially urged to one another by means of the biasing devices24,34.", "", "The holder respectively insert24a, in the accommodation15on the hub-side end face10of the rotor10, enables the use of identical toothed disk devices20,30, to provide for ease of installation, since confusion can be excluded. In terms of manufacturing technique, the accommodation15must be configured enlarged, to allow manufacture of the inner radial toothing13in the end portion60of the rotor10. The conditions in the accommodations15,35are identical.", "", "The axial width33aof the radial toothing33of the hub-side toothed disk device30and the (preferably) identical axial width23aof the radial toothing23of the rotor-side toothed disk device20, may, in particular, be larger than the axial width16aor the axial width6aof the roller bearing6respectively16.", "", "The axial width42of the threaded ring40is larger on the radial outside, since on the rotor side, the threaded ring has a central depression44, which is presently configured as a conical depression respectively chamfer44(seeFIG.12b). This enlarges the thread length of the external thread41, thus increasing the stability.", "", "The engagement body21,31of the rotor-side toothed disk device20and the hub-side toothed disk device30each comprise a radial toothing23,33over an axial length23arespectively33a, which is clearly larger than the radial height22brespectively32bof the end toothing22respectively32. This provides a precise guide for the two toothed disk devices in the axial direction. The axial length21a,31aof the engagement bodies21,31is larger by the axial width of the end toothings.", "", "The threaded ring40may be screw-connected with the hub shell2by means of a multiple thread.FIG.6shows on the top right an optional configuration, wherein two continuous and separate thread grooves41aand41bare screw-connected with corresponding thread grooves49aand49bin the hub shell2.", "", "The sealing device65for sealing the freewheel device9against environmental influences comprises a nearly horizontally configured (outer) narrow sealing gap67having a low radial height respectively clear dimension67aof less than 0.5 mm. The outer sealing gap67extends between an enlarged diameter area63at the end portion60and a radially inwardly protruding wall46at the hub shell2.", "", "From there axially inwardly, a groove62is configured radially outside on the end portion60, which accommodates a sealing unit68with a ring portion69. An elastic sealing lip extends from the ring portion69obliquely outwardly out of the groove62, so that a V-shaped cross section results between the ring portion69and the elastic sealing lip70, which is opened axially outwardly toward the outer sealing gap67. The sealing lip70protrudes into a peripheral groove47(seeFIG.8).", "", "Axially further inwardly, a conical gap66arespectively cone gap follows, having a clear gap width66b. Overall, the sealing device65therefore comprises three sealing gaps, firstly the cone gap66a, then the gap between the elastic sealing lip70and the wall of the sealing groove47in the hub shell, and the outer sealing gap67between the outer wall19in the enlarged diameter area63on the end portion60of the rotor10.", "", "FIG.6aonce again clearly shows that the plane of cross section4extends through the rolling members8aof the hub-side rotor bearing16, through the radial toothing23, and through the sealing unit68, and the rotor-side hub flange2a. The hub-side rotor bearing16supports the inner radial wall18of the rotor body11. On the radial outside thereof, the accommodation15is disposed in which the rotor-side toothed disk device20is non-rotatably accommodated, coupled with the rotor10.", "", "On the top left,FIG.6aadditionally shows a simplistic and perspective view of the coil spring81(or82) of a biasing device24,34of the hub1, which is described in more detail with reference toFIG.6c. At any rate, it can be seen that the coil spring81shows (at least approximately) diagonally opposite winding ends84,85. This enhances, even in unfavorable conditions, the alignment of the toothed disk devices20,30.", "", "The simple structure reliably prevents errors in installation.", "", "FIG.6bshows a schematic side view of a coil spring81,82of a biasing device24,34of the hub1. The two ends84,85of the coil springs81,82shown, terminate offset to one another by (about) 180°, lying diagonally opposite one another, but displaced axially offset to one another along the spring axis83. The coil springs81,82shown each have exactly one winding wire82, extending/being wound around, the spring axis83. Although the winding wire82may extend cylindrically, it may generally assume a (slightly) tapered or conical shape. The configuration shown is cylindrical. The number of windings93may in particular be 2.5 or 3.5 or 4.5 or 5.5. The additional half winding causes the winding ends84,85to be diagonally opposite.", "", "FIG.6balso indicates a projection area89onto a plane90transverse, and in particular perpendicular, to the spring axis83. The (imaginary) projection area89emerges from a projection respectively the “shadow casting” of the coil spring80,81onto the plane90. The projection section84aof the winding end84lies diagonally to the projection section85aof the winding end85. The (imaginary) projection takes place in the direction, respectively in parallel, to the spring axis83.", "", "FIG.6cshows a perspective view of the coil spring80,81, allowing to recognize the diameter92of the winding wire82in comparison to the external diameter91of the coil spring80,81. The relationship shown is between 20 and 30, at about 25.", "", "FIG.6dshows a top view of a coil spring80,81, and thus the afore-mentioned (imaginary) projection area89. The winding ends84,85are drawn in, lying in diagonally opposite triangle segments88respectively87. One triangle segment87is less than 30°, and in particular less than 15°. In the example shown, the angular distance of the two winding ends84,85is 180°.", "", "Additionally shown in broken lines is, another variant of a winding end84, wherein the angle at circumference93drawn in between the winding ends84,85is only approximately 165°. Alternately, measurements may be taken on the other side, so as to show approximately 195°, since the two angles together must add up to 360°.", "", "The configuration of the coil springs80,81achieves an improvement of the freewheeling system. The optimized coil spring allows to achieve a reduction of missed engagements (skips) and a reduction of the risk of missed engagement.", "", "In operation, the biasing devices24,34need to engage in, respectively couple with, one another very fast and precisely. In analyses of problematic missed engagements (skips) it has been found that such a coil spring, when in the compressed state, causes a further improved reaction force. Due to the arrangement of the coil springs in pairs on both the biasing devices24,34, this leads to improved properties. In freewheeling, the biasing devices24,34twist relative to one another. In the worst-case scenario (“worst case position”) the two coil springs80,81are offset180º to one another. In this condition, the new configuration of the coil springs80,81prevents an extremely inhomogeneous force, and improves the engagement behavior.", "", "FIG.7shows a schematic cross section through the rotor body11of the rotor10, which extends from the hub-side end11atoward the outer end11b. On the outer surface of the rotor body11, the sprocket accommodation10bis provided, showing an outer diameter10cwhich is smaller than the diameter of the inner radial toothings13on the accommodation15for the rotor-side toothed disk device20.", "", "The enlarged diameter area63, which provides a wall of the sealing gap67, is located on the end portion60. The sealing unit68can be disposed in the peripheral groove62. On the hub-side end11a, the conical portion11cis configured, forming, together with the conical depression44on the threaded ring40, the inner sealing gap66respectively cone gap66a. On the radial inside, the inner radial wall18can be seen, against which the rotor10is supported on the hub-side rotor bearing16.", "", "FIG.8shows an enlarged detail of a variant ofFIG.6, wherein, unlike the configuration according toFIG.5, identically sized roller bearings6,16(with identical widths8b) are used as the hub-side rotor bearing16and the rotor-side hub bearing6. This further facilitates installation and storage, since the quantity of different parts is further reduced. Again, the rotor-side toothed disk device20is accommodated in the accommodation15of the rotor body11. The inner radial toothing13on the outer wall19guides the radial toothing23of the rotor-side toothed disk device20in the axial direction. The biasing device24urges the end toothing22in the direction toward the hub shell.", "", "The outer diameter70aof the elastic sealing lip70is larger than the outer diameter61of the outer sealing gap67. This results in that water penetrating axially through the sealing gap67causes deformation of the sealing lip70, so that it rests (more forcefully) against the wall of the sealing groove47, obtaining a still higher sealing effect.", "", "The central plane of cross section20d(central plane of toothed disk) through the radial toothing23of the rotor-side toothed disk is only distant by a slight distance4bfrom the plane of cross section4(plane of rolling member) through the rolling members8aof the hub-side rotor bearing16. The distance4bbetween the planes of cross section20dand4is, in particular, less than half the diameter respectively the radius of a rolling member8, and particularly preferably it is also less than the smallest wall thickness of the hollow hub axle5. This applies accordingly for the central plane of cross section30dthrough the axial center of the radial toothing of the rotor-side toothed disk device30. Again, the distance3bbetween the two planes of cross section3(plane of rolling member) and30d(central plane of toothed disk) is very small and, in particular, smaller than half the diameter or half the radius of a rolling member8aof the rotor-side hub bearing6.", "", "The central plane of cross section20dthrough the radial toothing23intersects the rolling members8aof the hub-side rotor bearing16. The central plane of cross section30dthrough the radial toothing33also intersects the rolling members8aof the rotor-side hub bearing6. This effectively allows transferring the highest forces. The distances3band4bare very small and smaller than half the diameter8cor even half the radius of the rolling members8a.", "", "FIG.9shows a modification of the rotor10, presently consisting of two rotor parts12and14. The rotor body11comprises a first rotor part12, which provides the sprocket accommodation10b. Furthermore the wall37is configured on the first rotor part12, by means of which wall the rotor10is supported on the hub axle5by way of the outer rotor bearing17. The inner radial wall18is configured on the second rotor part14, by means of which wall the rotor10is supported on the hub-side rotor bearing16for rotation around the hub axle5.", "", "The second rotor part14is screw-connected with the first rotor part12. To provide aligned guiding and concentric running, which is, in particular, important for the rotor, the first rotor part12and the second rotor part14each comprise a connecting area121(FIG.10) and a connecting portion141. The connecting area121comprises a threaded area122and a guiding area123. The connecting portion141comprises a threaded portion142and a guiding portion143. The guiding portion143has a diameter145.", "", "A length141aof the connecting portion141of the second rotor part14, in particular, corresponds to at least ¼ or ⅓ of the length14aof the second rotor part14, in particular, between a quarter and half of the length of the rotor body11.", "", "The ratio of the length143aof the guiding portion143to the diameter145of the guiding portion143is higher than 1:10. Preferably, the ratio of the length143aof the guiding portion143to the length141aof the connecting portion141is higher than 1:4.", "", "In the installed condition, the threaded area122and the threaded portion142are screw-connected. The required centering is effected by the guiding area123and the guiding portion143. The radial tolerance in the guiding portion143is less than the radial tolerance between the threaded area122and the threaded portion142.", "", "FIG.10shows the interaction of the connecting area121and the connecting portion141in an enlarged, schematic illustration. The connecting area121extends over a length121a, which is composed of the length122aof the threaded area122and the length123aof the guiding area123.", "", "Accordingly, a connecting portion141is configured on the second rotor part14, extending over a length141a. The connecting portion141is composed of the threaded portion142and the guiding portion143, which extend over a length142arespectively143a. The threaded area122(respectively the threaded portion142) has a narrower tolerance148than does the screw-connected guiding area123(respectively guiding portion143) having a tolerance147. This provides high precision and repeatability of the radial orientation of the rotor10.", "", "FIGS.11aand11bshow the toothed disk devices20,30, presently identical, each having an engagement body21,31and an end toothing22,32, and an outer radial toothing23,33. The outer radial toothings23,33extend in the axial direction over an axial length23a,33a. The axial extension21a,31aof the engagement bodies21,31is, at least by the axial width of the end toothings22,32, larger than the axial length23a,33aof the outer radial toothings23,33. The clear inner diameter20cis larger than the outer diameter of the roller bearings6,16. The outer diameter22a,32ais larger than the outer diameter10cof the sprocket accommodation10b.", "", "The number of teeth of the end toothing is preferably higher than 72, and it may be 90, 100, 110 or 120 or more.", "", "The outer radial toothings23,33of the toothed disk devices20,30and the inner radial toothings13,43preferably have between 20 and 60 radial teeth. In this exemplary embodiment, the toothed disk devices20,30comprise approximately 36 radial teeth.", "", "The radial extension22b,32bof the end toothings22,32is less than the axial length23a,33aof the radial toothings23,33.", "", "TheFIGS.12a,12band12cshow variants of the threaded ring40, each comprising an axial width42, and on the outer periphery, comprising a preferably multiple thread, with which to screw the threaded ring into a corresponding thread in the hub shell2.", "", "At the rotor-side end40aof the threaded ring40, a central depression44, presently in the shape of a chamfer respectively conical depression44, is configured running at an angle44aof for example 30° and comprising a depth44b.", "", "The threaded ring40, when properly mounted, is screwed into the hub shell2. The hub-side toothed disk device30of the freewheel device9is accommodated therein. The end toothing32faces in the direction of the rotor10and is biased in the engagement position (E) by means of a biasing device24.", "", "The threaded ring40has an outer contour41dwith an external thread41, and comprises a central through hole40cwith an inner contour40d. The inner contour40dcomprises a non-round inner coupling contour43b, which is non-rotatably coupled in the driving direction with a matching non-round outer coupling contour33bon the outer periphery33cof the hub-side toothed disk device30. The inner coupling contour43bmay extend over the entire length or only part of the length of the inner contour40d.", "", "The threaded ring40has a central depression44at the rotor-side end40a, so that the external thread41on the threaded ring40extends in the direction to the rotor10axially further outwardly than does the inner coupling contour43b. This widens the external thread41of the threaded ring40in the direction toward the rotor10. An improved accommodation of the threaded ring40in the hub shell2is possible. The strength is improved. The external thread41is extended.", "", "Thus, the axial length41cof the external thread41is larger than the axial length33aof the coupling structure, which comprises the inner coupling contour43band the outer coupling contour33b. The threaded ring40is screwed into the internal thread48of the hub shell2by means of the external thread41.", "", "The hub-side toothed disk device30is accommodated radially within the threaded ring40by way of the coupling structure33b,43b, non-rotatably in the driving direction and axially movable. At the rotor-side end40a, the threaded ring40has a central, and presently centered, depression44. The axial width41cof the external thread41is wider than the axial width33aof the coupling structure.", "", "In the variant according toFIG.12b, the central depression44is configured as a conical depression. In all the exemplary embodiments, the depression44has an axial depth44bof at least 5% (and, in particular, at least 10%) of the axial width42of the threaded ring40. The axial length41cof the outer contour41dof the threaded ring40is larger than the axial length43aof the inner radial toothing43(which is the inner coupling contour43b).", "", "The axial depth44bof the central depression44is between 5% and 25% of the axial width42of the threaded ring40, and preferably between 10% and 20% of the axial width42of the threaded ring40. The axial depth44bof the central depression44is preferably between 0.5 mm and 3 mm.", "", "In all the configurations, the central depression44may be stepped and for example configured as a stepped depression44d, as is for example indicated in broken lines inFIG.12b. Also possible is, a stepped and conical configuration. Preferably, the central depression44is configured conical or convex as a centric chamfer. An angle or cone angle44aof the (conical) depression44to a plane transverse to the axis of symmetry of the hub or hub axle, is, in particular, between 5° and 30°.", "", "In the exemplary embodiment, the inner coupling contour43bcomprises, or is configured as, an inner radial toothing43on the threaded ring40. The outer coupling contour33bon the hub-side toothed disk device30comprises, or is configured as, an outer radial toothing33. In the mounted condition, a conical portion11cconfigured on the end face10aof the rotor10, plunges contactless into the central depression44on the threaded ring40. A sealing gap is configured in-between.", "", "At the other end40b, a conical support portion45may be configured (seeFIG.12c), extending at the conical angle45a(for example 30°). Such a conical support portion45allows saving axial mounting space. Alternately it is possible to configure the support portion45perpendicular to the axis of symmetry. This facilitates manufacture.", "", "Overall, an advantageous hub1which is simple in structure is provided. The hub1is easy to assemble and comprises a relatively small number of parts. High stability is achieved. A high number of teeth of the end toothing can provide a very narrow engagement angle.", "", "The configuration of the rotor-side toothed disk device20in the accommodation15in the rotor provides a compact hub1, in which the rotor-side toothed disk device20is guided in the inner radial toothing13of the rotor. This provides a high quality, axial guiding. The large diameter of the radial toothing and thus of the axial guide prevents tilting and jamming and provides for a reliable function.", "", "While a particular embodiment of the present hub, in particular for bicycles have been described herein, it will be appreciated by those skilled in the art that changes and modifications may be made thereto without departing from the invention in its broader aspects and as set forth in the following claims.", "", "List of reference numerals:1hub148tolerance of 143/1232hub shell15accommodation2ahub flange16hub-side rotor bearing2bhub flange16aaxial width3plane of cross section,16bexternal diameterplane of rolling member17outer rotor bearing3adistance of 3, 418inner radial wall3bdistance 3, 30d19outer wall4plane of cross section,20rotor-side toothed diskplane of rolling memberdevice4bdistance 4, 20d20aexternal diameter5hub axle20baxial width5athrough hole20cclear inner diameter6rotor-side hub bearing20dcentral plane of cross6aaxial widthsection6bexternal diameter21engagement body7outer hub bearing21aaxial extension8roller bearing22end toothing8arolling member22aexternal diameter8baxial width22bradial height8cdiameter 8a23radial toothing9freewheel device23aaxial length10rotor24biasing device10ahub-side end face24aholder10bsprocket accommodation25fitted length10couter diameter 10b26, 27bearing distance11rotor body28distance11ahub-side end29distance11bouter end30hub-side toothed disk11cconical portiondevice12first rotor part30aexternal diameter121connecting area30baxial width121alength of 12130cclear inner diameter122threaded area30dcentral plane of cross122alength of 122section123guiding area31engagement body123alength of 12331aaxial extension13inner radial toothing32end toothing14second rotor part32bradial height141connecting portion33radial toothing141alength of 14133aaxial length142threaded portion33bouter coupling contour142alength of 14233couter periphery143guiding portion34biasing device143alength of 14335accommodation145diameter of 14336inner wall147tolerance of 142/12237wall38brake disk62grooveaccommodation63enlarged diameter area40threaded ring65sealing device40arotor-side end, axially66inner sealing gapouter surface66acone gap40bhub-side end, axially66bclear gap widthinner surface67outer sealing gap40ccentral through hole67aclear dimension40dinner contour of 4068sealing unit41external thread69ring portion41a, bthread groove70sealing lip/elastic41caxial lengthwall41douter contour70aexternal diameter42axial width100bicycle43inner radial toothing101wheel, front wheel43aaxial length102wheel, rear wheel43binner coupling contour103frame44central depression,104fork, suspension forkconical depression105rear wheel damper44aangle106handlebar44bdepth107saddle44cheight109spoke44dstepped depression110rim45(conical) support111sprocket assemblyportion112pedal crank45aangleFfreewheeling position46sealing wallEengagement position47sealing groove47adiameter48thread in 249a, bthread groove50, 51limit stop52sleeve body53spacer54, 55radial bulges54ashoulder55ashoulder56accommodating contour(conical)58clamping mechanism59clamping axle59aend piece59bdiameter60end portion60ahub-side end (60)60bother end of 6061diameter"], "claims": ["wherein the hub shell is supported for rotation with at least two axially spaced apart hub bearings, namely, at least one rotor-side hub bearing disposed closer to the rotor and at least one outer hub bearing further distant from the rotor; and wherein the rotor is supported for rotation with at least two axially spaced apart rotor bearings, namely, one hub-side rotor bearing disposed closer to the hub shell and at least one outer rotor bearing further distant from the hub shell; and wherein the freewheel device comprises a hub-side toothed disk device coupled with the hub shell, and a rotor-side toothed disk device interacting therewith and coupled with the rotor, each comprising an end toothing to engage with one another, and biased to an engagement position (E) by means of at least one biasing device, wherein the end toothing of the hub-side toothed disk device is axially oriented to the rotor; and wherein the rotor-side toothed disk device is accommodated radially within the rotor, and by way of an outer radial toothing with an inner radial toothing in the rotor is coupled with the rotor in a rotationally fixed manner in the driving direction, and wherein the end toothing of the rotor-side toothed disk device is axially oriented to the hub shell; and wherein the clear inner diameter of the rotor-side toothed disk device is larger than the outer diameter of the hub-side rotor bearing, the biasing device comprises at least one coil spring with a winding wire, which extends around a spring axis and whose winding ends are disposed inside of diagonally opposite triangle segments.", "2 . The hub according to claim 1 , wherein the projection sections of the winding ends are disposed on an imaginary projection area of the coil spring in diagonally opposite triangle segments of the projection area, wherein each of the triangle segments extends over an angular range of less than 30°.", "3 . The hub according to claim 2 , wherein the imaginary projection area of the coil spring is defined by projecting the coil spring in the direction toward the spring axis onto a plane transverse to the spring axis.", "4 . The hub according to claim 1 , wherein each of the triangle segments extends over an angular range of less than 15° or 5°.", "5 . The hub according to claim 1 , wherein the angle at circumference between the winding ends is between 135° and 225°.", "6 . The hub according to claim 1 , wherein the angle at circumference between the winding ends is between 150° and 210°.", "7 . The hub according to claim 1 , wherein the winding ends are ground.", "8 . The hub according to claim 1 , wherein the number of full turns is between two and seven.", "9 . The hub according to claim 1 , wherein the relationship of the external diameter of the coil spring to the diameter of the winding wire is more than 10 or more than 20.", "and wherein the rotor-side toothed disk device, the hub-side rotor bearing, and a rotor-side hub flange on the hub shell, are located on a shared plane of cross section transverse to the longitudinal extension of the hub axle.", "and wherein both the hub-side toothed disk device and the rotor-side toothed disk device can be transferred from an engagement position (E) to a freewheel position (F), each against the biasing force of at least one biasing device.", "and wherein the inner radial toothing, with which the outer radial toothing of the hub-side toothed disk device interacts, is configured on a threaded ring screwed into the hub shell.", "13 . The hub according to claim 1 , wherein at least one toothed disk device comprises an engagement body, on which the end toothing is configured over a radial height, and the radial toothing is configured over an axial length, wherein the axial length is larger than the radial height.", "14 . The hub according to claim 1 , wherein the distance of the two planes of cross section is smaller than the axial width of both the toothed disk devices in the engaged position of the threaded ring.", "15 . The hub according to claim 1 , wherein the hub-side toothed disk device and the rotor-side toothed disk device are configured substantially the same.", "and wherein both the biasing devices are configured substantially the same."], "bibtex": "@patent{20240239137,\n    title = {HUB, IN PARTICULAR FOR BICYCLES},\n    number = {20240239137},\n    year = {2024},\n    note = {File: US20240239137A1-20240718.XML}\n    }", "classification": "B60B2702FI"}, {"title": "Wheel of a single or double caster for furniture", "doc_number": "20240239138", "filename": "US20240239138A1-20240718.XML", "abstract": "A wheel for a single or double caster for furniture or hospital beds or medical equipment, the wheel comprising: a rim; a tire; and a wheel bearing centrally arranged in the rim, wherein a running surface of the tire envelops the rim, and wherein the running surface of the tire includes a plurality of bonded spokes which are at least in contact the wheel bearing. The wheel is producible in a simple manner with short cycle times while having good thermal conductivity.", "detailed_description": ["A wheel is designated overall with reference numeral10in the drawing figures. The wheel10is formed by a tire11, a rim12and a wheel bearing13. The rim is made from a harder synthetic material, whereas the tire is made from a softer synthetic material with added steel fibers.", "", "FIGS.1and3respectively show a tire11, including a running surface14, seven spokes15and an inner ring16that is used for arranging the wheel bearing13.", "", "It is evident in particular fromFIG.2that the wheel bearing13is formed from an inner bearing race17and an outer bearing race18and balls19and an axle receiver20.", "", "The tire11is produced in a first injection molding tool S (cf.FIGS.7-12) in the embodiment described supra, wherein the wheel bearing13is initially inserted into the injection molding tool. After completion of the injection molding process a cooling is performed until the tire11is retrieved from the injection molding tool S so that the tire can be inserted into a second injection molding tool to produce the rim12and thus the entire wheel10.", "", "Cross section increases21provided on both sides of the spokes15are important for producing the rim12in the second injection molding tool wherein the cross section increases provide retaining points for the spokes15during production of the rim12. These cross section increases or indentations21in a spoke15assure that the spokes15are arranged straight in the rim12even after encasing the spokes15by injection molding.", "", "FIGS.4and5show the two top views of the finished wheel10from different sides, the wheel including a tire11, a rim12, and a wheel bearing13. It is evident that the running surface14runs about an outside of the rim12and that the spokes15besides the faces of the thickened cross sections21are encased by injection molding. Eventually the injection molding step of the rim12fixes the wheel bearing13in the wheel10.", "", "FIG.6shows a central sectional view of the wheel10according to the sectional lines VI-VI inFIG.4.", "", "FIGS.7-12show the first injection molding step for producing the tire11in various steps in top views of the injection molding tool S.", "", "Starting from one or plural injection points, a cavity V of the illustrated injection molding tool S is initially filled in the portion of the inner ring16(cf.FIG.7) wherein frontal flow areas F of the liquid synthetic material evenly move outward through the spokes15in an outward direction (cf.FIG.8).", "", "FIGS.9-12show a two-sided progression of two flow fronts F of the liquid synthetic material K in the portion of the cavity V for the running surface15starting at each spoke15so that the seven flow fronts F of the liquid synthetic material K join in the portion of the running surface14after completion of the injection molding step and form binding seams B at the joints.", "", "The inventors have found that the steel fibers are radially oriented in the portion of the binding seams B so that the running surface14has a higher thermal conductivity in these portions."], "claims": ["a rim; a tire; and a wheel bearing centrally arranged in the rim, wherein a running surface of the tire envelops the rim, and wherein the running surface of the tire includes a plurality of bonded spokes which are in contact with or bonded to the wheel bearing.", "2 . The wheel according to claim 1 , wherein the spokes are connected by an inner ring that at least partially envelops the wheel bearing.", "3 . The wheel according to claim 1 , wherein the tire includes at least one respective double sided cross section increase in a portion of each spoke forming a support point for the spoke during fabrication of the rim.", "4 . The wheel according to claim 1 , wherein a material of the tire includes additives improving thermal conductivity of the wheel bearing and the running surface.", "inserting the wheel bearing into a cavity of a first synthetic material injection molding tool in order to perform the first injection molding step; performing the first injection molding step including fabricating the tire including the running surface and a plurality of spokes that contact the wheel bearing; cooling the tire fabricated in the first injection molding step; extracting the tire from the first synthetic material injection molding tool using a transport device adapted to a shape of the tire; transporting the tire into a cavity of a second synthetic material injection molding tool in order to perform a second injection molding step; performing the second injection molding step including producing the rim; and cooling the wheel and retrieving the wheel from the second synthetic material injection molding tool.", "6 . The method according to claim 5 , wherein the tire is produced in the first synthetic material injection molding tool by a plurality of injection points arranged at an edge of the wheel bearing inserted into the first synthetic material injection molding tool.", "at least one cavity for a running surface of the tire, wherein the at least one cavity includes additional portions configured for producing a plurality of spokes.", "8 . The injection molding tool according to claim 7 , wherein the additional portions that produce the plurality of the spokes are connected with another partial cavity that produces a ring that partially envelops a wheel bearing."], "bibtex": "@patent{20240239138,\n    title = {Wheel of a single or double caster for furniture},\n    number = {20240239138},\n    year = {2024},\n    note = {File: US20240239138A1-20240718.XML}\n    }", "classification": "B60B3300FI"}, {"title": "Retractable Furniture Caster System", "doc_number": "20240239139", "filename": "US20240239139A1-20240718.XML", "abstract": "An example article of furniture includes a number of furniture legs having mechanically coupled thereto a respective furniture caster having a rolling component. The furniture casters are movable between (i) an extended position in which their rolling components at least partially extend below bottom surfaces of the furniture legs and (ii) a retracted position in which their rolling components are positioned entirely above the bottom surfaces of the furniture legs. Push-pull cables are mechanically coupled to the furniture casters, and at least one actuator is mechanically coupled to the push-pull cables. When actuated, the actuator applies a pushing force to the push-pull cables, thereby causing the furniture casters to transition from the retracted position to the extended position. When the actuator is not actuated, the pushing force is removed from the push-pull cables, thereby causing the furniture casters to transition from the extended position to the retracted position.", "detailed_description": ["As noted above, disclosed herein is new technology for providing improved mobility to an article of furniture. Existing techniques for improving the mobility of furniture may involve affixing a set of casters to the legs of the furniture. However, this technique may negatively impact the design aesthetic of the furniture. For instance, some consumers may find the visual appearance of casters to be unappealing. To help address these or other issues, the technology disclosed herein is directed toward a retractable furniture caster system that allows the casters to transition to an extended position for rolling on the ground when it is desirable to move the furniture to a new location, and allows the casters to transition to a retracted position when it is no longer desirable to move the furniture. While in the retracted position, the casters may be out of sight so that they do not affect the design aesthetic of the furniture.", "", "The following disclosure makes reference to the accompanying figures and several example embodiments. One of ordinary skill in the art should understand that such references are for the purpose of explanation only and are therefore not meant to be limiting. Part or all of the disclosed systems, devices, and methods may be rearranged, combined, added to, and/or removed in a variety of manners, each of which is contemplated herein."], "claims": ["a plurality of furniture caster assemblies, each furniture caster assembly of the plurality of furniture caster assemblies respectively comprising: a housing comprising (i) one or more side walls defining an interior space of the housing and (ii) a foot extending from at least one side wall of the one or more side walls to create an opening of the housing; a furniture caster comprising a caster block and at least one rolling component, wherein the furniture caster is positioned at least partially within the interior space of the housing and movable between (i) a retracted position in which the at least one rolling component is positioned within the interior space of the housing and (ii) an extended position in which the at least one rolling component at least partially extends outside of the interior space of the housing via passing through the opening of the housing, wherein the caster block is unable to pass through the opening of the housing, thereby preventing the furniture caster from extending beyond the extended position; and a push-pull cable mechanically coupled to the furniture caster; and at least one actuator mechanically coupled to the push-pull cables, wherein the at least one actuator is configured to (i) when actuated, apply a pushing force to the push-pull cables, thereby causing the furniture casters to transition from the retracted position to the extended position and (ii) when not actuated, remove the applied pushing force from the push-pull cables, thereby causing the furniture casters to transition from the extended position to the retracted position.", "2 . The system of claim 1 , wherein the at least one rolling component comprises a roller ball or a wheel.", "3 . The system of claim 1 , wherein the at least one actuator comprises a single actuator mechanically coupled to each of the push-pull cables.", "4 . The system of claim 1 , wherein the at least one actuator comprises a handle, and wherein actuating the at least one actuator comprises actuating the handle.", "5 . The system of claim 1 , wherein the opening of the housing is larger than the at least one rolling component and smaller than the caster block.", "6 . The system of claim 1 , wherein the push-pull cable comprises an outer conduit and a cable, and wherein the furniture caster further comprises a cable receiver block.", "7 . The system of claim 6 , wherein the outer conduit of the push-pull cable is fixed to the furniture caster, and wherein the cable of the push-pull cable extends through the cable receiver block to mechanically couple to the furniture caster.", "8 . The system of claim 1 , wherein the housing is configured to mechanically couple to a respective furniture leg of an article of furniture comprising a plurality of furniture legs.", "9 . The system of claim 8 , wherein the housing is configured to be at least partially inserted into an interior portion of the respective furniture leg.", "10 . The system of claim 8 , wherein, for each respective furniture caster assembly of the plurality of furniture caster assemblies, (i) the housing of the respective furniture caster assembly is coupled to a respective furniture leg of the plurality of furniture legs of the article of furniture, the respective furniture leg comprising a respective bottom surface configured to interface with a floor or ground surface, (ii) while the furniture caster of the respective furniture caster assembly is in the extended position, the at least one rolling component of the respective furniture caster assembly at least partially extends below the respective bottom surface of the furniture leg, and (iii) while the furniture caster of the respective furniture caster assembly is in the retracted position, the at least one rolling component of the respective furniture caster assembly is positioned entirely above the respective bottom surface of the furniture leg.", "11 . The system of claim 8 , wherein the article of furniture comprises an underside from which the plurality of furniture legs extends, and wherein the at least one actuator is configured to mechanically couple to the underside of the article of furniture.", "12 . The system of claim 8 , wherein each of the push-pull cables of the plurality of furniture caster assemblies is configured to be routed through a respective interior portion of a respective furniture leg of the article of furniture.", "a housing comprising (i) one or more side walls defining an interior space of the housing and (ii) a foot extending from at least one side wall of the one or more side walls to create an opening of the housing; a furniture caster comprising a caster block and at least one rolling component, wherein the furniture caster is positioned at least partially within the interior space of the housing and movable between (i) a retracted position in which the at least one rolling component is positioned within the interior space of the housing and (ii) an extended position in which the at least one rolling component at least partially extends outside of the interior space of the housing via passing through the opening of the housing, wherein the caster block is unable to pass through the opening of the housing, thereby preventing the furniture caster from extending beyond the extended position; and a push-pull cable mechanically coupled to the furniture caster and configured to be mechanically coupled to at least one actuator for causing the furniture caster to transition between the retracted position and the extended position.", "14 . The system of claim 13 , wherein the opening of the housing is larger than the at least one rolling component and smaller than the caster block.", "15 . The system of claim 13 , wherein the push-pull cable comprises an outer conduit and a cable, and wherein the furniture caster further comprises a cable receiver block.", "16 . The system of claim 15 , wherein the outer conduit of the push-pull cable is fixed to the furniture caster, and wherein the cable of the push-pull cable extends through the cable receiver block to mechanically couple to the furniture caster.", "a plurality of furniture legs each comprising a respective bottom surface configured to interface with a floor or ground surface; a plurality of furniture caster assemblies, each furniture caster assembly of the plurality of furniture caster assemblies respectively comprising: a housing comprising (i) one or more side walls defining an interior space of the housing and (ii) a foot extending from at least one side wall of the one or more side walls to create an opening of the housing; a furniture caster comprising a caster block and at least one rolling component, wherein the furniture caster is positioned at least partially within the interior space of the housing and movable between (i) a retracted position in which the at least one rolling component is positioned within the interior space of the housing and (ii) an extended position in which the at least one rolling component at least partially extends outside of the interior space of the housing via passing through the opening of the housing, wherein the caster block is unable to pass through the opening of the housing, thereby preventing the furniture caster from extending beyond the extended position; and a push-pull cable mechanically coupled to the furniture caster; and at least one actuator mechanically coupled to the push-pull cables, wherein the at least one actuator is configured to (i) when actuated, apply a pushing force to the push-pull cables, thereby causing the furniture casters to transition from the retracted position to the extended position and (ii) when not actuated, remove the applied pushing force from the push-pull cables, thereby causing the furniture casters to transition from the extended position to the retracted position.", "18 . The article of furniture of claim 17 , wherein the housing is configured to mechanically couple to a respective furniture leg of the plurality of furniture legs.", "19 . The article of furniture of claim 18 , wherein, for each respective furniture caster assembly of the plurality of furniture caster assemblies, (i) the housing of the respective furniture caster assembly is coupled to a respective furniture leg of the plurality of furniture legs of the article of furniture, (ii) while the furniture caster of the respective furniture caster assembly is in the extended position, the at least one rolling component of the respective furniture caster assembly at least partially extends below the respective bottom surface of the furniture leg, and (iii) while the furniture caster of the respective furniture caster assembly is in the retracted position, the at least one rolling component of the respective furniture caster assembly is positioned entirely above the respective bottom surface of the furniture leg.", "20 . The article of furniture of claim 17 , wherein the push-pull cable comprises an outer conduit and a cable, wherein the furniture caster further comprises a cable receiver block, wherein the outer conduit of the push-pull cable is fixed to the furniture caster, and wherein the cable of the push-pull cable extends through the cable receiver block to mechanically couple to the furniture caster."], "bibtex": "@patent{20240239139,\n    title = {Retractable Furniture Caster System},\n    number = {20240239139},\n    year = {2024},\n    note = {File: US20240239139A1-20240718.XML}\n    }", "classification": "B60B3306FI"}, {"title": "Steel Cord for Tire Belt Ply Reinforcement", "doc_number": "20240239140", "filename": "US20240239140A1-20240718.XML", "abstract": "A steel cord for tire belt ply reinforcement includes a cord formed by periodically twisting n wires, wherein the n wires are compressed by rolling, and at least one of the n wires is compressed into a non-circular shape, when n is an odd number, a cross-section of one wire from among the n wires is circular due to rolling, and cross-sections of n−1 wires from among the n wires are non-circular, and when n is an even number, cross-sections of two wires from among the n wires are circular due to rolling, and cross-sections of n−2 wires from among the n wires are non-circular due to rolling.", "detailed_description": [""], "claims": ["a cord formed by periodically twisting n wires, wherein the n wires are compressed by rolling, and at least one of the n wires is compressed into a non-circular shape, when n is an odd number, a cross-section of one wire from among the n wires is circular due to the rolling, and cross-sections of n−1 wires from among the n wires are non-circular, and when n is an even number, cross-sections of two wires from among the n wires are circular due to the rolling, and cross-sections of n−2 wires from among the n wires are non-circular due to the rolling.", "a ratio of a minor axis of the second wire to a diameter of the first wire is about 0.70 to about 0.98.", "3 . The steel cord of claim 2 , wherein the number (n) of the wires is 3 to 9.", "4 . The steel cord of claim 2 , wherein the diameter of the first wire is about 0.1 mm to about 0.6 mm.", "a first strength (normal tensile, NT) is defined as 3,200−2,000×d (mm)+200 (MPa), a second strength (high tensile, HT) is defined as 3,500−2,000×d (mm)+200 (MPa), a third strength (super tensile, ST) is defined as 3,850−2,000×d (mm)+200 (MPa), a fourth strength (ultra tensile, UT) is defined as 4,200−2,000×d (mm)+200 (MPa), a fifth strength (mega tensile, MT) is defined as 4,600−2,000×d (mm)+200 (MPa), and a tensile strength of the wires before the rolling is one of the second strength, the third strength, the fourth strength, and the fifth strength.", "6 . The steel cord of claim 5 , wherein, the wires having a tensile strength of an n-th strength before the rolling are rolled to have a tensile strength of an n−1-th strength."], "bibtex": "@patent{20240239140,\n    title = {Steel Cord for Tire Belt Ply Reinforcement},\n    number = {20240239140},\n    year = {2024},\n    note = {File: US20240239140A1-20240718.XML}\n    }", "classification": "B60C900FI"}, {"title": "SOUNDPROOF TYRE FOR VEHICLE WHEELS", "doc_number": "20240239141", "filename": "US20240239141A1-20240718.XML", "abstract": "The present invention relates to a soundproof tyre for vehicle wheels comprising a noise reducing element made by vulcanising a vulcanisable and expandable elastomeric compound comprising at least one elastomeric polymer, at least one expanding agent, and at least one compound selected from the group of (i) fatty acid amides and (ii) polymers and copolymers of caprolactone, lactic acid, glycolic acid, and mixtures thereof.", "detailed_description": ["The soundproof tyre according to the present invention may exhibit at least one of the following preferred features, taken individually or in combination with the others.", "", "The vulcanisable and expandable elastomeric compound of the noise reducing element according to the present invention may comprise (i) at least one natural or synthetic diene elastomeric polymer derived from the polymerisation of one or more monomers, at least one of which is a conjugated diene, or (ii) at least one elastomeric polymer of one or more monoolefins with an olefinic comonomer or derivatives thereof.", "", "The synthetic diene elastomeric polymer may be obtained by solution polymerisation, emulsion polymerisation or gas phase polymerisation of at least one conjugated diene, optionally mixed with at least one comonomer selected from monovinylarenes and/or polar comonomers in an amount not exceeding 60% by weight.", "", "The conjugated dienes generally contain from 4 to 12, preferably from 4 to 8 carbon atoms and may be selected, for example, from the group comprising: 1,3-butadiene, isoprene, 2,3-dimethyl-1,3-butadiene, 1,3-pentadiene, 1,3-hexadiene, 3-butyl-1,3-octadiene, 2-phenyl-1,3-butadiene and mixtures thereof. 1,3-butadiene and isoprene are particularly preferred.", "", "Monovinylarenes, which may optionally be used as comonomers, generally contain from 8 to 20, preferably from 8 to 12 carbon atoms and may be selected, for example, from: styrene; 1-vinylnaphthalene; 2-vinylnaphthalene; various alkyl, cycloalkyl, aryl, alkylaryl or arylalkyl derivatives of styrene, such as, for example, α-methylstyrene, 3-methylstyrene, 4-propylstyrene, 4-cyclohexylstyrene, 4-dodecylstyrene, 2-ethyl-4-benzylstyrene, 4-p-tolyl-styrene, 4-(4-phenylbutyl)styrene, and mixtures thereof. Styrene is particularly preferred.", "", "Polar comonomers that may optionally be used, may be selected, for example, from: vinylpyridine, vinylquinoline, acrylic acid and alkylacrylic acid esters, nitriles, or mixtures thereof, such as, for example, methyl acrylate, ethyl acrylate, methyl methacrylate, ethyl methacrylate, acrylonitrile and mixtures thereof.", "", "Preferably, the diene elastomeric polymer which may be used in the present invention may be selected, for example, from among: cis-1,4-polyisoprene (natural or synthetic, preferably natural rubber), 3,4-polyisoprene, polybutadiene (in particular polybutadiene with a high content of 1,4-cis), isoprene/isobutene copolymers, 1,3-butadiene/acrylonitrile copolymers, styrene/1,3-butadiene copolymers, styrene/isoprene/1,3-butadiene copolymers, styrene/1,3-butadiene/acrylonitrile copolymers, and mixtures thereof.", "", "Monoolefins may be selected from: ethylene and α-olefins generally containing 3 to 12 carbon atoms, such as for example propylene, 1-butene, 1-pentene, 1-hexene, 1-octene or mixtures thereof. The following are preferred: copolymers selected from ethylene and an α-olefin, optionally with a diene; isobutene homopolymers or copolymers thereof with small amounts of a diene, which are optionally at least partially halogenated. The diene optionally present generally contains 4 to 20 carbon atoms and is preferably selected from: 1,3-butadiene, isoprene, chloroprene, neoprene, 1,4-hexadiene, 1,4-cyclohexadiene, 5-ethylidene-2-norbornene, 5-methylene-2-norbornene, vinylnorbornene or mixtures thereof. Among them, the following are particularly preferred: ethylene/propylene (EPR) copolymers or ethylene/propylene/diene (EPDM) copolymers; polyisobutene; butyl rubber; halobutyl rubbers, in particular chlorobutyl (CIIR) or bromobutyl (BIIR) rubbers; or mixtures thereof.", "", "The vulcanisable and expandable elastomeric compound of the noise reducing element according to the present invention comprises at least one reinforcing filler, preferably selected from carbon black, conventional silica, such as sand silica precipitated with strong acids, preferably amorphous, diatomaceous earth, calcium carbonate, titanium dioxide, talc, alumina, aluminosilicates, kaolin, silicate fibres and mixtures thereof.", "", "Preferably, the reinforcing filler is selected from carbon black, conventional silica, silicate fibres, talc and mixtures thereof.", "", "Commercial examples of reinforcing fillers suitable for use in the present elastomeric composition are the carbon black N326 and N375 from Cabot, the carbon black N326 and N375 from Birla, and Minstron HAR lamellar talc produced by Imerys Talc France.", "", "The elastomeric composition preferably comprises from 20 to 60 phr, more preferably from 20 to 50 phr of said reinforcing filler.", "", "The vulcanisable and expandable elastomeric compound of the noise reducing element according to the present invention may comprise at least one vulcanising agent.", "", "The vulcanising agent is preferably selected from sulphur, or alternatively, sulphur-containing molecules (sulphur donors), in the presence of compounds containing zinc and fatty acids, or peroxides.", "", "Preferably, the vulcanising agent is sulphur preferably selected from soluble sulphur (crystalline sulphur), insoluble sulphur (polymeric sulphur), (iii) oil-dispersed sulphur and mixtures thereof.", "", "Alternatively, sulphur donor molecules such as, for example, caprolactam disulphide (CLD), bis[(trialkoxysilyl)propyl]polysulphides, dithiophosphates, phosphoryl polysulphide (SDT) and mixtures thereof may be used.", "", "Commercial examples of suitable vulcanising agents are the 65% sulphur known under the trade name of Rhenogran of Lanxess, the 67% sulphur known under the trade name of Crystex OT33 of Eastman, the 95% sulphur known under the trade name of Solvay SchwefelKC, the rhombic crystalline sulphur known under the trade name of Sulphur (1% oil and 0.3% silica) of Zolfindustria.", "", "Preferably, the vulcanising agent may be present in the elastomeric composition of the invention in an overall amount generally of from 0.1 to 2.5 phr, preferably from 0.2 to 2 phr, even more preferably from 0.3 to 1.5 phr. According to an alternative embodiment, the elastomeric composition is free of sulphur-based vulcanising agents, and may comprise only zinc-based or peroxide-based vulcanising agents.", "", "The vulcanising agent is preferably used together with adjuvants such as vulcanisation activating agents, accelerants and/or retardants known to those skilled in the art. The set of vulcanisation activating agents, accelerants and/or retardants constitutes, together with the vulcanising agent, the so-called “vulcanisation package”.", "", "The vulcanisation activators which are particularly effective are zinc compounds, and in particular ZnO, ZnCO3, zinc salts of saturated or unsaturated fatty acids containing from 8 to 18 carbon atoms, such as, for example, zinc stearate, which are preferably formed in situ in the elastomeric composition from ZnO and fatty acid, as well as BiO, PbO, Pb3O4, PbO2or mixtures thereof. Commercial examples are Wuhan Jinghe's Dispersing Agent FS-200 fatty acid zinc salts, KLK OLEO's Palmera B1810 stearic acid or U.S. Zinc grade 203 zinc oxide.", "", "The vulcanisation accelerant agent is preferably selected from dithiocarbamates, guanidines, thioureas, thiazoles, sulphenamides, sulphenimides, thiurams, amines, xanthates and mixtures thereof.", "", "Preferably, the accelerant agent is selected from N-cyclohexyl-2-benzothiazol-sulphenamide (CBS), N-tert-butyl-2-benzothiazol-sulphenamide (TBBS) and mixtures thereof.", "", "A commercial example of a suitable accelerant agent is N-cyclohexyl-2-benzothiazol-sulphenamide Vulkacit® (CBS) marketed by Lanxess.", "", "The vulcanisation accelerant agent may be present in the vulcanisable elastomeric composition in an overall amount generally from 0.05 phr to 10 phr, preferably from 0.1 phr to 5 phr.", "", "The vulcanisable elastomeric composition may comprise one or more vulcanisation accelerants as defined above in mixture.", "", "The vulcanisation retardant agent may be selected for example from urea, phthalic anhydride, N-nitrosodiphenylamine N-cyclohexylthiophthalimide (CTP), and mixtures thereof.", "", "A commercial example of a suitable retardant agent is N-cyclohexylthiophthalimide VULKALENT G of Lanxess.", "", "The retardant agent may be present in the vulcanisable elastomeric composition in an amount generally of from 0.05 phr to 2 phr.", "", "The expanding agent preferably used in the vulcanisable and expandable elastomeric compound of the noise reducing element according to the present invention is selected from the group of diazo, dinitrose, hydrazide, carbazide, semi-carbazide, tetrazole, carbonate, citrate compounds and mixtures thereof, as described in particular in publication WO2011/064128.", "", "Among these, one may mention in particular dinitroso-pentane-ethylene tetramine, dinitroso-pentane-styrene tetramine, N,N′-dimethyl-N,N′-dinitroso-phthalamide, azodicarbonamide, benzene sulphonyl hydrazide, toluene sulphonyl hydrazide, p,p′-oxy bis(benzenesulphonyl)hydrazide, p-toluene sulphonyl semicarbazide, p,p′-oxy bis (benzenesulphonyl)semicarbazide, and mixtures thereof.", "", "The foaming agent preferably used in the vulcanisable and expandable elastomeric compound of the noise reducing element according to the present invention is azodicarbonamide.", "", "The elastomeric composition preferably comprises from 10 phr to 20 phr of said expanding agent.", "", "The fatty acid amides useful in the present invention derive from the corresponding saturated, monounsaturated and polyunsaturated fatty acids by substitution of the —OH group of the carboxylic acid by an —NR1R2group, where R1and R2represent, independently of each other, a hydrogen atom or a linear or branched alkyl having from 1 to 6 carbon atoms, preferably from 1 to 4 carbon atoms, preferably methyl, ethyl, propyl, isopropyl, butyl, isobutyl, and tert-butyl.", "", "Saturated fatty acids from which the amides useful in the present invention may be obtained are, for example, butyric acid, valeric acid, capronic acid, enanthic acid, caprylic acid, pelargonic acid, capric acid, lauric acid, myristic acid, palmitic acid, margaric acid, stearic acid, arachic acid, behenic acid, lignoceric acid, cerotic acid, montanic acid, melissic acid, and laceroic acid.", "", "Monounsaturated fatty acids from which the amides useful in the present invention may be obtained are, for example, myristoleic acid, sapienic acid, palmitoleic acid, heptadecenoic acid, oleic acid, elaidic acid, vaccenic acid, trans-vaccenic acid, asclepic acid, cis-vaccenic acid, petroselinic acid, petroselinic acid, gadoleic acid, gondoic acid, cetoleic acid, erucic acid, and nervonic acid.", "", "Polyunsaturated fatty acids from which the amides useful in the present invention may be obtained are, for example, linoleic acid, rumenic acid, α-linolenic acid, γ-linolenic acid, stearidonic acid, arachidonic acid, timnodonic acid, clupanodonic acid, and cervonic acid.", "", "The fatty acid amides useful in the present invention are, for example, stearamide, oleamide, erucamide, behenamide, lauramide, palmitamide, butyramide, and so on.", "", "Commercial examples of fatty acid amides useful in the present invention are the amides marketed by Croda Italia SpA under the trade name of Crodamide™ or Incroslip™, such as for example Crodamide™ SR, Crodamide™ ER. Crodamide™ BR, Crodamide™ ORX, Crodamide™ S, Crodamide™ EBS, Crodamide™ OR, and Crodamide™ SRV, and by Fine Organics under the trade names of Finawax S, Finawax S 50, Finawax S 70.", "", "The elastomeric composition preferably comprises from 10 phr to 30 phr, more preferably from 10 phr to 20 phr of said fatty acid amides.", "", "The polymers and copolymers of caprolactone, lactic acid, and glycolic acid useful in the present invention are represented by polycaprolactones (PCL), polylactides (PLA or polylactic acid), polyglycolides (PGA), poly(caprolactones-co-lactides), poly(lactides-co-glycolides) (PLGA), poly(caprolactones-co-glycolides).", "", "The polycaprolactones useful in the present invention may be obtained by annular opening polymerization from caprolactone in the presence of metallic organic compounds (e.g., tin tetraphenyl) as catalyst and dihydroxyl (such as butylene glycol) or trihydroxyl (such as trimethylolpropane) or tetrahydroxyl compounds (such as pentaerythritol) as an initiator.", "", "Commercial examples of polycaprolactones useful in the present invention are the polycaprolactones marketed by Ingevity under the trade name of Capa™, such as Capa 2125, Capa 2045, Capa 2100J, Capa 2101, Capa 2101A, Capa 2125, Capa 2141A, Capa 2161A, Capa 2200J, Capa 2201, Capa 2201A, Capa 2202AJ, Capa 2203A, Capa 2204J, Capa 2205, Capa 2209, Capa 2241A, Capa 2302J, Capa 3022, Capa 3041, Capa 3201, Capa 6800, Capa 6250, and Capa 7201A. Further examples of polycaprolactones useful in the present invention are available under the trade name TONE, such as TONE 300 and TONE 700, marketed by Union Carbide Corporation Danbury, Connecticut.", "", "Commercial examples of polylactides useful in the present invention are available from Chronopol Inc. (Golden, CO), from NatureWorks LLC under the trade name EcoPLA™, from Mutsui Chemical under the trade name Lacea®, and from Biomer under the trade name L5000™", "", "The elastomeric composition preferably comprises from 2 phr to 15 phr, more preferably from 3 phr to 10 phr of the aforesaid polymers and copolymers of caprolactone, lactic acid, and glycolic acid are present in the vulcanisable and expandable elastomeric compound in amounts preferably comprised between 2 phr and 15 phr, more preferably between 3 phr and 10 phr.", "", "The Applicant has mainly focused on applying the invention to tyres for four-wheeled vehicles for road use, as tyres adapted to equip medium and high powered cars for transporting people (maximum chord size from 195 mm to 245 mm). The Applicant believes that the invention is also adapted for tyres for small cars or high-performance tyres (HP high performance-UHP ultra high performance) with maximum chord size, for example, of from 145 mm to 355 mm, or tyres for various vehicles such as motorcycles or heavy load vehicles for transporting people or property.", "", "The soundproof tyre may be an HP (High Performance) or UHP (Ultra High Performance) tyre intended for equipping vehicles for the transport mainly of people, such as Sedan, Minivan, family, SUVs (Sport Utility Vehicles) and/or CUVs (Crossover Utility Vehicles), typically tyres that allow driving at high speeds.", "", "The high and ultra-high performance tyres are in particular those which allow to reach speeds higher than at least 160 km/h, higher than 200 km/h up to over 300 km/h. Examples of such tyres are those belonging to the classes “T”, “U”, “H”, “V”, “Z”, “W”, “Y” according to the E.T.R.T.O. (European Tyre and Rim Technical Organisation) standards, in particular for four-wheel high-power vehicles. Typically, the tyres belonging to these classes have a section width equal to 185 mm or greater, preferably not greater than 325 mm, more preferably of between 195 mm and 325 mm. These tyres are preferably mounted on rims having seating diameters equal to or larger than 15 inches, preferably not larger than 24 inches, more preferably of between 17 inches and 22 inches. By SUV and CUV it is meant vehicles with raised distribution, typically four-wheel drive, typically having a displacement greater than or equal to 1800 cc, more preferably of between 2000 cc and 6200 cc. Preferably, these vehicles have a mass greater than 1,400 kg, more preferably of between 1500 Kg and 3000 Kg.", "", "The tyre of the invention may be used as a summer or winter or “all-season” (tyres usable in all seasons) tyre.", "", "The noise reducing element made of expanded elastomeric material is preferably disposed on at least a portion of the radially inner surface of the vulcanised layer of airtight elastomeric compound and extends axially at least at a part of the tread band.", "", "Preferably, the noise reducing element is disposed on the radially inner surface of the vulcanised layer of airtight elastomeric compound, which extends by the entire circumference of the tyre and axially at least at a part of the tread band of the tyre, preferably comprised between 10% and 70% of the width of the tread band of the tyre.", "", "Alternatively, the noise reducing element may be disposed for a width corresponding to 100% or more of the width of the tread band, i.e. it may extend over the radially inner surface of the vulcanised layer of airtight elastomeric compound corresponding to the sidewalls, in all or in part, preferably comprised between 10% and 70% of said surface.", "", "Preferably, the noise reducing element is disposed on the radially inner surface of the vulcanised layer of airtight elastomeric compound axially extending in a substantially centred position with respect to the equatorial plane of the tyre.", "", "In the tyre according to the present invention, the noise reducing element may be disposed on the radially inner surface of the vulcanised layer of airtight elastomeric compound as a single strip or as multiple stripes preferably parallel to each other circumferentially or with inclined pattern with respect to the equatorial plane. Such strips may substantially be rectangular portions, having a width preferably less than the cross-sectional width (maximum chord) of the tyre and length equal to or different from each other, preferably comprised between 0.5 and 0.05 of the inner circumferential development of the tyre; such substantially rectangular portions are disposed preferably in a substantially centred position with respect to the equatorial plane of the tyre.", "", "Preferably, the number of strips of material is greater than or equal to 1, preferably between 2 and 8, preferably less than 10.", "", "Preferably, the noise reducing element is disposed in such a way as to distribute the load as symmetrically as possible, so as not to unbalance the tyre posture.", "", "Preferably, the noise reducing element is disposed avoiding the overlapping of the end flaps of one or more strips of material.", "", "Preferably the coverage of the radially inner surface of the vulcanised layer of airtight elastomeric compound is less than 100% and preferably greater than 40%, more preferably greater than 50%, even more preferably greater than 60%.", "", "Further features and advantages will appear more clearly from the detailed description of a preferred but non-exclusive embodiment of a soundproof tyre according to the present invention.", "", "Such description is set forth hereinafter with reference to the drawing ofFIG.1provided for indicative and, therefore, non-limiting purposes only, where “a” indicates an axial direction and “r” indicates a radial direction. For simplicity,FIG.1shows only a part of the tyre, the remaining part not shown being identical and disposed symmetrically with respect to the radial direction “r”.", "", "The reference numeral100indicates inFIG.1a tyre for vehicle wheels, which generally comprises a carcass structure101having respectively opposite end flaps engaged with respective annular anchoring structures102, called bead cores, possibly associated with a bead filler104. The tyre area comprising the bead core102and the filler104forms a bead structure103intended for anchoring the tyre onto a corresponding mounting rim, not shown. Each bead structure103is associated to the carcass structure by folding back of the opposite lateral edges of the at least one carcass layer101around the bead core102so as to form the so-called carcass flaps101aas shown inFIG.1.", "", "The carcass structure101is possibly associated with a belt structure106comprising one or more belt layers106a,106bplaced in radial superposition with respect to one another and with respect to the carcass structure101, having reinforcing cords typically made of metal. Such reinforcing cords may have crossed orientation with respect to a circumferential extension direction of the tyre100. By “circumferential” direction we mean a direction generally facing according to the direction of rotation of the tyre, or in any case not very inclined with respect to the direction of rotation of the tyre.", "", "The belt structure106further comprises at least one radially outer reinforcing layer106cwith respect to the belt layers106a,106b. The radially outer reinforcing layer106ccomprises textile or metal cords, disposed according to a substantially zero angle with respect to the circumferential extension direction of the tyre and immersed in the elastomeric material. Preferably, the cords are disposed substantially parallel and side by side to form a plurality of turns. Such turns are substantially oriented according to the circumferential direction (typically with an angle of between 0° and 5°), such direction being usually called “zero degrees” with reference to the laying thereof with respect to the equatorial plane X-X of the tyre. By “equatorial plane” of the tyre it is meant a plane perpendicular to the axis of rotation of the tyre and which divides the tyre into two symmetrically equal parts. A tread band109is disposed in a radially inner position with respect to the carcass structure101and/or if present (as in the illustrated case) to the belt structure106.", "", "In a radially outer position, the tread band109has a rolling portion109aintended to come into contact with the ground. Circumferential grooves, which are connected by transverse notches (not shown inFIG.1) so as to define a plurality of blocks of various shapes and sizes distributed in the rolling portion109a, are generally made in this portion109a, which for simplicity is represented smooth inFIG.1.", "", "To optimise the performance of the tread, the tread band may be made in a two-layer structure.", "", "Such two-layer structure comprises the rolling layer or portion109a(called cap) and a substrate111(called base) forming the so-called cap-and-base structure. It is thus possible to use an elastomeric material capable of providing a low rolling resistance for the cap109aand at the same time high resistance to wear and to the formation of cracks while the elastomeric material of the substrate111may be particularly aimed at a low hysteresis to cooperate in reducing rolling resistance. The under-layer111of vulcanised elastomeric compound may be disposed between the belt structure106and the rolling portion109a.", "", "Moreover, respective sidewalls108of vulcanised elastomeric compound are applied in an axially outer position to said carcass structure101, each extending from one of the lateral edges of the tread band109up to the respective bead structure103.", "", "A strip consisting of elastomeric compound110, commonly known as “mini-sidewall”, of vulcanised elastomeric compound may optionally be provided in the connecting zone between sidewalls108and the tread band109, this mini-sidewall generally being obtained by co-extrusion with the tread band109and allowing an improvement of the mechanical interaction between the tread band109and the sidewalls108. Preferably, the end portion of sidewall108directly covers the lateral edge of the tread band109.", "", "In some specific embodiments, such as the one illustrated and described herein, the stiffness of the bead103may be improved by providing a reinforcing layer120generally known as a “flipper” in the tyre bead.", "", "The flipper120is wrapped around the respective bead core102and the bead filler104so as to at least partially surround them. The flipper120is disposed between the carcass layer101and the bead structure103. Usually, the flipper120is in contact with the carcass layer101and said bead structure103. The flipper120typically comprises a plurality of metal or textile cords incorporated in a vulcanised elastomeric compound.", "", "In some specific embodiments, such as the one illustrated and described herein, the bead structure103may further comprise a further protective layer121which is generally known by the term of “chafer”, or protective strip, and which has the function to increase the rigidity and integrity of the bead structure103.", "", "The chafer121usually comprises a plurality of cords incorporated in a vulcanised elastomeric compound; such cords are generally made of textile material (for example aramid or rayon), or of metallic material (for example steel cords).", "", "Optionally, an anti-abrasive strip105is disposed so as to wrap the bead structure103along the axially inner and outer and radially inner areas of the bead structure103, thus interposing itself between the latter and the wheel rim when the tyre100is mounted on the rim.", "", "Moreover, a radially inner surface of tyre100is preferably internally lined by a layer of substantially airtight elastomeric material, or so-called liner112.", "", "A noise reducing element of foamed elastomeric material301made by vulcanising the vulcanisable and expandable elastomeric composition according to the present invention is adhered by co-vulcanisation to the radially inner surface of the layer of airtight elastomeric material112, occupying in axial extension at least a part of the crown portion of the tyre.", "", "Preferably but non-exclusively, the tyre100for motor vehicles is of the HP (High Performance) or UHP (Ultra High Performance) type, i.e. it is a tyre capable of withstanding maximum speeds of at least 190 Km/h, up to over 300 Km/h. Examples of such tyres are those belonging to the classes “T”, “U”, “H”, “V”, “Z”, “W”, “Y”.", "", "According to an embodiment not shown, the tyre may be a tyre for motorcycle wheels. The profile of the straight section of the tyre for motorcycle (not shown) has a high transversal curvature since it must guarantee a sufficient footprint area in all the inclination conditions of the motorcycle. The transverse curvature is defined by the value of the ratio between the distance f of the ridge of the tread from the line passing through the laterally opposite ends of the tread itself, measured on the equatorial plane of the tyre, and the width C defined by the distance between the laterally opposite ends of the tread itself. A tyre with high transverse curvature indicates a tyre whose transverse curvature ratio (f/C) is at least 0.20.", "", "The building of the tyre100as described above is carried out by assembling respective semi-finished products onto a forming drum, not shown, by at least one assembly device.", "", "At least a part of the components intended to form the carcass structure101of the tyre100is built and/or assembled on the forming drum. More particularly, the forming drum lends itself to first receive the noise reducing element301made with the vulcanisable and expandable elastomeric compound according to the present invention, then the liner112, and subsequently the carcass ply101. Thereafter, devices not shown coaxially engage one of the annular anchoring structures102around each of the end flaps, position an outer sleeve comprising the belt structure106and the tread band109in a coaxially centred position around the cylindrical carcass sleeve and shape the carcass sleeve according to a toroidal configuration through a radial expansion of the carcass ply101, so as to cause the application thereof against a radially inner surface of the outer sleeve.", "", "After building of the green tyre100, a moulding and vulcanisation treatment is generally carried out in order to determine the structural stabilisation of the tyre100through vulcanisation of the elastomeric compounds, as well as to impart a desired tread pattern on the tread band109and to impart any distinguishing graphic signs at the sidewalls108.", "", "The vulcanised tyre, after being extracted from the vulcanisation chamber, is kept at rest at room temperature for a variable period of time, for example between about 5 minutes and about 20 minutes in order to allow the expansion of the elastomeric material of the noise reducing element301.", "", "Alternatively, the vulcanised tyre100is built without the noise reducing element301, which is applied, in a radially inner position to the liner layer of the finished tyre, and vulcanised, in a step subsequent to the manufacture of the finished tyre or applied to the finished tyre after being extruded, vulcanised and expanded separately.", "", "The present invention will be further illustrated below by means of a number of preparatory examples, which are provided for indicative purposes only and without any limitation of the present invention."], "claims": ["1 - 13 . (canceled)", "a carcass structure; a tread band in a radially outer position with respect to the carcass structure; a vulcanised layer of airtight elastomeric compound (liner), disposed in a radially inner position with respect to the carcass structure; and a noise reducing element made of foamed elastomeric material disposed in a radially inner position with respect to the vulcanised layer of airtight elastomeric compound and axially extending at least at a part of the tread band; wherein the foamed elastomeric material comprises, before vulcanization, a vulcanisable and foamable elastomeric compound comprising, before mixing, an elastomeric composition comprising: (i) 100 phr of at least one natural or synthetic elastomeric polymer, (ii) from 10 phr to 80 phr of at least one reinforcing filler, (iii) less than 3 phr of at least one vulcanising agent, (iv) from 5 phr to 30 phr of at least one expanding agent, (v) from 5 phr to 40 phr of at least one compound chosen from fatty acid amides, and (vi) from phr 1 to 20 phr of at least one compound chosen from polymers and copolymers of caprolactone, lactic acid, glycolic acid, and mixtures thereof.", "15 . The soundproof tyre according to claim 14 , wherein the at least one expanding agent is chosen from diazo compounds, dinitroso compounds, hydrazide compounds, carbazide compounds, semi-carbazide compounds, tetrazole compounds, carbonate compounds, citrate compounds, and mixtures thereof.", "16 . The soundproof tyre according to claim 14 , wherein the at least one expanding agent is chosen from dinitroso-pentane-ethylene tetramine, dinitroso-pentane-styrene tetramine, N, N′-dimethyl-N,N′-dinitroso-phthalamide, azodicarbonamide, benzene sulphonyl hydrazide, toluene sulphonyl hydrazide, p,p′-oxy bis(benzenesulphonyl) hydrazide, p-toluene sulphonyl semicarbazide, p,p′-oxy bis(benzenesulphonyl) semicarbazide, and mixtures thereof.", "17 . The soundproof tyre according to claim 14 , wherein the at least one expanding agent is azodicarbonamide.", "18 . The soundproof tyre according to claim 14 , wherein the elastomeric composition comprises from 10 phr to 20 phr of the at least one expanding agent.", "by substitution of the —OH group of the carboxylic acid by an —NR", "20 . The soundproof tyre according to claim 14 , wherein the elastomeric composition comprises from 10 phr to 30 phr of the fatty acid amides.", "21 . The soundproof tyre according to claim 14 , wherein the polymers and copolymers of caprolactone, lactic acid, and glycolic acid are chosen from polycaprolactones (PCL), polylactides (PLA or polylactic acid), polyglycolides (PGA), poly(caprolactones-co-lactides), poly(lactides-co-glycolides) (PLGA), poly(caprolactones-co-glycolides), and mixtures thereof.", "22 . The soundproof tyre according to claim 14 , wherein the elastomeric composition comprises from 2 phr to 15 phr, of the polymers and copolymers of caprolactone, lactic acid, and glycolic acid.", "23 . The soundproof tyre according to claim 14 , wherein the vulcanisable and foamable elastomeric compound comprises (i) at least one natural or synthetic diene elastomeric polymer derived from the polymerisation of one or more monomers, at least one of which is a conjugated diene, or (ii) at least one elastomeric polymer of one or more monoolefins with an olefinic comonomer or derivatives thereof.", "24 . The soundproof tyre according to claim 23 , wherein the (i) diene elastomeric polymer is chosen from natural or synthetic cis-1,4-polyisoprene, 3,4-polyisoprene, polybutadiene, isoprene/isobutene copolymers, 1,3-butadiene/acrylonitrile copolymers, styrene/1,3-butadiene copolymers, styrene/isoprene/1,3-butadiene copolymers, styrene/1,3-butadiene/acrylonitrile copolymers, and mixtures thereof.", "25 . The soundproof tyre according to claim 23 , wherein the (ii) elastomeric polymer is chosen from ethylene/propylene copolymers (EPR) or ethylene/propylene/diene copolymers (EPDM); polyisobutene; butyl rubbers; halobutyl rubbers; or mixtures thereof.", "(i) 100 phr of at least one natural or synthetic elastomeric polymer, (ii) from 10 phr to 80 phr of at least one reinforcing filler, (iii) less than 3 phr of at least one vulcanising agent, (iv) from 5 phr to 30 phr of at least one expanding agent, and (v) from 5 phr to 40 phr of at least one compound chosen from fatty acid amides, and (vi) from 1 phr to 20 phr of at least one compound chosen from polymers and copolymers of caprolactone, lactic acid, glycolic acid, and mixtures thereof.", "27 . The soundproof tyre according to claim 19 , wherein the saturated fatty acids are chosen from butyric acid, valeric acid, capronic acid, enanthic acid, caprylic acid, pelargonic acid, capric acid, lauric acid, myristic acid, palmitic acid, margaric acid, stearic acid, arachic acid, behenic acid, lignoceric acid, cerotic acid, montanic acid, melissic acid, and laceroic acid, and mixtures thereof.", "28 . The soundproof tyre according to claim 19 , wherein the monounsaturated fatty acids are chosen from myristoleic acid, sapienic acid, palmitoleic acid, heptadecenoic acid, oleic acid, elaidic acid, vaccenic acid, trans-vaccenic acid, asclepic acid, cis-vaccenic acid, petroselinic acid, petroselaidic acid, gadoleic acid, gondoic acid, cetoleic acid, erucic acid, nervonic acid, and mixtures thereof.", "29 . The soundproof tyre according to claim 19 , wherein the polyunsaturated fatty acids are chosen from linoleic acid, rumenic acid, α-linolenic acid, γ-linolenic acid, stearidonic acid, arachidonic acid, thymnodonic acid, clupanodonic acid, and cervonic acid.", "30 . The soundproof tyre according to claim 20 , wherein the elastomeric composition comprises from 10 phr to 20 phr, of the fatty acid amides.", "31 . The soundproof tyre according to claim 22 , wherein the elastomeric composition comprises from 3 phr to 10 phr, of the polymers and copolymers of caprolactone, lactic acid, and glycolic acid."], "bibtex": "@patent{20240239141,\n    title = {SOUNDPROOF TYRE FOR VEHICLE WHEELS},\n    number = {20240239141},\n    year = {2024},\n    note = {File: US20240239141A1-20240718.XML}\n    }", "classification": "B60C1900FI"}, {"title": "DOOR-TRIGGERED TIRE PRESSURE DETECTION SYSTEM AND METHOD FOR WAKING UP THE SAME", "doc_number": "20240239142", "filename": "US20240239142A1-20240718.XML", "abstract": "A car door-triggered tire pressure detection system includes an on-board unit with an ECU unit connected to a main high-frequency transceiver module, a main display, and a door sensing module. The on-board unit does not include a vehicle low- frequency circuit and a vehicle low-frequency antenna. Multiple TPMS each include a TPMS main control unit connected to a TPMS high-frequency transceiver module. Each TPMS does not include a TPMS low-frequency circuit and a TPMS low-frequency antenna. When the door sensing module detects a car door is opened, the main display shows the tire pressure values returned by each TPMS. The problem of excessive antennas used in known wireless transmission systems is improved. When the door sensing module detects the opening of the car door, the main display shows the tire pressure values returned by each TPMS.", "detailed_description": ["Referring toFIGS.1and2, the car door-triggered tire pressure detection system comprises an on-board unit(1) which includes an ECU unit (12) (electronic control unit) electrically connected to a main high-frequency transceiver module (13), a main display (14), and a door sensing module (11). The on-board unit (1) excludes a vehicle low-frequency circuit and a vehicle low-frequency antenna. Multiple TPMS (2) (tire pressure monitoring system) each include a TPMS main control unit (21) electrically connected to a TPMS high-frequency transceiver module (22). Each TPMS high-frequency transceiver module (22) matches with the main high-frequency transceiver module (13) through high-frequency wireless signals. Each TPMS (2) excludes a TPMS low-frequency circuit and a TPMS low-frequency antenna. When the door sensing module (11) detects an opening of a car door (3), the main display (14) displays tire pressure values returned by each TPMS (2). As shown inFIG.3, the main high-frequency transceiver module (13) matches with a car key (4) using high-frequency signals. The car key (4) includes a car key display (41). When the main display (14) displays the tire pressure values returned by each TPMS (2), the car key display (41) synchronously displays the same tire pressure values.", "", "Preferably, the signal transmission methods of the main high-frequency transceiver module (13) and the TPMS high-frequency transceiver module (22) are BLE (Bluetooth low energy), OOK (on-off keying), RFID (radio frequency identification), WI-FI, UWB (ultra-wideband), Zigbee (zonal intercommunication global standard), LPWAN (low-power wide-area network).", "", "The low frequency is less than or equal to 150 KHz.", "", "The door sensing module (11) can be a build-in system used to determine whether the car door (3) is securely closed, or an additionally configured infrared detection system. It can also be combined with other door-opening systems to detect whether the car door (3) is open. The methods of opening the car door (3) may include manual opening, magnetic card sensing, remote control, and other methods.", "", "The main high-frequency transceiver module (13) comprises a main high-frequency antenna (131) and a main high-frequency RF unit (132). The TPMS high-frequency transceiver module (22) comprises a TPMS high-frequency antenna (221) and a TPMS high-frequency RF unit (222).", "", "A wake-up method for a car door-triggered tire pressure detection system of the present invention comprises the following steps: when a car door (3) is opened, a door sensing module (11) of an on-board unit (1) detects the opening of the car door (3). An ECU unit (12) of the on-board unit (1) commands a main high-frequency transceiver module (13) to wirelessly wake up the matched TPMS (2) using high-frequency signals. When each TPMS unit (2) is waken up, and the TPMS main control unit (21) processes a detected data, transmitting wireless high-frequency signals back to the main high-frequency transceiver module (13) via a TPMS high-frequency transceiver module (22). The on-board unit (1) receives the signals returned by each TPMS (2) and displays the detected data on a main display (14).", "", "The vehicle on-board unit (1) and TPMS (2) are equipped with the main high-frequency transceiver module (13) and the TPMS high-frequency transceiver module (22), and neither uses low-frequency circuits nor low-frequency antennas. The signal transmission between the components is done using only high-frequency signals. In comparison, the present invention indeed improves the configuration of those conventional wireless transmission systems for vehicles, addressing the issue of excessive antenna types. In the present invention, the vehicle on-board unit (1) saves a set of low-frequency antennas and circuits, and TPMS (2) typically requires four sets. In other words, the present invention saves four sets of low-frequency antennas and circuits. In other words, the present invention saves at least five sets of low-frequency antennas and circuits compared to known products, reducing production and installation costs related to low-frequency antennas and circuits. As shown inFIG.3, the present invention, in conjunction with the car door sensing module (11) and the TPMS (2), allows the vehicle to obtain abnormal tire pressure values without the need to start or move the vehicle. This overcomes the issue in many conventional technologies where the vehicle must move before sending out tire pressure values. Discovering abnormal tire pressure values only after the vehicle has moved can be dangerous. As depicted inFIG.3, if the tire pressure of tires is insufficient or damaged before the vehicle moves, the wheel rims can lead to ineffective wheel rims protection, resulting in damage and deformation of the wheel rims. Therefore, the capability to obtain abnormal tire pressure values without starting or moving the vehicle is highly necessary.", "", "While we have shown and described the embodiment in accordance with the present invention, it should be clear to those skilled in the art that further embodiments may be made without departing from the scope of the present invention."], "claims": ["an on-board unit ( multiple TPMS (", "2 . The car door-triggered tire pressure detection system as claimed in claim 1 , wherein signal transmission methods of the main high-frequency transceiver module ( 13 ) and the TPMS high-frequency transceiver module ( 22 ) are BLE (Bluetooth low energy), OOK (on-off keying), RFID (radio frequency identification), WI-FI, UWB (ultra-wideband), Zigbee (zonal intercommunication global standard), LPWAN (low-power wide-area network).", "3 . The car door-triggered tire pressure detection system as claimed in claim 1 , wherein the main high-frequency transceiver module ( 13 ) comprises a main high-frequency antenna ( 131 ) and a main high-frequency RF unit ( 132 ), the TPMS high-frequency transceiver module ( 22 ) comprises a TPMS high-frequency antenna ( 221 ) and a TPMS high-frequency RF unit ( 222 ).", "4 . The car door-triggered tire pressure detection system as claimed in claim 1 , wherein the main high-frequency transceiver module ( 13 ) matches with a car key ( 4 ) using high-frequency signals, the car key ( 4 ) includes a car key display ( 41 ), when the main display ( 14 ) displays the tire pressure values returned by each TPMS ( 2 ), the car key display ( 41 ) synchronously displays the same tire pressure values.", "5 . A wake-up method for a car door-triggered tire pressure detection system, comprising the following steps: when a car door ( 3 ) is opened, a door sensing module ( 11 ) of an on-board unit ( 1 ) detects the opening of the car door ( 3 ), an ECU unit ( 12 ) of the on-board unit ( 1 ) commands a main high-frequency transceiver module ( 13 ) to wirelessly wake up the matched TPMS ( 2 ) using high-frequency signals, when each TPMS unit ( 2 ) is waken up, and the TPMS main control unit ( 21 ) processes a detected data, transmitting wireless high-frequency signals back to the main high-frequency transceiver module ( 13 ) via a TPMS high-frequency transceiver module ( 22 ), the on-board unit ( 1 ) receives the signals returned by each TPMS ( 2 ) and displays the detected data on a main display ( 14 ).", "6 . The wake-up method for the car door-triggered tire pressure detection system as claimed in claim 5 , wherein signal transmission methods of the main high-frequency transceiver module ( 13 ) and the TPMS high-frequency transceiver module ( 22 ) are BLE (Bluetooth low energy), OOK (on-off keying), RFID (radio frequency identification), WI-FI, UWB (ultra-wideband), Zigbee (zonal intercommunication global standard), LPWAN (low-power wide-area network).", "7 . The wake-up method for the car door-triggered tire pressure detection system as claimed in claim 5 , wherein the main high-frequency transceiver module ( 13 ) comprises a main high-frequency antenna ( 131 ) and a main high-frequency RF unit ( 132 ), the TPMS high-frequency transceiver module ( 22 ) comprises a TPMS high-frequency antenna ( 221 ) and a TPMS high-frequency RF unit ( 222 ).", "8 . The wake-up method for the car door-triggered tire pressure detection system as claimed in claim 5 , wherein the main high-frequency transceiver module ( 13 ) matches with a car key ( 4 ) using high-frequency signals, the car key ( 4 ) includes a car key display ( 41 ), when the main display ( 14 ) displays the tire pressure values returned by each TPMS ( 2 ), the car key display ( 41 ) synchronously displays the same tire pressure values."], "bibtex": "@patent{20240239142,\n    title = {DOOR-TRIGGERED TIRE PRESSURE DETECTION SYSTEM AND METHOD FOR WAKING UP THE SAME},\n    number = {20240239142},\n    year = {2024},\n    note = {File: US20240239142A1-20240718.XML}\n    }", "classification": "B60C2300FI"}, {"title": "SYSTEMS AND METHODS TO SELECTIVELY ACTIVATE TPMS LEARNING MODE OPERATIONS IN A VEHICLE", "doc_number": "20240239143", "filename": "US20240239143A1-20240718.XML", "abstract": "This disclosure generally pertains to systems and methods that guard against information piracy by selective activation of tire pressure sensor learning operations in a vehicle. An example method can include receiving, by a processor in a vehicle, a sensor signal from a wheel movement sensor provided in a wheel of the vehicle. The processor may evaluate the sensor signal and detect a tire-changing operation. The tire-changing operation may be detected, for example, based on a major surface of the wheel coming in contact with ground or determining that an angular displacement of a major surface of the wheel exceeds a threshold angle. The processor may then enable a learning mode of operation that can include a wireless pairing of a tire pressure sensor in the wheel to a tire pressure monitoring system of the vehicle. The processor disables the learning mode of operation after a period of time.", "detailed_description": [""], "claims": ["receiving, by a processor in a vehicle, a first sensor signal from a wheel movement sensor provided in a wheel of the vehicle; detecting, by the processor, based on evaluating the first sensor signal, a tire-changing operation being carried out upon the wheel; enabling, by the processor, based on detecting the tire-changing operation, a learning mode of operation that comprises a wireless pairing of a tire pressure sensor in the wheel to a tire pressure sensor system of the vehicle; and disabling, by the processor, the learning mode of operation upon expiry of a first period of time after enabling of the learning mode of operation.", "2 . The method of claim 1 , wherein detecting the tire-changing operation comprises determining, based on evaluating the first sensor signal, that at least a portion of a major surface of the wheel is in contact with a ground surface.", "3 . The method of claim 2 , wherein the learning mode of operation is enabled based on determining that the at least the portion of the major surface of the wheel is in contact with the ground surface.", "detecting, by the processor, based on evaluating the first sensor signal, an angular displacement of a major surface of the wheel with respect to a vertical axis; determining, by the processor, that the angular displacement exceeds a threshold angle; and detecting, by the processor, the tire-changing operation, based on determining that the angular displacement exceeds the threshold angle.", "5 . The method of claim 4 , wherein the threshold angle is selected with respect to the vertical axis.", "detecting, by the processor, based on evaluating the first sensor signal, a first angular displacement of a major surface of the wheel with respect to a horizontal axis; receiving, by the processor, a second sensor signal from the wheel movement sensor provided in the wheel of the vehicle; detecting, by the processor, based on evaluating the second sensor signal, that the wheel has been mounted upon an axle of the vehicle; enabling, by the processor, based on detecting that the wheel has been mounted upon the axle of the vehicle, the learning mode of operation; and disabling, by the processor, the learning mode of operation upon expiry of a second period of time after enabling of the learning mode of operation.", "determining, by the processor, a time lapse between the first angular displacement of the major surface of the wheel with respect to the horizontal axis and a previous angular displacement of the major surface of the wheel with respect to a vertical axis; and determining, by the processor, based on evaluating the time lapse, that the wheel is being moved from a horizontal storage position as a part of the tire-changing operation.", "receiving, by a processor in a vehicle, a sensor signal from a wheel movement sensor provided in a wheel of the vehicle; detecting, by the processor, based on evaluating the sensor signal, one of a first state or a second state, the first state associated with a first movement of the wheel due to a motion of the vehicle, the second state associated with a second movement of the wheel due to a tire-changing operation; and enabling, by the processor, based on detecting the second state, a learning mode of operation that comprises a wireless pairing of a tire pressure sensor in the wheel to a tire pressure sensor system of the vehicle.", "disabling, by the processor, the learning mode of operation upon expiry of a first period of time after enabling of the learning mode of operation.", "10 . The method of claim 8 , wherein the wheel movement sensor is an accelerometer, wherein detecting the first state comprises detecting a rotation of the wheel, and wherein detecting the second state comprises determining that a first angular displacement of a major surface of the wheel exceeds a threshold angular displacement.", "detecting, by the processor, a second angular displacement of the major surface of the wheel during the rotation of the wheel; and selecting the threshold angular displacement to one of equal or exceed the second angular displacement.", "12 . The method of claim 8 , wherein the wheel movement sensor is an accelerometer, wherein detecting the first state comprises detecting a rotation of the wheel, and wherein detecting the second state comprises detecting a transitioning of the wheel from one of a vertical position to a horizontal position with respect to a ground plane or vice-versa.", "13 . The method of claim 8 , wherein the wheel movement sensor is an accelerometer, wherein detecting the first state comprises detecting a rotation of the wheel, and wherein detecting the second state comprises determining that a major surface of the wheel is in contact with a ground surface.", "a tire pressure monitoring system comprising: a sensor system; a memory that stores computer-executable instructions; and a processor configured to access the memory and execute the computer-executable instructions to perform operations comprising: receiving a first sensor signal from the sensor system; detecting, based on evaluating the first sensor signal, a tire-changing operation being carried out upon a wheel of the vehicle; determining that a learning mode of operation that is supported by the tire pressure monitoring system is disabled; enabling, based on detecting the tire-changing operation, the learning mode of operation, the learning mode of operation comprising a wireless pairing of the tire pressure monitoring system to a tire pressure sensor in the wheel of the vehicle; and disabling the learning mode of operation upon expiry of a first period of time after enabling of the learning mode of operation.", "detecting, based on evaluating the first sensor signal, one of a first state or a second state, the first state associated with a first movement of the wheel due to a motion of the vehicle, the second state associated with a second movement of the wheel due to the tire-changing operation.", "16 . The vehicle of claim 15 , wherein the wheel movement sensor is one of an accelerometer or an inertial measurement unit, wherein detecting the first state comprises detecting a rotation of the wheel, and wherein detecting the second state comprises determining that a major surface of the wheel is in contact with a ground surface.", "17 . The vehicle of claim 15 , wherein detecting the first state comprises detecting a rotation of the wheel, and wherein detecting the second state comprises determining that a first angular displacement of a major surface of the wheel exceeds a threshold angular displacement.", "detecting a second angular displacement of the major surface of the wheel during the rotation of the wheel; and selecting the threshold angular displacement to one of equal or exceed the second angular displacement.", "detecting, based on evaluating the first sensor signal, a first angular displacement of a major surface of the wheel with respect to a horizontal axis; receiving a second sensor signal from the wheel movement sensor; detecting, based on evaluating the second sensor signal, that the wheel has been mounted upon an axle of the vehicle; enabling, based on detecting that the wheel has been mounted upon the axle of the vehicle, the learning mode of operation; and disabling the learning mode of operation upon the expiry of the first period of time after enabling of the learning mode of operation.", "determining a time lapse between the first angular displacement of the major surface of the wheel with respect to the horizontal axis and a previous angular displacement of the major surface of the wheel with respect to a vertical axis; and determining, based on evaluating the time lapse, that the wheel is being moved from a horizontal storage position as a part of the tire-changing operation."], "bibtex": "@patent{20240239143,\n    title = {SYSTEMS AND METHODS TO SELECTIVELY ACTIVATE TPMS LEARNING MODE OPERATIONS IN A VEHICLE},\n    number = {20240239143},\n    year = {2024},\n    note = {File: US20240239143A1-20240718.XML}\n    }", "classification": "B60C2304FI"}, {"title": "GPS TRACKER HOUSING FOR AN INFLATION VALVE", "doc_number": "20240239144", "filename": "US20240239144A1-20240718.XML", "abstract": "This invention relates to a housing for a GPS tracker, the housing being attachable to an inflation valve and comprising: (a) a receptacle in the housing which is shaped to accept a GPS tracker, and (b) a connector for attaching the housing to the inflation valve. The invention also relates to a GPS tracker housing kit comprising: (a) a housing as described above, (b) an inflation valve, and optionally one or more of: (c) a GPS tracker, (d) one of more grommets which are shaped to fit around the inflation valve, (e) a tyre rim, and (f) a tyre. In addition, the invention relates to the combination of the housing as described above and an inflation valve, wherein the housing is attached to the inflation valve.", "detailed_description": ["FIGS.1and2show side-on and perspective views of a housing according to the invention. The embodiment shown is the one in which the housing is attachable to (and removable from) an inflation valve. However, as described above it is possible for the housing to be formed as part of the inflation valve.", "", "As shown inFIGS.1and2, the housing comprises two parts, a base2and a cap3. Also shown inFIGS.1and2are GPS tracker5(in this embodiment, an Apple AirTag), inflation valve10, and grommets15A,15B and15C.", "", "The base2is formed from a resiliently flexible material, for example a synthetic rubber such as ethylene propylene diene monomer (EPDM) rubber. The base2comprises a head portion101comprising receptacle105(the interior of which is only visible inFIG.5) which is shaped to accept the GPS tracker5.", "", "In the Figures, the receptacle105of head portion101is shaped to accept a GPS tracker in the form of an Apple AirTag. The receptacle105comprises a lower surface111(only visible inFIG.5), upwardly extending side wall112, and inwardly extending lip113(not visible inFIG.2). Lip113defines an opening106at the upper end of head portion101which is slightly smaller than the GPS tracker. The deformable nature of the material from which the base2is made means that the GPS tracker can be pushed through the opening106and into receptacle105in the head portion101. In this way, the GPS tracker can be retained in receptacle105by the lip113. In particular, the receptacle105is shaped to closely fit around the Apple AirTag. However, alternative shapes can be utilised depending on the GPS tracker being used (e.g. a Tile GPS tracker, etc.).", "", "The base2also comprises stem20which extends from a lower surface120of head portion101. The stem20is substantially cylindrical and comprises four oblong apertures125A,125B,125C and125D (not all of which are visible in the Figures) in the part of the stem20which is closest to lower surface120. These apertures125A,125B,125C,125D are provided in order to allow the flow of air and sealant into the tyre to which the housing is to be fitted. The apertures125A,125B,125C,125D can also absorb compression/impact forces that may be experienced by the housing during use. The number, size and shape of the apertures can be varied.", "", "Towards its lower end130, stem20is provided with inwardly tapered section135. A circular through-hole140(not visible inFIG.1) is then provided at the lower end130.", "", "As noted above, the housing of the invention also comprises cap3. The cap3is formed from a resiliently flexible material, for example a silicone-based material such as FluoroSilicone Rubber (FSR). The cap3comprises opening107on its lower side, and side wall108extending upwards from the opening107. The opening107and side wall108are both shaped to fit over and around the head portion101of base2, and in this embodiment are both annular. Cap3also comprises top section109which, when the cap3fitted over head portion101of base2, forms a cavity which encloses the GPS tracker5in receptacle105.", "", "As shown inFIGS.1and2, the inflation valve10to which the housing is fitted comprises valve base145at its first end and valve core150at its second end. Valve base145and valve core150are connected by valve body155which is in the form of a screw-threaded cylinder. Inflation valve10may comprise any suitable tubeless valve system as is known in the art.", "", "Although not shown in the Figures, there is a conduit extending through the inflation valve10, providing fluid connection between valve base145and valve core150via the interior of valve body155.", "", "Valve base145has a larger cross-section than valve body155and is hexagonal in shape, although other valve base shapes could be utilised. The valve base145tapers slightly as it extends away from valve body155. Each of the six side faces (one indicated by way of example as160) of the valve base145are provided with a channel165in order to allow the flow of air through the inflation valve10and into the tyre to which the housing1is to be fitted.", "", "Also shown inFIGS.1and2are grommets15A,15B and15C, which are formed from the same material as the base2of the housing. Alternatively, they could be formed from the same material as the cap3of the housing. As shown inFIG.2, all three grommets15A,15B,15C are provided with an internal cylindrical through hole170(not visible inFIG.1) which is shaped to mate with the screw-thread of valve body155.", "", "Each grommet15A,15B,15C has an upper surface175(not visible inFIG.2) which is shaped to abut the lower end130of stem20during use. Grommet15A is in the form of a truncated cone which tapers as it extends away from upper surface175. Grommet15B has a similar truncated cone shape, except that it comprises two tapering sections. First tapering section180extends away from upper surface175. This then abuts second tapering section185which has a shallower taper than first tapering section180. Grommet15C has a bulbous section190adjacent to its upper surface175. Cylindrical section195then extends away from the opposite end of the bulbous section. The grommets15A,15B,15C are provided in order to provide a good seal between the inflation valve10and the rim of the tyre to it is to be fitted.", "", "FIGS.3,4and5then show side-on, perspective and cross-sectional views of housing (indicated generally as 1, and comprising the base2and cap3) containing GPS tracker5(not visible inFIGS.3and4), inflation valve10and grommet15A (not visible inFIG.3) when fitted to tyre rim201. InFIGS.3,4and5, the cap3has been fitted over the base2. For ease of reference, the component parts of these items are not labelled inFIGS.3and4.", "", "Tyre rim201is circular in shape and, as visible inFIG.4, has a substantially u-shaped cross-section such that there is provided annular channel205which is bounded by base210and side walls215,220.", "", "As shown inFIG.5, tyre rim201is provided with valve hole225in the base210and through which the inflation valve10is inserted. Inflation valve10is secured to interior face210A of base210by locking nut230which is screwed onto valve body155. Again, for ease of reference, not all of the component parts ofFIGS.1and2are labelled inFIG.5.", "", "InFIGS.3,4and5, grommet15A is slid onto valve body155of inflation valve10such that the narrow end of the truncated cone abuts exterior face210B of base210of type rim201.", "", "Also inFIGS.3,4and5, inflation valve10is inserted through circular through-hole140(not visible inFIGS.3,4and5) of the lower end130of stem20of housing1. This would be done prior to inserting the inflation valve10through valve hold225in tyre trim201. The valve core150is inserted into circular through-hole140first, followed by valve body155. The circular through-hole140has a diameter smaller than that of valve base145such that inflation valve10is then retained in the stem20.", "", "The GPS tracker5is then inserted into receptacle105in the base2of housing1, after which cap3is fitted over head portion101. The resiliently flexible material used to form cap3means that it can be stretched over head portion101by the user, after which the cap31is retained on the head portion101.", "", "The tyre rim201with housing1containing GPS tracker5, inflation valve10and grommet15A attached would them be fitted with a tubeless tyre (not shown). As is known in the art, the tyre is manufactured or treated such that it creates a substantially airtight seal with the rim of the tyre. For example, a sealant may be applied to the inner surface of the tyre."], "claims": ["(a) a receptacle in the housing which is shaped to accept a GPS tracker, and (b) a connector for attaching the housing to the inflation valve.", "2 . A housing for a GPS tracker as claimed in claim 1 , wherein the housing comprises a head comprising the receptacle, and a stem comprising the connector which extends from a lower surface of the head.", "3 . A housing as claimed in claim 2 , wherein the receptacle is in the form of a recess which is shaped to accept a GPS tracker.", "4 . A housing as claimed in claim 3 which comprises a base comprising the head and the stem, and a removable cap which is shaped to fit over the head.", "5 . A housing as claimed in claim 4 , wherein the removable cap is shaped to fit over the head such that it forms a cavity which is shaped to enclose a GPS tracker.", "6 . A housing as claimed in claim 4 , wherein the base and/or the removable cap is formed from a resiliently flexible material.", "7 . A housing as claimed in claim 6 , wherein the base is formed from ethylene propylene diene monomer rubber.", "8 . A housing as claimed in claim 6 , wherein the removable cap is formed from fluorosilicone rubber.", "9 . A housing as claimed in claim 2 , wherein the stem comprises one or more apertures for allowing flow of air and/or sealant through the stem.", "10 . A housing as claimed in claim 9 , wherein the stem comprises, at an opposite end to the head, a valve base aperture which is shaped to accept a valve base of an inflation valve.", "a housing, an inflation valve, a connector for attaching the housing to the inflation valve, and one or more of: a GPS tracker, wherein the housing comprises a receptacle in the housing which is shaped to accept the GPS tracker, one of more grommets which are shaped to fit around the inflation valve, a tyre rim, and a tyre.", "12 . The housing as claimed in claim 1 , further comprising an inflation valve, wherein the housing is attached to the inflation valve.", "13 . The housing of claim 12 comprising a GPS tracker in the receptacle of the housing.", "14 . The housing claimed in claim 12 , wherein a grommet is fitted to the inflation valve.", "15 . The housing of claim 12 , wherein the housing is fitted to a tyre rim.", "16 . An inflation valve comprising a housing for a GPS tracker, the housing comprising a receptacle which is shaped to accept a GPS tracker.", "17 . An inflation valve as claimed in claim 16 , wherein the housing comprises a head comprising the receptacle.", "18 . An inflation valve as claimed in claim 17 , wherein the receptacle is in the form of a recess which is shaped to accept a GPS tracker.", "19 . An inflation valve as claimed in claim 16 , wherein the housing comprises a removable cap which is shaped to fit over the head.", "20 . An inflation valve as claimed in claim 19 , wherein the removable cap is shaped to fit over the head such that it forms a cavity which is shaped to enclose a GPS tracker.", "21 . An inflation valve as claimed in claim 19 , wherein the head and/or the removable cap is formed from a resiliently flexible material.", "22 . An inflation valve as claimed in claim 21 , wherein the head is formed from ethylene propylene diene monomer rubber.", "23 . An inflation valve as claimed in claim 21 , wherein the removable cap is formed from fluorosilicone rubber.", "(a) an inflation valve, and one or more of: (b) a GPS tracker, (c) one of more grommets which are shaped to fit around the inflation valve, (d) a tyre rim, and (e) a tyre.", "25 . An inflation valve as claimed in claim 16 , comprising the GPS tracker in the receptacle of the housing.", "26 . An inflation valve as claimed in claim 25 , wherein a grommet is fitted to the inflation valve.", "27 . An inflation valve as claimed in claim 25 , when fitted to a tyre rim.", "28 . A mounting for a GPS tracker, the mounting being shaped for attachment to a surface of a tyre rim which surface, in use, faces a tyre attached to the rim.", "(a) a tyre rim, (b) a mounting for a GPS tracker as claimed in claim (c) a GPS tracker.", "30 . The mounting for the GPS tracker as claimed in claim 28 , wherein a tyre rim is fitted with the mounting for the GPS tracker."], "bibtex": "@patent{20240239144,\n    title = {GPS TRACKER HOUSING FOR AN INFLATION VALVE},\n    number = {20240239144},\n    year = {2024},\n    note = {File: US20240239144A1-20240718.XML}\n    }", "classification": "B60C2906FI"}]