[{"title": "V-SHAPED WHEEL SPOKE", "doc_number": "20240399787", "filename": "US20240399787A1-20241205.XML", "abstract": "A V-shaped wheel spoke made of carbon fiber material is provided. The bottom part of the spoke is provided with a first through hole for placing a bolt when the spoke is connected with a wheel rim. The spoke has two legs, the top portion of each of the two legs is provided with a second through hole for placing bolt when the two legs are connected with flanges at left and right sides of a hub. With this design, the conventional connection structure consisting of spokes and nipples has been abandoned, and bolts or fastening structures are used for connection. The two legs of the spoke are respectively connected to the flanges at the left and right sides of the hub with bolts or fastening structures, such that the overall structure forms a stable triangle which greatly improves the strength and stiffness of the wheel.", "detailed_description": [""], "claims": ["1 . A V-shaped wheel spoke, wherein the wheel spoke has a V shape, a bottom part of the V-shaped wheel spoke is provided with a first through hole, the first through hole is configured to place a bolt for connecting the V-shaped wheel spoke with a wheel rim, the V-shaped wheel spoke has two legs, and each of the two legs is provided with a second through hole at a top portion of the leg, the second through holes are configured to place bolts for connecting the V-shaped wheel spoke with flanges at left and right sides of a hub.", "2 . The V-shaped wheel spoke according to claim 1 , wherein the first through hole at the bottom part of the V-shaped wheel spoke has a diameter of 5 mm, and the second through hole at the top portion of the two legs of the V-shaped wheel spoke has a diameter of 6 mm.", "3 . The V-shaped wheel spoke according to claim 1 , wherein the V-shaped wheel spoke is made of carbon fiber material.", "4 . A V-shaped wheel spoke, wherein the wheel spoke has a V shape, a bottom part of the V-shaped wheel spoke is provided with a first through hole, the first through hole is configured to place a bolt for connecting the V-shaped wheel spoke with a wheel rim, the V-shaped wheel spoke has two legs, and each of the two legs is provided with a connection part at a top portion of the leg, the connection parts are connectable with flanges at left and right sides of a hub.", "5 . The V-shaped wheel spoke according to claim 4 , wherein the connection parts are provided with external threads, the flanges at the left and right sides of the hub are provided with internal threads matching the external threads on the connection parts, and the connection parts are screwed into the internal threads on the flanges by the external threads during installation to achieve a fixed connection.", "6 . The V-shaped wheel spoke according to claim 4 , wherein the top of the connection part of each leg is provided with a fastening cap, the flanges at the left and right sides of the hub are correspondingly provided with third through holes, the connection parts of the two legs are fixedly connectable with the third through holes, the fastening cap of the connection part of each leg has an outer diameter greater than an inner diameter of the third through hole, after installation, a bottom surface of the fastening cap of the connection part of each leg is attached to an inner end surface of the third through hole.", "7 . The V-shaped wheel spoke according to claim 6 , wherein the bottom surface of the fastening cap of the connection part of each leg is provided with a metal sleeve, the metal sleeve is arranged around a periphery of the connection part, and during installation, an end of the metal sleeve away from the fastening cap passes through the third through hole.", "8 . The V-shaped wheel spoke according to claim 6 , wherein the fastening cap and the connection part are integrally formed as a single piece by carbon fiber material."], "bibtex": "@patent{20240399787,\n    title = {V-SHAPED WHEEL SPOKE},\n    number = {20240399787},\n    year = {2024},\n    note = {File: US20240399787A1-20241205.XML}\n    }", "classification": "B60B102FI"}, {"title": "WHEEL DISC FOR A DISC WHEEL AND A DISC WHEEL THEREWITH", "doc_number": "20240399788", "filename": "US20240399788A1-20241205.XML", "abstract": "A wheel disc for a wheel with a radially extending hub connection flange and a disc rim connected to a wheel rim and a transition region extending between the disc rim and the connection flange. The transition region is provided with ventilation holes. The holes extend in the radial direction from a first inner pitch circle located closer to the connection flange to a second outer pitch circle located closer to the rim. The transition region in the radial section in a first sectional area extending between the connection flange and the radially inner first pitch circle has a material thickness reduced by at least 30% compared to a material thickness of the connection flange and/or wherein the holes have a hole region with a hole width increasing in the circumferential direction of the disc from the radially inner, first pitch circle towards the radially outer, second pitch circle.", "detailed_description": ["FIG.1shows a radial section (generatrix) of an upper half of a wheel disc10according to the invention, which in a known manner has a radially extending hub connection flange11with several bolt holes12, by means of which the wheel provided with the wheel disc10can be fastened to a wheel hub, not shown, of a commercial vehicle.", "", "The wheel disc10further has a cylindrical disc rim13, with which it is welded to a wheel rim14(FIG.3) at a connection region15, which in the wheel according to the invention shown is located laterally next to a rim well base, as will be described in detail below.", "", "Between the disc rim13and the hub connection flange11extends a transition region16connecting the two parts11,13, the particular design of which transition region is an essential characteristic of the present invention.", "", "As can be seen from the drawing, several ventilation holes17are provided in the transition region16, which holes are evenly distributed around the disc circumference and extend in the radially outer section of the transition region16, which is located further out towards the disc rim, between a radially inner first pitch circle18and a second, radially outer pitch circle19. At their inner end pointing radially inward toward the axis of rotation20of the wheel, the ventilation holes17are essentially pointed with a rounded hole tip21with a comparatively narrow hole tip radius rmin. Starting from the first, inner pitch circle18towards the second, outer pitch circle19, the hole width of the ventilation holes increases, and namely to a maximum hole width bmax, which lies on a third pitch circle22, which is located between the first and the second pitch circle18,19. In the preferred embodiment of the invention, the ratio of the distance a between the first and the third pitch circle to the hole height h of the ventilation holes17, thus the distance between the first and second pitch circle, is thereby less than/equal to 0.47. The maximum width bmax of the ventilation holes17is thus closer to the first than to the second pitch circle. In their respective radially outer region, the ventilation holes are provided with a flattening23located towards the second pitch circle19, which flattening merges with outer radii of curvature R into lateral hole regions.", "", "The ventilation holes are axially symmetrical to the radial plane E defining the hole height h. In the radially more inner hole region of the ventilation holes between the hole tip21and the maximum hole width bmax on the third pitch circle22, the hole rim curvature r increases from the narrow (minimum) radius of curvature rmin to about 8 times thereof, in order to then decrease again to about 2.5 times of the hole tip radius rmin in the transition region to the maximum hole width. Thus, in the lower, radially inner part of the ventilation holes, an approximately triangular wall shape results, as in an isosceles triangle. The overall shape of the ventilation holes can be described as drop- or egg-shaped.", "", "In addition to the special shape of the ventilation holes, the design of the wheel disc according to the invention is characterized by a special ratio of the material thickness in the sectional area24lying radially inward of the first pitch circle18to the material thickness at the hub connection flange11, wherein this material thickness ratio explained below has an independent inventive character. As can be seen in particular inFIG.1, the material thickness DN at the hub connection flange is essentially constant. In the sectional area24adjoining the hub connection flange11on the outside, the material thickness DA continuously reduces to less than 0.46 of the material thickness DN at the hub connection flange, wherein this minimum material thickness DA is reached approximately halfway between the transition from the hub connection flange11to the inner sectional area24and the first pitch circle18. From there, the thickness increases again to a value D1, which then reaches at least 50% of the material thickness DN at the hub connection flange at the first pitch circle18and which is preferably greater than 0.54 times of the thickness DN at the hub connection flange there. By reducing the material thickness in the sectional area24lying radially inward of the first pitch circle18to less than half, actually less than 46%, of the thickness DN of the hub connection, stresses in this part of the wheel disc10are minimized and, surprisingly, a particularly good stability of the wheel is achieved with a reduced weight compared to known wheels. The special design of the ventilation holes17, which have a larger cross section than the holes in known wheels, also contribute significantly to the weight reduction without adversely affecting the stability of the wheel or its wheel disc.", "", "FIG.3shows a vehicle wheel25which is advantageously equipped with the wheel disc10described above. The wheel rim14used with the vehicle wheel25has an inner rim well base26, two axially outer rim shoulders27and rim flanges28delimiting these on the outer and inner rim of the rim14. The connection region15for the disc rim13of the wheel disc is arranged between the rim well base26and the outer rim shoulder27A. The disc rim13is welded to the rim in a known manner on the inside of the connection region over its circumference. A circumferential, comparatively low hump29is formed between the connection region15and the outer rim shoulder27A, which hump prevents unintentional slipping of a tyre mounted on the rim into the rim well base, for example during brisk cornering, as is known.", "", "In accordance with the provisions of the patent statutes, the principle and mode of operation of this invention have been explained and illustrated in its preferred embodiments. However, it must be understood that this invention may be practiced otherwise than as specifically explained and illustrated without departing from its spirit or scope."], "claims": ["1 . A wheel disc for a disc wheel for commercial vehicles, with an at least essentially radially extending hub connection flange and with an essentially cylindrical disc rim which can be connected to a wheel rim and with a transition region extending between the disc rim and the hub connection flange, wherein the transition region is provided with ventilation holes distributed over a circumference, wherein the ventilation holes extend in a radial direction from a first inner pitch circle located closer to the connection flange to a second outer pitch circle located closer to the disc rim, wherein the transition region in radial section in a first sectional area extending between the hub connection flange and the radially inner first pitch circle has a material thickness reduced by at least 30% in relation to a material thickness of the hub connection flange and/or wherein the ventilation holes have a hole region with a hole width in disc circumference direction increasing from the radially inner first pitch circle towards the radially outer second pitch circle.", "2 . The wheel disc according to claim 1 , wherein a ratio of the material thickness in the first sectional area to the material thickness of the hub connection flange is at most 0.6.", "3 . The wheel disc according to claim 1 , wherein a material thickness of the transition region at the first pitch circle is at least 50% of the material thickness of the hub connection flange.", "4 . The wheel disc according to claim 3 , wherein a ratio of the material thickness at the first pitch circle ( 18 ) to the material thickness at the hub connection flange is greater than 0.54.", "5 . The wheel disc according to claim 1 , wherein a maximum hole width of the ventilation holes is at most 85% of a hole height thereof measured in the radial direction.", "6 . The wheel disc according to claim 1 , wherein a maximum hole width of the ventilation holes lies on a third pitch circle between the first inner pitch circle and the second outer pitch circle, wherein a distance between the third pitch circle and the first pitch circle is at most as great the distance between the second pitch circle and the third pitch circle.", "7 . The wheel disc according to claim 6 , wherein the ratio of the distance between the first pitch circle and the third pitch circle and a hole height of the ventilation holes is smaller than/equal to 0.48.", "8 . The wheel disc according to claim 1 , wherein the ventilation holes have an approximately drop- or egg-shaped basic shape with a hole tip pointing towards the first, inner pitch circle having a narrow radius of curvature, and a flattening located towards the second, outer pitch circle having a second radius of curvature.", "9 . The wheel disc according to claim 1 , wherein the ventilation holes are respectively axially symmetrical with respect to a radial plane defining a hole height of the ventilation holes.", "10 . The wheel disc according to claim 8 , wherein the ventilation holes have a hole rim curvature between their hole tip and their maximum hole width, which curvature, starting from the narrow radius of curvature of the hole tip, increases to at least 6 times more than of the hole tip radius.", "11 . Wheel disc according to claim 10 , wherein the hole rim curvature in a transition region to the maximum hole width is approximately 1.5 to 3 times of the narrow radius of curvature of the hole tip.", "12 . A disc wheel for commercial vehicles, with a wheel rim having an inner rim well base and two axially outer rim shoulders with rim flanges delimiting these at the outer and inner rim of the rim and an essentially cylindrical connection region arranged between one of the rim shoulders and the rim well base, to the inner side of which connection region the disc rim of a wheel disc according to claim 1 .", "13 . The disc wheel according to claim 12 , wherein a circumferential hump is arranged between the connection region and the rim shoulder adjacent thereto."], "bibtex": "@patent{20240399788,\n    title = {WHEEL DISC FOR A DISC WHEEL AND A DISC WHEEL THEREWITH},\n    number = {20240399788},\n    year = {2024},\n    note = {File: US20240399788A1-20241205.XML}\n    }", "classification": "B60B310FI"}, {"title": "RAILWAY WHEEL", "doc_number": "20240399789", "filename": "US20240399789A1-20241205.XML", "abstract": "In a cross section of the hub part of the railway wheel of the present disclosure including the central axis, when regions of 15 mm×15 mm defined by a plurality of axial line segments which are parallel to the central axis and which are arranged at a pitch of 15 mm in a radial direction of the railway wheel from an inner peripheral surface of the through hole, and by a plurality of radial line segments which are perpendicular to the central axis and which are arranged at a pitch of 15 mm in the central axis direction from a surface of the hub part in which an opening of the through hole is formed are defined as rectangular regions, the average C concentration in each rectangular region in the cross section of the hub part is 1.40% by mass or less.", "detailed_description": [""], "claims": ["a rim part, a hub part having a through hole, and a web part which is disposed between the rim part and the hub part, and is connected to the rim part and the hub part, wherein a chemical composition of the railway wheel consists of, in mass %, C: more than 0.80% to 1.35%, Si: 1.00% or less, Mn: 0.10 to 1.50%, P: 0 to 0.050%, S: 0 to 0.030%, N: 0.0200% or less, Al: 0 to 1.500%, Cu: 0 to 0.50%, Ni: 0 to 0.50%, Cr: 0 to 0.50%, V: 0 to 0.12%, Ti: 0 to 0.010%, Mo: 0 to 0.20%, and Nb: 0 to 0.050%, with the balance being Fe and impurities, and wherein in a cross section of the hub part obtained when, in a central axis direction of the through hole, the hub part is cut along a plane that includes the central axis, when regions of 15 mm×15 mm defined by a plurality of axial line segments which are parallel to the central axis and which are arranged at a pitch of 15 mm in a radial direction of the railway wheel from an inner peripheral surface of the through hole, and by a plurality of radial line segments which are perpendicular to the central axis and which are arranged at a pitch of 15 mm in the central axis direction from a surface of the hub part in which an opening of the through hole is formed are defined as rectangular regions, an average C concentration in each rectangular region in the cross section of the hub part is 1.40% by mass or less.", "P: 0.001 to 0.050%, S: 0.001 to 0.030%, Al: 0.001 to 1.500%, Cu: 0.01 to 0.50%, Ni: 0.01 to 0.50%, Cr: 0.01 to 0.50%, V: 0.01 to 0.12%, Ti: 0.001 to 0.010%, Mo: 0.01 to 0.20%, and Nb: 0.010 to 0.050%."], "bibtex": "@patent{20240399789,\n    title = {RAILWAY WHEEL},\n    number = {20240399789},\n    year = {2024},\n    note = {File: US20240399789A1-20241205.XML}\n    }", "classification": "B60B1700FI"}, {"title": "WALL-TRAVERSING VEHICLE", "doc_number": "20240399790", "filename": "US20240399790A1-20241205.XML", "abstract": "A first wheel and a second wheel are attached to a vehicle body, the first wheel and the second wheel being attractable to a contact surface and being switchable between an attracted state and an attraction release state. A traveling motor rotates the first wheel and the second wheel. A control unit switches each of the first wheel and the second wheel between the attracted state and the attraction release state and controls rotation. The control unit implements a first traveling mode for traveling on a first surface in a direction from the second wheel toward the first wheel, and a second traveling mode for traveling by setting the first wheel to the attraction release state and setting the second wheel to the attracted state, and rotating the second wheel until the first wheel comes into contact with a second surface rising from the first surface.", "detailed_description": ["On the wall-traversing vehicle including the attraction wheel, an object to be transported or a work tool for performing various types of work on the wall surface is loaded. Examples of the work tool loaded on the wall-traversing vehicle include various sensors such as a camera for appearance inspection, a welding torch, a cutting machine using gas or air plasma, a polishing tool such as a grinder, a painting spray gun, and a small robot arm for performing general-purpose work. A size of the load varies, and there is a case where the load protrudes forward of the front wheel. In a case where the load protrudes forward of the front wheel, when moving from the floor surface to the wall surface, the load comes into contact with the wall surface before the front wheel comes into contact with the wall surface. Since the front wheel cannot come into contact with the wall surface, the wall-traversing vehicle having the structure of the related art cannot move from the floor surface to the wall surface.", "", "It is desirable to provide a wall-traversing vehicle capable of stably traveling even when a load protrudes forward of a wheel."], "claims": ["a vehicle body; a first wheel and a second wheel that are attached to the vehicle body, that are attractable to a contact surface, and that are switchable between an attracted state and an attraction release state; a traveling motor that rotates the first wheel and the second wheel; and a control unit that switches each of the first wheel and the second wheel between the attracted state and the attraction release state and that controls rotation of the first wheel and the second wheel, wherein the first wheel and the second wheel are attached at an interval in a traveling direction that is a direction in which the vehicle body moves when the first wheel and the second wheel are rotated, and the control unit implements a first traveling mode for traveling on a first surface in a direction from the second wheel toward the first wheel, and a second traveling mode for traveling by setting the first wheel to the attraction release state and setting the second wheel to the attracted state in a state where the second wheel is in contact with the first surface, and rotating the second wheel until the first wheel comes into contact with a second surface rising from the first surface in a state where the first wheel is lifted off the first surface.", "wherein the vehicle body includes a first distal end portion that protrudes from the first wheel in a direction from the second wheel toward the first wheel, and the control unit implements the second traveling mode in a state where the first distal end portion is in contact with the second surface.", "wherein the vehicle body includes a first auxiliary wheel provided at the first distal end portion.", "wherein a first contact sensor is attached to the first distal end portion for detecting that the first auxiliary wheel comes into contact with an obstacle.", "wherein the control unit executes control of switching of an attracted state of the first wheel based on a detection result of the first contact sensor.", "wherein the first wheel includes a first rotating body, a first oscillating magnet, and a first axle, and the traveling motor applies a rotation force to the first rotating body.", "wherein the first oscillating magnet oscillates about the first axle as an oscillation center independently of rotation of the rotating body.", "a first oscillating magnet posture control motor that controls a posture of the first oscillating magnet.", "wherein the second wheel includes a second rotating body, a second oscillating magnet, and a second axle, and the traveling motor applies a rotation force to the second rotating body.", "a second oscillating magnet posture control motor that controls a posture of the second oscillating magnet.", "wherein the control unit further implements a third traveling mode for traveling by setting the first wheel to the attracted state and rotating the first wheel in a state where the first wheel is in contact with the second surface and the second wheel is in contact with the first surface.", "wherein the vehicle body includes a second distal end portion that protrudes from the second wheel in a direction from the first wheel toward the second wheel, and the control unit further implements a fourth traveling mode for traveling by setting the first wheel to the attracted state and setting the second wheel to the attraction release state in a state where the second distal end portion is in contact with the first surface and the first wheel is in contact with the second surface, and rotating the first wheel in a state where the second wheel is lifted off the first surface.", "wherein the vehicle body includes a second auxiliary wheel provided at the second distal end portion.", "wherein a second contact sensor is attached to the second distal end portion for detecting that the second auxiliary wheel comes into contact with an obstacle.", "wherein the control unit executes control of switching of an attracted state of the second wheel based on a detection result of the second contact sensor.", "wherein the control unit further implements a wall surface traveling mode for traveling by setting both the first wheel and the second wheel to the attracted state and rotating the first wheel and the second wheel in a state where the first wheel and the second wheel are in contact with the second surface.", "a metal lamination mechanism capable of laminating metal."], "bibtex": "@patent{20240399790,\n    title = {WALL-TRAVERSING VEHICLE},\n    number = {20240399790},\n    year = {2024},\n    note = {File: US20240399790A1-20241205.XML}\n    }", "classification": "B60B1900FI"}, {"title": "Gearless Portal Axle Assembly", "doc_number": "20240399791", "filename": "US20240399791A1-20241205.XML", "abstract": "A portal axle assembly is an enclosed drive system that is attached to a vehicle's axle, steering or other linkages, relocating vehicle power from an input axle shaft to a displaced (usually lower) output shaft. The output shaft, in turn, drives an attached unit bearing hub assembly that provides power to the vehicle's wheel. The inventive approach of this gearless, direct-drive, chain-and-sprocket design represents a unique and simplified approach that differs significantly from the multi-gear portal technology that is widely utilized in other portal axle designs. The gearless portal is designed to be compatible with floating axle shafts, or not on both the input and output ports, depending on use-case. Differential sprocket sizing provides for changes to drive ratio based on application. Additionally, the design of the portal housing provides for adaptation for attachment to a wide variety of OEM and aftermarket axle housing, suspension, steering linkage and other attachment methods. The portal axle can be readily made to accept a wide range of output hubs, unit bearing, and other methods of wheel attachment.", "detailed_description": ["The Gearless Portal Axle Assembly represents a novel approach to portal axle design that is substantially differentiated from all previously patented multi-gear portal axle iterations in that it utilizes a simplified, gear-free drive mechanism. Designed to be a modular system with the core architecture consisting of two sprockets and a matching laminate chain of any type, the bifurcated proximal and distal housing components are meant to be readily adapted, from a design and manufacture standpoint, for precision fitment to a wide range of current and future vehicle adaptation. Prerequisite to this detailed description of embodiments, the following Table of Components is provided for reference to the included drawings and the following information:", "", "REFERENCE TABLE OF COMPONENTSCharacter Reference#description1driven sprocket2end cap seal3drive sprocket4end cap5retaining ring6inverted silent chain7bearing inner race8proximal housing9bearing10shaft seal11shear pin12alignment pin13distal housing14wheel unit bearing15wheel bearing bolt16wheel bearing bolt seal17housing attachment bolt18housing seal19output shaft20drive slug21wheel bearing cover22cover screw23drain plug seal24drain plug25vent plug26vent plug adapter27knuckle28portal mount bolt29portal mount threaded stud30Axle housing tube31Axle shaft", "", "Various embodiments herein provide a mechanism to lift a vehicle from the ends of the axles and/or steering and suspension componentry. In some embodiments the portal mounts to an existing rotating axle steering component27. In other embodiments the portal mounts to a fixed solid axle component30. In yet other embodiments, the gearless portal is attached to OEM or aftermarket suspension components such as ball-joints, steering and or suspension linkage components, depending on the vehicle and application.", "", "FIG.4illustrates how the inventiveness is unique in that a chain and sprocket system is used to transmit torque in contrast to multi-gear portal drive systems.", "", "FIG.2Cillustrates a mechanism where there is a drive sprocket3with internal splines which mesh with an axle shaft31. A chain drive system is comprised of an inverted laminate (silent or any other type of laminate chain, so long as sprockets are designed and manufactured to match specified chain profile) chain6which wraps around the drive sprocket and extends down to and wraps around a driven sprocket1.", "", "In the example shown onFIG.4, both sprockets are supported for radial and thrust loads by a cylindrical bearing set7,9, but ball bearings could also be utilized in certain applications generating significant lateral thrust. In some embodiments the inner bearing race7can be assembled on to the sprocket. In other embodiments the inner bearing race can be integral to the sprocket giving the sprocket greater strength. Both the drive sprocket3and the driven sprocket1are supported by a cylindrical bearing set7,9on each side of the sprocket.", "", "The bearings shown onFIG.4are held in place both radially and axially by the proximal housing8and the distal housing13. Outside of the bearing is a shaft seal10which is held in place and supported by the proximal housing8. Shaft seals10are located at the points where oil could leak out of the chain and sprocket drive chamber. The shaft seals also keep contaminants from getting inside the gearless drive mechanism.", "", "At the proximal side of the sprocket1there is an end cap4. The end cap is held in place with a retaining ring5. The end cap has a groove that houses a seal2to keep the oil from leaking outside of the gearless chain drive chamber.", "", "In the example shown inFIG.4, the driven sprocket1has internal splines that mesh with the proximal end of a floating output shaft19. In other embodiments and applications, the output shaft can be integral to the driven sprocket. The end cap4keeps or supports the axial motion of the output shaft.", "", "in the example shown inFIG.4, the distal end of the output shaft meshes with a drive slug20. In other embodiments, the floating or integral output shaft can directly drive a hub, unit bearing or other wheel attachment device without the use of a drive slug. In the example embodiment shown, the drive slug20has internal splines that mesh with the output shaft. The drive slug has external splines that mesh with internal splines of a unit bearing14. The output shaft19and the drive slug14are supported by the wheel bearing cover21. This support allows the slug and output shaft to float while transmitting torque. The wheel bearing cover is held in place by cover screws22.", "", "The proximal housing8and the distal housing13are fixed together with housing attachment bolts17. The open area around the chain drive inside the proximal and distal housings is the gearless chain drive chamber. Between the housing surfaces is a seal18that keeps oil inside the gearless chain drive chamber while keeping contaminants out.", "", "FIG.4shows a perspective exploded view of the portal assembly. The housings8,13are aligned by insertion of alignment pin12. The housings are fixed by insertion of structural shear pins11. InFIG.2Can oil fill cap24is located at the top of the proximal housing8. The oil cap maintains a seal against contaminants getting into the chain drive chamber by compressing seal23. The oil fill cap24and the seal23are also the same component as the drain plug24and the drain plug seal23.", "", "FIG.2Ashows an air vent system which is made up of vent plug25and vent plug adapter26mounted to the side of proximal housing8. The air vent system attaches to a standard air tube by the vent plug adapter barb feature. A standard tube connected to the vent plug adapter26barb can be routed to attach to a standard check-valued filter. This allows for pressure changes inside the sealed chain drive chamber while not allowing contaminants to get inside the chain drive chamber. The vent plug25and vent plug adapter26can be removed during oil fill to determine oil fill height.", "", "FIG.2Dillustrates how the distal housing13attaches to a unit bearing14. The wheel bearing bolt15is assembled from inside the chain drive compartment. In other embodiments, various other unit bearings, hub assemblies or other drive and wheel attachment scenarios can be employed, depending on the vehicle and use case. The bearing bolt seal keeps oil in the chain drive compartment from leaving the chain drive compartment while keeping contaminants out.", "", "FIG.3illustrates how an assembled portal would attach to an existing rotating knuckle27. The mounting bolts28are aligned with the current mounting bolts of the knuckle27. In other embodiments the proximal housing would be modified for attachment to a variety of vehicle and use case scenarios including axle housing, ball joint, suspension, steering linkage and other componentry depending on the nature of the vehicle and use case. In some embodiments the mount holes for a brake bracket are repurposed for mounting reinforcement of the portal assembly. Customizable brake bracket attachment surfaces may be provided as shown in this embodiment, providing for optionally in brake caliper size and location via customizable, vehicle and application-specific brake caliper adapters.", "", "FIGS.5A &5Billustrate how a gearless portal assembly attaches to a fixed or solid axle housing assembly. The portal mount stud29is fixed to the portal assembly. During assembly the threaded studs line up with holes in the flange of the axle housing tube30. The portal assembly can be fastened with standard nuts. A pocket in the face of the proximal housing8nests around the flange on the axle housing tubing30. The nest encapsulates the flange creating a resistance to torque created by the axle shaft31."], "claims": ["1 . A Gearless Portal Axle Assembly comprising two sprockets and matching inverted laminate drive chain of any type; a bifurcated housing with the proximal portion attaching to a vehicle's axle and/or suspension componentry of any type; and the distal housing incorporating a vehicle's wheel attachment componentry of any type.", "2 . The Gearless portal Axle Assembly is a modular drive system whereas portal attachment adaptation to both the proximal and distal bifurcated housings provide for precision fitment to a variety of current and future vehicle input and output scenarios while maintaining the essential integrity of the core gearless drive system.", "3 . Sprockets and a matching laminate inverted chain as in claim 1 wherein system input power is delivered to the drive sprocket via an axle shaft, transferred via inverted laminate chain of any type to the driven sprocket and output power is delivered via floating or integral output shaft to integrated wheel attachment componentry of any type.", "4 . Sprockets as in claim 1 wherein differentially sized sprockets can be utilized to modify a vehicle's drive ratio within the gearless portal axle assembly."], "bibtex": "@patent{20240399791,\n    title = {Gearless Portal Axle Assembly},\n    number = {20240399791},\n    year = {2024},\n    note = {File: US20240399791A1-20241205.XML}\n    }", "classification": "B60B3500FI"}, {"title": "INTEGRATED AXLE ASSEMBLY AND STRUCTURAL ASSEMBLY", "doc_number": "20240399792", "filename": "US20240399792A1-20241205.XML", "abstract": "Provided discloses an integrated axle assembly and structural assembly. The integrated axle assembly comprises an axle tube assembly extending in a first direction; a front support arm extending circumferentially from the axle tube assembly in a second direction perpendicular to the first direction for attachment to the frame; a rear support arm extending circumferentially from the axle tube assembly in a third direction away from the second direction for mounting a resilient assembly; and a brake base plate extending in a peripheral direction from the circumference of the axle tube assembly; the axle tube assembly, front bracket arm, rear bracket arm and brake base plate are molded in one piece, which improves the assembly efficiency.", "detailed_description": ["In order to make the purpose, technical solutions and advantages of the present application clearer, the technical solutions of the present application will be described clearly and completely in the following in combination with specific embodiments of the present application and the corresponding accompanying drawings. Obviously, the described embodiments are only a part of the embodiments of the present application, and not all of the embodiments. Based on the embodiments in the present application, all other embodiments obtained by the person of ordinary skill in the field without making creative labor are within the scope of protection of the present application.", "", "An automobile includes a vehicle chassis, a body carried on the vehicle chassis, and electrical appliances mounted on the body and vehicle chassis.", "", "The function of the automobile chassis is to support and mount the engine and various other parts and assemblies of the automobile, which in turn constitute the automobile as a whole. The power generated by the engine is transmitted to the drive wheels after deceleration and torque increasing to drive the automobile as a whole forward or backward. The automobile chassis is equipped with steering control, brake control and vibration damping buffer and other devices to ensure that the vehicle runs normally.", "", "The automobile chassis consists of a transmission system, a traveling system, a steering system and a braking system.", "", "Specifically, the power of the automobile is generated by the engine, and is transmitted to the driving wheels through the clutch, transmission, universal transmission device, and differential and half shaft installed in the drive axle, etc.", "", "The transmission system includes the clutch, transmission, universal drive, and drive axle.", "", "The clutch is located between the engine and transmission, is the automobile transmission system directly connected to the engine components, can be connected or cut off the engine power.", "", "The actual use of the car is very complex, such as starting, idling and parking, low or high speed driving, acceleration, deceleration, hill climbing and reversing. These working conditions require that the driving force and speed of the car can be changed within a considerable range, and the widely used piston engine output torque and speed change range is small, in order to adapt to the varying driving conditions, and make the engine work in favorable conditions, set up a transmission in the drive system.", "", "In actual use, the output shaft of the transmission and the input shaft of the drive axle, it is difficult to drive in a straight line, and in the process of automobile use, due to the impact of uneven road surface and other factors cause vibration, so the output shaft of the transmission and the input shaft of the drive axle can not be rigidly connected, and thus a universal transmission device must be used.", "", "The main function of the drive axle is to transfer the engine power or torque from the universal drive to the driving wheels by means of speed reduction and torque increasing. The drive axle is the most end assembly in the automobile transmission system, and it is equipped with drive wheels on both sides. The drive axle can be arranged at the front side of the vehicle, at the rear side of the vehicle or at both the front and rear sides of the vehicle.", "", "The drive axle includes a drive axle housing and a differential and a half shaft installed in the drive axle housing.", "", "In addition to the differential and the half shaft, a main reducer is usually provided in the drive axle to realize speed reduction and torque increase. At the same time, the main reducer can change the direction of torque transmission. In the drive axle of a vehicle with a transverse engine arrangement, the main reducer is often a simple helical cylindrical gear. In the longitudinal arrangement of the engine on the drive axle, the main gear reducer tends to use bevel gears and hypoid gears and other forms. The main reducer decelerates the speed output from the transmission again to increase the torque, after which the power is transferred to the differential. For rear-wheel drive vehicles, such as passenger cars and trucks, the main reducer and differential are mounted in the rear drive axle, forming one large assembly.", "", "The differential realizes the differential speed of the wheels on both sides to meet the needs of the inner and outer wheels rotating at different speeds.", "", "The drive wheels are connected to the differential by half shafts, in other words, half of the axle between the two drive wheels.", "", "The main reducer housing of the drive axle housing covers the main reducer and differential. The half shaft casing of the drive axle housing covers the half shaft.", "", "When the half shaft casing and the main reducer shell rigidly integrated, both sides of the half shaft and the drive wheel can not be in the transverse plane to do relative movement, we call this drive axle housing for the integral drive axle housing or non-disconnect drive axle housing. Integral drive axle housing has greater strength and rigidity, easy to assemble and adjust the main gearbox and maintenance, so it is commonly used in various types of automobiles. Integral drive axle housing has large stiffness, high strength, easy to cast into the shape of equal-strength beams, but because of the large mass, casting quality is not easy to ensure that it is suitable for medium and heavy-duty vehicles, and is currently mainly used in heavy-duty vehicles.", "", "In order to improve the smoothness of automobile driving and passability, some passenger cars all or part of the drive wheels using independent suspension, that is, the two sides of the drive wheels are connected to the frame with elastic suspension, the two drive wheels can be independent of each other relative to the frame up and down jump. Correspondingly, the main gearbox housing is fixed on the frame, the main gearbox housing and half shaft casing segmented and connected by hinges, this drive axle housing is called disconnected drive axle housing or segmented drive axle housing. Segmented drive axle housing is generally divided into two segments, and the two segments are bolted together as a single unit. Segmented drive axle housing than the whole drive axle housing is easy to casting, processing is simple, but maintenance is not convenient. When disassembling and inspecting the main reducer, the entire drive axle must be removed from the car.", "", "The traveling system connects the various assemblies and parts of the car into a whole, supports the mass of the whole car, and ensures that the car moves.", "", "The traveling system includes the frame for mounting the drive train, the wheels, the steering axle for limiting the relative motion of the wheels with respect to the frame, and the suspension for limiting the motion of the wheels with respect to the frame or body.", "", "The frame is a support that can be used to mount the steering gear, the leaf springs, the fuel tank, the gas tank, the battery, the spare tire, the water tank and the like. The specific realization of the frame can be divided into side-beam frame, platform frame and ridge-beam frame.", "", "The side-beam frame is a rigid structure consisting of two longitudinal beams located on both sides and a number of cross beams riveted or welded together. Because the side beam frame is easy to install the body and arrange the assembly, which is favorable for the modification and development of multi-species models, so it is widely used.", "", "The longitudinal beam of the side beam frame is usually made of low carbon alloy steel plate stamping. Its cross-section shapes include groove cross-section, box cross-section, Z-shaped cross-section and I-shaped cross-section. According to the requirements of automobile form and structural arrangement, the longitudinal beam can be made into curved, isotropic or non-isotropic section in the horizontal plane or longitudinal plane.", "", "The longitudinal beam has many forms, including narrow front and wide rear structure, wide front and narrow rear structure and front and rear equal width structure, as well as parallel structure and curved structure.", "", "The frame cross member is not only used to ensure the torsional stiffness of the frame and bear the longitudinal load, but also used to support the main components of the car, such as the radiator, engine, cockpit, driveshaft, spare tire carrier and suspension.", "", "The wheel is a rotating component that carries the load between the tire and the axle, and generally consists of a hub, spokes and rim.", "", "Steering axle mainly consists of front axle, steering knuckle and main pin, cooperating with wheel hub and steering system to realize steering function. The front axle is the main body of the steering axle, and its cross-section shape has I-beam or tube shape.", "", "The front axle of the steering axle is used to reduce the height of the engine, thus lowering the center of gravity of the car, expanding the driver's field of vision, and reducing the angle between the drive shaft and the output shaft of the transmission.", "", "The steering knuckle is the hinge on which the wheels are steered, and is a fork-", "", "shaped piece. The upper and lower forks of the fork-shaped piece have two holes with the same axis for installing the main pin.", "", "The role of the main pin is to hinge the front axle and the steering knuckle, so that the steering knuckle swings around the main pin to realize the wheel steering.", "", "The main function of the suspension is to transfer the supporting force, driving force, braking force and lateral reaction force acting on the wheels on the road surface and the moment formed by these reaction forces to the frame or load-bearing body to ensure that the car is traveling normally.", "", "According to whether the wheel movements on both sides of the car are related to each other, the automobile suspension can be divided into non-independent suspension and independent suspension.", "", "Non-independent suspension structure is characterized by the car on both sides of the wheels were installed in an integral axle at both ends, the axle is connected to the frame through the elastic element, when one side of the wheels due to the road is not level and jumping, will affect the other side of the wheel work.", "", "The structure of independent suspension is characterized by the two sides of the wheels were installed in the disconnected axle ends, each section of the axle and wheel alone through the elastic element connected to the frame, when one side of the wheels jump, the other side of the wheels do not have an impact, so it is called independent suspension.", "", "The front wheels of independent suspension can be adjusted for their positioning, so they are widely used in passenger cars, while non-independent suspension is commonly used in medium and heavy commercial vehicles because of its simple structure, easy manufacturing and maintenance.", "", "The steering system ensures that the car is driven according to the driver's will. When the car is traveling on the road, the driver can turn the steering wheel to make the steering wheel deflect according to the road and traffic conditions, and change the driving direction of the car. The mechanism used to change or maintain the direction of travel is called the automobile steering system. The function of the steering system is to control the traveling direction of the car according to the driver's wishes.", "", "The braking system forces the automobile to slow down and stop and park safely in various places according to the needs of automobile traveling. The main function of the braking system is to enable the driver to control the braking force according to the road and traffic, etc., in order to realize a certain degree of forced braking, so that the car decelerates or stops; to ensure that the car travels at a stable speed when driving downhill; and to ensure that the car stops reliably in situ, which also includes stopping on the ramp.", "", "Drum brakes utilize brake shoes to squeeze the wheel hub and obtain braking force, and can be divided into internal tensioned type and external beam type. Internal tension drum brakes use the inner cylindrical surface of the wheel hub as the working surface and are widely used in modern automobiles, while external beam drum brakes use the outer cylindrical surface of the wheel hub as the working surface and are currently only used as parking brakes for very few automobiles.", "", "In order to more clearly illustrate the differences between the technical solutions of the present application relative to the prior art, the technical solutions employed in the prior art are revealed inFIG.1. Referring again toFIG.1, a trailer axle housing assembly comprises an axle tube assembly1on both ends where wheels can be mounted, a guide arm assembly2mounted in a circumferential direction of the axle tube assembly1, and a brake base plate12mounted in an axial direction of the axle tube assembly1.", "", "The axle tube assembly1can encompass a half shaft inside, and wheels are mounted at both ends of the axle tube assembly1.", "", "In a specific realization form, one side of the guide arm assembly2may be indirectly connected to the frame by a linkage structure. An air spring assembly may be mounted on the opposite side of the guide arm assembly2, and the frame is supported by the air spring assembly. The axle tube assembly1passes through the guide arm assembly2in the middle, thereby securing the guide arm assembly2to the axle tube assembly1in a circumferential direction.", "", "The axle tube assembly1also passes through a plate-like brake base plate12, which is axially secured to the axle tube assembly1by the ABS bracket.", "", "It is to be understood that, according to the aforementioned overall description of the vehicle structure, the axle tube assembly1can be categorized as an axle structure bridging the wheels on both sides, i.e. as an ordinary axle that does not have an automotive power transmission function in the vehicle's driving system. The guide arm assembly2may be considered to belong to a suspension structure, i.e., to be classified as a suspension in the driving system of the vehicle. The brake base plate12, on the other hand, may be categorized as a brake mounting structure in the braking system of the vehicle.", "", "The present application breaks the boundary between the traveling system and the brake system structure in the prior art, and breaks the boundary between the axle structure and the suspension structure in the traveling system in the prior art, and casts as many parts and components as possible in one piece, which on the one hand can reduce the workload of assembly, and on the other hand, the structure of the one-piece casting has a good consistency of the internal mechanical properties, which is not easy to be damaged in the process of use.", "", "The present invention provides an integrated axle assembly as shown inFIGS.2-8, including an axle tube assembly4and a guide arm assembly. The axle tube assembly4comprises an axle tube body41, a brake base plate42, a half-shaft casing43, and an ABS bracket holder44cast in one piece. And this axle tube assembly4adopts one-piece casting to make the production process simple, to reduce the intensity of the work and to reduce the dimensional deviation caused by the welding and positioning, to reduce the non-conformity rate to avoid unnecessary waste, cost savings. Brake base plate42can be used disc brake base plate or drum brake base plate. Half shaft casing43wall thickness varying from 23 mm to 13 mm, the value set according to the bridge load requirements, the program can make the half shaft casing43segments of the force uniformity, do not produce strength over the area, increase the total number of cases. Half shaft casing43according to the load and force set up with unequal wall thickness433, can also be designed according to the trailer load into different values of unequal wall thickness (gradient wall thickness)433, can ensure the safety of the product strength at the same time to reduce the weight of the product. The axle tube assembly4according to the characteristics of its upper wall under pressure, the lower wall under pressure, can be used in the design of the eccentric circle, the formation of different up and down the wall thickness of411to meet the reasonable design of the wall thickness of411, can increase the utilization rate of the material to achieve the control of weight. Moreover, the axle tube assembly4can realize the adjustment of the wall thickness411(including the realization of equal wall thickness) by changing the inner and outer diameters of the axle tube assembly4and the centroid distance of the eccentric circle, so as to meet the use of vehicles of different load levels.", "", "The guide arm assembly includes a front support arm5and a rear support arm6, and the axle tube assembly4may be cast integrally with the front support arm5and pinned and bolted to the rear support arm6; or the axle tube assembly4may be cast integrally with both the front support arm5and the rear support arm6.", "", "The front support arm5and the shaft tube assembly4is a one-piece casting, the front support arm5outer wall and the shaft tube assembly4is set in the position of the connection part of a first hollow70, easy to cast sand, easy to produce, reduce the difficulty of the process. The connection part of the front support arm5is set to the transition of a rounded first corner80. The connection part of the front support arm5to the transition of the rounded first corner80, can be guaranteed under the premise of the strength of the connection as far as possible reduce the weight of the product to increase end-user revenue. The upper and lower walls of the front support arm5and the upper and lower walls of the axle tube assembly4are respectively provided with a first cut corner71and a second cut corner72to ensure good connection strength of the front support arm5and improve product quality. The front support arm5consists of a shock absorber seat51, a sand outlet52, a reinforcement bar53, and a front support arm body54. And the sand outlet52is provided on the front support arm body54, which is convenient for casting the sand and easy to produce, reducing the process difficulty. reducing process difficulty. The sand outlet52is located in the position of the inner and outer wall of the front arm5is set up with bumps521to strengthen. The thickness and width of bumps521can be adjusted according to the size of the sand outlet52and the stress situation of the front arm5. The shock absorber seat51is set up in the lower wall of the front arm5close to the position of the side wall of the axle tube assembly4. The shock absorber seat51close to the lower wall of the front arm5is conducive to the molding of the core, and is conducive to the realization of the process. The reinforcement bar53is set at the head position of the front support arm5for strengthening the head strength of the front support arm5, and the width, thickness and extension length of the reinforcement bar53can be adjusted according to the load registration to match the needs of different load trucks.", "", "The rear support arm6is set on the side of the axle tube assembly4away from the front support arm5. The rear support arm6and the axle tube assembly4are fixed by pin positioning and bolt fastening. The axle tube assembly4and the rear support arm6form the axle housing assembly by the form of pin positioning and bolt fastening. The pins play the role of assembling and positioning at the same time, but also strengthen the shear strength in the direction of the firmness, increase the overall safety, and better ensure the stability of quality of the product. At the same time, according to different gas spring, suspension height can be replaced with different rear support arm6, increasing the flexibility of the axle assembly. The rear support arm6includes upper support plate61, lower support plate65, upper fixed seat62, lower fixed seat64and gas spring transition plate mounting cam69. The upper fixed seat62and lower fixed seat64are fixedly connected to the same end both of the upper support plate61and the lower support plate65. The upper support plate61is fixedly connected to the lower fixed seat64. The gas spring transition plate mounting tab69is fixedly connected to the upper support plate61and the lower support plate65away from the end of the upper fixed seat62. The gas spring transition plate mounting tab69is machined on the surface of the head of the upper support plate61, and the upper support plate61is a one-piece structure. The thickness of the upper support plate61and the lower support plate65cross-section is gradually thinned and narrowed from the root towards the front. And the thickness of the lower support plate65is greater than the thickness of the upper support plate, so as to achieve stress uniformity, reduce material waste, control costs and reduce weight, and increase the revenue of end customers.", "", "Gas spring transition plate mounting tab69of the upper surface height is higher than the height of the upper surface of the upper support plate61, which is conducive to machine processing, reduce stress concentration, to ensure the strength requirements. The gas spring transition plate mounting tab69were opened on the gas spring bolt mounting holes85and two gas spring transition plate mounting holes84. The gas spring bolt mounting holes85is located in the gas spring transition plate mounting holes between the two holes84, which can be adapted to the different gas spring installation methods.", "", "A middle reinforcing bar67is fixedly connected in the middle between the upper support plate61and the lower support plate65. A front reinforcing bar68is provided on the side of the middle reinforcing bar67away from the lower fixing seat64to fix the upper support plate61and the lower support plate65. A bottom reinforcing bar66is fixedly connected at the top of the lower support plate65and fixedly connected with the middle reinforcing bar67and the lower fixing seat64. And a rear reinforcing bar63is fixedly connected between the lower fixing seat64and the upper support plate61. The rear reinforcing bar63, the middle reinforcing bar67, the front reinforcing bar68and the bottom reinforcing bar66are fixedly connected to the upper support plate61, the overall strength between the upper support plate61and the lower support plate65can be increased, and the product quality can be improved. The rear reinforcement bar63is connected to the root of the upper support plate61at the forward position83, which effectively strengthens the root of the upper support plate61. The rear reinforcing bar63, the lower support plate65and the lower fixing seat64are connected with a chamfer82on the outer wall, which reduces the weight of the product as much as possible under the premise of guaranteeing the strength of the product and increases the revenue of the end customer.", "", "The rear support arm6and the axle tube assembly4can also be cast in one piece to further reduce the number of parts, simplify the structure, reduce weight and cost and improve production efficiency. The connection portion of the outer wall of the rear support arm6where it connects with the shaft tube assembly4is provided with a skeletonized second73, which can facilitate sanding, reduce weight, be easy to produce, and reduce the difficulty of the process. The attachment portion of the rear support arm6is provided with a second rounded corner81for transition. The lower wall of the rear support arm6and the lower wall of the axle tube assembly4are provided with tangent flanges74to ensure good connection strength of the rear support arm6.", "", "In the present invention, the axle tube assembly4is cast with the front support arm5as a whole, and the rear support arm6is pin-positioned and bolted, or cast with the front support arm5and the rear support arm6, removing the existing technology, such as anti-breakage plate assembly21, U-type bolts22, guide arm pressure plate23, guide arm24, axle lower bracket25, axle upper bracket26, and other parts, reducing the difficulty of the assembly operation, reducing the risk of loosening the bolt connection, reduced failure factor, resulting in higher product quality and lower product costs. The integral casting process used in the present invention can effectively reduce the weight of the product while ensuring the quality of the product, so that the end customer can carry more goods and increase the revenue", "", "Referring toFIGS.9and10, two different viewing angles of an integrated axle assembly100are revealed, respectively.", "", "The integrated axle assembly100comprises an axle tube assembly111extending in a first direction, a front support arm112extending circumferentially from the axle tube assembly111in a second direction perpendicular to the first direction for connecting to a frame130, a rear support arm113extending circumferentially from the axle tube assembly111in a third direction departing from the second direction for mounting an elastic component and a brake base plate114, said axle tube assembly111, front support arm112, rear support arm113and brake base plate114being integrally cast and molded. It is readily understood that the integrated axle assembly100breaks the boundary between the traveling system and the brake system structure in the prior art, breaks the boundary between the axle structure and the suspension structure within the traveling system in the prior art, and integrally casts as many as possible of the spare parts as possible, so that on the one hand the assembly workload can be reduced, and on the other hand the integrally casted structure has a good consistency of the internal mechanical properties, and is not easy to be damaged in the course of use.", "", "It is easily understood that the axle tube assembly111is the main structure of the axial direction of the integrated axle assembly100, and in order to ensure the smallest size and the best mechanical properties in the case of the same material, in a preferred embodiment provided by the present application, the said axle tube assembly111is a longitudinal cylindrical shape, andFIG.11reveals such a case. At the same time, in order to prevent the effect of shrinkage during the casting process as well as to reduce the consumption of casting material, the front support arm112adopts a hollow cylinder structure. In addition, in order to make the front support arm112maintain the mechanical strength and stiffness in accordance with the requirements, the front support arm112is provided with reinforcing bars inside the front support arm112at appropriate positions.", "", "It is readily understood that the axle tube assembly111is the main structure of the axial direction of the integrated axle assembly100, and in order to facilitate the positioning and installation of other components, in a preferred embodiment provided by the present application, said axle tube assembly111is a longitudinal square cylinder, andFIG.12reveals such a case. The square cylindrical shaft tube assembly111has a flat outer surface, which can facilitate the positioning and installation of other components. At the same time, in order to prevent the effect of shrinkage during the casting process and to reduce the consumption of casting material, the front support arm112adopts a hollow cylinder structure. In addition, in order to make the front support arm112maintain mechanical strength and stiffness in accordance with the requirements, the front support arm112is internally provided with reinforcement bars at appropriate positions.", "", "It is readily understood that the axle tube assembly111is the main structure of the axial direction of the integrated axle assembly100, and in order to further reduce the consumption of casting material, in a preferred embodiment provided in the present application, said axle tube assembly111is a longitudinal I-bar body, which is revealed inFIG.13. Compared to the longitudinally long square barrel shaft tube assembly111the consumption of material for substantially one wall can be reduced. At the same time, in order to prevent the effect of shrinkage during casting as well as to reduce the consumption of casting material, the front support arm112is constructed as a hollow cylinder. In addition, in order to enable the front support arm112to maintain mechanical strength and stiffness in accordance with the requirements, the front support arm112is provided with reinforcement bars inside the front support arm112at appropriate positions.", "", "It is readily understood that the axle tube assembly111is the main structure of the axial direction of the integrated axle assembly100, and in order to facilitate installation, in a preferred embodiment provided in the present application, said axle tube assembly111is a longitudinal groove structure. In a preferred embodiment provided by the present application, the recess structure has a cross-section of a three-sided enclosing structure, which is revealed inFIGS.14and15. In a preferred embodiment, the wall of the groove is provided with a flap edge structure on both sides. Wherein, the groove opening inFIG.14is oriented in a third direction. Wherein the orientation of the groove opening inFIG.15is a direction toward the frame130. Meanwhile, in order to prevent the effect of shrinkage during the casting process as well as to reduce the consumption of casting material, the front support arm112adopts a hollow cylinder structure. In addition, in order to make the front support arm112maintain the mechanical strength and stiffness in accordance with the requirements, the front support arm112is provided with reinforcing ribs inside the front support arm112at appropriate positions. In a preferred embodiment provided in the present application, the groove is provided with network-like distributed reinforcement bars. The network-like distribution of reinforcement bars improves the load of the axle tube assembly111in all directions, refer toFIG.16.", "", "Further, in a preferred embodiment provided in the present application, in order to reduce the casting difficulty of the front support arm112, said front support arm112is provided as a groove structure, and the reinforcing bars are appropriately provided within the groove. The front support arm112of the recess structure is easier to cast relative to the front support arm112of the hollow cylinder structure. Wherein the recess has a first groove wall and a second groove wall extending in a second direction, and transverse reinforcement bars connecting the first groove wall and the second groove wall.FIGS.17through19reveal this type of front support arm112structure.", "", "Further, in a preferred embodiment provided in the present application, in order to reduce the casting difficulty of the front support arm112, said front support arm112is provided as a groove structure, with reinforcing bars appropriately provided within the groove. The front support arm112of the recess structure is easier to cast relative to the front support arm112of the hollow cylinder structure. Wherein the groove has a first groove wall and a second groove wall extending in a second direction, transverse reinforcement bars connecting the first groove wall and the second groove wall, and longitudinal reinforcement bars extending in a direction substantially in line with the first groove wall.FIGS.20to22reveal the front support arm112structure of the species.", "", "Further, in a preferred embodiment provided in the present application, in order to reduce the difficulty of casting the front support arm112as well as to reduce the consumption of casting materials, the front support arm112adopts a hollow cylinder structure and the internal reinforcement bars are removed.FIGS.23to25reveal such a front support arm112structure.", "", "Further, in a preferred embodiment provided in the present application, in order to reduce the casting difficulty of the front support arm112as well as to reduce the consumption of casting materials, the front support arm112adopts an I-bar structure, i.e., the cross-section is an I-shaped structure.FIGS.26through28reveal such a front support arm112structure.", "", "Further, in a preferred embodiment provided in the present application, in order to reduce the casting difficulty of the front support arm112as well as to reduce the consumption of casting materials, the front support arm112adopts a longitudinal groove, and the groove wall is provided with a folded edge structure on both sides, i.e., the cross-section is roughly in a three-side encircling structure, and the edge portion is reinforced.FIG.29reveals such a structure. The three-sided enclosure may be specifically made of smooth curved surfaces, or it may be made of straight-sided connections, with the connection portions being treated with smooth transitions. These adaptive changes to specific application scenarios should clearly not be construed as being outside the scope of substantive protection of this application.", "", "Further, in a preferred embodiment provided in the present application, in order to improve the supporting effect of the rear support arm113on the air spring assembly, said rear support arm113is a horn structure that gradually contracts along the third direction space.FIGS.11through15reveal such a rear support arm113structure.", "", "Further, in a preferred embodiment provided in the present application, in order to reduce the casting difficulty of the rear support arm113as well as to reduce the consumption of casting material, said rear support arm113is provided as a recess structure, with reinforcing ribs appropriately provided within the recess. The rear support arm113of the groove structure is easier to cast relative to the front support arm112of the horn structure. Wherein the recess has a third groove wall and a fourth groove wall extending in a third direction, transverse reinforcement bars connecting the third groove wall and the fourth groove wall.FIG.17,FIG.20andFIG.23reveal the rear support arm113structure of the species.", "", "Further, in a preferred embodiment provided in the present application, in order to reduce the casting difficulty of the rear support arm113, to reduce the consumption of casting material, and to improve the structural strength of the rear support arm113, said rear support arm113is provided as a prismatic raised structure. The prismatic projection of this rear support arm113extends from a third direction and splits in two at an appropriate position to form, a fork-shaped prismatic projection.FIG.18,FIG.21andFIG.24reveal this rear support arm113structure.", "", "Further, in a preferred embodiment provided by the present application, in order to improve the structural strength of the rear support arm113, said rear support arm113is provided with reinforcing bars distributed in along the third direction.FIG.19,FIG.22andFIG.25reveal such rear support arm113structure.", "", "Further, in a preferred embodiment provided by the present application, the axle tube assembly111is cast in one piece, refer toFIG.30, which reveals a sectional structure of the end of the axle tube assembly111.", "", "Further, in a preferred embodiment provided by the present application, the axle tube assembly111may comprise two sections nested together in a sleeve, refer toFIG.31, revealing a sectional structure of the two-section axle tube assembly111, the two-end axle tube assembly111being axially secured by a locking pin115.", "", "Referring toFIG.32, the rear support arm113may be relatively independently It is mated to the axle tube assembly111by threads and has at least two mounting positions. It is readily appreciated that the rear support arm113is used to mount and support the air spring assembly. By adjusting the relative position of the rear support arm113with respect to the axle tube assembly111, in particular the height up and down with respect to the center of the axle tube assembly111, the suspension performance of the vehicle can be tuned, resulting in better vehicle stability.", "", "Referring toFIG.33, the rear support arm113can be integrated with the mount116of the damper120, thereby further improving the integration of the integrated axle assembly100.", "", "Referring toFIG.34, the rear support arm113may be provided with only the mounting holes117of the damper120, thereby further improving the integration of the integrated axle assembly100while simplifying the structure.", "", "Referring toFIGS.35to37, respectively, reveal situations when the integrated axle assembly100is mounted on the frame130. Among other things,FIG.35shows a schematic diagram of the structural assembly at an angle when the integrated axle assembly100is mounted on the frame130.FIG.36shows a schematic diagram of the structural assembly of the integrated axle assembly100at another angle when the integrated axle assembly100is mounted to the frame130.FIG.37shows a schematic view of the structure of the integrated axle assembly100when the frame130is removed with the air bag assembly110suspended. The present application also provides a structural assembly10having an integrated axle assembly100, further comprising:a damper120mated to the frame130at one end and mated to the integrated axle assembly100at the other end;an air spring assembly110carried on a rear support arm113and mappable to the frame130.", "", "The integrated axle assembly100can reduce the complexity of assembly and improve assembly efficiency. In specific use, the integrated axle assembly100, the air gas spring assembly110, and the damper120can be connected to the frame130. And the front support arm112is hingedly coupled to the frame130via lugs140.", "", "Further, in a preferred embodiment provided in the present application, to further improve integration, said structure assembly10further comprises:a brake mated to a brake base plate;a linkage system300mounted to the axle tube assembly111, mating with the brake and selectively switching the brake between a braked state and a free state;an air chamber400mated to the linkage system300and providing braking force.", "", "By changing the air pressure in the air chamber400, switching of the brake between the braking state and the free state can be realized to meet the needs of vehicle driving.", "", "Referring toFIGS.37to40, further, in a preferred embodiment provided by the present application, said brake comprises:a brake drum200coupled to a brake base plate114;a brake shoe201embedded in the brake drum200and oscillating relative to an inner wall of the brake drum200;a reset spring202providing a reset force for the brake shoe201;a camshaft203mounted to the brake base plate114that drives the brake shoe201to oscillate.", "", "The brake drum200is assembled to the integrated axle assembly100via the brake base plate114. The brake shoe201is embeddedly mounted within the brake drum200and is swingable relative to an inner wall of the brake drum200. A reset spring202is connected to the brake shoe201at one end, and when the operator issues a braking action, the air chamber400applies a braking force through the linkage system300, and the linkage system300drives the camshaft203to rotate, which in turn drives the brake shoe201to oscillate close to, and ultimately contact and rub against, the inner wall of the brake drum200for braking. After the braking force is removed, the brake shoe201moves away from the inner wall of the brake drum200under the action of the reset spring202.", "", "Referring toFIGS.41and42, further, in a preferred embodiment provided in the present application, said brake comprises:a caliper bracket204coupled to a brake base plate114;a brake disk205partially seated into the caliper bracket204;a caliper206mounted to the caliper bracket204, selectively proximate or remote from the brake disk205.", "", "The caliper bracket204is assembled to the integrated axle assembly100via the brake base plate114. The brake disc205is partially seated into the caliper bracket204. the brake caliper206is mounted to the caliper bracket204, selectively proximate or remote from the brake disc205. When a braking action is initiated by an operator, the air chamber400applies a braking force through the linkage system300, which moves the hydraulic system, which in turn drives the caliper206close to the brake disc205and causes the corresponding friction components to eventually contact the friction disc205to brake. After the braking force is removed, the brake caliper206moves away from the brake disk205under the action of the hydraulic system.", "", "Further, in a preferred embodiment provided in this application, said brake base plate is used for mounting a brake shoe for a drum brake or a caliper bracket for mounting a disk brake.", "", "As inFIGS.35through37brake base plate114is used to mount brake shoes for drum brakes. And the brake base plate114may be used to mount a caliper bracket for a disk brake, as inFIG.41.", "", "It is noted that the terms “including”, “comprising”, or any other variant thereof, are intended to cover non-exclusive inclusion such that a process, method, commodity, or apparatus comprising a set of elements includes not only those elements, but also other elements not expressly listed, or also other elements not expressly listed. or which are inherent to such process, method, commodity or equipment. Without further limitation, the fact that an element is defined by the phrase “including a . . . ” does not preclude the existence of another element of the same kind in the process, method, commodity, or apparatus including the said element.", "", "The foregoing is only an example of the present application and is not intended to limit the present application. The present application is subject to various changes and variations for those skilled in the art. Any modifications, equivalent substitutions, improvements, etc. made within the spirit and principles of this application shall be included in the scope of the claims of this application."], "claims": ["a front support arm, said front support arm being cast integrally with the axle tube assembly; a rear support arm, said rear support arm being fixedly connected to a side of the axle tube assembly away from the front support arm; said rear support arm is pinned and bolted to the axle tube assembly, and said rear support arm comprises an upper support plate, a lower support plate, an upper fixed seat, a lower fixed seat and a gas spring transition plate mounting tab, said upper fixed seat and lower fixed seat are fixedly connected to the same end of the upper and lower support plates, said upper support plate is fixedly connected to the lower fixed seat and the gas spring transition plate mounting tab is connected to the upper support plate at an end away from the upper fixed seat, said upper support plate is fixedly connected to the lower fixed seat, and said gas spring transition plate mounting tab is connected to the upper support plate at an end away from the upper fixed seat. away from one end of the upper fixed seat, the bottom end of said gas spring transition plate mounting tab is fixedly connected to one end of the lower support plate away from the lower fixed seat, the thickness of said upper support plate and lower support plate cross-section is gradually thinning and narrowing from the root to the front end, and the thickness of said lower support plate is greater than the thickness of the upper support plate; wherein a middle reinforcing bar fixedly connected in the middle between said upper supporting plate and lower supporting plate, and there is a front reinforcing bar on the side of said middle reinforcing bar far away from the lower fixing seat, and the two ends of said front reinforcing bar are respectively fixedly connected with the opposite sides of the upper supporting plate and the lower supporting plate, and there is a bottom reinforcing bar on the side of said middle reinforcing bar far away from the front reinforcing bar, and the bottom reinforcing bar is fixedly connected to the outer walls of the lower supporting plate and the lower fixing seat on the bottom and the one side respectively, said bottom reinforcing bar is fixedly connected to the outer wall of the lower support plate and the lower fixing seat respectively, and said rear reinforcing bar is fixedly connected between said lower fixing seat and the upper support plate; said rear reinforcement bar is connected to the root of the upper support plate at a forward position, and said rear reinforcement bar and the outer wall of the connection between the lower support plate and the lower fixed seat are provided with chamfered corners.", "2 . The integrated axle assembly according to claim 1 , characterized in that said outer wall of said front support arm is provided with a first skeleton at a position of a connection section with the axle tube assembly, said front support arm is provided with a rounded first corner for transition at the connection section with the axle tube assembly, said upper wall of said front support arm is provided with a first cut corner at a position corresponding to the upper wall of the axle tube assembly, said lower wall of said front support arm is provided with a second cut corner at a position corresponding to the lower wall of the axle tube assembly, provided with a second cut corner.", "3 . The integrated axle assembly according to claim 1 , characterized in that said front carrier arm comprises a shock absorber seat, a sand outlet, a reinforcing bar and a front carrier arm body, said sand outlet being provided in the middle of the front carrier arm body, said protrusions being provided in the inner and outer walls of the front carrier arm body and located at the port positions at both ends of the sand outlet, said shock absorber seat being provided in the front carrier arm body at a position close to the end of the axle tube assembly, said reinforcing bar being provided in the front carrier arm body at a position corresponding to the upper wall of the axle tube assembly and the lower wall of the axle tube assembly, reinforcement is provided on the outer wall of one end of the front support arm body away from the shaft tube assembly.", "4 . The integrated axle assembly according to claim 1 , characterized in that said axle tube assembly is cast integrally from an axle tube body, a brake base plate, a half-axle sleeve and an ABS bracket seat, and said half-axle sleeve is set with different wall thicknesses according to the load and force conditions.", "5 . The integrated axle assembly according to claim 4 , characterized in that said axle tube assembly is of eccentric circle design, said upper and lower walls of said axle tube body cross-section can be realized with different wall thicknesses of different sizes, and said axle tube assembly can be adjusted with wall thicknesses by changing the inner and outer diameters of its inner and outer circles and the centroid distance of the eccentric circle.", "6 . The integrated axle assembly according to claim 1 , characterized in that the height of the upper surface of said gas spring transition plate mounting tab is higher than the height of the upper surface of the upper support plate, and said gas spring transition plate mounting tab is provided with gas spring bolt mounting holes and two gas spring transition plate mounting holes, respectively, and said gas spring bolt mounting holes are disposed between the two gas spring transition plate mounting holes.", "an axle tube assembly extending in a first direction; a front support arm extending circumferentially from the axle tube assembly in a second direction perpendicular to the first direction for attachment to the frame; a rear support arm extending circumferentially from the axle tube assembly in a third direction away from the second direction for mounting a resilient assembly; and a brake base plate extending in a peripheral direction from the circumference of the axle tube assembly; said axle tube assembly, front bracket arm, rear bracket arm and brake base plate are molded in one piece.", "8 . The integrated axle assembly according to claim 7 , characterized in that said axle tube assembly is longitudinally cylindrical.", "9 . The integrated axle assembly according to claim 7 , characterized in that said axle tube assembly is a longitudinally square cylinder.", "10 . The integrated axle assembly according to claim 7 , characterized in that said axle tube assembly is a longitudinal I-bar.", "11 . The integrated axle assembly according to claim 7 , characterized in that said axle tube assembly is a longitudinal groove structure.", "12 . The integrated axle assembly according to claim 7 , characterized in that said axle tube assembly is a longitudinal groove structure, and the groove is provided with a network of distributed reinforcement bars.", "13 . The integrated axle assembly according to claim 7 , characterized in that said axle tube assembly is a longitudinal groove structure, and the cross-section of the groove structure is a three-sided encompassing structure.", "14 . The integrated axle assembly according to claim 13 , characterized in that said groove opening is oriented in a third direction or towards the frame.", "15 . The integrated axle assembly according to claim 7 , characterized in that said front support arm is provided as a hollow cylinder structure with reinforcement bars at appropriate positions.", "16 . The integrated axle assembly according to claim 7 , characterized in that said front support arm is provided as a groove structure having a first groove wall and a second groove wall extending in a second direction, and transverse reinforcement bars connecting the first groove wall and the second groove wall.", "17 . The integrated axle assembly according to claim 7 , characterized in that said front support arm is provided as a recess structure having a first groove wall and a second groove wall extending in a second direction, a transverse reinforcing bar connecting the first groove wall and the second groove wall, and a longitudinal reinforcing bar extending in a direction substantially in line with the direction of the first groove wall.", "18 . The integrated axle assembly according to claim 7 , characterized in that said front support arm has a hollow cylinder structure.", "19 . The integrated axle assembly according to claim 7 , characterized in that said front support arm adopts an I-bar structure.", "20 . The integrated axle assembly according to claim 7 , characterized in that said front support arm adopts a longitudinal groove, and a folded edge structure is provided on both sides of the groove wall.", "21 . The integrated axle assembly according to claim 7 , characterized in that said rear support arm is a horn structure which gradually contracts along the third direction space.", "22 . The integrated axle assembly according to claim 7 , characterized in that said rear support arm adopts a groove structure, having a third groove wall and a fourth groove wall extending along the third direction, and a transverse reinforcement connecting the third groove wall and the fourth groove wall.", "23 . The integrated axle assembly according to claim 7 , characterized in that said rear support arm adopts a groove structure and the rear support arm is set up as a prismatic projection structure, the prismatic projection extends in the third direction and splits into two at an appropriate position to form a fork-shaped prismatic projection.", "24 . The integrated axle assembly according to claim 7 , characterized in that said rear support arm is provided as a structure having a bottom wall, a top wall, and an intermediate wall in connecting a middle part of the bottom wall to a middle part of the top wall.", "25 . The integrated axle assembly according to claim 7 , characterized in that said axle tube assembly comprises two segments nested together in a sleeve.", "26 . The integrated axle assembly according to claim 7 , characterized in that said rear support arm is threaded to mate with the axle tube assembly and has at least two mounting positions.", "27 . The integrated axle assembly according to claim 7 , characterized in that said rear support arm integrates a mount for a damper.", "28 . The integrated axle assembly according to claim 7 , characterized in that said rear support arm is provided with mounting holes for the damper.", "29 . The integrated axle assembly according to claim 7 , characterized in that said brake base plate for mounting brake shoes for drum brakes or caliper brackets for mounting disc brakes.", "an integrated axle assembly comprising: an axle tube assembly extending in a first direction; a front support arm extending circumferentially from the axle tube assembly in a second direction perpendicular to the first direction for attachment to the frame; a rear support arm extending circumferentially from the axle tube assembly in a third direction away from the second direction for mounting a resilient assembly; and a brake base plate extending in a peripheral direction from the circumference of the axle tube assembly; said axle tube assembly, front bracket arm, rear bracket arm and brake base plate are molded in one piece; and said structural assembly further comprises: a damper for mating with the frame at one end and mating with the integrated axle assembly at the other end; an air spring assembly carried on the rear support arm and for mating with the frame.", "a brake mated to a brake base plate; a linkage system mounted to the axle tube assembly, mating with the brake and selectively switching the brake between a braked state and a free state; an air chamber mated to the linkage system and providing braking force.", "a brake drum coupled to a brake base plate; brake shoes embedded in the brake drum and oscillating relative to the inner wall of the brake drum; a reset spring providing a resetting force for the brake shoe; a camshaft mounted to the brake base plate and driving the brake shoe to oscillate.", "a caliper bracket connected to the brake base plate; a brake disk partially seated into the caliper bracket; a caliper mounted to the caliper bracket, selectively proximate or remote from the brake disk."], "bibtex": "@patent{20240399792,\n    title = {INTEGRATED AXLE ASSEMBLY AND STRUCTURAL ASSEMBLY},\n    number = {20240399792},\n    year = {2024},\n    note = {File: US20240399792A1-20241205.XML}\n    }", "classification": "B60B3504FI"}, {"title": "FLEXIBLE METALLIC WEB ELEMENTS FOR NON-PNEUMATIC TIRE", "doc_number": "20240399793", "filename": "US20240399793A1-20241205.XML", "abstract": "A non-pneumatic tire includes an inner ring of metal material, an outer ring of metal material, a plurality of bent metal spokes, and a first overmolded polymeric foot formed over a first end of each bent metal spoke. Each first overmolded polymeric foot is attached to the inner ring by one of brazing, welding, casting, or adhering with an adhesive; The non-pneumatic tire further includes a second overmolded polymeric foot at a second end of each bent metal spoke. Each second overmolded polymeric foot is attached to the outer ring by one of brazing, welding, casting, or adhering with an adhesive.", "detailed_description": ["FIG.1illustrates one embodiment of a non-pneumatic tire10. The non-pneumatic tire10is merely an exemplary illustration and is not intended to be limiting. In the illustrated embodiment, the non-pneumatic tire10includes a generally annular inner ring20that engages a rim (not shown) to which the tire10is mounted. The generally annular inner ring20has an internal surface23and an external surface24and can be made of metal. In one embodiment, the generally annular inner ring20can me made of annealed spring steel. In another embodiment, the generally annular inner ring20can be made of a polymeric material. In another embodiment, the generally annular inner ring20can be made of a composite material.", "", "The non-pneumatic tire10further includes a generally annular outer ring30. A plurality of spokes40extend between the generally annular inner ring20and the generally annular outer ring30. In alternative embodiments, a web or other support structure connects the inner ring to the outer ring. The outer ring30can be configured to deform in an area around and including a footprint region (not shown), which decreases vibration and increases ride comfort.", "", "In one embodiment, the generally annular inner ring20and the generally annular outer ring30are made of the same material as the plurality of spokes40. As shown inFIG.1, the generally annular outer ring30has a radially external surface to which a tread layer70is attached. Attachment can be done adhesively, by curing, or by using other methods. The tread rubber70may have tread elements formed therein, such as ribs, blocks, lugs, grooves, sipes, and other tread elements. The tread rubber may also include internal structures. In one embodiment, the tread band includes a shear band. In another embodiment, the tread band includes a bending element.", "", "In the illustrated embodiment shown inFIG.1, the inner ring is a smooth inner ring configured to be mounted to a hub. In alternative embodiments, the inner ring may have geometry configured to engage corresponding geometry of a hub.", "", "In the illustrated embodiment shown inFIG.1, the outer ring is a smooth outer ring configured to receive tread rubber. In alternative embodiments, the outer ring may have geometry configured to engage corresponding geometry of a strip of tread rubber.", "", "In the illustrated embodiment, the plurality of spokes40are oriented in a generally radial direction. It should be understood that other spoke orientations or web structures may be employed. For example,FIG.2A,FIG.2B,FIG.2Cillustrate a plurality of spokes200,210,220arranged in various radial orientations.FIG.2Aillustrates a straight radial spoke orientation.FIG.2Billustrates an arched radial spoke orientation.FIG.2Cillustrates a bent radial spoke orientation. In one embodiment, the spokes extend axially across the entire inner and outer rings. In another embodiment, the spokes extend axially across only a portion of the inner or outer rings.", "", "In one embodiment, the plurality of spokes40are welded to the annular inner ring20and annular outer ring30. In another embodiment, the plurality of spokes40are brazed to the annular inner ring20and annular outer ring30. In yet another embodiment, the plurality of spokes can be cast into a metal wheel or otherwise bonded directly to the tread band. In still another embodiment, the plurality of spokes40are attached to the annular inner ring20and the annular outer ring30by overmolding an attachment piece to the end of each of the plurality of spokes40. To overmold an attachment piece onto the spoke40, an end of the spoke is placed in an injection mold and then plastic is injected around the spoke. As the plastic cools, it hardens and cools around the end of the spoke.", "", "In another embodiment, the plurality of spokes40are attached to the annular inner ring20and the annular outer ring30by a combination of welding, brazing, solder, applying an adhesive, casting, and overmolding an attachment piece to the ends of the spokes40.", "", "In another embodiment, shown inFIG.2D, an interconnected web230is illustrated. The interconnected web230can be a molded web that is attached to the inner and outer rings. In another embodiment, the interconnected web230is formed by a plurality of strips, with each strip extending across only a portion of the wheel. In such an embodiment, the plurality of strips may be spaced apart from each other, or may contact each other at one or more locations. Each individual strip connects to an inner or outer ring.", "", "FIG.2EandFIG.2Fillustrate other examples of support structures240,250. InFIG.2E, the support structure240can be molded structures that are attached to the inner and outer rings. In another embodiment, the support structure240is formed by a plurality of strips, with each strip extending across only a portion of the wheel. In such an embodiment, the plurality of strips may be spaced apart from each other, or may contact each other at one or more locations. Each individual strip connects to an inner or outer ring.", "", "FIG.2Fillustrates a honeycomb geometry of an interconnected web structure. The interconnected web can have at least two radially adjacent layers of web elements that define a plurality of generally polygonal openings250. In other embodiments (not shown), other web configurations may be employed. It should be understood that the geometries shown inFIGS.1and2A-2Fare merely exemplary and that any geometries may be employed. Similarly, other support structures may be employed instead of a webbing.", "", "With continued reference toFIG.2AthroughFIG.2Fthe support structures can be metal elements formed through bending or through a press form process. In another embodiment, the metal elements can be formed through another forming process such as stamping or rolling.", "", "In one embodiment, the spokes or web elements are formed by metal cords that are axially spaced along the inner and outer rings. In another embodiment, the spokes or web elements are formed by metal strips that are axially spaced along the inner and outer rings. In yet another embodiment, each spoke or web element is formed by a sheet of material. In such an embodiment, the process of bending the metal is performed on a discrete sheet of material. In an alternative embodiment, the process of bending the metal is performed on a material that is later cut into discrete sheets. In such an embodiment, the material may be provided as a roll of material.", "", "FIG.3Ais a schematic drawing illustrating a perspective view of an exemplary sheet300of metal material that is used to form a spoke or a web element. The sheet300has a first length L1in a longitudinal direction, and a first width W1in a lateral direction, the first width W1being equal to the full width of the wheel. The first length L1is greater than the first width W1. Thus, the sheet300may be referred to as an elongated sheet. In one embodiment, the sheet300is a spring steel strip. Spring steel specifically accommodates the need for the web elements to be very flexible without deformation. In an alternative embodiment, the metal is stainless steel. In another alternative embodiment, the metal may be another type of steel material.", "", "FIG.3Bis a schematic drawing illustrating a side view of the sheet300of metal material. While the sheet300is depicted as a single, flat sheet, it may be provided in a roll of material that is cut to the desired size. The sheet300may be bent or curved to form a single spoke or web element. Alternatively, the sheet300may be cut into a plurality of sheets or strips to form multiple spokes or web elements.", "", "FIG.4is a schematic drawing illustrating a partial side view of one embodiment of a non-pneumatic tire structure400having an inner ring410and an outer ring420. For illustrative purposes, only a single spoke430is shown. A sheet of metal, such as the sheet300, may be bent to form the spoke430. It should be understood that the illustrated spoke is merely exemplary, and that the shape and angle of the bent portion of the spoke may vary. After the spoke430is formed, it is affixed to the inner annual ring410and outer annular ring420.", "", "In the illustrated embodiment, the ends of the spoke430are attached to the inner and outer rings410,420by overmolding a first foot440onto a first end of the spoke430and overmolding a second foot450onto a second end of the spoke430. The first foot440is attached to the inner ring410and the second foot450is attached to the outer ring420.", "", "In one embodiment, a metal foot is overmolded onto a metal web element and cast directly to a metal wheel or bonded directly to a tread band. In another embodiment, a polymeric foot is overmolded onto a metal web element and cast or bonded to a metal wheel or tread band. In yet another embodiment, a polymeric foot is overmolded onto a metal web element and bonded to a polymeric wheel or tread band.", "", "After the spoke430is formed, the metal can be coated for protection. The coating provides environment protection, noise dampening, and improves the smoothness of the ride. In one embodiment, the metal may be coated in a painters dip.", "", "In the illustrated embodiment, a plurality of spokes are formed and attached to the inner and outer rings in the manner described above. The number of spokes, web elements, or other support structure varies for the given type of non-pneumatic tire. The spokes can be angled to support torque transfer. In one embodiment, the plurality of spokes can be arranged in multiple planes to promote flexibility within the tire. In another embodiment, the plurality of spokes can have multiple angles. In another embodiment, the angles of the plurality of spokes support torque in both directions.", "", "FIGS.5A through5Care schematic drawings illustrating cross-sections of non-pneumatic tires with various embodiments of a support structure.FIG.5Aillustrates a plurality of spokes550extending axially across a non-pneumatic tire between in outer ring510and an inner ring520. A single, continuous first foot530is attached to a first end of each of the plurality of spokes550. The single, continuous first foot530is also attached to the inner ring520. Likewise, a single, continuous second foot540is attached to a second end of each of the plurality of spokes550. The single, continuous second foot540is also attached to the outer ring510.", "", "FIG.5Balso illustrates a plurality of spokes550extending axially across a non-pneumatic tire between in outer ring510and an inner ring520. A plurality of first feet560and a plurality of second feet570are also illustrated. One of the plurality of first feet560is attached to a first end of each of the plurality of spokes550. Each of the plurality of first feet560is also attached to the inner ring520. Likewise, one of the plurality of second feet570is attached to a second end of each of the plurality of spokes550. Each of the plurality of second feet570is also attached to the outer ring510.", "", "FIG.5Cis a schematic drawing illustrating another embodiment of a cross-sectional view of the support structure. In the illustrated embodiment, a spoke580extends axially across the entire width of the non-pneumatic tire. The spoke580can be a single sheet of metal. The metal can have a plurality of cuts or slices590that do not extend the length of the metal. Such cuts or slices reduce the lateral stiffness of the material. While the cuts590are shown here as oval shaped, it should be understood that they may have any geometric shape.", "", "In the illustrated embodiment, a single, continuous first foot530is attached to a first end of each of the spoke580. The single, continuous first foot530is also attached to the inner ring520. Likewise, a single, continuous second foot540is attached to a second end of each of the spoke580. The single, continuous second foot540is also attached to the outer ring510. In an alternative embodiment (not shown), a single spoke may extend across the width of the non-pneumatic tire, and be attached to the inner ring by a plurality first feet and attached to the outer ring by a plurality of second feet.", "", "FIGS.6A-Care schematic drawings of various embodiments of attaching a foot to an inner ring of a tire. It should be understood that similar methods may be employed to attach a foot to the outer ring of a tire.", "", "FIG.6Aillustrates a foot600overmolded onto a support structure. The support structure may be bent at the end before the foot600is overmolded onto it. In this embodiment, the foot600is attached to an outer surface of the inner ring610. In one such embodiment, the foot600and the inner ring610are both constructed of the same material. For example, both the foot600and the inner ring610may be constructed of metal. In such an embodiment, the foot600may be welded or brazed to the inner ring610. Alternatively, the foot600may be affixed to the inner ring610with an adhesive. As another alternative embodiment, the foot600may be affixed to the inner ring610with rivets, staples, bolts, or other mechanical fasteners.", "", "As another example, both the foot600and the inner ring610may be constructed of a polymeric material. In such an embodiment, the foot600may be welded or brazed to the inner ring610. Alternatively, the foot600may be affixed to the inner ring610with an adhesive. As another alternative embodiment, the foot600may be affixed to the inner ring610with mechanical fasteners.", "", "FIG.6Billustrates a foot630overmolded onto a support structure. The support structure may be bent at the end before the foot630is overmolded onto it. In this embodiment, the foot630is attached to an inner surface of the inner ring610. In one such embodiment, the foot630and the inner ring610are both constructed of the same material. For example, both the foot630and the inner ring610may be constructed of metal. In such an embodiment, the metal annular inner ring610is cast around the metal foot630.", "", "FIG.6Cillustrates a foot640overmolded onto a support structure. The support structure may be bent at the end before the foot640is overmolded onto it. In this embodiment, a channel is formed in the inner annular ring610and the foot640is slid into the channel. The foot640may be secured in the channel by welding, brazing, adhesive, or with mechanical fasteners. Alternatively, the foot may not be secured within the channel. In one embodiment, the inner annular ring610and the foot640are both constructed of the same material. In another embodiment, the inner annular ring610and the foot640are constructed of different materials.", "", "All of the above described attachment methods inFIG.6AthroughFIG.6Care combinable and a combination of attachment methods can be utilized in the same tire. For example, in one embodiment, one end of the overmolded foot can be attached to the inner or outer ring using a welding and the opposite end of the overmolded foot can be attached to the inner or outer ring by being slid into a channel. The overmolded foot can be attached using a welding or brazing process. In another embodiment, the foot can be attached using a friction weld. In another embodiment the foot can be attached using an adhesive. In yet another embodiment, the foot can be attached using solder.", "", "FIGS.7A-Care schematic drawings illustrating additional ways to attach a support structure to a tire. In these illustrations, the support structures are being attached to an outer ring of a tire. It should be understood that similar methods may be employed to attach a support structure to the inner ring of the tire.", "", "FIG.7Aillustrates a support structure having a bent end. A bracket700is welded to the support structure. The bracket700and the bent end of the support structure are likewise welded to on outer ring710. The welding beads are exaggerated in this figure for illustrative purposes. In this embodiment, the support structure, the bracket700, and the outer ring710are all constructed of the same material. For example, the support structure, the bracket700, and the outer ring710may be constructed of metal, such as spring steel, or of a polymeric material.", "", "FIG.7Billustrates a support structure attached to an outer ring730by brazing the end of the support structure720. The solder flow of brazing creates a large contact area, which is exaggerated in this figure for illustrative purposes. In this embodiment, the end of the support structure720and the outer ring730are constructed of the same material. For example, the end of the support structure720and the outer ring730may be constructed of metal, such as spring steel, or of a polymeric material.", "", "FIG.7Cillustrates a polymer foot740attached to a polymer wheel750. The metal spoke is formed with a hook on the end that hooks to the polymer foot. The polymer foot is attached using an adhesive. In another embodiment, the foot is attached using a heat process. In another embodiment, the foot is attached using an overmold process.", "", "After the desired number of spokes are formed, they are connected to the inner and outer rings. In one embodiment, the inner ring and the outer ring are constructed of the same material as the plurality of spokes. In an alternative embodiment, at least one of the inner ring and the outer ring is constructed of a different material from the plurality of spokes.", "", "In another alternative embodiment, the overmolded foot may be directly attached to a strip of tread rubber.", "", "To the extent that the term “includes” or “including” is used in the specification or the claims, it is intended to be inclusive in a manner similar to the term “comprising” as that term is interpreted when employed as a transitional word in a claim. Furthermore, to the extent that the term “or” is employed (e.g., A or B) it is intended to mean “A or B or both.” When the applicants intend to indicate “only A or B but not both” then the term “only A or B but not both” will be employed. Thus, use of the term “or” herein is the inclusive, and not the exclusive use. See, Bryan A. Garner, A Dictionary of Modern Legal Usage 624 (2d. Ed. 1995). Also, to the extent that the terms “in” or “into” are used in the specification or the claims, it is intended to additionally mean “on” or “onto.” Furthermore, to the extent the term “connect” is used in the specification or claims, it is intended to mean not only “directly connected to,” but also “indirectly connected to” such as connected through another component or components.", "", "While the present application has been illustrated by the description of embodiments thereof, and while the embodiments have been described in considerable detail, it is not the intention of the applicants to restrict or in any way limit the scope of the appended claims to such detail. Additional advantages and modifications will readily appear to those skilled in the art. Therefore, the application, in its broader aspects, is not limited to the specific details, the representative apparatus and method, and illustrative examples shown and described. Accordingly, departures may be made from such details without departing from the spirit or scope of the applicant's general inventive concept."], "claims": ["providing a plurality of elongated sheets of metal material; bending the plurality of elongated sheets of metal material to form a plurality of metal spokes; overmolding a first polymeric foot onto the first end of each of the plurality of metal spokes; providing an inner ring of metal material; affixing the inner ring of metal material to the first polymeric foot; providing an outer ring of metal material; affixing the outer ring of metal material to a second end of each of the plurality of metal spokes; providing tread rubber; and affixing the tread rubber to the outer ring of metal material.", "2 . The method of claim 1 , further comprising dip coating the plurality of metal spokes.", "3 . The method of claim 1 , wherein the plurality of metal spokes are bent in differing directions to form a crisscross pattern.", "4 . The method of claim 1 , further comprising bending a first end of each of the plurality of metal spokes to form a hook.", "5 . The method of claim 1 , wherein the affixing of the inner ring of metal material to the first polymeric foot includes one of welding, brazing, using an adhesive, or soldering the first polymeric foot to the inner ring of metal material.", "6 . The method of claim 1 , wherein the affixing of the inner ring of metal material to the first polymeric foot includes casting the inner ring of metal material around the first polymeric foot.", "7 . The method of claim 1 further comprising overmolding a second polymeric foot onto the second end of each of the plurality of spokes, wherein the affixing of the outer ring of metal material to the second end of each of the plurality of spokes includes affixing the outer ring of metal material to the second polymeric foot.", "8 . The method of claim 7 , wherein the affixing of the outer ring of metal material to the second polymeric foot includes one of welding, brazing, using an adhesive or soldering the second polymeric foot to the outer ring of metal material.", "9 . The method of claim 7 , wherein the affixing of the second polymeric foot to the outer ring of metal material includes casting the outer ring of metal material around the second polymeric foot.", "10 . The method of claim 7 , wherein the affixing of the inner ring of metal material to the first polymeric foot includes sliding the first polymeric foot into a channel formed in the inner ring of metal material, and wherein the affixing of the outer ring of metal material to the second polymeric foot includes sliding the second polymeric foot into a channel formed in the outer ring of metal material.", "11 . The method of claim 1 , wherein the bending of the plurality of the elongated sheets of metal material to form the plurality of metal spokes includes placing the plurality of spokes in an axially spaced formation across a width of the non-pneumatic tire.", "12 . The method of claim 1 , further comprising cutting slices in the elongated sheets of metal material.", "13 . The method of claim 1 , further comprising cutting openings in the plurality of elongated sheets of metal material.", "an inner ring of metal material; an outer ring of metal material; a plurality of bent metal spokes; a first overmolded polymeric foot formed over a first end of each bent metal spoke, each first overmolded polymeric foot being attached to the inner ring by one of brazing, welding, casting, or adhering with an adhesive; and a second overmolded polymeric foot at a second end of each bent metal spoke, each second overmolded polymeric foot being attached to the outer ring by one of brazing, welding, casting, or adhering with an adhesive.", "15 . The non-pneumatic tire of claim 14 , wherein each of the plurality of metal support structures has a hook formed at a first end.", "providing a plurality of metal support structures; overmolding a first polymeric foot onto a first end of each of the plurality of metal support structures; overmolding a second polymeric foot onto a second end of each of the plurality of metal support structures; providing an inner ring of metal material; affixing the inner ring of metal material to the first polymeric foot; providing an outer ring of metal material; affixing the outer ring of metal material to the second polymeric foot; providing tread rubber; and affixing the tread rubber to the outer ring.", "17 . The method of claim 16 , wherein the plurality of metal support structures are bent in differing directions and joined to form a crisscross pattern.", "18 . The method of claim 16 , wherein the affixing of the inner ring to the first polymeric foot includes one of welding the inner ring to the first polymeric foot, brazing the inner ring to the first polymeric foot, casting the inner ring around the first polymeric foot, adhering the inner ring to the first polymeric foot with an adhesive, or sliding the first polymeric foot into a channel formed in the inner ring.", "19 . The method of claim 16 , wherein the affixing of the outer ring to the second polymeric foot includes one of welding the outer ring to the second polymeric foot, brazing the outer ring to the second polymeric foot, casting the outer ring around the second polymeric foot, adhering the outer ring to the second polymeric foot with an adhesive, or sliding the second polymeric foot into a channel formed in the outer ring.", "20 . The method of claim 16 , further comprising dip coating the plurality of metal support structures."], "bibtex": "@patent{20240399793,\n    title = {FLEXIBLE METALLIC WEB ELEMENTS FOR NON-PNEUMATIC TIRE},\n    number = {20240399793},\n    year = {2024},\n    note = {File: US20240399793A1-20241205.XML}\n    }", "classification": "B60C714FI"}, {"title": "RADIAL TIRE", "doc_number": "20240399794", "filename": "US20240399794A1-20241205.XML", "abstract": "A radial tire includes a pair of bead cores, a carcass having one or a plurality of carcass plies extending from one of the bead cores to the other of the bead cores in a toroidal form, a tread portion circumferentially encircling the toroidal form of the carcass, and a belt structure disposed radially between the carcass and the tread portion having a main belt layer, a first, unreinforced rubber layer disposed on a radially outer side of the main belt layer, a second, unreinforced rubber layer disposed within the main belt layer, and a protective belt layer disposed on a radially outer side of the first, unreinforced rubber layer and a radially inner side of the tread portion. A radially outermost layer of the main belt layer has a plurality of reinforcement cords each having a diameter, and the first and second, unreinforced rubber layers have first and second radial thicknesses, respectively, relative to such diameter.", "detailed_description": ["FIG.1illustrates a cross-sectional view of one half of an example radial aircraft tire10of the present disclosure. The tire10is symmetrical about an equatorial plane (EP) so that only one half of the tire10is illustrated. As shown, the tire10may have a pair of bead portions12each containing a bead core14embedded therein. Each bead core14may have a circular cross-section. Each bead core14may have an aluminum, aluminum alloy, or other light weight alloy in a center portion and a plurality of steel sheath wires surrounding the center portion. A person skilled in the art may appreciate that other bead cores may also be utilized.", "", "The tire10may further comprise a sidewall portion11extending substantially radially outwardly from each of the bead portions12and a tread portion18extending substantially axially between the radially outer ends of the sidewall portions11. Furthermore, the tire10may include a carcass16toroidally extending from one of the bead portions12to the other of the bead portions12. The carcass16may include one carcass ply22or a plurality of carcass plies22, such as for example, six or more carcass plies22. In the example tire10ofFIG.1, the tire10includes six carcass plies22. The one carcass ply22or plurality of carcass plies22may be wound around the bead portions12to form turnup portions. Also, the one carcass ply22or plurality of carcass plies22may comprise rubber-coated organic fiber cords arranged in a radial direction of the tire10and retained by the bead cores14. Note that, since other structures, such as a flipper, a chafer, a chipper, etc. may be similar to conventional structures, they are not depicted inFIG.1.", "", "The one carcass ply22or each of the plurality of carcass plies22may utilize, in one example, an organic fiber cord having a tensile fracture strength of 6.3 cN/dtex or higher, an elongation percentage of 0.2 to 1.8 percent when a load is 0.2 cN/dtex in the elongating direction, an elongation percentage of 1.4 to 6.4 percent when a load is 1.0 cN/dtex in the elongating direction, and an elongation percentage of 2.1 to 8.6 percent when a load is 2.9 cN/dtex in the elongating direction. The organic fiber cord of the one carcass ply22or each of the plurality of carcass plies22may be an aromatic polyamide fiber with an inner-layer coefficient of 0.12 to 0.85, or 0.17 to 0.51, and an outer-layer coefficient of 0.4 to 0.85.", "", "The one carcass ply22or each of the plurality of carcass plies22may utilize, in another example, an organic fiber cord having a tensile fracture strength of 6.3 cN/dtex or higher, an elongation percentage of 0.2 to 2.0 percent when a load is 0.3 cN/dtex in the elongating direction, an elongation percentage of 1.5 to 7.0 percent when a load is 2.1 cN/dtex in the elongating direction, and an elongation percentage of 2.2 to 9.3 percent when a load is 3.2 cN/dtex in the elongating direction. The organic fiber cord of the one carcass ply22or each of the plurality of carcass plies22may be an aromatic polyamide fiber with an inner-layer coefficient of 0.12 to 0.85, or 0.17 to 0.51, and an outer-layer coefficient of 0.4 to 0.85.", "", "The organic fiber cord of the one carcass ply22or each of the plurality of carcass plies22may be a merged, or hybrid, cord including aromatic polyamide fiber and aliphatic polyamide fiber. The weight ratio of the aromatic polyamide fiber and the aliphatic polyamide fiber may be from 100:27 to 100:255. Additionally, nylon may be used for part or all of the merged cord.", "", "The example aircraft radial tire10may also have a belt structure20arranged radially between the carcass16and the tread portion18.FIGS.1and2illustrate an example of one half of a belt structure20suitable for use in the example tire10. The belt structure20may have an overall axial width AW. The belt structure20may include a main belt layer26and a protective belt layer28. The main belt layer26may be disposed radially inward of the protective belt layer28, such that the main belt layer26is disposed on a radially inner side of the belt structure20and the protective belt layer28is disposed on a radially outer side of the belt structure20. The main belt layer26may have an axial width AWM, and the protective belt layer28may have an axial width AWP. In the example ofFIGS.1and2, the axial width AWM of the main belt layer26is the overall axial width AW of the belt structure20. The axial width AWP of the protective belt layer28may be smaller or larger relative to the axial width AWM of the main belt layer26. In some examples, a ratio of the axial width AWP of the protective belt layer28and the axial width AWM of the main belt layer26may be between 0.30 and 1.10. In other examples, the axial width AWP of the protective belt layer28may be 72 percent of the axial width AWM of the main belt layer26.", "", "The main belt layer26may include a plurality of belt plies, in a range of, for example, from two to 16 belt plies. The widths of the belt plies may be the same or vary relative to each other. Additionally, in one example, each of the plurality of belt plies of the main belt layer26may be formed with a plurality of reinforcement cords, wherein the plurality of reinforcement cords includes one or a plurality of organic fiber cords. Further, in another example, a radially outermost belt ply of the main belt layer26may be formed with a plurality of reinforcement cords, wherein the plurality of reinforcement cords includes one or a plurality of organic fiber cords. In either of the foregoing examples, the plurality of reinforcement cords may have a diameter. The diameter of each of the plurality of reinforcement cords may be 1.02 mm. Also, in either of the foregoing examples, the plurality of reinforcement cords may have a cord angle in a range of between 1 and 45 degrees, or 10 and 45 degrees, with respect to an equatorial plane EP of the tire10. Also, in either of the foregoing examples, if the plurality of reinforcement cords includes a plurality of organic fiber cords, the density of the plurality of organic fiber cords may be in a range of between 4.0 cords/10 mm to 10.0 cords/10 mm, or 7.0 cords/10 mm.", "", "In examples where the plurality of reinforcement cords of the main belt layer26includes one or a plurality of organic fiber cords, the one or plurality of organic fiber cords may be a merged or hybrid cord, including aromatic polyamide fiber and aliphatic polyamide fiber. The weight ratio of the aromatic polyamide fiber and the aliphatic polyamide fiber may be from 100:27 to 100:255. Additionally, nylon may be used for part or all of the example merged cord.", "", "The protective belt layer28may be formed of one belt ply or a plurality of belt plies. Additionally, in one example, the one or plurality of belt plies of the protective belt layer28may be formed with a plurality of reinforcement cords, wherein the plurality of reinforcement cords includes one or a plurality of organic fiber cords. The one or plurality of organic fiber cords may be each coated with rubber to form band-like thin bodies wound such that, whenever the thin bodies are wound once, or 360 degrees, the thin bodies may reciprocate between both axial ends of the belt plies, and the thin bodies may be inclined at an angle of 0 to 45 degrees with respect to the equatorial plane (EP) of the tire10, and this winding may be carried out many times while offsetting the thin bodies as substantially the same distance as their widths in the circumferential direction of the tire10such that no gap is generated between the thin bodies (this is called endless zigzag-wound belt, hereinafter), as disclosed in U.S. Pat. No. 7,712,499, hereby incorporated by reference in its entirety. As a result, the one or plurality of organic fiber cords, extending in substantially the circumferential direction of the tire10in a zigzag manner, may be embedded in the entire region of the one or plurality of belt plies of the protective belt layer28substantially uniformly by changing the bending direction at both axial ends of the belt plies. The plurality of reinforcement cords of the one or plurality of belt plies of the protective belt layer28may also have a cord angle, which may be greater than the cord angle of the one or plurality of organic fiber cords of the plurality of belt plies of the main belt layer26.", "", "In the protective belt layer28, the plurality of reinforcement cords, which in some examples may be one or a plurality of organic fiber cords, may have an elastic modulus equal to or less than that of the clastic modulus of the plurality of reinforcement cords, which may be one or a plurality of organic fiber cords, of the main belt layer26. Example organic fiber cords of the protective layer28may include an aliphatic polyamide fiber, such as nylon, or a merged cord with an aromatic polyamide fiber, such as aramid, and an aliphatic polyamide fiber, such as nylon. The protective belt layer28may include an endless zigzag-wound belt having a cord angle of the one or plurality of organic fiber cords being in a range of 0 to 45 degrees with respect to the tire equatorial plane, or an angle of 10 degrees.", "", "As shown inFIGS.1and2, the example aircraft radial tire10may additionally include a first, unreinforced (e.g., lacking cord reinforcement, etc.) rubber layer30. In one example, the first, unreinforced rubber layer30may be disposed on a radially outer side of the main belt layer26, or radially between the main belt layer26and the protective belt layer28. The first unreinforced rubber layer30may have an axial width AW1. A minimum radial thickness of the first, unreinforced rubber layer30may be in a range of 2.0 mm to 10.0 mm, or 4.6 mm to 10.0 mm, or 4.5 mm. The first, unreinforced rubber layer30may also comprise a plurality of layers with an overall thickness within the above ranges, or more specifically, the first, unreinforced rubber layer30may have a radial thickness in a range of between 0.5 and 4.0 times the diameter of the plurality of reinforcement cords of the main belt layer26. The protective belt layer28may be disposed on a radially outer side of the first, unreinforced rubber layer30and a radially inner side of a tread portion18.", "", "Moreover, as shown inFIGS.1and2, the example tire10may include a second, unreinforced rubber layer32. In one example, the second, unreinforced rubber layer32may be disposed within the main belt layer26, and thus, radially inward relative to the first, unreinforced rubber layer30. In another example, the second, unreinforced rubber layer32may be disposed within the main belt layer26between any two, adjacent belt plies of the plurality of belt plies of the main belt layer26. In another example, the second, unreinforced rubber layer32may be disposed within the main belt layer26between two, radially outer, adjacent belt plies of the plurality of belt plies of the main belt layer26. Further, in some examples, the example aircraft radial tire10may also include a third, unreinforced rubber layer34, similar to the second, unreinforced rubber layer32. In such examples, the second, unreinforced rubber layer32may be disposed between two, adjacent belt plies of the plurality of belt plies of the main belt layer26, and the third, unreinforced rubber layer34may be disposed between any two, adjacent belt plies of the plurality of belt plies of the main belt layer26that are radially inward or radially outward from those of the second, unreinforced rubber layer32. A minimum thickness of the second and third, unreinforced rubber layers32,34may be in a range of 1.0 mm to 4.0 mm, or 2.0 mm. Also, in some examples, the second and third, unreinforced rubber layers32,34may each include a plurality of layers. In such examples, an overall thickness of each second and third, unreinforced rubber layer32,34may be within the above ranges, or more specifically, each second and third, unreinforced rubber layer32,34may have a radial thickness in a range of between 0.5 and 2.5 times the diameter of the plurality of reinforcement cords of the main belt layer26. Additionally, the second and third, unreinforced rubber layers32,34may each have an axial width AW2, AW3, respectively. The axial width AW2, AW3 of each of the second and third, unreinforced rubber layer32,34may be in a range of between 0.3 and 1.1 times the overall axial width AW of the belt structure20, or as shown inFIGS.1and2, the axial width AWM of the main belt layer26.", "", "In the example ofFIGS.1and2, the first, unreinforced rubber layer30is disposed radially outward of the main belt layer26, the second, unreinforced rubber layer32is disposed radially between two, adjacent belt plies of the plurality of belt plies of the main belt layer26, and the third, unreinforced rubber layer34is disposed between two, adjacent belt plies of the plurality of belt plies of the main belt layer26that are radially outward from belt plies between which the second, unreinforced rubber layer32is disposed.", "", "The example radial tire10of example ofFIG.3is the same as the tire10inFIGS.1and2in all respects except that it includes only the first, unreinforced rubber layer30and the second, unreinforced rubber layer32. In particular, the first, unreinforced rubber layer30is disposed radially outward of the main belt layer26and the second, unreinforced rubber layer32is disposed radially between two, adjacent belt plies of the plurality of belt plies of the main belt layer26.", "", "The above configurations of the rubber layers30,32,34result in an improved method of repairing the example aircraft radial tire10after penetration by a foreign object through the tread portion18, the protective belt layer28, the first, unreinforced rubber layer30, and into the main belt layer26and the second, unreinforced rubber layer32and third, unreinforced rubber layer34(or, in other examples, such as inFIG.3, only the second, unreinforced rubber layer32). The repair process may involve removing the foreign object that has penetrated the foregoing portions of the tire10. Then, the process may include buffing a surface of the first, unreinforced rubber layer30as well as within the cut damaged area using any suitable buffing means. Next, the process may include filling the cut damaged area with a repair rubber. When the example aircraft radial tire10is penetrated by the foreign object as far as into the main belt layer26and the second, unreinforced rubber layer32and the third, unreinforced rubber layer34(or, in other examples, only the second, unreinforced rubber layer32), the adhesion of the repair rubber is improved as it can adhere to the second, unreinforced rubber layer32and third, unreinforced rubber layer34(or, in other examples, only the second, unreinforced rubber layer32).", "", "If the thickness of the rubber layers30,32,34is too small, when retreading the tire10, it may become difficult to remove the rubber layers30,32,34without damaging the main belt layer26. Conversely, if the thickness of the rubber layers30,32,34is too large, not only does the weight of the tire increase, but heat generation of the tread portion18also increases, which are both disadvantageous for the performance of the tire10. The thickness of the first, unreinforced rubber layer30may allow removal of the protective layer28during retread operations.", "", "The tire10according to the present disclosure has been described in detail. However, the present disclosure is not limited to the above example, and various modifications of the example may also apply. Numerous modifications and variations of the present disclosure are possible in light of the above teachings. It is therefore to be understood that within the scope of the appended claims, the present disclosure may be practiced otherwise than as specifically and exemplarily described herein.", "", "Further, variations in the present disclosure are possible in light of the description of it provided herein. While certain representative embodiments and details have been shown for the purpose of illustrating the subject disclosure, it will be apparent to those skilled in this art that various changes and modifications can be made therein without departing from the scope of the subject disclosure. It is, therefore, to be understood that changes may be made in the particular examples described which will be within the fully intended scope of the present disclosure as defined by the following appended claims."], "claims": ["a pair of bead cores; a carcass having one or a plurality of carcass plies extending from one of the bead cores to the other of the bead cores in a toroidal form; a tread portion circumferentially encircling the toroidal form of the carcass; and a belt structure disposed radially between the carcass and the tread portion having a main belt layer, a first, unreinforced rubber layer disposed on a radially outer side of the main belt layer, a second, unreinforced rubber layer disposed within the main belt layer, and a protective belt layer disposed on a radially outer side of the first, unreinforced rubber layer and a radially inner side of the tread portion, a radially outermost belt ply of the main belt layer having a plurality of reinforcement cords each having a diameter, the first, unreinforced rubber layer having a first radial thickness between 0.5 and 4.0 times the diameter of the plurality of reinforcement cords of the radially outermost belt ply of the main belt layer, the second, unreinforced rubber layer having a second radial thickness between 0.5 and 2.5 times the diameter of the plurality of reinforcement cords of the radially outermost belt ply of the main belt layer, and wherein the second, unreinforced rubber layer has a second axial width in a range between 0.5 and 1.1 times an overall axial width of the belt structure, and wherein the first, unreinforced rubber layer has a first axial width that is greater than the overall axial width of the belt structure.", "2 . The radial tire of claim 1 , wherein the second, unreinforced rubber layer has a second radial thickness between 0.5 and 1.5 times the diameter of the plurality of reinforcement cords of the radially outermost belt ply of the main belt layer.", "3 . (canceled)", "4 . The radial tire of claim 1 , wherein the first, unreinforced rubber layer has a first radial thickness in a range of between 0.5 and 3.0 times the diameter of the plurality of reinforcement cords of the radially outermost belt ply of the main belt layer.", "5 . The radial tire of claim 1 , wherein the plurality of reinforcement cords of the radially outermost belt ply of the main belt layer is a plurality of organic fiber, merged cords.", "6 . The radial tire of claim 1 , wherein the carcass has organic fiber cords.", "7 . The radial tire of claim 1 , further comprising a third, unreinforced rubber layer disposed within the main belt layer radially inward of the second, unreinforced rubber layer.", "8 . The radial tire of claim 1 , further comprising a third, unreinforced rubber layer disposed within the main belt layer radially outward of the second, unreinforced rubber layer.", "9 . The radial tire of claim 7 , wherein the third, unreinforced rubber layer has a third radial thickness in a range of between 0.5 and 2.5 times the diameter of the plurality of reinforcement cords of the radially outermost belt ply of the main belt layer.", "10 . The radial tire of claim 8 , wherein the third, unreinforced rubber layer has a third radial thickness in a range of between 0.5 and 2.5 times the diameter of the plurality of reinforcement cords of the radially outermost belt ply of the main belt layer.", "11 . The radial tire of claim 7 , wherein the third, unreinforced rubber layer has a third radial thickness in a range of between 0.5 and 1.5 times the diameter of the plurality of reinforcement cords of the radially outermost belt ply of the main belt layer.", "12 . The radial tire of claim 8 , wherein the third, unreinforced rubber layer has a third radial thickness in a range of between 0.5 and 1.5 times the diameter of the plurality of reinforcement cords of the radially outermost belt ply of the main belt layer.", "13 . The radial tire of claim 7 , wherein the third, unreinforced rubber layer has a third axial width between 0.5 and 1.1 times an overall axial width of the belt structure.", "14 . The radial tire of claim 8 , wherein the third, unreinforced rubber layer has a third axial width between 0.5 and 1.1 times an overall axial width of the belt structure.", "a pair of bead cores; a carcass having one or a plurality of carcass plies extending from one of the bead cores to the other of the bead cores in a toroidal form; a tread portion circumferentially encircling the toroidal form of the carcass; and a belt structure disposed radially between the carcass and the tread portion having a main belt layer, a first, unreinforced rubber layer disposed on a radially outer side of the main belt layer, a second, unreinforced rubber layer disposed within the main belt layer, a third, unreinforced rubber layer disposed within the main belt layer, and a protective belt layer disposed on a radially outer side of the first, unreinforced rubber layer and a radially inner side of the tread portion, a radially outermost belt ply of the main belt layer having a plurality of reinforcement cords each having a diameter, the first, unreinforced rubber layer having a first radial thickness between 0.5 and 4.0 times the diameter of the plurality of reinforcement cords of the radially outermost belt ply of the main belt layer, the second, unreinforced rubber layer having a second radial thickness between 0.5 and 2.5 times the diameter of the plurality of reinforcement cords of the radially outermost belt ply of the main belt layer, the third, unreinforced rubber layer having a third radial thickness between 0.5 and 2.5 times the diameter of the plurality of reinforcement cords of the radially outermost belt ply of the main belt layer, and wherein the second, unreinforced rubber layer has a second axial width in a range between 0.5 and 1.1 times an overall axial width of the belt structure, and wherein the first, unreinforced rubber layer has a first axial width that is greater than the overall axial width of the belt structure.", "16 . The radial tire of claim 15 , wherein the third, unreinforced rubber layer is disposed radially inward of the second, unreinforced rubber layer.", "17 . The radial tire of claim 15 , wherein the third, unreinforced rubber layer is disposed radially outward of the second, unreinforced rubber layer.", "18 . The radial tire of claim 15 , wherein the second, unreinforced rubber layer has a second radial thickness in a range of between 0.5 and 1.5 times the diameter of the plurality of reinforcement cords of the radially outermost belt ply of the main belt layer.", "19 . The radial tire of claim 15 , wherein the third, unreinforced rubber layer has a third radial thickness in a range of between 0.5 and 1.5 times the diameter of the plurality of reinforcement cords of the radially outermost belt ply of the main belt layer.", "20 . The radial tire of claim 15 , wherein the third, unreinforced rubber layer has a third axial width in a range between 0.5 and 1.1 times an overall axial width of the belt structure."], "bibtex": "@patent{20240399794,\n    title = {RADIAL TIRE},\n    number = {20240399794},\n    year = {2024},\n    note = {File: US20240399794A1-20241205.XML}\n    }", "classification": "B60C920FI"}, {"title": "PNEUMATIC RADIAL TIRE FOR PASSENGER VEHICLES", "doc_number": "20240399795", "filename": "US20240399795A1-20241205.XML", "abstract": "The pneumatic radial tire for passenger vehicles of this disclosure comprises a belt consisting of one or more belt layers, a tread, and a communication device. A cross-sectional width SW and an outer diameter OD of the tire satisfy a predetermined relationship, belt cords constituting the belt layer are non-metallic cords, and the communication device is installed in the tread.", "detailed_description": ["The following is a detailed illustration of the embodiment of the present disclosure with reference to the drawings.", "", "FIG.1is a schematic diagram illustrating the cross-sectional width SW and the outer diameter OD of the tire.", "", "A pneumatic radial tire for passenger vehicles (hereinafter referred to simply as “tire”) of one embodiment of the present disclosure has a cross-sectional width SW of less than 165 (mm) and a ratio SW/OD of the cross-sectional width SW to an outer diameter OD of the tire is 0.26 or less, forming a narrow width and large diameter. By making the cross-sectional width SW of the tire relatively narrower than the outer diameter OD of the tire, air resistance can be reduced. At the same time, by making the outer diameter OD of the tire relatively larger than the cross-sectional width SW of the tire, rolling resistance can be reduced by suppressing deformation of the tread rubber near the ground contact patch of the tire. These can improve the fuel efficiency of the tire. The above SW/OD is preferably 0.25 or less, and more preferably 0.24 or less.", "", "The above ratio is preferably satisfied when the internal pressure of the tire is 200 kPa or higher, more preferably when it is 220 kPa or higher, and even more preferably when it is 280 kPa or higher. This is because rolling resistance can be reduced. On the other hand, the above ratio is preferably satisfied when the internal pressure of the tire is 350 kPa or less. This is because ride comfort can be improved.", "", "Here, the cross-sectional width SW of the tire is preferably 105 to 145 mm, and 115 to 135 mm is more preferred.", "", "In addition, the aspect ratio of the tire is preferably 45 to 70 when the cross-sectional width SW and the outer diameter OD of the tire meet the above ratio, and 45 to 65 is more preferred.", "", "Specific tire sizes are not limited, but can be 105/50R16, 115/50R17, 125/55R20, 125/60R18, 125/65R19, 135/45R21, 135/55R20, 135/60R17, 135/60R18, 135/60R19, 135/65R19, 145/45R21, 145/55R20, 145/60R16, 145/60R17, 145/60R18, 145/60R19, 145/65R19, 155/45R18, 155/45R21, 155/55R18, 155/55R19, 155/55R21, 155/60R17, 155/65R18, 155/70R17, or 155/70R19, as an example.", "", "Alternatively, the cross-sectional width SW of the tire is less than 165 mm, and the cross-sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the relational expression:", "", "OD(mm)≥−0.0187×SW(mm)2+9.15×SW(mm)−380,", "", "and the tire has a narrow width and a large diameter.", "", "By satisfying the above relational expression, air resistance and rolling resistance can be reduced, thereby improving the fuel efficiency of the tire.", "", "In the third form, as for the cross-sectional width SW and the outer diameter OD of the tire, the ratio SW/OD is preferably 0.26 or less, more preferably 0.25 or less, and even more preferably 0.24 or less, after satisfying the above relational expression. This is because the fuel efficiency of the tire can be further improved.", "", "The above relational expression and/or the ratio is preferably satisfied when the internal pressure of the tire is 200 kPa or higher, more preferably when it is 220 kPa or higher, and even more preferably when it is 280 kPa or higher. This is because rolling resistance can be reduced. On the other hand, the above relational expression and/or the ratio is preferably satisfied when the internal pressure of the tire is 350 kPa or less. This is because ride comfort can be improved.", "", "Here, the cross-sectional width SW of the tire is preferably 105 to 145 mm, and 115 to 135 mm is more preferred.", "", "In addition, the aspect ratio of the tire is preferably 45 to 70 when the cross-sectional width SW and the outer diameter OD of the tire satisfy the above relational expression, and 45 to 65 is more preferred.", "", "Specific tire sizes are not limited, but can be 105/50R16, 115/50R17, 125/55R20, 125/60R18, 125/65R19, 135/45R21, 135/55R20, 135/60R17, 135/60R18, 135/60R19, 135/65R19, 145/45R21, 145/55R20, 145/60R16, 145/60R17, 145/60R18, 145/60R19, 145/65R19, 155/45R18, 155/45R21, 155/55R18, 155/55R19, 155/55R21, 155/60R17, 155/65R18, 155/70R17, or 155/70R19, as an example.", "", "The tire of this embodiment is a pneumatic radial tire for passenger vehicles. This tire is particularly suitable for use as a tire mounted on a vehicle for personal mobility.", "", "FIG.2is a cross-sectional view in the tire width direction of a pneumatic radial tire for passenger vehicles according to one embodiment of this disclosure.FIG.2illustrates a cross-sectional view in the width direction of the tire under reference condition, with the tire mounted on a rim, filled to the prescribed internal pressure, and unloaded. As illustrated inFIG.2, the tire1comprises a carcass3consisting of plies of radially arranged cords that straddle toroidally between a pair of bead portions2. The tire1also comprises a belt4consisting of two belt layers4aand4bin the illustrated example, and a tread5, in this order, on the outer side of the carcass3in the tire radial direction.", "", "The aforementioned “rim” refers to the standard rim in the applicable size (Measuring Rim in ETRTO's STANDARDS MANUAL and Design Rim in TRA's YEAR BOOK) as described or as may be described in the future in the industrial standard, which is valid for the region in which the tire is produced and used, such as JATMA YEAR BOOK of JATMA (Japan Automobile Tyre Manufacturers Association) in Japan, STANDARDS MANUAL of ETRTO (The European Tyre and Rim Technical Organization) in Europe, and YEAR BOOK of TRA (The Tire and Rim Association, Inc.) in the United States (That is, the “rim section” of the above “wheel” includes current sizes as well as future sizes to be listed in the aforementioned industrial standards. An example of the “size as described in the future” could be the sizes listed as “FUTURE DEVELOPMENTS” in the ETRTO 2013 edition). For sizes not listed in these industrial standards, the “rim” refers to a rim with a width corresponding to the bead width of the tire.", "", "In addition, the “prescribed internal pressure” refers to the air pressure (maximum air pressure) corresponding to the maximum load capacity of a single wheel in the applicable size and ply rating, as described in the aforementioned JATMA, and others. In the case that the size is not listed in the aforementioned industrial standards, the “prescribed internal pressure” refers to the air pressure (maximum air pressure) corresponding to the maximum load capacity specified for each vehicle in which the tire is mounted.", "", "The “maximum load” described below means the load corresponding to the maximum load capacity described above.", "", "In this example, bead cores2aare embedded in each of the pair of bead portions2. In the present disclosure, the cross-sectional shape and material of the bead core2aare not particularly limited, and can be of the configuration normally used in pneumatic radial tires for passenger vehicles. In the present disclosure, the bead core2amay be divided into a plurality of small bead cores. Alternatively, in the present disclosure, the tire can be configured without the bead core2a.", "", "The tire1in the illustrated example has an abbreviated triangular-shaped bead filler2bin cross section on the outer side of the bead core2ain the tire radial direction. The cross-sectional shape of the bead filler2bis not limited to this example, nor is its material. Alternatively, the tire can be made lighter by not having the bead filler2b.", "", "In this embodiment, the tire1can also be configured with a rim guard. In addition, in this embodiment, the bead portion2can be further provided with an additional reinforcement member such as a reinforcement rubber or a cord layer for reinforcement or other purposes. Such additional members can be provided in various positions relative to the carcass3and the bead filler2b.", "", "In the example illustrated inFIG.2, the carcass3consists of a single carcass ply. On the other hand, the number of carcass plies in the present disclosure is not limited and can be two or more. In the example illustrated inFIG.2, the carcass3has a carcass body portion3athat straddles toroidally between the pair of bead portions2and carcass turn-up portions3bthat is folded around the bead core2afrom the carcass body portion3a. On the other hand, in the present disclosure, the carcass turn-up portions3bcan be wrapped around the bead core2a, or these can be sandwiched between a number of divided small bead cores. In the illustration, the end3cof the carcass turn-up portion3bis located on the outer side in the tire radial direction than the tire radially outer end of the bead filler2band on the inner side in the tire radial direction than the tire maximum width position. This makes it possible to reduce the weight of the tire while ensuring the rigidity of the sidewall portion. On the other hand, in the present disclosure, the end3cof the carcass turn-up portion3bmay be located on the inner side in the tire radial direction than the tire radially outer end of the bead filler2b, or on the outer side in the tire radial direction than the tire maximum width position. Alternatively, the end3cof the carcass turn-up portion3bcan be of an envelope structure, in which it is positioned between the carcass body portion2aand the belt4in the tire radial direction, and is positioned inner side in the tire width direction than the end of the belt4(e.g., the end of the belt layer4b). Furthermore, when the carcass3is constituted by a plurality of carcass plies, the position of the end3cof the carcass turn-up portions3b(e.g., in the tire radial direction) can be the same or different among the carcass plies. The number of cords in the carcass3is not particularly limited, but can be in the range of 20 to 60 cords/50 mm, for example. In addition, various structures can be used for the carcass lines. For example, in the tire radial direction, the carcass maximum width position can be moved closer to the bead portion2side or to the tread portion5side. For example, the carcass maximum width position can be provided at the position in the range of 50% to 90% of the tire cross-sectional height from the bead baseline toward the outer side in the tire radial direction. The above-mentioned “radially arranged” means at least 85° with respect to the tire circumferential direction, preferably 90° with respect to the tire circumferential direction.", "", "The tire of this embodiment preferably has one or more inclined belt layers consisting of a rubberized layer of cords extending at an angle with respect to the tire circumferential direction. It is most preferable to have two layers for the combination of weight reduction and suppression of distortion of the shape of the contact patch. From the viewpoint of weight reduction, one belt layer can be used, and from the viewpoint of suppressing distortion of the shape of the contact patch, three or more layers can be used. In the example illustrated inFIG.2, of the two belt layers4aand4b, the tire widthwise width of the belt layer4bwhich locates on the outer side in the tire radial direction is smaller than that of the belt layer4awhich is locates on the inner side in the tire radial direction. On the other hand, the tire widthwise width of the belt layer4bwhich locates on the outer side in the tire radial direction can be larger than or the same as that of the belt layer4awhich locates on the inner side in the tire radial direction. The tire widthwise width of the belt layer with the largest tire widthwise width (belt layer4ain the illustrated example) is preferably 90 to 115% of the ground contact width, and especially preferred when it is 100 to 105% of the ground contact width. Note, that the “ground contact width” refers to the distance in the tire width direction between the above-mentioned ground contact edges E.", "", "In this embodiment, the belt cords constituting the belt layers4aand4bare non-metallic cords. An example of the non-metallic cord is an organic fiber cord such as Kevlar® (Kevlar is a registered trademark in Japan, other countries, or both) nylon or aramid, etc.", "", "In this embodiment, the inclination angle of the belt cords of the belt layers4aand4bis preferably 10° or more with respect to the tire circumferential direction. In this embodiment, the inclination angle of the belt cords of the belt layers4aand4bshould be at a high angle, it is specifically 20° or more with respect to the tire circumferential direction, preferably 35° or more, and especially in a range of 55° to 85° with respect to the tire circumferential direction. This is because an inclination angle of 20° or more (preferably 35° or more) increases the rigidity of the tire in the tire width direction and improves the handling stability performance, especially during cornering. In addition, this is because shear deformation of the interlayer rubber can be reduced to reduce rolling resistance.", "", "In the illustrated example, the tread rubber constituting the tread5consists of single layer. On the other hand, in this embodiment, the tread rubber constituting the tread5may be formed by a plurality of different rubber layers laminated in the tire radial direction. For the above plurality of rubber layers, rubbers with different tangent loss, modulus, hardness, glass transition temperature, material, etc. can be used. The ratio of the thicknesses in the tire radial direction of the plurality of rubber layers may vary in the tire width direction, and only the bottom of the circumferential main groove, etc. may have a different rubber layer than the surrounding area. In addition, the tread rubber constituting the tread5may be formed by a plurality of rubber layers that differ in the tire width direction. For the above plurality of rubber layers, rubbers with different tangent loss, modulus, hardness, glass transition temperature, material, etc. can be used. The ratio of the tire widthwise width of the plurality of rubber layers may vary in the tire radial direction, and only some limited areas, such as only near the circumferential main groove, only near the ground contact edge, only in the shoulder land portion, and only in the center land portion, can have a different rubber layer than the surrounding area.", "", "In the illustrated example, this tire1has three circumferential main grooves6extending in the tire circumferential direction. Specifically, the tire1has one circumferential main groove6on the tire equatorial plane CL and one circumferential main groove6on each shoulder area on both sides of the tire equatorial plane CL in the tire width direction. The width (opening width) of the circumferential main grooves6is not limited, but can be 2 mm to 5 mm, for example. In the present disclosure, the number and arrangement of the circumferential main grooves6are not particularly limited to the above examples. In addition, width direction grooves extending in the tire width direction, and sipes that is closed when touching the ground can also be provided as needed.", "", "The tire1of this embodiment has an inner liner8on the inner surface7of the tire (also referred to simply as the tire inner surface7). The thickness of the inner liner8is preferably about 1.5 mm to 2.8 mm. This is because it can effectively reduce vehicle interior noise in the 80 to 100 Hz range. The air permeability coefficient of the rubber composition constituting the inner liner8is preferably 1.0×10−14cc-cm/(cm2-s-cmHg) or higher and 6.5×10−10cc-cm/(cm2-s-cmHg) or lower.", "", "Here, as illustrated inFIG.2, the tire comprises a communication device9. The communication device9need only be capable of wireless communication with a predetermined device outside the tire1, and the configuration of the communication device9is not limited. In this embodiment, the communication device9is an RF tag. The RF tag is also referred to as an RFID (Radio Frequency Identification) tag. The communication device9may be configured to include, for example, an IC chip that constitutes a control section and a storage section, and one or more antennas connected to the IC chip. For example, the communication device9may have an overall longitudinal shape with two antennas extending in a straight, wavy, or spiral shape extending in opposite directions from the IC chip. The IC chip may also be operated by induced electromotive forces generated by electromagnetic waves received by one or more antennas. In other words, the communication device9may be a passive communication device. Alternatively, the communication device9may further comprise a battery and be able to communicate by generating electromagnetic waves with its own power. In other words, the communication device9may be an active communication device. Note, that the communication device9may be covered by coating rubber. The communication device9can be a sensor (e.g., a sensor capable of detecting tire temperature), etc., in addition to an RF tag.", "", "In this embodiment, the communication device9is provided in the tread5, more specifically, it is provided on the outer side in the tire radial direction than the belt layer4b, which is the outermost belt layer in the tire radial direction among one or more belt layers.", "", "The following is an explanation of the effects of the pneumatic radial tire for passenger vehicles of this embodiment.", "", "First, in the pneumatic radial tire for passenger vehicles of this embodiment, the cross-sectional width SW is less than 165 (mm) and the ratio SW/OD of the cross-sectional width SW to the outer diameter OD of the tire is 0.26 or less (or, the relational expression, OD (mm)≥−0.0187×SW (mm)2+9.15×SW (mm)−380 (mm), is satisfied). This improves the fuel efficiency of the tire, as described above. By the way, in tires with a narrow width and a large diameter, in which SW and OD are in the above relationship, the deformation of the tread5is smaller than in tires with a wide width and a high aspect ratio. Therefore, even if a communication device9is provided in this area, it is less likely to be subjected to large deformation, and the durability of the communication device9can be improved. Furthermore, by disposing it in the tread5(especially on the outer side in the tire radial direction than the belt layer4b, which is the outermost belt layer), the communication from the road surface is improved. Here, if the belt cords are metallic cords such as steel cords, there is a risk that the communication of the communication device9provided in the tread5may be inhibited by the belt layer. However, in this embodiment, since a non-metallic cord is used for the belt cords constituting the belt layer, the communication of the communication device9provided in the above positions is not interfered with.", "", "Furthermore, since the communication device9is disposed in the tread (on the outer side in the tire radial direction than the belt layer4b, which is the outermost belt layer), it is easier to perform maintenance on the communication device9when retreading.", "", "Thus, the pneumatic radial tire for passenger vehicles in this embodiment allow both durability and communication performance of the communication device.", "", "In the example above, it is preferable that the tire has one or two circumferential main grooves extending in the tire circumferential direction, or does not have the circumferential main grooves, on a surface of the tread. This is because this configuration provides space for the communication device9to be embedded and also makes it easier to protect the communication device9. Since the communication device9can be replaced together when retreading, the driving history, retreading history, and tread information, etc. can be stored. Here, the “surface” of the tread means the outer surface around the entire circumference of the tire that is in contact with the road surface when the tire is assembled on a rim, filled with prescribed internal pressure, and rolled under a maximum load. In addition, the “circumferential main groove” means a groove with a width (opening width) of 2 mm or more. Furthermore, “extending in the tire circumferential direction” includes cases where it extends in the circumferential direction as well as at an angle of 5° or less with respect to the tire circumferential direction, and in various shapes such as straight, zigzag, etc."], "claims": ["a cross-sectional width SW of the tire is less than 165 (mm), and a ratio SW/OD of the cross-sectional width SW to an outer diameter OD of the tire is 0.26 or less, belt cords constituting the belt layer are non-metallic cords, and the communication device is provided in the tread.", "a cross-sectional width SW of the tire is less than 165 (mm), the cross-sectional width SW (mm) and an outer diameter OD (mm) of the tire satisfy a relational expression: belt cords constituting the belt layer are non-metallic cords, and the communication device is provided in the tread.", "3 . The pneumatic radial tire for passenger vehicles according to claim 1 , having one or two circumferential main grooves extending in a tire circumferential direction, or not having the circumferential main grooves, on a surface of the tread.", "4 . The pneumatic radial tire for passenger vehicles according to claim 1 , wherein the communication device is an RF tag.", "5 . The pneumatic radial tire for passenger vehicles according to claim 2 , having one or two circumferential main grooves extending in a tire circumferential direction, or not having the circumferential main grooves, on a surface of the tread.", "6 . The pneumatic radial tire for passenger vehicles according to claim 2 , wherein the communication device is an RF tag.", "7 . The pneumatic radial tire for passenger vehicles according to claim 3 , wherein the communication device is an RF tag.", "8 . The pneumatic radial tire for passenger vehicles according to claim 5 , wherein the communication device is an RF tag."], "bibtex": "@patent{20240399795,\n    title = {PNEUMATIC RADIAL TIRE FOR PASSENGER VEHICLES},\n    number = {20240399795},\n    year = {2024},\n    note = {File: US20240399795A1-20241205.XML}\n    }", "classification": "B60C920FI"}, {"title": "THREE-DIMENSIONAL TIRE SIPE", "doc_number": "20240399796", "filename": "US20240399796A1-20241205.XML", "abstract": "Various embodiments of a tire having a three-dimensional tire sipe are disclosed. In one embodiment, a tire having a sipe is provided, the tire comprising: opposing tread element portions separated by the sipe, each opposing tread element portion including a plurality of positive elements and a plurality of negative elements, wherein the plurality of positive elements and the plurality of negative elements include three substantially quadrilateral-shaped planar surfaces, each planar surface being oriented relative to another planar surface by an angle of 90 degrees, wherein the three planar surfaces meet at a rounded terminal portion, wherein the sipe includes a radially outer zig-zag portion, wherein the sipe includes a radially inner three-dimensional portion radially inward of the radially outer zig-zag portion, and wherein the sipe includes a radially inner zig-zag portion radially inward of the radially inner three-dimensional portion.", "detailed_description": ["Tires not intended for operation on smooth, dry surfaces typically comprise a tread pattern, including a least one groove, at least one rib, and/or a plurality of tread blocks. Tires intended for operation in inclement conditions, including for example icy or snowy conditions, may additionally comprise a plurality of sipes in the tire tread. The addition of sipes in the tire tread may result in more surface edges in the tire tread for engagement with the icy or snowy roadway.", "", "Increasing the length of a sipe, such as providing the sipe with a three-dimensional pattern, may increase the amount of cutting edges available to engage snowy, icy, and/or wet road surfaces.", "", "Providing the sipe with a three-dimensional pattern in at least one of the lateral direction of the tire and the radial direction of the tire, may allow opposing walls of the sipe to at least partially engage one another in a high friction, or locking, manner to maintain a desired stiffness of the tire tread block or tire tread rib. Maintaining a specified level of stiffness in the tire tread may mitigate or eliminate irregular wear patterns. Maintaining a specified level of stiffness in the tire tread may improve stopping distance of the tire. Maintaining a specified level of stiffness in the tire tread may improve traction of the tire.", "", "However, sipe blades used to form sipes having the desired traction while maintaining the desired block stiffness may be difficult to draw out of a tire after molding and curing (tire mold extraction). This results from the amount of surface area of the sipe blade at its distal portion, which forms the radially innermost portion of the tire after molding and curing.", "", "FIG.1Aillustrates a prior art sipe blade100for forming a three-dimensional tire sipe. Blade100may include a radially outer zig-zag portion101, and a radially inner three-dimensional portion102. Blade100may include a central plane103, and a base104.", "", "Blade100may be used in conjunction with a mold to mold a three-dimensional sipe into a tire. The use of blade100results in the creation of a negative of blade100being formed in a sipe of a tire, creating the three-dimensional sipe.", "", "Blade100is formed using a thin sheet of material pressed into a desired shape, and generally having a material thickness that is consistent at least through radially outer zig-zag portion101and radially inner three-dimensional portion102. In this manner, it is understood that a feature that is positive (i.e., extending out of blade100on a first side of blade100) is negative (i.e., extending into blade100on a second side of blade100).", "", "It is understood that when molding a tire using a sipe blade, such as blade100(and all other blades described below), base104forms the base of a sipe in a tire, while radially outer zig-zag portion would form the ground-contacting radially outer portion of the sipe. Blade100may be affixed into a tire mold in such a manner to effect this molding orientation. As such, the term “radially outer zig-zag portion” reflects the fact that a three-dimensional sipe molded into a tire using blade100(and all other blades described below) would include the zig-zag feature molded by radially outer zig-zag portion101in a portion of the three-dimensional sipe that is oriented radially outward relative to the remainder of the three-dimensional sipe. Similarly, the term “radially inner three-dimensional portion” reflects the fact that a three-dimensional sipe molded into a tire using blade100(and all other blades described below) would include the three-dimensional feature molded by radially inner three-dimensional portion102in a portion of the three-dimensional sipe that is oriented radially inward relative to radially outer zig-zag portion101.", "", "The X, Y, and Z axes illustrated in the figures are utilized for ease of description of the invention, and are not intended as limiting. In some instances, the X-axis may be generally tangential to the circumferential direction of a tire, the Y-axis may be generally parallel to the axial direction of a tire, and the Z-axis may be generally parallel to the radial direction of a tire. In some instances, the X-axis may be exactly tangential to the circumferential direction of a tire, the Y-axis may be exactly parallel to the axial direction of a tire, and the Z-axis may be exactly parallel to the radial direction of a tire.", "", "Blade100may include a plurality of positive elements106and a plurality of negative elements108. Collectively, these features may form the three-dimensional feature described herein. That is, a pattern of alternating positive elements106and negative elements108may form the three-dimensional feature described as radially inner three-dimensional portion102.", "", "Positive elements106and negative elements108may result in corresponding positive elements and negative elements in a three-dimensional tire sipe molded using blade100. These corresponding positive elements and negative elements may interlock with one another so as to create stiffness in a tire tread element having the three-dimensional sipe. The corresponding features may come together along the X-axis, to provide greater shear strength in the Y-Z plane between opposing faces of a sipe, as compared to a traditional, straight wall sipe.", "", "Radially outer zig-zag portion101may be formed by a series of alternating angled surfaces110and112, which form radially-extending peaks114and valleys116. These peaks and valleys may form corresponding peaks and valleys in a tire sipe molded using blade100. These corresponding peaks and valleys may interlock with one another so as to create stiffness in a tire tread element having the three-dimensional sipe.", "", "Each of the three-dimensional features forming the plurality of positive elements106and a plurality of negative elements108may be made up of three planar surfaces118,120, and122. Each of planar surfaces118,120, and122may be angled relative to one another by about 90 degrees. The point at which each of planar surfaces118,120, and122meet may be a rounded, terminal portion. Each of planar surfaces118,120, and122may have a quadrilateral shape.", "", "Sipe blade100may be difficult to draw out of a tire after molding and curing (tire mold extraction). This results from the amount of surface area of the sipe blade at its distal portion (the radially inner three-dimensional portion102).", "", "FIG.1Billustrates a sectional view of an example sipe blade100for forming a three-dimensional tire sipe.FIG.1Brepresents a sectional view taken about line A-A inFIG.1A.", "", "Sipe blade100may include a radially outer zig-zag portion101, and a radially inner three-dimensional portion102. Blade100may include a central plane103, and a base104.", "", "Blade100may include a plurality of positive elements106and negative elements108. The plurality of positive elements106and negative elements108may be made up planar surfaces118,120, and122. Blade100may include a plurality of valleys116and peaks114oriented in the radially outer zig-zag portion101.", "", "In one embodiment, central plane103bisects the plurality of positive elements106and negative elements108.", "", "The line formed by the intersection of planar surfaces118and120may be oriented at an angle A1relative to peak114(and central plane103). Angle A1may be about 45 degrees. Angle A1may be 45 degrees.", "", "The line formed by the intersection of planar surfaces118and120may be oriented at an angle A2relative to planar surface122(forming the top surface). Angle A2may be about 90 degrees. Angle A2may be 90 degrees.", "", "The line formed by the intersection of planar surfaces118and120may be oriented at an angle A3relative to a radial connection105extending between radially inner three-dimensional portion102and base104. Angle A3may be about 45 degrees. Angle A3may be 45 degrees. Radial connection105is planar, oriented between base104and radially inner three-dimensional portion102. That is, the lower row of positive elements106and negative elements108terminates, and radial connection105begins, extending to base104. Radial connection105being planar is intended to mean that it has a flat shape, devoid of significant variation, and a substantially constant thickness, excepting a localized transition to base104and the lower row of positive elements106and negative elements108.", "", "FIGS.2A-2Dillustrates an example sipe blade200for forming a three-dimensional tire sipe. Blade200may include a radially outer zig-zag portion201, a radially inner three-dimensional portion202, and a radially inner zig-zag portion250. Radially inner three-dimensional portion202is oriented radially between radially outer zig-zag portion201and radially inner zig-zag portion250. Blade200may include a central plane203, and a base204.", "", "Blade200may be used in conjunction with a mold to mold a three-dimensional sipe into a tire. The use of blade200results in the creation of a negative of blade200being formed in a sipe of a tire, creating the three-dimensional sipe.", "", "Blade200may be formed using a thin sheet of material pressed into a desired shape, and generally having a material thickness that is consistent at least through radially outer zig-zag portion201, radially inner three-dimensional portion102, and radially inner zig-zag portion250. Blade200may be formed using a thin sheet of material pressed into a desired shape, and generally having a material thickness that is not constant in radially inner three-dimensional portion202. Base204may have a material thickness that is different when compared to that of radially outer zig-zag portion201, radially inner three-dimensional portion202, and/or radially inner zig-zag portion250. In this manner, it is understood that a feature that is positive (i.e., extending out of blade200on a first side of blade200) is negative (i.e., extending into blade200on a second side of blade200). Blade200may be formed using any of a variety of manufacturing methods, including for example, machining, three-dimensional printing, casting, stamping, and the like, so as to produce the relationship described herein between positive elements and negative elements on exact opposite sides of blade200. This arrangement is shared by each blade described herein.", "", "Blade200may be formed from any of a variety of materials, including for example a metal (e.g., a steel or an alloy), a polymer, a ceramic, a composite, and the like. Blade200may be formed from a material capable of withstanding the heat and pressure associated with molding a tire.", "", "It is understood that when molding a tire using a sipe blade, such as blade200(and all other blades described below), base204forms the base of a sipe in a tire, while radially outer zig-zag portion would form the ground-contacting radially outer portion of the sipe. Blade200may be affixed into a tire mold in such a manner to effect this molding orientation. As such, the term “radially outer zig-zag portion” reflects the fact that a three-dimensional sipe molded into a tire using blade200(and all other blades described below) would include the zig-zag feature molded by radially outer zig-zag portion201in a portion of the three-dimensional sipe that is oriented radially outward relative to the remainder of the three-dimensional sipe. Similarly, the term “radially inner three-dimensional portion” reflects the fact that a three-dimensional sipe molded into a tire using blade200(and all other blades described below) would include the three-dimensional feature molded by radially inner three-dimensional portion202in a portion of the three-dimensional sipe that is oriented radially inward relative to radially outer zig-zag portion201. Finally, the term “radially inner zig-zag portion” reflects the fact that a three-dimensional sipe molded into a tire using blade200(and all other blades described below) would include the zig-zag feature molded by radially inner zig-zag portion250in a portion of the three-dimensional sipe that is oriented radially inward relative to the remainder of the three-dimensional sipe (except for base204), and at least radially inward of both the radially outer zig-zag portion201and the radially inner three-dimensional portion202.", "", "The X, Y, and Z axes illustrated in the figures are utilized for ease of description of the invention, and are not intended as limiting. In some instances, the X-axis may be generally tangential to the circumferential direction of a tire, the Y-axis may be generally parallel to the axial direction of a tire, and the Z-axis may be generally parallel to the radial direction of a tire. In some instances, the X-axis may be exactly tangential to the circumferential direction of a tire, the Y-axis may be exactly parallel to the axial direction of a tire, and the Z-axis may be exactly parallel to the radial direction of a tire. However, sipes formed using blade200(and all blades described herein) are not necessarily aligned as described above, but rather, may be inclined relative to the axial, circumferential, and/or radial directions of the tire. In this sense, the X, Y, and Z axes are not limiting, but are utilized for convenience.", "", "Blade200may include a plurality of positive elements206and a plurality of negative elements208. Collectively, these features may form the three-dimensional feature described herein. That is, a pattern of alternating positive elements206and negative elements208may form the three-dimensional feature described as radially inner three-dimensional portion202.", "", "Radially inner three-dimensional portion202may have a height RmH. Blade200may have a height RH. Height RmH may be about 32% of blade radial height RH. Height RmH may be 32% of blade radial height RH. Height RmH may be about 33% of blade radial height RH. Height RmH may be 33% of blade radial height RH. Height RmH may be between about 27% and about 37% of blade radial height RH. Height RmH may be between 27% and 37% of blade radial height RH. Height RmH may be between about 22% and about 42% of blade radial height RH. Height RmH may be between 22% and 42% of blade radial height RH. A sipe molded into a tire using blade200will have the same relationship in heights of RH and RmH.", "", "As illustrated further below, positive elements206and negative elements208may result in corresponding positive elements and negative elements in a three-dimensional tire sipe molded using blade200. These corresponding positive elements and negative elements may interlock with one another so as to create stiffness in a tire tread element having the three-dimensional sipe. The corresponding features may come together along the X-axis, to provide greater shear strength in the Y-Z plane between opposing faces of a sipe, as compared to a traditional, straight wall sipe.", "", "Radially outer zig-zag portion201may be formed by a series of alternating angled surfaces210and212, which form radially-extending peaks214and valleys216. These peaks and valleys may form corresponding peaks and valleys in a tire sipe molded using blade200. These corresponding peaks and valleys may interlock with one another so as to create stiffness in a tire tread element having the three-dimensional sipe.", "", "Radially outer zig-zag portion201may have a height RoH. Height RoH may be about 24% of blade radial height RH. Height RoH may be 24% of blade radial height RH. Height RoH may be about 23% of blade radial height RH. Height RoH may be 23% of blade radial height RH. Height RoH may be between about 20% and about 30% of blade radial height RH. Height RoH may be between 20% and 30% of blade radial height RH. Height RoH may be between about 15% and about 35% of blade radial height RH. Height RoH may be between 15% and 35% of blade radial height RH. A sipe molded into a tire using blade200will have the same relationship in heights of RH and RoH.", "", "Radially inner zig-zag portion250may be formed by a series of alternating angled surfaces256and258, which form biased, but generally radially-extending, peaks252and valleys254. These peaks and valleys may form corresponding peaks and valleys in a tire sipe molded using blade200. These corresponding peaks and valleys may interlock with one another so as to create stiffness in a tire tread element having the three-dimensional sipe.", "", "Peaks252and valleys254may be biased from the radial direction (parallel to the Z-axis) by an angle A3. Angle A3may be measured in reference to a centerline CL of the sipe, which centerline CL may extend radially (parallel to the Z-axis) in the corresponding tire molded using blade200. Angle A3may be about 15 degrees. Angle A3may be 15 degrees. Angle A3may be between about 14 degrees and about 16 degrees. Angle A3may be between 14 degrees and 16 degrees. Angle A3may be between about 12 degrees and about 18 degrees. Angle A3may be between 12 degrees and 18 degrees.", "", "The X-axis (generally circumferential) depth of peaks252and valleys254may gradually decrease as peaks252and valleys254extend radially inwardly toward a radial connection205extending between radially inner zig-zag portion250. Stated differently, peaks252and valleys254may taper into radial connection205as peaks252and valleys254extend radially inwardly in the direction of base204.", "", "The angle A3and tapered nature of radially inner zig-zag portion250yields a reduction in the undercut surface geometry (that is, the surface geometry of this section of blade200) that is reduced by up to 37%, or exactly 37%, over the prior art designs disclosed above and illustrated inFIGS.1A-1B. The result is that the force required to withdraw the tire tread mold from the tire tread following curing of the tire is reduced by up to 37%, or exactly 37%, over the prior art designs disclosed above and illustrated inFIGS.1A-1B.", "", "Peaks252have a distal section (defined as its greatest extent in the X-axis (generally circumferential direction) and being in the form of a ridgeline). Positive elements206likewise have a terminal portion (defined as its greatest extent in the X-axis (generally circumferential direction)). The distal section of peak252may extend further in the X-axis (generally circumferential direction) than the terminal portion of positive element206by an offset distance01. Offset distance01may be about 20% of the distance of peak252's distal section from centerline CL. Offset distance01may be between about 18% and 22% of this aforementioned distance. Offset distance01may be between 18% and 22% of this aforementioned distance.", "", "Radially inner zig-zag portion250may have a height RiH. Height RiH may be about 44% of blade radial height RH. Height RiH may be 44% of blade radial height RH. Height RiH may be about 45% of blade radial height RH. Height RiH may be 45% of blade radial height RH. Height RiH may be between about 40% and about 50% of blade radial height RH. Height RiH may be between 40% and 50% of blade radial height RH. Height RiH may be between about 35% and about 55% of blade radial height RH. Height RiH may be between 35% and 55% of blade radial height RH. A sipe molded into a tire using blade100will have the same relationship in heights of RH and RiH.", "", "Radially inner zig-zag portion250's peaks252are aligned (in the Y-axis (axial direction) with radially outer zig-zag portion201's peaks214. Radially inner zig-zag portion250's valleys254are aligned (in the Y-axis (axial direction) with radially outer zig-zag portion201's valleys216.", "", "The terminal portion of each positive element206and each negative element208is aligned (in the Y-axis (axial direction) with either peaks214,252or valleys216,254.", "", "The terminal portion of each of the radially inner set of positive elements206(that is, those elements contiguous to/connecting to radially inner zig-zag portion250) may directly connect to and form a part of peak252, while the terminal portion of each of the radially inner set of negative elements208may directly connect to and form a part of valley254.", "", "The radially inner set of positive elements206(that is, those elements contiguous to/connecting to radially inner zig-zag portion250) may form an angle A4with contiguous (connecting) peaks252. Angle A4may be about 120 degrees. Angle A4may be 120 degrees. Angle A4may be derived using the following equation: Angle A4=180 degrees−45 degrees−angle A3.", "", "In the prior art blade100, the three-dimensional feature that would include the equivalent placement of angle A4has an angle of 120 degrees.", "", "The interlocking aspect of the features described herein (in reference to each of the three-dimensional sipes herein) may result in a tire tread sipe that has the increased surface area desired when the sipe is “open” (e.g., while running down a roadway), but may result in increased stiffness when the sipe is “closed” (e.g., under breaking or when heavy tractive forces are applied, which may result in the tread element containing the sipe to be deformed).", "", "Each of the three-dimensional features forming the plurality of positive elements206and a plurality of negative elements208may be made up of three planar surfaces218,220, and222. For the ease of description, planar surfaces218and220may be referred to as side surface218and side surface220, while planar surface222may be referred to as top surface222. It is understood that these terms are not intended to be limiting, but rather, are used to simply clarify the relationship between these surfaces.", "", "Each of planar surfaces218,220, and222may be angled relative to one another by about 90 degrees. Each of planar surfaces218,220, and222may be angled relative to one another by 90 degrees. Each of planar surfaces218,220, and222may be angled relative to one another by between about 85 degrees and about 95 degrees. Each of planar surfaces218,220, and222may be angled relative to one another by between 85 degrees and 95 degrees. Each of planar surfaces218,220, and222may be angled relative to one another by between about 80 degrees and about 100 degrees. Each of planar surfaces218,220, and222may be angled relative to one another by between 80 degrees and 100 degrees. Each of planar surfaces218,220, and222may be angled relative to one another by between about 75 degrees and about 105 degrees. Each of planar surfaces218,220, and222may be angled relative to one another by between 75 degrees and 105 degrees.", "", "In one embodiment, the point at which each of planar surfaces218,220, and222meet may be a rounded, terminal portion. The terminal portion may have a radius.", "", "Each of planar surfaces218,220, and222may have a quadrilateral shape. One or more of planar surfaces218,220, and222may be at least one of a square, a rectangle, a rhombus, and a parallelogram. In one embodiment, each of planar surfaces218,220, and222is a square. In another embodiment, top surface222may be square, while side surfaces218,220are rectangular.", "", "In one embodiment, top surface222may have a width EW1. Top surface222may be square, and thus may have a width EW1about each of its four sides. Where side surfaces218,220are rectangular, side surfaces218,220may also have a width EW1about two sides, with a height being greater than or less than EW1, which will be further described below. Blade200may have a longitudinal width LW.", "", "Each of the plurality of positive elements206and negative elements208may have a height EH1, EH2. Height EH1, EH2may be equal to width EW1. Height EH1, EH2may be less than width EW1. Height EH1, EH2may be greater than width EW1. Height EH1, EH2may be about 71.5% of width EW1. Height EH1, EH2may be 71.5% of width EW1. Height EH1, EH2may be between about 70% and about 75% of width EW1. Height EH1, EH2may be between 70% and 75% of width EW1. Height EH1, EH2may be between about 65% and about 80% of width EW1. Height EH1, EH2may be between 65% and 80% of width EW1. Height EH1, EH2may be between about 60% and about 85% of width EW1. Height EH1, EH2may be between 60% and 85% of width EW1. A sipe molded into a tire using blade200will have the same relationship in heights EH1, EH2, and width EW1.", "", "The line formed by the intersection of planar surfaces218and220may be oriented at an angle A1relative to peak214(and central plane203/centerline CL). Angle A1may be about 45 degrees. Angle A1may be 45 degrees. Central plane203and centerline CL may be coplanar. Central plane203is the plane of blade200that corresponds to centerline CL of a sipe molded using blade200.", "", "The line formed by the intersection of planar surfaces218and220may be oriented at an angle A2relative to planar surface222(forming the top surface). Angle A2may be about 90 degrees. Angle A2may be 90 degrees.", "", "FIG.3illustrates a plan view of a tire tread element334illustrating engagement between a first and second element of a three-dimensional tire sipe. Tread element334may be at least partially bisected by a three-dimensional sipe335, forming a first tread element portion336and a second tread element portion338. Tread element portions336,338may include a plurality of positive elements306and a plurality of negative elements308.", "", "Each of the three-dimensional features forming the plurality of positive elements306and a plurality of negative elements308may be made up of three planar surfaces318,320, and322. For the ease of description, planar surfaces318and320may be referred to as side surface318and side surface320, while planar surface322may be referred to as top surface322. It is understood that these terms are not intended to be limiting, but rather, are used to simply clarify the relationship between these surfaces.", "", "Each of planar surfaces318,320, and322may be angled relative to one another by about 90 degrees. Each of planar surfaces318,320, and322may be angled relative to one another by 90 degrees.", "", "In practice, three-dimensional sipe335may be in contact with a running surface of a tire. When the tire is subjected to forces, tread element portions336,338may extend toward one another, for example, along the X-axis, such that positive elements306may at least partially engage and interlock with negative elements308, and vice versa. In this manner, three-dimensional sipe335may perform its function as a sipe (increasing surface area of tractive elements in a tire), while maintaining the rigidity of tread element334. That is, the engagement of positive elements306with negative elements308may provide greater shear strength in tread element334in at least one of a radial direction, axial direction, and circumferential direction of the tire, as compared to a traditional, straight wall sipe.", "", "The forces subjected to tread element portions336,338that may cause interlocking thereof include forces applied to a tire when a vehicle using that tire at least one of: brakes, accelerates, and corners.", "", "It is understood that a tire made using blade200would have sipes including the characteristics and features of the three-dimensional and two-dimensional elements of blade200but in a negative.", "", "Additionally, tires utilizing any of the three-dimensional sipes disclosed herein may yield better performance than a tire utilizing traditional two-dimensional (straight wall) sipes in the following common tire tests: cornering coefficient, snow braking, snow acceleration, snow lateral traction, tire wear, wet roadway lap time, and dry peak friction coefficient.", "", "To the extent that the term “includes” or “including” is used in the specification or the claims, it is intended to be inclusive in a manner similar to the term “comprising” as that term is interpreted when employed as a transitional word in a claim. Furthermore, to the extent that the term “or” is employed (e.g., A or B) it is intended to mean “A or B or both.” When the applicants intend to indicate “only A or B but not both” then the term “only A or B but not both” will be employed. Thus, use of the term “or” herein is the inclusive, and not the exclusive use. See Bryan A. Garner, A Dictionary of Modern Legal Usage 624 (2d. Ed. 1995). Also, to the extent that the terms “in” or “into” are used in the specification or the claims, it is intended to additionally mean “on” or “onto.” To the extent that the term “substantially” is used in the specification or the claims, it is intended to take into consideration the degree of precision available or prudent in manufacturing. To the extent that the term “selectively” is used in the specification or the claims, it is intended to refer to a condition of a component wherein a user of the apparatus may activate or deactivate the feature or function of the component as is necessary or desired in use of the apparatus. To the extent that the term “operatively connected” is used in the specification or the claims, it is intended to mean that the identified components are connected in a way to perform a designated function. As used in the specification and the claims, the singular forms “a,” “an,” and “the” include the plural. Finally, where the term “about” is used in conjunction with a number, it is intended to include ±10% of the number. In other words, “about 10” may mean from 9 to 11. Cartesian coordinates referenced herein are intended to comply with the SAE tire coordinate system.", "", "As stated above, while the present application has been illustrated by the description of embodiments thereof, and while the embodiments have been described in considerable detail, it is not the intention of the applicants to restrict or in any way limit the scope of the appended claims to such detail. Additional advantages and modifications will readily appear to those skilled in the art, having the benefit of the present application. Therefore, the application, in its broader aspects, is not limited to the specific details, illustrative examples shown, or any apparatus referred to. Departures may be made from such details, examples, and apparatuses without departing from the spirit or scope of the general inventive concept."], "claims": ["opposing tread element portions separated by the sipe, each opposing tread element portion including a plurality of positive elements and a plurality of negative elements, wherein the plurality of positive elements and the plurality of negative elements include three substantially quadrilateral-shaped planar surfaces, each planar surface being oriented relative to another planar surface by an angle of 90 degrees, wherein the three planar surfaces meet at a rounded terminal portion, wherein the sipe includes a radially outer zig-zag portion, wherein the sipe includes a radially inner three-dimensional portion radially inward of the radially outer zig-zag portion, and wherein the sipe includes a radially inner zig-zag portion radially inward of the radially inner three-dimensional portion.", "2 . The tire of claim 1 , wherein the radially outer zig-zag portion includes radially-extended peaks and valleys.", "3 . The tire of claim 1 , wherein the radially inner zig-zag portion includes radially-extended peaks and valleys.", "4 . The tire of claim 1 , wherein the radially inner three-dimensional portion includes a first row of elements and a second row of elements.", "5 . The tire of claim 4 , wherein the radially inner zig-zag portion includes radially-extended peaks and valleys, and wherein the terminal portion of each positive element of the second row of elements is connected to and forms a part of the radially-extended peaks of the radially inner zig-zag portion.", "6 . The tire of claim 3 , wherein the peaks are biased from a centerline of the sipe by an angle A 3 , and wherein the angle A 3 is 15 degrees.", "7 . The tire of claim 3 , wherein the peaks are biased from a centerline of the sipe by an angle A 3 , and wherein the angle A 3 is between 14 degrees and 16 degrees.", "8 . The tire of claim 3 , wherein the peaks are biased from a centerline of the sipe by an angle A 3 , and wherein the angle A 3 is between 12 degrees and 18 degrees.", "9 . The tire of claim 3 , wherein the peaks and the valleys decrease in size as the peaks and valleys extend radially inwardly.", "opposing tread element portions separated by the sipe, each opposing tread element portion including a plurality of positive elements and a plurality of negative elements, wherein the plurality of positive elements and the plurality of negative elements include three substantially quadrilateral-shaped planar surfaces, each planar surface being oriented relative to another planar surface by an angle of 90 degrees, wherein the three planar surfaces meet at a rounded terminal portion, wherein the sipe includes a radially outer zig-zag portion, wherein the sipe includes a radially inner three-dimensional portion radially inward of the radially outer zig-zag portion, and wherein the sipe includes a radially inner zig-zag portion radially inward of the radially inner three-dimensional portion, the radially inner zig-zag portion including radially-extended peaks and valleys.", "11 . The tire of claim 10 , wherein the radially outer zig-zag portion includes radially-extended peaks and valleys.", "12 . The tire of claim 10 , wherein the radially inner three-dimensional portion includes a first row of elements and a second row of elements.", "13 . The tire of claim 12 , wherein the radially inner zig-zag portion includes radially-extended peaks and valleys, and wherein the terminal portion of each positive element of the second row of elements is connected to and forms a part of the radially-extended peaks of the radially inner zig-zag portion.", "14 . The tire of claim 10 , wherein the peaks are biased from a centerline of the sipe by an angle A 3 , and wherein the angle A 3 is 15 degrees.", "15 . The tire of claim 10 , wherein the peaks are biased from a centerline of the sipe by an angle A 3 , and wherein the angle A 3 is between 14 degrees and 16 degrees.", "16 . The tire of claim 10 , wherein the peaks are biased from a centerline of the sipe by an angle A 3 , and wherein the angle A 3 is between 12 degrees and 18 degrees.", "17 . The tire of claim 10 , wherein the peaks and the valleys decrease in size as the peaks and valleys extend radially inwardly."], "bibtex": "@patent{20240399796,\n    title = {THREE-DIMENSIONAL TIRE SIPE},\n    number = {20240399796},\n    year = {2024},\n    note = {File: US20240399796A1-20241205.XML}\n    }", "classification": "B60C1112FI"}]