[{"title": "VEHICLE WHEEL, IN PARTICULAR FOR COMMERCIAL VEHICLES, WITH AN AERODYNAMIC COVER AND AERODYNAMIC COVER FOR VEHICLE WHEELS, IN PARTICULAR FOR COMMERCIAL VEHICLES", "doc_number": "20240181802", "filename": "US20240181802A1-20240606.XML", "abstract": "A vehicle wheel for commercial vehicles, having a fastening device for an aerodynamic wheel disc cover. In order to enable secure and easy fastening of the disc cover, the fastening device comprises several fastening holes arranged in the hub connection flange, with at least one fastening hole consisting of a through hole having a smaller diameter on the front side of the wheel than on a rear side of the hub connection flange and forming an abutment for a detachable retaining means acting by form fit, and/or wherein at least one fastening hole consists of a through hole provided with an internal thread for screwing in a fastening screw as a retaining means, and/or that the centre hole has an inner circle edge comprising a constriction which forms an abutment for a cover side arranged retaining means acting by form fit.", "detailed_description": ["FIG.1shows a vehicle wheel10according to the invention for a commercial vehicle together with a mounted wheel disc cover, designated altogether by reference numeral50, according to a first exemplary embodiment. The vehicle wheel10consists, in a manner known per se, of a metal rim1which is adapted in terms of size, dimensions, shape and thickness for mounting on the hub of an axle, in particular the (front) drive axle of a commercial vehicle, not shown. The ring-shaped closed rim1accordingly has an inner rim flange2, an inner rim shoulder3, a rim well base4, a transition section5, an outer rim shoulder6and an outer rim flange7. In the design of the vehicle wheel10or the rim1for a commercial vehicle, both rim shoulders3,6are designed as steep shoulders with a 15° (15°-degree) angle relative to the wheel axle.", "", "In the interior of the rim1is arranged a wheel disc, designated overall by reference numeral20, which has, in the exemplary embodiment shown, in a manner known per se, a hub connection flange21formed concentrically around the wheel axle, which is provided with several, for example 4, 5 or 10, bolt holes22arranged on a bolt circle for the passage of wheel bolts, not shown, and forms the contact surface and abutment surface on the vehicle-side hub with its rear side23. The hub connection flange21merges radially outwards into a transition region24which is provided with several ventilation holes25and then ends in a disc edge26via which the wheel disc20is connected to the rim, preferably by means of a welded connection. The hub connection flange21itself has a centre hole27with an inner circle edge28. Such a design of a preferably metal, multi-part vehicle wheel is known to the person skilled in the art, which is why the possible variants for the design of the disc shape and the rim shape are not discussed here further. The vehicle wheel could also be designed in one piece and consist of aluminium, for example.", "", "In the exemplary embodiment shown, the hub connection flange21protrudes axially over the plane spanned by the circumferential outer rim flange7. The designations inner rim flange2and outer rim flange7refer to the mounting state of such a vehicle wheel on a vehicle, because then the outer rim flange7is on the outside, whereas the inner rim flange2disappears inside in the wheel housing or the like. The normally visible wheel outside of the vehicle wheel1is therefore essentially formed by the front side29of the hub connection flange21, the transition area24, the inside of the outer rim shoulder6and the inside of the outer rim flange7. Referring to the annular rim, inside designates the radial inner side, whereas a tyre, not shown, is mounted on the radial outer side of the rim.", "", "The outer side of the vehicle wheel10is almost completely covered by the aerodynamic ring-shaped wheel disc cover50. The wheel disc cover50essentially extends from the centre hole27to the outer rim flange7. In the exemplary embodiment according toFIG.1, the wheel disc cover50is in several parts; it has a cover main body51, which is preferably made of a suitable plastic, has a substantially ring-shaped basic shape and is inherently rigid. Here, the cover main body51has an end face53running conically from the outer circumference52radially inwards and axially outwards, and a bottom face55which together enclose a cavity60. On the outer circumference52, a web56extends, which is preferably integrally or form-fit formed on the cover main body51and which, as can be seen particularly clearly from the lower half ofFIG.1, is provided with a plurality of air guide slots57, via which air can enter the intermediate space between the bottom side55of the cover and the front side of the wheel disc20, in order, for example, to ensure adequate cooling of the brakes during ongoing driving operation. Both the closed end face53and the air guide slots57on the web56decisively influence the aerodynamics and to this extent also the air resistance on the vehicle wheel10when it is mounted on a vehicle. Different designs of aerodynamic covers can be used for the present invention, as the invention essentially relates to the manner in which the wheel disc cover50is fastened to the vehicle wheel1.", "", "In the exemplary embodiment ofFIG.1as well asFIG.2andFIG.3, to which reference is now additionally made, a special modification has been made for fastening the wheel disc cover50to the wheel disc20in that the wheel disc20has a plurality of fastening holes30arranged on a bolt circle around the wheel axle, of which, however, only a single fastening hole30is shown. The fastening hole30is provided with an internal thread, and a fastening screw40interacts with the fastening hole30as retaining means. The fastening holes30are arranged on a bolt circle that is similar to the bolt circle of the bolt holes22, but the fastening holes30have a much smaller diameter, asFIGS.1to3clearly show. The cover main body51has blind hole depressions58with a through hole59in the bottom side55for the arrangement of the fastening screws40, and the blind hole depressions58have a cylindrical peripheral wall, which delimits the cavity60of the cover main body51. The several blind hole depressions58distributed on a bolt circle correspond in their number and position to the number and position of the fastening holes30in the hub connection flange21. Due to the depth of the blind hole depressions58, the head41of the fastening screw40does not act directly against the bottom of the blind hole depressions58, but is used between sleeves42, via which the length of the fastening screw40can be adapted to the depth of the blind hole depressions58. The design must be such that the screw40can be screwed into the threaded fastening hole30with a sufficient tightening torque without the threaded shank of the fastening screw40protruding at the rear side of the hub connection flange21.", "", "So that the blind hole depressions58do not impair the aerodynamics of the wheel disc cover50, the individual blind hole depressions58are arranged in a region of the main body51which is recessed with respect to the end face53. This resulting depression61can in turn be covered by a cover ring65, which in the exemplary embodiment shown is additionally provided on its underside66with a circular cam67for each blind hole depression58, which is designed and adapted to dip into the blind hole depressions58in the mounted state, as can be seen particularly well inFIG.3. A retaining force for the cover ring65can be generated by means of a suitable clearance or transition fit between the outer circumference of the cam67and the inner circumference of the blind hole depressions58. For additional locking of the cover ring65on the main body51, the cover ring65is provided with a sloping, reversibly bendable retaining lip68on the inside, which has an offset69at its lower end in order to engage behind a correspondingly positioned and formed wedge surface on the radial inner circumference of the main body51, as can be seen particularly well fromFIG.3.", "", "The fastening device formed by means of the fastening screws40and the threaded fastening holes30does not form the only locking means for the aerodynamic cover50, because a second locking also takes place on the inside of the outer rim flange7. The main body51of the wheel disc cover50is correspondingly provided with an additional locking device on the outer circumference52, which has either a single, circumferential locking element70which engages the arcuately curved inner side of the outer rim flange7with a form fit body formed for example by a bead or a curvature, in order to effect locking of the cover50on the vehicle wheel in the region of the outer circumference of the cover50by form fit. However, this additional locking element does not have to be formed circumferentially, but it could also consist of several individual pieces or a plurality of individual elements directly adjoining one another. However, it is preferably a locking element that is integrally formed on the cover. The additional support and locking on the outer rim flange7also ensures very good centring of the wheel disc cover50on the vehicle wheel numeral ten.", "", "FIGS.4to7show a second design of a vehicle wheel110with a correspondingly installed wheel disc cover150. Functionally identical components to the previous exemplary embodiment are denoted by reference symbols increased by 100. Here, too, the outside of the vehicle wheel110is formed by the front side129of the hub connection flange121, the transition section124with the ventilation holes125, the inside of the outer rim shoulder106and the inside of the outer rim flange107. The wheel disc cover150has essentially the same basic shape as the wheel disc cover in the previous exemplary embodiment, with an end face153that runs conically inwards and axially forwards and an outer circumference152on which a circumferential annular web156with air guide slots (not shown) is arranged. InFIG.4, the outer locking means in the form of the locking element170can be seen particularly well, wherein, in the exemplary embodiment according toFIG.4, the locking element170is additionally provided on its end face, lying axially inwards from and offset to the web156, with a separate and replaceable bead ring175, with which the locking element170engages with form fit in the locking lip formed by the inside of the outer rim flange107.", "", "Unlike the previous embodiment, the hub connection flange121is provided with several mounting holes130here that do not have a thread but have a smaller inner diameter at the front side129than at the rear side123of the hub connection flange121. In the exemplary embodiment according toFIGS.4-7, each fastening hole130arranged on a bolt circle around the wheel axle is provided with a step136, as can be seen particularly well inFIG.6. The dimensions of the fastening hole130are indicated inFIG.7. The fastening hole has a smaller inside diameter DI1 in front of step136and a larger inside diameter DI2 behind step136. The difference between DI1 and DI2 is preferably at least 0.8 mm, and in particular more than 1.9 mm. The undercut formed by the step136has only a small depth T1 with respect to the front side129, whereas the section with the diameter DI2 has a significantly greater depth T2. The ratio of T1/T2 can be, for example, between 1/1 and 1/5, and is preferably between 1/2 and 1/3. The depth is at least 1.5 mm.", "", "For the locking the wheel disc cover150to the stepped fastening holes130, the main body151is provided with integrally formed latch pins180extending rearwardly beyond the bottom face155, as can be readily seen fromFIGS.5to7. Each locking pin180is formed in two parts and has a first flexible partial element181and a second flexible partial element182which can be pushed into one another or apart from one another. The partial elements181,182of the two parts locking pin180are pre-stressed or pre-curved in such a way that they are normally pushed together slightly inward. The locking pin at180or the partial elements181,102are provided with a centre hole183, into which a preferably metal pin185can be inserted as an actuating element and securing element in the exemplary embodiment shown. If the pin185is inserted in the centre hole183, as shown inFIGS.5and7for example, the two partial elements181,182cannot be pushed together, but rather they engage in a form-fitting manner with their hook projections186on the end faces of the partial elements181,182of the locking pin180on the step136of the fastening hole130. However, if the pin185is removed, the partial elements181,182can move inward and the wheel disc cover150can be demounted.", "", "Here, too, blind hole depressions158are formed in a depressed section161of the main body151, at the front of which the locking pins180are formed integrally. The blind hole depressions158serve to receive retaining cams167on the underside of a cover ring165in a recessed manner, with which the receding recessed section161can be covered and filled flush with the end face153of the main body151in order to optimize the aerodynamics. The number of cams167with pins185held on the cover ring165by means of these is preferably adapted to the number of stepped fastening holes130in the hub connection flange121. By mounting the cover ring165, all pins185are inserted into the locking projections180, and locking and securing of all retaining means is effected via the cover ring165. In order that this is additionally anchored to the main body151, in the exemplary embodiment according toFIG.5toFIG.7, the cover ring165has a flexible retaining lip with an offset169in order to engage behind a correspondingly formed mating surface on the cover main body151.", "", "FIG.8shows, in a very simplified schematic form, a third embodiment variant for retaining means for a cover250. On the hub connection flange221, only indicated, several fastening holes230are distributed on a bolt circle around the wheel axle, wherein each fastening hole widens conically from the front side229to the back side223of the hub connection flange221. The ratio of the minimum diameter DA on the front side229to the maximum diameter DB on the rear side223can be 0.5<DA/DB<0.85, for example, whereby the conical course forms a sufficient retention surface for retaining means engaging the conical through-holes. The retaining means could hereby be designed in exactly the same way as in the previous exemplary embodiment with corresponding multi-part locking pins, wherein the conical surface would have the advantage during disassembly that the part elements are automatically pushed together. Alternatively, a wheel disc cover250could also be anchored to the fastening hole230by means of an expansion dowel291and a plug-in rivet290, which pass through a suitable through hole in the cover250, as indicated schematically inFIG.8.", "", "FIGS.9and10show a fourth embodiment variant of a vehicle wheel310and a cover350; this embodiment variant also has two locking surfaces or locking means that are spaced apart from one another, namely, on the one hand, a locking element370on the outer circumference352of the cover350, which interacts with the inside of the outer rim flange307, and also a further retaining means, which is integrally formed on the cover350and interacts with a constriction395on the inner circle edge329of the centre hole327on the hub connection flange321. The constriction395on the rear side323of the hub connection flange321is formed by means of a taper, which provides a clearance or undercut at the rear side323of the hub connection flange321, as illustrated by the dimensions inFIG.10. With respect to the total thickness of the wheel disc in the region of the hub connection flange321, the beginning of the taper may have a distance TA from the front side329of the hub connection flange321that is preferably approximately equal to or only slightly greater than half the total thickness of the hub connection flange. The internal offset TB of the taper is preferably smaller than the distance TA, whereas the total length TC of the taper is longer than the distance TA. By appropriately dimensioning the taper or constriction395, the wheel disc cover350can be provided as the first inner locking means or retaining means of a fastening device with a flexible but sufficiently rigid retaining lip396, which is provided with a hook projection397on the end face. The length of the retaining lip396is selected such that the retaining lip396protrudes rearward beyond the bottom side355of the wheel disc cover main body351. The length is altogether dimensioned in such a way that the hook projection397dips into the constriction395when the wheel disc cover350is mounted on the vehicle wheel310, but without hitting the front side of the hub. As the retaining lip is also ring-shaped here, the wheel disc cover350is additionally locked in a concentric, circumferential manner at the centre hole327of the vehicle wheel310.", "", "There is also an alternative in the fourth variant, in which the constriction is not designed by means of a taper at the transition from the inner circumference of the centre hole to the rear side of the hub connection flange of the wheel disc, but by means of a circumferential groove directly in the inner circumference of the centre hole. The retaining lip on the cover350would then have a somewhat shorter length so that a correspondingly designed hook projection can engage in the groove.", "", "Numerous modifications will become apparent to the person skilled in the art from the foregoing description, which are intended to fall within the scope of the appended claims. It is clear to the person skilled in the art that individual retaining means could be combined with one another in order to increase the secure locking of the aerodynamic wheel disc cover. In the exemplary embodiment shown, the offset of the wheel disc in the rim ensures that the hub connection flange clearly projects over the outer rim flange of the rim. In other designs of vehicle wheels, the hub connection flange could also lie inside the wheel, thus projecting less far than the outer rim flange when viewed axially. In such an embodiment, the wheel disc cover could then be designed flat overall and without a cone, or with an inverted cone, so that air guide slots for cooling the brakes can still be provided axially outside the outer rim flange. The air guide slots are preferably formed by such flow guide bodies which at the same time reduce the turbulence during the rotation of the vehicle wheel.", "", "The invention has been described with reference to metal vehicle wheels. Vehicle wheels can in particular also consist of light metal and be produced in one piece, and/or also consist of material combinations. The naming of particular materials is therefore not intended to limit the scope of the invention.", "", "In accordance with the provisions of the patent statutes, the principle and mode of operation of this invention have been explained and illustrated in its preferred embodiments. However, it must be understood that this invention may be practiced otherwise than as specifically explained and illustrated without departing from its spirit or scope."], "claims": ["1 . Vehicle wheel, in particular for commercial vehicles, having a metal rim with an inner rim flange and an outer rim flange, an inner rim shoulder and an outer rim shoulder as well as a rim well base between the rim shoulders, having a metal wheel disc arranged inside the rim and connected to the rim, which disc has a hub connection flange with a centre hole and a plurality of bolt holes arranged on a bolt circle around a wheel axle, a transition area provided with ventilation holes and a disc edge, wherein the hub connection flange, the transition area, the outer rim flange and the outer rim shoulder form a front side of the wheel, and having a fastening device for an aerodynamic wheel disc cover, wherein the fastening device comprises several fastening holes arranged in the hub connection flange, preferably arranged symmetrically on a hole circle around the wheel axle for a wheel disc cover, wherein at least one fastening hole consists of a through hole with a hole axis, is formed symmetrical to the hole axis, has a smaller diameter on the front side of the wheel than on a rear side of the hub connection flange and forms an abutment for a detachable retaining means acting by form fit, and/or wherein at least one fastening hole consists of a through hole provided with an internal thread for screwing in a fastening screw as a retaining means, and/or that the centre hole has an inner circle edge comprising a constriction which forms an abutment for a cover side arranged retaining means acting by form fit.", "wherein the at least one fastening hole widens, preferably conically, from the front side of the wheel to the rear side of the hub connection flange.", "3 . Vehicle wheel according to claim 1 , wherein the at least one fastening hole has a step between the front side of the wheel and the rear side of the hub connection flange and forms a retaining projection for the retaining means with the undercut formed by the step.", "wherein the smaller inside diameter of the fastening hole in front of the step is at least 0.8 mm, preferably at least 1.5 mm, particularly preferably more than 1.9 mm smaller than the larger inside diameter at the step, and/or that the step has a distance (T", "wherein all fastening holes are designed identically to one another and are arranged symmetrically on a common bolt circle, or that several fastening holes are arranged symmetrically on a bolt circle, which have a larger diameter on the rear side than on the front side of the wheel, wherein at least one fastening hole with an internal thread is preferably additionally provided, which is arranged asymmetrically to the fastening holes that widen towards the rear side.", "6 . Vehicle wheel according to claim 1 , characterized in that wherein the constriction on the inner circle edge of the centre hole consists of a concentric circumferential taper with which the inner circle edge merges into the rear side of the hub connection flange, wherein the taper preferably produces an undercut surface on the inner circle edge, which jumps back circumferentially on the rear side at least 4 mm with respect to the inner diameter of the inner circle.", "7 . Vehicle wheel according to claim 1 , wherein the constriction on the inner circle edge of the centre hole consists of a groove extending over the inner circumference of the centre hole, wherein the groove is preferably positioned centrally between the front side and the rear side of the hub connection flange.", "8 . Vehicle wheel according to claim 1 , wherein the through holes have a maximum diameter which is smaller than the diameter of the bolt holes in the hub connection flange.", "9 . Vehicle wheel according to claim 1 , wherein the outer rim flange has an arcuately curved locking lip on the inside as an abutment for a locking projection or several locking projections on the outer circumference of an aerodynamic wheel disc cover, wherein each locking projection preferably has at least one bead for edging into the locking lip.", "10 . Aerodynamic wheel disc cover for a vehicle wheel according to claim 1 , with an annular cover main body for covering the front side of a vehicle wheel between the centre hole and the outer rim flange, and with at least one retaining means interacting with a fastening device on the vehicle wheel, wherein the retaining means consists of a retaining means acting by form fit, which is designed to engage in or behind a constriction or a fastening hole that widens towards the rear side of the hub connection flange, or that the retaining means consists of a fastening screw for screwing into a fastening hole provided with an internal thread on the hub connection flange.", "11 . Wheel disc cover according to claim 10 , wherein the cover main body has a locking projection or several locking projections on the outer circumference, which are respectively provided with a bead for engaging a locking lip on the outer rim flange of the wheel disc.", "12 . Wheel disc cover according to claim 10 , wherein the cover main body is designed and dimensioned to cover all bolt holes as well as the wheel bolt screws screwed into the bolt holes.", "13 . Wheel disc cover according to claim 10 , characterized in that wherein the cover main body has several blind hole depressions with through openings, and the retaining means consisting of fastening screws effect via spacer sleeves, which are pre-stressed against a bottom side of the blind hole depressions by means of the fastening screws, a locking of the cover on the vehicle wheel, wherein an additional cover ring is preferably provided which comprises cams on an underside, wherein each of the cams is intended for and is positioned correspondingly to engage by form fit in the blind hole depressions on the main body in the mounted state, and/or wherein the cover ring is provided on the inside of the ring with a reversibly bendable retaining lip for engaging behind a retaining edge on an inner circumference of the main body.", "14 . Wheel disc cover according to claim 10 , wherein the cover main body has several locking pins on its underside, which pins are arranged symmetrically on a bolt circle and which are provided with a hook projection at their lower pin end, wherein each locking pin is preferably designed at least in two parts and the partial elements of the locking pin is pushable apart and/or is pushed together in the radial direction with respect to an initial state, and each locking pin is provided with a centre hole for an actuating means for pushing the partial elements of the locking pin apart.", "15 . Wheel disc cover according to claim 14 , wherein a cover ring is additionally provided, which comprises on its underside pins projecting beyond the underside, wherein each pin is intended and positioned correspondingly to engage in one of the centre holes of the locking pins on the main body in the mounted state, wherein the cover ring is preferably provided, on the inside of the ring, with a reversibly bendable retaining lip for engaging behind a retaining edge on an inner circumference of the main body, and/or wherein the pin is made of metal.", "16 . Wheel disc cover according to claim 10 , wherein the cover main body has a bottom side which is designed as an abutment surface on a front side of a wheel-side hub connection flange and is provided with a reversibly bendable retaining lip which partially protrudes beyond the bottom side and is designed to engage an annular groove on the inner circumference of a wheel-side centre hole of a vehicle wheel or to engage behind a taper on a rear side of an inner circumference of a wheel-side centre hole of a vehicle wheel.", "17 . Wheel disc cover according to claim 10 , wherein the cover main body and/or the cover ring are made of plastic and/or that the cover main body is provided with flow guide bodies on the outer circumference for additionally influencing the aerodynamics, in particular with flow guide bodies that are designed to reduce air turbulence.", "18 . Wheel disc cover according to claim 10 , wherein the cover main body has a flat or conical end face, and preferably has a depression in the end face, wherein preferably the cover ring in the mounted state is filling the depression and lies flush with the end face, and/or that the main body of the cover is provided on the outer circumference with a ring-shaped peripheral web with air duct slots, which in the mounted state is positioned axially offset next to the outer rim flange."], "bibtex": "@patent{20240181802,\n    title = {VEHICLE WHEEL, IN PARTICULAR FOR COMMERCIAL VEHICLES, WITH AN AERODYNAMIC COVER AND AERODYNAMIC COVER FOR VEHICLE WHEELS, IN PARTICULAR FOR COMMERCIAL VEHICLES},\n    number = {20240181802},\n    year = {2024},\n    note = {File: US20240181802A1-20240606.XML}\n    }", "classification": "B60B316FI"}, {"title": "BICYCLE RIM AND METHOD OF MANUFACTURING", "doc_number": "20240181803", "filename": "US20240181803A1-20240606.XML", "abstract": "A bicycle rim for bicycles with a rim body with a visible surface perceptible in proper operation, wherein a supporting structure of the rim body is made from fibrous composite materials of prepreg layers is disclosed. The rim body includes rim flanks disposed opposite one another, a rim well, and a rim base. The visible surface is formed by a thin non-woven layer on the supporting structure, so as to form directly during manufacturing, an optically appealing, visible surface on the rim body, involving no postprocessing. The non-woven layer forms on the rim body, an outer layer of a composite layer. The composite layer includes a prepreg layer and the non-woven layer.", "detailed_description": ["TheFIGS.1and2illustrate a mountain bike respectively a racing bicycle100, each equipped with bicycle rims1according to the application. The mountain bike respectively racing bicycle100comprise a front wheel101and a rear wheel102each, where bicycle rims1according to the application respectively rims are used. The two wheels101,102are provided with spokes109to connect the rims1with the hubs110. To this end, the rim1is provided with spoke holes25. The mountain bike respectively racing bicycle100comprise a handlebar30and a frame103each.", "", "A bicycle100has a frame103with frame components40, a handle106with a handlebar30, a saddle107, a fork respectively suspension fork104, and the mountain bike may be provided with a rear wheel damper105. A pedal crank112with pedals serves for driving.", "", "Optionally the pedal crank112and/or the wheels may be provided with an electrical auxiliary drive. The hub110of the wheels may be attached to the frame by means of a clamping system such as a through axle or a quick release.", "", "FIG.3shows a bicycle rim respectively rim1as a bicycle component in a schematic cross section. The rim1is configured as a hollow rim and has a hollow space29in the interior of the rim1between the radially inwardly rim base23and the radially outwardly rim well24. On the sides, rim flanks21and22are provided, extending convex between the rim base23and the radially outwardly rim flanges26and27. The rim1has a component body respectively rim body2, whose supporting structure3is provided by prepreg layers5. The radially outwardly side24aof the rim well24between the rim flanges26and27is as a rule not visible in proper use, since this is where the tire plus optionally a tube is/are received.", "", "Therefore, the visible surface8extends on the inner surface28from the rim flange26across the rim base23up to the other, opposite rim flank22. This visible surface8is again provided by a non-woven layer9(seeFIGS.4aand4b), extending over the inner surface28and across the rim flanks21,22and the rim base23up to and including the rim flanges26,27. The thin and lightweight non-woven layer9preferably has an end weight of less than 10 grams. In particular, the weight proportion of the non-woven layer (resin plus fibers) is relative to the total weight of the rim1less than 2% or even less than 1.5% and may be less than 1% or less than 0.5%.", "", "Surprisingly, the non-woven layer9achieves considerable improvement of the optical quality of the rim1removed from the manufacturing mold50and to reduce the quantity of defects on the visible surface8to such an extent that postprocessing is not necessary as a rule, thus reducing the manufacturing costs and increasing the quality of the rim1.", "", "The supporting structure3is formed by a number of prepreg layers5. The supporting structure3provides the majority of the stability of the rim body2. The non-woven layer9only provides a very low proportion of 5%, 10% or maybe 15% of the stability of the rim body2. The predominant part (80%, 90% or more) of the stability of the supporting structure3respectively the rim body2is provided by the prepreg layers5from fibrous composite materials4. A minimum wall thickness3bof the supporting structure3is formed in the convex region of the rim flanks21and22, while in the region of the rim base23, additionally inserted reinforcement layers12achieve a higher maximum wall thickness3cof the supporting structure3, other than crossing points such as the connecting points of the rim well24and the rim flanks21,22.", "", "Basically, the outer layer11provides the visible surface8by way of a non-woven layer9. The prepreg layers5aand5bfollow toward the inside, forming the supporting structure3of the rim body2. Further reinforcement layers12may be comprised inside.", "", "FIG.4ashows a schematic, perspective illustration of a non-woven layer and two prepreg layers5aand5b, which are joined together to form a composite layer10, which is thereafter inserted into a manufacturing mold50to manufacture a bicycle rim1.", "", "FIG.4bshows a schematic and sectional side view of the composite layer10on a backing60. Firstly, a (first) prepreg layer5ais positioned on the backing60. Thereafter, a second prepreg layer5bis disposed on the first prepreg layer5a. Finally, the non-woven layer9, which is very lightweight and thin and therefore difficult to drape, is placed, as wrinkle-free as possible, to form a composite layer of three layers, the composite layer10. The stacked prepreg layers5a,5band the non-woven layer9are pressed to one another. It is possible to vacuum impregnate the composite layer10so as to form a very homogeneous and very closely joined composite layer.", "", "For producing large quantities, the composite layer10may be manufactured by way of automatically feeding prepreg layers5a(and5b) and at least one non-woven layer9, which are unwound from separate rolls, and assembled and pressed together. Then, the composite layer10may be cut to the sizes required.", "", "Using prepregs for the fiber layers5aand5band the non-woven layer9, causes these layers to adhere to one another, thus enabling a simple way of joint draping in the manufacturing mold50.", "", "As can be seen inFIG.4a, the reinforcing fibers6of the two prepreg layers5aand5brun transverse to one another and thus on the whole allow increased stability of a bicycle rim1thus manufactured. The matrix material used is a resin material7, so that no additional resin is needed for the composite layer10nor otherwise. The non-woven layer9comprises a fibrous material16in the shape of non-woven fibers17. The non-woven fibers may be formed by short-fiber and/or long-fiber reinforcing fibers. The non-woven fibers17are homogeneously distributed over the surface of the non-woven layer9, and disposed randomly and actually disordered relative to one another, and not woven nor braided.", "", "FIG.4bschematically shows the two prepreg layers5aand5band disposed on the second prepreg layer5b, the non-woven layer9, which forms the visible outer surface of the finished component. It can be clearly seen that the thickness9aof the non-woven layer9is considerably less than the wall thickness3aof the supporting structure3, which is formed by the prepreg layers5aand5b. In the exemplary embodiment, the thickness9aof the non-woven layer9is less than 1/10 of the wall thickness3aof the supporting structure3, which in this case is formed only of the two prepreg layers5aand5b. Thus, the non-woven layer9provides only very little of the total weight of the bicycle rim1.", "", "FIGS.5abis5cshow three successive steps in manufacturing a rim, the bicycle rim1.FIG.5aschematically illustrates the two moldings51and52of the manufacturing mold50. The composite layer10is inserted in the molding51, such that the non-woven layer9covers the contact surface with the molding51. Thus, the non-woven layer9provides what later is the outer, visible surface8of the finished rim1, which is perceptible respectively visible in normal operation. After covering the first molding and the second molding and the ring part53, the manufacturing mold50is closed, so as to obtain the condition shown inFIG.5b. The interior of the rim1schematically shows an inflatable tube18, which is pumped up to generate the required counterpressure from the inside.", "", "The outside surfaces are provided on the rim flanks21and22and the rim base23, with a (continuous or two-part right/left) non-woven layer9, which is provided to form on what is to be the rim1, the surface8of which can be directly seen from the outside.", "", "After heating and curing the fibrous composite material, the manufacturing mold50can be opened. Then, the ring part53respectively its segments are removed radially outwardly, and the finished rim1can be taken out of the manufacturing mold50.", "", "Thereafter, the rim body2may be provided with spoke holes25, and any excess resin may be removed. There is no need for extensive refinishing of the visible outer surface.FIG.6shows a schematic, perspective illustration of a rim1.FIG.6shows the rim body2of the rim1, schematically showing on the right the outer, non-woven layer9and the two prepreg layers5aand5bof the composite layer10, and a reinforcement layer12.", "", "Overall, the invention provides high quality bicycle rims, the supporting structure of which is formed by prepreg layers5. A high quality, visible outer surface8is provided by a thin, non-woven layer9. The quantity of any optical defects is largely reduced, so as to provide the visible surface8largely without any postprocessing to the surface.", "", "While a particular embodiment of the present bicycle rim and method of manufacturing have been described herein, it will be appreciated by those skilled in the art that changes and modifications may be made thereto without departing from the invention in its broader aspects and as set forth in the following claims."], "claims": ["the visible surface is formed by a thin, non-woven layer on the supporting structure, so as to form during manufacturing, an optically appealing, visible surface on the rim body; and the non-woven layer on the rim body is an outer layer of a composite layer, which comprises at least one prepreg layer and the non-woven layer.", "2 . The bicycle rim according to claim 1 , wherein the composite layer comprises two prepreg layers with reinforcing fibers in different orientations, and the non-woven layer.", "3 . The bicycle rim according to claim 1 , wherein at least one prepreg layer comprises unidirectional reinforcing fibers.", "4 . The bicycle rim according to claim 1 , wherein the non-woven layer provides less than 10% or less than 5% of the stability of the rim body.", "5 . The bicycle rim according to claim 1 , wherein the thickness of the non-woven layer is less than 5% of the wall thickness of the supporting structure of the rim body, and/or wherein the thickness of the non-woven layer is less than 0.1 mm.", "6 . The bicycle rim according to claim 1 , wherein the weight per unit area of the fibrous material of the non-woven layer is 8 grams per square meter +/−50%.", "7 . The bicycle rim according to claim 1 , wherein the prepreg layers comprise continuous fibers cut to the layer size.", "8 . The bicycle rim according to claim 1 , wherein the non-woven layer is configured as a non-woven prepreg comprising randomly disposed non-woven fibers of different lengths, and resin.", "9 . The bicycle rim according to claim 1 , wherein the non-woven proportion of the non-woven layer is 40%+/−20%.", "comprising: forming a perceptible (visible) surface on the rim body which is visible in proper operation, a composite layer of a thin, non-woven layer and at least one prepreg layer is inserted into the manufacturing mold so that the non-woven layer bears against the manufacturing mold, so that the visible surface is formed by the thin non-woven layer, and the supporting structure is formed by the prepreg layers, so as to form during manufacturing an optically appealing, visible surface on the rim body, and that the non-woven layer on the rim body is an outer layer of a composite layer, which comprises at least one prepreg layer and the non-woven layer.", "11 . The method according to claim 10 , wherein the composite layer is first formed by way of joining at least one prepreg layer with the non-woven layer, and wherein for forming the composite layer, at least one prepreg layer is placed on a backing and the non-woven layer is placed on top and then pressed onto it.", "12 . The method according to claim 10 , wherein the composite layer is vacuum impregnated prior to placement in the manufacturing mold.", "13 . The method according to claim 10 , wherein the composite layer is pressed onto the manufacturing mold full-surface, and wherein after placing/inserting the composite layer in the manufacturing mold, reinforcement layers are placed/inserted in the manufacturing mold.", "14 . The method according to claim 10 , wherein the manufacturing mold loaded with the prepreg layers and the non-woven layer and optionally with reinforcement layers, is evacuated, and wherein the manufacturing mold is placed in a press device and heated.", "15 . The method according to claim 10 , wherein for manufacturing a rim, a prepreg layer (and no non-woven layer) is applied directly on the ring part forming the rim well, and wherein after removing the rim, spoke holes are inserted."], "bibtex": "@patent{20240181803,\n    title = {BICYCLE RIM AND METHOD OF MANUFACTURING},\n    number = {20240181803},\n    year = {2024},\n    note = {File: US20240181803A1-20240606.XML}\n    }", "classification": "B60B502FI"}, {"title": "FASTENER ASSEMBLY WITH DECORATIVE COATED CAP", "doc_number": "20240181804", "filename": "US20240181804A1-20240606.XML", "abstract": "A wheel fastener and method of forming a wheel fastener is provided. The wheel fastener has a fastener body comprising a threaded portion and an upper portion opposite the threaded portion. A load-bearing surface of the fastener body is shaped to cooperate with a fastener seat. A cap is decoupled from the fastener body and has a coating covering a cap base material to define a decorative appearance surface. The cap is crimped to the upper portion at a crimp area to retain the cap on the fastener body and define a wrenching surface. The cap does not cover the load-bearing surface. The coating of the cap comprises applying a nickel strike layer and a black chrome passivation layer to define a black appearance surface.", "detailed_description": ["As required, detailed embodiments of the present invention are disclosed herein; however, it is to be understood that the disclosed embodiments are merely exemplary of the invention that may be embodied in various and alternative forms. The figures are not necessarily to scale; some features may be exaggerated or minimized to show details of particular components. Therefore, specific structural and functional details disclosed herein are not to be interpreted as limiting, but merely as a representative basis for teaching one skilled in the art to variously employ the present invention.", "", "FIG.1illustrates a capped wheel fastener assembly10according to one embodiment. The assembly10includes a fastener body12and a decorative cap14.", "", "As illustrated inFIG.1, the fastener body12may be a nut body having an internal threaded portion16formed along internal bore18extending axially through the fastener body12.", "", "The fastener body12has a torque-bearing surface, or wrenching surface20formed as an out-of-round surface at an upper portion22. As illustrated, the torque-bearing surface20may be a hexagonal-shaped surface to be engaged by a standard hexagonal tool. Other suitable torque-bearing surfaces such as a different polygonal shape with a different number of wrenching surfaces or, any suitable shape, configuration or standard of tool wrenching surface may be used. In one example, the fastener may have a three-point torque-bearing surface such as U.S. patent application Ser. No. 15/487,805 by Wilson et al., or a hybrid three-point torque-bearing surface, such as in U.S. patent application Ser. No. 15/872,386 by Tomaszewski et al., the disclosures of which are hereby incorporated by reference herein. Other suitable torque-bearing surfaces may also be formed on the fastener body12. The fastener assembly10may also have an improved wrenching design and torque bearing surface according to U.S. Pat. No. 8,491,247 by Wilson, the disclosure of which is hereby incorporated by reference herein. The cap14may have a decorative wrenching surface that matches the size and styling of the exiting wheel fasteners, but the cap will rotate separately to the fastener and applying torque to the wrenching surface on the cap will not remove the fastener or may not affect tension in the joint, such as in U.S. Patent Application No. 63/315,434 by Deeds et al., or U.S. Patent Application No. 63/296,422 by Raves et al., the disclosures of which are hereby incorporated by reference herein.", "", "The lower portion24of the nut body16has a load-bearing surface30. As illustrated, the load-bearing surface30has a frustoconical shape; however, the load-bearing surface30may be spherical or other suitable shape for seating in a wheel rim aperture to fasten the wheel rim to a vehicle wheel stud. In another embodiment, the lower portion24of the fastener body12may also be a bolt body having an external threaded portion formed on a protrusion extending below the load bearing surface30.", "", "The fastener body12may be formed of carbon steel in a conventional manner. The fastener body12may be coated to prevent oxidation and corrosion. For example, the coating may be composed of zinc and aluminum and be chromium-free. The coating may be applied over the entire fastener body12.", "", "A flange40is formed between the hex-shaped surface20and the load-bearing surface30. The flange40defines an outer cylinder that extends radially outward from the torque bearing surface20and the load bearing surface30. Below the flange40, and above the load-bearing surface30, there is an undercut44.", "", "The cap14is placed over the upper portion22and covers torque-bearing surface20and flange40. A lower edge42of the cap14and is crimped inward along the undercut44to form an inward crimp segment46. Crimping the lower end of the cap14around the outer flange40retains the cap14onto the fastener body12so that the cap14does not move axially along the fastener body12in use.", "", "The cap14has wall segments to align with the torque-bearing surface20and provide the outer surface50. The outer surface50may be shaped as a torque-bearing surface or wrenching surface. The outer surface50may also have any decorative shape. The upper portion22may also have a stem that does not have a torque-bearing surface and the cap14may have decorative wrenching surfaces where applying torque to the decorative wrenching surface on the cap and will not remove the fastener or may not affect tension in the joint. The cap14may also freely-spin on the fastener body12when torque is applied to the decorative wrenching surfaces.", "", "A cylindrical surface48extends over the flange40. After the fastener body12is placed into the cap14, a lower edge of the cylindrical surface48is crimped inward to form the crimp segment46. The crimp segment46is crimped into engagement with the undercut44on the fastener body12and assures that cap14will not be dislodged from the fastener body even under extreme or repeated wrenching, or other environmental conditions.", "", "The fastener body12may be placed into the cap14with an interference fit, or a slip fit. The crimp then also blocks entry of moisture between the cap14on the fastener body12along the upper portion22.", "", "The cap14also has an end segment52defining the distal end of the fastener assembly10. The end segment52may be domed, as shown, of point, flat or another suitable shape for decorative purposes.", "", "The cap14also provides a decorative appearance to the fastener assembly10. Since the cap14is decoupled from the fastener body12, the cap14may be coated to provide a desired aesthetic appearance surface different than the fastener body12. For example, the cap14may be coated to have a black chrome appearance surface. However, other colors and/or coating materials may be used to provide different aesthetic appearances.", "", "Wheel fasteners must have a repeatable coefficient of friction in order to assure that a given installation torque will equal the desired clamp load. Wheel fasteners are also subjected to a corrosive environment. For these reasons, decoupling the cap14from the fastener body12allows the cap14to be coated to provide corrosion resistance, as well as aesthetic appearance, while leaving the fastener body12free of coatings, such as chrome, that negativity impacts friction control of the threaded surfaces and load-bearing surfaces.", "", "In one embodiment, the cap12has a black chrome coating60covering a cap base material62. The black chrome coating60is formed of a nickel strike layer66and a black chrome passivation layer68to define the black appearance surface on the cap14.FIG.2shows a 25,000 times magnification micrograph of the black chrome passivation layer68superficially reacting with nickel strike layer66.", "", "Traditional bright chrome on nickel plating has a significant thickness of 25-30 microns that is necessary for brightness and corrosion protection but will crack if used in applications requiring bending or crimping of the cap14.", "", "The coating60illustrated inFIG.2has a nickel strike layer66with a minimal thickness for allowing the chromate to passivate so reaction only takes place with surface of the nickel layer66, and not with the base material62. Therefore, the nickel strike layer66only thinly covers the base material62. The base material layer62may be stainless steel, carbon steel, or another suitable base layer.", "", "The black chrome passivation layer68reacts superficially with the nickel. The black chrome passivation is a treatment applied onto the nickel strike with a final product of complex trivalent chromium oxides. In one embodiment, the black chrome passivation layer may be formed in a plating bath having hexavalent chrome and through the process converts to a trivalent chrome that cannot revert to hexavalent chrome. The chrome passivation layer68meets environmental requirements while minute amounts of homogeneous materials may be tolerated. The final appearance is deep black but under some conditions there are areas displaying iridescent, brassy, or a dull black appearance. Chrome passivation is typically referred to as chromate in the industry. The nickel (Ni) is deposited with electroplating on the base material62. The black chrome passivation layer68may be electroplated on the nickel strike layer66.", "", "The black chrome coating60may have a smooth and flat surface and no nickel or base material is visible. The black chrome coating60has a thickness that prevents any visual anomalies such as cracking, peeling or flaking during the crimping of the cap or wrenching of the fastener during assembly. Wear marks due to the crimp tool may be acceptable, but the base layer62and/or the nickel strike layer66are not visible below the black chrome passivation layer68. The black chrome passivation layer68is not removed and maintains adhesion during crimping and repeated wrenching. Maintaining a controlled thickness of the coating ensure there is no cracking, peeling or flaking on any of the appearance surfaces. There shall be no nickel or stainless steel visible at the undercut surface44. Black chrome provides a uniform black color.", "", "In one embodiment, the nickel strike layer66may have a thickness in the range of 0.1 microns to 3.5 microns. In another embodiment, the nickel strike layer66may have a thickness of less than 0.1 microns. In another embodiment, the nickel strike layer66may have a thickness up to 11 microns.", "", "The thickness of the black chrome passivation layer68is one factor that affects appearance. In one embodiment, the thickness of the black chrome passivation layer68may be in the range of 0.1 microns to 2.1 microns. In another embodiment, the black chrome passivation layer68may have a thickness up to 3 microns. As shown inFIG.2, the black chrome passivation layer68may have variations along the surface and the thickness may be difficult to measure. Therefore, the thickness of the black chrome passivation layer68may not be specified or may be measured as an average or mean-value. Several factors may also affect color including bath temperature, bath contamination and other manufacturing parameters.", "", "The nickel strike layer66is applied in order to condition the base material62of the cap14for acceptance of the black chrome passivation layer68. The cap14may be formed of a base material being a stainless-steel sheet. In another embodiment, the cap14may be formed of a base material being carbon steel.", "", "After the black chrome treatment, a sealer such as an oil, wax or clear lacquer may be applied onto the black chrome passivation layer68to improve its uniformity, reflectivity and to increase its depth of black color. Some sealers also improve the wearability of the black chrome plating system.", "", "The plating thickness of the nickel strike layer66and black chrome passivation layer68may be measured by cross section analysis using a light or scanning electron microscope (SEM). Alternatively, focused ion beam (FIB) may be used to etch the specimen and together with SEM and BSE (backscatter electron) analysis obtains plating thickness. Thickness measurements acquired via these methods shall be referred hereinafter as “true layer thickness” measurements, but are destructive and therefore not feasible for production.", "", "Nondestructive thickness (NDT) measurements were developed using X-ray fluorescence (XRF) to determine plating thickness once a correlation was established between XRF and true layer thickness. While XRF is reasonably accurate for normal steels and plastics, XRF is not typically accurate with steels having Nickel content, including stainless steels. According to one embodiment of the application, a correlation was developed to relate XRF readings of chrome plating on stainless steel parts and back-scatter electron measurements, thus enabling XRF testing to be quantifiable for plating thickness testing on chrome plated stainless steel. This is particularly useful in the manufacture of black color capped wheel fasteners, and in particular fasteners with a stainless-steel cap. The stainless-steel capped wheel fastener solved the problem of repeatable wheel fastening function without corrosion and with high durability. However, stainless steel only has a natural bright finish. By adding a decorative coating to the cap, such as a black chrome coating, the fastening function is preserved, while providing a decorative appearance to the cap, such as a black color. However, in-process measurement of the chrome coating thickness was not possible, due to XRF's issues with nickel. In-process checks are needed to assure part quality. The issue of correlating XRF to thickness needed to be solved in order for part process capability to be measure and assured. The thickness of the black chrome passivation layer and the thickness of the nickel strike layer both must be measured and therefore a correlation factor was developed using XRF to measure the thicknesses and ensure threshold thicknesses were maintained.", "", "FIG.3shows a fastener assembly70having a decorative coating on the cap14according to another embodiment. The fastener assembly70, as pictured, has a black physical vapor deposition (PVD) layer. Physical Vapor Deposition (PVD) produces a hard coating that is metal-based by generation of partially ionized metal vapor, its reaction with certain gases and by forming a thin film with a specified composition on the base material62of the cap14. The PVD coating process is performed under a high vacuum. The PVD process may be used to form coatings made of nitrides, carbides and carbonitrides of Ti, Cr, Zr and alloys like AlCr, AlTi, TiSi, for example.", "", "In one embodiment, the PVD layer has a thickness in the range of 0.2 to 15 microns. In another embodiment, the PVD layer has a thickness in the range of 0.2 to 5 microns. In another embodiment, the PVD layer has a thickness in the range of 0.2 to 2 microns. The PVD coating may be applied over the nickel strike layer66. In addition, a hard chrome/bright chrome layer may be formed between the nickel strike layer and the black PVD layer.", "", "In another embodiment, the fastener assembly may have a black oxide decorative coating on the cap14. Applying the black oxide coating includes a process of forming a black iron oxide on the surface of ferrous metals. The black oxide coating is produced by a chemical reaction between the iron on the surface of the ferrous metal and the oxidizing salts present in the black oxide solution. The chemical reaction forms a black iron oxide, magnetite (Fe3O4), on the surface of the base material62of the cap14. A post treatment may be applied to the black oxide coating to increase the corrosion resistance. The black oxide layer is extremely thin and has a thickness 10 millionths of an inch.", "", "FIG.4illustrates a method of forming the fastener assembly10. Decoupling the cap14from the fastener body12allows the cap14to be coated to provide a desired aesthetic appearance without coating the load-bearing surface or the threaded portion. The decoupled cap also allows for the coating to have a controlled thickness for durability and corrosion resistance even after the cap14is press-fit and/or crimped onto the fastener.FIG.4illustrates a method100of forming the fastener assembly10.", "", "At step110, the fastener body12is formed according to standard processes or suitable processes known to a person of ordinary skill in the art. At step112, the fastener body12may be coated with a coating that provides corrosion resistance and the correct coefficient of friction for the threaded surfaces. At step112, the entire fastener body12without the cap14may be coated.", "", "At step120, the cap14is formed. Since the cap14is decoupled from the fastener body12, the cap14is preformed to correspond to the fastener body12. The cap14may be preformed of the base material in stainless steel or carbon steel. The cap14may be formed according to standard processes or suitable processes known to a person of ordinary skill in the art.", "", "At step124, the decorative coating layer is applied to the cap14. In the example of a black chrome decorative coating, the nickel strike layer66is applied to the preformed cap with electroplating. Then the black chrome passivation layer68is applied to the preformed cap over the nickel strike layer66. In one embodiment, the black chrome passivation layer68is applied with electroplating. In other embodiments, the decorative coating may be black physical vapor deposition (PVD) or black oxide layer. In at least one embodiment, a hard chrome/bright chrome layer may be applied between the nickel strike layer66and the black PVD.", "", "At step126, the preformed cap with chrome coating is placed on the fastener body12. The fastener body12may engage the preformed cap with an interference fit, such as a press fit. Finally, at step128, the cap14is crimped to the fastener body12. The cap14is secured to the fastener body12without welding or adhesive or additional components.", "", "While exemplary embodiments are described above, it is not intended that these embodiments describe all possible forms of the invention. Rather, the words used in the specification are words of description rather than limitation, and it is understood that various changes may be made without departing from the spirit and scope of the invention. Additionally, the features of various implementing embodiments may be combined to form further embodiments of the invention."], "claims": ["a fastener body comprising: a threaded portion; a wrenching surface shaped to receive torque from a tool; a load-bearing surface shaped to cooperate with a fastener seat; and a cap decoupled from the fastener body and having a black coating covering a cap base material to define a decorative black appearance surface, wherein the cap is secured to the fastener body at a crimp area thereby covering the wrenching surface without covering the load-bearing surface and the threaded portion.", "2 . The wheel fastener of claim 1 , wherein the black coating has a nickel strike layer and a black chrome passivation layer to define the decorative black appearance surface.", "3 . The wheel fastener of claim 2 , wherein the black chrome passivation layer comprises a complex trivalent chromium oxide.", "4 . The wheel fastener of claim 2 , further comprising a sealant layer over the black chrome passivation layer.", "5 . The wheel fastener of claim 2 , wherein the black chrome passivation layer has a thickness less than 3 microns.", "6 . The wheel fastener of claim 5 , wherein the black chrome passivation layer has a thickness in the range of 0.1 to 2.1 microns.", "7 . The wheel fastener of claim 2 , wherein the nickel strike layer has a thickness less than 11 microns.", "8 . The wheel fastener of claim 2 , wherein the black coating comprises a black physical vapor deposition (PVD) to define the decorative black appearance surface.", "9 . The wheel fastener of claim 8 , wherein the black coating further comprises a hard chrome layer between the nickel strike layer and the black PVD.", "10 . The wheel fastener of claim 1 , wherein a base material of the cap comprises stainless steel.", "11 . The wheel fastener of claim 1 , wherein a base material of the cap comprises carbon steel.", "12 . The wheel fastener of claim 1 , wherein the cap has a crimp area to retain the cap on the fastener body.", "13 . The wheel fastener of claim 12 , wherein the fastener body has a flange extending radially outwardly from the wrenching surface, wherein the crimp area is positioned adjacent the flange.", "forming a fastener body having an upper portion and a threaded portion opposite the upper portion; preforming a cap to cover the upper portion of the fastener body; coating the cap to define a decorative appearance surface; crimping the cap to the upper portion of the fastener body to secure the cap to the fastener body.", "15 . The method of claim 14 , wherein coating the cap comprises applying a nickel strike layer and a black chrome passivation layer to define the decorative appearance surface being a black appearance surface.", "16 . The method of claim 15 , further comprising measuring the black chrome passivation layer and nickel strike layer to ensure a thickness of the coating is less than a threshold thickness.", "17 . The method of claim 14 , further comprising preforming the cap of stainless steel.", "18 . The method of claim 14 , wherein coating the cap comprises applying a black physical vapor deposition (PVD) to define the decorative appearance surface being a black appearance surface.", "a fastener body comprising a threaded portion and an upper portion opposite the threaded portion and a load-bearing surface shaped to cooperate with a fastener seat; and a cap decoupled from the fastener body and having a decorative coating covering a cap base material to define a black appearance surface, wherein the cap is crimped to the upper portion of the fastener body at a crimp area to retain the cap on the fastener body and define a wrenching surface on the cap without covering the load-bearing surface and the threaded portion on the fastener body.", "20 . The wheel fastener of claim 19 , wherein the decorative coating comprises a black chrome coating having a nickel strike layer and a black chrome passivation layer to define a black appearance surface, wherein the black chrome coating is free of anomalies along a crimp area so the nickel strike layer or a cap material is not visible"], "bibtex": "@patent{20240181804,\n    title = {FASTENER ASSEMBLY WITH DECORATIVE COATED CAP},\n    number = {20240181804},\n    year = {2024},\n    note = {File: US20240181804A1-20240606.XML}\n    }", "classification": "B60B706FI"}, {"title": "WHEEL AND LEG TRANSFORMABLE ROBOT WITH SUSPENSION AND AUTONOMOUS NAVIGATION", "doc_number": "20240181805", "filename": "US20240181805A1-20240606.XML", "abstract": "Aspects of the disclosure relate to a robot. The robot includes a body and a wheel assembly coupled to the body. The wheel assembly includes a central hub and a central gear coupled to the central hub. A plurality of legs are coupled to the central hub. The plurality of legs are operatively coupled to the central gear such that the central gear drives the plurality of legs between a closed position and an open position. A motor is coupled to the body and coupled to the wheel. A suspension system is coupled to the wheel assembly. An autonomous guidance system is coupled to the motor.", "detailed_description": ["It is to be understood that the following disclosure provides many different embodiments, or examples, for implementing different features of various embodiments. Specific examples of components and arrangements are described below to simplify the disclosure. These are, of course, merely examples and are not intended to be limiting. The section headings used herein are for organizational purposes and are not to be construed as limiting the subject matter described.", "", "Presented is a new adaptive wheel-and-leg transformable robot for versatile multi-terrain mobility. The robot is equipped with passively transformable wheels, where each wheel includes a central gear and multiple leg segments with embedded spring suspension for shock reduction. These wheels enable the robot to traverse various terrains, obstacles, and stairs, while retaining the simplicity in primary control and operation principles of conventional wheeled robots. The chassis dimensions and the location of the center of gravity were determined via multi-objective design optimization aimed at minimizing the weight and maximizing the pitch angle of the robot for obstacle climbing. The design variables associated with the transformable wheels were selected via simulations. Based on the results from this optimization process, an embedded sensing and control system was developed. Experiments showed that the spring suspension on the wheels effectively reduced the vibrations while walking and verified the robot's versatile locomotion capabilities. Results from physical experiments were highly consistent with the simulations, proving the potential utility of the simulator for selecting optimal wheel designs for target locomotion objectives.", "", "FIG.1is a perspective view of a wheel-and-leg autonomous robot100. Robot100includes a body102and a plurality of wheel assemblies104. By way of example, body102may have dimensions of about 720 mm(L)×590 mm(W)×300 mm(H), weighing about 11 kg. The size of body102may be customized as needed for different applications. As shown inFIG.1, robot100includes four wheel assemblies104; however, various embodiments of robot100could include more or fewer wheel assemblies104. For example, the robot100could include two wheel assemblies104, three wheel assemblies104, four wheel assemblies104, or six or more wheel assemblies104. Each wheel assembly104is operatively coupled to a motor106such that each wheel assembly104is controlled independent of other wheel assemblies104. In other embodiments, multiple wheel assemblies104could be coupled to a single motor106such that robot100could have, for example, a front-wheel-drive configuration, a rear-wheel drive configuration, or an all-wheel drive configuration.", "", "Still referring toFIG.1, robot100includes an autonomous guidance system. The autonomous guidance system includes a front camera108, a rear camera110, a LiDAR device112, and a GPS receiver114. Front camera108, rear camera110, LiDAR device112, and GPS receiver114are electrically coupled to a microcontroller and a power source (e.g., seeFIG.6). The autonomous guidance system is enabled by onboard sensing, processing, and wireless communication capabilities. Robot100has potential for many areas, such as agriculture, space exploration, surveillance, and urban military applications.", "", "The locomotion system of robot100includes wheel assemblies104that are passively transformable wheels. Passive is used to describe wheels that can transition from wheels to legs (and vice versa) based on the driving direction and environmental conditions. Each assembly104is a geared, transformable wheel mechanism (e.g., seeFIGS.2-6for examples). This design includes a central gear, leg segments with partial gears, and two spoke frames. When the central gear rotates in a first direction, the legs open until a mechanical lock is reached. As the central gear continues to rotate in the first direction under sufficient friction, even at a low speed, the entire mechanism turns in the first direction with the legs open. When the central gear rotates in the opposite direction, the legs close or remain closed in a seamless circular shape and continue to roll in the opposite direction. Each assembly104is mechanically simple with only a few moving components. The design variables, including the ratio of the partial gears on the legs to the central driving gear (ρ=r2/r1), the number of legs (nleg), and the wheel radius (R=r1+2r2), are customizable.", "", "Robot100is a fully functional robotic platform developed for real-world tactical applications. To carry necessary payloads and conduct sensing and processing required for autonomous navigation, the robot inevitably becomes much larger and heavier. Physical scale-up is expected to result in increased vibrations and shocks during legged locomotion. In addition, overall locomotion performance and behavior are affected by the dimensions of robot100as well as the design of assemblies104. For shock reduction, torsional springs are embedded into each assembly104(SeeFIGS.3-4). A multidisciplinary optimization approach is adopted for determining the overall chassis dimensions and the location of the center of gravity to minimize the weight—and thus torque requirement—and maximize the robot's achievable pitch angle for obstacle climbing.", "", "FIG.2Ais a perspective view of a wheel assembly104in a close configuration andFIG.2Bis a perspective view of wheel assembly104in an open configuration.FIG.2Cis an exploded view of wheel assembly104in a closed configuration. Wheel assembly104includes a plurality of legs202. Each leg of the plurality of legs202is hingedly coupled to a central hub204and includes a partial gear205. A central gear206is disposed centrally between the plurality of legs202such partial gear205of each leg of the plurality of legs202engages central gear206. Central gear206is operatively coupled to motor106.", "", "Each leg of the plurality of legs202includes an arcuate outer surface207. When the wheel assembly104moves from the open position to the closed position, legs202pivot about central hub204such that a distal end208of each leg202aligns with a proximal end210of an adjacent leg202. When closed, arcuate outer surfaces207align to form a round, wheel-like surface (e.g.,FIG.2A).", "", "Central hub204includes a first spoke frame212and a second spoke frame214. A fastener216passes through an aperture218in the first spoke frame214, through an aperture220formed in leg202, and through a corresponding aperture222formed in second spoke frame214. In various embodiments, bearings may be utilized to reduce friction between leg202and fastener216.", "", "FIG.2Dis a free body diagram of the wheel assembly in the closed position and driven in the clockwise direction. During operation, wheel assemblies104are initially in the closed position. The closed position is suitable for moving over smooth terrain. When friction on arcuate outer surface207increases such as, for example, when robot100encounters an obstacle or uneven terrain, the interaction of central gear206and legs202causes legs202to rotate about central hub204to the open position. In this sense, wheel assembly104passively moves between the closed position and the open position based on the terrain conditions and friction between the surface and wheel assembly104. In various embodiments, the amount of resistance or friction required to move leg202to the open position may be adjusted by changing the gear ratio between central gear206and leg202. For example, a lower gear ratio between central gear206and leg202would require less torque to cause leg202to move to the open position.", "", "In various embodiments, wheel assembly104may include a locking mechanism to secure legs202in either the open position or the closed position until it desirable to change the position of legs202. For example, in various embodiments, a magnetic or mechanical lock could be utilized to secure legs202in either the open position or the closed position. When it is desired to change the position of legs202, the locking mechanism may be released by, for example, de-energizing a magnetic lock, thereby allowing legs202to move between the open position and the closed position. In various embodiments, wheel assembly104may include one or more motors coupled with legs202to control opening and closing of legs202(i.e., active actuation).", "", "In a small-size, light-weight robot, the impact force directly applied to the motor shaft is not significant. However, when used for a larger and heavier one, the motor shaft would continuously experience increased shocks and unwanted vibrations while operating in the legged mode. This would not only increase wear on the structure but also affect the sensor readings and thus cause control difficulties. Reducing shocks and vibrations would not only help the structural robustness and durability, but also enhance overall locomotion performance. Modularity is another important design consideration as it allows easy onsite replacement of the wheels which is often expected in field operations.", "", "FIGS.9A-9Cillustrate designs for legs202that may be used with robot100according to aspects of the disclosure. Leg202ofFIG.9Ais a tubeless-tire design that includes a tread230that is suspended from frame232via a webbing234. Tread230and webbing234are made of, for example, rubbers or other materials that offer good traction and flexibility. Webbing234allows tread230to flex to soften impacts while robot100moves about. In some aspects, tread230is attached to frame232via tabs236(e.g., tread230includes an aperture that is stretched over the tab to secure tread230to frame232). Tread230may be further secured to frame232via an adhesive. Leg202includes a toe238that is given some structure via webbing234. Toe238can also provide some cushion/flex to soften impacts upon the ground etc. as robot100moves about, especially when leg202is in the open configuration.", "", "FIG.9Bis another tubeless-tire design that includes a tread240that is suspended from frame242by a webbing244. Tread240and webbing244are made of, for example, rubbers or other materials that offer good traction and flexibility. Webbing244allows tread240to flex to soften impacts while robot100moves about. In some aspects, tread240is attached to frame232via an adhesive. Leg202includes a toe248that is given some structure via webbing244. Toe248can also provide some cushion/flex to soften impacts upon the ground etc. as robot100moves about, especially when leg202is in the open configuration.", "", "FIG.9Cis another tubeless-tire design that includes a tread250that is suspended from frame252via a webbing254. Leg202ofFIG.9Cis similar to leg202ofFIG.9A, with similar parts given similar part numbers. Leg202ofFIG.9Cdiffers from leg202ofFIG.9Ain dimension. For example, Leg202ofFIG.9Cis dimensioned for use as part of a six-leg design, whereas leg202ofFIGS.9A and9Bare dimensioned for use as part of a four leg design.", "", "It will be appreciated by those having skill in the art that the dimensions of legs202ofFIGS.9A-9Ccould be modified as necessary to accommodate a design with any number of legs. It will also be appreciated that webbings234,244,254could be replaced with tubed-tire designs (e.g., inflatable bladders).", "", "FIG.3Ais an exploded view of wheel assembly104in the closed position illustrating a spring suspension.FIG.3Bis a plane view of wheel assembly104in the open position.FIG.3Cis a detailed view of torsional spring302. Referring toFIGS.3A-3Ccollectively, torsion springs302sit in cavities304and are bear against legs202and first spoke frame212(FIG.3C). For example, torsion springs302bear against an edge203of leg202and an edge213of first spoke frame212to bias each leg202into the closed position. In some embodiments, each leg202includes two torsional springs302, with the second torsional spring302being similarly disposed on an opposite side of leg202. When wheel assembly104moves to the open position, torsion spring302provides resistance to movement of the leg202. In various embodiments, torsion spring302could be replaced with a different type of spring, such as a linear spring, a leaf spring, a compressible media (e.g., foam, rubber, etc.), and the like.", "", "FIGS.4A and4Billustrate relative movement of leg202when an impact is experienced. InFIG.4B, leg202(1) is has flexed relative to its position inFIG.4Aas a result of leg202(1) impacting the ground.FIGS.4C and4Dare close-up views of the flex of leg202(1), withFIG.4Cillustrating a relative position of leg202(1) with an initial angle θ1andFIG.4Dillustrating a flexed position of leg202(1) having an increased angle of θ2. The amount of flex (A0=θ2−θ1) of leg202(1) is dependent upon the force encountered. Thus, torsion springs302cushion impact and reduce vibration/shock resulting from movement of robot100when wheel assemblies104are in the open position. In various embodiments, a single torsion spring302may be coupled to the plurality of legs202. As one leg hits an obstacle or ground while walking, the free ends of the springs hit the spoke frame, winding the spring and absorbing the impact. This design is fully integrated, making the wheel structure highly modular while maintaining its mechanical simplicity.", "", "Selection of torsional springs requires careful consideration of the physical space as well as the expected torque acting on each spring while walking. The total potential energy change due to the vertical height change while walking (Δh) can be used as the target amount of the energy to be absorbed by the springs (FIGS.4A and4B). This leads to an approximation of MrgΔh≈4nleg(1/2)kΔθ2, where Mris the total mass of the robot, g is gravitational acceleration, Δh is the maximum change in the vertical height of the robot body while walking, k is the spring constant, and Δθ is the range of winding angle of the torsional spring (FIGS.4C and4D). The right side of the formula is multiplied by 4 because robot100is equipped with four wheels. For a robot with a different number of wheels, that number is multiplied to the formula. The design of the spring housing in the leg segment can be modified to adjust Δθ. Considering practical and space limitations, its range is kept at 45≤Δθ≤50° in this specific embodiment, but the range can be adjusted.", "", "The stiffness and the winding angle can then be used to determine the strain energy stored in each spring due to the bending moment. A spring grade is then determined depending on the incident stress. In this step, the mean diameter and the wire diameter are first selected based on the physical space constraints. Subsequently, the yield strength of the spring and the spring index are obtained. The Wahl factor is used to calculate the bending stress on the spring. If the obtained bending stress is less than the ultimate tensile strength of the spring, the design parameters are considered to be safe. Otherwise, if higher values for the mean and wire diameter are chosen, the process continues until the design is safe. This process must also ensure that the natural frequency of the spring would not result in resonance. The total weight and mechanical design and size of the wheels must be determined first in order to select proper springs.", "", "FIG.5is a perspective view of a spring-and-damper suspension system for robot100according to aspects of the disclosure. In various embodiments, motor106may be coupled to body102by a spring and damper suspension. A spring402and damper406are coupled between body102and motor106. Spring402and damper406facilitate reduced vibration and shock when the robot is transporting heavier payloads or traversing rough terrain, regardless of wheel assembly104being in the open or closed position. Combining torsional springs302with spring402and damper406provides an overall improvement in vibration/shock reduction.", "", "FIGS.6A-6Eillustrate embodiments of wheel assembly104according to aspects of the disclosure. Referring toFIGS.6A-6Ecollectively, wheel assembly104may, in various embodiments, include two legs202, three legs202, four legs202, five legs202, or six legs202. Additionally, as illustrated inFIGS.6A and6Bby the number of teeth, the gear ratio between the legs202and the central gear206may be varied.", "", "FIG.7is a schematic diagram of an autonomous guidance system700for robot100according to aspects of the disclosure. The autonomous guidance system700includes a microcontroller702that is coupled to a power source704. In various embodiments, the power source704includes a battery706that is coupled to a current regulator707such as, for example a 12 Volt DC regulator. The microcontroller702is coupled to a motor controller708, which is electrically coupled to motors106. In the embodiment ofFIG.7, four motors106are shown, but more or fewer motors106may be used. Motor controller708regulates operation of motors106. Front camera108, rear camera110, LiDAR device112, and GPS receiver114are electrically coupled to microcontroller702. In various embodiments, a universal serial bus (USB) hub709may be utilized to provide power and data connection to front camera108, rear camera110, LiDAR device112, and GPS receiver114. In various embodiments, USB hub709receives power from a second battery710. GPS receiver114is coupled to an inertial measurement unit712. The inertial measurement unit712is coupled to microcontroller702and measures and reports parameters, such as, specific force, angular rate, and/or orientation of robot100using a combination of accelerometers, gyroscopes, and/or magnetometers to aid in the maneuvering of robot100.", "", "FIG.8Acompares hybrid locomotion systems with the instant system in terms of the weight and the size represented by the longest body length. While non-transformable hybrids as well as actively transformable robots have been developed in varying sizes and weights, passively transformable ones have remained relatively small and light. Passive mechanisms often rely on high surface friction and/or a high rotating speed for triggering wheel-to-leg transformation. Such transformation strategies may be suitable only for small, light-weight robots. In the wheel assemblies of the instant design, the leg segments are mechanically connected to the driving system through a gear, and therefore the driving actuator together with the friction triggers the transformation even under a low speed and high payload.", "", "For the wheel-leg transformable mechanisms which are closely related to the presented work, we further evaluated the robot's overall obstacle climbing ability versus structural complexity. As a measure of the obstacle climbing ability, we define climability score as:", "", "Sc=Omax/REq. 1where Omaxis the maximum climbable obstacle height and R is the closed wheel radius. Mechanical complexity is defined as:", "", "C=NA·NJEq. 2where NAis the number of actuators and NJis the number of joints. As a robot may have a different number of wheels, C calculated for a single wheel is used here. A regular wheel driven by a motor has one actuator and one joint, resulting in C=1. As the design becomes mechanically more complex, C increases accordingly.FIG.8Bshows Scversus C for existing wheel-leg transformable mechanisms. While our transformable mechanism can be realized with any number of legs, the most practical choices would be nleg=3-6.", "", "FIG.8Bincludes data for 3, 4, and 6-leg versions of the wheels for comparison. The 3-leg design achieves the lowest C with a relatively high Sccompared to the 4- or 6-leg versions as well as other transformable wheel-leg mechanisms shown in the plot. In general, passive mechanisms achieve relatively high Scwith a low C. Most of these existing passive mechanisms, however, have only been realized in small and light-weight platforms, occupying the lower left side of the plot inFIG.8B. Robots equipped with the advanced wheel mechanisms disclosed herein are significantly larger and heavier than the small and light-weight platforms, while still maintaining the mechanical simplicity and the climbing ability expected in the passive systems."], "claims": ["a body; a wheel assembly coupled to the body, the wheel assembly comprising: a central hub; a central gear coupled to the central hub; a plurality of legs coupled to the central hub, the plurality of legs operatively coupled to the central gear such that the central gear drives the plurality of legs between a closed position and an open position; a motor coupled to the body and coupled to the wheel; a suspension system coupled to the wheel assembly; and an autonomous guidance system coupled to the motor.", "2 . The robot of claim 1 , wherein the wheel assembly comprises two legs.", "3 . The robot of claim 1 , wherein the wheel assembly comprises three legs.", "4 . The robot of claim 1 , wherein the wheel assembly comprises four legs.", "5 . The robot of claim 1 , wherein the wheel assembly comprises five legs.", "6 . The robot of claim 1 , wherein the wheel assembly comprises six legs.", "7 . The robot of claim 1 , wherein the suspension system comprises a torsion spring coupled to each leg of the plurality of legs.", "8 . The robot of claim 1 , wherein the suspension system comprises a torsion spring coupled to the plurality of legs.", "a microcontroller; a power source; and a sensor suite.", "a LiDAR device; a GPS receiver; and a camera.", "11 . The robot of claim 1 , wherein the suspension system comprises a spring-and-damper suspension system coupled between the body and the motor.", "a spring-and-damper suspension system coupled between the body and the motor; a spring coupled to each leg of the plurality of legs; and a spring-and-damper coupled to each leg of the plurality of legs.", "13 . The robot of claim 1 , wherein the central gear passively drives the plurality of legs between the closed position and the open position.", "14 . The robot of claim 1 , comprising a locking mechanism that secures the plurality of legs in at least one of the closed position and the open position.", "15 . The robot of claim 14 , wherein the locking mechanism is configured to be selectively released responsive to input from a user.", "16 . The robot of claim 14 , wherein the locking mechanism is configured to be selectively released responsive to a signal from the autonomous guidance system.", "17 . The robot of claim 14 , comprising an actuator coupled to a leg of the plurality of legs to selectively move the leg between the closed position and the open position in response a signal from the autonomous guidance system."], "bibtex": "@patent{20240181805,\n    title = {WHEEL AND LEG TRANSFORMABLE ROBOT WITH SUSPENSION AND AUTONOMOUS NAVIGATION},\n    number = {20240181805},\n    year = {2024},\n    note = {File: US20240181805A1-20240606.XML}\n    }", "classification": "B60B1506FI"}, {"title": "RAILWAY WHEEL", "doc_number": "20240181806", "filename": "US20240181806A1-20240606.XML", "abstract": "In a cross section of the hub part of the railway wheel, obtained when the hub part is cut in a central axis direction of the through hole along a plane including a central axis, when regions of 15 mm×15 mm defined by a plurality of axial line segments parallel to the central axis and arranged at a pitch of 15 mm in a radial direction from an inner peripheral surface of the through hole, and by a plurality of radial line segments perpendicular to the central axis and arranged at a pitch of 15 mm in the central axis direction from a surface of the hub part in which an opening of the through hole is formed are defined as rectangular regions, the average C concentration in each rectangular region in the cross section of the hub part is less than 0.90% by mass.", "detailed_description": [""], "claims": ["a rim part, a hub part having a through hole, and a web part which is disposed between the rim part and the hub part, and is connected to the rim part and the hub part, wherein a chemical composition of the railway wheel consists of, in mass %, C: 0.60 to 0.80%, Si: 1.00% or less, Mn: 0.10 to 1.50%, P: 0.050% or less, S: 0.030% or less, N: 0.0200% or less, Al: 0 to 0.500%, Cu: 0 to 0.50%, Ni: 0 to 0.50%, Cr: 0 to 0.50%, V: 0 to 0.12%, Ti: 0 to 0.010%, Mo: 0 to 0.20%, and Nb: 0 to 0.050%, with the balance being Fe and impurities, and wherein in a cross section of the hub part obtained when, in a central axis direction of the through hole, the hub part is cut along a plane that includes the central axis, when regions of 15 mm×15 mm defined by a plurality of axial line segments which are parallel to the central axis and which are arranged at a pitch of 15 mm in a radial direction of the railway wheel from an inner peripheral surface of the through hole, and by a plurality of radial line segments which are perpendicular to the central axis and which are arranged at a pitch of 15 mm in the central axis direction from a surface of the hub part that is a surface in which an opening of the through hole is formed are defined as rectangular regions, an average C concentration in each rectangular region in the cross section of the hub part is less than 0.90% by mass.", "Al: 0.001 to 0.500%, Cu: 0.01 to 0.50%, Ni: 0.01 to 0.50%, Cr: 0.01 to 0.50%, V: 0.01 to 0.12%, Ti: 0.001 to 0.010%, Mo: 0.01 to 0.20%, and Nb: 0.010 to 0.050%."], "bibtex": "@patent{20240181806,\n    title = {RAILWAY WHEEL},\n    number = {20240181806},\n    year = {2024},\n    note = {File: US20240181806A1-20240606.XML}\n    }", "classification": "B60B1700FI"}, {"title": "BICYCLE DRIVE ASSEMBLY", "doc_number": "20240181807", "filename": "US20240181807A1-20240606.XML", "abstract": "A bicycle drive assembly may include an axle, a hub shell rotatably mounted on the axle by a first bearing, a free hub rotatably mounted on the axle by a second bearing, and a ratchet mechanism releasably coupling the free hub to the hub shell to transmit torque from the free hub to the hub. The ratchet mechanism may include a first ratchet ring having an inner surface joined to the hub shell for rotation with the hub shell and a second ratchet ring having an inner surface joined to the free hub for rotation with the free hub. The first ratchet ring and the second ratchet ring encircle and radially overlap the first bearing and the second bearing, respectively. At least one spring resiliently biases the first ratchet face and the second ratchet face into engagement to transmit torque from the free hub to the hub shell.", "detailed_description": ["Disclosed are example bicycle drive assemblies that may offer greater durability and lower weight, easier maintenance, lower manufacturing complexity and cost, and higher degrees of engagement between the free hub and the hub shell. The example bicycle drive assemblies comprise a ratchet mechanism that may comprise ratchet rings which are joined to the hub shell and the free hub. Because the ratchet rings are formed separately from the hub shell and the free hub, the ratchet rings may be formed from harder, more durable materials while the hub shell and/or the free hub are formed from lighter weight materials.", "", "The ratchet rings of the example bicycle drive assemblies may overlap and encircle the bearings that rotatably support the hub shell and the free hub about the axle. Because the ratchet rings overlap the bearings, the bearings of the hub shell and the free hub may be more closely positioned to one another along the axle. As a result, deflection of the axle may be reduced. This deflection reduction may result in more reliable engagement and less wheel flex. This deflection reduction may also result in less wear of the axle and bearings, increasing durability and prolonging life of the drive assembly.", "", "The example bicycle drive assemblies may comprise a spring, such as a wave washer, captured between bearings that rotatably support the free hub and the hub shell about the axle. The spring may reduce wear of such bearings over time and increase the durability of the drive assembly.", "", "The example bicycle drive assemblies may comprise a damper captured between one of the ratchet rings and the free hub. The damper absorbs vibration and reduces noise. The dampener may further increase the durability of the drive assembly.", "", "The example bicycle drive assemblies may comprise a retainer that retains the ratchet rings together, in engagement with one another, upon separation and withdrawal of the free hub from the hub shell. As a result, the ratchet mechanism is less likely to experience contamination during maintenance of the drive assembly.", "", "The example bicycle drive assemblies may comprise similar or substantially identical ratchet rings. High performance of the ratchet mechanism may be dependent upon the precision of the ratchet mechanism and, namely, the manufacturing precision of the ratchet faces of the ratchet rings. Because the ratchet mechanism utilizes similar or substantially identical ratchet rings, manufacturing complexity and cost may be reduced.", "", "The ratchet rings of the example bicycle drive assemblies may have inner surfaces, rather than outer surfaces, joined to the hub shell and the free hub. In some implementations, the inner surfaces include splines which are interlocked to corresponding splines formed in the hub shell and the free hub. Because the example ratchet rings have inner diameters or inner surfaces directly connected to the hub shell and the free hub, the height and surface area of the ratchet face of each of the ratchet rings may be enlarged, providing a greater number of teeth and achieving higher degrees of engagement (a larger number of engagement points) between the ratchet rings and between the free hub and the hub shell. The higher degree of engagement may offer reduced movement at the pedal to engage the drive, especially on rough or uneven terrains, such as when such drive assemblies are employed in mountain bikes.", "", "The ratchet rings of the example bicycle drive assemblies may each have an axial surface, a ratchet face, and a radial surface, the inner surface of the ratchet ring being joined to the hub shell or joined to the free hub. In some implementations, the inner surface of each of the ratchet rings is splined for being interlocked with corresponding splines of the hub shell or with corresponding splines of the free hub. The axial face, the ratchet face, may have a radial length RL. The radial surface, the inner surface, in some implementations, may have an axial length of at least 75% of the length of the axial face, at least 0.75 RL. In those implementations where the radial surface include splines, the axial length of the splines may be greater than the radial length of the ratchet faces. The relatively long axial length of the inner surface of each of the ratchet rings may reduce deflection of the of the ratchet rings to enhance performance and durability of the drive assembly.", "", "In some implementations, the cross section of the ratchet rings may have an L-shape, providing a larger ratchet face with a larger number of teeth for enhanced engagement and also providing a longer inner surface for joining to the hub shell and the free hub. In some implementations, each of the L-shaped ratchet rings has a first leg of at least 3 mm and a second leg extending perpendicular to the first leg, the second leg having a length of at least 3 mm. In some implementations, the ratchet mechanism comprises a first ratchet ring having a first leg providing a ratchet toothed surface forming a first ratchet face and a second leg having a splined surface, wherein the second leg extends from the first leg in a direction towards the hub shell, the splined surface interlocking with the hub shell. In some implementations, the ratchet mechanism comprises a second ratchet ring having a first leg providing a ratchet toothed surface forming a second ratchet face and a second leg having a splined surface, wherein the second leg of the second ratchet ring extends from the first leg in a direction towards the free hub, the splined surface interlocking with the free hub. The second legs of the first ratchet ring and the second ratchet ring extend away from one another in opposite directions.", "", "For purposes of this disclosure, the term “coupled” shall mean the joining of two members directly or indirectly to one another. Such joining may be stationary in nature or movable in nature. Such joining may be achieved with the two members, or the two members and any additional intermediate members being integrally formed as a single unitary body with one another or with the two members or the two members and any additional intermediate member being attached to one another. Such joining may be permanent in nature or alternatively may be removable or releasable in nature. The term “operably coupled” shall mean that two members are directly or indirectly joined such that motion may be transmitted from one member to the other member directly or via intermediate members.", "", "For purposes of this disclosure, the phrase “configured to” denotes an actual state of configuration that fundamentally ties the stated function/use to the physical characteristics of the feature proceeding the phrase “configured to”.", "", "For purposes of this disclosure, the term “releasably” or “removably” with respect to an attachment or coupling of two structures means that the two structures may be repeatedly connected and disconnected to and from one another without material damage to either of the two structures or their functioning.", "", "FIG.1is a side view illustrating an example bicycle20.FIG.1illustrates an example of a bicycle that includes a drive assembly for its rear-wheel that may offer greater durability and lower weight, easier maintenance, lower manufacturing complexity and cost, and higher degrees of engagement between the free hub and the hub shell. Bicycle20comprises frame22, front wheel24, front disc brake system25, rear-wheel26, rear disc brake system27, seat28, pedals30supported by crank arms31, front cog wheels32, gear chain34, rear drive assembly36including cog wheels37, front derailer38, rear derailer39, handlebars40, and braking-shifting levers42.", "", "Frame22supports the remaining components of bicycle20. Frame22comprises seat tube100, head tube102, top or cross tube104, down tube106, rake108and rear struts110. Seat tube100supports a seat post112which support seat128. Head tube102supports handlebars40and rake108. Cross tube104and down tube106extend between seat tube100and head tube102. Rake108is rotatably coupled to head tube102and supports front wheel24. Rear struts110extend rearwardly from seat tube100and support rear-wheel26and drive assembly36. Some of the various components forming frame22may be integrally formed as a single unitary body or may be welded or otherwise joined to one another. Each of such tubes or structures forming frame22may have cylindrical or non-cylindrical shapes. Each such tubes or structures may be hollow to reduce weight.", "", "Front wheel24is rotatably supported by rake108. Front disc brake system25is supported by rake108and is actuatable by cabling (not shown) to retard the rotation of or brake front wheel24. Rear-wheel26is rotatably supported by drive assembly36which is supported by struts110. Rear disc brake system27is supported by rear struts110and is actuatable by cabling (not shown) to retard the rotation of or brake rear-wheel26. In other implementations, other braking system may be employed which are actuated. For example, in other implementations, bicycle20may utilize front and rear brakes which include brake pads or bars that are selectively controlled to squeeze against a braking surface of the wheel24,26to brake their respective rotation.", "", "Seat28is supported by seat post112. Pedals30are connected to cog wheels32by crank arm31. Front cog wheels32comprise a set of differently sized cogs, in the form of gears or sprockets, which are rotatably supported by frame22. Front cog wheels32are configured to be rotated by the rotation of pedals30, by rider, about the axis of cog wheels32. Gear chain34is selectively connected one of the cog wheels32and is selectively connected to one of rear cog wheels37. Rear cog wheels37are connected a free hub which is connected to a hub shell (both of which are shown inFIGS.2and3) such that rotation of the rear cog wheels37rotates rear-wheel26. The particular cog wheels connected by gear chain34determines the speed or gear ratio of bicycle20. Gear chain32transmits motion and torque from the selected one of front cog wheels32to the selected one of rear cog wheels37to propel rear-wheel26.", "", "Front derailer38selectively connects gear chain34to a selected one of the different cog wheels or sprockets of front cog wheels32. Front derailer38shifts gear chain34from one cog wheel or sprocket to another cog wheel or sprocket of front cog wheel32. Front derailer38may be actuated by the rider.", "", "Rear derailer39selectively connects gear chain34to a selected one of the different cog wheels or sprockets of rear cog wheels37. Rear derailer39shifts gear chain34from one cog wheel or sprocket to another cog wheel or sprocket of rear cog wheels37. Rear derailer39may be actuated by a rider", "", "Handlebars40are supported by front tube102of frame22. Brake-shift levers42are movably supported by handlebars40and are operably coupled to cabling44. Brake and shift levers42may be located on each of the right and left sides of handlebars40. Brake and shift levers42are manually actuatable to individually actuate brake systems25,27and individually actuate or move derailers38,39depending upon which of the particular ones of levers42are moved.", "", "FIG.2is a side view illustrating portions of the example drive assembly36incorporated as part of bicycle20.FIG.3is a perspective view illustrating portions of the drive assembly36ofFIG.2without the rear cog wheels37. As shown byFIG.2, drive assembly36comprises axle210, hub212, free hub214and cog wheels37. Axle210comprise a shaft about which hub212and free hub214rotate. Hub200comprises a hub shell218and spoke or hub flanges220. As shown byFIG.3, each of spoke flanges220comprises spoke holes222which are circumferentially spaced about the rotational axis of hub shell218. As shown byFIG.2, spoke holes222receive end portions of spokes224(two which are shown) which have opposite ends connected to rim228of wheel26(shown inFIG.1).", "", "Free hub214comprises a free hub shell232which rotates about axle210and which engages portions of hub shell218via a ratchet mechanism (described hereafter) to transmit torque to the hub shell218to rotatably drive wheel26. Free hub shell232is connected to cog wheels37. In some implementations, cog wheels37may be provided as part of a cassette which is interlocked (via splines) to the free hub shell232. In other implementations, cog wheels37may be connected to the three of shell232in other fashions. In yet other implementations, torque may be transmitted to the free hub shell232using other mechanisms.", "", "FIGS.4-14illustrate portions of drive assembly36in more detail.FIG.4is an exploded perspective view of the axle210, hub212and free hub214of drive assembly36.FIG.5is an enlarged perspective view of the example hub shell218, illustrating interior portions of hub shell218which connect to the ratchet mechanism that connects hub shell218to the free hub shell232.FIGS.6and7are partially exploded perspective views of the example drive assembly36ofFIG.4.", "", "As shown byFIG.4, axle210supports hub212, free hub214and ratchet mechanism300. Axle210comprises axle shaft302, end cap304and endcap306. End caps304,306are mounted to opposite ends of axle shaft302and assist in retaining the remaining components of drive assembly36(excluding cog wheel37) upon axle shaft302. End caps304,306further assist in mounting axle shaft302to rear struts110of bicycle frame22. In other implementations, axle210may have other configurations.", "", "Hub212comprises hub shell218with spokes flanges220, hub bearing308and hub bearing310. Hub shell218comprises a generally hollow cylindrical structure formed from a metal, such as aluminum. Hub shell218connects to spokes224and supports rim228of wheel26. As shown byFIG.5, hub shell218comprises an axial through opening316through which axle shaft302extends. Hub shell218comprises an internal groove317that receives a snap ring318which is sized and located to axially retain bearing332about and along axle shaft302. In other implementations, ring318may be replaced with a shoulder integrally formed as part of hub shell218.", "", "As further shown byFIG.5, hub shell218comprises an internal ring320which encircles through opening316and which includes an external peripheral surface322configured to permit a ratchet ring of ratchet mechanism300to be axially slid onto and about the internal ring320and to be interlocked with the ring320inhibit the ratchet frame from rotating relative to hub shell218about the axis of axle shaft302. In the example illustrated, peripheral surface322comprises external or outwardly projecting splines324(a series of projections and grooves) that are configured to interlock with a corresponding set of internal injecting splines of the ratchet ring (to be described hereafter).", "", "In the example illustrated, hub shell218further comprises an internal groove357which encircles the through opening316. The internal groove357is configured to receive retainer, such as a C-shaped snap ring. As will be described hereafter, the internal groove357is located and sized such that the received retainer projects into the through opening316to abut an axial face of a second ratchet ring of the ratchet mechanism to retain both ratchet rings in engagement with one another, as a unit, during and after separation of freehub214from hub212.", "", "Bearings308and310extend about axle shaft302and rotatably support hub shell218for rotation about the axis of axle shaft302. In the example illustrated, bearings308,310each comprise a rolling bearing having an inner race, an outer race and rollers or balls therebetween. For example, in some implementations, bearings308,310may comprise roller bearings. In other implementations, bearings308,310may comprise other forms of bearings for rotatably supporting hub shell218about axle shaft302.", "", "Free hub214is configured to receive torque from cog wheels37and to selectively transmit the torque to hub212and wheel26via ratchet mechanism300. Free hub214comprises free hub shell232, bearing330, bearing332and bearing spacer334. Free hub shell232comprises a generally hollow cylindrical structure formed from a metal, such as aluminum. Free hub shell232has an axial opening such that shell232may extend about and along axle shaft302. Free hub shell232comprises an outer external interlocking surface338configured to interlock with cog wheels37. In the example illustrated, interlocking surface338include splines339which interlock with a cassette providing cog wheels37. In other implementations, surface338may have other configurations to interlock or key with a cassette or individual cog wheels37. In still other implementations, cog wheels37may be affixed or otherwise joined to shell232in other fashions.", "", "Similar to hub shell218, free hub shell232comprises a ring340having an external surface342configured to permit a ratchet ring of ratchet mechanism300to be axially slid onto and about the internal ring320and to be interlocked with the ring340to inhibit the ratchet ring from rotating relative to free hub shell232about the axis of axle shaft302. External surface342axially projects towards hub shell218from a collar343formed as part of free hub shell232. In the example illustrated, peripheral surface342comprises external or outwardly projecting splines344(a series of projections and grooves) that are configured to interlock with a corresponding set of inwardly projecting splines of the ratchet ring (to be described hereafter).", "", "Bearings330and332extend about axle shaft302and rotatably support free hub shell232for rotation about the axis of axle shaft302. In the example illustrated, bearings330and332each comprise a rolling bearing having an inner race, an outer race and rollers or balls therebetween. For example, in some implementations, bearings330,332may comprise roller bearings. In other implementations, bearings330,332may comprise other forms of bearings for rotatably supporting free hub shell232about axle shaft302.", "", "Bearing spacer334axially spaces bearings330and332from one another. In the example illustrated, bearing spacer334comprises an elongate sleeve positioned about axle shaft302and having axially facing edges that abut the outer race of bearings330and332. Bearing spacer334has an outer surface configured to facilitate the axial sliding positioning of free hub sleeve232over and about spacer334. In other implementations, spacer334may have other configurations or may be omitted, such as where other mechanisms or structures are incorporated into axle shaft302or other components are utilized for spacing bearings330and332.", "", "Ratchet mechanism300transmits torque from free hub214(sometimes referred to as a driver) to hub shell218(sometimes referred to as a hub sleeve). Ratchet mechanism300serves as a free wheel device or clutch adapter for connecting free hub214and hub shell218in a torque transmitting state when torque is being supplied to free wheel hub232in a first rotational direction. Ratchet mechanism300permits hub shell218and wheel26to freely rotate relative to free wheel hub212when torque is no longer being applied to free wheel hub212or when torque is being supplied to free wheel hub214in a direction opposite to that of the direction in which torque is transmitted. As shown byFIGS.4,6and7, ratchet mechanism300comprises ratchet rings350-1,350-2(collectively referred to as ratchet rings350), spring354, retainer356, and dampener358.", "", "Ratchet rings350comprise components that are distinct and separate from hub shell218and free hub shell232. As a result, ratchet rings350may be formed from materials that are different from hub shell218and free hub shell232. In the example illustrated, ratchet rings are each formed from material harder than the material or materials forming hub shell218and free hub shell232. In the example illustrated, hub shell218and free hub shell232are each formed from a lighter weight metal material, such as aluminum, whereas ratchet rings350are formed from a harder, albeit heavier, metal material such as steel or titanium. In other implementations, hub shell218, free hub shell232and ratchet rings350may be formed from other materials. For example, hub shell218and/or free hub shell232may be formed from other metals or non-metal materials, such as a fiber reinforced material. Because the shells218,232may be formed from lighter weight materials while the ratchet rings350are formed from harder materials, rear drive assembly36may have enhanced durability with a reduced overall weight.", "", "FIGS.8-10illustrate ratchet ring350-1in more detail. As shown byFIGS.8-10, ratchet ring350-1comprises an inner diameter or otherwise inner surface362, a ratchet face364, and a backside366(shown inFIGS.9and10). Inner surface362is configured to interlock with the exterior surface322of ring320of hub shell218. In the example illustrated, inner surface362is configured to facilitate axial sliding or positioning of ratchet ring350-1onto and about ring320, wherein relative rotation of ratchet ring350-1and hub shell218about the axis of axle shaft302is inhibited by such interlocking. In the example illustrated, inner surface362comprise a series of splines370which mesh with corresponding splines324on exterior surface322of ring320of hub shell218. In other implementations, other interlocking features may be provided on inner surface362(and outer surface322) to facilitate such interlocking. For example, surfaces322and362may have polygonal cross-sectional shape that facilitates interlocking or keying of ring350-1onto ring320of hub shell218.", "", "Ratchet face364comprise the face of ratchet ring350-1which is to engage the corresponding ratchet face364of ring350-2to facilitate transmission of torque from ring350-2to ring350-1. Ratchet face364comprise a series of ramped teeth372that are configured to bite into the corresponding teeth372of the ratchet face364of ring350-2when ring350-2is being rotatably driven in a torque transmitting direction by free hub214. Ramped teeth372slide over or ratchet relative to the teeth372of ratchet ring350-2when ring350-2is not being rotatably driven and when ring350-1and wheel26are rotating in a non-torque transmitting direction (opposite to the torque transmitting direction), such as during coasting of the bicycle.", "", "Because the inner surface362of ring350-1is joined to the exterior surface322of ring320of axle hub218, the radial length RL of ratchet face364is not limited or constricted by the diameter of inner surface362. Moreover, the outer diameter of ratchet face364is not limited or constricted by the diameter of inner surface362. As result, the radial length RL of ratchet face364and the outer and inner diameter ratchet face364may be larger. The larger radial length RL of ratchet face364provides a greater surface area for engagement with the ratchet face of ring350-2. The larger inner and outer diameter of ratchet face364facilitate the provision of a greater number of individual ratchet teeth372. Because the example ratchet rings have inner diameters or inner surfaces directly connected to the hub shell and the free hub, the height and surface area of the ratchet face of each of the ratchet rings350may be enlarged, providing a greater number of teeth372and achieving higher degrees of engagement (a larger number of engagement points) between the ratchet rings350and between the free hub214and the hub212. The higher degree of engagement may offer reduced movement of the pedal to engage the drive assembly, especially on rough or uneven terrains, such as when such drive assemblies are employed in mountain bikes.", "", "In some implementations ratchet face364may have a radial length RL of at least 3 mm. In some implementations, ratchet face364may have at least 40 teeth having a pitch diameter of at least 24 mm and with each tooth having a height at least 0.30 mm. In some implementations, ratchet face364may have at least 60 teeth having a pitch diameter of at least 24 mm and with each tooth having a height at least 0.25 mm. In some implementations, ratchet face364may have at least 80 teeth having a pitch diameter of at least 24 mm and with each tooth having a height at least 0.20 mm. In some implementations, ratchet face364may have at least 100 teeth having a pitch diameter of at least 24 mm and with each tooth having a height at least 0.15 mm. In some implementations, the pitch and tube height ratchet face having 40, 60, 80, or 100 teeth may vary. As previously noted, the director joining of the inner surface362of ratchet ring350-1facilitates a provision of the larger number of teeth in the greater engagement points for ratchet face364.", "", "As shown mayFIG.10, ring350-1is configured such that the inner surface362has a longer axial length AL. The axial face, the ratchet face364, may have a radial length RL, wherein the inner surface may have an axial length AL of at least 75% of the length of the axial face, at least 0.75 RL. In those implementations where the inner surface include splines, the axial length of the splines may be at least 75% of the length of the axial face, at least 0.75 RL in some implementations, the axial length of the inner surface362or the axial length of the splines370may be greater than or equal to the radial length RL of the ratchet face364. The relatively long axial length of the inner surface362of ratchet ring350-1may reduce deflection of the ratchet ring350-1to enhance performance and durability of the drive assembly.", "", "As shown byFIGS.9and10, backside366is shaped such that ratchet ring350-1has an L-shaped cross-section, wherein the L-shaped includes a first leg376supporting the ratchet face364and a second leg378forming the inner surface362with the splines370. Legs376and378may each have a length of at least 3 mm. In the example illustrated, the surface of legs376and378, forming the backside366, form a shoulder380against which spring354may be retained, wherein the spring may extend around leg378and may abut against the rear face of leg376. As discussed above, the length or radial length of leg376increases the area number of teeth of ratchet face364. The axial length of leg378increases the axial length of inner surface362and the axial length of splines370to increase the number of engagement points on ratchet face364and to reduce deflection of ratchet ring350-1. The L-shape of ring350-1facilitates a provision of the larger ratchet face364and the longer inner surface362and splines370while reducing the overall weight of ring in other implementations, rather than having an L-shape, ring350-1may have a cross-sectional shape that is rectangular, square, rounded, V-shaped, or the like.", "", "In the example illustrated, ratchet ring350-2is substantially similar to or identical to ratchet ring350-1, but wherein ratchet ring350-2mirrors ratchet ring350-1as part of drive assembly36. In other words, ratchet face364of ratchet rings350face one another, whereas legs378of ratchet rings350extend in opposite directions away from one another. Leg378of ratchet ring350-1extends from ratchet face364towards hub sleeve218. Leg378of ratchet ring350-2extends away from ratchet face364towards free wheel hub sleeve232. The splines370of ratchet ring350-2interlock with the splines344of ring340of free hub shell232, inhibiting relative rotation of ratchet ring350-2and free hub shell232. During the transmission of torque, ramped teeth372of ratchet ring350-2bite into and against the teeth372of ratchet ring350-1such that rings350rotate in unison with one another. During coasting or periods when torque is not being transmitted, teeth372of ratchet rings350slide over top of one another, at least one of the rings350rotating relative to the other of the rings350.", "", "High performance of the ratchet mechanism300may be dependent upon the precision of the ratchet mechanism300and, namely, the manufacturing precision of the ratchet faces364of the ratchet rings350. Because the ratchet mechanism utilizes similar or substantially identical ratchet rings350, manufacturing complexity and cost may be reduced. In other implementations, rings350-1and350-2may be different from one another, yet provide one or more of the above-described features or having one or more of the above-described characteristics.", "", "As shown byFIG.11, spring354is captured between an internal shoulder384of hub shell218and the backside360of ratchet ring350-1. Spring354overlaps and encircles bearing310. In the example illustrated, spring354is in the form of a steel multiturn wave compression spring which encircles leg378and which abuts leg380of ratchet ring350-1. Spring354resiliently biases ratchet ring350-1towards and against ratchet ring350-2. During rotation of ratchet ring350-1relative to ratchet ring350-2, such as when wheel26is coasting without receiving torque from free hub214, ratchet ring350-1may be urged against spring354, compressing spring354towards hub shell218to a greater extent. Although spring354is illustrated as a steel multi-turn wave compression spring, in other implementations, spring354may be formed from other materials and/or may have other configurations or types. For example, spring354may alternatively comprise a compression coil spring.", "", "Retainer356comprise a mechanism configured to retain ratchet ring350-2against or in a connected state to ratchet ring350-1during and after separation of free hub214from hub212. In some circumstances, maintenance of drive assembly36may involve disconnection and separation of at least portions of free hub214from hub212. Without retainer356, ratchet ring350-2might otherwise separate from ratchet ring350-1and fall to the ground, becoming contaminated. Retainer356reduces the likelihood of such contamination, facilitating easier maintenance of drive assembly36.", "", "As shown byFIG.7, in the example illustrated, retainer356comprises a C-clip or ring.FIG.12is an enlarged view of portions of the sectional view of those portions of drive assembly36shown inFIG.11. As shown byFIG.12, retainer356is retained within an internal groove357(also shown inFIG.5) of hub shell218. The diameter and location of groove357and the radial width of retainer356are such that retainer356projects beyond groove357into abutment with leg376on the backside366of ratchet ring350-2. Although illustrated as a C-shaped snap ring or clip, retainer356may have other configurations facilitating an axial retention of ratchet ring to within hub shell218and against ratchet ring350-1during and after separation of free hub214from hub212.", "", "As shown byFIG.7, dampener358comprises an annular ring and is formed from an elastic and/or compressible material, such as a rubber a rubber-like material. As shown byFIG.12, dampener358comprises a dampening portion388and the sealing portion390.", "", "Dampening portion388comprises that portion of dampener358that is axially captured between an axial edge or end of ratchet ring350-2and an axial face of free hub shell232. In the example illustrated, dampening portion388directly abuts an axial end or edge of leg378of ratchet ring350-2and directly abuts an axial face of collar343of free hub shell232. In some implementations, additional components or structures may be sandwiched between dampening portion388and axial end portions of free hub shell232and/or the axial end portions of ratchet ring350-2. Dampening portion388is captured within an outer circumferential groove345formed in shell232between the exterior surface342and collar343. In the example illustrated, dampening portion388encircles bearing332while being supported outside of and out of contact with bearing332by free hub shell232. Dampening portion388absorbs vibration and size or dampens vibration by serving as an axial bumper or shock absorber between ratchet ring350-2and free hub shell232.", "", "Sealing portion390outwardly extends from dampening portion388along the backside366of ratchet ring350-2. Sealing portion390forms a flap that resiliently extends into abutment with an interior surface of hub shell218. As a result, dampener358continuously extends from an outer surface of free hub shell232and to an inner surface of hub shell218, forming a seal therebetween. Sealing portion390is sufficiently flexible such that dampener358may be withdrawn from within the interior of hub shell218during the withdrawal of free hub shell232from the interior of hub shell218. As discussed above, during such withdrawal during which the axially extending splines of surface342are being axially slid relative to the internal splined of ratchet ring350-2, retainer356secures ratchet ring350-2in place against ratchet ring350-1. In other implementations, the dampening and sealing functions provided by dampener may alternatively be formed by separate compressible and/or elastomeric components.", "", "As further shown byFIG.12, the overall construction of drive assembly36results in several components radially overlapping one another. This is in part achieved by the nesting of free hub shell232within hub shell218. In the example illustrated, although free of shell232is partially nestled within hub shell218, bearing310does not support (is not inset within) any portion of free hub shell232. Likewise, bearing332does not support (is not inset within) any portion of hub shell218.", "", "Ratchet ring350-1radially overlaps and extends about or around bearing310. Ratchet ring350-2radially overlaps and extends about around bearing332. Spring354radially overlaps and extends about or around bearing310. Dampener358radially overlaps and extends about around bearing332. The flange220and the associated spoke openings222radially overlap and extend about or around portions of bearing332, the bearing supporting free hub shell232. Because such components radially overlap one another, the bearings310,332supporting the axial end portions of hub shell218and free hub shell232, respectively, may be axially positioned closer to one another. As a result, the bearings310,332are positioned closer to the axial end portions or axial ends of hub shell218and free hub shell232, respectively. Because the bearings310,332of the hub shell and the free hub may be more closely positioned to one another along the axle210, deflection of the axle shaft302may be reduced. This deflection reduction may result in better stiffness, bearing wear and power transfer. This deflection reduction may also result in less wear of the axle shaft302and bearings308,310,330,332, increasing durability and prolonging life of the drive assembly36.", "", "As further shown byFIG.12, the nesting of free hub shell232within hub shell218also facilitates the radial alignment of the surfaces322and340as well as the radial alignment of their splines in the particular examples. The nesting of the free hub shell232within hub shell218further facilitates the radial alignment of bearings310and330. Said another way, the free hub shell232and hub shell218are configured such that axial end portions of free hub shell232are positioned partially within hub shell218, the outer surface of the splines of surfaces322and340are radially spaced by the same distance from the rotational axis or centerline of axle shaft302. Likewise, the inner races and/or the outer races of bearings310and332are each radially spaced by the same radial distance from the rotational axis and line of axle shaft302.", "", "As shown byFIGS.13and14, drive assembly36additionally comprises a spring394captured between bearing310and bearing323to resiliently urge the bearing310and the bearing323away from one another. The spring394may reduce wear of such bearings over time and increase the durability of the drive assembly. In the example illustrated, spring394encircles axle shaft302. In the example illustrated, spring394comprises a wave washer captured between the races of bearings310and323. In other implementations, spring394may comprise other types of springs, such as a coil compression spring, leaf spring, or the like.", "", "Although the present disclosure has been described with reference to example implementations, workers skilled in the art will recognize that changes may be made in form and detail without departing from the disclosure. For example, although different example implementations may have been described as including features providing various benefits, it is contemplated that the described features may be interchanged with one another or alternatively be combined with one another in the described example implementations or in other alternative implementations. Because the technology of the present disclosure is relatively complex, not all changes in the technology are foreseeable. The present disclosure described with reference to the example implementations and set forth in the following claims is manifestly intended to be as broad as possible. For example, unless specifically otherwise noted, the claims reciting a single particular element also encompass a plurality of such particular elements. The terms “first”, “second”, “third” and so on in the claims merely distinguish different elements and, unless otherwise stated, are not to be specifically associated with a particular order or particular numbering of elements in the disclosure."], "claims": ["an axle extending along an axis; a hub shell rotatably mounted on the axle by a first bearing; a free hub rotatably mounted on the axle by a second bearing; and a ratchet mechanism releasably coupling the free hub to the hub shell to transmit torque from the free hub to the hub, the ratchet mechanism comprising: a first ratchet ring having an inner surface joined to the hub shell for rotation with the hub shell, the first ratchet ring encircling and radially overlapping the first bearing, the first ratchet ring having a first ratchet face; a second ratchet ring having an inner surface joined to the free hub for rotation with the free hub, the second ratchet ring encircling and radially overlapping the second bearing; and at least one spring resiliently biasing the first ratchet face and the second ratchet face into engagement to transmit torque from the free hub to the hub shell, wherein the first ratchet ring has an L-shaped cross section having a first leg and a second leg, the second leg having a series of splines in engagement with the hub shell, wherein an entirety of the first ratchet face is radially outward of the series of splines, and wherein the first leg extends radially outward from the second leg and comprises the first ratchet face.", "2 . The bicycle drive assembly of claim 1 , wherein the inner surface of the second ratchet ring is interlocked to the free hub to transmit torque from the free hub to the second ratchet ring and wherein the inner surface of the first ratchet ring is interlocked to the hub shell to transmit torque from the first ratchet ring to the hub shell.", "3 . The bicycle drive assembly of claim 2 , wherein the inner surface of the first ratchet ring and the inner surface of the second ratchet ring are each splined.", "4 . The bicycle drive assembly of claim 3 , wherein the first ratchet face has at least 40 teeth.", "5 . The bicycle drive assembly of claim 3 , wherein the first ratchet face has at least 60 teeth.", "6 . The bicycle drive assembly of claim 3 , wherein the first ratchet face has at least 80 teeth.", "7 . The bicycle drive assembly of claim 3 , wherein the first ratchet face has at least 100 teeth.", "8 . The bicycle drive assembly of claim 4 , wherein the free hub is formed from a first material having a first hardness and wherein the second ratchet ring is formed from a second material having a second hardness greater than the first hardness.", "9 . The bicycle drive assembly of claim 8 , wherein the free hub is formed from aluminum alloy and wherein the second ratchet ring is formed from steel or titanium alloy.", "10 . The bicycle drive assembly of claim 1 , wherein the first ratchet ring and the second ratchet ring are identical to one another.", "11 . The bicycle drive assembly of claim 10 , wherein the first ratchet face and the second ratchet face each have at least 40 teeth.", "12 . The bicycle drive assembly of claim 11 , wherein the first ratchet face and the second ratchet face each have a radial length of at least 3 mm.", "13 . The bicycle drive assembly of claim 11 , wherein the first ratchet face and the second ratchet face each have an inner diameter of at least 24 mm.", "14 . The bicycle drive assembly of claim 11 , wherein the at least 40 teeth have a pitch diameter of at least 25.5 mm.", "15 . (canceled)", "16 . The bicycle drive assembly of claim 1 , wherein the first bearing is axially spaced from the second bearing by no greater than 5 mm.", "17 . The bicycle drive assembly of claim 1 , wherein the second leg has a rear face directly opposite the first ratchet face and wherein the at least one spring comprises a spring in contact with the rear face.", "a retainer secured to the hub shell and in engagement with the rear face of the first leg of the second ratchet ring to retain the second ratchet ring against the first ratchet ring upon separation of the free hub from the hub shell.", "a retainer having a retainer surface facing in a direction away from the first ratchet ring and in engagement with the second ratchet ring, the retainer being secured to the hub shell by projecting into an outwardly extending undercut in the hub shell, the undercut having an undercut surface in contact with the retainer surface to inhibit separation of the first ratchet ring and the second ratchet ring upon separation of the free hub from the hub shell.", "a resiliently flexible flap captured between an outer surface of the second leg of the second ratchet ring and the hub shell.", "an axle extending along an axis; a hub shell rotatably mounted on the axle by a first bearing; a free hub rotatably mounted on the axle by a second bearing; a ratchet mechanism releasably coupling the free hub to the hub shell to transmit torque from the free hub to the hub, the ratchet mechanism comprising: a first ratchet ring having an inner surface joined to the hub shell for rotation with the hub shell, the first ratchet ring encircling and radially overlapping the first bearing, the first ratchet ring having a first ratchet face; a second ratchet ring having an inner surface joined to the free hub for rotation with the free hub, the second ratchet ring encircling and radially overlapping the second bearing; at least one spring resiliently biasing the first ratchet face and the second ratchet face into engagement to transmit torque from the free hub to the hub shell; and a retainer having a retainer surface facing in a direction away from the first ratchet ring and in engagement with the second ratchet ring, the retainer being secured to the hub shell by projecting into an outwardly extending undercut in the hub shell, the undercut having an undercut surface in contact with the retainer surface to inhibit separation of the first ratchet ring and the second ratchet ring upon separation of the free hub from the hub shell."], "bibtex": "@patent{20240181807,\n    title = {BICYCLE DRIVE ASSEMBLY},\n    number = {20240181807},\n    year = {2024},\n    note = {File: US20240181807A1-20240606.XML}\n    }", "classification": "B60B2704FI"}, {"title": "BICYCLE DRIVE ASSEMBLY", "doc_number": "20240181808", "filename": "US20240181808A1-20240606.XML", "abstract": "A bicycle drive assembly may include an axle, a hub shell rotatably mounted on the axle by a first bearing, a free hub rotatably mounted on the axle by a second bearing, and a ratchet mechanism releasably coupling the free hub to the hub shell to transmit torque from the free hub to the hub. The ratchet mechanism may include a first ratchet ring having an inner surface joined to the hub shell for rotation with the hub shell and a second ratchet ring having an inner surface joined to the free hub for rotation with the free hub. The first ratchet ring and the second ratchet ring encircle and radially overlap the first bearing and the second bearing, respectively. At least one spring resiliently biases the first ratchet face and the second ratchet face into engagement to transmit torque from the free hub to the hub shell.", "detailed_description": ["Disclosed are example bicycle drive assemblies that may offer greater durability and lower weight, easier maintenance, lower manufacturing complexity and cost, and higher degrees of engagement between the free hub and the hub shell. The example bicycle drive assemblies comprise a ratchet mechanism that may comprise ratchet rings which are joined to the hub shell and the free hub. Because the ratchet rings are formed separately from the hub shell and the free hub, the ratchet rings may be formed from harder, more durable materials while the hub shell and/or the free hub are formed from lighter weight materials.", "", "The ratchet rings of the example bicycle drive assemblies may overlap and encircle the bearings that rotatably support the hub shell and the free hub about the axle. Because the ratchet rings overlap the bearings, the bearings of the hub shell and the free hub may be more closely positioned to one another along the axle. As a result, deflection of the axle may be reduced. This deflection reduction may result in more reliable engagement and less wheel flex. This deflection reduction may also result in less wear of the axle and bearings, increasing durability and prolonging life of the drive assembly.", "", "The example bicycle drive assemblies may comprise a spring, such as a wave washer, captured between bearings that rotatably support the free hub and the hub shell about the axle. The spring may reduce wear of such bearings over time and increase the durability of the drive assembly.", "", "The example bicycle drive assemblies may comprise a damper captured between one of the ratchet rings and the free hub. The damper absorbs vibration and reduces noise. The dampener may further increase the durability of the drive assembly.", "", "The example bicycle drive assemblies may comprise a retainer that retains the ratchet rings together, in engagement with one another, upon separation and withdrawal of the free hub from the hub shell. As a result, the ratchet mechanism is less likely to experience contamination during maintenance of the drive assembly.", "", "The example bicycle drive assemblies may comprise similar or substantially identical ratchet rings. High performance of the ratchet mechanism may be dependent upon the precision of the ratchet mechanism and, namely, the manufacturing precision of the ratchet faces of the ratchet rings. Because the ratchet mechanism utilizes similar or substantially identical ratchet rings, manufacturing complexity and cost may be reduced.", "", "The ratchet rings of the example bicycle drive assemblies may have inner surfaces, rather than outer surfaces, joined to the hub shell and the free hub. In some implementations, the inner surfaces include splines which are interlocked to corresponding splines formed in the hub shell and the free hub. Because the example ratchet rings have inner diameters or inner surfaces directly connected to the hub shell and the free hub, the height and surface area of the ratchet face of each of the ratchet rings may be enlarged, providing a greater number of teeth and achieving higher degrees of engagement (a larger number of engagement points) between the ratchet rings and between the free hub and the hub shell. The higher degree of engagement may offer reduced movement at the pedal to engage the drive, especially on rough or uneven terrains, such as when such drive assemblies are employed in mountain bikes.", "", "The ratchet rings of the example bicycle drive assemblies may each have an axial surface, a ratchet face, and a radial surface, the inner surface of the ratchet ring being joined to the hub shell or joined to the free hub. In some implementations, the inner surface of each of the ratchet rings is splined for being interlocked with corresponding splines of the hub shell or with corresponding splines of the free hub. The axial face, the ratchet face, may have a radial length RL. The radial surface, the inner surface, in some implementations, may have an axial length of at least 75% of the length of the axial face, at least 0.75 RL. In those implementations where the radial surface include splines, the axial length of the splines may be greater than the radial length of the ratchet faces. The relatively long axial length of the inner surface of each of the ratchet rings may reduce deflection of the of the ratchet rings to enhance performance and durability of the drive assembly.", "", "In some implementations, the cross section of the ratchet rings may have an L-shape, providing a larger ratchet face with a larger number of teeth for enhanced engagement and also providing a longer inner surface for joining to the hub shell and the free hub. In some implementations, each of the L-shaped ratchet rings has a first leg of at least 3 mm and a second leg extending perpendicular to the first leg, the second leg having a length of at least 3 mm. In some implementations, the ratchet mechanism comprises a first ratchet ring having a first leg providing a ratchet toothed surface forming a first ratchet face and a second leg having a splined surface, wherein the second leg extends from the first leg in a direction towards the hub shell, the splined surface interlocking with the hub shell. In some implementations, the ratchet mechanism comprises a second ratchet ring having a first leg providing a ratchet toothed surface forming a second ratchet face and a second leg having a splined surface, wherein the second leg of the second ratchet ring extends from the first leg in a direction towards the free hub, the splined surface interlocking with the free hub. The second legs of the first ratchet ring and the second ratchet ring extend away from one another in opposite directions.", "", "For purposes of this disclosure, the term “coupled” shall mean the joining of two members directly or indirectly to one another. Such joining may be stationary in nature or movable in nature. Such joining may be achieved with the two members, or the two members and any additional intermediate members being integrally formed as a single unitary body with one another or with the two members or the two members and any additional intermediate member being attached to one another. Such joining may be permanent in nature or alternatively may be removable or releasable in nature. The term “operably coupled” shall mean that two members are directly or indirectly joined such that motion may be transmitted from one member to the other member directly or via intermediate members.", "", "For purposes of this disclosure, the phrase “configured to” denotes an actual state of configuration that fundamentally ties the stated function/use to the physical characteristics of the feature proceeding the phrase “configured to”.", "", "For purposes of this disclosure, the term “releasably” or “removably” with respect to an attachment or coupling of two structures means that the two structures may be repeatedly connected and disconnected to and from one another without material damage to either of the two structures or their functioning.", "", "FIG.1is a side view illustrating an example bicycle20.FIG.1illustrates an example of a bicycle that includes a drive assembly for its rear-wheel that may offer greater durability and lower weight, easier maintenance, lower manufacturing complexity and cost, and higher degrees of engagement between the free hub and the hub shell. Bicycle20comprises frame22, front wheel24, front disc brake system25, rear-wheel26, rear disc brake system27, seat28, pedals30supported by crank arms31, front cog wheels32, gear chain34, rear drive assembly36including cog wheels37, front derailer38, rear derailer39, handlebars40, and braking-shifting levers42.", "", "Frame22supports the remaining components of bicycle20. Frame22comprises seat tube100, head tube102, top or cross tube104, down tube106, rake108and rear struts110. Seat tube100supports a seat post112which support seat128. Head tube102supports handlebars40and rake108. Cross tube104and down tube106extend between seat tube100and head tube102. Rake108is rotatably coupled to head tube102and supports front wheel24. Rear struts110extend rearwardly from seat tube100and support rear-wheel26and drive assembly36. Some of the various components forming frame22may be integrally formed as a single unitary body or may be welded or otherwise joined to one another. Each of such tubes or structures forming frame22may have cylindrical or non-cylindrical shapes. Each such tubes or structures may be hollow to reduce weight.", "", "Front wheel24is rotatably supported by rake108. Front disc brake system25is supported by rake108and is actuatable by cabling (not shown) to retard the rotation of or brake front wheel24. Rear-wheel26is rotatably supported by drive assembly36which is supported by struts110. Rear disc brake system27is supported by rear struts110and is actuatable by cabling (not shown) to retard the rotation of or brake rear-wheel26. In other implementations, other braking system may be employed which are actuated. For example, in other implementations, bicycle20may utilize front and rear brakes which include brake pads or bars that are selectively controlled to squeeze against a braking surface of the wheel24,26to brake their respective rotation.", "", "Seat28is supported by seat post112. Pedals30are connected to cog wheels32by crank arm31. Front cog wheels32comprise a set of differently sized cogs, in the form of gears or sprockets, which are rotatably supported by frame22. Front cog wheels32are configured to be rotated by the rotation of pedals30, by rider, about the axis of cog wheels32. Gear chain34is selectively connected one of the cog wheels32and is selectively connected to one of rear cog wheels37. Rear cog wheels37are connected a free hub which is connected to a hub shell (both of which are shown inFIGS.2and3) such that rotation of the rear cog wheels37rotates rear-wheel26. The particular cog wheels connected by gear chain34determines the speed or gear ratio of bicycle20. Gear chain32transmits motion and torque from the selected one of front cog wheels32to the selected one of rear cog wheels37to propel rear-wheel26.", "", "Front derailer38selectively connects gear chain34to a selected one of the different cog wheels or sprockets of front cog wheels32. Front derailer38shifts gear chain34from one cog wheel or sprocket to another cog wheel or sprocket of front cog wheel32. Front derailer38may be actuated by the rider.", "", "Rear derailer39selectively connects gear chain34to a selected one of the different cog wheels or sprockets of rear cog wheels37. Rear derailer39shifts gear chain34from one cog wheel or sprocket to another cog wheel or sprocket of rear cog wheels37. Rear derailer39may be actuated by a rider", "", "Handlebars40are supported by front tube102of frame22. Brake-shift levers42are movably supported by handlebars40and are operably coupled to cabling44. Brake and shift levers42may be located on each of the right and left sides of handlebars40. Brake and shift levers42are manually actuatable to individually actuate brake systems25,27and individually actuate or move derailers38,39depending upon which of the particular ones of levers42are moved.", "", "FIG.2is a side view illustrating portions of the example drive assembly36incorporated as part of bicycle20.FIG.3is a perspective view illustrating portions of the drive assembly36ofFIG.2without the rear cog wheels37. As shown byFIG.2, drive assembly36comprises axle210, hub212, free hub214and cog wheels37. Axle210comprise a shaft about which hub212and free hub214rotate. Hub200comprises a hub shell218and spoke or hub flanges220. As shown byFIG.3, each of spoke flanges220comprises spoke holes222which are circumferentially spaced about the rotational axis of hub shell218. As shown byFIG.2, spoke holes222receive end portions of spokes224(two which are shown) which have opposite ends connected to rim228of wheel26(shown inFIG.1).", "", "Free hub214comprises a free hub shell232which rotates about axle210and which engages portions of hub shell218via a ratchet mechanism (described hereafter) to transmit torque to the hub shell218to rotatably drive wheel26. Free hub shell232is connected to cog wheels37. In some implementations, cog wheels37may be provided as part of a cassette which is interlocked (via splines) to the free hub shell232. In other implementations, cog wheels37may be connected to the three of shell232in other fashions. In yet other implementations, torque may be transmitted to the free hub shell232using other mechanisms.", "", "FIGS.4-14illustrate portions of drive assembly36in more detail.FIG.4is an exploded perspective view of the axle210, hub212and free hub214of drive assembly36.FIG.5is an enlarged perspective view of the example hub shell218, illustrating interior portions of hub shell218which connect to the ratchet mechanism that connects hub shell218to the free hub shell232.FIGS.6and7are partially exploded perspective views of the example drive assembly36ofFIG.4.", "", "As shown byFIG.4, axle210supports hub212, free hub214and ratchet mechanism300. Axle210comprises axle shaft302, end cap304and endcap306. End caps304,306are mounted to opposite ends of axle shaft302and assist in retaining the remaining components of drive assembly36(excluding cog wheel37) upon axle shaft302. End caps304,306further assist in mounting axle shaft302to rear struts110of bicycle frame22. In other implementations, axle210may have other configurations.", "", "Hub212comprises hub shell218with spokes flanges220, hub bearing308and hub bearing310. Hub shell218comprises a generally hollow cylindrical structure formed from a metal, such as aluminum. Hub shell218connects to spokes224and supports rim228of wheel26. As shown byFIG.5, hub shell218comprises an axial through opening316through which axle shaft302extends. Hub shell218comprises an internal groove317that receives a snap ring318which is sized and located to axially retain bearing332about and along axle shaft302. In other implementations, ring318may be replaced with a shoulder integrally formed as part of hub shell218.", "", "As further shown byFIG.5, hub shell218comprises an internal ring320which encircles through opening316and which includes an external peripheral surface322configured to permit a ratchet ring of ratchet mechanism300to be axially slid onto and about the internal ring320and to be interlocked with the ring320inhibit the ratchet frame from rotating relative to hub shell218about the axis of axle shaft302. In the example illustrated, peripheral surface322comprises external or outwardly projecting splines324(a series of projections and grooves) that are configured to interlock with a corresponding set of internal injecting splines of the ratchet ring (to be described hereafter).", "", "In the example illustrated, hub shell218further comprises an internal groove357which encircles the through opening316. The internal groove357is configured to receive retainer, such as a C-shaped snap ring. As will be described hereafter, the internal groove357is located and sized such that the received retainer projects into the through opening316to abut an axial face of a second ratchet ring of the ratchet mechanism to retain both ratchet rings in engagement with one another, as a unit, during and after separation of freehub214from hub212.", "", "Bearings308and310extend about axle shaft302and rotatably support hub shell218for rotation about the axis of axle shaft302. In the example illustrated, bearings308,310each comprise a rolling bearing having an inner race, an outer race and rollers or balls therebetween. For example, in some implementations, bearings308,310may comprise roller bearings. In other implementations, bearings308,310may comprise other forms of bearings for rotatably supporting hub shell218about axle shaft302.", "", "Free hub214is configured to receive torque from cog wheels37and to selectively transmit the torque to hub212and wheel26via ratchet mechanism300. Free hub214comprises free hub shell232, bearing330, bearing332and bearing spacer334. Free hub shell232comprises a generally hollow cylindrical structure formed from a metal, such as aluminum. Free hub shell232has an axial opening such that shell232may extend about and along axle shaft302. Free hub shell232comprises an outer external interlocking surface338configured to interlock with cog wheels37. In the example illustrated, interlocking surface338include splines339which interlock with a cassette providing cog wheels37. In other implementations, surface338may have other configurations to interlock or key with a cassette or individual cog wheels37. In still other implementations, cog wheels37may be affixed or otherwise joined to shell232in other fashions.", "", "Similar to hub shell218, free hub shell232comprises a ring340having an external surface342configured to permit a ratchet ring of ratchet mechanism300to be axially slid onto and about the internal ring320and to be interlocked with the ring340to inhibit the ratchet ring from rotating relative to free hub shell232about the axis of axle shaft302. External surface342axially projects towards hub shell218from a collar343formed as part of free hub shell232. In the example illustrated, peripheral surface342comprises external or outwardly projecting splines344(a series of projections and grooves) that are configured to interlock with a corresponding set of inwardly projecting splines of the ratchet ring (to be described hereafter).", "", "Bearings330and332extend about axle shaft302and rotatably support free hub shell232for rotation about the axis of axle shaft302. In the example illustrated, bearings330and332each comprise a rolling bearing having an inner race, an outer race and rollers or balls therebetween. For example, in some implementations, bearings330,332may comprise roller bearings. In other implementations, bearings330,332may comprise other forms of bearings for rotatably supporting free hub shell232about axle shaft302.", "", "Bearing spacer334axially spaces bearings330and332from one another. In the example illustrated, bearing spacer334comprises an elongate sleeve positioned about axle shaft302and having axially facing edges that abut the outer race of bearings330and332. Bearing spacer334has an outer surface configured to facilitate the axial sliding positioning of free hub sleeve232over and about spacer334. In other implementations, spacer334may have other configurations or may be omitted, such as where other mechanisms or structures are incorporated into axle shaft302or other components are utilized for spacing bearings330and332.", "", "Ratchet mechanism300transmits torque from free hub214(sometimes referred to as a driver) to hub shell218(sometimes referred to as a hub sleeve). Ratchet mechanism300serves as a free wheel device or clutch adapter for connecting free hub214and hub shell218in a torque transmitting state when torque is being supplied to free wheel hub232in a first rotational direction. Ratchet mechanism300permits hub shell218and wheel26to freely rotate relative to free wheel hub212when torque is no longer being applied to free wheel hub212or when torque is being supplied to free wheel hub214in a direction opposite to that of the direction in which torque is transmitted. As shown byFIGS.4,6and7, ratchet mechanism300comprises ratchet rings350-1,350-2(collectively referred to as ratchet rings350), spring354, retainer356, and dampener358.", "", "Ratchet rings350comprise components that are distinct and separate from hub shell218and free hub shell232. As a result, ratchet rings350may be formed from materials that are different from hub shell218and free hub shell232. In the example illustrated, ratchet rings are each formed from material harder than the material or materials forming hub shell218and free hub shell232. In the example illustrated, hub shell218and free hub shell232are each formed from a lighter weight metal material, such as aluminum, whereas ratchet rings350are formed from a harder, albeit heavier, metal material such as steel or titanium. In other implementations, hub shell218, free hub shell232and ratchet rings350may be formed from other materials. For example, hub shell218and/or free hub shell232may be formed from other metals or non-metal materials, such as a fiber reinforced material. Because the shells218,232may be formed from lighter weight materials while the ratchet rings350are formed from harder materials, rear drive assembly36may have enhanced durability with a reduced overall weight.", "", "FIGS.8-10illustrate ratchet ring350-1in more detail. As shown byFIGS.8-10, ratchet ring350-1comprises an inner diameter or otherwise inner surface362, a ratchet face364, and a backside366(shown inFIGS.9and10). Inner surface362is configured to interlock with the exterior surface322of ring320of hub shell218. In the example illustrated, inner surface362is configured to facilitate axial sliding or positioning of ratchet ring350-1onto and about ring320, wherein relative rotation of ratchet ring350-1and hub shell218about the axis of axle shaft302is inhibited by such interlocking. In the example illustrated, inner surface362comprise a series of splines370which mesh with corresponding splines324on exterior surface322of ring320of hub shell218. In other implementations, other interlocking features may be provided on inner surface362(and outer surface322) to facilitate such interlocking. For example, surfaces322and362may have polygonal cross-sectional shape that facilitates interlocking or keying of ring350-1onto ring320of hub shell218.", "", "Ratchet face364comprise the face of ratchet ring350-1which is to engage the corresponding ratchet face364of ring350-2to facilitate transmission of torque from ring350-2to ring350-1. Ratchet face364comprise a series of ramped teeth372that are configured to bite into the corresponding teeth372of the ratchet face364of ring350-2when ring350-2is being rotatably driven in a torque transmitting direction by free hub214. Ramped teeth372slide over or ratchet relative to the teeth372of ratchet ring350-2when ring350-2is not being rotatably driven and when ring350-1and wheel26are rotating in a non-torque transmitting direction (opposite to the torque transmitting direction), such as during coasting of the bicycle.", "", "Because the inner surface362of ring350-1is joined to the exterior surface322of ring320of axle hub218, the radial length RL of ratchet face364is not limited or constricted by the diameter of inner surface362. Moreover, the outer diameter of ratchet face364is not limited or constricted by the diameter of inner surface362. As result, the radial length RL of ratchet face364and the outer and inner diameter ratchet face364may be larger. The larger radial length RL of ratchet face364provides a greater surface area for engagement with the ratchet face of ring350-2. The larger inner and outer diameter of ratchet face364facilitate the provision of a greater number of individual ratchet teeth372. Because the example ratchet rings have inner diameters or inner surfaces directly connected to the hub shell and the free hub, the height and surface area of the ratchet face of each of the ratchet rings350may be enlarged, providing a greater number of teeth372and achieving higher degrees of engagement (a larger number of engagement points) between the ratchet rings350and between the free hub214and the hub212. The higher degree of engagement may offer reduced movement of the pedal to engage the drive assembly, especially on rough or uneven terrains, such as when such drive assemblies are employed in mountain bikes.", "", "In some implementations ratchet face364may have a radial length RL of at least 3 mm. In some implementations, ratchet face364may have at least 40 teeth having a pitch diameter of at least 24 mm and with each tooth having a height at least 0.30 mm. In some implementations, ratchet face364may have at least 60 teeth having a pitch diameter of at least 24 mm and with each tooth having a height at least 0.25 mm. In some implementations, ratchet face364may have at least 80 teeth having a pitch diameter of at least 24 mm and with each tooth having a height at least 0.20 mm. In some implementations, ratchet face364may have at least 100 teeth having a pitch diameter of at least 24 mm and with each tooth having a height at least 0.15 mm. In some implementations, the pitch and tube height ratchet face having 40, 60, 80, or 100 teeth may vary. As previously noted, the director joining of the inner surface362of ratchet ring350-1facilitates a provision of the larger number of teeth in the greater engagement points for ratchet face364.", "", "As shown mayFIG.10, ring350-1is configured such that the inner surface362has a longer axial length AL. The axial face, the ratchet face364, may have a radial length RL, wherein the inner surface may have an axial length AL of at least 75% of the length of the axial face, at least 0.75 RL. In those implementations where the inner surface include splines, the axial length of the splines may be at least 75% of the length of the axial face, at least 0.75 RL in some implementations, the axial length of the inner surface362or the axial length of the splines370may be greater than or equal to the radial length RL of the ratchet face364. The relatively long axial length of the inner surface362of ratchet ring350-1may reduce deflection of the ratchet ring350-1to enhance performance and durability of the drive assembly.", "", "As shown byFIGS.9and10, backside366is shaped such that ratchet ring350-1has an L-shaped cross-section, wherein the L-shaped includes a first leg376supporting the ratchet face364and a second leg378forming the inner surface362with the splines370. Legs376and378may each have a length of at least 3 mm. In the example illustrated, the surface of legs376and378, forming the backside366, form a shoulder380against which spring354may be retained, wherein the spring may extend around leg378and may abut against the rear face of leg376. As discussed above, the length or radial length of leg376increases the area number of teeth of ratchet face364. The axial length of leg378increases the axial length of inner surface362and the axial length of splines370to increase the number of engagement points on ratchet face364and to reduce deflection of ratchet ring350-1. The L-shape of ring350-1facilitates a provision of the larger ratchet face364and the longer inner surface362and splines370while reducing the overall weight of ring in other implementations, rather than having an L-shape, ring350-1may have a cross-sectional shape that is rectangular, square, rounded, V-shaped, or the like.", "", "In the example illustrated, ratchet ring350-2is substantially similar to or identical to ratchet ring350-1, but wherein ratchet ring350-2mirrors ratchet ring350-1as part of drive assembly36. In other words, ratchet face364of ratchet rings350face one another, whereas legs378of ratchet rings350extend in opposite directions away from one another. Leg378of ratchet ring350-1extends from ratchet face364towards hub sleeve218. Leg378of ratchet ring350-2extends away from ratchet face364towards free wheel hub sleeve232. The splines370of ratchet ring350-2interlock with the splines344of ring340of free hub shell232, inhibiting relative rotation of ratchet ring350-2and free hub shell232. During the transmission of torque, ramped teeth372of ratchet ring350-2bite into and against the teeth372of ratchet ring350-1such that rings350rotate in unison with one another. During coasting or periods when torque is not being transmitted, teeth372of ratchet rings350slide over top of one another, at least one of the rings350rotating relative to the other of the rings350.", "", "High performance of the ratchet mechanism300may be dependent upon the precision of the ratchet mechanism300and, namely, the manufacturing precision of the ratchet faces364of the ratchet rings350. Because the ratchet mechanism utilizes similar or substantially identical ratchet rings350, manufacturing complexity and cost may be reduced. In other implementations, rings350-1and350-2may be different from one another, yet provide one or more of the above-described features or having one or more of the above-described characteristics.", "", "As shown byFIG.11, spring354is captured between an internal shoulder384of hub shell218and the backside360of ratchet ring350-1. Spring354overlaps and encircles bearing310. In the example illustrated, spring354is in the form of a steel multiturn wave compression spring which encircles leg378and which abuts leg380of ratchet ring350-1. Spring354resiliently biases ratchet ring350-1towards and against ratchet ring350-2. During rotation of ratchet ring350-1relative to ratchet ring350-2, such as when wheel26is coasting without receiving torque from free hub214, ratchet ring350-1may be urged against spring354, compressing spring354towards hub shell218to a greater extent. Although spring354is illustrated as a steel multi-turn wave compression spring, in other implementations, spring354may be formed from other materials and/or may have other configurations or types. For example, spring354may alternatively comprise a compression coil spring.", "", "Retainer356comprise a mechanism configured to retain ratchet ring350-2against or in a connected state to ratchet ring350-1during and after separation of free hub214from hub212. In some circumstances, maintenance of drive assembly36may involve disconnection and separation of at least portions of free hub214from hub212. Without retainer356, ratchet ring350-2might otherwise separate from ratchet ring350-1and fall to the ground, becoming contaminated. Retainer356reduces the likelihood of such contamination, facilitating easier maintenance of drive assembly36.", "", "As shown byFIG.7, in the example illustrated, retainer356comprises a C-clip or ring.FIG.12is an enlarged view of portions of the sectional view of those portions of drive assembly36shown inFIG.11. As shown byFIG.12, retainer356is retained within an internal groove357(also shown inFIG.5) of hub shell218. The diameter and location of groove357and the radial width of retainer356are such that retainer356projects beyond groove357into abutment with leg376on the backside366of ratchet ring350-2. Although illustrated as a C-shaped snap ring or clip, retainer356may have other configurations facilitating an axial retention of ratchet ring to within hub shell218and against ratchet ring350-1during and after separation of free hub214from hub212.", "", "As shown byFIG.7, dampener358comprises an annular ring and is formed from an elastic and/or compressible material, such as a rubber a rubber-like material. As shown byFIG.12, dampener358comprises a dampening portion388and the sealing portion390.", "", "Dampening portion388comprises that portion of dampener358that is axially captured between an axial edge or end of ratchet ring350-2and an axial face of free hub shell232. In the example illustrated, dampening portion388directly abuts an axial end or edge of leg378of ratchet ring350-2and directly abuts an axial face of collar343of free hub shell232. In some implementations, additional components or structures may be sandwiched between dampening portion388and axial end portions of free hub shell232and/or the axial end portions of ratchet ring350-2. Dampening portion388is captured within an outer circumferential groove345formed in shell232between the exterior surface342and collar343. In the example illustrated, dampening portion388encircles bearing332while being supported outside of and out of contact with bearing332by free hub shell232. Dampening portion388absorbs vibration and size or dampens vibration by serving as an axial bumper or shock absorber between ratchet ring350-2and free hub shell232.", "", "Sealing portion390outwardly extends from dampening portion388along the backside366of ratchet ring350-2. Sealing portion390forms a flap that resiliently extends into abutment with an interior surface of hub shell218. As a result, dampener358continuously extends from an outer surface of free hub shell232and to an inner surface of hub shell218, forming a seal therebetween. Sealing portion390is sufficiently flexible such that dampener358may be withdrawn from within the interior of hub shell218during the withdrawal of free hub shell232from the interior of hub shell218. As discussed above, during such withdrawal during which the axially extending splines of surface342are being axially slid relative to the internal splined of ratchet ring350-2, retainer356secures ratchet ring350-2in place against ratchet ring350-1. In other implementations, the dampening and sealing functions provided by dampener may alternatively be formed by separate compressible and/or elastomeric components.", "", "As further shown byFIG.12, the overall construction of drive assembly36results in several components radially overlapping one another. This is in part achieved by the nesting of free hub shell232within hub shell218. In the example illustrated, although free of shell232is partially nestled within hub shell218, bearing310does not support (is not inset within) any portion of free hub shell232. Likewise, bearing332does not support (is not inset within) any portion of hub shell218.", "", "Ratchet ring350-1radially overlaps and extends about or around bearing310. Ratchet ring350-2radially overlaps and extends about around bearing332. Spring354radially overlaps and extends about or around bearing310. Dampener358radially overlaps and extends about around bearing332. The flange220and the associated spoke openings222radially overlap and extend about or around portions of bearing332, the bearing supporting free hub shell232. Because such components radially overlap one another, the bearings310,332supporting the axial end portions of hub shell218and free hub shell232, respectively, may be axially positioned closer to one another. As a result, the bearings310,332are positioned closer to the axial end portions or axial ends of hub shell218and free hub shell232, respectively. Because the bearings310,332of the hub shell and the free hub may be more closely positioned to one another along the axle210, deflection of the axle shaft302may be reduced. This deflection reduction may result in better stiffness, bearing wear and power transfer. This deflection reduction may also result in less wear of the axle shaft302and bearings308,310,330,332, increasing durability and prolonging life of the drive assembly36.", "", "As further shown byFIG.12, the nesting of free hub shell232within hub shell218also facilitates the radial alignment of the surfaces322and340as well as the radial alignment of their splines in the particular examples. The nesting of the free hub shell232within hub shell218further facilitates the radial alignment of bearings310and330. Said another way, the free hub shell232and hub shell218are configured such that axial end portions of free hub shell232are positioned partially within hub shell218, the outer surface of the splines of surfaces322and340are radially spaced by the same distance from the rotational axis or centerline of axle shaft302. Likewise, the inner races and/or the outer races of bearings310and332are each radially spaced by the same radial distance from the rotational axis and line of axle shaft302.", "", "As shown byFIGS.13and14, drive assembly36additionally comprises a spring394captured between bearing310and bearing323to resiliently urge the bearing310and the bearing323away from one another. The spring394may reduce wear of such bearings over time and increase the durability of the drive assembly. In the example illustrated, spring394encircles axle shaft302. In the example illustrated, spring394comprises a wave washer captured between the races of bearings310and323. In other implementations, spring394may comprise other types of springs, such as a coil compression spring, leaf spring, or the like.", "", "Although the present disclosure has been described with reference to example implementations, workers skilled in the art will recognize that changes may be made in form and detail without departing from the disclosure. For example, although different example implementations may have been described as including features providing various benefits, it is contemplated that the described features may be interchanged with one another or alternatively be combined with one another in the described example implementations or in other alternative implementations. Because the technology of the present disclosure is relatively complex, not all changes in the technology are foreseeable. The present disclosure described with reference to the example implementations and set forth in the following claims is manifestly intended to be as broad as possible. For example, unless specifically otherwise noted, the claims reciting a single particular element also encompass a plurality of such particular elements. The terms “first”, “second”, “third” and so on in the claims merely distinguish different elements and, unless otherwise stated, are not to be specifically associated with a particular order or particular numbering of elements in the disclosure."], "claims": ["a axle extending along an axis; a hub shell rotatably mounted on the axle by a first bearing; a free hub rotatably mounted on the axle by a second bearing; a first spring captured between the first bearing and the second bearing to resiliently urge the inner races of the first bearing and the second bearing away from one another; and a ratchet mechanism releasably coupling the free hub to the hub shell to transmit torque from the free hub to the hub, the ratchet mechanism comprising: a first ratchet ring joined to the hub shell for rotation with the hub shell, the first ratchet ring encircling and radially overlapping the first bearing, the first ratchet ring having a first ratchet face; a second ratchet ring joined to the free hub for rotation with the free hub, the second ratchet ring encircling and radially overlapping the second bearing; and a second spring resiliently biasing the first ratchet face and the second ratchet face into engagement to transmit torque from the free hub to the hub shell.", "2 . The bicycle drive assembly of claim 1 , wherein the first spring comprises a wave washer.", "one or more spacers axially between the first bearing and the second bearing, wherein the wave washer is captured between the bearings and contacting one or more of the spacers", "4 . The bicycle drive assembly of claim 1 , wherein the inner surface of the second ratchet ring is interlocked to the free hub to transmit torque from the free hub to the second ratchet ring and wherein the inner surface of the first ratchet ring is interlocked to the hub shell to transmit torque from the first ratchet ring to the hub shell.", "5 . The bicycle drive assembly of claim 4 , wherein the inner surface of the first ratchet ring and the inner surface of the second ratchet ring are each splined.", "6 . The bicycle drive assembly of claim 5 , wherein the first ratchet face has at least 40 teeth.", "7 . The bicycle drive assembly of claim 5 , wherein the first ratchet face has at least 60 teeth.", "8 . The bicycle drive assembly of claim 5 , wherein the first ratchet face has at least 80 teeth.", "9 . The bicycle drive assembly of claim 5 , wherein the first ratchet face has at least 100 teeth.", "10 . The bicycle drive assembly of claim 6 , wherein the free hub is formed from a first material having a first hardness and wherein the second ratchet ring is formed from a second material having a second hardness greater than the first hardness.", "11 . The bicycle drive assembly of claim 10 , wherein the free hub is formed from aluminum alloy and wherein the second ratchet ring is formed from steel or titanium alloy.", "12 . The bicycle drive assembly of claim 1 , wherein the first ratchet ring and the second ratchet ring are identical to one another.", "13 . The bicycle drive assembly of claim 12 , wherein the first ratchet face and the second ratchet face each have at least 40 teeth.", "14 . The bicycle drive assembly of claim 13 , wherein the first ratchet face and the second ratchet face each have a radial length of at least 3 mm.", "15 . The bicycle drive assembly of claim 13 , wherein the first ratchet face and the second ratchet face each have an inner diameter of at least 24 mm.", "16 . The bicycle drive assembly of claim 13 , wherein the at least 40 teeth have a pitch of at least 25.5 mm.", "17 . The bicycle drive assembly of claim 1 , wherein at least one the first spring and the second spring resiliently biases the first ratchet face towards the second ratchet face."], "bibtex": "@patent{20240181808,\n    title = {BICYCLE DRIVE ASSEMBLY},\n    number = {20240181808},\n    year = {2024},\n    note = {File: US20240181808A1-20240606.XML}\n    }", "classification": "B60B2704FI"}, {"title": "BICYCLE DRIVE ASSEMBLY", "doc_number": "20240181809", "filename": "US20240181809A1-20240606.XML", "abstract": "A bicycle drive assembly may include an axle, a hub shell rotatably mounted on the axle by a first bearing, a free hub rotatably mounted on the axle by a second bearing, and a ratchet mechanism releasably coupling the free hub to the hub shell to transmit torque from the free hub to the hub. The ratchet mechanism may include a first ratchet ring having an inner surface joined to the hub shell for rotation with the hub shell and a second ratchet ring having an inner surface joined to the free hub for rotation with the free hub. The first ratchet ring and the second ratchet ring encircle and radially overlap the first bearing and the second bearing, respectively. At least one spring resiliently biases the first ratchet face and the second ratchet face into engagement to transmit torque from the free hub to the hub shell.", "detailed_description": ["Disclosed are example bicycle drive assemblies that may offer greater durability and lower weight, easier maintenance, lower manufacturing complexity and cost, and higher degrees of engagement between the free hub and the hub shell. The example bicycle drive assemblies comprise a ratchet mechanism that may comprise ratchet rings which are joined to the hub shell and the free hub. Because the ratchet rings are formed separately from the hub shell and the free hub, the ratchet rings may be formed from harder, more durable materials while the hub shell and/or the free hub are formed from lighter weight materials.", "", "The ratchet rings of the example bicycle drive assemblies may overlap and encircle the bearings that rotatably support the hub shell and the free hub about the axle. Because the ratchet rings overlap the bearings, the bearings of the hub shell and the free hub may be more closely positioned to one another along the axle. As a result, deflection of the axle may be reduced. This deflection reduction may result in more reliable engagement and less wheel flex. This deflection reduction may also result in less wear of the axle and bearings, increasing durability and prolonging life of the drive assembly.", "", "The example bicycle drive assemblies may comprise a spring, such as a wave washer, captured between bearings that rotatably support the free hub and the hub shell about the axle. The spring may reduce wear of such bearings over time and increase the durability of the drive assembly.", "", "The example bicycle drive assemblies may comprise a damper captured between one of the ratchet rings and the free hub. The damper absorbs vibration and reduces noise. The dampener may further increase the durability of the drive assembly.", "", "The example bicycle drive assemblies may comprise a retainer that retains the ratchet rings together, in engagement with one another, upon separation and withdrawal of the free hub from the hub shell. As a result, the ratchet mechanism is less likely to experience contamination during maintenance of the drive assembly.", "", "The example bicycle drive assemblies may comprise similar or substantially identical ratchet rings. High performance of the ratchet mechanism may be dependent upon the precision of the ratchet mechanism and, namely, the manufacturing precision of the ratchet faces of the ratchet rings. Because the ratchet mechanism utilizes similar or substantially identical ratchet rings, manufacturing complexity and cost may be reduced.", "", "The ratchet rings of the example bicycle drive assemblies may have inner surfaces, rather than outer surfaces, joined to the hub shell and the free hub. In some implementations, the inner surfaces include splines which are interlocked to corresponding splines formed in the hub shell and the free hub. Because the example ratchet rings have inner diameters or inner surfaces directly connected to the hub shell and the free hub, the height and surface area of the ratchet face of each of the ratchet rings may be enlarged, providing a greater number of teeth and achieving higher degrees of engagement (a larger number of engagement points) between the ratchet rings and between the free hub and the hub shell. The higher degree of engagement may offer reduced movement at the pedal to engage the drive, especially on rough or uneven terrains, such as when such drive assemblies are employed in mountain bikes.", "", "The ratchet rings of the example bicycle drive assemblies may each have an axial surface, a ratchet face, and a radial surface, the inner surface of the ratchet ring being joined to the hub shell or joined to the free hub. In some implementations, the inner surface of each of the ratchet rings is splined for being interlocked with corresponding splines of the hub shell or with corresponding splines of the free hub. The axial face, the ratchet face, may have a radial length RL. The radial surface, the inner surface, in some implementations, may have an axial length of at least 75% of the length of the axial face, at least 0.75 RL. In those implementations where the radial surface include splines, the axial length of the splines may be greater than the radial length of the ratchet faces. The relatively long axial length of the inner surface of each of the ratchet rings may reduce deflection of the of the ratchet rings to enhance performance and durability of the drive assembly.", "", "In some implementations, the cross section of the ratchet rings may have an L-shape, providing a larger ratchet face with a larger number of teeth for enhanced engagement and also providing a longer inner surface for joining to the hub shell and the free hub. In some implementations, each of the L-shaped ratchet rings has a first leg of at least 3 mm and a second leg extending perpendicular to the first leg, the second leg having a length of at least 3 mm. In some implementations, the ratchet mechanism comprises a first ratchet ring having a first leg providing a ratchet toothed surface forming a first ratchet face and a second leg having a splined surface, wherein the second leg extends from the first leg in a direction towards the hub shell, the splined surface interlocking with the hub shell. In some implementations, the ratchet mechanism comprises a second ratchet ring having a first leg providing a ratchet toothed surface forming a second ratchet face and a second leg having a splined surface, wherein the second leg of the second ratchet ring extends from the first leg in a direction towards the free hub, the splined surface interlocking with the free hub. The second legs of the first ratchet ring and the second ratchet ring extend away from one another in opposite directions.", "", "For purposes of this disclosure, the term “coupled” shall mean the joining of two members directly or indirectly to one another. Such joining may be stationary in nature or movable in nature. Such joining may be achieved with the two members, or the two members and any additional intermediate members being integrally formed as a single unitary body with one another or with the two members or the two members and any additional intermediate member being attached to one another. Such joining may be permanent in nature or alternatively may be removable or releasable in nature. The term “operably coupled” shall mean that two members are directly or indirectly joined such that motion may be transmitted from one member to the other member directly or via intermediate members.", "", "For purposes of this disclosure, the phrase “configured to” denotes an actual state of configuration that fundamentally ties the stated function/use to the physical characteristics of the feature proceeding the phrase “configured to”.", "", "For purposes of this disclosure, the term “releasably” or “removably” with respect to an attachment or coupling of two structures means that the two structures may be repeatedly connected and disconnected to and from one another without material damage to either of the two structures or their functioning.", "", "FIG.1is a side view illustrating an example bicycle20.FIG.1illustrates an example of a bicycle that includes a drive assembly for its rear-wheel that may offer greater durability and lower weight, easier maintenance, lower manufacturing complexity and cost, and higher degrees of engagement between the free hub and the hub shell. Bicycle20comprises frame22, front wheel24, front disc brake system25, rear-wheel26, rear disc brake system27, seat28, pedals30supported by crank arms31, front cog wheels32, gear chain34, rear drive assembly36including cog wheels37, front derailer38, rear derailer39, handlebars40, and braking-shifting levers42.", "", "Frame22supports the remaining components of bicycle20. Frame22comprises seat tube100, head tube102, top or cross tube104, down tube106, rake108and rear struts110. Seat tube100supports a seat post112which support seat128. Head tube102supports handlebars40and rake108. Cross tube104and down tube106extend between seat tube100and head tube102. Rake108is rotatably coupled to head tube102and supports front wheel24. Rear struts110extend rearwardly from seat tube100and support rear-wheel26and drive assembly36. Some of the various components forming frame22may be integrally formed as a single unitary body or may be welded or otherwise joined to one another. Each of such tubes or structures forming frame22may have cylindrical or non-cylindrical shapes. Each such tubes or structures may be hollow to reduce weight.", "", "Front wheel24is rotatably supported by rake108. Front disc brake system25is supported by rake108and is actuatable by cabling (not shown) to retard the rotation of or brake front wheel24. Rear-wheel26is rotatably supported by drive assembly36which is supported by struts110. Rear disc brake system27is supported by rear struts110and is actuatable by cabling (not shown) to retard the rotation of or brake rear-wheel26. In other implementations, other braking system may be employed which are actuated. For example, in other implementations, bicycle20may utilize front and rear brakes which include brake pads or bars that are selectively controlled to squeeze against a braking surface of the wheel24,26to brake their respective rotation.", "", "Seat28is supported by seat post112. Pedals30are connected to cog wheels32by crank arm31. Front cog wheels32comprise a set of differently sized cogs, in the form of gears or sprockets, which are rotatably supported by frame22. Front cog wheels32are configured to be rotated by the rotation of pedals30, by rider, about the axis of cog wheels32. Gear chain34is selectively connected one of the cog wheels32and is selectively connected to one of rear cog wheels37. Rear cog wheels37are connected a free hub which is connected to a hub shell (both of which are shown inFIGS.2and3) such that rotation of the rear cog wheels37rotates rear-wheel26. The particular cog wheels connected by gear chain34determines the speed or gear ratio of bicycle20. Gear chain32transmits motion and torque from the selected one of front cog wheels32to the selected one of rear cog wheels37to propel rear-wheel26.", "", "Front derailer38selectively connects gear chain34to a selected one of the different cog wheels or sprockets of front cog wheels32. Front derailer38shifts gear chain34from one cog wheel or sprocket to another cog wheel or sprocket of front cog wheel32. Front derailer38may be actuated by the rider.", "", "Rear derailer39selectively connects gear chain34to a selected one of the different cog wheels or sprockets of rear cog wheels37. Rear derailer39shifts gear chain34from one cog wheel or sprocket to another cog wheel or sprocket of rear cog wheels37. Rear derailer39may be actuated by a rider", "", "Handlebars40are supported by front tube102of frame22. Brake-shift levers42are movably supported by handlebars40and are operably coupled to cabling44. Brake and shift levers42may be located on each of the right and left sides of handlebars40. Brake and shift levers42are manually actuatable to individually actuate brake systems25,27and individually actuate or move derailers38,39depending upon which of the particular ones of levers42are moved.", "", "FIG.2is a side view illustrating portions of the example drive assembly36incorporated as part of bicycle20.FIG.3is a perspective view illustrating portions of the drive assembly36ofFIG.2without the rear cog wheels37. As shown byFIG.2, drive assembly36comprises axle210, hub212, free hub214and cog wheels37. Axle210comprise a shaft about which hub212and free hub214rotate. Hub200comprises a hub shell218and spoke or hub flanges220. As shown byFIG.3, each of spoke flanges220comprises spoke holes222which are circumferentially spaced about the rotational axis of hub shell218. As shown byFIG.2, spoke holes222receive end portions of spokes224(two which are shown) which have opposite ends connected to rim228of wheel26(shown inFIG.1).", "", "Free hub214comprises a free hub shell232which rotates about axle210and which engages portions of hub shell218via a ratchet mechanism (described hereafter) to transmit torque to the hub shell218to rotatably drive wheel26. Free hub shell232is connected to cog wheels37. In some implementations, cog wheels37may be provided as part of a cassette which is interlocked (via splines) to the free hub shell232. In other implementations, cog wheels37may be connected to the three of shell232in other fashions. In yet other implementations, torque may be transmitted to the free hub shell232using other mechanisms.", "", "FIGS.4-14illustrate portions of drive assembly36in more detail.FIG.4is an exploded perspective view of the axle210, hub212and free hub214of drive assembly36.FIG.5is an enlarged perspective view of the example hub shell218, illustrating interior portions of hub shell218which connect to the ratchet mechanism that connects hub shell218to the free hub shell232.FIGS.6and7are partially exploded perspective views of the example drive assembly36ofFIG.4.", "", "As shown byFIG.4, axle210supports hub212, free hub214and ratchet mechanism300. Axle210comprises axle shaft302, end cap304and endcap306. End caps304,306are mounted to opposite ends of axle shaft302and assist in retaining the remaining components of drive assembly36(excluding cog wheel37) upon axle shaft302. End caps304,306further assist in mounting axle shaft302to rear struts110of bicycle frame22. In other implementations, axle210may have other configurations.", "", "Hub212comprises hub shell218with spokes flanges220, hub bearing308and hub bearing310. Hub shell218comprises a generally hollow cylindrical structure formed from a metal, such as aluminum. Hub shell218connects to spokes224and supports rim228of wheel26. As shown byFIG.5, hub shell218comprises an axial through opening316through which axle shaft302extends. Hub shell218comprises an internal groove317that receives a snap ring318which is sized and located to axially retain bearing332about and along axle shaft302. In other implementations, ring318may be replaced with a shoulder integrally formed as part of hub shell218.", "", "As further shown byFIG.5, hub shell218comprises an internal ring320which encircles through opening316and which includes an external peripheral surface322configured to permit a ratchet ring of ratchet mechanism300to be axially slid onto and about the internal ring320and to be interlocked with the ring320inhibit the ratchet frame from rotating relative to hub shell218about the axis of axle shaft302. In the example illustrated, peripheral surface322comprises external or outwardly projecting splines324(a series of projections and grooves) that are configured to interlock with a corresponding set of internal injecting splines of the ratchet ring (to be described hereafter).", "", "In the example illustrated, hub shell218further comprises an internal groove357which encircles the through opening316. The internal groove357is configured to receive retainer, such as a C-shaped snap ring. As will be described hereafter, the internal groove357is located and sized such that the received retainer projects into the through opening316to abut an axial face of a second ratchet ring of the ratchet mechanism to retain both ratchet rings in engagement with one another, as a unit, during and after separation of freehub214from hub212.", "", "Bearings308and310extend about axle shaft302and rotatably support hub shell218for rotation about the axis of axle shaft302. In the example illustrated, bearings308,310each comprise a rolling bearing having an inner race, an outer race and rollers or balls therebetween. For example, in some implementations, bearings308,310may comprise roller bearings. In other implementations, bearings308,310may comprise other forms of bearings for rotatably supporting hub shell218about axle shaft302.", "", "Free hub214is configured to receive torque from cog wheels37and to selectively transmit the torque to hub212and wheel26via ratchet mechanism300. Free hub214comprises free hub shell232, bearing330, bearing332and bearing spacer334. Free hub shell232comprises a generally hollow cylindrical structure formed from a metal, such as aluminum. Free hub shell232has an axial opening such that shell232may extend about and along axle shaft302. Free hub shell232comprises an outer external interlocking surface338configured to interlock with cog wheels37. In the example illustrated, interlocking surface338include splines339which interlock with a cassette providing cog wheels37. In other implementations, surface338may have other configurations to interlock or key with a cassette or individual cog wheels37. In still other implementations, cog wheels37may be affixed or otherwise joined to shell232in other fashions.", "", "Similar to hub shell218, free hub shell232comprises a ring340having an external surface342configured to permit a ratchet ring of ratchet mechanism300to be axially slid onto and about the internal ring320and to be interlocked with the ring340to inhibit the ratchet ring from rotating relative to free hub shell232about the axis of axle shaft302. External surface342axially projects towards hub shell218from a collar343formed as part of free hub shell232. In the example illustrated, peripheral surface342comprises external or outwardly projecting splines344(a series of projections and grooves) that are configured to interlock with a corresponding set of inwardly projecting splines of the ratchet ring (to be described hereafter).", "", "Bearings330and332extend about axle shaft302and rotatably support free hub shell232for rotation about the axis of axle shaft302. In the example illustrated, bearings330and332each comprise a rolling bearing having an inner race, an outer race and rollers or balls therebetween. For example, in some implementations, bearings330,332may comprise roller bearings. In other implementations, bearings330,332may comprise other forms of bearings for rotatably supporting free hub shell232about axle shaft302.", "", "Bearing spacer334axially spaces bearings330and332from one another. In the example illustrated, bearing spacer334comprises an elongate sleeve positioned about axle shaft302and having axially facing edges that abut the outer race of bearings330and332. Bearing spacer334has an outer surface configured to facilitate the axial sliding positioning of free hub sleeve232over and about spacer334. In other implementations, spacer334may have other configurations or may be omitted, such as where other mechanisms or structures are incorporated into axle shaft302or other components are utilized for spacing bearings330and332.", "", "Ratchet mechanism300transmits torque from free hub214(sometimes referred to as a driver) to hub shell218(sometimes referred to as a hub sleeve). Ratchet mechanism300serves as a free wheel device or clutch adapter for connecting free hub214and hub shell218in a torque transmitting state when torque is being supplied to free wheel hub232in a first rotational direction. Ratchet mechanism300permits hub shell218and wheel26to freely rotate relative to free wheel hub212when torque is no longer being applied to free wheel hub212or when torque is being supplied to free wheel hub214in a direction opposite to that of the direction in which torque is transmitted. As shown byFIGS.4,6and7, ratchet mechanism300comprises ratchet rings350-1,350-2(collectively referred to as ratchet rings350), spring354, retainer356, and dampener358.", "", "Ratchet rings350comprise components that are distinct and separate from hub shell218and free hub shell232. As a result, ratchet rings350may be formed from materials that are different from hub shell218and free hub shell232. In the example illustrated, ratchet rings are each formed from material harder than the material or materials forming hub shell218and free hub shell232. In the example illustrated, hub shell218and free hub shell232are each formed from a lighter weight metal material, such as aluminum, whereas ratchet rings350are formed from a harder, albeit heavier, metal material such as steel or titanium. In other implementations, hub shell218, free hub shell232and ratchet rings350may be formed from other materials. For example, hub shell218and/or free hub shell232may be formed from other metals or non-metal materials, such as a fiber reinforced material. Because the shells218,232may be formed from lighter weight materials while the ratchet rings350are formed from harder materials, rear drive assembly36may have enhanced durability with a reduced overall weight.", "", "FIGS.8-10illustrate ratchet ring350-1in more detail. As shown byFIGS.8-10, ratchet ring350-1comprises an inner diameter or otherwise inner surface362, a ratchet face364, and a backside366(shown inFIGS.9and10). Inner surface362is configured to interlock with the exterior surface322of ring320of hub shell218. In the example illustrated, inner surface362is configured to facilitate axial sliding or positioning of ratchet ring350-1onto and about ring320, wherein relative rotation of ratchet ring350-1and hub shell218about the axis of axle shaft302is inhibited by such interlocking. In the example illustrated, inner surface362comprise a series of splines370which mesh with corresponding splines324on exterior surface322of ring320of hub shell218. In other implementations, other interlocking features may be provided on inner surface362(and outer surface322) to facilitate such interlocking. For example, surfaces322and362may have polygonal cross-sectional shape that facilitates interlocking or keying of ring350-1onto ring320of hub shell218.", "", "Ratchet face364comprise the face of ratchet ring350-1which is to engage the corresponding ratchet face364of ring350-2to facilitate transmission of torque from ring350-2to ring350-1. Ratchet face364comprise a series of ramped teeth372that are configured to bite into the corresponding teeth372of the ratchet face364of ring350-2when ring350-2is being rotatably driven in a torque transmitting direction by free hub214. Ramped teeth372slide over or ratchet relative to the teeth372of ratchet ring350-2when ring350-2is not being rotatably driven and when ring350-1and wheel26are rotating in a non-torque transmitting direction (opposite to the torque transmitting direction), such as during coasting of the bicycle.", "", "Because the inner surface362of ring350-1is joined to the exterior surface322of ring320of axle hub218, the radial length RL of ratchet face364is not limited or constricted by the diameter of inner surface362. Moreover, the outer diameter of ratchet face364is not limited or constricted by the diameter of inner surface362. As result, the radial length RL of ratchet face364and the outer and inner diameter ratchet face364may be larger. The larger radial length RL of ratchet face364provides a greater surface area for engagement with the ratchet face of ring350-2. The larger inner and outer diameter of ratchet face364facilitate the provision of a greater number of individual ratchet teeth372. Because the example ratchet rings have inner diameters or inner surfaces directly connected to the hub shell and the free hub, the height and surface area of the ratchet face of each of the ratchet rings350may be enlarged, providing a greater number of teeth372and achieving higher degrees of engagement (a larger number of engagement points) between the ratchet rings350and between the free hub214and the hub212. The higher degree of engagement may offer reduced movement of the pedal to engage the drive assembly, especially on rough or uneven terrains, such as when such drive assemblies are employed in mountain bikes.", "", "In some implementations ratchet face364may have a radial length RL of at least 3 mm. In some implementations, ratchet face364may have at least 40 teeth having a pitch diameter of at least 24 mm and with each tooth having a height at least 0.30 mm. In some implementations, ratchet face364may have at least 60 teeth having a pitch diameter of at least 24 mm and with each tooth having a height at least 0.25 mm. In some implementations, ratchet face364may have at least 80 teeth having a pitch diameter of at least 24 mm and with each tooth having a height at least 0.20 mm. In some implementations, ratchet face364may have at least 100 teeth having a pitch diameter of at least 24 mm and with each tooth having a height at least 0.15 mm. In some implementations, the pitch and tube height ratchet face having 40, 60, 80, or 100 teeth may vary. As previously noted, the director joining of the inner surface362of ratchet ring350-1facilitates a provision of the larger number of teeth in the greater engagement points for ratchet face364.", "", "As shown mayFIG.10, ring350-1is configured such that the inner surface362has a longer axial length AL. The axial face, the ratchet face364, may have a radial length RL, wherein the inner surface may have an axial length AL of at least 75% of the length of the axial face, at least 0.75 RL. In those implementations where the inner surface include splines, the axial length of the splines may be at least 75% of the length of the axial face, at least 0.75 RL in some implementations, the axial length of the inner surface362or the axial length of the splines370may be greater than or equal to the radial length RL of the ratchet face364. The relatively long axial length of the inner surface362of ratchet ring350-1may reduce deflection of the ratchet ring350-1to enhance performance and durability of the drive assembly.", "", "As shown byFIGS.9and10, backside366is shaped such that ratchet ring350-1has an L-shaped cross-section, wherein the L-shaped includes a first leg376supporting the ratchet face364and a second leg378forming the inner surface362with the splines370. Legs376and378may each have a length of at least 3 mm. In the example illustrated, the surface of legs376and378, forming the backside366, form a shoulder380against which spring354may be retained, wherein the spring may extend around leg378and may abut against the rear face of leg376. As discussed above, the length or radial length of leg376increases the area number of teeth of ratchet face364. The axial length of leg378increases the axial length of inner surface362and the axial length of splines370to increase the number of engagement points on ratchet face364and to reduce deflection of ratchet ring350-1. The L-shape of ring350-1facilitates a provision of the larger ratchet face364and the longer inner surface362and splines370while reducing the overall weight of ring in other implementations, rather than having an L-shape, ring350-1may have a cross-sectional shape that is rectangular, square, rounded, V-shaped, or the like.", "", "In the example illustrated, ratchet ring350-2is substantially similar to or identical to ratchet ring350-1, but wherein ratchet ring350-2mirrors ratchet ring350-1as part of drive assembly36. In other words, ratchet face364of ratchet rings350face one another, whereas legs378of ratchet rings350extend in opposite directions away from one another. Leg378of ratchet ring350-1extends from ratchet face364towards hub sleeve218. Leg378of ratchet ring350-2extends away from ratchet face364towards free wheel hub sleeve232. The splines370of ratchet ring350-2interlock with the splines344of ring340of free hub shell232, inhibiting relative rotation of ratchet ring350-2and free hub shell232. During the transmission of torque, ramped teeth372of ratchet ring350-2bite into and against the teeth372of ratchet ring350-1such that rings350rotate in unison with one another. During coasting or periods when torque is not being transmitted, teeth372of ratchet rings350slide over top of one another, at least one of the rings350rotating relative to the other of the rings350.", "", "High performance of the ratchet mechanism300may be dependent upon the precision of the ratchet mechanism300and, namely, the manufacturing precision of the ratchet faces364of the ratchet rings350. Because the ratchet mechanism utilizes similar or substantially identical ratchet rings350, manufacturing complexity and cost may be reduced. In other implementations, rings350-1and350-2may be different from one another, yet provide one or more of the above-described features or having one or more of the above-described characteristics.", "", "As shown byFIG.11, spring354is captured between an internal shoulder384of hub shell218and the backside360of ratchet ring350-1. Spring354overlaps and encircles bearing310. In the example illustrated, spring354is in the form of a steel multiturn wave compression spring which encircles leg378and which abuts leg380of ratchet ring350-1. Spring354resiliently biases ratchet ring350-1towards and against ratchet ring350-2. During rotation of ratchet ring350-1relative to ratchet ring350-2, such as when wheel26is coasting without receiving torque from free hub214, ratchet ring350-1may be urged against spring354, compressing spring354towards hub shell218to a greater extent. Although spring354is illustrated as a steel multi-turn wave compression spring, in other implementations, spring354may be formed from other materials and/or may have other configurations or types. For example, spring354may alternatively comprise a compression coil spring.", "", "Retainer356comprise a mechanism configured to retain ratchet ring350-2against or in a connected state to ratchet ring350-1during and after separation of free hub214from hub212. In some circumstances, maintenance of drive assembly36may involve disconnection and separation of at least portions of free hub214from hub212. Without retainer356, ratchet ring350-2might otherwise separate from ratchet ring350-1and fall to the ground, becoming contaminated. Retainer356reduces the likelihood of such contamination, facilitating easier maintenance of drive assembly36.", "", "As shown byFIG.7, in the example illustrated, retainer356comprises a C-clip or ring.FIG.12is an enlarged view of portions of the sectional view of those portions of drive assembly36shown inFIG.11. As shown byFIG.12, retainer356is retained within an internal groove357(also shown inFIG.5) of hub shell218. The diameter and location of groove357and the radial width of retainer356are such that retainer356projects beyond groove357into abutment with leg376on the backside366of ratchet ring350-2. Although illustrated as a C-shaped snap ring or clip, retainer356may have other configurations facilitating an axial retention of ratchet ring to within hub shell218and against ratchet ring350-1during and after separation of free hub214from hub212.", "", "As shown byFIG.7, dampener358comprises an annular ring and is formed from an elastic and/or compressible material, such as a rubber a rubber-like material. As shown byFIG.12, dampener358comprises a dampening portion388and the sealing portion390.", "", "Dampening portion388comprises that portion of dampener358that is axially captured between an axial edge or end of ratchet ring350-2and an axial face of free hub shell232. In the example illustrated, dampening portion388directly abuts an axial end or edge of leg378of ratchet ring350-2and directly abuts an axial face of collar343of free hub shell232. In some implementations, additional components or structures may be sandwiched between dampening portion388and axial end portions of free hub shell232and/or the axial end portions of ratchet ring350-2. Dampening portion388is captured within an outer circumferential groove345formed in shell232between the exterior surface342and collar343. In the example illustrated, dampening portion388encircles bearing332while being supported outside of and out of contact with bearing332by free hub shell232. Dampening portion388absorbs vibration and size or dampens vibration by serving as an axial bumper or shock absorber between ratchet ring350-2and free hub shell232.", "", "Sealing portion390outwardly extends from dampening portion388along the backside366of ratchet ring350-2. Sealing portion390forms a flap that resiliently extends into abutment with an interior surface of hub shell218. As a result, dampener358continuously extends from an outer surface of free hub shell232and to an inner surface of hub shell218, forming a seal therebetween. Sealing portion390is sufficiently flexible such that dampener358may be withdrawn from within the interior of hub shell218during the withdrawal of free hub shell232from the interior of hub shell218. As discussed above, during such withdrawal during which the axially extending splines of surface342are being axially slid relative to the internal splined of ratchet ring350-2, retainer356secures ratchet ring350-2in place against ratchet ring350-1. In other implementations, the dampening and sealing functions provided by dampener may alternatively be formed by separate compressible and/or elastomeric components.", "", "As further shown byFIG.12, the overall construction of drive assembly36results in several components radially overlapping one another. This is in part achieved by the nesting of free hub shell232within hub shell218. In the example illustrated, although free of shell232is partially nestled within hub shell218, bearing310does not support (is not inset within) any portion of free hub shell232. Likewise, bearing332does not support (is not inset within) any portion of hub shell218.", "", "Ratchet ring350-1radially overlaps and extends about or around bearing310. Ratchet ring350-2radially overlaps and extends about around bearing332. Spring354radially overlaps and extends about or around bearing310. Dampener358radially overlaps and extends about around bearing332. The flange220and the associated spoke openings222radially overlap and extend about or around portions of bearing332, the bearing supporting free hub shell232. Because such components radially overlap one another, the bearings310,332supporting the axial end portions of hub shell218and free hub shell232, respectively, may be axially positioned closer to one another. As a result, the bearings310,332are positioned closer to the axial end portions or axial ends of hub shell218and free hub shell232, respectively. Because the bearings310,332of the hub shell and the free hub may be more closely positioned to one another along the axle210, deflection of the axle shaft302may be reduced. This deflection reduction may result in better stiffness, bearing wear and power transfer. This deflection reduction may also result in less wear of the axle shaft302and bearings308,310,330,332, increasing durability and prolonging life of the drive assembly36.", "", "As further shown byFIG.12, the nesting of free hub shell232within hub shell218also facilitates the radial alignment of the surfaces322and340as well as the radial alignment of their splines in the particular examples. The nesting of the free hub shell232within hub shell218further facilitates the radial alignment of bearings310and330. Said another way, the free hub shell232and hub shell218are configured such that axial end portions of free hub shell232are positioned partially within hub shell218, the outer surface of the splines of surfaces322and340are radially spaced by the same distance from the rotational axis or centerline of axle shaft302. Likewise, the inner races and/or the outer races of bearings310and332are each radially spaced by the same radial distance from the rotational axis and line of axle shaft302.", "", "As shown byFIGS.13and14, drive assembly36additionally comprises a spring394captured between bearing310and bearing323to resiliently urge the bearing310and the bearing323away from one another. The spring394may reduce wear of such bearings over time and increase the durability of the drive assembly. In the example illustrated, spring394encircles axle shaft302. In the example illustrated, spring394comprises a wave washer captured between the races of bearings310and323. In other implementations, spring394may comprise other types of springs, such as a coil compression spring, leaf spring, or the like.", "", "Although the present disclosure has been described with reference to example implementations, workers skilled in the art will recognize that changes may be made in form and detail without departing from the disclosure. For example, although different example implementations may have been described as including features providing various benefits, it is contemplated that the described features may be interchanged with one another or alternatively be combined with one another in the described example implementations or in other alternative implementations. Because the technology of the present disclosure is relatively complex, not all changes in the technology are foreseeable. The present disclosure described with reference to the example implementations and set forth in the following claims is manifestly intended to be as broad as possible. For example, unless specifically otherwise noted, the claims reciting a single particular element also encompass a plurality of such particular elements. The terms “first”, “second”, “third” and so on in the claims merely distinguish different elements and, unless otherwise stated, are not to be specifically associated with a particular order or particular numbering of elements in the disclosure."], "claims": ["1 . (canceled)", "2 . (canceled)", "an axle extending along an axis; a hub shell rotatably mounted on the axle by a first bearing; a free hub rotatably mounted on the axle by a second bearing; and a ratchet mechanism releasably coupling the free hub to the hub shell to transmit torque from the free hub to the hub, the ratchet mechanism comprising: a first ratchet ring joined to the hub shell for rotation with the hub shell, the first ratchet ring encircling and radially overlapping the first bearing, the first ratchet ring having a first axial ratchet face and an inner radial face interlocked to the hub shell to transmit torque between the first ratchet ring and the hub shell, wherein the axial face has a radial length RL and wherein the radial face has an axial length of at least 75 RL, wherein the first ratchet ring cross section has an L-shape; a second ratchet ring joined to the free hub for rotation with the free hub, the second ratchet ring having a second ratchet face, the second ratchet ring encircling and radially overlapping the second bearing; and at least one spring resiliently biasing the first ratchet face and the second ratchet face into engagement to transmit torque from the free hub to the hub shell, wherein the first ratchet ring has a first leg of at least 3 mm and a second leg extending perpendicular to the first leg, the second leg having a length of at least 3 mm.", "4 . The bicycle drive assembly of claim 3 , wherein the first leg has a ratchet toothed surface forming the first ratchet face and wherein the second leg has a splined surface and extends from the first leg in a direction towards the hub shell, the splined surface interlocking with the hub shell.", "5 . The bicycle drive assembly of claim 4 , wherein the second ratchet ring has a first leg of at least 3 mm and a second leg extending perpendicular to the first leg, the second leg having a length of at least 3 mm.", "6 . The bicycle drive assembly of claim 5 , wherein the first leg of the second ratchet ring has a ratchet toothed surface and wherein the second leg of the second ratchet ring has a splined surface interlocking with the free hub, the second leg extending from the first leg in a direction towards the free hub.", "7 . The bicycle drive assembly of claim 3 further comprising an elastomeric damper axially captured between and engaging the second ratchet ring and the free hub.", "8 . The bicycle drive assembly of claim 7 , wherein the elastomeric dampener seals against a portion of the free hub.", "9 . The bicycle drive assembly of claim 7 further comprising a retainer secured to the hub shell and in engagement with the second ratchet ring to retain the second ratchet ring against the first ratchet ring upon separation of the free hub from the hub shell.", "10 . The bicycle drive assembly of claim 9 , wherein the retainer comprises a C-clip partially received within an internal groove in the hub shell and projecting into engagement with an axial face of the second ratchet ring.", "11 . The bicycle drive assembly of claim 1 further comprising a retainer secured to the hub shell and in engagement with the second ratchet ring to retain the second ratchet ring against the first ratchet ring upon separation of the free hub from the hub shell.", "12 . The bicycle drive assembly of claim 11 , wherein the retainer comprises a C-clip partially received within an internal groove in the hub shell and projecting into engagement with an axial face of the second ratchet ring.", "an axle extending along an axis; a hub shell rotatably mounted on the axle by a first bearing; a free hub rotatably mounted on the axle by a second bearing; and a ratchet mechanism releasably coupling the free hub to the hub shell to transmit torque from the free hub to the hub shell, the ratchet mechanism comprising: a first ratchet ring joined to the hub shell for rotation with the hub shell, the first ratchet ring encircling and radially overlapping the first bearing, the first ratchet ring having a first ratchet face; a second ratchet ring joined to the free hub for rotation with the free hub, the second ratchet ring encircling and radially overlapping the second bearing, the second ratchet ring having a second ratchet face; at least one spring resiliently biasing the first ratchet face and the second ratchet face into engagement to transmit torque from the free hub to the hub shell; and an elastomeric damper axially captured between and engaging the second ratchet ring and the free hub.", "14 . The bicycle drive assembly of claim 13 , wherein the elastomeric dampener seals against a portion of the hub shell.", "15 . The bicycle drive assembly of claim 13 further comprising a retainer secured to the hub shell and in engagement with the second ratchet ring to retain the second ratchet ring against the first ratchet ring upon separation of the free hub from the hub shell.", "an axle extending along an axis; a hub shell rotatably mounted on the axle by a first bearing; a free hub rotatably mounted on the axle by a second bearing; and a ratchet mechanism releasably coupling the free hub to the hub shell to transmit torque from the free hub to the hub, the ratchet mechanism comprising: a first ratchet ring joined to the hub shell for rotation with the hub shell, the first ratchet ring encircling and radially overlapping the first bearing, the first ratchet ring having a first ratchet face; a second ratchet ring joined to the free hub for rotation with the free hub, the second ratchet ring encircling and radially overlapping the second bearing; at least one spring resiliently biasing the first ratchet face and the second ratchet face into engagement to transmit torque from the free hub to the hub shell; and a retainer secured to the hub shell and in engagement with the second ratchet ring to retain the second ratchet ring against the first ratchet ring upon separation of the free hub from the hub shell, wherein the retainer comprises a C-clip partially received within an internal groove in the hub shell and projecting into engagement with an axial face of the second ratchet ring.", "17 . (canceled)"], "bibtex": "@patent{20240181809,\n    title = {BICYCLE DRIVE ASSEMBLY},\n    number = {20240181809},\n    year = {2024},\n    note = {File: US20240181809A1-20240606.XML}\n    }", "classification": "B60B2704FI"}, {"title": "SLEEVE FOR AN AXLE SHAFT ASSEMBLY", "doc_number": "20240181810", "filename": "US20240181810A1-20240606.XML", "abstract": "A sleeve for an axle shaft assembly, which may be found in an automotive transmission, is provided. The sleeve includes a body that defines an axis of rotation about which the body is radially symmetric, an inner surface, and an outer surface. The body includes a first set of splines, a second set of splines, and a chamfered edge. The first set of splines protrude outward from the outer surface, and the first set of splines are spaced apart about the axis of rotation. The second set of splines protrude outward from the outer surface, and are spaced apart about the axis of rotation. The first set of splines is axially spaced apart from the second set of splines, along the axis of rotation. The chamfered edge extends from a leading edge of the first set of splines toward the outer surface, between the first and second set of splines.", "detailed_description": ["It is to be understood that the phraseology and terminology used herein is for the purpose of description and should not be regarded as limiting. The use of “including,” “comprising,” or “having” and variations thereof herein is meant to encompass the items listed thereafter and equivalents thereof as well as additional items. Unless specified or limited otherwise, the terms “mounted,” “connected,” “supported,” and “coupled” and variations thereof are used broadly and encompass both direct and indirect mountings, connections, supports, and couplings. Further, “connected” and “coupled” are not restricted to physical or mechanical connections or couplings.", "", "While the structures and components disclosed herein may be embodied in many different forms, several specific embodiments are discussed herein with the understanding that the embodiments described in the present disclosure are to be considered only exemplifications of the principles described herein, and the disclosure is not intended to be limited to the embodiments illustrated. Further, throughout the disclosure, the terms “about”, “substantially”, and “approximately” mean plus or minus 5% of the number or geometric constraint that each term precedes. For example, about 100 may mean 100+/5. Additionally, or alternatively, substantially orthogonal may mean that any 90 degree angle related to the described orthogonality may be between 85.5 degrees and 94.5 degrees (inclusive).", "", "As mentioned above, sleeves may be used in a variety of contexts. In some examples, sleeves may be used in axle shaft assemblies to transmit torque from a first axle shaft, about which the sleeve is disposed, to a second axle shaft. The torque may be transmitted through a differential of the axle shaft assembly. The sleeve may include splines that engage with corresponding splines of a carrier flange of the differential to transmit torque therethrough. However, an amount of stroke for a shift fork may be limited by dimensions of an axle housing opening and gear housing of the axle shaft assembly. Such limitations in dimensions may be due to standardized sizes of vehicle components, such as vehicle chassis. Therefore, due to the limitations of the shift fork stroke distance, an engagement between the splines of the sleeve and the splines of the carrier flange is also limited.", "", "Accordingly, there exists a need to improve engagement between the sleeve and the carrier flange to effectively transmit torque through the differential (e.g., from the first axle shaft to the second axle shaft). It is with respect to these and other general considerations that embodiments have been described. Also, although relatively specific problems have been discussed, it should be understood that the embodiments should not be limited to solving the specific problems identified herein.", "", "Aspects of the present disclosure can be advantageous to address the above problems, as well as additional problems that may be recognized by those of ordinary skill in the art. Generally, as explained herein, the present disclosure provides a sleeve, such as, for example, a sleeve for an axle shaft assembly. A sleeve made in accordance with aspects of the present disclosure provides improved engagement between an axle shaft and a carrier flange, such as when facing a limited stroke length for the sleeve to engage the carrier flange.", "", "For example, the sleeve may include a cylindrical body that defines an axis of rotation about which the cylindrical body is radially symmetric, an inner circumferential surface, and an outer circumferential surface. The cylindrical body may include first and second sets of splines that protrude outward from the outer circumferential surface. Each set of splines includes a plurality of splines that are each spaced apart from one another and distributed about the axis of rotation, as shown inFIGS.4and5for example. The first and second sets of splines may further be axially spaced apart from each other, along the axis of rotation (e.g., defining a valley164between the first and second sets of splines), as shown inFIGS.4and7for example. Further, a chamfered edge may extend from the first set of splines to the outer circumferential surface, between the first and second sets of splines, to initially engage the carrier flange, and reduce blockage in the valley between the first and second sets of splines, such as from dust or debris.", "", "FIG.1illustrates a front cross-sectional view of an axle shaft assembly100. The axle shaft assembly100includes an axle shaft housing102that encloses a first axle shaft104and a second axle shaft106. The first axle shaft104and the second axle shaft106are generally cylindrical. In some examples, the first and second axle shafts104,106may be moving at the same speed (e.g., when locked together). Alternatively, in some examples, the first and second axle shafts104,106may be moving at different speeds (e.g., when not locked together). One of ordinary skill should recognize that when the conditions of operation are different for each of the axle shafts104,106, they may consequently be moving at different speeds, such as when a vehicle including axle shaft assembly is cornering such that left and right wheels respectively fixed to the axle shafts104,106are turning at different speeds. Wheel slippage may also cause differing speeds between the two axle shafts104,106. By contrast, when the conditions of operation are the same for both of the axle shafts104,106, the axle shafts104,106may consequently be moving at the same speeds. This is the case when the vehicle is tracking straight and the left and right wheels are therefore turning at the same speeds, for example.", "", "The axle shaft assembly100includes a piston108that is configured to move between a first position and a second position. The axle shaft assembly100further includes a biasing member or spring110that is received about at least a portion of the piston108to return the piston108in one direction between the first position and the second position. A cap112is sized and configured to receive and locate the piston108. The cap112may include a fitting114extending therethrough (seeFIG.9), such as a pneumatic fitting. Accordingly, air may be input into the cap112, through the fitting114, to change a pressure within the cap112, thereby actuating the piston108in the other direction between the first position and the second position. Thus, piston108utilizes pneumatic actuation with a spring return, though other configurations may of course be utilized as required or desired for a particular application. Further, a seal116may extend about (e.g., entirely about) the piston108to seal air within the cap112(e.g., preventing air from escaping from the cap112), by passing along the piston108.", "", "The axle shaft assembly100further includes a sleeve118. The sleeve118may be a lock sleeve that locks the rotation of the first axle shaft104with the rotation of the second axle shaft106, such as to match a rotation speed of the second axle shaft106with a rotation speed of the first axle shaft104. When so locked, torque is applied equally to axle shaft104and axle shaft106, and vice-versa when both wheels are rotating at the same speed. Torque is applied fully to axle shaft104when axle shaft106is spinning freely, and vice-versa. The axle shaft assembly100includes a carrier flange120that engages with the sleeve118to lock the rotation of the first axle shaft104with the rotation of the second axle shaft106. The carrier flange120may be part of a differential122that further includes a plurality of gears, such as a first side gear124and a second side gear126. The carrier flange120extends about the first axle shaft104. For example, the first axle shaft104may be inserted into a hole formed by the carrier flange120, when the first axle shaft104is assembled with the carrier flange120.", "", "While in the illustrated example the carrier flange120engages with the sleeve118to lock the first axle shaft104with the second axle shaft106it should be recognized by those of ordinary skill in the art that alternative configurations may be used to lock the first and second axle shafts104,106together, via actuation of the sleeve118, as further described below. For example, in a first position, the sleeve118may be solely disposed about the first axle shaft104, and in a second position, the sleeve118may be disposed about both the first axle shaft104and the second axle shaft106. Additional and/or alternative examples will be recognized by those of ordinary skill in the art for locking a first axle shaft with a second axle shaft using mechanisms provided herein.", "", "The axle shaft assembly100includes a gear housing128that encloses the differential122. Further, the piston108and the spring110may be contained at least partially within the gear housing128. The cap112that receives and locates the piston108may be coupled to the gear housing128(e.g., via fasteners, adhesive, snappable attachment, threaded attachment, etc.). Further, a plurality of bearings130may be disposed along the gear housing128to couple neighboring components thereto.", "", "FIG.2illustrates an enlarged front cross-sectional elevation view of a portion of the axle shaft assembly100. As shown inFIG.2, the sleeve118includes a first set of splines132and a second set of splines134. The carrier flange120includes a third set of splines136and a fourth set of splines138that are arranged to engage with the first and second sets of splines132,134of the sleeve118, respectively.", "", "While the illustrated example includes two corresponding sets of splines (e.g., first and second sets of splines132,134of the sleeve118and third and fourth sets of splines136,138of the carrier flange120), it should be recognized by those of ordinary skill in the art that mechanisms taught herein for improving engagement between the sleeve118and the carrier flange120may include three corresponding sets of splines, or four corresponding sets of splines, or any number of corresponding sets of splines greater than singular corresponding sets of splines.", "", "The axle shaft assembly100includes a shift fork or fork140that extends from the piston108to the sleeve118. The shift fork140is coupled to the piston108and to the sleeve118. The shift fork140extends about the piston108on a first end and is received by the sleeve118at a second end (e.g., that is opposite of the first end). In some examples, the piston108extends through a hole in the shift fork140, when assembled therewith.", "", "The shift fork140extends between the gear housing128and the axle shaft housing102. An end plate142is coupled to the sleeve118(e.g., via one or more fasteners144). The end plate142couples the shift fork140to the sleeve118. For example, when the piston108shifts from a first position to a second position, the shift fork140, which is coupled to the piston108, correspondingly shifts from a first position to a second position, thereby engaging (e.g., locking) or disengaging (e.g., unlocking) the sleeve118with the carrier flange120.", "", "FIG.3Aillustrates a front cross-sectional view of the piston108, shift fork140and sleeve118in a first or disengaged position, andFIG.3Billustrates a front cross-sectional view of the piston108, shift fork140and sleeve118in a second or engaged position, according to some aspects described herein.", "", "In some examples, the disengaged and engaged positions are with respect to the carrier flange120. For example, the first and second sets of splines132,134of the sleeve118may respectively engage with the third and fourth sets of splines136,138of the carrier flange120, when in the engaged position. Comparatively, the first and second sets of splines132,134of the sleeve118may be disengaged and spaced from the third and fourth sets of splines136,138of the carrier flange120, when in the disengaged position.", "", "The chamfered edge146of the sleeve118along the first set of splines132of the sleeve118is configured to engage the third set of splines136of the carrier flange120, before the second set of splines134of the sleeve118engages with the fourth set of splines138of the carrier flange120. For example, a distance between the third and fourth sets of splines136,138of the carrier flange120may be larger than a distance between the first and second sets of splines132,134of the sleeve118, such that the first set of splines132of the sleeve118can engage the third set of splines136of the carrier flange120, prior to the second set of splines134of the sleeve118engaging the fourth set of splines138of the carrier flange120.", "", "One of ordinary skill in the art will recognize that inFIG.3B, the respective splines of sleeve118and carrier flange120are intermeshed. Thus, at least part of a spline of the first set of splines132of the sleeve118is hidden behind a spline of the third set of splines136of the carrier flange120because the first set of splines132of the sleeve118are engaged with the third set of splines136of the carrier flange120. Further, at least part of a spline of the second set of splines134of the sleeve118is hidden behind a spline of the fourth set of splines136of the carrier flange120because the second set of splines134of the sleeve118are engaged with the fourth set of splines138of the carrier flange120.", "", "It is also noted that when the sleeve118is in an engaged position (FIG.3B), the piston108is compressed against the spring110, thereby decreasing an axial length of the spring110, along a direction of motion of the piston108, relative to when the sleeve118is in the disengaged position. Comparatively, when the sleeve118is in the disengaged position (FIG.3A), the spring110is uncompressed, and thereby an axial length of the spring110is increased, along a direction of motion of the piston108, relative to when the sleeve118is in the engaged position.", "", "When the sleeve118is in the engaged position (FIG.3B), the sleeve118rotates with the first axle shaft104, and the carrier flange120rotates with both of the first axle shaft104and the sleeve118. Therefore, torque is applied equally to axle shaft104and axle shaft106, and vice-versa when both wheels are rotating at the same speed. Torque is applied fully to axle shaft104when axle shaft106is spinning freely. In some examples, the sleeve118rotates with the first axle shaft104, the second axle shaft106, and the carrier flange120.", "", "FIG.4illustrates a top, front, and left isometric view of the sleeve118, according to some aspects described herein. The sleeve118includes a body148with a first axial end face150and a second axial end face152. In some examples, the body148is a generally cylindrical body. The body148defines a central axis or axis of rotation154. The body148may be radially symmetric about the axis of rotation154. The axis of rotation154may extend through a center point (e.g., geometric center point) of the first face150and the second face152.", "", "The body148may further define an inner surface156and an outer surface158. In some examples, the inner surface156is an inner circumferential surface and the outer surface158is an outer circumferential surface, for example, when the body148is a generally cylindrical body. The inner surface156defines a bore or cavity160within the body148. The cavity160may extend through a width of the body148. Further, the cavity160may extend through the first face150and the second face152. Accordingly, the axis of rotation154extends through the cavity160. Further, when assembled in an axle shaft assembly, such as the axle shaft assembly100, the cavity160may receive the first axle shaft104. Specifically, the first axle shaft104may extend through the cavity160, thereby extending through the sleeve118.", "", "The body148includes the first set of splines132and the second set of splines134. The first set of splines132protrude radially outward from the outer surface158. Further, the first set of splines132are spaced apart and distributed about the axis of rotation154. In some examples, the first set of splines132may be spaced apart about the axis of rotation154at a regular interval, such that, for example groups of two or more splines of the first set of splines132are diametrically opposed from other groups of splines having the same configuration.", "", "The second set of splines134protrude radially outward from the outer surface158. Further, the second set of splines134are spaced apart and distributed about the axis of rotation154. In some examples, the second set of splines134may be spaced apart about the axis of rotation154at a regular interval, such that, for example groups of two or more splines of the second set of splines134are diametrically opposed from other groups of splines having the same configuration. The first and second sets of splines132,134are spaced axially apart from each other, along the axis of rotation154. As a result, the first and second sets of splines132,134are also axially spaced apart from each other, along the length of the first axle shaft104, when the sleeve118is assembled with the first axle shaft104.", "", "As best seen inFIG.4, a chamfered edge146extends from outer surfaces of the first set of splines132toward the outer surface158. Specifically, the chamfered edge146is positioned at the leading edge of the splines132and extends from the outer surfaces of the splines132downwardly and forwardly toward the outer surface158, terminating between the first and second sets of splines132,134. The sleeve118may be sized and configured such that the chamfered edge146is the initial point of engagement with the carrier flange120.", "", "By engaging the chamfered edge146first, the first set of splines132engage with the carrier flange120before the second set of splines134as the sleeve118moves from the disengaged position (FIG.3A) toward the engaged position (FIG.3B). This allows for any debris generated by initial engagement (e.g., metal shavings or particles) to be evacuated away from side gear124by a flow of oil during operation. In particular, such debris may flow from the space between the sets of splines132,134in a leftward direction, from the perspective shown inFIG.1, when the sleeve118is in the disengaged position. Any other debris (e.g., dirt, dust, etc.) which may be present between the first and second sets of splines132,134is also allowed to fall out, be removed, or otherwise be evacuated from the sleeve118, in a similar fashion. By contrast, if second set of splines134were to engage with the carrier flange120before the first set of splines132, then any resulting debris, such as metal shavings or particles, may get caught in the space between the sleeve118and the side gear124with no means of evacuation. In this way, the position and configuration of chamfered edge146increases performance and longevity of the axle shaft assembly100.", "", "In some examples, the body148further includes an inner set of splines166. The inner set of splines166include a plurality of splines. The inner set of splines166extrude inward from the inner surface156(e.g., toward the axis of rotation154). Further, the inner set of splines166are spaced apart about the axis of rotation154. In some examples, the inner set of splines166may be spaced apart about the axis of rotation154at a regular interval, such that, for example groups of two or more splines of the inner set of splines166are diametrically opposed from other groups of splines having the same configuration.", "", "The inner set of splines166extend across the axial extent of cylindrical body148, with respect to the axis of rotation154(e.g., along the axis of rotation154). In some examples, the inner set of splines166extend continuously across the cylindrical body, with respect to the axis of rotation154. The inner set of splines166may rotatably fix the sleeve118with the axle shaft104by engaging with the first axle shaft104(e.g., splines on the first axle shaft104), such that as the first axle shaft104rotates, torque is applied to the inner set of splines166, to rotate the sleeve118.", "", "FIG.5illustrates a left-side elevational view of the sleeve118andFIG.6illustrates a right-side elevational view of the sleeve118, according to some aspects described herein. The first face150and the second face152of the body are generally circular. The first face150of the body148includes one or more holes162extending therethrough (FIG.6), into the body148. As shown inFIG.9, the one or more holes162are configured to receive the fasteners144that couple the end plate142to the sleeve118.", "", "The second set of splines134may abut the second face152. For example, the second set of splines extend into the second face152. Comparatively, the first set of splines132are spaced apart from the first face150. The first set of splines132are spaced apart from the first face150at a distance that is sized to receive the shift fork140. By offsetting the first set of splines132form the first face150, a distance between the end plate142, which is coupled to the first face150, and the first set of splines132, is dimensioned to receive the shift fork140.", "", "FIG.7illustrates a front elevation view of the sleeve118ofFIG.3A, according to some aspects described herein andFIG.8illustrates a front cross-sectional elevation view of the sleeve118, according to some aspects described herein. The first set of splines132and the second set of splines134extends radially outward from the outer surface158to substantially the same height, where height is taken from the perspective ofFIGS.7and8, and equals the radial distance from axis154to the outer surface of the splines132,134. In alternative example, the first and second sets of splines132,134may extend outward from the outer surface158to different heights. Further one of ordinary skill in the art will recognize that corresponding engagement surface, such as on a carrier flange (e.g., carrier flange120) and/or another component of a differential assembly (e.g., differential122), for the first and second sets of splines132,134may be sized and shaped to engage with the first and second sets of splines132,134, based on their respective heights from the outer surface158.", "", "In some examples a width W1of the first set of splines132may be the same as a width W2of the second set of splines134. Additionally or alternatively, in some examples, the first set of splines132may have a width that is different than a width of the second set of splines134. Further one of ordinary skill in the art will recognize that corresponding engagement surface, such as on a carrier flange (e.g., carrier flange120) and/or another component of a differential assembly (e.g., differential122), for the first and second sets of splines132,134may be sized and shaped to engage with the first and second sets of splines132,134, based on their respective widths.", "", "The first set of splines132and the second set of splines134define a valley164in the axial space between them. The chamfered edge146forms a portion (i.e., a wall) of the valley164. The outer surface158forms another portion (i.e., a floor) of the valley164. In some examples, the valley164extends continuously between the first set of splines132and the second set of splines134. Alternatively, in some examples, there may be a plurality of valleys that extend between the first set of splines132and the second set of splines134, such as in examples where additional sets of splines are disposed between the first and second sets of splines132,134and/or in examples where the outer surface158extends curvedly and/or jaggedly from the first set of splines132to the second set of splines134.", "", "FIG.9illustrates a front, bottom, and right-side isometric view of aspects of the axle shaft assembly ofFIG.1.FIG.9illustrates an alternate view of the fitting114that extends from and/or through the cap112. The shift fork140is shown to extend circularly about the piston108. Further, an end of the shift fork140opposite of the piston108extends at least partially about the sleeve118. The shift fork140coupled to the sleeve118between the end plate142and the first set of splines132. The sleeve118is generally cylindrical and is received within a cavity of the carrier flange120that is also generally cylindrical. The cavity within the carrier flange120is sized and shaped to receive the sleeve118.", "", "Generally, in an axle shaft assembly, an amount of stroke for a shift fork may be limited by dimensions of an axle shaft housing (e.g., axle shaft housing102) and a gear housing (e.g., the gear housing128) of an axle shaft assembly. The sleeve118provided herein may accommodate the limited space for the shift fork140stroke, by providing the first set of splines132and the second set of splines134that extend outward from the outer surface158of the sleeve118, are each spaced apart about an axis of rotation154of the sleeve118, and that are spaced apart from each other, along the axis of rotation154. The first and second sets of splines132,134may increase (e.g., approximately double) an amount of spline engagement for every given length (e.g., one millimeter) of stroke, thereby improving the axle shaft assembly's100fatigue life.", "", "While this invention has been described as having exemplary designs, the present invention may be further modified within the spirit and scope of this disclosure. This application is therefore intended to cover any variations, uses, or adaptations of the invention using its general principles. Further, this application is intended to cover such departures from the present disclosure as come within known or customary practice in the art to which this invention pertains."], "claims": ["a cylindrical body, the cylindrical body defining an axis of rotation about which the cylindrical body is radially symmetric, an inner circumferential surface, and an outer circumferential surface, the cylindrical body comprising: a first set of splines, the first set of splines protruding outward from the outer circumferential surface, and the first set of splines being spaced apart about the axis of rotation; a second set of splines, the second set of splines protruding outward from the outer circumferential surface, the second set of splines being spaced apart about the axis of rotation, and the first set of splines is axially spaced apart from the second set of splines, along the axis of rotation; and a chamfered edge extending from a leading edge of the first set of splines toward the outer circumferential surface, between the first and second set of splines.", "2 . The sleeve of claim 1 , wherein the cylindrical body further comprises a third set of splines, the third set of splines protruding inward from the inner circumferential surface, and the third set of splines being spaced apart about the axis of rotation.", "3 . The sleeve of claim 2 , wherein the third set of splines extend continuously across the cylindrical body, with respect to the axis of rotation.", "4 . The sleeve of claim 1 , wherein the inner circumferential surface defines a cavity within the cylindrical body, the axis of rotation extending through the cavity.", "5 . The sleeve of claim 1 , wherein the first set of splines and the second set of splines protrude outward from the outer circumferential surface to substantially the same height.", "6 . The sleeve of claim 1 , wherein the first set of splines and the second set of splines define a valley in the space between which they are apart, the chamfered edge forming a portion of the valley.", "a cylindrical body, the cylindrical body defining an axis of rotation about which the cylindrical body is radially symmetric, an inner circumferential surface, and an outer circumferential surface, the cylindrical body comprising: a first set of splines, the first set of splines protruding outward from the outer circumferential surface, and the first set of splines being spaced apart about the axis of rotation; a second set of splines, the second set of splines protruding outward from the outer circumferential surface, the second set of splines being spaced apart about the axis of rotation, and the first set of splines is axially spaced apart from the second set of splines, along the axis of rotation; and a third set of splines, the third set of splines protruding inward from the inner circumferential surface, and the third set of splines being spaced apart about the axis of rotation.", "8 . The sleeve of claim 7 , wherein the cylindrical body further comprises a chamfered edge, the chamfered edge extending from a leading edge of the first set of splines toward the outer circumferential surface, between the first and second set of splines.", "9 . The sleeve of claim 7 , wherein the third set of splines extend continuously across the cylindrical body, with respect to the axis of rotation.", "10 . The sleeve of claim 7 , wherein the inner circumferential surface defines a cavity within the cylindrical body, the axis of rotation extending through the cavity.", "11 . The sleeve of claim 7 , wherein the first set of splines and the second set of splines protrude outward from the outer circumferential surface to substantially the same height.", "12 . The sleeve of claim 7 , wherein the first set of splines and the second set of splines define a valley in the space between which they are apart.", "a carrier flange, the carrier flange being positioned about an axle shaft, the carrier flange comprising a first set of splines and a second set of splines; a sleeve, the sleeve being positioned about the axle shaft, and the sleeve comprising: a body, the body defining an inner surface, and an outer surface, the body comprising: a third set of splines, the third set of splines protruding outward from the outer surface, and the third set of splines being spaced apart about the carrier flange; and a fourth set of splines, the fourth set of splines protruding outward from the outer surface, the fourth set of splines being spaced apart about the carrier flange, the third set of splines being axially spaced apart from the fourth set of splines, along a length of the axle shaft, wherein the third set of splines and the fourth set of splines are configured to engage with the first set of splines and the second set of splines, respectively.", "14 . The axle shaft assembly of claim 13 , wherein the body further comprises a chamfered edge, the chamfered edge extending from a leading edge of the third set of splines toward the outer surface, between the third and fourth set of splines.", "15 . The axle shaft assembly of claim 14 , wherein the chamfered edge is configured to engage the first set of splines with the third set of splines, before the second set of splines engages with the fourth set of splines.", "16 . The axle shaft assembly of claim 13 , wherein the first set of splines are axially spaced apart from the second set of splines, along the length of the axle shaft.", "17 . The axle shaft assembly of claim 13 , wherein the inner surface defines a cavity within the body, the axle shaft extending through the cavity.", "a piston that is configured to move between a first position and a second position; and a shift fork that is coupled to the piston and to the sleeve, the shift fork being configured to move the sleeve, when the piston moves between the first position and the second position, thereby locking or unlocking the sleeve with the carrier flange.", "19 . The axle shaft assembly of claim 13 , wherein the axle shaft is a first axle shaft, and wherein the axle shaft assembly further comprises a second axle shaft, the sleeve being configured to transmit torque from the first axle shaft to the second axle shaft, via the carrier flange, when the sleeve is locked with the carrier flange.", "20 . The axle shaft assembly of claim 13 , wherein the body of the sleeve is a cylindrical body, wherein the inner surface is an inner circumferential surface, and wherein the outer surface is an outer circumferential surface."], "bibtex": "@patent{20240181810,\n    title = {SLEEVE FOR AN AXLE SHAFT ASSEMBLY},\n    number = {20240181810},\n    year = {2024},\n    note = {File: US20240181810A1-20240606.XML}\n    }", "classification": "B60B3516FI"}, {"title": "Optimized Architecture of a Civil Engineering Tire", "doc_number": "20240181811", "filename": "US20240181811A1-20240606.XML", "abstract": "Radial carcass tire for a civil engineering vehicle, having two bead wires ( 2 ) of radial height Ht, and carcass reinforcement made of two layers, the first ( 1 ) being radially innermost with a radial height Hdc, is anchored in each bead to form a main part ( 11 ) and a turn-up ( 12 ). The second layer ( 3 ) is radially outside the first layer ( 1 ). The free end (A) of the turn-up ( 12 ) is at a radial distance from the radially outermost point ( 21 ) of the bead wire that is at least equal to 1 and at most equal to 2 times Ht. From the end A of the turn-up ( 12 ) to the point B at 85% of the radial height Hdc, the distance between carcass layers is at least equal to 2 and at most equal to 11 times the diameter of metal reinforcers of first carcass layer ( 1 ).", "detailed_description": [""], "claims": ["a crown reinforcement, radially on the inside of a tread, said tread being connected by two sidewalls to two beads, a carcass reinforcement extending between the two beads and made up of two carcass layers comprising metal reinforcers which, with a radial direction, make an angle of between −10° and 10°, a first carcass layer, the radially innermost one, being anchored in each of the beads by being turned up around a bead wire having a geometric centre and a radial height Ht, to form a main part extending from one bead wire to the other, and a turn-up, axially on the outside of the main part in each of the beads, and having a free end (A), the first carcass layer having a radial height Hdc, measured from its radially innermost point to its radially outermost point, a second carcass layer extending from one bead to the other and being radially on the outside of the first carcass layer in a crown region of the tire, the distance from the second carcass layer to the main part of the first carcass layer Ha being measured between the neutral axes of the second carcass layer and of the main part of the first carcass layer, wherein each free end (A) of each turn-up of the first carcass layer in each bead is at a radial distance from the radially outermost point of the bead wire that is at least equal to 1 times and at most equal to 2 times the radial height (Ht) of the bead wire, wherein in each bead, the end of the second carcass layer is radially on the inside of the geometric centre of the bead wire, wherein, in each bead, from the free end (A) of the turn-up of the first carcass layer to the point (B) of the first carcass layer that is distant from the radially innermost point of the first carcass layer by a radial distance equal to 85% of the radial height (Hdc) of the first carcass layer the distance between the main part of the first carcass layer and the second carcass layer is at least equal to 2 times and at most equal to 11 times the diameter of the metal reinforcers of the first carcass layer, and wherein the metal reinforcers of the two carcass layers are cords made up of individual threads of which the diameters are at least equal to 0.17 mm and at most equal to 0.23 mm for at least 50% of these individual threads, and at least equal to 0.17 mm and at most equal to 0.26 mm for the entirety of these individual threads.", "2 . The tire according to claim 1 , wherein the distance DA between the main part of the first carcass layer and the second carcass layer, measured at the free end (A) of the turn-up of the first carcass layer, is greater than the distance DB between the first carcass layer and the second carcass layer, measured at that point (B) of the first carcass layer that is distant from the radially innermost point of the first carcass layer by a radial distance equal to 85% of the radial height (Hdc) of the first carcass layer.", "3 . The tire according to claim 1 , wherein the distance DA between the main part of the first carcass layer and the second carcass layer, measured at the free end (A) of the turn-up of the first carcass layer is greater than the distance DE between the first carcass layer and the second carcass layer, measured at the axially outermost point (E) of the first carcass layer ( 1 ).", "4 . The tire according to claim 1 , wherein the distance (DE) between the first carcass layer and the second carcass layer, measured at the axially outermost point (E) of the first carcass layer is at least equal to 0.9 times the distance (DB) between the first carcass layer and the second carcass layer, measured at that point (B) of the first carcass layer that is distant from the radially innermost point of the first carcass layer by a radial distance equal to 85% of the radial height (Hdc) of the first carcass layer.", "5 . The tire according to claim 1 , wherein a point I of the first carcass layer is situated at a radial distance from the free end (A) of the turn-up of the first carcass layer that is equal to 0.65 times the distance (Hae) between the free end (A) of the turn-up of the first carcass layer and the axially outermost point (E) of the first carcass layer, wherein the distance (DI) between the first carcass layer and the second carcass layer, measured at the point I of the first carcass layer, is less than the distance (DE) between the first carcass layer and the second carcass layer, measured at the axially outermost point (E) of the first carcass layer.", "6 . The tire according to claim 1 , wherein the distance (DA) between the main part of the first carcass layer and the second carcass layer, measured at the free end (A) of the turn-up of the first carcass layer, minus the minimum distance measured between the two carcass layers between the free end (A) of the turn-up of the first carcass layer and that point (B) of the first carcass layer that is distant from the radially innermost point of the first carcass layer by a radial distance equal to 85% of the radial height (Hdc) of the first carcass layer, is at least equal to 1.5 and at most equal to 4 times the diameter of the metal reinforcers of the first carcass layer.", "7 . The tire according to claim 1 , wherein, in each bead, from the free end (A) of the turn-up of the first carcass layer to the point (B) of the first carcass layer that is distant from the radially innermost point of the first carcass layer by a radial distance equal to 85% of the radial height (Hdc) of the first carcass layer, the distance from the first carcass layer to the second carcass layer is at least equal to 3 and at most equal to 8 times the diameter of the metal reinforcers of the first carcass layer.", "8 . The fire according to claim 1 , wherein the end of the second carcass layer is radially on the inside of the radially innermost point of the bead wire.", "9 . The tire according to claim 1 , having a nominal pressure P in bar, a diameter d of the metal reinforcers of the carcass layers in mm, a radial distance R13 from the radially innermost point of the first carcass layer to the axis of rotation of the tire in mm, a radial distance R14 from the radially outermost point of the first carcass layer to the axis of rotation of the tire in mm, wherein, if the product Q is equal to (R14−R13)*(3R14+R13)/8 in mm 2 , then the quotient 1000*d*R13/(P*Q) is at least equal to 0.25 and at most equal to 0.6.", "10 . The fire according to Clair 11 , wherein the metal reinforcers of the two carcass layers are cords made up of individual threads of which the diameters are, for at least 60% of these individual threads, at least equal to 0.17 mm and at most equal to 0.2 mm."], "bibtex": "@patent{20240181811,\n    title = {Optimized Architecture of a Civil Engineering Tire},\n    number = {20240181811},\n    year = {2024},\n    note = {File: US20240181811A1-20240606.XML}\n    }", "classification": "B60C902FI"}]