[{"title": "OPENING-PREFABRICATED CARBON FIBER SPOKE AND METHOD FOR PREPARATION THEREOF", "doc_number": "20240198722", "filename": "US20240198722A1-20240620.XML", "abstract": "The present invention discloses an opening-prefabricated carbon fiber spoke and a method for preparing thereof. The opening-prefabricated carbon fiber spoke includes: a spoke body made of carbon fiber, a nipple, and a nipple head. Both ends of the spoke body are a first fixed connector and a second fixed connector. The nipple is sleeved on the second fixed connector of the spoke body. A forked part of the second fixed connector is provided with a wedge pin. According to the present invention, a slope is formed at both ends of the spoke body, and the two ends are increasingly tight under an action of a pulling force, which greatly improves a tensile strength.", "detailed_description": [""], "claims": ["1 . An opening-prefabricated carbon fiber spoke, comprising: a spoke body made of carbon fiber, a nipple that is configured to cooperate with and connect to a wheel rim, and a nipple head that is configured to cooperate with and connect to a hub, ends of the spoke body respectively have a first fixed connector and a second fixed connector, the first fixed connector is provided with a diameter-expanded part, the second fixed connector is provided with a forked part, the nipple and the nipple head are provided with penetrating mounting holes, the nipple head is sleeved on the first fixed connector of the spoke body, and the nipple is sleeved on the second fixed connector of the spoke body, and the forked part of the second fixed connector is provided with a wedge pin.", "2 . The opening-prefabricated carbon fiber spoke according to claim 1 , wherein a cross-sectional shape of the spoke body between the first fixed connector and the second fixed connectors is circular, flat, oval, or diamond.", "3 . The opening-prefabricated carbon fiber spoke according to claim 1 , wherein the penetrating mounting hole of the nipple head comprises a tapered hole part, a maximum inner diameter of the tapered hole part is not greater than a maximum outer diameter of the diameter-expanded part, and under an action of a pulling force, the nipple head is connected to the spoke body.", "4 . The opening-prefabricated carbon fiber spoke according to claim 1 , wherein the spoke body is integrally formed and comprises the first fixed connector and a columnar body that extends forward, the diameter-expanded part of the first fixed connector is an inverted cone structure, and a maximum outer diameter of the inverted cone structure is 1.1-2 times a diameter of the columnar body.", "5 . The opening-prefabricated carbon fiber spoke according to claim 1 , wherein the forked part of the spoke body is a Y-shaped structure.", "6 . The opening-prefabricated carbon fiber spoke according to claim 5 , wherein the penetrating mounting hole of the nipple comprises a tapered hole part.", "7 . The opening-prefabricated carbon fiber spoke according to claim 1 , wherein the spoke body, the nipple, and the nipple head are connected and fastened by adhesive.", "step 1: forming a carbon fiber spoke body by thermoforming, one end of the carbon fiber spoke body is an expanded part with an inclination, and a second end of the carbon fiber spoke body is that a forked part in a closed state; step 2: sleeving a nipple head from a forked end of the carbon fiber spoke body, and placing the nipple head in place, so that an expanded end that is of the carbon fiber spoke body and that has a slope is inserted into the nipple head; step 3: sleeving a nipple from the forked end of the carbon fiber spoke body, applying an adhesive on the forked end of the carbon fiber spoke body, and then moving the nipple in place; step 4: applying the adhesive to a wedge pin and a part at which the forked end of the carbon fiber spoke body is bonded to the wedge pin; step 5: pressing the wedge pin into the forked end of the carbon fiber spoke body, so that the forked end of the carbon fiber spoke body expands and compresses an inner surface of a gradient hole of the nipple; and step 6: heating an assembled spoke assembly in an oven to cure the adhesive.", "in step 2, before the nipple head performs sleeving, the adhesive is applied to the one end of the carbon fiber spoke body, so that the expanded part of the carbon fiber spoke body is further fastened to the nipple head by adhesive.", "in step 1, the carbon fiber spoke body is formed by direct thermoforming and is “Y”-shaped, the one end of the carbon fiber spoke body provided with the slope is inserted into the nipple provided with the gradient hole, and the second end spreads the carbon fiber spoke body by using the wedge pin, and fastens the nipple to the carbon fiber spoke body, and bonding is performed by using an epoxy adhesive."], "bibtex": "@patent{20240198722,\n    title = {OPENING-PREFABRICATED CARBON FIBER SPOKE AND METHOD FOR PREPARATION THEREOF},\n    number = {20240198722},\n    year = {2024},\n    note = {File: US20240198722A1-20240620.XML}\n    }", "classification": "B60B104FI"}, {"title": "Traction Enhancement and Improved Spokes for Airless Tires", "doc_number": "20240198723", "filename": "US20240198723A1-20240620.XML", "abstract": "The invention is embodied in a tire having retractable studs. A driver can activate the studs for driving in icy and/or snowy conditions without manual replacement of all-weather tires to snow or studded tires as well as the installation of snow chains. The invention can be incorporated in an airless tire vehicle's traction control system and anti-lock brake system (ABS), which the traction control system can activate the retractable studs to add traction on one or more wheels. In addition, this invention provides a better thermal dissipation for airless tires.", "detailed_description": ["A clear understanding of the key features of the invention is referenced to the appended drawings that illustrate the invention. It should be understood that such drawings depict preferred embodiments of the invention and, therefore, are not to be considered as limiting its scope regarding other embodiments that the invention is capable of contemplating.", "", "The invention is embodied in a built-in stud system. The system is preferably axle driven and self-powered. The invention is an on demand wheel traction enhancement that can be operated by the traction control system (or “tract” system) and/or the anti-lock braking system (“ABS”). It also adds safety enhancements similar to mounting snow chains and/or replacing all weather tires with studded snow tires as needed. The preferred embodiment of the invention is shown inFIGS.8,10, and14.", "", "FIG.14illustrates a wheel10for enhanced traction. The wheel10comprises a center hub14that houses a pressure generating assembly16(FIG.10A). Extending radially from the exterior face18of the center hub14are a plurality of extendible stud spokes22. The proximal end24of each extendible stud spoke22is in fluid communication with the pressure generating assembly16. The distal end26of each extendible stud spoke22is connected to a tire36.", "", "The pressure generating assembly16delivers pressurized fluid to each extendible stud spoke22. Housed inside each extendible stud spoke22is a sliding stud55. The sliding stud55can be positioned inside the extendible stud spoke so that it can extend beyond the tread face34of the tire36and enhance traction depending on the pressure delivered to the extendible stud spoke. The pressure generating assembly16can be connected to and controlled by a vehicle's traction control system and/or anti-lock brake system (ABS) so that the studs can be extended automatically as the driving environment dictates. Alternatively, a driver could manually control the pressure and extend the studs when driving in icy and/or snowy conditions.", "", "When extended studs are not needed or desired, the stud heads61(FIG.23B) are recessed within the wheel (so that they do not extend past the tread face34for a smoother ride and to prevent damage the roadway pavement and/or the stud itself).", "", "Turning now toFIGS.10A and10B, the preferred pressure generating assembly16comprises a pressurized air tank7for supplying pressure to the extendible stud spokes22via a conduit system42(FIG.24). The conduit system42can be created in many ways, but it is preferred to use a circular manifold19and lateral distribution pipes21to distribute pressurized fluid. Similarly, it is preferred to connect a motorized valve13, pressure reducing valve15and an air to oil pressure booster17(FIG.17) to the conduit system42between the pressurized air tank7and the first end of the stud spoke in order to modify the pressure to the spoke.", "", "The preferred embodiment of the wheel employs an air compressor60mounted on the center hub14to pressurize the air tank7. In addition, the preferred embodiment employs a magnetic DC generator63to create electrical power (FIG.11)."], "claims": ["a center hub, the center hub comprising a pressure generating assembly and a center hub face, an extendible stud spoke, the extendible stud spoke connected to the center hub face and emanating radially from the center hub face, a proximal end of the extendible stud spoke in fluid communication with the pressure generating assembly, the extendible stud spoke comprising a sliding stud, and a tire connected to a distal end of the extendible stud spoke.", "2 . The wheel of claim 1 comprising a non-extendible spoke.", "an air tank in fluid communication with the proximal end of the extendible stud spoke via a conduit system.", "a motorized valve, a pressure reducing valve, and an air to oil pressure booster, wherein the motorized valve, pressure reducing valve and air to oil pressure booster are connected to the conduit system between the pressurized air tank and the extendible stud spoke.", "a circular distribution manifold connected to a lateral distribution pipe, and the lateral distribution pipe connected to the proximal end of the stud spoke.", "6 . The wheel of claim 3 , the pressure generating assembly further comprising an air compressor connected to the air tank.", "7 . The wheel of claim 3 , the pressure generating assembly further comprising a generator.", "8 . The wheel of claim 1 , the extendible stud spoke comprising a stud shaft housing and a slidable stud positioned within the stud shaft housing.", "9 . The wheel of claim 8 , the extendible stud spoke further comprising a spring biasing the extendible stud into a retracted position.", "10 . The wheel of claim 8 , the extendible stud comprising a face in fluid communication with the pressure generating assembly wherein pressure from the pressure generating assembly biases the sliding stud into an extended position.", "11 . The wheel of claim 10 , wherein when the sliding stud is in the extended position, a distal end of the sliding stud extends past an outside face of the tire.", "a spoke slidably positioned inside a spring housing and a spoke spring positioned inside the spring housing biasing the spoke toward the center hub."], "bibtex": "@patent{20240198723,\n    title = {Traction Enhancement and Improved Spokes for Airless Tires},\n    number = {20240198723},\n    year = {2024},\n    note = {File: US20240198723A1-20240620.XML}\n    }", "classification": "B60B928FI"}, {"title": "WHEEL AND MOTOR VEHICLE", "doc_number": "20240198724", "filename": "US20240198724A1-20240620.XML", "abstract": "A wheel and a motor vehicle. The wheel includes: a wheel hub; a wheel rim, connected to the wheel hub through a plurality of spokes, the plurality of spokes being spaced apart from each other to form a plurality of through spaces; and a plurality of baffles, movably installed to the wheel relative to the wheel hub and configured to move relative to the wheel hub in response to changes in a speed of a vehicle to provide different shielding degrees for corresponding through spaces among the plurality of through spaces.", "detailed_description": ["Various embodiments according to the present disclosure will be described in detail with reference to the accompanying drawings. Herein, it should be noted that, in the drawings, the same reference numerals are given to components having basically the same or similar structures and functions, and repeated descriptions about them will be omitted. The term “including A, B, C, etc. in sequence” only indicates the arrangement order of included components A, B, C, etc., and does not exclude the possibility of including other components between A and B and/or between B and C. In the following description, directional terms may be used for convenience. It should be pointed out that the directions appearing here are only for convenience of description, and the present disclosure is not limited thereto. Under different orientations, the features may have different directions.", "", "The attached drawings in the present specification are schematic diagrams to help explain the concept of the invention, and schematically show the shapes of various parts and their relationships.", "", "FIG.1shows a perspective view of a wheel of a first embodiment of the present application. The wheel includes a wheel hub1, a wheel rim2and a plurality of spokes3connected between the wheel hub1and the wheel rim2. The wheel hub1is connected with an axle of the vehicle, and the wheel hub is equivalent to an “inner ring” of the wheel, and the wheel rim is equivalent to an “outer ring” of the wheel. The plurality of spokes3are arranged to be spaced apart from each other to define a plurality of through spaces4between the plurality of spokes to allow air to pass therethrough. A plurality of baffles5are movably installed to the wheel relative to the wheel hub, and are configured to move relative to the wheel hub in response to changes in a speed of the vehicle, so as to provide different shielding degrees for corresponding through spaces among the plurality of through spaces. In particular, the baffles move relative to the wheel hub by using a centrifugal force generated by a rotation of the wheel upon the vehicle moving.", "", "FIG.2shows an enlarged view of the wheel hub. As illustrated byFIG.2, the wheel hub1includes a plurality of grooves11arranged on the wheel hub, and protrusions51of the plurality of baffles5are movably arranged in corresponding grooves among the plurality of grooves11. In this specification, five grooves and five baffles are shown, but those skilled in the art should understand that this is only an example, and an appropriate number of grooves and baffles can be provided as required.", "", "Specifically, the plurality of baffles5each have a protrusion51, as illustrated byFIG.3, which is movably installed in a corresponding groove of the plurality of grooves11, so that the plurality of baffles move relative to the wheel hub under the guidance of the plurality of grooves.", "", "Each of the plurality of grooves11is in the form of a logarithmic spiral curve, and has a starting end111and a terminating end112, the starting end is closer to the origin point and the terminating end is further away from the origin point relative to a spiral direction of the logarithmic spiral curve. The angle corresponding to the logarithmic spiral curve depends on the number of baffles, that is, the logarithmic spiral curve is selected based on the number of baffles.", "", "A spring6is disposed in each groove11, and one end of the spring is connected to the protrusion51, and the other end is connected to the terminating end, as illustrated byFIG.5, which shows the connection between the protrusion51and the spring6. The protrusion51is arranged in the groove so as to be clamped in the groove, and the spring also provides support for the protrusion51and the baffle, and in this case, the spring balances the component force in the tangential direction of the centrifugal force generated upon the component rotating.", "", "During the moving of the vehicle, the shielding degree for the through space provided by the baffle5will change based on the speed of the vehicle, and the relationship between the shielding degree and the speed of the vehicle will be described in detail below.", "", "FIG.6shows a mathematical model of a logarithmic spiral curve of the groove11. It is assumed that the groove corresponds to a section of the logarithmic spiral curve shown inFIG.6from point A to point B, that is, point A corresponds to the starting end of the groove and point B corresponds to the terminating end of the groove. The characteristic of logarithmic spiral curve is that the angle between the normal vector of the curve and the polar radius is always the same.", "", "The polar coordinates are expressed by the following formula:", "", "ρ=a·ek⁢θ(1)Where, the constant “a” is the polar radius of point A (i.e. the starting end), and the constant “k” is the cotangent of the angle between the polar radius and the tangent direction, that is, R=cot α, α is the angle between the tangent of any point on the logarithmic spiral curve and the polar radius, which is constant for the logarithmic spiral curve, and θ represents a polar angle, the angle around which a connection line between a point and the origin in polar coordinates revolves relative to the polar axis, and describes a movement of the baffle. The greater the θ, the greater the shielding degree is. In the present application, when the baffle moves through 36 degrees, the baffles will completely cover the through spaces, so the maximum value of θ can be selected as 36 degrees, that is, the included angle between the polar radius of point A and the polar radius of point B is 36 degrees. Of course, the maximum value depends on the number of through spaces and the number of baffles.", "", "FIG.7shows a schematic diagram drawn to calculate the relationship between the shielding degree and the speed of the vehicle. As the vehicle starts moving, due to the centrifugal force generated by the rotation of the wheel, the baffle5moves along the groove11relative to the wheel hub, thus compressing the spring6by a distance Δx. In the state shown inFIG.7, assuming that the baffle5is in a stable state, then the component force in the tangential direction along the rotation trajectory of the centrifugal force on the protrusion51is equal to the compression force of the spring. Based on this principle, the relationship (5) between θ and the linear velocity of the mass center of the baffle can be obtained through the following three formulas (2) to (4).", "", "FN/sin⁢α=m⁢vflap2a·eθ·cot⁢α(2)Fk=K⁢Δ⁢x=FN⁢cot⁢α(3)Δ⁢x=a⁢∫0θθ⁢e(cot⁢α)·θ⁢d⁢θ=a·[tan⁢α·θ·e(cot⁢⁢α)·θ+tan⁢α2·(1-e(cot⁢α)·θ)](4)νflap=a⁢K⁢tan⁢αm·cos⁢α·e(cot⁢⁢α)·θ[θ·e(cot⁢α)·θ+tan⁢α⁡(1-e(cot⁢α)·θ)](5)", "", "where, vflapis a linear velocity of the mass center of the baffle, the mass center is configured to be located on a trajectory of a corresponding groove, a is a polar radius of the starting end, α is an included angle between a tangent of any point on the logarithmic spiral curve and the polar radius, m is mass of a single baffle (the mass of the baffle is relatively small, so that the mass center of the baffle is located on the moving trajectory, which can be regarded as a moving particle on the moving trajectory equivalently), K is a stiffness of the spring, θ indicates a polar angle in polar coordinates, FKis a force exerted on the baffle upon the spring being compressed, and FNis a force exerted on the baffle by the groove, and a direction of which is a normal direction of the trajectory of the groove.", "", "The above description is mainly aimed at the case that the slip rate of the vehicle is zero, that is, the wheel does not slip. During the normal moving of the vehicle, the speed of the vehicle has a corresponding conversion relationship with the wheel rotation speed, which is well known to those skilled in the art.", "", "Next, referring to the following formula (6) describing the speed of the vehicle and the linear speed of the baffle, the relationship between the shielding degree and the speed of the vehicle can be obtained.", "", "vc⁢a⁢r=Rwρ⁢vflap(6)", "", "where, vcaris the speed of the vehicle, Rwis the radius of the wheel, and ρ is the polar radius.", "", "Therefore, θ can change with the speed of the vehicle, specifically, it can increase with the increase of the speed of the vehicle. Next, the relationship between θ and the speed of the vehicle will be described with an example.", "", "Assuming that a, a, K, and m take the values shown in Table 1 below and substitute the following values into the above formula for calculation, the graph shown inFIG.8can be drawn, it can be seen from the graph that 0 can be directly proportional to the speed of the vehicle.", "", "TABLE 1a (mm)62α(°)70K(N/m)18800m(kg)0.01", "", "As a result, with the change of speed of vehicle, θ can change correspondingly, so as to change between the three states shown inFIGS.4a-4c, which respectively show a state that the baffles does not cover the through spaces (the shielding degree is 0%), a state that the baffles covers a part of the through spaces (the shielding degree is between 0% and 100%), and a state that the baffles completely cover the through spaces (the shielding degree is 100%).", "", "In the above description, the baffles do not need any driving mechanism or any external power supply, but only depend on the centrifugal force generated upon the wheel rotating. Therefore, the plurality of baffles can automatically move based on the speed of the vehicle, thereby providing different shielding degrees to the through space among the plurality of spokes, so as to automatically adjust the air resistance.", "", "In the following second embodiment, an example in which a driving mechanism is used to drive the baffles to rotate is described. The main difference between the second embodiment and the first embodiment lies in that, in the second embodiment, the driving mechanism controls the rotation angles of the plurality of baffles based on the speed of the vehicle.", "", "As illustrated byFIGS.9and10, a wheel of the second embodiment is shown. The wheel includes a driving mechanism7and a transmission assembly; the driving mechanism7includes a motor71arranged in the wheel hub1, and the transmission assembly is connected to the rotor of the motor and the plurality of baffles, and can cause the plurality of baffles to rotate upon the rotor of the motor rotating. As illustrated byFIG.11, the transmission assembly includes: a center gear72connected to the rotor of the motor and configured to rotate together with the rotor; a plurality of transmission gears73, which are arranged around the central gear72, connected with each other through a gear frame74, and meshed with the central gear72; and a gear ring75, arranged around the plurality of transmission gears73and meshed with the plurality of transmission gears73, and the plurality of baffles5are installed to the gear ring75and can rotate together with the gear ring75.", "", "When the rotor of the motor rotates, the central gear72is driven to rotate, so that the transmission gears73rotate around the central gear, and then the gear ring75rotates circumferentially together with the plurality of baffles5.", "", "In this second embodiment, the motor is configured to, upon the speed of the vehicle being less than a predetermined threshold (for example, 140 km/h), make the rotation angle of the baffle change with the speed of the vehicle based on the following formula: θ=K·vcar. Upon the speed of the vehicle being greater than or equal to the predetermined threshold, the motor is configured to make the rotation angle of the baffle to completely cover a corresponding through space among the plurality of through spaces. In this second embodiment, the rotation angle of the baffle is set to be 36 degrees at this time. It should be understood by those skilled in the art that the value of the rotation angle that completely covers the through spaces depends on the number of through spaces and the number of baffles. The motor is controlled by a controller, which is not shown, and the use of the controller to control the motor is well known to those skilled in the art, so it will not be described in detail here.", "", "For the second embodiment, in order to supply power to the motor, as illustrated byFIG.12, a wire76can be integrated in the bearing8and the wheel hub1to supply power to the motor.FIG.12also shows that the stator712of the motor7is arranged in the wheel hub1, and the rotor711is connected with the center gear72. The power supply mode described in the present disclosure is just an example, and those skilled in the art should understand that there can be any other power supply mode as long as it can supply power to the motor.", "", "It is obvious to those skilled in the art that the present disclosure is not limited to the details of the above-mentioned exemplary embodiments, but can be realized in other specific forms without departing from the spirit or essential characteristics of the present disclosure. Therefore, the embodiments should be considered in all aspects as illustrative and not restrictive, and the scope of the invention is defined by the appended claims rather than the above description, so it is intended to embrace all changes that come within the meaning and range of equivalents of the claims. Any reference signs in the claims shall not be construed as limiting the claims concerned."], "claims": ["a wheel hub; a wheel rim, connected to the wheel hub through a plurality of spokes, the plurality of spokes being spaced apart from each other to form a plurality of through spaces; and a plurality of baffles, movably installed to the wheel relative to the wheel hub and configured to move relative to the wheel hub in response to changes in a speed of a vehicle to provide different shielding degrees for a corresponding through space among the plurality of through spaces.", "2 . The wheel according to claim 1 , wherein a shielding degree of the corresponding through space among the plurality of through spaces is based on the speed of the vehicle or a wheel rotation speed.", "3 . The wheel according to claim 2 , wherein the shielding degree of the corresponding through space among the plurality of through spaces increases with an increase of the speed of the vehicle.", "4 . The wheel according to claim 1 , wherein the plurality of baffles move relative to the wheel hub by using a centrifugal force generated by a rotation of the wheel upon the vehicle moving.", "5 . The wheel according to claim 4 , further comprising a plurality of grooves arranged on the wheel hub, wherein the plurality of baffles are movably installed into corresponding grooves among the plurality of grooves through respective protrusions of the plurality of baffles, so as to be able to move relative to the wheel hub along a specific trajectory under a guidance of corresponding grooves.", "6 . The wheel according to claim 5 , wherein a trajectory of any one of the plurality of grooves is in a form of a logarithmic spiral curve with a starting end and a terminating end, and the starting end is closer to an origin point and the terminating end is further away from the origin point relative to a spiral direction of the logarithmic spiral curve.", "7 . The wheel according to claim 6 , wherein a spring is arranged in each of the plurality of grooves, one end of the spring is connected to a protrusion of a corresponding baffle, and the other end of the spring is connected to the terminating end.", "wherein, v", "9 . The wheel according to claim 2 , further comprising a driving mechanism installed to the wheel hub and configured to drive the plurality of baffles to rotate in a circumferential direction relative to the wheel hub upon the vehicle moving.", "a motor, arranged in the wheel hub; and a transmission assembly, connected to a rotor of the motor and the plurality of baffles and configured to cause the plurality of baffles to rotate upon the rotor of the motor rotating.", "a center gear, connected to the rotor of the motor and configured to rotate together with the rotor; a plurality of transmission gears, arranged around the central gear, connected with each other through a gear frame, and meshed with the central gear; and a gear ring, arranged around the plurality of transmission gears, meshed with the plurality of transmission gears, the plurality of baffles being installed on the gear ring and being able to rotate together with the gear ring.", "12 . The wheel according to claim 10 , wherein the motor is configured to, upon the speed of the vehicle being smaller than a predetermined threshold value, make a rotation angle of the baffle change with the speed of the vehicle based on the following formula: θ=K·v car .", "13 . The wheel according to claim 12 , wherein the motor is configured to, upon the speed of the vehicle being larger than or equal to the predetermined threshold value, make the rotation angle of the baffle to completely cover a corresponding through space among the plurality of through spaces.", "14 . The wheel according to claim 13 , wherein the predetermined threshold is 140 km/h.", "a wheel, comprising: a wheel hub; a wheel rim, connected to the wheel hub through a plurality of spokes, the plurality of spokes being spaced apart from each other to form a plurality of through spaces; and a plurality of baffles, movably installed to the wheel relative to the wheel hub and configured to move relative to the wheel hub in response to changes in a speed of a vehicle to provide different shielding degrees for a corresponding through space among the plurality of through spaces."], "bibtex": "@patent{20240198724,\n    title = {WHEEL AND MOTOR VEHICLE},\n    number = {20240198724},\n    year = {2024},\n    note = {File: US20240198724A1-20240620.XML}\n    }", "classification": "B60B2700FI"}, {"title": "MACHINE AND METHOD FOR AUTOMATIC APPLICATION OF RIM TAPE", "doc_number": "20240198725", "filename": "US20240198725A1-20240620.XML", "abstract": "The invention refers to a machine ( 1 ) and the automatic method for applying tape ( 5 ) in the interior of the rim ( 3 a ) of a bicycle wheel ( 3 ) to protect the inner tube and/or seal the rim ( 3 a ) for tubeless tyres. The machine ( 1 ) of the invention comprises a stand ( 2 ) where the wheel ( 3 ) is placed on a positioning and retention system ( 4 ) that rotates it to place the tape ( 5 ) in the interior of the rim ( 3 a ) by means of a dispensing system ( 6 ). The machine ( 1 ) and the method of the invention comprise a shaping system ( 8 ) for the tape ( 5 ) by means of a pressure roller ( 8 a ) and a heat dispenser ( 8 b ) together with an automation system ( 9 ) to setting the taping parameters required by the different systems.", "detailed_description": ["The invention refers to a machine (1) for the automatic application of a rim tape onto a wheel rim (3a) like the one shown inFIGS.1to3. That is, a machine (1) that applies, for example, self-adhesive tape (5) to the interior of the rim (3a) of a wheel (3) to protect the inner tube and/or seal the rim (3a) to later place a tyre on the wheel (3) of a bicycle.", "", "The machine (1) of the invention comprises a stand (2) with a front surface (2a) where the wheel (3) is placed and a rear surface (2b) that has a cover (2c) that protects some systems forming part of the machine (1) as shown inFIGS.2and3. Specifically, the wheel (3) is placed on at least two fixed rollers (4a) on the lower part of the stand (2) and at least one mobile roller (4b) on the upper part of the stand (2), which form a positioning and retention system (4) for the wheel (3). The mobile roller (4b) is moved by a longitudinal guide (4c), which allows the user to adjust the positioning and retention system (4) to different diameters of wheel (3). When the wheel (3) is placed and the movable roller (4b) is adjusted to the diameter of the wheel (3), it can be seen that on the movable roller (4b) there is a locking button (4d) to lock the movement of the mobile roller (4b) in the longitudinal guide (4c). As a result, after the retention of the mobile roller (4b), the wheel (3) can only rotate due to friction from the rotation of the fixed rollers (4a) and the pressure of the rollers (4a,4b) on the edge of the rim (3a) since the rollers (4a,4b) are slightly thicker than the width of the rim (3a).", "", "As shown inFIGS.1A to3and7, the stand (2) of the machine (1) of the invention comprises an inclined front surface (2a) that improves operator ergonomics and minimizes work injuries. In addition, it includes at least four wheels at the bottom of the stand (2) to make it easy to move from one place to another.", "", "As can also be seen inFIGS.1A and1Band in more detail inFIG.4, on the front surface (2a), specifically above the wheel (3) and the mobile roller (4b), there is a mobile tape (5) dispensing system (6). In other words, the dispensing system (6) can move along a radial guide (6g) fixed to a base of the rear surface (2b) of the stand (2), parallel to a guide groove (6c) on the stand (2) from a resting position on the upper part of the stand (2) until it comes into contact with the wheel (3). The dispensing system (6) comprises a roll (6a) of tape (5) placed and fixed on an axle (6h) attached to a tensing system (6b) that is located between the wheel (3) and the roll (6a) on the front surface (2a) of the stand (2). The tensing system (6b) of the dispensing system (6) comprises at least three rollers, where at least one tensing roller (6e) has a larger diameter than the other two guide rollers (6f). In other words, the larger diameter tensing roller (6e) will have the purpose of generating tension in the tape (5) to prevent wrinkles and the smaller diameter guide rollers (6f) above and below the tensing roller (6e) are for directing the tape (5) towards the inside of the rim (3a). The tensing roller (6e) that is in contact with the inside of the rim (3a) has the same thickness as the width of the inside of the rim (3a) in order to be inserted into it and fix the tape (5) completely flat. In addition, the dispensing system (6) is capable of moving along the radial guide (6g) and the guide groove (6c) from a resting position until it meets the wheel (3) when activated by a start button (10) on the upper part of the stand (2).", "", "In addition, the dispensing system (6) also comprises a retention system (6d) formed, for example, of a brake disc installed on a rear surface (2b) of the stand (2) connected to the dispensing system (6) to exert a certain dosed retention on the axle (6h) of the roll (6a) as shown inFIGS.3and6. The tape (5) is also placed in the interior of the rim (3a) with the right tension to stick it as strongly and smoothly as possible. This retention system (6d) also has a regulation device to establish the necessary tension of the tape (5). As also shown inFIGS.1A,3and4, the dispensing system (6) is also connected to a mobile, displaceable cutting system (7) next to the dispensing system (6), since once the necessary tape (5) has been fixed to the interior of the rim (3a), the tape (5) must be cut. To do so, the cutting system (7) comprises a protector (7c) that is located on the front surface (2a) as shown inFIGS.1A,1B and7, behind which there is a blade (7b) attached to a pneumatic piston (7a) located on the rear surface (2b) of the stand (2). The pneumatic piston (7a) moves the blade (7b) perpendicularly, so that the blade (7b) passes through the stand (2) from the rear surface (2b) towards the front surface (2a) through a lower area of the guide groove (6c). The protector (7c) is for protecting the blade (7b) when it is necessary for the operator to handle the roll (6a) for its replacement or when the machine (1) is not in operation. In other words, the protector (7c) can be moved from a resting position as shown inFIG.1A, where the blade (7b) is exposed when the machine (1) is in operation, to a protective position shown inFIG.1B, where the blade (7b) is covered by the front surface (2a), shows when the machine (1) is not operating or the roll (6a) must be replaced. In the preferred embodiment of the invention, the protector (7c) comprises a C-shaped flat body that, together with the axle (6h), limits the movement of the protector (7c).", "", "Furthermore, the machine (1) of the invention, as can be seen inFIG.5, is characterized in that in a lateral area of the stand (2) there is a shaping system (8) that comprises at least one pressure roller (8a) that is laterally displaceable by a lateral guide (8c), from a resting position at an outer end of the lateral guide (8c) of the stand (2) towards an active position in contact with the interior of the rim (3a) and a heat dispenser (8b) on the front surface (2a) oriented to dispense heat towards the wheel (3). By means of this shaping system (8) and once the tape (5) is placed on the interior of the rim (3a), heat is applied by means of the heat dispenser (8b) and pressure with the pressure roller (8a), achieving the regular shape of the tape (5), and thus eliminating bubbles so that it is completely adhered and matched, i.e., that the seal is tight and guarantees the necessary tightness for the assembly of the tyre or tubeless tyre. To do this, the pressure roller (8a) must have a thickness and shape equal to the interior of the rim (3a) so it must be exchangeable depending on the wheel (3) to be taped.", "", "Next, asFIGS.1A and1BandFIG.6show in detail, on the other side of the wheel (3), that is, on the opposite side to the shaping system (8), the stand (2) comprises a hole punch (11) which can be moved along a guide (11a) and oriented by means of a laser (11b) designed to mark a hole for a valve of the wheel (3) so that the punch (11) moves and make a hole for the valve of the wheel (3) on the tape (5). Specifically, the laser (11b) is located on the rear surface (2b) of the stand (2) at the height of the hole punch (11) and oriented towards the hole punch (11) and a slot (11c) on the stand (2) that makes it possible to project a light on the rim (3a) between the hole punch (11) and the slot (11c).", "", "In addition, as previously mentioned, the object of the invention is an automatic machine (1) for applying rim tape. Therefore, the machine (1) includes an automation system (9) whereby it is possible to establish and define the taping parameters necessary to carry out the process of placing the tape (5) on the interior of the rim (3a) automatically. As seen inFIGS.1A and1B, the stand (2) comprises an automation system (9) in the upper area connected to all the previously mentioned systems by the rear surface (2b) of the stand (2) as shown inFIG.3. The automation system (9) comprises a display or touch screen (9a) on the front surface (2a) of the stand (2) that is easily accessible to the user, where the user can enter the following parameters:Taping process;Number of complete turns that the wheel (3) will make for the placing of the tape (5)Wheel (3) rotation speedLength of tape (5) usedPosition of the valve hole (14) to calculate the overlap of the tape (5) on the valve hole (14).Shaping process:Number of complete turns of the wheel (3) that occurs with the pressure roller (8a) applying pressure to the bottom of the rim (3a).Turning speed of the wheel (3) while the pressure roller (8a) presses the tape (5).Action of the pressure roller (8a).Diffusion time and temperature of the heat dispenser (8b)", "", "The touch screen (9a) also allows various different options such as; the option to cancel the activity of the machine (1), to choose the blade (7b) change option, where the cutting system (7) moves towards the front surface (2a) to give the user access to the blade (7b) and the option to preheat, an option necessary to start using the machine (1).", "", "Additionally, and for safety, the machine (1) can include an emergency stop button (12) and an automated system for stopping and resetting the automation system (9) and the machine (1). In alternative embodiments, the machine (1) can also include a protection system by means of sensors to prevent people approaching the perimeter while the machine (1) is in operation. In the preferred embodiment, the protection system consists of safety bars (13) on fixtures (14) on the sides of the front surface (2a) as shown inFIG.7. The safety bars (13) are a security solution based on emitting beams of light from one bar (13) to another so that if something interrupts the beam of light while the machine (1) is in operation it is detected by means of sensors.", "", "Therefore, the machine (1) of the invention is for taping the rim (3a) of a wheel (3) quickly, easily, conveniently and safely for the operator or user of the machine (1), achieving optimal placement of the tape (5) for the use of tubeless tyres, in a safe way for the operator.", "", "The invention also refers to an automatic method for applying the rim tape by means of the machine (1) of the invention, where the machine (1) is activated to rotate a wheel (3) and place a tape (5) on the interior of the rim (3a). In other words, the tape (5) application method can be fully automatic or semi-automatic, where the steps are carried out fully automated or between an operator and the machine (1). The operator merely has to place the wheel (3), start the machine (1), finish and remove the wheel (3).", "", "Initially, an automation system (9) is configured by means of a touch screen (9a) which is adjustable by means of a control knob (9b). Both elements (9a,9b) are located in an upper front surface (2a) of the machine (1) and are designed to configure the parameters of the machine (1), such as the number of taping turns, the speed of rotation, the overlapping of the tape (5), the number of turns in the shaping, the temperature of shaping, heat exposure time, etc. depending on the bicycle wheel (3) that needs to be taped.", "", "Next, the wheel (3) is placed in the machine (1) resting on at least two fixed rollers (4a) as indicated by the projection of a laser (11b) on the internal part of the wheel (3), that is to say that a valve hole in the wheel (3) must coincide with the projection of the laser (11b) on the inside of the wheel (3). Once the valve hole is located, the wheel (3) is fixed by means of at least one mobile roller (4b), which can be moved by a longitudinal guide (4c) to adjust it to the diameter of the wheel (3). After fixing the wheel (3) with the movable roller (4b), the locking screw or button (4d) is pressed to block the longitudinal movement of the movable roller (4b).", "", "Once the wheel (3) is fixed, a protector (7c) in the cutting system (7) is raised and at least two motors connected to the fixed rollers (4b), located on the rear surface (2b) of the machine (1), are activated (1), which will start the automation process of the machine (1) systems, by optionally activating a start button (10). That is to say, the fixed rollers (4a) begin to rotate, which by friction make the wheel (3) rotate and the path established for the overlapping parameter of the tape (5) will rotate over the valve hole. Once sufficient turn has been made for the overlapping of the tape (5), the fixed rollers (4a) stop and a dispensing system (6) moves along a radial guide (6g) of the system (6) thanks to a guide groove (6c) on the stand (2) until a tensing system (6b) in the dispensing system (6), through which the tape (5) protrudes, comes into contact with the wheel (3), specifically with the interior of the rim (3a). In this way, the tape (5) sticks to the interior of the rim (3a) and the fixed rollers (4a) start working again by turning the wheel (3) and sticking the tape (5) without wrinkles and with some tension to the interior of the rim (3a). Once the taping turns established in the automation system (9) have finished, the fixed rollers (4a) stop turning and the dispensing system (6) returns to its starting position, to activate a connected and movable cutting system (7) with the dispensing system (6) on the rear surface (2b) of the stand (2). Therefore, a pneumatic piston (7a) is activated to move a blade (7b) connected to it, from a rear surface (2b) towards a front surface (2a) of the stand (2) through the guide groove (6c) to cut the tape (5) in the area that is under tension between the mobile roller (4b) and the tensing system (6b), which is now in the resting position.", "", "Following the cutting of the tape (5), the rotation of the fixed rollers (4a) is activated again and a shaping system (8) and/or thermal moulding is also activated according to the criteria specified in the automation system (9). In other words, at least one pressure roller (8a) of the shaping system (8) moves along a lateral guide (8c) towards the interior of the rim (3a) to exert pressure on the tape (5) while a heat dispenser (8b) projects hot air onto the belt (5) before reaching the pressure roller (8a). In this way, a better adhesion of the tape (5) to the interior of the rim (3a) is achieved and any imperfection that may have remained during the placement of the rim tape is corrected.", "", "Subsequently, when the tape (5) is correctly fixed on the bottom of the rim (3a), the rotation of the wheel (3) and the fixed rollers (4a) stops. Finally, the mobile roller (4b) is unlocked, releasing the wheel (3) of the machine (1) and the wheel (3) is turned until the valve hole is positioned where the laser projection (11b) indicates. The wheel (3) is locked again by means of the mobile roller (4b) so that, by means of a hole punch (11) that can be moved along a guide (11a) that is located on the opposite side of the shaping system (8), the hole is made in the tape (5) for the valve. Once the valve hole has been punched, the mobile roller (4b) is unlocked again, releasing the wheel (3) from the machine (1).", "", "Due to all of the above, an automatic operating machine (1) is achieved for taping the interior of the rim (3a) of a bicycle wheel (3) and a very simple semi-automatic procedure, thanks to which the effort of placing the tape (5) and the results of the taping are optimized thanks to the dispensing (6) and shaping systems (8). In addition, the parameterization of the automation system (9) for different wheels (3) is dynamic and easy to use thanks to the touch screen (9a) and the many possibilities it offers."], "claims": ["A shaping system for the tape comprising at least one heat dispenser facing the wheel and at least one pressure roller that can be moved towards the interior of the rim.", "2 . Machine for applying rim tape, according to claim 1 , where the machine comprises a automation system for the setting of the taping parameters that includes a touch screen and is connected to the positioning and retention system, to the dispensing system, to a cutting system and to the shaping system.", "3 . Machine for applying rim tape, according to claim 1 , where the positioning and retention system comprises at least two fixed rollers in a lower part of the stand under the wheel and at least one mobile roller movable by a longitudinal guide in an upper part of the stand above the wheel.", "4 . Machine for applying rim tape, according to claim 1 , where the dispensing system is located in an upper part of the stand parallel to the mobile roller and comprises a roll of tape attached to a tensing system, which comprises at least three rollers, with at least one having a larger diameter than the others, located between the wheel and the roll and a retention system on a rear surface of the stand connected to an axle of the roll of tape.", "5 . Machine for applying rim tape, according to claim 1 , where the dispensing system can be moved by a guide groove parallel to a longitudinal guide from a resting position in the upper part of a front surface toward a contact position with the wheel.", "6 . Machine for applying rim tape, according to claim 1 , where the dispensing system is connected to a cutting system comprising a pneumatic piston on a rear surface of the stand that is attached to a blade.", "7 . Machine for applying rim tape, according to claim 1 , where at least one pressure roller of the shaping system can be moved laterally by a lateral guide, from a resting position at one outer end of a front surface of the stand towards an active position in contact with the interior of the rim.", "8 . Machine for applying rim tape, according to claim 7 , where the pressure roller is interchangeable according to the wheel model and dimensions, shape or size of the rim.", "9 . Machine for applying rim tape, according to claim 1 , where the machine comprises a hole punch that can be moved along a guide towards a projection laser.", "10 . Machine for applying rim tape, according to claim 1 , where the machine comprises a protection system by means of sensors.", "Activating a shaping system, Projecting heat on the tape of the wheel using a heat dispenser, Pressing a pressure roller above the tape on the interior of the rim.", "Setting an automation system, according to some taping parameters of the rim tape, Placing the wheel on the positioning and retention system, Fixing the wheel using a laser projection that indicates the position of a valve hole.", "Moving a tape dispenser system until it comes into contact with the wheel, Sticking the tape in the interior of the rim, Turning the wheel sticking the tape for the established turns, Activating a cutting system in the dispensing system, activating a blade towards the tape, Cutting the tape.", "Adjusting a retention system located at the rear surface of the stand, to slow the axle of the roll of the dispensing system and tighten the tape during the placement of the tape to ensure even adhesion.", "Turning the wheel to place a valve hole where a laser projection indicates, Blocking the wheel by means of the mobile roller, Moving a hole punch through a guide to make a hole for the valve in the tape, Releasing the wheel."], "bibtex": "@patent{20240198725,\n    title = {MACHINE AND METHOD FOR AUTOMATIC APPLICATION OF RIM TAPE},\n    number = {20240198725},\n    year = {2024},\n    note = {File: US20240198725A1-20240620.XML}\n    }", "classification": "B60B3100FI"}, {"title": "Caster with Compliant Brake Ring or Brake Block", "doc_number": "20240198726", "filename": "US20240198726A1-20240620.XML", "abstract": "A caster hub structure has an outward facing brake ring with a tooth profile on its outer surface. A brake block with a tooth profile on its outer surface is engageable and disengageable with the brake ring. The brake block material may be harder than the brake ring material, or the brake ring material may be hardness the brake block material, depending upon the application. The brake block tooth profile is configured to slip with the brake ring tooth profile at a first wheel rotational speed when the brake block is engaged with the brake ring, and the brake block tooth profile is configured to interlock with the brake ring tooth profile at a second wheel rotational speed when the brake block is in the engaged with the brake ring, the first speed being higher than the second speed.", "detailed_description": ["Referring toFIGS.1to7, the exemplary caster10may be coupled to a movable object (not shown) to support and move the movable object. The movable object to which the caster device10is coupled may include, but is not limited to, a movable bed or a medical appliance such as an ultrasonic diagnostic apparatus. Further, the movable object may be any movable object to which the caster10can be coupled, such as a cart designed to carry articles. The caster10may be coupled to a lower side of the movable object. Although the drawings show a dual wheel caster, the principles of the disclosure may be applied to a single wheel caster, or other arrangement and are not intended to be limiting. For the sake of brevity and not in any limiting sense, the disclosure that follows below will address a dual wheel arrangement of a caster for purposes of illustrating the principles of the disclosure but such principles apply equally with respect to a single wheel or other arrangement for a caster.", "", "The caster10may include a body12, left and right wheels14,16projecting from the body, and a stem18projecting from the body to provide swivel connection to the movable object. A base20rotatable with the stem18may be provided at the bottom of stem to further support the movable object. A rotary bearing22may be operatively disposed between the body12and the stem18for swivel rotation, and a thrust bearing24may be disposed between the body and the base20. The body12may include a fork portion26that supports an axle28and/or hub structure30of the wheel14,16. The hub structure30of the wheel14,16may include a brake ring32with a smooth saw tooth profile extending around the peripheral edge of the brake ring.", "", "The stem18may be provided with an actuator40that allows the caster to be placed in one of a plurality of operating modes by reciprocating rotation of the actuator. A crank shaft (not shown) may be coaxially connected or coupled to the actuator40of the caster10. The actuator40may cooperate with a cam element42disposed in the stem. The actuator40may be operatively connected with the cam element42so rotation of the actuator repositions the cam element and sets the operating mode of the caster. A push rod44may have first and second ends and extend vertically in the stem and through an upper hollow interior of the body. An end of the push rod44may be operatively connected with a compression spring46in the caster body that urges the push rod vertically upward so the push rod engages against the cam element42. Between the first and second ends, the push rod may have a releasable connection with a swivel lock50of the caster and/or a releasable connection with a brake lock52.", "", "The cam element42may have three or more cam surfaces that may be brought to bear on the second end of a push rod44and set the vertical position of the push rod to release or form the connection with the swivel lock50and/or release or form the connection with the brake lock52. In one aspect, a brake block56may be attached toward a lower or first end of the push rod44, and a face gear engagement piece58may be integrally attached to the push rod above the brake block. The brake block56may selectively engage the complementary brake ring32to form the wheel lock52. The face gear engagement piece58may selectively engage a complementary locking gear60formed in the upper portion of the body below the rotary bearing22to form the swivel lock50.", "", "The cam element42may have first, second and third cam surfaces on its periphery, each of which is sized in a radial direction from a rotating axis. As the second end of the push rod44contacts the cam surfaces of the cam element42under the biasing force of the compression spring46, the push rod may be vertically and resiliently movable due to the reciprocating rotation of the cam element42about the rotating axis, thus allowing the caster to operate in first, second and third modes. In the first mode, the second end of the push rod44may be engaged with the first cam surface of the cam element. The push rod44may be vertically positioned in a manner such that the face gear engagement piece58may be separated from the locking gear60of the body12and the brake block56may be separated from the brake ring32of the wheel hub30. Thus, the stem18of the caster may swivel or rotate to change the moving direction and the wheel14,16may rotate. In the second mode, the second end of the push rod44may contact the second cam surface of the cam element. In the second mode, the push rod44may move downwardly to bring the face engagement gear58in interlocking registry with the locking gear60in the body12, thus preventing rotation about the swivel axis while maintaining the brake block56disengaged from the brake ring32. Thus, in the second mode, swiveling may be locked in position, but the wheel may be free to rotate. As explained below in more detail, in the third mode, the second end of the push rod44may be engaged with the third cam surface of the cam element. In the third mode, the push rod44may be vertically positioned in a manner such that the face gear engagement piece58may be engaged to the locking gear60in the body12and the brake block56may be brought into contact with the brake ring58. Thus, in the third mode, swiveling may be locked in position, and the wheel may be prevented from rotation.", "", "As best shown inFIGS.3-5, the brake block56has a shallow tooth pattern that is engageable and interlockable with the shallow tooth pattern of the brake ring32. The outer surface of the brake ring32has a shallow tooth profile patterned around the outer diameter surface of the brake ring. In one aspect, the brake ring32has a material on its outer surface that is compliant and deformable. The brake ring material and tooth profile allows the outer surface of the brake ring to compress/deform when engaged by the brake block. By way of example and not in any limiting sense, the outer surface of the brake ring may be formed form an elastomer. The brake block56may be more rigid than the brake ring. By way of example and not in any limiting sense, the brake block may be formed of a plastic material. The brake block may have a shallow tooth profile that complements the tooth profile on the brake ring.", "", "In another aspect, the brake block has a material on its outer surface that is compliant and deformable. The brake block material and tooth profile allows the outer surface of the brake block to compress/deform when engaged by the brake ring. In the aforementioned embodiment, by way of example and not in any limiting sense, the outer surface of the brake block may be formed form an elastomer. The brake ring may be more rigid than the brake block. In the aforementioned embodiment, by way of example and not in any limiting sense, the brake ring may be formed of a plastic material. The brake ring may have a shallow tooth profile that complements the tooth profile on the brake ring.", "", "When activated, for instance, in the third mode, the brake block56may be driven into the brake ring32via the action of the push rod44. In the drawings, the push rod44is moved downward which corresponds to the motion of the brake block56relative to the brake ring32. That is, the brake block moves in a vertical direction within the body when moving between the engaged and disengaged positions. In one aspect, the brake ring32material deflects and/or deforms upon engagement and thereafter the tooth profile of the brake ring interlocks with the tooth profile of the brake block56. In another aspect, the brake block material deflects and/or deforms upon engagement and thereafter the tooth profile of the brake ring interlocks with the tooth profile of the brake block. The tooth profile of the brake block56and brake ring32is somewhat rounded at the tips of the teeth to allow relative motion or slip between the brake block and brake ring32during engagement until the tooth profile of the brake ring interlocks with the tooth profile of the brake block. For instance, as best shown inFIG.8, each tooth in the plurality of teeth of the brake block is defined by a rounded outer edge disposed between rounded inner edges, and each tooth in the plurality of teeth of the brake ring is defined by a rounded outer edge disposed between rounded inner edges. In both cases, the rounded outer edge has a first curvature and the rounded inner edge has a second curvature that is less than the first curvature. As to the first and second curvature, the teeth may be formed with a single radius or a more general type of curvature with multiple radii defining the curvature. In each case of the brake ring teeth and the brake block teeth, the curvature of the rounded outer edge is greater than the curvature of the adjacent rounded inner edges.", "", "In this way, the tooth profile of the brake ring and the brake block are configured to allow relative slip between the brake block and brake ring at a first speed of rotation of the wheel with the brake block engaged with the brake ring and to allow interlocking of the brake block with the brake ring at a second speed of rotation of the wheel that is less than the first speed of rotation of the wheel. In other words, when the brake block engages the brake ring, the brake ring may engage the brake ring to begin to slow the rotation of the caster wheel. Because the brake ring (or brake block, as the case may be) is compliant and the brake block (or brake ring, as the case may be) is made from a harder material, the brake block (or brake ring) may deform to allow slip and without the tooth profile of the brake block interlocking with the tooth profile of the brake ring. With the brake block engaged, the wheel may continue to slow rotation until a level such that the tooth profile of the brake ring interlocks with the tooth profile of the brake block to thereafter prevent rotation of the wheel. The brake ring (or brake block, as the case may be) may slowly return to its undeformed state to allow the tooth profile of the brake ring to interlock with the tooth profile of the brake block to prevent rotation of the wheel. This allows the brake52to be activated, for instance, in the third mode, while caster is in motion and allows for a progressive reduction in speed before unit comes to a complete stop.", "", "While the drawings show a caster with a stem operator adapted and configured to set three modes of operation of the caster, the principles of the compliant brake ring described above may be used in connection with other types of casters and wheels.", "", "The principle and embodiments of the present application are described through specific examples herein. The description of the above-described embodiments is merely used to facilitate understanding the method and core idea of the present application. It should be noted that, for those skilled in the art, various improvements and modifications may be further made to the present application without departing from the principle of the present application, and these improvements and modifications also fall within the protection scope defined by the claims of the present application."], "claims": ["a body; a wheel operatively rotatably connected to the body; a hub structure operatively connected to the wheel, the hub structure having an outward facing brake ring, the brake ring being formed of a radially compliant material, the brake ring having a tooth profile on an outer surface of the brake ring; and a brake block adapted and configured for reciprocating motion within the body between an engaged position with the brake ring and a disengaged position with the brake ring, the brake block being formed of a material having a hardness greater than the hardness of the material of the brake ring, the brake block having a tooth profile on an outer surface of the brake block; wherein the tooth profile of the brake block is adapted and configured to slip with the tooth profile on the outer surface of the brake ring at a first speed of rotation of the wheel when the brake block is in the engaged position, and the tooth profile of the brake block is adapted and configured to interlock with the tooth profile on the outer surface of the brake ring at a second speed of rotation of the wheel when the brake block is in the engaged position, the first speed being higher than the second speed; wherein when the brake block is in the engaged position relative to the brake ring, the brake block engages the brake ring in a manner so as to enable relative motion between the brake block and brake ring at the first speed of rotation of the wheel and to limit relative motion between the brake block and the brake ring at the second speed of rotation of the wheel; and wherein when the brake block is in the disengaged position relative to the brake ring, the brake block is spaced from the brake ring in a manner so as to allow free rotation of the wheel relative to the body.", "2 . The caster of claim 1 wherein brake ring is coaxially aligned with an axis of rotation of the wheel.", "3 . The caster of claim 1 wherein the hub structure has an annular surface with the brake ring being mounted on the annular surface.", "4 . The caster of claim 1 where the brake ring is formed of an elastomer material.", "5 . The caster of claim 1 wherein the tooth profile of the brake block having rounded outer edges.", "6 . The caster of claim 1 wherein the tooth profile on the outer surface of the brake ring having rounded outer edges.", "7 . The caster of claim 1 wherein the brake block is made of a plastic material.", "8 . The caster of claim 1 wherein the brake block moves in a vertical direction within the body when moving between the engaged and disengaged positions.", "a body; a wheel operatively rotatably connected to the body; a hub structure operatively connected to the wheel, the hub structure having an outward facing brake ring, the brake ring having a plurality of teeth arranged in a pattern on an outer surface of the brake ring; and a brake block adapted and configured for reciprocating motion within the body between an engaged position with the brake ring and a disengaged position with the brake ring, the brake block having a plurality of teeth on an outer surface of the brake block; wherein the brake ring is formed of a material sufficiently radially compliant such that wherein when the brake block is in the engaged position relative to the brake ring, the brake block engages the brake ring in a manner so as to allow relative motion between the brake block and the brake ring, and after rotation of the wheel, enable at least one of the teeth in the plurality of teeth of the brake block to interlock with at least one of the teeth in the plurality of teeth on the outer surface of the brake ring; and wherein when the brake block is in the disengaged position relative to the brake ring, the brake block is spaced from the brake ring in a manner so as to allow free rotation of the wheel relative to the body.", "10 . The caster of claim 9 wherein brake ring is coaxially aligned with an axis of rotation of the wheel.", "11 . The caster of claim 9 wherein the hub structure has an annular surface with the brake ring being mounted on the annular surface.", "12 . The caster of claim 9 where the brake ring is formed of an elastomer material.", "13 . The caster of claim 9 wherein each tooth of the tooth profile of the brake block has rounded outer edges.", "14 . The caster of claim 9 wherein each tooth in the plurality of teeth on the outer surface of the brake ring has rounded outer edges.", "15 . The caster of claim 9 wherein the brake block is made of a plastic material.", "16 . The caster of claim 9 wherein the brake block moves in a vertical direction within the body when moving between the engaged and disengaged positions.", "17 . The caster of claim 9 wherein each tooth in the plurality of teeth of the brake block is defined by a rounded outer edge disposed between rounded inner edges, the rounded outer edge has a first curvature, the rounded inner edge has a second curvature, the first curvature is greater than the second curvature.", "18 . The caster of claim 9 wherein each tooth in the plurality of teeth of the brake ring is defined by a rounded outer edge disposed between rounded inner edges, the rounded outer edge has a first curvature, the rounded inner edge has a second curvature, the first curvature is greater than the second curvature.", "19 . The caster of claim 9 wherein the plurality of teeth of the brake ring are adapted and configured to slip with the plurality of teeth of the brake block at a first speed of rotation of the wheel when the brake block is in the engaged position and interlock with the plurality of teeth of the brake block at a second speed of rotation of the wheel when the brake block is in the engaged position, the first speed is greater than the second speed.", "a body; a wheel operatively rotatably connected to the body; a hub structure operatively connected to the wheel, the hub structure having an outward facing brake ring, the brake ring having a plurality of teeth arranged in a pattern on an outer surface of the brake ring; and a brake block adapted and configured for reciprocating motion within the body between an engaged position with the brake ring and a disengaged position with the brake ring, the brake block having a plurality of teeth on an outer surface of the brake block; wherein the brake block is formed of a material sufficiently radially compliant such that wherein when the brake block is in the engaged position relative to the brake ring, the brake block engages the brake ring in a manner so as to allow relative motion between the brake block and the brake ring, and after rotation of the wheel, enable at least one of the teeth in the plurality of teeth of the brake block to interlock with at least one of the teeth in the plurality of teeth on the outer surface of the brake ring; and wherein when the brake block is in the disengaged position relative to the brake ring, the brake block is spaced from the brake ring in a manner so as to allow free rotation of the wheel relative to the body.", "21 . The caster of claim 20 wherein brake ring is coaxially aligned with an axis of rotation of the wheel.", "22 . The caster of claim 20 wherein the hub structure has an annular surface with the brake ring being mounted on the annular surface.", "23 . The caster of claim 20 where the brake block is formed of elastomer material.", "24 . The caster of claim 20 wherein each tooth of the tooth profile of the brake block has rounded outer edges.", "25 . The caster of claim 20 wherein each tooth in the plurality of teeth on the outer surface of the brake ring has rounded outer edges.", "26 . The caster of claim 20 wherein the brake ring is made of a plastic material.", "27 . The caster of claim 20 wherein the brake block moves in a vertical direction within the body when moving between the engaged and disengaged positions.", "28 . The caster of claim 20 wherein each tooth in the plurality of teeth of the brake block is defined by a rounded outer edge disposed between rounded inner edges, the rounded outer edge has a first curvature, the rounded inner edge has a second curvature, the first curvature is greater than the second curvature.", "29 . The caster of claim 20 wherein each tooth in the plurality of teeth of the brake ring is defined by a rounded outer edge disposed between rounded inner edges, the rounded outer edge has a first curvature, the rounded inner edge has a second curvature, the first curvature is greater than the second curvature.", "30 . The caster of claim 20 wherein the plurality of teeth of the brake ring are adapted and configured to slip with the plurality of teeth of the brake block at a first speed of rotation of the wheel when the brake block is in the engaged position and interlock with the plurality of teeth of the brake block at a second speed of rotation of the wheel when the brake block is in the engaged position, the first speed is greater than the second speed."], "bibtex": "@patent{20240198726,\n    title = {Caster with Compliant Brake Ring or Brake Block},\n    number = {20240198726},\n    year = {2024},\n    note = {File: US20240198726A1-20240620.XML}\n    }", "classification": "B60B3300FI"}, {"title": "CONTROLLER AND METHOD FOR CONTROLLING CASTERS ATTACHED TO A MOVABLE PART", "doc_number": "20240198727", "filename": "US20240198727A1-20240620.XML", "abstract": "A controller and a method for controlling casters attached to a movable part such as a hospital bed, for switching the castors between a state in which the castor is pivot locked and rotationally blocked, and a state in which there is neither a pivot locking nor a rotational blocking, additionally switchable into a state in which the caster is only pivot locked, actuatable electrically and also manually, movement sensor. Multiple switching states may be automatically and sequentially assumed in a predetermined sequence, a first switching state in which there is neither a pivot locking nor a rotational blocking, which a second switching state, in which one or more or all castors are pivot locked, however not rotationally blocked, and finally a switching state, in which all switchable casters are again pivot locked and rotationally blocked.", "detailed_description": ["A first exemplary embodiment of a movable part1in the form of a hospital bed, depicted here only as a chassis, is depicted and described, initially with respect to the depiction inFIG.1.", "", "Movable part1has four casters2assigned to the corner areas of the rectangle substantially spanned in a top view by movable part1. These casters are designed as lockable steering casters each having a wheel4rotatably held in a support housing3. In the usual arrangement and use position of casters2, the geometric axes of rotation x of wheels4extend substantially in a common horizontal plane. It is possible to pivot support housing3, together with caster4, about a pivot axis y perpendicular to said horizontal plane, in order in particular to facilitate a curving travel of movable part1.", "", "Movable part1is provided with a controller5, via which multiple switching states S1, S2, and S3of one or more of casters2may be automatically assumed in sequence, thus, in particular, a first switching state S1(release state), in which a pivoting of the respective caster2about the pivot axis y and a free rotation of wheel4about the axis of rotation x is enabled; further a second switching state S2(pivot locking state), in which the pivoting of the caster2about the pivot axis y is blocked while free rotation of wheel4continues; and more preferably a third switching state S3, in which both the rotation of wheel4and the pivoting of caster2are blocked (total locking state). The various switching states S1, S2, and S3are automatically sequentially assumed in a predetermined sequence via controller5.", "", "The different switching positions of switching states S1, S2, and S3may be detected, for example, via limit switches. These may further interact, for example, with an actuating shaft26driven by an electric motor30. A referencing for path determination may also be carried out, preferably automatically, when using an electric motor30, as will be subsequently described. This may be a position feedback. The motor may be referenced when starting, and may then move to the positions based on a software-side entry.", "", "In detail, the position feedback may be carried out in such a way that the motor initially approaches a stop at a slow speed. Together with the direction of rotation, which may be detected, the conclusion may then be drawn that it is either the stop assigned to the rotational blocking and pivotal locking, or the stop assigned to the pivot locking alone. During this movement of the motor, the pulses from the position feedback/rotary encoder are evaluated by the controller. If no more pulses are detected over a predetermined period of time, it is assumed that the motor is located at one of the specified stops. The motor then switches off. Afterwards, however, it is more preferably moved out of the end position again by a few pulses, which correspond to incremental distances (wherein the magnitude of such a distance is also preferably adjustable), in order to assume a safe position that does not lead to overloading, even during a following actuation.", "", "Each caster2may be held on the chassis of movable part1by means of a mounting pin8and may be pivoted in this arrangement position about pivot axis y, which is aligned substantially vertically in normal use.", "", "Each caster2may be designed, for example, according to WO 2013/023917 A1 or WO 2008/055831 A1 (US 2010/0077562 A1) or WO 2012/171814 A1 (US 2014/0109342 A1) the disclosure of which are all herein incorporated by reference.", "", "A locking device6is arranged in caster2(see alsoFIG.3) for the parking brake of wheels2.", "", "In detail, locking device6in the exemplary embodiment shown has an interaction surface7which interacts with a wheel inner surface9in a braking position or in a total locking position.", "", "Furthermore, caster2has an actuating tappet10which may be moved along pivot axis y in order to actuate locking device6. The movement is carried out in the exemplary embodiment in particular by a cam wheel11, which acts on actuating tappet10from above and is preferably accommodated to be rotatable in mounting pin8.", "", "Cam wheel11is provided with switch formations24,24′ and24″ arranged on different axial diameter lines with respect to an axis of rotation z of cam wheel11, for different axial adjustment of actuating tappet10. A first switch formation24is formed directly by the outer wall of cam wheel11, while the other switch formations24′ and24″ are formed by depressions, which start from the outer wall, have different radial dimensions, and are radially aligned with respect to axis of rotation z.", "", "Switch formations24′ and24″ are provided in a position one behind the other when viewed in the circumferential direction of cam wheel11.", "", "Furthermore, cam wheel11is provided with a socket25, in particular a hexagonal socket, through which the geometric axis of rotation centrally penetrates, for rotary actuation of the same about its axis of rotation z.", "", "In further detail, the interaction between locking device6and actuating tappet10in the exemplary embodiment is provided by means of a guide sleeve12.", "", "Locking device6is further biased into its release position by a return spring13.", "", "Return spring13is arranged laterally offset to actuating tappet10.", "", "Furthermore, return spring13is preferably designed as a compression spring, and, as is clear in the exemplary embodiment, is preferably arranged relative to an interaction with a wheel axle14, namely being supported thereon.", "", "Actuating tappet8, which depicts an actuating part, is connected in a rotationally fixed manner to an engagement part15for directional locking. For the directional locking, engagement part15interacts with an upper first counterpart16or a lower second counterpart17in a form-fitting or frictional manner for directional locking. The interaction with lower second counterpart17is provided in the exemplary embodiment in the case of total locking.", "", "Two roller bearings22,23, designed as ball bearings in the depicted exemplary embodiment, are arranged in the area of support housing3. Engagement part15as well as both counterparts16and17in the exemplary embodiment are arranged within the vertical spacing between roller bearings18and19.", "", "Actuating tappet10is provided with a cam part20in the area of its upper end. Cam part20supports a cam44for interaction with one of switching formations24,24′, or24″.", "", "Furthermore, a tappet return spring21acts between cam part20and guide sleeve12. Actuating tappet10is biased into its release position by means of tappet return spring21. The release position relates in this case to locking device6. With regard to the non-rotatable position, it is clear that this spring only biases towards second counterpart17into the release position. Concerning first counterpart16, however, it is biased into the locking position.", "", "Engagement part15may have toothed formations (not shown in detail) on the upper side for interacting with counter formations22fixed to the housing in the state of the directional locking of caster2.", "", "Interaction surface7, which, in the state of a rotational blocking of wheel4, interacts frictionally with wheel inner surface9, which preferably consists of a rubber or elastomer material, is provided with tooth formations23, comparable to the underside of engagement part15, which are formed extending in the direction of wheel axle14.", "", "With respect to a usual direction of travel r of movable part1in the depicted exemplary embodiment, there are two front casters2and two rear casters2when viewed in the direction of travel r, wherein cam wheels11of casters2of a caster pair may be connected to one another via an actuating shaft26. For this purpose, actuating shaft26has a hexagonal cross-section, at least in the area interacting in a form-fitting manner with respective socket25. Actuating shaft26is preferably accommodated in the chassis of movable part1, which consists more preferably of hollow profiles.", "", "The pivot positions of cam parts20of the caster pairs are synchronized via actuating shaft26.", "", "Each actuating shaft26may be part of a shift linkage27, which may additionally include a push rod28, which may extend in a crossbeam29of the chassis that extends in the usual direction of travel r. A movement connection of the two actuating shafts26, provided, where appropriate, is enabled via this push rod28. For this purpose, push rod28engages in each end in an articulated manner on a lever arm45of actuating shaft26(seeFIG.8). All four casters2may be switched simultaneously and in a synchronized manner via such a shift linkage27.", "", "The switching of casters2is preferably carried out by an electric motor. An electric motor30is provided for this purpose, which preferably acts indirectly on respective cam wheel11via a high reduction transmission31via actuating shaft26or shift linkage27.", "", "Reference is made, for example, to WO 02/055322 A1, mentioned at the outset, with regard to the arrangement and configuration of aforementioned electric motor30.", "", "An accumulator32may serve as the on-board power source for movable part1, which accumulator may be arranged, for example, on the chassis of movable part1, for example, farther in the area of crossbeam29.", "", "If the power source fails, for example due to exhausting the charge of accumulator32, the usual functions of casters2(assuming the total locking, assuming the running direction locking, and assuming the free running and pivoting position) may still be carried out. For this purpose, optionally, after deliberately releasing an otherwise effective locking mechanism, electric motor30, which is radially aligned and exposed to actuating shaft26, may be used as a handle in order to manually carry out a rotary actuation of actuating shaft26and thus a rotary actuation of cam parts20, subjected as a whole to rotational pressure via the actuating shaft26and, optionally, shift linkage27(see dash-dotted line depictions inFIG.7). Reference is also made to the aforementioned WO 02/055322 A1, for example, with regard to this emergency actuation.", "", "Aforementioned controller5may be accommodated in a housing34arranged in an easily accessible way, for example, in a handling area33of the movable part1. The power supply for the controller, as well as for other electronic components, is provided by accumulator32.", "", "Controller5may be intentionally actuated by an operator as a result of a triggering event, for which purpose the system as a whole may be kept, in principle, in a standby mode.", "", "The triggering event, for example a switch actuation by the operator, may, as is also preferred, be preceded by a safety check. Such a safety check may be carried out simultaneously, where appropriate, using a sensor35, for example, provided on housing34. With regard to sensor35, this may be a fingerprint sensor, for example; alternatively, however, it may also be a face or iris scanner, for example. In the comparison with stored data, for example in a database, a release of controller5is enabled after a successful security check. Such a check may also directly be the triggering event, so that controller5may be activated simultaneously with a successful check.", "", "Alternatively to such a sensor35, a transponder may also be provided, for example also arranged on the housing34. As another alternative, an authorized release may be carried out, for example, by entering a code.", "", "After an appropriate activation, controller5monitors a displacement of movable part1via control electronics36. For this purpose, movable part1is provided with a movement sensor37. This may be arranged on the chassis side; however, it may also be accommodated in housing34. Movement sensor37does not merely register a displacement of movable part1, instead it also registers the selected direction of travel.", "", "The values recorded via movement sensor37are evaluated using control electronics36. If the same or approximately the same movement values are recorded and evaluated via movement sensor37within a predetermined period of time of a few seconds, for example 3 to 5 seconds, where appropriate, also within longer periods of time of up to 20 or 30 seconds or more, controller5effects a change of the switching state to the electric motor drive, provided that the current switching state does not already correspond to the switching state that is to be preferably assumed based on the evaluation.", "", "Before triggering the control sequence, the third switching state (S3inFIGS.3and4and depiction inFIG.4) is preferably present, in which one or more or, as preferred in the exemplary embodiment, all casters2are locked against both pivoting and also rotation. A total locking prevails.", "", "When the control sequence is triggered, for example by switch actuation and/or by proof of an authorization, for example by means of a sensor35, a signal is automatically transmitted via control electronics36, which causes electric motor30to actuate actuating shaft26, if necessary entire shift linkage27, in such a way that, via cam parts20, respective switching formation24′ comes into operation with cam part20of actuating tappet10such that both engagement part15and locking device6of caster2lose their positive-locking and/or frictional position on support housing3or on wheel4. Caster2may then be pivoted freely about pivot axis y, with wheel4freely rotating about axis of rotation x.", "", "Correspondingly, in this first switching state (S1inFIGS.3and4and depiction inFIG.5), movable part1may be moved freely immediately after triggering the control sequence. This state is further monitored by controller5, based on the evaluation of the values detected by motion sensor37.", "", "If no movement is detected by movement sensor37within a predetermined period of time, the third switching state (total locking) may be immediately brought about again via controller5.", "", "If, in contrast, (only) a straight-line travel of the movable part1is detected in a predetermined period of time, controller5then automatically initiates the corresponding activation of electric motor30in order to displace respective cam part20, via this activation and via shift linkage27, in such a way about axis of rotation z that switching formation24″ now comes into effect. In this cam part position, the second switching state is assumed (S2inFIGS.3and4and depiction inFIG.6), in which wheel4may continue to rotate freely about its axis of rotation x; however, pivoting about vertical pivot axis y is prevented. Caster2in this switching position functions as a type of fixed caster, which supports straight-line travel in an advantageous way.", "", "The movement monitoring is continuous. Correspondingly, if, in an assumed second switching state S2, a stopping of movable part1is also detected over a predetermined period of time and evaluated as such, this may preferably result, in the automatic control sequence, in a switch back from second switching state S2into first switching state S1with a freely movable caster2.", "", "If, after a predetermined period of time has elapsed, no movement of movable part1is detected, a switch into third switching state S3takes place automatically, which means that one or all of casters2are located in the total locking position. Starting from this third switching state S3, a restart of the control sequence may preferably be carried out only after renewed, intentional activation by the operator. More preferably, such a renewed activation may only be necessary after a predetermined period of time has elapsed.", "", "In a further embodiment, first switching state S1may be reached directly from the second switching state S2(directional locking position), for example, by actuating a switch, bypassing the expiration of the predetermined period of time, for example, in order to maneuver movable part1after a straight-line travel without waiting for the predetermined period of time to pass in an idle position of movable part1.", "", "FIGS.9to11show a second embodiment of a movable part1, in which, where appropriate, only wheel4of respective caster2may be effected via the controller5and electric motor30. Thus, with respect to casters2, where appropriate, only two switching states may be assumed, namely a switching state in which wheel4is freely rotatable about axis of rotation x, and a switching state in which wheel4is rotationally blocked. Independently of this, respective caster2may preferably rotate freely about vertical pivot axis y in each switching position. Alternatively, and also according to the first embodiment, one or more casters2may also assume a total locking position.", "", "Moreover, movable part1of this second embodiment has a fifth caster as an additional caster38. Its running wheel39has only one predetermined running direction, namely a running direction aligned in the usual direction of travel r.", "", "Additional caster38may be movable between a raised position inFIG.10and a lowered position inFIG.11, such that correspondingly, additional caster38is lowered to floor40, where appropriate, solely to support a straight-line travel according to switching state S2of the first embodiment.", "", "Preferably, as also depicted, an arrangement of additional caster38is assigned to the rear area of movable part1in direction of travel r, corresponding to a central vertical plane of movable part1, opposite direction of travel r, spaced apart in the direction of handling area33.", "", "Such an additional caster is known, for example, from WO 2007/093549 A1 (US 2010/0181122 A1) or also from WO 2012/110283 A1 (US 2013/0299252 A1), the disclosures of which are all herein incorporated by reference.", "", "Additional caster38is provided with a separate electric motor, which preferably acts on an eccentric41via a transmission. When the electric motor is activated and eccentric41is rotated as a result, running wheel39accommodated in a housing42, preferably together with housing42, is pivotally displaced about a fixed pivot axis43until it is displaced into a lowered position touching floor40or into a preferably stop-delimited, raised position.", "", "Housing42of additional caster38may be fastened to the chassis of movable part1on the underside of crossbeam29, for example, via a mounting plate46, and may also be fastened with screws, for example.", "", "Furthermore, a compression spring47may be provided, which is supported on housing42or on mounting plate46at one end and acts against a frame carrying running wheel39at the other end. The arrangement of compression spring47may, as is also preferred, be selected so that it supports the respective position of running wheel39, both in the raised position and in the lowered position, in that compression spring47presses the frame supporting running wheel39into the raised position or—in the lowered position—presses running wheel39on ground40via the frame.", "", "In addition, an actuating lever48may be a component of additional caster38, via which a raising of running wheel39may achieved manually, where appropriate, for example if the electric motor drive fails.", "", "In a further embodiment, running wheel39of additional caster38may be driven by an electric motor, so that in the lowered position a movement of movable part1is supported. For this purpose, additional caster38may have a separate electric motor.", "", "To achieve second switching state S2, additional caster38is brought into the lowered position."], "claims": ["1 - 16 . (canceled)", "17 . A system comprising two or more casters and a controller, wherein the casters ( 2 ) are attached to a movable part ( 1 ) such as a hospital bed, wherein the two or more casters ( 2 ) are switchable by the controller by means of a switching device ( 36 ) for switching the casters ( 2 ) between a state in which one or more of the casters ( 2 ) is pivot locked and a wheel ( 4 ) of the caster ( 2 ) is rotationally blocked and a state in which there is neither a pivot locking nor a rotational blocking, wherein furthermore one of the casters ( 2 ) is additionally switchable into a state in which the one caster ( 2 ) is only pivot locked, wherein the switchable casters ( 2 ) are configured to be actuated electrically and also manually in the event of a failure of an electric drive or a plurality of such electric drives or in the event of a failure of an electrical supply, in order to be able to carry out an emergency switching actuation of one or more or all casters ( 2 ), and the movable part ( 1 ) has a movement sensor ( 37 ), wherein the system is configured such that starting from a state in which the switchable casters ( 2 ) are pivot locked and rotationally blocked, following a triggering event, multiple switching states may be automatically and sequentially assumed in a predetermined sequence by the switchable casters ( 2 ), wherein a first switching state (S 1 ) transfers all casters ( 2 ) into the state in which there is neither a pivot locking nor a rotational blocking, which a second switching state (S 2 ) may automatically follow, in which one or more or all casters ( 2 ) are pivot locked, however their wheels ( 4 ) are not rotationally blocked, and finally a switching state (S 3 ) follows, after the expiration of a predetermined period of time and an absence of a detection of a movement of the movable part ( 1 ), in which all switchable casters ( 2 ) are again transferred into the state in which they are pivot locked and rotationally blocked, and wherein the triggering event is a switch actuation by an operator.", "18 . A system comprising two or more casters and a controller, wherein the casters ( 2 ) are attached to a movable part ( 1 ) such as a hospital bed, wherein the two or more casters ( 2 ) are switchable by the controller by means of a switching device ( 36 ) for switching the casters ( 2 ) between a state in which one or more of the casters ( 2 ) is pivot locked and a wheel ( 4 ) of the caster ( 2 ) is rotationally blocked and a state in which there is neither a pivot locking nor a rotational blocking, wherein furthermore one of the casters ( 2 ) is additionally switchable into a state in which the caster ( 2 ) is only pivot locked, wherein the switchable casters ( 2 ) are configured to be actuated electrically and also manually in the event of a failure of an electric drive or a plurality of such electric drives or in the event of a failure of an electrical supply, in order to be able to carry out an emergency switching actuation of one or more or all casters ( 2 ), and the movable part ( 1 ) has a movement sensor ( 37 ), wherein the system is configured such that starting from a state in which the switchable casters ( 2 ) are pivot locked and rotationally blocked, following a triggering event, multiple switching states may be automatically and sequentially assumed in a predetermined sequence by the switchable casters ( 2 ), wherein a first switching state (S 1 ) transfers all casters ( 2 ) into the state in which there is neither a pivot locking nor a rotational blocking, which a second switching state (S 2 ) may automatically follow, in which one or more or all casters ( 2 ) are pivot locked, however their wheels ( 4 ) are not rotationally blocked, and finally a switching state (S 3 ) follows, after the expiration of a predetermined period of time and an absence of a detection of a movement of the movable part ( 1 ), in which all switchable casters ( 2 ) are again transferred into the state in which they are pivot locked and rotationally blocked, and wherein the triggering event is a switch actuation by an operator and wherein the triggering event is only effective after a security check.", "19 . The system according to claim 17 , wherein the triggering event is only effective after a security check.", "20 . The system according to claim 18 , wherein the security check can be carried out by means of a finger sensor ( 35 ) and/or a transponder and/or by entering a code.", "21 . The system according to claim 17 , wherein the switchable casters ( 2 ) are configured to be switched via a shift linkage ( 27 ).", "22 . The system according to claim 17 , wherein after a successful triggering of the sequence and given that one or more casters ( 2 ) is/are directionally locked, the directional lock can be released again by repeating the triggering event or by a separate actuation including a separate switch actuation, whereupon all casters ( 2 ) are in the release position.", "23 . The system according to claim 22 , wherein the repetition of the triggering event is effective during the automatic sequence of the switching states without a safety check.", "24 . The system according to claim 17 , wherein the predetermined sequence includes a predetermined time period between the respective switching states.", "25 . The system according to claim 17 , wherein the two or more casters comprises at least three casters, and further comprising a fourth or fifth caster forming an an additional caster ( 38 ) which has only one predetermined running direction.", "26 . The system according to claim 25 , wherein the additional caster ( 38 ) is movable between a lowered and a raised position.", "27 . The system, according to claim 25 , wherein the additional caster ( 38 ) is drivable.", "actuating a switch by which a previously determined sequence of different switching states (S", "29 . A system comprising two or more casters and a controller, wherein the casters ( 2 ) are attached to a movable part ( 1 ) such as a hospital bed, wherein the two or more of casters ( 2 ) are switchable by the controller by means of a switching device ( 36 ) for switching the casters ( 2 ) between a state in which the caster ( 2 ) is pivot locked and a wheel ( 4 ) of the caster ( 2 ) is rotationally blocked and a state in which there is neither a pivot locking nor a rotational blocking, wherein furthermore one of the casters ( 2 ) is additionally switchable into a state in which the one caster ( 2 ) is only pivot locked, wherein the switchable casters ( 2 ) can be actuated electrically and also manually in the event of a failure of an electric drive or a plurality of such electric drives or in the event of a failure of an electrical supply, in order to be able to carry out an emergency switching actuation of one or more or all casters ( 2 ), and the movable part ( 1 ) has a movement sensor ( 37 ), wherein, the system is configured such that with respect to a desired movement of the movable part ( 1 ) using the casters ( 2 ) on the movable part ( 1 ), a triggering event is enacted by actuating a switch by which means a previously determined sequence of different switching states (S 1 , S 2 , S 3 ) of the casters ( 2 ) is triggered, wherein all casters ( 2 ) are initially transferred into a release position, which an automatic pivot locking of one or more or all casters ( 2 ) can follow, and finally, after an absence of a detection of a movement of the movable part, all casters ( 2 ), which are switchable between a rotational blocking and pivot locking and a release position, are switched into the rotational blocking and pivot locking, and wherein the triggering event is only effective after a security check.", "30 . The method according to claim 28 , wherein the triggering event is only effective after a security check.", "31 . The method according to claim 28 , wherein the switchable casters ( 2 ) are switched via a shift linkage ( 27 ).", "32 . The method according to claim 28 , wherein after a successful triggering of the sequence and given that one or more casters ( 2 ) is/are directionally locked, the directional lock is released by repeating the triggering event or by a separate actuation including a separate switch actuation, whereupon all casters ( 2 ) are in the release position."], "bibtex": "@patent{20240198727,\n    title = {CONTROLLER AND METHOD FOR CONTROLLING CASTERS ATTACHED TO A MOVABLE PART},\n    number = {20240198727},\n    year = {2024},\n    note = {File: US20240198727A1-20240620.XML}\n    }", "classification": "B60B3302FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240198728", "filename": "US20240198728A1-20240620.XML", "abstract": "A pneumatic tire includes undertread layer made of a rubber composition obtained by blending, per 100 parts by mass of diene rubber, 15 parts by mass to 45 parts by mass of carbon black having a nitrogen adsorption specific surface area N 2 SA of 20 m 2 /g to 85 m 2 /g and a DBP absorption of 90 mL/100 g to 200 mL/100 g, 3 parts by mass to 30 parts by mass of silica, and a silane coupling agent in an amount of 5 mass % to 15 mass % of the silica. A ratio is calculated based on a hardness Hu of an undertread rubber and an elastic modulus Ec and a hardness Hc of a cap tread rubber, is set to 110 to 140. A proportion iof a thickness G2 of the undertread layer to an under-groove rubber gauge G1, is set to 0.55 or more and 0.80 or less.", "detailed_description": ["Configurations of embodiments of the present disclosure will be described in detail below with reference to the accompanying drawings.", "", "As illustrated inFIG.1, a pneumatic tire according to an embodiment of the present disclosure includes a tread portion1, a pair of sidewall portions2respectively disposed on both sides of the tread portion1, and a pair of bead portions3respectively disposed on an inner side in a tire radial direction of the sidewall portions2. Note that “CL” inFIG.1denotes a tire equator. Although not illustrated inFIG.1that is a meridian cross-sectional view, the tread portion1, the sidewall portions2, and the bead portions3each extend in the tire circumferential direction and have an annular shape, forming a basic structure of a toroidal shape of the pneumatic tire. Although the description usingFIG.1is basically based on the illustrated meridian cross-sectional shape, all of the tire components extend in the tire circumferential direction and form the annular shape.", "", "A carcass layer4is mounted between the left-right pair of bead portions3. The carcass layer4includes a plurality of reinforcing cords extending in the tire radial direction and is folded back around a bead core5disposed in each of the bead portions3from a vehicle inner side to a vehicle outer side. Additionally, a bead filler6is disposed on the outer periphery of the bead core5, and the bead filler6is enveloped by a body portion and a folded back portion of the carcass layer4.", "", "A plurality of belt layers7(four layers inFIG.1) are embedded on an outer circumferential side of the carcass layer4in the tread portion1. Each belt layer7includes a plurality of reinforcing cords (steel cords) oriented in a predetermined direction. A cross belt pair is always included in the plurality of belt layers7. The cross belt pair is a combination of at least two belt layers configured such that the inclination angle of the reinforcing cords with respect to the tire circumferential direction is set in the range of 10° to 40°, and the inclination directions of the reinforcing cords are reversed between the layers so that the reinforcing cords intersect with each other. In addition to the cross belt pair, a large-angle belt layer in which the inclination angle of the reinforcing cord with respect to the tire circumferential direction is set in the range of 40° to 70°, a protective belt layer disposed in the outermost layer and having a width of 85% or less of that of the other belt layers, and a circumferential reinforcing layer in which the angle of the reinforcing cord with respect to the tire circumferential direction is set in the range of 0° to 5° can be optionally provided. For example, inFIG.1, one protective belt layer is disposed on the outermost layer, one large-angle belt layer is disposed on the innermost layer, and the other two layers are the cross belt pair. In addition, a belt reinforcing layer (not illustrated) can be provided on the outer circumferential side of the belt layers7. The belt reinforcing layer can be configured of, for example, an organic fiber cord oriented in the tire circumferential direction. The angle of the organic fiber cords constituting a belt reinforcing layer8with respect to the tire circumferential direction can be set to, for example, from 0° to 5°.", "", "In the following description, these belt layers7and the belt reinforcing layer8can be collectively referred to as a reinforcing layer. In an embodiment of the present disclosure, as the reinforcing layer, only the belt layers7can be provided, or both of the belt layers7and the belt reinforcing layer8can be provided. In the following description, “outer circumferential side of the reinforcing layer” means an outer circumferential side of a belt layer7(an outermost layer of the plurality of belt layers7in the tire radial direction) in a case where only the belt layers7are provided, or means an outer circumferential side of a belt reinforcing layer8(an outermost layer of a plurality of belt reinforcing layers8in the tire radial direction) in a case where the belt layers7and the belt reinforcing layers8are provided.", "", "In the tread portion1, a tread rubber layer10is disposed on the outer circumferential side of the carcass layer4and the reinforcing layer (the belt layers7and the belt reinforcing layers8) described above. In an embodiment of the present disclosure, the tread rubber layer10has a structure in which two types of rubber layers having different physical properties (a cap tread layer11and an undertread layer12) are layered in the tire radial direction. The cap tread layer11is disposed on outer circumferential side of the undertread layer12and constitutes a road contact surface of the tread portion1. The undertread layer12is sandwiched between the cap tread layer11and the reinforcing layer described above. A side rubber layer20is disposed on the outer circumferential side (the outer side in the tire width direction) of the carcass layer4in the sidewall portion2, and a rim cushion rubber layer30is disposed on the outer circumferential side (the outer side in the tire width direction) of the carcass layer4in the bead portion3.", "", "Any number of grooves40can be formed in an outer surface of the tread portion1. The grooves40refer to circumferential grooves extending in the tire circumferential direction and lug grooves extending in the tire width direction. SinceFIG.1is a meridian cross-sectional view, only the circumferential grooves are illustrated as the grooves40, and the lug grooves are not illustrated. Various types of land portions50can be formed in the tread portion1by the grooves40. The land portions50includes, for example, a rib-like land portion50extending along the tire circumferential direction, and a block-shaped land portion50whose circumference is defined by the grooves40. As illustrated inFIG.1, in an entire region including a region under the grooves40and a region under the land portions50, the tread rubber layer10has a structure in which the cap tread layer11and the undertread layer12are layered in the tire radial direction.", "", "An embodiment of the present disclosure relates to the tread portion1, and thus other portions and constituent members are not limited to the structure described above. Note that, in the following description, a rubber composition constituting the cap tread layer11can be referred to as a cap tread rubber, and a rubber composition constituting the undertread layer12can be referred to as an undertread rubber.", "", "In the rubber composition constituting the undertread layer12, the rubber component is a diene rubber. As the diene rubber, a natural rubber is necessarily used, and a butadiene rubber can be optionally used in combination.", "", "As the natural rubber used in the undertread rubber, a rubber that is generally used in rubber compositions for tires can be used. Durability can be further enhanced by blending the natural rubber. The content of the natural rubber is preferably 80 mass % to 100 mass %, more preferably 100 mass %, in 100 mass % of the diene rubber. When the content of the natural rubber is less than 80 mass %, durability cannot be sufficiently improved.", "", "As the butadiene rubber used in the undertread rubber, a rubber that is generally used in rubber compositions for tires, such as unmodified butadiene rubber and modified butadiene rubber, can be used. Low rolling resistance can be further enhanced by blending the butadiene rubber. However, in consideration of use as the undertread rubber, the blended amount of the butadiene rubber is preferably small. The content of the butadiene rubber is preferably 20 mass % to 0 mass %, more preferably 0 mass %, in 100 mass % of the diene rubber. When the content of the butadiene rubber is greater than 20 mass %, low rolling resistance cannot be sufficiently improved. In addition, since the content of the natural rubber decreases with an increase in the content of the butadiene rubber, it is difficult to secure durability.", "", "Silica and carbon black are necessarily blended in the undertread rubber. By blending carbon black and silica, heat build-up of the rubber composition can be made small, and tire durability can be improved by improving mechanical properties such as rubber hardness, tensile strength at break, and tensile elongation at break. Particularly, in the undertread rubber, by using relatively high-structured carbon black having a large particle size to be described later, it is possible to maintain good mechanical properties such as rubber hardness, tensile strength at break, and tensile elongation at break while reducing tan δ (60° C.) of the rubber composition. As the silica, a silica that is typically used in rubber compositions for tires can be blended, and, for example, wet silica, dry silica, and surface-treated silica can be used.", "", "The carbon black used in the undertread rubber has a nitrogen adsorption specific surface area N2SA of from 20 m2/g to 85 m2/g, preferably from 30 m2/g to 85 m2/g, and more preferably from 30 m2/g to 75 m2/g. When the N2SA is less than 20 m2/g, mechanical properties such as rubber hardness, tensile strength at break, and wear resistance of the rubber composition are deteriorated. When the N2SA exceeds 85 m2/g, tan δ (60° C.) is increased and heat build-up is deteriorated.", "", "The DBP absorption of the carbon black used in the undertread rubber is from 90 mL/100 g to 200 mL/100 g, preferably from 105 mL/100 g to 200 mL/100 g, and more preferably from 105 mL/100 g to 160 mL/100 g. When the DBP absorption is less than 90 mL/100 g, the reinforcing performance of the carbon black cannot be sufficiently obtained, and tire durability is decreased. When the DBP absorption exceeds 200 mL/100 g, forming processability of the rubber composition is decreased, and mechanical properties such as tensile strength at break and tensile elongation at break are decreased, leading to deterioration of tire durability. Further, the viscosity of the rubber composition is increased and processability is deteriorated.", "", "The blended amount of the carbon black is from 15 parts by mass to 45 parts by mass, preferably from 20 parts by mass to 40 parts by mass, and more preferably from 30 parts by mass to 40 parts by mass, per 100 parts by mass of the diene rubber described above. When the blended amount of the carbon black is less than 15 parts by mass, reinforcing performance for the rubber composition cannot be sufficiently obtained, and rubber hardness and tensile strength at break become insufficient. When the blended amount of the carbon black exceeds 45 parts by mass, heat build-up of the rubber composition is increased and tensile elongation at break is decreased.", "", "The blended amount of the silica is from 3 parts by mass to 30 parts by mass, preferably from 5 parts by mass to 25 parts by mass, and more preferably from 7 parts by mass to 23 parts by mass, per 100 parts by mass of the above-described diene rubber. By setting the blended amount of the silica within such a range, low rolling resistance and durability can be achieved in a compatible manner when a tire is produced. When the blended amount of the silica is less than 3 parts by mass, heat build-up is increased and rolling resistance cannot be sufficiently decreased when a tire is produced. Further, tensile strength at break of the rubber composition is decreased. When the blended amount of the silica exceeds 30 parts by mass, tensile strength at break is decreased and durability is decreased when a tire is produced.", "", "The sum of the blended amounts of the silica and the carbon black is preferably from 20 parts by mass to 75 parts by mass, and more preferably from 25 parts by mass to 70 parts by mass, per 100 parts by mass of the above-described diene rubber. By setting the total amount of the silica and the carbon black within such a range, the low rolling resistance and the durability of the rubber composition can be balanced at higher levels. When the total amount of the silica and the carbon black is less than 20 parts by mass, tire durability cannot be ensured. When the total amount of the silica and the carbon black exceeds 75 parts by mass, heat build-up is increased and rolling resistance is deteriorated.", "", "In the undertread rubber, a silane coupling agent is necessarily blended together with the silica. Accordingly, the dispersibility of the silica is improved, and the reinforcing property for the rubber component can be further enhanced. The blended amount of the silane coupling agent is from 5 mass % to 15 mass %, and preferably from 7 mass % to 13 mass %, relative to the amount of the silica. When the blended amount of the silane coupling agent is less than 5 mass % of the silica weight, the effect of improving the dispersibility of the silica cannot be sufficiently obtained. Furthermore, when the blended amount of the silane coupling agent exceeds 15 mass %, the silane coupling agent itself condenses, and the desired effects cannot be obtained.", "", "The silane coupling agent is not particularly limited, but a sulfur-containing silane coupling agent is preferably used. Examples of the sulfur-containing silane coupling agent include bis-(3-triethoxysilylpropyl)tetrasulfide, bis-(3-triethoxysilylpropyl)disulfide, 3-trimethoxysilylpropyl benzothiazole tetrasulfide, γ-mercaptopropyl triethoxysilane, and 3-octanoylthiopropyl triethoxysilane.", "", "In the pneumatic tire according to an embodiment of the present disclosure, the blending proportion of the rubber composition constituting the cap tread layer11is not particularly limited, a rubber composition typically used for a cap tread of pneumatic tires can be employed.", "", "In an embodiment of the present disclosure, the rubber composition constituting the cap tread layer11and the rubber composition constituting the undertread layer12can contain various additives, such as a vulcanization or crosslinking agent, a vulcanization accelerator, various oils, an anti-aging agent, and a plasticizer, that are typically used for rubber compositions for tires besides the compounding agents described above in a range that does not impair the object of the present disclosure. These additives can be kneaded by a typical method to form a rubber composition to be used for vulcanization or crosslinking. The blended amounts of these additives can be known typical blended amounts without departing from the object of the present disclosure. The rubber composition for a tire can be produced by mixing each component described above by using a common rubber kneading machine such as a Banbury mixer, a kneader, and a roll.", "", "In the tread portion1of the pneumatic tire according to an embodiment of the present disclosure, the cap tread layer11and the undertread layer12are layered, that is, the undertread rubber and the cap tread rubber are used in combination. At this time, when the hardness of the rubber composition constituting the undertread layer12(undertread rubber) is defined as a hardness Hu and the elastic modulus and the hardness of the rubber composition constituting the cap tread layer (cap tread rubber) are defined as an elastic modulus Ec and a hardness Hc, respectively, a ratio α calculated by the following formula (1) using these elastic modulus and hardnesses is set to 110 to 140, preferably 115 to 140, and more preferably 115 to 135. By setting the ratio α within an appropriate range as described above, steering stability can be effectively improved. When the ratio α does not satisfy the formula (1), it is difficult to satisfactorily exhibit steering stability.", "", "α=Hu/(Ec×Hc)×1000   (1)", "", "Note that individual values of the hardness Hu of the undertread rubber and the elastic modulus Ec and the hardness Hc of the cap tread rubber are not particularly limited. However, the hardness Hu of the undertread rubber can be set to, for example, 55 to 70, the elastic modulus Ec of the cap tread rubber can be set to, for example, 5.0 MPa to 15.0 MPa, and the hardness Hc of the cap tread rubber can be set to, for example, 55 to 75. Further, when the elastic modulus of the undertread rubber is set as an elastic modulus Eu, the elastic modulus Eu can be set to, for example, 2.0 MPa to 10.0 MPa although not involved in the above-described formula (1). Similarly to the elastic modulus Ec, the elastic modulus Eu is a value measured in accordance with JIS-K6394 by using a viscoelastic spectrometer under conditions of a frequency of 20 Hz, an initial strain of 10%, a dynamic distortion of ±2%, and a temperature of 20° C.", "", "As described above, the grooves40are formed in the tread portion1of the pneumatic tire according to an embodiment of the present disclosure. When the sum of the thicknesses of the cap tread layer11and the undertread layer12in a region under the grooves40formed in an outer surface of the tread portion1as illustrated inFIG.2is defined as G1and the thickness of the undertread layer12in the region under the grooves40formed in the outer surface of the tread portion1is defined as G2, a proportion G2/G1is set to 0.55 or more and 0.80 or less, preferably 0.63 or more and 0.80 or less, more preferably 0.66 or more and 0.78 or less. By defining the relationship between the rubber thicknesses (proportion G2/G1) in this way, it is possible to reduce heat build-up while improving durability. When the proportion G2/G1is less than 0.55, the amount of the undertread rubber becomes insufficient, and thus the effect of reducing rolling resistance by the undertread rubber that has the above-described blending proportion and thus has a low heat build-up property cannot be sufficiently expected. When the proportion G2/G1exceeds 0.80, the undertread layer12becomes too thick and it becomes difficult to obtain sufficient durability.", "", "Further, regarding the thickness of the undertread layer12, when the thickness of the undertread layer12in a region under the land portion50formed in the outer surface of the tread portion1as illustrated inFIG.2is defined as G3, a proportion G3/G1is preferably 0.45 or more and 0.95 or less, and more preferably 0.50 or more and 0.90 or less. By defining the relationship between the rubber thicknesses (proportion G3/G1) in this way, it is advantageous to reduce heat build-up while improving durability. When the proportion G3/G1is less than 0.45, the amount of the undertread rubber becomes insufficient, and thus the effect of reducing rolling resistance by the undertread rubber that has the above-described blending proportion and thus has a low heat build-up property cannot be sufficiently expected. When the proportion G3/G1exceeds 0.95, the undertread layer12becomes too thick, making it difficult to obtain sufficient durability.", "", "Note that, as illustrated inFIG.2, the above-described G1is a distance measured from an outer surface of a reinforcing layer located on an outermost circumferential side among the reinforcing layers (the belt layers7or the belt reinforcing layers8) provided in the tire to a groove bottom of the groove40formed in the tread portion1along a perpendicular line to the outer surface of the reinforcing layer described above. The above-described G2is a distance measured from the outer surface of the reinforcing layer located on the outermost circumferential side among the reinforcing layers (the belt layers7or the belt reinforcing layers8) provided in the tire to a boundary between the cap tread layer11and the undertread layer12along the perpendicular line to the outer surface of the reinforcing layer at the same location as the above-described G1. The above-described G3is a distance (maximum value) measured from the outer surface of the reinforcing layer located on the outermost circumferential side among the reinforcing layers (the belt layers7or the belt reinforcing layers8) provided in the tire to a boundary between the cap tread layer11and the undertread layer12along a perpendicular line to the outer surface of the reinforcing layer in a region under the land portion50formed in the tread portion1. G1, G2, and G3are not particularly limited as long as the above-described relationships are satisfied, and G1can be set to, for example, 1.0 mm to 10.0 mm, G2can be set to, for example, 1.0 mm to 10.0 mm, and G3can be set to, for example, 1.0 mm to 10.0 mm.", "", "In the pneumatic tire according to an embodiment of the present disclosure, the undertread layer12is made of the rubber composition having the above-described blending proportion, and the ratio α calculated by the above-described formula (1) and the above-described proportion G2/G1and the like are set within appropriate ranges. Accordingly, by a combination of the above, it is possible to provide excellent durability, steering stability, and low rolling resistance in a well-balanced and a highly compatible manner.", "", "An embodiment of the present disclosure will further be described below by way of Examples, but the scope of an embodiment of the present disclosure is not limited to these Examples."], "claims": ["a tread portion extending in a tire circumferential direction and having an annular shape; a pair of sidewall portions respectively disposed on both sides of the tread portion: and a pair of bead portions each disposed on an inner side of the pair of the sidewall portions in a tire radial direction, the tread portion comprising two layers of a cap tread layer constituting a road contact surface of the tread portion and an undertread layer disposed on an inner side of the cap tread layer in the tire radial direction, the undertread layer being made of a rubber composition obtained by blending, per 100 parts by mass of diene rubber, 15 parts by mass to 45 parts by mass of carbon black having a nitrogen adsorption specific surface area N a ratio α being 110 to 140, the a ratio α being calculated by formula (1) based on a hardness Hu of the rubber composition constituting the undertread layer and an elastic modulus Ec and a hardness Hc of a rubber composition constituting the cap tread layer, and a proportion G", "2 . The pneumatic tire according to claim 1 , wherein the diene rubber is composed of 80 mass % to 100 mass % of a natural rubber and 20 mass % to 0 mass % of a butadiene rubber.", "3 . The pneumatic tire according to claim 2 , wherein the diene rubber is made of only a natural rubber."], "bibtex": "@patent{20240198728,\n    title = {PNEUMATIC TIRE},\n    number = {20240198728},\n    year = {2024},\n    note = {File: US20240198728A1-20240620.XML}\n    }", "classification": "B60C100FI"}, {"title": "TIRE", "doc_number": "20240198729", "filename": "US20240198729A1-20240620.XML", "abstract": "A tire includes a tread portion, a pair of bead cores, a carcass layer extended across the bead cores, and a belt layer disposed on an outer side of the carcass layer in a radial direction. A tire outer diameter OD (mm) is in a range 200≤OD≤660. A total tire width SW (mm) is in a range 100≤SW≤400. A tire internal volume V (m{circumflex over ( )}3) is in a range 4.0≤(V/OD)×10{circumflex over ( )}6≤60 with respect to the tire outer diameter OD (mm).", "detailed_description": ["Embodiments of the technology will be described in detail below with reference to the drawings. Note that the technology is not limited to the embodiments. Additionally, constituents of the embodiments include constituents that are substitutable and are obviously substitutes while maintaining consistency with the embodiments of the technology. Additionally, a plurality of modified examples described in the embodiments can be combined in a discretionary manner within the scope apparent to one skilled in the art."], "claims": ["1 - 7 . (canceled)", "a tread portion; a pair of bead cores; a carcass layer extended across the bead cores; and a belt layer disposed on an outer side of the carcass layer in a radial direction, a tire outer diameter OD (mm) being in a range 200≤OD≤660, a total tire width SW (mm) being in a range 100≤SW≤400, and a tire internal volume V (m{circumflex over ( )}3) being in a range 4.0≤(V/OD)×10{circumflex over ( )}6≤60 with respect to the tire outer diameter OD (mm).", "a total tensile strength TTcs (N/50 mm) of the carcass layer is in a range 300≤TTcs/OD≤3500 with respect to the tire outer diameter OD (mm).", "when, in a cross-sectional view in a tire meridian direction, a periphery length of a tire side portion as a length along a tire inner surface between an intersection point and an innermost end portion of a bead portion comprising the bead cores in a tire radial direction is defined as Ps (mm), and the intersection point is between a perpendicular line drawn from an end portion of the belt layer in a tire width direction to the carcass layer and the tire inner surface, a minimum thickness of the tire side portion is defined as Gs (mm), and a height in the tire radial direction from a measurement point of a rim diameter in the bead portion to which a rim is fitted to an end portion of a turned-up portion turned up to an outer side in the tire width direction of the bead core in the carcass layer is defined as Hcs (mm), the periphery length Ps of the tire side portion satisfies {(Gs×√Hcs)/2.0}≤Ps≤{(Gs×ρHcs)/0.06}.", "a relationship between the minimum thickness Gs of the tire side portion and the tire outer diameter OD satisfies (70/√OD)≤Gs≤(450/√OD).", "when, in a cross-sectional view in a tire meridian direction, a periphery length of the tread portion as a length along a tire inner surface between respective intersection points between perpendicular lines drawn from respective end portions on both sides of the belt layer in a tire width direction to the carcass layer and the tire inner surface is defined as Pt (mm), a minimum thickness of the tread portion is defined as Gt (mm), and a minimum number of layers of the belt layer is defined as L (sheet), the periphery length Pt of the tread portion satisfies {(Gt×L)/1.0}≤Pt≤{(Gt×L)/0.11}.", "a relationship between the minimum thickness Gt of the tread portion and the total tire width SW satisfies {22/(SW){circumflex over ( )}(1/4)}≤Gt≤{130/(SW){circumflex over ( )}(1/4)}.", "when a diameter at a tire maximum width position is defined as SWD (mm), and an internal pressure is defined as P (kPa), a total tensile strength TTcs (N/50 mm) of the carcass layer satisfies TTcs≥0.02×P×{(OD/2){circumflex over ( )}2−(SWD/2){circumflex over ( )}2}.", "when, in a cross-sectional view in a tire meridian direction, a periphery length of a tire side portion as a length along a tire inner surface between an intersection point and an innermost end portion of a bead portion comprising the bead cores in a tire radial direction is defined as Ps (mm), and the intersection point is between a perpendicular line drawn from an end portion of the belt layer in a tire width direction to the carcass layer and the tire inner surface, a minimum thickness of the tire side portion is defined as Gs (mm), and a height in the tire radial direction from a measurement point of a rim diameter in the bead portion to which a rim is fitted to an end portion of a turned-up portion turned up to an outer side in the tire width direction of the bead core in the carcass layer is defined as Hcs (mm), the periphery length Ps of the tire side portion satisfies {(Gs×√Hcs)/2.0}≤Ps≤{(Gs×√Hcs)/0.06}.", "a relationship between the minimum thickness Gs of the tire side portion and the tire outer diameter OD satisfies (70/VOD)≤Gs≤(450/VOD).", "when, in a cross-sectional view in a tire meridian direction, a periphery length of the tread portion as a length along a tire inner surface between respective intersection points between perpendicular lines drawn from respective end portions on both sides of the belt layer in a tire width direction to the carcass layer and the tire inner surface is defined as Pt (mm), a minimum thickness of the tread portion is defined as Gt (mm), and a minimum number of layers of the belt layer is defined as L (sheet), the periphery length Pt of the tread portion satisfies {(Gt×L)/1.0}≤Pt≤{(Gt×L)/0.11}.", "a relationship between the minimum thickness Gt of the tread portion and the total tire width SW satisfies {22/(SW){circumflex over ( )}(¼)}≤Gt≤{130/(SW){circumflex over ( )}(1/4)}.", "when a diameter at a tire maximum width position is defined as SWD (mm), and an internal pressure is defined as P (kPa), a total tensile strength TTcs (N/50 mm) of the carcass layer satisfies TTcs≥0.02×P×{(OD/2){circumflex over ( )}2−(SWD/2){circumflex over ( )}2}."], "bibtex": "@patent{20240198729,\n    title = {TIRE},\n    number = {20240198729},\n    year = {2024},\n    note = {File: US20240198729A1-20240620.XML}\n    }", "classification": "B60C304FI"}, {"title": "HIGH-PERFORMANCE TYRE", "doc_number": "20240198730", "filename": "US20240198730A1-20240620.XML", "abstract": "A car tyre ( 100 ), in particular a high or ultra high performance car tyre also suitable for use on track, is described; the tread band ( 1 ) of the tyre has a central region (L 1 ), separated from two shoulder regions (L 2 , L 3 ), respectively an outer shoulder region (L 2 ) and inner shoulder region (L 3 ); the outer shoulder region (L 2 ) has a width greater than the width of the inner shoulder region (L 3 ); the outer and inner shoulder regions are provided with relatively large grooves ( 5,6 ); in the outer shoulder region these grooves ( 5 ) alternate with narrower grooves ( 7 ), which reduce the stiffness of this tyre region only to a limited extend; the central region (L 1 ) of the tyre, instead, was designed so as to have a low void-to-rubber ratio of equal to or smaller than 0.09.", "detailed_description": ["With reference to the attached figures, a tyre for car wheels, in particular for wheels of high or ultra high performance cars, also intended for use on track, is generally indicated at100.", "", "The structure of the tyre100is in itself of a conventional type and comprises a carcass, a tread band1placed in crown to the carcass, a pair of axially opposed sidewalls, ending in beads reinforced by bead cores and associated bead fillers. The tyre preferably also comprises a belt structure interposed between the carcass and the tread band. The carcass comprises one or more carcass plies anchored to the bead cores, whereas the belt structure comprises two radially superimposed belt strips. The belt strips are formed of pieces of a rubberized fabric incorporating metal cords parallel to one another in each strip and having a crossed orientation, preferably with a symmetrical inclination relative to the equatorial plane, relative to the cords of adjacent strips. Preferably, the belt structure also comprises, in a radially outer position, a third belt layer provided with cords oriented substantially parallel to the equatorial plane. Preferably, although not necessarily, the tyre according to the invention has a nominal section width of at least about 205, more preferably of at least about 225. For example, the tyre may have a nominal section width of225,245,275,295,355. Preferably, the tyre according to the invention has a reduced section height. For example, the section height may be smaller than, or equal to, 60%, more preferably smaller than, or equal to, 50%, of the nominal section width.", "", "The tread band1has overall a low void-to-rubber ratio, preferably smaller than, or equal to, 0.30, more preferably smaller than, or equal to, 0.26, even more preferably smaller than, or equal to, 0.20.", "", "Preferably, the overall void-to-rubber ratio of the tread1is greater than 0.14.", "", "Preferably, although not necessarily, the tyre according to the invention is of the asymmetrical type, i.e., the tread band pattern of the tyre on the right of the equatorial plane X-X is substantially different from that on the left. Therefore, the tyre100and/or the tread band1has an inner side to be preferably arranged, when fitted, towards the inside of the vehicle (on the right in the examples shown in the figures) and an outer side to be preferably arranged towards the outside of the vehicle (on the left in the examples shown in the figures).", "", "The tread band1is provided with at least two circumferential grooves, respectively a first2and a second3circumferential groove, extending in a substantially circumferential direction.", "", "The first and second circumferential grooves2and3respectively separate a central region L1of the tread band1from an outer shoulder region L2and from an inner shoulder region L3of the tread band1, respectively located to the left and right of the central region L1. The outer shoulder region L2is located on the outer side of the tyre, whereas the inner shoulder region L3is located on the inner side of the tyre.", "", "The central region L1extends across the equatorial X-X plane of the tyre. The outer L2and inner L3shoulder regions extend close to the axial ends of the tread band1.", "", "In the embodiments shown inFIGS.1-5, the central region L1takes up a limited portion of the tread band1.", "", "In these embodiments, the central region L1may have a width smaller than, or equal to, 35% of the effective width of tread band1, i.e., the width of the region of the tread band1intended to contact the ground. The outer shoulder region L2has a width greater than 30% of the effective width of tread band1; the inner shoulder region L3has a width smaller than 35% of the effective width of tread band1.", "", "In the embodiment shown inFIG.6, the central region L1may have a width smaller than, or equal to, 50% of the effective width of the tread band1; the outer shoulder region L2has a width greater than 25% of the effective width of tread band1and the inner shoulder region L3has a width smaller than 25% of the effective width of tread band1.", "", "Preferably, in the tyre100of the invention the outer shoulder region L2has a width greater than the width of the inner shoulder region L3.", "", "The first circumferential groove2delimits in axial direction the outer shoulder region L2relative to the central region L1of the tread band1, whereas the second circumferential groove3delimits in axial direction the inner shoulder region L3relative to the central region L1.", "", "Preferably, the first2and second3circumferential grooves have a substantially straight course in the circumferential direction, preferably along the whole circumferential development of the tyre.", "", "The first circumferential groove2may have a different width as compared to the second circumferential groove3.", "", "In the embodiments shown inFIGS.1-4and6the first circumferential groove2has a width smaller than the width of the second circumferential groove3. For example, in these embodiments the first circumferential groove2may have a width smaller than 50% of the width of the second circumferential groove3.", "", "In these cases, the first circumferential groove2is mainly intended to provide a substantial continuity in behavior between the outer shoulder region L2and the outermost portion of the central region L1, the function of draining water from the footprint area being thus assigned mainly to the other circumferential grooves, described below.", "", "In the embodiments shown inFIGS.1-4and6, the first circumferential groove2may, for example, have a width smaller than, or equal to, about 8 mm, more preferably smaller than, or equal to, about 6 mm, in any case greater than, or equal to, about 2 mm.", "", "In the embodiment shown inFIG.5the first circumferential groove2has a width comparable to, or slightly greater than, the width of the second circumferential groove3. For example, in these embodiments the first circumferential groove2may have a width at most about 20% greater than the width of the second circumferential groove3. Preferably, in the embodiments shown inFIGS.1-6the second circumferential groove3may have a width greater than, or equal to, about 8 mm, more preferably greater than, or equal to, about 10 mm, in any case smaller than, or equal to, about 15 mm.", "", "Preferably, the first and second circumferential grooves2and3may have a depth smaller than, or equal to, about 8 mm, in any case greater than, or equal to, about 2 mm. In all embodiments shown inFIGS.1-6, the tread band1further comprises a third circumferential groove4in the central region L1.", "", "Preferably, the third circumferential groove4also has a substantially straight course.", "", "Preferably, the third circumferential groove4has a width greater than the width of the first circumferential groove2.", "", "In the embodiments ofFIGS.1-4, the third circumferential groove4has a width smaller than the width of the second circumferential groove3.", "", "In the embodiment ofFIGS.5-6, the third circumferential groove4has a width greater than the width of the second circumferential groove3.", "", "Preferably, in all of the four embodiments, the third circumferential groove4may have a width greater than, or equal to, about 7 mm, more preferably greater than, or equal to, about 8 mm, in any case smaller than, or equal to, about 15 mm.", "", "The third circumferential groove4may have a depth smaller than, or equal to, about 9 mm, more preferably smaller than, or equal to, about 8 mm, in any case greater than, or equal to, about 3 mm.", "", "Preferably, the first circumferential groove2has a depth equal to, or smaller than, the depth of the third circumferential groove4. Preferably, the second circumferential groove3has a depth equal to, or smaller than, the depth of the third circumferential groove4.", "", "Still referring to the embodiments shown inFIGS.1-6, at least the second and the third circumferential grooves3and4are configured so as to have a straight section of substantially trapezoidal shape.", "", "In an embodiment, such as, for example, that shown inFIG.6, the tread band1further comprises a fourth circumferential groove19in the central region L1.", "", "Preferably, the fourth circumferential groove19has a width greater than the width of the first2and of the second3circumferential groove, but smaller than the width of the third circumferential groove4.", "", "Preferably, the fourth circumferential groove19also has a substantially straight course. Preferably, the fourth circumferential groove19may have a width greater than, or equal to, about 9 mm, more preferably greater than, or equal to, about 10 mm, in any case smaller than, or equal to, about 18 mm.", "", "The fourth circumferential groove19may have a depth smaller than, or equal to, about 9 mm, more preferably smaller than, or equal to, about 8 mm, in any case greater than 2 mm.", "", "Preferably, the fourth circumferential groove19has a depth equal to, or smaller than, the depth of the third circumferential groove4.", "", "Preferably, the first circumferential groove2has a depth equal to, or smaller than, the depth of the fourth circumferential groove19.", "", "Preferably, the second circumferential groove3has a depth equal to, or smaller than, the depth of the fourth circumferential groove19.", "", "Preferably, the fourth circumferential groove19has a straight section of substantially trapezoidal shape.", "", "The outer shoulder region L2, as well as the inner shoulder region L3, has good stiffness, so as to provide readiness of response to the tyre especially at high speeds and when cornering.", "", "In order to make the shoulder regions of the tyre stiff, the outer L2and inner L3shoulder regions have a limited void-to-rubber ratio.", "", "Preferably, the outer shoulder region L2and/or the inner shoulder region L3have a void-to-rubber ratio smaller than about 0.20, preferably smaller than about 0.18.", "", "Preferably, the outer shoulder region L2and/or the inner shoulder region L3have a void-to-rubber ratio greater than about 0.05, preferably greater than about 0.07.", "", "Preferably, the inner shoulder L3region has a void-to-rubber ratio greater than the void-to-rubber ratio of the outer shoulder region L2.", "", "The inner shoulder region L3comprises circumferentially repeated first transverse grooves6.", "", "The void-to-rubber ratio of the inner shoulder region L3preferably results only from such first transverse grooves6.", "", "In other words, preferably, no other kind of grooves and/or recesses (leaving out the second circumferential groove3) are present in the inner shoulder region L3.", "", "Preferably, the first transverse grooves6of the inner shoulder region L3have a substantially straight course.", "", "Preferably, the first transverse grooves6of the inner shoulder region L3have a substantially transverse course or a course only slightly inclined relative to the axial direction.", "", "In particular, the course of the first transverse grooves6forms with the equatorial plane X-X an angle of between 750 and 900 in absolute value.", "", "The first transverse grooves6of the inner shoulder region L3have a maximum width greater than, or equal to, about 3 mm. Preferably, they have a maximum width smaller than about 8 mm. For example, they may have a maximum width of between about 3.5 and about 7 mm.", "", "The first transverse grooves6of the inner shoulder region L3may have, as in the examples shown inFIGS.1-3,5,6, a substantially constant width along their extension. In an alternative embodiment, as shown for example inFIG.4, the first transverse grooves6of the inner shoulder region L3have a width that substantially increases moving away from the equatorial plane X-X.", "", "Preferably, the first transverse grooves6of the inner shoulder region L3have a maximum depth of at least about 2 mm and smaller than about 8 mm.", "", "The first transverse grooves6of the inner shoulder region L3may have a depth that is not constant along their respective extension, for example a depth that decreases, preferably gradually, moving towards the axially outer edges of the tread band1.", "", "The first transverse grooves6of the inner shoulder region L3have a first end located substantially at the respective axially outer edge of the tread band1, and extend from said end in a substantially axial direction over at least 50% of the width of the inner shoulder region L3.", "", "Preferably, the first transverse grooves6of the inner shoulder region L3may have an extension equal to, or smaller than, 70% of the width of the inner shoulder region L3. The first transverse grooves6of the inner shoulder region L3may have an extension equal to, or smaller than, 90% of the width of the inner shoulder region L3.", "", "Preferably, the first transverse grooves6of the inner shoulder region L3do not have intersection points with the second circumferential groove3.", "", "In some embodiments, such as those shown inFIGS.5-6, some of the first grooves6may be connected to the second circumferential groove3by means of transverse sipes6′.", "", "The transverse sipes6′ extend, preferably in an axial direction, from one end of the first transverse grooves6to the second circumferential groove3.", "", "The6′ sipes may have an extension equal to at most 15% of the width of the inner shoulder region L3.", "", "The transverse sipes6′ may have, as in the examples shown inFIGS.5,6, a substantially constant width along their extension.", "", "The transverse sipes6′ may have, as in the examples shown inFIGS.5,6, a maximum width smaller than 2 mm.", "", "The transverse sipes6′ may have, as in the examples shown inFIGS.5,6, a maximum depth smaller than 2 mm.", "", "Preferably, not all of the first transverse grooves6of the inner shoulder region L3have a transverse sipe6′.", "", "In the embodiment shown inFIGS.5and6, first transverse grooves6having transverse sipes6′ are alternated in circumferential direction with first transverse grooves6lacking transverse sipes6′.", "", "The outer shoulder region L2comprises at least first transverse grooves5and second transverse grooves7circumferentially alternated with one another.", "", "Thus, the void-to-rubber ratio in the outer shoulder region L2results at least from first5and second7transverse grooves.", "", "In the embodiments shown inFIGS.5,6the outer shoulder region L2further has longitudinal grooves15, described in more detail below.", "", "The number of first transverse grooves5of the outer shoulder region L2is smaller than the number of first transverse grooves6of the inner shoulder region L3.", "", "Preferably, the number of first transverse grooves6of the inner shoulder region L3is about twice the number of first transverse grooves5of the outer shoulder region L2.", "", "Preferably, the first transverse grooves5of the outer shoulder region L2have a substantially straight course.", "", "Preferably, the first transverse grooves5of the outer shoulder region L2have a substantially transverse course or a course only slightly inclined relative to the axial direction.", "", "In particular, the course of the first transverse grooves5of the outer shoulder region L2forms with the equatorial plane X-X an angle α of between 750 and 900 in absolute value.", "", "The first transverse grooves5of the outer shoulder region L2may have, as in the examples shown inFIGS.1,3,5,6, a substantially constant width along their extension.", "", "In an alternative embodiment, as shown for example inFIG.4, the first transverse grooves5have instead a width that substantially increases along their extension moving away from the equatorial plane X-X.", "", "The first transverse grooves5of the outer shoulder region L2have a maximum width greater than, or equal to, about 3 mm. Preferably, they have a maximum width smaller than about 8 mm. For example, they may have a maximum width of between about 3.5 and about 7 mm.", "", "Preferably, the first transverse grooves5of the outer shoulder region L2have a maximum depth of at least about 2 mm and smaller than about 8 mm.", "", "The first transverse grooves5of the outer shoulder region L2may have a depth that is not constant along their respective extension, for example a depth that decreases, preferably gradually, moving towards the axially outer edges of the tread band1.", "", "The first transverse grooves5of the outer shoulder region L2have a first end located substantially at the respective axially outer edge of the tread band1, and extend from said end in a substantially axial direction over at least 50% of the width of the outer shoulder region L2.", "", "Preferably, the first transverse grooves5of the outer shoulder region L2may have an extension equal to, or smaller than, 70% of the width of the outer shoulder region L2. The first transverse grooves5of the outer shoulder region L2may have an extension equal to, or smaller than, 90% of the width of the outer shoulder region L2.", "", "Preferably, the first transverse grooves5of the outer shoulder region L2do not have intersection points with the first circumferential groove2.", "", "The second transverse grooves7located in the outer shoulder region L2preferably extend from the first circumferential groove2, in a substantially axial direction, for at least 20% of the width of the outer shoulder region L2.", "", "Preferably, the second transverse grooves7have an extension equal to, or smaller than, 90% of the width of said outer shoulder region L2.", "", "Preferably, the second transverse grooves7have a substantially straight course.", "", "The second transverse grooves7also have a substantially transverse course or a course only slightly inclined relative to the axial direction, but counter-inclined relative to the first transverse grooves5.", "", "In particular, the course of the second grooves7forms an angle α′ with the equatorial plane X-X of between 750 and 90° in absolute value, but opposite in sign relative to that of the first transverse grooves5.", "", "Preferably, the second transverse grooves7do not have intersection points with the first transverse grooves5, but they are mutually located such that on the outer shoulder region L2the second transverse grooves7and the first transverse grooves5have a segment of their extension lying in a common circumferential annular portion S.", "", "Preferably, the common circumferential annular portion S has a width equal to at least ⅕ of the width of the outer shoulder region L2.", "", "Preferably, the common circumferential annular portion S has a width equal to at most ⅖ of the width of the outer shoulder region L2.", "", "The second transverse grooves7have a width smaller than the width of the first transverse grooves5,6.", "", "Preferably, the second transverse grooves7have a maximum width smaller than about 3 mm. For example, they may have a width of between about 1.2 and about 3 mm.", "", "Preferably, the second transverse grooves7have a maximum depth of at least about 1.5 mm and smaller than about 4 mm.", "", "In some embodiments, such as those shown inFIGS.5and6, the outer shoulder region L2may have a plurality of longitudinal grooves15.", "", "The longitudinal grooves15extend with a substantially straight course in a substantially circumferential direction.", "", "Preferably, the longitudinal grooves15extend in a circumferential direction so as to join at least some of the second transverse grooves7, preferably all of the second transverse grooves7.", "", "Preferably, the longitudinal grooves15extend in a circumferential direction until they reach at least a first transverse groove5.", "", "In the embodiment shown inFIG.5, the longitudinal grooves15extend in a circumferential direction until they intersect, and go slightly beyond, a first transverse groove5.", "", "In the embodiment shown inFIG.6, instead, the longitudinal grooves15extend in a circumferential direction until they intercept a first transverse groove5, but without extending beyond the latter in circumferential direction.", "", "In the embodiments shown inFIGS.5and6, each longitudinal groove15extends from one end of a respective second transverse groove7seamlessly, i.e., so as to form a single groove with the latter.", "", "Preferably, the longitudinal grooves15have a width smaller than the width of the first transverse grooves5,6.", "", "Preferably, the longitudinal grooves15have a width smaller than about 4 mm. For example, they may have a width of between about 1.2 and about 3 mm.", "", "Preferably, the longitudinal grooves15have substantially the same width as the second transverse grooves7.", "", "Preferably, the longitudinal grooves15have a maximum depth of at least about 1.5 mm and smaller than about 4 mm.", "", "The central region L1is designed so as to provide a high amount of rubber on the ground at the most central portion of tread band1, i.e., near the equatorial plane X-X of tyre1, keeping the stiffness of tread band1as uniform as possible.", "", "To this end, the central region L1has a void-to-rubber ratio smaller than about 0.40, preferably smaller than about 0.36. Preferably, the central region L1has a void-to-rubber ratio greater than about 0.25, preferably greater than about 0.28.", "", "In the embodiments shown inFIGS.1-5, the third circumferential groove4, together with the first2and the second3circumferential grooves, defines, in the central region L1, a first9and a second10circumferential rib.", "", "In the embodiment shown inFIG.6, the third circumferential groove4and the fourth circumferential groove19, together with the first2and the second3circumferential grooves, define, in the central region L1, a first9, a second10and a third20circumferential rib.", "", "In the embodiment shown inFIGS.1-5, the first circumferential rib9is located between the first circumferential groove2and the third circumferential groove4; the second circumferential rib10is located between the third circumferential groove4and the second circumferential groove3.", "", "In the embodiment shown inFIG.6, the first circumferential rib9is located between the third circumferential groove4and the fourth circumferential groove19; the second circumferential rib10is located between the third circumferential groove4and the second circumferential groove3; the third circumferential rib20is located between the first circumferential groove2and the fourth circumferential groove19.", "", "In order to increase the amount of “rubber on the ground” at the central region L1, thus optimizing handling features, noise and rolling resistance, the central region L1and the circumferential ribs9,10are characterized by low void-to-rubber ratios.", "", "At least one of the first9and the second10circumferential rib, preferably both of them, has, in fact, a void-to-rubber ratio smaller than, or equal to, about 0.075, more preferably smaller than, or equal to, about 0.05.", "", "To this end, the first9and the second10circumferential rib may respectively comprise a plurality of third11and fourth12transverse grooves having a limited width and/or extension.", "", "In order not to generate excessive and abrupt stiffness variations between outer shoulder L2and central portion L1, in the first circumferential rib9the third transverse grooves11extend, preferably from the first circumferential groove2, so as to be located along the extension direction of the second transverse grooves7located in the outer shoulder region L2.", "", "Preferably, the course of the second transverse grooves11forms an angle α′ with the equatorial plane X-X of between 750 and 90°.", "", "Preferably, the third transverse grooves11extend over at most 80% of the width of the circumferential rib9.", "", "More preferably, the third transverse grooves11extend over at most 50% of the width of the circumferential rib9.", "", "In the embodiment shown inFIG.4the third grooves11extend over at most 30% of the width of the circumferential rib9.", "", "The third transverse grooves11may have a substantially straight course.", "", "The third transverse grooves11are mutually arranged at a distance in circumferential direction preferably of between 25 mm and 80 mm.", "", "The third transverse grooves11have a maximum width smaller than the maximum width of the first transverse grooves5,6.", "", "Preferably, the third transverse grooves11have a width smaller than about 3 mm. For example, they may have a width of between about 1.2 and about 3 mm.", "", "Preferably, the third transverse grooves11have a width substantially equal to the width of the second transverse grooves7.", "", "The third transverse grooves11may have a depth greater than, or equal to, about 2 mm.", "", "Preferably, the third transverse grooves11may have a depth smaller than about 5 mm.", "", "For example, they may have a depth of between about 2.5 and about 4.5 mm.", "", "The third transverse grooves11may have a depth that is not constant along their respective extension.", "", "In some embodiments, such as for example that shown inFIG.6, the third grooves11have a first portion11A and a second portion11B having different widths arranged consecutively to each other.", "", "The first circumferential rib9may comprise, as in the examples ofFIGS.3,5,6, a plurality of fifth transverse grooves13.", "", "In the first circumferential rib9the fifth transverse grooves13preferably extend from the third circumferential groove4.", "", "Preferably, the fifth transverse grooves13have a substantially straight course.", "", "The fifth transverse grooves13extend over at most 50% of the width of the circumferential rib9, preferably at most 30% of the width of the circumferential rib9. In the embodiments shown inFIGS.3,5,6, the fifth transverse grooves13extend in a direction substantially parallel to the direction of the third transverse grooves11.", "", "The fifth transverse grooves11are inclined so as to form an angle α′ with the equatorial plane X-X preferably of between 750 and 90°.", "", "The fifth transverse grooves13have a width greater than the width of the third transverse grooves11. Preferably, the fifth transverse grooves13have a width equal to, or greater than, about 3 mm.", "", "For example, they may have a width of between about 3.5 to about 6 mm.", "", "The fifth transverse grooves13may have a depth greater than, or equal to, about 2 mm. For example, they may have a depth of between about 2.5 mm and about 5 mm. The fifth transverse grooves13may have a depth that is not constant along the respective extension.", "", "The second circumferential rib10comprises a plurality fourth transverse grooves12.", "", "The fourth transverse grooves12extend over at least 50% of the width of the second circumferential rib10.", "", "Preferably, the fourth transverse grooves12extend over at least 90% of the width of the second circumferential rib10.", "", "Preferably, the fourth grooves12extend from the second circumferential groove3to the third circumferential groove4, i.e., over the full width of the second circumferential rib10.", "", "The fourth transverse grooves12have at least one first segment12′ and at least one second segment12″, consecutively located relative to the first segment12′.", "", "The first segment12′ and, respectively, the second segment12″ preferably have a substantially straight course.", "", "Preferably, the second segment12″ is counter-inclined relative to the first segment12′. In order to limit excessive stiffness variations in the tread band in axial direction, in some embodiments, such as those shown for example inFIGS.1-3,4, the first segment12′ of the fourth grooves12extends so as to be located substantially along the extension direction of the second transverse grooves7.", "", "In the embodiments shown inFIGS.5and6, the extension direction of the first segment12′ of the fourth transverse grooves12is substantially parallel, but circumferentially offset, relative to the extension direction of the second transverse grooves7.", "", "In some embodiments, for example those shown inFIGS.1-3,4and5, the second segment12″ has a first portion12″A and a second portion12″B having different widths, arranged consecutively to each other.", "", "Preferably, the fourth transverse grooves12have a width equal to, or greater than, about 1 mm.", "", "Preferably, the fourth transverse grooves12have a width equal to, or smaller than, about 6 mm.", "", "The fourth transverse grooves12may have a depth greater than, or equal to, about 2 mm. For example, they may have a depth of between about 2.5 and about 5 mm.", "", "The fourth transverse grooves12may have a depth that is not constant along their respective extension.", "", "The second circumferential rib10may have, as in the embodiment shown inFIG.5, a plurality of sixth transverse grooves22.", "", "Preferably, the sixth transverse grooves22extend from the second circumferential groove3.", "", "Preferably, the sixth transverse grooves22have a substantially straight course.", "", "Preferably, the sixth transverse grooves22extend over at most 80% of the width of the second circumferential rib10.", "", "Preferably, the sixth transverse grooves22extend in a direction substantially parallel to the direction of the second segment12″ of the fourth transverse grooves12.", "", "Preferably, the sixth transverse grooves22have a width equal to, or greater than, about 1 mm.", "", "Preferably, the sixth transverse grooves22have a width equal to, or smaller than, about 6 mm.", "", "The sixth transverse grooves22may have a depth greater than, or equal to, about 2 mm. For example, they may have a depth of between about 2.5 and about 5 mm. The sixth transverse grooves22may have a depth that is not constant along their respective extension.", "", "In some embodiments such as that shown inFIG.6, the central portion L1may have a fourth circumferential groove19located so as to define a third circumferential rib20between the first circumferential rib9and the outer shoulder region L2.", "", "Still in order to keep a proper amount of rubber on the ground, also the third circumferential rib20is characterized by a low void-to-rubber ratio.", "", "Preferably, the third circumferential rib20has a void-to-rubber ratio smaller than, or equal to, about 0.09.", "", "To this end, the third circumferential rib20comprises a plurality of seventh transverse grooves14having a limited extension and/or width.", "", "Preferably, the seventh transverse grooves14extend over at least 70%, more preferably over at least 90%, of the width of the third circumferential rib20.", "", "In the embodiment shown inFIG.6, the seventh grooves14extend from the first circumferential groove2to the fourth circumferential groove19, i.e., they extend over the full width of the third circumferential rib20.", "", "In order to reduce excessive stiffness variations in the tread band in axial direction, the seventh grooves14extend, preferably from the first circumferential groove2, so as to be located substantially along the extension direction of the second transverse grooves7.", "", "Preferably, the course of the seventh grooves14forms an angle α′ with the equatorial plane X-X of between 750 and 90°.", "", "Preferably, the seventh grooves14have a width equal to, or greater than, about 1 mm.", "", "Preferably, the seventh grooves14have a width equal to, or smaller than, about 6 mm.", "", "The seventh transverse grooves14may have a depth greater than, or equal to, about 2 mm. For example, they may have a depth of between about 2.5 and about 5 mm. The seventh grooves14may have a depth that is not constant along their respective extension.", "", "Preferably, the seventh grooves14have a first portion14A and a second portion14B having different widths, arranged consecutively to each other.", "", "Various modifications may be made to the embodiments described herein in detail, while still remaining within the scope of protection of the invention, as defined by the following claims."], "claims": ["1 - 35 . (canceled)", "a first circumferential groove axially delimiting the outer shoulder region relative to the central region and a second circumferential groove axially delimiting the inner shoulder region relative to the central region; the outer shoulder region having a width greater than a width of the inner shoulder region; and the outer shoulder region and the inner shoulder region comprise a plurality of first transverse grooves having a first end located substantially at the respective edge of the tread band, having a maximum width greater than, or equal to, 3 mm and an extension equal to at least 50% of the width of the shoulder region where the plurality of first transverse grooves are located; wherein the outer shoulder region comprises a plurality of second transverse grooves extending from the first circumferential groove; the second transverse grooves have a width smaller than the first transverse grooves and a counter-inclined course relative to the first transverse grooves; the central region comprising a first and a second circumferential rib separated by a third circumferential groove, and the first and second circumferential ribs having a void-to-rubber ratio equal to, or smaller than, 0.09.", "37 . The tyre according to claim 36 , wherein the first circumferential rib comprises a plurality of third transverse grooves extending from the first circumferential groove to be located along the extension direction of the second transverse grooves.", "38 . The tyre according to claim 36 , wherein the third transverse grooves have an extension equal to, or smaller than, 80% of a width of the first circumferential rib.", "39 . The tyre according to claim 36 , wherein the second circumferential rib comprises a plurality of fourth transverse grooves.", "40 . The tyre according to claim 39 , wherein the fourth transverse grooves have an extension equal to, or greater than, 50% of a width of the second circumferential rib.", "41 . The tyre according to claim 36 , wherein the second transverse grooves are inclined relative to a direction parallel to the equatorial plane (X-X) to form an angle (α′) greater than 75°.", "42 . The tyre according to claim 36 , wherein the second transverse grooves have an extension equal to, or smaller than, 90% of the width of the outer shoulder region.", "43 . The tyre according to claim 36 , wherein the second transverse grooves do not have intersection points with the first transverse grooves.", "44 . The tyre according to claim 36 , wherein in the outer shoulder region, the second transverse grooves and the first transverse grooves have a segment of their extension in a common circumferential annular portion having a width equal to at least ⅕ of the width of the outer shoulder region.", "45 . The tyre according to claim 36 , wherein in the outer shoulder region, the second transverse grooves and the first transverse grooves have a segment of their extension in a common circumferential annular portion having a width equal to at most ⅖ of the width of the outer shoulder region.", "46 . The tyre according to claim 38 , wherein the third transverse grooves have an extension equal to, or smaller than, 50% of a width of the first circumferential rib.", "47 . The tyre according to claim 39 , wherein the fourth transverse grooves have at least one first segment and at least one second segment consecutively located relative to the first segment, and the second segment counter-inclined relative to the first segment.", "48 . The tyre according to claim 47 , wherein the first segment extends from the third circumferential groove.", "49 . The tyre according to claim 47 , wherein the first segment extends to be located along an extension direction of the second transverse grooves.", "50 . The tyre according to claim 47 , wherein the second segment extends over at least 50% of the total extension of the fourth transverse grooves.", "51 . The tyre according to claim 47 , wherein the first segment extends over at most 20% of the total extension of the fourth transverse grooves.", "52 . The tyre according to claim 47 , wherein the second segment has a first portion having a width equal to, or greater than, 3 mm.", "53 . The tyre according to claim 52 , wherein the second segment has a second portion having a width smaller than the width of the first portion.", "54 . The tyre according to claim 36 , wherein the outer shoulder region comprises a plurality of longitudinal grooves, having a substantially circumferential course.", "55 . The tyre according to claim 54 , wherein the longitudinal grooves intersect at least some of the first transverse grooves.", "56 . The tyre according to claim 37 , wherein the void-to-rubber ratio of the first circumferential rib results only from the third transverse grooves.", "57 . The tyre according to claim 36 , wherein the first circumferential rib comprises a plurality of fifth transverse grooves.", "58 . The tyre according to claim 57 , wherein the fifth transverse grooves have an extension equal to, or smaller than, 50% of a width of the first circumferential rib.", "59 . The tyre according to claim 57 , wherein the fifth transverse grooves have a width greater than the third transverse grooves.", "60 . The tyre according to claim 36 , wherein the central region comprises a third circumferential rib separated from the first circumferential rib by a fourth circumferential groove.", "61 . The tyre according to claim 60 , wherein the third circumferential rib has a void-to-rubber ratio equal to, or smaller than, 0.09.", "62 . The tyre according to claim 60 , wherein the third circumferential rib comprises a plurality of seventh transverse grooves.", "63 . The tyre according to claim 62 , wherein the seventh transverse grooves have an extension equal to, or greater than, 60% of a width of the third circumferential rib.", "64 . The tyre according to claim 62 , wherein the seventh transverse grooves extend from the first circumferential groove to be located along the extension direction of the second transverse grooves.", "65 . The tyre according to claim 36 , wherein the first transverse grooves have substantially straight course.", "66 . The tyre according to claim 36 , wherein the second transverse grooves have a substantially straight course.", "67 . The tyre according to claim 36 , wherein the void-to-rubber ratio of the inner shoulder region results only form the first transverse grooves.", "68 . The tyre according to claim 36 , wherein in the inner shoulder region, the first transverse grooves have an extension equal to, or smaller than, 90% of the width of the inner shoulder region.", "69 . The tyre according to claim 36 , wherein the number of the first transverse grooves of the outer shoulder region is lower than the number of the first transverse grooves of the inner shoulder region.", "70 . The tyre according to claim 69 , wherein the number of first transverse grooves of the inner shoulder region is about twice the number of first transverse grooves of the outer shoulder region."], "bibtex": "@patent{20240198730,\n    title = {HIGH-PERFORMANCE TYRE},\n    number = {20240198730},\n    year = {2024},\n    note = {File: US20240198730A1-20240620.XML}\n    }", "classification": "B60C1103FI"}, {"title": "TIRE", "doc_number": "20240198731", "filename": "US20240198731A1-20240620.XML", "abstract": "A tire comprises a tread portion provided with blocks including a first block provided with a plurality of sipes. Each sipe comprises a zigzag portion in a cross section perpendicular to the sipe length direction, and a zigzag portion in a cross section parallel to the ground contacting top surface of the first block. Each of the sipes is provided with at least one tie bar protruding radially outwardly from the bottom of the sipe and terminating without reaching the ground contacting top surface. The sipes includes a first sipe having the tie bar at a first position in the tire axial direction, and a second sipe having the tie bar at a second position in the tire axial direction different from the first position.", "detailed_description": ["An embodiment of the present disclosure will now be described in detail in conjunction with accompanying drawings.", "", "FIG.1is a developed partial view of a tread portion2of a tire1as an embodiment of the present disclosure.", "", "As shown inFIG.1, the tire1in the present embodiment is intended for use in the winter season.", "", "The tire1in the present embodiment is designed for a pneumatic tire for passenger cars. However, the present disclosure is not limited to the present embodiment, and may be applied, for example, to heavy duty vehicles tires.", "", "The tread portion2is provided with a plurality of circumferential grooves3continuously extending in a tire circumferential direction and disposed between two tread edges Te. Thus, the tread portion2is divided by these circumferential grooves3into a plurality of land portions4.", "", "The tread edges Te corresponds to the outermost contact positions in the tire axial direction when the tire1in its normal state is set on a horizontal flat surface at a camber angle of 0 degrees and loaded with 70% of a normal load.", "", "In the case of pneumatic tires for which various standards have been established, the “normal state” of a tire means a state of the tire mounted on a regular rim, and inflated to a regular internal pressure, but loaded with no tire load.", "", "In the case of tires for which various standards are not yet defined or non-pneumatic tires, the “normal state” of a tire means a standard usage condition according to the purpose of use of the tire, which is a condition in which the tire is not mounted on the vehicle and no tire load is applied.", "", "In this specification, unless otherwise noted, the dimensions of each part or position of the tire refer to those measured under the normal state.", "", "Incidentally, known methods can be appropriately applied to the method for measuring the dimensions unless otherwise specified.", "", "The “regular rim” is a wheel rim specified for the tire in a standard system including standards on which the tire is based, for example, “Standard Rim” in JATMA, “Design Rim” in USA, and “Measuring Rim”. in ETRTO,", "", "The “regular internal pressure” is the air pressure specified for the tire in the standard system including standards on which the tire is based, for example, the “maximum air pressure” in JATMA, the “Inflation Pressure” in ETRTO, and the maximum pressure given in the “Tire Load Limits at Various Cold Inflation Pressures” table in TRA or the like.", "", "In the case of pneumatic tires for which various standards have been established, the “normal load” is the tire load specified for the tire in the standard system including standards on which the tire is based, for example, “LOAD CAPACITY” in JATMA, the maximum value listed in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” for TRA, and “LOAD CAPACITY” in ETRTO.", "", "In the case of tires for which various standards have not been established, the “normal load” refers to the maximum load that can be applied when using the tire according to the above-mentioned standards.", "", "In the present embodiment, the tread portion2is provided with the four circumferential grooves3including two crown circumferential grooves5and two shoulder circumferential grooves6.", "", "The two crown circumferential grooves5are disposed one on each side of the tire equator C.", "", "The two shoulder circumferential grooves6are respectively disposed axially outside the two crown circumferential grooves5.", "", "The present disclosure is however, not limited to such groove arrangement.", "", "The circumferential grooves3may adopt various modes such as those extending linearly in the tire circumferential direction and those extending in a zigzag shape in the tire circumferential direction.", "", "FIG.2shows a cross section of the tread portion2, wherein the sipes and the lateral grooves observed in the plan view of the tread portion2are omitted here.", "", "It is preferable that the groove widths of the circumferential grooves3are not less than 3 mm as shown inFIG.2.", "", "The maximum groove width W1of the circumferential grooves3is, for example, 2.0% to 5.0% of the tread width TW (shown inFIG.1).", "", "The maximum depth d1of the circumferential groove3is, for example, 5 to 15 mm. Incidentally, the tread width TW corresponds to the distance in the tire axial direction between the tread edges Te under the normal state.", "", "As shown inFIG.1, the tread portion2in the present embodiment is divided into five land portions4by the four circumferential grooves3described above.", "", "The five land portions4are one crown land portion7, two middle land portions8mand two shoulder land portions9.", "", "The crown land portion7is defined between the two circumferential crown grooves5.", "", "Each of the middle land portions8is defined between the crown circumferential groove5and one of the shoulder circumferential grooves6.", "", "Each of the shoulder land portions9is defined between one of the shoulder circumferential grooves6and the adjacent tread edge Te.", "", "The tread portion2in the present embodiment is provided with a plurality of lateral grooves10. Thereby, each of the five land portions4is circumferentially divided by the lateral grooves10into a plurality of blocks11in a row.", "", "The above-said plurality of blocks11includes at least one first block13.", "", "In the present embodiment, the shoulder land portion9includes a plurality of the first blocks13arranged in the tire circumferential direction. The plurality of first blocks13constitute the tread edge Te.", "", "InFIG.3. there is shown an enlarged view of the plurality of first blocks13.", "", "The plurality of first blocks13shown inFIG.3are included in the shoulder land portion9on the left side ofFIG.3.", "", "As shown inFIG.3, the plurality of sipes15extending in the tire axial direction are arranged in the ground contacting top surface13sat intervals in the tire circumferential direction.", "", "The term “sipe” means a narrow groove having a width not more than 1.5 mm between two opposite side walls, inclusive of a cut having no substantial width.", "", "A chamfer may be provided at the edge of the opening of the sipe.", "", "Further, the bottom15dof the sipe15may be communicated with a wide portion as described later.", "", "FIG.4is an enlarged perspective view showing the internal space of the sipe15.", "", "As shown inFIG.4, the internal space are lightly dotted.", "", "FIG.5shows a cross-sectional view of the sipe15perpendicular to the sipe length direction.", "", "FIG.5is a cross-sectional view including a first wide portion21, and corresponds to the cross-sectional view taken along line AA inFIG.3. The first wide portion21will be described later,", "", "FIG.6is a cross-sectional view of the sipe15taken along a plane parallel to the ground contacting top surface13sof the first block13.", "", "The cross-sectional view ofFIG.6includes a tie bar18which will be described later.", "", "In the present embodiment, as shown inFIGS.4and5, each of the sipes15includes a zigzag-shaped portion in a cross section orthogonal to the sipe length direction. Further, as shown inFIGS.4and6, each of the sipes15includes a zigzag portion in a cross section parallel to the ground contacting top surface13s.", "", "Here, the expression “include a zigzag-shaped portion” means that the part which vibrates in a zigzag is formed in at least one position.", "", "In the present embodiment, as a preferable example, in both the cross section orthogonal to the sipe length direction and the cross section parallel to the ground contacting top surface13s, the sipe is zigzag-shaped as a whole.", "", "FIG.7is a cross-sectional view of the sipe15taken along the length direction of the sipe15.", "", "The cross-sectional view ofFIG.7corresponds to the cross-sectional view taken along line BB ofFIG.3.", "", "InFIG.7, double-dots chain lines20corresponding mountain lines and valley lines of concavities and convexities formed in the opposite side walls of the sipe.", "", "Further, as shown inFIG.7, the sipe15is provided with at least one tie bar18.", "", "The tie bar18locally protrudes outward in the tire radial direction from the bottom18dof the sipe, and terminates without reaching the ground contacting top surface13sof the first block13.", "", "FIG.8is an enlarged top view of the first block13, wherein the positions of the tie bars18of the respective sipes15are indicated by hatched circles.", "", "In the present embodiment, as shown inFIG.8, the sipes15provide in one first block13include at least a first sipe31having the tie bar18at a first axial position, and a second sipe32having the tie bar18at a second axial sipe31different from the first axial position. Here, two tie bars located at different axial positions means that the center18cin the sipe length direction of the tie bar18of the first sipe31is displaced from that of the second sipe32.", "", "Thus, in the present embodiment, it is possible that, in the top view of the first block13, a virtual zone37(dotted inFIG.8), which is formed by extending the axial extent of the tie bar18of the first sipe31toward the second sipe32in parallel with the tire circumferential direction, may partially overlaps with the tie bar18of the second sipe32.", "", "However, as another arrangement, it is also possible that the virtual zone37does not overlap with the tie bar18of the second sipe32.", "", "The tire1of the present embodiment can improve the load bearing performance while maintaining the on-ice performance by adopting the above-described configuration. The reason is as follows.", "", "In the present embodiment, as shown inFIGS.5and6, each of the sipes15has the zigzag-shaped portion in the cross section orthogonal to the sipe length direction, and also has the zigzag-shaped portion in the cross section parallel to the ground contacting top surface13sof the first block13. Further, as shown inFIG.7, each of the sipes15is provided with at least one tie bar18.", "", "When a load from the ground acts on the first block13, the side walls of the sipes15facing each other are strongly engaged with each other so as to maintain the apparent rigidity of the first block13. Further, the tie bars18maintain the rigidity of the first block13. As a result, the collapse of the first block13is effectively suppressed, and the strain at the bottom of the first sipe31can be suppressed, therefore, the load bearing performance is improved.", "", "In addition, as shown inFIG.8, in the present embodiment, as the tie bars18of the first sipe31and the second sipe32are located at different axial positions, the first block13is surely prevented from falling down. and the load bearing performance is further improved. In addition, since the tie bars18described above suppress local falling down of the block, even if a large shear stress acts on the first block13, for example, during braking on ice, the entire edges of the first sipe31and the second sipe32exerts a large frictional force to maintain the on-ice performance.", "", "For the above reasons, the tire1can improve the load bearing performance while maintaining the on-ice performance.", "", "Hereinafter, the present embodiment will be described in more detail.", "", "Each configuration described below represents a specific aspect of the present embodiment. Therefore, the present disclosure can exhibit the above effects even if it does not have the configuration described below.", "", "Further, even if any one of the configurations described below is applied singly to the tire of the present disclosure having the features described above, an improvement in performance corresponding to each configuration can be expected.", "", "Furthermore, when some of the respective configurations described below are applied in combination, it is possible to expect a combined improvement in performance according to each configuration.", "", "As shown inFIG.1, when the tread portion2is axially divided into four equal parts: two outer parts2A, which are regions on the tread edge Te side, and two inner parts2B, which are regions on the tire equator C side, the plurality of first blocks13is preferably arranged in the land portion4included in the outer part2A.", "", "In the present embodiment, the plurality of first blocks13is included in the shoulder land portion9, and the plurality of first blocks13forms the tread edge Te.", "", "Thereby, since the sipes15are arranged in the shoulder land portion9where ground contact pressure tends to become high, the load bearing performance is reliably improved.", "", "Preferably, 2 to 7 sipes15are disposed per one first block13.", "", "In the present embodiment, as shown inFIG.3, five sipes15are disposed per one first block13, and", "", "each sipe15crosses the first block13in the tire axial direction.", "", "Further, in the present embodiment, except for the sipes15, the first block13is not provided with recesses such as grooves.", "", "However, the present disclosure is not limited to such arrangement. For example, the first block13may be provided with a narrow groove extending in the tire circumferential direction.", "", "The interval “ta” between two sipes15adjacent in the tire circumferential direction (corresponds to the distance in the tire circumferential direction between the sipe center lines) is, for example, 3.0 to 7.0 mm, preferably 4.0 to 6.0 mm.", "", "Thereby, it is possible to exhibit excellent on-ice performance while suppressing uneven wear of the first block13.", "", "In the present embodiment, as shown inFIG.7, the sipe15is provided with only one tie bar18at a position other than the ends in the sipe length direction.", "", "However, the sipe arrangement is not limited to such example. The sipe15may be provided with a plurality of tie bars18.", "", "In the present embodiment, as shown inFIG.7, the tie bar18extends in the tire radial direction with a constant width W5except for the radially outer end portion18awhich has an arcuate outer surface convex toward the ground contacting top surface13s.", "", "The constant width W5of the tie bar18in a cross section along the length direction of the sipe15is, for example, in a range from 0.5 to 5.0 mm.", "", "The height h1in the tire radial direction from the bottom of the first wide portion21which will be described later, to the radially outer end of the tie bar18, is preferably set in a range from 30% to 70% of the maximum depth d3from the ground contacting top surface13sof the first block13to the bottom of the first wide portion21. Such tie bars18serve to improve the load bearing performance and the on-ice performance in a well-balanced manner.", "", "As shown inFIG.8, the tie bar18is preferably disposed in a center region of each sipe15in its longitudinal direction. Therefore, when the first sipe31is divided into three equal parts in the sipe length direction, it is preferable that the above-said first position is located in the central part.", "", "Similarly, when the second sipe32is divided into three equal parts in the sipe length direction, it is preferable that the above-said second position is located in the central part. That is, the center18cof each tie bar18in the sipe length direction is located within the central part. Thereby, the central part of the first block13in the tire axial direction is effectively reinforced.", "", "As long as the center18cis located within the central part, a portion of the tie bar18may be outside the central part.", "", "InFIG.8, the boundary lines38between three equal parts are indicated by double-dots chain line.", "", "The plurality of sipes15provided in one first block13are not limited to the first sipe31and the second sipe32only.", "", "In the present embodiment, in addition to the first sipe31and the second sipe32, a third sipe33, a fourth sipe34, and a fifth sipe35provided per one first block13.", "", "InFIG.8, the first sipe31to the fifth sipe35are arranged in order from one side to the other side in the tire circumferential direction.", "", "Further, inFIG.8, the positions at which the tie bars18of the sipes31to35are provided are indicated by hatched circles.", "", "The third sipe33has the tie bar18at a third position in the tire axial direction different from the first position and the second position.", "", "The fourth sipe34has the tie bar18at a fourth axial position in the tire axial direction.", "", "The fifth sipe35has the tie bar18at a fifth position in the tire axial direction.", "", "The fourth position is different from the first to third positions.", "", "The fifth position is different from the first to fourth positions.", "", "The second position is between the first position and the third position in the tire axial direction. Thereby, the on-ice performance and the load bearing performance are further improved.", "", "The first position and the second position are on one side in the tire axial direction of the third position.", "", "The fourth position and the fifth position are on the other side in the tire axial direction of the third position.", "", "The fourth position is between the third position and the fifth position in the tire axial direction.", "", "Thereby, it is possible to suppress uneven wear in the region where these sipes15are provided, while obtaining the above-described effects.", "", "In the present embodiment, for each sipe15provided in the first block13, the tie bar18is located in the central part when the sipe15is divided into three equal parts in the sipe length direction as described above.", "", "It is preferable that, for every two of the sipes15adjacent to each other in the tire circumferential direction, a virtual zone, which is formed by extending the axial extent of the tie bar18of one of the two sipes toward the other of the two sipes in parallel with the tire circumferential direction, partially overlaps with the tie bar of the other of the two sipes. Thereby, the central portion of the first block13in the tire axial direction is effectively reinforced, and the load-bearing performance is improved.", "", "InFIG.8, tie bar arrangement lines36are indicated by double-dot chain lines. Each of the tie bar arrangement lines36is an imaginary line connecting the centers of two of the tie bars18adjacent in the tire circumferential direction.", "", "In the present embodiment, in a top view of the first block, each of the tie bar arrangement lines36is inclined in one direction with respect to the tire circumferential direction.", "", "The angle θ1of each tie bar arrangement line36with respect to the tire circumferential direction is, for example, 10 to 30 degrees.", "", "As a result, uneven wear resistance and the load bearing performance are improved in a well-balanced manner.", "", "In the present disclosure, the tie bar arrangement is not limited to the above example, and various arrangements can be adopted.", "", "FIGS.9to11each show a top view of the first block13as another example of the tie bar arrangement.", "", "InFIGS.9to11, the same reference numerals are given to elements that are common to the above-described example, and the above-described configurations can be applied thereto.", "", "In the examples shown inFIGS.9to10, the tie bar18of each sipe15is arranged in a central part when the sipe15is divided into three equal parts in the longitudinal direction. And the tie bar arrangement lines36extend in a zigzag pattern.", "", "In the examples shown inFIGS.9and10, in the top view of the first block13, tie bar center lines18vextending parallel to the tire circumferential direction through the respective centers18cof the tie bars18, are displaced in the tire axial direction. Such arrangement of the tie bars18helps to further improve the load bearing performance.", "", "In the examples shown inFIGS.9and10, it is preferable that the tie bar centerlines18vof the tie bars18are respectively placed on virtual lines which are drawn in parallel to the tire circumferential direction at substantially equal spacings L2.", "", "The “substantially equal spacing” means that the difference between the minimum value and the maximum value of the spacings L2between the tie bar center lines18vis not more than 15% of the maximum value.", "", "For example, The spacings L2are in a range from 50% to 200% of the maximum width W5of the tie bars18.", "", "As a result, the above effects can be reliably obtained.", "", "In the example shown inFIG.9, in a top view of the first block13, a virtual zone (not shown), which is formed by extending the axial extent of the tie bar18of the second sipe32toward the third sipe33in parallel to the tire circumferential direction, overlaps with the tie bar18of the third sipe33.", "", "Further, in the top view of the first block13, a virtual zone (not shown), which is formed by extending the axial extent of the tie bar18of the third sipe33toward the fourth sipe34in parallel to the tire circumferential direction, overlaps with the tie bar18of the fourth sipe34.", "", "Such arrangement of the tie bars18helps to further increase the load bearing performance.", "", "In the example shown inFIG.10, in a top view of the first block13, a virtual area (not shown), which is formed by extending the axial extent of the tie bar18of the second sipe32toward the third sipe33in parallel to the tire circumferential direction, does not overlap with the tie bar18of the third sipe33.", "", "Further, in the top view of the first block13, a virtual zone (not shown), which is formed by extending the axial extent of the tie bar18of the third sipe33toward the fourth sipe34in parallel to the tire circumferential direction, does not overlap with the tie bar18of the fourth sipe34.", "", "As a result, the reinforcing effect by the tie bars18acts over a wide range, and uneven wear of the first block13can be suppressed.", "", "In the example shown inFIG.11, among the first to fifth sipes31to35arranged from one side to the other side in the tire circumferential direction,", "", "the tie bar18of the third sipe33and the tie bar18of the fifth sipe35are located at the same axial position as the first position of the first sipe31. That is, the third sipe33and the fifth sipe35are configured as “the first sipe31having the tie bar18at the first position in the tire axial direction”.", "", "On the other hand, the tie bar18of the fourth sipe34is located at the same axial position as the second position of the second sipe32. That is, the fourth sipe34is configured as “the second sipe32having the tie bar18at the second position in the tire axial direction”. With such sipe arrangement, this example can be said that the first sipe31having the tie bar18at the first position in the tire axial direction, and the second sipe32having the tie bar18at the second position in the tire axial direction are alternately arranged in the tire circumferential direction.", "", "As a result, the tie bar arrangement lines36form a zigzag line extending in the tire circumferential direction.", "", "In such example, as the tie bars18adjacent in the tire circumferential direction are separated from each other in the tire axial direction, uneven wear of the first block13can be further suppressed.", "", "In this example, in a top view of the first block13, a virtual zone37, which is formed by extending the axial extent of the tie bar18of the first sipe31toward the second sipe32in parallel with the tire circumferential direction, does not overlap with the tie bar18of the second sipe32.", "", "On the other hand, the first position is located in a central part when the first sipe31is divided into three equal parts in the longitudinal direction of the sipe.", "", "Also, the second position is located in a central part when the second sipe32is divided into three equal parts in the longitudinal direction of the sipe.", "", "The positions of the tie bars18are not limited to the above examples.", "", "As a modified example of that shown inFIG.11, it may be possible that:when the first sipe31is divided into three equal parts in the sipe longitudinal direction, the first position is located in a part on the tread edge Te side; andwhen the second sipe32is divided into three equal parts in the sipe longitudinal direction, the second position is located in a part on the tire equator C side.", "", "In such modified example, since no tie bar18is arranged in a central part of the sipe15, each sipe15can exhibit high water absorption performance, thereby exhibiting excellent on-ice performance.", "", "As a further modified example of that shown inFIG.11, it may be possible that: the centers18cof the tie bars18are axially displaced from each other. Thereby, uneven wear of the first block13is suppressed.", "", "FIG.12shows a top view of the first block13as another example of the tie bar arrangement.", "", "In this first block13, the first sipe31to the fifth sipe35are arranged in order from one side to the other side in the tire circumferential direction.", "", "Each sipe15is divided into five equal parts in the longitudinal direction of the sipe, namely, a first part41, a second part42, a third part43, a fourth part44and a fifth part45.", "", "The first part41is arranged closest to the tread edge Te.", "", "The second part42is adjacent to the first part41on the tire equator C side.", "", "The third part43is adjacent to the second part42on the tire equator C side.", "", "The fourth part44is adjacent to the third part43on the tire equator C side.", "", "The fifth part45is adjacent to the fourth part44on the tire equator C side. That is, the fifth part45is positioned closest to the tire equator C among the five regions.", "", "In the example shown inFIG.12,the first position is located in the third part43of the first sipe31,the second position is located in the fourth part44of the second sipe32,the third position is located in the third part43of the third sipe33,the fourth position is located in the second part of the fourth sipe34, andthe fifth position is located in the third part43of the fifth sipe35.", "", "As a result, the tie bar arrangement lines36oscillate and extend in a wavy shape.", "", "Such arrangement of the sipes15helps to improve the on-ice performance and the load-bearing performance in a well-balanced manner.", "", "As a modified example of that ofFIG.12, it may be possible that the centers18cof the tie bars18are axially displaced from each other. Thereby, uneven wear of the first block13is suppressed.", "", "FIG.13shows a top view of the first block13as still another example of the tie bar arrangement. In this example,the first position is located in the first part41of the first sipe31,the second position is located in the third part43of the second sipe32,the third position is located in the fifth part45of the third sipe33,the fourth position is located in the third part of the fourth sipe34, andthe fifth position is located in the first part41of the fifth sipe35.", "", "As a result, the tie bar arrangement lines36are bent convexly toward the tire equator C.", "", "In such arrangement of the sipes15, since two tie bars18on the most tread edge Te side (the tie bar18of the first sipe31and the tie bar18of the fifth sipe35), are separated in the tire circumferential direction, improvement in wandering performance can be expected while obtaining the above effects.", "", "As a modified example of that shown inFIG.13, it is possible that the center18cof the tie bar18of the first sipe31and the center18cof the tie bar18of the fifth sipe35are displaced from each other in the tire axial direction.", "", "Further, it is possible that the center18cof the tie bar18of the second sipe32and the center18cof the tie bar18of the fourth sipe34are displaced from each other in the tire axial direction. Thereby, uneven wear of the first block13is suppressed.", "", "Hereinafter, the features of one sipe15will be described in more detail.", "", "The features described below are applicable to the first sipe31through fifth sipe35described above.", "", "As shown inFIG.4, the sipe15is divided into at least a first portion16and a second portion17in the sipe length direction by one tie bar18.", "", "In the region between the tie bar18and the ground contacting top surface13sof the first block13, the boundary between the first portion16and the second portion17is an imaginary line (not shown) which is obtained by extending the center line in the width direction of the tie bar18toward the outside in the tire radial direction.", "", "The bottom16dof the first portion16communicates with a first wide portion21having a circular cross section.", "", "The first wide portion21has a groove width larger than the sipe width in the first portion16as shown inFIG.5.", "", "The first wide portion21extends linearly along the sipe length direction of the first portion16over its entire length as shown inFIG.4.", "", "Similarly, the bottom17dof the second portion17communicates with a second wide portion22having a circular cross section as shown inFIGS.4and5.", "", "The second wide portion22has a groove width larger than the sipe width in the second portion17.", "", "The second wide portion22extends linearly along the sipe length direction of the second portion17over its entire length.", "", "The first wide portion21and the second wide portion22do not communicate with each other.", "", "Since the above-described sipe15comprises the first wide portion21and the second wide portion22, which are not in communication with each other.", "", "Even if the first block13collapses, strain is dispersed at the bottom of the sipe15, and damage to the sipe can be suppressed.", "", "In addition, since the first wide portion21and the second wide portion22exhibit excellent water absorption performance, the on-ice performance can be further improved.", "", "The shape of the cross section of the first wide portion21and the second wide portion22is not limited to circular, and may be triangular, for example.", "", "As shown inFIG.5, in the cross section of the sipe15, the sipe15extends in the tire radial direction with a constant width W2.", "", "Further, as shown inFIG.6, the sipe15extends in its length direction while maintaining the constant width W2described above. That is, the sipe15extends with the constant width W2over its entirety.", "", "For example, the width W2is preferably not more than 1.0 mm, more preferably 0.2 to 0.7 mm.", "", "As a result, the load bearing performance and the on-ice performance are improved in a well-balanced manner.", "", "The present disclosure is however, not limited to such configuration.", "", "Further, inevitable errors occurs in rubber products such as tires can be allowed.", "", "Therefore, the width of the sipe15may vary depending on its measurement position.", "", "In this case, it is preferable that the ratio W2M/W2mbetween the maximum value W2M and the minimum value W2m(not shown) of the width of the sipe15is not more than 2.0.", "", "The maximum value W2M is preferably 0.4 to 0.7 mm.", "", "The minimum value W2mis desirably 0.2 to 0.4 mm.", "", "As shown inFIG.7, the maximum depth d3from the ground contacting top surface13sof the first block13to the bottom of the first wide portion21is 4.0 to 9.0 mm. The maximum depth d4from the ground contacting top surface of the first block13to the bottom of the second wide portion22is 4.0 to 9.0 mm.", "", "As a result, the load bearing performance and the on-ice performance can be improved in a well-balanced manner.", "", "Preferably, the depth d3is the same as the depth d4.", "", "As shown inFIG.4, the first wide portion21extends linearly in the sipe length direction of the sipe15while maintaining a circular area in the cross section.", "", "As a result, the first wide portion21is configured in a columnar shape except for the communicating portion with the sipe15.", "", "The centers of the circular cross sections of the first wide portion21collectively form a central axis of the first wide portion21, and this central axis extends linearly.", "", "The same applies to the second wide portion22.", "", "However, the first wide portion21and the second wide portion22are not limited to such linearly extending shape, and the central axis may extend in a zigzag shape.", "", "As shown inFIG.5, the diameter L1in the cross section of the first wide portion21is preferably not less than 2.0 times, more preferably not less than 3.0 times, but preferably not more than 6.0 times, more preferably not more than 5.0 times the width W2of the sipe15in the cross section.", "", "As a result, the above effects can be obtained while demonstrating excellent dimoldability during tire production.", "", "In addition, the above-mentioned “width in the cross section of the sipe15” means the constant width W2in this embodiment, and means the maximum width when the width varies depending on the measurement position.", "", "From a similar point of view, the diameter of the second wide portion22in its cross section is preferably not less than 2.0 times, more preferably not less than 3.0 times, but preferably not more than 6.0 times, more preferably not more than 5.0 times the width of the sipe15in its cross section.", "", "As shown inFIG.2, the tread portion2in the present embodiment comprises a cap tread rubber layer Cg and a base tread rubber layer Bg.", "", "The cap tread rubber layer Cg forms a ground contacting surface of the tread portion2.", "", "The base tread rubber layer Bg is disposed radially inside the cap tread rubber layer Cg.", "", "The rubber hardness of the cap tread rubber layer Cg is, for example, in a range from 40 to 65 degrees.", "", "The base tread rubber layer Bg has a rubber hardness greater than that of the cap tread rubber layer Cg.", "", "The rubber hardness of the base tread rubber layer Bg is, for example, in a range from 65 to 90 degrees.", "", "In this specification, the rubber hardness means the type-A durometer hardness measured at 23 deg. C. according to Japanese Industrial Standard (JIS) K6253.", "", "In the present embodiment, the distance t2in the tire radial direction from the ground contacting surface of the tread portion2to the boundary25between the cap tread rubber layer Cg and the base tread rubber layer Bg, is in a range from 30% to 70% of the total thickness t1of the tread rubber.", "", "On the other hand, as shown inFIG.5, the minimum distance t3in the tire radial direction from the boundary25to the bottoms of the first wide portion21and the second wide portion22is not less than 0.5 mm, preferably from 1.5 mm to 4.0 mm.", "", "This effectively suppresses rubber separation at the boundary25due to deformation of the first wide portion21and the second wide portion22.", "", "While detailed description has been made of preferable embodiments of the present disclosure, the present disclosure can be embodied in various forms without being limited to the illustrated embodiments."], "claims": ["each of the plurality of sipes has a zigzag portion in a cross section perpendicular to the length direction of the sipe, and a zigzag portion in a cross section parallel to the ground contacting top surface of the first block, each of the plurality of sipes is provided with a tie bar protruding radially outwardly from a bottom of the sipe and terminating without reaching the ground contacting top surface, and the plurality of sipes includes a first sipe having the tie bar at a first position in the tire axial direction, and a second sipe having the tie bar at a second position in the tire axial direction different from the first position.", "said at least one first block is a plurality of the first blocks arranged in the tire circumferential direction so as to form a tread edge of the tread portion.", "the first position of the first sipe is located in a central part when the first sipe is divided into three equal parts in the sipe length direction, and the second position of the second sipe is located in a center part when the second sipe is divided into three equal parts in the sipe length direction.", "the first position of the first sipe is located in a central part when the first sipe is divided into three equal parts in the sipe length direction, and the second position of the second sipe is located in a center part when the second sipe is divided into three equal parts in the sipe length direction.", "in a top view of the first block, a virtual zone, which is formed by extending an axial extent of the tie bar of the first sipe toward the second sipe in parallel with the tire circumferential direction, partially overlaps with the tie bar of the second sipe.", "in a top view of the first block, a virtual zone, which is formed by extending an axial extent of the tie bar of the first sipe toward the second sipe in parallel with the tire circumferential direction, partially overlaps with the tie bar of the second sipe.", "in a top view of the first block, a virtual zone, which is formed by extending an axial extent of the tie bar of the first sipe toward the second sipe in parallel with the tire circumferential direction, partially overlaps with the tie bar of the second sipe.", "in a top view of the first block, a virtual zone, which is formed by extending an axial extent of the tie bar of the first sipe toward the second sipe in parallel with the tire circumferential direction, partially overlaps with the tie bar of the second sipe.", "in a top view of the first block, a virtual zone, which is formed by extending an axial extent of the tie bar of the first sipe toward the second sipe in parallel with the tire circumferential direction, does not overlap with the tie bar of the second sipe.", "in a top view of the first block, a virtual zone, which is formed by extending an axial extent of the tie bar of the first sipe toward the second sipe in parallel with the tire circumferential direction, does not overlap with the tie bar of the second sipe.", "in a top view of the first block, a virtual zone, which is formed by extending an axial extent of the tie bar of the first sipe toward the second sipe in parallel with the tire circumferential direction, does not overlap with the tie bar of the second sipe.", "in a top view of the first block, a virtual zone, which is formed by extending an axial extent of the tie bar of the first sipe toward the second sipe in parallel with the tire circumferential direction, does not overlap with the tie bar of the second sipe.", "in the first block, the first sipe and the second sipe are alternately arranged in the tire circumferential direction.", "in the first block, the first sipe and the second sipe are alternately arranged in the tire circumferential direction.", "in the first block, the first sipe and the second sipe are alternately arranged in the tire circumferential direction.", "the plurality of sipes includes a third sipe having the tie bar at a third position in the tire axial direction different from the first position and the second position.", "the plurality of sipes includes a third sipe having the tie bar at a third position in the tire axial direction different from the first position and the second position.", "the plurality of sipes includes a third sipe having the tie bar at a third position in the tire axial direction different from the first position and the second position.", "the second sipe is arranged between the first sipe and the third sipe, and the second position is between the first position and the third position in the tire axial direction."], "bibtex": "@patent{20240198731,\n    title = {TIRE},\n    number = {20240198731},\n    year = {2024},\n    note = {File: US20240198731A1-20240620.XML}\n    }", "classification": "B60C1103FI"}]