[{"title": "WHEEL COVER", "doc_number": "20240286432", "filename": "US20240286432A1-20240829.XML", "abstract": "A wheel cover includes a fixing unit fixed to a wheel of a vehicle, a variable unit coupled to and supported by the fixing unit and configured for being opened and closed, a first power unit configured to apply a first force acting on the variable unit, wherein the force changes depending on temperature, and a second power unit configured to apply a second force acting on the variable unit, wherein the second force changes depending on a wheel speed, wherein the variable unit is opened or closed depending on the first force generated by the first power unit and the second force generated by the second power unit.", "detailed_description": ["Reference will now be made in detail to various embodiments of the present disclosure(s), examples of which are illustrated in the accompanying drawings and described below. While the present disclosure(s) will be described in conjunction with exemplary embodiments of the present disclosure, it will be understood that the present description is not intended to limit the present disclosure(s) to those exemplary embodiments of the present disclosure. On the other hand, the present disclosure(s) is/are intended to cover not only the exemplary embodiments of the present disclosure, but also various alternatives, modifications, equivalents and other embodiments, which may be included within the spirit and scope of the present disclosure as defined by the appended claims.", "", "Hereinafter, various embodiments of the present disclosure will be described with reference to the appended drawings.", "", "Various embodiments will be described with reference to accompanying drawings. However, this does not necessarily limit the scope of the embodiments to a specific embodiment form. Instead, modifications, equivalents and replacements included in the included concept and technical scope of the present description may be employed. Throughout the specification, similar reference numerals are used for similar elements.", "", "The terms “first,” “second,” and the like may be used to distinguish one element from the other, and may not limit a sequence and/or an importance, or others, in relation to the elements. In some cases, a first element may be referred to as a second element, and similarly, a second element may be referred to as a first element without departing from the scope of right of the embodiments.", "", "The terms, “include,” “comprise,” “is configured to,” or the like of the description are used to indicate the presence of features, numbers, steps, operations, elements, parts or combination thereof, and do not exclude the possibilities of combination or addition of one or more features, numbers, steps, operations, elements, parts or combination thereof.", "", "Unless otherwise defined, all terms used herein, including technical or scientific terms, include the same meanings as those which would be generally understood by those with ordinary knowledge in the field of art to which the present disclosure belongs. Terms such as those defined in a generally used dictionary are to be interpreted as having meanings equal to the contextual meanings in the relevant field of art, and are not to be interpreted as having ideal or excessively formal meanings unless clearly defined as having such in the present application.", "", "FIG.1is a perspective diagram illustrating a wheel20including a wheel cover10mounted thereon according to an exemplary embodiment of the present disclosure.FIG.2is a cross-sectional diagram illustrating a wheel20including a wheel cover10mounted thereon according to an exemplary embodiment of the present disclosure.FIG.3is an exploded diagram illustrating a wheel cover10mounted thereon according to an exemplary embodiment of the present disclosure.FIG.4AandFIG.4Bare perspective diagrams illustrating a closed state (FIG.4A) and an open state (FIG.4B) of a wheel cover10according to an exemplary embodiment of the present disclosure.FIG.5is a diagram illustrating a wheel cover according to an exemplary embodiment of the present disclosure, viewed from below.FIG.6is a diagram illustrating a state in which a fixing unit200is mounted on a wheel20according to an exemplary embodiment of the present disclosure.", "", "Referring toFIG.1andFIG.2, the wheel cover10according to the exemplary embodiment of the present disclosure may be coupled to the external side of the wheel20provided in the vehicle. The braking device30may be disposed on the internal side of the wheel20and may be coupled through the wheel20and the wheel bolt31. The wheel cover10may be fixed using the wheel20and the wheel bolt31. In other words, the braking device30and the wheel cover10may be coupled and fixed to the wheel20through the wheel bolt31with the wheel20interposed therebetween.", "", "The wheel cover10according to the exemplary embodiment of the present disclosure may be coupled to the external side of the wheel20including the braking device30disposed on the internal side thereof, and may open or close the external side surface of the wheel20, allowing air to flow through the wheel20or preventing the flow of air. Also, by fixing to the wheel using the wheel bolt31, the wheel cover10may be mounted on the existing wheel20without modifying the wheel20provided in the existing vehicle so that compatibility may be high.", "", "Referring toFIG.3, the wheel cover10according to the exemplary embodiment of the present disclosure may include a variable unit100and a fixing unit200. The shape of the variable unit100may change according to a rotation state of the wheel20or the temperature of the braking device30. As a rotation speed of the wheel20increases, force may actin the direction in which the variable unit100is closed, and as the temperature of the braking device30increases, force opening the variable unit100may arise. The variable unit100may be opened or closed based on a balance between the force generated by the rotation speed of the wheel20and the force generated as the temperature of the braking device30increases.", "", "The fixing unit200may be fixed to the wheel20and may rotate integrally with the wheel20. The fixing unit200may support the variable unit100by being coupled with the variable unit100along a circumferential surface. That is, the fixing unit200is coupled to and supported by the variable unit100on one side surface, and the fixing unit200may be fixed to the wheel20on the other side surface so that the fixing unit200and the variable unit100may be attached to the wheel.", "", "Referring toFIG.4, the variable unit100may include a central plate110, a variable plate120, and a fixing unit coupling plate140, and the central plate110and the variable plate120may form a kirigami structure. The variable unit100may include a substantially circular plate shape. The central plate110may include a substantially circular plate shape at the center portion of the variable unit100. The central plate110may be connected to the second power unit400and the first power unit300, which will be described later, and may move forwards and backwards along the axial direction of the wheel20according to forces generated by the second power unit400and the first power unit300.", "", "The fixing unit coupling plate140may be separated from the external circumferential surface of the fixing unit200to the internal side and may be fixed through a bolt penetrating a coupling hole formed along the circumference and a nut fixing the same. However, an exemplary embodiment thereof is not limited thereto, and various known fixing members may be applied in addition to bolts and nuts. The fixing unit coupling plate140may be coupled to the fixing unit200to support the variable unit100, and may be fixed to the wheel20to rotate together with the rotating fixing unit200.", "", "The variable plate120may have one side coupled to the circumferential surface of the central plate110and the other side coupled to the internal circumferential surface of the fixing unit coupling plate140. The variable plate120may be rotatably coupled to the central plate110or the fixing unit coupling plate140through pins. However, an exemplary embodiment thereof is not limited thereto, and the variable plate120may be coupled to various rotatable coupling members such as hinges. Here, the variable plate120may include a plurality of plates including a spiral shape. The variable plate120may connect the central plate110to the fixing unit coupling plate140, and the variable plate120, the central plate110, and the fixing unit coupling plate140may be coupled to each other and may form a kirigami structure. When the central plate110and the fixing unit coupling plate140are present on the same plane, the variable unit100, the central plate110, the variable plate120, and the fixing unit coupling plate140may form a circular plate, and air flow to flow into the wheel20through the variable unit100may be blocked. Furthermore, when the central plate110moves along the axial direction of the wheel20, the central plate110and the fixing unit coupling plate140may be present on a plane in different positions, and the central plate110and the fixing unit coupling plate140may be connected to the variable plate120. In the instant case, a space may be formed between the variable plates120so that air may flow through the variable unit100and may flow to the internal side of the wheel20. Here, the shape of the variable plate120may form a kirigami structure including a spiral line toward the central plate110. Depending on the shape and angle formed by the variable plate120, the variable plate120may function as a turbine structure, and may efficiently discharge the heated air in to the external side thereof. However, an exemplary embodiment thereof is not limited thereto, and the kirigami structure formed by the variable plate120may be designed and manufactured to have various shapes and angles.", "", "Also, a connection plate130provided between the central plate110and the variable plate120may be further included according to elastic force of the material forming the variable unit100. When the material forming the variable unit100is elastic, the variable plate120may expand and reduce without a connection plate130, and the central plate110may move back and forth along the axial direction of the wheel20.", "", "When the material forming the variable unit100is not elastic, even when force is applied to the central plate110, variable unit100may be bound to the central plate110and the fixing unit coupling plate140so that the variable plate120may not change. Accordingly, the variable unit100may further include a connection plate130to compensate for insufficient elastic force. The connection plate130may be disposed between the central plate110and the variable plate120and may be rotatably coupled to each of the central plate110and the variable plate120. The connection plate130may allow the central plate110, the variable plate120, and the fixing unit coupling plate140to move flexibly so that the central plate110, the variable plate120, the connection plate130and the fixing unit coupling plate140formed of materials lacking elastic force may be naturally deformed. When the central plate110rises, the central plate110, the variable plate120, the connection plate130and the fixing unit coupling plate140coupled to each other to be rotatable may change shapes thereof through a coupling portion through which the central plate110, the variable plate120, the connection plate130and the fixing unit coupling plate140may relatively rotate according to the movement of the central plate110. The wheel cover even when according to the exemplary embodiment of the present disclosure may form a kirigami structure even without elastic force using the central plate110, the variable plate120, the connection plate130and the fixing unit coupling plate140rotatably coupled to each other. However, the position of the connection plate130may not be limited thereto. The connection plate130may be disposed between the fixing unit coupling plate140and the variable plate120and may be rotatably coupled to each of the fixing unit coupling plate140and the variable plate120. Also, one or more connection plates130may be disposed between the central plate110and the variable plate120or between the fixing unit coupling plate140and the variable plate120. When the material forming the variable unit100is not elastic, when more connection plates130are placed, force limiting the movement of the central plate110may be reduced, but additional components (e.g., the addition of a hinge coupling portion) and process may be added. Accordingly, the number of connection plates130may be appropriately selected in consideration of characteristics of the material and the manufacturing process.", "", "Referring toFIG.5andFIG.6, the fixing unit200may include a wheel coupling unit210, a variable unit coupling plate240, and a support unit250.", "", "The wheel coupling unit210may include a first coupling hole220formed in a position corresponding to the wheel bolt31, and a second coupling hole230formed at least greater than the direct diameter of the shaft21in the center portion. The wheel coupling unit210may be coupled to the wheel20and the braking device30through the first coupling hole220and the wheel bolt31, so that the deformation of the existing wheel20may be reduced using the coupling portion of the existing wheel20as is, possibility of compatibility with the existing wheel20may increase, and an increase in weight may be prevented as additional components for mounting the wheel cover is not necessary. Also, by forming the second coupling hole230, the wheel coupling unit210may not interfere with the shaft21while rotating together with the wheel20. Also, the first power unit300and the second power unit400to be described later may be connected to the central plate110of the variable unit100through the second coupling hole230.", "", "The variable unit coupling plate240may be coupled to the fixing unit coupling plate140of the variable unit100and may support the variable unit100. The variable unit coupling plate240may be a donut-shaped disk including a shape corresponding to the fixing unit coupling plate140. The variable unit coupling plate240may be coupled to the fixing unit coupling plate140and may rotate integrally. The variable unit coupling plate240and the fixing unit coupling plate140may form coupling holes in positions corresponding to each other, and may be coupled through bolts penetrating the coupling holes and nuts fixing the bolts. However, an exemplary embodiment thereof is not limited thereto, and the variable unit coupling plate240and the fixing unit coupling plate140may be fixed using various known techniques such as rivet coupling.", "", "The support unit250may connect the wheel coupling unit210to the variable unit coupling plate240and may support the wheel coupling unit210to the variable unit coupling plate240. The support unit250may be disposed in a space between the spokes SP of the wheel20and may be in a form of a plate including a predetermined thickness and length. One side of the support unit250may be fixed to the wheel coupling unit210and the other side may be fixed to the variable unit coupling plate240. When the wheel coupling unit210rotates together with the wheel20, the variable unit coupling plate240connected through the support unit250, the variable unit coupling plate240and the wheel coupling unit210may rotate with the wheel20.", "", "FIG.7is a diagram illustrating a second power unit400according to an exemplary embodiment of the present disclosure.", "", "Referring toFIG.7, the wheel cover10according to the exemplary embodiment of the present disclosure may include a second power unit400. The second power unit400may be configured to close the wheel cover10based on a change in the magnitude of centrifugal force generated as the wheel20rotates. The second power unit400may include a guide slide410, a weight420, an elastic member440, and a wire430.", "", "The second power unit400may include a wire430including one end portion fixed to a portion of the lower surface of the central plate110and the other end portion connected to the elastic member440, and the elastic member440connected to the wire430. An elastic member440including one end portion coupled to the wire430and the other end portion fixed to a portion of the variable unit coupling plate240may be included. The elastic member440may form elastic force so that the central plate110may move in a direction to close the wheel cover10.", "", "The weight420may be disposed between the wire430and the elastic member440. The weight420may generate centrifugal force corresponding to the rotation speed of the wheel20of the vehicle, adjusting the force acting to move the central plate110in the direction of closing the wheel cover10. Here, the elastic member440may allow the elastic force to act in the same direction as the centrifugal force of the weight420, and may also continuously apply the elastic force to the weight420so that the weight420may be prevented from deviating from the path or vibrating excessively.", "", "The guide slide410may prevent the wire430and elastic member440connected to both sides of the weight420, which may linearly move back and forth according to the position of the central plate110, from deviating from the path, vibrating excessively, or colliding with other components. The guide slide410may be disposed below the support unit250to reduce obstruction of the air flow through the space between the spokes SP when the variable unit100is opened. However, an exemplary embodiment thereof is not limited thereto, and the guide slide410may be disposed spaced from the support unit250in the space between the spokes SP.", "", "The second power unit400may further include a wear prevention unit450. The wear prevention unit450may connect the weight420to the central plate110so that the wire430moving together with the weight420and the central plate110may move smoothly, and abrasion due to repetitive movement of the wire430may be prevented. The wear prevention unit450may include an annular shape including a larger external diameter than that of the central plate110. The wire430may have different moving paths in contact with the wear prevention unit450. For example, the wire430moves between the wear prevention unit450and the central plate110with a vertical component with respect to the guide slide410, and may move along the guide slide410between the wear prevention unit450and the weight420. That is, the wire430may move together with the weight420and the central plate110, and may be supported by and in contact with the wear prevention unit450so that the moving direction may change. Accordingly, as the weight420and the central plate110move, the wire430may repeatedly rub against the wear prevention unit450, and the wear prevention unit450may include an annular shape including a predetermined thickness to reduce friction with the wire430and to sufficiently withstand wear. The wear prevention unit450may include a shape of a roller allowing the wire430to naturally move, and various components for preventing wear of the second power unit400by the wire430may be applied.", "", "Referring toFIG.7, the force generated by the second power unit400to close the variable unit100may be proportional to the centrifugal force generated by the weight420. When the force generated by the weight420may be represented by in Equation 1 as below:", "", "Fz=Fc·sin(θ)=m·r·w2·sin(θ)=m·(r0−h)·w2·sin(θ)  [Equation 1]", "", "Here, Fzmay be the force to close the variable unit100acting on the center portion, Fcmay be the centrifugal force generated by the weight420, w may be the rotation speed of the wheel20, r may be the distance from the center of rotation to the weight420in a rotating state, r0may be the distance from the center of rotation of the variable unit100to the weight420in a closed state, h may be the height difference between the weight420and the central plate110, m may be the mass of weight420, and0may be an angle of force applied to the central plate110by the wire430.", "", "FIG.8Ais a diagram illustrating a thermo-responsive elastic member in a form of a leaf spring according to an exemplary embodiment of the present disclosure.FIG.8Bis a diagram illustrating a thermo-responsive elastic member in a form of a coil spring according to an exemplary embodiment of the present disclosure.FIG.9is an exploded diagram illustrating a thermo-responsive elastic member310in a form of a leaf spring according to an exemplary embodiment of the present disclosure.FIG.10AandFIG.10Bare diagrams illustrating a process of manufacturing a thermo-responsive elastic member310in a form of a leaf spring according to an exemplary embodiment of the present disclosure.FIG.11is a diagram illustrating a process of manufacturing a thermo-responsive elastic member310in a form of a coil spring according to an exemplary embodiment of the present disclosure.FIG.12is a diagram illustrating a change in form of a thermo-responsive elastic member310including a form of leaf spring depending on temperature according to an exemplary embodiment of the present disclosure.FIG.13is a diagram illustrating a change in form of a thermo-responsive elastic member310including a form of coil spring depending on temperature according to an exemplary embodiment of the present disclosure.", "", "The wheel cover10according to the exemplary embodiment of the present disclosure may include a first power unit300. The first power unit300may be configured to generate force to move the central plate110so that the variable unit100may be opened. In other words, the second power unit400may be configured to generate force to move the central plate110in the direction in which the variable unit100is closed, and the first power unit300may be configured to generate force to move the central plate110in a direction in which the variable unit100is opened. The variable unit100may be opened or closed due to a difference in power generated by the first power unit300and the second power unit400. For example, when the force generated by the second power unit400is greater than the force generated by the first power unit300, and when the force generated by the first power unit300is greater than the force generated by the second power unit400, the variable unit100may be opened.", "", "The first power unit300may include a thermally responsive elastic member310provided below the central plate110. The elastic force of the thermally responsive elastic member310acting on the central plate may change depending on temperature. The thermally responsive elastic member310may be formed of a material of which shape changes in a specific temperature range (e.g., nickel-titanium shape memory alloy (SMA)). The elastic force generated by the thermally responsive elastic member310may change nonlinearly with respect to temperature. For example, the shape of the thermally responsive elastic member310may change in a specific temperature range determined according to a heat treatment process for manufacturing the thermally responsive elastic member310, and accordingly, elastic force generated by the thermally responsive elastic member310may rapidly increase within a predetermined temperature range.", "", "However, the thermally responsive elastic member is not limited to a shape memory alloy and may be formed of various materials of which shape changes with temperature. For example, the thermally responsive elastic member may be formed of bi-metal. Here, the bimetal may be formed by overlapping and attaching two types of thin metals including different degrees of expansion and reduction depending on temperature changes, and may be a material bending to one side when the temperature changes due to different coefficients of thermal expansion. As for the bimetal, when the temperature rises, a metal plate including a high thermal expansion coefficient may expand more and may be bent to the side with a small thermal expansion coefficient, and when the temperature decreases, the plate may be restored to an original state thereof. Accordingly, the bimetal may be manufactured to be bent at a predetermined temperature, and the first power unit including the bimetal may open the variable unit at a predetermined temperature by deformation of the bimetal.", "", "Referring toFIGS.8A and8B, the thermally responsive elastic member310may include a leaf spring shape and a coil spring shape.", "", "Referring toFIGS.8A,9,10A and10B, the thermally responsive elastic member310in a form of a leaf spring may be formed of different materials, may include a first plate311and a second plate312in a form of plates including shapes corresponding to each other, and the first plate311and the second plate312may be fixed using fixing members313on both sides of the first plate311and the second plate312. The fixing member313may be a rivet, but an exemplary embodiment thereof is not limited thereto, and various known means for coupling the two plates, such as bolt and nut coupling, may be used.", "", "The thermally responsive elastic member310in a form of a leaf spring may be heat treated while being fixed to the first jig314so that the shape may be changed in a target temperature range. Here, referring toFIG.10, both side ends of the first plate311and the second plate312may be coupled to each other through the fixing member313in a state in which the height adjusting member316of the first jig314is disposed therebetween. Here, by adjusting the size of the height adjusting member316, the height formed by the change of the thermally responsive elastic member310in a form of a leaf spring in a specific temperature range may be adjusted. Also, by coupling the flange nuts315to both sides of the height adjusting member316, the first plate311and the second plate312may be prevented from being separated during the heat treatment process. Through the above-described process, the first plate311and the second plate312may be heat-treated while the first plate311and the second plate312are fixed to the first jig314. Here, the first plate311and the second plate312fixed to the first jig314may be enclosed with a member (e.g., aluminum foil) for preventing oxidation, may be inserted into an electric furnace and may be heated so that oxidation of the first plate311and the second plate312may be prevented during the heat treatment process. Here, the first plate311and the second plate312fixed to the first jig314with a member preventing oxidation (e.g., aluminum foil) may be heat-treated for 30 minutes at 500 degrees Celsius in an electric furnace, and thereafter, the plates may be heat-treated by cooling at room temperature (approximately 25 degrees Celsius). The thermally responsive elastic member310in a form of a leaf spring formed through the above process may rapidly change a shape thereof between approximately 30 degrees and 50 degrees. However, an exemplary embodiment thereof is not limited thereto, and the heat treatment temperature and heat treatment holding time of the thermally responsive elastic member310may be varied depending on the type of material of the thermally responsive elastic member310and the target deformation temperature.", "", "Referring toFIG.11together withFIG.8B, the thermally responsive elastic member310may include a coil spring shape. The thermally responsive elastic member310in a form of a coil spring may be manufactured by heating a shape memory alloy wire317by winding the wire around a cylindrical second jig318in which a spiral groove is formed. Here, the spiral groove formed in the second jig318may be formed as a spiral groove including various widths according to a target height of the thermally responsive elastic member310and the required elastic force. After enclosing the shape memory alloy wire317wound along the spiral groove of the second jig318with a member for preventing oxidation along with the second jig318, the wire may be inserted into an electric furnace, may be heat-treated at 500 degrees Celsius for 30 minutes, and may be cooled at room temperature (approximately 25 degrees Celsius). The temperature and heat treatment time applied in the heat treatment process are not limited thereto, and may be varied according to the type of material of the thermally responsive elastic member310and the target deformation temperature.", "", "Referring toFIG.12, andFIG.13, shapes of the thermally responsive elastic member310in a form of a leaf spring or the thermally responsive elastic member310in a form of a coil spring may change based on the temperature changing according to heat generated by the braking device. The thermally responsive elastic member310may generate more force to return to an original shape thereof in a predetermined temperature range so that the elastic force may rapidly increase nonlinearly. Referring toFIG.12, in the thermally responsive elastic member310in a form of a leaf spring, in a state in which no heat is applied, one surfaces of the first plate311and the second plate312may be in contact with each other. When a predetermined level of heat is applied to the thermally responsive elastic member310in a form of a leaf spring, the first plate311and the second plate312are deformed in a form of being spaced from each other while both end portions are coupled to each other so that elastic force may be generated. Here, according to the experimental results, it was confirmed that the elastic modulus increased in proportion to the number of stacked thermally responsive elastic members310in a form of leaf springs when stacked vertically. Accordingly, by adjusting the number of the thermally responsive elastic members310in a form of leaf springs, the required elastic force may be secured.", "", "Also, the thermally responsive elastic member310in a form of a coil spring, which was in a compressed state in a predetermined temperature range, may generate force to return to the length of the heat treatment state, that is, to a state before being compressed. Accordingly, the elastic force of the thermally responsive elastic member310in a form of a coil spring may rapidly increase in a predetermined temperature range.", "", "After heating for 30 minutes at 500 degrees Celsius through an electric furnace, performance of the thermally responsive elastic member310performed by cooling at room temperature was tested. According to the result, the thermally responsive elastic member310was rapidly deformed between about 30 degrees Celsius and about 50 degrees Celsius, and the deformation was completed at about 70 degrees Celsius. Here, the performance test of the thermally responsive elastic member310was performed by adjusting the temperature of the water in a state in which the thermally responsive elastic member310was placed in water so that heat was constantly applied to the thermally responsive elastic member310, and the test was conducted while monitoring the temperature of the water in real time through the temperature sensor. A weight was provided on the upper end portion of the thermally responsive elastic member310, and the test was conducted while heating water and observing changes in the thermally responsive elastic member310. Here, the test was repeatedly performed while changing the weight of the weight on the upper end portion of the thermally responsive elastic member310, and the lifting distance and heating time of the weight changed by the thermally responsive elastic member310according to the weight of the weight was observed to test the performance of the thermally responsive elastic member310.", "", "FIG.14Ais a diagram illustrating an operation of a first power unit300including a thermo-responsive elastic member310in a form of a leaf spring according to an exemplary embodiment of the present disclosure.FIG.14Bis a diagram illustrating an operation of a first power unit300including a thermo-responsive elastic member310in a form of a leaf spring according to an exemplary embodiment of the present disclosure.", "", "As illustrated exemplarily inFIG.14A, the thermally responsive elastic members310in a form of leaf springs may be vertically stacked. In the instant case, the elastic modulus of the two stacked thermally responsive elastic members310may be twice the elastic modulus of one thermally responsive elastic member310. In other words, the thermally responsive elastic member310in a form of a leaf spring may increase the modulus of elastic force in proportion to the number of the stacked thermally responsive elastic members310. Accordingly, the elastic force generated by a predetermined temperature range may be adjusted through the number of thermally responsive elastic members310in a form of leaf springs. As illustrated inFIG.14AandFIG.14B, shapes of both the thermally responsive elastic members310in a form of a leaf spring and a coil spring may change in a predetermined range of temperature, and the variable unit100may be opened by raising the central plate110through the changed shape in a predetermined range of temperature.", "", "FIG.15AandFIG.15Bare diagrams illustrating a heat transfer unit according to an exemplary embodiment of the present disclosure.FIG.16AandFIG.16Bare diagrams illustrating a change in temperature depending on a thickness of a heat transfer unit according to an exemplary embodiment of the present disclosure.", "", "As described above, when the rotation speed of the wheel increases, the centrifugal force generated by the weight420of the second power unit400may increase. Due to the centrifugal force, the weight420may move in a direction away from the center, and the central plate110connected to the weight420by the wire430may move down as the weight420moves, and the variable unit100may be closed. In the state in which the variable unit100is closed, air does not flow into the wheel20, and the braking device30disposed in the wheel20may be overheated and the temperature may rise. When the temperature in the wheel20increases, the shape of the thermally responsive elastic member310may change due to the heat generated by the braking device30, and the elastic force may increase according to the change in shape and the central plate110may move up so that the variable unit100may be opened. When the variable unit100is opened, air may flow into the open space of the variable unit100so that the overheated braking device30may be cooled. In other words, the thermally responsive elastic member310may open the variable unit100by heat generated by the overheated braking device30, and may cool the braking device30by allowing air to flow into the open space. The thermally responsive elastic member310may need to receive maximum heat generated by the braking device30to prevent the braking device30from being excessively overheated. In other words, the thermally responsive elastic member310may need to operate sensitively to temperature changes in the braking device30. Accordingly, the wheel cover10according to the exemplary embodiment of the present disclosure may further include a heat transfer unit320for transferring heat generated by the brake disc to the thermally responsive elastic member310.", "", "Referring toFIG.15AandFIG.15B, the heat transfer unit320may include a heat transfer plate323for receiving heat by being in contact with a cylindrical body portion321with both sides open and a portion of the braking device30(e.g., a brake disc), and a connection portion322for connecting the body portion321to the heat transfer unit320. The heat transfer unit320may be formed of a metal (e.g., copper) including excellent thermal conductivity and corrosion resistance, but an exemplary embodiment thereof is not limited thereto.", "", "The body portion321may include a thermally responsive elastic member310disposed therein, and may include a shape of cylinder to not interfere with the shaft21of the wheel20. Because the body portion321includes a shape of cylinder, interference with existing devices such as the shaft21may be avoided, and heat may be transferred to the thermally responsive elastic member310disposed therein.", "", "The heat transfer plate323may be disposed in the space between the braking device30and the wheel20, may be in direct contact with a portion (e.g., a brake disc) of the braking device30, and may transfer heat. The heat transfer plate323may be in a form of a plate including a wide cross-sectional area, and may absorb heat generated by securing a sufficient contact area with the braking device30.", "", "The heat transfer plate323may be connected to the body portion321through at least one connection portion322, and the at least one connection portion322may transfer heat absorbed by the heat transfer plate323to the body portion321. Heat generated by the braking device30may be transferred to the heat transfer plate323in contact with the braking device30, and heat transferred to the heat transfer plate323may be transferred to the body portion321via the connection portion322. The body portion321may transfer heat to the thermally responsive elastic member310disposed in the cylindrical structure.", "", "FIG.16AandFIG.16Bare diagrams illustrating the heat transfer capability according to the thickness of the body portion and the thickness of the connection portion of the heat transfer unit, illustrating simulation results by determining an ambient temperature of 25° C. and a brake heating temperature of 100° C. with respect to a heat transfer plate model formed of copper.", "", "FIG.16Aillustrates the temperature change according to the thickness of the body portion as an example. Referring toFIG.16A, it may be indicated that as the thickness of the body portion decreased, the heat generated by the brake was more properly transferred to the space in which the thermally responsive elastic member is disposed. As the thickness of the body portion decreased, heat capacity decreased so that the temperature of the body portion including a thin thickness may change more rapidly than that of the body portion including a thick thickness.", "", "Also,FIG.16Billustrates the temperature change according to the thickness of the connection portion as an example. Referring toFIG.16B, as the thickness of the connection portion decreased, the heat may be more properly transferred. Because the connection portion transfers the heat absorbed by the heat transfer plate to the body portion mainly through heat conduction, as the cross-sectional area of the heat transfer unit increased, more heat may be transferred smoothly. It may be indicated that the temperature changed faster when the thickness of the connection portion was greater than when the thickness of the connection portion was thin.", "", "FIG.17A,FIG.17BandFIG.17Care diagrams illustrating an operation process of a wheel cover10according to an exemplary embodiment of the present disclosure.", "", "Referring toFIG.17, the central plate110may move up by the first power unit300or may move down by the second power unit400according to forces acting on the first power unit300and the second power unit400so that the position thereof may change.", "", "First, as illustrated inFIG.17A, when the vehicle is not traveling, to enhance aesthetics of an exterior of a vehicle, the variable unit100may remain open due to the elastic force of the thermally responsive elastic member310.", "", "Thereafter, as illustrated inFIG.17B, the force generated by the second power unit400may be resultant force of the elastic force of the elastic member440through the wire430fixed to the lower portion of the central plate110and the centrifugal force changing according to the rotation speed of the wheel20, and may close the variable unit100. Also, as illustrated inFIG.17C, the force generated by the first power unit300may open the variable unit100by elastic force of the thermally responsive elastic member310disposed below the central plate110, in particular, the elastic force of the thermally responsive elastic member310increased by receiving the heat generated from the braking device30.", "", "In other words, the forces generated by the first power unit300and the second power unit400may actin opposite directions, and the magnitude of the force generated by the first power unit300and the second power unit400may change based on the speed of the wheel20and the temperature of the braking device30. The variable unit100may be opened or closed by changing the position of the central plate110according to the resultant force generated by the first power unit300and the second power unit400.", "", "Referring toFIG.7and Equation 1 together withFIG.17, the force to close the variable unit100may increase in proportion to the mass of the weight420and may increase in proportion to the square of the rotation speed of the wheel20, and may decrease slightly as the height of the central plate110increases. by appropriately adjusting the mass of the weight420, the magnitude of the force generated by the second power unit400may be adjusted. Accordingly, by determining the mass of the weight420by comparing the elastic force of the variable unit100, the opening amount and timing of the variable unit100may be adjusted. For example, when the mass of the weight420is excessive large, the thermally responsive elastic member310may be applied with centrifugal force greater than the elastic force increased with temperature so that the variable unit100may not open, and the braking device30may be cooled. Furthermore, when the mass of the weight420is determined to be excessive low, centrifugal force smaller than the elastic force of the thermally responsive elastic member310in the initial state may act so that the variable unit100may not be closed and air resistance may not be reduced.", "", "Similarly, the temperature at which the elastic force and shape generated by the first power unit300may change may be changed. However, the temperature range in which the elastic force and shape generated by the first power unit300rapidly change may be determined by the method of manufacturing the thermally responsive elastic member310(e.g., the heat treatment temperature, the height of the height adjusting member316, or the shape of the groove of the second jig318). Also, the elastic modulus of the thermally responsive elastic member310in a form of a leaf spring increases in proportion to the number of thermally responsive elastic members310to be mounted, and accordingly, the elastic force may be adjusted by adjusting the number of thermally responsive elastic members310.", "", "Accordingly, in the wheel cover10according to the exemplary embodiment of the present disclosure, by adjusting the mass of the weight420of the second power unit400and the method of manufacturing the thermally responsive elastic members310or the number of the thermally responsive elastic members310of the first power unit300, the wheel cover10may be closed at a target speed and may be opened in a temperature range in which overheating of the braking device30may not occur.", "", "The wheel cover10in the exemplary embodiment of the present disclosure may include at least two embodiments according to an initial state, that is, a state in which the wheel20does not rotate and no heat is generated by the braking device30.", "", "Various exemplary embodiments of the present disclosure may be various exemplary embodiments in which the variable unit100may be open in an initial state, and another exemplary embodiment of the present disclosure is various exemplary embodiments in which the variable unit100may be in a closed state in an initial state.", "", "In the case of the various exemplary embodiments of the present disclosure, the variable unit100may be in an opened state using the elastic force of the thermally responsive elastic member310and the elastic member440in the initial state and the height of the thermally responsive elastic member310. In the various exemplary embodiments of the present disclosure, when the vehicle accelerates, the centrifugal force acting on the weight420may increase to close the variable unit100, reducing air resistance and improving fuel efficiency. Furthermore, when the braking device30is overheated to a predetermined level or higher while driving with the variable unit100closed, the elastic force of the thermally responsive elastic member310may increase due to the overheated heat, opening the variable unit100. Air may flow into the space between the open variable units100and may cool the braking device30, preventing performance deterioration of the braking device30. Furthermore, when the braking device30is sufficiently cooled, the elastic force of the thermally responsive elastic member310may be reduced, and when the centrifugal force generated by the weight420is less than the variable unit100, the variable unit100may be closed. While the vehicle is driving, the above process may be repeatedly performed, and air resistance of the vehicle may be reduced, and performance degradation due to overheating of the braking device30may be prevented.", "", "In the case of the various exemplary embodiments of the present disclosure, the variable unit100may be placed in a closed state using the elastic force of the thermally responsive elastic member310and the elastic member440in the initial state and the height of the thermally responsive elastic member310. In the case of the various exemplary embodiments of the present disclosure, the vehicle may travel from an initial state to a closed state to reduce air resistance. Accordingly, in the case of the various exemplary embodiments of the present disclosure, differently from the various exemplary embodiments of the present disclosure, the weight420may not be included, and the variable unit100may be opened or closed only by the elastic force of the thermally responsive elastic member310and the elastic member440. In the various exemplary embodiments of the present disclosure, the variable unit100may be opened or closed using the elastic force of the thermally responsive elastic member310and the elastic member440. In the various exemplary embodiments of the present disclosure, when the braking device30overheats, the elastic force of the thermally responsive elastic member310may increase than the elastic force of the elastic member440to open the variable unit100, and when the braking device30is cooled, the elastic force of the elastic member440may be reduced to be closed. Accordingly, until the braking device30overheats, the variable unit100may travel in a closed state by the elastic member440, reducing air resistance of the vehicle. Furthermore, when the braking device30is overheated, the variable unit100may be opened by the thermally responsive elastic member310to cool the braking device30.", "", "In the aforementioned embodiments, it has been described that, when the braking device30overheats, the kirigami structure of the variable unit100may protrude toward the external side of the wheel20, but an exemplary embodiment thereof is not limited thereto, and the variable unit100may include a structure in which the kirigami structure is incorporated into the internal side of the wheel.", "", "For example, in the thermally responsive elastic member in a form of a leaf spring illustrated exemplarily inFIG.12, a thermally responsive elastic member may be used so that the shape change may occur oppositely when cooling and when heating. That is, in the thermally responsive elastic member, the elastic force generated before the braking device may overheat may be greater than the elastic force generated when the braking device is overheated.", "", "The thermally responsive elastic member before the braking device is heated may be designed so that the elastic force of the thermally responsive elastic member pressing the variable unit to the external side may act greater than the elastic force of the second power unit pressing the variable unit to the internal side thereof. Here, the variable unit may be designed not to protrude from the external side of the wheel even when the elastic force of the thermally responsive elastic member is greater than that of the second power unit. Accordingly, the variable unit may maintain a closed state as long as the braking device is not overheated.", "", "When the braking device is heated, the elastic force of the thermally responsive elastic member pressing the variable unit to the external side may decrease. In contrast, as the speed of the vehicle increases, the centrifugal force acting on the weight of the second power unit may increase so that the force for moving the variable unit to the internal side may increase. Accordingly, when the braking device is heated or the speed of the vehicle increases, the kirigami structure of the variable unit may be opened to the internal side thereof.", "", "According to the aforementioned embodiments, because the wheels provided in the vehicle may be actively opened or closed, the air resistance generated by the wheel may be reduced by closing the wheel cover when the vehicle is traveling, and when the braking device is overheated during the driving of the vehicle, the braking device may be cooled by opening the wheel cover.", "", "Also, to open or close the open space of the wheel, the open space of the wheel provided in the vehicle may be actively opened or closed without a power supply.", "", "Also, using a member of which a shape changes based on temperature to open or close the wheel based on the temperature of the braking device, components such as a sensor to detect the state of the wheel (e.g., the temperature of the braking device inside the wheel) and wires to control the opening and closing device may not be necessary, and installation may be simplified.", "", "Also, by including a structure for opening or closing the wheel cover using a kirigami structure, when there is no load, a flat structure may be formed so that a volume may be reduced and a wheel cover may be easily stored and transported.", "", "For convenience in explanation and accurate definition in the appended claims, the terms “upper”, “lower”, “inner”, “outer”, “up”, “down”, “upwards”, “downwards”, “front”, “rear”, “back”, “inside”, “outside”, “inwardly”, “outwardly”, “interior”, “exterior”, “internal”, “external”, “forwards”, and “backwards” are used to describe features of the exemplary embodiments with reference to the positions of such features as displayed in the figures. It will be further understood that the term “connect” or its derivatives refer both to direct and indirect connection.", "", "The term “and/or” may include a combination of a plurality of related listed items or any of a plurality of related listed items. For example, “A and/or B” includes all three cases such as “A”, “B”, and “A and B”.", "", "A singular expression includes a plural expression unless the context clearly indicates otherwise.", "", "The foregoing descriptions of specific exemplary embodiments of the present disclosure have been presented for purposes of illustration and description. They are not intended to be exhaustive or to limit the present disclosure to the precise forms disclosed, and obviously many modifications and variations are possible in light of the above teachings. The exemplary embodiments were chosen and described in order to explain certain principles of the invention and their practical application, to enable others skilled in the art to make and utilize various exemplary embodiments of the present disclosure, as well as various alternatives and modifications thereof. It is intended that the scope of the present disclosure be defined by the Claims appended hereto and their equivalents."], "claims": ["a fixing unit fixed to a wheel of a vehicle; a variable unit coupled to and supported by the fixing unit and configured for being opened and closed; a first power unit configured to apply a first force acting on the variable unit, wherein the first force changes depending on temperature; and a second power unit configured to apply a second force acting on the variable unit, wherein the second force changes depending on a wheel speed, wherein the variable unit is opened or closed depending on the first force generated by the first power unit and the second force generated by the second power unit.", "2 . The wheel cover of claim 1 , wherein the first power unit includes a thermally responsive elastic member of which elastic force changes depending on the temperature.", "3 . The wheel cover of claim 2 , wherein, in the thermally responsive elastic member, the elastic force generated based on a linear change in the temperature, changes nonlinearly.", "a heat transfer plate in contact with a braking device mounted on the wheel; and a heat transfer unit connected to the heat transfer plate and including a body portion enclosing the thermally responsive elastic member.", "a fixing unit coupling plate coupled to the fixing unit; a central plate coupled to the first power unit and the second power unit and configured for moving according to the first force generated by the first power unit and the second force generated by the second power unit; and a variable plate configured to connect the fixing unit coupling plate to the central plate and to open or close the variable unit according to the movement of the central plate.", "6 . The wheel cover of claim 5 , wherein the central plate, the variable plate, and the fixing unit coupling plate form a kirigami structure.", "wherein the first power unit includes a central plate coupled to the first power unit and the second power unit and configured to move according to the first force generated by the first power unit and the second force generated by the second power unit, wherein the second power unit includes a weight connected to the central plate by a wire, and wherein force acting on the variable unit changes by the weight rotating together with the wheel.", "8 . The wheel cover of claim 7 , wherein the second power unit further includes a guide slide configured to guide a movement path of the weight.", "9 . The wheel cover of claim 8 , wherein the second power unit includes an elastic member coupled to the weight and a portion of the guide slide and configured to provide an elastic force to the weight.", "10 . The wheel cover of claim 1 , wherein the variable unit is open while the wheel is stopped.", "11 . The wheel cover of claim 1 , wherein the variable unit is closed while the wheel is stopped.", "a fixing unit fixed to a wheel of a vehicle together with a braking device; a variable unit coupled to the fixing unit and configured for being opened and closed; a first power unit including a thermally responsive elastic member to generate a first force to the variable unit; and a second power unit including an elastic member to generate a second force to the variable unit, wherein the thermally responsive elastic member non-linearly generates a first elastic force in a predetermined temperature range, and the elastic member generates a second elastic force linearly with respect to a change in length.", "a fixing unit coupling plate coupled to the fixing unit; a central plate coupled to the first power unit and the second power unit and configured to move in a direction of a rotation axis of the wheel; and a variable plate configured to connect the fixing unit coupling plate to the central plate and to open or close the variable unit according to the movement of the central plate.", "14 . The wheel cover of claim 13 , wherein the variable unit includes a connection plate disposed between the central plate and the variable plate and rotatably coupled to each of the central plate and the variable plate.", "15 . The wheel cover of claim 12 , wherein the thermally responsive elastic member is a leaf spring including a shape memory alloy.", "16 . The wheel cover of claim 12 , wherein the thermally responsive elastic member is a coil spring including a shape memory alloy.", "17 . The wheel cover of claim 12 , wherein the first power unit further includes a heat transfer unit including a body portion enclosing the thermally responsive elastic member.", "a heat transfer plate in contact with the braking device; and a connection portion configured to connect the heat transfer plate to the body portion.", "19 . The wheel cover of claim 12 , wherein the thermally responsive elastic member generates the first elastic force greater than the second elastic force of the elastic member in the predetermined temperature range.", "20 . The wheel cover of claim 12 , wherein the variable unit is closed while the wheel is stopped."], "bibtex": "@patent{20240286432,\n    title = {WHEEL COVER},\n    number = {20240286432},\n    year = {2024},\n    note = {File: US20240286432A1-20240829.XML}\n    }", "classification": "B60B706FI"}, {"title": "UNIVERSAL SPINNER WHEEL", "doc_number": "20240286433", "filename": "US20240286433A1-20240829.XML", "abstract": "A vehicle wheel for the purpose of slow speed temporary movement of the vehicle whereby the inner portion of the wheel disc includes a curved surface disposed in rotating contact with the beveled surface of the cylinder element of the attachment hub. The wheel disc and the attached tire extend outwardly from the attachment hub. The attachment hub includes the cylinder with a securing ring affixed to the inwardly extending portion of the cylinder and disposed in abutting relation with the inner surface of the wheel disc wherein the outer surface of the cylinder is disposed between the securing ring and a flange.", "detailed_description": ["The universal wheel, according to this invention, is generally mounted on automobiles which have a variety of lug patterns. As shown in the drawings, wheel disc1extends outwardly from attachment hub2which is unitary and disposed at the center of the wheel. Hub2includes outer circular flange3integrally joined to the outer edge of cylinder4and, on the inner edge of cylinder4, aperture plate5is integrally affixed and extends inwardly therefrom. Multiple lug receiving apertures6are formed in aperture plate5and are configured to receive a variety of vehicle wheel lugs in varying patterns, for example, 4, 5, 6 and 8 universal lug bolt patterns. A central bore is formed in aperture plate5to receive the automobile axle, as is well known.", "", "According to a feature of this invention, a securing ring, generally indicated by the numeral7inFIG.3, is spaced inwardly from flange3and extends around the outer periphery of cylinder4of hub2. Ring7is secured to hub2by means fasteners in the form of four screws or bolts8which extend into corresponding threaded apertures formed in cylinder4. Screws or bolts8are flexible to provide stress dampening to counter normal vibration encountered in the movement of the automobile and especially the components of the vehicle wheel.", "", "According to this invention and as best shown inFIG.4, hub2comprises bearing surface9awhich extends around the outer periphery of cylinder4between flange3and securing ring7. Also, the inner surface of wheel disc1is curved at9band is disposed around bearing surface9ain an abutting manner to allow surface9bto rotate around surface9a.", "", "With particular reference toFIG.3, the details of securing ring7are shown wherein ring7is of a circular configuration and includes circular channel10, the curvature of which provides added rigidity and strength to ring7and ensures that hub2is correctly centered on the vehicle. Wedges11are integrally joined to securing ring7the underside of which conform to the contours of the surface of securing ring7and channel10and provide strength at the attachment point between securing ring7and hub2. Apertures12extend through each wedge11and flexible bolts8extend through apertures12and into corresponding threaded apertures formed in cylinder4of hub2.", "", "Wheel disc1is provided with tire13extending around the periphery thereof, as is well known.", "", "As shown inFIG.1, a nonspinning universal wheel is assembled by securing wheel disc1, tire13and attachment hub4by means of multiple bolts14which are screwed into wedge nuts15which are disposed in corresponding cavities formed on the inner side of wheel disc1. The cavities are best shown inFIG.2. Wedge nuts15are configured of a dimension one millimeter larger than the inside dimension of the respective wheel disc cavity. By this means, wedge nuts15are forced into each cavity and are frictionally maintained within the cavities to prevent them from inadvertently falling out when not interconnected to the bolts.", "", "The nonspinning universal wheel is mounted on an automobile whereby the wheel lugs extend through apertures6and the wheel is secured in place thereto by conventional lug nuts. By this means, the universal wheel is securely affixed to the automobile in a conventional manner and in situations where a nonspinning tire is applicable.", "", "In order to convert a nonspinning universal wheel to a spinner-roller wheel. As shown inFIG.1, bolts14, from the front side of the vehicle wheel, are loosened from corresponding wedge nuts15and removed. Ring7is then slipped over the inner free end of cylinder4to a position flush with the inner surface of wheel disc1and attached thereto by means of bolts8which extend through apertures12disposed in wedges11and are affixed to corresponding threaded apertures disposed in cylinder4. By this means, wheel disc1and attached tire13are freely rotatable around hub2. The bearing surface9aand sliding surface9bare appropriately lubricated to enhance rotation of the wheel. To return the wheel to a normal rolling wheel, it is simply necessary to reinstall bolts14and interconnect them with corresponding wedge nuts15which are secured in cavities on the inner side of the wheel. Once installed, ring7stays in place whether the wheel is configured to spin or not.", "", "Therefore, by this invention, a universal wheel provides a unique mobility solution for standard or electric cars in situations where the brakes freeze or there is no power to the vehicle wheels. The is hub bolted onto the automobile in the conventional manner and then the car can be pushed or pulled around the repair shop or maneuvered onto a tow truck. The universal spinner wheel is easily converted into a conventional wheel whereby the bolts securing the flange to the steel center of the wheel are reinstalled."], "claims": ["a central attachment hub, a wheel disc extending outwardly from said attachment hub and comprising an inner portion, said attachment hub comprising a cylinder, said cylinder comprising an inner and an outer edge and the inner edge extending inwardly of said wheel disc, and a securing ring extending around the outer surface of said inwardly extending portion of said cylinder.", "2 . The vehicle wheel according to claim 1 wherein said wheel disc comprises an inner side, a flange is affixed to said outer edge of said cylinder, multiple apertures are formed in said flange, bolts extend through said apertures and are interconnected to wedge nuts disposed on said inner side of said wheel disc.", "3 . The vehicle wheel according to claim 1 wherein said attachment hub comprises an aperture plate attached to the inner edge of said cylinder and multiple apertures are formed in said aperture plate.", "4 . The vehicle wheel according to claim 3 wherein said multiple apertures form a universal lug receiving pattern.", "5 . The vehicle wheel according to claim 1 wherein said securing ring comprises a curved channel extending around the outer surface of said securing ring.", "6 . The vehicle wheel according to claim 1 wherein multiple wedges are secured to the outer surface of said securing ring and said apertures extend respectively through said wedges.", "7 . The vehicle wheel according to claim 6 wherein fasteners extend through said apertures and into threaded apertures formed in said cylinder.", "8 . The vehicle wheel according to claim 7 wherein said fasteners are flexible.", "9 . The vehicle wheel according to claim 1 wherein said inner portion of said wheel disc comprises a curved sliding surface.", "10 . The vehicle wheel according to claim 9 wherein a flange is secured to said outer edge of said cylinder, the outer surface of said cylinder disposed between said securing ring and said flange comprises a bearing surface and said sliding surface of said wheel disc is adapted to slide on said bearing surface to cause said vehicle wheel to rotate in a free spinning fashion.", "11 . The vehicle wheel according to claim 1 wherein a flange is affixed to said outer edge of said cylinder and said flange is interconnected to said wheel disc by fasteners.", "12 . The vehicle wheel according to claim 11 wherein said wheel disc comprises an inner side and said fasteners comprise wedge nuts disposed in cavities formed on said inner side.", "13 . The vehicle wheel according to claim 12 wherein the outer dimension of said wedge nuts is larger than the inner dimension of said cavities.", "an attachment hub, a wheel disc extending outwardly from said hub, said hub comprising a circular cylinder, said cylinder having an outer and an inner end, a flange affixed to said outer end, said flange secured to said wheel disc, said cylinder extending inwardly, the method comprising the steps of disengaging said flange from said wheel disc, positioning a securing ring on said inwardly extending cylinder in abutting relation with said wheel disc, and interconnecting said securing ring to said cylinder by means of fasteners.", "15 . The method according to claim 14 wherein said fasteners are flexible.", "16 . The method according to claim 14 wherein wedges are affixed to said securing ring, apertures are formed in said wedges, and said fasteners are extended through said apertures formed in said wedges and into threaded apertures formed in said cylinder."], "bibtex": "@patent{20240286433,\n    title = {UNIVERSAL SPINNER WHEEL},\n    number = {20240286433},\n    year = {2024},\n    note = {File: US20240286433A1-20240829.XML}\n    }", "classification": "B60B1110FI"}, {"title": "Walking Apparatus with Lockable Castors", "doc_number": "20240286434", "filename": "US20240286434A1-20240829.XML", "abstract": "A castor might comprise a castor body for coupling the castor to an apparatus, at least one wheel coupled to the castor body, wherein said wheel is operable to rotate about a wheel axis. The castor body might be configured to swivel about a swivel axis which is substantially perpendicular to the wheel axis such as to rotate the orientation of the wheel with respect to the swivel axis. A locking means might be configured to adopt at least first state and a second state. In the first state, the locking means might be configured to allow swivelling motion of the castor body about the swivel axis and in the second state the locking means might be configured to inhibit the swivelling motion of the castor body about the swivel axis such that the orientation of the castor wheel is locked relative to the swivel axis.", "detailed_description": ["In the following description, various embodiments will be described. For purposes of explanation, specific configurations and details are set forth in order to provide a thorough understanding of the embodiments. However, it will also be apparent to one skilled in the art that the embodiments may be practiced without the specific details. Furthermore, well-known features may be omitted or simplified in order not to obscure the embodiment being described.", "", "Referring now to the drawings, inFIG.1there is shown, generally indicated by the reference numeral1, a castor defining a first aspect. The castor1is shown comprising a castor body3for coupling the castor1to an apparatus. The castor1might further comprise at least one wheel5which is coupled to the castor body3, which is operable to rotate about a wheel axis. The wheel axis defined by an axle which the wheel5rotates about. The castor body3is configured to swivel about a swivel axis which is substantially perpendicular to the wheel axis such as to rotate the orientation of at least part of the castor body3and the wheel5with respect to the swivel axis. The castor1further comprises a locking means7which is configured to adopt at least a first state and a second state. Wherein the first state, the locking means7is configured to allow swivelling motion of the castor body3about the swivel axis and in the second state, the locking means7is configured to inhibit the swivelling motion of the castor body3about the swivel axis such that the orientation of the wheel5and typically part of the castor body3is locked relative to the swivel axis.", "", "The castor body1preferably comprises an upper part11and a lower part13. The wheel5can be coupled, in a manner such as to permit rotation movement of the wheel5, to the lower part13. The lower part13is configured to swivel about the swivel axis relative to the upper part11which remains fixed. The upper part11is typically plate like and might ideally be substantially circular in shape. The lower part13is typically substantially cylindrical in shape. The lower part13preferably further comprises first and second forks which extend from opposing sides of the lower part to define a channel with which the wheel5is located and operable to rotate. The wheel5being coupled to the forks with the wheel axle extending there between.", "", "The locking means7when in the second state is configured to releasably couple the upper and lower parts11,13of the castor body3together such as to prevent swivelling movement of the lower part13relative to the upper part11. The locking means7might ideally comprise co-operable male and female members which are configured to releasably couple together, when aligned, such as to couple the upper and lower parts of the castor body together. To this end the locking means7preferably comprises a pin15and at least one pin receiving aperture17within which at least part of said pin15is receivable. The pin15is a resiliently biased pin. The pin15comprises an elongate member which is seated within a channel formed in the lower part13which extends substantially along the length of the castor body3in a direction parallel to the swivel axis. The pin15is housed within castor body3, and is, typically, at least in the first state, contained entirely within the lower part13of the castor body3. The pin receiving aperture17is located in the upper part11of the castor body3. The upper and lower parts11to13are coupled together such that when the lower part13swivels relative to the upper part11, the pin15and pin receiving apertures17are configured to align with respect to one another. When the pin15adopts the first state, the lower part13will swivel about the upper part with no restriction with regards to direction. However, when the pin15adopts the second state, the biasing of the pin15will result in the pin15engaging with the pin receiving aperture17when they align with respect to one another as a result of the swivelling motion of the lower part13relative to the upper part11.", "", "In a preferred embodiment, as shown for example inFIGS.6to8, the upper part might ideally11comprise a plurality of pin receiving apertures17. The upper part11is preferably substantially circular in shape. The pin receiving apertures17preferably extend substantially through the entire width of the upper part11. However, in an alternative embodiment, the pin receiving apertures17may extend only partially through the upper part11to the extent that is sufficient for receiving at least part of the pin15for restricting movement of the lower part13relative to the upper part11. As shown inFIGS.6to7, the pin receiving apertures17are spaced apart around the upper part11. In particular, the pin receiving apertures17are provided in and extend through the top and bottom surfaces of the upper part11, the top surface being the surface which faces away from the ground on which the castor1rests in-use. Preferably the pin receiving apertures17are spaced apart with respect to one another such that they are substantially equidistant from one another around the upper part11, typically around the circumference thereof. In one embodiment, the upper part11comprises at least two pin receiving apertures17which might be ideally spaced apart from one another around the circumference of the upper part11, typically at opposing ends of the upper part11. To this end the at least two pin receiving apertures17are preferably spaced apart at 180° positions with respect to one another around the upper part11. The two pin receiving apertures17are preferably located at 90° and 270° positions around the upper part11. Alternatively, the upper part11may comprise at least four pin receiving apertures17which might be ideally spaced apart from one another around the upper part11such that each pin receiving aperture17is spaced apart from each adjacent pin receiving aperture at 90-degree positions around the upper part11. To this end, the four pin receiving apertures17are located at 90°, 180°, 270° and 360-degree positions around the circumference of the circular shaped upper part11such as shown inFIGS.6to8. Further alternatively, the upper part11may comprise any number of pin receiving apertures17. The pin receiving apertures17are positioned such that when the pin15engages with one of the pin receiving apertures17in the second state, the orientation of the lower part13and consequently the wheel5is locked relative to the swivel axis such as to allow rotation of wheel5in a fixed orientation, typically in a fore-aft direction or a side-to-side direction.", "", "The upper part11might ideally further comprise a plurality of transitional sections21which are located and extend between the plurality of pin receiving apertures17. The transitional sections21comprise a pin blocking member23which is configured to allow the lower part13of the castor body3to swivel between positions defined by the pin receiving apertures17in the upper part11of the castor body3when the locking means5has adopted the second state such that it is biased towards engaging with the pin receiving aperture17in the upper part11. To this end the pin blocking member23typically comprises an elongate rib which extends the length of the distance between respective pin receiving apertures17which prevents the pin15from engaging with the upper part11.", "", "The castor1further comprises an actuation means9which is configured to vary the locking means7between the first and second states. To this end the actuation means9is typically coupled to the locking means7. The actuation means9might ideally comprise a switch that is variable between first and second positions corresponding to the first and second states of the locking means7respectively. The actuation means7may further comprise a sleeve8within which at least part of the locking means7may be slidably received. The switch and sleeve8are coupled together, typically integrally so, such that movement of the switch between first and second positions causes respective movement of the sleeve8. The sleeve8is typically open ended at both sides and accommodates the pin15therein, at least in part. The pin15comprises the elongate member which at one end, is typically shaped such as to engage with the pin receiving aperture17whilst at the opposing end the pin15comprises one or more lateral protrusions10which are configured to abut the sleeve8end such as to restrict the movement of the pin15. For example, when the actuation means7is in the first position, as shown inFIG.9, the sleeve8retains the pin15in the first state wherein the pin15is entirely contained within the lower part13of the castor body3. Upon actuation of the actuation means7such that it adopts the second position, as shown inFIG.11, the sleeve8is moved upwards in the direction of the upper part11to an extent that a part of the sleeve8contacts an interior wall14of the lower part13which prevents further upward movement of the sleeve8. Movement of the sleeve8in an upward direction allows for corresponding movement of the resiliently biased pin15such that the pin15extends up and away from the lower part13such as to engage with the pin receiving aperture17in the upper part11of the castor body3.", "", "Further to the above, as shown inFIG.10, when the actuation means7is actuated such that it adopts the second position such as to cause the pin15to adopt the second state but the lower part13is pivoted relative to the upper part11such that the channel containing the pin15and one of the pin receiving apertures17are not aligned, the pin15abuts the pin blocking member23provided along the transitional section21of the upper part11. Advantageously, this ensures that engagement of the pin15and pin receiving apertures17only occurs at pre-defined positions which correspond to pre-defined directions.", "", "Referring now toFIGS.2and3of the drawings, there is shown, generally indicated as100, a walking support apparatus embodying a second aspect. The walking support apparatus100comprises a frame structure102, which is typically mounted on a plurality of wheels, wherein at least one of said wheels comprise a castor1, the castor comprising that which embodies the first aspect as described previously. Preferably, each of the wheels comprise castors that embody the first aspect. In a preferred embodiment, the castors1are pivotably mounted upon the frame structure such that the castor wheels5are multidirectional, at least when the locking means7of the castors1has adopted the first state. The upper part11of the castors1is fixed relative to the frame structure102such that the pin receiving apertures17are located in pre-defined locations relative to the frame structure102. The castors1are ground-engaging and facilitate movement of the support apparatus100in any direction desired by the user in-use. In preferred embodiments therefore, the frame structure102is a self-propelled wheeled structure. The frame structure typically comprises a base104, which carries the castors1, and an upper portion108. In use, one or more users are connectable to the frame structure102, typically to an upper portion108thereof. Accordingly, the upper portion108is configured, e.g. shaped and dimensioned, for connection with one or more upright (i.e. standing or walking) users.", "", "In one embodiment, where the castor1, in particular the upper part11, comprises two pin receiving apertures17as described previously, these are located along the same axis to one another which extends perpendicular to the part of the frame structure102to which the castor1is coupled such that they are located at 90- and 270-degree positions on the upper part11i.e. they are laterally located relative to the frame structure102. In this manner when the castor1adopts the locked state, movement of the walking support apparatus100is restricted to a side-to-side direction wherein the user, when coupled to the walking support apparatus100, faces forward but their movement is restricted to that side-to-side direction.", "", "In an alternative embodiment, wherein the castor comprises four pin receiving apertures17such as is shown inFIGS.6to8, two of the pin receiving apertures17are located on the same axis which extends perpendicular to the frame structure102such that they are located at 90 and 270 degree positions on the upper part11whilst the other two pin receiving apertures17are located on the same axis to one another which extends substantially along the same axis as the frame structure102(to the extent that they are substantially aligned with the frame structure102) such that they are located at 180 and 360 degree positions around the upper part11. Accordingly, the 180 and 360 degree positioned pin receiving apertures17comprise those apertures which are most forward and rearward of the pin receiving apertures17whilst the 90 and 270 degree positioned pin receiving apertures are equally located there between. In this manner the castor1, when in the locked state and engaged with either of the 90- and 270-degree pin receiving apertures7, is configured to restrict movement of the walking support apparatus100to a side-to-side direction. Further, when the castor1adopts the locked state and is engaged with either of the 180- or 360-degree pin receiving apertures7the castor1is configured to restrict movement of the walking support apparatus100along a fore-aft direction wherein the user, when coupled to the walking support apparatus100, faces forward and their movement is restricted to that frontward backward direction.", "", "Optionally the base104and upper portion108comprise a plurality of sections which are couplable together; these sections may be pivotably coupled together such as to allow the frame structure102of the support apparatus1to be foldable/collapsible in-use. A connecting portion between the upper portion108and the base104may comprise one or more telescopic struts (not shown) such as to allow variation in the height of the upper portion108relative to the base104in-use. The upper portion108may be coupled to the base104via a resilient biasing means (not shown), the resilient biasing means may comprise at least one spring or gas strut or any other suitable biasing means. In an alternative embodiment the base104and upper portion108may be made from a single piece and/or otherwise rigidly fixed together.", "", "The base104typically comprises first and second side members105,106which extend in a spaced apart arrangement substantially parallel to each other. The first and second sides105,106are coupled via the upper portion108. The upper portion108typically extends transversely between the first and second sides105,106, and may be substantially perpendicular to the first and second sides105,106. An elongate channel is typically defined between the first and second sides105,106of the frame structure102, the channel being shaped and dimensioned to accommodate at least one user therein. Optionally, a respective front and rear channel are defined in front of and behind, respectively, the upper portion108, each channel being shaped and dimensioned to accommodate a respective user. The upper portion108, or at least part of it, is positioned for connection to a respective user in the, or each, adjacent channel. Advantageously, each elongate channel is open-ended to allow for easy entry and exit of the user when utilising the walking support apparatus100. The user in need of walking assistance is accommodated by the front channel. In some embodiments, the primary user is connected to the upper portion108during use.", "", "It should be apparent from the foregoing that, in preferred embodiments, the frame structure102is configured, i.e. shaped and dimensioned, to define a station for receiving the user. The station being configured to accommodate the respective user in an upright state, e.g. walking or standing, on a ground surface across which it is desired to move. To this end, the base104is open in the region of the station to allow the primary user to walk or stand on the ground. The station provided between the first and second sides105,106of the frame102, which extend in the longitudinal direction.", "", "The upper portion108typically comprises an inverted U or substantially arcuate shape however it may also comprise a substantially square or rectangular shape or any other suitable shape. Typically, the frame102is made from any combination of, or at least one of: metal; plastic; or composite material such as carbon fibre; or any other suitable material. The castors1are typically mounted on the base104, typically on the underside of the base104. In a preferred embodiment the castors1are mounted upon opposing ends of the underside of both the first and second sides105,106of the base104.", "", "Optionally the support apparatus100comprises means for receiving and supporting the primary user (not shown) such as a couplable garment or the other attachment means or the like. Advantageously, the means for receiving and supporting a primary user fully supports the user's weight when the user is inserted into the support apparatus1. The means for receiving and supporting the user may comprise a structural element or seat or any other suitable receiving means.", "", "FIG.2illustrates the walking support apparatus100with the castors1having their respective locking means7adopting the first state such that the wheels are operable to swivel in any direction to allow the walking support apparatus100, and in particular the user when utilising this, to be able to walk with the aid of the apparatus in any direction.FIG.3illustrates the walking support apparatus100with the castors1having their respective locking means7adopting the second state such that the wheels are restricted with the orientation of the wheels locked in a pre-defined direction such that the walking support apparatus100, and in particular the user when utilising this, is restricted to movement in the pre-defined direction, such as shown inFIG.3which is a side to side direction.", "", "FIG.4is a front plan view of the castor1showing the actuation means9in the second position which is configured to cause the locking means7to adopt the second state.FIG.5is a front plan view of the castor1showing the actuation means9in the first position which is configured to cause the locking means7to adopt the first state.", "", "FIGS.6to8are top plane views showing the transition between first and second states of the locking means7and the engagement of the locking means7to restrict the pivoting movement of the lower part13relative to the upper part11of the castor body3. For example, the substantially circular shaped upper part11is shown having four pin receiving apertures17provided therein at 90-, 180-, 270- and 360-degree positions around the upper part11, typically the circumference thereof. The pin15is also shown provided in the lower part13. Beginning withFIG.6the locking means7is shown in the first state such that the pin15does not extend from the lower part13such as to engage the upper part11. Accordingly, the lower part13is operable to swivel in any direction relative to the upper part11such as to allow multidirectional movement of the walking support apparatus100to which the castors1are coupled.FIG.7illustrates the transition between the first state and the second state of the locking means7, wherein the lower part13is pivoted relative to the upper part11but the pin15has not aligned with the pin receiving aperture17such that the pin15abuts the pin blocking member13which extends the length of the transition section21.FIG.8illustrates when the lower part13has pivoted relative to the upper part11such that the pin15and pin receiving aperture17align such as to engage the upper and lower parts11,13such as to restrict the movement of the walking support apparatus100along the predefined direction which as shown inFIG.3is a side-to-side direction. It should be understood that reference to a side to side or sideways direction as described herein is intended to mean wherein the user when coupled to or otherwise engaging the frame moves in a direction which is perpendicular to the direction in which their body, in particular their front, substantially faces toward in-use.", "", "FIGS.9to11show a side sectional view of the castor body3. For example, when the switch7is in the first position, as shown inFIG.9, the sleeve8retains the pin15in the first state wherein the pin15is entirely retained within the lower part13of the castor body3. Upon actuation of the switch7such that it adopts the second position, as shown inFIG.11, the sleeve8is moved upwards within the lower part13of the castor body3in the direction of the upper part11until part of the sleeve8contacts an interior wall14of the lower part13which prevents further upward movement of the sleeve8. Movement of the sleeve8in the upward direction allows for corresponding movement of the resiliently biased pin15such that the pin15extends up and away from the lower part13such as to engage with the pin receiving aperture17in the upper part11of the castor body3.FIG.10shows when the switch7is actuated such that it adopts the second position such as to cause the pin15to adopt the second state but the lower part13is pivoted relative to the upper part11such that the channel containing the pin15and one of the pin receiving apertures17is not aligned, such that the pin15abuts the pin blocking member23provided along the transitional section21of the upper part11. This being also shown inFIGS.7and13. Advantageously, this ensures that engagement of the pin15and pin receiving apertures17only occurs at pre-defined positions which correspond to movement of the walking support apparatus100in pre-defined directions.FIGS.12to14show corresponding images to those of9to11but from a front sectional viewpoint.", "", "In-use a user would be coupled to the walking support apparatus100, initially the castors1would have the locking means7in the first state in which the castors are in an unlocked state and are free to swivel in any direction. Subsequently, the castors1may be actuated to adopt the second state or locked state. Upon transition to a sideways locked state the user would then be restricted to movement along a straight line in a sideways direction. Advantageously this movement pattern is beneficial for the user because it engages the muscles groups used for abductional and adductional movements, typical of those seen in the cruising phase of toddler's as they learn to walk. The nominal walking gait pattern also involves engaging these muscles to enable the legs to move towards and away from the sagittal plane of the body, critical to the skills of weight shifting and side stepping. This locked sideways state allows therapists to isolate and effectively train the user's muscles groups in a way that develops the aforementioned techniques and skills.", "", "The invention is not limited to the embodiment(s) described herein but can be amended or modified without departing from the scope of the present invention.", "", "The use of examples, or exemplary language (e.g., “such as”) provided herein, is intended merely to better illuminate embodiments of the invention and does not pose a limitation on the scope of the invention unless otherwise claimed. No language in the specification should be construed as indicating any non-claimed element as essential to the practice of the invention.", "", "In the foregoing specification, embodiments of the invention have been described with reference to numerous specific details that may vary from implementation to implementation. The specification and drawings are, accordingly, to be regarded in an illustrative rather than a restrictive sense. The sole and exclusive indicator of the scope of the invention, and what is intended by the applicants to be the scope of the invention, is the literal and equivalent scope of the set of claims that issue from this application, in the specific form in which such claims issue, including any subsequent correction.", "", "Further embodiments can be envisioned to one of ordinary skill in the art after reading this disclosure. In other embodiments, combinations or sub-combinations of the above-disclosed invention can be advantageously made. The example arrangements of components are shown for purposes of illustration and combinations, additions, re-arrangements, and the like are contemplated in alternative embodiments of the present invention. Thus, while the invention has been described with respect to exemplary embodiments, one skilled in the art will recognize that numerous modifications are possible."], "claims": ["a castor body for coupling the castor to an apparatus; at least one wheel coupled to the castor body, wherein said wheel is operable to rotate about a wheel axis; wherein the castor body is configured to swivel about a swivel axis that is substantially perpendicular to the wheel axis such as to rotate the orientation of the wheel with respect to the swivel axis; and a locking means which is configured to adopt at least a first state and a second state, wherein in said first state the locking means allows for a swivelling motion of the castor body about the swivel axis and in said second state the locking means inhibits the swivelling motion of the castor body about the swivel axis, whereby the orientation of the wheel is locked relative to the swivel axis.", "2 . The castor of claim 1 , wherein the castor body comprises an upper part and a lower part, wherein the wheel is coupled to the lower part which is configured to swivel about the swivel axis relative to the upper part.", "3 . The castor of claim 2 , wherein the locking means in said second state is configured to couple the upper part and the lower part of the castor body together to prevent swivelling movement of the lower part relative to the upper part.", "4 . The castor of claim 3 , wherein the locking means comprises co-operable male and female members which are configured to releasably couple together such as to couple the upper part and the lower part of the castor body together.", "5 . The castor of claim 4 , wherein the locking means comprises at least one pin and at least one aperture within which at least part of said pin is receivable such as to couple the upper part and the lower part together.", "6 . The castor of claim 5 , wherein the pin comprises a resiliently biased pin.", "7 . The castor of claim 5 , wherein said pin is retained entirely within the lower part of the castor body when the locking means adopts said first state.", "8 . The castor of claim 5 , wherein said pin receiving aperture is located on the upper part of the castor body.", "9 . The castor of claim 8 , wherein the upper part comprises a plurality of pin receiving apertures.", "10 . The castor of claim 9 , wherein the upper part is substantially circular in shape and wherein the pin receiving apertures are spaced apart around an edge of the upper part.", "11 . The castor of claim 10 , wherein the upper part comprises four pin receiving apertures and wherein the pin receiving apertures are spaced apart from one another such that they are located at 90-, 180-, 270- and 360-degree positions around the edge of the upper part.", "12 . The castor of claim 9 , wherein the upper part comprises a plurality of transitional sections located between the plurality of pin receiving apertures.", "13 . The castor of claim 12 , wherein the transitional sections comprise a pin blocking member which is configured to allow the lower part of the castor body to swivel between positions defined by the pin receiving apertures in the upper part of the castor body when the locking means has adopted the second state.", "14 . The castor of claim 1 , further comprising an actuation means which is configured to vary the locking means between the first and second states.", "15 . The castor of claim 14 , wherein the actuation means comprises a switch which is variable between first and second positions corresponding to the first and second states of the locking means respectively.", "16 . The castor of claim 6 , further comprising an actuation means which is configured to vary the locking means between the first and second states, wherein the actuation means comprises a switch which is variable between first and second positions corresponding to the first and second states of the locking means respectively, and wherein the actuation means further comprise a sleeve within which the resiliently biased pin is slidably received at least in part.", "17 . The castor of claim 16 , wherein the switch and the sleeve are coupled together such that movement of the switch between the first and second positions causes respective movement of the sleeve, wherein the sleeve is open ended at both sides and accommodates the pin therein, at least in part.", "18 . The castor of claim 17 , wherein the pin at one end, is shaped and dimensioned for engagement with the pin receiving aperture whilst at an opposing end the pin comprises one or more lateral protrusions which are configured to abut the sleeve such as to restrict the movement of the pin within the sleeve.", "a frame; and at least one castor as recited in", "20 . The walking support apparatus of claim 19 , further comprising a plurality of castors as recited in claim 1 ."], "bibtex": "@patent{20240286434,\n    title = {Walking Apparatus with Lockable Castors},\n    number = {20240286434},\n    year = {2024},\n    note = {File: US20240286434A1-20240829.XML}\n    }", "classification": "B60B3302FI"}, {"title": "Adjustable Wheel Assembly", "doc_number": "20240286435", "filename": "US20240286435A1-20240829.XML", "abstract": "A tool storage unit includes a housing configured to store a tool. The tool storage unit additionally includes an adjustable wheel assembly coupled to the housing. The adjustable wheel assembly includes a bolt movable between a first position and a second position, a support arm extending outwardly from the housing, a swing arm, and a caster wheel. The swing arm defining a first end and a second end, where the first end receives the bolt and is pivotally coupled to the support arm and the second end is rotatably coupled to the caster wheel. The swing arm is vertically movable between a raised position and a lowered position, where the caster wheel and swing arm are in the raised position when the bolt is in the first position and the caster wheel and swing arm are in the lowered position when the bolt is in the second position.", "detailed_description": ["This description describes several example embodiments, at least some which relate to adjustable wheel assemblies. In example embodiments, the adjustable wheel assembly may include a bolt movable between a first position and a second position. Movement of the bolt from the first position to the second position may cause components of the adjustable wheel assembly to move from an extended position and an unextended position relative to other components. Such adjustment of position of the adjustable wheel assembly may allow leveling of an object coupled to the adjustable wheel assembly without the aid of shims. Leveling of the object may reduce undesired and/or uncontrolled movement of the object across a sloped floor without the aid of chocks.", "", "In examples of the present disclosure, a tool storage unit including an adjustable wheel assembly is disclosed. More particularly, the tool storage unit may include a housing configured to store a tool and an adjustable wheel assembly coupled to the housing. The adjustable wheel assembly may include a bolt movable between a first position and a second position. The adjustable wheel assembly may also include a support arm that couples to and extends outwardly from the housing. The support arm may define a plurality of apertures, where at least one of the apertures may form point of rotation and at least one of the plurality of apertures may receive the bolt. The adjustable wheel assembly may additionally include a swing arm that couples with the support arm via the bolt and also rotatably couples to a caster wheel. The swing arm may be vertically movable between a raised position and a lowered position relative to the housing, where the caster wheel and swing arm may be in the raised position when the bolt is in the first position and the caster wheel and swing arm may be in the lowered position when the bolt is in the second position. Thus, the adjustable wheel assembly may provide for an integrated leveling system on the tool storage unit.", "", "FIG.1depicts a tool storage unit10with a housing16. The housing16may include one or more parts of the tool storage unit10(e.g., drawers, cabinets), various enclosures, among other examples. The tool storage unit10may be part of a larger storage device or be a standalone unit. For example, the tool storage unit10may include the housing16. A user may open a drawer or a door of the housing16. The housing16may be used to store various tools and equipment.", "", "In one example, the housing16of the tool storage unit10includes a first side12and a second side14opposite the first side, where the second side14defines an underside. Various components may be coupled to the housing16of the tool storage unit10. For example, at least one adjustable wheel assembly100may be coupled to the underside of the second side14of the housing16.", "", "In another example a non-adjustable wheel assembly is coupled to the housing of the tool storage unit10. For instance, a tool storage unit10may include four wheels, where two of the wheels are adjustable wheel assemblies100and two of the wheels are non-adjustable wheel assemblies. However, other numbers and combinations of wheel assemblies are possible. The tool storage unit10may thus include a combination of adjustable and non-adjustable wheel assemblies.", "", "The non-adjustable wheel assembly is a wheel assembly having the location of all parts remaining fixed with respect to one another. The position of each component on the non-adjustable wheel assembly is not adjustable. The non-adjustable wheel assembly may include a caster wheel coupled to a supporting structure. A distance between the caster wheel and the underside of the second side14of the housing16remains fixed and is not adjustable via the components of the non-adjustable wheel assembly.", "", "FIGS.2A and2Billustrate perspective views of an adjustable wheel assembly100, according to an example embodiment.FIG.2Cillustrates a plan view of the adjustable wheel assembly100, according to an example embodiment. An example adjustable wheel assembly100includes a support bracket110that includes a first support arm110A and a second support arm110B. The first and second support arms110A and110B are coupled, by way of a bolt104, to a first swing arm120A and a second swing arm120B. The first and second swing arms120A and120B are rotatably coupled to a caster wheel130.", "", "The first and second support arms110A and110B each define a plurality of apertures that are capable of receiving the bolt104and a fastener, such as fastener106, which further couples the support arms110A and110B to the swing arms120A and120B and forms a point of rotation. As shown the apertures are occupied by the bolt104and/or the fastener106. The fastener106may be a fixed bolt. In some examples, the fixed bolt does not move from a first position to a second position, thus rotation of the fixed bolt does not adjust a position of the caster wheel assembly. The fixed bolt may have a head of the bolt concentric with a shaft and/or shank of the bolt. In some examples, the fixed bolt may be a hex bolt, a machine bolt, a flange bolt, a carriage bolt, an architectural bolt, etc. In other examples, the fastener106may be a rivet, a rod, or a bar coupled to a pin, such as a clevis pin coupled to a cotter pin.", "", "The first and second support arms110A and110B of the adjustable wheel assembly100according to the example embodiment ofFIGS.2A and2Beach includes a channel114configured to receive the bolt104. A width of the channel114may be equal to or greater than a dimension of the bolt104, such as a diameter of an eccentric cam included on the bolt104. The depth of the channel114may be equal to, greater than, or less than a dimension of the bolt104, for instance a thickness of the eccentric cam included on the bolt104. The channel114may allow the eccentric cam on the bolt104to reside completely within the channel114such that the eccentric cam may sit flush with a surface of the respective first and second support arms110A and110B. Edges of the channel114may come into contact with a portion of the bolt104, such as contacting the eccentric cam, and may assist in keeping the bolt104in a desired position by further constraining movement of the bolt104. The channel may also aid in transferring loading from the bolt104through the adjustable wheel assembly100. In some examples, both the first and second support arms110A and110B include the channel114, while in other examples only one support arm, or no support arms, include the channel114.", "", "In one example, the adjustable wheel assembly100is coupled to the tool storage unit10. The adjustable wheel assembly100may be coupled to the underside of the second side14of the housing16of the tool storage unit10. For instance, the first and second support arms110A and110B may be coupled to the underside of the second side14of the housing16of the tool storage unit10and extend outwardly from the housing16.", "", "The adjustable wheel assembly100may be made from any suitable material. For example, a metal, such as steel, may be used to construct various components of the adjustable wheel assembly100. Other metals or materials may also be used. In some examples, more than one material may be used. A coating or treatment may also be applied to the components of the adjustable wheel assembly100. The coating or treatment may be a corrosion or erosion preventative coating, for example galvanizing; however, other coatings or treatments are also possible.", "", "FIG.3shows an exploded view of the adjustable wheel assembly100ofFIGS.2A through2C, according to an example embodiment. As shown,FIG.3includes a bearing plate102, a support bracket110, first and second swing arms120A and120B, and the caster wheel130.", "", "The bearing plate102may be coupled to the tool storage unit10and provide further coupling to the support bracket110. Any suitable form of fastening (e.g., a bolt and a nut) may be used to couple the bearing plate102to the tool storage unit10. The bearing plate102may include a bearing coupling between the bearing plate102and the support bracket110, which may enable the adjustable wheel assembly100to rotate, pivot, and/or swivel in order to change the direction in which the adjustable wheel assembly100is oriented. The bearings may be ball bearings, roller bearings, needle bearings, etc. In this way, as a user moves the tool storage unit10, including the adjustable wheel assembly100, around a shop floor, the user may be able to change a direction of travel of the tool storage unit10by simply pushing the tool storage unit10in a new direction which may cause the adjustable wheel assembly100to automatically reorient (e.g., by swiveling via the radial ball bearings) to the new direction of travel. In some examples, the bearing plate102may include a device that prevents the adjustable wheel assembly100from swiveling (e.g., reorienting the direction the caster wheel faces), such as a lock or locking pin. The bearing plate102may be coupled to the support bracket110.", "", "In the example shown, the support bracket110is a single piece that includes a first support arm110A and a second support arm110B integrally formed with a top piece110C. The top piece110C may allow coupling of the support bracket110to the bearing plate102, with the bearing plate102further coupling to the tool storage unit10. However, in other examples, the support bracket110may couple directly to the tool storage unit10without the aid of the bearing plate102. In another example, the first and second support arms110A and110B of support bracket110are not formed from a single piece (e.g., the first support arm110A may be a separate piece from the second support arm110B) and does not include the top piece110C; in such an example, the first and second support arms110A and110B may directly couple to the bearing plate102or the tool storage unit10. Further, the first and second support arms110A and110B may be symmetrical to one another.", "", "The first and second support arms110A and110B may be separated at a distance from one another, such as being disposed on opposite ends of the top piece110C of the support bracket110. For example, the second support arm110B may be disposed at a distance from the first support arm110A such that the first and second swing arms120A and120B and the caster wheel130are disposed between the first and second support arms110A and110B. In this example, and as shown, the spacing of the second support arm110B from the first support arm110A depends on the mating structure that may be disposed between the first and second support arms110A and110B. Although the first and second support arms110A and110B are described, in other embodiments more or less than two support arms may be used. For example, the adjustable wheel assembly100may use only one support arm.", "", "In the exploded view, the first and second support arms110A and110B are shown to define a plurality of apertures, such as apertures112A and112B on the first support arm110A. The second support arm110B may have apertures that mirror the apertures on the first support arm110A. Although two apertures,112A and112B, are shown on the first support arm110A, in other embodiments more or less than two apertures may be used. For example, the first and second support arms110A and110B may each have one aperture, two apertures, three apertures, etc. In some examples, at least one aperture on the first and second support arms110A and110B is a point of rotation and at least one aperture is configured to receive the bolt104. In the example shown, aperture112B is the point of rotation on the first support arm110A. A corresponding aperture to112B, forming the point of rotation, and mirroring the position of aperture112B, may be found on the second support arm110B. However, in other examples a different aperture may form the point of rotation.", "", "In one example, the fastener106pivotally couples the first and second swing arms120A and120B to the first and second support arms110A and110B at the point of rotation, and the aperture configured to receive the bolt104is distinct from the point of rotation. In this example, the bolt104, may be an eccentric bolt or a cam bolt.", "", "The first and second swing arms120A and120B may rotate and/or pivot about the point of rotation as the adjustable wheel assembly100is being adjusted. Aperture112A may be configured to receive the bolt, such as bolt104. In one example, the bolt104is movable between a first position and a second position. The aperture112A may, therefore, define a path of travel for the bolt as it moves between the first and second position. However, in some instances, the aperture112A may not define the path of travel and may be another shape such as circular, oval, or oblong. In some examples, aperture shape and dimensions allow coupling with the bolt. Further, in other examples, the aperture configured to receive the bolt104may also form the point of rotation, thus the point of rotation may be formed independent of the aperture configured to receive the bolt104.", "", "In one example, the bolt104, movable between the first position and the second position, couples the first support arm110A to the first swing arm120A and couples the second support arm110B to the second swing arm120B.", "", "The first and second swing arms120A and120B are additionally shown in the example ofFIG.3. The first and second swing arms120A and120B are shown as a single piece, with the second swing arm120B being disposed at a distance from the first swing arm120A. The caster wheel130may be disposed between, and couple to, the first and second swing arms120A and120B. Therefore, the distance at which the first swing arm120A is disposed from the second swing arm120B may be dependent on the dimensions (e.g., a width) of the caster wheel130. In further examples, the first and second swing arms120A and120B are disposed within, and couple to, the support bracket110between the first and second support arms110A and110B. Thus, the distance at which the first and second swing arms120A and120B are disposed from one another may be dependent on the dimensions (e.g., a width) of the first and second support arms110A and110B disposed from one another on the support bracket110.", "", "While the first and second swing arms120A and120B are shown inFIG.3as being included on a single piece, in other examples the first swing arm120A may be a separate piece from the second swing arm120B. In further examples, only a single swing arm may be used. In this way, any number of swing arms may be used in adjustable wheel assemblies described herein. The swing arms may form a single piece or be distinct pieces.", "", "Further, the first and second swing arms120A and120B are shown to define a plurality of apertures, such as apertures122A-C on the first swing arm120A. The first swing arm120A may have a first end which may define apertures, such as apertures122A and122B, and a second end which may define apertures, such as aperture122C. The second swing arm120B may be symmetric to the first swing arm120A, and the apertures on the second swing arm120B may similarly mirror, or align with, those on the first swing arm120A. Thus, the example features described with respect to the first swing arm120A may be the same for the second swing arm120B.", "", "Each of the apertures may be configured to receive a bolt, such as bolt104and/or fasteners106. In one example, the first swing arm120A defines the first end, the second end, and the plurality of apertures, where the first end receives the bolt104in at least one of the apertures and is pivotally coupled to the first support arm110A. The second end of the first swing arm120A is rotatably coupled to the caster wheel130. The first swing arm120A is be vertically movable between a raised position and a lowered position relative to the underside of the second side of the housing (as shown inFIG.1). The caster wheel130and the first swing arm120A are in the raised position when the bolt104is in the first position and the caster wheel130and the first swing arm120A are in the lowered position when the bolt104is in the second position.", "", "The apertures122A-C, and similarly those on the second swing arm120B, may also be configured to receive a bushing. In some examples, a bushing124is housed within the aperture122A and is disposed between the first and second swing arms120A and120B. The bushing124may aid in load transfer, such as bearing load, throughout the parts when the adjustable wheel assembly100is mounted to the tool storage unit10. The bushing124may include radially disposed bearings, such as ball bearings, roller bearings, or needle bearings, to further assist in movement of the adjustable wheel assembly100as the bolt104moves from the first position to the second position. The aperture122B may also receive a bushing, which may couple to, and be disposed between, the first and second swing arms120A and120B. Similarly, the aperture122C may be configured to receive the bushing in addition to the bolt104and/or fastener106. Thus, the shape and dimensions of the apertures on the first and second swing arms120A and120B may be determined, at least partially, by the coupling fastener and/or bolt and/or bushing.", "", "In one example, the aperture112A on the first support arm110A couples to the aperture122A on the first swing arm120A. Similarly, the aperture112B on the first support arm110A couples to the aperture122B on the first swing arm120A. As previously stated, the apertures on the second support arm110B may mirror the apertures on the first support arm110A, and the apertures on the second swing arm120B may mirror the apertures on the first swing arm120A. Thus, similarly situated apertures present on the second support arm110B may couple to the apertures on the second swing arm120B. Coupling between the respective parts may be accomplished using the bolt104and/or fasteners106at the respective apertures.", "", "The caster wheel130may be coupled, by way of either the bolt104or fasteners106, to the first and second swing arms120A and120B through at least one aperture located on the respective swing arms, such as aperture122C located on the second end. In one example, the bolt104is used to couple the swing arms to the caster wheel130. The bolt104may be the eccentric bolt or the cam bolt. The bolt104may be used to adjust the position of the caster wheel130from a first position to a second position, such as from an extended position to an unextended position. Changing the caster wheel130from the first position to the second position may allow the height of the tool storage unit10to be adjusted by adjusting the caster wheel130position relative to the position of the swing arms120A and120B. In another example, the swing arms120A and120B are coupled to the support bracket110using at least one bolt104, and the caster wheel130is coupled to the swing arms120A and120B using at least one bolt104. In this example, both of the bolts104may be movable between a first position and a second position, and allow multiple points of adjustment on the caster wheel assembly100. For example, the caster wheel130and swing arms120A and120B may be movable between a first position and a second position, such as an extended position and an unextended position, relative to the support bracket110through adjustment of the bolt104coupling the support bracket110to the swing arms120A and120B. Similarly, the caster wheel130may additionally be movable between a first position and a second position, such as an extended position and an unextended position, relative to the swing arms120A and120B and the support bracket110through adjustment of the bolt104coupling the caster wheel130to the swing arms120A and120B. Thus, multiple points of adjustment from the first position to the second position are possible on the adjustable wheel assembly100. Multiple points of adjustment may allow for the tool storage unit10to be adjusted to a level position while resting on an unlevel, graded, or sloped surface. Such adjustment to the level position may reduce the tool storage unit10from uncontrolled rolling without the aid of chocks, and/or mitigate unintentional sliding open of drawers. Further, on unlevel surfaces, drawers on the tool storage unit10may have forces pressing on a locking feature, which may not allow the locking feature to properly engage. Thus, adjustment of the tool storage unit10to the level position may allow locks on drawers to properly engage by mitigating forces exerted by the drawer on the locking feature.", "", "The example bolt104shown inFIG.3includes an eccentric fastener104A and eccentric cams104B which couple to the eccentric fastener104A. The eccentric cams104B slide onto the eccentric fastener104A and are located on an outside surface of the first and second swing arms110A and110B. A securing member108(e.g., a nut or pin) further couples to the bolt104to secure the pieces together. Securing members108may additionally be coupled to the fasteners106. The eccentric cams104B have an off-center aperture that the eccentric fastener104A is coupled to. As such, the position of the bolt104, in this example the bolt104includes the eccentric cams104B coupled with the eccentric fastener104A, relative to a location on the support bracket110may be adjusted as the eccentric cam104B is rotated. Thus, the eccentric cams104B, may therefore allow for adjustment from the first position to the second position of the bolt104when residing in an aperture, such as the aperture112A.", "", "In one example, the bolt104is a cam bolt. In another example, the bolt104is an eccentric bolt. The bolt104may be employed in multiple apertures or a single aperture on any of the parts of the adjustable wheel assembly100. The eccentric nature of the bolt104may allow for adjustment of the adjustable wheel assembly100as the bolt104is rotated from the first position to the second position causing movement in at least one of the parts coupled by the bolt104. For example, rotation of the bolt104from the first position to the second position may cause movement, such as from the extended position to the unextended position, of the swing arms120A and120B when the bolt104is used to couple the first and second swing arms120A and120B to the first and second support arms110A and110B of the support bracket110. The coupling may be accomplished through at least aperture112A and aperture122A. Other locations of the bolt104are also contemplated, as previously stated.", "", "While the bolt104in the example ofFIG.3includes the eccentric bolt and eccentric cams104A as separate pieces, in other examples the bolt104may be a single piece or includes an integrally formed eccentric cam or eccentric member. Additional examples of the bolt104, are discussed below with respect toFIGS.7A and7B.", "", "FIGS.4A and4Billustrate side views of the adjustable wheel assembly100, according to an example embodiment. The example adjustable wheel assembly100illustrates the bolt104coupling the support bracket110to a first end of the first and second swing arms120A and120B which are further coupled at a second end to the caster wheel130by way of the fastener106. The support bracket110is further coupled to the first and second swing arms120A and120B using the fastener106, which defines the point of rotation. Adjustment of the bolt104from the first position to the second position, causes the first and second swing arms to move from the extended position to the unextended position, rotating about the point of rotation. Thus, the position of the caster wheel130may be adjusted by adjusting the position of the bolt104.", "", "FIGS.5A-5Dshow side views of the adjustable wheel assembly100where the bolt104is in the first position and the second position, according to an example embodiment.FIGS.5A and5Cillustrate side views of the adjustable wheel assembly100when the bolt104is in the first position172, whileFIGS.5B and5Dillustrate side views of the adjustable wheel assembly100when the bolt104is in the second position174.", "", "In the examples shown, when the bolt104is in the first position172, the first swing arm120A and/or caster wheel130are in the extended position. The extended position may be relative to another surface and/or part that is not adjusted (e.g., remains stationary). For example, the first swing arm120A and/or caster wheel130may be in the extended position relative to the underside of the second side14of the tool storage unit10and/or relative to the first support arm110A of the support bracket110. In the extended position, for instance when the bolt is in the first position172, the first swing arm120A and the caster wheel130may be disposed at a distance further away from the underside of the second side14of the tool storage unit10than in the unextended position, for instance when the bolt104is in the second position174.", "", "The position of the bolt104may be changed from the first position172to the second position174by loosening of the securing member108(shown inFIG.3) and rotating the bolt104from one position to the other position. In this example, the bolt104is coupled to the first swing arm120A; thus, rotation of the bolt104from the first position172to the second position174causes movement in the first swing arm120A, such as from the extended position to the unextended position. After the bolt104has been moved to the new position (e.g., the second position174) the securing member108may be tightened to hold the bolt104in place using clamp up loads exerted by the securing member108. Thus, adjustment of the adjustable wheel assembly100may be accomplished by moving the position of the bolt104. Such adjustments may allow objects that the adjustable wheel assembly100coupled to, such as the tool storage unit10, to maintain a level orientation when situated on an uneven surface. This may reduce the occurrence of such objects from uncontrolled rolling which would otherwise pose a safety hazard to personnel.", "", "FIG.5Cis a side cutaway view showing the position of the bolt104in the aperture receiving the bolt104when the bolt104is in the first position172.FIG.5Dis a side cutaway view showing the position of the bolt104in the aperture receiving the bolt when the bolt104is in the second position174. As shown, the aperture receiving the bolt104may define a path of travel of the bolt104as the bolt104moves from the first position172to the second position174.", "", "While the examples shown inFIGS.5A-5Dshow the adjustable wheel assembly100employing only one bolt104, in other examples the adjustable wheel assembly may include more than one bolt104. For example, a second bolt104may be included and couple the first swing arm120A to the caster wheel130.", "", "In some examples, an adjustable wheel assembly may allow for adjustment to occur at the caster wheel.FIG.6shows an adjustable wheel assembly200, according to an example embodiment. The adjustable wheel assembly200includes a support arm210coupled, by way of fasteners located at apertures206, to a swing arm220which is rotatably coupled, using an adjustable bolt204, to a caster wheel230. In some examples, such as the example shown, the fasteners located at apertures206fixedly connect the swing arm220to the support arm210. However, the adjustable bolt204may also be used in the apertures206to couple the swing arm220to the support arm210.", "", "The adjustable wheel assembly200may be of similar construction and have similar parts as described with respect to the adjustable wheel assembly100. Therefore, features and components described in the sections discussing the adjustable wheel assembly100are applicable with respect to the adjustable wheel assembly200.", "", "In some examples, the adjustable wheel assembly200is coupled to an object, such as the tool storage unit10. In this example, the caster wheel230is vertically movable between a raised position and a lowered position relative to the underside of the second side14of the tool storage unit10. The caster wheel230is in the raised position when the adjustable bolt204is in the first position242, and in the lowered position when the adjustable bolt204is in the second position244. Thus, movement of the adjustable bolt204from the first position242to the second position244causes the caster wheel230to move from the raised position to the lowered position relative to the underside14of the second side of the tool storage unit10. The adjustable wheel assembly200may allow for leveling of the tool storage unit10on uneven surfaces, thus reducing a likelihood of uncontrolled rolling, without the aid of chocks. Eliminating the need for chocks may allow fluids on the uneven surface to properly drain, providing for a more hygienic and safer work environment.", "", "FIGS.7A and7Bshow example bolts300that may be used on the adjustable wheel assembly100, according to an example embodiment.FIG.7Aillustrates an eccentric bolt310andFIG.7Billustrates a cam bolt320according to an example.", "", "In some examples, the bolt104may take the form of the eccentric bolt310, while in other examples the bolt104may take the form of the cam bolt320. In examples where the adjustable wheel assembly includes more than one bolt104, multiple eccentric bolts310may be used, multiple cam bolts320may be used, or a mix of eccentric bolts310and cam bolts320may be used. The use of the eccentric bolt310and/or cam bolt320may allow linear motion (e.g., raising and lowering) of the adjustable wheel assembly100as the bolt is moved (e.g., rotated) from the first position172to the second position174, as described above and illustrated inFIGS.5A-5D.", "", "The dimensions of the eccentric bolt310and/or cam bolt320may be chosen based on the design constraints of the adjustable wheel assembly100, for example. Additionally and/or alternatively, the design of the adjustable wheel assembly100, for example the shape and/or dimensions of the apertures, may be selected based on the eccentric bolt310and/or cam bolt320chosen.", "", "The eccentric bolt310and/or cam bolt320may be formed from a single piece, or may include multiple components assembled together. A securing member, such as a nut, may couple to the eccentric bolt310and/or the cam bolt320, and may serve to provide clamp up load during use.", "", "The eccentric bolt310and/or cam bolt320may be made from any suitable material. In one example, the eccentric bolt310and/or cam bolt320is made from steel; however, other metals may also be used. A coating or treatment may also be applied to the eccentric bolt310and/or the cam bolt320. The coating or treatment may be a corrosion or erosion preventative coating, for example galvanizing; however, other coatings or treatments are also contemplated.", "", "FIG.8shows a method800of adjusting the height of a tool storage unit having an adjustable wheel assembly, according to an example embodiment.", "", "At block802the method800includes loosening a bolt on the adjustable wheel assembly, where the bolt is in a first position and movable between the first position and a second position, and where the adjustable wheel assembly is in a raised position when the bolt is in the first position.", "", "In some examples, loosening the bolt may involve loosening a nut securing the bolt. However, in other examples a cam lever or other clamping device may be coupled to the bolt and loosened.", "", "At block804the method800includes rotating the bolt from the first position to the second position, wherein the adjustable wheel assembly is in a lowered position when the bolt is in the second position.", "", "At block806the method800includes tightening the bolt in the second position via a clamp up load.", "", "It should be understood that the arrangements described herein and/or shown in the drawings are for purposes of example only and are not intended to be limiting. As such, those skilled in the art will appreciate that other arrangements and elements (e.g., machines, interfaces, functions, orders, and/or groupings of functions) can be used instead, and some elements can be omitted altogether.", "", "While various aspects and embodiments are described herein, other aspects and embodiments will be apparent to those skilled in the art. The various aspects and embodiments disclosed herein are for purposes of illustration and are not intended to be limiting, with the true scope being indicated by the claims, along with the full scope of equivalents to which such claims are entitled. It is also to be understood that the terminology used herein for the purpose of describing embodiments only, and is not intended to be limiting.", "", "In this description, the articles “a,” “an,” and “the” are used to introduce elements and/or functions of the example embodiments. The intent of using those articles is that there is one or more of the introduced elements and/or functions.", "", "In this description, the intent of using the term “and/or” within a list of at least two elements or functions and the intent of using the terms “at least one of,” “at least one of the following,” “one or more of,” “one or more from among,” and “one or more of the following” immediately preceding a list of at least two components or functions is to cover each embodiment including a listed component or function independently and each embodiment including a combination of the listed components or functions. For example, an embodiment described as including A, B, and/or C, or at least one of A, B, and C, or at least one of: A, B, and C, or at least one of A, B, or C, or at least one of: A, B, or C, or one or more of A, B, and C, or one or more of: A, B, and C, or one or more of A, B, or C, or one or more of: A, B, or C is intended to cover each of the following possible embodiments: (i) an embodiment including A, but not B and not C, (ii) an embodiment including B, but not A and not C, (iii) an embodiment including C, but not A and not B, (iv) an embodiment including A and B, but not C, (v) an embodiment including A and C, but not B, (v) an embodiment including B and C, but not A, and/or (vi) an embodiment including A, B, and C. For the embodiments including component or function A, the embodiments can include one A or multiple A. For the embodiments including component or function B, the embodiments can include one B or multiple B. For the embodiments including component or function C, the embodiments can include one C or multiple C. In accordance with the aforementioned example and at least some of the example embodiments, “A” can represent a component, “B” can represent a system, and “C” can represent a device.", "", "The use of ordinal numbers such as “first,” “second,” “third” and so on is to distinguish respective elements rather than to denote an order of those elements unless the context of using those terms explicitly indicates otherwise. Further, the description of a “first” element, such as a first plate, does not necessitate the presence of a second or any other element, such as a second plate."], "claims": ["a housing configured to store a tool, the housing having both a first side and a second side opposite the first side, the second side defining an underside; and an adjustable wheel assembly coupled to the housing, the adjustable wheel assembly comprising: a bolt movable between a first position and a second position, a support arm, connected to the underside of the second side of the housing, extending outwardly from the housing and defining a plurality of apertures, wherein at least one of the plurality of apertures is a point of rotation and at least one of the plurality of apertures is configured to receive the bolt, a caster wheel, and a swing arm defining a first end, a second end, and a plurality of apertures, wherein the first end receives the bolt in at least one of the apertures and is pivotally coupled to the support arm and the second end is rotatably coupled to the caster wheel, the swing arm being vertically movable between a raised position and a lowered position relative to the underside of the second side, wherein the caster wheel and swing arm are in the raised position when the bolt is in the first position and the caster wheel and swing arm are in the lowered position when the bolt is in the second position.", "2 . The tool storage unit of claim 1 , further comprising a non-adjustable wheel assembly coupled to the housing.", "3 . The tool storage unit of claim 1 , wherein the bolt is an eccentric bolt.", "4 . The tool storage unit of claim 1 , wherein the bolt is a cam bolt.", "5 . The tool storage unit of claim 1 , wherein a fixed bolt pivotally couples the swing arm to the support arm at the point of rotation and the aperture configured to receive the bolt is distinct from the point of rotation.", "6 . The tool storage unit of claim 5 , wherein an eccentric bolt or a cam bolt couples the swing arm to the support arm at the aperture configured to receive the bolt.", "7 . The tool storage unit of claim 1 , wherein an eccentric bolt or a cam bolt rotatably couples the second end of the swing arm to the caster wheel.", "a second support arm symmetrical to the first support arm and disposed at a distance from the first support arm such that the swing arm and the caster wheel are disposed between the first and second support arms.", "a second swing arm symmetrical to the first swing arm and coupled to the second support arm, wherein the caster wheel is disposed between and rotatably coupled to the first and second swing arm.", "a bolt movable between a first position and a second position, a support bracket comprising a support arm that defines a plurality of apertures, wherein at least one of the plurality of apertures is a point of rotation and at least one of the plurality of apertures is configured to receive the bolt, a caster wheel, and a swing arm defining a first end, a second end, and a plurality of apertures, wherein the first end receives the bolt in at least one of the apertures and is pivotally coupled to the support arm and the second end is rotatably coupled to the caster wheel, the swing arm being vertically movable between an extended position and an unextended position relative to the support bracket, wherein the caster wheel and swing arm are in the extended position when the bolt is in the first position and the caster wheel and swing arm are in the unextended position when the bolt is in the second position.", "11 . The adjustable wheel assembly of claim 10 , wherein the bolt is an eccentric bolt.", "12 . The adjustable wheel assembly of claim 11 , wherein the eccentric bolt comprises an eccentric fastener coupled to at least one eccentric cam.", "13 . The adjustable wheel assembly of claim 10 , wherein the bolt is a cam bolt.", "14 . The adjustable wheel assembly of claim 10 , wherein a fixed bolt pivotally couples the swing arm to the support arm at the point of rotation and the aperture configured to receive the bolt is distinct from the point of rotation.", "15 . The adjustable wheel assembly of claim 14 , wherein an eccentric bolt or a cam bolt couples the swing arm to the support arm at the aperture configured to receive the bolt.", "16 . The adjustable wheel assembly of claim 10 , wherein an eccentric bolt or a cam bolt rotatably couples the second end of the swing arm to the caster wheel.", "a second support arm symmetrical to the first support arm and disposed at a distance from the first support arm such that the swing arm and the caster wheel are disposed between the first and second support arms.", "a second swing arm symmetrical to the first swing arm and coupled to the second support arm, wherein the caster wheel is disposed between and rotatably coupled to the first and second swing arm.", "a housing configured to store a tool, the housing having both a first side and a second side opposite the first side, the second side defining an underside; and an adjustable wheel assembly coupled to the housing, the adjustable wheel assembly comprising: a bolt movable between a first position and a second position, a support arm, connected to the underside of the second side of the housing, extending outwardly from the housing, a caster wheel, and a swing arm defining a first end and a second end, wherein the first end is coupled to the support arm and the second end is rotatably coupled to the caster wheel by the bolt, the caster wheel being vertically movable between a raised position and a lowered position relative to the underside of the second side, wherein the caster wheel is in the raised position when the bolt is in the first position and the caster wheel is in the lowered position when the bolt is in the second position.", "loosening a bolt on the adjustable wheel assembly, wherein the bolt is in a first position and movable between the first position and a second position, and wherein the adjustable wheel assembly is in a raised position when the bolt is in the first position; rotating the bolt from the first position to the second position, wherein the adjustable wheel assembly is in a lowered position when the bolt is in the second position; and tightening the bolt in the second position via a clamp up load."], "bibtex": "@patent{20240286435,\n    title = {Adjustable Wheel Assembly},\n    number = {20240286435},\n    year = {2024},\n    note = {File: US20240286435A1-20240829.XML}\n    }", "classification": "B60B3304FI"}, {"title": "Tire With RFID Enclosed In Different Rubber Layers And Related Methods", "doc_number": "20240286436", "filename": "US20240286436A1-20240829.XML", "abstract": "Disclosed herein is a tire having an electronic communication module including a radio device where the radio device is positioned between a first rubber layer and a second rubber layer, with the second rubber layer having a T50 cure time at 160° C. that is than the T50 cure time of the first rubber layer. Also disclosed are related methods for curing a tire with an electronic communication module including a radio device positioned between a first rubber layer and a second rubber layer, with the second rubber layer having a T50 cure time at 160° C. that is than the T50 cure time of the first rubber layer.", "detailed_description": ["Disclosed herein is a tire having an electronic communication module including a radio device where the radio device is positioned between a first rubber layer and a second rubber layer, with the second rubber layer having a T50 cure time at 160° C. that is greater than the T50 cure time of the first rubber layer. Also disclosed are related methods for curing a tire with an electronic communication module including a radio device positioned between a first rubber layer and a second rubber layer, with the second rubber layer having a T50 cure time at 160° C. that is greater than the T50 cure time of the first rubber layer.", "", "In a first embodiment, a tire is disclosed which has an electronic communication module including a radio device, with the radio device positioned between a first rubber layer and a second rubber layer. The first rubber layer is comprised of 100 parts of at least one diene-based rubber, at least one filler, and a cure package and the first rubber layer has a T50 cure time T50-1 at 160° C. of about 1.5 to about 3.5 minutes, preferably about 2 to about 3 minutes. The second rubber layer is comprised of at least one diene-based rubber, at least one filler, and a cure package, and the second rubber layer has a T50 cure time T50-2 at 160° C. that is greater than T50-1 and is about 2.5 to about 5 minutes, preferably about 3 to about 4 minutes. According to the first embodiment, the first and second rubber layers each independently have a thickness of about 0.4 to about 3 mm, preferably about 0.5 to about 2 mm.", "", "In a second embodiment, a process is provided for curing a tire with an electronic communication module. According to the process of the second embodiment, an uncured tire carcass and an electronic communication module including an enclosed radio device positioned between a first rubber layer and a second rubber layer are provided. The first rubber layer is comprised of 100 parts of at least one diene-based rubber, at least one filler, and a cure package and the first rubber layer has a T50 cure time T50-1 at 160° C. of about 1.5 to about 3.5 minutes, preferably about 2 to about 3 minutes. The second rubber layer is comprised of at least one diene-based rubber, at least one filler, and a cure package, and the second rubber layer has a T50 cure time T50-2 at 160° C. that is greater than T50-1 and is about 2.5 to about 5 minutes, preferably about 3 to about 4 minutes. According to the second embodiment, the first and second rubber layers each independently have a thickness of about 0.4 to about 3 mm, preferably about 0.5 to about 2 mm. Further according to the process of the second embodiment, the enclosed radio device (i.e., the radio device that is positioned between the first and second rubber layers) is positioned against at least one component of the uncured tire carcass, and then the uncured tire carcass is cured together with the enclosed radio device."], "claims": ["1 - 21 . (canceled)", "wherein the first rubber layer is comprised of 100 parts of at least one diene-based rubber, at least one filler, and a cure package and the first rubber layer has a T50 cure time T50-1 at 160° C. of about 1.5 to about 3.5 minutes, wherein the second rubber layer is comprised of at least one diene-based rubber, at least one filler, and a cure package, and the second rubber layer has a T50 cure time T50-2 at 160° C. that is greater than T50-1 and is about 2.5 to about 5 minutes, wherein the first and second rubber layers each independently have a thickness of about 0.4 to about 3 mm, wherein the 100 parts of the at least one diene-based rubber of the first rubber layer includes a majority by weight of polybutadiene, polyisoprene, natural rubber, or mixtures thereof, and no more than 10 parts in total of EPDM, butyl rubber, halogenated butyl rubber, or nitrile rubber, and the 100 parts of the at least one diene-based rubber of the second rubber layer includes a majority by weight of polyisoprene, natural rubber, styrene-butadiene rubber, or mixtures thereof, and no more than 10 parts in total of EPDM, butyl rubber, halogenated butyl rubber, or nitrile rubber, wherein the at least one filler of the first rubber layer includes about 30 to about 50 phr of carbon black, and the at least one filler of the second rubber layer includes about 30 to about 50 phr of at least one filler selected from carbon black, silica, and mixtures thereof, and wherein the cure package of the first rubber layer includes sulfur as a vulcanizing agent and at least one vulcanization accelerator with a weight ratio of vulcanization accelerator to sulfur of 0.7:1 to 1.5:1, and the cure package of the second rubber layer includes sulfur as a vulcanizing agent and at least one vulcanization accelerator with a weight ratio of vulcanization accelerator to sulfur of no more than 0.6:1.", "wherein the first rubber layer meets at least one of the following: a. an elongation at break at 23° C. of less than 150%; b. a 50% modulus at 23° C. of about 3.5 MPa to about 6 MPa; c. a tension at break at 23° C. of about 9 MPa to about 15 MPa; or d. a Mooney viscosity ML1+4 at 130° C. of about 43 to about 57, and wherein the second rubber layer meets at least one of the following: e. an elongation at break at 23° C. of at least 300%; f. a 50% modulus at 23° C. of about 6 MPa to about 10 MPa; g. a tension at break at 23° C. of about 12 MPa to about 20 MPa; or h. a Mooney viscosity ML1+4 at 130° C. of about 46 to about 60.", "24 . The tire of claim 23 , wherein each of (a)-(h) are met.", "25 . The tire of claim 22 , wherein the tire includes an inner liner and the radio device is positioned radially inward of the inner liner with the second layer against the inner liner and the first rubber layer facing radially inward.", "26 . The tire of claim 22 , wherein the first rubber layer has a T50 cure time T50-1 of about 2 minutes to about 3 minutes, and second rubber layer has a T50 cure time T50-2 of about 3 to about 4 minutes.", "wherein the first rubber layer is comprised of 100 parts of at least one diene-based rubber, at least one filler, and a cure package and the first rubber layer has a T50 cure time T50-1 at 160° C. of about 1.5 to about 3.5 minutes, wherein the second rubber layer is comprised of at least one diene-based rubber, at least one filler, and a cure package, and the second rubber layer has a T50 cure time T50-2 at 160° C. that is greater than T50-1 and is about 2.5 to about 5 minutes, and wherein the first and second rubber layers each independently have a thickness of about 0.4 to about 3 mm.", "wherein the first rubber layer meets at least one of the following: a. an elongation at break at 23° C. of less than 150%; b. a 50% modulus at 23° C. of about 3.5 MPa to about 6 MPa; c. a tension at break at 23° C. of about 9 MPa to about 15 MPa; or d. a Mooney viscosity ML1+4 at 130° C. of about 43 to about 57, and wherein the second rubber layer meets at least one of the following: e. an elongation at break at 23° C. of at least 300%; f. a 50% modulus at 23° C. of about 6 MPa to about 10 MPa; g. a tension at break at 23° C. of about 12 MPa to about 20 MPa; or h. a Mooney viscosity ML1+4 at 130° C. of about 46 to about 60.", "29 . The tire of claim 28 , wherein each of (a)-(h) are met.", "30 . The tire of claim 27 , wherein the 100 parts of the at least one diene-based rubber of the first rubber layer includes a majority by weight of polybutadiene, polyisoprene, natural rubber, or mixtures thereof, and no more than 10 parts in total of EPDM, butyl rubber, halogenated butyl rubber, or nitrile rubber, and wherein the 100 parts of the at least one diene-based rubber of the second rubber layer includes a majority by weight of polyisoprene, natural rubber, styrene-butadiene rubber, or mixtures thereof, and no more than 10 parts in total of EPDM, butyl rubber, halogenated butyl rubber, or nitrile rubber.", "31 . The tire of claim 27 , wherein the at least one filler of the first rubber layer includes about 30 to about 50 phr of carbon black, and the at least one filler of the second rubber layer includes about 30 to about 50 phr of at least one filler selected from carbon black, silica, and mixtures thereof.", "32 . The tire of claim 27 , wherein the cure package of the first rubber layer includes sulfur as a vulcanizing agent and at least one vulcanization accelerator with a weight ratio of vulcanization accelerator to sulfur of 0.7:1 to 1.5:1, and the cure package of the second rubber layer includes sulfur as a vulcanizing agent and at least one vulcanization accelerator with a weight ratio of vulcanization accelerator to sulfur of no more than 0.6:1.", "33 . The tire of claim 27 , wherein the tire includes an inner liner and the radio device is positioned radially inward of the inner liner with the second layer against the inner liner and the first rubber layer facing radially inward.", "providing an uncured tire carcass and an electronic communication module including an enclosed radio device positioned between a first rubber layer and a second rubber layer, wherein the first rubber layer is comprised of 100 parts of at least one diene-containing rubber, at least one filler, and a cure package and the first rubber layer has a T50 cure time T50-1 at 160° C. of about 1.5 to about 3.5 minutes, wherein the second rubber layer is comprised of at least one diene-containing rubber, at least one filler, and a cure package, and the second rubber layer has a T50 cure time T50-2 at 160° C. that is greater than T50-1 and is about 2.5 to about 5 minutes, and wherein the first and second rubber layers each independently have a thickness of about 0.4 to about 3 mm, positioning the enclosed radio device against at least one component of the uncured tire carcass, and then curing the uncured tire carcass together with the enclosed radio device.", "35 . The method of claim 34 , wherein the curing includes use of a pebble-surface rubber curing bladder.", "wherein the first rubber layer meets at least one of the following: a. an elongation at break at 23° C. of less than 150%; b. a 50% modulus at 23° C. of about 3.5 MPa to about 6 MPa; c. a tension at break at 23° C. of about 9 MPa to about 15 MPa; or d. a Mooney viscosity ML1+4 at 130° C. of about 43 to about 57, and wherein the second rubber layer meets at least one of the following: d. an elongation at break at 23° C. of at least 300%; e. a 50% modulus at 23° C. of about 6 MPa to about 10 MPa; f. a tension at break at 23° C. of about 12 MPa to about 20 MPa; or g. a Mooney viscosity ML1+4 at 130° C. of about 46 to about 60.", "37 . The method of claim 36 , wherein each of (a)-(h) are met.", "38 . The method of claim 34 , wherein the 100 parts of the at least one diene-based rubber of the first rubber layer includes a majority by weight of polybutadiene, polyisoprene, natural rubber, or mixtures thereof, and no more than 10 parts in total of EPDM, butyl rubber, halogenated butyl rubber, or nitrile rubber, and wherein the 100 parts of the at least one diene-based rubber of the second rubber layer includes a majority by weight of polyisoprene, natural rubber, styrene-butadiene rubber, or mixtures thereof, and no more than 10 parts in total of EPDM, butyl rubber, halogenated butyl rubber, or nitrile rubber.", "39 . The method of claim 34 , wherein the at least one filler of the first rubber layer includes about 30 to about 50 phr of carbon black, and the at least one filler of the second rubber layer includes about 30 to about 50 phr of at least one filler selected from carbon black, silica, and mixtures thereof.", "40 . The method of claim 34 , wherein the cure package of the first rubber layer includes sulfur as a vulcanizing agent and at least one vulcanization accelerator with a weight ratio of vulcanization accelerator to sulfur of 0.7:1 to 1.5:1, and the cure package of the second rubber layer includes sulfur as a vulcanizing agent and at least one vulcanization accelerator with a weight ratio of vulcanization accelerator to sulfur of no more than 0.6:1.", "41 . The method of claim 34 , wherein the at least one component of the uncured tire carcass is an inner liner and the radio device is positioned radially inward of the inner liner with the second layer against the inner liner and the first rubber layer facing radially inward."], "bibtex": "@patent{20240286436,\n    title = {Tire With RFID Enclosed In Different Rubber Layers And Related Methods},\n    number = {20240286436},\n    year = {2024},\n    note = {File: US20240286436A1-20240829.XML}\n    }", "classification": "B60C100FI"}, {"title": "POLYESTER CARCASS REINFORCEMENT", "doc_number": "20240286437", "filename": "US20240286437A1-20240829.XML", "abstract": "A process for manufacturing a polyester carcass reinforcement has high tenacity improved tensile properties and high Modulus Enhancement Potential (MEP).", "detailed_description": ["“A Polyester Carcass Reinforcement” developed to fulfill the objectives of the present invention is clarified such that there is no limiting effect for the sake of better understanding.", "", "The present invention relates to a carcass reinforcement comprising:A drawn polyethylene terephthalate yarn comprising at least 90% PET by mole,Said yarn has minimum 8.8 g/d tenacity and 2.8 g/d 5% SASE,The greige cord, obtained by that yarn, has at least 110% modulus enhancement potential after being heat-set,The dipped and heat-set cord of the said yarn has maximum 0.20 g/dtex shrinkforce at 180° C. under 0.05 g/dtex pretension in 2 mins.", "", "The present invention relates to a process for manufacturing a polyester tire cord reinforcement which has high tenacity tensile properties.", "", "For the production of high tenacity fibers, high purity chips (90 mol % or more PET chips) are subjected to a solid phase polymerization to obtain chips which has an intrinsic viscosity (IV) of 0.96 to 1.2. In the next step, these chips reach to extruder having temperature controllable zones which have set values between 230 and 320° C.", "", "The next step is melt-zone, comprise of manifold and spin-pack, which is kept under temperature control by a secondary heating medium with a temperature between 260 to 330° C. Properly controlled melted polymer is pumped by gear pumps through the spinneret with certain number of holes depending on product type. After generating filaments by using spinneret, the quench zone starts. The starting part of the quench zone with certain length is kept heated with electrical heaters between 180 and 400° C. With the help of this higher temperature quench zone, the spun yarn finds residence area for slow cooling and avoids rapid quenching.", "", "After heated-quench zone, the spun yarn enters into a quenching area that cool down the fibers with forced air supply.", "", "Spun filament yarn delivered is firstly wrapped to feed roll. The drawing of yarn occurs in two different sections, and the draw ratio of first and second zones are 1.1 to 3.0, and 1.4 to 5.0 respectively. Each of the roll-sets, except first-feed roll, are heated to specific temperature.", "", "As a next step, the drawn filament yarn coming from the last drawing roll is feed to the relaxing section with relax percentage of 0% to 20% on roll set with certain temperature control. Finally, the drawn yarn winded at a speed of 3500 to 6500 m/min.", "", "Control samples A and B were compared with the invention (C) in Table 1. According to this, improved sample has higher tenacity and higher MEP (Modulus Enhancement Potential) parameter with same cord construction which has 1670 dtex, 2 plies, 390*390 TPM (twist number per meter) and heat treated at 250° C. under 1.2 g/dtex stress for 30 secs under static conditions in Testrite apparatus (%). The cords that heat set at 250° C. under 1.2 g/dtex stress were freely waited in the laboratory conditions without any tension and then measurements in the Table 1 were taken via Instron testing apparatus.", "", "TABLE 1MEP Comparison of Control A & B vs Invention (C)PET cord, 1670/2,5% LASE Greige5% LASE390/390tpm(kg)Heat-set (kg)MEPControl A5.9111.5395%Control B6.1311.9795%Invention (C)5.8312.71118%", "", "The definitions of the parameters belonging to the samples are given below:5% SASE: Stress at 5% elongation (g/dtex)Twist Multiplier (T.M.): Twist (tpm)×(√total dtex)/1000MEP (Modulus Enhancement Potential): Stress increase at 5% elongation after being heat-set at 250° C. under 1.2 g/dtex stress for 30 secs under static conditions in Testrite apparatus (%). Instron testing after 1 hour relaxation at 20-25° C. with free ends. Balanced twisted reference greige test cord has twist multiplier between 22 and 23.", "", "The following technical results have been found in line with the parameters of the polyester tire cord reinforcement obtained within the scope of the invention.Tenacity higher than 8.8 g/d enables to use thinner reinforcements in tire leading to weight and rolling resistance reduction.The 5% SASE higher than 2.8 g/d help to obtain high modulus tire cord reinforcement after being dipped and heat-set in hot stretching process.The MEP value higher than 110% provides sufficient resist to tire growth under high speed driving conditions and improves high speed durability of the tire.The cord shrinkforce less than 0.20 g/dtex provides sufficient uniformity after curing process at splice zone of the carcass layer and reduces sidewall indentation (SWI).The 5% SASE of the said dipped and heat-set cord is between 2.0 g/dtex and 4.0 g/dtex and because provides sufficient dimensional stability with enough fatigue resistance, it is preferably 2.5 g/dtex and 3.5 g/dtex.The useful linear density range of the PET yarn is between 300 and 3500 dtex. Lower than 300 dtex yarns are more expensive and the higher than 3500 dtex might not have sufficient uniformity.The cord twist multiplier between 15 and 30 provides sufficient compression fatigue resistance of the carcass under dynamic conditions."], "claims": ["a drawn polyethylene terephthalate yarn comprising at least 90% PET by mole, wherein the drawn polyethylene terephthalate yarn has minimum 8.8 g/d tenacity and 2.8 g/d 5% SASE, a greige cord, obtained by the drawn polyethylene terephthalate yarn, has at least 110% modulus enhancement potential after being heat-set, and a dipped and heat-set cord of the drawn polyethylene terephthalate yarn has maximum 0.20 g/dtex shrinkforce at 180° C. under 0.05 g/dtex pretension in 2 mins.", "2 . The carcass reinforcement according to claim 1 , wherein 5% SASE of the dipped and heat-set cord is between 2.0 g/dtex and 4.0 g/dtex.", "3 . The carcass reinforcement according to claim 2 , wherein 5% SASE of the dipped and heat-set cord is between 2.5 g/dtex and 3.5 g/dtex.", "4 . The carcass reinforcement according to claim 1 , wherein a linear density of the drawn polyethylene terephthalate yarn in cord plies is minimum 300 dtex and maximum 3500 dtex.", "5 . The carcass reinforcement according to claim 1 , wherein twist multiplier of the dipped and heat-set cord is between 15 and 30.", "6 . The carcass reinforcement according to claim 1 , wherein the dipped and heat-set polyethylene terephthalete cord is used as carcass ply in pneumatic radial tires as dipped and heat-set cord.", "7 . The carcass reinforcement according to claim 2 , wherein a linear density of the drawn polyethylene terephthalate yarn in cord plies is minimum 300 dtex and maximum 3500 dtex.", "8 . The carcass reinforcement according to claim 3 , wherein a linear density of the drawn polyethylene terephthalate yarn in cord plies is minimum 300 dtex and maximum 3500 dtex.", "9 . The carcass reinforcement according to claim 2 , wherein twist multiplier of the dipped and heat-set cord is between 15 and 30.", "10 . The carcass reinforcement according to claim 3 , wherein twist multiplier of the dipped and heat-set cord is between 15 and 30.", "11 . The carcass reinforcement according to claim 4 , wherein twist multiplier of the dipped and heat-set cord is between 15 and 30.", "12 . The carcass reinforcement according to claim 2 , wherein the dipped and heat-set polyethylene terephthalete cord is used as carcass ply in pneumatic radial tires as dipped and heat-set cord.", "13 . The carcass reinforcement according to claim 3 , wherein the dipped and heat-set polyethylene terephthalete cord is used as carcass ply in pneumatic radial tires as dipped and heat-set cord.", "14 . The carcass reinforcement according to claim 4 , wherein the dipped and heat-set polyethylene terephthalete cord is used as carcass ply in pneumatic radial tires as dipped and heat-set cord.", "15 . The carcass reinforcement according to claim 5 , wherein the dipped and heat-set polyethylene terephthalete cord is used as carcass ply in pneumatic radial tires as dipped and heat-set cord."], "bibtex": "@patent{20240286437,\n    title = {POLYESTER CARCASS REINFORCEMENT},\n    number = {20240286437},\n    year = {2024},\n    note = {File: US20240286437A1-20240829.XML}\n    }", "classification": "B60C900FI"}, {"title": "Bicycle Tire Optimized for Electric Assistance", "doc_number": "20240286438", "filename": "US20240286438A1-20240829.XML", "abstract": "A tire ( 1 ) for an electrically assisted bicycle or wheelchair having tire a crown reinforcement, which is radially on the inside of a tread, with the tread being connected to two beads via two sidewalls. The tire has, on at least one of the sidewalls ( 3 ) and protruding from the sidewall, a strip ( 4 ) of a rubber compound with an axial thickness (ep) that is at least equal to 1 mm and at most equal to 4 mm, at least equal to 10 mm and at most equal to 30 mm. The rubber compound has a Shore A hardness of between 55 and 75, and a glass transition temperature of between −15° C. and 0° C. The compound forms a smooth outer surface ( 5 ) that is intended to come into contact with a drive roller bearing a plurality of indenting elements.", "detailed_description": [""], "claims": ["a crown reinforcement, which is radially on the inside of a tread, said tread being connected to two beads via two sidewalls, wherein the tire comprises, on at least one of the sidewalls and protruding from the sidewall, a strip of a rubber compound with an axial thickness (ep), perpendicular to the sidewall, that is at least equal to 1 mm and at most equal to 4 mm, and with a radial height (Hr), perpendicular to the axis of revolution of the tire, that is at least equal to 10 mm and at most equal to 30 mm, in that said rubber compound of the strip has a Shore A hardness of between 55 and 75, and a glass transition temperature of between −15° C. and −0° C., and in that said rubber compound of the strip forms a smooth outer surface that is intended to come into contact with a drive roller bearing a plurality of indenting elements.", "2 . A lightweight vehicle, such as a bicycle, tricycle or wheelchair, comprising a tire according to claim 1 , wherein a metal roller drives at least one tire of the vehicle by rotational contact with the strip of rubber compound arranged on the sidewall of said tire."], "bibtex": "@patent{20240286438,\n    title = {Bicycle Tire Optimized for Electric Assistance},\n    number = {20240286438},\n    year = {2024},\n    note = {File: US20240286438A1-20240829.XML}\n    }", "classification": "B60C1302FI"}, {"title": "Tire With RFID Surrounded By A Rubber Layer And Related Methods", "doc_number": "20240286439", "filename": "US20240286439A1-20240829.XML", "abstract": "Disclosed herein is a tire having an electronic communication module including a radio device where the radio device is surrounded by a rubber layer having a specified T50 cure time at 160° C. Also disclosed are related methods for curing a tire with an electronic communication module including a radio device surrounded by a rubber layer having a specified T50 cure time at 160° C.", "detailed_description": ["Disclosed herein is a tire having an electronic communication module including a radio device where the radio device is surrounded by a rubber layer having a specified T50 cure time at 160° C. Also disclosed are related methods for curing a tire with an electronic communication module including a radio device surrounded by a rubber layer, with the rubber layer having a specified T50 cure time at 160° C.", "", "In a first embodiment, a tire is disclosed which has an electronic communication module including a radio device, with the radio device surrounded by a rubber layer. The rubber layer is comprised of 100 parts of at least one diene-based rubber, at least one filler, and a cure package and the rubber layer has a T50 cure time at 160° C. of about 1.5 to about 3.5 minutes, preferably about 2 to about 3 minutes. According to the first embodiment, the rubber layer has a thickness of about 0.4 to about 3 mm, preferably about 0.5 to about 2 mm.", "", "In a second embodiment, a process is provided for curing a tire with an electronic communication module. According to the process of the second embodiment, an uncured tire carcass and an electronic communication module including an enclosed radio device surrounded by a rubber layer are provided. The rubber layer is comprised of 100 parts of at least one diene-based rubber, at least one filler, and a cure package and the rubber layer has a T50 cure time at 160° C. of about 1.5 to about 3.5 minutes, preferably about 2 to about 3 minutes. According to the second embodiment, the rubber layer has a thickness of about 0.4 to about 3 mm, preferably about 0.5 to about 2 mm. Further according to the process of the second embodiment, the enclosed radio device (i.e., the radio device that is surrounded by the rubber layer) is positioned against at least one component of the uncured tire carcass, and then the uncured tire carcass is cured together with the enclosed radio device."], "claims": ["1 - 16 . (canceled)", "wherein the 100 parts of the at least one diene-based rubber of the rubber layer includes a majority by weight of polybutadiene, polyisoprene, natural rubber, or mixtures thereof, and no more than 10 parts in total of EPDM, butyl rubber, halogenated butyl rubber, or nitrile rubber. wherein the at least one filler of the rubber layer includes about 30 to about 50 phr of carbon black wherein the cure package of the rubber layer includes sulfur as a vulcanizing agent and at least one vulcanization accelerator with a weight ratio of vulcanization accelerator to sulfur of 0.7:1 to 1.5:1.", "a. an elongation at break at 23° C. of less than 150%; b. a 50% modulus at 23° C. of about 3.5 MPa to about 6 MPa; c. a tension at break at 23° C. of about 9 MPa to about 15 MPa; or d. a Mooney viscosity ML1+4 at 130° C. of about 43 to about 57.", "19 . The tire of claim 18 , wherein each of (a)-(d) is met.", "20 . A tire having an electronic communication including a radio device surrounded by a rubber layer comprised of 100 parts of at least one diene-based rubber, at least one filler, and a cure package, wherein the rubber layer has a T50 cure time at 160° C. of about 1.5 to about 3 minutes, and a thickness of about 0.4 to about 3 mm.", "a. an elongation at break at 23° C. of less than 150%; b. a 50% modulus at 23° C. of about 3.5 MPa to about 6 MPa; c. a tension at break at 23° C. of about 9 MPa to about 15 MPa; or d. a Mooney viscosity ML1+4 at 130° C. of about 43 to about 57.", "22 . The tire of claim 21 , wherein each of (a)-(d) is met.", "23 . The tire of claim 20 , wherein the 100 parts of the at least one diene-based rubber of the rubber layer includes a majority by weight of polybutadiene, polyisoprene, natural rubber, or mixtures thereof, and no more than 10 parts in total of EPDM, butyl rubber, halogenated butyl rubber, or nitrile rubber.", "24 . The tire of claim 20 , wherein the entirety of the 100 parts of the at least one diene-based rubber of the rubber layer is selected from the group consisting of polybutadiene, polyisoprene, natural rubber, and mixtures thereof.", "25 . The tire of claim 20 , wherein the at least one filler of the rubber layer includes about 30 to about 50 phr of carbon black.", "26 . The tire of claim 20 , wherein the cure package of the rubber layer includes sulfur as a vulcanizing agent and at least one vulcanization accelerator with a weight ratio of vulcanization accelerator to sulfur of 0.7:1 to 1.5:1.", "27 . The tire of claim 20 , wherein the tire includes an inner liner and the radio device is positioned radially inward of the inner liner.", "providing an uncured tire carcass and an electronic communication module including an enclosed radio device surrounded by a rubber layer comprised of 100 parts of at least one diene-containing rubber, at least one filler, and a cure package, wherein the rubber layer has a T50 cure time at 160° C. of about 1.5 to 3 minutes, and the rubber layer has a thickness of about 0.4 to about 3 mm, and positioning the enclosed radio device against at least one component of the uncured tire carcass, and then curing the uncured tire carcass together with the enclosed radio device.", "29 . The method of claim 28 , wherein the curing includes use of a pebble-surface rubber curing bladder.", "a. an elongation at break at 23° C. of less than 150%; b. a 50% modulus at 23° C. of about 3.5 MPa to about 6 MPa; c. a tension at break at 23° C. of about 9 MPa to about 15 MPa; or d. a Mooney viscosity ML1+4 at 130° C. of about 43 to about 57.", "31 . The method of claim 28 , wherein the 100 parts of the at least one diene-based rubber of the rubber layer includes a majority by weight of polybutadiene, polyisoprene, natural rubber, or mixtures thereof, and no more than 10 parts in total of EPDM, butyl rubber, halogenated butyl rubber, or nitrile rubber.", "32 . The method of claim 28 , wherein the entirety of the 100 parts of the at least one diene-based rubber of the rubber layer is selected from the group consisting of polybutadiene, polyisoprene, natural rubber, and mixtures thereof.", "33 . The method of claim 28 , wherein the at least one filler of the rubber layer includes about 30 to about 50 phr of carbon black.", "34 . The method claim 28 , wherein the cure package of the rubber layer includes sulfur as a vulcanizing agent and at least one vulcanization accelerator with a weight ratio of vulcanization accelerator to sulfur of 0.7:1 to 1.5:1.", "35 . The method of claim 28 , wherein the enclosed radio device is surrounded by the rubber layer via a process that includes use of two separate sheets of the rubber layer which are used to surround the radio device.", "36 . The method of claim 28 , wherein the at least one component of the uncured tire"], "bibtex": "@patent{20240286439,\n    title = {Tire With RFID Surrounded By A Rubber Layer And Related Methods},\n    number = {20240286439},\n    year = {2024},\n    note = {File: US20240286439A1-20240829.XML}\n    }", "classification": "B60C1900FI"}, {"title": "SOUND-ABSORBING DEVICE FOR A VEHICLE WHEEL", "doc_number": "20240286440", "filename": "US20240286440A1-20240829.XML", "abstract": "A sound-absorbing device includes a resonator. The resonator includes a flexible, tube-shaped resonator body having a first end, a second end, and a channel fluidically connecting the first end and the second end. The resonator body is wrapped completely around a hub of a vehicle wheel at least one time and is configured to absorb sound produced within a cavity of a tire of the vehicle wheel.", "detailed_description": ["The present disclosure provides a sound-absorbing device for a vehicle wheel. The sound-absorbing device includes a resonator. The resonator includes a flexible, tube-shaped resonator body having a first end, a second end, and a channel fluidically connecting the first end and the second end. The resonator body is wrapped completely around a hub of a vehicle wheel at least one time and is configured to absorb sound produced within a cavity of a tire of the vehicle wheel.", "", "Referring toFIGS.1A and1B, an example of a wheel100for a vehicle is shown. Among other components typical of vehicle wheels, the wheel100includes a tire110and a hub120. The tire110can be a standard tire typical of vehicles and formed from rubber. The tire110is hollow, defines a cavity130, and is configured to be mounted to the hub120. As the wheel100rolls on a ground upon which the vehicle is traveling, sound may be produced within the cavity130. In some instances, this sound can be undesirable to a driver of the vehicle. Therefore, it may be advantageous to absorb at least some of the sound produced within the cavity130.", "", "Accordingly, the wheel100includes a sound-absorbing device. The sound-absorbing device is located within the cavity130and is configured to absorb sound produced within the cavity130as the wheel100rolls on the ground. The sound-absorbing device includes a resonator140. The resonator140includes a resonator body150, which is long, flexible, and tube-like and can be configured to wrap around the hub120one or more times. As used herein, the term “flexible” means that the resonator body150is pliable enough to wrap around the hub120without incurring significant stresses in the material of the resonator body150that might lead to the material ripping or breaking. The resonator body150also includes a first end160and a second end170and defines a channel180(FIG.2) fluidically connecting the first end160and the second end170. As molecules of air or other gas within the cavity130pass through the channel180, the channel180significantly restricts movement of the molecules, and friction between the molecules increases. Accordingly, acoustic energy is dissipated in the form of heat due to the friction, and sound is absorbed by the resonator140.", "", "As described herein, the channel180is substantially hollow. However, in one or more arrangements, referring toFIG.2, the channel180may be filled with sound-absorbing material200. As shown, the sound-absorbing material200fills the entire channel180. However, it will be understood that, in some arrangements, the sound-absorbing material200does not fill the entire channel180. For example, only a section of the channel180may be filled with sound-absorbing material200. In another example, the entire channel180may be lined with sound-absorbing material200, or only a section of the channel180may be lined with sound-absorbing material200.", "", "Referring back toFIGS.1A and1B, in one or more arrangements, the resonator body150is formed from flexible tubing. For example, the resonator body150can be formed from commercially-available silicone or rubber tubing. However, any other suitable material may be used to form the resonator body150. In some instances, the material forming the resonator body150is lightweight. The resonator body150can be formed in any suitable manner. For example, the resonator body150can be formed by cutting commercially available tubing to a desired size. In other examples, the resonator body150can be formed by extruding, molding, or otherwise forming plastic or silicone-based material into a tube shape. Once formed to the desired size, the resonator body150defines an inner diameter D and a length L (FIG.3). The inner diameter D and/or the length L can be any suitable dimension. In some instances, the inner diameter D has the same dimension along the length L of the resonator body150. In other instances, the inner diameter D may vary along the length L of the resonator body150. The length L, in some instances, is substantially equal to or greater than a circumference of the hub120.", "", "The resonator body150can be attached to the hub120in any suitable manner. In one or more arrangements, the resonator body150is adhered directly to the hub120. For example, the resonator body150can be glued or taped directly to the hub120. In one or more other arrangements, referring now toFIG.3, the resonator body150can be attached to the hub120using a mount300. The mount300can be unitarily formed with the hub120, or the mount300can be configured for attachment to the hub120. The mount300can include one or more apertures configured to hold the resonator body150at a location near both the first end160and the second end170, as shown. In one or more arrangements, the aperture(s) can have a diameter slightly larger than an outer diameter of the resonator body150, and the resonator body150can be adhered to the mount300, for example, by glue. In one or more other arrangements, the aperture(s) can have a diameter substantially equal or less than the outer diameter of the resonator body150such that the resonator body150forms a tight fit (e.g., a press fit) with the aperture(s) to keep the resonator140in place.", "", "In one or more arrangements, the resonator140is a quarter-wavelength resonator140. As mentioned above, the resonator body150defines an inner diameter D and a length L. In some instances, the inner diameter D of the resonator body150governs the bandwidth of the sound absorbed by the resonator140. Accordingly, the inner diameter D can have any suitable dimension that creates a high friction between the air molecules in the channel180. Moreover, in some instances, the length L of the resonator body governs the resonance frequency f of the resonator140. For example, the resonance frequency f is defined by the following equation, where c is the speed of sound and n is the harmonic index (n=1, 3, 5, 7, etc.). The harmonic index will be described in further detail below.", "", "f,n=cn4⁢L", "", "In some instances, it may be advantageous to tune the resonance frequency f to a frequency of the sound produced by the tire110rolling on the ground as the vehicle is driven, which, in some instances, is about 500-1000 Hz. However, it will be understood that the resonance frequency f may be tuned to any other suitable resonance frequency. In one or more arrangements, the resonance frequency f can be changed by the addition of one or more components to the resonator140. For example, referring now toFIG.4, the resonator140may include a cap400. The cap400can be configured to change the resonance frequency f, for example, by changing the speed of the sound traveling through the channel180. More specifically, a resonator140with two open ends may function as a different type of resonator rather than a quarter-wavelength resonator. The cap400can be attached to the first end160or the second end170, and the cap400can be attached to the resonator140in any suitable manner. For example, the cap400can define an aperture configured to receive the first end160or the second end170. In one or more arrangements, the aperture can have a diameter slightly smaller than an outer diameter of the resonator body150, and the resonator body150can be adhered to the cap400, for example, by glue. In one or more other arrangements, the aperture can have a diameter substantially equal to or less than the outer diameter of the resonator body150such that the resonator body150forms a tight fit (e.g., press fit) with the aperture(s) to keep the cap400in place.", "", "Though the tire110is described above as exhibiting a single resonance frequency, in some instances, the tire110may exhibit multiple resonance frequencies. Accordingly, it may be advantageous to design the resonator140such that it is configured to absorb sound waves of different frequencies. In one or more arrangements, referring now toFIG.5A, this may be accomplished by sectioning the channel180(FIG.2) to create two or more resonator body sections500. Each resonator body section500defines its own aperture510, which allows the passage of air or other gas through the channel180of each resonator body section500, thereby allowing each resonator body section500to function as an individual resonator.", "", "As shown inFIG.5A, the channel180is sectioned to form five (5) resonator body sections500. The five resonator body sections include a first resonator body section500A, a second resonator body section500B, a third resonator body section500C, a fourth resonator body section500D, and a fifth resonator body section500E. However, it will be understood that the channel180can be sectioned to form any suitable number of resonator body sections500, for example, two (2) resonators body sections500, three (3) resonator body sections500, four (4) resonator body sections500, six (6) resonator body sections500, etc. As mentioned above, each resonator body section500defines its own aperture510. More specifically, the first resonator body section500A defines a first aperture510A, the second resonator body section500B defines a second aperture510B, the third resonator body section500C defines a third aperture510C, the fourth resonator body section500D defines a fourth aperture510D, and the fifth resonator body section500E defines a fifth aperture510E. In some instances, the first aperture510A can be the first end160, and the fifth aperture510E can be the second end170.", "", "The channel180can be sectioned in any suitable manner. Referring now toFIGS.5A and5B, in one or more arrangements, the resonator140can include one or more clamps520. The clamp(s)520are configured to clamp the resonator body150to block the passage of air or other gas at the point of the clamp520. As shown inFIG.5A, the resonator140includes four (4) clamps520configured to section the resonator body150into the five resonator body sections500. More specifically, the resonator140includes a first clamp520A, a second clamp520B, a third clamp520C, and a fourth clamp520D. However, it will be understood that the resonator140can include any suitable number of clamp(s)520configured to section the resonator body150into any suitable number of resonator body sections500. The clamp(s)520can be positioned along the length L of the resonator body150in any suitable manner. For example, as shown inFIG.5A, the clamp(s)520are substantially equally spaced along the length L. However, it will be understood that the clamp(s)520can be un-equally spaced along the length L.", "", "The clamp(s)520can have any suitable structure. Referring now toFIG.5B, a cross-sectional view of one arrangement of one of the clamp(s)520is shown. The clamp520has a clamp body530that is configured to close around the resonator body150. The clamp body530defines a first protrusion540A and a second protrusion540B respectively positioned across from each other with respect to the resonator body150. When the clamp body530is clamped to the resonator body150, the first protrusion540A and the second protrusion540B pinch the resonator body150such that the passage of air or other gas through the channel180at the point of the clamp530is substantially blocked.", "", "In one or more other arrangements, referring now toFIG.5C, the resonator140can include one or more beads550located in the channel180and configured to section the channel180into the resonator body sections500. The bead(s)550can be formed from acoustically-rigid material. As used herein, the term “acoustically-rigid” means that the material significantly blocks sound from passing through the material. The acoustically-rigid material can be a physically rigid material such as plastic or metal, or the acoustically-rigid material can be a physically softer but still acoustically-rigid material such as foam or even drops of water. Like the clamp(s)520, the bead(s)550can be substantially equally spaced along the length L of the resonator body150. However, it will be understood that the bead(s)550can be un-equally spaced along the length L.", "", "Another way to account for multiple resonance frequencies produced by the tire110is to use multiple resonators. Referring now toFIG.6A, the sound-absorbing device can include two resonators. The sound-absorbing device can include a first resonator140, as described above. The sound-absorbing device can also include a second resonator600. Like the first resonator140, the second resonator600includes a second resonator body610, a second resonator first end620, a second resonator second end630, and a second resonator channel (not shown) fluidically connecting the second resonator first end620and the second resonator second end630. Both the first resonator140and the second resonator600can be configured to wrap around the hub120one or more times. In some instances, the first resonator140and the second resonator600can define different inner diameters and/or different lengths such that the first resonator140and the second resonator600exhibit different resonance frequencies. For example, the first resonator140can define a first inner diameter D1and a first length L1, and the second resonator600can define a second inner diameter D2and a second length L2. In some instances, the first inner diameter D1and the second inner diameter D2are different. Similarly, in some instances, the first length L1and the second length L2are different. However, it will be understood that the first inner diameter D1and the second inner diameter D2can be substantially equal, and the first length L1and the second length L2can be substantially equal. Moreover, it will be understood that whileFIG.6Adepicts the sound-absorbing device as having two resonators, the sound-absorbing device can include any suitable number of resonators. For example, the sound-absorbing device can include 3 resonators, 4 resonators, 5 resonators, etc.", "", "Yet another way to account for multiple resonance frequencies produced by the tire110is to design the resonator140with a longer length L and wrap the resonator140around the hub120multiple times. As used herein, the term “longer length” can mean that the resonator140has a length L that is long enough to wrap around the hub120two or more times (in other words, the length L is greater than two times the circumference of the hub120). Referring toFIG.6B, an example of a resonator140having a longer length L and being wrapped multiple times around the hub120is shown. In arrangements where the resonator140is a quarter-wave length resonator140, a characteristic of the quarter-wavelength resonator140is its ability to have multiple resonance modes for a longer length L. Because the frequency interval is inversely proportional to the length L, the longer the resonator140is, the smaller the frequency intervals become such that many resonance peaks appear in a given frequency range, and the more resonance frequencies are observed by the resonator140. For example, the fundamental resonance mode (e.g., the fundamental frequency) is f0. Higher-mode resonances occur in increasing intervals of 2*f0. For example, higher-mode resonances occur at 3*f0, 5*f0, 7*f0, etc. Since the higher-mode resonances are multiples of the fundamental resonance, in some instances, it may be advantageous to design the resonator to have the lowest possible fundamental resonance mode. This allows the resonator to have many more higher-mode resonance frequencies for the same length of the resonator body.", "", "Referring now toFIGS.7A-7C, examples of the acoustic spectra of some of the variations described herein are shown.FIG.7Ashows an acoustic spectrum of the sound produced within a cavity130of a tire110without a resonator140. It can be seen that the sound exhibits multiple resonance frequencies. More specifically, the resonance frequencies occur at around 200 Hertz (Hz), around 370 Hz, around 550 Hz, around 750 Hz, and around 950 Hz. The noise level of the first resonance frequency (about 200 Hz) is about 35 decibels (dB). The noise level of the second resonance frequency (about 370 Hz) is about 90 dB. The noise level of the third resonance frequency (about 550 Hz) is about 65 Hz. The noise level of the fourth resonance frequency (about 750 Hz) is about 105 Hz. The noise level of the fifth resonance frequency (around 950 Hz) is about 80 dB.", "", "FIG.7Bshows an example of an acoustic spectrum of the sound produced within the cavity130of the tire110including a resonator140with an inner diameter of about 10 mm. It can be seen that the noise levels of some of the resonance frequencies described above in connection withFIG.7Aare lower. For example, the noise level of the second resonance frequency (about 370 Hz) is about 80 dB. The noise level of the fourth resonance frequency (about 750 Hz) is about 80 Hz. The noise level of the fifth resonance frequency (around 950 Hz) is about 70 dB.", "", "FIG.7Cshows an example of an acoustic spectrum of the sound produced within the cavity130of the tire110including a resonator140with an inner diameter of about 15 mm. It can be seen that the noise levels of some of the resonance frequencies described above in connection withFIGS.7A and7Bare even lower. For example, the noise level of the second resonance frequency (about 370 Hz) is about 70 dB. The noise level of the third resonance frequency (about 550 Hz) is about 55 Hz. The noise level of the fourth resonance frequency (about 750 Hz) is about 60 Hz. The noise level of the fifth resonance frequency (around 950 Hz) is about 60 dB.", "", "FIG.7Dshows an example of an acoustic spectrum of the sound produced within a cavity130of a tire110with a resonator140having a longer length, for example, the resonator ofFIG.6B. It can be seen that the resonator140exhibits multiple resonance modes, for example, a first resonance mode at about 1 Hz, a second resonance mode at about 200 Hz, a third resonance mode at about 280 Hz, a fourth resonance mode at about 480 Hz, a fifth resonance mode at about 670 Hz, and a sixth resonance mode at about 870 Hz. These resonance modes may correspond to the resonance frequencies of the sound produced within the cavity130as the tire110rolls on the ground during driving.", "", "The variations described herein have the benefit of absorbing sound produced within a cavity of a tire of a vehicle wheel as the wheel rolls on the ground during driving. Moreover, the variations described herein allow for sound-absorption within a tire without the need for high-cost manufacturing of sound-absorbing devices within the hub of the wheel itself. Additionally, the variations described herein may allow for low-cost sound absorption, as the resonator can be produced with standard, low-cost materials.", "", "The preceding description is merely illustrative in nature and is in no way intended to limit the disclosure, its application, or uses. Work of the presently named inventors, to the extent it may be described in the background section, as well as aspects of the description that may not otherwise qualify as prior art at the time of filing, are neither expressly nor impliedly admitted as prior art against the present technology.", "", "As used herein, the phrase at least one of A, B, and C should be construed to mean a logical (A or B or C), using a non-exclusive logical “or.” It should be understood that the various steps within a method may be executed in different order without altering the principles of the present disclosure. Disclosure of ranges includes disclosure of all ranges and subdivided ranges within the entire range.", "", "The headings (such as “Background” and “Summary”) and sub-headings used herein are intended only for general organization of topics within the present disclosure and are not intended to limit the disclosure of the technology or any aspect thereof. The recitation of multiple variations or forms having stated features is not intended to exclude other variations or forms having additional features, or other variations or forms incorporating different combinations of the stated features.", "", "As used herein the term “about” when related to numerical values herein refers to known commercial and/or experimental measurement variations or tolerances for the referenced quantity. In some variations, such known commercial and/or experimental measurement tolerances are +/−10% of the measured value, while in other variations such known commercial and/or experimental measurement tolerances are +/−5% of the measured value, while in still other variations such known commercial and/or experimental measurement tolerances are +/−2.5% of the measured value. And in at least one variation, such known commercial and/or experimental measurement tolerances are +/−1% of the measured value.", "", "The terms “a” and “an,” as used herein, are defined as one or more than one. The term “plurality.” as used herein, is defined as two or more than two. The term “another,” as used herein, is defined as at least a second or more. The terms “including” and/or “having.” as used herein, are defined as comprising (i.e., open language). The phrase “at least one of . . . and . . . ” as used herein refers to and encompasses any and all possible combinations of one or more of the associated listed items. As an example, the phrase “at least one of A, B, and C” includes A only, B only, C only, or any combination thereof (e.g., AB, AC, BC, or ABC).", "", "As used herein, the terms “comprise” and “include” and their variants are intended to be non-limiting, such that recitation of items in succession or a list is not to the exclusion of other like items that may also be useful in the devices and methods of this technology. Similarly, the terms “can” and “may” and their variants are intended to be non-limiting, such that recitation that a form or variation can or may comprise certain elements or features does not exclude other forms or variations of the present technology that do not contain those elements or features.", "", "The broad teachings of the present disclosure can be implemented in a variety of forms. Therefore, while this disclosure includes particular examples, the true scope of the disclosure should not be so limited since other modifications will become apparent to the skilled practitioner upon a study of the specification and the following claims. Reference herein to one variation, or various variations, means that a particular feature, structure, or characteristic described in connection with a form, a variation, or a particular system is included in at least one variation or form. The appearances of the phrase “in one variation” (or variations thereof) are not necessarily referring to the same variation or form. It should be also understood that the various method steps discussed herein do not have to be carried out in the same order as depicted, and not each method step is required in each variation or form.", "", "The foregoing description of the forms and variations has been provided for purposes of illustration and description. It is not intended to be exhaustive or to limit the disclosure. Individual elements or features of a particular form or variation are generally not limited to that particular form or variation, but, where applicable, are interchangeable and can be used in a selected form or variation, even if not specifically shown or described. The same may also be varied in many ways. Such variations should not be regarded as a departure from the disclosure, and all such modifications are intended to be included within the scope of the disclosure."], "claims": ["a resonator including a flexible, tube-shaped resonator body having a first end, a second end, and a channel fluidically connecting the first end and the second end, the resonator body wrapped completely around a hub of a vehicle wheel at least one time and configured to absorb sound produced within a cavity of a tire of the vehicle wheel.", "2 . The sound-absorbing device of claim 1 , wherein the resonator body is adhered directly to the hub.", "3 . The sound-absorbing device of claim 1 , further comprising a mount configured to adhere the resonator body to the hub.", "4 . The sound-absorbing device of claim 1 , wherein the resonator is a quarter-wavelength resonator having a resonance frequency that is a function of a length of the resonator body.", "5 . The sound-absorbing device of claim 4 , wherein the resonance frequency is substantially equal to a resonance frequency of a sound produced by the tire rolling on the ground.", "6 . The sound-absorbing device of claim 4 , further comprising a cap covering one of the first end and the second end, thereby changing the resonance frequency.", "7 . The sound-absorbing device of claim 1 , wherein the channel is sectioned into a plurality of resonator body sections with each of the plurality of resonator body sections defining an aperture such that each of the plurality of resonator body sections functions as an individual resonator.", "8 . The sound-absorbing device of claim 7 , further comprising one or more clamps located external to the resonator body and configured to clamp the resonator body to section the channel into the plurality of resonator body sections.", "9 . The sound-absorbing device of claim 7 , further comprising one or more beads located in the channel and configured to section the channel into the plurality of resonator body sections.", "10 . The sound-absorbing device of claim 1 , wherein the resonator includes sound-absorbing material located in the channel to further absorb sound within the cavity.", "11 . The sound-absorbing device of claim 1 , wherein the resonator body has a length substantially longer than a circumference of the hub, is wrapped completely around the hub at least two times, and is configured to absorb sound of multiple resonance frequencies, the multiple resonance frequencies including a fundamental frequency and one or more higher-mode resonance frequencies in intervals of twice the fundamental frequency.", "a hub; a tire mounted to the hub and defining a hollow cavity; and a resonator including a flexible, tube-shaped resonator body having a first end, a second end, and a channel fluidically connecting the first end and the second end, the resonator body wrapped completely around the hub at least one time, the resonator configured as a quarter-wavelength resonator having a resonance frequency that is a function of a length of the resonator body and that is substantially equal to a resonance frequency of a sound produced by the tire rolling on the ground, whereby the resonator is configured to absorb sound produced in the cavity.", "13 . The vehicle wheel of claim 12 , further comprising a cap covering one of the first end and the second end, thereby changing the resonance frequency.", "14 . The vehicle wheel of claim 12 , wherein the channel is sectioned into a plurality of resonator body sections with each of the plurality of resonator body sections defining an aperture such that each of the plurality of resonator body sections functions as an individual resonator.", "15 . The vehicle wheel of claim 14 , further comprising one or more clamps located external to the resonator body and configured to clamp the resonator body to section the channel into the plurality of resonator body sections.", "16 . The vehicle wheel of claim 14 , further comprising one or more beads located in the channel and configured to section the channel into the plurality of resonator body sections.", "17 . The vehicle wheel of claim 12 , wherein the resonator includes sound-absorbing material located in the channel to further absorb sound within the cavity.", "18 . The vehicle wheel of claim 12 , wherein the resonator body has a length substantially longer than a circumference of the hub, is wrapped completely around the hub at least two times, and is configured to absorb sound of multiple resonance frequencies, the multiple resonance frequencies including a fundamental frequency and one or more higher-mode resonance frequencies in intervals of twice the fundamental frequency.", "a plurality of resonators, each of the plurality of resonators including a flexible, tube-shaped resonator body having a first end, a second end, and a channel fluidically connecting the first end and the second end, each of the resonator bodies wrapped around a hub of a vehicle wheel at least one time and configured to absorb sound produced within a cavity of a tire of the vehicle wheel.", "20 . The sound-absorbing device of claim 19 , wherein each of the plurality of resonators defines an inner diameter and a length, and wherein the inner diameter and the length of one of the plurality of resonators is different from the inner diameter and length of at least one of the other plurality of resonators, whereby the plurality of resonators are configured to absorb sound of multiple resonance frequencies."], "bibtex": "@patent{20240286440,\n    title = {SOUND-ABSORBING DEVICE FOR A VEHICLE WHEEL},\n    number = {20240286440},\n    year = {2024},\n    note = {File: US20240286440A1-20240829.XML}\n    }", "classification": "B60C1900FI"}, {"title": "DATA DRIVEN SMART NON-PNEUMATIC TIRES", "doc_number": "20240286441", "filename": "US20240286441A1-20240829.XML", "abstract": "Various embodiments of a smart non-pneumatic tire and methods for generating a mean vibration characteristic of the smart non-pneumatic tire are described. In one embodiment, a method for measuring the mean vibration characteristic includes receiving tire-road contact acceleration data from an accelerometer that is secured near a tire-surface contact region, where the tire-road contact acceleration data includes data captured by the accelerometer over a duration of time while a tread along an outer periphery of a sector of the tire contacts a surface. The method further includes receiving velocity data for the tire and load data for the tire over the duration of time. The method further includes generating a mean vibration characteristic based on the above-mentioned data. The method also includes changing a stiffness of spokes of the tire based on the generated mean vibration characteristic in some cases.", "detailed_description": ["Non-pneumatic tires, or puncture-free tires, provide a next-generation mobility solution for making rides safe from punctures and common road hazards, which often result in accidents due to tire blowouts. The absence of air in such tires, however, can toggle a negative effect which can affect ride comfort, as the air in a regular pneumatic tire serves to dampen such vibrations. Thus, the commercial usability of conventional non-pneumatic tires is hampered by inherent problems like heat dissipation and ride discomfort.", "", "In order to address the shortcomings and ride discomfort challenges faced by non-pneumatic tires today, the present disclosure presents a smart non-pneumatic tire that can use real-time vibration information to alter the framework of such tires. Such tires can sense the road profile and control the stiffness of the structural aspects of the tire-spoke framework to stiffen or dampen them based on driving conditions. In addition, the tire-spoke framework may be altered based on information about instantaneous road profiles and ride quality metrics. Accordingly, the smart non-pneumatic tires described herein can address not only tire blowouts but also provide a softer ride using a feedback control system.", "", "In the context outlined above, various embodiments of a smart non-pneumatic tire and methods for generating a mean vibration characteristic of the smart tire are described herein. In various embodiments, generating a mean vibration characteristic can include predicting a mean vibration characteristic. In one embodiment, a method for measuring the mean vibration characteristic includes receiving tire-road contact acceleration data from an accelerometer that is secured to a spoke of the non-pneumatic tire within a sector of the tire, where the tire-road contact acceleration data includes data captured by the accelerometer over a duration of time while a tread extending along an outer periphery of the sector contacts a surface. The method further includes receiving velocity data for the tire and load data for the tire over the duration of time from the accelerometer secured to a spoke of the tire. In one example, the velocity data and the load data for the tire may be received by extracting or retrieving the data from the accelerometer secured to the spoke of the tire. The method further includes predicting a mean vibration characteristic based on the above-mentioned data. The method also includes changing a stiffness of the spokes of the tire based on the predicted mean vibration characteristic in some cases.", "", "With reference to the drawings,FIG.1illustrates a motor vehicle100with smart non-pneumatic tires103and150implemented according to various embodiments described herein. The smart tires103and150can measure vibration characteristics of the road and change the stiffness of spokes within the smart tires103and150based on the measured vibration characteristics. The illustration inFIG.1is provided as a representative example. The motor vehicle100, the smart tires103and150, and other components shown inFIG.1are not necessarily drawn to any particular scale or size. Additionally,FIG.1is not exhaustively illustrated, meaning that other components that are not shown inFIG.1can be included and relied upon in some cases. Similarly, one or more of the components shown inFIG.1can be omitted in some cases.", "", "Among other components, the motor vehicle100includes a computing device133and the smart tires103and150. The smart tire103includes an accelerometer109, a tire-center member118, and a computing device130, among possibly other components. The smart tire150can be similar to the smart tire103. In other cases, the smart tire150can omit the accelerometer109and other components of the smart tire103.", "", "The accelerometer109is positioned within the smart tire103and can be attached to one or more spokes (seeFIG.2) of the non-pneumatic tire103, at an intersection point between the spokes and tread of the tire103, or at another suitable location in or on the non-pneumatic tire103. In one example, the accelerometer109can be secured within a sector112of the tire103and can be configured to measure acceleration experienced by the tire103while the tire103contacts a surface127as the motor vehicle100is driven. In this regard, the surface127may be a road, pavement, or any surface a car may be moved or driven on, and the accelerometer109can include devices that can measure the vibration or acceleration of a motion of a structure.", "", "The computing devices130and133can include one or more processing circuits, for example, having processors and memories or memory devices, which can be coupled to a local interface for data communications. The processing circuits of the computing devices130and133can process data, as described herein, such as dynamic tire data of the smart non-pneumatic tire103, the tire150, and other tires of the motor vehicle100, including normal load data, velocity data, and tire-road contact acceleration data. The computing devices130and133can also include power sources, such as batteries or other power sources, and battery charging systems. The local interfaces of the computing devices130and133can be embodied as wired, wireless, or wired and wireless local interfaces.", "", "The accelerometer109can be embodied as one or more accelerometers. As one example, the accelerometer109is capable of measuring acceleration (i.e., the rate of change of velocity) as compared to its own instantaneous rest frame and provide feedback signals or data representative of the acceleration. The accelerometer109can be a single- or multi-axis accelerometer, capable of detecting both the magnitude and the direction of the acceleration in some cases, as a vector quantity. In some cases, the accelerometer109can be an inertial measurement unit (IMU) capable of also measuring orientation, positional angular information, velocity, and other inertial information related to the tire103. Thus, the accelerometer109can also sense orientation, coordinate acceleration, vibration, shock, and falling motions in some cases. The accelerometer109provides the feedback signals or data including these metrics to the computing device130for further processing, as described below. Based in part on the feedback signals from the accelerometer109and other data, the computing device130can calculate a mean vibration characteristic for the tire103, among other characteristics, as described below. Examples of the accelerometer109can include accelerometers from Dytran®, Honeywell®, Bosch®, and other manufacturers.", "", "The sector112is an area enclosed by a region of the tire103, which can be defined as an area between a central angle (θ)115, two radii121, and a circular arc124between the two radii121. According to various embodiments, the central angle (θ) can include a contact patch angle (θ). In this respect, the central angle (θ)115can further be defined as an angle that is formed by an apex (vertex) at the center of the tire103and/or the tire-center member118, and whose sides are the radii121extending from the vertex to two distinct points on the circumference of the tire103. In this respect, the circular arc124connects the radii121along the circumference of the tire103. AlthoughFIG.1illustrates one sector112, more than one sector that includes an accelerometer may be implemented in the smart tire103in accordance with the various embodiments presented herein.", "", "In the example shown, the accelerometer109is secured within the sector112at a location closer to the circular arc124than to the tire center member118of the tire103. The accelerometer109can be secured close to the tread of the tire103that extends along the circular arc124on the inner liner of the tire. The tire103can experience vibrations coming from the tire-surface interface as a contact patch160comes into contact with the surface127. As the contact patch160contacts the surface127, vibration characteristics being transferred from the surface127to the smart tire103can be measured by the accelerometer109. For example, when the motor vehicle100is being driven, the tread of the tire103that extends along the circular arc124, to which the accelerometer109is positioned near, contacts the surface127for a short duration of time in each revolution of the tire103. Accordingly, the accelerometer109, when configured to measure acceleration, can measure vibrations transmitted from the surface127through the tire-surface contact patch160to the tire103, and the motor vehicle100.", "", "The accelerometer109may be in data communications with the computing device130, computing device133, or both the computing devices130and133. The network communications interfaces can include wireless communications interfaces, such as cellular, WI-FIR, BLUETOOTH®, Z-WAVER, ZigBee, or other wireless communications interfaces. In other examples, the network communications interfaces can include wired communication interfaces. The wired communications interfaces for the computing device133can also include Controller Area Network (CAN) interfaces, Media Oriented Systems Transport (MOST) interfaces, Local Interconnect Network (LIN) interfaces, Flexray® Automotive Communication interfaces, and other network communication interfaces and protocols. The computing devices130and133can retrieve and extract data from the accelerometer109. Additionally, the computing devices130and133can store data from the accelerometer109, process the data, and generate new data. In some embodiments, the computing devices130and133may supply power to the accelerometer109. Additionally, the computing device130can be located within the tire103while the computing device133can be located in the vehicle100as part of an independent vehicle computer system.", "", "Moving on toFIG.2, shown is a side view of the smart non-pneumatic tire103according to one embodiment of the present disclosure. The smart tire103includes a number of spokes203. The spokes203can be made out of various materials of varying stiffnesses. To this end, the spokes203can include smart material, such as piezoelectric material, shape memory materials, chromoactive materials, magnetorheological materials, photoactive materials, and other types of smart materials. Such smart materials have one or more properties that may be changed or controlled by external stimuli. The spokes203extend radially from the tire-center member118of the tire103to a tread212of the tire103.", "", "Also shown inFIG.2is the accelerometer109secured to one of the spokes203. As explained with respect toFIG.1, the accelerometer109can be positioned within the sector112near the vicinity of the tread212of the tire103that extends along the circular arc124. As the tire103rotates with an angular velocity ω, the tread212of the tire103extending along the circular arc124may contact the surface127for a short duration for each tire revolution. The accelerometer109can be configured to send tire-road contact acceleration data to the computing device(s)130and/or133continuously or over a duration of time while the tread212of the tire103extending along the circular arc124contacts the surface127. Accordingly, the duration of time can include multiple revolutions of the tire103, and the accelerometer109may only capture the tire-road contact acceleration data for a specific duration of time for each tire revolution. Therefore, the computing device(s)130and/or133may store the tire-road contact acceleration data over multiple tire revolution data sets over a duration of time.", "", "In addition, the computing devices130and133can be configured to receive velocity data for the tire103and normal load data for the tire103during movement. In various embodiments, the velocity data for the tire103may be extracted from the data measured by the accelerometer109. In some embodiments, the velocity may be measured by the computing device133, using alternate sensors like a global positioning system (GPS), or by a speedometer of the vehicle100. In this respect, the velocity data received by the computing devices130and133may be an instantaneous velocity of the vehicle100or the tire's angular velocity (rotational velocity) @.", "", "The normal load data can include data associated with the vertical load215of the motor vehicle100, acting on a center of the tire103. The vertical load215applied to the tire103may be dynamic or varying over time. The vertical load215may be measured by a load cell connected to the tire103or through other means such as using strain gages attached to the suspension system of the vehicle100as can be appreciated. The vertical load215may also be extracted from the data measured by the accelerometer109in some cases.", "", "The computing device130can be configured to process the tire-road contact acceleration data, the velocity data, and the load data to generate a mean vibration characteristic of the tire103. Alternatively, the computing device133can be configured to process the tire-road contact acceleration data, the velocity data, and the load data to generate a mean vibration characteristic of the tire103. In some cases, the computing devices130and133can operate together to process the data and generate the mean vibration characteristic of the tire103. The generated mean vibration characteristic is estimated at the center of the tire103during the movement of the vehicle100. Based on the generated mean vibration characteristic and/or driving conditions, the computing device(s)130and/or133can change the stiffness of the spokes in real-time.", "", "Referring toFIG.3, shown is a side view of a smart tire103A according to various embodiments of the present disclosure. The smart tire103A includes an additional accelerometer303that can be attached at or near the center of the tire103A, on the tire center member118. In some embodiments, the additional accelerometer303may be attached as close to the tire center as possible. Alternatively, the accelerometer303can be attached to a hub106of the vehicle100, on to which the tire103can be mounted, to measure the acceleration at the center of the tire103. Specifically, the accelerometer303can be configured to transmit tire-center acceleration data to the computing device(s)130and/or133(FIG.1).", "", "In one example, the accelerometer303may transmit the tire-center acceleration data over the same duration of time while the accelerometer109transmits the tire-road contact acceleration data. That is, the accelerometer303can be configured to transmit the tire-center acceleration data during specific periods of time the tread212that extends along an outer periphery of the circular arc124contacts the surface127. By implementing such a configuration, certain advantages may be achieved, such as reducing computer resources utilization (e.g., memory consumption, processor utilization, network transfer, etc.). In other embodiments, the accelerometer303may transmit tire-center acceleration data continuously.", "", "In order to accurately measure vertical acceleration (z-axis), longitudinal acceleration (x-axis), and lateral acceleration (y-axis), at the center of the tire103, the accelerometer303may be vertically aligned with the accelerometer109. Accordingly, the data that is retrieved from the accelerometer303during periods of time the tread212that extends along an outer periphery of the circular arc124contacts the surface127represents vertical vibrations, or roughness of the ride, transmitted from the contact patch160to the center of the tire103, or to the hub106of the vehicle100.", "", "According to various embodiments, the computing device(s)130and/or133can predict the mean vibration characteristic at the center of the tire103using the tire-road contact acceleration data, measured by the accelerometer109, to determine the mean vibration characteristic transmitted from the road surface to the hub106of the vehicle100. This predicted mean vibration characteristic can be compared with the tire-center acceleration data, measured by accelerometer303, to determine its accuracy. If it is determined that the predicted mean vibration characteristic is accurate, the computing devices130and/or133may adjust the stiffness of the spokes203in some cases to improve the ride comfort if deemed necessary. If not deemed accurate, the computing devices130and/or133may continue to process the tire-road contact acceleration data, the load data for the tire103A, and the velocity data for the tire103A, for more per-revolution data sets until an accurate mean vibration characteristic is predicted. However, in some embodiments, the computing devices130and/or133may adjust the stiffness of the spokes203based on the predicted mean vibration characteristic regardless of the comparison with the tire-center acceleration data.", "", "Apart from the accuracy of the predicted mean vibration characteristic, in some embodiments, the stiffness of the spokes203can be adjusted based on a manufacturer and/or user-defined ride comfort matrix. The predicted mean vibration characteristic can be compared against the defined ride comfort matrix and if the predicted mean vibration characteristic is higher than the maximum limit on this comfort matrix, the computing devices130and/or133can reduce the stiffness of the spokes203to dampen the vibrations. Alternatively, if the predicted mean vibration characteristic is lower than the minimum limit of the comfort matrix, the computing devices130and/or133can increase the stiffness of the spokes203.", "", "Also illustrated inFIG.3is a second sector306. Included in the sector306can be another accelerometer109A secured to one or more of the spokes203within the sector306, incorporating all of the features discussed for the accelerometer109. In this respect, the smart tire103A can include any number of accelerometers positioned in any number of sectors and in data communication with the computing devices130and133, in order to measure tire-road contact acceleration data. Therefore, the number of accelerometers or sectors in the smart tire103or103A is not a limiting factor according to the embodiments of this disclosure.", "", "The following paragraphs describe a test setup conducted using the smart-tires described herein according to various embodiments. The data collected for an experiment includes data from indoor tests performed on a rolling resistance test rig.FIGS.4-7illustrate data collected from various sensors of the test setup of the smart tires according to various embodiments described herein. The items used during the testing include non-pneumatic tires, a data acquisition system, and a test-rig, etc. A rolling resistance test system from Test Measurement System International (TMSI) was redesigned to allow for force and moment testing of passenger car tires. This remodeled test rig was used in the form of an indoor test rig for this application. The test rig had a rolling drum of 1.7 m diameter and 0.3 m face width. The rig was powered by a 60 HP D.C. motor. The rolling drum and motor setup had the capability to roll at up to 100 kph. The D.C. motor was also equipped with an optical rotary encoder which was calibrated to have a precise measurement of the rolling speed of the drum.", "", "The test rig had a P120 grit abrasive sanding cloth attached to the face of the drum. The cloth roll replicated an asphalt road surface. Multiple different grit sandpapers can be installed on the drum to allow for different friction surface availability. Apart from the capability of having multiple rolling speeds and friction surfaces, the rig also had the potential to add camber and slip to the tire tested. A load cell was also mounted on the rig to control the normal loading applied on the tires, both static and dynamic. The test rig was controlled via a computer system with proprietary software from TMSI installed on it. The software controls the speed of the test rig among other things. The specifications of this rig are stated in Table 2.1.", "", "TABLE 2.1Rolling Resistance Test Rig SpecificationsDrum Diameter1.7mDrum Face Width0.3mMax Speed100kphLoading MechanismLoad Cell coupled with aLinear Motor Driven BoltTire Sizes14″ to 18″Slip Angle Sweep+−15°Camber Angle Sweep+−10°Sanding SurfaceP120, P80", "", "The goal of the experiment was to understand the vibration characteristics transmitted through the non-pneumatic tires. The transmission of the vibrations being assessed was from the contact patch between these tires and the surface (in this case, the drum of the test rig), to the center of the non-pneumatic tires. The transmissibility is an effect of the spoke structure of the non-pneumatic tires. The transmissibility is affected by the design of the spoke structure and the stiffness of the materials used in the non-pneumatic tires. For the experiment, tests were conducted on two non-pneumatic tires with differences in the stiffness of the spoke materials. The basic design of the spoke structure was similar for both these tires. This difference in the stiffness of the spoke materials was assessed in the experiments.", "", "The rolling resistance test rig was equipped with two sensors, including a load cell to measure the normal loading applied on the tires and an encoder to evaluate the rolling speed of the drum. Apart from these two sensors, two accelerometers were installed on the non-pneumatic tires along with a slip ring based wired connection to the data acquisition system. A brief overview of these sensors is discussed below. Two Dytran® 3343A3 tri-axis accelerometers were installed on the non-pneumatic tires for the experiment. The accelerometers were chosen due to their small size and low weight. These accelerometers were installed on the spoke structure of the tires such that one of the accelerometers was near the tire-surface contact region and the other one was near the center of the tire. Both the accelerometers were installed at a laterally centered location using cyanoacrylate glue.", "", "The transmission of data from the accelerometers to the data acquisition system was through a wired setup involving a slip ring, a signal conditioner, and finally, a data acquisition device. The slip ring used for this application was a Michigan Scientific SR10A/PE512. A slip ring was used as it permits data transmission from a rotating body (the tires) to a stationary body (the data acquisition device) seamlessly. This slip ring was mounted onto the tires by an in-house adapter. These accelerometers required DC power for their usage. A signal conditioner (Dytran® Model 4116) was used in this setup to supply continuous regulated power to these accelerometers. This device ran on an A.C. line supply and had up to 16 connection channels.", "", "The test rig used in the experiments has the capabilities to measure the normal load applied onto the tires. The load was applied by the use of a linear actuation system driven by a DC motor. The linear actuator had a bolt head as its pushing agent, which applies load onto the frame, which holds the tires. A load cell, from Sentran® PH Series, was attached to this linear actuator. The load cell had a rated capacity of 7.5 k lbs. The purpose of the load cell was to measure the amount of normal force applied to the tires by the linear actuator. The load cell was calibrated to map the tire force at the tire center while the tire was rolling with the drum surface. The load cell outputs the normal force constantly and, thus, the test rig had the ability to display and control the dynamic load applied on the tires.", "", "The drum in the test rig was powered by a 60 HP DC motor. The motor actuated the rotary motion of the drum. The speed at which the drum was rotated was user-fed and was constant and controlled. Thus, a high-precision rotary optical encoder was mounted on the motor, which was calibrated to provide speed in “kph” units for the drum. The encoder, Model 725 by Accu-Coder, had a resolution of 1024 cycles per revolution making it very precise for this application.", "", "For such data-driven approaches, there is a need for a good system to record the data from the sensors. For this instrumentation, Data Acquisition Systems (DAQs) by National Instrument (NI) were used along with the data logging capabilities of the computer system which controls the test rig. The computer system had a software interface that displays and records data, such as the rolling speed from the encoder, the ambient air temperature, the date and time of the tests, and possibly other data. Apart from the data recorded by the computer system, the additional sensors' data from the accelerometers and the load cell were recorded through a NI 6212 DAQ. This data was logged at a 9600 Hz sampling rate to help assess the high-frequency spectral content of the signals.", "", "With the hardware setup in place, a thorough data bank was generated by varying the rolling speeds, applied normal load, and the use of two different airless tires. The test matrix for this experimentation is shown in Table 3.1.", "", "TABLE 3.1Test MatrixRolling Speeds30, 60km/hNormal Load250, 500lbsTires Used2 non-pneumatic tires", "", "The data bank generated comprised of data from the two accelerometers, at the contact patch and at the tire center, dynamic normal load, and velocity. Sample data for all these 4 sensors is shown inFIGS.4-7, which show data for multiple tire revolutions. This raw data collected using the hardware setup explain earlier needs of cleaning and pre-processing. The steps involved in such data-cleaning stages involve data chopping, outlier removal, and so on. These processes, followed by the signal processing techniques applied to these signals are elaborated in the subsections below.", "", "The raw tire data recorded included data from multiple different tire revolutions. For this analysis, the data per tire revolution was assessed to identify some relevant information which these signals may hold. For this assessment, the raw tire data was be chopped and separated into single tire revolution data sets. Thus, a data chopping algorithm was applied to this data set and the output of this algorithm is separated tire data. Further, some tire revolutions did not conform to how a standard signal should look like. These “outliers” were then cleared from the data set.", "", "In addition, the experiments used the information, which the tire sensor contained. This information can be accessed and processed by using either the time-domain representation or the frequency-domain spectral content of the data. The spectral content method was followed for one analysis, as it decomposes the time-varying signals into their frequency composition, although the time-domain representation can be relied upon. Welch's periodogram method was utilized for accessing the spectral domain information for the tire sensor data sets in one case.", "", "One goal of the experiment was to estimate the mean vibration content captured by the tire center accelerometer using the tire-road contact acceleration data from the tire-road contact patch. This approach provides an understanding of the ride roughness based on contact patch vibrations. In addition to this, spoke designs can be altered based on the tire-road contact acceleration data and the estimates of tire vibrations to ensure a smoother ride.", "", "During experimentation, the tire-road contact accelerometer data was compared for the two types of non-pneumatic tires. A distinction was observed between the data collected for the two tires with varying stiffness. The distinction held for both the contact patch and tire-center/spindle accelerometer data sets. Thus, certain signal features like maximum peak height, and contact patch length were observed to be sensitive to changes in tire stiffness. Based on conclusions from previous work, it was known that both the tire center data and the tire contact acceleration data were affected by dynamic loading and instantaneous velocity.", "", "Therefore, four features, including contact patch length, maximum peak height, dynamic loading, and velocity were selected as input features. The estimation target was the mean vibration characteristics for the tire center for one tire revolution. This vibration data at the tire center was accessed when the contact-patch accelerometer was in the vicinity of tire-ground contact. This location ensured that the z-axis of the tire-center accelerometer was aligned in the vertical direction when the contact-patch accelerometer was near contact. Thus, with these spatial limits, the mean tire center acceleration estimated using this approach represented vertical vibrations or the roughness of the ride.", "", "With this information, a machine learning environment was set up with four features as input, including the contact patch length, maximum peak height, dynamic loading, and velocity, and one output, the mean vertical vibration at the tire center. Bagged decision trees were chosen as the classical machine learning algorithm for solving the estimation problem. The algorithm used for this experiment was a combination of decision trees and bootstrapped aggregation (bagging).", "", "Decision trees are a simple if-else-based machine learning technique that breaks down the data set into logical regions. The decision trees start with a root node and, following the root node, an if-else question is asked, which divides the data set into two sections called leaf nodes. Successive if-else questions are asked and the entire data set is divided into such sections such that no further division is possible. This splitting of the region is stopped when the L2-norm error starts increasing on adding a split.", "", "A bootstrapped aggregation method has also been deployed on top of this decision trees model, thus transforming the method into a random forest algorithm. Bootstrapped aggregation includes picking random sub-samples of the data and training several regressors on these small batches of data. The random sub-samples chosen from the data set have the same statistical features as the parent data, thus exposing the regressors to data in different subsets having similar statistical attributes. The predictions of all these regressors were averaged and the final prediction was calculated. This process helped in reducing the variance of the output of machine learning. Hence, the bagging approach was chosen for this experiment, although other approaches can be relied upon according to the embodiments. The developed model was trained on 70% of the data with 15% reserved for five-fold cross-validation and 15% held back for test data. An R2of 0.86 was achieved, and a normalized mean absolute error of 18% was observed on the test data set. The results achieved with the approach were promising for a classical machine learning-based approach.", "", "For the assessment of the vibrational characteristics of the tires, a machine learning model was also developed for the experiment to estimate tire center vibrations of a non-pneumatic tire using the tire-road contact acceleration data. The developed machine learning algorithms use classical bagged trees for this estimation problem, and the input features were extracted from the time domain. In addition, frequency domain features may be looked at, and neural networks may be used as the machine learning techniques. This would enable covering maximum variance in the data set, thus increasing the R2and minimizing the error.", "", "In addition, a transfer function or a frequency response function can be generated with the tire-road contact acceleration data as the input and tire center acceleration data as the output of the transfer function. The transfer function or a frequency response function can help in the creation of new designs, given a particular spoke design and material stiffness. Based on different spoke designs and materials, different transfer functions can be obtained for the two sets of data. This transfer function or frequency response function can also serve as an industrial test bench to assess the damping characteristics of the non-pneumatic tires with different spoke structures and material stiffnesses, computationally bypassing the need to physically build and test the tire. The generated transfer functions can be employed in the utility of smart materials as spoke material, such that the materials can change their stiffness or the transfer function to get an apt response at the tire center to ensure a smoother ride.", "", "Referring now toFIG.8, shown is a schematic block diagram of the computing devices130and133. Each of the computing devices130and133includes at least one processor circuit, for example, having a processor800and a memory803, both of which are coupled to a local interface824. To this end, each of the computing devices130and133may comprise, for example, at least one computer, processing circuit, or like device. The local interface824may comprise, for example, a data bus with an accompanying address/control bus or other bus structure as can be appreciated, in either wired or wireless form.", "", "Stored in the memory803are both data and several components that are executable by the processor800. In particular, stored in the memory803and executable by the processor800are a control system806and potentially other applications. Also stored in the memory803are tire-road contact acceleration data809, load data812, velocity data815, which are gathered by the sensors described herein. Also stored in the memory803are a mean vibration characteristic818and tire center acceleration data821, with each of these being processed or otherwise generated by the control system806.", "", "Referring next toFIG.9, shown is a flowchart that provides one example of the operation of a portion of the control system806according to various embodiments. It is understood that the flowchart ofFIG.9provides merely an example of the many different types of functional arrangements that may be employed to implement the operation of the portion of the control system806as described herein. As an alternative, the flowchart ofFIG.9may be viewed as depicting an example of elements of a method implemented in the computing devices130and133(FIG.1) according to one or more embodiments.", "", "Beginning with box903, the computing devices130and133can be configured to receive the tire-road contact acceleration data809from the accelerometer109. In one example, receiving the tire-road contact acceleration data809includes extracting or retrieving the data809from the accelerometer109. As described with respect toFIGS.1-3, the accelerometer109can be secured to one or more of the spokes203(FIGS.2and3) within the sector112of the tires103or103A, and within close proximity of the tread212extending along the circular arc124of the tires103or103A (FIGS.1-3). This close placement to the tread212extending along the circular arc124enables the accelerometer109to measure the vibrations transmitted from the surface127(FIGS.1-3) to the contact patch160, and to the center of the tires103or103A.", "", "In various embodiments, the computing devices130and133may receive the tire-road contact acceleration data809for a predetermined duration of time or continuously while the motor vehicle100is being driven. Accordingly, the duration of time can include multiple revolutions of the tire103, and the accelerometer109may only capture the tire-road contact acceleration data during periods of time the tread212extending along the circular arc127of the tire103contacts the surface127as can be appreciated.", "", "In such a case where the accelerometer109is configured to only capture the tire-road contact acceleration data809during periods of time the tread212extending along the circular arc127of the tire103contacts the surface127, the accelerometer109may begin collecting the tire-road contact acceleration data809based on when the radii121enters the contact patch160region, and end collecting the tire-road contact acceleration data809when the radii121exits the contact patch160region of the tire103for one tire revolution. As the radii121enters the contact patch160region again during the next tire revolution, the accelerometer109can be configured to start collecting the tire-road contact acceleration data809again and end when the radii121exits the contact patch160region. This iterative step may be repeated for a predetermined duration of time or continuously until manually stopped. Accordingly, the tire-road contact acceleration data809includes data for multiple revolution data sets for the tires103and/or103A.", "", "In box906, the computing devices130and133can be configured to receive the velocity data815of the tires103and/or103A. The velocity data815can include an angular velocity ω of the tires103and/or103A received during movement of the vehicle100. In some embodiments, the velocity data815can also include a linear velocity of the vehicle100, such as instantaneous velocity as measured by a speedometer during movement of the vehicle100, or velocity data measured by sensors in the tires103or103A, or by using alternative sensors such as a GPS sensor.", "", "In box909, the computing devices130and133can be configured to receive the load data812from a load cell connected to the tires103and/or103A, strain gages connected to a suspension system of the vehicle100, sensors in the tire103or103A, or through other load measuring means as can be appreciated. In some cases, the load data812may be extracted from the data measured by the accelerometer109. The load data812includes vertical or normal load data of the motor vehicle100acting on the center of the tires103or103A while the vehicle100is being driven, such as the vertical load215. Accordingly, the normal or vertical load215may be dynamic. Collectively, the tire-road contact acceleration data809received at step903, the velocity data received at step906, and the normal load data received at step909can comprise dynamic tire data as described herein.", "", "In box912, the computing devices130and133can be configured to process the tire-road contact acceleration data809, the velocity data815, and the load data812. For example, at box912, the computing devices130and133can be configured to chop the dynamic tire data into a number of per-revolution data subsets to enable the control system806to identify relevant information in each per-revolution data subset for predicting the mean vibration characteristic818at the center of the tires103or103a. In that case, each per-revolution data subset among the plurality of per-revolution data subsets includes dynamic tire data for one revolution of the tires103or103A. The process at box912can also include removing outlier data from the per-revolution data subsets.", "", "In box915, the computing devices130and133can be configured to generate the mean vibration characteristic818at the center of the tires103or103A. In various embodiments, generating the mean vibration characteristic818includes predicting the mean vibration characteristic818. In processing the above-mentioned dynamic tire data to predict the mean vibration characteristic818, the control system806can use various data processing models and/or machine learning algorithms to efficiently predict the mean vibration characteristic818.", "", "For example, the above-mentioned data that the computing devices130and133receive can be accessed by using either the time-domain representation or the frequency-domain spectral content. In one embodiment, the frequency-domain spectral content can be used to decompose the time-varying signals into their frequency composition. Further, Welch's periodogram method can be used to access the spectral domain information, and the output of this analysis can be displayed as a power spectrum of individual tire revolutions in some cases.", "", "Predicting the mean vibration characteristic818can further involve applying a machine learning algorithm to the tire-road contact acceleration data809, the load data812, and the velocity data815. With the above-mentioned data selected as inputs to the machine learning algorithm, the output can return the mean vibration characteristic818for one or more tire revolutions. The machine learning algorithms can include use of a decision tree, bootstrapped aggregation, and/or a neural network. Thus, the predicted mean vibration characteristic818is dynamically affected by the tire-road contact acceleration data809, the load data812, and the velocity data815. In some embodiments, the above-mentioned data may be inputted into a vibration modeler, which can predict the mean vibration characteristic818.", "", "After box915, the control system806may go directly to box927in some cases to adjust a stiffness of the spokes203according to some embodiments. In one example, the predicted mean vibration characteristic818can be compared against a defined ride comfort matrix, and if the predicted mean vibration characteristic818is higher than the maximum limit on this comfort matrix, the computing devices130and/or133can reduce the stiffness of the spokes203to dampen the vibrations. Alternatively, if the predicted mean vibration characteristic818is lower than the minimum limit of the comfort matrix, the computing devices130and/or133can increase the stiffness of the spokes203.", "", "In this respect, the spokes203can include smart material that can adjust its properties in real time based on an external stimuli, such as magnetic fields, temperature, pressure, electrical impulses, and other external stimuli, based on the predicted mean vibration characteristic818. Accordingly, the spokes203can include piezoelectric material, shape memory materials, chromoactive materials, magnetorheological materials, photoactive materials, and other types of smart materials. Thereafter, the portion of the control system806may end.", "", "In other embodiments, after box915, the control system may move to box918. In box918, the control system806may generate a transfer function or a frequency response function based on the tire-road contact acceleration data809, the load data812, and the velocity data815as inputs and the mean vibration characteristic818as the output of the transfer function. Further transfer functions can be created based on a particular spoke design and material stiffness of the tires103and103A, in which the generated transfer function can be used for the selection of specific smart material to be used as the spoke203material.", "", "Moving on to boxes921and924, the control system806can verify the predicted mean vibration characteristic818for the tires103and103A based on the tire center acceleration data821measured by the accelerometer303(FIG.3). According to various embodiments, the accelerometer303can be configured to measure acceleration at the center of the tire103during periods the tread212that extends along an outer periphery of the circular arc124contacts the surface127. In this case, the accelerometer303can be configured to transmit data to the computing devices130and/or133synchronously with the accelerometer109. In some cases, the accelerometer303may transmit the tire-center acceleration data821to the computing devices130and/or133continuously.", "", "In order to accurately measure vertical acceleration (z-axis), longitudinal acceleration (x-axis), and lateral acceleration (y-axis) at the center of the tire103, the accelerometer303may be vertically aligned with the accelerometer109. Accordingly, the data that is retrieved from the accelerometer303during periods of time the tread212that extends along an outer periphery of the circular arc124contacts the surface127represents vertical vibrations, or roughness of the ride, transmitted from the contact patch160to the center of the tire103, or to the hub106of the vehicle100.", "", "The control system806can compare the predicted mean vibration characteristic818with the tire-center acceleration data821to determine the accuracy of the predicted mean vibration characteristic818. If it is determined that the predicted mean vibration characteristic818is accurate, the control system806may adjust the stiffness of the spokes203in some cases to improve the ride comfort if deemed necessary, as outlined for box927above. If not deemed accurate, the computing devices130and/or133may continue to process the tire-road contact acceleration data809, the load data812, and the velocity data815, for more per-revolution data sets until an accurate mean vibration characteristic818is predicted. However, in some embodiments, the computing devices130and/or133may adjust the stiffness of the spokes203based on the predicted mean vibration characteristic818regardless of the comparison with the tire-center acceleration data821. Thereafter, the portion of the control system806may end.", "", "It is understood that there may be other applications that are stored in the memory803and are executable by the processor800as can be appreciated. Where any component discussed herein is implemented in the form of software, any one of a number of programming languages may be employed such as, for example, C, C++, C#, Objective C, Java®, JavaScript®, Perl, PHP, Visual Basic®, Python®, Ruby, Flash®, or other programming languages.", "", "A number of software components are stored in the memory803and are executable by the processor800. In this respect, the term “executable” means a program file that is in a form that can ultimately be run by the processor800. Examples of executable programs may be, for example, a compiled program that can be translated into machine code in a format that can be loaded into a random access portion of the memory803and run by the processor800, source code that may be expressed in proper format such as object code that is capable of being loaded into a random access portion of the memory803and executed by the processor800, or source code that may be interpreted by another executable program to generate instructions in a random access portion of the memory803to be executed by the processor800, etc. An executable program may be stored in any portion or component of the memory803including, for example, random access memory (RAM), read-only memory (ROM), hard drive, solid-state drive, USB flash drive, memory card, optical disc such as compact disc (CD) or digital versatile disc (DVD), floppy disk, magnetic tape, or other memory components.", "", "The memory803is defined herein as including both volatile and nonvolatile memory and data storage components. Volatile components are those that do not retain data values upon loss of power. Nonvolatile components are those that retain data upon a loss of power. Thus, the memory803may comprise, for example, random access memory (RAM), read-only memory (ROM), hard disk drives, solid-state drives, USB flash drives, memory cards accessed via a memory card reader, floppy disks accessed via an associated floppy disk drive, optical discs accessed via an optical disc drive, magnetic tapes accessed via an appropriate tape drive, and/or other memory components, or a combination of any two or more of these memory components. In addition, the RAM may comprise, for example, static random access memory (SRAM), dynamic random access memory (DRAM), or magnetic random access memory (MRAM) and other such devices. The ROM may comprise, for example, a programmable read-only memory (PROM), an erasable programmable read-only memory (EPROM), an electrically erasable programmable read-only memory (EEPROM), or other like memory device.", "", "Also, the processor800may represent multiple processors800and/or multiple processor cores and the memory803may represent multiple memories803that operate in parallel processing circuits, respectively. In such a case, the local interface824may be an appropriate network that facilitates communication between any two of the multiple processors800, between any processor800and any of the memories803, or between any two of the memories803, etc.", "", "The flowchart ofFIG.9shows the functionality and operation of an implementation of portions of the control system806. If embodied in software, each block may represent a module, segment, or portion of code that comprises program instructions to implement the specified logical function(s). The program instructions may be embodied in the form of source code that comprises human-readable statements written in a programming language or machine code that comprises numerical instructions recognizable by a suitable execution system such as the processor800in a computer system or other system. The machine code may be converted from the source code, etc. If embodied in hardware, each block may represent a circuit or a number of interconnected circuits to implement the specified logical function(s).", "", "Although the flowchart ofFIG.9shows a specific order of execution, it is understood that the order of execution may differ from that which is depicted. For example, the order of execution of two or more blocks may be scrambled relative to the order shown. Also, two or more blocks shown in succession inFIG.9may be executed concurrently or with partial concurrence. Further, in some embodiments, one or more of the blocks shown inFIG.9may be skipped or omitted. In addition, any number of counters, state variables, warning semaphores, or messages might be added to the logical flow described herein, for purposes of enhanced utility, accounting, performance measurement, or providing troubleshooting aids, etc. It is understood that all such variations are within the scope of the present disclosure.", "", "Also, any logic or application described herein, including the control system806, that comprises software or code can be embodied in any non-transitory computer-readable medium for use by or in connection with an instruction execution system such as, for example, the processor800in a computer system or other system. In this sense, the logic may comprise, for example, statements including instructions and declarations that can be fetched from the computer-readable medium and executed by the instruction execution system. In the context of the present disclosure, a “computer-readable medium” can be any medium that can contain, store, or maintain the logic or application described herein for use by or in connection with the instruction execution system.", "", "The computer-readable medium can comprise any one of many physical media such as, for example, magnetic, optical, or semiconductor media. More specific examples of a suitable computer-readable medium would include, but are not limited to, magnetic tapes, magnetic floppy diskettes, magnetic hard drives, memory cards, solid-state drives, USB flash drives, or optical discs. Also, the computer-readable medium may be a random access memory (RAM) including, for example, static random access memory (SRAM) and dynamic random access memory (DRAM), or magnetic random access memory (MRAM). In addition, the computer-readable medium may be a read-only memory (ROM), a programmable read-only memory (PROM), an erasable programmable read-only memory (EPROM), an electrically erasable programmable read-only memory (EEPROM), or other type of memory device.", "", "Further, any logic or application described herein, including the control system806, may be implemented and structured in a variety of ways. For example, one or more applications described may be implemented as modules or components of a single application. Further, one or more applications described herein may be executed in shared or separate computing devices or a combination thereof. For example, a plurality of the applications described herein may execute in the same computing devices130and133or in multiple computing devices. Additionally, it is understood that terms such as “application,” “service,” “system,” “engine,” “module,” and so on may be interchangeable and are not intended to be limiting.", "", "Disjunctive language such as the phrase “at least one of X, Y, or Z,” unless specifically stated otherwise, is otherwise understood with the context as used in general to present that an item, term, etc., may be either X, Y, or Z, or any combination thereof (e.g., X, Y, and/or Z). Thus, such disjunctive language is not generally intended to, and should not, imply that certain embodiments require at least one of X, at least one of Y, or at least one of Z to each be present.", "", "It should be emphasized that the above-described embodiments of the present disclosure are merely possible examples of implementations set forth for a clear understanding of the principles of the disclosure. Many variations and modifications may be made to the above-described embodiment(s) without departing substantially from the spirit and principles of the disclosure. All such modifications and variations are intended to be included herein within the scope of this disclosure and protected by the following claims."], "claims": ["receiving, by a computing device, tire-road contact acceleration data from an accelerometer, the accelerometer being secured to a spoke of a non-pneumatic tire within a sector of the tire, wherein the tire-road contact acceleration data comprises acceleration data captured by the accelerometer over a duration of time while a tread extending along an outer periphery of the sector of the tire contacts a surface; receiving, by the computing device, velocity data for the tire over the duration of time; receiving, by the computing device, normal load data for the tire over the duration of time; and generating, by the computing device, a mean vibration characteristic for the tire based on the tire-road contact acceleration data, the velocity data, and the normal load data.", "2 . The method of claim 1 , further comprising generating a transfer function or a frequency response function for the tire based on the mean vibration characteristic for the tire.", "the normal load data, the velocity data, and the tire-road contact acceleration data comprise dynamic tire data; and the method further comprises chopping the dynamic tire data into a plurality of per-revolution data subsets, a per-revolution data subset among the plurality of per-revolution data subsets comprising dynamic tire data for one revolution of the tire.", "4 . The method of claim 3 , further comprising removing outlier data from the plurality of per-revolution data subsets.", "5 . The method of claim 4 , further comprising feeding the plurality of per-revolution data subsets into a vibration modeler for generating the mean vibration characteristic for the tire.", "6 . The method of claim 1 , wherein the tire comprises a second accelerometer secured within the tire at a location closer to a center of the tire than to the accelerometer, the second accelerometer being communicatively coupled to the computing device and configured to transmit tire-center acceleration data to the computing device over the duration of time while the tread extending along the outer periphery of the sector contacts the surface.", "7 . The method of claim 6 , further comprising comparing the mean vibration characteristic for the tire to the tire-center acceleration data.", "8 . The method of claim 1 , wherein generating the mean vibration characteristic for the tire comprises applying a machine learning algorithm to the tire-road contact acceleration data, the velocity data, and the normal load data.", "9 . The method of claim 8 , wherein the machine learning algorithm comprises a decision tree and bootstrapped aggregation.", "10 . The method of claim 8 , wherein the machine learning algorithm comprises a neural network.", "11 . The method of claim 1 , wherein generating the mean vibration characteristic for the tire comprises performing a frequency domain analysis on the tire-road contact acceleration data, the velocity data, and the normal load data.", "12 . The method of claim 1 , wherein the tire comprises a plurality of spokes, the plurality of spokes comprising smart material, the smart material configured to change in stiffness based on an external stimuli.", "13 . The method of claim 12 , wherein the smart material comprises piezoelectric material.", "14 . The method of claim 12 , wherein the method further comprises changing a stiffness of the plurality of spokes based on the mean vibration characteristic for the tire.", "15 . The method of claim 1 , wherein the sector comprises an area enclosed by a region of the tire defined between a contact patch angle having a vertex at a center of the tire, radii extending from the contact patch angle to a circular arc extending along the outer periphery of the tire between the radii, and the circular arc.", "16 . The method of claim 15 , wherein the accelerometer is secured to the spoke at a position closer to the circular arc than to the center of the tire.", "17 . The method of claim 15 , wherein the mean vibration characteristic for the tire comprises an average vibration characteristic estimated at the center of the tire, and the tire-road contact acceleration data comprises vibration characteristics measured while the tread along the outer periphery of the sector of the tire contacts the surface.", "an accelerometer, the accelerometer being secured to a spoke of the non-pneumatic tire within a sector of the tire; and a computing device communicatively coupled to the accelerometer, the computing device configured to: receive tire-road contact acceleration data from the accelerometer, wherein the tire-road contact acceleration data comprises acceleration data captured by the accelerometer over a duration of time while a tread extending along an outer periphery of the sector of the tire contacts a surface; receive velocity data for the tire over the duration of time; receive normal load data for the tire over the duration of time; and generate a mean vibration characteristic for the tire based on the tire-road contact acceleration data, the velocity data, and the normal load data.", "19 . The smart non-pneumatic tire of claim 18 , wherein the sector comprises an area enclosed by a region of the tire defined between a contact patch angle having a vertex at a center of the tire, radii extending from the contact patch angle to a circular arc extending along the outer periphery of the tire between the radii, and the circular arc.", "20 . The smart non-pneumatic tire of claim 18 , wherein the tire comprises a plurality of spokes, the plurality of spokes comprising smart material, the smart material configured to change in stiffness based on an external stimuli."], "bibtex": "@patent{20240286441,\n    title = {DATA DRIVEN SMART NON-PNEUMATIC TIRES},\n    number = {20240286441},\n    year = {2024},\n    note = {File: US20240286441A1-20240829.XML}\n    }", "classification": "B60C2306FI"}]