[{"title": "Disc Wheel for a Vehicle", "doc_number": "20240351368", "filename": "US20240351368A1-20241024.XML", "abstract": "An apparatus for a single-track motor vehicle includes a first wheel disc and a second wheel disc. The first wheel disc and the second wheel disc are configured on the wheel rim so as to be mutually spaced apart in a transverse direction parallel to the rotation axis (A) of the disc wheel, and extend from the wheel rim in the direction of the wheel hub. The wheel discs converge in the direction of the wheel hub and are connected to one another in such a manner that at least one cavity between the wheel discs and the wheel rim is formed. At least one cutout toward the at least one cavity is formed in a rim well of the wheel rim.", "detailed_description": ["The figures are schematic and by way of example. In the figures, the same reference signs denote identical functional and/or structural features.", "", "Illustrated inFIG.1is a sectional view of a disc wheel1for a single-track motor vehicle. The disc wheel1is integrally configured and comprises a wheel hub10for assembling the disc wheel1on the vehicle, which wheel hub10is disposed concentrically with a rotation axis A of the disc wheel1, a wheel rim30which is likewise concentric with the rotation axis A, and a first and a second wheel disc21,22. The first wheel disc21and the second wheel disc22are configured on the wheel rim30so as to be mutually spaced apart in a transverse direction parallel to the rotation axis A of the disc wheel1, and extend in each case from the wheel rim30in the direction of the wheel hub10. Moreover, the wheel discs21,22converge in the direction of the wheel hub10and are connected to one another in such a manner that a cavity4between the wheel discs21,22and the wheel rim30is formed. Furthermore, the at least one cavity4between the two wheel discs21,22and the rim well31are configured so as to be V-shaped in a cross section.", "", "Furthermore, at least one cutout32toward the at least one cavity4is formed in a rim well31of the wheel rim30, as a result of which the cavity4is able to be fluidically connected to a tire which is able to be fitted to the wheel rim, or to the interior of the tire, so that the internal pressure of the tire is prevalent in the cavity. The respective cutout32is configured so as to be centric in the transverse direction in the rim well31.", "", "Moreover, the wheel rim30has two mutually separate rim segments33,34which, in terms of a symmetry plane of the disc wheel1that is orthogonal to the rotation axis A, are laterally inversed. Furthermore, the rim segments33,34, while forming the at least one cavity4, are connected to one another by the wheel discs21,22and the rim well31. The respective rim segment31,32has in each case one rim shoulder35, and the rim shoulders35are connected to one another by the rim well31.", "", "Three reinforcement ribs5are formed in the cavity4of the disc wheel1, wherein only one of the reinforcement ribs is illustrated inFIG.1. The reinforcement ribs5extend from the first wheel disc21to the second wheel disc22and connect those, and the rim well31, to one another. Moreover, the reinforcement ribs5are disposed so as to be uniformly distributed about the rotation axis A of the disc wheel1. A cavity4is in each case formed between two adjacent reinforcement ribs5, and the respective reinforcement rib5comprises in each case one rib cutout51, as a result of which the adjacent cavities4are fluidically connected directly to one another.", "", "The reinforcement rib5illustrated inFIG.1forms a rib cavity52which is open toward the wheel rim30. A tire pressure sensor is disposed in the rib cavity52, and an opening53which leads to the rib cavity52and in which a valve is received is provided in the first wheel disc21.", "", "FIG.2shows a view from above of the disc wheel1for a single-track motor vehicle. Since this here is the disc wheel1illustrated inFIG.1, only features will be discussed hereunder which are not shown inFIG.1.", "", "Accordingly, it can be seen inFIG.2that a multiplicity of cutouts32are formed in the rim well31of the wheel rim30. The multiplicity of cutouts32are disposed so as to be uniformly spaced apart from one another in a circumferential direction of the rim well31. Moreover, the respective cutout32is configured as a slot.", "", "Illustrated inFIG.3is a perspective view of the disc wheel1illustrated inFIGS.1and2. Accordingly, likewise only features are discussed which are not shown in the previousFIGS.1and2.", "", "The first and the second wheel disc21,22herein extend from the wheel rim30to the wheel hub10approximately along a quarter of the distance in a radial direction between the wheel rim30and the wheel hub10. Moreover, the disc wheel1comprises five spokes60which extend in each case from the first wheel disc21and the second wheel disc22to the wheel hub10and connect those to one another. Furthermore, the spokes60are disposed so as to be uniformly distributed about the rotation axis A of the disc wheel1.", "", "The disclosure in terms of its embodiment is not limited to the preferred exemplary embodiments stated above. Rather, a number of variants which utilize the illustrated solution even in embodiments of a fundamentally different type are conceivable."], "claims": ["1 .- 14 . (canceled)", "a disc wheel, wherein single-track motor vehicle includes a wheel hub configured to assemble the disc wheel on the vehicle, the wheel hub being disposed concentrically with a rotation axis (A) of the disc wheel, a wheel rim which is likewise concentric with the rotation axis (A), and a first and a second wheel disc, wherein the first wheel disc and the second wheel disc are configured on the wheel rim so as to be mutually spaced apart in a transverse direction parallel to the rotation axis (A) of the disc wheel, and extend from the wheel rim in the direction of the wheel hub, the wheel discs converge in the direction of the wheel hub and are connected to one another in such a manner that at least one cavity between the wheel discs and the wheel rim is formed, and at least one cutout toward the at least one cavity is formed in a rim well of the wheel rim.", "16 . The apparatus according to claim 15 , wherein a multiplicity of cutouts are formed in the rim well of the wheel rim.", "17 . The apparatus according to claim 16 , wherein the multiplicity of cutouts are disposed so as to be uniformly spaced apart from one another in a circumferential direction of the rim well.", "18 . The apparatus according to claim 17 , wherein the respective cutout is configured so as to be centric in the transverse direction in the rim well.", "19 . The apparatus according to claim 18 , wherein the at least one cavity between the two-wheel discs and/or the rim well are/is configured so as to be V-shaped or U-shaped in a cross section.", "20 . The apparatus according to claim 19 , wherein the wheel rim has two mutually separate rim segments which, in terms of a symmetry plane of the disc wheel that is orthogonal to the rotation axis (A), are laterally inversed, and wherein the rim segments, while forming the at least one cavity, are connected to one another by the wheel discs and the rim well.", "21 . The apparatus according to claim 20 , wherein the respective rim segment has one rim shoulder, wherein the rim shoulders are connected to one another by the rim well.", "22 . The apparatus according to claim 21 , wherein the at least one cutout is configured as a slot, square, rectangular or circular.", "23 . The apparatus according to claim 22 , wherein the first and the second wheel disc extend from the wheel rim to the wheel hub along at least a quarter of the distance in a radial direction between the wheel rim and the wheel hub.", "24 . The apparatus according to claim 23 , wherein at least two reinforcement ribs, which extend from the first wheel disc to the second wheel disc and connect those, and in particular the rim well, to one another, are formed in the cavity, and wherein the reinforcement ribs are disposed so as to be uniformly distributed about the rotation axis (A) of the disc wheel.", "25 . The apparatus according to claim 24 , wherein a cavity is formed between two respective adjacent reinforcement ribs of the at least two reinforcement ribs, wherein a rib cutout is formed in the respective reinforcement rib.", "26 . The apparatus according to claim 25 , wherein at least one reinforcement rib forms a rib cavity which is open toward the wheel rim, wherein a tire pressure sensor, is disposed in the rib cavity, and/or an opening which leads to the rib cavity of the reinforcement rib and in which a further sensor and/or a valve is received is provided in one of the two wheel discs.", "27 . The apparatus according to claim 26 , further comprising: at least two spokes which extend from the first wheel disc and the second wheel disc to the wheel hub and connect those to one another, wherein the spokes are disposed so as to be uniformly distributed about the rotation axis (A) of the disc wheel.", "28 . The apparatus according to 27 , wherein the disc wheel is integrally configured."], "bibtex": "@patent{20240351368,\n    title = {Disc Wheel for a Vehicle},\n    number = {20240351368},\n    year = {2024},\n    note = {File: US20240351368A1-20241024.XML}\n    }", "classification": "B60B308FI"}, {"title": "MECANUM WHEEL WITH EASILY REPLACEABLE ROLLERS", "doc_number": "20240351369", "filename": "US20240351369A1-20241024.XML", "abstract": "The invention describes a mecanum wheel comprising a plurality of rollers each with a rolling surface and an axel and a wheel frame for mounting the rollers with mounting units holding respective axel ends of each roller. Each mounting unit comprise a mounting unit recess with an opening, wherein the mounting unit recess interacts with the respective axel end for locking the roller against movements in directions having a component radially inwards. Each mounting unit further comprise a rebounding roller retaining structure positioned at least partly inside an insertion path causing resistance when the axel end is pushed or pulled past the roller retaining structure into, and out from, a resting position in the mounting unit recess, thus preventing unintended release in a radial outward directed component.", "detailed_description": ["In this text the important directions are radially outward and radially inward of the mecanum wheel. The peripheral wheel plane is in this text a cylindrical plane along the outer rim of the mecanum wheel with the central axis coinciding with the axis of the mecanum wheel. When describing a roller and associated mounting unit up and down and vertical and horizontal are as seen inFIG.3and inner side of the mounting unit is toward the center of the roller and outer side is towards the rim of the mecanum wheel as indicated inFIG.4.", "", "The invention is primarily directed towards mecanum wheels but can also conceivably be used in omnidirectional wheels. A mecanum wheel according to prior art is shown inFIG.1a. A rolling surface4of a roller2must be positioned in the peripheral wheel plane of the wheel. This is always true in a mecanum wheel. The rolling surface4of the roller2is the surface that rolls on the ground or floor.", "", "FIG.1bshows a rolling device30for movement along a surface comprising a mecanum wheel1according to the invention. Several rolling devices can be linked together. Each rolling device30comprises in some embodiments driving means, communication means, and sensors for autonomous operation when controlled by a central controller unit.", "", "The rolling device30may comprise a control unit for controlling the rolling device. The control unit can receive control signals for operation of the first and/or second drive motor from a remote control, computer, cell phone or by voice-activation. It is also possible that the control unit comprises software for autonomous control of the rolling device.", "", "The rolling device30may comprise or be arranged in a housing31. The housing may be arranged to enclose some of, all or most of the parts of the rolling device, such as wheel axle, the wheel, the motor and possibly means for extending and retracting the wheel. The rolling device may be arranged in the housing31in such a way that in the extended position at least a portion of the wheel1projects outside the housing31.", "", "The mecanum wheel1according to the invention comprises a plurality of rollers2. Each roller has an axel3with axel ends7protruding from a rolling surface4in an axial direction as seen inFIGS.2and4. The axel ends7protrudes from the rolling surfaces in an axial direction to enable interaction with the mounting unit recess8. The axel ends comprise an end surface23largely perpendicular to the axel and an axial stopper surface18largely perpendicular to the axel3as seen inFIGS.2and4. The rollers are mounted on a wheel frame5by mounting units12, which are arranged with one pair of mounting units12for each roller.", "", "A mounting unit12comprises a mounting unit recess8with an opening for receiving the axel end7. The mounting unit recess8is mating with respective axel ends7on the end of each side of the axel3for structurally locking the roller2at least for movements in directions having a component radially inwards of the mecanum wheel1.", "", "The mounting unit further comprise a mounting unit stopper surface19largely perpendicular to the axel3interacting with the axial stopper surface18for locking the roller2against movements relative to the wheel frame5in directions along the axis of the roller2. Examples of stopper surfaces18,19are shown inFIGS.2,4and6. The directions of the mentioned movements are indicated inFIG.8.", "", "As can be seen inFIGS.2,3and4, the mounting unit12further comprise a rebounding roller retaining structure6preventing unintended release of the roller2in directions not being locked by the respective mounting unit recesses8interacting with the respective axel ends7of the axel3. A roller is held in position on the mecanum wheel by two mounting units.", "", "In another embodiment shown inFIG.5the roller is held in position by one mounting unit and one axially directed slot16into which one of the axel ends7can be inserted in a largely axial movement, before the other axel end7is inserted into the mounting unit recess8on the mounting unit12on the opposite side of the slot16.", "", "Preferably, it is possible to insert and remove the roller2without any other action being necessary like e.g. pushing or pulling a grip, button or handle. This is most easily achieved by a rebounding roller retaining structure6at least partly positioned inside the mounting unit recess8or opening14. This is equivalent to the roller retaining structure being positioned in an insertion path28of the respective axial ends7. Embodiments of an insertion path28is indicated by dotted lines shown inFIGS.7aandb. The insertion path is the path the respective axel ends7follows when inserted into the respective recesses8and comprises the recess itself and the opening14.", "", "The purpose of the rebounding roller retaining structure6is to provide a resistance when forces are pushing/pulling the roller in or out of the mounting unit recesses8. The rebounding roller retaining structure6can obtain its rebounding characteristics by a deflective arm, a flexible material or a structure pretensioned by a spring. The force needed to counteract the pretensioning of the pretensioned structure, compressing the flexible material or bending the deflective arm combined with frictional forces will provide the resistance needed to hold the roller2in position.", "", "In one embodiment shown inFIG.6the rebounding roller retaining structure is a ball26pretensioned by a spring27and mating with a hollow structure29in the end surface23of the axel.", "", "By ‘structurally locked’ against movements we mean that it is the structure and properties of the material that prevents movements. The roller may have an axel3that is fixed to the rolling surface4or may have an axel that is rotating relative to the rolling surface4. Bearings10can be mounted between the axel and the rolling surface4or between the axel3and the mounting unit. Low friction material and/or lubrication can be used instead of bearings.", "", "In an embodiment, shown inFIG.2, the rebounding roller retaining structure6comprises a narrow neck9by the opening14of the mounting unit recess8, which in this embodiment is a U-shape structure17. The narrow neck9is made from a resilient material adapted to receive the axel end7of a roller2allowing the axel to be pushed past the neck9and rest in the bottom of the U-shape structure17.", "", "An embodiment of the rebounding roller retaining structure6is shown inFIGS.3and4.FIG.3shows a mounting unit recess8for receiving an axel end7of a roller2. Close to the mounting unit recess8is a deflective arm15attached to the mounting unit12, appearing to be in front of the mounting unit recess8inFIG.3. The deflective arm15ofFIG.3deflects in an axial direction and is provided with a holding structure13which interacts with a reciprocal holding structure11on the axel end7. In one embodiment the deflective arm15is provided with a finger grip20to ease manual release of the roller4. Arrows inFIG.4indicate possible directions to push for releasing the roller.", "", "In an embodiment shown inFIGS.2and7a, the axial stopper surface18is a flange25on the inner side of the axel end7stopping against a largely vertical inner rim22peripheral to the recess8(FIG.2) or slot16(FIG.5).", "", "In an embodiment shown inFIG.6, the axial stopper surface18is a largely vertical end surface23of the axel end7stopping against a vertical stopper surface24on the outer side of the recess8constituting the mounting unit stopper surface19on the mounting unit12. The mentioned surfaces are largely perpendicular to the axis of the roller.", "", "In the embodiments seen inFIGS.2and4the removal of the roller2can be done symmetrically with both axial ends moving in parallel and with no action needed except from applying a force on the roller in a radial direction outward. The roller may then be removed by a robotic arm clutching a gripping zone21on each axial end as indicated inFIG.4. In the embodiment shown inFIG.2the gripping zone21is positioned on the end surfaces23of the axel ends7and robotic arms may clutch the gripping zone21in an axial movement. For better grip, a gripping structure may be provided in the gripping zone21."], "claims": ["a plurality of rollers each with a rolling surface and an axel with axel ends protruding from each side of the rolling surface in the longitudinal direction of the roller and having an axial stopper surface largely perpendicular to the axel, a wheel frame for mounting the rollers with mounting units, arranged for holding respective axel ends of each roller, wherein each mounting unit comprising: a mounting unit recess with an opening for inserting an axel end, wherein the mounting unit recess interacts with the respective axel end for structurally locking the roller against movements relative to the wheel frame in directions having a component radially inwards of the mecanum wheel, a mounting unit stopper surface largely perpendicular to the axel interacting with the axial stopper surface for locking the roller against movements relative to the wheel frame in directions along the axis of the roller, a rebounding roller retaining structure positioned at least partly inside an insertion path of the respective axel end causing resistance when the axel end is pushed or pulled past the roller retaining structure into, and out from, a resting position in the mounting unit recess, thus preventing unintended release of the roller caused by forces having a component directed radially outward of the mecanum wheel.", "2 . Mecanum wheel according to claim 1 , wherein the axel is fixed to the rolling surface of the roller.", "3 . Mecanum wheel according to claim 1 , wherein the rollers have an axel around which the rolling surface is rotating.", "4 . Mecanum wheel according to claim 1 , wherein the rebounding roller retaining structure comprise a holding structure mounted on a deflective arm fixed to the mounting unit mating with a reciprocal holding structure on the end surface of the corresponding axel end.", "5 . Mecanum wheel according to claim 1 , wherein the rebounding roller retaining structure is a narrow neck positioned partly inside the opening of the recess to receive the axel end of a roller allowing the axel end to be pushed past the narrow neck and rest in the bottom of the recess.", "6 . Mecanum Wheel according to claim 5 , wherein the narrow neck comprises a resilient material.", "7 . Mecanum wheel according to claim 1 , wherein the rebounding roller retaining structure is a ball positioned on an outer side of the recess and being pretensioned by a spring, wherein the ball mates with a hollow structure on the end surface of the axel end.", "8 . Mecanum wheel according to claim 1 , wherein the mounting unit recess is a U-shape structure for receiving the axel end.", "9 . Mecanum wheel according to claim 4 , wherein both axel ends of each roller comprises a gripping zone for robotic removal of the roller from the roller mounting units.", "10 . Mecanum wheel according to claim 4 , wherein the deflective arm is provided with a finger grip to ease manual release of the roller.", "11 . Mecanum wheel according to claim 5 , wherein the end surface of both axel ends of each roller comprises a gripping zone for robotic removal of the roller from the roller mounting units.", "12 . Mecanum wheel according to claim 1 , wherein the axial stopper surface 18 is the outward facing largely vertical end surface of the axial end interacting with an inward facing vertical stopper surface on an outer side of the recess constituting the mounting unit stopper surface.", "13 . Mecanum wheel according to claim 1 , wherein the axial stopper surface is a flange at the outward facing inner side of the axial end interacting with an inward facing vertical inner rim of the recess constituting the mounting unit stopper surface.", "a housing arranged for attachment to the device, a mecanum wheel according to driving means."], "bibtex": "@patent{20240351369,\n    title = {MECANUM WHEEL WITH EASILY REPLACEABLE ROLLERS},\n    number = {20240351369},\n    year = {2024},\n    note = {File: US20240351369A1-20241024.XML}\n    }", "classification": "B60B1900FI"}, {"title": "MOBILE ROBOTS WITH SHAPE-CHANGING TENSEGRITY STRUCTURES", "doc_number": "20240351370", "filename": "US20240351370A1-20241024.XML", "abstract": "Aspects of the present disclosure include a robotic wheel that includes a tensegrity structure, an inner hub, an outer hub, and a cable. The tensegrity structure includes multiple rigid rods and multiple elastic cables, and the tensegrity structure defines a longitudinal axis, a first end and a second end. The inner hub is disposed at the first end of the tensegrity structure and the outer hub is disposed at the second end of the tensegrity structure. The cable is in contact with the outer hub, extends through the tensegrity structure parallel to the longitudinal axis, and extends through the inner hub. The cable is operable to retract to transition the tensegrity structure to a collapsed state and to extend to transition the tensegrity structure an expanded state.", "detailed_description": ["Disclosed herein are robots that include tensegrity structures. Section I of the present disclosure relates to embodiments of robots that include tensegrity structures as wheels. Section II of the present disclosure relates to embodiments of robots that include one or more tensegrity structures in a robotic arm."], "claims": ["a tensegrity structure defining a longitudinal axis, the tensegrity structure including: a plurality of rigid rods; and a plurality of elastic cables; an inner hub disposed at a first end of the tensegrity structure; an outer hub disposed at a second end of the tensegrity structure; and a cable contacting the outer hub, extending through the tensegrity structure parallel to the longitudinal axis of the tensegrity structure, and extending through the inner hub, the cable operable to retract to transition the tensegrity structure to a collapsed state and to extend to transition the tensegrity structure an expanded state.", "2 . The robotic wheel of claim 1 , wherein the cable extends through the tensegrity structure coincident to the longitudinal axis of the tensegrity structure.", "3 . The robotic wheel of claim 1 , further comprising a hollow shaft coupled to the inner hub, the hollow shaft coincident to the longitudinal axis of the tensegrity structure.", "4 . The robotic wheel of claim 1 , wherein a plane defined by the outer hub is substantially perpendicular to the longitudinal axis of the tensegrity structure when the tensegrity structure is in the expanded state, the collapsed state, and transitioning between the expanded state and the collapsed state.", "5 . The robotic wheel of claim 1 , wherein a plane defined by the inner hub is substantially parallel to a plane defined by the outer hub when the tensegrity structure is in the expanded state, the collapsed state, and transitioning between the expanded state and the collapsed state.", "6 . The robotic wheel of claim 1 , wherein the outer hub is coupled to outer ends of at least a portion of the plurality of rigid rods via compliant connectors.", "7 . The robotic wheel of claim 1 , wherein each opposing end of each of the plurality of rigid rods includes an endcap configured to increase friction between the tensegrity structure and a surface supporting the tensegrity structure.", "8 . The robotic wheel of claim 1 , wherein the tensegrity structure defines a width, wherein the width of the tensegrity structure is greater in the expanded state than in the collapsed state.", "9 . The robotic wheel of claim 1 , wherein the tensegrity structure defines a height, wherein the height of the tensegrity structure is greater in the collapsed state than in the expanded state.", "10 . The robotic wheel of claim 1 , wherein the tensegrity structure includes six rigid rods and twenty-four elastic cables, the six rigid rods and the twenty-four elastic cables arranged in a 6-bar icosahedron tensegrity structure.", "a body; a first tensegrity wheel coupled to a first shaft extending outward from a first side of the body, the first tensegrity wheel operable to rotate about a first longitudinal axis; and a second tensegrity wheel coupled to a second shaft extending outward from a second side of the body, the second tensegrity wheel operable to rotate about a second longitudinal axis.", "a third tensegrity wheel coupled to a third shaft extending outward from the first side of the body, the third tensegrity wheel operable to rotate about a third longitudinal axis; and a fourth tensegrity wheel coupled to a fourth shaft extending outward from the second side of the body, the fourth tensegrity wheel operable to rotate about a fourth longitudinal axis.", "13 . The robot of claim 11 , wherein the first tensegrity wheel is operable to transition between an expanded state and a collapsed state along the first longitudinal axis, wherein the second tensegrity wheel is operable to transition between an expanded state and a collapsed state along the second longitudinal axis.", "14 . The robot of claim 13 , wherein the robot defines a width, wherein when each of the first tensegrity wheel and the second tensegrity wheel are in the expanded state the width of the robot is greater than when each of the first tensegrity wheel and the second tensegrity wheel are in the collapsed state.", "15 . The robot of claim 13 , wherein the robot defines a clearance height, wherein when each of the first tensegrity wheel and the second tensegrity wheel are in the collapsed state the clearance height of the robot is greater than when each of the first tensegrity wheel and the second tensegrity wheel are in the expanded state.", "16 . The robot of claim 11 , further comprising a jumping mechanism coupled to the body, the jumping mechanism configured actuate to cause the robot to separate from a surface supporting the robot.", "17 . The robot of claim 16 , wherein the jumping mechanism comprises a bistable mechanism.", "18 . The robot of claim 11 , further comprising a tail extending from a back side of the body.", "19 . The robot of claim 11 , further comprising a first plurality of paddles couplable to the first tensegrity wheel and a second plurality of paddles couplable to the second tensegrity wheel.", "20 . The robot of claim 11 , further comprising an unmanned aerial vehicle coupled to the body.", "a first base including a first end effector; a second base including a second end effector; one or more tensegrity structures disposed in series between the first base and the second base, the one or more tensegrity structures defining a longitudinal axis; and a plurality of cables extending between the first base and the second base, each of the plurality of cables configured to retract towards or extend from the first base, each of the plurality of cables being substantially parallel to the longitudinal axis when the longitudinal axis is substantially linear.", "22 . The robotic arm of claim 21 , further comprising a cable guide extending radially outward from an interface between a first tensegrity structure and a second tensegrity structure, the cable guide including a plurality of apertures corresponding to the plurality of cables, wherein the first tensegrity structure and the second tensegrity structure are included in the one or more tensegrity structures.", "23 . The robotic arm of claim 21 , wherein each of the plurality of cables are equally spaced along a circumference defined radially outward from the longitudinal axis.", "24 . The robotic arm of claim 21 , wherein the plurality of cables includes a first cable, a second cable, and a third cable.", "25 . The robotic arm of claim 24 , further comprising a first motor, a second motor, and a third motor each enclosed withing a housing of the first base, the first motor configured to retract or extend the first cable, the second motor configured to retract or extend the second cable, and the third motor configured to retract or extend the third cable.", "26 . The robotic arm of claim 21 , wherein the robotic arm expands or contracts along the longitudinal axis when each of the plurality of cables are extended or retracted at a same rate.", "27 . The robotic arm of claim 21 , wherein the longitudinal axis transitions between a straight configuration and a bent configuration when at least two cables of the plurality of cables are extended or retracted at a different rate.", "28 . The robotic arm of claim 21 , wherein each of the plurality of cables defines a length between the first base and the second base, wherein the longitudinal axis is substantially linear when the length of each of the plurality of cables are substantially equal.", "29 . The robotic arm of claim 21 , wherein each of the plurality of cables defines a length between the first base and the second base, wherein the longitudinal axis is substantially non-linear when the length a first cable is different than a second cable, wherein the first cable and second cable are included in the plurality of cables.", "30 . The robotic arm of claim 21 , wherein the first end effector includes a first robotic claw extending outward from the first base, wherein the second end effector includes a second robotic claw extending outward from the second base, each of the first robotic claw and the second robotic claw operable to transition between an open position and a closed position."], "bibtex": "@patent{20240351370,\n    title = {MOBILE ROBOTS WITH SHAPE-CHANGING TENSEGRITY STRUCTURES},\n    number = {20240351370},\n    year = {2024},\n    note = {File: US20240351370A1-20241024.XML}\n    }", "classification": "B60B1904FI"}, {"title": "WHEEL UNIT FOR A PEDELEC AND PEDELEC", "doc_number": "20240351371", "filename": "US20240351371A1-20241024.XML", "abstract": "A wheel unit for a pedelec includes a hub and a rim connected via spokes which rotate about a rotational axis, a brake disc non-rotatably connected to the hub via a fastening device, and a sensor ring. The fastening device includes a mounting element non-rotatably arranged on the hub, and a clamping nut fastenable to the hub or to the mounting element via a screw connection. The brake disc is interlockingly connected to the mounting element in a direction of rotation. The brake disc is clampingly attached via the clamping nut in the direction of the rotational axis between the hub or the mounting element and the clamping nut. The sensor ring is connected rotationally fixed to the hub and is fixed to the clamping nut. The sensor ring is fastenable together with the clamping nut to the hub or to the mounting element via the screw connection.", "detailed_description": ["The wheel unit comprises a hub and a rim, the hub and the rim being connected to each other by a plurality of radially extending spokes. The hub is mounted on a section of the frame of a pedelec so that it can rotate about a rotational axis, thereby enabling movement of the pedelec and a rolling of the wheel unit on a road surface.", "", "In order to provide for a safe riding operation of the pedelec, the pedelec comprises a brake. The brake comprises a brake disc provided on the wheel unit, which in turn interacts with a brake caliper attached to the frame. The wheel unit comprises a fastening device for attaching the brake disc to the hub so that a brake disc cannot rotate. The fastening device comprises a mounting element arranged on the hub in a non-rotatable manner, onto which the disc brake can be attached, wherein the mounting element can also be configured in one piece with the hub. The mounting element comprises an element and the brake disc comprises a counter element for the interlocking connection between the mounting element and the brake disc, via which the brake disc is connected to the mounting element in a torque-transmitting manner in the direction of rotation in a mounted state. The fastening device further comprises a clamping nut which can be attached to the hub or to the mounting element via a screw connection, wherein the brake disc is clamped by the clamping nut in the direction of the rotational axis between the hub and the clamping nut. The clamping nut and the mounting element each comprise a radial projection, wherein the brake disc is in contact with the radial projection of the mounting element in the direction of the rotational axis of the hub when mounted on the mounting element. In a final assembled state of the clamping nut, i.e., in a screwed-in state of the clamping nut, the brake disc is in contact with the radial projection of the clamping nut with a side facing away from the radial projection of the mounting element, wherein the clamping nut is screwed in until the brake disc is clamped between the two radial projections in the direction of the rotational axis.", "", "The wheel unit has a sensor ring comprising a scanning area to determine the travelling speed of the pedelec. The scanning area is scanned by a speed sensor which is arranged on the frame, and the travelling speed is determined therefrom.", "", "According to the present invention, the sensor ring is directly fixed to the clamping nut, wherein the sensor ring is attached together with the clamping nut to the hub or to the mounting element via the screwed connection of the clamping nut. The sensor ring can be attached to the clamping nut in a pre-assembly process and automatically attached to the hub during the brake disc assembly process. This can simplify the assembly process of the pedelec.", "", "The fact that the sensor ring is attached to the clamping nut means that the sensor ring can be attached to the hub in a simple and reliable manner, wherein the attachment of the sensor ring does not negatively affect the attachment of the brake disc.", "", "In an embodiment of the present invention, the sensor ring can, for example, be screwed to the clamping nut. The sensor ring comprises a circular ring-shaped section on which the scanning area is provided. Starting from the circular ring-shaped section, several fastening sections extend radially inwards, wherein the fastening sections are screwed to the clamping nut at their free ends. The screw connection of the sensor ring provides that the sensor ring is detachably attached to the clamping nut, which means that the sensor ring can be easily replaced if it is damaged or bent, for example, by a stone or other object hitting the sensor ring.", "", "The sensor ring can, for example, be attached to the clamping nut via a press connection, wherein the sensor ring comprises at least one recess which forms a press connection with a protrusion provided on the clamping nut. The sensor ring comprises a circular ring-shaped section on which the scanning area is provided. Starting from the circular ring-shaped section, several fastening sections extend radially inwards, wherein a recess is formed on each of the fastening sections. The sensor ring and the clamping nut are manufactured separately from each other in separate manufacturing steps and then pressed together. The press connection is a connection that is reliable against loosening so that the sensor ring can be reliably attached to the clamping nut.", "", "In an embodiment of the present invention, the sensor ring can, for example, be configured in one piece with the clamping nut, which can reduce the assembly effort of the wheel unit.", "", "The brake disc can, for example, comprise an internal toothing and the mounting element can, for example, comprise an external toothing that corresponds to the internal toothing. This allows the brake disc to be reliably attached to the mounting element in the direction of rotation, wherein the toothing provides a relatively high torque transmission surface.", "", "In an embodiment of the present invention, the clamping nut can, for example, comprise an anti-loss toothing on a side facing the mounting element, and the brake disc can, for example, comprise an anti-loss toothing on a side facing the clamping nut, wherein the anti-loss toothing of the clamping nut interacts with the anti-loss toothing of the brake disc. In the final assembled state of the clamping nut, the anti-loss toothing of the clamping nut interacts with the anti-loss toothing of the brake disc, whereby the teeth of the anti-loss toothing engage behind each other in the direction of rotation. This reduces the risk of loosening the screw connection between the clamping nut and the hub or the mounting element.", "", "The clamping nut can, for example, comprise a bore, wherein a tool coupling structure is provided on the circumferential surface of the bore of the clamping nut. A tool coupling structure can alternatively be provided on the outer circumferential surface of the clamping nut. This allows the clamping nut to be mounted easily, reliably, and with a sufficiently high tightening torque so that a loosening of the screw connection between the clamping nut and the hub or the mounting element can be reliably prevented.", "", "A center plane of the sensor ring and a center plane of the brake disc can, for example, be arranged to be offset with respect to each other.", "", "The present invention also provides a pedelec with a wheel unit and a speed sensor, wherein the speed sensor interacts with the sensor ring. The advantages thereof are described above.", "", "Such a configuration of the wheel unit allows the sensor ring to be attached to the hub in a simple and reliable manner, wherein the attachment of the sensor ring does not negatively affect the attachment of the brake disc. The sensor ring can in particular be mounted in combination with the mounting of the brake disc according to the CenterLock principle, wherein the time required for mounting the wheel unit is reduced by simply attaching the brake disc to the mounting element and screwing in the clamping nut.", "", "An embodiment of the present invention is described in greater detail below with reference to the drawings.", "", "FIG.1shows a pedelec10with a frame14, a front wheel unit20, and a rear wheel unit18. The front wheel unit20is rotatably mounted on a fork15, wherein the fork15is rotatably mounted on the frame14and is non-rotatably connected to a handlebar16. Both wheel units18,20each comprise a hub38,40and a rim42,44, wherein each hub38,40is connected to the rim42,44via a plurality of spokes50,52. A tire46,48is arranged on each of the rims42,44.", "", "The pedelec10further comprises an electric drive unit22, a traction battery36attached to the frame14, and a control unit37attached to the handlebar16. The electric drive unit22is configured as a center motor and is arranged in the region of a pedal crankshaft24. The electric drive unit22comprises an electric motor and possibly a gearbox (which are not shown inFIG.1). The electric motor is connected to a torque-transmitting output chainring30via the gearbox. The output chainring30is also connected to the pedal crankshaft24, wherein a rider torque introduced into the pedal crankshaft24via two pedal cranks26,28is transmitted to the output chainring30. This means that a total drive power generated by the electric motor and a rider power input by the rider is available at the output chainring30. The output chainring30is connected via a chain32to a pinion cassette34which is attached to the hub38of the rear wheel unit18in a torque-transmitting manner so that the rear wheel unit18is driven by the motor power and the rider power.", "", "In order to provide a safe riding operation of the pedelec10, disc brakes54,56are provided on each of the two wheel units18,20. The disc brakes54,56each comprise a brake caliper58,64attached to the frame14and a brake disc60,68attached to the hub38,40. The brake calipers58,64each comprise two brake pads which clamp the brake disc60,68during a braking operation and are each connected via a hydraulic brake line62,70to a brake lever arranged on the handlebar16.", "", "The brake discs60,68are each non-rotatably connected to the hub38,40of the wheel units18,20via a fastening device72. One such fastening device72is shown inFIGS.2and3. The fastening device72comprises a mounting element74which is attached to the hub38,40. The mounting element74is configured in the form of a sleeve and comprises a brake disc fastening area75on an outer circumferential surface. The brake disc fastening area75comprises an external toothing98which interacts with an internal toothing96of the brake disc60,68in the mounted state. An internal thread, which is not visible in the drawings, is provided on an inner circumferential surface of the sleeve-like mounting element74. The mounting element74comprises a radial projection77on an axial side facing the hub38,40. The fastening device72also has a clamping nut76, which comprises a fastening section79with an external thread, wherein the clamping nut76is screwed into the internal thread of the mounting element74via the external threads. In other words, the clamping nut76is connected to the mounting element74via a screw connection78. The clamping nut76also comprises a radial projection81.", "", "When the brake disc60,68is mounted on the hub38,40, the brake disc60,68, which comprises a bore95with an internal toothing96, is pushed onto the brake disc fastening area75, thereby connecting the brake disc60,68to the mounting element74and the hub38,40in a rotationally fixed manner via toothing96,98. The clamping nut76is then screwed into the mounting element74, wherein the brake disc60,68is clamped between the radial projection77of the mounting element74and the radial projection81of the clamping nut76in the direction of the rotational axis of the hub38,40, whereby the brake disc60,68is fixed in the direction of the rotational axis of the hub38,40. The clamping nut76comprises an anti-loss toothing100on its surface which is in contact with the brake disc60,68, wherein the anti-loss toothing100interacts with a corresponding anti-loss toothing102provided on the brake disc60,68. This reduces the risk of the clamping nut76coming loose. A tool coupling structure106is provided on a bore104of the clamping nut76for mounting the clamping nut76, wherein a tool can be interlockingly coupled to the clamping nut76in the direction of rotation via the tool coupling structure106, and the screw connection78between the mounting element74and the clamping nut76can be tightened.", "", "In order to operate the pedelec10, i.e., to control an electric motor of the electric drive unit22, it is imperative that the travelling speed of the pedelec10is measured. Pedelecs10may only be operated up to a legally permissible riding speed, i.e., assistance by the electric drive unit22may only be provided up to a legally prescribed maximum speed, wherein the electric drive unit22must be switched off if the maximum speed is exceeded.", "", "In order to measure the travelling speed of the pedelec10, the pedelec10comprises a speed sensor82which measures the travelling speed of the pedelec10, wherein the sensor signals of the speed sensor82are transmitted to a motor control unit which is used to control the electric motor. The speed sensor82interacts with a sensor ring80, which comprises a scanning area86.", "", "According to the present invention, the sensor ring80is fixedly arranged on the clamping nut76. The sensor ring80has four fastening sections90distributed around the circumference which project radially inwards, each comprising a recess92. The clamping nut76comprises four protrusions94corresponding to the recesses92, wherein the fastening sections90with the recesses92are pushed onto the protrusions94. This creates several press connections between the fastening sections90and the protrusions94. The sensor ring80could alternatively be screwed to the clamping nut76or configured integrally with the clamping nut76.", "", "It should be clear that other constructive embodiments of the pedelec10compared to the described embodiment are also possible. Reference should be had to the appended claims."], "claims": ["1 - 10 (canceled)", "a hub which is rotatable about a rotational axis; a rim which is rotatable about the rotational axis, the hub and the rim being connected to one another via spokes; a fastening device comprising, a mounting element which is non-rotatably arranged on the hub, and a clamping nut which is fastenable to the hub or to the mounting element via a screw connection; a brake disc which is non-rotatably connected to the hub via the fastening device, wherein, the brake disc is interlockingly connected to the mounting element in a direction of rotation, and the brake disc is clampingly attached via the clamping nut in the direction of the rotational axis between the hub or the mounting element and the clamping nut; and a sensor ring which is connected to the hub in a rotationally fixed manner; the sensor ring comprising a scanning area which is scannable by a speed sensor, wherein, the sensor ring is arranged to be directly fixed to the clamping nut, and the sensor ring is fastenable together with the clamping nut to the hub or to the mounting element via the screw connection.", "12 . The wheel unit as recited in claim 11 , wherein the sensor ring is arranged on a side of the clamping nut which faces away from the brake disc.", "13 . The wheel unit as recited in claim 11 , wherein the sensor ring is directly fixed to the clamping nut by being screwed to the clamping nut.", "the sensor ring is directly fixed to the clamping nut via a press connection, and the sensor ring further comprises at least one recess which forms the press connection via a corresponding protrusion provided on the clamping nut.", "15 . The wheel unit as recited in claim 11 , wherein the sensor ring is configured in one piece with the clamping nut.", "the brake disc comprises an internal toothing, and the mounting element comprises an external toothing which is complementary to the internal toothing of the brake disc.", "the clamping nut comprises anti-loss toothing on a side facing the mounting element, the brake disc comprises anti-loss toothing on a side facing the clamping nut, and the anti-loss toothing of the clamping nut interacts with the anti-loss toothing of the brake disc.", "a tool coupling structure, wherein, the clamping nut comprises a bore, and the tool coupling structure is arranged on a circumferential surface of the bore or on an outer circumferential surface of the clamping nut.", "the sensor ring has a center plane, the brake disc has a center plane, and the center plane of the sensor ring and the center plane of the brake disc are arranged to be offset relative to one another.", "the wheel unit as recited in a speed sensor which is configured to interact with the sensor ring of the wheel unit."], "bibtex": "@patent{20240351371,\n    title = {WHEEL UNIT FOR A PEDELEC AND PEDELEC},\n    number = {20240351371},\n    year = {2024},\n    note = {File: US20240351371A1-20241024.XML}\n    }", "classification": "B60B2700FI"}, {"title": "HUB ASSEMBLY FOR HUMAN POWERED VEHICLE", "doc_number": "20240351372", "filename": "US20240351372A1-20241024.XML", "abstract": "A hub assembly is provided for a human powered vehicle. The hub assembly basically includes a hub axle, a hub body, a thru-axle and an electrical cable. The thru-axle is configured to be disposed in a through bore of the hub axle. The electrical cable includes a first cable section extending from an interior space of the hub body through an opening in the hub axle and into the through bore. The electrical cable includes a second cable section extending in the axial direction within the through bore. The electrical cable includes an axially expandable cable section between the first cable section and the second cable section. The axially expandable cable section extends in the axial direction within the through bore. The axially expandable cable section is expandable in the axial direction in response to movement of the thru-axle relative to the hub axle.", "detailed_description": ["Selected embodiments will now be explained with reference to the drawings. It will be apparent to those skilled in the human-powered vehicle field (e.g., the bicycle field) from this disclosure that the following descriptions of the embodiments are provided for illustration only and not for the purpose of limiting the invention as defined by the appended claims and their equivalents.", "", "Referring initially toFIG.1, a hub assembly10is provided for a human powered vehicle V (i.e., a bicycle) in accordance with a first illustrated embodiment. Here, in the first embodiment, the hub assembly10is a bicycle rear hub assembly. The hub assembly10can be used with other human-powered vehicles as needed and/or desired. The hub assembly10is configured to be removably mounted to the human-powered vehicle V as discussed below.", "", "Here, the human-powered vehicle V is an electric assist bicycle (E-bike). Alternatively, the human-powered vehicle V can be a road bicycle, a city bike, a cargo bike, and a recumbent bike, or another type of off-road bicycle such as a cyclocross bicycle. The number of wheels on the human-powered vehicle V is not limited. The human-powered vehicle V includes, for example, a monocycle and a vehicle having three or more wheels. Here, the human-powered vehicle V is a bicycle that at least partially uses human power as a driving power for traveling and includes an electric drive unit assisting the human power. In particular, a vehicle using solely an internal combustion engine as driving power is not included in the human-powered vehicle of this disclosure.", "", "As seen inFIG.1, the human-powered vehicle V includes a vehicle body VB that is supported by a rear wheel RW and a front wheel FW. The vehicle body VB basically includes a front frame body FB and a rear frame body RB (a swing arm). The vehicle body VB is also provided with a handlebar H and a front fork FF for steering the front wheel FW. The rear frame body RB is swingably mounted to a rear section of the front frame body FB such that the rear frame body RB can pivot with respect to the front frame body FB. The rear wheel RW is mounted to a rear end of the rear frame body RB. A rear shock absorber RS is operatively disposed between the front frame body FB and rear frame body RB. The rear shock absorber RS is provided between the front frame body FB and the rear frame body RB to control the movement of the rear frame body RB with respect to the front frame body FB. Namely, the rear shock absorber RS absorbs shock transmitted from the rear wheel RW. The rear wheel RW is rotatably mounted to the rear frame body RB. The front wheel FW is mounted to the front frame body FB via the front fork FF. Namely, the front wheel FW is mounted to a lower end of the front fork FF. A height adjustable seatpost ASP is mounted to a seat tube of the front frame body FB in a conventional manner and supports a bicycle seat or saddle S in any suitable manner. The front fork FF is pivotally mounted to a head tube of the front frame body FB. The handlebar H is mounted to an upper end of a steering column steerer tube of the front fork FF. The front fork FF absorbs shock transmitted from the front wheel FW. Preferably, the rear shock absorber RS and the front fork FF are electrically adjustable suspensions. For example, the stiffness and/or stoke length of the rear shock absorber RS and the front fork FF can be adjusted.", "", "The human-powered vehicle V further includes a drivetrain DT and an electric drive unit DU that is operatively coupled to the drivetrain DT. Here, for example, the drivetrain DT is a chain-drive type that includes a crank C, a front sprocket FS, a plurality of rear sprockets CS and a chain CN. The crank C includes a crank axle CA1and a pair of crank arms CA2. The crank axle CA1is rotatably supported to the front frame body FB via the electric drive unit DU. The crank arms CA2are provided on opposite ends of the crank axle CA1. A pedal PD is rotatably coupled to the distal end of each of the crank arms CA2. The drivetrain DT can be selected from any type, and can be a belt-drive type or a shaft-drive type.", "", "The electric drive unit DU has an electric motor that provides a drive assist force to the front sprocket FS. The electric drive unit DU can be actuated to assist in the propulsion of the human-powered vehicle V in a conventional manner. The electric drive unit DU is actuated, for example, in accordance with a human driving force applied to the pedals PD. The electric drive unit DU is actuated by electric power supplied from a main battery pack BP that is mounted on a downtube of the human-powered vehicle V. The main battery pack BP can provide electrical power to other vehicle components such as the electric rear derailleur RD, the height adjustable seatpost ASP, the rear shock absorber RS, the front fork FF and any other vehicle component that uses electrical power.", "", "The human-powered vehicle V further includes a cycle computer SC. Here, the cycle computer SC is mounted to the front frame body FB. Alternatively, the cycle computer SC can be provided on the handlebar H. The cycle computer SC notifies the rider of various traveling and/or operating conditions of the human-powered vehicle V. The cycle computer SC can also include various control programs for automatically controlling one or more vehicle components. For example, the cycle computer SC can be provided with an automatic shifting program for changing gears of the electric rear derailleur RD based on one or more traveling and/or operating conditions of the human-powered vehicle V.", "", "Here, the human-powered vehicle V further includes an electric rear derailleur RD that is attached to the rear frame body RB for shifting the chain CN between the rear sprockets CS. The electric rear derailleur RD is one type of gear changing device. Here, the electric rear derailleur RD is an electric derailleur (i.e., an electric gear changing device or an electric transmission device). Here, the electric rear derailleur RD is provided on the rear side of the rear frame body RB near the hub assembly10. The electric rear derailleur RD can be operated when a rider of the human-powered vehicle V manually operates a gear shift operating device or shifter SL. The electric rear derailleur RD can also be automatically operated based on traveling conditions and/or operating conditions of the human-powered vehicle V. The human-powered vehicle V can further include a plurality of electronic components.", "", "As seen inFIGS.2and3, the hub assembly10is support on the rear end of the rear frame body RB. The hub assembly10supports the rear sprockets CS for operatively coupling the hub assembly10to the chain CN. The hub assembly10is electrically coupled to the electric rear derailleur RD by an electrical cable EC. As explained below, the hub assembly10is configured to supply electrical power to the electric rear derailleur RD. Moreover, as explained below, the hub assembly10is configured to receive electrical power via the electric rear derailleur RD. In particular, as seen inFIG.3, the electric rear derailleur RD has a charging port CP for receiving a charging cable of a charging device. Thus, a human powered vehicle assembly11comprises the hub assembly10and an electric component. Here, the human powered vehicle assembly11comprises the electric rear derailleur RD as the electric component. Alternatively, the electric component of the human powered vehicle assembly11can be another electrical component of the human-powered vehicle V as needed and/or desired.", "", "The structure of the hub assembly10will now be described with particular reference toFIGS.3to6. The hub assembly10basically comprises a hub axle12and a hub body14. The hub axle12has a center axis O1. The center axis O1defines an axial direction A1and a radial direction R1. The center axis O1further defines a circumferential direction C1. The hub axle12is configured to be non-rotatably attached to the rear frame body RB of the vehicle body VB. The hub body14is rotatably disposed around the center axis O1. In other words, the hub body14is rotatably mounted around the hub axle12. The hub body14has an interior space16. The interior space16is defined between the hub body14and the hub axle12in the radial direction R1. Thus, in the first embodiment, the interior space16is an annular space.", "", "As seen inFIGS.5and6, the hub axle12is a rigid member made of a suitable material such as a metallic material. The hub axle12is preferably made of several pieces that are coupled together. However, the hub axle12can be a one-piece member in certain situations if needed and/or desired. Here, the hub axle12is a tubular member. The hub axle12has a first axial end12aand a second axial end12b. The hub axle12has a through bore12c. The through bore12cextends between the first axial end12aand the second axial end12b. In this first embodiment, a first end piece18is provided to the first axial end12a(right side inFIGS.5and6) of the hub axle12, and a second end piece20is provided to the second axial end12b(left side inFIGS.5and6) of the hub axle12. Here, the first end piece18is frictionally fitted onto the first axial end12aof the hub axle12, and the second end piece20is threadedly mounted to the second axial end12bof the hub axle12.", "", "As indicated inFIGS.2, the hub body14is rotatably mounted around the hub axle12to rotate in a driving rotational direction D1. The driving rotational direction D1corresponds to a forward driving direction of the rear wheel RW. The hub body14is configured to support the rear wheel RW in a conventional manner. More specifically, in the first embodiment, the hub body14includes a first spoke attachment structure14aand a second spoke attachment structure14b. The first spoke attachment structure14ais spaced from the second spoke attachment structure14bin the axial direction A1. The first spoke attachment structure14ais a first annular flange that extend radially outward with respect to the center axis O1. The second spoke attachment structure14bis a second annular flange that extend radially outward with respect to the center axis O1. The first spoke attachment structure14aincludes a plurality of first spoke openings, and the second spoke attachment structure14bincludes a plurality of second spoke openings. The first spoke attachment structure14aand the second spoke attachment structure14bare configured to receive a plurality of spokes (FIG.1) for attaching a rim (FIG.1) of the rear wheel RW to the hub body14in a conventional manner. In this way, the hub body14and the rear wheel RW are coupled to rotate together about the central axis O1.", "", "As mentioned above, the hub body14is rotatably disposed around the hub axle12to rotate around the center axis O1. In particular, as seen inFIGS.5and6, the hub body14is rotatably supported on the hub axle12by a first hub body bearing21and a second hub body bearing22. The first hub body bearing21rotatably supports one end of the hub body14with respect to the center axis O1. The second hub body bearing22rotatably supports the other end of the hub body14with respect to the center axis O1.", "", "The first hub body bearing21includes a first inner race21a, a first outer race21band a plurality of first roller elements21c. The first roller elements21care disposed between the first inner race21aand the first outer race21b. The second hub body bearing22includes a second inner race22a, a second outer race22band a plurality of second roller elements22c. The second roller elements22care disposed between the second inner race22aand the second outer race22b. Here, the first hub body bearing21and the second hub body bearing22are angular contact bearings. Alternatively, both the first hub body bearing21and the second hub body bearing22can be radial bearings. Also, alternatively, one of the first hub body bearing21and the second hub body bearing22can be an angular contact bearing, and the other one of the first hub body bearing21and the second hub body bearing22can be a radial bearing.", "", "Angular contact bearings have inner and outer ring raceways that are displaced relative to each other in the direction of the bearing axis. In other words, angular contact bearings are designed to accommodate combined loads, i.e., simultaneously acting radial and axial loads. Angular contact bearings can have a plurality of ball bearings or a plurality of tapered rollers as the roller elements. Radial bearings support force in the direction perpendicular to the axis. Further, a radial roller bearing can be adopted instead of the angular contact roller bearings. Radial bearings can have a plurality of ball bearings or a plurality of cylindrical rollers as the roller elements.", "", "Referring toFIG.4, the hub assembly10further comprises a sprocket support body24. The sprocket support body24is a rigid member made of a suitable material such as a metallic material. The center axis of the sprocket support body24is disposed concentrically with the center axis O1. The sprocket support body24is rotatably disposed around the hub axle12to rotate around the center axis O1. In particular, the sprocket support body24is rotatably supported around the hub axle12by a first sprocket support bearing25and a second sprocket support bearing26. As illustrated inFIG.3, the sprocket support body24is configured to support the plurality of sprockets CS. The sprocket support body24is configured to non-rotatably support the sprockets CS. Here, the sprocket support body24has a plurality of external splines24athat are configured to engage the sprockets CS. In this way, the sprockets CS are non-rotatably coupled to the sprocket support body24. The external splines24aform a sprocket attachment structure of the hub assembly10. However, the sprocket support body24is not limited to the illustrated embodiment. Alternatively, one or more of the rear sprockets CS can be integrally formed with the sprocket support body24. Basically, the sprocket support body24is configured to rotate around the center axis O1to transmit a driving force to the hub body14while rotating in the driving rotational direction D1around the center axis O1. However, the sprocket support body24does not transmit a driving force to the hub body14while rotating in a non-driving rotational direction D2around the center axis O1. The non-driving rotational direction D2is opposite to the driving rotational direction D2with respect to the center axis O1. In any case, the sprocket support body24and the sprockets CS are coupled together to rotate together in both the driving rotational direction D1and the non-driving rotational direction D2.", "", "Referring toFIGS.5and6, the first sprocket support bearing25and the second sprocket support bearing26are axially spaced apart along the hub axle12. The first sprocket support bearing25rotatably supports a first end of the sprocket support body24. The second sprocket support bearing26rotatably supports a second end of the sprocket support body24. The first sprocket support bearing25includes a first inner race25a, a first outer race25band a plurality of first roller elements25c. The first roller elements25care disposed between the first inner race25aand the first outer race25b. The second sprocket support bearing26includes a second inner race26a, a second outer race26band a plurality of second roller elements26c. The second roller elements26care disposed between the second inner race26aand the second outer race26b. Here, the first sprocket support bearing25and the second sprocket support bearing26are radial ball bearings. Alternatively, both the first sprocket support bearing25and the second sprocket support bearing26can be angular contact bearings. Also, alternatively, one the first sprocket support bearing25and the second sprocket support bearing26can be an angular contact bearing, and the other one of the first sprocket support bearing25and the second sprocket support bearing26can be a radial bearing.", "", "In the illustrated embodiment, as seen inFIGS.5and6, the rear hub10further comprises a torque transmitting mechanism28disposed between the hub body14and the sprocket support body24to transmit a rotational force to the hub body14from the sprocket support body24. The torque transmitting mechanism28forms a one-way clutch such that torque is transferred from the sprocket support body24to the hub body14in one direction. In this way, the rotational force imparted to the sprocket support body24from the rear sprockets CS during pedaling in the driving rotational direction is transmitted to hub body14. During coasting, the sprocket support body24can be stationary and the hub body14can rotate in the driving rotational direction. Torque transmitting mechanisms such as the torque transmitting mechanism28are well known in the human-powered vehicle field (e.g., the bicycle field). Thus, the torque transmitting mechanism28will not be described in further detail.", "", "Referring now toFIGS.4and5, the hub assembly10further comprises a thru-axle30. The thru-axle30is a rigid member made of a suitable material such as a metallic material. The thru-axle30is configured to be non-rotatably attached to the rear frame body RB of the vehicle body VB. The thru-axle30is configured to be disposed in the through bore12cof the hub axle12. When the thru-axle30is fixed to the rear frame body RB of the vehicle body VB, the hub axle12is also non-rotatably is fixed to the rear frame body RB of the vehicle body VB. More specifically, when the thru-axle30is fixed to the rear frame body RB of the vehicle body VB, the rear frame body RB of the vehicle body VB is squeezed against the first end piece18and the second end piece20to prevent the hub axle12from rotating relative to the thru-axle30and the rear frame body RB.", "", "Basically, as seen inFIGS.7to13, the thru-axle30includes a first shaft portion31, a second shaft portion32and an intermediate shaft portion33. The intermediate shaft portion33is disposed between the first shaft portion31and the second shaft portion32. Referring toFIG.12, the first shaft portion31has a radial width W1in the radial direction R1with respect to the center axis O1. The radial width W1can also be referred to a first radial width W1of the thru-axle30. The second shaft portion32has a radial width W2in the radial direction R1with respect to the center axis O1. The radial width W2can also be referred to a second radial width W2of the thru-axle30. The intermediate shaft portion33has a radial width W3that is smaller than the radial width W1of the first shaft portion31and the radial width W2of the second shaft portion32to define a recessed area34of the thru-axle30. The radial width W3can also be referred to a third radial width W3of the thru-axle30.", "", "In the first embodiment, as seen inFIGS.7to9, the thru-axle30comprises a first axle part36, and a second axle part38. As discussed below, the second axle part38is detachably coupled to the first axle part36in the axial direction A1. The first axle part36includes the first shaft portion31, the second shaft portion32and the intermediate shaft portion33. The first axle part36includes an axial bore36a. The axial bore36aextends at least axially through the first shaft portion31, the second shaft portion32and the intermediate shaft portion33. Here, the axial bore36aextends axially through the first shaft portion31. The first axle part36has a first axle length L1. The second axle part38has a second axle length L2. The first axle length L1is larger than the second axle length L2.", "", "Here, the first axle part36has a first attachment end portion40and a first connection end portion42. The first attachment end portion40includes an external thread40athat is configured to threadedly engage an internal thread of a fixing nut, or a fork or a frame. Here, the external thread40aof the first attachment end portion40of the first axle part36is threadedly engaged with an internal thread of the rear frame body RB. The first connection end portion42is configured to be detachably coupled to the second axle part38. In the first embodiment, the first axle part36is made of two pieces. In particular, the first connection end portion42is detachably coupled from a reminder of the first axle part36. More specifically, as discussed below, the first axle part36has an external thread40bthat is configured to threadedly engage an internal thread42aof the first connection end portion42.", "", "The second axle part38has a second attachment end portion44and a second connection end portion46. The thru-axle30further comprises a frame attachment structure50. The frame attachment structure50is coupled to the second attachment end portion44of the second axle part38. In this way, the frame attachment structure50couples the second attachment end portion44of the second axle part38to the rear frame body RB. On the other hand, the second connection end portion46of the second axle part38is detachably coupled to the first connection end portion42of the first axle part36. In particular, the second connection end portion46of the second axle part38is detachably coupled to the first connection end portion42of the first axle part36by a twist-lock connection52. Basically, the twist-lock connection52includes a male connector54and a female receptacle56. The male connector54is provided to one of the first connection end portion42and the second connection end portion46of the second axle part38. The female receptacle56is provided to the other of the first connection end portion42of the first axle part36and the second connection end portion46of the second axle part38. More specifically, here, the first connection end portion42includes the female receptacle56, and the second connection end portion46includes the male connector54.", "", "As seen inFIG.14, the male connector54includes a shaft portion54ahaving a protrusion54bextending from the shaft portion54ain the radial direction R1. The rod portion54aextends along the center axis O1in the assembled state. Here, the protrusion54bincludes a pair of diametrically disposed abutments that project radially from the rod portion54awith respect to the center axis O1in the assembled state.", "", "As seen inFIGS.15and16, the female receptacle56includes an insertion section56a, a retaining section56b, and an abutment surface56c. The abutment surface56cis disposed between the insertion section insertion section56aand the retaining section56b. Here, the insertion section56aincludes an opening56a1that is configured to receive the male connector54therethrough while the male connector54is in a first orientation. The retaining section56bis a tubular portion that extends from the insertion section56ato define an internal space. The retaining section56bincludes a pair of stops56b1and56b2. The shaft portion54aand the protrusion54bare configured to slide in the axial direction A1through the insertion section56aand are twisted in the retaining section56bto engage the protrusion54bwith the abutment surface56c. Thus, the abutment surface56ccontacts the protrusion54bto prevent axial separation of the second axle part38from the first axle part36while the male connector54is in a second orientation in which the male connector54has been twisted about the center axis O1so that the protrusion54bcontact the stops56b1and56b2. Thus, the first orientation of the male connector54is established by aligning the protrusion54bwith the opening56also that the male connector54can slide in the axial direction A1through the insertion section56a. The second orientation of the male connector54is established by twisting the male connector54so that the protrusion54bcontact the stops56b1and56b2and the protrusion54bengage the abutment surface56c.", "", "Referring toFIGS.12to14, the frame attachment structure50includes a control lever60, a cam62and a cam follower64. The cam62is configured to be pivoted by the control lever60. The cam follower64is configured to move in the axial direction A1in response to operation of the control lever60. The cam follower64is integrally formed with the second attachment end portion44of the second axle part38. Here, the control lever60is pivotally coupled to the cam follower64by the cam62for moving a frame engagement cap36ewith respect to the attachment bolt36bin an axial direction of the attachment bolt36b. Thus, by pivoting the control lever60between a first (open) position to a second (closed) position, the control lever60pivots the cam62to change the distance between a frame engagement cap66and the second end piece20. In this way, the frame attachment structure50attaches the hub axle12and the thru-axle30to the rear frame body RB of the vehicle body VB.", "", "Referring toFIGS.17,19and20, the hub assembly10further comprises an electrical power storage device68. At least a portion of the electrical power storage device68is axially disposed between the first spoke attachment structure14aand the second spoke attachment structure14b. Here, the electrical power storage device68is entirely disposed with respect to the axial direction A1between the first spoke attachment structure14aand the second spoke attachment structure14b.", "", "The electrical power storage device68is configured to supply electricity to an electric component. Specifically, in the first embodiment, the electrical power storage device68is configured to supply electricity to an electric component that is different from the hub assembly10. The electrical power storage device68is configured to receive electricity from the electric component. In the first embodiment, the electric component corresponds to the electric rear derailleur RD. However, the electric component can be a different component of the human-powered vehicle V (e.g., bicycle).", "", "The hub assembly10further comprises an electrical cable70. The electrical cable70is electrically connected to the electrical power storage device68and an electric component (e.g., the electric rear derailleur RD). In this way, the electrical power storage device68is configured to supply electricity to an electric component (e.g., the electric rear derailleur RD) via the electrical cable70. Also, the electrical power storage device68is configured to receive electricity from an electric component (e.g., the electric rear derailleur RD) via the electrical cable70. In the first embodiment, the electrical power storage device68supplies electricity to the electric rear derailleur RD via the electrical cable70, and receives electricity from the electric rear derailleur RD via the electrical cable70.", "", "Basically, the electrical cable70extends from the interior space16of the hub body14through an opening72in the hub axle12and into the through bore12c. The electrical cable70is partly disposed in the recessed area34of the first axle part36between an outer surface33aof the intermediate shaft portion33and an inner surface12dof the hub axle12that defines the through bore12c. In particular, the electrical cable70includes a first cable section70aextending from the interior space16of the hub body14through the opening72in the hub axle12and into the through bore12c. The electrical cable70includes a second cable section70bextending in the axial direction A1within the through bore12c. In particular, the second cable section70bof the electrical cable70extends in the axial direction A1along a section of the first axle part36. In particular, the second cable section70bof the electrical cable70through a section of the axial bore36aalong the first shaft portion31of the first axle part36.", "", "The electrical cable70includes an axially expandable cable section70cbetween the first cable section70aand the second cable section70b. The axially expandable cable section70cextends in the axial direction A1within the through bore12c. The axially expandable cable section70cis expandable in the axial direction A1in response to movement of the thru-axle30relative to the hub axle12.", "", "In this embodiment, as seen inFIG.17, the axially expandable cable section70cincludes a coiled section71spirally wrapped around the thru-axle30. In particular, the coiled section71is spirally wrapped around the intermediate shaft portion33. Thus, the axially expandable cable section70cis disposed in the recessed area34of the thru-axle30between the outer surface33aof the intermediate shaft portion33and the inner surface12dof the hub axle12in the radial direction R1. The coiled section71is expandable in the axial direction A1by the coiled section71being uncoiled or coiled in response to movement of the thru-axle30relative to the hub axle12.", "", "As seen inFIG.18, the hub assembly10further comprises an electrical connector74. The electrical connector74is coupled to an axial end of the thru-axle30. Specifically, the electrical connector74is coupled to an axial end of the first axle part36. The axial end of the first axle part36is opposite to the second axle part38. Thus, in the first embodiment, the electrical connector74is coupled to the first attachment end portion40of the first axle part36. The electrical connector74is at least partly disposed in a connector hole40bof the axial end of the thru-axle30. More specifically, the electrical connector74is at least partly disposed in the connector hole40bof the axial end of the first axle part36. The electrical connector74includes at least one electrical pin74a. The at least one electrical pin74apartly projects from the axial end of the thru-axle30. Specifically, the at least one electrical pin74apartly projecting from the axial end of the first axle part36. The at least one electrical pin74ais configured to be rotatably disposed in the connector hole40bsuch that relative rotation between the at least one electrical pin74aand the first axle part36is permitted. The electrical connector74is electrically connected to the electrical cable70. In particular, the electrical connector74is electrically connected to an end of the second cable section70bthat is opposite to the axially expandable cable section70c.", "", "Referring toFIGS.6and17, the electrical power storage device68will now be discussed in further detail. The electrical power storage device68is disposed radially outward of an outer surface12eof the hub axle12. In particular, the electrical power storage device68is disposed in the interior space16. Also, in the first embodiment, the electrical power storage device68is disposed axially inward of the sprocket attachment structure (e.g., the external splines24aof the sprocket support body24). In particular, the electrical power storage device68is disposed axially inward of the first axial end12aof the hub axle12and the second axial end12bof the hub axle12. Preferably, the electrical power storage device68surrounds at least half of the outer surface of the hub axle12in the circumferential direction C1. In the first embodiment, the electrical power storage device68surrounds the outer surface12eof the hub axle12in the circumferential direction C1.", "", "Preferably, at least a portion of the electrical power storage device68axially overlaps the hub body14. More preferably, an entire axial length of the electrical power storage device68axially overlaps the hub body14. At least a portion of the electrical power storage device68is axially disposed between the first spoke attachment structure14aand the second spoke attachment structure14b. In the first embodiment, an entire axial length of the electrical power storage device68is disposed between the first spoke attachment structure14aand the second spoke attachment structure14bin the axial direction A1.", "", "The electrical power storage device68includes a casing76. The electrical power storage device68further includes at least one battery78. The at least one battery78is disposed in the casing76. The electrical power storage device68surrounds the outer surface12eof the hub axle12in the circumferential direction C1. Thus, here, the casing76is at least partly arc shaped and surrounds the outer surface12eof the hub axle12in the circumferential direction C1. Moreover, the battery78surrounds the outer surface12eof the hub axle12in the circumferential direction C1. In the first embodiment, the electrical power storage device68includes a plurality of batteries78disposed to surround the hub axle12in the circumferential direction C1. The batteries78are cylindrical shaped members that are elongated in the axial direction A1. The batteries78are disposed circumferentially around the outer surface12eof the hub axle12in the circumferential direction C1. Here, the batteries78are rechargeable batteries.", "", "As diagrammatically illustrated inFIG.20, the electrical power storage device68further includes a circuit board80having an electronic controller82, a power control circuit84and a wireless communication circuit86. The circuit board80is electrically connected to the batteries78by an electrical cable88for receiving electric power from the batteries78and supplying electric power to the batteries78. Thus, the batteries78supply electric power to the electronic controller82, the power control circuit84and the wireless communication circuit86. Here, the circuit board80having the electronic controller82, the power control circuit84and the wireless communication circuit86are provided in a casing90. Alternatively, the circuit board80having the electronic controller82, the power control circuit84and the wireless communication circuit86can be provided in the casing76.", "", "For example, in the first embodiment, the electronic controller82, the power control circuit84and the wireless communication circuit86are provided on a common circuit board (i.e., the circuit board80) containing any number of integrated circuit or circuits for completing the activities described herein. Also, while the controller82is illustrated as being a single unit located on the circuit board80, the electrical power storage device68is not limited to this configuration. Rather, the electrical power storage device68can be provided with a plurality of circuit board80and/or a plurality of controllers that are provided at various locations.", "", "The electronic controller82is configured to control the power control circuit84and the wireless communication circuit86. The electronic controller82includes at least one processor that executes predetermined control programs. The at least one processor can be, for example, a central processing unit (CPU) or a micro processing unit (MPU). The electronic controller82also preferably includes a data storage device (memory) for storing various control programs and information used for various control processes. The data storage device (memory) is any computer storage device or any computer readable medium with the sole exception of a transitory propagating signal. For example, the memory device can be nonvolatile memory and volatile memory, and can includes a ROM (Read Only Memory) device, a RAM (Random Access Memory) device, a hard disk, a flash drive, etc. The term “electronic controller” as used herein refers to hardware that executes a software program, and does not include a human being.", "", "The power control circuit84is configured to control the charging of the batteries78and the supply of electric power from the batteries78where the electric power delivered via the electrical cable70. On the other hand, the wireless communication circuit86configured to control the charging of the batteries78and the supply of electric power from the batteries78where the electric power delivered wirelessly. Thus, the electrical power storage device68is configured to wirelessly supply electricity to an electric component. The electrical power storage device68is configured to wirelessly receive electricity from the electric component. Here, for example, the wireless communication circuit86includes at least a non-contact charging coil for carrying out magnetic resonance to transfer electric power to and from the batteries78. Alternatively, the wireless communication circuit86can be configured to carry out Near-Field Communication (NFC). The term “NFC” as used herein refers to short-range wireless communication that achieves communication by electromagnetic induction to transfer electric power to and from the batteries78. Preferably, an AC/DC converter92is disposed between the wireless communication circuit86and the batteries78. The AC/DC converter92is provided on the circuit board80. The AC/DC converter92converts the alternating current outputted by the wireless communication circuit86to direct current that is received by the batteries78. In this way, the direct current outputted by the AC/DC converter92is used to recharge the batteries78.", "", "Referring now toFIG.21, a first modification of the hub assembly10will now be explained. In this first modification, the electrical cable70is replaced with an electrical cable170. Basically, the electrical cable170includes a first cable section170a, a second cable section170band an axially expandable cable section170c. The first cable section170aextends from the interior space16of the hub body14through the opening72in the hub axle12and into the through bore12c. The second cable section170bextends in the axial direction A1within the through bore12c. In particular, the second cable section170bextends in the axial direction A1along a section of the axial bore36aalong the first shaft portion31of the first axle part36. The electrical connector74is electrically connected to an end of the second cable section170bthat is opposite to the axially expandable cable section170c. The axially expandable cable section170cextends between the first cable section170aand the second cable section170b.", "", "In the first modification, the axially expandable cable section170cincludes an undulating section171that is disposed in the through bore12cand extends in the axial direction A1. In particular, the undulating section171is disposed in the recessed area34of the first axle part36. Here, for example, the undulating section171includes a flexible flat electrical cable. The undulating section171is expandable in the axial direction A1by unfolding in response to movement of the thru-axle30relative to the hub axle12.", "", "Referring now toFIGS.22and23, a second modification of the hub assembly10will now be explained. In this second modification, the electrical cable70is replaced with an electrical cable270. Basically, the electrical cable270includes a first cable section270a, a second cable section270band an axially expandable cable section270c. The first cable section270aextends from the interior space16of the hub body14through the opening72in the hub axle12and into the through bore12c. The second cable section270bextends in the axial direction A1within the through bore12c. In particular, the second cable section270bextends in the axial direction A1along a section of the axial bore36aalong the first shaft portion31of the first axle part36. The electrical connector74is electrically connected to an end of the second cable section270bthat is opposite to the axially expandable cable section270c. The axially expandable cable section270cextends between the first cable section270aand the second cable section270b.", "", "As seen inFIG.22, the axially expandable cable section270cincludes an elastic section271disposed in the through bore12cand extending in the axial direction A1. In particular, the elastic section271is disposed in the recessed area34of the thru-axle30. More specifically, the elastic section271is disposed in the recessed area34of the first axle part36. As seen inFIG.23, for example, the elastic section271includes an electrical conductor wire271aspirally wound around an elastic main cable271b. The electrical conductor wire271ais further disposed inside a flexible outer sheath271c. In this way, the elastic section271is expandable in the axial direction A1by the elastic main cable271bstretching and the electrical conductor wire271auncoiling in response to movement of the thru-axle30relative to the hub axle12.", "", "Referring now toFIG.24, a third modification of the hub assembly10will now be explained. In this third modification, the electrical cable70is replaced with an electrical cable370. Basically, the electrical cable370includes a first cable section370aand a second cable section370b. The electrical cable370further includes a third cable section370c. The first cable section370aextends from the interior space16of the hub body14through the opening72in the hub axle12and into the through bore12c. The second cable section370bextends in the axial direction A1within the through bore12c. In particular, the second cable section370bextends in the axial direction A1along a section of the axial bore36aalong the first shaft portion31of the first axle part36. The third cable section370cextends between the first cable section370aand the second cable section370b.", "", "The third cable section370chas a first terminal371aand a second terminal371b. The first terminal371aand the second terminal371bare spaced apart in the axial direction A1. The first terminal371aand the second terminal371bare disposed in the recessed area34of the thru-axle30between the outer surface33aof the intermediate shaft portion33and the inner surface12dof the hub axle12that defines the through bore12cin the radial direction R1. Here, the first terminal371aand the second terminal371bare disposed on the inner surface12dof the hub axle12and project into the recessed area34of the thru-axle30. The first cable portion370ais electrically connected to the first terminal371aand the second terminal371b. In particular, the first terminal371aand the second terminal371bare electrically connected to the third cable section370c, which is electrically connected to the first cable portion370a. For example, the first cable portion370aand the third cable section370care formed of a single continuous piece of electrical cable. The thru-axle30includes an outer surface having a first electrode371cand a second electrode371d. Specifically, the first axle part36includes an outer surface having the first electrode371cand the second electrode371dthat are spaced apart in the axial direction A1. More specifically, the first electrode371cand the second electrode371dare annular metal bands. The first electrode371cand the second electrode371dare disposed on the intermediate shaft portion33. The second cable portion370bis electrically connected to the first electrode371cand the second electrode371d. The electrical connector74is electrically connected to an end of the second cable section370bthat is opposite to the first electrode371cand the second electrode371d.", "", "The second electrode371dis spaced from the first electrode371cin the axial direction A1. The first terminal371ais in sliding contact with the first electrode371cand the second terminal371bbeing in sliding contact with the second electrode371dsuch that electrical contact is maintained between the first terminal371aand the first electrode371cand between the second terminal371band the second electrode371din a case where the thru-axle30moves in the axial direction A1.", "", "Referring now toFIGS.25and26, a fourth modification of the hub assembly10will now be explained. In this fourth modification, the casing76and the cylindrical shaped batteries78have been replaced with a casing476and a plurality of flat shaped batteries478. The batteries478are disposed in the casing476, which is located in the interior space16between the hub body14and the hub axle12. Here, in the fourth modification, the casing476is arc-shaped. Also, in the fourth modification, each battery478has a flat shape and an elongated shape in the axial direction A1. The batteries478are electrically connected to together and disposed in the casing476to form a battery pack. The batteries478are electrically connected to the circuit board80by the electrically cable488for controlling the charging of the batteries478and the supply of electricity from the batteries478to an electric component (e.g., the electric rear derailleur RD) that is a separate component from the hub assembly10. This fourth modification can be used with any of the prior modifications.", "", "Referring now toFIG.27, a fifth modification of the hub assembly10will now be explained. In the fifth modification, the cylindrical shaped batteries78have been replaced a plurality of flat shaped batteries578. The batteries578are disposed in the casing76, which is located in the interior space16between the hub body14and the hub axle12. Here, the fifth modification, the batteries578are flat batteries that are laminated in the axial direction A1. The batteries578can be donut shaped or arc-shaped so as to at least partially surround the outer surface12eof the hub axle12in the circumferential direction C1. The batteries578are electrically connected to together and disposed in the casing76to form a battery pack. The batteries578are electrically connected to the circuit board80by the electrically cable88for controlling the charging of the batteries578and the supply of electricity from the batteries578to an electric component (e.g., the electric rear derailleur RD) that is a separate component from the hub assembly10. This fifth modification can be used with any of the first to third modifications.", "", "In understanding the scope of the present invention, the term “comprising” and its derivatives, as used herein, are intended to be open ended terms that specify the presence of the stated features, elements, components, groups, integers, and/or steps, but do not exclude the presence of other unstated features, elements, components, groups, integers and/or steps. The foregoing also applies to words having similar meanings such as the terms, “including”, “having” and their derivatives. Also, the terms “part,” “section,” “portion,” “member” or “element” when used in the singular can have the dual meaning of a single part or a plurality of parts unless otherwise stated.", "", "As used herein, the following directional terms “frame facing side”, “non-frame facing side”, “forward”, “rearward”, “front”, “rear”, “up”, “down”, “above”, “below”, “upward”, “downward”, “top”, “bottom”, “side”, “vertical”, “horizontal”, “perpendicular” and “transverse” as well as any other similar directional terms refer to those directions of a human-powered vehicle (e.g., bicycle) in an upright, riding position and equipped with the hub assembly. Accordingly, these directional terms, as utilized to describe the hub assembly should be interpreted relative to a human-powered vehicle (e.g., bicycle) in an upright riding position on a horizontal surface and that is equipped with the hub assembly. The terms “left” and “right” are used to indicate the “right” when referencing from the right side as viewed from the rear of the human-powered vehicle (e.g., bicycle), and the “left” when referencing from the left side as viewed from the rear of the human-powered vehicle (e.g., bicycle).", "", "The phrase “at least one of” as used in this disclosure means “one or more” of a desired choice. For one example, the phrase “at least one of” as used in this disclosure means “only one single choice” or “both of two choices” if the number of its choices is two. For another example, the phrase “at least one of” as used in this disclosure means “only one single choice” or “any combination of equal to or more than two choices” if the number of its choices is equal to or more than three. Also, the term “and/or” as used in this disclosure means “either one or both of”. For instance, the phrase “at least one of A and B” encompasses (1) A alone, (2), B alone, and (3) both A and B. The phrase “at least one of A, B, and C” encompasses (1) A alone, (2), B alone, (3) C alone, (4) both A and B, (5) both B and C. (6) both A and C, and (7) all A, B, and C. In other words, the phrase “at least one of A and B” does not mean “at least one of A and at least one of B” in this disclosure.", "", "Also, it will be understood that although the terms “first” and “second” may be used herein to describe various components, these components should not be limited by these terms. These terms are only used to distinguish one component from another. Thus, for example, a first component discussed above could be termed a second component and vice versa without departing from the teachings of the present invention.", "", "The term “attached” or “attaching”, as used herein, encompasses configurations in which an element is directly secured to another element by affixing the element directly to the other element; configurations in which the element is indirectly secured to the other element by affixing the element to the intermediate member(s) which in turn are affixed to the other element; and configurations in which one element is integral with another element, i.e. one element is essentially part of the other element. This definition also applies to words of similar meaning, for example, “joined”, “connected”, “coupled”, “mounted”, “bonded”, “fixed” and their derivatives. Finally, terms of degree such as “substantially”, “about” and “approximately” as used herein mean an amount of deviation of the modified term such that the end result is not significantly changed.", "", "While only selected embodiments have been chosen to illustrate the present invention, it will be apparent to those skilled in the art from this disclosure that various changes and modifications can be made herein without departing from the scope of the invention as defined in the appended claims. For example, unless specifically stated otherwise, the size, shape, location or orientation of the various components can be changed as needed and/or desired so long as the changes do not substantially affect their intended function. Unless specifically stated otherwise, components that are shown directly connected or contacting each other can have intermediate structures disposed between them so long as the changes do not substantially affect their intended function. The functions of one element can be performed by two, and vice versa unless specifically stated otherwise. The structures and functions of one embodiment can be adopted in another embodiment. It is not necessary for all advantages to be present in a particular embodiment at the same time. Every feature which is unique from the prior art, alone or in combination with other features, also should be considered a separate description of further inventions by the applicant, including the structural and/or functional concepts embodied by such feature(s). Thus, the foregoing descriptions of the embodiments according to the present invention are provided for illustration only, and not for the purpose of limiting the invention as defined by the appended claims and their equivalents."], "claims": ["a hub axle having a through bore and a center axis defining an axial direction and a radial direction; a hub body rotatably disposed around the center axis and having an interior space defined between the hub body and the hub axle in the radial direction; a thru-axle configured to be disposed in the through bore of the hub axle; and an electrical cable including a first cable section extending from the interior space of the hub body through an opening in the hub axle and into the through bore, the electrical cable including a second cable section extending in the axial direction within the through bore, the electrical cable including an axially expandable cable section between the first cable section and the second cable section, the axially expandable cable section extending in the axial direction within the through bore, and being expandable in the axial direction in response to movement of the thru-axle relative to the hub axle.", "the axially expandable cable section includes a coiled section spirally wrapped around the thru-axle.", "the axially expandable cable section includes an undulating section disposed in the through bore and extending in the axial direction.", "the undulating section includes a flexible flat electrical cable.", "the axially expandable cable section includes an elastic section disposed in the through bore and extending in the axial direction.", "the elastic section includes an electrical conductor wire spirally wound around an elastic main cable and disposed inside a flexible outer sheath.", "the thru-axle includes a first shaft portion, a second shaft portion and an intermediate shaft portion disposed between the first shaft portion and the second shaft portion, the intermediate shaft portion has a radial width that is smaller than a radial width of the first shaft portion and a radial width of the second shaft portion to define recessed area of the thru-axle, and the axially expandable cable section is disposed in the recessed area of the thru-axle between an outer surface of the intermediate shaft portion and an inner surface of the hub axle in the radial direction.", "the axially expandable cable section includes a coiled section spirally wrapped around the intermediate shaft portion.", "the axially expandable cable section includes an undulating section disposed in the recessed area of the thru-axle.", "the undulating section includes a flexible flat electrical cable.", "the axially expandable cable section includes an elastic section disposed in the recessed area of the thru-axle.", "the elastic section includes an electrical conductor wire spirally wound around an elastic main cable and disposed inside a flexible outer sheath.", "an electrical connector coupled to an axial end of the thru-axle, and the electrical connector being electrically connected to an end of the second cable section that is opposite to the axially expandable cable section.", "the electrical connector is at least partly disposed in a connector hole of the axial end of the thru-axle.", "the electrical connector includes at least one electrical pin that partly projects from the axial end of the thru-axle.", "the at least one electrical pin is configured to be rotatably disposed in a connector hole such that relative rotation between the at least one electrical pin and the first axle part is permitted.", "a hub axle having a through bore and a center axis defining an axial direction and a radial direction; a hub body rotatably disposed around the center axis and having an interior space defined between the hub body and the hub axle in the radial direction; a thru-axle configured to be axially disposed in the through bore of the hub axle; and an electrical cable including a first cable section extending from the interior space of the hub body through an opening in the hub axle and into the through bore, the electrical cable including a second cable section extending in the axial direction within the through bore, the electrical cable including a third cable section having a first terminal and a second terminal spaced apart that are spaced the first terminal in the axial direction, the thru-axle including an outer surface having a first electrode and a second electrode spaced from the first electrode in the axial direction, the first terminal being in sliding contact with the first electrode and the second terminal being in sliding contact with the second electrode such that electrical contact is maintained between the first terminal and the first electrode and between the second terminal and the second electrode in a case where the thru-axle moves in the axial direction.", "the thru-axle includes a first shaft portion, a second shaft portion and an intermediate shaft portion disposed between the first shaft portion and the second shaft portion, the intermediate shaft portion has a radial width that is smaller than a radial width of the first shaft portion and a radial width of the second shaft portion to define recessed area of the thru-axle, the first electrode and the second electrode are disposed on the intermediate shaft portion, and the first terminal and the second terminal are disposed in the recessed area of the thru-axle between an outer surface of the intermediate shaft portion and an inner surface of the hub axle that defines the through bore in the radial direction.", "an electrical connector coupled to an axial end of the thru-axle, and the electrical connector being electrically connected to an end of the second cable section that is opposite to the first electrode and the second electrode.", "the electrical connector is at least partly disposed in a connector hole of the axial end of the thru-axle.", "the electrical connector includes at least one electrical pin that partly projects from the axial end of the thru-axle.", "the at least one electrical pin is configured to be rotatably disposed in the connector hole such that relative rotation between the at least one electrical pin and the first axle part is permitted."], "bibtex": "@patent{20240351372,\n    title = {HUB ASSEMBLY FOR HUMAN POWERED VEHICLE},\n    number = {20240351372},\n    year = {2024},\n    note = {File: US20240351372A1-20241024.XML}\n    }", "classification": "B60B2702FI"}, {"title": "HUB ASSEMBLY FOR HUMAN POWERED VEHICLE, AND THRU-AXLE FOR HUB ASSEMBLY", "doc_number": "20240351373", "filename": "US20240351373A1-20241024.XML", "abstract": "A hub assembly is provided for a human powered vehicle. The hub assembly basically includes a hub axle, a hub body, a thru-axle and an electrical cable. The hub axle has a through bore extending between a first axial end and a second axial end. The hub body is rotatably disposed around a center axis of the hub axle. The thru-axle is configured to be disposed in the through bore of the hub axle. The thru-axle includes a first axle part and a second axle part. The second axle part is detachably coupled to the first axle part in the axial direction. The electrical cable extends from an interior space of the hub body through an opening in the hub axle and into the through bore. The electrical cable extends in the axial direction along a section of the first axle part.", "detailed_description": ["Selected embodiments will now be explained with reference to the drawings. It will be apparent to those skilled in the human-powered vehicle field (e.g., the bicycle field) from this disclosure that the following descriptions of the embodiments are provided for illustration only and not for the purpose of limiting the invention as defined by the appended claims and their equivalents.", "", "Referring initially toFIG.1, a hub assembly10is provided for a human powered vehicle V (i.e., a bicycle) in accordance with a first illustrated embodiment. Here, in the first embodiment, the hub assembly10is a bicycle rear hub assembly. The hub assembly10can be used with other human-powered vehicles as needed and/or desired. The hub assembly10is configured to be removably mounted to the human-powered vehicle V as discussed below.", "", "Here, the human-powered vehicle V is an electric assist bicycle (E-bike). Alternatively, the human-powered vehicle V can be a road bicycle, a city bike, a cargo bike, and a recumbent bike, or another type of off-road bicycle such as a cyclocross bicycle. The number of wheels on the human-powered vehicle V is not limited. The human-powered vehicle V includes, for example, a monocycle and a vehicle having three or more wheels. Here, the human-powered vehicle V is a bicycle that at least partially uses human power as a driving power for traveling and includes an electric drive unit assisting the human power. In particular, a vehicle using solely an internal combustion engine as driving power is not included in the human-powered vehicle of this disclosure.", "", "As seen inFIG.1, the human-powered vehicle V includes a vehicle body VB that is supported by a rear wheel RW and a front wheel FW. The vehicle body VB basically includes a front frame body FB and a rear frame body RB (a swing arm). The vehicle body VB is also provided with a handlebar H and a front fork FF for steering the front wheel FW. The rear frame body RB is swingably mounted to a rear section of the front frame body FB such that the rear frame body RB can pivot with respect to the front frame body FB. The rear wheel RW is mounted to a rear end of the rear frame body RB. A rear shock absorber RS is operatively disposed between the front frame body FB and rear frame body RB. The rear shock absorber RS is provided between the front frame body FB and the rear frame body RB to control the movement of the rear frame body RB with respect to the front frame body FB. Namely, the rear shock absorber RS absorbs shock transmitted from the rear wheel RW. The rear wheel RW is rotatably mounted to the rear frame body RB. The front wheel FW is mounted to the front frame body FB via the front fork FF. Namely, the front wheel FW is mounted to a lower end of the front fork FF. A height adjustable seatpost ASP is mounted to a seat tube of the front frame body FB in a conventional manner and supports a bicycle seat or saddle S in any suitable manner. The front fork FF is pivotally mounted to a head tube of the front frame body FB. The handlebar H is mounted to an upper end of a steering column steerer tube of the front fork FF. The front fork FF absorbs shock transmitted from the front wheel FW. Preferably, the rear shock absorber RS and the front fork FF are electrically adjustable suspensions. For example, the stiffness and/or stoke length of the rear shock absorber RS and the front fork FF can be adjusted.", "", "The human-powered vehicle V further includes a drivetrain DT and an electric drive unit DU that is operatively coupled to the drivetrain DT. Here, for example, the drivetrain DT is a chain-drive type that includes a crank C, a front sprocket FS, a plurality of rear sprockets CS and a chain CN. The crank C includes a crank axle CA1and a pair of crank arms CA2. The crank axle CA1is rotatably supported to the front frame body FB via the electric drive unit DU. The crank arms CA2are provided on opposite ends of the crank axle CA1. A pedal PD is rotatably coupled to the distal end of each of the crank arms CA2. The drivetrain DT can be selected from any type, and can be a belt-drive type or a shaft-drive type.", "", "The electric drive unit DU has an electric motor that provides a drive assist force to the front sprocket FS. The electric drive unit DU can be actuated to assist in the propulsion of the human-powered vehicle V in a conventional manner. The electric drive unit DU is actuated, for example, in accordance with a human driving force applied to the pedals PD. The electric drive unit DU is actuated by electric power supplied from a main battery pack BP that is mounted on a downtube of the human-powered vehicle V. The main battery pack BP can provide electrical power to other vehicle components such as the electric rear derailleur RD, the height adjustable seatpost ASP, the rear shock absorber RS, the front fork FF and any other vehicle component that uses electrical power.", "", "The human-powered vehicle V further includes a cycle computer SC. Here, the cycle computer SC is mounted to the front frame body FB. Alternatively, the cycle computer SC can be provided on the handlebar H. The cycle computer SC notifies the rider of various traveling and/or operating conditions of the human-powered vehicle V. The cycle computer SC can also include various control programs for automatically controlling one or more vehicle components. For example, the cycle computer SC can be provided with an automatic shifting program for changing gears of the electric rear derailleur RD based on one or more traveling and/or operating conditions of the human-powered vehicle V.", "", "Here, the human-powered vehicle V further includes an electric rear derailleur RD that is attached to the rear frame body RB for shifting the chain CN between the rear sprockets CS. The electric rear derailleur RD is one type of gear changing device. Here, the electric rear derailleur RD is an electric derailleur (i.e., an electric gear changing device or an electric transmission device). Here, the electric rear derailleur RD is provided on the rear side of the rear frame body RB near the hub assembly10. The electric rear derailleur RD can be operated when a rider of the human-powered vehicle V manually operates a gear shift operating device or shifter SL. The electric rear derailleur RD can also be automatically operated based on traveling conditions and/or operating conditions of the human-powered vehicle V. The human-powered vehicle V can further include a plurality of electronic components.", "", "As seen inFIGS.2and3, the hub assembly10is support on the rear end of the rear frame body RB. The hub assembly10supports the rear sprockets CS for operatively coupling the hub assembly10to the chain CN. The hub assembly10is electrically coupled to the electric rear derailleur RD by an electrical cable EC. As explained below, the hub assembly10is configured to supply electrical power to the electric rear derailleur RD. Moreover, as explained below, the hub assembly10is configured to receive electrical power via the electric rear derailleur RD. In particular, as seen inFIG.3, the electric rear derailleur RD has a charging port CP for receiving a charging cable of a charging device. Thus, a human powered vehicle assembly11comprises the hub assembly10and an electric component. Here, the human powered vehicle assembly11comprises the electric rear derailleur RD as the electric component. Alternatively, the electric component of the human powered vehicle assembly11can be another electrical component of the human-powered vehicle V as needed and/or desired.", "", "The structure of the hub assembly10will now be described with particular reference toFIGS.3to6. The hub assembly10basically comprises a hub axle12and a hub body14. The hub axle12has a center axis O1. The center axis O1defines an axial direction A1and a radial direction R1. The center axis O1further defines a circumferential direction C1. The hub axle12is configured to be non-rotatably attached to the rear frame body RB of the vehicle body VB. The hub body14is rotatably disposed around the center axis O1. In other words, the hub body14is rotatably mounted around the hub axle12. The hub body14has an interior space16. The interior space16is defined between the hub body14and the hub axle12in the radial direction R1. Thus, in the first embodiment, the interior space16is an annular space.", "", "As seen inFIGS.5and6, the hub axle12is a rigid member made of a suitable material such as a metallic material. The hub axle12is preferably made of several pieces that are coupled together. However, the hub axle12can be a one-piece member in certain situations if needed and/or desired. Here, the hub axle12is a tubular member. The hub axle12has a first axial end12aand a second axial end12b. The hub axle12has a through bore12c. The through bore12cextends between the first axial end12aand the second axial end12b. In this first embodiment, a first end piece18is provided to the first axial end12a(right side inFIGS.5and6) of the hub axle12, and a second end piece20is provided to the second axial end12b(left side inFIGS.5and6) of the hub axle12. Here, the first end piece18is frictionally fitted onto the first axial end12aof the hub axle12, and the second end piece20is threadedly mounted to the second axial end12bof the hub axle12.", "", "As indicated inFIGS.2, the hub body14is rotatably mounted around the hub axle12to rotate in a driving rotational direction D1. The driving rotational direction D1corresponds to a forward driving direction of the rear wheel RW. The hub body14is configured to support the rear wheel RW in a conventional manner. More specifically, in the first embodiment, the hub body14includes a first spoke attachment structure14aand a second spoke attachment structure14b. The first spoke attachment structure14ais spaced from the second spoke attachment structure14bin the axial direction A1. The first spoke attachment structure14ais a first annular flange that extend radially outward with respect to the center axis O1. The second spoke attachment structure14bis a second annular flange that extend radially outward with respect to the center axis O1. The first spoke attachment structure14aincludes a plurality of first spoke openings, and the second spoke attachment structure14bincludes a plurality of second spoke openings. The first spoke attachment structure14aand the second spoke attachment structure14bare configured to receive a plurality of spokes (FIG.1) for attaching a rim (FIG.1) of the rear wheel RW to the hub body14in a conventional manner. In this way, the hub body14and the rear wheel RW are coupled to rotate together about the central axis O1.", "", "As mentioned above, the hub body14is rotatably disposed around the hub axle12to rotate around the center axis O1. In particular, as seen inFIGS.5and6, the hub body14is rotatably supported on the hub axle12by a first hub body bearing21and a second hub body bearing22. The first hub body bearing21rotatably supports one end of the hub body14with respect to the center axis O1. The second hub body bearing22rotatably supports the other end of the hub body14with respect to the center axis O1.", "", "The first hub body bearing21includes a first inner race21a, a first outer race21band a plurality of first roller elements21c. The first roller elements21care disposed between the first inner race21aand the first outer race21b. The second hub body bearing22includes a second inner race22a, a second outer race22band a plurality of second roller elements22c. The second roller elements22care disposed between the second inner race22aand the second outer race22b. Here, the first hub body bearing21and the second hub body bearing22are angular contact bearings. Alternatively, both the first hub body bearing21and the second hub body bearing22can be radial bearings. Also, alternatively, one of the first hub body bearing21and the second hub body bearing22can be an angular contact bearing, and the other one of the first hub body bearing21and the second hub body bearing22can be a radial bearing.", "", "Angular contact bearings have inner and outer ring raceways that are displaced relative to each other in the direction of the bearing axis. In other words, angular contact bearings are designed to accommodate combined loads, i.e., simultaneously acting radial and axial loads. Angular contact bearings can have a plurality of ball bearings or a plurality of tapered rollers as the roller elements. Radial bearings support force in the direction perpendicular to the axis. Further, a radial roller bearing can be adopted instead of the angular contact roller bearings. Radial bearings can have a plurality of ball bearings or a plurality of cylindrical rollers as the roller elements.", "", "Referring toFIG.4, the hub assembly10further comprises a sprocket support body24. The sprocket support body24is a rigid member made of a suitable material such as a metallic material. The center axis of the sprocket support body24is disposed concentrically with the center axis O1. The sprocket support body24is rotatably disposed around the hub axle12to rotate around the center axis O1. In particular, the sprocket support body24is rotatably supported around the hub axle12by a first sprocket support bearing25and a second sprocket support bearing26. As illustrated inFIG.3, the sprocket support body24is configured to support the plurality of sprockets CS. The sprocket support body24is configured to non-rotatably support the sprockets CS. Here, the sprocket support body24has a plurality of external splines24athat are configured to engage the sprockets CS. In this way, the sprockets CS are non-rotatably coupled to the sprocket support body24. The external splines24aform a sprocket attachment structure of the hub assembly10. However, the sprocket support body24is not limited to the illustrated embodiment. Alternatively, one or more of the rear sprockets CS can be integrally formed with the sprocket support body24. Basically, the sprocket support body24is configured to rotate around the center axis O1to transmit a driving force to the hub body14while rotating in the driving rotational direction D1around the center axis O1. However, the sprocket support body24does not transmit a driving force to the hub body14while rotating in a non-driving rotational direction D2around the center axis O1. The non-driving rotational direction D2is opposite to the driving rotational direction D2with respect to the center axis O1. In any case, the sprocket support body24and the sprockets CS are coupled together to rotate together in both the driving rotational direction D1and the non-driving rotational direction D2.", "", "Referring toFIGS.5and6, the first sprocket support bearing25and the second sprocket support bearing26are axially spaced apart along the hub axle12. The first sprocket support bearing25rotatably supports a first end of the sprocket support body24. The second sprocket support bearing26rotatably supports a second end of the sprocket support body24. The first sprocket support bearing25includes a first inner race25a, a first outer race25band a plurality of first roller elements25c. The first roller elements25care disposed between the first inner race25aand the first outer race25b. The second sprocket support bearing26includes a second inner race26a, a second outer race26band a plurality of second roller elements26c. The second roller elements26care disposed between the second inner race26aand the second outer race26b. Here, the first sprocket support bearing25and the second sprocket support bearing26are radial ball bearings. Alternatively, both the first sprocket support bearing25and the second sprocket support bearing26can be angular contact bearings. Also, alternatively, one the first sprocket support bearing25and the second sprocket support bearing26can be an angular contact bearing, and the other one of the first sprocket support bearing25and the second sprocket support bearing26can be a radial bearing.", "", "In the illustrated embodiment, as seen inFIGS.5and6, the rear hub10further comprises a torque transmitting mechanism28disposed between the hub body14and the sprocket support body24to transmit a rotational force to the hub body14from the sprocket support body24. The torque transmitting mechanism28forms a one-way clutch such that torque is transferred from the sprocket support body24to the hub body14in one direction. In this way, the rotational force imparted to the sprocket support body24from the rear sprockets CS during pedaling in the driving rotational direction is transmitted to hub body14. During coasting, the sprocket support body24can be stationary and the hub body14can rotate in the driving rotational direction. Torque transmitting mechanisms such as the torque transmitting mechanism28are well known in the human-powered vehicle field (e.g., the bicycle field). Thus, the torque transmitting mechanism28will not be described in further detail.", "", "Referring now toFIGS.4and5, the hub assembly10further comprises a thru-axle30. The thru-axle30is a rigid member made of a suitable material such as a metallic material. The thru-axle30is configured to be non-rotatably attached to the rear frame body RB of the vehicle body VB. The thru-axle30is configured to be disposed in the through bore12cof the hub axle12. When the thru-axle30is fixed to the rear frame body RB of the vehicle body VB, the hub axle12is also non-rotatably is fixed to the rear frame body RB of the vehicle body VB. More specifically, when the thru-axle30is fixed to the rear frame body RB of the vehicle body VB, the rear frame body RB of the vehicle body VB is squeezed against the first end piece18and the second end piece20to prevent the hub axle12from rotating relative to the thru-axle30and the rear frame body RB.", "", "Basically, as seen inFIGS.7to13, the thru-axle30includes a first shaft portion31, a second shaft portion32and an intermediate shaft portion33. The intermediate shaft portion33is disposed between the first shaft portion31and the second shaft portion32. Referring toFIG.12, the first shaft portion31has a radial width W1in the radial direction R1with respect to the center axis O1. The radial width W1can also be referred to a first radial width W1of the thru-axle30. The second shaft portion32has a radial width W2in the radial direction R1with respect to the center axis O1. The radial width W2can also be referred to a second radial width W2of the thru-axle30. The intermediate shaft portion33has a radial width W3that is smaller than the radial width W1of the first shaft portion31and the radial width W2of the second shaft portion32to define a recessed area34of the thru-axle30. The radial width W3can also be referred to a third radial width W3of the thru-axle30.", "", "In the first embodiment, as seen inFIGS.7to9, the thru-axle30comprises a first axle part36, and a second axle part38. As discussed below, the second axle part38is detachably coupled to the first axle part36in the axial direction A1. The first axle part36includes the first shaft portion31, the second shaft portion32and the intermediate shaft portion33. The first axle part36includes an axial bore36a. The axial bore36aextends at least axially through the first shaft portion31, the second shaft portion32and the intermediate shaft portion33. Here, the axial bore36aextends axially through the first shaft portion31. The first axle part36has a first axle length L1. The second axle part38has a second axle length L2. The first axle length L1is larger than the second axle length L2.", "", "Here, the first axle part36has a first attachment end portion40and a first connection end portion42. The first attachment end portion40includes an external thread40athat is configured to threadedly engage an internal thread of a fixing nut, or a fork or a frame. Here, the external thread40aof the first attachment end portion40of the first axle part36is threadedly engaged with an internal thread of the rear frame body RB. The first connection end portion42is configured to be detachably coupled to the second axle part38. In the first embodiment, the first axle part36is made of two pieces. In particular, the first connection end portion42is detachably coupled from a reminder of the first axle part36. More specifically, as discussed below, the first axle part36has an external thread40bthat is configured to threadedly engage an internal thread42aof the first connection end portion42.", "", "The second axle part38has a second attachment end portion44and a second connection end portion46. The thru-axle30further comprises a frame attachment structure50. The frame attachment structure50is coupled to the second attachment end portion44of the second axle part38. In this way, the frame attachment structure50couples the second attachment end portion44of the second axle part38to the rear frame body RB. On the other hand, the second connection end portion46of the second axle part38is detachably coupled to the first connection end portion42of the first axle part36. In particular, the second connection end portion46of the second axle part38is detachably coupled to the first connection end portion42of the first axle part36by a twist-lock connection52. Basically, the twist-lock connection52includes a male connector54and a female receptacle56. The male connector54is provided to one of the first connection end portion42and the second connection end portion46of the second axle part38. The female receptacle56is provided to the other of the first connection end portion42of the first axle part36and the second connection end portion46of the second axle part38. More specifically, here, the first connection end portion42includes the female receptacle56, and the second connection end portion46includes the male connector54.", "", "As seen inFIG.14, the male connector54includes a shaft portion54ahaving a protrusion54bextending from the shaft portion54ain the radial direction R1. The rod portion54aextends along the center axis O1in the assembled state. Here, the protrusion54bincludes a pair of diametrically disposed abutments that project radially from the rod portion54awith respect to the center axis O1in the assembled state.", "", "As seen inFIGS.15and16, the female receptacle56includes an insertion section56a, a retaining section56b, and an abutment surface56c. The abutment surface56cis disposed between the insertion section insertion section56aand the retaining section56b. Here, the insertion section56aincludes an opening56althat is configured to receive the male connector54therethrough while the male connector54is in a first orientation. The retaining section56bis a tubular portion that extends from the insertion section56ato define an internal space. The retaining section56bincludes a pair of stops56b1and56b2. The shaft portion54aand the protrusion54bare configured to slide in the axial direction A1through the insertion section56aand are twisted in the retaining section56bto engage the protrusion54bwith the abutment surface56c. Thus, the abutment surface56ccontacts the protrusion54bto prevent axial separation of the second axle part38from the first axle part36while the male connector54is in a second orientation in which the male connector54has been twisted about the center axis O1so that the protrusion54bcontact the stops56b1and56b2. Thus, the first orientation of the male connector54is established by aligning the protrusion54bwith the opening56also that the male connector54can slide in the axial direction A1through the insertion section56a. The second orientation of the male connector54is established by twisting the male connector54so that the protrusion54bcontact the stops56b1and56b2and the protrusion54bengage the abutment surface56c.", "", "Referring toFIGS.12to14, the frame attachment structure50includes a control lever60, a cam62and a cam follower64. The cam62is configured to be pivoted by the control lever60. The cam follower64is configured to move in the axial direction A1in response to operation of the control lever60. The cam follower64is integrally formed with the second attachment end portion44of the second axle part38. Here, the control lever60is pivotally coupled to the cam follower64by the cam62for moving a frame engagement cap36ewith respect to the attachment bolt36bin an axial direction of the attachment bolt36b. Thus, by pivoting the control lever60between a first (open) position to a second (closed) position, the control lever60pivots the cam62to change the distance between a frame engagement cap66and the second end piece20. In this way, the frame attachment structure50attaches the hub axle12and the thru-axle30to the rear frame body RB of the vehicle body VB.", "", "Referring toFIGS.17,19and20, the hub assembly10further comprises an electrical power storage device68. At least a portion of the electrical power storage device68is axially disposed between the first spoke attachment structure14aand the second spoke attachment structure14b. Here, the electrical power storage device68is entirely disposed with respect to the axial direction A1between the first spoke attachment structure14aand the second spoke attachment structure14b.", "", "The electrical power storage device68is configured to supply electricity to an electric component. Specifically, in the first embodiment, the electrical power storage device68is configured to supply electricity to an electric component that is different from the hub assembly10. The electrical power storage device68is configured to receive electricity from the electric component. In the first embodiment, the electric component corresponds to the electric rear derailleur RD. However, the electric component can be a different component of the human-powered vehicle V (e.g., bicycle).", "", "The hub assembly10further comprises an electrical cable70. The electrical cable70is electrically connected to the electrical power storage device68and an electric component (e.g., the electric rear derailleur RD). In this way, the electrical power storage device68is configured to supply electricity to an electric component (e.g., the electric rear derailleur RD) via the electrical cable70. Also, the electrical power storage device68is configured to receive electricity from an electric component (e.g., the electric rear derailleur RD) via the electrical cable70. In the first embodiment, the electrical power storage device68supplies electricity to the electric rear derailleur RD via the electrical cable70, and receives electricity from the electric rear derailleur RD via the electrical cable70.", "", "Basically, the electrical cable70extends from the interior space16of the hub body14through an opening72in the hub axle12and into the through bore12c. The electrical cable70is partly disposed in the recessed area34of the first axle part36between an outer surface33aof the intermediate shaft portion33and an inner surface12dof the hub axle12that defines the through bore12c. In particular, the electrical cable70includes a first cable section70aextending from the interior space16of the hub body14through the opening72in the hub axle12and into the through bore12c. The electrical cable70includes a second cable section70bextending in the axial direction A1within the through bore12c. In particular, the second cable section70bof the electrical cable70extends in the axial direction A1along a section of the first axle part36. In particular, the second cable section70bof the electrical cable70through a section of the axial bore36aalong the first shaft portion31of the first axle part36.", "", "The electrical cable70includes an axially expandable cable section70cbetween the first cable section70aand the second cable section70b. The axially expandable cable section70cextends in the axial direction A1within the through bore12c. The axially expandable cable section70cis expandable in the axial direction A1in response to movement of the thru-axle30relative to the hub axle12.", "", "In this embodiment, as seen inFIG.17, the axially expandable cable section70cincludes a coiled section71spirally wrapped around the thru-axle30. In particular, the coiled section71is spirally wrapped around the intermediate shaft portion33. Thus, the axially expandable cable section70cis disposed in the recessed area34of the thru-axle30between the outer surface33aof the intermediate shaft portion33and the inner surface12dof the hub axle12in the radial direction R1. The coiled section71is expandable in the axial direction A1by the coiled section71being uncoiled or coiled in response to movement of the thru-axle30relative to the hub axle12.", "", "As seen inFIG.18, the hub assembly10further comprises an electrical connector74. The electrical connector74is coupled to an axial end of the thru-axle30. Specifically, the electrical connector74is coupled to an axial end of the first axle part36. The axial end of the first axle part36is opposite to the second axle part38. Thus, in the first embodiment, the electrical connector74is coupled to the first attachment end portion40of the first axle part36. The electrical connector74is at least partly disposed in a connector hole40bof the axial end of the thru-axle30. More specifically, the electrical connector74is at least partly disposed in the connector hole40bof the axial end of the first axle part36. The electrical connector74includes at least one electrical pin74a. The at least one electrical pin74apartly projects from the axial end of the thru-axle30. Specifically, the at least one electrical pin74apartly projecting from the axial end of the first axle part36. The at least one electrical pin74ais configured to be rotatably disposed in the connector hole40bsuch that relative rotation between the at least one electrical pin74aand the first axle part36is permitted. The electrical connector74is electrically connected to the electrical cable70. In particular, the electrical connector74is electrically connected to an end of the second cable section70bthat is opposite to the axially expandable cable section70c.", "", "Referring toFIGS.6and17, the electrical power storage device68will now be discussed in further detail. The electrical power storage device68is disposed radially outward of an outer surface12eof the hub axle12. In particular, the electrical power storage device68is disposed in the interior space16. Also, in the first embodiment, the electrical power storage device68is disposed axially inward of the sprocket attachment structure (e.g., the external splines24aof the sprocket support body24). In particular, the electrical power storage device68is disposed axially inward of the first axial end12aof the hub axle12and the second axial end12bof the hub axle12. Preferably, the electrical power storage device68surrounds at least half of the outer surface of the hub axle12in the circumferential direction C1. In the first embodiment, the electrical power storage device68surrounds the outer surface12eof the hub axle12in the circumferential direction C1.", "", "Preferably, at least a portion of the electrical power storage device68axially overlaps the hub body14. More preferably, an entire axial length of the electrical power storage device68axially overlaps the hub body14. At least a portion of the electrical power storage device68is axially disposed between the first spoke attachment structure14aand the second spoke attachment structure14b. In the first embodiment, an entire axial length of the electrical power storage device68is disposed between the first spoke attachment structure14aand the second spoke attachment structure14bin the axial direction A1.", "", "The electrical power storage device68includes a casing76. The electrical power storage device68further includes at least one battery78. The at least one battery78is disposed in the casing76. The electrical power storage device68surrounds the outer surface12eof the hub axle12in the circumferential direction C1. Thus, here, the casing76is at least partly arc shaped and surrounds the outer surface12eof the hub axle12in the circumferential direction C1. Moreover, the battery78surrounds the outer surface12eof the hub axle12in the circumferential direction C1. In the first embodiment, the electrical power storage device68includes a plurality of batteries78disposed to surround the hub axle12in the circumferential direction C1. The batteries78are cylindrical shaped members that are elongated in the axial direction A1. The batteries78are disposed circumferentially around the outer surface12eof the hub axle12in the circumferential direction C1. Here, the batteries78are rechargeable batteries.", "", "As diagrammatically illustrated inFIG.20, the electrical power storage device68further includes a circuit board80having an electronic controller82, a power control circuit84and a wireless communication circuit86. The circuit board80is electrically connected to the batteries78by an electrical cable88for receiving electric power from the batteries78and supplying electric power to the batteries78. Thus, the batteries78supply electric power to the electronic controller82, the power control circuit84and the wireless communication circuit86. Here, the circuit board80having the electronic controller82, the power control circuit84and the wireless communication circuit86are provided in a casing90. Alternatively, the circuit board80having the electronic controller82, the power control circuit84and the wireless communication circuit86can be provided in the casing76.", "", "For example, in the first embodiment, the electronic controller82, the power control circuit84and the wireless communication circuit86are provided on a common circuit board (i.e., the circuit board80) containing any number of integrated circuit or circuits for completing the activities described herein. Also, while the controller82is illustrated as being a single unit located on the circuit board80, the electrical power storage device68is not limited to this configuration. Rather, the electrical power storage device68can be provided with a plurality of circuit board80and/or a plurality of controllers that are provided at various locations.", "", "The electronic controller82is configured to control the power control circuit84and the wireless communication circuit86. The electronic controller82includes at least one processor that executes predetermined control programs. The at least one processor can be, for example, a central processing unit (CPU) or a micro processing unit (MPU). The electronic controller82also preferably includes a data storage device (memory) for storing various control programs and information used for various control processes. The data storage device (memory) is any computer storage device or any computer readable medium with the sole exception of a transitory propagating signal. For example, the memory device can be nonvolatile memory and volatile memory, and can includes a ROM (Read Only Memory) device, a RAM (Random Access Memory) device, a hard disk, a flash drive, etc. The term “electronic controller” as used herein refers to hardware that executes a software program, and does not include a human being.", "", "The power control circuit84is configured to control the charging of the batteries78and the supply of electric power from the batteries78where the electric power delivered via the electrical cable70. On the other hand, the wireless communication circuit86configured to control the charging of the batteries78and the supply of electric power from the batteries78where the electric power delivered wirelessly. Thus, the electrical power storage device68is configured to wirelessly supply electricity to an electric component. The electrical power storage device68is configured to wirelessly receive electricity from the electric component. Here, for example, the wireless communication circuit86includes at least a non-contact charging coil for carrying out magnetic resonance to transfer electric power to and from the batteries78. Alternatively, the wireless communication circuit86can be configured to carry out Near-Field Communication (NFC). The term “NFC” as used herein refers to short-range wireless communication that achieves communication by electromagnetic induction to transfer electric power to and from the batteries78. Preferably, an AC/DC converter92is disposed between the wireless communication circuit86and the batteries78. The AC/DC converter92is provided on the circuit board80. The AC/DC converter92converts the alternating current outputted by the wireless communication circuit86to direct current that is received by the batteries78. In this way, the direct current outputted by the AC/DC converter92is used to recharge the batteries78.", "", "Referring now toFIG.21, a first modification of the hub assembly10will now be explained. In this first modification, the electrical cable70is replaced with an electrical cable170. Basically, the electrical cable170includes a first cable section170a, a second cable section170band an axially expandable cable section170c. The first cable section170aextends from the interior space16of the hub body14through the opening72in the hub axle12and into the through bore12c. The second cable section170bextends in the axial direction A1within the through bore12c. In particular, the second cable section170bextends in the axial direction A1along a section of the axial bore36aalong the first shaft portion31of the first axle part36. The electrical connector74is electrically connected to an end of the second cable section170bthat is opposite to the axially expandable cable section170c. The axially expandable cable section170cextends between the first cable section170aand the second cable section170b.", "", "In the first modification, the axially expandable cable section170cincludes an undulating section171that is disposed in the through bore12cand extends in the axial direction A1. In particular, the undulating section171is disposed in the recessed area34of the first axle part36. Here, for example, the undulating section171includes a flexible flat electrical cable. The undulating section171is expandable in the axial direction A1by unfolding in response to movement of the thru-axle30relative to the hub axle12.", "", "Referring now toFIGS.22and23, a second modification of the hub assembly10will now be explained. In this second modification, the electrical cable70is replaced with an electrical cable270. Basically, the electrical cable270includes a first cable section270a, a second cable section270band an axially expandable cable section270c. The first cable section270aextends from the interior space16of the hub body14through the opening72in the hub axle12and into the through bore12c. The second cable section270bextends in the axial direction A1within the through bore12c. In particular, the second cable section270bextends in the axial direction A1along a section of the axial bore36aalong the first shaft portion31of the first axle part36. The electrical connector74is electrically connected to an end of the second cable section270bthat is opposite to the axially expandable cable section270c. The axially expandable cable section270cextends between the first cable section270aand the second cable section270b.", "", "As seen inFIG.22, the axially expandable cable section270cincludes an clastic section271disposed in the through bore12cand extending in the axial direction A1. In particular, the elastic section271is disposed in the recessed area34of the thru-axle30. More specifically, the elastic section271is disposed in the recessed area34of the first axle part36. As seen inFIG.23, for example, the elastic section271includes an electrical conductor wire271aspirally wound around an elastic main cable271b. The electrical conductor wire271ais further disposed inside a flexible outer sheath271c. In this way, the elastic section271is expandable in the axial direction A1by the elastic main cable271bstretching and the electrical conductor wire271auncoiling in response to movement of the thru-axle30relative to the hub axle12.", "", "Referring now toFIG.24, a third modification of the hub assembly10will now be explained. In this third modification, the electrical cable70is replaced with an electrical cable370. Basically, the electrical cable370includes a first cable section370aand a second cable section370b. The electrical cable370further includes a third cable section370c. The first cable section370aextends from the interior space16of the hub body14through the opening72in the hub axle12and into the through bore12c. The second cable section370bextends in the axial direction A1within the through bore12c. In particular, the second cable section370bextends in the axial direction A1along a section of the axial bore36aalong the first shaft portion31of the first axle part36. The third cable section370cextends between the first cable section370aand the second cable section370b.", "", "The third cable section370chas a first terminal371aand a second terminal371b. The first terminal371aand the second terminal371bare spaced apart in the axial direction A1. The first terminal371aand the second terminal371bare disposed in the recessed area34of the thru-axle30between the outer surface33aof the intermediate shaft portion33and the inner surface12dof the hub axle12that defines the through bore12cin the radial direction R1. Here, the first terminal371aand the second terminal371bare disposed on the inner surface12dof the hub axle12and project into the recessed area34of the thru-axle30. The first cable portion370ais electrically connected to the first terminal371aand the second terminal371b. In particular, the first terminal371aand the second terminal371bare electrically connected to the third cable section370c, which is electrically connected to the first cable portion370a. For example, the first cable portion370aand the third cable section370care formed of a single continuous piece of electrical cable. The thru-axle30includes an outer surface having a first electrode371cand a second electrode371d. Specifically, the first axle part36includes an outer surface having the first electrode371cand the second electrode371dthat are spaced apart in the axial direction A1. More specifically, the first electrode371cand the second electrode371dare annular metal bands. The first electrode371cand the second electrode371dare disposed on the intermediate shaft portion33. The second cable portion370bis electrically connected to the first electrode371cand the second electrode371d. The electrical connector74is electrically connected to an end of the second cable section370bthat is opposite to the first electrode371cand the second electrode371d.", "", "The second electrode371dis spaced from the first electrode371cin the axial direction A1. The first terminal371ais in sliding contact with the first electrode371cand the second terminal371bbeing in sliding contact with the second electrode371dsuch that electrical contact is maintained between the first terminal371aand the first electrode371cand between the second terminal371band the second electrode371din a case where the thru-axle30moves in the axial direction A1.", "", "Referring now toFIGS.25and26, a fourth modification of the hub assembly10will now be explained. In this fourth modification, the casing76and the cylindrical shaped batteries78have been replaced with a casing476and a plurality of flat shaped batteries478. The batteries478are disposed in the casing476, which is located in the interior space16between the hub body14and the hub axle12. Here, in the fourth modification, the casing476is arc-shaped. Also, in the fourth modification, each battery478has a flat shape and an elongated shape in the axial direction A1. The batteries478are electrically connected to together and disposed in the casing476to form a battery pack. The batteries478are electrically connected to the circuit board80by the electrically cable488for controlling the charging of the batteries478and the supply of electricity from the batteries478to an electric component (e.g., the electric rear derailleur RD) that is a separate component from the hub assembly10. This fourth modification can be used with any of the prior modifications.", "", "Referring now toFIG.27, a fifth modification of the hub assembly10will now be explained. In the fifth modification, the cylindrical shaped batteries78have been replaced a plurality of flat shaped batteries578. The batteries578are disposed in the casing76, which is located in the interior space16between the hub body14and the hub axle12. Here, the fifth modification, the batteries578are flat batteries that are laminated in the axial direction A1. The batteries578can be donut shaped or arc-shaped so as to at least partially surround the outer surface12eof the hub axle12in the circumferential direction C1. The batteries578are electrically connected to together and disposed in the casing76to form a battery pack. The batteries578are electrically connected to the circuit board80by the electrically cable88for controlling the charging of the batteries578and the supply of electricity from the batteries578to an electric component (e.g., the electric rear derailleur RD) that is a separate component from the hub assembly10. This fifth modification can be used with any of the first to third modifications.", "", "In understanding the scope of the present invention, the term “comprising” and its derivatives, as used herein, are intended to be open ended terms that specify the presence of the stated features, elements, components, groups, integers, and/or steps, but do not exclude the presence of other unstated features, elements, components, groups, integers and/or steps. The foregoing also applies to words having similar meanings such as the terms, “including”, “having” and their derivatives. Also, the terms “part,” “section,” “portion,” “member” or “element” when used in the singular can have the dual meaning of a single part or a plurality of parts unless otherwise stated.", "", "As used herein, the following directional terms “frame facing side”, “non-frame facing side”, “forward”, “rearward”, “front”, “rear”, “up”, “down”, “above”, “below”, “upward”, “downward”, “top”, “bottom”, “side”, “vertical”, “horizontal”, “perpendicular” and “transverse” as well as any other similar directional terms refer to those directions of a human-powered vehicle (e.g., bicycle) in an upright, riding position and equipped with the hub assembly. Accordingly, these directional terms, as utilized to describe the hub assembly should be interpreted relative to a human-powered vehicle (e.g., bicycle) in an upright riding position on a horizontal surface and that is equipped with the hub assembly. The terms “left” and “right” are used to indicate the “right” when referencing from the right side as viewed from the rear of the human-powered vehicle (e.g., bicycle), and the “left” when referencing from the left side as viewed from the rear of the human-powered vehicle (e.g., bicycle).", "", "The phrase “at least one of” as used in this disclosure means “one or more” of a desired choice. For one example, the phrase “at least one of” as used in this disclosure means “only one single choice” or “both of two choices” if the number of its choices is two. For another example, the phrase “at least one of” as used in this disclosure means “only one single choice” or “any combination of equal to or more than two choices” if the number of its choices is equal to or more than three. Also, the term “and/or” as used in this disclosure means “either one or both of”. For instance, the phrase “at least one of A and B” encompasses (1) A alone, (2), B alone, and (3) both A and B. The phrase “at least one of A, B, and C” encompasses (1) A alone, (2), B alone, (3) C alone, (4) both A and B. (5) both B and C, (6) both A and C, and (7) all A, B, and C. In other words, the phrase “at least one of A and B” does not mean “at least one of A and at least one of B” in this disclosure.", "", "Also, it will be understood that although the terms “first” and “second” may be used herein to describe various components, these components should not be limited by these terms. These terms are only used to distinguish one component from another. Thus, for example, a first component discussed above could be termed a second component and vice versa without departing from the teachings of the present invention.", "", "The term “attached” or “attaching”, as used herein, encompasses configurations in which an element is directly secured to another element by affixing the element directly to the other element; configurations in which the element is indirectly secured to the other element by affixing the element to the intermediate member(s) which in turn are affixed to the other element; and configurations in which one element is integral with another element, i.e. one element is essentially part of the other element. This definition also applies to words of similar meaning, for example, “joined”, “connected”, “coupled”, “mounted”, “bonded”, “fixed” and their derivatives. Finally, terms of degree such as “substantially”, “about” and “approximately” as used herein mean an amount of deviation of the modified term such that the end result is not significantly changed.", "", "While only selected embodiments have been chosen to illustrate the present invention, it will be apparent to those skilled in the art from this disclosure that various changes and modifications can be made herein without departing from the scope of the invention as defined in the appended claims. For example, unless specifically stated otherwise, the size, shape, location or orientation of the various components can be changed as needed and/or desired so long as the changes do not substantially affect their intended function. Unless specifically stated otherwise, components that are shown directly connected or contacting each other can have intermediate structures disposed between them so long as the changes do not substantially affect their intended function. The functions of one element can be performed by two, and vice versa unless specifically stated otherwise. The structures and functions of one embodiment can be adopted in another embodiment. It is not necessary for all advantages to be present in a particular embodiment at the same time. Every feature which is unique from the prior art, alone or in combination with other features, also should be considered a separate description of further inventions by the applicant, including the structural and/or functional concepts embodied by such feature(s). Thus, the foregoing descriptions of the embodiments according to the present invention are provided for illustration only, and not for the purpose of limiting the invention as defined by the appended claims and their equivalents."], "claims": ["a hub axle having a first axial end, a second axial end, a through bore extending between the first axial end and the second axial end, and a center axis defining an axial direction and a radial direction; a hub body rotatably disposed around the center axis and having an interior space; a thru-axle configured to be disposed in the through bore of the hub axle, the thru-axle including a first axle part and a second axle part, the second axle part being detachably coupled to the first axle part in the axial direction; and an electrical cable extending from the interior space of the hub body through an opening in the hub axle and into the through bore, the electrical cable extending in the axial direction along a section of the first axle part.", "an electrical power storage device configured to supply electricity to an electric component; and wherein the electrical cable is electrically connected to the electrical power storage device and the electric component.", "the electrical power storage device configured to receive electricity from the electric component.", "an electrical connector coupled to an axial end of the first axle part; and wherein the axial end of the first axle part is opposite to the second axle part; and the electrical connector is electrically connected to the electrical cable.", "the electrical connector is at least partly disposed in a connector hole of the axial end of the first axle part.", "the electrical connector includes at least one electrical pin partly projecting from the axial end of the first axle part.", "the at least one electrical pin is configured to be rotatably disposed in the connector hole such that relative rotation between the at least one electrical pin and the first axle part is permitted.", "the first axle part has a first attachment end portion and a first connection end portion, and the second axle part has a second attachment end portion and a second connection end portion, and the second connection end portion of the second axle part is detachably coupled to the first connection end portion of the first axle part.", "the second connection end portion of the second axle part is detachably coupled to the first connection end portion of the first axle part by a twist-lock connection, the twist-lock connection includes a male connector provided to one of the first connection end portion of the first axle part and the second connection end portion of the second axle part and a female receptacle provided to the other of the first connection end portion of the first axle part and the second connection end portion of the second axle part.", "the first attachment end portion includes an external thread configured to threadedly engage an internal thread of a fixing nut, or a fork or a frame.", "a frame attachment structure coupled to the second attachment end portion of the second axle part.", "the first axle part includes an intermediate shaft portion having a radial width smaller than a radial width of the first attachment end portion and a radial width of the first connection end portion to define recessed area of the first axle part, and the electrical cable is partly disposed in the recessed area of the first axle part between an outer surface of the intermediate shaft portion and an inner surface of the hub axle that defines the through bore.", "the electrical cable includes a coiled section spirally wrapped around the shaft intermediate portion.", "the electrical cable includes an undulating section disposed in the recessed area of the first axle part.", "the electrical cable includes an elastic section disposed in the recessed area of the first axle part.", "the electrical cable includes a first cable portion electrically connected to a first terminal and a second terminal that are spaced apart in the axial direction, the first axle part includes an outer surface having a first electrode and a second electrode that are spaced apart in the axial direction, the electrical cable includes a second cable portion electrically connected to the first electrode and the second electrode, the first terminal is in sliding contact with the first electrode and the second terminal is in sliding contact with the second electrode such that electrical contact is maintained between the first terminal and the first electrode and between the second terminal and the second electrode even in a case where the thru-axle moves in the axial direction.", "a first axle part having a first attachment end portion and a first connection end portion; and a second axle part having a second attachment end portion and a second connection end portion, the second connection end portion of the second axle part being detachably coupled to the first connection end portion of the first axle part by a twist-lock connection, the twist-lock connection including a male connector provided to one of the first connection end portion and the second connection end portion of the second axle part, and a female receptacle provided to the other of the first connection end portion of the first axle part and the second connection end portion of the second axle part.", "the first connection end portion is detachably coupled from a reminder of the first axle part.", "the first connection end portion includes the female receptacle, and the second connection end portion includes the male connector.", "the male connector includes a shaft portion having a protrusion extending from the shaft portion in the radial direction, the female receptacle includes an insertion section, a retaining section, and an abutment surface disposed between the insertion section and the retaining section, and the shaft portion and the protrusion are configured to slide in the axial direction through the insertion section and twisted in the retaining section to engage the protrusion with the abutment surface.", "the first axle part includes an intermediate shaft portion having a radial width that is smaller than a radial width of the first attachment end portion and a radial width of the first connection end portion.", "the first attachment end portion includes an external thread configured to threadedly engage an internal thread of a fixing nut, or a fork or a frame.", "a frame attachment structure coupled to the second attachment end portion of the second axle part.", "the frame attachment structure includes a control lever, a cam configured to be pivoted by the control lever, and a cam follower configured to move in the axial direction in response to operation of the control lever.", "the cam follower is integrally formed with the second attachment end portion of the second axle part.", "the first axle part has a first axle length, the second axle part has a second axle length; and the first axle length is larger than the second axle length."], "bibtex": "@patent{20240351373,\n    title = {HUB ASSEMBLY FOR HUMAN POWERED VEHICLE, AND THRU-AXLE FOR HUB ASSEMBLY},\n    number = {20240351373},\n    year = {2024},\n    note = {File: US20240351373A1-20241024.XML}\n    }", "classification": "B60B2702FI"}, {"title": "BICYCLE REAR-WHEEL DRIVE MECHANISM", "doc_number": "20240351374", "filename": "US20240351374A1-20241024.XML", "abstract": "A bicycle rear-wheel drive mechanism comprises a fixed shaft, a hollow toothed disc shaft, a wheel shaft, a sprocket shaft, an end cap and pin posts, the hollow toothed disc shaft is composed of a shaft cylinder and a toothed disc arranged at one end of the shaft cylinder, the toothed disc is provided with an array of semi-circular slots located at the edge of the disc body; in this design, the structure is stronger, the torque transmitted is greater, and the driving ability is stronger; replacing the original ball bearings used in bicycles with standardized tapered roller bearings allows the mechanism to be adjusted to the optimal axial and radial positions after installation, while also improving sealing performance and durability.", "detailed_description": [""], "claims": ["a first bearing chamber is arranged at one end of the wheel shaft, and a first bearing is arranged inside the first bearing chamber, the outer peripheral surface of the wheel shaft is provided with two spoke mounting plates along the axial direction, and the axis of the wheel shaft is provided with a first shaft hole; an annular groove is arranged on one side of the sprocket shaft, a second shaft hole is arranged in the center of the annular groove, and the annular groove is provided with second pin holes in a circumferential array near the edge of the bottom of the groove, which are designed to work in conjunction with the semi-circular grooves; the end of the shaft cylinder of the hollow toothed disc shaft away from the toothed disc penetrates the second shaft hole and the first shaft hole in sequence and then extends to the first bearing chamber, the toothed disc is located inside the annular groove; the notch of the annular groove is snap-fitted with the end cap, the side of the end cap near the annular groove is provided with first pin holes coaxially arranged with the second pin holes, the pin posts are located inside the cylindrical regions formed by the first pin holes and the second pin holes, springs are arranged between the pin posts and the bottoms of the second pin holes, the pin posts are provided with grooves on one side of their bodies facing the central axis of the toothed disc; on the side of the end cap facing away from the annular groove, a second bearing chamber is located at the center of the cap body, the center of the second bearing chamber is provided with a third shaft hole, the interior of the second bearing chamber is provided with a second bearing; the fixed shaft is arranged inside the shaft cylinder, the first bearing and the second bearing are respectively sleeved on the outer peripheral surfaces of the shaft journals on both sides of the fixed shaft.", "2 . The bicycle rear-wheel drive mechanism of claim 1 , an acute angle is set between one groove wall of the groove of the pin post near the wheel shaft and the axis of the pin post, the other groove wall of the groove of is perpendicular to the axis of the pin post, the distance between the two groove walls of the groove is slightly larger than the thickness of the toothed disc, the angle formed by the groove wall planes on both sides of the groove points to the direction in which the sprocket shaft drives the hollow toothed disc shaft to rotate.", "3 . The bicycle rear-wheel drive mechanism of claim 1 , the fixed shaft and the shaft cylinder are coaxially arranged, and the outer diameter of the fixed shaft is smaller than the inner diameter of the shaft cylinder.", "4 . The bicycle rear-wheel drive mechanism of claim 1 , the spoke mounting plates are provided with mounting holes evenly around their edges for installing spokes.", "5 . The bicycle rear-wheel drive mechanism of claim 1 , a sprocket gear is fixed on the outer peripheral surface of the sprocket shaft.", "6 . The bicycle rear-wheel drive mechanism of claim 1 , the hollow toothed disc shaft is axially provided with a keyway on the outer circumferential surface, the hollow toothed disc shaft and the wheel shaft are circumferentially fixed by a key, which is arranged inside the keyway.", "7 . The bicycle rear-wheel drive mechanism of claim 1 , second screw holes are arranged at the notch of the annular groove, first screw holes are arranged at the edge of the cover body of the end cap, the axes of the first screw holes and the second screw holes are coincident and the apertures are equal, fixing studs extend into the first screw holes and the second screw holes in turn.", "8 . The bicycle rear-wheel drive mechanism of claim 1 , the two ends of the fixed shaft are respectively connected with bushings of the bicycle frame.", "9 . The bicycle rear-wheel drive mechanism of claim 1 , the diameter of the toothed disc is slightly smaller than the inner diameter of the annular groove.", "10 . The bicycle rear-wheel drive mechanism of claim 1 , both the first bearing and the second bearing adopt tapered roller bearings."], "bibtex": "@patent{20240351374,\n    title = {BICYCLE REAR-WHEEL DRIVE MECHANISM},\n    number = {20240351374},\n    year = {2024},\n    note = {File: US20240351374A1-20241024.XML}\n    }", "classification": "B60B2704FI"}, {"title": "AXLE ASSEMBLY AUXILIARY FLANGES", "doc_number": "20240351375", "filename": "US20240351375A1-20241024.XML", "abstract": "An axle can include auxiliary flanges separate from the axle flanges. The auxiliary flanges can be configured to accommodate vehicle protection systems. By incorporating auxiliary flanges, such axles facilitate the installation and use of vehicle protection systems.", "detailed_description": ["Embodiments of the present invention extend to axles that include axle flanges and auxiliary flanges. In the context of this specification and the claims, the term “axle flange” should be construed as a flange of the axle to which a brake assembly attaches.", "", "FIG.1provides an example of an axle assembly100that includes an axle101that is configured in accordance with one or more embodiments of the present invention. Axle101includes axle flanges105and auxiliary flanges110that are spaced inwardly from axle flanges105. Although axle flanges105and auxiliary flanges110are shown as having the same size and shape, this need not be the case. Auxiliary flanges110could be shaped and sized in different ways including having holes111in different patterns. Axle101also includes leaf spring mounts104that may be positioned inward of auxiliary flanges110and may be configured to support leaf springs.", "", "InFIG.1, axle assembly100also includes spindles102that may be secured (e.g., welded) to the ends of axle101and hubs103that are secured to spindles102. Hubs103can function to allow wheels to be secured to axle101.", "", "FIG.2provides another example of axle assembly100where axle101does not include leaf spring mounts104and hubs103have not been secured to axle101.FIG.2is therefore intended to represent that an axle configured in accordance with embodiments of the present invention could include different components which may be selected for a particular application.", "", "FIG.3provides an example of how auxiliary flanges110facilitate securing a vehicle protection system300to axle101to thereby protect a vehicle (not shown) from tire blowouts. In some embodiments, vehicle protection system300could be configured in accordance with the teachings of U.S. Pat. No. 11,453,444.", "", "As shown, a drum brake assembly106is mounted to axle flange105and a wheel/tire107are secured to axle101via spindle102and hub103(not visible). Auxiliary flange110is spaced inwardly from axle flange105.", "", "Vehicle protection system300includes a fender301and one or more mounting members302that may be secured to auxiliary flange110(e.g., via bolts303) to thereby position fender301around the top portion of tire107. Mounting member(s)302may be vertically oriented and may, in some embodiments, wrap at least partially around axle101. However, any suitable configuration could be used to secure mounting member(s)302to auxiliary axle101.", "", "The present invention may be embodied in other specific forms without departing from its spirit or essential characteristics. The described embodiments are to be considered in all respects only as illustrative and not restrictive. The scope of the invention is, therefore, indicated by the appended claims rather than by the foregoing description. All changes which come within the meaning and range of equivalency of the claims are to be embraced within their scope."], "claims": ["opposing axle flanges that are positioned towards ends of the axle; and opposing auxiliary flanges that are spaced inwardly from the axle flanges.", "2 . The axle of claim 1 , wherein each of the auxiliary flanges includes one or more holes by which a vehicle protection system is secured to the auxiliary flange.", "opposing spring leaf mounts that are spaced inwardly from the auxiliary flanges.", "4 . The axle of claim 1 , wherein the auxiliary flanges are welded to the axle.", "an axle having opposing axle flanges that are positioned towards ends of the axle and opposing auxiliary flanges that are spaced inwardly from the axle flanges.", "a vehicle protection system secured to each auxiliary flange.", "7 . The axle assembly of claim 6 , wherein the vehicle protection system comprises one or more mounting members that are secured to the auxiliary flange and a fender that is supported by the one or more mounting members overtop a tire that is secured to the axle.", "a brake drum assembly secured to each axle flange.", "opposing axle flanges that are positioned towards ends of the axle, the axle flanges being configured to secure brake drum assemblies to the axle; and opposing auxiliary flanges that are spaced inwardly from the axle flanges, the auxiliary flanges being configured to secure vehicle protection systems to the axle.", "10 . The axle of claim 9 , wherein each of the auxiliary flanges includes a plurality of holes by which mounting members of the vehicle protection system are secured to the auxiliary flange."], "bibtex": "@patent{20240351375,\n    title = {AXLE ASSEMBLY AUXILIARY FLANGES},\n    number = {20240351375},\n    year = {2024},\n    note = {File: US20240351375A1-20241024.XML}\n    }", "classification": "B60B3500FI"}, {"title": "NOVEL TIRE STRUCTURE", "doc_number": "20240351376", "filename": "US20240351376A1-20241024.XML", "abstract": "A tire structure, including a rim, an outer tire, an inner tube, and an inflating valve; an outer peripheral surface of the rim is provided with a mounting groove; tire beads of the outer tire are hermetically connected with side walls of the mounting groove, so that a hermetically sealed air cavity is formed between the rim and the outer tire; the inner tube is annular and made of an elastic porous material, with a sectional size larger than that of the air cavity; the inner tube is disposed in the air cavity so that an outer surface of the inner tube is tightly attached to an inner wall of the air cavity; the inflating valve is mounted to the rim to inflate the air cavity and the inner tube. Impact force can be absorbed to protect the rim even when the tire is not completely inflated.", "detailed_description": ["To further explain the technical solutions of the present invention, a detailed description of the present invention is provided below through specific embodiments.", "", "Referring toFIGS.1to3, the present invention discloses a novel tire structure, comprising a rim1, an outer tire2, an inner tube3, and an inflating valve4;", "", "an outer peripheral surface of the rim1is provided with a mounting groove11circumferentially around the rim1;", "", "tire beads21of the outer tire2are hermetically connected with side walls of the mounting groove11, so that a hermetically sealed air cavity10is formed between the rim1and the outer tire2;", "", "the inner tube3is annular, and is made of an elastic porous material with a sectional size larger than that of the air cavity10; the inner tube3is disposed in the air cavity10so that an outer surface of the inner tube3is tightly attached to an inner wall of the air cavity10; and", "", "the inflating valve4is mounted to the rim1and is configured to inflate the air cavity10and the inner tube3.", "", "The following describes specific embodiments of the present invention.", "", "The outer tire2and the rim1are hermetically connected to each other by using prior art techniques used in making vacuum tires; the outer tire2may be a vacuum tire, which is a well-known prior art and thus will not be described herein.", "", "Two sides of the mounting groove11are raised away from the rim1and along a radial direction of the rim1to form two stepped portions12respectively; a recessed portion of the mounting groove11is formed between the two stepped portions12; a middle part of an inner annular surface of the inner tube3is protruded inwardly and embedded between the two stepped portions12, and two sides of the inner annular surface of the inner tube3are rested on the two stepped portions12respectively; the stepped portions12support the inner tube3, bear the pressure from the inner tube3, and axially limit a position of the inner tube3, thus ensuring structural stability. Also, the stepped portions12thicken the rim1, thereby improving the strength of the rim1. In addition, inner end surfaces of the tire beads21also abut against the stepped portions12respectively.", "", "Furthermore, a limiting flange121is formed on an inner side of a top surface of each of the stepped portions12; the limiting flange121protrudes away from and along the radial direction of the rim1, and extend circumferentially around the corresponding stepped portion; when the inner tube3is fitted to the inner wall of the air cavity10, the limiting flange121is embedded into the inner annular surface of the inner tube3, so as to further enhance the axial limiting function of the inner tube3.", "", "The inner tube3is made of foam.", "", "One of the side walls of the mounting groove11is provided with a mounting hole13; two ends of the mounting hole13penetrate through an inner side and an outer side of the rim1; and the inflating valve4is hermetically installed in the mounting hole13. According to the difference of the type and specification of the rim1, the mounting hole13may be arranged on a bottom wall of the mounting groove11, so that the inflating valve4is positioned on an inner annular surface of the rim1.", "", "According to the above described structures, the inner tube3made of the elastic porous material is arranged in the hermetically sealed air cavity10formed between the rim1and the outer tire2, the inner tube3is formed according to the shape of the air cavity10, and the cross sectional size of the inner tube3is larger than that of the air cavity10, such that the air cavity10can be completely filled after the inner tube3is placed inside the air cavity10, and hence achieving supporting and buffering effects for the outer tire2. When the air cavity10is in an incompletely inflated state, and the outer tire2is deformed under stress, the inner tube3can absorb most impact force to achieve a buffering effect, so that the impact force is prevented from being directly transmitted to the rim1, and hence the rim1is protected, the service life of the rim1and that of the tire are prolonged, therefore the novel tire structure of the present invention is particularly suitable for tires used in terrains like woodland and sand. The inner tube3is made of elastic porous material, the porous structure of the inner tube can be filled with gas, so that the air cavity10can be inflated normally, thus an amount of gas required to inflate the tire for normal use is ensured. Further, buffering effect can be achieved by the inner tube3even if the outer tire2has gas leakage, so that the tire can still be used for a period of time before reaching a maintenance point, and the potential safety hazard during the ride can be reduced. The inner tube3can still be ensured to be tightly attached to the inner wall of the air cavity10after the outer tire2is inflated and expanded thanks to the material and the size of the inner tube3, so that the functional stability is ensured. Because the inner tube3is made of porous material, the inner tube3has the functions of sound absorption and noise reduction, after the inner tube3is attached to the outer tire2, when the outer tire2is in contact with the ground or the ground obstacle directly and generates noise during use, the noise transmitted to the inner tube3through the outer tire2is absorbed by the inner tube3, thereby achieving the function of noise reduction.", "", "The above embodiments and illustrations are not intended to limit the form and style of the product of the present invention. Any appropriate variations or modifications made by those of ordinary skills in the art within the scope of the present invention shall be considered as falling within the scope of the patent."], "claims": ["a rim, an outer tire, an inner tube, and an inflating valve; an outer peripheral surface of the rim is provided with a mounting groove circumferentially around the rim; tire beads of the outer tire are hermetically connected with side walls of the mounting groove, so that a hermetically sealed air cavity is formed between the rim and the outer tire; the inner tube is annular, and is made of an elastic porous material, with a sectional size larger than that of the air cavity; the inner tube is disposed in the air cavity so that an outer surface of the inner tube is attached to an inner wall of the air cavity; and the inflating valve is mounted to the rim and is configured to inflate the air cavity and the inner tube.", "2 . The tire structure of claim 1 , wherein two sides of the mounting groove are raised away from the rim and along a radial direction of the rim to form two stepped portions respectively; a middle part of an inner annular surface of the inner tube is protruded inwardly and embedded between the two stepped portions.", "3 . The tire structure of claim 2 , wherein a limiting flange is formed on an inner side of a top surface of each of the stepped portions; the limiting flange protrudes away from and along the radial direction of the rim, and extend circumferentially around the corresponding stepped portion; when the inner tube is fitted to the inner wall of the air cavity, the limiting flange is embedded into the inner annular surface of the inner tube.", "4 . The tire structure of claim 1 , wherein the inner tube is made of foam.", "5 . The tire structure of claim 1 , wherein one of the side walls of the mounting groove is provided with a mounting hole; two ends of the mounting hole penetrate through an inner side and an outer side of the rim; and the inflating valve is hermetically installed in the mounting hole."], "bibtex": "@patent{20240351376,\n    title = {NOVEL TIRE STRUCTURE},\n    number = {20240351376},\n    year = {2024},\n    note = {File: US20240351376A1-20241024.XML}\n    }", "classification": "B60C516FI"}, {"title": "TIRE", "doc_number": "20240351377", "filename": "US20240351377A1-20241024.XML", "abstract": "A tire 1 includes a communication device 10 embedded inside a tire side portion 1 d and a plurality of turbulence-generating projections F projecting from a tire outer surface 1 ds of the tire side portion, extending along the tire radial direction, and arranged at intervals in the tire circumferential direction. The communication device overlaps at least one of an inter-projection recess G between adjacent turbulence-generating projections and the turbulence-generating projection F in a projected plane of the tire side portion in the tire width direction.", "detailed_description": ["A tire according to the present disclosure can be suitably used as any type of pneumatic tire, such as a passenger vehicle pneumatic tire and a truck/bus pneumatic tire.", "", "Embodiments of a tire according to the present disclosure are described below with reference to the drawings.", "", "Members and components that are common across drawings are labeled with the same reference signs. In some of the drawings, the tire width direction is indicated by the reference sign “TW”, the tire radial direction by the reference sign “RD”, and the tire circumferential direction by the reference sign “CD”. In the present description, the side closer to the tire inner cavity is referred to as the “tire inner side”, and the side farther from the tire inner cavity as the “tire outer side”.", "", "FIGS.1and2are diagrams illustrating a tire1according to a first embodiment of the present disclosure.FIG.1is a side view of a portion of the tire side portion of the tire according to the first embodiment of the present disclosure, as viewed from the outside in the tire width direction.FIG.2is a cross-sectional view, in the tire width direction, illustrating a portion of the tire inFIG.1(specifically, a portion on one side with respect to the tire equatorial plane CL) by a cross-section along the A-A line inFIG.1.FIG.6is a cross-sectional view, in the tire width direction, illustrating a portion of a tire according to a second embodiment of the present disclosure (specifically, a portion on one side with respect to the tire equatorial plane CL).", "", "The tire1of the embodiment inFIGS.1and2is configured as a passenger vehicle pneumatic tire. The tire1of the embodiment inFIG.6is configured as a truck/bus pneumatic tire. For the sake of convenience, these embodiments will be described together below.", "", "The tire1of any embodiment of the present disclosure may be configured as any type of tire.", "", "The tire1includes a tire main body1M and a communication device10. The tire main body1M corresponds to the portion of the tire1other than the communication device10.", "", "Unless otherwise specified, the positional relationships, dimensions, and the like of elements are assumed below to be measured in a reference state in which the tire1is mounted on an applicable rim and filled to a prescribed internal pressure, with no load applied. The width in the tire width direction of the contact patch in contact with the road surface when the tire1is mounted on the applicable rim and filled to the prescribed internal pressure, with the maximum load applied, is referred to as the ground contact width of the tire, and the edges in the tire width direction of the contact patch are referred to as the ground contact edges.", "", "In the present description, the “applicable rim” refers to a standard rim of an applicable size, such as the Measuring Rim in the STANDARDS MANUAL of the European Tyre and Rim Technological Organisation (ETRTO) in Europe or the Design Rim in the YEAR BOOK of the Tire and Rim Association, Inc. (TRA) in the USA, that is described, or will be described in the future, in industrial standards effective in the region where the pneumatic tire is manufactured and used, such as the JATMA YEAR BOOK published by the Japan Automobile Tyre Manufacturers Association (JATMA) in Japan, the STANDARDS MANUAL of the ETRTO, and the YEAR BOOK of the TRA. In the case of a size not specified in the aforementioned industrial standards, the “rim” refers to a rim whose width corresponds to the bead width of the pneumatic tire. The “applicable rim” includes sizes that will be described in the future in the aforementioned industrial standards, in addition to current sizes. Examples of the “sizes that could be described in the future” include the sizes described under “FUTURE DEVELOPMENTS” in the ETRTO STANDARDS MANUAL 2013.", "", "In the present specification, the “prescribed internal pressure” refers to the air pressure (maximum air pressure) corresponding to the maximum load capability of a single wheel for the applicable size/ply rating in industrial standards, such as the aforementioned JATMA YEAR BOOK. In the case of a size not described in the aforementioned industrial standards, the “prescribed internal pressure” refers to the air pressure (maximum air pressure) corresponding to the maximum load capability prescribed for each vehicle on which the tire is mounted. In the present specification, the “maximum load” refers to the load corresponding to the maximum load capability for a tire of the applicable size described in the aforementioned industrial standards. In the case of a size not described in the aforementioned industrial standards, the “maximum load” refers to the load corresponding to the maximum load capability prescribed for each vehicle on which the tire is mounted.", "", "First, the tire main body1M will be described.", "", "As illustrated inFIG.2,FIG.6, and the like, in each of the embodiments in the present description, the tire main body1M includes a tread portion la, a pair of sidewall portions1bextending inward in the tire radial direction from both tread widthwise ends of the tread portion1a, and a pair of bead portions1cprovided at the respective tire radial inner ends of the sidewall portions1b.The tread portion1ais the tire widthwise portion between the pair of ground edges in the tire main body1M. The bead portion1cis configured to contact the rim on the inner side in the tire radial direction and the outer side in the tire width direction when the tire1is mounted on the rim.", "", "The tire main body1M has a pair of tire side portions1dextending inward in the tire radial direction from both tire widthwise ends of the tread portion1a. The tire side portion1dis formed by the tire sidewall portion1band the bead portion1c.The surface on the tire outer side of the tire side portion1dis referred to in the present description as the “tire outer surface1dsof the tire side portion1d”.", "", "The tire main body1M also includes a pair of bead cores4a,a pair of bead fillers4b,a carcass5, a belt6, a tread rubber7, a side rubber8, and an inner liner9.", "", "Each bead core4ais embedded in the corresponding bead portion1c. The bead core4aincludes a plurality of bead wires that are coated by rubber. The bead wires are preferably made of metal (such as steel). The bead wires can, for example, be made of monofilaments or twisted wires. The bead wires may also be made of organic fibers or carbon fibers.", "", "Each bead filler4bis positioned farther outward in the tire radial direction than the corresponding bead core4a.The bead filler4btapers while extending outward in the tire radial direction. The bead filler4bis, for example, made of rubber.", "", "Bead fillers are sometimes referred to as “stiffeners”.", "", "As illustrated inFIG.6, in a case in which the tire main body1M (and thus the tire1) is configured as a truck/bus pneumatic tire, the bead filler4bmay be formed by a plurality of (in the example inFIG.6, two) bead filler portions4b1and4b2. These bead filler portions4b1,4b2may, for example, differ in hardness. These bead filler portions4b1,4b2may, for example, be arranged (stacked) along the tire radial direction.", "", "The carcass5spans the pair of bead cores4aand extends toroidally. The carcass5is configured by one or more carcass plies5a.Each carcass ply5aincludes one or more carcass cords and a coating rubber covering the carcass cords. The carcass cords can be formed from monofilaments or twisted wires.", "", "The carcass cords may be made of organic fibers composed of polyester, nylon, rayon, aramid, or the like, or may be made of metal (such as steel). In a case in which the tire1is configured as a truck/bus pneumatic tire, the carcass cords are preferably made of metal (such as steel). In a case in which the tire1is configured as a passenger vehicle pneumatic tire, the carcass cords are preferably made of organic fibers, such as polyester, nylon, rayon, aramid, or the like.", "", "The carcass ply5aincludes a ply main body5M located between the pair of bead cores4a.The carcass ply5amay further include a ply turn-up portion5T that is turned up, from both ends of the ply main body5M, around the bead core4afrom the inside to the outside in the tire width direction. The carcass ply5aneed not include the ply turn-up portion5T, however. The carcass5preferably has a radial structure but may also have a bias structure.", "", "The belt6is disposed farther outward in the tire radial direction than a crown portion of the carcass5. The belt6includes one or more belt layers6a.Each belt layer6aincludes one or more belt cords and a coating rubber covering the belt cords. The belt cords can be formed from monofilaments or twisted wires. The belt cords may be made of metal (such as steel) or may be made of organic fibers composed of polyester, nylon, rayon, aramid, or the like.", "", "The tread rubber7is located on the tire radial outer side of the belt6in the tread portion1a. The tread rubber7forms the tread surface, which is the tire radial outer surface of the tread portion1a. A tread pattern is formed on the tread surface.", "", "The side rubber8is located on the tire widthwise outer side of the carcass5in the sidewall portion1b.The side rubber8forms the tire widthwise outer surface of the sidewall portion1b.The side rubber8is integrally formed with the tread rubber7.", "", "The inner liner9is disposed on the tire inner side of the carcass5and may, for example, be laminated onto the tire inner side of the carcass5. The inner liner9is, for example, configured by a butyl-based rubber having low air permeability. Examples of butyl-based rubber include butyl rubber and butyl halide rubber, which is a derivative thereof. The inner liner9is not limited to butyl-based rubber and can be configured by other rubber compositions, resins, or elastomers.", "", "As illustrated inFIG.6, in a case in which the tire main body1M (and thus the tire1) is configured as a truck/bus pneumatic tire, the tire main body1M may include a reinforcement member3around the bead core4a.The reinforcement member3may be disposed on the opposite side of the bead core4afrom the carcass5, as in the example inFIG.6. The reinforcement member3includes one or more (in the example inFIG.6, three) reinforcement plies3a.Each reinforcement ply3acontains a reinforcement cord. The reinforcement cord may be made of metal (such as steel) or may be made of organic fibers composed of polyester, nylon, rayon, aramid, or the like.", "", "In each of the embodiments in the present description, as illustrated inFIGS.1,2, and6, the tire main body1M includes a plurality of turbulence-generating projections F projecting from the tire outer surface1dsof the tire side portion1d,extending along the tire radial direction, and arranged at intervals in the tire circumferential direction. An inter-projection recess G that is recessed inward in the tire width direction is defined between adjacent turbulence-generating projections F.", "", "Here, with reference toFIG.5, the effect of the turbulence-generating projections F will be described. As illustrated inFIG.5, as the tire1rotates, the air flow S1in contact with the tire outer surface1dsof the tire side portion1dwhere the turbulence-generating projection F is not formed is detached from the tire outer surface1dsby the turbulence-generating projection F and overcomes the turbulence-generating projection F. On the back side of the turbulence-generating projection F, a portion (region) S2is created in which the air flow is stagnant.", "", "The air flow S1then reattaches to the tire outer surface1dsbetween the back side and the next turbulence-generating projection F and is detached again at the next turbulence-generating projection F. At this time, a portion (region) S3is created in which the air flow is stagnant between the air flow S1and the next turbulence-generating projection F and the like. Here, increasing the velocity gradient (speed) over the region in contact with the turbulence S1is considered advantageous for increasing the cooling effect. In other words, provision of the turbulence-generating projection F on the tire outer surface1dsof the tire side portion1dgenerates the air flow S1with a high flow rate and the stagnant portions S2, S3and promotes the generation of turbulence on the tire outer surface1dsof the tire side portion1d,thereby enhancing the cooling effect of the tire side portion1d.", "", "Next, the communication device10will be described.", "", "The configuration of the communication device10is not limited, provided that the communication device10is configured to communicate wirelessly with a predetermined external device (such as a reader or a reader/writer) located external to the tire1.", "", "The communication device10preferably includes an RF tag. RF tags are also referred to as “RFID tags”. The RF tag is preferably configured as a passive type but may be configured as an active type.", "", "Instead of or in addition to an RF tag, the communication device10may include an acceleration sensor that detects the acceleration of the tire1, an internal pressure sensor that detects the internal pressure of the tire1, or the like.", "", "FIGS.3and4illustrate an example of the communication device10. In the present example, the communication device10has an RF tag. In the present example, the communication device10includes an RF tag10eand a cover10f.The RF tag10eincludes an IC chip10cand an antenna unit10b. The RF tag10eis configured as a passive type.", "", "The IC chip10coperates by an induced electromotive force generated by radio waves received by the antenna unit10b,for example. The IC chip10chas a controller and a memory, for example.", "", "The memory may store any information. For example, the memory may store identification information for the tire1. The identification information for the tire1is unique identification information for the tire1capable of identifying each tire individually, such as the manufacturer of the tire1, the manufacturing plant, the date of manufacture, and the like. The memory may also store tire history information such as the running distance of the tire, the number of instances of sudden braking, the number of instances of sudden starts, and the number of instances of sudden turns. Sensors that detect the tire internal temperature, tire internal pressure, tire acceleration, and the like may be provided in the tire inner cavity, for example, and the memory may store detection information detected by these sensors. In this case, the RF tag10ecan acquire the detection information from the sensors by wirelessly communicating with the sensors through the antenna unit10b.", "", "The controller is configured to be capable of reading information from the memory.", "", "The antenna unit10bhas a pair of antennas10b1,10b2. The antennas10b1,10b2are connected to respective ends located on opposite sides of each other in the IC chip10c.The antenna unit10bis configured to be capable of transmission and reception to and from the aforementioned predetermined external device that is external to the tire1. In the example inFIGS.3and4, each antenna10b1,10b2extends in a straight line, but each antenna10b1,10b2may extend to form any shape, such as a wave shape.", "", "The cover10fcovers the entire RF tag10e.The cover10fis formed from rubber or resin, for example.", "", "In the present example, the cover10fhas a pair of sheet-like covering members10f1and10f2. The pair of covering members10f1,10f2overlap with the RF tag10esandwiched between them. The pair of covering members10f1,10f2are preferably fixed to each other by adhesion or the like.", "", "The cover10fmay, however, be configured by a single member.", "", "In the present example, the cover10fhas a rectangular shape in plan view, but the cover10fmay have any shape in plan view.", "", "The communication device10need not have the cover10f,i.e., the communication device10may be configured only by the RF tag10e.", "", "The communication device10thus configured is capable of receiving, via the antenna unit10b,information transmitted through a radio wave or magnetic field from the aforementioned predetermined external device. Due to rectification (in the case of radio waves) or resonance (in the case of magnetic fields), electricity is generated in the antenna unit10bof the communication device10, and the memory and controller of the IC chip10cperform predetermined operations. For example, the controller reads the information in the memory and returns (transmits) the information to the aforementioned predetermined external device from the antenna10bthrough a radio wave or magnetic field. The aforementioned predetermined external device receives the radio wave or magnetic field from the communication device10. By retrieving the received information, the aforementioned predetermined external device can acquire the information stored in the memory of the IC chip10cof the communication device10.", "", "The communication device10may, however, have any configuration other than that of the present example.", "", "The communication device10may have a longitudinal direction LD, a transverse direction SD, and a thickness direction TD. The longitudinal direction LD, the transverse direction SD, and the thickness direction TD are perpendicular to each other.", "", "As illustrated inFIGS.3and4, in a case in which the communication device10has the RF tag10e,the longitudinal direction LD of the communication device10is parallel to the extending direction of the antenna unit10b.In a case in which each of the antennas10b1,10b2of the antenna unit10bis wave-shaped, the extending direction of the antenna unit10brefers to the extending direction of the amplitude centerline of the wave shape formed by each of the antennas10b1,10b2. In the communication device10, the thickness direction TD of the communication device10refers to the thickness direction of the cover10fin a case in which the communication device10has the cover10fand refers to the thickness direction of the IC chip10cin a case in which the communication device10does not have the cover10f.", "", "The length of the RF tag10ein the longitudinal direction LD is, for example, preferably 20 mm or more, or 50 mm or more. The length of the RF tag10ein the longitudinal direction LD is, for example, preferably 100 mm or less, or 70 mm or less.", "", "The length of the RF tag10ein the transverse direction SD is, for example, preferably 10 mm or less, or 8 mm or less.", "", "The length of the RF tag10ein the thickness direction TD is, for example, preferably 5 mm or less, or 2 mm or less.", "", "In a case in which the communication device10has the cover10f,the length of the communication device10in the longitudinal direction LD is, for example, preferably 30 mm or more, or 60 mm or more. The length of the RF tag10ein the longitudinal direction LD is, for example, preferably 110 mm or less, or 80 mm or less.", "", "In a case in which the communication device10has the cover10f,the length of the communication device10in the transverse direction SD is, for example, preferably 20 mm or less, or 15 mm or less.", "", "In a case in which the communication device10has the cover10f,the thickness of the communication device10in the thickness direction TD is, for example, preferably 6 mm or less, or 3 mm or less.", "", "The thickness of each of the covering members10f1,10f2of the cover10fis, for example, preferably 0.5 mm or more. The thickness of each of the covering members10f1,10f2of the cover10fis, for example, preferably 1 mm or less.", "", "In each of the embodiments in the present description, the entire communication device10is embedded inside the tire side portion1dof the tire main body1M, as illustrated inFIGS.1,2, and6. The communication device10is embedded in a portion of the tire side portion1dof the tire body1M that is farther outward in the tire width direction than the carcass5.", "", "The communication device10overlaps at least one of an inter-projection recess G between adjacent turbulence-generating projections F and a turbulence-generating projection F (in the example inFIG.1, an inter-projection recess G) in a projected plane (FIG.1) of the tire side portion1din the tire width direction. Here, the “projected plane of the tire side portion1din the tire width direction” is the projected plane when the tire side portion1dis viewed as projected in the tire width direction, as illustrated inFIG.1.", "", "The communication device10is oriented so that the thickness direction TD of the communication device10is substantially aligned with the tire width direction (FIGS.2and6).", "", "During production of the tire1, a raw tire forming the tire main body1M and the communication device10are housed inside a mold for forming a tire and are vulcanized.", "", "The effects of each embodiment in the present description are now explained.", "", "First, as described above, in each of the embodiments in the present description, the communication device10is embedded inside the tire side portion1d,as illustrated inFIGS.1,2, and6. Here, in general, metal may weaken the radio waves between the communication device10and the aforementioned predetermined external device (such as a reader or a reader/writer), thereby degrading the communication performance between the communication device10and the aforementioned predetermined external device. This may in turn reduce the communication distance between the communication device10and the aforementioned predetermined external device. On the other hand, in the tire main body1M, metal (such as steel) can be used in the carcass5, the belt6, the bead core4a,the reinforcement member3, and the like. In general, the tire side portion1dtends to have less metal than the tread portion1a. Therefore, arrangement of the communication device10in the tire side portion1dcan improve the communication performance and lengthen the communication distance between the communication device10and the aforementioned predetermined external device as compared to a case in which the communication device10is arranged in the tread portion1a.", "", "As described above, in each of the embodiments in the present description, the tire main body1M includes a plurality of turbulence-generating projections F, the communication device10is embedded inside the tire side portion1dof the tire main body1M, and the communication device10overlaps at least one of an inter-projection recess G between adjacent turbulence-generating projections F and a turbulence-generating projection F in a projected plane (FIG.1) of the tire side portion1din the tire width direction, as illustrated inFIGS.1,2, and6. As a result, heat generated from the communication device10can be effectively dissipated by the turbulence-generating projections F, thereby suppressing thermal aging of the communication device10, which in turn improves the durability of the communication device10. In addition, since the turbulence-generating projections F disperse the strain of the tire side portion1dduring rolling and the like of the tire1, the load on the communication device10can be reduced, thereby improving the durability of the communication device10.", "", "In each of the embodiments in the present description, the communication device10is preferably entirely located within the inter-projection recess G in the projected plane (FIG.1) of the tire side portion1din the tire width direction, as in the example inFIG.1. This allows the impact (and thus the damage) from an obstacle to be received by the turbulence-generating projections F when the tire side portion1dcollides with an external obstacle and thus more reliably protects the communication device10, which is located at the position corresponding to the inter-projection recess G, from damage. In this case, the gauge of the side rubber8covering the tire widthwise outer side of the communication device10is thin, yielding a corresponding improvement in the communication performance. In other words, carbon is included in the side rubber8, and in general, carbon may weaken the radio waves between the communication device10and the aforementioned predetermined external device (such as a reader or a reader/writer), thereby degrading the communication performance between the communication device10and the aforementioned predetermined external device. This may in turn reduce the communication distance between the communication device10and the aforementioned predetermined external device. A thin gauge for the side rubber8covering the communication device10therefore leads to improved communication performance.", "", "In each of the embodiments in the present description, the facing direction (orientation) of the communication device10is arbitrary, but from the perspective of durability and the like of the communication device10, the communication device10is preferably oriented so that the longitudinal direction LD of the communication device10is substantially aligned with the tire circumferential direction, as in the example inFIG.1. However, the communication device10may also be oriented so that the transverse direction SD of the communication device10is substantially aligned with the tire circumferential direction.", "", "In each of the embodiments in the present description, the communication device10is preferably arranged in the sidewall portion1b,as in each of the embodiments inFIGS.2and6. In general, the sidewall portion1btends to have less metal than the bead portion1c.Therefore, arrangement of the communication device10in the sidewall portion1bcan improve the communication performance and lengthen the communication distance between the communication device10and the aforementioned predetermined external device as compared to a case in which the communication device10is arranged in the bead portion1c.", "", "In each of the embodiments in the present description, in a case in which the tire1is configured as a passenger vehicle pneumatic tire (FIG.2), the tire radial outer end10uof the communication device10(more preferably, the entire communication device10) is preferably farther outward in the tire radial direction than the tire radial outer end of the bead core4a,more preferably farther outward in the tire radial direction than the tire radial center of the bead filler4b.For example, the tire radial outer end10uis preferably farther outward in the tire radial direction than a tire radial outer end4buof the bead filler4b.", "", "In each of the embodiments in the present description, in a case in which the tire1is configured as a passenger vehicle pneumatic tire (FIG.2), and the communication device10is arranged in the sidewall portion1bas described above, the tire radial outer end10uof the communication device10is preferably located farther inward in the tire radial direction than the tire radial outer end5eof the ply turn-up portion5T of the carcass5, as in the example inFIG.2. This can improve the communication performance and increase the communication distance between the communication device10and the aforementioned predetermined external device, while enabling arrangement of the communication device10in a portion of the tire main body1M that undergoes relatively little distortion during rolling and the like of the tire1, thereby improving the durability of the communication device10and hence the durability of the tire1.", "", "The tire radial distance between the tire radial outer end10uof the communication device10and the tire radial outer end5eof the ply turn-up portion5T of the carcass5is preferably 3 mm to 30 mm, more preferably 5 mm to 15 mm.", "", "In each of the embodiments in the present description, in a case in which the tire1is configured as a passenger vehicle pneumatic tire (FIG.2), the tire radial outer end5eof the ply turn-up portion5T of the carcass5is preferably located farther outward in the tire radial direction than the tire radial outer end4buof the bead filler4b,as in the example inFIG.2. The tire radial outer end5eof the ply turn-up portion5T of the carcass5may, however, be located at the same tire radial position as the tire radial outer end of the bead filler4b,or farther inward in the tire radial direction.", "", "In each of the embodiments in the present description, in a case in which the tire1is configured as a passenger vehicle pneumatic tire (FIG.2), the tire radial outer end5eof the ply turn-up portion5T of the carcass5may be located farther outward in the tire radial direction than the tire maximum width position of the tire main body1M, at the same tire radial position as the tire maximum width position of the tire main body1M, or farther inward in the tire radial direction than the tire maximum width position of the tire main body1M. Here, the “tire maximum width position of the tire main body1M” is the position in the tire radial direction at which the tire main body1M has the maximum dimension in the tire width direction.", "", "In each of the embodiments in the present description, in a case in which the tire1is configured as a passenger vehicle pneumatic tire (FIG.2), the communication device10is preferably in contact with the tire widthwise outer surface of the carcass5and is more preferably in contact with the tire widthwise outer surface of the ply turn-up portion5T of the carcass5, as in the example inFIG.2.", "", "In each of the embodiments in the present description, in a case in which the tire1is configured as a truck/bus pneumatic tire (FIG.6), the tire radial center10mof the communication device10(more preferably, the entire communication device10) is preferably farther outward in the tire radial direction than the tire radial outer end of the bead core4a.This can improve the communication performance and lengthen the communication distance between the communication device10and the aforementioned predetermined external device.", "", "In each of the embodiments in the present description, in a case in which the tire1is configured as a truck/bus pneumatic tire (FIG.6), the tire radial center10mof the communication device10(more preferably, the entire communication device10) is preferably farther outward in the tire radial direction than the tire radial outer end5eof the ply turn-up portion5T of the carcass5. This can improve the communication performance and increase the communication distance between the communication device10and the aforementioned predetermined external device, while enabling arrangement of the communication device10in a portion of the tire main body1M that undergoes relatively little distortion during rolling and the like of the tire1, thereby improving the durability of the communication device10and hence the durability of the tire1.", "", "Here, the “tire radial outer end5eof the ply turn-up portion5T of the carcass5” refers to the tire radial outer end that is farthest outward in the tire radial direction among the tire radial outer ends of the ply turn-up portions5T of the carcass plies5aof the carcass5.", "", "In each of the embodiments in the present description, in a case in which the tire1is configured as a truck/bus pneumatic tire (FIG.6), the tire radial center10mof the communication device10(more preferably, the entire communication device10) is preferably farther outward in the tire radial direction than a tire radial outer end3uof the reinforcement member3. This can improve the communication performance and increase the communication distance between the communication device10and the aforementioned predetermined external device, while enabling arrangement of the communication device10in a portion of the tire main body1M that undergoes relatively little distortion during rolling and the like of the tire1, thereby improving the durability of the communication device10and hence the durability of the tire1.", "", "Here, the “tire radial outer end3uof the reinforcement member3” refers to the tire radial outer end that is farthest outward in the tire radial direction among the tire radial outer ends of the reinforcement plies3aof the reinforcement member3.", "", "In each of the embodiments in the present description, in a case in which the tire1is configured as a truck/bus pneumatic tire (FIG.6), the tire radial center10mof the communication device10(more preferably, the entire communication device10) is preferably farther inward in the tire radial direction than the tire radial outer end4buof the bead filler4b.This can improve the communication performance and increase the communication distance between the communication device10and the aforementioned predetermined external device, while enabling arrangement of the communication device10in a portion of the tire main body1M that undergoes relatively little distortion during rolling and the like of the tire1, thereby improving the durability of the communication device10and hence the durability of the tire1. The tire radial distance between the tire radial center10mof the communication device10and the tire radial outer end4buof the bead filler4bis preferably 1 mm to 30 mm, more preferably 5 mm to 15 mm.", "", "In each of the embodiments in the present description, in a case in which the tire1is configured as a truck/bus pneumatic tire (FIG.6), the tire radial outer end5eof the ply turn-up portion5T of the carcass5is preferably located farther inward in the tire radial direction than the tire radial outer end4buof the bead filler4b,but the tire radial outer end5eof the ply turn-up portion5T of the carcass5may be located at the same tire radial position as the tire radial outer end4buof the bead filler4bor farther outward in the tire radial direction.", "", "In each of the embodiments in the present description, in a case in which the tire1is configured as a truck/bus pneumatic tire (FIG.6), the tire radial outer end3uof the reinforcement member3is preferably located farther inward in the tire radial direction than the tire radial outer end4buof the bead filler4b,but the tire radial outer end3uof the reinforcement member3may be located at the same tire radial position as the tire radial outer end4buof the bead filler4bor farther outward in the tire radial direction.", "", "In each of the embodiments in the present description, in a case in which the tire1is configured as a truck/bus pneumatic tire (FIG.6), the tire radial outer end5eof the ply turn-up portion5T of the carcass5may be located farther inward in the tire radial direction than the tire maximum width position of the tire main body1M, as in the example inFIG.6, at the same tire radial position as the tire maximum width position of the tire main body1M, or farther outward in the tire radial direction than the tire maximum width position of the tire main body1M.", "", "Here, the “tire maximum width position of the tire main body1M” is the position in the tire radial direction at which the tire main body1M has the maximum dimension in the tire width direction.", "", "In each of the embodiments in the present description, in a case in which the tire1is configured as a truck/bus pneumatic tire (FIG.6), the tire radial outer end3uof the reinforcement member3may be located farther inward in the tire radial direction than the tire maximum width position of the tire main body1M, as in the example inFIG.6, at the same tire radial position as the tire maximum width position of the tire main body1M, or farther outward in the tire radial direction than the tire maximum width position of the tire main body1M.", "", "In each of the embodiments in the present description, in a case in which the tire1is configured as a truck/bus pneumatic tire (FIG.6), the tire radial center10mof the communication device10(more preferably, the entire communication device10) is preferably located farther inward in the tire radial direction than the tire maximum width position of the tire main body1M. This can improve the communication performance and increase the communication distance between the communication device10and the aforementioned predetermined external device, while enabling arrangement of the communication device10in a portion of the tire main body1M that undergoes relatively little distortion during rolling and the like of the tire1, thereby improving the durability of the communication device10and hence the durability of the tire1.", "", "In each of the embodiments in the present description, in a case in which the tire1is configured as a truck/bus pneumatic tire (FIG.6), the communication device10is preferably in contact with the tire widthwise outer surface of the bead filler4b,as in the example inFIG.6.", "", "In each of the embodiments in the present description, the maximum width of the turbulence-generating projection F in the tire circumferential direction is preferably 4.7 mm to 7.1 mm.", "", "This can further improve the durability of the communication device10.", "", "In each of the embodiments in the present description, the length of the turbulence-generating projection F in the tire radial direction is preferably 8 mm to 30 mm.", "", "This can further improve the durability of the communication device10.", "", "In each of the embodiments in the present description, the maximum distance between adjacent turbulence-generating projections F in the tire circumferential direction (i.e., the maximum length of the inter-projection recess G in the tire circumferential direction) is preferably 10 mm to 25 mm.", "", "This can further improve the durability of the communication device10.", "", "Variations of the turbulence-generating projection F are described below with reference toFIGS.7to21.", "", "FIGS.7to9are diagrams illustrating a tire1according to a third embodiment of the present disclosure.FIGS.10to12are diagrams illustrating a tire1according to a fourth embodiment of the present disclosure.FIGS.13to15are diagrams illustrating a tire1according to a fifth embodiment of the present disclosure.FIGS.16to17are diagrams illustrating a tire1according to a sixth embodiment of the present disclosure.FIGS.18to21are diagrams illustrating a tire1according to a seventh embodiment of the present disclosure. The configuration of the turbulence-generating projection F differs in each of the embodiments inFIGS.7to21. However, in each of the embodiments inFIGS.7to21, as in the embodiments described above with reference toFIGS.1to6, the tire main body1M includes a plurality of turbulence-generating projections F projecting from the tire outer surface1dsof the tire side portion1d,extending along the tire radial direction, and arranged at intervals in the tire circumferential direction. An inter-projection recess G that is recessed inward in the tire width direction is defined between adjacent turbulence-generating projections F.", "", "InFIGS.7through21, the communication device10is not depicted for the sake of convenience. In each of the embodiments inFIGS.7to21as well, however, the tire1includes the communication device10, which is embedded inside the tire side portion1dof the tire main body1M, and the communication device10overlaps at least one of an inter-projection recess G between adjacent turbulence-generating projections F and a turbulence-generating projection F in a projected plane of the tire side portion1din the tire width direction.", "", "The tire1according to the third embodiment of the present disclosure is described below with reference toFIGS.7to9.", "", "In the tire1of the third embodiment, a plurality of uneven surfaces extending along the tire radial direction while undulating in the tire width direction is formed at the apex of the turbulence-generating projection F.", "", "As illustrated inFIG.7, the tire side portion1dis provided with turbulence-generating projections20(F). The turbulence-generating projection20(F) extends in the tire radial direction and projects outward in the tire width direction. As also illustrated inFIG.7, a plurality (eight in the present embodiment) of the turbulence-generating projections20(F) is arranged close together along the circumferential direction to form one turbulence-generating projection group. Five of these turbulence-generating projection groups are provided at intervals along the circumferential direction.", "", "FIG.8is an enlarged perspective view illustrating the turbulence-generating projection according to the present embodiment, andFIG.9is a front view ofFIG.8from the tire circumferential direction.", "", "As illustrated in these drawings, the turbulence-generating projection20is defined by a bottom wall21provided at the inner end in the tire radial direction RD, a pair of side wall surfaces22,22provided on both sides in the tire circumferential direction CD, and an apex23provided on the tire widthwise outer side.", "", "The side wall surfaces22are flat while extending along the tire radial direction, and the pair of side wall surfaces22,22are arranged at a predetermined distance from each other.", "", "The apex23is formed into an uneven surface24that repeatedly undulates in the tire width direction. One uneven portion25forming part of this uneven surface24has, in greater detail, a substantially triangular cross-sectional shape formed by a first inclined surface (climbing surface)26inclined outward in the tire width direction while extending outward in the tire radial direction (to the top of the paper inFIGS.8and9) and a second inclined surface (descending surface)27inclined inward in the tire width direction while extending outward in the tire radial direction (to the top of the paper inFIGS.8and9). The apex23of the turbulence-generating projection20is formed into the uneven surface24by a plurality of these uneven portions25being successively formed in the tire radial direction on the apex23.", "", "As illustrated inFIG.9, the boundary portion between the second inclined surface27and the first inclined surface26adjacent to the second inclined surface27becomes a valley point28, and the cross-sectional shape of the valley point28is formed to be curved with a small radius of curvature. Similarly, at an apex29where the first inclined surface26transitions to the second inclined surface27, the cross-sectional shape of the apex29is formed to be curved with a small radius of curvature.", "", "The height of the uneven surface24, i.e., the distance along the tire width direction between the apex29and the surface of the tire side portion1d, is H1. On the other hand, the height of the valley point28, i.e., the distance along the tire width direction between the valley point28and the surface of the tire side portion1d,is H2. Here, the undulation height of the uneven surface24is (H1-H2), and the height of the turbulence-generating projection20is H1. The undulation height of the uneven surface24(H1-H2) is preferably 20% to 70% of the height H1of the turbulence-generating projection20.", "", "In the third embodiment, a plurality of the uneven surfaces24extending along the tire radial direction while undulating in the tire width direction is formed at the apex of the turbulence-generating projection20(F).", "", "Therefore, compared to a turbulence-generating projection with a flat apex, the turbulence-generating projection20(F) with an uneven surface24according to the present embodiment has a greater cooling effect on the tire side portion1d,since the generated turbulence S1(FIG.5) is larger. In addition, in the case of a turbulence-generating projection with a flat apex, air accumulated at the apex of the projection in the mold for forming a tire can easily move without resistance when the tire is vulcanized, which may tend to generate bare portions (air pockets). According to the third embodiment, however, it is difficult for air accumulated at the apex of the projection20in the mold for forming a tire to move during tire vulcanization. Bare portions are thus less likely to occur, and even if they do occur, they are less noticeable as a result of the uneven surface24at the apex. The degradation in the appearance due to the bare portions is thus suppressed. To increase turbulence and improve the effect of cooling the tire side portion1d,the number of uneven surfaces is preferably large.", "", "The undulation height of the uneven surface24(H1-H2) is preferably 20% to 70% of the height H1of the turbulence-generating projection20. By thus limiting the undulation height (H1-H2) of the uneven surface24to a predetermined value, the occurrence of bare portions can be further suppressed.", "", "The uneven surface24has the shape of substantially triangular cross-sections continuously arranged in the tire radial direction, which is a relatively simple shape that has the effect of simplifying the structure of the mold for forming a tire.", "", "The tire1according to the fourth embodiment of the present disclosure is described below with reference toFIGS.10to12.", "", "In the tire1of the fourth embodiment, the tire side portion1dincludes a first rigidity portion, in which a first rubber member formed by a rubber member and having a predetermined rigidity is used, and a second rigidity portion, in which a second rubber member having a rigidity higher than the predetermined rigidity is used. The turbulence-generating projections F are only provided in the first rigidity portion.", "", "As illustrated inFIG.11, the tire side portion1dincludes a low-rigidity portion61(first rigidity portion) and a high-rigidity portion62(second rigidity portion). In the low-rigidity portion61, a first rubber member formed by a rubber member and having a predetermined rigidity is used. In the present embodiment, the first rubber member is the portion of the side rubber8of the tire side portion1din the region from the ground edge51, which is located farthest outward in the tire width direction when the tread portion1acontacts the road surface, to the tire radial outer end4buof the bead filler4b(hereinafter referred to as the side rubber portion60A). For example, rubber with a Young's modulus of 5 MPa to 7 MPa (at 25° C.) is used in the side rubber portion60A.", "", "A second rubber member having a higher rigidity than the rigidity of the first rubber member, i.e., than the rigidity of the side rubber portion60A, is used in the high-rigidity portion62. In the present embodiment, the second rubber member is the bead filler4b.For example, rubber with a Young's modulus of 50 MPa to 500 MPa, particularly 110 MPa to 130 MPa (at 25° C.), is preferably used in the bead filler4b.", "", "Here, the temperature dependence of the bead filler4bis greater than the temperature dependence of the side rubber portion60A. The temperature dependence is the property whereby the rigidity of a tire component changes in response to a change in the temperature of the tire component that forms part of the tire. In the present embodiment, the rigidity of the bead filler4bis higher than the rigidity of the side rubber portion60A. The temperature dependence of the bead filler4bis therefore greater than the temperature dependence of the side rubber portion60A. In other words, as illustrated inFIG.12, the change in rigidity (U1) of the bead filler4bdue to a change in temperature is greater than the change in rigidity (U2) of side rubber portion60A due to a change in temperature.", "", "Turbulence-generating projections70(F) extending along the tire radial direction RD are provided in at least a portion of this tire side portion1d.", "", "As illustrated inFIGS.10and11, the turbulence-generating projection70projects from the surface of the tire side portion1d.The cross-sectional shape of the turbulence-generating projection70orthogonal to the extending direction thereof is rectangular.", "", "The turbulence-generating projections70are provided only in the low-rigidity portion61, i.e., only in the side rubber portion60A. Specifically, the turbulence-generating projections70are provided only in the region from the ground edge51to the tire radial outer end4buof the bead filler4b.In other words, the turbulence-generating projections70are provided at a position not in overlap with the bead filler4bin the tire width direction.", "", "The cross-sectional shape of the turbulence-generating projection70does not necessarily have to be rectangular and may be any of various shapes, such as a trapezoid or semi-circular arc. It suffices for the turbulence-generating projection70to be provided within the region from the ground edge51to the tire radial outer end4buof the bead filler4b,and a plurality thereof may be provided separately.", "", "For example, if turbulence-generating projections are provided on the entire surface of the tire side portion, the entire surface of the tire side portion is cooled by the turbulence-generating projections. However, if the temperature of the entire tire side portion decreases, then the rigidity difference (d2) between the rigidity of the bead filler (for example, T1) and the rigidity of the side rubber portion (for example, T2′) is large, as illustrated inFIG.12. Therefore, the less the bead filler flexes (deforms), the more the tire side portion flexes. As a result, distortion tends to be concentrated at a tire widthwise end6eof the belt6(hereinafter the belt end6e), which may cause separation at the belt end6e.", "", "Therefore, in the fourth embodiment, the turbulence-generating projections70are provided only in the low-rigidity portion61(side rubber portion60A). In other words, the turbulence-generating projections70do not overlap in the tire width direction with the high-rigidity portion62(bead filler4b), which has higher rigidity than the side rubber portion60A. Therefore, the turbulence caused by the turbulence-generating projections70as the tire1rotates will cool only the side rubber portion60A.", "", "Since the side rubber portion60A is cooled by turbulence, its temperature does not rise easily, resulting in less rigidity loss. On the other hand, the bead filler4b,which has greater temperature dependence than the side rubber portion60A, is not cooled by turbulence, and thus its temperature rises, causing a gradual decrease in rigidity. Therefore, as illustrated inFIG.12, the rigidity difference between the rigidity of the side rubber portion60A and the rigidity of the bead filler4bbecomes smaller as the rigidity of the bead filler4bgradually decreases in a predetermined temperature range R.", "", "Accordingly, in a temperature range of the tire when the vehicle is traveling at very high speed (a predetermined temperature range R), for example, the rigidity difference (d1) between the rigidity of the side rubber portion60A (for example, T1) and the rigidity of the bead filler4b(for example, T2) can be reduced, as illustrated inFIG.12, making it easier for the bead filler4bto flex together with the side rubber portion60A.", "", "This can prevent the concentration of distortion (deformation) at the belt end6edue to the rigidity difference between the rigidity of the side rubber portion60A and the rigidity of the bead filler4bin the temperature range of the tire when the vehicle is traveling at very high speed, for example. As a result, separation at the belt end6ecan be reliably suppressed.", "", "Since the turbulence-generating projections70do not overlap in the tire width direction with the high-rigidity portion62(bead filler4b), which has a higher rigidity than the side rubber portion60A, the thickness of the side rubber portion60A does not increase at the tire widthwise outer side of the bead filler4bdue turbulence-generating projections projecting from the surface of the tire side portion. Therefore, even when the vehicle travels at very high speed, the side rubber portion60A and the bead filler4breliably flex together, and the concentration of strain on the belt end6ecan be reliably suppressed.", "", "The tire1according to the fifth embodiment of the present disclosure is described below with reference toFIGS.13to15.", "", "In the tire1of the fifth embodiment, the projection width, defined as the length of the turbulence-generating projection F in the tire circumferential direction, varies in the tire radial direction and widens toward a projection outer end located on the tire radial outer side, and the height of the turbulence-generating projection F relative to the tire outer surface1dsof the tire side portion1dvaries in the tire radial direction and is formed to decrease gradually toward the projection outer end.", "", "A plurality of turbulence-generating projections110(F) project from the tire outer surface1dsof the tire side portion1d,extend along the tire radial direction, and are arranged at intervals in the tire circumferential direction. The turbulence-generating projections110are arranged radially, centering on the tire rotation axis, on the tire outer surface1dsof the tire side portion1d, as illustrated inFIG.13.", "", "The turbulence-generating projection110is an elongated projection for generating or promoting turbulence on the tire outer surface of the tire side portion1dduring rotation of the tire1. As illustrated inFIG.15, the projection outer end111, which is the outer end of the turbulence-generating projection110in the tire radial direction, is formed with a slope so that the height110H gradually becomes lower toward the edge. The tire widthwise outer surface of the turbulence-generating projection110at the projection outer end111(the surface visible from the tire side) is continuous with the tire outer surface1dsof the tire side portion1dso as to be flush with the tire outer surface1ds. As illustrated inFIG.15, the maximum angle1θ1between the tire widthwise outer surface of the turbulence-generating projection110at the projection outer end111and the tire outer surface1dsof the tire side portion is set to be 25° or less. Specifically, the maximum angle1θ1is approximately 22° in the present embodiment.", "", "The projection inner end112, which is the inner end of the turbulence-generating projection110in the tire radial direction, is formed to be smoothly continuous with the tire outer surface1ds, which rises up from the bead portion1cand extends from the rim guard in the tire radial direction, so as to be flush with the tire outer surface1ds.", "", "On the tire radial outer side of the turbulence-generating projection110, characters and symbols for conveying information are provided. These characters and symbols are protrusions130that project from the tire side portion1d.These protrusions130also generate turbulence in the fluid passing along the tire side portion1dand thus have a cooling effect on the tire side portion1d.", "", "The radial length110L (FIG.14), which is the length of the turbulence-generating projection110in the tire radial direction, is 12 mm, for example. The maximum height110H (FIG.15) of the turbulence-generating projection110relative to the tire outer surface1dsof the tire side portion1dis, for example, 0.7 mm. The length130L of the protrusion130in the tire radial direction is, for example, 10 mm.", "", "In the present embodiment, as illustrated inFIG.14, turbulence-generating projections110adjacent to each other are set at predetermined intervals. The projection width of the turbulence-generating projection110varies so as to widen towards the tire radial outer side (the tread portion1aside). The interval1P (FIG.14) between the turbulence-generating projections110is, for example, 11 mm.", "", "For example, the projection width111W (FIG.14) of the projection outer end111of the turbulence-generating projection110is 4.665 mm to 7.141 mm, and the projection width112W (FIG.14) of the projection inner end112is 1.202 mm to 1.454 mm. The projection width111W of the projection outer end111and the projection width112W of the projection inner end112can be adjusted as needed for each tire size.", "", "Specifically, for example, the projection width111W of the projection outer end111of a 225/50F17 tire is 7.141 mm, the projection width112W of the projection inner end112is 1.202 mm, and the ratio of the projection width111W of the projection outer end111to the projection width112W of the projection inner end112is 5.941. The projection width111W of the projection outer end111of a 225/45F17 tire is 5.378 mm, the projection width112W of the projection inner end112is 1.454 mm, and the ratio of the projection width111W of the projection outer end111to the projection width112W of the projection inner end112is 3.699. The projection width111W of the projection outer end111of a 245/40F18 tire is 4.665 mm, the projection width112W of the projection inner end112is 1.346 mm, and the ratio of the projection width111W of the projection outer end111to the projection width112W of the projection inner end112is 3.466. The projection width111W of the projection outer end111of a 225/50F16 tire is 6.844 mm, the projection width112W of the projection inner end112is 1.392 mm, and the ratio of the projection width111W of the projection outer end111to the projection width112W of the projection inner end112is 4.917.", "", "The projection width111W is configured to have a length of 25% or more of the interval1P of the turbulence-generating projections110. Specifically, the projection width111W of the projection outer end111is 50% or more of the interval1P between adjacent turbulence-generating projections110. In addition, the adjacent turbulence-generating projections110are configured not to be connected. The aforementioned interval1P between the turbulence-generating projections110is the distance between points bisecting the width of the turbulence-generating projections110in the tire circumferential direction.", "", "The shapes of the two sides of the turbulence-generating projection in the longitudinal direction differ from each other. The shape of one side is substantially parallel to the longitudinal direction and is substantially straight. The shape of the other side has a gently sloping portion113, which is substantially parallel to the one side, and a steeply sloping portion114, which is more inclined relative to the longitudinal direction than the gently sloping portion113. The area near the projection outer end111is the steeply sloping portion114. Therefore, the turbulence-generating projection110has an increasingly larger projection width toward the projection outer end111.", "", "Of the width ends111A and111B, which are the ends in the tire circumferential direction of the projection outer end111of the turbulence-generating projection110, one width end111A is formed so that the angle1θ3between a circumferential side1E1extending in the tire circumferential direction and a radial side1E2extending in the tire radial direction is 90° or less. According to such a configuration, at least one end of the projection outer end in the tire circumferential direction is 90° or less, i.e., an acute angle, which facilitates extraction of the tire from the mold during manufacturing and also facilitates the release of air to the tire surface during vulcanization, effectively suppressing the occurrence of bare portions during manufacturing and reducing the probability of a defective shape or defective appearance.", "", "According to the tire1of the fifth embodiment, the temperature of the tire side portion1dcan be reduced by the turbulence-generating projections110, since the turbulence-generating projections110are provided on the tire side portion1d.In addition, since the height of the projection outer end111of the turbulence-generating projection110gradually decreases toward the surface of the tire side portion, the occurrence of chips and broken-off portions of the turbulence-generating projections110is reduced and bare portions are less likely to occur when the raw tire is vulcanized in the mold for forming a tire.", "", "Furthermore, the projection width111W at the projection outer end111of the turbulence-generating projection110is 2.0 times or more the projection width112W at the projection inner end112of the turbulence-generating projection110. A sufficient temperature reduction effect can thereby be obtained while avoiding the problem of heat storage.", "", "The maximum angle1θ1between the tire widthwise outer surface of the turbulence-generating projection110and the tire outer surface1dsof the tire side portion is set to be 25° or less (for example, approximately 22°). Therefore, the occurrence of chips and broken-off portions of the projection outer end111of the turbulence-generating projection110is reduced and bare portions are less likely to occur when the raw tire is vulcanized in the mold for forming a tire during manufacturing.", "", "Furthermore, since the projection width111W is 25% or more of the interval1P between turbulence-generating projections110, and adjacent turbulence-generating projections110are not connected to each other, a temperature rise due to heat storage caused by an excessively large projection width and a decrease in rigidity due to an excessively narrow projection width can be avoided while effectively achieving the diffusion of turbulence. A heat storage suppression function and a turbulence promotion function (cooling function) can thus both be achieved.", "", "The width end111A of the projection outer end111of the turbulence-generating projection110is formed so that the angle1θ3between the circumferential side1E1extending in the tire circumferential direction and the radial side1E2extending in the tire radial direction is 90° or less, which facilitates extraction from the mold during manufacturing and also facilitates the release of air to the tire surface during vulcanization. This effectively suppresses the occurrence of bare portions during manufacturing and reduces the probability of a defective shape or defective appearance.", "", "Since the projection inner end112of the turbulence-generating projection110is continuous so as to be flush with the tire outer surface1ds, the rigidity of the projection inner end112can be enhanced to suppress damage, such as chips and broken-off portions. This also suppresses the occurrence of bare portions during manufacturing and reduces the probability of a defective shape or defective appearance.", "", "The tire1according to the sixth embodiment of the present disclosure is described below with reference toFIGS.16and17.", "", "In the tire1of the sixth embodiment, the tire side portion1dhas provided thereon a first region in which a plurality of the turbulence-generating projections F are arranged adjacent to each other, and a second region at least partially overlapping the first region in the tire circumferential direction and not having any turbulence-generating projections F arranged therein. A protrusion projecting from the tire outer surface1dsof the tire side portion1dis formed in the second region. The protrusion has the shape of characters and symbols displaying information or the shape of figures and patterns displaying a design. The protrusion has a height from the tire outer surface1dsof the tire side portion1dthat is from 50% to 100% of the height of the turbulence-generating projection F from the tire outer surface1dsof the tire side portion1d.", "", "As illustrated inFIG.16, the tire outer surface1dsof the tire side portion1dhas provided thereon a first region2R1in which a plurality of turbulence-generating projections210(F) are arranged adjacent to each other and a second region2R2in which no turbulence-generating projections210(F) are arranged adjacent to each other. In the second region2R2, a plurality of protrusions220are arranged adjacent to each other. The first region2R1and the second region2R2are arranged to partially overlap in the tire circumferential direction.", "", "The plurality of turbulence-generating projections210(F) project from the tire outer surface1dsof the tire side portion1d,extend along the tire radial direction, and are arranged at intervals in the tire circumferential direction. The turbulence-generating projections210are arranged radially, centering on the tire rotation axis, on the tire outer surface1dsof the tire side portion1d, as illustrated inFIG.16. Each turbulence-generating projection210extends so that the longitudinal direction is along the tire radial direction. A cross-section of the turbulence-generating projection210in the tire circumferential direction is formed to have a rectangular shape. The turbulence-generating projection210is an elongated projection for generating or promoting turbulence on the tire outer surface1dsof the tire side portion1dduring rotation of the tire1.", "", "The plurality of protrusions220project from the tire outer surface1dsof the tire side portion1dand are arranged at intervals in the tire circumferential direction. As illustrated inFIG.16, the protrusions220are in the shape of characters, recognizable when viewed from the outside of the tire side portion1d,and display predetermined information. A cross-section of the protrusions220in the tire circumferential direction is formed to have a rectangular shape. The protrusions220generate or promote turbulence on the outer circumferential surface of the tire side portion1dduring rotation of the tire1.", "", "Projections230project from the tire outer surface1dsof the tire side portion1d.The projections230are arranged at intervals along the tire circumferential direction on the tire radial inner side of the protrusions220. The projections230generate or promote turbulence on the outer circumferential surface of the tire side portion1dduring rotation of the tire1. The projections230are arranged radially, centering on the tire rotation axis, on the tire outer surface1dsof the tire side portion1d,as illustrated inFIG.16.", "", "Each projection230extends so that the longitudinal direction is along the tire radial direction. A cross-section of the projections230in the tire circumferential direction is substantially rectangular. The pitch of the projections230in the tire circumferential direction is the same length as the pitch2P of the turbulence-generating projections210in the tire circumferential direction.", "", "By the turbulence-generating projections210(F) thus being arranged in the first region2R1and the projections230and protrusions220being arranged in the second region2R2, turbulence can be generated or promoted over the entire circumference of the tire outer surface1dsof the tire side portion1dto effectively reduce the tire temperature.", "", "The mechanism of turbulence generation is now explained. As the tire1rotates, the air flow S1in contact with the tire outer surface1dsof the tire side portion1dwhere the turbulence-generating projection210or protrusion220is not formed is detached from the tire outer surface1dsby the turbulence-generating projection210or protrusion220and overcomes the turbulence-generating projection210or protrusion220. On the back side of the turbulence-generating projection210or the protrusion220, a portion (region) S2is created in which the air flow is stagnant.", "", "The air flow S1then reattaches to the bottom between the back side and the next turbulence-generating projection210or protrusion220and is detached again at the next turbulence-generating projection210or protrusion220. At this time, a portion (region) S3is created in which the air flow is stagnant between the air flow S1and the next turbulence-generating projection210and the like. Here, increasing the velocity gradient (speed) over the region in contact with the turbulence S1is considered advantageous for increasing the cooling effect. In other words, provision of the turbulence-generating projections210and protrusions220on the tire outer surface1dsof the tire side portion1dgenerates the air flow S1with a high flow rate and the stagnant portions S2, S3and promotes the generation of turbulence on the tire outer surface1dsof the tire side portion1d,thereby enhancing the cooling effect of the tire side portion1d.", "", "The projections230on the tire radial inner side in the tire side portion1dalso contribute to heat dissipation on the tire radial outer side. Specifically, a centrifugal force during rotation of the tire1causes air to flow from the inside to the outside in the tire radial direction. The projections230provided on the tire radial inner side thereby also contribute to heat dissipation on the tire radial outer side. By the turbulence-generating projections210and the projections230being provided at least in a portion on the tire radial inner side of the tire side portion1d,heat dissipation can be promoted not only in the portion on the tire radial inner side but also the portion on the tire radial outer side, thereby efficiently enhancing the cooling effect on the entire tire outer surface1dsof the tire side portion1d.", "", "In the tire1of the present embodiment, the height210H of the turbulence-generating projection210from the tire outer surface1dsis, for example, 0.7 mm. The height220H of the protrusion220from the tire outer surface1dsis, for example, 0.6 mm. The height220H of the protrusion220is preferably in a range of 50% to 100% of the height210H of the turbulence-generating projection210, for example 86%. If the height220H of the protrusion220, the height210H of the turbulence-generating projection210, and the height230H of the projection230are too large, the deformation of the tire side portion during rolling becomes difficult to follow, and subjection to repeated deformation may concentrate strain especially at the base of the turbulence-generating projection, causing cracks to occur.", "", "On the other hand, if the height220H of the protrusion220is too small relative to the height210H of the turbulence-generating projection210, i.e., less than 50% of the height210H of the turbulence-generating projection210, then the visibility of the characters may be reduced, or the turbulence generation effect may not be sufficiently obtained. Therefore, the height220H of the protrusion220is preferably within a range of 50% to 100% of the height210H of the turbulence-generating projection210.", "", "The protrusion220is arranged so as to overlap, in the tire circumferential direction, a tire radial outer end210X of the turbulence-generating projection210. In other words, the protrusion220is arranged on a virtual line2C1extending in the tire circumferential direction through the outer end210X of the turbulence-generating projection210. An outer end220X of the protrusion220is disposed farther outward in the tire radial direction than the outer end210X of the turbulence-generating projection210, and the length221L (FIG.16) in the tire radial direction from the outer end220X of the protrusion220to the outer end210X of the turbulence-generating projection210is, for example, 6.4 mm.", "", "The length221L (FIG.16) in the tire radial direction from the outer end220X of the protrusion220to the outer end210X of the turbulence-generating projection210is preferably 2 mm to 8 mm. The distance in the tire radial direction between the projection230and the protrusion220is preferably set from approximately 1.5 mm to 3 mm, more preferably 2 mm. The distance between the turbulence-generating projection210and the protrusion220is preferably set from approximately 6 mm to 12 mm in the circumferential direction.", "", "A tire radial inner end230Y of the projection230is arranged so as to overlap, in the tire circumferential direction, a tire radial inner end210Y of the turbulence-generating projection210. In other words, the projection230is arranged on a virtual line2C2extending in the tire circumferential direction through the inner end210Y of the turbulence-generating projection210. By the protrusions220and the projections230being arranged in this manner, air moving along the tire circumferential direction can continuously contact the turbulence-generating projections210and the protrusions220.", "", "The length220L of the protrusion220in the tire radial direction is from 30% to 80% of the length220L of the turbulence-generating projection210in the tire radial direction. If the length220L of the protrusion220is too small relative to the length210L of the turbulence-generating projection210, i.e., less than 30%, then the visibility of the characters may be reduced, or the turbulence generation effect may not be sufficiently obtained. Therefore, the length220L of the protrusion220is preferably within a range of 30% to 80% of the length210L of the turbulence-generating projection210.", "", "According to the tire1configured as described above, the turbulence-generating projections210are provided in the first region2R1, and the protrusions220and projections230are provided in the second region2R2. This enables a reduction in the temperature of the second region2R2through the protrusions220and the projections230while maintaining the effect of reducing the temperature in the first region2R1through the turbulence-generating projections. In addition, since characters can be displayed by the protrusions220, the effect of reducing the temperature through air turbulence and the effect of conveying information can both be achieved.", "", "The tire1according to the seventh embodiment of the present disclosure is described below with reference toFIGS.18to21.", "", "The tire1of the seventh embodiment further includes a circumferential projection projecting from the tire outer surface1dsof the tire side portion1dand extending in the tire circumferential direction. An end of the turbulence-generating projection F in the tire radial direction is connected to the circumferential projection, and the height of the end of the turbulence-generating projection F relative to the tire outer surface1dsof the tire side portion1dis lower than the height of the circumferential projection relative to the tire outer surface1dsof the tire side portion1dat a portion at which the end of the turbulence-generating projection F and the circumferential projection are connected in the tire radial direction.", "", "Also, in the tire1of the seventh embodiment, in the tire side portion1d,the tire1has a tire maximum width region TR that includes a position at which a length of the tire in the tire width direction is maximized, an end of the turbulence-generating projection F in the tire radial direction is located in the tire maximum width region TR, the tire1includes a circumferential projection projecting from the tire outer surface1dsof the tire side portion1dand extending in the tire circumferential direction, the end of the turbulence-generating projection F is connected to the circumferential projection, and the width of the circumferential projection in the tire radial direction is narrower than the maximum width of the turbulence-generating projection F in the tire circumferential direction.", "", "As illustrated inFIG.18, a plurality of turbulence-generating projections310(F) are arranged on the tire outer surface1dsof the tire side portion1d.In addition, a circumferential projection315extending in the tire circumferential direction is arranged on the tire outer surface1dsof the tire side portion1d.Therefore, the tire1includes the turbulence-generating projections310and the circumferential projection315. The tire outer surface1dsof the tire side portion1dis configured by a tire outer surface3A, a tire outer surface3B, and a tire outer surface3C. The tire outer surface3A of the tire side portion1dis the surface between the tire outer surface3B and the tire outer surface3C in the tire radial direction. The tire outer surface3B of the tire side portion1dis the surface located on the tire radial inner side of the turbulence-generating projections310. The tire outer surface3C of the tire side portion1dis the surface located on the tire radial outer side of the circumferential projection315.", "", "The tire1has a maximum tire width that is the maximum length of tire1in the tire width direction. The maximum tire width referred to here does not, for example, include the maximum width between rim guards in the tire width direction in a tire that is provided with rim guards. In other words, the maximum tire width does not include the rim guards. The height of the tire maximum width position (maximum width height SWH) with respect to the height of the inner end of the bead portion1cin the radial direction is located at 48% or more of the height of the tread surface (tread surface height TH) on the tire equatorial plane CL with respect to the height of the inner end of the bead portion1cin the radial direction when the tire is not inflated.", "", "In the tire side portion1d,the tire1has a tire maximum width region TR (FIG.21) that includes the tire maximum width position at which the length of the tire1in the tire width direction is maximized. In other words, the maximum width region TR is the surface of the tire side portion1d,in the tire radial direction, located at a height including the maximum width height SWH (FIG.21). The range of the tire maximum width region TR in the tire radial direction is a region within 25% of the tread surface height TH. The tire maximum width position (indicated by a dashed dotted line inFIG.21) is located at the tire radial center of the tire maximum width region TR.", "", "For example, the maximum width region TR in the tire radial direction is a range of 60 mm. In this case, the range of the tire maximum width region TR in the tire radial direction is centered on the tire maximum width position and extends 30 mm outward in the tire radial direction and 30 mm inward in the tire radial direction.", "", "FIG.19is a partially enlarged view of the turbulence-generating projection310illustrated inFIG.18.FIG.20Ais a partially enlarged view of the turbulence-generating projection310illustrated inFIG.18.FIG.20Bis a cross-sectional view orthogonal to the extending direction of the turbulence-generating projection310illustrated inFIG.20A. Specifically,FIG.20Bis an E-E cross-sectional view ofFIG.20A.FIG.21Ais a partial cross-sectional view of the tire1along the tire width direction and the tire radial direction.FIG.21Bis a partial cross-sectional view of the tire1along the tire width direction and the tire radial direction. Specifically,FIGS.21A and21Bare D-D cross-sectional views ofFIG.19.", "", "In the tire1of the present embodiment, a plurality of turbulence-generating projections310are provided on the tire outer surface3A of the tire side portion1dto generate or promote turbulence, thereby enhancing the cooling effect at the tire side portion1d.", "", "The plurality of turbulence-generating projections310project from the tire outer surface3A of the tire side portion1d,extend along the tire radial direction, and are arranged at intervals in the tire circumferential direction. The turbulence-generating projections310are arranged radially, centering on the tire rotation axis, on the tire outer surface3A of the tire side portion1d,as illustrated inFIG.18. The turbulence-generating projection310extends at an inclination relative to the tire radial direction. Therefore, the length of the turbulence-generating projection310in the extending direction is longer than the length of the turbulence-generating projection310along the tire radial direction. The ends of the turbulence-generating projection310in the tire radial direction have a projection outer end311located on the outer side of the turbulence-generating projection310in the tire radial direction and a projection inner end312located on the inner side of the turbulence-generating projection310in the tire radial direction. The circumferential projection315projects from the tire outer surface3A of the tire side portion1dand extends along the tire circumferential direction. The circumferential projection315is annular as viewed from the tire radial direction.", "", "The turbulence-generating projection310is an elongated projection for generating or promoting turbulence on the tire outer surface1dsof the tire side portion1dduring rotation of the tire1. As illustrated inFIG.21, the projection outer end311, which is the outer end of the turbulence-generating projection310in the tire radial direction, is located in the tire maximum width region TR. The projection outer end311is connected to the circumferential projection315. Specifically, the projection outer end311is connected to the surface on the inner side of the circumferential projection315in the tire radial direction. The projection outer end311is in contact with the surface on the inner side of the circumferential projection315in the tire radial direction.", "", "At the portion where the projection outer end311and the circumferential projection315are connected, a height311H of the projection outer end311relative to the tire outer surface3A of the tire side portion1d(FIG.21B) is lower than a height315H of the circumferential projection315relative to the tire outer surface3A of the tire side portion1d(FIG.21B). In other words, the height315H of the circumferential projection315relative to the tire outer surface3A of the tire side portion1dis higher than the height311H of the projection outer end311relative to the tire outer surface3A of the tire side portion1d.Therefore, a step with different heights along the tire width direction is formed at the portion where the projection outer end311and the circumferential projection315are connected.", "", "The projection inner end312of the turbulence-generating projection310is smoothly connected to the tire outer surface3B of the tire side portion1d,which is on the tire radial inner side of the turbulence-generating projection310. In other words, no step with different heights along the tire width direction is formed at the portion where the projection inner end312and the tire outer surface3B are connected. In the portion where the projection inner end312and the tire outer surface3B are connected, the height of the projection inner end312relative to the tire outer surface3A of the tire side portion1dis the same as the height of the tire outer surface3B relative to the tire outer surface3A of the tire side portion1d.In other words, the projection inner end312of the turbulence-generating projection310is continuous so as to be flush with the tire outer surface3B. Therefore, the rigidity of the projection inner end312can be enhanced to suppress damage, such as chips and broken-off portions. This also suppresses the occurrence of bare portions during manufacturing and reduces the probability of a defective shape or defective appearance.", "", "On the tire outer surface3C of the tire side portion1d,which is on the tire radial outer side of the circumferential projection315, characters and symbols for conveying information are provided.", "", "In the present embodiment, as illustrated inFIG.19, turbulence-generating projections310adjacent to each other are set at predetermined intervals. The projection width, which is the width of the turbulence-generating projection310in the tire circumferential direction, varies so as to widen towards the tire radial outer side (the tread portion la side). Therefore, the centrifugal force generated by tire rotation and vehicle travel causes the fluid moving from the inside to the outside in the tire radial direction to contact the turbulence-generating projection310, thereby enhancing the effect of cooling the temperature of the tire side portion1d.In addition, the fluid moving outward in the tire radial direction can be easily guided to the turbulence-generating projection310adjacent in the tire circumferential direction, thereby enhancing the cooling effect over the entire tire side portion1d.", "", "The shapes of the two sides of the turbulence-generating projection310in the longitudinal direction (i.e., the extending direction of the turbulence-generating projection310) differ from each other. The shape of one side is substantially parallel to the longitudinal direction and is substantially straight. The shape of the other side has a gently sloping portion313, which is substantially parallel to the one side, and a steeply sloping portion314, which is more inclined relative to the longitudinal direction than the gently sloping portion313. The area near the projection outer end311is the steeply sloping portion314. Therefore, the turbulence-generating projection310has an increasingly larger projection width toward the projection outer end311.", "", "Of the width ends311A and311B, which are the ends in the tire circumferential direction of the projection outer end311of the turbulence-generating projection310, one width end311A is formed so that the angle3θe (FIG.19) between a circumferential side3E1extending in the tire circumferential direction and a radial side3E2extending in the tire radial direction is 90° or less.", "", "The projection inner end312of the turbulence-generating projection310includes width ends312A and312B, which are ends in the tire circumferential direction. A line that, when viewed from the tire width direction, passes through the approximate tire circumferential center of the width ends312A and312B and is substantially parallel to the surface on the width end312B side in the tire circumferential direction is designated as a line m (FIG.20A). A line that passes through the boundary between the gently sloping portion313and the steeply sloping portion314and is parallel to the line m is designated as a line n (FIG.20A). The distance311Wa between the line m and the line n is, for example, 1.4 mm in the present embodiment. The distance311Wb between the width end311B and the line m is, for example, 1.2 mm. The projection width311W of the projection outer end311of the turbulence-generating projection310is, for example, 4.7 mm to 7.1 mm.", "", "The distance312Wa between the line m and one width end312A of the width ends312A and312B, which are the ends in the tire circumferential direction of the projection inner end312of the turbulence-generating projection310, is 0.7 mm, for example, in the present embodiment. The distance312Wb between the line m and the other width end312B is, for example, 0.8 mm in the present embodiment. The projection width312W of the projection inner end312is, for example, 1.2 mm to 1.5 mm. The projection width311W of the projection outer end311and the projection width312W of the projection inner end312can be adjusted as needed for each tire size.", "", "The length310L (FIG.20A) in the tire radial direction from the projection outer end311to the projection inner end312of the turbulence-generating projection310is preferably in a range of 8 mm to 30 mm.", "", "In the present embodiment, one side of the turbulence-generating projection310as viewed from the tire width direction is arc-shaped. The radius of curvature Ra of the one side of the turbulence-generating projection310is, for example, constant at 180 mm. As viewed from the tire width direction, the gently sloping portion313has an arc-shaped side surface. The radius of curvature Rb of the side surface of the gently sloping portion313is, for example, constant at 180 mm. As viewed from the tire width direction, the steeply sloping portion314has an arc-shaped side surface. The radius of curvature Rc of the side surface of the steeply sloping portion314is, for example, 0.8 times the length310L. The radius of curvature Rc is preferably in a range of 12 mm to 20 mm. The end of the tire outer surface3B of the tire side portion1din the tire radial direction extends along the tire circumferential direction.", "", "The end of the tire outer surface3B in the outer tire radial direction is arc-shaped when viewed from the tire width direction. The number and pitch angle3θp of the turbulence-generating projections310may be determined by the radius of curvature Rd of the end of the tire outer surface3B on the tire radial outer side. For example, in a case in which the radius of curvature Rd is 147.2 mm to 165.4 mm, the number of turbulence-generating projections310is 90, and the pitch angle3θp is 4 degrees. In a case in which the radius of curvature Rd is 165.5 mm to 176.5 mm, the number of turbulence-generating projections310is 96, and the pitch angle3θp is 3.8 degrees. In a case in which the radius of curvature Rd is 176.6 mm to 183.8 mm, the number of turbulence-generating projections310is 100, and the pitch angle3θp is 3.6 degrees. In a case in which the radius of curvature Rd is 183.9 mm to 220.6 mm, the number of turbulence-generating projections310is 120, and the pitch angle3θp is 3 degrees. In a case in which the radius of curvature Rd is 220.7 mm to 229.8 mm, the number of turbulence-generating projections310is 125, and the pitch angle3θp is 2.9 degrees. In a case in which the radius of curvature Rd is 229.9 mm to 264.7 mm, the number of turbulence-generating projections310is 144, and the pitch angle3θp is 2.5 degrees. In a case in which the radius of curvature Rd is 264.8 mm to 275.7 mm, the number of turbulence-generating projections310is 150, and the pitch angle3θp is 2.4 degrees. In a case in which the radius of curvature Rd is 275.8 mm to 294.1 mm, the number of turbulence-generating projections310is 160, and the pitch angle3θp is 2.3 degrees. In a case in which the radius of curvature Rd is 294.2 mm to 330.9 mm, the number of turbulence-generating projections310is 180, and the pitch angle3θp is 2 degrees. In a case in which the radius of curvature Rd is 331.0 mm to 352.9 mm, the number of turbulence-generating projections310is 192, and the pitch angle3θp is 1.9 degrees. In a case in which the radius of curvature Rd is 353.0 mm to 367.6 mm, the number of turbulence-generating projections310is 200, and the pitch angle3θp is 1.8 degrees.", "", "The pitch angle3θp is the angle between one turbulence-generating projection310and another turbulence-generating projection310adjacent to the one turbulence-generating projection310, with the rotation axis of the tire as the center. Specifically, the pitch angle3θp is the angle formed between lines extending from the rotation axis of the tire through points bisecting the length310L on the lines m of adjacent turbulence-generating projections310.", "", "The angle3θa between a line parallel to the tire radial direction and the line m is preferably in a range of 10° to 45°. In the present embodiment, the angle3θa between the line parallel to the tire radial direction and the line m is, for example, 27°.", "", "As illustrated inFIG.20B, in a cross-section orthogonal to the extending direction of the turbulence-generating projection310, the turbulence-generating projection310and the tire outer surface3A of the tire side portion1dare preferably connected in the shape of an arc. In the present embodiment, the radius of curvature Re of the arc is, for example, 0.4 mm. The angle3θb between the side surface of the turbulence-generating projection310facing the tire circumferential direction and a line parallel to the tire width direction is preferably in a range of 3° to 15°. In the present embodiment, the angle3θb is 10°.", "", "As illustrated inFIG.21B, the height310H of the tire side portion1dfrom the tire outer surface3A is preferably in a range of 0.5 mm to 1.5 mm.", "", "The cooling effect is enhanced by the height310H being 0.5 mm or more. By the height310H being 1.5 mm or less, the depth to the bottom of the recess in the tire mold for forming the turbulence-generating projections310is not deep. Rubber material can thereby easily enter to the bottom of the recess in the tire mold for forming the turbulence-generating projections310. Therefore, the occurrence of bare portions in the turbulence-generating projections310can be suppressed. In the present embodiment, the height310H is, for example, constant at 0.7 mm.", "", "The height315H of the circumferential projection315from the tire outer surface3A is preferably in a range of 0.5 mm to 1.5 mm. By the height315H being 0.5 mm or more, air accumulated in the recess in the tire mold for forming the circumferential projection315is less likely to move into the recess in the tire mold for forming the projection outer end311. Therefore, the occurrence of bare portions in the turbulence-generating projections310can be suppressed. By the height315H being 1.5 mm or less, the length to the bottom of the recess in the tire mold for forming the circumferential projection315is shortened. Rubber material can thereby easily enter to the bottom of the recess in the tire mold for forming the projection outer end311. Therefore, the occurrence of bare portions in the circumferential projection315can be suppressed. In the present embodiment, the height315H is, for example, 0.9 mm. As described above, the height315H is higher than the height310H in the present embodiment.", "", "In the present embodiment, the width of the circumferential projection315in the tire radial direction varies along the tire width direction. Specifically, the width of the circumferential projection315becomes narrower farther outward in the tire width direction. Accordingly, the width315La, in the tire radial direction, of the upper surface315a(the surface facing the tire radial direction) of the circumferential projection315is narrower than the width315Lb, in the tire radial direction, of the circumferential projection315on the tire outer surface1dsof the tire side portion1d.In other words, the shape of the circumferential projection315is trapezoidal in a cross-section along the tire radial direction and the tire width direction. The width315La and the width315Lb preferably satisfy the expressions 0.2 mm≤width315La≤3 mm, and 1.5 mm≤width315Lb≤5.0 mm. By the width315La being 0.2 mm or more and the width315Lb being 1.5 mm or more, the rubber material configuring the circumferential projection315can easily enter the recess in the tire mold for forming the circumferential projection315. Consequently, the occurrence of bare portions in the circumferential projection315can be suppressed. Setting the width315La to 3 mm or less and the width315Lb to 5.0 mm or less enables a reduction in the amount of rubber material used and a reduction in weight of the tire side portion1d.", "", "The width of the circumferential projection315in the tire radial direction is narrower than the maximum width of the turbulence-generating projection310in the tire circumferential direction. In the present embodiment, the maximum width of the turbulence-generating projection310in the tire circumferential direction is the width of the projection outer end311in the tire circumferential direction. In other words, this is the projection width311W of the projection outer end311of the turbulence-generating projection310. Specifically, the maximum width of the turbulence-generating projection310in the tire circumferential direction is the length, in the tire circumferential direction, from one width end311A to the other width end311B. In the present embodiment, the width315La of the circumferential projection315is narrower than the width of the projection outer end311in the tire circumferential direction. Specifically, the width of the projection outer end311in the tire circumferential direction is, for example, 5 mm. The width315La of the circumferential projection315is, for example, 3.0 mm. The width315Lb of the circumferential projection315is narrower than the width of the projection outer end311in the tire circumferential direction.", "", "According to the tire1of the seventh embodiment, the projection outer end311is connected to the circumferential projection315. In other words, in the tire radial direction, the circumferential projection315is located on the outer side of the projection outer end311. Furthermore, the height311H of the projection outer end311relative to the tire outer surface3A of the tire side portion1dis lower than the height315H of the circumferential projection315relative to the tire outer surface3A of the tire side portion1dat a portion at which the projection outer end311of the turbulence-generating projection310and the circumferential projection315are connected in the tire radial direction.", "", "When a raw tire is vulcanized in a tire mold, air that tends to accumulate in the corners of the recess in the tire mold for forming the projection outer end311moves to the recess in the tire mold for forming the circumferential projection315. Therefore, rubber material can reach the bottom of the recess of the tire mold for forming the projection outer end311of the turbulence-generating projection310without being obstructed by air, thereby suppressing the formation of a bare portion at the projection outer end311.", "", "Since the height311H of the projection outer end311relative to the tire outer surface3A of the tire side portion1dis lower than the height315H of the circumferential projection315relative to the tire outer surface3A of the tire side portion1dat a portion at which the projection outer end311and the circumferential projection315are connected, a step with a different heights along the tire width direction is formed between the bottom of the recess for forming the circumferential projection315and the bottom of the recess for forming the projection outer end311. Accordingly, when a raw tire is vulcanized in a mold for forming a tire, air accumulated in the recess for forming the circumferential projection315must cross the step in order to move to the recess for forming the projection outer end311. The air accumulated in the recess for forming the circumferential projection315is pushed to the bottom of the recess for forming the circumferential projection315by the rubber material that enters the recess. Therefore, air accumulated in the recess for forming the circumferential projection315is less likely to cross the step and move into the recess forming the turbulence-generating projection310.", "", "Furthermore, since the height311H of the projection outer end311is lower than the height315H of the circumferential projection315, the rubber material can easily reach the bottom of the recess for forming the projection outer end311.", "", "As a result of these effects, air is less likely to accumulate in the corners of the recesses of the tire mold for forming the projection outer end311, and rubber material can more easily move to enter the recesses of the tire mold for forming the projection outer end311. Therefore, the occurrence of bare portions in the projection outer end311can be suppressed.", "", "The temperature of the tire side portion1dcan be reduced by the turbulence-generating projections310, since the turbulence-generating projections310are provided on the tire side portion1d.Furthermore, the circumferential projection315is provided on the tire side portion1d. Therefore, air having a radial component in the tire radial direction overcomes the circumferential projection315. The air that comes over then flows in a direction substantially perpendicular to the tire outer surface3C on the back side of the circumferential projection315and strikes the tire outer surface3C located on the tire radial outer side of the circumferential projection315. Therefore, the air flow striking the tire outer surface3C exchanges heat with the air flow resting on the tire outer surface3C located on the tire radial outer side of the circumferential projection315. As a result of these effects, a rise in temperature of the tire outer surface1dsof the tire side portion1dcan be suppressed, and the tire durability can be improved.", "", "According to the tire1of the present embodiment, in the tire maximum width region TR, the projection outer end311is connected to the circumferential projection315, and the width of the circumferential projection315in the tire radial direction is narrower than the maximum width of the turbulence-generating projection310in the tire circumferential direction.", "", "In a cross-section along the tire radial direction and the tire width direction, the tire outer surface1dsof the tire side portion1dhas a curved shape. Air flow having a radial component going outward in the tire radial direction thus easily separates from the tire outer surface1dsof the tire1near the tire maximum width region TR. In the tire maximum width region TR, however, the projection outer end311is connected to the circumferential projection315. Hence, when air flow with a radial component overcomes the circumferential projection315, the air flows in the vertical direction relative to the outer surface3C of the tire1(so-called downflow) at the outer side of the circumferential projection315in the tire radial direction. This suppresses the air flow that has a radial component from separating from the tire outer surface3C of the tire, controls the rise in temperature of the tire outer surface3C of the tire1on the outer side of the circumferential projection315in the tire radial direction, and improves the tire durability.", "", "Furthermore, since the width of circumferential projection315in the tire radial direction is narrower than the maximum width of the turbulence-generating projection310in the tire circumferential direction, the amount of rubber material used to configured the tire side portion1ddoes not significantly increase. Therefore, the gauge of the tire side portion1dcan be made thinner, while the occurrence of bare portions in the projection outer end311is suppressed.", "", "According to the tire1of the seventh embodiment, the turbulence-generating projection310extends at an inclination relative to the tire radial direction. Since the turbulence-generating projection310extends at an inclination relative to the tire radial direction, the generation of turbulence is promoted by the relationship between air flowing outward due to centrifugal force and stagnant air, thereby enhancing the cooling effect, as described in WO2009/017167."], "claims": ["a communication device embedded inside a tire side portion; and a plurality of turbulence-generating projections projecting from a tire outer surface of the tire side portion, extending along a tire radial direction, and arranged at intervals in a tire circumferential direction, wherein the communication device overlaps at least one of an inter-projection recess between adjacent turbulence-generating projections and the turbulence-generating projection in a projected plane of the tire side portion in a tire width direction.", "2 . The tire according to claim 1 , wherein the communication device is entirely located within the inter-projection recess in the projected plane of the tire side portion in the tire width direction.", "3 . The tire according to claim 1 , wherein a plurality of uneven surfaces extending along the tire radial direction while undulating in the tire width direction is formed at an apex of the turbulence-generating projection.", "the tire side portion includes a first rigidity portion, in which a first rubber member formed by a rubber member and having a predetermined rigidity is used, and a second rigidity portion in which a second rubber member having a rigidity higher than the predetermined rigidity is used, and the turbulence-generating projections are only provided in the first rigidity portion.", "a projection width, defined as a length of the turbulence-generating projection in the tire circumferential direction, varies in the tire radial direction and widens toward a projection outer end located on a tire radial outer side, and a height of the turbulence-generating projection relative to the tire outer surface of the tire side portion varies in the tire radial direction and is formed to decrease gradually toward the projection outer end.", "the tire side portion has provided thereon a first region in which a plurality of the turbulence-generating projections are arranged adjacent to each other, and a second region at least partially overlapping the first region in the tire circumferential direction and not having any turbulence-generating projections arranged therein, a protrusion projecting from the tire outer surface of the tire side portion is formed in the second region, the protrusion has a shape of characters and symbols displaying information or a shape of figures and patterns displaying a design, and the protrusion has a height from the tire outer surface of the tire side portion that is from 50% to 100% of a height of the turbulence-generating projection from the tire outer surface of the tire side portion.", "a circumferential projection projecting from the tire outer surface of the tire side portion and extending in the tire circumferential direction, wherein an end of the turbulence-generating projection in the tire radial direction is connected to the circumferential projection, and a height of the end of the turbulence-generating projection relative to the tire outer surface of the tire side portion is lower than a height of the circumferential projection relative to the tire outer surface of the tire side portion at a portion at which the end of the turbulence-generating projection and the circumferential projection are connected in the tire radial direction.", "in the tire side portion, the tire has a tire maximum width region that includes a position at which a length of the tire in the tire width direction is maximized, an end of the turbulence-generating projection in the tire radial direction is located in the tire maximum width region, the tire comprises a circumferential projection projecting from the tire outer surface of the tire side portion and extending in the tire circumferential direction, the end of the turbulence-generating projection is connected to the circumferential projection, and a width of the circumferential projection in the tire radial direction is narrower than a maximum width of the turbulence-generating projection in the tire circumferential direction.", "9 . The tire according to claim 1 , wherein the turbulence-generating projection has a maximum width of 4.7 mm to 7.1 mm in the tire circumferential direction.", "10 . The tire according to claim 1 , wherein the turbulence-generating projection has a length of 8 mm to 30 mm in the tire radial direction.", "11 . The tire according to claim 1 , wherein the communication device is an RF tag.", "12 . The tire according to claim 2 , wherein a plurality of uneven surfaces extending along the tire radial direction while undulating in the tire width direction is formed at an apex of the turbulence-generating projection.", "the tire side portion includes a first rigidity portion, in which a first rubber member formed by a rubber member and having a predetermined rigidity is used, and a second rigidity portion in which a second rubber member having a rigidity higher than the predetermined rigidity is used, and the turbulence-generating projections are only provided in the first rigidity portion.", "a projection width, defined as a length of the turbulence-generating projection in the tire circumferential direction, varies in the tire radial direction and widens toward a projection outer end located on a tire radial outer side, and a height of the turbulence-generating projection relative to the tire outer surface of the tire side portion varies in the tire radial direction and is formed to decrease gradually toward the projection outer end.", "the tire side portion has provided thereon a first region in which a plurality of the turbulence-generating projections are arranged adjacent to each other, and a second region at least partially overlapping the first region in the tire circumferential direction and not having any turbulence-generating projections arranged therein, a protrusion projecting from the tire outer surface of the tire side portion is formed in the second region, the protrusion has a shape of characters and symbols displaying information or a shape of figures and patterns displaying a design, and the protrusion has a height from the tire outer surface of the tire side portion that is from 50% to 100% of a height of the turbulence-generating projection from the tire outer surface of the tire side portion.", "a circumferential projection projecting from the tire outer surface of the tire side portion and extending in the tire circumferential direction, wherein an end of the turbulence-generating projection in the tire radial direction is connected to the circumferential projection, and a height of the end of the turbulence-generating projection relative to the tire outer surface of the tire side portion is lower than a height of the circumferential projection relative to the tire outer surface of the tire side portion at a portion at which the end of the turbulence-generating projection and the circumferential projection are connected in the tire radial direction.", "in the tire side portion, the tire has a tire maximum width region that includes a position at which a length of the tire in the tire width direction is maximized, an end of the turbulence-generating projection in the tire radial direction is located in the tire maximum width region, the tire comprises a circumferential projection projecting from the tire outer surface of the tire side portion and extending in the tire circumferential direction, the end of the turbulence-generating projection is connected to the circumferential projection, and a width of the circumferential projection in the tire radial direction is narrower than a maximum width of the turbulence-generating projection in the tire circumferential direction.", "18 . The tire according to claim 2 , wherein the turbulence-generating projection has a maximum width of 4.7 mm to 7.1 mm in the tire circumferential direction.", "19 . The tire according to claim 3 , wherein the turbulence-generating projection has a maximum width of 4.7 mm to 7.1 mm in the tire circumferential direction.", "20 . The tire according to claim 4 , wherein the turbulence-generating projection has a maximum width of 4.7 mm to 7.1 mm in the tire circumferential direction."], "bibtex": "@patent{20240351377,\n    title = {TIRE},\n    number = {20240351377},\n    year = {2024},\n    note = {File: US20240351377A1-20241024.XML}\n    }", "classification": "B60C1302FI"}]