[{"title": "WINDSCREEN INSTALLATION APPARATUS AND METHOD", "doc_number": "20250114915", "filename": "US20250114915A1-20250410.XML", "abstract": "A side window mount assembly is provided for use in handling windscreens, which includes a vehicle anchor device for securing to a vehicle side window, a platform mechanically secured to the vehicle anchor device, a raising and lowering index hub supported by the platform, a connecting arm extending from the raising and lowering index hub, and a mount structure operably coupled to the connecting arm. The mount structure is configured to engage a support arm of a windscreen anchor assembly. The raising and lower index hub controls index rotation of the connecting arm that moves the mount structure between a dropped down and a raised-up position in an index-wise manner between a series of successively rotationally spaced positions of the raising and lowering index hub.", "detailed_description": [""], "claims": ["a vehicle anchor device for securing to a vehicle side window; a platform mechanically secured to the vehicle anchor device; a raising and lowering index hub supported by the platform; a connecting arm extending from the raising and lowering index hub; and a mount structure operably coupled to the connecting arm, wherein the mount structure is configured to engage a support arm of a windscreen anchor assembly; wherein the raising and lower index hub controls index rotation of the connecting arm that moves the mount structure between a dropped down and a raised-up position-in an index-wise manner between a series of successively rotationally spaced positions of the raising and lowering index hub.", "2 . The side window mount assembly according to claim 1 , wherein the raising and lowering index hub further comprises securing means for securing the raising and lowering index hub in a desired rotational position.", "3 . The side window mount assembly according to claim 1 , wherein the raising and lowering index hub has a meshing gear lock arrangement configured to securely engage meshed gear parts in different arcuate positions.", "4 . The side window mount assembly according to claim 1 , further comprising a pivot hub mounted to the connecting arm opposite the raising and lower index hub, wherein the pivot hub is configured to move the mount structure from side to side.", "5 . The side window mount assembly according to claim 1 , wherein the vehicle anchor device comprises a sucker device with a bracket, and wherein the platform is mounted on the bracket.", "6 . The side window mount assembly according to claim 1 , wherein the connecting arm is rotationally mounted in an end bearing secured to the platform by a frame.", "7 . The side window mount assembly according to claim 6 , wherein the frame has an arcuate geared rail that is configured to mesh to a locking gear mounted to the connecting arm.", "8 . The side window mount assembly according to claim 7 , wherein the locking gear is configured to selectively mesh to the geared rail by operation of a locking cam.", "9 . The side window mount assembly according to claim 8 , wherein rotation of the connecting arm is prohibited when the locking gear is configured to mesh to the geared rail, and rotation of the connecting arm is permitted when the locking gear is configured to not mesh to the geared rail.", "10 . The side window mount assembly according to claim 8 , wherein the locking gear is configured to selectively mesh to the geared rail over a range of angular orientations of the locking gear.", "11 . The side window mount assembly according to claim 8 , wherein the locking cam is connected to a cam handle, and operation of the locking cam is controlled by manual adjustment of the cam handle.", "12 . The side window mount assembly according to claim 11 , wherein the operation of the locking cam is controlled by manual adjustment of rotational position of the cam handle.", "13 . The side window mount assembly according to claim 1 , wherein the vehicle side window comprises a passenger side window or a driver side window."], "bibtex": "@patent{20250114915,\n    title = {WINDSCREEN INSTALLATION APPARATUS AND METHOD},\n    number = {20250114915},\n    year = {2025},\n    note = {File: US20250114915A1-20250410.XML}\n    }", "classification": "B60J100FI"}, {"title": "RIM SPOKE", "doc_number": "20250115075", "filename": "US20250115075A1-20250410.XML", "abstract": "Provided is a rim spoke, including a spoke rope and nipples. Mounting heads are fixedly sleeved on both ends of the spoke rope; through mounting holes are formed in the nipples; the nipples are fixedly sleeved on the mounting heads by means of the mounting holes; and the spoke rope is made of a textile fiber material. When the textile fiber spoke rope in a high tension state is subjected to a heavy impact, part of an impact force is cushioned due to the flexibility and strength margin of the spoke rope itself, so that the original characteristics of the spoke rope can still be kept under an extreme impact force without irreversible deformation, thereby reducing riding failure rate of riding, ensuring the riding safety, reducing the daily maintenance requirement of a wheel, and reducing costs.", "detailed_description": ["In order to make the objectives, technical solutions and advantages of the present disclosure more clearly, the present disclosure is further described in detail below with reference to the accompanying drawings and the embodiments. It should be understood that specific embodiments described here are only used to illustrate rather than limiting the present disclosure.", "", "In the description of the present disclosure, it needs to be understood that the orientation or positional relationship indicated by terms “upper”, “lower”, “left”, “right”, “vertical”, “horizontal”, “inside” and “outside” is based on the orientation or positional relationship shown in the drawings only for convenience of description of the present disclosure and simplification of description rather than indicating or implying that the apparatus or element referred to must have a particular orientation, be constructed and operate in a particular orientation, and thus are not to be construed as limiting the present disclosure."], "claims": ["1 . A rim spoke, comprising a spoke rope and nipples, wherein mounting heads are fixedly sleeved on both ends of the spoke rope; through mounting holes are formed in the nipples; and the nipples are fixedly sleeved on the mounting beads by means of the mounting holes.", "2 . The rim spoke according to claim 1 , wherein the spoke rope is made of a textile fiber material.", "3 . The rim spoke according to claim 2 , wherein the spoke rope is made by braiding of a plurality of textile fiber ropes.", "4 . The rim spoke according to claim 1 , wherein each of the mounting holes is a tapered hole with an inner diameter increasing from inside to outside, each of the mounting heads has a uniform outer diameter, and the outer diameter of each of the mounting heads is in fit with a maximum inner diameter of the mounting hole.", "5 . The rim spoke according to claim 1 , wherein an outer end of each of the nipples is provided with a threaded structure, and each of the nipples is inserted into a spoke hole of a rim or a hub to be in fit with a nut, so as to connect the spoke rope to the rim or the hub.", "6 . The rim spoke according to claim 1 , wherein each of the mounting heads is provided with a through sleeving hole, and an outer wall of each of the mounting heads is radially provided with a pressing opening communicating with the sleeving hole; an end of the spoke rope is inserted into the sleeving hole, the pressing opening forms a closed compact structure by means of an adhesive and pressing of a machine platform, and the closed compact structure is configured to fix the spoke rope.", "7 . The rim spoke according to claim 1 , wherein the mounting heads and the nipples are made of metal materials."], "bibtex": "@patent{20250115075,\n    title = {RIM SPOKE},\n    number = {20250115075},\n    year = {2025},\n    note = {File: US20250115075A1-20250410.XML}\n    }", "classification": "B60B104FI"}, {"title": "WHEEL DISK", "doc_number": "20250115076", "filename": "US20250115076A1-20250410.XML", "abstract": "It is an objective of the present invention to reduce weight further in a wheel disk 1 for vehicle. A hat portion 20 of the wheel disk 1 for vehicle includes an annular top portion 21, an inner peripheral portion 22 and an outer peripheral portion 23. The inner peripheral portion 22 connects the top portion 21 and a hub attachment portion 10. The outer peripheral portion 23 connects the top portion 21 and welding flanges 30 and connects the top portion 21 and the window-forming flanges 40. The welding flanges 30 are welded to an inner periphery of a wheel rim 2. Windows 5 are formed between the window-forming flanges 40 and the inner periphery of the wheel rim 2. The outer peripheral portion 23 of the hat portion 20 includes first regions 231 and second regions 232 alternately in a circumferential direction. The first regions 231 are connected to the welding flanges 30 and the second regions 232 are connected to the window-forming flanges 40. Connecting portions 45 connecting the second regions 232 and the window-forming flanges 40 are protruded outward in an axial direction with respect to corresponding portions 231 a of the first regions 231. The connecting portions and the corresponding portions are disposed at equal distances from a wheel central axis L.", "detailed_description": [""], "claims": ["a hub attachment portion; a hat portion disposed adjacent to the hub attachment portion outside in a radial direction, the hat portion protruded outward in an axial direction, the hat portion comprising an annular top portion, an inner peripheral portion connecting the top portion and the hub attachment portion and an outer peripheral portion disposed outside of the top portion in the radial direction; a plurality of welding flanges and a plurality of window-forming flanges disposed alternately in a peripheral edge of the outer peripheral portion of the hat portion, the welding flanges and the window-forming flanges extending inward in the axial direction, wherein the welding flanges are welded to an inner periphery of a wheel rim, wherein the window-forming flanges are configured to form windows between the window-forming flanges and the inner periphery of the wheel rim, wherein the outer peripheral portion of the hat portion comprises first regions connected to the welding flanges and second regions connected to the window-forming flanges wherein the first regions and the second regions are disposed alternately in a circumferential direction, wherein the second regions are connected to the window-forming flanges via connecting portions, the connecting portions are protruded outward in the axial direction with respect to corresponding portions of the first regions over ranges at least including centers of the connecting portions in the circumferential direction and wherein the connecting portions and the corresponding portions are disposed at equal distances from a wheel central axis.", "2 . The wheel disk according to claim 1 , wherein the connecting portions are protruded outward in the axial direction with respect to the corresponding portions of the first regions over entire lengths in the circumferential direction.", "3 . The wheel disk according to claim 1 , wherein the first regions extend from the top portion toward the welding flanges such that the first regions are inclined inward in the axial direction and wherein the second regions extend from the top portion in the radial direction toward the window-forming flanges such that the second regions are inclined outward in the axial direction.", "4 . The wheel disk according to claim 1 , wherein the outer peripheral portion of the hat portion comprises transition regions between the first regions and the second regions and wherein the transition regions are inclined inward in the axial direction from the second regions toward the first regions along the circumferential direction.", "5 . The wheel disk according to claim 4 , wherein as differences between locations of the first regions and locations of the second regions in the axial direction are increased toward outside in the radial direction, widths of the transition regions in the circumferential direction are increased toward outside in the radial direction.", "6 . The wheel disk according to claim 1 , wherein the wheel disk is formed by drawing a blank having a configuration of a flat plate of a square shape having four corners thereof cut off in arc-like configurations, wherein the welding flanges are formed of vicinity portions of four sides of the blank having circular-arc configurations, wherein the window-forming flanges are formed of vicinity portions of four sides of the blank having straight-line configurations and wherein intersection portions connecting the welding flanges and the window-forming flanges extend in the axial direction."], "bibtex": "@patent{20250115076,\n    title = {WHEEL DISK},\n    number = {20250115076},\n    year = {2025},\n    note = {File: US20250115076A1-20250410.XML}\n    }", "classification": "B60B304FI"}, {"title": "WIND-BREAKING RIM, WHEEL AND BICYCLE", "doc_number": "20250115077", "filename": "US20250115077A1-20250410.XML", "abstract": "The disclosure provides a wind-breaking rim, a wheel and a bicycle. The wind-breaking rim includes a plurality of rim wave profiles. The plurality of rim wave profiles extend from an inner ring spoke mounting portion to two rim side walls and are symmetrically distributed with a rim width center surface as a plane of symmetry. The plurality of rim wave profiles are continuously arranged to form an annular wind-breaking structure. The rim wave profiles include adjacent crest portions and trough portions. A rim inner ring and the rim side walls having wave profiles can greatly reduce wind resistance.", "detailed_description": [""], "claims": ["1 . A wind-breaking rim, comprising an outer ring tire mounting portion for mounting a tire, an inner ring spoke mounting portion for mounting spokes, and two rim side walls oppositely arranged between the outer ring tire mounting portion and the inner ring spoke mounting portion, the wind-breaking rim having a rim width center surface in a rim width direction, wherein the wind-breaking rim further comprises a plurality of rim wave profiles, the plurality of rim wave profiles extending from the inner ring spoke mounting portion to the two rim side walls and being symmetrically distributed with the rim width center surface as a plane of symmetry, the plurality of rim wave profiles being continuously arranged to form an annular wind-breaking structure, and the plurality of rim wave profiles comprising adjacent crest portions and trough portions.", "2 . The wind-breaking rim according to claim 1 , wherein the plurality of rim wave profiles extend from the inner ring spoke mounting portion to the two rim side walls such that the inner ring spoke mounting portion and the two rim side walls respectively form a concave-convex wave surface, wherein an inner ring wave surface of the inner ring spoke mounting portion comprises adjacent inner ring crest portions and inner ring trough portions, a side wall wave surface of each of the two rim side walls comprises adjacent side wall crest portions and side wall trough portions, the side wall crest portions respectively being connected with the inner ring crest portions, and the side wall trough portions respectively being connected with the inner ring trough portions.", "3 . The wind-breaking rim according to claim 2 , wherein the wind-breaking rim has a central axis of rotation, crest lines of the side wall crest portions are radial arc curves around the central axis, trough lines of the side wall trough portions are second radial arc curves around the central axis, and the radial arc curves and the second radial arc curves are each a part of a logarithmic spiral or a part of a parabola.", "4 . The wind-breaking rim according to claim 2 , wherein crest lines of the side wall crest portions and trough lines of the side wall trough portions extend from the inner ring spoke mounting portion to the outer ring tire mounting portion, a height of the side wall crest portions gradually decreasing as the side wall crest portions extend from the inner ring spoke mounting portion to the outer ring tire mounting portion, and a depth of the side wall trough portions gradually decreasing as the side wall trough portions extends from the inner ring spoke mounting portion to the outer ring tire mounting portion.", "5 . The wind-breaking rim according to claim 4 , wherein the height of the side wall crest portions decreases to zero at the outer ring tire mounting portion, and the depth of the side wall trough portions decreases to zero at the outer ring tire mounting portion.", "6 . The wind-breaking rim according to claim 2 , wherein spoke mounting holes are each respectively located at the inner ring crest portions.", "7 . The wind-breaking rim according to claim 1 , wherein the outer ring tire mounting portion, inner ring spoke mounting portion and the two rim side walls form a cavity and are integrally formed.", "8 . The wind-breaking rim according to claim 7 , wherein the outer ring tire mounting portion, the inner ring spoke mounting portion and the two rim side walls are made of carbon fibers.", "9 . A wheel, comprising the wind-breaking rim according to claim 1 and further comprising a hub and a plurality of spokes, wherein the hub is located in a middle of the wind-breaking rim, a first end of each of the plurality of spokes is connected to or integrally formed to the hub, and a second end of each of the plurality of spokes is connected to or integrally formed to the inner ring spoke mounting portion.", "10 . A bicycle, comprising the wheel according to claim 9 ."], "bibtex": "@patent{20250115077,\n    title = {WIND-BREAKING RIM, WHEEL AND BICYCLE},\n    number = {20250115077},\n    year = {2025},\n    note = {File: US20250115077A1-20250410.XML}\n    }", "classification": "B60B2102FI"}, {"title": "TIRE ASSEMBLY WITH CIRCUMFERENTIAL SHAPE MEMORY ALLOY CONFIGURATION", "doc_number": "20250115078", "filename": "US20250115078A1-20250410.XML", "abstract": "A tire assembly that includes a tread portion, a rim, and at least a first band assembly positioned between the tread portion and the rim. The first band assembly includes a first SMA element having an outer surface and a first bead member having an outer surface. The first SMA element extends circumferentially about the tire assembly and the first bead member extends circumferentially about the tire assembly. The first band assembly also includes a plurality of fiber reinforcement members. Each of the plurality of fiber reinforcement members extend around the outer surface of the first SMA element and the outer surface of the first bead member to form the first band assembly.", "detailed_description": ["The following description and drawings are illustrative and are not to be construed as limiting. Numerous specific details are described to provide a thorough understanding of the disclosure. However, in certain instances, well-known or conventional details are not described in order to avoid obscuring the description. References to one or an embodiment in the present disclosure can be, but not necessarily are references to the same embodiment; and, such references mean at least one of the embodiments. If a component is not shown in a drawing then this provides support for a negative limitation in the claims stating that that component is “not” present. However, the above statement is not limiting and in another embodiment, the missing component can be included in a claimed embodiment.", "", "Reference in this specification to “one embodiment,” “an embodiment,” “a preferred embodiment” or any other phrase mentioning the word “embodiment” means that a particular feature, structure, or characteristic described in connection with the embodiment is included in at least one embodiment of the-disclosure and also means that any particular feature, structure, or characteristic described in connection with one embodiment can be included in any embodiment or can be omitted or excluded from any embodiment. The appearances of the phrase “in one embodiment” in various places in the specification are not necessarily all referring to the same embodiment, nor are separate or alternative embodiments mutually exclusive of other embodiments. Moreover, various features are described which may be exhibited by some embodiments and not by others and may be omitted from any embodiment. Furthermore, any particular feature, structure, or characteristic described herein may be optional. Similarly, various requirements are described which may be requirements for some embodiments but not other embodiments. Where appropriate any of the features discussed herein in relation to one aspect or embodiment of the invention may be applied to another aspect or embodiment of the invention. Similarly, where appropriate any of the features discussed herein in relation to one aspect or embodiment of the invention may be optional with respect to and/or omitted from that aspect or embodiment of the invention or any other aspect or embodiment of the invention discussed or disclosed herein.", "", "The terms used in this specification generally have their ordinary meanings in the art, within the context of the disclosure, and in the specific context where each term is used. Certain terms that are used to describe the disclosure are discussed below, or elsewhere in the specification, to provide additional guidance to the practitioner regarding the description of the disclosure. For convenience, certain terms may be highlighted, for example using italics and/or quotation marks: The use of highlighting has no influence on the scope and meaning of a term; the scope and meaning of a term is the same, in the same context, whether or not it is highlighted.", "", "It will be appreciated that the same thing can be said in more than one way. Consequently, alternative language and synonyms may be used for any one or more of the terms discussed herein. No special significance is to be placed upon whether or not a term is elaborated or discussed herein. Synonyms for certain terms are provided. A recital of one or more synonyms does not exclude the use of other synonyms. The use of examples anywhere in this specification including examples of any terms discussed herein is illustrative only, and is not intended to further limit the scope and meaning of the disclosure or of any exemplified term. Likewise, the disclosure is not limited to various embodiments given in this specification.", "", "Without intent to further limit the scope of the disclosure, examples of instruments, apparatus, methods and their related results according to the embodiments of the present disclosure are given below. Note that titles or subtitles may be used in the examples for convenience of a reader, which in no way should limit the scope of the disclosure. Unless otherwise defined, all technical and scientific terms used herein have the same meaning as commonly understood by one of ordinary skill in the art to which this disclosure pertains. In the case of conflict, the present document, including definitions, will control.", "", "It will be appreciated that terms such as “front,” “back,” “top,” “bottom,” “side,” “short,” “long,” “up,” “down,” “aft,” “forward” and “below” used herein are merely for ease of description and refer to the orientation of the components as shown in the figures. It should be understood that any orientation of the components described herein is within the scope of the present invention.", "", "The figures are generally directed to a tire assembly10. In some embodiments, the tire assembly10may instead be characterized as an SMA assembly that may be used for other purposes where air or pneumatic pressure would otherwise be used within a polymer structure. Since the tire assembly10is functional without air or pneumatic pressure, use of the tire assembly10is advantageous in rugged terrain where conventional tires are prone to flats and environments where air is lacking or not present (e.g., space, other planets, moons, etc.). In addition to enhanced durability, the tire assembly10advantageously provides lower rolling resistance than pneumatic tires, which contribute to greater fuel efficiency in vehicles. The use of the SMA assembly as the tire assembly10is only exemplary and is not a limitation on the present invention. In a preferred embodiment, the SMA tire assembly10generally includes a toroidal SMA structure12encapsulated in a polymer member or structure14(such as polyurethane) and then bonded to a polymer outer tread16. It will be appreciated that the SMA structure12may be other enclosed or unenclosed shapes, such as tubular, spherical, helical etc.", "", "FIG.1is a perspective view of the tire assembly10. The tire assembly10may be shaped and sized for various use including but not limited to automobiles, bicycles, aircraft, motorcycles, and, scooters. The tire assembly10may have a recessed or indented inner surface11. The recess or indentation of the inner surface11may allow the tire assembly10to be mated with a wheel or a rim18to then be attached to a vehicle. The tire assembly10may include the SMA structure12and the polymer member14. The SMA structure12is shown inFIG.1as a spring toroid encased with a polymer (e.g., rubber) outer tread16to form an airless tire. The", "", "The SMA structure12may include SMA elements. The SMA elements may collectively form the SMA structure. In some examples, the SMA elements may be uniform in size, shape, and/or material properties. In some examples, the SMA elements may be different than each other in size, shape, and/or material properties. For example, an SMA element may be a wire, a spring, a sheet, a fiber, foam, and/or the like. The SMA element may include one or more of NiTi, Ag—Cd, Au—Cd, Cu—Al—Ni, Cu—Sn, Cu—Zn, Fe—Pt, Mn—Cu, Fe—Mn—Si, Co—Ni—Al, Co—Ni—Ga, Ni—Fe—Ga, Ti—Nb, B—Ti alloys, or ternary alloys or quaternary alloys of a material of the SMA element. The SMA elements may be attached together to form the SMA structure12. For example, the SMA elements may be interwoven with each other.", "", "The polymer outer tread16may be disposed over the SMA structure12. The polymer outer tread16may enclose an outer surface13of the SMA structure12. The polymer outer tread16may be rubber and/or another material having similar properties to rubber. The polymer outer tread16may have protrusions, bumps, threads, grooves, channels, cavities, and/or the like to provide additional grip.", "", "FIG.2is a sectional view of the SMA structure12. The SMA structure12includes a first spring20and a second spring22.FIG.3is a sectional view of the first spring20.FIG.4is a sectional view of multiple interwoven second springs22. In some examples, the first spring20and/or second spring22may be replaced with a wire, sheet, fiber, or foam. Referring back toFIG.2, the second spring22may be woven or threaded around the first spring20along a length of the first spring20in the directions of the arrows24. There may be multiple second springs22woven or threaded around the first spring20. The second springs22may also be woven or threaded around each other.FIG.5is a magnified view of the SMA structure12showing the connection between the first spring20and the second springs22. Referring back toFIG.2, the first spring20may have a first diameter26. The second spring22may have a second diameter28. The first diameter26may be greater than the second diameter28. The second springs22may be disposed around an entirety of the first diameter26. The second springs22being connected to the first spring20as shown inFIG.2maintains a pitch30of the first spring20constant. Prior to assembling the first spring20and the second springs together22, the pitch30may be varied to render the tire assembly10(seeFIG.1) harder or softer.", "", "In some examples, the SMA structure12may include or have an outer, thin, practically or nearly monomolecular microporous metal coating thereof selected from at least one of zirconium, cerium, lanthanum, nickel, cobalt, tin, titanium, zinc, copper, brass and/or bronze plated. In some examples, a second layer of coating (of any of the materials described above) may be applied, using the same or a different metal. In some examples, a benzotriazole or another corrosion inhibitor may be applied to the SMA structure12.", "", "In some examples, a prepolymer or resin may be applied to the SMA structure12by using a pre-formed mold and a curing process. In some examples, the curing process may include rotational molding, rotational casting, spin casting, injection molding, extrusion, blow molding, thermoforming, expanded bead foam molding, or extruded foam molding.", "", "FIG.6is a sectional view of the tire assembly10showing the SMA structure12encapsulated in the polymer member14. The polymer member14may be disposed between the first spring20and the second springs22such that the space defined by the first diameter26(seeFIG.2) remains hollow. Any polymer is within the scope of the present invention. For example, the polymer member14may be one of natural rubber, synthetic rubber, vulcanized rubber, polyurethane, nylon, acrylic, or another thermoset or thermoplastic polymer.", "", "In some examples, the polymer member14may be 3D printed or additively manufactured onto the SMA structure12. In some examples, the SMA structure12may be bonded to the polymer member14using a vulcanizing adhesive, solvent-based adhesive, water-based adhesive, or epoxy. For instance, Chemlok® may be used to bond the SMA structure12and the polymer member14together.", "", "FIG.7is a cross-sectional view of the tire assembly10showing the SMA structure12encapsulated by the polymer member14as well as the polymer outer tread16. The polymer outer tread16may provide additional reinforcement to the tire assembly10. The polymer outer tread16may be bonded directly to the polymer member14. The polymer material or materials of the polymer member14may be different than those of the polymer outer tread16. It will be appreciated that the polymer outer tread16may entirely cover the polymer member14and the SMA structure12.", "", "FIG.8is a side view of the tire assembly10. The polymer outer tread16may partially cover the polymer member14and the SMA structure12as shown inFIG.8. In some examples, the polymer outer tread16may not be enclosing the polymer member14and the SMA structure12at or near mating surfaces of the rim18and the tire assembly10. A bicycle rim is shown inFIG.8by example.", "", "FIG.9is a cut-off perspective view of an SMA wire32under a layer of sheathing material34. The SMA wire32may be utilized in lieu of the first spring20(seeFIG.5) and/or the second spring22(seeFIG.5) to form an SMA structure. The SMA wire32may be used as a core of a drawn filled tube36. The drawn filled tube36may include the sheathing material34. The sheathing material34may be a metal or a polymer. In some examples, the sheathing material34may be same as the material of the polymer member14(seeFIG.8) and/or the polymer outer tread16(seeFIG.8). In some examples, the sheathing material34may be same as the material of the SMA wire32.", "", "FIGS.10-17show another embodiment of the present invention where the tire assembly50includes or incorporates SMA elements52that are configured in a circumferentially extending configuration with attachments (e.g., semi-rigid attachments) to the rim and/or beads or bead members. The tire assembly50may be used with any type of vehicle, but is preferably used with a bicycle, automobile or the like. In a preferred embodiment, the tire assembly is used with existing hardware (e.g., rim, etc.), however, this is not a limitation on the present invention.", "", "As shown inFIG.11-12, in a preferred embodiment, the tire assembly50may include a number of interrelated and interacting components, including the circumferential SMA elements52(which may include any cross-sectional shape), polymer member or polymer ply member54that includes the fibers56as reinforcements therein (referred to as fiber reinforcements56), one or more belts60, tire beads or bead members58and the tread16. In a preferred embodiment, the polymer member54is configured in a band with the fiber reinforcements56therein and may be referred to herein as a fiber reinforced polymer assembly53. The fiber reinforced polymer assembly53together with the outer circumferential SMA elements52and inner circumferential bead members58may be referred to herein as a ply or band assembly55. The SMA elements52may be tubular, shape set and welded. However, this is not a limitation on the present invention. The SMA elements may include any cross-sectional shape, such as tubular (FIG.12), U-shaped (FIG.13), semi-circular, I-beam, non-hollow circular or any other desired shape. The fiber reinforcements may be SMA elements, Kevlar, nylon, polyester or similar material or chord and as may be known in the tire industry and embedded within the polymer54(similar to polymer14), which may be rubber, polyurethane, polymer or the like. None of the materials discussed herein are limitations on the present invention. The tire beads58may be a series of circumferentially extending welded tubes made of a metal, such as steel, aluminum, titanium or SMA, for example. The bead members58may also be solid wires, cables or may be any cross-sectional shape. The tubes may be received or set in individual circumferentially extending grooves, a plurality of grooves or a single groove64(seeFIG.13) in the inner surface of the rim18. The U-shaped structure shown inFIG.13may help with manufacturing of the SMA elements52(or bead members) as it may be easier (and cheaper) to use a sheet of SMA that can be rolled into a U-shape cross-section instead of creating a full tube.", "", "As shown inFIG.11, in a preferred embodiment, the tire assembly50includes the tread member or portion16, rim18, and at least a first band assembly55positioned between the tread portion16and the rim18. The band assembly55includes at least a first SMA element52having an outer surface52aand may extend circumferentially about the tire assembly55, as shown inFIG.12. The band assembly55may also include at least a first bead member58having an outer surface58and that extends circumferentially about the tire assembly50. In another embodiment, the inner portion of the band assembly55if secured to the rim18or other component, as opposed to being wrapped around or extending around the a bead. The tire assembly50also may include a plurality of fiber reinforcements or fiber reinforcement members56. The fiber reinforcement members56may extend around the outer surface of the first SMA element52and the outer surface of the first bead member58to at least partially form the band assembly55. In an embodiment where individual fiber reinforcement members56extend around the SMA element(s)52and the bead member58, the band assembly55is formed by the fiber reinforcement members56and the SMA element(s)52and the bead member58(and the polymer is omitted). Preferably, the entire set of the plurality of fiber reinforcement members56extend circumferentially about the tire assembly. In other words, each individual fiber reinforcement member36extends around at least one SMA element52and at least one bead member. However, the individual fiber reinforcement members56are positioned adjacent to one another around the circumference, as is best shown inFIG.11with the fiber reinforcement members56positioned next to each other.", "", "In a preferred embodiment, the plurality of fiber reinforcement members56are disposed, embedded, encased or otherwise associated with a polymer ply member54to together form the fiber reinforced polymer assembly53that extends around the outer surface of the first SMA element52and the outer surface of the first bead member58. As shown inFIG.11, in an embodiment of the invention, the fiber reinforced polymer assembly53may take the form of a tubular configuration that extends circumferentially about the tire assembly. The tubular configuration does not have to be circular, but can be any enclosed configuration, as shown inFIG.11or13-16, etc. In another embodiment, as shown inFIG.17, instead of a continuous circumferential tube, the fiber reinforced polymer assembly82can be formed by a wrap extending around the SMA element(s)52on the outside and the bead member(s)58on the inside. See the edges62of the wrap showing that the wrap is spiraled around the SMA element(s)52on the outside and the bead member(s)58on the inside. Therefore, the fiber reinforced polymer assembly may comprises a wrapped spiral configuration that extends circumferentially about the tire assembly. The wrap includes the fiber reinforcement members or cords therein, and may be, for example, a one inch wide strip that starts as a roll and is wrapped around the SMA element(s) and bead member(s), during manufacture.", "", "FIG.10shows the tire assembly50with a portion cut away.FIG.10also shows the tire assembly50with sidewalls17. For ease of illustrating the inner portion of the tire assembly, the sidewalls are omitted in the other views. However, it will be appreciated that the tire portion of the tire assembly (e.g., the rubber of the tire) may include an outer portion (that includes or is the tread portion16) and first and second sidewalls17that enclose or house the SMA assembly19(which includes the one or more laterally adjacent band assemblies55). It will be appreciated that the tread portion does not have to include actual treads thereon, but is referred to the tread portion herein as it is the portion of the tire that contacts the ground or road. The SMA may include a band, housing, enclosure or structure therearound to hold all the components thereof (e.g., the band assemblies55) together.FIGS.11and13-16show close-ups of the fiber reinforced polymer assemblies53and the band assemblies55. InFIG.11, the fiber reinforced polymer assembly53(which includes the fiber reinforcements56embedded in the polymer54) extends around an SMA element52at the outer end (at or near the outer circumference of the tire assembly) and around a bead member58at the inner end (at or near the inner circumference of the tire assembly), thus forming the band assembly55.FIG.12shows that an SMA element52and a bead member58extending circumferentially around the tire assembly50. As shown inFIG.11, the fiber reinforced polymer assemblies53extend around the OD of the SMA elements52and the bead members58. The separate fiber reinforcements56within the fiber reinforced polymer assemblies53are evident at the top ofFIG.13.", "", "FIGS.11and13show an exemplary embodiment that includes twelve band assemblies55configured laterally to partially form the tire assembly50. However, this is only exemplary and any number of band assemblies55are within the scope of the present invention. In this embodiment, the fiber reinforced polymer assemblies53extend vertically from a bead member58to the vertically adjacent SMA element52or tube. In another embodiment, the fiber reinforced polymer assemblies53can extend diagonally or at an angle from a bead member58to an SMA element52that is not vertically adjacent. For example, when viewingFIG.13, the fiber reinforced polymer assembly53associated with the left-most bead member58may extend upwardly to the right at an angle and extend or wrap around the SMA element that is second from the left or any of the other SMA elements that are not directly vertically adjacent thereto. This arrangement can help address lateral forces in the tire assembly when the vehicle goes around a corner. In another embodiment, a fiber reinforced polymer assembly53can extend around one or bead members58at the ID and one or more SMA elements52at the OD. Different arrangements of band assemblies55including any number of bead members58and any number of SMA elements52and at any angle are within the scope of the present invention.", "", "Further to the explanation involving more than one SMA element,FIG.14shows band assemblies66that include two SMA elements68toward the outside of the tire assembly (near the tread) and one bead member58toward the inside of the tire assembly (near the rim).FIG.15includes exaggerated layering to see a fiber reinforcement member56inside the polymer member70and extending around the outer surfaces68aand58aof the first and second SMA elements68and the bead member58. As shown inFIG.15, the fiber reinforced polymer assembly may include an extension portion72that extends inwardly and between the first and second SMA elements68to prevent the SMA elements from rubbing together.FIG.16shows band assemblies74that include three SMA elements76toward the outside of the tire assembly (near the tread) and one bead member58toward the inside of the tire assembly (near the rim). In this arrangement, a portion of the fiber reinforced polymer assembly78extends from the bead member58upwardly at an angle, which provides a lateral force component that helps with cornering and the like. Therefore, if the tire assembly is longitudinally bisected by a plane (e.g., the plane extends up and down with respect to the ground), the right and left sides of the fiber reinforced polymer assembly53extend upwardly at an angle that is non-parallel to the plane. This provides a lateral or horizontal component to the tension provided by the fiber reinforced polymer assembly78. It will be appreciated that inFIGS.14and16, the detail of a number of the components, including the SMA elements53, belt60, fiber reinforced polymer assemblies78and bead members58behind the cut line are not shown and are omitted so as to not complicate the drawings.", "", "In a preferred embodiment, the polymer in the fiber reinforced polymer assemblies is adhered to the outer surface of the bead member(s) and SMA elements to form the band assembly. Furthermore, the fiber reinforced polymer assemblies may be cured such that the adjacent the fiber reinforced polymer assemblies are adhered or otherwise secured together. The fiber reinforcements may spiral around the bead member(s) and SMA elements (within the polymer strip, band or ply) over the 360° of the tire assembly.", "", "It will be appreciated that each fiber reinforced polymer assembly may include multiple layers or plies, each with fiber reinforcement members therein. Furthermore, in any of the ply layers or the polymers, the fiber reinforcement members or cords may extend or run at an angle, as opposed to radially, as is shown in most of the drawings.FIG.18shows two sets of fiber reinforcement members80extending at opposite angles to one another (e.g., 45 degrees one way and 45 degrees the other way). These oppositely extending fiber reinforcement members80may be in the same polymer layer or may be in separate ply layers (e.g., one ply or layer with plus 30 degree cords and another ply or layer with negative 30 degree cords, which may be referred to as a bias ply. The fiber reinforcement members may extend radially (FIG.11) or at any angle up to 90 degrees (which is essentially extending circumferentially).", "", "In use, the present invention includes an outer ring of circumferentially wrapped SMA elements that are designed to engage when the tire assembly is loaded. In use, the SMA elements are designed to absorb the majority of the load. It will be appreciated by those of ordinary skill in the art that the SMA elements use a unique combination of strength, recoverability, and return energy to increase tire performance.", "", "Another component of the invention is the fiber reinforced polymer assembly53used to create a rigid attachment between the SMA elements52and the tire bead elements or members58and/or the rim18. During loading, the SMA elements52deflect to generate a footprint. The diameter of the remaining SMA elements attempts to grow to accommodate the shortened chord length of the footprint section. The fiber reinforced polymer assembly53restricts the growth of the outer diameter through the semi-rigid fiber reinforcements56wrapped around the SMA elements52to the tire bead elements or members58and/or the rim18. This effectively distributes the load to the entire band assemblies55, rather than just the SMA elements at the footprint, resulting in an efficient usage of the SMA material and improved tire performance. As load is placed on the axle, the SMA elements at or near the outer diameter (OD) of the tire assembly deflect to generate the footprint. Since the circumference is shorter due to the cord length of the footprint, the circumferential tube formed by the SMA elements attempts to grow radially outwardly and/or outside the footprint. The reinforcement fibers56extending between and attaching the rim/beads and the SMA elements restricts the OD growth, therefore generating a semi-rigid body similar to a pneumatic tire.", "", "The tire belt(s)60are used to support tire assembly performance with added lateral strength. They help maintain ideal tire shape during usage. However, the tire belt(s) may be omitted. The tire bead members58allow the tire to stay seated on the rim, similar to its purpose in conventional pneumatic tires. However, without the need for tight seals (in tubeless pneumatic tires), additional improvements can be made to the tire bead.", "", "The tread16serves a similar purpose as in conventional pneumatic tires. This is the section of the tire that comes in contact with the road. The tread is used to ensure good contact and allow water to escape during poor weather conditions.", "", "Unless the context clearly requires otherwise, throughout the description and the claims, the words “comprise,” “comprising,” and the like are to be construed in an inclusive sense, as opposed to an exclusive or exhaustive sense; that is to say, in the sense of “including, but not limited to.” As used herein, the terms “connected,” “coupled,” or any variant thereof, means any connection or coupling, either direct or indirect, between two or more elements; the coupling of connection between the elements can be physical, logical, or a combination thereof. Additionally, the words “herein,” “above,” “below,” and words of similar import, when used in this application, shall refer to this application as a whole and not to any particular portions of this application. Where the context permits, words in the above Detailed Description of the Preferred Embodiments using the singular or plural number may also include the plural or singular number respectively. The word “or” in reference to a list of two or more items, covers all of the following interpretations of the word: any of the items in the list, all of the items in the list, and any combination of the items in the list.", "", "The above-detailed description of embodiments of the disclosure is not intended to be exhaustive or to limit the teachings to the precise form disclosed above. While specific embodiments of and examples for the disclosure are described above for illustrative purposes, various equivalent modifications are possible within the scope of the disclosure, as those skilled in the relevant art will recognize. Further, any specific numbers noted herein are only examples: alternative implementations may employ differing values, measurements or ranges.", "", "Although the operations of any method(s) disclosed or described herein either explicitly or implicitly are shown and described in a particular order, the order of the operations of each method may be altered so that certain operations may be performed in an inverse order or so that certain operations may be performed, at least in part, concurrently with other operations. In another embodiment, instructions or sub-operations of distinct operations may be implemented in an intermittent and/or alternating manner.", "", "The teachings of the disclosure provided herein can be applied to other systems, not necessarily the system described above. The elements and acts of the various embodiments described above can be combined to provide further embodiments. Any measurements or dimensions described or used herein are merely exemplary and not a limitation on the present invention. Other measurements or dimensions are within the scope of the invention.", "", "Any patents and applications and other references noted above, including any that may be listed in accompanying filing papers, are incorporated herein by reference in their entirety. Aspects of the disclosure can be modified, if necessary, to employ the systems, functions, and concepts of the various references described above to provide yet further embodiments of the disclosure.", "", "These and other changes can be made to the disclosure in light of the above Detailed Description of the Preferred Embodiments. While the above description describes certain embodiments of the disclosure, and describes the best mode contemplated, no matter how detailed the above appears in text, the teachings can be practiced in many ways. Details of the system may vary considerably in its implementation details, while still being encompassed by the subject matter disclosed herein. As noted above, particular terminology used when describing certain features or aspects of the disclosure should not be taken to imply that the terminology is being redefined herein to be restricted to any specific characteristics, features or aspects of the disclosure with which that terminology is associated. In general, the terms used in the following claims should not be construed to limit the disclosures to the specific embodiments disclosed in the specification unless the above Detailed Description of the Preferred Embodiments section explicitly defines such terms. Accordingly, the actual scope of the disclosure encompasses not only the disclosed embodiments, but also all equivalent ways of practicing or implementing the disclosure under the claims.", "", "While certain aspects of the disclosure are presented below in certain claim forms, the inventors contemplate the various aspects of the disclosure in any number of claim forms. For example, while only one aspect of the disclosure is recited as a means-plus-function claim under 35 U.S.C. § 112, ¶6, other aspects may likewise be embodied as a means-plus-function claim, or in other forms, such as being embodied in a computer-readable medium. (Any claims intended to be treated under 35 U.S.C. § 112, ¶6 will include the words “means for”). Accordingly, the applicant reserves the right to add additional claims after filing the application to pursue such additional claim forms for other aspects of the disclosure.", "", "Accordingly, although exemplary embodiments of the invention have been shown and described, it is to be understood that all the terms used herein are descriptive rather than limiting, and that many changes, modifications, and substitutions may be made by one having ordinary skill in the art without departing from the spirit and scope of the invention."], "claims": ["at least a first band assembly that includes a first SMA element having an outer surface, wherein the first SMA element extends circumferentially about the tire assembly, a first bead member having an outer surface, wherein the first bead member extends circumferentially about the tire assembly, and a plurality of fiber reinforcement members, wherein each of the plurality of fiber reinforcement members extend around the outer surface of the first SMA element and the outer surface of the first bead member to form the first band assembly.", "2 . The tire assembly of claim 1 wherein the plurality of fiber reinforcement members extend circumferentially about the tire assembly.", "3 . The tire assembly of claim 1 wherein the plurality of fiber reinforcement members are disposed in a first polymer member to form a fiber reinforced polymer assembly, wherein the fiber reinforced polymer assembly extends around the outer surface of the first SMA element and the outer surface of the first bead member.", "4 . The tire assembly of claim 3 wherein the fiber reinforced polymer assembly comprises a tubular configuration that extends circumferentially about the tire assembly.", "5 . The tire assembly of claim 3 wherein the fiber reinforced polymer assembly comprises a wrapped spiral configuration that extends circumferentially about the tire assembly.", "6 . The tire assembly of claim 3 wherein the fiber reinforced polymer assembly includes first and second polymer members, wherein the first polymer member includes a first set of fiber reinforcement members disposed therein, wherein the second polymer member includes a second set of fiber reinforcement members disposed therein, wherein the first set of fiber reinforcement members extend in a first direction, wherein the second set of fiber reinforcement members extend in a second direction, and wherein the first direction is non-parallel to the second direction.", "7 . The tire assembly of claim 3 wherein the band assembly includes a second SMA element having an outer surface, wherein the second SMA element extends circumferentially about the tire assembly, wherein the fiber reinforced polymer assembly extends around the outer surface of the first SMA element, the outer surface of the second SMA element and the outer surface of the first bead member.", "8 . The tire assembly of claim 7 wherein the first SMA element is positioned laterally adjacent to the second SMA element.", "9 . The tire assembly of claim 8 wherein the fiber reinforced polymer assembly includes an extension portion that extends inwardly and between the first and second SMA elements.", "a first SMA element having an outer surface, wherein the first SMA element extends circumferentially about the tire assembly, a first bead member having an outer surface, wherein the first bead member extends circumferentially about the tire assembly, and a plurality of fiber reinforcement members, wherein each of the plurality of fiber reinforcement members extend around the outer surface of the first SMA element and the outer surface of the first bead member to form the first band assembly.", "11 . The tire assembly of claim 1 wherein an inner portion of the first band assembly is seated in a groove associated with a rim of the tire assembly.", "at least a first band assembly that includes a first SMA element having an outer surface, wherein the first SMA element extends circumferentially about the tire assembly, a second SMA element having an outer surface, wherein the second SMA element extends circumferentially about the tire assembly and is positioned laterally adjacent to the first SMA element, a first bead member having an outer surface, wherein the first bead member extends circumferentially about the tire assembly, and a first fiber reinforced polymer assembly that includes a plurality of fiber reinforcement members disposed in a polymer member, wherein the first fiber reinforced polymer assembly extends around the outer surface of the first SMA element, the outer surface of the second SMA element and the outer surface of the first bead member, wherein the first fiber reinforced polymer assembly extends circumferentially about the tire assembly.", "a first SMA element having an outer surface, wherein the first SMA element extends circumferentially about the tire assembly, a first bead member having an outer surface, wherein the first bead member extends circumferentially about the tire assembly, and a first fiber reinforced polymer assembly that includes a plurality of fiber reinforcement members disposed in a polymer member, wherein the first fiber reinforced polymer assembly extends around the outer surface of the first SMA element, the outer surface of the second SMA element and the outer surface of the first bead member, wherein the first fiber reinforced polymer assembly extends circumferentially about the tire assembly."], "bibtex": "@patent{20250115078,\n    title = {TIRE ASSEMBLY WITH CIRCUMFERENTIAL SHAPE MEMORY ALLOY CONFIGURATION},\n    number = {20250115078},\n    year = {2025},\n    note = {File: US20250115078A1-20250410.XML}\n    }", "classification": "B60C714FI"}, {"title": "NON-PNEUMATIC HOLLOW TIRE AND MANUFACTURING METHOD", "doc_number": "20250115079", "filename": "US20250115079A1-20250410.XML", "abstract": "A non-pneumatic hollow tire includes a tire body, a spiral channel is defined in the tire body, the spiral channel is through from a head end to a tail end. The manufacturing method of the non-pneumatic hollow tire with this structure includes: winding a strip with through hole in a stacked manner in a plurality of layers to form a structure in the tire cavity, then curing it to complete the non-pneumatic hollow tire.", "detailed_description": ["The disclosure will be described in further detail below with reference toFIGS.1-6. The drawings are for illustrative purposes only and should not be construed as limitations of this patent. In order to better illustrate the embodiments, some components of the drawings will be omitted, enlarged or reduced, which does not represent the size of the actual product. It is understandable for those skilled in the art that some known structures in the drawings and their descriptions are omitted. The positional relationships described in the drawings are for illustrative purposes only."], "claims": ["1 . A non-pneumatic hollow tire, comprising a tire body, wherein a spiral channel is defined in the tire body, the spiral channel extends from a head end to a tail end.", "2 . The non-pneumatic hollow tire according to claim 1 , wherein the spiral channel is laid in a continuously stacked manner to form a cylindrical spiral structure, and the spiral channel has a uniform pitch, a uniform channel diameter and a uniform cross-section shape.", "3 . The non-pneumatic hollow tire according to claim 1 , wherein the spiral channel is laid in a plurality of layers, the spiral channel has different pitches, channel diameters and cross-section shapes in different layers of the plurality of layers, and the spiral channel has a uniform pitch, channel diameter and cross-section shape in a same layer of the plurality of layers.", "4 . The non-pneumatic hollow tire according to claim 1 , wherein the head end and the tail end of the spiral channel are enclosed in a tire cavity, and or one or both of the head end and the tail end of the spiral channel is in communication with an outside of the tire body.", "5 . The non-pneumatic hollow tire according to claim 1 , wherein a channel wall of the spiral channel is made of one or more materials selected from rubber, resin composite material and metal.", "6 . The non-pneumatic hollow tire according to claim 1 , wherein a cross section of the spiral channel is circular, elliptical, triangular or polygonal.", "the spiral channel is an inner hole in a strip, the inner hole extends from end to end of the strip, the strip is wound in a circumferential direction of the non-pneumatic hollow tire to form a group of strip layers as a blank for a tire cavity in the tire body, and one of: a rubber sheet is coated outside the group of strip layers, then the group of strip layers with the rubber sheet is placed in a mold for curing, or the group of strip layers is directly placed in the mold, and then a material of the tire body is injected into the mold for curing, so as to form the non-pneumatic hollow tire.", "the strip is formed in one piece, the inner hole is formed in the strip, and the inner hole extends from end to end of the strip; or the strip is made of a group of sub-strips, the group of sub-strips is formed by a plurality of separate sub-strips side by side, and each of the plurality of separate sub-strips is configured with the inner hole; or the strip is formed in one piece, a group of through holes are formed in the strip, the group of through holes comprises two or more inner holes, the two or more inner holes extend end to end of the strip.", "the inner hole or each of the two or more inner holes has a constant channel diameter and shape from end to end of the strip, or the inner hole or each of the two or more inner holes is segmented to have at least one of different channel diameters or different shapes corresponding to channel positions in different strip layers of the group of strip layers, and the inner hole or each of the two or more inner holes has a same size and a same shape in a same strip layer of the group of strip layers."], "bibtex": "@patent{20250115079,\n    title = {NON-PNEUMATIC HOLLOW TIRE AND MANUFACTURING METHOD},\n    number = {20250115079},\n    year = {2025},\n    note = {File: US20250115079A1-20250410.XML}\n    }", "classification": "B60C722FI"}, {"title": "PNEUMATIC VEHICLE TYRE", "doc_number": "20250115080", "filename": "US20250115080A1-20250410.XML", "abstract": "A pneumatic vehicle tire with sidewalls and a tread with at least one shoulder-side profile rib delimited by a circumferential groove with a rib outer surface and a shoulder flank extending to the respective sidewall. The shoulder-side profile rib is provided with depressions, which proceed from the shoulder flank and have an opening on the rib outer surface. The opening of the depression when viewed from above, is elongate-rectangular in the axial direction or elongate-trapezoidal in the axial direction.", "detailed_description": ["Pneumatic vehicle tires embodied according to the invention are tires for motor vehicles, in particular for multi-track motor vehicles, and preferably radial tires for commercial vehicles (medium-heavy motor trucks: 7.5 t<GVW≤18.0 t, heavy trucks: GVW>18.0 t).", "", "FIG.1shows a view from above onto a tread of a commercial vehicle tire. The tread has three middle profile ribs1and two shoulder-side profile ribs2, wherein the middle profile ribs1are separated by two middle circumferential grooves3, and the shoulder-side profile ribs2are in each case separated from the adjacent middle profile rib1by a shoulder-side circumferential groove4. The profile ribs1,2each have a rib outer surface1a(profile rib1),2a(profile rib2) lying in the tread periphery. The shoulder-side profile ribs2are further delimited by a shoulder flank2bextending outside the ground contact patch to the respective sidewall not shown (seeFIG.5).", "", "When viewed from above, the circumferential grooves3,4extend in a regular zigzag shape, each have a groove centerline mURfollowing the groove course when viewed from above and consist of groove portions5, which—with reference to the groove centerline mUR—are in each case at an angle α of 15° to 30°, in particular of 20° to 25°, in relation to the circumferential direction, wherein—in accordance with the zigzag shape—immediately successive groove portions5are inclined opposite to one another with respect to the circumferential direction. At the mutual connection region of two groove portions5, the circumferential groove3,4has in each case a bending point with a bend inner side6aand a bend outer side6b.The bend inner side6ais the side by way of which the adjacent groove portions5conjointly enclose an angle β of less than 180° in relation to the groove centerline mUR. The circumferential grooves3,4are embodied at the respective envisaged profile depth in the radial direction, which is in particular 12.0 mm to 26.0 mm, and have a width bURof 10.0 mm to 25.0 mm measured perpendicularly to the groove centerline mURat the tread periphery. If circumferential grooves3,4are provided with different depths, the profile depth is understood to be the depth of the respective deepest circumferential groove(s)3,4.", "", "In each shoulder-side profile rib2, the rib outer surface2aadjoins the respective shoulder flank2b,wherein a sharp peripheral edge7is formed at the mutual connection in the exemplary embodiment shown. The rib outer surface2atherefore ends at the peripheral edge7on the outside of the tread. Between the rib outer surface2aand the shoulder flank2b,a transition radius may alternatively be provided so that the rib outer surface2aends at the radially outer end of the transition radius.", "", "Each shoulder-side profile rib2has a maximum width bPR, determined at the level of the rib outer surface2aand projected in the axial direction, and is provided with a plurality of cuboid-like local depressions8distributed over the circumference of the tread, which proceed from the shoulder flank2band are open toward the rib outer surface2a,so that the peripheral edge7, or the transition radius provided instead of the latter, is interrupted in portions, wherein the depressions8are located axially beside the bend inner sides6aof the respective shoulder-side circumferential groove4. Depressions8which are successive in the circumferential direction have mutual spacings a1of 20.0 mm to 60.0 mm, preferably of 30.0 mm to 40.0 mm, which are determined as the smallest possible spacings at the level of the rib outer surface2a.", "", "The further design embodiment of the depressions8is explained below with reference to a single depression8.", "", "FIG.2shows an enlarged view from above onto a depression8which is formed in the left shoulder-side profile rib2inFIG.1. The depression8has at the rib outer surface2aan opening9which is elongate in the axial direction when viewed from above, and a symmetry plane E1aligned in the longitudinal extent of said depression8and running in the radial direction (coincides with the section line IV-IV). The symmetry plane E1, when viewed from above, extends at an angle γ of +/−5°, in particular of +/−3°, particularly preferably of 0°, in relation to the axial direction, and thus in the axial direction.", "", "The opening9has the shape of an isosceles trapezoid, wherein the shorter base side of the trapezoid is within the shoulder-side profile rib2and the longer base side of the trapezoid is on the shoulder flank2b.", "", "The opening9has on the rib outer surface2aa delimiting edge9awhich lies completely within the profile rib2, runs rectilinearly and forms the shorter base side of the trapezoid, and two delimiting edges9bwhich run straight and to the peripheral edge7, each forming a trapezoidal leg, wherein in the exemplary embodiment a circular-arcuate radiussed transition edge9cruns in each case between the delimiting edges9band the delimiting edge9a,said transition edge9cadjoining the respective delimiting edge9bwithout a bend, and adjoining the delimiting edge9awithout a bend. The delimiting edge9adelimits the opening9on the inside of the tread and runs perpendicular to the symmetry plane E1. The delimiting edges9bdelimit the opening9in the circumferential direction and, when viewed from above, run at an angle δ of 5° to 25°, in particular of 10° to 20°, particularly preferably of 12° to 18°, in relation to the axial direction, wherein the one delimiting edge9bis inclined toward the axial direction in the opposite direction of the other delimiting edge9b—so as to correspond to the trapezoidal shape.", "", "The opening9has a width bi which is determined between the delimiting edges9bin the circumferential direction and decreases continuously from the tread outer ends of the delimiting edges9bto the tread inner ends of the delimiting edges9b,so that the width b1has its maximum value b1maxat the tread outer ends of the delimiting edges9b,and its minimum value b1minat the tread inner ends of the delimiting edges9b.The maximum value b1maxis 10.0 mm to 30.0 mm, in particular 15.0 mm to 25.0 mm, and the minimum value b1minis 40% to 60%, in particular 45% to 55%, of the maximum value b1max. The opening9furthermore has a maximum length c1, determined at the level of the rib outer surface2aand projected in the axial direction, of 30% to 50%, preferably of 40% to 45%, of the maximum width bPR(FIG.1) of the shoulder-side profile rib2.", "", "According toFIG.5, the depression8is delimited in the radial direction by a base8c,in the direction of the inner side of the tread by an end flank8awhich proceeds from the delimiting edge9a,and in the circumferential directions by two lateral surfaces8bwhich proceed from the delimiting edges9b.", "", "As shown inFIG.4, the end flank8a,when viewed from above in the cross section aligned perpendicularly to the delimiting edge9a(cf. position of the line IV-IV inFIG.2), runs at an angle ε of 8° to 20°, in particular of 10° to 15°, in relation to the radial direction, wherein the inclination takes place in such a manner that the radially outer end of the end flank8alying on the delimiting edge9ais closer to the inner side of the tread.", "", "According toFIG.3, the lateral surfaces8b,when viewed from above in the cross section aligned perpendicularly to the associated delimiting edge9b(cf. position of the line III-III inFIG.2), run at an angle η of 8° to 25°, in particular of 10° to 15°, in relation to the radial direction, wherein the inclination of the lateral surfaces8btakes place in such a manner that the mutual clear spacing between the lateral surfaces8bincreases in the direction of the rib outer surface2a.", "", "As shown inFIG.4andFIG.5respectively, the base8cis composed of an inner base portion8c′, a middle base portion8c″ and an outer base portion8c″′, wherein the outer base portion8c″′ is closer to the shoulder flank2bcompared to the inner base portion8c′. The base8c,and therefore each base portion8c′,8c″,8c″′, runs straight and parallel to the rib outer surface2awhen viewed in the cross section aligned in the circumferential direction.", "", "According toFIG.4, the base8c,when viewed from above in the cross section aligned perpendicularly to the delimiting edge9a,has a length ccdetermined parallel to the rib outer surface2a.", "", "The inner base portion8c′, when viewed from above in the cross section aligned perpendicularly to the delimiting edge9a,runs at a constant depth tmin, determined in the radial direction, of 50% to 80%, in particular of 55% to 75%, preferably of 60% to 70%, of the profile depth and has a length cc′, determined parallel to the rib outer surface2a,of 27% to 37%, in particular of 30% to 35%, of the length cc.", "", "The outer base portion8c′″, when viewed in the last-mentioned cross section, runs at a constant angle θ of 30° to 60°, in particular of 45° to 55°, in relation to the radial direction, has a length cc″′, determined parallel to the rib outer surface2a, of 27% to 37%, in particular of 30% to 35%, of the length cc, and ends in front of the shoulder flank2bon the outside of the tread at a spacing a2of up to 3.0 mm, determined parallel to the rib outer surface2a.Alternatively, the outer base portion8c′″ may end at the shoulder flank2b.", "", "The middle base portion8c″, when viewed in the last-mentioned cross section, runs continuously outwardly convex in an arcuate manner and furthermore, in particular, along a circular arc, wherein said middle base portion8c″ adjoins tangentially (“bend-free”) to the inner base portion8c′ and tangentially to the outer base portion8c″′. “Adjoin tangentially” means that a tangent passing through the respective mutual connection and applied to one portion (base portion8c′ and8c′″) and a tangent passing through the same mutual connection and applied to the other portion (base portion8c″) have concurrent slopes and therefore these tangents coincide.", "", "The design embodiment of the base portions8c′,8c″,8c′″ is mutually adapted in particular in such a manner that the outer base portion8c″′ at its end facing the shoulder flank2bends at a depth tmax, determined in the radial direction, of 90% to 100%, in particular of at least 95%, of the profile depth.", "", "According toFIG.5, the depression8in the exemplary embodiment shown has an end-side plateau surface8d,which lies at its outer end, is substantially rectangular when viewed from above and is elongate in the circumferential direction (cf.FIG.2), and runs at a constant depth, determined in the radial direction, and when viewed from above in the cross section aligned transversely to the circumferential direction, has a constant width b2(FIG.4) of 1.0 mm up to 2.0 mm.", "", "In the exemplary embodiment shown, two transition radii10, two transition radii11, a transition radius12, a transition radius13and a transition radius14are formed between the mentioned surfaces delimiting the depression8, said surfaces including the end flank8a,the lateral surfaces8b,the base8cand the plateau surface8d.The two transition radii10proceed from the mentioned, circular-arcuate radiussed transition edges9cand run in each case between the end flank8aand one of the lateral surfaces8b.The transition radii11run between the base8cand one of the lateral surfaces8b,extending over all the base portions8c′,8c″,8c″′. The transition radius12(cf.FIG.4) runs between the end flank8aand the inner base portion8c′. The transition radius13(cf.FIG.4) runs between the outer base portion8c′″ and the plateau surface8d.The transition radii14extend between the plateau surface8dand the lateral surfaces8b.The design embodiment of all transition radii10,11,12,13,14is such that these ensure tangential transitions between the respective surfaces delimiting the depression8(end flank8a,lateral surfaces8b,base8c,plateau surface8d), these transition radii10,11,12,13,14thus adjoining the respective surfaces without bends. Correspondingly radiussed corner regions15result at the mutual connection points of the transition radii10,11,12,13,14.", "", "The invention is not limited to the exemplary embodiment described.", "", "The circumferential grooves3,4can run straight when viewed from above. The depressions8can also be formed only in a shoulder-side profile rib2. The opening9of the depression8, when viewed from above, can be elongate-rectangular in the axial direction."], "claims": ["sidewalls and a tread with at least one shoulder-side profile rib delimited by a circumferential groove with a rib outer surface and a shoulder flank extending to the respective sidewall; wherein the shoulder-side profile rib is provided with depressions, which proceed from the shoulder flank and have an opening on the rib outer surface: wherein the opening is delimited on an inner side of a tread by a first delimiting edge lying completely within the shoulder-side profile rib, and in the circumferential direction by two second delimiting edges, and wherein the opening between the second delimiting edges in the circumferential direction has a width (b wherein the opening of the depression, when viewed from above, is elongate-rectangular in the axial direction or elongate-trapezoidal in the axial direction; wherein the depression has an end flank, proceeding from the first delimiting edge, and a base; wherein the end flank, when viewed from above in the cross section running perpendicular to the first delimiting edge, runs at an angle (ε) of 8° to 20° in relation to the radial direction, and wherein the base, when viewed from above in the cross section aligned perpendicularly to the first delimiting edge, consists of an inner base portion running at a constant depth (tmin), an outer base portion extending at an angle (θ) of 30° to 60° in relation to the radial direction, and a middle base portion which is outwardly convex in an arcuate manner and tangentially adjoins these base portions.", "2 . The tire of claim 1 , wherein the width (b 1 ) of the opening of the depression decreases continuously in the direction of the inner side of the tread, so that the width (b 1 ) has its maximum value (b 1 max) at the tread outer ends of the second delimiting edges and its minimum value (b 1 min) at the tread inner ends of the second delimiting edges.", "3 . The tire of claim 1 , wherein the minimum value (b 1 min) of the width (b 1 ) is 40% to 60%;", "4 . The tire of claim 1 , wherein the opening of the depression has a maximum length (c 1 ), determined at the level of the rib outer surface and projected in the axial direction, of 30% to 50%, of the maximum width (bPR) of the shoulder-side profile rib, determined at the level of the rib outer surface and projected in the axial direction.", "5 . The tire of claim 1 , wherein the constant depth (tmin) at which the inner base portion runs is 50% to 80%, of the profile depth.", "6 . The tire of claim 1 , wherein, when viewed from above in the cross section running perpendicular to the first delimiting edge, the angle (ε) at which the end flank runs in relation to the radial direction is 10° to 15°.", "7 . The tire of claim 1 , wherein, when viewed from above in the cross section aligned perpendicularly to the first delimiting edge, the angle (θ) at which the outer base portion runs in relation to the radial direction is 45° to 55°.", "8 . The tire of claim 1 , wherein, when viewed from above in the cross section aligned perpendicularly to the first delimiting edge, the outer base portion has a length, determined parallel to the rib outer surface, of 27% to 37%, in particular of 30% to 35%, of the length (cc) of the base, determined in an analogous way.", "9 . The tire of claim 1 , wherein, when viewed from above in the cross section aligned perpendicularly to the first delimiting edge, the inner base portion has a length, determined parallel to the rib outer surface, of 27% to 37%, in particular of 30% to 35%, of the length (cc) of the base, determined in an analogous way.", "10 . The tire of claim 1 , wherein the outer base portion, when viewed from above in the cross section aligned perpendicularly to the first delimiting edge, ends at the shoulder flank.", "11 . The tire of claim 1 , wherein the outer base portion, when viewed from above in the cross section aligned perpendicularly to the first delimiting edge, ends in front of the shoulder flank at a spacing (a 2 ) of up to 3.0 mm, determined parallel to the rib outer surface.", "12 . The tire of claim 1 , wherein the depression at its outer end has an end-side plateau surface which proceeds from the shoulder flank, runs at a constant depth determined in the radial direction, is elongate in the circumferential direction, and has a width (b 2 ) of 1.0 mm to 2.0 mm, determined transversely to the circumferential direction.", "13 . The tire of claim 1 , wherein the outer base portion at its end facing the shoulder flank ends at a depth (tmax), determined in the radial direction, of 90% to 100%, of the profile depth.", "14 . The tire of claim 1 , wherein the depression has lateral surfaces which proceed from the second delimiting edges and, when viewed from above in the cross section aligned perpendicularly to the associated second delimiting edge, run at an angle (η) of 8° to 25°, in particular of 10° to 15°, in relation to the radial direction.", "15 . The tire of claim 1 , wherein the shoulder-side circumferential groove, when viewed from above, runs in a zigzag shape and is composed of groove portions which run in each case at an angle (α) of 15° to 30°, in particular of 20° to 25°, in relation to the circumferential direction, wherein the shoulder-side circumferential groove at the groove portions has in each case a bending point with a bend inner side and a bend outer side, wherein the depressions are in each case located so as to be axially beside a bend inner side.", "sidewalls and a tread with at least one shoulder-side profile rib delimited by a circumferential groove with a rib outer surface and a shoulder flank extending to the respective sidewall; wherein the shoulder-side profile rib is provided with depressions, which proceed from the shoulder flank and have an opening on the rib outer surface: wherein the opening is delimited on an inner side of a tread by a first delimiting edge lying completely within the shoulder-side profile rib, and in the circumferential direction by two second delimiting edges, and wherein the opening between the second delimiting edges in the circumferential direction has a width(b wherein the opening of the depression, when viewed from above, is elongate-rectangular in the axial direction or elongate-trapezoidal in the axial direction; wherein the depression has an end flank, proceeding from the first delimiting edge, and a base; wherein the end flank, when viewed from above in the cross section running perpendicular to the first delimiting edge, runs at an angle (ε) of 8° to 20° in relation to the radial direction, and wherein the base, when viewed from above in the cross section aligned perpendicularly to the first delimiting edge, consists of an inner base portion running at a constant depth (tmin), an outer base portion extending at an angle (θ) of 30° to 60° in relation to the radial direction, and a middle base portion which is outwardly convex in an arcuate manner and tangentially adjoins these base portions; wherein the width (b wherein the minimum value (b the circumferential groove, when viewed from above, runs in a zigzag shape and is composed of groove portions which run in each case at an angle (α) of 15° to 30°, in particular of 20° to 25°, in relation to the circumferential direction, wherein the shoulder-side circumferential groove at the groove portions has in each case a bending point with a bend inner side and a bend outer side, wherein the depressions are in each case located so as to be axially beside a bend inner side."], "bibtex": "@patent{20250115080,\n    title = {PNEUMATIC VEHICLE TYRE},\n    number = {20250115080},\n    year = {2025},\n    note = {File: US20250115080A1-20250410.XML}\n    }", "classification": "B60C1103FI"}, {"title": "LOW NOISE TIRE", "doc_number": "20250115081", "filename": "US20250115081A1-20250410.XML", "abstract": "An embodiment describes a low noise tire that reduces noise caused by air column resonance occurring in a main groove and has a fluid flow path to prevent a surface layer from being roughened during a mold casting process. A low noise tire according to an embodiment includes a plurality of blocks formed on a tread, a groove formed between the blocks and extending in a circumferential direction of a tire, protrusion portions including a plurality of protrusion bodies protruding from a bottom surface and a wall surface of the groove and extending along the groove, and fluid flow paths formed along the wall surface of the groove and configured to divide the protrusion portions while traversing the protrusion portions so that a fluid positioned between the protrusion portions moves.", "detailed_description": ["Hereinafter, the present invention will be described with reference to the accompanying drawings. However, the present invention may be implemented in various different ways and is not limited to the embodiments described herein. Further, a part irrelevant to the description will be omitted in the drawings in order to clearly describe the present invention, and similar constituent elements will be designated by similar reference numerals throughout the specification.", "", "Throughout the present specification, when one constituent element is referred to as being “connected to (coupled to, in contact with, or linked to)” another constituent element, one constituent element can be “directly connected to” the other constituent element, and one constituent element can also be “indirectly connected to” the other element with other elements interposed therebetween. In addition, unless explicitly described to the contrary, the word “comprise/include” and variations such as “comprises/includes” or “comprising/including” will be understood to imply the inclusion of stated elements, not the exclusion of any other elements.", "", "The terms used in the present specification are used to just describe a specific embodiment and do not intend to limit the present invention. Singular expressions include plural expressions unless clearly described as different meanings in the context. In the present specification, it should be understood the terms “comprises,” “comprising,” “includes,” “including,” “containing,” “has,” “having” or other variations thereof are inclusive and therefore specify the presence of stated features, integers, steps, operations, elements, components, or combinations thereof, but do not preclude the presence or addition of one or more other features, integers, steps, operations, elements, components, or combinations thereof.", "", "Hereinafter, the present invention will be described in detail with reference to the accompanying drawings.", "", "FIG.1is a perspective view of a low noise tire according to a second embodiment of the present invention,FIG.2is a front view of the low noise tire according to the second embodiment of the present invention,FIG.3is a cross-sectional view and an enlarged view illustrating the low noise tire according to the second embodiment of the present invention when viewed from the lateral side,FIG.4is a cross-sectional view taken along line B-B′ inFIG.3,FIG.5is a top plan view illustrating an abrasion indicator according to the second embodiment of the present invention, andFIG.6is an image illustrating air slags.", "", "As illustrated inFIG.1, a low noise tire200according to a second embodiment of the present invention may include blocks210, a groove220, protrusion portions, fluid flow paths250, an abrasion indicator260, and air slags251. The plurality of blocks210may be formed on a tire tread and define portions that come into contact with the ground surface.", "", "The groove220may be formed between the blocks210and define a main groove extending in a circumferential direction of the tire. The groove220may include one side wall surface inclined downward from an upper portion and formed to be straight and flat, a bottom surface coupled to one side wall surface and formed to be straight and parallel to the ground surface, and the other side wall surface coupled to the bottom surface and formed to be flat and symmetric together with one side wall surface. The groove220may include one side coupling surface coupled to one side wall surface and the bottom surface and formed as a curved portion, and the other side coupling surface coupled to the other side wall surface and the bottom surface and formed as a curved portion.", "", "The protrusion portions may include bottom protrusion portions protruding from the bottom surface of the groove220and extending along the groove220, wall surface protrusion portions protruding from the wall surfaces of the groove and extending along the groove, and coupling protrusion portions coupled to one side coupling surface and the other side coupling surface and formed as curved portions. In this case wall, as illustrated inFIG.2, the surface protrusion portions may be formed over a length1. As illustrated inFIG.5, a length of the bottom protrusion portions may be set to e in a direction perpendicular to the longitudinal direction of the groove220.", "", "The protrusion portions may include a plurality of protrusion bodies protruding from the bottom surface and the wall surfaces of the groove220, extending along the groove, and having different heights. The protrusion bodies may be classified into one or more types depending on the heights thereof. The protrusion bodies may be provided to define one pitch and reduce noise energy by increasing thermal friction energy generated by the flow.", "", "Hereinafter, the protrusion bodies, which constitute the protrusion portions, will be described with reference to a specific embodiment. However, the number of protrusion bodies included in the protrusion portion is not limited to two. Hereinafter, for convenience of description, the number of protrusion bodies is described as being two. However, the number of protrusion bodies having different heights is not limited to two, and the number of protrusion bodies may be two or more.", "", "The protrusion portion may include a first protrusion body230and a second protrusion body240. The plurality of first protrusion bodies230may protrude from the bottom surface and the wall surfaces of the groove220, and the plurality of second protrusion bodies240may protrude from the bottom surface and the wall surfaces of the groove.", "", "In this case, a protruding height of the first protrusion body230may be larger than a protruding height of the second protrusion body240. More specifically, a cross-sectional area of the second protrusion body240in a direction perpendicular to the ground surface may be 0 to 90% of a cross-sectional area of the first protrusion body230in the direction perpendicular to the ground surface.", "", "For example, a height of the first protrusion body230may be 0.1 to 2 mm, and a height of the second protrusion body240may be 0.09 to 1.8 mm. However, the protruding height of the first protrusion body230may be equal to the protruding height of the second protrusion body240. In addition, an area of the first protrusion body230may be 0.1 to 2 mm2, and an area of the second protrusion body240may be 0.09 to 1.8 mm2.", "", "Further, the first protrusion body230and the second protrusion body240may extend in parallel with each other. The first protrusion body230and the second protrusion body240may be spaced apart from each other at a predetermined interval.", "", "For example, the interval between the first protrusion body230and the second protrusion body240may be 0.05 to 4 mm. The first protrusion bodies230and the second protrusion bodies240, which are provided as described above, may be provided at predetermined intervals over the entire region of the groove220.", "", "More specifically, one or more first protrusion bodies230and one or more second protrusion bodies240are included and provided to define one pitch, and the pitches may be repeatedly formed over the entire region of the groove220.", "", "For example, the pitch may include one first protrusion body230and one second protrusion body240, and the plurality of pitches may be repeatedly formed at predetermined intervals.", "", "Alternatively, the pitch may include the first protrusion body230, the second protrusion body240, the second protrusion body240, and the first protrusion body230in this order, and the pitches may be repeatedly formed at predetermined intervals.", "", "In addition, the pitch may be provided such that a first group including one or more first protrusion bodies230and a second group including one or more second protrusion bodies240intersect each other.", "", "For example, the first group may include three first protrusion bodies230and two second protrusion bodies240. Further, the pitches, which include the first and second groups including the first protrusion body230, the first protrusion body230, the first protrusion body230, the second protrusion body240, and the second protrusion body240in this order, may be repeatedly formed over the entire region of the groove220.", "", "As described above, in the present invention, the pitches having a combination of the first protrusion bodies230and the second protrusion bodies240may be repeatedly formed at predetermined intervals over the entire region of the groove220.", "", "The first protrusion body230and the second protrusion body240according to the second embodiment may extend at an angle parallel to the circumferential direction of the tire.", "", "That is, the first protrusion bodies230and the second protrusion bodies240may be formed on the bottom surface and the wall surfaces of the groove220and extend in the extension direction of the groove220.", "", "As described above, the first protrusion bodies130and230and the second protrusion bodies140and240according to the first and second embodiments may extend to have an angle of 0 degree or more and 360 degrees or less when an angle of the protrusion body extending in parallel with the circumferential direction of the tire is 0 degree.", "", "A cross-sectional shape of the protrusion body may be a circular or polygonal shape. The protrusion bodies may each have a height constant in the longitudinal direction of the groove120, or the height of the protrusion body may vary in the longitudinal direction of the groove120. For example, the protrusion bodies extend in the longitudinal direction of the groove120, and the height of the protrusion body may be constant, gradually increased, gradually decreased, or increased and decreased.", "", "The protrusion portion may extend in the longitudinal direction of the groove and extend in a rectilinear or curved shape.", "", "In the present invention configured as described above, the first and second protrusion bodies230and240, which are provided in the form of fine protrusions, are applied to the entire wall surfaces and the entire bottom surface of the groove220, thereby ensuring a larger surface area. Further, the protrusion bodies formed on the entire exposed surface of the groove220dissipate noise energy by generating a large amount of thermal friction energy, thereby reducing the air column resonance sound.", "", "In addition, as illustrated inFIG.4, the first protrusion body230and the second protrusion body230formed in the groove220may have different sizes and intersect each other to disperse and cancel the resonance sound, thereby significantly improving noise reducing efficiency.", "", "As illustrated inFIG.3, the plurality of wall surface protrusion portions may be separated by the fluid flow paths250. A cross-sectional shape of the protrusion body included in the wall surface protrusion portion may be a trapezoidal shape in the longitudinal direction of the groove, and an angle of the trapezoidal shape may be 65 to 85°, particularly 90°.", "", "As illustrated inFIGS.2to3, the low noise tire may include the fluid flow path250formed along the wall surface of the groove220and configured to provide a flow path for air in the groove220. The fluid flow paths250may be formed in the wall surface protrusion portions formed on flat two opposite side wall bodies having no curved portion. A length of one fluid flow path in a wall body direction may be equal to a length of the wall surface protrusion portion.", "", "In another embodiment, the fluid flow paths250may be provided in the flat wall surface protrusion portion and the coupling protrusion portion formed as a curved portion. Therefore, the fluid flow paths250may be formed in all the portions of the groove220, except for the bottom surface of the groove, thereby easily removing fluid droplets trapped between the protrusion portions.", "", "The fluid flow path250may be formed at a predetermined angle with respect to the longitudinal direction of the wall surface protrusion portion and formed along the wall surface of the groove220. The fluid flow path250may divide the protrusion portions while traversing the protrusion portions, so that the fluid positioned in the protrusion portions may move. That is, the fluid flow path250may be formed as a groove-shaped path that passes through the plurality of wall surface protrusion portions. The fluid flow path250may divide the protrusion bodies, which protrude from two opposite side wall surfaces of the groove220, into a plurality of protrusion bodies.", "", "As illustrated inFIG.3, the plurality of fluid flow paths250may be formed in one block210.", "", "In the case of the protrusion bodies included in the wall surface protrusion portions formed adjacent to the fluid flow path250, a length of the fluid flow path in the longitudinal direction of the groove, which is a distance between one protrusion body and another protrusion body, may be set to a, and the length a between the fluid flow paths may be 0.03 to 5 mm. A length of the protrusion body, which is included in the wall surface protrusion portion adjacent to the fluid flow path, may be 3 to 20 mm in the longitudinal direction of the groove.", "", "In the related art, during a process of manufacturing a core for tire mold casting, moisture cannot be discharged while the core containing a mixture of gypsum and water is hardened, which may cause a situation in which the surface layer is roughened.", "", "Unlike the related art, in the case of the present invention, the fluid flow paths250are formed in the direction that is not parallel to the longitudinal direction of the groove220, and the fluid droplets trapped between the protrusion bodies of the protrusion portions are discharged along the flow paths of the fluid flow paths250. Therefore, moisture contained in the core is discharged through the fluid flow paths250during the process of manufacturing the core, such that the surface layer of the core may be prevented from being roughened. Therefore, it is possible to manufacture the tire200with a smooth surface during the process of manufacturing the tire200by using the core. In addition, the fluid droplets trapped between the protrusion portions may be discharged through the fluid flow paths, thereby improving the water discharge performance of the tire200.", "", "FIG.5Ais a top plan view of the abrasion indicator260, andFIG.5Bis a view illustrating a length of a support groove261in the direction perpendicular to the longitudinal direction of the groove220.", "", "As illustrated inFIGS.1and5, the low noise tire200may include the abrasion indicator260protruding from the bottom surface of the groove220. In this case, the abrasion indicator260may include the support groove261provided in the form of a flat plate-shaped groove in the bottom surface of the groove220, and a recognition protrusion body262protruding from an upper portion of the support groove261and coupled to at least a part of the groove220. Therefore, the abrasion indicator260is formed to allow a user to visibly identify a degree of abrasion of the tire.", "", "As illustrated inFIG.5B, the support groove261may be provided in the form of a flat plate-shape groove in the bottom protrusion portions of the groove220. A length of the support groove261in the direction perpendicular to the longitudinal direction of the groove may be set to e that is equal to the length of the bottom protrusion portion formed in parallel and having no curved portion.", "", "A length A between one side edge of the support groove261and one side lower edge of the recognition protrusion body262in the longitudinal direction of the groove220may be 3 to 15 mm. A length A between the other side edge of the support groove261and the other side lower edge of the recognition protrusion body262in the longitudinal direction of the groove may be 3 to 15 mm.", "", "In the related art, a peripheral portion of the abrasion indicator260is formed as an uneven protrusion, which makes it impossible to measure an accurate height of the abrasion indicator260. Therefore, in the present invention, the support groove261is formed to be flat by removing elements adjacent to the recognition protrusion body262, thereby measuring an accurate height of the recognition protrusion body262.", "", "The recognition protrusion body261may protrude from the support groove262. Two opposite surfaces of the recognition protrusion body261based on the direction perpendicular to the longitudinal direction of the groove220may be coupled to the protrusion portions. Therefore, a lower surface of the recognition protrusion body261is coupled to the support groove262, and the two opposite surfaces of the recognition protrusion body261are coupled to the protrusion portions. Therefore, it is possible to prevent the recognition protrusion body262from being cracked or damaged when a strong impact is applied because of a rapid curve or the like. A cross-sectional shape of the recognition protrusion body262in the longitudinal direction of the groove may be any one selected from trapezoidal, rectangular, semicircle, and semi-elliptical shapes.", "", "As illustrated inFIG.6, the low noise tire200may include the air slags251irregularly formed in groove shapes in the protrusion portions formed in the groove. The air slags251may be formed in groove shapes in the groove220or the protrusion portions and additionally reduce noise. Even though the tire is abraded, the air slags251formed in groove shapes may define empty spaces in the tire surface, thereby improving the water discharge performance of the tire200.", "", "FIG.7is a perspective view of a low noise tire according to a first embodiment of the present invention,FIG.8is a front view of the low noise tire according to the first embodiment of the present invention,FIG.9is a cross-sectional view illustrating the low noise tire according to the first embodiment of the present invention when viewed from the lateral side,FIG.10is a cross-sectional view taken along line A-A′ inFIG.9, andFIG.11is a top plan view illustrating an abrasion indicator according to the first embodiment of the present invention.", "", "As illustrated inFIGS.7to11, a low noise tire100according to a first embodiment of the present invention may include blocks110, a groove120, a plurality of protrusion portions, fluid flow paths150, an abrasion indicator160, and air slags151. The plurality of blocks110may be formed on a tire tread and define portions that come into contact with the ground surface.", "", "The groove120may be formed between the blocks110and define a main groove extending in a circumferential direction of the tire. The groove120may include one side wall surface inclined downward from an upper portion and formed to be straight and flat, a bottom surface coupled to one side wall surface and formed to be straight and parallel to the ground surface, and the other side wall surface coupled to the bottom surface and formed to be flat and symmetric together with one side wall surface. The groove120may include one side coupling surface coupled to one side wall surface and the bottom surface and formed as a curved portion, and the other side coupling surface coupled to the other side wall surface and the bottom surface and formed as a curved portion.", "", "The protrusion portions may include bottom protrusion portions protruding from the bottom surface of the groove and extending along the groove, wall surface protrusion portions protruding from one wall surface and the other wall surface of the groove and extending along the groove, and coupling protrusion portions coupled to one side coupling surface and the other side coupling surface and formed as curved portions.", "", "The protrusion portions may include a plurality of protrusion bodies protruding from the bottom surface and the wall surfaces of the groove, extending along the groove, and having different heights. The protrusion bodies may be classified into one or more types depending on the heights thereof. The protrusion bodies may be provided to define one pitch and reduce noise energy by increasing thermal friction energy generated by the flow.", "", "Hereinafter, the plurality of protrusion bodies, which constitute the protrusion portions, will be described with reference to a specific embodiment. However, the number of protrusion bodies included in the protrusion portion is not limited to two. Hereinafter, for convenience of description, the number of protrusion bodies is described as being two. However, the number of protrusion bodies having different heights is not limited to two, and the number of protrusion bodies may be two or more.", "", "The protrusion portion may include a first protrusion body130and a second protrusion body140.", "", "The plurality of first protrusion bodies130may protrude from the bottom surface and the wall surfaces of the groove120.", "", "The second protrusion body140may protrude from the bottom surface and the wall surface of the groove.", "", "In this case, a protruding height of the first protrusion body130may be larger than a protruding height of the second protrusion body140. More specifically, a height from a bottom of the second protrusion body140may be 0 to 90% of a height from a bottom of the first protrusion body130.", "", "For example, a height of the first protrusion body130may be 0.1 to 2 mm, and a height of the second protrusion body140may be 0.09 to 1.8 mm.", "", "However, the protruding height of the first protrusion body130may be equal to the protruding height of the second protrusion body140.", "", "Further, the first protrusion body130and the second protrusion body140may extend in parallel with each other. The first protrusion body130and the second protrusion body140may be spaced apart from each other at a predetermined interval.", "", "For example, the interval between the first protrusion body and the second protrusion body may be 0.05 to 4 mm.", "", "The first protrusion bodies130and the second protrusion bodies140, which are provided as described above, may be provided at predetermined intervals over the entire region of the groove120.", "", "More specifically, one or more first protrusion bodies130and one or more second protrusion bodies140are included and provided to define one pitch, and the pitches may be repeatedly formed over the entire region of the groove120.", "", "For example, the pitch may include one first protrusion body130and one second protrusion body140, and the plurality of pitches may be repeatedly formed at predetermined intervals.", "", "Alternatively, the pitch may include the first protrusion body130, the second protrusion body140, the second protrusion body140, and the first protrusion body130in this order, and the pitches may be repeatedly formed at predetermined intervals.", "", "In addition, the pitch may be provided such that a first group including one or more first protrusion bodies130and a second group including one or more second protrusion bodies140intersect each other.", "", "For example, the first group may include three first protrusion bodies130and two second protrusion bodies140. Further, the pitches, which include the first and second groups including the first protrusion body130, the first protrusion body130, the first protrusion body130, the second protrusion body140, and the second protrusion body140in this order, may be repeatedly formed over the entire region of the groove120.", "", "As described above, in the present invention, the pitches having a combination of the first protrusion bodies130and the second protrusion bodies140may be repeatedly formed at predetermined intervals over the entire region of the groove120.", "", "The first protrusion body130and the second protrusion body140according to the first embodiment may extend at an angle that is not parallel to the circumferential direction of the tire.", "", "That is, the first protrusion body130and the second protrusion body140may extend obliquely from an upper end of one side wall surface of the groove120to the bottom surface of the groove120and an upper end of the other side wall surface of the groove120.", "", "When the first protrusion body130and the second protrusion body140extends in the direction that is not parallel to the circumferential direction of the tire, a height of two opposite ends a of each of the first and second protrusion bodies130and140decreases toward the upper end of the wall surface of the groove120, such that the height at an uppermost end of the groove120converges on 0 to 2 mm, as illustrated inFIG.8. Specifically, if the height of the two opposite ends a of each of the first and second protrusion bodies130and140at the uppermost end of the groove120exceeds 2 mm, the wet traveling performance may deteriorate. Therefore, the height may be limited to 2 mm or less. However, the present invention does not exclude all the cases in which the height of the two opposite ends a of each of the first and second protrusion bodies130and140at the uppermost end of the groove120exceeds 2 mm, and any modification may be possible, as necessary.", "", "In this case, the two opposite ends a of each of the first and second protrusion bodies130and140may refer to portions corresponding to points of 10 to 50% of an overall depth of the groove120from the upper end of the groove120.", "", "A cross-sectional shape of the protrusion body may be a circular or polygonal shape.", "", "The protrusion bodies may each have a height constant in the longitudinal direction of the groove120, or the height of the protrusion body may vary in the longitudinal direction of the groove120. For example, the protrusion portions extend in the longitudinal direction of the groove120, and the height of the protrusion body may be constant, gradually increased, gradually decreased, or increased and decreased.", "", "The protrusion body may extend in the longitudinal direction of the groove and extend in a rectilinear or curved shape.", "", "In the present invention configured as described above, the first and second protrusion bodies130and140, which are provided in the form of fine protrusions, are applied to the entire wall surfaces and the entire bottom surface of the groove120, thereby ensuring a larger surface area. Further, the protrusion portions formed on the entire exposed surface of the groove120dissipate noise energy by generating a large amount of thermal friction energy, thereby reducing the air column resonance sound.", "", "In addition, as illustrated inFIG.10, the first protrusion body130and the second protrusion body130formed in the groove120may have different sizes and intersect each other to disperse and cancel the resonance sound, thereby significantly improving the noise reducing efficiency.", "", "As illustrated inFIGS.7to8, the low noise tire100may include the fluid flow paths150formed along the wall surface of the groove120and configured to provide flow paths for air in the groove120. The fluid flow path150may be formed as a path formed by an intervening space between one protrusion body and another protrusion body. In one embodiment, in the case of the first protrusion body130and the second protrusion body140formed on one side wall surface and the other side wall surface of the groove120, a portion between the first and second protrusion bodies130and140, which are formed adjacent to each other, may refer to the fluid flow path150.", "", "In the related art, during a process of manufacturing a core for tire mold casting, moisture cannot be discharged while the core containing a mixture of gypsum and water is hardened, which may cause a situation in which the surface layer is roughened.", "", "Unlike the related art, in the case of the present invention, moisture contained in the core is discharged through the fluid flow paths150during the process of manufacturing the core, such that the surface layer of the core may be prevented from being roughened. Therefore, it is possible to manufacture the tire100with a smooth surface during the process of manufacturing the tire by using the core. In addition, because the protrusion bodies extend obliquely, the fluid droplets trapped between the protrusion portions may be discharged through the fluid flow path150between one protrusion body and another protrusion body, thereby improving the water discharge performance of the tire.", "", "FIG.11Ais a top plan view of the abrasion indicator160, andFIG.11Bis a view illustrating a length of a support groove161in the direction perpendicular to the longitudinal direction of the groove120.", "", "As illustrated inFIGS.7and11, the low noise tire100may include the abrasion indicator160protruding from the bottom surface of the groove120. In this case, the abrasion indicator160may include the support groove161provided in the form of a flat plate-shaped groove in the bottom surface of the groove120, and a recognition protrusion body162protruding from an upper portion of the support groove161and coupled to at least a part of the groove120. Therefore, the abrasion indicator160is formed to allow a user to visibly identify a degree of abrasion of the tire.", "", "As illustrated inFIG.11B, the support groove161may be provided in the form of a flat plate-shape groove in the bottom protrusion portions of the groove120. A length of the support groove161in the direction perpendicular to the longitudinal direction of the groove may be set to e that is equal to the length of the bottom protrusion portion formed in parallel and having no curved portion.", "", "A length A between one side edge of the support groove161and one side lower edge of the recognition protrusion body162in the longitudinal direction of the groove120may be 3 to 15 mm. A length A between the other side edge of the support groove161and the other side lower edge of the recognition protrusion body162in the longitudinal direction of the groove may be 3 to 15 mm.", "", "In the related art, a peripheral portion of the abrasion indicator160is formed as an uneven protrusion, which makes it impossible to measure an accurate height of the abrasion indicator160. Therefore, in the present invention, the support groove162is formed to be flat by removing elements adjacent to the recognition protrusion body161, thereby measuring an accurate height of the recognition protrusion body161.", "", "The recognition protrusion body161may protrude from the support groove162. Two opposite surfaces of the recognition protrusion body161based on the direction perpendicular to the longitudinal direction of the groove120may be coupled to the protrusion portions. Therefore, a lower surface of the recognition protrusion body161is coupled to the support groove162, and the two opposite surfaces of the recognition protrusion body161are coupled to the protrusion portions. Therefore, it is possible to prevent the recognition protrusion body161from being cracked or damaged when a strong impact is applied because of a rapid curve or the like. A cross-sectional shape of the recognition protrusion body162in the longitudinal direction of the groove may be any one selected from trapezoidal, rectangular, semicircle, and semi-elliptical shapes.", "", "As illustrated inFIG.6, the low noise tire100may include the air slags151irregularly formed in groove shapes in the protrusion portions formed in the groove120. The air slags151may be formed in groove shapes in the groove120or the protrusion portions and additionally reduce noise. Even though the tire is abraded, the air slags151formed in groove shapes may define empty spaces in the tire surface, thereby improving the water discharge performance of the tire100.", "", "According to the effect of the present invention configured as described above, the protrusion portions, which are provided in the form of fine protrusions, may be applied to the entire groove wall surfaces and the entire bottom surface, thereby ensuring a larger surface area. Further, the protrusion portions formed on the entire exposed surface of the groove may dissipate noise energy by generating a large amount of thermal friction energy.", "", "In addition, according to the effect of the present invention, the first and second protrusion bodies formed in the groove may have different sizes and intersect each other to disperse and cancel the resonance sound, thereby improving the noise reducing efficiency.", "", "In addition, according to the effect of the present invention, it is possible to form the fluid flow path to prevent the surface layer from being roughened because moisture cannot be discharged during the mold casting process.", "", "In addition, according to the effect of the present invention, it is possible to form the abrasion indicator to identify the degree of abrasion of the tire.", "", "In addition, according to the effect of the present invention, it is possible to form the abrasion indicator on the flat surface to measure the accurate height of the abrasion indicator.", "", "The effects of the present invention are not limited to the above-mentioned effects, and it should be understood that the effects of the present invention include all effects that may be derived from the configuration of the present invention disclosed in the detailed description of the present invention or the appended claims.", "", "It will be appreciated that the embodiments of the present invention have been described above for purposes of illustration, and those skilled in the art may understand that the present invention may be easily modified in other specific forms without changing the technical spirit or the essential features of the present invention. Therefore, it should be understood that the above-described embodiments are illustrative in all aspects and do not limit the present specification. For example, each component described as a single type may be carried out in a distributed manner. Likewise, components described as a distributed type can be carried out in a combined type.", "", "The scope of the present invention is represented by the claims to be described below, and it should be interpreted that the meaning and scope of the claims and all the changes or modified forms derived from the equivalent concepts thereto fall within the scope of the present invention."], "claims": ["a plurality of blocks formed on a tread; a groove formed between the blocks and extending in a circumferential direction of a tire; and protrusion portions including a plurality of protrusion bodies protruding from a bottom surface and a wall surface of the groove and extending along the groove, wherein noise energy is reduced by thermal friction energy generated by the plurality of protrusion bodies.", "fluid flow paths formed along the wall surface of the groove and configured to divide the protrusion portions while traversing the protrusion portions so that a fluid positioned between the protrusion portions moves.", "3 . The low noise tire of claim 2 , wherein a width of the fluid flow path is 0.03 to 5 mm.", "an air slag formed in a groove shape in the groove.", "an abrasion indicator coupled to the bottom surface of the groove and protruding from the bottom surface of the groove.", "a support groove provided in the form of a flat plate-shape groove in the bottom surface of the groove; and a recognition protrusion body protruding from an upper portion of the support groove and coupled to at least a part of the groove.", "a plurality of first protrusion bodies protruding from the bottom surface and the wall surface of the groove; and a plurality of second protrusion bodies protruding from the bottom surface and the wall surface of the groove.", "8 . The low noise tire of claim 7 , wherein a height of the second protrusion body from the bottom surface is 0 to 90% of a height of the first protrusion body from the bottom surface.", "9 . The low noise tire of claim 7 , wherein one pitch is formed by including one or more first protrusion bodies and one or more second protrusion bodies, and a plurality of pitches is repeatedly formed.", "10 . The low noise tire of claim 9 , wherein the pitch includes a first group including one or more first protrusion bodies and a second group including one or more second protrusion bodies, and the first group and the second group intersect each other.", "11 . The low noise tire of claim 1 , wherein the plurality of protrusion bodies is provided in parallel.", "12 . The low noise tire of claim 1 , wherein when an angle at which the plurality of protrusion bodies extends in parallel with the circumferential direction of the tire is 0 degree, the plurality of protrusion bodies extends to have an angle of 0 degree or more and 360 degrees or less.", "13 . The low noise tire of claim 1 , wherein when the plurality of protrusion portions extends in a direction that is not parallel to the circumferential direction of the tire, a height of two opposite ends of the plurality of protrusion portions decreases toward an upper end of the wall surface of the groove, and the height at an uppermost end of the groove converges on 0 to 2 mm.", "14 . The low noise tire of claim 13 , wherein the two opposite ends of the plurality of protrusion portions are points of 10 to 50% of an overall depth of the groove from the upper end of the groove.", "15 . The low noise tire of claim 7 , wherein a height of the first protrusion body is 0.1 to 2 mm, an area of the first protrusion body is 0.1 to 2 mm 2 , a height of the second protrusion body is 0.09 to 1.8 mm, and an area of the second protrusion body is 0.09 to 1.8 mm 2 .", "16 . The low noise tire of claim 15 , wherein an interval between the first protrusion body and the second protrusion body is 0.05 to 4 mm.", "17 . The low noise tire of claim 1 , wherein the plurality of protrusion bodies is spaced apart from one another at predetermined intervals and formed over an entire region of the groove.", "18 . The low noise tire of claim 1 , wherein a cross-sectional shape of the protrusion body is a circular or polygonal shape.", "19 . The low noise tire of claim 1 , wherein the protrusion body has a height constant in a longitudinal direction of the groove.", "20 . The low noise tire of claim 1 , wherein the protrusion body extends in a longitudinal direction of the groove and extends in a rectilinear or curved shape."], "bibtex": "@patent{20250115081,\n    title = {LOW NOISE TIRE},\n    number = {20250115081},\n    year = {2025},\n    note = {File: US20250115081A1-20250410.XML}\n    }", "classification": "B60C1113FI"}, {"title": "WHEEL PARTITION ASSEMBLY CONFIGURED TO MODIFY TIRE CAVITY RESONANCE", "doc_number": "20250115082", "filename": "US20250115082A1-20250410.XML", "abstract": "A partition assembly configured to be mounted in a tire cavity defined between a wheel and a tire to divide the tire cavity into a plurality of segments, the partition assembly including at least one air line and a plurality of baffles. Each one of the plurality of baffles including: a base configured to be mounted to the wheel, the base defining an air passageway in fluid communication with the at least one air line; and an expandable body connected to the base and in fluid communication with the air passageway of the base, the expandable body configured to be filled with air from the at least one air line. Each one of the plurality of baffles is configured to receive air from the at least one air line to expand the plurality of baffles from a deflated configuration to an inflated configuration in which the plurality of baffles are configured to contact an inner wall of the tire coupled to the wheel to divide the tire cavity into the plurality of segments.", "detailed_description": ["FIG.1illustrates a wheel assembly10in accordance with the present disclosure. The wheel assembly10generally includes a wheel12having a rim14. Mounted to the wheel12is a tire20. A tire cavity22is defined between the wheel12and the tire20. A wheel valve24is in fluid configuration with the tire cavity22. The wheel valve24is configured to cooperate with any suitable air source in order to fill the tire cavity22with air from the air source.", "", "The wheel assembly10is configured to be mounted to any suitable vehicle, such as any suitable passenger vehicle, utility vehicle, recreational vehicle, mass transit vehicle, military vehicle, construction vehicle, trailer, aircraft, etc. The wheel assembly10may also be configured for use in any suitable nonvehicular application. Exemplary nonvehicular applications include, but are not limited to, manufacturing equipment, military equipment, construction equipment, etc.", "", "The wheel assembly10further includes a partition assembly50(seeFIGS.1and2). The partition assembly50is between the wheel12and an inner wall26(seeFIGS.5A and5B) of the tire20. The partition assembly50is mounted to the wheel12as described herein.", "", "The partition assembly50generally includes a plurality of baffles60and an air line62. The air line62includes an air valve64, which is configured to cooperate with any suitable air source for supplying air into the air line62. Each one of the baffles60is in fluid communication with the air line62to receive air from the air line62. The air line62may be circular as illustrated, so as to extend around the wheel12. The air line62may be a continuous air line extending entirely around the wheel12and be in fluid communication with each one of the baffles60. Alternatively, the air line62may include a plurality of air lines connecting neighboring ones of the baffles60together.", "", "Any suitable number of baffles60may be included. In the example ofFIGS.1and2, the partition assembly50includes eight baffles60, which are evenly spaced apart around the partition assembly50. Any other suitable number of baffles60may be included. The baffles60define the tire cavity22into a plurality of segments. The number of segments defined depends on the number of baffles60included. In the example ofFIG.1, the eight baffles60divide the tire cavity22into eight segments24A,24B,24C,24D,24E,24F,24G,24H, which are air-tight when the baffles60are inflated as described herein. Any other suitable number of baffles60may be included to divide the tire cavity22into any other suitable number of segments. For example, four baffles60may be included to divide the tire cavity22into four segments.", "", "With particular reference toFIG.3, each one of the plurality of baffles60includes a base70and an expandable body72. At an outer perimeter of the expandable body72is a seal74. The base70may be made of any suitable material, such as, but not limited to, acrylonitrile butadiene styrene (ABS) plastic. The expandable body72may be made of any suitable expandable material, such as butyl rubber. The seal74may be made of any suitable material, such as a nylon fabric reinforced polyurethane expandable seal.", "", "The base70of each one of the plurality of baffles60is mounted to the wheel12in any suitable manner. For example, the base70may be secured to the wheel12with a suitable adhesive. The base70defines an aperture80, which is connected to the air line62and in fluid communication with the air line62.", "", "The base70defines one or more passageways in fluid communication with the aperture80to receive airflow from the air line62. In the example illustrated, the base70defines a first air passageway82, which extends from the aperture80to the expandable body72. The base70further defines second air passageways84, which extend from the aperture80to the seal74.", "", "The baffle60is configured such that air from the air line62flows into the baffle60through the aperture80. From the aperture80, air flows through the first air passageway82into an air chamber76defined by the expandable body72. Air flow into the air chamber76expands the expandable body72from a deflated configuration to an inflated configuration. Air also flows from the aperture80through the second air passageways84into the seal74. Air flow into the seal74expands the seal from a deflated configuration to an inflated configuration, as explained herein. Although the baffle60is illustrated as including both the first air passageway82and the second air passageways84, in some applications the baffle60may include only the first air passageway82to only inflate the air chamber76and not include the second air passageways84. In other applications, the baffle60may only include the second air passageways84to only inflate the seal74and not include the first air passageway82.", "", "The base70of each one of the baffles60may further include a pressure relief valve86. The pressure relief valve86ensures that air pressure is uniform across all of the segments24A-24H of the tire cavity22. For example, in the event of a tire puncture, the pressure relief valves86allow air to flow between the segments24A-24H to maintain uniformity of the tire pressure across all segments.", "", "With reference toFIGS.4A and4B, the seal74will now be described in additional detail. The seal74of each one of the baffles60includes a pair of lips90, which are configured to be filled with air.FIG.4Aillustrates the pair of lips90in a deflated configuration.FIG.4Billustrates the pair of lips90in an inflated configuration resulting from air from the air line62having been introduced into the pair of lips90. The lips90are mounted to the expandable body72in any suitable manner, such as with any suitable mechanical interlock. In the example ofFIGS.4A and4B, the lips90are connected to a tab92, which may be generally T-shaped as illustrated. The tab92is seated in a slot94defined at an outer perimeter of the expandable body72. The slot94is configured to not expand, so as to retain the interlock between the pair of lips90and the slot94.", "", "FIGS.5A and5Bare cross-sectional views of the wheel assembly10illustrating one of the plurality of baffles60in the tire cavity22.FIG.5Aillustrates the baffle60in a deflated configuration in which the expandable body72and the seal74are deflated. The plurality of baffles60are typically in the deflated configuration ofFIG.5Aprior to the tire20being attached to the wheel12, and prior to inflation of the tire20. The tire20is inflated by pumping air into the tire cavity22through the wheel valve24. After the tire20is inflated, the plurality of baffles60are inflated.", "", "The plurality of baffles60are inflated by pumping air into the air line62by way of the air valve64. From the air valve64, air flows into the base70of each one of the baffles60. At each one of the bases70, air flows from the aperture80through the first air passageway82into the air chamber76of the expandable body72to inflate the expandable body72. Air also flows through the second air passageways84into the pair of lips90of the seal74to expand the pair of lips90to the inflated position ofFIG.4B. Adding air into the air chamber76of the expandable body72, and adding air into pair of lips90of the seal74, expands the plurality of baffles60from the deflated configuration ofFIG.5Ato an inflated configuration ofFIG.5B. In the inflated configuration ofFIG.5B, the plurality of baffles60abut the inner wall26of the tire20to provide an airtight seal between each one of the plurality of baffles60(particularly the inflated seals74thereof) and the inner wall26of the tire20, thereby defining the segments24A-24H of the tire cavity22.", "", "Noise may be generated in the tire cavity22by air inside the tire cavity22that has been excited by interaction between the tire20and the road surface as the wheel assembly10is traveling along a road surface. Tire cavity resonances, such as between 150 Hz to 400 Hz may play a role in reducing/amplifying noise experienced by occupants. The partition assembly50of the present disclosure is configured to raise resonant frequencies of the tire cavity22to a higher range, which avoids amplification of noise caused by interaction between the tire and the road. More specifically, the baffles60divide the tire cavity22into smaller segments24A-24H, which shifts the natural frequencies of the tire cavity22to a higher range to avoid resonance with tire vibrations caused by tire interaction with the road. The segments24A-24H are defined by the baffles60when the baffles60are inflated with air from the air line62, which inflates the air chamber76and the seal74. Once inflated, the baffles60expand into contact with, and form an airtight seal with, the inner wall26of the tire20to form the segments24A-24H, which increase the overall resonant frequency of the tire cavity22to a level at which any sound generated due to interaction between the wheel assembly10and a road surface is not amplified. As a result, occupants of a vehicle including the wheel assembly10will typically experience a quieter passenger cabin.", "", "The foregoing description is merely illustrative in nature and is in no way intended to limit the disclosure, its application, or uses. The broad teachings of the disclosure can be implemented in a variety of forms. Therefore, while this disclosure includes particular examples, the true scope of the disclosure should not be so limited since other modifications will become apparent upon a study of the drawings, the specification, and the following claims. It should be understood that one or more steps within a method may be executed in different order (or concurrently) without altering the principles of the present disclosure. Further, although each of the embodiments is described above as having certain features, any one or more of those features described with respect to any embodiment of the disclosure can be implemented in and/or combined with features of any of the other embodiments, even if that combination is not explicitly described. In other words, the described embodiments are not mutually exclusive, and permutations of one or more embodiments with one another remain within the scope of this disclosure.", "", "Spatial and functional relationships between elements (for example, between modules, circuit elements, semiconductor layers, etc.) are described using various terms, including “connected,” “engaged,” “coupled,” “adjacent,” “next to,” “on top of,” “above,” “below,” and “disposed.” Unless explicitly described as being “direct,” when a relationship between first and second elements is described in the above disclosure, that relationship can be a direct relationship where no other intervening elements are present between the first and second elements, but can also be an indirect relationship where one or more intervening elements are present (either spatially or functionally) between the first and second elements. As used herein, the phrase at least one of A, B, and C should be construed to mean a logical (A OR B OR C), using a non-exclusive logical OR, and should not be construed to mean “at least one of A, at least one of B, and at least one of C.”", "", "In the figures, the direction of an arrow, as indicated by the arrowhead, generally demonstrates the flow of information (such as data or instructions) that is of interest to the illustration. For example, when element A and element B exchange a variety of information but information transmitted from element A to element B is relevant to the illustration, the arrow may point from element A to element B. This unidirectional arrow does not imply that no other information is transmitted from element B to element A. Further, for information sent from element A to element B, element B may send requests for, or receipt acknowledgements of, the information to element A."], "claims": ["at least one air line; and a plurality of baffles, each one of the plurality of baffles including: a base configured to be mounted to the wheel, the base defining an air passageway in fluid communication with the at least one air line; and an expandable body connected to the base and in fluid communication with the air passageway of the base, the expandable body configured to be filled with air from the at least one air line; and a seal extending about an outer perimeter of the expandable body, wherein each one of the plurality of baffles is configured to receive air from the at least one air line to expand the plurality of baffles from a deflated configuration to an inflated configuration in which the plurality of baffles are configured to contact an inner wall of the tire coupled to the wheel to divide the tire cavity into the plurality of segments.", "2 . The partition assembly of claim 1 , wherein the at least one air line is circular and is in cooperation with each one of the plurality of baffles to deliver air to each one of the plurality of baffles.", "3 . The partition assembly of claim 2 , wherein the plurality of baffles are evenly spaced apart about the at least one air line.", "4 . The partition assembly of claim 2 , wherein the at least one air line includes at least one air valve.", "5 . The partition assembly of claim 1 , wherein the base of each one of the plurality of baffles includes a pressure relief valve configured to allow air to flow therethrough to establish a uniform pressure across the plurality of segments of the tire cavity.", "the base of each one of the plurality of baffles defines an aperture in fluid communication with the at least one air line and in fluid communication with the air passageway of the base.", "7 . The partition assembly of claim 1 , wherein the base includes acrylonitrile butadiene styrene (ABS) plastic and the expandable body includes butyl rubber.", "8 . (canceled)", "the seal is inflatable and is in fluid communication with the at least one air line by way of the base to receive air from the at least one air line; and the seal is configured to contact the inner wall of the tire mounted to the wheel to form an air-tight seal with the tire and define the plurality of segments when the seal is inflated with air from the at least one air line.", "10 . The partition assembly of claim 1 , wherein the seal is a nylon fabric reinforced polyurethane expandable seal.", "11 . The partition assembly of claim 1 , wherein the expandable body defines a slot, and the seal is seated within the slot.", "at least one air line; a plurality of baffles, each one of the plurality of baffles including: a base configured to be mounted to the wheel, the base defining an air passageway in fluid communication with the at least one air line; a body connected to the base, the body is an expandable body in fluid communication with the at least one air line by way of the base; and a seal extending about an outer perimeter of the body and in fluid communication with the air passageway of the base, the seal is expandable and configured to be filled with air from the at least one air line to expand the seal from a deflated configuration to an inflated configuration in which the seal is configured to contact an inner wall of the tire coupled to the wheel to divide the tire cavity into the plurality of segments.", "13 . (canceled)", "14 . The partition assembly of claim 12 , wherein the at least one air line is a single air line extending around the wheel and is in fluid communication with each one of the plurality of baffles.", "15 . The partition assembly of claim 12 , wherein the plurality of baffles are evenly spaced apart about the at least one air line, and the plurality of segments of the tire cavity are air-tight segments when the seal is in contact with the inner wall of the tire.", "16 . The partition assembly of claim 12 , wherein the partition assembly divides the tire cavity into at least four of the plurality of segments.", "17 . The partition assembly of claim 12 , wherein the seal includes a pair of inflatable lips secured to the outer perimeter of the body with a mechanical interlock.", "a wheel including a rim; a tire mounted to the wheel to define a tire cavity between the wheel and the tire; a partition assembly mounted to the wheel in the tire cavity, the partition assembly including: an air line extending around the wheel, the air line in cooperation with a valve configured to couple with an air source for introducing air from the air source into the air line; and a plurality of baffles mounted to the wheel and connected to the air line to receive air from the air line, each one of the plurality of baffles is expandable from a deflated configuration to an inflated configuration in response to air from the air line flowing into the plurality of baffles, in the inflated configuration the plurality of baffles contact an inner wall of the tire to divide the tire cavity into a plurality of air-tight segments; wherein each one of the plurality of baffles includes: an expandable body in fluid communication with the air line to receive air from the air line for inflating the expandable body; and a seal extending about an outer perimeter of the expandable body, the seal is in fluid communication with the air line to receive air from the air line for inflating the seal.", "19 - 20 . (canceled)"], "bibtex": "@patent{20250115082,\n    title = {WHEEL PARTITION ASSEMBLY CONFIGURED TO MODIFY TIRE CAVITY RESONANCE},\n    number = {20250115082},\n    year = {2025},\n    note = {File: US20250115082A1-20250410.XML}\n    }", "classification": "B60C1900FI"}, {"title": "STRAIN DETECTION DEVICE", "doc_number": "20250115083", "filename": "US20250115083A1-20250410.XML", "abstract": "The present disclosure provides a strain detection device capable of downsizing and improvement in strain detection accuracy as compared with the conventional functional components without hindering deformation of a tire. An aspect of the present disclosure includes a housing 110 bonded to an inner peripheral surface Ti of a tire T via an elastic adhesive EA, and a recess portion 111 c provided on an end surface 111 e of the housing 110 facing the inner peripheral surface Ti of the tire T. The strain detection device 100 includes the strain detection element 120 that is disposed at the center part of the recess portion 111 c and detects strain of the tire T via the elastic adhesive EA, and the elastic member 130 that is disposed in the inner peripheral edge part of the recess portion 111 c and protrudes toward the inner peripheral surface Ti of the tire T relative to the end surface 111 e of the housing 110. The elastic adhesive EA is filled in a space between the bottom surface 111 b of the recess portion 111 c and the inner peripheral surface Ti of the tire T inside the elastic member 130.", "detailed_description": [""], "claims": ["a housing bonded to an inner peripheral surface of a tire via an elastic adhesive; a recess portion provided on an end surface of the housing facing the inner peripheral surface of the tire; a strain detection element that is disposed in a center part of the recess portion and detects strain of the tire via the elastic adhesive; and an elastic member disposed on an inner peripheral edge part of the recess portion and protruding toward the inner peripheral surface of the tire relative to the end surface of the housing, wherein a space between a bottom surface of the recess portion and the inner peripheral surface of the tire inside the elastic member is filled with the elastic adhesive.", "the elastic member has an annular shape, and the strain detection element includes a semiconductor sensor for biaxial strain measurement that detects strain in two directions orthogonal to each other, and is disposed at a center of the elastic member having the annular shape.", "3 . The strain detection device according to claim 1 , wherein the elastic member has a circular cross-sectional shape in a cross section.", "4 . The strain detection device according to claim 1 , wherein an outer edge of the elastic member is engaged with an inner peripheral wall of the recess portion.", "the strain detection element includes a support member having a flat plate shape supported by the bottom surface of the recess portion of the housing and facing the inner peripheral surface of the tire via the elastic adhesive, and a semiconductor sensor provided on a surface of the support member opposite to a surface facing the inner peripheral surface of the tire."], "bibtex": "@patent{20250115083,\n    title = {STRAIN DETECTION DEVICE},\n    number = {20250115083},\n    year = {2025},\n    note = {File: US20250115083A1-20250410.XML}\n    }", "classification": "B60C2306FI"}]