[{"title": "BASSINET", "doc_number": "20240092121", "filename": "US20240092121A1-20240321.XML", "abstract": "A bassinet includes a base, a column assembly rotatably connected to the base at a first end of the column assembly, an arm rotatably connected to a second end of the column assembly, a tub frame pivotably connected to the arm, an infant tub retained within the tub frame, the infant tub including a front wall, a back wall, and two side walls and having areas of reduced height along the front wall and at least one of the side walls to provide enhanced access to the infant located within the infant tub, and an insert configured to reversibly fit within an interior of the infant tub.", "detailed_description": ["An example embodiment for a bassinet suitable for use in a hospital, birthing center or other maternity healthcare setting is illustrated in the figures, which will be described further hereinbelow in a non-limiting manner. In the embodiments shown, the bassinet comprises a base, a column assembly connected to the base, an arm connected to the column assembly, a tub frame connected to the arm, and an infant tub that is removably contained within the tub frame. In some embodiments, the height of the arm, the tub frame, and the infant tub is variable and manually selectable by a user, from a standing or seated position for example, over a predefined range of heights relative to the base and the surface on which the mobile bassinet is supported (e.g., the floor). In some embodiments, the arm is a rotary arm that is configured to rotate through a predefined range of rotary movements relative to the base of the mobile bassinet. In some embodiments, the tub frame is configured to rotate relative to the arm. In some embodiments, the base may be absent and replaced with another structure, such as any suitable non-movable structure for example, that provides complete support for the bassinet, such as, for example, a hospital bed in a postnatal unit room in a hospital or other birthing center, such that the bassinet is no longer independently mobile from the supporting structure, but is rotatable relative thereto. These features are capable of being combined in any combination without deviating from the scope of the subject matter disclosed herein.", "", "InFIGS.1and2, an example embodiment of a mobile bassinet, generally designated1, is shown. Bassinet1has a base, generally designated100, a column assembly, generally designated200, attached to the base100, an arm, generally designated300, rotatably connected to the column assembly200, a tub frame, generally designated400, rotatably connected to the arm, and an infant tub, generally designated500, that is removably contained within a recessed portion of the tub frame400. As shown, the tub frame has, for example, three rotational degrees of freedom from a stationary object (e.g., a hospital bed) about which the bassinet1is movably positioned. The first rotational degree of freedom is achieved by the base100being rotatable and/or pivotable relative to the stationary object using, for example casters (see, e.g.,130inFIG.3). The second rotational degree of freedom is achieved by the column assembly200, as well as the arm300, tub frame400, and infant tub500, being rotatable and/or pivotable about the base100. The third rotational degree of freedom is achieved by the tub frame400, as well as the infant tub500, being rotatable and/or pivotable about the arm300. At least some of the components of the bassinet1are capable of being secured and/or locked, at least temporarily, in any respective position achieved due to the three rotational degrees of freedom. Due to these three rotational degrees of freedom, the infant tub is capable of being moved into virtually any user-selectable position relative to the stationary object. InFIG.2, the bassinet1is shown in a position and configuration that could be used for either transport of an infant within the infant tub500or for inactive periods of time (e.g., when the infant is sleeping).", "", "FIG.3shows an isometric view of the base100isolated from the other components of bassinet1. Base100comprises a main body, generally designated110, which comprises a base plate112and a wheel mount area116attached at each corner thereof, with the wheel mount areas116being connected to the base plate112by a transition region114. The use of the transition regions114allows for the base100to have a lower center of mass by having the base plate112lower than the height of the wheel mount areas116, which is generally determined by the physical dimensions of the wheels130selected for a given application. By way of example, it may be advantageous to use caster or other wheels130that are pneumatic for bassinets that will be used to transport infants over any typical surfaces (e.g., paved surfaces), while harder wheels130, e.g., those made from plastic or solid rubber, may be selected for bassinets that will only be used on smooth surfaces, such as those found within a typical U.S. hospital. In general, pneumatic wheels will have a larger diameter than will hard plastic or rubber caster wheels, such that the height difference between the wheel mount area116and the base plate112may be selected based on the type of wheel130that will be installed on the base100of the bassinet. Base100can include manual or front wheels134which can be manually lockable (e.g., by foot actuation of a locking lever) and are rotatable in direction R1about an axis. Base100also has rear wheels132which can have an automatic locking function, such that they will only rotate when the automatic lock is released by a user and will automatically lock when the user disengages the automatic lock release or the base can instead be otherwise secured without automatic locking into a stationary position with any suitable structure. Also, it is possible for base100to not have any locking function. Rear wheels132can be pivoting, as shown by R1for front wheels134, or can be rotationally fixed. In the embodiment shown, all caster wheels130are rotatable in the direction R1about an axis defined by the attachment location of each caster wheel130to the base100. Each wheel130can be individually locked in a stationary position, for example angularly or rotationally, to prevent movement thereof while the bassinet is in motion. Each wheel130can also include a shroud or other cover if desired. Base100has a hole120therein for attachment of the column assembly200to the base100.", "", "InFIG.4, an internal view of column assembly200is shown, with external structural/cladding members being omitted to clearly illustrate the internal structures therein. Column support250is attached to the base100(seeFIG.3) of the bassinet and is fixed thereto such that the column support250is held stationary with respect to base100. A height adjuster252is attached to the base100at a first end thereof and to a support post230at a second end thereof. The height adjuster252allows for arm300to be set at one of a plurality of heights relative to base100within a predefined range of height values. The support post230is connected at its first end to the arm300by arm collar320, which is securely clamped about the support post230to prevent relative angular rotations between the arm300and the support post230. The support post230passes through a linear bearing, generally designated210. The linear bearing is configured to prevent relative rotational movements between the support post230, which has a square cross-section and a circular lower support member236(seeFIG.10). The support post230has a support post positioner generally designated240attached at the second end thereof. The support post positioner240has a cross-sectional shape that is contoured to the inner surface of the lower support member236. Because the support post230is connected to the lower support member236at two positions, unwanted movements (e.g., “wobbling”) of the infant tub are minimized. The support post230is moved vertically by an actuation of the height adjuster, which can be a pneumatic cylinder in some embodiments.", "", "The linear bearing210is shown in greater detail inFIGS.5-8. The linear bearing210has a housing212that can be formed as a single piece with a single housing seam214or as two separate pieces that are attached (e.g., hinged together in a clam shell arrangement or as separate pieces that are not connected to each other prior to installation) around the support post230, so as to define two housing seams214. The housing212has an upper flange211with a shape that is substantially similar (e.g., a same, similar, or larger diameter) to the lower support member236(seeFIG.10). The housing212is connected to the lower support member236by fasteners222(e.g., threaded screws) passing through holes222A passing through the flange211. At least one (e.g., a plurality of) upper roller218extends upwards from the housing212and is arranged on each of the lateral sides of the support post230. At least one (e.g., a plurality of) lower roller220extends downwards from the housing212and is arranged on each of the lateral sides of the support post230. Upper and lower rollers218and220, respectively, are attached to the housing212at support members218A and220A, respectively, which have through-holes formed therethrough. Upper and lower rollers218and220, respectively, can be made of a material having a suitable durometer so as to be at least partially compressed against the surface of the support post230to ensure positive pressure in the attachment of the linear bearing210about the support post230. Linear bearing210is secured about the support post230by one or more clamping fasteners216, which can be of the threaded screw type. The linear bearing210is configured such that the support post230is vertically mobile through and relative to the linear bearing210. A cavity224is formed through the thickness (e.g., in the vertical direction) of the linear bearing210. The cavity224has a cross-sectional shape and contour that is at least as large as the cross-sectional shape of the support post230, but preferably has a larger cross-sectional area than the support post230.", "", "FIG.7shows the support post positioner240, which has a perimeter in the shape of a cylindrical disc, which is substantially the same shape as the inner surface of the lower support member236(seeFIG.10), which is shown in this embodiment in the form of a hollow cylindrical member. The support post positioner240has or defines a recess242that has a shape (e.g., a “footprint”) that is the same size as the second end of the support post230(seeFIG.4) where it is connected thereto. The outer and inner perimeters of the recess242are shaped such that a distance therebetween is at least as large as the thickness of the outer walls of the support post230. The support post positioner240is secured, in the embodiment shown, to the support post230by passing a threaded member through and from each of the securing holes, generally designated246, into threaded receivers, generally designated247on at least two opposing sides of the support post positioner240. The support post positioner240has at least one or more cable-guiding holes, generally designated244, that are formed through a thickness of the support post positioner240. In the embodiment shown, a plurality of (e.g., four) cable-guiding holes244are provided and pass from an upper surface to a lower surface within a central portion of the support post positioner240. These cable-guiding holes244are inclined at an angle relative to a vertical axis substantially parallel to the direction of extension of the support post230. This inclination of the cable-guiding holes244may have a radial inclination component to impart a curvature or winding form to the actuation cables passing therethrough (seeFIG.21) so that these cables may be held in a coiled configuration within the lower support member236. A central void, generally designated248, is formed and is configured such that the height adjuster252(seeFIG.10) can pass therethrough to be secured to the support post230. In some embodiments, a hole may be formed through the height adjuster252that would be aligned to the securing holes246for securing the height adjuster to the support post230. In such embodiments, the receivers247may not be threaded so that a connecting rod may freely extend therethrough to interconnect the support post230, the support post positioner240, and the height adjuster252.", "", "The height adjuster252is shown inFIG.9as fixedly connected to a rotary gear260, such that they are rotationally locked together, e.g., by threaded members. The rotary gear260has a predefined range of rotary movement defined by a toothed region262(seeFIG.12). In the embodiment shown, the rotary gear260has a maximum range of motion of ±135° from a nominal (i.e. “0°”) position. The column assembly200is secured to the base by collar280, which is attached to the base100(e.g., at hole120, seeFIG.3) in the form of a sandwich member, having a two-piece construction with a first piece positioned below the base100and a second piece positioned above the base100. Collar280may be in the form of a rotary bearing for smooth rotary movements of the column assembly200relative to the base100. In some embodiments, a bearing may be provided separately from the collar280. Safety collar280is provided at the bottom of column assembly200and is rotationally locked to move with the other components of the column assembly200.", "", "The rotation of arm300and column assembly200relative to the base100is shown inFIG.10, with the direction of rotation being designated R2in this view. The internal components of the column assembly200are hidden in this view by upper support shroud238, which is largely a cosmetic, non-load bearing member, and by lower support member236, which passes through column support250is rigidly attached to rotary gear260to prevent relative angular movements therebetween. Anti-tip safety arm290is shown in the rotated, deployed, position, and is aligned to move radially with arm300, such that arm300and anti-tip safety arm290are aligned in a common plane.", "", "FIGS.11-15show the anti-tip safety arm290in the retracted and deployed positions. InFIG.11, the anti-tip safety arm290is arranged in the retracted position. Anti-tip safety arm290can comprise an anti-skid footing298at a distal end thereof, which can be made of, for example, rubber or any material of sufficient durometer. Anti-tip safety arm290is rotatably locked to move along with rotational movements of the column assembly by being secured to anti-tip safety arm mount292at a proximal end of anti-tip safety arm290. Anti-tip safety arm290also has actuating member294attached adjacent to the proximal end of anti-tip safety arm290. Actuating disc296is provided in the form of an arc on a bottom surface of base100and actuating member294is positioned on anti-tip safety arm290to interface with actuating disc. Actuating disc has a reduced height at the central position, such that anti-tip safety arm290, which is spring-biased in the upward direction (e.g., towards the base100), is moved to the retracted position when the actuating member294is located within the reduced height region of the actuating disc. Similarly, when the column assembly200and anti-tip safety arm290are rotated from the nominal position, the actuating member294rotates and is displaced vertically downwards by the increased thickness of the actuating disc296away from the nominal position. In the embodiment shown, the actuating disc296has rotational stop elements296A positioned at the extremes of the arc defined by the actuating disc296to prevent excess movement of anti-tip safety arm290beyond the bounds of the safety disc. In some embodiments, the rotational stop elements296A can be used to define the maximum amount of rotation of the column assembly200and arm300to prevent excessive rotation thereof relative to the base100. The angular position of the column assembly200and the arm300is maintained by engagement of the rotary lock270with the toothed portion262of the rotary gear260. The rotary lock270is slidingly attached to the base100at slot111(seeFIG.10). By slidingly actuating rotary lock270to move radially away from the rotary gear260, it is possible to rotate column assembly200and arm300relative to base100. Once rotary lock270is slidingly reengaged with the toothed portion262of rotary gear260, relative angular movements between the base100and the column assembly200are prevented. Rotary lock270and the rotary gear260have interlocking gear teeth formed therein that are complementary (e.g., having a shape and size that mesh together). The granularity of rotational movement of the column assembly200relative to the base100is determined by the size and pitch of the gear teeth of the rotary gear260and the rotary lock270.FIGS.14and15are exploded views of the components of the column assembly200that engage with and enable rotational movement relative to the base100.", "", "FIGS.16and17show the wheel handles, generally designated410, that are attached to the tub frame400. Wheel handles410control disengaging the automatic locking feature of the rear wheels132(see, e.g.,FIG.21) to allow for movement of the bassinet1, for example, for transport of an infant or positioning of the bassinet1relative to a substantially stationary object, such as a hospital bed. While only a single wheel handle410may be provided, in this embodiment tub frame400comprises a plurality of wheel handles410, specifically a quantity of four wheel handles410, each of which are arranged on a corner of the tub frame400, which has a substantially rectangular perimeter shape. Each first handle has a handle grip412and an actuator414, which is captive within handle drip412. Actuator414pivots, when squeezed against handle grip412by a user, about hinge416. As such, actuator414moves in the direction R3which is oriented circumferentially to hinge416. First handle may be integrally formed into the tub frame400or may be removably attached thereto. The operation of the wheel handles410will be discussed further hereinbelow with respect toFIGS.20and21.", "", "FIGS.17-19show pivot/rotation handles, generally designated430, and height handles, generally designated450, as part of the tub frame400. Each of pivot/rotation handles430and height handles450are integrally formed as part of the tub frame400, but in some embodiments one or both may be removably attached or affixed to tub frame400. While only a single pivot/rotation handle430and a single height handle450may be provided in some embodiments, in the example embodiment shown, a plurality of pivot/rotation handles430and a plurality of height handles450are provided as part of the tub frame400. Specifically, two pivot/rotation handles430and two height handles450are provided. The two pivot/rotation handles430are shown as being arranged on opposite sides/ends of the tub frame400, the sides/ends of the tub frame400on which the pivot/rotation handles430are arranged being the sides of the bassinet1from which the infant is to be removed from or placed within the infant tub500(e.g., the long sides of the tub frame400). The two height handles450are shown arranged on opposite sides/ends of the tub frame400, the sides/ends of the tub frame400on which the height handles450are arranged being the sides of the bassinet1which the head or feet of the infant are to be adjacent when the infant is in the infant tub500(e.g., the short sides of the tub frame400). The quantities and locations described hereinabove regarding the wheel handles410, the pivot/rotation handles430, and the height handles450are merely examples and these handles may be combined in any location and quantity without deviating from the scope of the subject matter disclosed herein.", "", "The pivot/rotation handles430have a grip432that is molded into the tub frame400along the length of the opposing long edges thereof. This location of the pivot/rotation handles is contemplated as being advantageous because it will be more easily accessible by mobility-impaired users, such as, for example, new mothers. Located underneath the grip432is one or more actuation bars434that a user can linearly actuate by pulling the actuation bar434towards the perimeter edge of the grip432while holding grip432. The actuation bar434, when actuated, allows for the column assembly200and the arm300to rotate relative to the base100, while simultaneously allowing for the tub frame400and the infant tub500to rotate and/or pivot about the substantially circular hub310of arm300. In this embodiment collar250does not rotate with respect to base100, but is instead rigidly attached thereto, so that lower support member236rotated within the collar250. In the embodiment shown, pivot/rotation handles430have a single stage actuation, such that the rotating movement of arm300and column assembly200and the pivoting movement of tub frame400and infant tub500are activated substantially simultaneously. In some embodiments, however, pivot/rotation handles430may have dual stage actuation, such that the pivoting movement of the tub frame400and the infant tub500is activated prior to the rotating movement of arm300and column assembly200being activated, such that the pivoting movement of the tub frame400and the infant tub500is activated with a lesser degree of movement of actuation bar434than is necessary to activate the rotating movement of arm300and column assembly200. The opposite is also true, such that the rotating movement of arm300and column assembly200may be activated prior to the pivoting movement of the tub frame400and the infant tub500. In some further embodiments, the rotating movement of arm300and column assembly200and the pivoting movement of the tub frame400and the infant tub500may each be controlled by a physically separate set of handles. These physically separate sets of handles can have a common or separate grips.", "", "The height handles450have a grip452that is molded into the tub frame400along the length of the opposing short edges thereof. Located underneath the grip452is one or more actuation tabs454that a user can linearly actuate by pulling the actuation tab454towards the perimeter edge of the grip452while holding grip452. Height handles450, because they are on a same edge as the wheel handles410, have a significantly reduced width compared to the pivot/rotation handles430. The actuation tab454, when actuated, allows for the actuation of the height adjuster252(see, e.g.,FIG.4), allowing a user to increase or decrease a length of the column assembly200and, accordingly, the height of the tub frame400and the infant tub500relative to the surface on which the base100is supported, for example, the ground. Upper support shroud238slides vertically over and/or around the perimeter of the lower support member236. In some embodiments, a lower vertical stop can be selected based on the length of the upper support shroud238, such that upper support shroud238will contact collar250when at the minimum operable height of the bassinet1. The length of upper support shroud238is selected such that, at a maximum operable height of the bassinet1, it remains circumferentially engaged around at least a portion of the lower support member236. This feature is both aesthetically pleasing and functional, both hiding the linear bearing210(seeFIGS.4-8) and ensuring that no alignment features are needed to maintain circumferential alignment of the upper support shroud238and the lower support member236, which could cause a binding or jam of the bassinet if they were allowed to become separated during use and did not maintain sufficiently precise alignment with respect to each other.", "", "Hub310has a substantially circular shape and is substantially hollow, except for cable guide features, such as walls, retaining clips, and the like, to allow for adequate cable management for the cables needed for actuation of the wheel handles410, the pivot/rotation handles430, and the height handles450to each achieve their stated functions. Hub310has a substantially open top surface that mates with a corresponding surface of the tub frame400, which will be shown and described in greater detail regardingFIG.20.FIG.19shows an alternate embodiment of the bassinet, with anti-tip safety arm290being able to be selectively disengaged from the rotational movements of arm300and column assembly200.", "", "FIGS.20-22show the various aspects of the cable routing for the plurality of handles410,430,450provided in the tub frame400. Tub frame400has a central hub472that is attached to hub310of arm300to create a substantially enclosed area in which actuation cables can be routed without being externally visible. Tub frame400has an at least partially hollow perimeter portion that is connected to the hub472by lateral ribs470A,470B, which can be entirely enclosed so the cables routed therethrough are not externally accessible or visible. To allow the pivoting movement of the tub frame400and the infant tub500and the rotary movement of the arm300to occur simultaneously and over their respective maximum degrees of angular movement (in the embodiment shown, both are capable of rotating/pivoting ±135° from a central, or nominal, position at “0°”).", "", "For the rear wheels132(see, e.g.,FIG.3) to be unlocked, the actuator414is connected to first wheel cable418and pulls the first wheel cable418as the actuator414pivots about hinge416. First wheel cable418is connected to first wheel cable interface420, which is configured to be held substantially stationary and/or for only linear movement in the direction in which first wheel cable is pulled when actuator414is squeezed. First wheel cable interface420is connected to a second wheel cable422, which extends towards, and is connected to, wheel cable reducer424, which is configured to receive inputs from a plurality of second wheel cables422and actuate a third wheel cable426as an output when any of second wheel cables424transmit an actuation movement to wheel cable reducer424. Third wheel cable426is routed through hubs472and310, through arm300, and to column assembly200at interim terminus428. From interim terminus428, third wheel cable426is routed vertically through column assembly200, including, for example, through support post230, linear bearing210, support post positioner240, and rotary gear260, to be output from the bottom surface of the base100and is connected to each of rear wheels132such that, when actuated, the lock of each rear wheel132is deactivated so that bassinet1can be moved.", "", "For the pivoting and rotational movements of the tub frame400and the arm300, respectively, each actuator bar434is connected to the first pivot cable438and pulls the first pivot cable438as the actuator bar434is moved in the direction of the perimeter of grip432. First pivot cables438pass through hub310,472, and are directed through the outer perimeter portion of the tub frame400to the pivot cable reducer440. Pivot cable reducer440is configured to perform two actions simultaneously when receiving an actuation input from either of the plurality of first pivot cables438attached to an input side thereof. In a first aspect directed to the control of the rotary movement of the arm300and the column assembly200about base100, the pivot cable reducer440transmits a corresponding output to a rotary cable442that is routed through and around the hub310,472and into arm300to pass into and through the column assembly200at interim terminus444. In a second aspect directed to the control of the pivoting movement of the tub frame400and the infant tub500relative to the arm300, the pivot cable reducer440actuates a pivot lock476radially away from a central pivot gear478located within hub310,472to allow for rotation of the pivot gear478relative to the pivot lock476. When the actuating input from first pivot cable438is no longer received at the pivot cable reducer, the pivot lock476moves back to engage with the pivot gear478, which is integrally formed with, or rigidly attached or affixed to, tub frame400within hub472, to prevent the pivoting movement of the tub frame400and infant tub500relative to arm300. In some embodiments, the pivot gear478can be integrally formed or rigidly attached or affixed within hub310of arm300. From interim terminus444, rotary cable442is routed vertically through column assembly200, including, for example, through support post230, linear bearing210, support post positioner240, and rotary gear260, to be output from the bottom surface of the base100and is connected to rotary lock270such that, when actuated, the rotary lock270disengages from (e.g., moves radially away from) rotary gear260so that column assembly200and arm300can rotated relative to base100.", "", "In the region within lower support member236below support post positioner240, the third wheel cable426and the third pivot cable442are coiled in a substantially double helix arrangement (e.g., in a spring-like shape) which is vertically compressible, such that the pitch between each “coil” of each helix is variable based on the height at which the column assembly200is set. As such, when the column assembly200is extended vertically, each helix becomes elongated and the coils of the helix are spaced further apart. Similarly, when the column assembly is shortened vertically, each helix becomes correspondingly compressed and the coils of the helix are spaced closer together.", "", "To control the height adjustment of the bassinet1, which is accomplished by changing the length of the column assembly200, each actuator tab454is connected to a first height adjustment cable458and pulls the first height adjustment cable458as the actuator tab454is moved in the direction of the perimeter of grip452. First height adjustment cables458pass through the outer perimeter portion of the tub frame400to the height adjustment cable reducer460. Height adjustment cable reducer460receives an input from one of the first height adjustment cables458and transmits an actuation movement via a second height adjustment cable462, which passes into and around the hub310,472and is operably connected to height adjustment terminus464within column assembly200, such that the height adjuster252is activated to alter a length of the column assembly, thereby changing a height of the tub frame400and infant tub500.", "", "Various cable routing features are provided within and/or on tub frame400, arm300, column assembly200, and base100to maintain proper cable routing and ensure that actuations of the respective cables are transmitted from the respective handles to the respective actuation points within the bassinet1. InFIG.22, a top view through column assembly is provided, with inlet regions480designating areas at the top of the column assembly200(e.g., at an inlet of the arm collar320, seeFIG.4) through which respective actuation cables may pass therethrough. Similarly, exit regions482are shown at the bottom of the column assembly200(e.g., at a bottom of the post support positioner240, seeFIG.4through which respective actuation cables may pass therethrough.", "", "The rotational movements of the column assembly200, arm300, and tub frame400relative to the base100are shown inFIG.23, with the direction of rotation being indicated by R2. Infant tub500rotates along with tub frame400when placed therein.FIGS.24A-24Eshow example angular movements of the column assembly200and the arm300relative to base100.FIGS.25-28show other views of the bassinet1to more clearly illustrate the features thereof. Specifically, the tub frame400has a corner brace484at each corner thereof to support the infant tub500when placed therein. Infant tub500is also supported by the upper surface of hub472and lateral ribs470A,470B, thereby defining a substantially flat plane along which the bottom surface520of the infant tub500is supported by the tub frame400. In the embodiment shown, the range of motion of the tub frame400relative to the arm300is controlled by rotary stop490, the position of which on tub frame400determines the maximum angular degree of rotation of the tub frame400relative to the arm300by the rotary stop490contacting the arm300when the maximum angular rotation in one direction (e.g., clockwise or counterclockwise) is reached, thereby preventing rotational movements of the tub frame400that would result in damage to the respective actuation cables contained within and routed throughout the tub frame400. The pivoting movements of the tub frame400and the infant tub500relative to the arm300are shown inFIG.29, with the direction of rotation being indicated by R4. Infant tub500pivots along with tub frame400when placed therein.FIGS.30A-30Dshow example angular pivoting movements of the tub frame400and the infant tub500relative to the arm300.", "", "Some features of the infant tub are shown and described relative toFIGS.31-36B. Infant tub500can be made from one or more of opaque, translucent, and/or transparent materials, including, for example, aluminum, plastic, or any other suitable material. The infant tub has a recessed portion, generally designated530, which has a reduced length and/or width compared with the perimeter of the infant tub500measured at a height above the recessed portion530. Recessed portion530is provided to more accurately retain the infant tub500within the tub frame400and also to conform to a standard mattress (see, e.g.,700,FIG.41) or pad shape that would be placed within the recessed portion530inside the infant tub500. In some embodiments, physical indentations and/or protuberances in the tub frame400and the infant tub500, detachable mating clips attached thereto, and the like may be provided to provide enhanced physically interlocking engagement between the tub frame400and the infant tub500. In some embodiments, an actuatable release may be provided within the tub frame400to prevent the infant tub500from being separated from the tub frame400without the release being disengaged, either by direct manipulation of the release or by a remote release, for example, of the type shown for any of the wheel handles410, the pivot/rotation handles430, and/or the height handles450. The mattress700or pad can, for example, have a height that is substantially the same as the height of the recessed portion530to provide an effectively flat bottom surface of the infant tub500that is larger than bottom surface520of the infant tub500. The infant tub has, above the recessed portion530, opposing lateral side walls560that are connected by a front wall540and a back wall550. Side walls560and back wall550have a height that meets all applicable safety standards necessary for the transport of infants within a mobile bassinet. Front wall540has a reduced height that provides increased access to infants within the infant bassinet. In the corners572joining the front wall540with the side walls560, a further reduced height section542is provided to allow for a mother or other caregiver to have easier access to the infant to ensure the infant in safely transitioned from the bassinet into the arms of the mother or other caregiver. The upper edges of the back wall550and the side walls560have a rolled edge to provide a more distributed point of contact between the arms of the mother or other caregiver and the infant tub500when placing the infant into or removing the infant from the infant tub500. At each of corners572, along the entirety of the reduced height section542, and along the upper edge of front wall540, a fully rolled edge is provided to ensure a maximized distributed point of contact between the arms of the mother or other caregiver and the infant tub500when placing the infant into or removing the infant from the infant tub500.", "", "Infant tub500has an insert510that is contoured to the back wall550and the full height portions of the side walls560, including conforming to the inner contours of the recessed portion530and extending proximate to (e.g., in contact with) the bottom surface520of the infant tub500. As such, when a mattress (e.g.,700,FIG.41) is placed within the recessed portion530, the insert510is held securely against the back wall550and the side walls560to provide increased access to the infant when needed. During periods when increased access to the infant is not needed (e.g., during sleep and/or transport of the infant), the insert510is configured to be reversibly installed into a first position (seeFIGS.34-36A), such that the insert510is in contact with the front wall540and the side walls560of the infant tub500. In the second position (seeFIGS.31and32), the insert510is located against the side walls560and the back wall550of the infant tub500, so as to not require a separate storage location for the insert510when enhanced access to the interior of the infant tub500is desired by a user. The full height portions of the side walls560extend at least half of the total width of the overall width of the infant tub500. The sides of the insert510extend, just as with the side walls560of the infant tub500, over half of the width of the infant tub500. As such, when in the first position, the insert fully overlaps the reduced height sections542and the front wall540, thereby providing a substantially wall of a single height to prevent infants from rolling or otherwise falling over the side of the infant tub500while, for example, sleeping or being transported within the infant tub500.", "", "In some embodiments, the infant tub500has a visual indicator532, which is shown in an example embodiment inFIGS.35,36A, and36Bas a vividly colored area, such as red in the embodiment shown inFIGS.35,36A, and36Bwithin the recessed portion530to provide a visual indication to a user when the infant tub500is not fully engaged within the tub frame400. An example of such a mis-alignment, incomplete, and/or improper insertion of the infant tub500within the tub frame400can be seen, for example, inFIG.36B, which shows an example of the infant tub500not being fully and/or properly seated/positioned within the tub frame400. Further safety indicia may be provided to be visible on one or more of the outside and/or the inside surfaces of the infant tub500. Such safety indicia may include printed materials directing proper use of the bassinet1and warning of the dangers posed by improper use, such as, for example, placing an infant face down within the infant tub500. As noted above, the infant tub500may include, in some embodiments, a visual indicator532around the bottom perimeter of the infant tub500(e.g., within the recessed portion530). In the embodiment shown, this visual indicator532is flush with the infant tub500, is approximately one inch in width, and, from the outside of the tub, the visual indicator532is only visible when the infant tub500is incorrectly positioned in the tub frame400. This visual indicator532serves as a visual cue to appropriately adjust the infant tub500into the intended secure position within the tub frame400. In the embodiment shown, the outside marking may be red or some other vivid and/or noticeable color to draw attention and action from users regarding the m is-alignment, incomplete, and/or improper positioning of the infant tub500. In embodiments where the infant tub500is made of, at least in part, a translucent and/or a transparent material, the visual indicator532can serve as a pre-populated message board, with basic patient care information integrated on the inner surface thereof (e.g., the surface engaged against the outer surface of the infant tub500), such as “position infant on his/her back to sleep.” The inside marking of visual indicator532may be a neutral color, such as white.", "", "FIGS.37-41show an example embodiment of a two-piece insert, generally designated600, installed in various installation positions within an infant bassinet500. The inserts600have contoured shapes that match the internal contours of the rear wall550and side wall560of at least one of the corners of the infant tub500. InFIG.37, the inserts600are in a second position, in which the reduced height sections542are not blocked and each of the inserts600are positioned adjacent to (e.g., substantially flush with) the back wall and at least a portion of one of the two side walls of the infant tub500. In some embodiments, the inserts600can be configured to be installed in any of the corners of the infant tub, including at the reduced height sections542of infant tub500. In other embodiments, the inserts600can be configured to be “keyed” or otherwise shaped to only fit within a pair of designated corners of the infant tub500. Regardless of the configuration of the inserts600and in which corners of the infant tub500they are configured to fit, the height of the perimeter of the infant tub is not a continuous height but is instead a reduced height along at least a portion of front wall540where inserts600do not overlap front wall540(see, e.g.,FIGS.38-40) when both inserts600are in the second position.FIG.38shows the inserts600installed in a first position, in which the inserts600block the reduced height sections so that an upper edge546of the infant tub500and the inserts600is substantially continuous, other than at a portion of the front wall540over which the inserts600do not overlap.FIGS.39and40show two example configurations for the inserts600within the infant base, with one insert600being installed in the first position and one insert600being installed in the second position in each ofFIGS.39and40.FIG.41shows the inserts600being retained in the second position by being positioned between a mattress700located within the recessed portion (see530,FIGS.31and32) of the infant tub500and the walls of the recessed portion itself.", "", "In some embodiments, as shown in the example embodiment ofFIGS.42and43, a lighting device800(see also,502,FIG.36B) or devices can be included in association with bassinet1. For example, one or more LEDs or other suitable lighting device(s) can be provided in, on, integrally formed within, or removably coupled to the infant tub500. In some embodiments, the lighting device(s)800can be similarly incorporated with, or attached to, the tub frame400, either instead of, or in addition to, the lighting device800on the infant tub500. The lighting device(s)800can be provided power via batteries contained within a receptacle within the infant tub500or via electrical contacts on the infant tub500that mate with corresponding electrical contacts on the tub frame400to provide power to the lighting device(s)800from a power source (e.g., a rechargeable battery) located elsewhere on the bassinet1(e.g., on the base100, on the arm300, or on the tub frame400). The lighting device(s)800can in an example embodiment be positioned above the infant positioned within the infant tub500to provide optional lighting when activated within the infant tub to promote safe and comfortable infant handling by a user during periods of darkness, such as at night. The intensity of the light generated by the lighting device800may be controlled by a user, for example, by turning an intensity knob or engaging/pressing one or more buttons configured to set the lighting device at one of a plurality of preset illumination intensity thresholds, so that the infant's sleeping is not disturbed by turning on the lighting device800. In some embodiments, the lighting device800may be configured to direct the light generated toward a center region810of the infant tub500, away from an area of the infant tub in which the infant's face would be located while sleeping in the infant tub.", "", "The embodiments described herein are examples only and are not limiting. Many variations and modifications of the systems, apparatus, and processes described herein are possible and are within the scope of the disclosure. Accordingly, the scope of protection is not limited to the embodiments described herein, but is only limited by the claims that follow, the scope of which shall include all equivalents of the subject matter of the claims."], "claims": ["an infant tub comprising a bottom portion, a front wall portion, a back wall portion, a first side wall portion, and a second side wall portion, each of the front wall portion, the back wall portion, the first side wall portion, and the second side wall portion extending upward relative to the bottom portion, the back wall portion coupling a back edge of the first side wall portion to a back edge of the second side wall portion, the infant tub defining a first opening between a first edge of the front wall portion and the first side wall portion such that an upper edge of the infant tub includes a first upper edge portion disposed lower than an uppermost edge of the front wall portion, the infant tub defining a second opening between a second edge of the front wall portion and the second side wall portion such that the upper edge of the infant tub includes a second upper edge portion lower than the uppermost edge of the front wall portion, the second edge of the front wall portion disposed opposite the first edge of the front wall portion; a base; a column assembly coupled to the base; and an arm rotatably coupled to the column assembly, the arm configured to support the infant tub.", "2 . The system of claim 1 , wherein the bottom portion, the back wall portion, the first side wall portion, and the second side wall portion are integrally formed.", "3 . The system of claim 1 , wherein the bottom portion and the front wall portion are integrally formed.", "4 . The system of claim 1 , wherein the back wall portion, the first side wall portion, and the second side wall portion are integrally formed.", "5 . The system of claim 1 , wherein the infant tub includes a blocking portion configured to be transitioned between a first configuration in which the blocking portion blocks the first opening and a second configuration in which the blocking portion does not block the first opening.", "6 . The system of claim 5 , wherein the blocking portion is a first blocking portion, the infant tub including a second blocking portion configured to be transitioned between a first configuration in which the blocking portion blocks the second opening and a second configuration in which the blocking portion does not block the second opening.", "7 . The system of claim 1 , comprising a mattress disposed on an upper surface of the bottom portion.", "8 . The system of claim 1 , comprising a tub frame coupled to the arm and configured to support the infant tub, the tub frame including an upper surface defining a recess, the infant tub including a mating portion extended downward relative to the bottom portion and configured to be received in the recess, the mating portion having at least one of a smaller width or a smaller length than a maximum width between the front wall portion and the back wall portion or a maximum length between the first side wall portion and the second side wall portion, respectively.", "9 . The system of claim 1 , wherein the front wall portion has a maximum height smaller than a maximum height of the first side wall portion and a maximum height of the second side wall portion.", "10 . The system of claim 1 , wherein a distance between the front wall portion and the back wall portion is smaller than a distance between the first side wall portion and the second side wall portion.", "a base; a column assembly connected to the base; an arm rotatably connected to the column assembly; a tub frame connected to the arm; an infant tub including a front wall, a back wall opposite the front wall, a first side wall, and a second side wall opposite the first side wall, the front wall having a maximum height smaller than a maximum height of the first side wall and a maximum height of the second side wall such that a front edge of the first side wall, a front edge of the second side wall, and an upper edge of the front wall collectively define an access area to an interior of the infant tub; and an insert configured to be removably disposed within the interior of the infant tub, the insert configured to partially obstruct the access area.", "12 . The system of claim 11 , wherein, when the insert is disposed within the interior of the infant tub, the insert has a height greater than the height of the front wall adjacent the insert.", "13 . The system of claim 11 , wherein the infant tub comprises a bottom wall, integrally formed with the front wall, the back wall, the first side wall, and the second side wall.", "14 . The system of claim 11 , wherein the front wall comprises a central portion, a first outer portion coupled to a first side of the central portion, and a second outer portion coupled to a second side of the central portion opposite the first side, the central portion having a greater height than a height of the first outer portion and a height of the second outer portion.", "15 . The system of claim 14 , wherein the central portion of the front wall is coupled to the first side wall via the first outer portion and is coupled to the second side wall via the second outer portion.", "16 . The system of claim 1 , wherein a distance between the front wall and the back wall is smaller than a distance between the first side wall and the second side wall.", "transitioning, by a user while the user is in a seated position, an infant tub from at least one of a first position or first orientation to at least one of a second position or second orientation by engaging with at least one of the infant tub or a tub frame supporting the infant tub to cause the infant tub to rotate and/or translate relative to a base such that a front wall portion of the infant tub is facing the user and disposed sufficiently close to the user such that the user can access an interior of the infant tub from the seated position, the infant tub coupled to the base via a column assembly and an arm rotatably coupled to the column assembly; and accessing, by the user while the user is in the seated position, an infant disposed within the interior of the infant tub by inserting a first arm of the user through a first opening defined above a first reduced height portion of the infant tub and a second arm of the user through a second opening defined above a second reduced height portion of the infant tub such that the user is in contact with the infant through the first opening and the second opening, the first opening and the second opening separated by the front wall portion, the front wall portion having a greater height relative to a bottom portion of the infant tub than the first reduced height portion and the second reduced height portion.", "18 . The method of claim 17 , wherein the transitioning is performed by the user without assistance from another person.", "19 . The method of claim 17 , comprising removing, by the user while the user is in the seated position, the infant from the interior of the infant tub via removing the first arm from the first opening, removing the second arm from the second opening, and lifting the infant over the front wall portion.", "20 . The method of claim 17 , wherein the user is in the seated position on a bed.", "21 . The method of claim 17 , comprising transitioning, prior to the accessing, a blocking portion from a first configuration in which the blocking portion blocks the first opening to a second configuration in which the blocking portion does not block the first opening.", "22 . The method of claim 17 , wherein, in the second position or second orientation, the infant tub is at least partially disposed above and vertically aligned with a portion of the user.", "23 . The method of claim 17 , comprising adjusting, by the user, a height of the infant tub relative to the base by hand actuating a height handle included in the tub frame and operatively coupled to a height adjustment actuator included in the column assembly, the height handle disposed higher than a surface on which the user is seated during the adjusting.", "deactivating, by the user while the user is in the seated position, an automatic lock feature associated with a wheel coupled to the base via hand actuating a wheel handle included in the tub frame and operatively coupled to the automatic lock feature, the wheel handle disposed higher than a surface on which the user is seated during the deactivating; and moving the base via pulling on at least one of the infant tub or the tub frame.", "25 . The method of claim 17 , wherein the transitioning includes engaging, by a hand of the user, a pivot handle included in the tub frame and operatively coupled to a pivot actuator included in the tub frame, the pivot handle disposed higher than a surface on which the user is seated during the adjusting.", "a base; a column assembly connected to the base; an arm rotatably connected to the column assembly; a tub frame connected to the arm; an infant tub releasable coupled to the tub frame; and an anti-tip safety arm rotatably connected to the column assembly, the anti-tip safety arm being located underneath the base, wherein: the anti-tip safety arm is rotatable in a same plane as the arm as the column assembly is rotatable relative to the base; and the anti-tip safety arm is configured to contact ground and to minimize potential risk of the bassinet tipping over.", "27 . The bassinet according to claim 26 , wherein the infant tub comprises a visual indicator within an area defined by the recessed portion of the infant tub, the visual indicator being positioned and configured to provide a visual indication to a user when the infant tub is not fully seated within the tub frame.", "28 . The bassinet according to claim 26 , wherein the column assembly has a length that is adjustable and adjusting the length of the column assembly changes a height of the tub frame and infant tub relative to the base.", "29 . The bassinet according to claim 28 , wherein the length of the column assembly is adjustable by changing a length of a height adjuster located within the column assembly.", "30 . The bassinet according to claim 29 , wherein the tub frame comprises height handles that that are connected to the height adjuster by one or more cables routed through the tub frame and, when actuated, the height handles are configured to actuate the height adjuster to allow a user to change a length of the column assembly.", "31 . The bassinet according to claim 29 , wherein the height adjuster comprises a pneumatic strut.", "32 . The bassinet according to claim 26 , wherein the column assembly comprises a support post, which has a square cross-sectional profile and is fixedly connected to the arm, a lower support member, which has a cross-sectional profile of a hollow cylinder and is fixedly connected to the base, and a linear bearing configured to prevent relative rotational movements between the support post and the lower support member.", "the lower support member is fixedly connected to a rotary gear adjacent to the base; the rotary gear is rotatable along with the column assembly relative to the base; a rotary lock is slidingly attached to the base in a position adjacent to the rotary gear; and wherein the rotary lock and the rotary gear have interlocking teeth that, when the lock is engaged against the rotary gear, the column is held rotatably stationary relative to the base.", "34 . The bassinet according to claim 26 , comprising a rotary hub connecting the tub frame to the arm, the rotary hub comprising a pivot gear and a pivot lock that interlock to prevent a pivoting movement of the tub frame relative to the arm.", "35 . The bassinet according to claim 34 , wherein the tub frame comprises at least one pivot/rotation handle, which is connected by a pivot/rotation cable to the rotary lock and the pivot lock so that an actuating movement of the pivot/rotation handle by a user causes an actuation of the pivot/rotation cable, which substantially simultaneously disengages the pivot lock from the pivot gear and the rotary lock from the rotary gear, so that the tub frame is released to pivot about the arm and the column assembly is released to rotate about the base substantially simultaneously.", "36 . The bassinet according to claim 26 , wherein the base comprises a plurality of pivotable wheels, at least two of the pivotable wheels comprising an automatic lock feature that prevents a respective one of the pivotable wheels from rolling unless deactivated.", "37 . The bassinet according to claim 36 , wherein the tub frame comprises wheel handles configured to be actuated by a user to deactivate the automatic lock to allow the pivotable wheels to roll.", "38 . The bassinet according to claim 37 , wherein the at least two pivotable wheels are held rotatably fixed unless one or more of the wheel handles are actuated by a user.", "39 . The bassinet according to claim 37 , wherein each of the wheel handles are connected to a cable, wherein each cable is connected to a wheel cable reducer, which is configured to transmit an actuating movement from any of the cables to an outlet cable which is connected to the at least two pivotable wheels.", "40 . The bassinet according to claim 26 , wherein the column assembly has a variable length, wherein cables passing through the column assembly are coiled in a helical arrangement within a lower support member, and wherein a pitch of the helical arrangement varies as the length of the column assembly varies.", "41 . The bassinet according to claim 26 , wherein the anti-tip safety arm is in a retracted position with a distal end of the anti-tip safety arm spaced vertically apart from the ground when the anti-tip safety arm is substantially aligned with a length direction of the base and in a deployed position with the distal end of the anti-tip safety arm adjacent the ground when the anti-tip safety arm is not substantially aligned with the length direction of the base.", "42 . The bassinet according to claim 26 , wherein the insert comprises first and second sections, the first and second sections being contoured to fit within a respective one of the corners of the infant tub.", "43 . The bassinet according to claim 26 , wherein the first and second sections are movable between respective corners of the infant tub independently of each other and are secured in place within the infant tub in one of the respective corners of the infant tub.", "44 . The bassinet according to claim 26 , wherein the insert in one position is substantially flush with the back wall and at least portions of the two side walls of the infant tub.", "45 . The bassinet according to claim 26 , comprising a lighting device attached to the bassinet.", "46 . The bassinet according to claim 45 , wherein the lighting device is configured to direct a light towards a center region within the infant tub, away from a face of an infant placed therein."], "bibtex": "@patent{20240092121,\n    title = {BASSINET},\n    number = {20240092121},\n    year = {2024},\n    note = {File: US20240092121A1-20240321.XML}\n    }", "classification": "B60B3300FI"}, {"title": "ADDITIVES IN RUBBER FORMULATIONS", "doc_number": "20240092122", "filename": "US20240092122A1-20240321.XML", "abstract": "The present invention relates to the use of at least one N,N-dimethylamide as an additive in an elastomeric composition for producing a tread band for vehicle wheels, wherein the N,N-dimethylamide has the formula: formula (I), wherein: R is a C 6 -C 12 alkyl group, and R′ and R″ are methyl. A further aspect of the present invention concerns a vulcanised elastomeric material for producing a tread band for vehicle wheels obtained by vulcanising an elastomeric composition comprising (a) at least one elastomeric polymer, (b) at least one reinforcing filler selected among hydroxides, oxides and hydrated oxides, salts and hydrated salts of metals or mixtures thereof and (c) at least one N,N-dimethylamide of formula (I). An additional aspect of the present invention concerns a tread band for vehicle wheels comprising a vulcanised elastomeric material, which vulcanised elastomeric material is obtained by vulcanising an elastomeric composition comprising (a) at least one elastomeric polymer, (b) at least one reinforcing filler selected among hydroxides, oxides and hydrated oxides, salts and hydrated salts of metals or mixtures thereof and (c) at least one N,N-dimethylamide of formula (I). The inventive use and the inventive composition provide effective elastomeric materials particularly suitable for use as treads on vehicle tyres.", "detailed_description": ["The elastomeric materials may be employed in producing a tread band for vehicle wheels. The performance of the elastomeric materials, particularly as all being comprised in tread bands, has been found to be particularly effective.", "", "In particular, the use of the at least one N,N-dimethylamide of formula (I) in the elastomeric composition for making resulting elastomeric materials for tread allows particularly satisfactory results in regard to the tyre characteristics typical for its intended use. For example, it is possible to achieve the required characteristics of abrasion and tear resistance of a tyre for heavy load vehicle wheels, the performance characteristics of low-temperature and on the wet for winter tyres, to achieve a reduced rolling resistance both at low temperatures, (for example 0° C. or lower) and at high temperatures (for example 70° C. or higher) for all seasons vehicle tyres. The inventors believe that the at least one N,N-dialkylamide of formula (I) of the present invention facilitates the dispersibility of filler within the elastomeric material, particularly where the filler comprises silica.", "", "The R group may be a linear, branched or cyclic alkyl group. These alkyl groups may be further substituted, for instance with aryl, arylalkyl, alkylaryl groups or even groups containing heteroatoms, for instance hydroxyl or oxo groups. Nevertheless, it is preferred that the R group does not contain heteroatoms as this may be detrimental to the polarity of the molecules. Preferably the R group is not substituted. More preferably the R group is linear alkyl or branched alkyl and more preferably still linear alkyl.", "", "According to a preferred aspect of the invention, the R of the N,N-dimethylamide of formula (I) is a C7-C11alkyl group.", "", "Specific examples of N,N-dimethylamides of formula (I) according to the present invention are N,N-dimethylamides, in particular N,N-dimethyl heptanamide; N,N-dimethyloctanamide; N,N-dimethylnonanamide; N,N-dimethyldecanamide; N,N-dimethylundecanamide; N,N-dimethyldodecanamide; N,N-dimethyltridecanamide; N,N-dimethylethylhexanamide, for instance N,N-dimethyl-2-ethylhexanamide or N,N-dimethyl-3 ethyl hexanamide; N, N-dimethyl methylhexanamide, for instance N, N-dimethyl-2-methyl hexanamide or N, N-dimethyl-3-methyl hexanamide; N, N-dimethyl methyl pentamide, for instance N, N-dimethyl-2-methyl pentamide or N, N-dimethyl-3-methyl pentamide; or N, N-dimethyl-dimethyl nonanamide, for instance N, N-dimethyl-4,8-dimethyl nonanamide. Particularly preferred are N, N-dimethyloctanamide, N, N-dimethyldecanamide and N, N-dimethyldodecanamide.", "", "Specific examples of suitable mixtures of N,N-dimethylamides include mixtures of N,N-dimethyloctanamide N,N-dimethyldecanamide or mixtures of N,N-dimethyloctanamide, N,N-dimethylnonanamide and N,N-dimethyldecanamide. These could be prepared starting from C8-C10fatty acids, which may be regarded as short-chain fatty acids, with dimethyl amine.", "", "Particularly preferred is N, N-dimethyloctanamide; N, N-dimethyldecanamide and mixtures thereof.", "", "Preferred are dimethylamides prepared by converting naturally occurring acids such as octanoic acid, decanoic acid and undecanoic acid i.e. with saturated aliphatic groups or oleic acid as an example of unsaturated aliphatic group. These compounds can be converted to the corresponding dimethylamides by the reaction of the aforesaid corresponding acids with dimethylamine.", "", "The amount of dimethyl amide of formula (I) may be generally from 0.1 phr to 15 phr, typically from 0.1 phr to 10 phr, suitably from 1 phr to 5 phr, and preferably from 2 phr to 3 phr.", "", "Desirably, the elastomeric composition further comprises (d) at least one polyalkylene glycol. The polyalkylene glycol may be any polyalkylene glycol. Suitably the polyalkylene glycol may be either polyethylene glycol or polypropylene glycol or a mixture of polyethylene glycol and polypropylene glycol (referred to as PEO/PPO) or a polyalkylene glycol containing a mixture of ethylene oxide repeating units and propylene oxide repeating units (referred to as P-EO-PO). More desirably, the polyalkylene glycol is polyethylene glycol or P-EO-PO. Suitably, the P-EO-PO would have a ratio of >0:<100 to <100: >0 ethylene oxide units to propylene oxide units, for instance 1:99 to 99:1. More preferably the polyalkylene glycol is polyethylene glycol.", "", "Preferably the polyalkylene glycol (d), more preferably polyethylene glycol (d), is of medium molecular weight. By medium molecular weight we mean that the polyalkylene glycol, preferably polyethylene glycol, would have a weight average molecular weight from 400 to 8000, suitably from 1500 to 8000, desirably from 1500 to 6000.", "", "The use of at least one polyalkylene glycol, preferably polyethylene glycol, and at least one N,N-dimethyl amide of formula (I), in the elastomeric material, for instance for tread band according to the present invention produces a further improving effect. In fact, both the processability of the elastomeric material and the rolling resistance and, more generally, the characteristics already improved by the use of the N,N-dimethyl amide are higher than the results obtained by using the N, N-dimethylamide of formula (I) alone. The elastomeric material comprising (a) at least one elastomeric polymer, (b) at least one reinforcing filler selected among hydroxides, oxides and hydrated oxides, salts and hydrated salts of metals or mixtures thereof and (c) at least one N,N-dimethylamide of formula (I) according to the present invention can be advantageously used also for the preparation of tread bands useful for the reconstruction of tyres, the so-called retreated tyres.", "", "Generally, the amount of reinforcing filler contained in the elastomeric material, e.g. when included in the tyre, according to the present invention does not represent a critical parameter but more evident results in terms of improved workability of the elastomeric material are obtained with an amount of reinforcing filler lower or equal to 100 phr, preferably from 10 phr to 100 phr, more preferably from 15 phr to 70 phr. Among the specific examples of reinforcing fillers that can be used in the present invention silica, alumina, silicates, hydrotalcite, calcium carbonate, kaolin, titanium dioxide and mixtures thereof can be cited.", "", "Among the specific examples of silica, pyrogenic silica, amorphous precipitated silica, wet silica (hydrated silicic acid), fumed silica or mixtures thereof can be particularly cited.", "", "Silica is preferably used, more preferably amorphous precipitated silica with a surface area as described in Standard ISO 5794-1:2005 from 1 m2/g to 200 m2/g, preferably from 10 m2/g to 150 m2/g, more preferably from 20 m2/g to 110 m2/g.", "", "The amount of elastomeric material of the present invention that may be included in a tyre preferably comprises from 15 phr to 70 phr of a silica reinforcing filler. Examples of silica reinforcing fillers that can be used according to the present invention are commercially available products under the trademarks Hi-Sil® 190, Hi-Sil® 210, Hi-Sil® 215, Hi-Sil® 233, Hi-Sil® 243 from PPG Industries; Ultrasil® VN2, Ultrasil® VN3, Ultrasil® 7000 from Degussa; Zeosil® 1 165MP from Rhodia.", "", "Specific examples of silicates are phyllosilicates, such as for example, montmorillonite, bentonite, nontronite, beidellite, volkonskoite, hectorite, saponite, sauconite, vermiculite, halloysite, sericite or mixtures thereof. Montmorillonite is particularly preferred. These layered materials generally contain exchangeable ions such as sodium (Na+), calcium (Ca2+), potassium (K+), magnesium (Mg2+), hydroxide (OH−) or carbonate (CO32−) onto the surfaces between the layers.", "", "The polymeric component of the elastomeric material, according to the present invention, can be formed of any elastomeric polymer or elastomeric polymer mixture and desirably those commonly used for the production of tyres and particularly for the production of treads.", "", "The elastomeric polymer (a) may be a natural elastomeric polymer or a synthetic elastomeric polymer or mixtures thereof. Suitably the elastomeric polymer (a) may be a diene polymer that can be selected from those commonly used in sulphur cross-linkable elastomeric materials, that are particularly suitable for producing tyres. Such sulphur cross linking may be referred to as vulcanisation.", "", "Elastomeric polymers may be C—C double bonds and such C—C double bonds may be vinyl groups, —CH═CH2, or —C—(CH3)═CH2) groups or internal double bonds such as —CH═C(CH3)— groups. Both vinyl groups and C—C-double bonds allow for cross-linking the polymer chains of the elastomeric material, e.g. by vulcanisation.", "", "Examples of elastomeric polymers (a) include polybutadiene, polychloroprene, also called neoprene, acrylonitrile butadiene rubber (NBR), ethylene propylene diene monomer rubber (EPDM), natural rubber, poly-2,3-dimethyl butadiene, styrene butadiene rubber (SBR), butyl rubber, carboxylated nitrile rubber (XNBR), hydrogenated carboxylated nitrile rubber (HXNBR), and mixtures of at least 2 of the foregoing. One suitable elastomeric polymer (a) is SBR. Suitable binary mixtures are co-vulcanisates of SBR and neoprene and of SBR and natural rubber, and of SBR and butyl rubber. SBR may be made in solution (S-SBR) or in emulsion (E-SBR).", "", "Desirably, the elastomeric polymers may be homopolymers or copolymers with an unsaturated chain having a glass transition temperature (Tg) generally below 20° C., preferably in the range of from 0° C. to −110° C. These homopolymers or copolymers can be of natural origin or can be obtained by polymerisation in solution, polymerisation in emulsion or gas phase polymerisation of one or more conjugated by olefins, optionally blended with at least one comonomer selected from mono vinyl arenes and/or polar comonomers in an amount not higher than 60% by weight.", "", "The conjugated diolefins generally contain from 4 to 12, preferably from 4 to 8 carbon atoms and can be selected, for instance, from 1,3-butadiene, isoprene, 2-3-dimethyl-1,3-butadiene, 1,3-pentadiene, 1,3-hexadiene, 3-butyl-1,3-octadiene, 2-phenyl-1,3-butadiene or mixtures thereof. 1,3-butadiene and isoprene are more preferred.", "", "Monovinylarenes, which can optionally be used as comonomers, in general contain from 8 to 20, preferably from 8 to 12 carbon atoms and can be selected, for example, from styrene; 1-vinyl naphthalene; 2-vinyl naphthalene; various alkyl, cycloalkyl, aryl, alkyl aryl or aryl alkyl derivatives of styrene, such as, for example, α-methyl styrene, 3-methyl styrene, 4-propyl styrene, 4-cyclohexyl styrene, 4-dodecyl styrene, 2-ethyl-4 benzyl styrene, 4-p-tolyl styrene, 4-(4-phenyl butyl) styrene, or mixtures thereof. Styrene is especially preferred.", "", "Polar comonomers, which can be optionally used, can be selected from, for example, vinylpyrrolidine, vinyl quinoline, acrylic acid and alkyl acrylic acid esters and nitriles or mixtures thereof, such as, for example, methyl acrylate, ethyl acrylate, methyl methacrylate, ethyl methacrylate, acrylonitrile or mixtures thereof.", "", "Preferably the elastomeric polymer (a) is a diene polymer. This elastomeric diene polymer suitable for the present invention can be selected, for example, from cis-1,4-poly-isoprene (natural or synthetic, preferably natural rubber), 3,4 polyisoprene, polybutadiene (in particular polybutadiene with a high 1,4-cis content), optionally halogenated isoprene/isobutylene copolymers, 1,3-butadiene/acrylonitrile copolymers, styrene/1,3-butadiene copolymers, styrene/isoprene/1,3-butadiene copolymers, styrene/1,3-butadiene/acrylonitrile copolymers or mixtures thereof.", "", "According to one preferred embodiment, said elastomeric material comprises at least 10% by weight of natural rubber, preferably from 20% by weight to 100% by weight of natural rubber, with respect to the total weight of said at least one elastomeric diene polymer (a).", "", "The above-mentioned elastomeric material can optionally comprise at least one elastomeric polymer of one or more monoolefins with an olefinic comonomer or derivatives thereof (a′). The monoolefins can be selected from ethylene and an α-olefin, optionally with a diene; isobutylene homopolymers or copolymers thereof with small amount of a diene, which are optionally at least partially halogenated. The optionally present diene generally contains from 4 to 20 carbon atoms and is preferably selected from 1,3-butadiene, isoprene, 1,4-hexadiene, 1,4-cyclo hexadiene, 5-ethyldiene-2-norbornene, 5-methylene-2-norbornene, vinyl norbornene or mixtures thereof. Among fees, the following are particularly suitable: ethylene/propylene copolymers (EPR) or ethylene/propylene/diene copolymers (EPDM); polyisobutylene; butyl rubbers; halobutyl rubbers, in particular chlorobutyl or bromobutyl rubbers, or mixtures thereof.", "", "An elastomeric diene polymer (a) or an elastomeric mono olefin polymer (a′) functionalized by reaction with suitable terminating or coupling agents can be optionally used. In particular, the elastomeric diene polymers obtained by anionic polymerization in the presence of an organometallic initiator (particularly an organolithium initiator) can be functionalized by reacting the residual organometallic groups derived from the initiator with suitable terminating agents or coupling agents such as, for example, imines, carbodiimides, alkyltin halides, substituted benzophenones, alkoxysilanes or aryloxysilanes. Optionally, said elastomeric material can also include at least one carbon black reinforcing filler (e).", "", "The additional reinforcing filler can be selected among those used for crosslinked products, particularly carbon black or its aggregates with silica derivatives as described for example in U.S. Pat. No. 6,057,387.", "", "According to a preferred embodiment, the carbon black reinforcing filler (e) that can be used in the present invention can be selected among those having a surface area not less than 20 m2/g (determined by STSA—statistical thickness surface area according to ISO 18852:2005).", "", "According to a preferred embodiment, said carbon black reinforcing filler (e) is present in the elastomeric material in an amount from 0.1 phr to 120 phr, preferably from 3 phr to 90 phr. The elastomeric material can also include at least one silane coupling agent (f).", "", "According to a preferred embodiment, the silane coupling agent (f) that can be used in the present invention can be selected among those having at least a hydrolysable silane group that can be identified, for example, by the following general formula (II):", "", "(R′)3Si—CnH2n—X   (II)", "", "wherein the groups R′, the same or different from each other, are selected among: alkyl, alkoxy or aryloxy groups or among halogen atoms, provided that at least one of the R′ groups is an alkoxy or aryloxy group; n is an integer from 1 to 6, extremes included; X is a group selected among: nitroso, mercapto, amino, epoxide, vinyl, imide, chloro, —(S)mCnH2n—Si—(R′)3or —S—COR′, wherein m and n are integers from 1 to 6, extremes included and the R′ groups are as defined above.", "", "Among the silane coupling agents, those particularly preferred are bis(3-triethoxysilylpropyl)tetrasulphide and bis(3-triethoxysilylpropyl)disulphide. Said coupling agents can be used as such or as a suitable mixture with an inert filler (for example carbon black) as to facilitate their incorporation into the elastomeric material.", "", "According to a preferred embodiment, said silane coupling agent (f) is present in the elastomeric material in an amount from 0.01 phr to 10 phr, preferably from 0.5 phr to 5 phr.", "", "The abovementioned elastomeric materials can be vulcanised according to known techniques, in particular with sulphur vulcanising systems commonly used for elastomeric diene polymers. For this purpose, after one or more steps of thermo-mechanical treatment, a sulphur vulcanising agent is incorporated into the material together with vulcanisation accelerators. In the final treatment step, the temperature is generally kept below 120° C. and preferably below 100° C., so as to avoid any unwanted pre-crosslinking phenomena.", "", "The vulcanising agent more advantageously used is sulphur or molecules comprising sulphur (sulphur donors), with accelerators and activators known to those skilled in the art.", "", "The activators that are particularly effective are zinc compounds and particularly ZnO, ZnCO3, zinc salts of saturated or unsaturated fatty acids containing from 8 to 18 carbon atoms, such as, for example, zinc stearate, which are preferably formed in situ in the elastomeric material from ZnO and fatty acid, as well as BiO, PbO, Pb3O4, PbO2or mixtures thereof.", "", "Accelerators that are commonly used can be selected among: dithiocarbamates, guanidine, thiourea, thiazoles, sulphenamides, thiurams, amines, xanthates or mixtures thereof.", "", "Said elastomeric materials can include other commonly used additives selected on the basis of the specific application for which the material is intended. For example, antioxidants, anti-ageing agents, plasticizers, adhesives, anti-ozone agents, modifying resins, fibres (for example Kevlar® pulp) or mixtures thereof can be added to said materials.", "", "Particularly, for the purpose of further improving the processability, a plasticizer, generally selected among mineral oils, vegetable oils, synthetic oils or mixtures thereof, such as for example, aromatic oil, naphtenic oil, phthalates, soybean oil or mixtures thereof, can be added to said elastomeric material. The amount of plasticizer is generally from 0 phr to 70 phr, preferably from 5 phr to 30 phr.", "", "The abovementioned elastomeric materials can be prepared by mixing together the polymeric components with the reinforcing filler and with the other additives optionally present according to techniques known in the art. The mixing can be carried out, for example, by using an open mixer of open-mill type or an internal mixer of the type with tangential rotors (Banbury) or with interlocking rotors (Intermix) or in continuous mixers of Ko-Kneader (Buss) or of co-rotating or counter- rotating twin-screw type.", "", "As used herein, the term “phr” (acronym of parts per 100 parts of rubber) means the parts by weight of a given component of elastomeric material per 100 parts by weight of the elastomeric polymer.", "", "As used herein, all ranges include any combination of the reported maximum and minimum points and include any intermediate ranges therein which can or cannot be specifically enumerated in the present description.", "", "The invention may be defined by the following embodiments.", "", "Embodiment 1. Use of at least one N,N-dimethylamide as an additive in an elastomeric composition for producing a tread band for vehicle wheels, wherein the at least one N,N-dimethylamide has the formula:", "", "wherein:R is a C6-C12alkyl group, andR′ and R″ are methyl.", "", "Embodiment 2: Use according to embodiment wherein the elastomeric composition is vulcanised to form an elastomeric material by vulcanising the elastomeric composition which elastomeric composition comprises (a) at least one elastomeric polymer, (b) at least one reinforcing filler selected from hydroxides, oxides and hydrated oxide, salts and hydrated salts of metals or mixtures thereof and (c) the at least one N,N-dimethylamide.", "", "Embodiment 3: Use according to embodiment 1 or embodiment 2 wherein the elastomeric composition further comprises (d) at least one polyalkylene glycol, preferably polyethylene glycol or P-EO-PO, more preferably polyethylene glycol.", "", "Embodiment 4: Use according to any preceding embodiment wherein the elastomeric composition comprises a N,N-dimethylamide of formula (I), wherein R is a C7-C11alkyl group.", "", "Embodiment 5: Use according to any of embodiments 2 to 4 wherein said elastomeric material is formed by vulcanising an elastomeric composition comprising a N,N-dimethylamide of formula (I) in an amount from 0.1 phr to 15 phr, preferably 0.1 phr to 10 phr.", "", "Embodiment 6: Use according to any of embodiments 2 to 5 wherein said elastomeric material is formed by vulcanising an elastomeric composition comprising a N,N-dimethylamide of formula (I) in an amount from 1 phr to 5 phr.", "", "Embodiment 7: Use according to any of embodiments 2 to 6 and wherein said elastomeric material is formed by vulcanising an elastomeric composition comprising a N,N-dimethylamide of formula (I) in an amount from 2 phr to 3 phr.", "", "Embodiment 8: Use according to any of embodiments 3 to 7 wherein said polyalkylene glycol, preferably polyethylene glycol, is a medium molecular weight polyalkylene glycol, preferably polyethylene glycol.", "", "Embodiment 9: Use according to any one of embodiments 2 to 8 wherein said polyalkylene glycol, preferably polyethylene glycol, has a weight average molecular weight from 1500 to 8000.", "", "Embodiment 10: Use according to any of embodiments 2 to 9 wherein said reinforcing filler is included in an amount lower or equal to 100 phr.", "", "Embodiment 11: Use according to any of embodiments 2 to 10 wherein said reinforcing filler is in an amount from 10 phr to 100 phr.", "", "Embodiment 12: Use according to any of embodiments 2 to 11 wherein said reinforcing filler is in an amount from 15 phr to 70 phr.", "", "Embodiment 13: Use according to any of embodiments 2 to 12 wherein said reinforcing filler (b) is silica.", "", "Embodiment 14: Use according to any of embodiments 2 to 13 wherein said elastomeric composition further comprises (e) at least one reinforcing filler of carbon black.", "", "Embodiment 15: Use according to any embodiments 2 to 14 wherein said elastomeric material further comprises (f) at least one silane coupling agent.", "", "Embodiment 16: A vulcanised elastomeric material for producing a tread band for vehicle wheels obtained by vulcanising an elastomeric composition comprising (a) at least one elastomeric polymer, (b) at least one reinforcing filler selected among hydroxides, oxides and hydrated oxides, salts and hydrated salts of metals or mixtures thereof and (c) at least one N,N-dimethylamide of formula:", "", "wherein:R is a C6-C12alkyl group,R′ and R″ are methyl.", "", "Embodiment 17: The vulcanised elastomeric material of embodiment 16 comprising any of the features defined in any of embodiments 2 to 15.", "", "Embodiment 18: A tread band for vehicle wheels comprising a vulcanised elastomeric material, which vulcanised elastomeric material is obtained by vulcanising an elastomeric composition comprising (a) at least one elastomeric polymer, (b) at least one reinforcing filler selected among hydroxides, oxides and hydrated oxides, salts and hydrated salts of metals or mixtures thereof and (c) at least one N,N-dimethylamide of formula:", "", "wherein:R is a C6-C12alkyl group,R′ and R″ are methyl.", "", "Embodiment 19: The tread band of embodiment 18 comprising any of the features defined in any of embodiments 2 to 16.", "", "The present description will be further illustrated by some examples which are given for purely indicative purposes and without any limitation to this invention."], "claims": ["1 .- 15 . (canceled)", "wherein: R is a C R′ and R″ are methyl.", "17 . (canceled)", "wherein: R is a C R′ and R″ are methyl.", "19 . (canceled)", "20 . The vulcanized elastomeric material according to claim 16 wherein the elastomeric composition is vulcanised to form an elastomeric material by vulcanising an elastomeric composition which elastomeric composition comprises (a) at least one elastomeric polymer, (b) at least one reinforcing filler selected from hydroxides, oxides, hydrated oxides, salts, and hydrated salts of metals or mixtures thereof, and (c) the at least one N,N-dimethylamide of formula (I).", "21 . The vulcanized elastomeric material according to claim 16 wherein the elastomeric composition further comprises (d) at least one polyalkylene glycol.", "22 . The vulcanized elastomeric material according to claim 16 wherein the elastomeric composition comprises the N,N-dimethylamide of formula (I), wherein R is a C 7 -C 11 alkyl group.", "23 . The vulcanized elastomeric material according to claim 16 wherein said elastomeric material is formed by vulcanising an elastomeric composition comprising a N,N-dimethylamide of formula (I) in an amount from 0.1 phr to 15 phr.", "24 . The vulcanized elastomeric material according to claim 20 wherein said elastomeric material is formed by vulcanising an elastomeric composition comprising a N,N-dimethylamide of formula (I) in an amount from 1 phr to 5 phr.", "25 . The vulcanized elastomeric material according to claim 20 wherein said elastomeric material is formed by vulcanising an elastomeric composition comprising a N,N-dimethylamide of formula (I) in an amount from 2 phr to 3 phr.", "26 . The vulcanized elastomeric material according to claim 21 wherein said polyalkylene glycol is a medium molecular weight polyalkylene glycol.", "27 . The vulcanized elastomeric material according to 26 wherein said polyalkylene glycol has a weight average molecular weight from 1500 to 8000.", "28 . The vulcanized elastomeric material according to claim 20 wherein said reinforcing filler is included in an amount lower or equal to 100 phr.", "29 . The vulcanized elastomeric material according to claim 28 wherein said reinforcing filler is included in an amount from 10 phr to 100 phr.", "30 . The vulcanized elastomeric material according to claim 29 wherein said reinforcing filler is included in an amount from 15 phr to 70 phr.", "31 . The vulcanized elastomeric material according to claim 20 wherein said reinforcing filler (b) is silica.", "32 . The vulcanized elastomeric material according to claim 20 wherein said elastomeric composition further comprises (e) at least one reinforcing filler of carbon black.", "33 . The vulcanized elastomeric material according to claim 20 wherein said elastomeric material further comprises (f) at least one silane coupling agent.", "34 . The vulcanized elastomeric material according to claim 21 wherein the polyalkylene glycol comprises polyethylene glycol or PO-EP-PO.", "35 . The vulcanized elastomeric material according to claim 34 wherein the polyalkylene glycol comprises polyethylene glycol."], "bibtex": "@patent{20240092122,\n    title = {ADDITIVES IN RUBBER FORMULATIONS},\n    number = {20240092122},\n    year = {2024},\n    note = {File: US20240092122A1-20240321.XML}\n    }", "classification": "B60C100FI"}, {"title": "REINFORCED-RUBBER SPOKE FOR A NON-PNEUMATIC TIRE", "doc_number": "20240092123", "filename": "US20240092123A1-20240321.XML", "abstract": "Aspects of the invention relate to reinforced-rubber spokes for a non-pneumatic tire and non-pneumatic tires comprising a plurality of reinforced-rubber spokes. The spoke comprises a radially outer end for connecting the spoke to a shearband, a radially inner end for connecting the spoke to a hub and a web extending between the radially inner end and the radially outer end, the web comprising therein reinforcement cord serpentining between the radially inner end and the radially outer end.", "detailed_description": ["FIG.1shows a schematic representation of a non-pneumatic tire10(NPT) according to an aspect of the present invention. The NPT10comprise an annular tread12for contacting ground. The NPT10further comprises radially outer shearband14supporting the tread12. Also the NPT10comprises wheel hub17configured to receive the axle of the car (not depicted).FIG.1also depicts a connecting structure for connecting the radially outer shearband14to the wheel hub17.", "", "The connecting structure comprises a plurality of a reinforced-rubber spokes18. For the sake of clarity, only a subset of the spokes are represented.", "", "A radially inner shearband16may be provided between the wheel hub17and the connecting structure. The spokes18may be in direct contact with the radially inner shearband16. In an embodiment, the radially inner shearband16may be dispensed with. In another embodiment, the radially inner shearband16may be replaced by (reinforced) plastic. In that case, the spokes18may be in direct contact with the (reinforced) plastic.", "", "In particular, the rubber spokes18comprise a radially outer end20for connecting the spoke18to the radially outer shearband14and a radially inner end22for connecting the spoke to the wheel hub17(or the radially inner shearband16as depicted inFIG.1or the (reinforced) plastic).", "", "The radially outer end20of the rubber spokes18may comprise a flange for connecting the spoke to the shearband14. The radially inner end22rubber spokes18may comprise a flange for connecting the spoke to the wheel hub17(or the radially inner shearband16as depicted inFIG.1or the (reinforced) plastic).", "", "The rubber spokes18may comprise a web24extending between the radially inner end22and the radially outer end20. The web may comprise a reinforcement cord in its core. In particular, as will be further described below, the reinforcement cord may be sandwiched between first and second layers of rubber. The reinforcement cord may be serpentining between the radially outer end20and the radially inner end22.", "", "In the following, different steps, according to several embodiments, for producing the spokes18and the NPT10will be described for illustrating the structure of the spokes18and their integration in the NPT10.", "", "FIG.2schematically depicts a top view of a step of a method for producing the spokes18. A first layer26of uncured (e.g. green) rubber is deposited on a mold element28. The mold element28is provided with pins30(e.g. metal pins). The pins30are located at the radially inner end and the radially outer end of the spoke being manufactured. In particular, a first array of first pins may be provided at the radially outer end and a second array of second pins may be provided at the radially outer end. The first pins may be arranged along a first straight line. The second pins may be arranged along a second straight line. The first pins and second pins may be identical or different. The location of the first and second pins may be distributed homogeneously on the respective straight lines. The distance to the nearest (neighbor) pin of a (particular) pin may be the same or different for each pin.", "", "The first layer of rubber26is deposited between the pins30, i.e. between the radially inner end and the radially outer end of the spoke being manufactured. A reinforcement cord32is provided on top of the first layer26of rubber. The reinforcement cord32serpentines between the radially inner end and the radially outer end. The reinforcement cord32comprise first U-turns at the radially outer end, around the (first) pins30, and second U-turns, around the (second) pins30, at the radially inner end. In an embodiment, as depicted, the reinforcement cord32alternates between the radially inner end and the radially outer end. The reinforcement cord32may regularly (periodically) alternate between the radially inner end and the radially outer end.", "", "It is worthwhile noting that a tube31may be arranged between each U-turn and the corresponding pin, as depicted inFIG.8. The tube may have the same longitudinal axis as the pin it covers. The tube31may comprise, or consist of, half-cured or cured rubber. The tube31may comprise, or consist of, a metal, e.g. steel and/or aluminum. The tube may comprise, or consist of, a polymer having preferably a high melting point (e.g. above 150° C.), e.g. nylons, cross-linked poly-ethylene (PEX). The tube31may comprise a radially outer layer comprising, or consisting of, half-cured or cured rubber. The tube31has a radially outer surface which may comprise one or more recesses (e.g. one or more notches) for receiving the reinforcement cord. Of course, other configurations are contemplated for improving retention of the reinforcement cord after curing of the spoke. The outer surface may be roughened or textured, preferably excluding the notch. As will be appreciated the tube31allows easier extraction from the mold of the spoke after cure. Also, the tube31may reduce potential movements of the reinforcement cord at the U-turns under the dynamic stresses generated by a rolling tire comprising the spoke.", "", "It may be beneficial to fix the reinforcement cord32to one or more pins30, e.g. the extremal pins in order to keep the reinforcement cord32under tension and mitigate the risk of movement of the reinforcement cord32during a subsequent step of curing. The fixing may be carried out by making a knot around the extremal pins. Alternatively or additionally, the fixing may be effected by making a knot and stapling the knot to the first layer26of uncured rubber with one or more (metal or polymer) staples. The knot may thus act as a stopping knot. Also, alternatively or additionally, the knot may be pushed into the uncured rubber.", "", "In an embodiment, the extremal pins may be additional pins, i.e. different from the pins30. The extremal pins may be off centered with respect to the first and/or second arrays of pins. This allows for leaving more space for making the knot.", "", "The knot may be a Marlinspike Hitch. Of course, other knots are equally possible. The reinforcement cord32may be is cut on the outer ends of the knots.", "", "The reinforcement cord32may be made of steel cords and/or cords formed from nylon fiber, polyester fiber, fiber glass, carbon fiber, aramid fiber, glass fiber, polyethylene fiber, polyethylene terephthalate fiber, or other reinforcement materials. Different reinforcement materials could be combined. It is worthwhile noting that a “cord” may include one or plural strands.", "", "FIG.3schematically depicts steps of the manufacturing process viewed from the side. The first layer26of rubber is deposited on the mold element28, between the pins30. The height of the pins30is greater than the thickness of the first layer26. In a subsequent step, the reinforcement cord32is provided.", "", "In a further step, as schematically depicted inFIG.4, a second layer34of uncured (e.g. green) rubber is deposited. The second layer34is deposited on the first layer26, also on the reinforcement cord32. The reinforcement cord32is thereby sandwiched between the first and second layers26,34. Here also, the second layer34is deposited between the pins30.", "", "The thickness of the first layer26may be the same as the thickness of the second layer34. In that case, the reinforcement cord32is located in a median surface of the web24. In another embodiment, the thickness of the first layer26may be the different than the thickness of the second layer34. In that case, the reinforcement cord32is located in an off-median inner surface of the web.", "", "FIG.5schematically depicts part of the manufacturing process viewed from the side. (as inFIG.3), wherein the second layer34of uncured (e.g. green) rubber has been deposited on the first layer26and the reinforcement cord32. In the depicted embodiment, the reinforcement cord32is located in a median surface of the web24. As also shown inFIG.5, the height of the pins30is at least higher than the thickness of the first and second layers26,34of rubber.", "", "As depicted inFIG.6, illustrating further steps of the manufacturing process, a further mold element36is provided opposite of the mold element28, in contact with the second layer34. The mold element36may be identical to the mold element28. Flanges20,22are also provided at each end of first and second layers26,34. Flanges20,22may be in contact with the pins30. Flanges20,22may comprise (or may be made of) uncured (e.g. green) rubber.", "", "Mold cap elements38,40are also provided on top of each of the flanges20,22and are also in (direct) contact with the mold elements28,36so as to seal the uncured rubber in the mold comprising the mold elements28,36and the mold cap elements38,40.", "", "The mold may then be heated to an elevated temperature sufficient to cure partially the rubber. When the rubber is partially cured, the mold is disassembled, and the spoke, comprising the merged first and second layers26,34, flanges20,22, in embodiments also the tubes31, and reinforcement cord32, is removed from it. The spoke is thus a monolith. Of course, when the mold is disassembled, the pins30are also removed, leaving holes39in the spoke. In other words, the pins30are placeholders so that the spoke comprises holes39where the pins were located. In embodiments, (at least some of) the holes39are through holes.", "", "The spoke may comprise an array of first holes at the radially outer end, with the first U-turns being centered on the first holes, and an array of second holes at the radially inner end, with the second U-turns being centered on the second holes.", "", "With reference toFIG.7, in a subsequent step, a plurality of spokes18are arranged in a circular pattern between the inner shearband16and the outer shearband14. In other embodiments, inner shearband16may be dispensed with (in that case, the spokes are arranged on the wheel hub) or be replaced by (reinforced) plastic. The spokes18are separated by one or more interstitial mold elements41,43, which may be of trapezoic form. The interstitial mold elements41,43may be the same or be different in shape. The interstitial mold elements41,43provide support for the spokes during curing and suppress, or at least mitigate, deformation of the spokes during curing. The shearbands14,16may comprise uncured rubber (e.g. green rubber) on the side intended to (directly) contact with the flanges20,22of the spokes18. The spokes and shearband are placed in a mold comprising inner mold element42and an outer mold element44. The mold elements42,44may be substantially in the form of a tube. The mold may be sealed e.g. by other mold elements (not depicted).", "", "In more details, the inner shearband16may be wrapped around the inner mold element42, the spokes18and interstitial mold elements41,43may then be placed. The outer shearband14may then be wrapped around the spokes18and covered by the outer mold element44.", "", "The mold may then be heated to an elevated temperature, sufficient to (fully) cure the rubber. It should be noted that, in case of green rubber, the combination of elevated temperatures and high pressure causes vulcanization of the rubber. When the rubber is cured, the mold is disassembled and the cured (monolithic) product, comprising the shearbands merged with the spokes, is removed from it.", "", "The annular tread12(seeFIG.1) for contacting ground may be provided on the outer shearband14.", "", "In embodiments (e.g. as depicted in the present document) the web of the spokes is planar, or at least essentially planar. In other embodiments, the web of the spokes is curved. In that case, the mold elements28,38and/or the mold elements41,43may be modified for providing the spokes with a web having curved outer surfaces. For examples, the web of the spokes may all be curved in the same angular direction about a tire axis.", "", "It will be appreciated that embodiments of the present inventions allow for a lightweight, high tensile, highly compressible and highly flexible connecting structures, in particular spokes, with a high yield point/domain.", "", "Variations in the present invention are possible in light of the description of it provided herein. While certain representative embodiments and details have been shown for the purpose of illustrating the subject invention, it will be apparent to those skilled in this art that various changes and modifications can be made therein without departing from the scope of the subject invention. It is, therefore, to be understood that changes can be made in the particular embodiments described which will be within the full intended scope of the invention as defined by the following appended claims."], "claims": ["a radially outer end for connecting the spoke to a shearband; a radially inner end for connecting the spoke to a hub; and a web extending between the radially inner end and the radially outer end, the web comprising therein reinforcement cord serpentining between the radially inner end and the radially outer end.", "2 . The spoke as claimed in claim 1 , wherein the serpentining reinforcement cord is embedded between a first and a second layer of rubber.", "3 . The spoke as claimed in claim 1 , wherein the serpentining reinforcement cord is located in a median surface of the web.", "4 . The spoke as claimed in claim 1 , wherein the serpentining reinforcement cord is located in an off-median inner surface of the web.", "5 . The spoke as claimed in claim 1 , wherein the serpentining reinforcement cord comprises first U-turns at the radially outer end and second U-turns at the radially inner end of the spoke.", "6 . The spoke as claimed in claim 5 , wherein the spoke comprises an array of first holes at the radially outer end, the first U-turns being centered on the first holes, and an array of second holes at the radially inner end, the second U-turns being centered on the second holes.", "7 . The spoke as claimed in claim 6 , wherein at least one of the first and second holes are through-holes extending through the spoke.", "8 . The spoke as claimed in claim 6 , wherein the spoke comprises a tube arranged between each U-turn and the corresponding hole.", "9 . The spoke as claimed in claim 1 , wherein the web is planar.", "10 . The spoke as claimed in claim 1 , wherein the web is curved.", "11 . The spoke as claimed in claim 1 , wherein the radially outer end comprises a flange for connecting the spoke to a shearband.", "12 . The spoke as claimed in claim 1 , wherein the radially inner end comprises a flange for connecting the spoke to a hub.", "an annular tread for contacting ground; a shearband supporting the tread; and a connecting structure for connecting the shearband to a wheel hub, the connecting structure comprising a plurality of a reinforced-rubber spokes, each spoke comprising: a radially outer end for connecting the spoke to the shearband; a radially inner end for connecting the spoke to the wheel hub; and a web extending between the radially inner end and the radially outer end, the web comprising reinforcement cord sandwiched between a first and a second layer of rubber, the reinforcement cord serpentining between the radially inner end and the radially outer end.", "14 . The non-pneumatic tire as claimed in claim 13 , wherein the first and second layers of rubber are symmetric, so that the serpentining reinforcement cord is located in a median surface of the web.", "15 . The non-pneumatic tire as claimed in claim 13 , wherein the first and second layers of rubber have different thickness, so that the serpentining reinforcement cord is located in an off-median surface of the web.", "16 . The non-pneumatic tire as claimed in claim 13 , wherein the serpentining reinforcement cord comprises U-turns at the radially outer end and oppositely oriented U-turns at the radially inner end of the spoke.", "17 . The non-pneumatic tire as claimed in claim 16 , wherein the spoke comprises an array of first holes at the radially outer end, the U-turns at the radially outer end being centered each on a respective one of the first holes, and an array of second holes at the radially inner end, the U-turns at the radially inner end being centered each on a respective one of the second holes.", "18 . The non-pneumatic tire as claimed in claim 17 , wherein the first holes or the second holes, or both, are through-holes extending through the spoke.", "19 . The non-pneumatic tire as claimed in claim 17 , wherein the spoke comprises a tube arranged between each U-turn and the respective hole.", "20 . The non-pneumatic tire as claimed in claim 13 , wherein the web of each spoke is essentially planar.", "21 . The non-pneumatic tire as claimed in claim 13 , wherein the webs of the spokes are curved.", "22 . The non-pneumatic tire as claimed in claim 21 , wherein the webs of the spokes are all curved in the same angular direction about a tire axis.", "23 . The non-pneumatic tire as claimed in claim 13 , wherein each of the radially outer ends of the spokes comprises a flange for connecting the spoke to the shearband.", "24 . The non-pneumatic tire as claimed in claim 13 , wherein each of the radially inner ends of the spokes comprises a flange for connecting the spoke to a hub."], "bibtex": "@patent{20240092123,\n    title = {REINFORCED-RUBBER SPOKE FOR A NON-PNEUMATIC TIRE},\n    number = {20240092123},\n    year = {2024},\n    note = {File: US20240092123A1-20240321.XML}\n    }", "classification": "B60C714FI"}, {"title": "MOTORCYCLE TIRE", "doc_number": "20240092124", "filename": "US20240092124A1-20240321.XML", "abstract": "Provided is a technology for inhibiting the occurrence of uneven wear at shoulder-side edges of blocks in a motorcycle tire having a block pattern. A motorcycle tire ( 100 ) includes plural blocks ( 11 ) and ( 12 ) that are arranged on a tread ground-contact surface. In a tire widthwise cross-section of a tread portion ( 1 ), when regions obtained by bisecting a tread half-width region measured along the tire surface from a tire equator CL to a tread ground-contact end TE are each defined as a tread center portion Tc and a tread shoulder portion Ts, a middle block ( 12 ) among the plural blocks, whose outer wall surface ( 12 A) on the tire width-direction outer side is positioned in the tread shoulder portion Ts, is configured such that an upper end portion is chamfered only for the outer wall surface ( 12 A) and a chamfered part ( 12 B) is thereby formed on the middle block ( 12 ).", "detailed_description": [""], "claims": ["wherein, in a tire widthwise cross-section of a tread portion, when regions obtained by bisecting a tread half-width region measured along the tire surface from a tire equator to a tread ground-contact end are each defined as a tread center portion and a tread shoulder portion, a middle block among the plural blocks, whose outer wall surface on the tire width-direction outer side is positioned in the tread shoulder portion, is configured such that an upper end portion is chamfered only for the outer wall surface and a chamfered part is thereby formed on the middle block.", "2 . The motorcycle tire according to claim 1 , wherein, when the height of the middle block and that of the chamfered part are defined as H1 and h1, respectively, the height h1 is ⅔ or less of the height H1.", "3 . The motorcycle tire according to claim 1 , wherein, among the plural blocks, center blocks positioned on the tire equator have a ratio Lc/Wg, which is a ratio between an average value Lc of the tire-circumferential-direction length measured on the tire equator and an average value Wg of the width of widthwise grooves separating the center blocks measured on the tire equator, of 550% or less.", "4 . The motorcycle tire according to claim 1 , wherein the middle block has a tire-circumferential-direction length Lm in a range of 26 mm to 41 mm.", "5 . The motorcycle tire according to claim 1 , wherein the middle block has a tire-width-direction length Wm in a range of 15 mm to 44 mm.", "6 . The motorcycle tire according to claim 1 , wherein the upper end portion of the outer wall surface of the middle block has a length L1 in a range of 10 mm to 80 mm.", "7 . The motorcycle tire according to claim 1 , wherein the chamfered part has a width w1 in a range of 3 to 20% of a maximum value Wm(max) of the tire-width-direction length of the middle block.", "8 . The motorcycle tire according to claim 1 , having a negative ratio of less than 70%.", "9 . The motorcycle tire according to claim 2 , wherein, among the plural blocks, center blocks positioned on the tire equator have a ratio Lc/Wg, which is a ratio between an average value Lc of the tire-circumferential-direction length measured on the tire equator and an average value Wg of the width of widthwise grooves separating the center blocks measured on the tire equator, of 550% or less.", "10 . The motorcycle tire according to claim 2 , wherein the middle block has a tire-circumferential-direction length Lm in a range of 26 mm to 41 mm.", "11 . The motorcycle tire according to claim 2 , wherein the middle block has a tire-width-direction length Wm in a range of 15 mm to 44 mm.", "12 . The motorcycle tire according to claim 2 , wherein the upper end portion of the outer wall surface of the middle block has a length L1 in a range of 10 mm to 80 mm.", "13 . The motorcycle tire according to claim 2 , wherein the chamfered part has a width w1 in a range of 3 to 20% of a maximum value Wm(max) of the tire-width-direction length of the middle block.", "14 . The motorcycle tire according to claim 2 , having a negative ratio of less than 70%.", "15 . The motorcycle tire according to claim 3 , wherein the middle block has a tire-circumferential-direction length Lm in a range of 26 mm to 41 mm.", "16 . The motorcycle tire according to claim 3 , wherein the middle block has a tire-width-direction length Wm in a range of 15 mm to 44 mm.", "17 . The motorcycle tire according to claim 3 , wherein the upper end portion of the outer wall surface of the middle block has a length L1 in a range of 10 mm to 80 mm.", "18 . The motorcycle tire according to claim 3 , wherein the chamfered part has a width w1 in a range of 3 to 20% of a maximum value Wm(max) of the tire-width-direction length of the middle block.", "19 . The motorcycle tire according to claim 3 , having a negative ratio of less than 70%.", "20 . The motorcycle tire according to claim 4 , wherein the middle block has a tire-width-direction length Wm in a range of 15 mm to 44 mm."], "bibtex": "@patent{20240092124,\n    title = {MOTORCYCLE TIRE},\n    number = {20240092124},\n    year = {2024},\n    note = {File: US20240092124A1-20240321.XML}\n    }", "classification": "B60C1103FI"}, {"title": "TIRE WITH VARIABLE NUMBER OF LATERAL BLOCKS PER PITCH", "doc_number": "20240092125", "filename": "US20240092125A1-20240321.XML", "abstract": "The present invention provides a tire for a vehicle comprising: a rotation axis, a midplane at a central position along the rotation axis; a circumferential tread portion around the rotation axis, the circumferential tread portion comprising: a tread pattern exhibiting at least a first pitch pattern and a second pitch pattern each comprising: a center block crossed by the midplane, and two side block alignments, said side block alignments being inclined with respect to one another and extending from the center block; the first pitch pattern including: a first pitch length, a first number of blocks; the second pitch pattern including: a second pitch length which is shorter than the first pitch length, and a third number of blocks which is greater than the first number of blocks.", "detailed_description": ["For the disclosure, the following definitions are given.", "", "The terms “comprising”, “comprises” and “comprised of” as used herein are synonymous with “including”, “includes” or “containing”, “contains”, and are inclusive or open-ended and do not exclude additional, non-recited members, elements or method steps. The terms “comprising”, “comprises” and “comprised of” also include the term “consisting of”.", "", "The recitation of numerical ranges by endpoints includes all integer numbers and, where appropriate, fractions subsumed within that range (e.g., 1 to 5 includes 1, 2, 3, 4 when referring to, for example, a number of elements, and can also include 1.5, 2, 2.75 and 3.80, when referring to, for example, measurements). The recitation of endpoints also includes the recited endpoint values themselves (e.g., from 1.0 to 5.0 includes both 1.0 and 5.0). Any numerical range recited herein is intended to include all sub-ranges subsumed therein.", "", "The reference throughout this specification to “one embodiment” or “an embodiment” means that a particular feature, structure or characteristic described in connection with the embodiment is included in at least one embodiment of the present invention. The particular features, structures, characteristics or embodiments may be combined in any suitable manner, as would be apparent to a person skilled in the art from this disclosure, in one or more embodiments. Furthermore, while some embodiments described herein include some but not other features included in other embodiments, combinations of features of different embodiments are meant to be within the scope of the invention and form different embodiments, as would be understood by those in the art.", "", "Unless otherwise defined, all terms used in disclosing the invention, including technical and scientific terms, have the meaning as commonly understood by one skilled in the art to which this invention belongs. By means of further guidance, definitions for the terms used in the description are included to better appreciate the teaching of the present invention.", "", "The following is an explanation of a pneumatic or non-pneumatic tire according to the invention.", "", "Reference is made toFIG.1provides a perspective view of a pneumatic tire according to the invention. The tire10is adapted for a passenger car. It could be used for a commercial vehicle. Tire10illustrated inFIG.1is a pneumatic tire and exhibits a radial carcass construction, but the invention is not limited to a pneumatic tire and the person skilled in the art will adapt the invention to a non-pneumatic tire without any difficulty. The tire10comprises a ground contacting tread portion11having a pair of lateral edges12and13which are each flanked by a shoulder region14. Each shoulder region14extends radially inwardly into a sidewall15, and each sidewall15terminates at its radially inner end in a bead portion16utilized for fitting the tire onto a wheel rim.", "", "The tire10further exhibits a rotation axis17through the tread portion11. The pneumatic tire10is balanced to rotate about the rotation axis17. The pneumatic tire10exhibits a midplane18. It may correspond to an Equatorial plane. The midplane18is perpendicular to the rotation axis17. The midplane18is in the middle between the lateral edges12and13. The midplane18is a geometric plane.", "", "The tread portion11is a circumferential tread portion19around the rotation axis17. The circumferential tread portion19comprises a plurality of pitch patterns. The pitch patterns comprise different lengths, notably different circumferential lengths. In the current illustration, the plurality of pitch patterns exhibits at least: a first pitch pattern20, a second pitch pattern22and a third pitch pattern24. In the current illustration, only four pitch patterns are represented. However, it is encompassed in the current invention to repeat the pitch patterns all around the tread portion11.", "", "As an option, the second pitch pattern22is repeated. Two second pitch patterns22are adjacent. They may form pitch clusters. As a further option, at least three second pitch patterns22are adjacent. The same may be applied to the first pitch pattern20and the third pitch pattern24. Several pitch clusters of identical pitch patterns are arranged along the circumference of the tread portion11. The clusters are distributed at irregular angular positions about the rotation axis17. This aspect reduces tire noise.", "", "As an option, the first pitch pattern20, the second pitch pattern22and the third pitch pattern24have different widths. This feature promotes a silicious ride since it has an impact on the noise frequency spectrum. The tire10comprises a shore harness ranging from 55 to 65; preferably from 57 to 63. The shore hardness may be measured in accordance with the norm ISO 7619-1:2010.", "", "FIG.2is a plan view of an angular segment of a circumferential tread portion19of a tire. The tire may correspond to the pneumatic tire described withFIG.1.", "", "The circumferential tread portion19forms a tread pattern. The tread pattern exhibits at least a first pitch pattern20and a second pitch pattern22. Optionally, the tread pattern further encloses a third pitch pattern24and a fourth pitch pattern (not illustrated). Each pitch pattern comprises a center block26crossed by the midplane18, and two side block alignments28. The side block alignments28are inclined with respect to one another and extend from the center block26. The side block alignments28are inclined with respect to the rotation axis17and the midplane18. Each side block alignment28comprises at least two aligned blocks adjacent to the corresponding center block26. The side block alignments28are inclined with respect to the rotation axis17of an angle ranging from 40° to 50°. In the present disclosure, the wording “block” is a synonym of “tread block”. The block is a protrusion providing a surface intender to engage the road.", "", "The first pitch pattern20includes a first pitch length L1 and a first number of blocks. In the current illustration, the first pitch pattern20comprises five blocks. More generally, the first number may range from three to ten. As an option, the blocks of the first pitch pattern20are identical; or at least of the same shape. They may be the first blocks.", "", "It is understood in the current invention that the expression “identical blocks” is not to be understood in a strict meaning. This expression also covers blocks with a size variation of at most 10% with respect to an average size of the corresponding pitch pattern.", "", "The second pitch pattern22comprises a second pitch length L2 which is shorter than the first pitch length L1. In addition, the second pitch pattern22comprises a second number of blocks which is greater than the first number of blocks. The second number may range from five to fifteen. The blocks of the second pitch pattern22may be second blocks32. The second block32may be identical, or similar. They may have the same shape; for instance, the shape of the first blocks30.", "", "The third pitch pattern24includes a center block26crossed by the midplane18; and two side block alignments28which are inclined with respect to one another and which extend from the center block. The third pitch pattern24further exhibits a third pitch length L3 which is shorter than the first pitch length L1. The third pitch length L3 may be closer to the second pitch length L2 than to the first pitch length L1.", "", "The features defined in connection with the lengths L1, L2 and L3 may apply to the widths of the blocks of the pitch patterns (20;22;24). The widths are measured along the rotation axis17.", "", "The blocks of the third pitch pattern24are third blocks34. The third blocks34may be similar or identical. The third blocks34may have the same shape. They may have the same shape as the first blocks30; but at another size. The third pitch pattern24includes a third number of blocks which is greater than the first number of blocks and/or the second number of blocks. The third number of blocks may be equal to the second number of blocks. The second number can be seven.", "", "The blocks may generally have quadrilateral shapes with the main axis parallel to the rotation axis17. This feature increases the stiffness of the blocks along the rotation axis17. It improves the stability of the tire.", "", "As an option, the first blocks30have a first square shape, with a diagonal parallel to the rotation axis17. The other diagonal is along the circumferential direction; thus, parallel to the midplane18. The second blocks32have a second square shape which is smaller than the first square shape. The second square shape includes parallel, yet smaller, sides and diagonals than the first square shape. Accordingly, the first pitch pattern20includes a first pitch width along the rotation axis17; and the second pitch pattern includes a second pitch width which is shorter than the first pitch width.", "", "As an option or an alternative, the first blocks30have a different shape than the second blocks32. The first blocks30the blocks of the first pitch pattern are arranged in a chevron pattern. For illustrative purposes, the first blocks may be circular or trapezoidal and the second blocks32are diamond-shaped. As a further option, the third blocs34are rectangles or triangles. Other combinations of shapes are encompassed by the present invention.", "", "One of the two side block alignments28of the first pitch pattern20is parallel to one of the two side block alignments26of the second pitch pattern22. More generally, the side block alignments28on the left side of the tire are parallel; and/or the side block alignments28on the right side of the tire are parallel. The left side and the right side correspond to the lateral edges13and12respectively.", "", "The first pitch pattern20and the second pitch pattern20are circumferentially separated by a first groove36. Another first groove may form a separation between the first pitch pattern20and the third pitch pattern24. The first groove36exhibits a first depth, preferably a first constant depth. The first groove36may exhibit a “V” shape; or a chevron shape. The first grooves36are distributed around the circumferential tread portion19. The first grooves36are adapted for evacuating water on the road when the associated vehicle is circulating in wet conditions. The first grooves36are also designated as pitch separating grooves, or inter pitch channels. The first grooves36form the pitch boundaries.", "", "Within the first pitch pattern20, the first blocks30are separated by second grooves38. The second grooves38are shorter than the first groove36. The first grooves36are wider and deeper than the second grooves38. The depths of the grooves are measured perpendicularly to the rotation axis17. The widths of the second grooves38are measured along the side block alignments28. The second grooves38show a second depth which is shallower than the first constant depth of the first groove36. The second grooves38may be block separating grooves. Due to the groove arrangement, the circumferential tread portion19comprises a net-to-gross ranging from 50% to 85%; preferably from 60% to 75%, more preferably from 64% to 72%.", "", "The first groove36comprises a first section36.1and a second section36.2which is inclined with respect to the first section36.1. The first section36.1and the second section36.2are inclined with respect to the rotation axis17, and symmetrical. A starting second groove38S, is aligned on the first section36.1. These groove sections are communicating. Then, it eases a fluid flow between the road and the circumferential tread portion19.", "", "Within the second pitch pattern22, the second blocks32are separated as well by second grooves38. They may also be separated by third grooves40. The second grooves are between the third grooves40. The second grooves38are wider than the third grooves40. This aspect eases the water evacuation from the axial center of the circumferential tread portion19.", "", "Generally, the tread pattern comprises a straight groove and a crenelled groove which comprise depth variations, which extend on a whole axial width of the tread pattern, and which are parallel. The crenelled groove extends from one lateral edge13to the opposite lateral edge12. The straight groove is formed where several second and third grooves are aligned on one of the first sections36.1or one of the second sections36.2. The crenelled groove is formed in one of the sections (36.1;36.2), several second grooves38and third grooves which are continuous but slightly offset. Then the tread pattern provides different offset blocks while allowing straight grooves to foster water discharge.", "", "The first pitch pattern20includes first edge bodies42with a first body length. The first body length may be measured along the side block alignments28. The first blocks30are arranged between the first edge bodies42. The second pitch pattern22includes second edge bodies44with a second body length which is shorter than the first body length. The second blocks32of the second pitch pattern are aligned in two branches between the second edge bodies44. The circumferential tread portion19may further comprise second edge bodies44at the ends of the third pitch pattern24. The combination of the first edge bodies42and the second edge bodies44may form two ribs.", "", "The two side block alignments28of the first pitch pattern20each comprise a first side width Sw1 which is measured along the rotation axis17. The two side block alignments28of the second pitch pattern22each comprise a second side width Sw2 which is longer than the first side width Sw1. This width difference reduces the tire noise.", "", "Each side block alignment28comprises an axially outboard block48. The tread pattern comprises at least one bridge50connecting one of the axially outboard blocks48of the first pitch pattern20to one of the axially outboard blocks48of the second pitch pattern22. This improves the stiffness of the circumferential tread portion19. The bridge50may be at one end of the associated first groove36, or across the first groove36. As an option, a bridge50connects one of the outboard blocks48to one of the first edge bodies42.", "", "The tread pattern comprises at least one block row52across the first pitch pattern20, at least one second pitch pattern22; and optionally one of the third pitch pattern24. The block row52encloses an alignment of first blocks30, at least one second block32; and optionally a third block. The block row52encloses the center block26and a one of the two side block alignments28of the first pitch pattern20, and a starting block32S of one of the two side block alignments28of the second pitch pattern, said starting block being off centered with respect to said side block alignment of said one of the two side block alignments of the first pitch pattern.", "", "The circumferential tread portion19provides a matrix of generally aligned blocks, wherein several second grooves and blocks are at irregular positions in the matrix due to different block sizes. The first groove, the second groove, and optionally the third groove, define a groove network adapted to the pitch size variation, resulting from circumferential lengths differences, and/or block number variations.", "", "FIG.3provides a through cut of the circumferential tread portion19along the blocks gathered in the block row52. The position of the rotation axis it provided for orientation purposes.", "", "The first pitch pattern20and the second pitch pattern22are circumferentially separated by the first groove36which includes a first width W1 and a firth depth Dl. Still, within the first pitch pattern22, the blocks are separated by second grooves38including a second width W2 which is narrower than the first width W1. The third width W3 of the third groove40may be narrower than the second width W1. However, they may be of the same depth.", "", "In the current illustration, the block row52is marked by a first edge body42and a second edge body44. The block row52crosses three first grooves36which separate two second pitch patterns22, and also delimit these second pitch patterns22from a first pitch pattern20and a third pitch pattern24. Two second grooves38and one third groove40are apparent. They form recesses between the blocks. The second grooves38and the third grooves40define channels between the first blocks30and the center block26. The center block26is adjacent to the starting block32S. The specific shape of the circumferential tread portion19provides different pitch tones instead of one. Then, the perceived tire noise is limited.", "", "FIG.4illustrates a new tread design incorporating square blocks which are keeping their shape independently from pitch size. To achieve this, instead of the traditional pitch scaling which would result in a composition of rectangular blocks, the amount of square blocks inside one pitch vary depending from the pitch size. A large pitch ratio would incorporate 5 square blocks laterally arranged in a V-Shape whereas a medium and small pitch ratio would incorporate 7 square blocks laterally arranged in a V-Shape. Other shapes could be used, such as rectangles or circles.", "", "FIG.5is the complete tread pattern ofFIG.4from 0 to 360 degrees that is projected on a flat surface.", "", "Variations in the present invention are possible in light of the description of it provided herein. While certain representative embodiments and details have been shown for the purpose of illustrating the subject invention, it will be apparent to those skilled in this art that various changes and modifications can be made therein without departing from the scope of the subject invention. It is, therefore, to be understood that changes can be made in the particular embodiments described which will be within the full intended scope of the invention as defined by the following appended claims."], "claims": ["a rotation axis, a midplane at a central position along the rotation axis; and a circumferential tread portion around the rotation axis, the circumferential tread portion comprising a tread pattern exhibiting at least a first pitch pattern and a second pitch pattern, each comprising: a center block crossed by the midplane, and two side block alignments which are inclined with respect to one another and extending from the center block; the first pitch pattern including a first pitch length and a first number of blocks; the second pitch pattern including a second pitch length which is shorter than the first pitch length, and a second number of blocks which is greater than the first number of blocks.", "2 . The tire of claim 1 , wherein the blocks have a square shape with a diagonal parallel to the rotation axis, the first pitch pattern includes a first pitch width; and the second pitch pattern includes a second pitch width which is shorter than the first pitch width.", "3 . The tire of claim 1 , wherein the blocks of the first pitch pattern are first identical blocks, and the blocks of the second pitch pattern are second identical blocks which have a different size than the first identical blocks, and the second identical blocks and the first identical blocks comprise a same geometrical shape.", "4 . The tire of claim 1 , wherein the first pitch pattern and the second pitch pattern are circumferentially separated by a first groove including a first constant depth, and within the first pitch pattern the blocks are separated by second grooves including a second depth which is shallower than the first constant depth.", "5 . The tire of claim 4 , wherein the first groove comprises a first section and a second section which is inclined with respect to the first section, at least one of the second grooves being aligned on the first section.", "6 . The tire of claim 1 , wherein the first pitch pattern and the second pitch pattern are circumferentially separated by a first groove including a first width, and within the first pitch pattern, the blocks are separated by second grooves including a second width which is narrower than the first width.", "7 . The tire of claim 1 , wherein the tread pattern comprises a block row across the first pitch pattern and the second pitch pattern, the block row enclosing the center block and one of the two side block alignments of the first pitch pattern, and a starting block of one of the two side block alignments of the second pitch pattern, said starting block being off-centered with respect to said side block alignment of said one of the two side block alignments of the first pitch pattern.", "8 . The tire of claim 1 , wherein the tread pattern comprises a third pitch pattern, said third pitch pattern including a center block crossed by the midplane, and two side block alignments which are inclined with respect to one another and extending from said center block; and a third pitch length which is shorter than the second pitch length, and a third number of blocks which is greater than the second number of blocks.", "a rotation axis, a midplane at a central position along the rotation axis; a circumferential tread portion around the rotation axis comprising a tread pattern exhibiting at least a first pitch pattern and a second pitch pattern; the first pitch pattern including a first group of identical blocks which comprise a first center block and two side block alignments which are inclined with respect to one another, and a first number of identical blocks; the second pitch pattern including a second group of identical blocks which comprise a second center block adjacent to the first center block, and two side block alignments which are inclined with respect to one another, and a second number of identical blocks which is greater than the first number.", "10 . The tire of claim 9 , wherein the first pitch pattern includes first edge bodies with a first body length, the blocks of the first pitch pattern being arranged between the first edge bodies; and the second pitch pattern includes second edge bodies with a second body length which is shorter than the first body length, the blocks of the second pitch pattern being arranged between the second edge bodies.", "11 . The tire of claim 9 , wherein the tread pattern comprises a straight groove and a crenelled groove which comprise depth variations, which extend on a whole axial width of the tread pattern, and which are parallel.", "12 . The tire of claim 9 , wherein the two side block alignments of the first pitch pattern each comprise a first side width, and the two side block alignments of the second pitch pattern each comprise a second side width which is longer than the first side width.", "13 . The tire of claim 9 , wherein each side block alignment comprises an axially outboard block, the tread pattern comprising a bridge connecting one of the axially outboard blocks of the first pitch pattern to one of the axially outboard blocks of the second pitch pattern.", "14 . The tire of claim 9 , wherein within the second pitch pattern the blocks are separated by second grooves and third grooves, the second grooves being between the third grooves and being wider than the third grooves.", "15 . The tire of claim 9 , wherein the blocks have a quadrilateral shape with a main axis parallel to the rotation axis.", "a tread pattern having a first pitch pattern and a second pitch pattern, the first pitch pattern including a first pitch length and a first number of first tread elements arranged in a V shaped pattern across the lateral width of the tread; the second pitch pattern having a second pitch length which is shorter than the first pitch length, and a second number of second tread elements, wherein the second number of second tread elements are arranged in a V shaped pattern across the lateral width of the tread.", "17 . The tire of claim 16 wherein the first and second tread elements have the same shape.", "18 . The tire of claim 16 , wherein the first and/or second tread elements are shaped as a square.", "19 . The tire of claim 16 , wherein the first and/or second number of tread elements are shaped as a rectangle.", "20 . The tire of claim 16 wherein a V shaped groove separates the first pitch pattern from the second pitch pattern.", "21 . The tire of claim 16 , wherein the first tread elements are larger than the second tread elements.", "22 . The tire of claim 16 , wherein the first pitch pattern has five tread elements, and the second pitch pattern has 7 tread elements."], "bibtex": "@patent{20240092125,\n    title = {TIRE WITH VARIABLE NUMBER OF LATERAL BLOCKS PER PITCH},\n    number = {20240092125},\n    year = {2024},\n    note = {File: US20240092125A1-20240321.XML}\n    }", "classification": "B60C1103FI"}, {"title": "Tire Tread for a Heavy Vehicle with Improve Resistance to Aggressive Effects", "doc_number": "20240092126", "filename": "US20240092126A1-20240321.XML", "abstract": "A tire tread ( 1 ) for a heavy-duty vehicle to improve resistance to attack by stones. The tread ( 1 ) in the new state having at least one complex cut ( 5 ) with, along a mean line (Lm), an alternation of external cavities ( 6 ), opening onto the tread surface ( 2 ), and internal cavities ( 7 ), not opening onto the tread surface ( 2 ), two consecutive cavities, respectively an external cavity ( 6 ) and an internal cavity ( 7 ), being connected to each other by a connecting channel ( 8 ) of non-zero length, the height (H 11 ) of each external cavity ( 6 ) being at least equal to half the height (H) of the complex cut ( 5 ), the height (H 3 ) of each connecting channel ( 8 ) being at most equal to one third of the height (H) of the complex cut ( 5 ).", "detailed_description": [""], "claims": ["the tread in the new state comprising at least one complex cut comprising, along a mean line (Lm), an alternation of external cavities, opening onto the tread surface, and internal cavities, not opening onto the tread surface, two consecutive cavities, respectively an external cavity and an internal cavity, being connected to each other by a connecting channel, each external cavity having, in a mean surface (Sm) containing the mean line (Lm) and a radial direction (ZZ′) perpendicular to the tread surface, a height (H each internal cavity having, in the mean surface (Sm), a height (H each connecting channel having, in the mean surface (Sm), a height (H each complex cut having, in the mean surface (Sm), a height (H), measured, in the radial direction (ZZ′), between the tread surface and the internal cavity bottom, the height (H wherein the height (H", "2 . The tread according to claim 1 , wherein the height (H 3 ) of each connecting channel is at least equal to one tenth of the height (H) of the complex cut.", "3 . The tread according to claim 1 , wherein the height (H 11 ) of each external cavity is at most equal to three quarters of the height (H) of the complex cut.", "4 . The tread according to claim 1 , wherein the length (L 3 ) of each connecting channel is at least equal to the height (H 3 ) of the connecting channel.", "5 . The tread according to claim 1 , wherein the height (H 22 ) of each internal cavity is at least equal to one third of the height (H) of the complex cut.", "6 . The tread according to claim 1 , wherein the height (H 22 ) of each internal cavity is at most equal to three quarters of the height (H) of the complex cut.", "7 . The tread according to claim 1 , wherein the ratio between the length (L 2 ) of the internal cavity and the length (L 1 ) of the external cavity is at least equal to 0.8.", "8 . The tread according to claim 1 , wherein the ratio between the length (L 2 ) of the internal cavity and the length (L 1 ) of the external cavity is at most equal to 1.5.", "9 . The tread according to claim 1 , wherein each internal cavity has an internal cavity top extended radially outwards by a sipe as far as the tread surface.", "10 . The tread according to claim 1 , wherein each external cavity has an external cavity bottom extended radially inwards by at least one sipe as far as, at most, a bottom surface passing through the internal cavity bottom.", "11 . The tread according to claim 1 , wherein the mean line (Lm) of at least one complex cut is substantially longitudinal, forming at any point an angle at most equal to 45°, with respect to a longitudinal direction (XX′) of the tread.", "12 . The tread according to claim 11 , having an axial width (W), wherein at least one complex cut having a substantially longitudinal mean line (Lm) is axially positioned in a median portion of the tread having an axial width (Wm) at most equal to two thirds of the axial width (W) of the tread, said median portion being centred on a median plane (XZ) passing through the middle of the tread surface and perpendicular to the tread surface.", "13 . A tire for a heavy-duty vehicle, comprising a tread according to claim 1 ."], "bibtex": "@patent{20240092126,\n    title = {Tire Tread for a Heavy Vehicle with Improve Resistance to Aggressive Effects},\n    number = {20240092126},\n    year = {2024},\n    note = {File: US20240092126A1-20240321.XML}\n    }", "classification": "B60C1112FI"}, {"title": "PROGRAMMING METHOD AND DEVICE BASED ON TIRE PRESSURE SENSING", "doc_number": "20240092127", "filename": "US20240092127A1-20240321.XML", "abstract": "The present application provides a programming method and a programming device based on tire pressure sensing, which is related to the technical field of pressure sensing. The programming method includes: transmitting a region identification including at least one of a country, a region and a customer to an intelligent terminal through near-field communication for requesting the intelligent terminal to automatically match a database with the region identification and return a manufacturer code corresponding to a preset vehicle model identification from the database; receiving the manufacturer code sent by the intelligent terminal through near-field communication; and programming the tire pressure sensing device based on the manufacturer code. The programming method avoids an operator frequently manually switching countries, regions and customers on the intelligent terminal to match with the database, and also avoids a situation that the tire pressure sensing device cannot work normally due to error of manual switching.", "detailed_description": ["In order to make the objectives, solutions and advantages of the embodiments of the present application clearer, the solutions of the embodiments of the present application are clearly and completely described in combination with the accompanying drawings of the embodiments of the present application. The embodiments described are a part of the embodiments of the present application, rather than all the embodiments. Based on the embodiments of the present application, all other embodiments obtained by those of ordinary skill in the art without creative efforts fall within the scope of protection of the present application.", "", "As shown inFIG.1, an embodiment of the present application provides a programming method based on tire pressure sensing, applied to a tire pressure sensing device, which includes the following steps.", "", "Step S101: a region identification including at least one of a country, a region and a customer is transmitted to an intelligent terminal through near-field communication for requesting the intelligent terminal to automatically match a database with the region identification and return a manufacturer code corresponding to a preset vehicle model identification from the database.", "", "Before a tire pressure sensing device is manufactured, information of a country, region or customization customer is written into a built-in memory of the tire pressure sensing device, for example: an identification ID of the country or region, an identification ID of different customers, where if it is a customization customer, a country or region where the customization customer belongs can be known through an identification ID of the customization customer. In an embodiment, after establishing a communication connection between the tire pressure sensing device and the intelligent terminal, the tire pressure sensing device automatically sends its built-in above-mentioned region identification to the intelligent terminal.", "", "Step S102: the manufacturer code sent by the intelligent terminal through near-field communication is received, where the manufacturer code is obtained from a database that matches with the country, region and customer.", "", "Step S103: the tire pressure sensing device is programmed based on the manufacturer code, that is, the manufacturer code is written into a memory of the tire pressure sensing device, so that a processor of the tire pressure sensing device can execute the manufacturer code.", "", "According to the programming method based on tire pressure sensing provided by the present application, by automatically transmitting a region identification including at least one of a country, a region and a customer to an intelligent terminal through near-field communication, the intelligent terminal automatically matches a corresponding database with the region identification to find a manufacturer code corresponding to a preset vehicle model identification from the database, and transmit the manufacturer code to the tire pressure sensing device through near-field communication. The tire pressure sensing device is programmed based on the manufacturer code, so that in practical applications, it can avoid an operator frequently manually switching countries, regions and customers on the intelligent terminal to match with the database, and further avoid a situation that the tire pressure sensing device cannot work normally due to error of manual switching. The region identification is transmitted to the intelligent terminal by near field communication (NFC), and the manufacturer code sent by the intelligent terminal is received by near field communication. That is, a communication connection between the intelligent terminal and the tire pressure sensing device is established through a NFC communication module. Compared with existing low frequency/radio frequency (LF/RF) communication, it may not only make the tire pressure sensing device automatically send the region identification including at least one of a country, a region and a customer when the tire pressure sensing device senses that the intelligent terminal is close, but also make the intelligent terminal only communicate with a close tire pressure sensing device due to a short transmission distance when the communication is performed, thus avoiding information interference.", "", "In practical applications, some customization customers want to customize a batch of tire pressure sensing devices for a certain vehicle model, or customize tire pressure sensing devices for a certain brand of vehicle. Due to intelligence of a vehicle machine system, different vehicle models of the same brand often use the same manufacturer code, so that a receiver used to display tire pressure and tire temperature in a vehicle can be used on different vehicle models. Therefore, this kind of customized tire pressure sensing devices in a factory is usually also built-in preset vehicle logo, preset vehicle logo can be the vehicle model itself. For example, only a tire pressure sensing device for a certain vehicle model is customized, and information of the vehicle model is built in the tire pressure sensing device. The preset vehicle model identification can also be a code value corresponding to the vehicle model, and a plurality of vehicle models can correspond to a code value, and a code value corresponds to a manufacturer code. For example, all vehicle models of a brand correspond to a code value, and then the code value can be preset to the tire pressure sensing device.", "", "Further, the method based on tire pressure sensing of the present application further includes: transmitting the preset vehicle model identification to the intelligent terminal through near-field communication for requesting the intelligent terminal to automatically match the preset vehicle model identification with the manufacturer code in the database and return the matched manufacturer code, thus, avoiding the steps of manual selection of vehicle models, further improving intelligence of tire pressure sensing device programming, and avoiding the problem of manual selection errors. In an embodiment, the preset vehicle model identification can be transmitted to the intelligent terminal together with the region identification, or can be transmitted to the intelligent terminal before or after the region identification.", "", "As shown inFIG.2, an embodiment of the present application provides a programming method based on tire pressure sensing, applied to an intelligent terminal, which includes the following steps.", "", "Step S201: region identification including at least one of a country, a region and a customer transmitted by tire pressure sensing device through near field communication is received. Before a tire pressure sensing device is manufactured, information of a country, region or customer is written into a built-in memory of the tire pressure sensing device, for example, an identification ID of the country or region, an identification ID of different customers, where if it is a customization customer, a country or region where the customization customer belongs can be known through an identification ID of the customization customer. In an embodiment, when the intelligent terminal is close to the tire pressure sensing device, a communication near-field connection is established, and the intelligent terminal receives the region identification automatically uploaded by the tire pressure sensing device.", "", "Step S202: a database is matched with the region identification. In an embodiment, an intelligent terminal can obtain databases corresponding to different countries or regions. For customization customers, a manufacturer code database corresponding to a customer alone can be used, or a manufacturer code database of customer's country or region can be also used. Each database stores different vehicle models and their corresponding manufacturer codes, and the intelligent terminal can also obtain a mapping table of different region identification and corresponding database names. After receiving the region identification, the mapping table is used to determine whether a current database is a database that matches with the received region identification. If so, step S203is performed directly; otherwise, a switch operation is performed, and then step S203is performed. The database and mapping table mentioned above can be stored inside the intelligent terminal, or can be obtained by the intelligent terminal from outside, such as cloud. The intelligent terminal can be a mobile phone, tablet computer or specific device.", "", "Step S203: a manufacturer code corresponding to a preset vehicle model identification is found in the database. In an embodiment, the manufacturer code corresponding to the preset vehicle model identification is found in a corresponding relationship table between the vehicle model and the manufacturer code in the database, where the relationship table may include corresponding relationship between the vehicle model and the manufacturer code, or corresponding relationship between the code value, which can represent the vehicle model, and the manufacturer code, or corresponding relationship between the vehicle model, the code value and the manufacturer code, which is not limited in the present embodiment.", "", "Step S204: the manufacturer code is sent to the tire pressure sensing device through near-field communication for requesting to program the tire pressure sensing device based on the manufacturer code.", "", "According to the programming method based on tire pressure sensing provided by the present application, by receiving a region identification including at least one of a country, a region and a customer automatically uploaded by a programming device based on tire pressure sensing through near-field communication, the intelligent terminal automatically matches a corresponding database with the region identification to find a manufacturer code corresponding to a preset vehicle model identification from the database, and transmit the manufacturer code to the tire pressure sensing device through near-field communication. Then the tire pressure sensing device is programmed based on the manufacturer code, so that in practical applications, it can avoid an operator frequently manually switching countries, regions or customers on the intelligent terminal to match with the database, and also avoid a situation that the tire pressure sensing device cannot work normally due to error of manual switching. A communication connection between the intelligent terminal and the tire pressure sensing device is established through a NFC communication module. Compared with the existing LF/RF (low frequency/radio frequency) communication, as along as the intelligent terminal is close to a programmed tire pressure sensing device, it can automatically obtain the region identification including at least one of a country, a region and a customer transmitted by the tire pressure sensing device. When the communication is performed, the intelligent terminal only communicates with a close tire pressure sensing device due to a short transmission distance, thus avoiding information interference.", "", "In this embodiment, the step S203includes: receiving a vehicle model selected by a user as the preset vehicle model identification, and the user selects a vehicle model through an intelligent terminal man-machine interface, for example, select the vehicle model from a drop-down list.", "", "According a preset vehicle model identification, the manufacturer code corresponding to the preset vehicle model identification is found in the database. Since the database already corresponds to the region identification including at least one of a country, a region and a customer, the found manufacturer code is suitable for the vehicle model sold to the country, region or customer.", "", "In order to adapt to operation habits of different users, it can also receive the vehicle model selected by the user as the preset vehicle model identification before receiving the region identification including at least one of a country, a region and a customer transmitted by the tire pressure sensing device. In an embodiment, the user first selects the vehicle model before approaching the intelligent terminal to the tire pressure sensing device. After receiving the region identification including at least one of a country, a region and a customer transmitted by the tire pressure sensing device through near-field communication, the subsequent steps S202to S204are automatically performed.", "", "In this embodiment, for the tire pressure sensing devices that are built in a preset vehicle model identification when leaving the factory, step S203includes: receiving the preset vehicle model identification transmitted by the tire pressure sensing device through near-field communication mode; and finding the manufacturer code corresponding to the preset vehicle model identification in the database based on the preset vehicle model identification. The manufacturer code corresponding to the preset vehicle model identification can be automatically matched, thereby eliminating the step of manually selecting the vehicle model. In practical application, it only requires the intelligent terminal close to the tire pressure sensing device, and the above steps S201to S204are automatically performed without manual intervention, which further improves the intelligence of the tire pressure sensing device programming, and also avoids the problem of manual selection error.", "", "The programming device based on tire pressure sensing provided by the present application is described below. The programming device based on tire pressure sensing described below and the programming method based on tire pressure sensing described above can be referred to each other.", "", "As shown inFIG.3, an embodiment of the present application provides a programming device based on tire pressure sensing, which includes:a region identification sending module301, used to transmit a region identification including at least one of a country, a region and a customer to an intelligent terminal through near-field communication for requesting the intelligent terminal to automatically match a database with the region identification, and return a manufacturer code corresponding to a preset vehicle model identification from the database;a manufacturer code receiving module302, used to receive the manufacturer code sent by the intelligent terminal through near-field communication; anda programming module303, used to program the tire pressure sensing device based on the manufacturer code.", "", "According to the programming device based on tire pressure sensing provided by the present embodiment, by automatically transmitting a region identification including at least one of a country, a region and a customer to an intelligent terminal through near-field communication, the intelligent terminal automatically matches a corresponding database with the region identification to find a manufacturer code corresponding to a preset vehicle model identification from the database, and transmit the manufacturer code to the tire pressure sensing device through near-field communication. The tire pressure sensing device is programmed based on the manufacturer code, so that in practical applications, it can avoid an operator frequently manually switching countries, regions or customers on the intelligent terminal to match with the database, and further avoid a situation that the tire pressure sensing device cannot work normally due to error of manual switching. The region identification is transmitted to the intelligent terminal by near field communication (NFC), and the manufacturer code sent by the intelligent terminal is received by near field communication. That is, a communication connection between the intelligent terminal and the tire pressure sensing device is established through a NFC communication module. Compared with existing low frequency/radio frequency (LF/RF) communication, it may not only make the tire pressure sensing device automatically send the region identification including at least one of a country, a region and a customer when the tire pressure sensing device senses that the intelligent terminal is close, but also make the intelligent terminal only communicates with a close tire pressure sensing device due to a short transmission distance when the communication is performed, thus avoiding information interference.", "", "In an embodiment, the programming device based on tire pressure sensing provided by the present embodiment further includes: vehicle model identification sending module, used to transmit the preset vehicle model identification to the intelligent terminal through near-field communication for requesting the intelligent terminal to automatically match the preset vehicle model identification with the manufacturer code in the database and return the matched manufacturer code.", "", "As shown inFIG.4, an embodiment of the present application provides a programming device based on tire pressure sensing, which includes:a region identification receiving module401, used to receive region identification including at least one of a country, a region and a customer transmitted by tire pressure sensing device through near field communication;a region identification matching module402, used to match a database with the region identification;a manufacturer code finding module403, used to find a manufacturer code corresponding to a preset vehicle model identification in the database; anda manufacturer code sending module404, used to send the manufacturer code to the tire pressure sensing device through near-field communication for requesting to program the tire pressure sensing device based on the manufacturer code.", "", "According to the programming device based on tire pressure sensing provided by the present embodiment, by receiving a region identification including at least one of a country, a region and a customer automatically uploaded by a programming device based on tire pressure sensing through near-field communication, the intelligent terminal automatically matches a corresponding database with the region identification to find a manufacturer code corresponding to a preset vehicle model identification from the database, and transmit the manufacturer code to the tire pressure sensing device through near-field communication. The tire pressure sensing device is programmed based on the manufacturer code, so that in practical applications, it can avoid an operator frequently manually switching countries, regions and customers on the intelligent terminal to match with the database, and further avoid a situation that the tire pressure sensing device cannot work normally due to error of manual switching. A communication connection between the intelligent terminal and the tire pressure sensing device is established through a NFC communication module. Compared with the existing LF/RF (low frequency/radio frequency) communication, as long as the intelligent terminal is close to a programmed tire pressure sensing device, it can automatically obtain the region identification including at least one of a country, a region and a customer transmitted by the tire pressure sensing device. When the communication is performed, the intelligent terminal only communicates with a close tire pressure sensing device due to a short transmission distance, thus avoiding information interference.", "", "In an embodiment, the manufacturer code finding module403includes:a vehicle model identification receiving module, used to receive a vehicle model selected by a user as the preset vehicle model identification, or receive the preset vehicle model identification transmitted by the tire pressure sensing device through near-field communication mode; anda finding module, used to find the manufacturer code corresponding to the preset vehicle model identification in the database based on the preset vehicle model identification.", "", "FIG.5illustrates a structural diagram of an electronic device provided by the present application. The electronic device can include: a processor501, a communication interface502, a memory503and a communication bus504. The processor501, the communication interface502and the memory503communicate with each other through the communication bus504.", "", "In an electronic device, such as a tire pressure sensing, the processor501may invoke the logic instruction which is stored in the memory503to perform the programming method based on tire pressure sensing and applied to the programming device based on tire pressure sensing. The programming method includes:transmitting a region identification including at least one of a country, a region and a customer to an intelligent terminal through near-field communication for requesting the intelligent terminal to automatically match a database with the region identification and return a manufacturer code corresponding to a preset vehicle model identification from the database;receiving the manufacturer code sent by the intelligent terminal through near-field communication; andprogramming the tire pressure sensing device based on the manufacturer code.", "", "In another electronic device, such an intelligent terminal, the processor501may invoke the logic instruction which is stored in the memory503to perform the programming method based on tire pressure sensing and applied to the intelligent terminal. The programming method includes:receiving region identification including at least one of a country, a region and a customer transmitted by tire pressure sensing device through near field communication;matching a database with the region identification;finding a manufacturer code corresponding to a preset vehicle model identification in the database; andsending the manufacturer code to the tire pressure sensing device through near-field communication for requesting to program the tire pressure sensing device based on the manufacturer code.", "", "In addition, the logic instructions in the memory503may be implemented in the form of software functional units and may be stored in a computer readable storage medium when being sold or used as independent product. Based on such understandings, the technical solutions of the present application or the part that contributes to the prior art or the part of the technical solutions can be embodied in the form of a software product in essence. The computer software product is stored in a storage medium, including a number of instructions to enable a computer device (such as personal computer, server, or network device, etc.) to perform all or a part of the steps of the methods described in each embodiment of the application. The aforementioned storage media includes: USB flash disk, mobile hard disk, Read-Only Memory (ROM), Random Access Memory (RAM), magnetic disk, compact disk and other media that can store program codes.", "", "On the other hand, the embodiments of the present application also provide a computer program product. The computer program product includes a computer program that is stored in a non-transient computer readable storage medium. When the computer program is executed by the processor, the computer can perform the programming method based on tire pressure sensing and applied to the tire pressure sensing device. The programming method includes:transmitting a region identification including at least one of a country, a region and a customer to an intelligent terminal through near-field communication for requesting the intelligent terminal to automatically match a database with the region identification and return a manufacturer code corresponding to a preset vehicle model identification from the database;receiving the manufacturer code sent by the intelligent terminal through near-field communication; andprogramming the tire pressure sensing device based on the manufacturer code.", "", "Alternatively, the computer may perform the programming method based on tire pressure sensing and applied to the intelligent terminal. The programming method includes:receiving region identification including at least one of a country, a region and a customer transmitted by tire pressure sensing device through near field communication;matching a database with the region identification;finding a manufacturer code corresponding to a preset vehicle model identification in the database; andsending the manufacturer code to the tire pressure sensing device through near-field communication for requesting to program the tire pressure sensing device based on the manufacturer code.", "", "On the other hand, the embodiments of the present application also provide a non-transient computer readable storage medium storing a computer program, the computer program is executed by a processor to implement steps of the programming method based on tire pressure sensing and applied to the tire pressure sensing device. The programming method includes:transmitting a region identification including at least one of a country, a region and a customer to an intelligent terminal through near-field communication for requesting the intelligent terminal to automatically match a database with the region identification and return a manufacturer code corresponding to a preset vehicle model identification from the database;receiving the manufacturer code sent by the intelligent terminal through near-field communication; andprogramming the tire pressure sensing device based on the manufacturer code.", "", "Alternatively, the computer can perform the programming method based on tire pressure sensing and applied to the intelligent terminal. The programming method includes:receiving region identification including at least one of a country, a region and a customer transmitted by tire pressure sensing device through near field communication;matching a database with the region identification;finding a manufacturer code corresponding to a preset vehicle model identification in the database; andsending the manufacturer code to the tire pressure sensing device through near-field communication for requesting to program the tire pressure sensing device based on the manufacturer code.", "", "The device embodiments described above are only illustrative, in which the unit described as a separation component may be or may not be physically separated, and the component displayed as a unit may be or may not be a physical unit. That is, it may be located in a network unit or may be distributed to multiple network units. Some or all of the modules may be selected according to the actual requirements to achieve the purpose of the scheme of the embodiments. Those of ordinary skill in the art may understand and implement the embodiments without creative efforts.", "", "Through the description of the above embodiment methods, those of ordinary skill in the art may clearly understand that each embodiment may be realized by software and the necessary general hardware platform, and of course, it can also be realized by hardware. Based on such understandings, the above-mentioned solution can be embodied in the form of a software product in essence or the part that makes contribution to the prior art. The computer software product can be stored in a computer readable storage medium, such as a ROM/RAM, a disk, an optical disk, and the like, including a number of instructions to enable a computer device (which can be a personal computer, a server, or network equipment) to perform the methods described in each embodiment or some parts of the embodiments.", "", "Finally, it should be noted that the above embodiments are only used to illustrate the solutions of the present application, rather than limiting the solutions. Although the present application is described in detail with reference to the above embodiments, those of ordinary skill in the art should understand that they can still modify the solutions recorded in the above embodiments, or make equivalent replacements to some of the features; these modifications or replacements do not make the essence of the corresponding solutions depart from the scope of the solutions of various embodiments of the present application."], "claims": ["transmitting a region identification to an intelligent terminal through near-field communication for requesting the intelligent terminal to automatically match a database with the region identification and return a manufacturer code corresponding to a preset vehicle model identification from the database, wherein the region identification comprises at least one of a country, a region or a customer; receiving the manufacturer code sent by the intelligent terminal through near-field communication; and programming the tire pressure sensing device based on the manufacturer code.", "transmitting the preset vehicle model identification to the intelligent terminal through near-field communication for requesting the intelligent terminal to automatically match the preset vehicle model identification with the manufacturer code in the database and return the matched manufacturer code.", "receiving a region identification transmitted by tire pressure sensing device through near-field communication, wherein the region identification comprises at least one of a country, a region or a customer; matching a database with the region identification; finding a manufacturer code corresponding to a preset vehicle model identification in the database; and sending the manufacturer code to the tire pressure sensing device through near-field communication for requesting to program the tire pressure sensing device based on the manufacturer code.", "receiving a vehicle model selected by a user as the preset vehicle model identification, or receiving the preset vehicle model identification transmitted by the tire pressure sensing device through near-field communication mode; and finding the manufacturer code corresponding to the preset vehicle model identification in the database based on the preset vehicle model identification.", "5 . The programming method based on tire pressure sensing according to claim 3 , before the receiving region identification transmitted by tire pressure sensing device through near field communication, further comprising: receiving a vehicle model selected by a user as a preset vehicle model identification.", "6 - 9 . (canceled)", "a processor; and a memory storing a computer program that is executable by the processor, wherein the computer program, when executed by the processor, causes the electronic device to perform the programming method based on tire pressure sensing and applied to a tire pressure sensing device according to", "11 . A non-transient computer readable storage medium having computer program stored therein, wherein the computer program, when executed by the processor, causes a processor to perform the programming method based on tire pressure sensing and applied to a tire pressure sensing device according to claim 1 .", "12 - 19 . (canceled)"], "bibtex": "@patent{20240092127,\n    title = {PROGRAMMING METHOD AND DEVICE BASED ON TIRE PRESSURE SENSING},\n    number = {20240092127},\n    year = {2024},\n    note = {File: US20240092127A1-20240321.XML}\n    }", "classification": "B60C2304FI"}, {"title": "ARTICULATING TIRE VALVE STEM INSTALL-REMOVAL TOOL AND RELATED METHODS", "doc_number": "20240092128", "filename": "US20240092128A1-20240321.XML", "abstract": "An articulating tire valve install-removal tool and related methods for use. The articulating tire valve install-removal tool has a body comprising an outer perimeter, an inner recess, a threaded member, a linkage, and a contact member. The articulating tire valve install-removal tool components are connected to each other and secured within the body so one or more components can rotate around one or more axes. Together these components facilitate in the valve being installed and removed perpendicular or generally perpendicular to the valve hole on the wheel. The articulating tire valve stem tool includes a linkage assembly that is attached to the body to facilitate in ensuring the valve is installed and removed with the valve perpendicular to the valve hole in the wheel rim. The articulating tire valve stem tool includes a contact member that includes a feature that prevents slipping on the rim during use in addition to acting as a fulcrum to increase mechanical advantage during the use of the articulating tire valve install-removal tool. The articulating tire valve stem install-removal tool includes a contact member that has a feature that inhibits or prevents damage or slipping on the wheel during use in addition to acting as a fulcrum to increase mechanical advantage during the use of the articulating tire valve install-removal tool. The contact member also includes a feature to lock the threaded member parallel or generally parallel to the body which allows for the device to attach to the valve quickly. The body of the articulating tire valve stem tool reduces deflection, increases ergonomics, and is more durable due to the design.", "detailed_description": ["A more complete understanding of the articles/devices, processes and components disclosed herein can be obtained by reference to the accompanying drawings. These figures are merely schematic representations based on convenience and the ease of demonstrating the present disclosure, and are, therefore, not intended to indicate relative size and dimensions of the devices or components thereof and/or to define or limit the scope of the exemplary embodiments.", "", "Although specific terms are used in the following description for the sake of clarity, these terms are intended to refer only to the particular structure of the embodiments selected for illustration in the drawings and are not intended to define or limit the scope of the disclosure. In the drawings and the following description below, it is to be understood that like numeric designations refer to components of like function.", "", "The singular forms “a,” “an,” and “the” include plural referents unless the context clearly dictates otherwise.", "", "As used in the specification and in the claims, the term “comprising” may include the embodiments “consisting of” and “consisting essentially of.” The terms “comprise(s),” “include(s),” “having,” “has,” “can,” “contain(s),” and variants thereof, as used herein, are intended to be open-ended transitional phrases, terms, or words that require the presence of the named ingredients/steps and permit the presence of other ingredients/steps. However, such description should be construed as also describing compositions or processes as “consisting of” and “consisting essentially of” the enumerated ingredients/steps, which allows the presence of only the named ingredients/steps, along with any unavoidable impurities that might result therefrom, and excludes other ingredients/steps.", "", "Numerical values in the specification and claims of this application should be understood to include numerical values which are the same when reduced to the same number of significant figures and numerical values which differ from the stated value by less than the experimental error of conventional measurement technique of the type described in the present application to determine the value.", "", "All ranges disclosed herein are inclusive of the recited endpoint and independently combinable (for example, the range of “from 2 grams to 10 grams” is inclusive of the endpoints, 2 grams and 10 grams, and all the intermediate values).", "", "The terms “about” and “approximately” can be used to include any numerical value that can vary without changing the basic function of that value. When used with a range, “about” and “approximately” also disclose the range defined by the absolute values of the two endpoints, e.g., “about 2 to about 4” also discloses the range “from 2 to 4.” Generally, the terms “about” and “approximately” may refer to plus or minus 10% of the indicated number.", "", "Percentages of elements should be assumed to be percent by weight of the stated element, unless expressly stated otherwise.", "", "Although the operations of exemplary embodiments of the disclosed method may be described in a particular, sequential order for convenient presentation, it should be understood that disclosed embodiments can encompass an order of operations other than the particular, sequential order disclosed. For example, operations described sequentially may in some cases be rearranged or performed concurrently. Further, descriptions and disclosures provided in association with one particular embodiment are not limited to that embodiment, and may be applied to any embodiment disclosed.", "", "For the sake of simplicity, the attached figures may not show the various ways (readily discernable, based on this disclosure, by one of ordinary skill in the art) in which the disclosed system, method and apparatus can be used in combination with other systems, methods and apparatuses. Additionally, the description sometimes uses terms such as “produce” and “provide” to describe the disclosed method. These terms are abstractions of the actual operations that can be performed. The actual operations that correspond to these terms can vary depending on the particular implementation and are, based on this disclosure, readily discernible by one of ordinary skill in the art.", "", "Referring now toFIG.1, there is illustrated a standard wheel rim100and an isometric view of a prior art valve install-removal tool101that is connected to a valve102used to remove the tire valve102from the wheel rim100. As illustrated inFIG.1, a downward force103is applied at or near the end portion of the handle of valve install-removal tool101to create a fulcrum force such that a portion of the handle of valve install-removal tool101pivots on the edge of the wheel rim to cause a lifting force on the tire valve that is non-perpendicular to the longitudinal axis of the valve hole longitudinal axis VHA of a valve hole VH so as to remove tire valve102from wheel rim100. Such non-perpendicular force to the tire valve102during removal can result in damage to the wheel rim, damage to the tire valve102and/or damage to the valve install-removal tool101.", "", "Referring now toFIG.2a, there is illustrated a front view of one non-limiting type of prior art TPMS valve102where the stem202(e.g., brass stem, etc.) is over-molded by rubber jacket or coating200(or some other polymeric material), and wherein the rubber jacket or coating forms a sealing area201and seat area203on an outer surface of rubber jacket or coating200.", "", "Referring now toFIG.2b, there is illustrated a cross-sectional view of one non-limiting type of prior art TPMS valve102ofFIG.2a. As illustrated inFIG.2b, TPMS valve102includes a valve core chamber206where pressurized fluid is received to inflate the tire (not shown) that is connected to wheel rim100. Stem202extends through the valve body shown by204and the end portion of stem202includes a TPMS sensor. As can be appreciated, TPMS valve102can have other configurations and/or structures.", "", "Referring now toFIG.2c, there is illustrated a cross-sectional front view of one non-limiting type of prior art non-TPMS valve stem208(e.g., brass stem, etc.). As illustrated inFIG.2c, the base portion207of non-TPMS valve stem202does not extend below sealing area201and seating area203; however, it will be appreciated that non-TPMS valve208stem can have other configurations.", "", "Referring now toFIG.3a, there is illustrated a cross-sectional front view of a prior art valve install-removal tool300connected to a tire valve304(e.g., TPMS valve, non-TPMS valve, etc.) that is installed on a wheel rim310. Valve install-removal tool300has a handle301, and a threaded member303to connect to valve304. The front portion of handle301includes an articulation point305that connects handle301to the threaded member. A front region of handle302is located on an edge of wheel rim310and functions as a fulcrum point to facilitate in the removal of valve304from the wheel rim.", "", "Referring now toFIG.3b, there is illustrated a detailed cross-sectional front view of valve install-removal tool300connected to a TPMS valve304that is being inserted into/removed from valve hole VH of wheel rim310. The mouth306of TPMS valve304is illustrated as being threaded onto threaded member303of valve install-removal tool300. TPMS valve304has a compressed rubber outer jacket or coating to provide a seal307to wheel rim310.", "", "Referring now toFIG.3c, there is illustrated a detailed cross-sectional front view of valve install-removal tool300that is connected to a TPMS valve being removed from valve hole VH of wheel rim310. During the removal process, stem312of tire valve304is caused to rotate from the upward non-perpendicular force being applied to tire valve304as a downward force309is applied to handle301of valve install-removal tool300. Such rotation of tire valve304can result during either the insertion or removal of tire valve304from wheel rim310. The rotation of tire valve304can result in wheel rim310pinching and/or damage to the rubber outer jacket or coating311on stem312, thereby potentially resulting in an air leak and/or reduced life to tire valve304. Downward force309can also result in damage to wheel rim310(e.g., denting, scratching, etc.), and/or damage to one or more components of valve install-removal tool300(e.g., bent handle, broken or damaged articulation point305, stripping of threads on threaded member303, etc.).", "", "Referring now toFIG.3d, there is illustrated a detailed cross-sectional front view of a valve install-removal tool300connected to a NON-TPMS valve304that is being removed from valve hole VH of wheel rim310. The components of valve install-removal tool300and wheel rim are generally the same as illustrated inFIG.3c. Likewise, the structures of tire valve304illustrated inFIGS.3cand3dare generally the same except for the absence of the sensor in the tire valve ofFIG.3d. Furthermore, the problems associated with the removal/insertion of tire valve304from/into valve hole VH of wheel rim310are similar to the problems discussed above with respect toFIG.3c.", "", "Referring now toFIGS.4a-5c, there is illustrated the articulating tire valve install-removal tool objective in accordance with the present disclosure and a method for using the articulating tire valve install-removal tool objective that overcomes the above discussed problems associated with the use of prior art valve install-removal tools.", "", "Referring now toFIGS.4a-4e, there is illustrated one non-limiting embodiment of the articulating tire valve install-removal tool objective in accordance with the present disclosure. Articulating tire valve install-removal tool400includes a body418, threaded member402, a contact member401, a linkage403, and a handle413. Threaded member402, a contact member401, and linkage403are all movable connected to body418. The handle is non-movable connected to body418.", "", "Articulating tire valve install-removal tool400is configured to enable tire valves102to be installed and/or removed parallel or nearly parallel (e.g., 0.001-10° to an axis parallel to the VHA and all values and ranges therebetween) to a valve hole longitudinal axis VHA of a valve hole VH on a wheel rim100. In this way, the force to install and/or remove tire valve102to/from valve hole VH on wheel rim100is reduced. Advantageously, potential damage to wheel rim100and tire valve102are reduced when the force applied to tire valve102during installation and/or removal is parallel or nearly parallel to valve hole longitudinal axis VHA of a valve hole VH. The configuration of articulating tire valve install-removal tool400to enable tire valve102to be installed and/or removed is parallel or nearly parallel to valve hole longitudinal axis VHA of a valve hole VH has several benefits and advantages over prior art valve removal devices as illustrated inFIGS.3a-3dsuch as a) increasing the life of articulating valve install-removal tool400, b) reducing incidence of damage to tire valve102, c) reducing incidence of damage to wheel rim100, and/or d) reducing the force required by the user to install and/or remove tire valve102. Some of the non-limiting features of articulating tire valve install-removal tool400include a) a fulcrum point501on articulating tire valve install-removal tool400gives the user a better mechanical advantage when installing and removing tire valves, b) articulating tire valve install-removal tool400has a non-damaging contact point for engagement with wheel rim100that reduces or eliminates damage to the wheel rim, c) a locking feature406on articulating tire valve install-removal tool400that keeps articulating tire valve install-removal tool400secured to the wheel rim during use, d) a detent incorporated into the linkage403of the articulating tire valve install-removal tool400that allows articulating tire valve install-removal tool400to lock in a parallel direction when it is screwed/fastened to the valve, e) the body of articulating tire valve install-removal tool400is thicker, thus articulating tire valve install-removal tool400is more durable and ergonomic, and f) the design of articulating tire valve install-removal tool400reduces the force required to install and remove valves on/from the wheel rim which benefits the user.", "", "Articulating tire valve install-removal tool400can be partially or fully constructed from any desired rigid or semi-rigid material such as, but not limited to, metal (e.g., iron, steel, stainless steel, aluminum, aluminum alloy, copper, copper alloy, etc.), polymeric material, composite material, wood, and combinations thereof.", "", "Referring now toFIG.4a, there is illustrated an isometric view of articulating tire valve install-removal tool400. Articulating tire valve install-removal tool400includes a body418, an articulating rim contact member401, a handle413, and a rotating threaded member402, wherein rotating threaded member402is configured to connect to valve stem202of a tire valve102.", "", "Referring now toFIG.4b, a cross-sectional front view of articulating tire valve install-removal tool400is illustrated. Rotating threaded member402includes threads404that are configured to threadedly engage a threaded top region of tire valve102.", "", "Body418is illustrated as including a slot region419that is located between two side arms420,421of body418. A portion of articulating rim contact member401and rotating threaded member402are rotatably positioned in the slot region419. The longitudinal length of the slot region is illustrated as being at least 50% (e.g., 50-95% and all values and ranges therebetween) of a total longitudinal length of body418. The width of slot region419is illustrated as being constant along 50-100% (and all values and ranges therebetween) of the longitudinal length of slot region419. The maximum width of the slot region is at least 40% (e.g., 40-95% and all values and ranges therebetween) of a minimum width of body418.", "", "Rotating threaded member402is pivotally connected to a front portion of body418at pivot connection414(e.g., pin connection, etc.). Rotating threaded member402is also hingedly connected to a first end of a connecting linkage403at hinge point415. The second end of connecting linkage402is hingedly connected to a top portion of articulating rim contact member401at hinge point416. Articulating rim contact member401is also pivotally connected to body418at pivot connection405(e.g., pin connection, etc.). Pivot connection405is positioned rearwardly on body418from pivot connection414. Also, articulating rim contact member401is positioned rearwardly on body418from rotating threaded member402. The interconnection between rotating threaded member402, connecting linkage403, and articulating rim contact member401results in interactive movement between rotating threaded member402and articulating rim contact member401during the operation of articulating tire valve install-removal tool400as will be discussed in further detail below. Handle413is rigidly connected to the rear of body418. The longitudinal length of handle413is illustrated as being greater than a longitudinal length of body418. Handle413can be connected to body418by any type of means (e.g., slot connection, adhesive connection, pin connection, screw, and/or nail connection, clamp connection, etc.). During operation of articulating tire valve install-removal tool400, the front portion of rotating threaded member402extends outwardly from the419during 70-100% (and all values and ranges therebetween) of the tire valve removal process. Also, the top portion and bottom portion of articulating rim contact member401both extend outwardly from body419during 70-100% (and all values and ranges therebetween) of the tire valve removal process.", "", "The base of articulating rim contact member401includes one or more locking points406that are configured to releasably engage a portion of wheel rim100during use of articulating tire valve install-removal tool400. The shape of each locking point406is non-limiting. As illustrated inFIG.4b, the base of articulating rim contact member401includes two locking points406that have a step-like configuration, wherein each locking point406includes a flat base portion and a flat back portion that extends downwardly from the base portion and is angled about 80-100° (and all values and ranges therebetween) relative to the flat base portion. As can be appreciated, one or more of locking points406could have a notch configuration, a rib configuration, etc. Locking points406are used to limit movement of the base (e.g., forward movement of the base, etc.) of articulating rim contact member401relative to the wheel rim as handle413is forced downwardly during a tire valve removal process that will be discussed in more detail below.", "", "Referring now toFIGS.4c-4e, there is illustrated a cross-sectional front view of articulating tire valve install-removal tool400at different positions during the operation of removing a tire valve from a wheel rim. In each of these figures, the wheel rim and tire valve are not shown. Base line408is a representation of a plane of the top surface of the wheel rim adjacent to the tire valve that is perpendicular to the central longitudinal axis of a tire valve when the tire valve is fully inserted in the wheel rim. As will be described in more detail, articulating tire valve install-removal tool400is configured to enable the central longitudinal axis of rotating threaded member402to remain parallel or nearly parallel (e.g., ±10° to parallel and all values and ranges therebetween) to the central longitudinal axis of the tire valve during the complete operation of near complete operation (e.g., 70-99.999% of complete operation of removal and all values and ranges therebetween) of removing the tire valve from the wheel rim. As discussed above, the ability of articulating tire valve install-removal tool400to enable the central longitudinal axis of rotating threaded member402to remain parallel or nearly parallel to the central longitudinal axis of the tire valve during the complete operation of near complete operation of removing the tire valve from the wheel rim results in one or more or all of a) increasing the life of articulating tire valve install-removal tool400, b) reducing incidence of damage to tire valve102, c) reducing incidence of damage to wheel rim100, d) reducing the force required by the user to install and/or remove tire valve102, e) provides the user a better mechanical advantage when installing and removing the tire valves, and/or f) reduces the force required to install and remove valves on/from the wheel rim.", "", "FIG.4cillustrates the position of articulating tire valve install-removal tool400prior to the pulling of the tire valve from the wheel rim. The central longitudinal axis of rotating threaded member402is generally perpendicular to base line408. At this position of articulating tire valve install-removal tool400, rotating threaded member402can be threadedly connected to the top portion of the tire valve.", "", "FIG.4dillustrates a cross-sectional front view of articulating tire valve install-removal tool400wherein the tire valve has been partially (e.g., 10-70% and all values and ranges therebetween) removed from the wheel rim. As the handle413is pushed down by a user a handle distance410, the interconnection between threaded member402, connecting linkage403, and articulating rim contact member401results in the upward movement of rotating threaded member402as represented by move distance409. Generally, handle distance410is greater than move distance409during the tire valve removal process. As illustrated inFIG.4d, the bottom portion of articulating rim contact member401moves toward the central longitudinal axis of rotating threaded member402as the handle is moved downwardly during the tire valve removal proves as illustrated inFIGS.4c-4e. The central longitudinal axis of rotating threaded member402remains generally perpendicular to base line408.", "", "FIG.4eillustrates a cross-sectional front view of articulating tire valve install-removal tool400wherein the tire valve has been fully removed from the wheel rim. As handle413is pushed down by a user a handle distance412, the interconnection between rotating threaded member402, connecting linkage403, and articulating rim contact member401results in the upward movement of rotating threaded member402as represented by move distance411. Handle distance412is greater than move distance411. As illustrated inFIG.4e, the distance between the bottom portion of articulating rim contact member401and the central longitudinal axis of rotating threaded member402decreases as handle413is moved downwardly during the tire valve removal process. The central longitudinal axis of rotating threaded member402remains generally perpendicular to base line408. During operation of articulating tire valve install-removal tool400, the bottom portion of articulating rim contact member401remains in a generally fixed position relative to wheel rim100due to locking feature406on the bottom portion of articulating rim contact member401. As illustrated inFIGS.4c-4e, the bottom portion of articulating rim contact member401pivots on wheel rim100during the tire valve removal process.", "", "As illustrated inFIGS.4c-4e, the pivot connection414and hinge connection415move upwardly relative to pivot connection405as handle413is moved downwardly. As illustrated inFIG.4c, both pivot connection414and hinge connection415are positioned below pivot connection405at the beginning of the tire valve removal process, and both pivot connection414and hinge connection415are positioned above pivot connection405at the completion of the tire valve removal process.", "", "Referring now toFIGS.5a-5c, there is illustrated a cross-sectional front view of articulating tire valve install-removal tool400at the beginning position during the operation of removing a tire valve from a wheel rim. In each of these figures, the wheel rim and tire valve are shown with respect to articulating tire valve install-removal tool400.", "", "Referring now toFIG.5a, there is illustrated a cross-sectional front view of articulating tire valve install-removal tool400connected to a tire valve502that is position in wheel rim500.", "", "Referring now toFIG.5b, there is illustrated an enlarged detailed cross-sectional front view of articulating tire valve install-removal tool400connected to a TPMS valve502that is inserted in wheel rim500where the tool is threaded onto mouth504of valve502. Valve502has a compressed rubber coating or jacket505to provide a seal503to the rim. The central longitudinal axis of rotating threaded member402is generally perpendicular to valve hole longitudinal axis VHA. This orientation remains the same or nearly the same during the tire valve removal process as discussed above with regard toFIGS.4c-4e. TPMS valve502is fully inserted in wheel rim500and the orientation of articulating tire valve install-removal tool400relative to TPMS valve502in wheel rim500would be similar to the orientation of the articulating tire valve install-removal tool400as illustrated inFIG.4c.", "", "Referring now toFIG.5c, there is illustrated an enlarged detailed cross-sectional front view of articulating tire valve install-removal tool400connected to a TPMS valve502wherein TPMS valve502has been partially removed from wheel rim500. Such orientation of articulating tire valve install-removal tool400relative to TPMS valve502in wheel rim500would be similar to the orientation of articulating tire valve install-removal tool400as illustrated inFIG.4d. The central longitudinal axis of rotating threaded member402remains generally perpendicular to valve hole longitudinal axis VHA. During the removal of TPMS valve502from wheel rim500, TPMS valve502, as it removed from wheel rim500, does not rotate or has minimal rotation (e.g., 0-20° of rotation about VHA and all values and ranges therebetween). As illustrated inFIG.5c, the base of TPMS valve502was been moved above rim hole508. The little or no rotation of TPMS valve502during removal from wheel rim500inhibits or prevents pinch to the rubber coating or jacket on TPMS valve502.", "", "As illustrated inFIG.5c, locking feature406on the bottom portion of articulating tire valve install-removal tool400engages portion of the wheel rim that keeps articulating tire valve install-removal tool400secured to the wheel rim during use and inhibits or prevents forward movement the base of articulating rim contact member401relative to the wheel rim as handle413is force downwardly during a tire valve removal process.", "", "It will thus be seen that the objects set forth above, among those made apparent from the preceding description, are efficiently attained, and since certain changes may be made in the constructions set forth without departing from the spirit and scope of the disclosure, it is intended that all matter contained in the above description and shown in the accompanying drawings shall be interpreted as illustrative and not in a limiting sense. The disclosure has been described with reference to preferred and alternate embodiments. Modifications and alterations will become apparent to those skilled in the art upon reading and understanding the detailed discussion of the disclosure provided herein. This disclosure is intended to include all such modifications and alterations insofar as they come within the scope of the present disclosure. It is also to be understood that the following claims are intended to cover all of the generic and specific features of the disclosure herein described and all statements of the scope of the disclosure, which, as a matter of language, might be said to fall therebetween.", "", "To aid the Patent Office and any readers of this application and any resulting patent in interpreting the claims appended hereto, applicants do not intend any of the appended claims or claim elements to invoke 35 U.S.C. 112(f) unless the words “means for” or “step for” are explicitly used in the particular claim."], "claims": ["1 . An articulating tire valve stem install-removal tool for removing a tire valve from a valve hole in a wheel rim comprising a body, a rotating threaded member, an articulating rim contact member, a connecting linkage, and a handle; each of said rotating threaded member, said articulating rim contact member, and said linkage are movably connected to said body; said handle is connected to said body and spaced from one or more of said rotating threaded member, said articulating rim contact member, and said linkage; said articulating tire valve install-removal tool is configured to remove a tire valve from a wheel rim while a longitudinal axis of the tire valve remains parallel or nearly parallel a valve hole longitudinal axis of a valve hole in the wheel rim during removal of the tire valve from the wheel rim.", "2 . The articulating tire valve stem install-removal tool as defined in claim 1 , wherein said rotating threaded member is configured to be threadedly connected to a valve stem of said tire valve.", "3 . The articulating tire valve stem install-removal tool as defined in claim 1 , wherein said body includes a slot region that is located between two side arms of said body; at least a portion of said articulating rim contact member and said rotating threaded member are rotatably positioned in said slot region.", "4 . The articulating tire valve stem install-removal tool as defined in claim 3 , wherein a) a longitudinal length of said slot region is at least 50% of a total longitudinal length of said body, b) a width of said slot region is constant along 50-100% of said longitudinal length of said slot region, and/or c) a maximum width of said slot region is at least 40% of a minimum width of said body.", "5 . The articulating tire valve stem install-removal tool as defined in claim 1 , wherein said rotating threaded member is pivotally connected to a front portion of said body; said rotating threaded member is hingedly connected to a first end of said connecting linkage; a second end of said connecting linkage is hingedly connected to a top portion of said articulating rim contact member; said articulating rim contact member is pivotally connected to said body, and wherein an interconnection between said rotating threaded member, said connecting linkage and said articulating rim contact member results in interactive movement between said rotating threaded member and said articulating rim contact member during operation of said articulating tire valve install-removal tool.", "6 . The articulating tire valve stem install-removal tool as defined in claim 5 , wherein said articulating rim contact member is positioned rearwardly on said body from said rotating threaded member.", "7 . The articulating tire valve stem install-removal tool as defined in claim 1 , wherein said handle is rigidly connected to a rear portion of said body.", "8 . The articulating tire valve stem install-removal tool as defined in claim 1 , wherein a longitudinal length of said handle is greater than a longitudinal length of said body.", "9 . The articulating tire valve stem install-removal tool as defined in claim 1 , wherein a) a front portion of said rotating threaded member extends outwardly from said body during 70-100% of a tire valve removal process, and/or b) a top portion and bottom portion of said articulating rim contact member both extend outwardly from said body during 70-100% of the tire valve removal process.", "10 . The articulating tire valve stem install-removal tool as defined in claim 1 , wherein a base of said articulating rim contact member includes one or more locking points that are configured to releasably engage a portion of the wheel rim during use of said articulating tire valve install-removal tool during a tire valve removal process.", "11 . The articulating tire valve stem install-removal tool as defined in claim 1 , wherein one or more of said locking points has a step-like configuration that includes a flat base portion and a flat back portion that extends downwardly from said base portion at an angle of about 80-100°; one or more of said locking points are configured to limit movement of a base of said articulating rim contact member relative to the wheel rim during a tire valve removal process.", "a. providing said wheel rim that includes said tire valve; said tire valve at least partially positioned in said tire valve hole in said wheel rim; b. providing an articulating tire valve stem install-removal tool comprising a body, a rotating threaded member, an articulating rim contact member, a connecting linkage, and a handle; each of said rotating threaded member, said articulating rim contact member, and said linkage are movably connected to said body; said handle is connected to said body and spaced from one or more of said rotating threaded member, said articulating rim contact member, and said linkage; c. connecting said rotating threaded member to a top portion of said tire valve; d. positioning a bottom portion of said articulating rim contact member on a top surface of said wheel rim; e. applying a downward force on said handle to cause said tire valve to be lifted upwardly from said wheel rim; and wherein said articulating tire valve install-removal tool is configured to remove said tire valve from said tire valve hole while a longitudinal axis of said tire valve remains parallel or nearly parallel to a valve hole longitudinal axis of said tire valve hole during removal of said tire valve from said wheel rim.", "13 . The method as defined in claim 12 , wherein said rotating threaded member is configured to be threadedly connected to a valve stem of said tire valve.", "14 . The method as defined in claim 12 , wherein said body includes a slot region that is located between two side arms of said body; at least a portion of said articulating rim contact member and said rotating threaded member are rotatably positioned in said slot region.", "15 . The method as defined in claim 14 , wherein a) a longitudinal length of said slot region is at least 50% of a total longitudinal length of said body, b) a width of said slot region is constant along 50-100% of said longitudinal length of said slot region, and/or c) a maximum width of said slot region is at least 40% of a minimum width of said body.", "16 . The method as defined in claim 12 , wherein said rotating threaded member is pivotally connected to a front portion of said body; said rotating threaded member is hingedly connected to a first end of said connecting linkage; a second end of said connecting linkage is hingedly connected to a top portion of said articulating rim contact member; said articulating rim contact member is pivotally connected to said body, and wherein an interconnection between said rotating threaded member, said connecting linkage and said articulating rim contact member results in interactive movement between said rotating threaded member and said articulating rim contact member during operation of said articulating tire valve install-removal tool.", "17 . The method as defined in claim 16 , wherein said articulating rim contact member is positioned rearwardly on said body from said rotating threaded member.", "18 . The method as defined in claim 12 , wherein said handle is rigidly connected to a rear portion of said body.", "19 . The method as defined in claim 12 , wherein a longitudinal length of said handle is greater than a longitudinal length of said body.", "20 . The method as defined in claim 12 , wherein a) a front portion of said rotating threaded member extends outwardly from said body during 70-100% of a tire valve removal process, and/or b) a top portion and bottom portion of said articulating rim contact member both extend outwardly from said body during 70-100% of the tire valve removal process.", "21 . The method as defined in claim 12 , wherein a base of said articulating rim contact member includes one or more locking points that are configured to releasably engage a portion of the wheel rim during use of said articulating tire valve install-removal tool during a tire valve removal process.", "22 . The method as defined in claim 12 , wherein one or more of said locking points has a step-like configuration that includes a flat base portion and a flat back portion that extends downwardly from said base portion at an angle of about 80-100°; one or more of said locking points are configured to limit movement of a base of said articulating rim contact member relative to the wheel rim during a tire valve removal process.", "23 . The method as defined in claim 12 , wherein said tire valve rotates less than 20° about said valve hole longitudinal axis of said tire valve hole during removal of said tire valve from said wheel rim."], "bibtex": "@patent{20240092128,\n    title = {ARTICULATING TIRE VALVE STEM INSTALL-REMOVAL TOOL AND RELATED METHODS},\n    number = {20240092128},\n    year = {2024},\n    note = {File: US20240092128A1-20240321.XML}\n    }", "classification": "B60C2518FI"}, {"title": "WATERPROOF UAV FOR CAPTURING IMAGES", "doc_number": "20240092129", "filename": "US20240092129A1-20240321.XML", "abstract": "A waterproof UAV that records camera footage while traveling through air and while submerged in water. The UAV alters speed and direction of propellers dependent on the medium that the UAV is traveling through to provide control of the UAV. The propellers are capable of spinning in both directions to enable the UAV to change its depth and orientation in water. A machine learning (ML) model is used to identify humans and objects underwater. A housing coupled to the UAV makes the UAV positively buoyant to float in water and to control buoyancy while submerged.", "detailed_description": ["A waterproof UAV that records camera footage while traveling through air and while submerged in water. The UAV alters speed and direction of propellers dependent on the medium that the UAV is traveling through to provide control of the UAV. The propellers are capable of spinning in both directions to enable the UAV to change its depth and orientation in water. A machine learning (ML) model is used to identify humans and objects underwater. A housing coupled to the UAV makes the UAV positively buoyant to float in water and to control buoyancy while submerged.", "", "Additional objects, advantages and novel features of the examples will be set forth in part in the description which follows, and in part will become apparent to those skilled in the art upon examination of the following and the accompanying drawings or may be learned by production or operation of the examples. The objects and advantages of the present subject matter may be realized and attained by means of the methodologies, instrumentalities and combinations particularly pointed out in the appended claims.", "", "The description that follows includes systems, methods, techniques, instruction sequences, and computing machine program products illustrative of examples of the disclosure. In the following description, for the purposes of explanation, numerous specific details are set forth in order to provide an understanding of various examples of the disclosed subject matter. It will be evident, however, to those skilled in the art, that examples of the disclosed subject matter may be practiced without these specific details. In general, well-known instruction instances, protocols, structures, and techniques are not necessarily shown in detail.", "", "The terms and expressions used herein are understood to have the ordinary meaning as is accorded to such terms and expressions with respect to their corresponding respective areas of inquiry and study except where specific meanings have otherwise been set forth herein. Relational terms such as first and second and the like may be used solely to distinguish one entity or action from another without necessarily requiring or implying any actual such relationship or order between such entities or actions. The terms “comprises,” “comprising,” “includes,” “including,” or any other variation thereof, are intended to cover a non-exclusive inclusion, such that a process, method, article, or apparatus that comprises or includes a list of elements or steps does not include only those elements or steps but may include other elements or steps not expressly listed or inherent to such process, method, article, or apparatus. An element preceded by “a” or “an” does not, without further constraints, preclude the existence of additional identical elements in the process, method, article, or apparatus that comprises the element.", "", "The term “coupled” as used herein refers to any logical, optical, physical or electrical connection, link or the like by which signals or light produced or supplied by one system element are imparted to another coupled element. Unless described otherwise, coupled elements or devices are not necessarily directly connected to one another and may be separated by intermediate components, elements or communication media that may modify, manipulate or carry the light or signals.", "", "Reference now is made in detail to the examples illustrated in the accompanying drawings and discussed below.", "", "Commercial UAVs typically include a camera for imaging the earth and other objects below, for instance, capturing still images and video. In some versions, the camera is fixed to the UAV, without the use of a gimbal for selectively positioning the camera. More complicated UAVs include an electronic receiver and an electronically configurable gimble and camera. A remotely located controller establishes a wireless link with the receiver of the UAV to control the UAV and the camera. The electronic receiver, electrically controllable gimbles, and cameras are expensive, fragile, and mechanically complex, and add to the weight and bulkiness of the UAV. The UAV described herein is smaller and more lightweight than conventional UAVs. Additionally, the UAV has continuous surfaces and is sized to facilitate placement in a pocket of a garment.", "", "FIG.1Ais a perspective view of a UAV10having a shroud12with propeller openings15extending through the shroud12. Propellers14are positioned in respective propeller openings15. The shroud12includes a rectangular lower surface18and a rectangular upper surface (not shown) with a smooth continuous edge17extending around the entire UAV10between the upper and lower surfaces. The shroud encompasses electronics (e.g., processor202, memory204, GPS receiver208, and IMU210;FIG.2) and structural components of the UAV10(e.g., camera20). In the illustrated example, the rectangular surfaces completely encompass the propellor openings15.", "", "Each propeller opening15extends through the shroud12from the upper surface to the lower surface18and includes a continuous wall24extending around a periphery of the propeller opening15. Although four propeller openings15with respective propellers14are shown and described, more or fewer propeller openings15with respective propellers may be present. As used herein, the term continuous wall means a wall with a surface free of any visually perceptible through holes.", "", "Each propeller14includes multiple blades16. Each blade16is made out of metal or a non-conductive material. Typically, non-conductive materials, such as plastic, are used for the blades since they are generally lighter.", "", "The shroud12has a smooth continuous surface22and the peripheral edges17are also smooth. The shroud12is sized such that the UAV10can fit in a garment (e.g., a pocket of pants or a jacket). The peripheral edges17are rounded to facilitate placement of the UAV10into a garment pocket. The smooth continuous surface22and peripheral edges17also provide an elegant aesthetic design. As used herein, the term smooth continuous surface means free of any visually perceptible through holes or sharp edges.", "", "A camera20is positioned adjacent the lower surface18of the shroud12. The camera20faces outward from the lower surface18and is configured to capture images at a fixed pitch angle with respect to the shroud12. In this example, the camera20is facing downward from the shroud12such that the camera pitch angle is 90 degrees with respect to the lower surface18. In other examples, the camera pitch angle can also be fixed at other pitch angles, such as −5 degrees downward from horizontal, or other pitch angles as desired.", "", "The UAV10is waterproof for a sustained submersion underwater. The shroud12is waterproofed by sealing all edges, openings, and gaps of the shroud12. The motors of the propellers14may also be waterproof and capable of operating underwater. In one example, the waterproofing is done by sealing all edges with an epoxy coating to provide moisture protection of the internal electronics of the UAV10including the control system200as shown inFIG.2. The UAV10is waterproof to support full immersion for extended periods of time. In one example, the UAV10has an industry standard waterproof rating of IP68.", "", "FIG.1Bis a perspective view of the UAV10having a separate housing100that is attached to the shroud12(either permanently or selectively). The separate housing100has corners102that are commensurate with the corners17of the UAV10. In one example, the UAV10by itself is not buoyant in water and the separate housing100is attached to the UAV10to provide a positively buoyant UAV10. An upwards buoyant force generated by the housing100is only slightly higher than the gravitational force of the UAV10so that the UAV10requires minimal power, for example, minimal propellor14rotations, to stay at a particular depth. The UAV10is positively buoyant for a scenario when power is lost to the UAV10while underwater.", "", "In one example, the separate housing100is a hollow case that partially encompasses the UAV10about a periphery of the shroud12while exposing the propellers14so that they can function normally. In one example, the hollow case consists of top and bottom shells each formed as rings that can be snapped together to secure the housing100to the shroud12. In another example, the top and bottom shells can be connected via a hinge. Additionally, the case may completely or partially cover the top surface (not shown) of the UAV10and the bottom surface18of the UAV10while exposing the propellor openings15so as to not inhibit operation of the propellers14. In another example, the separate housing100may be a foam case, such as a closed cell foam, that can be coupled to the outside of the UAV10via friction. The separate housing100can be removed from the shroud12when not used for underwater purposes to reduce weight of the UAV10. The separate housing100allows the UAV10to float within a reasonable depth of water that is suitable for recreational applications.", "", "A water sensor30is positioned adjacent the lower surface18of the shroud12to determine if the UAV10is in water. The water sensor30is used by the processor202as shown inFIG.2to configure the UAV10between modes, e.g., an aerial mode and a water mode. The processor202in the aerial mode configures the propellers14to operate at speeds for effective navigation through air, whereas the processor202in the water mode configures the propellers14to operate at slower speeds to accommodate for the greater density of water as compared to air. When the UAV10is operating in water, the UAV10opposes its buoyant force when maneuvering. The buoyant force is in the opposite direction of gravity, which the UAV10opposes when operating in the air. The processor202in the water mode accounts for this change by altering the direction that the propellers14spin for maintaining a specific depth. In one example, the UAV10operates aerially and the water sensor30communicates to the processor202the absence of water. The UAV10then lands on the surface of a body of water and the water sensor30communicates to the processor202the presence of water and the UAV10switches to the water mode to better navigate underwater. In another example, the water sensor30may be absent and the switching between aerial and water modes may be done by a user.", "", "The propellers14each have the independent ability to spin in both directions in the water mode to maneuver the UAV10in the x/y plane and an orthogonal z direction, with z being depth to provide 3-dimensional (3D) control, such as deeper or shallower in water and laterally, depending on the individual spin directions. The direction of each propeller rotation is controlled by the processor202. In one example, independent switches may be provided for each propeller that are controlled by the processor202to control a direction of the propeller rotation. In one example, the two left propellers14shown inFIG.1Acan spin in the opposite direction while the right propellers14spin in the opposite direction of the two left propellers14to tilt the UAV10. Once the UAV10is tilted a desired rotation, such as 90°, and the UAV10is facing the target, all propellers14can spin into the same direction to move the UAV10toward or away from the target. Different propeller14speeds between each propeller14are used to enable the UAV10to turn and support additional directional actions. This maneuverability is useful for various cinematic footage techniques such as panorama, fade-out, etc., both in the air and in the water.", "", "FIG.2illustrates a control system200configured to automatically control the UAV10, including UAV operation along a flight path (FP). The control system200includes an electronic processor202comprising a flight controller, a memory204including flight plans, instructions and code for operating processor202to control and operate the UAV10, data tables206stored in memory204, a global positioning system (GPS) receiver208providing global positioning of the UAV10, an inertial measurement unit (IMU)210, and the water sensor30. The electronic processor202establishes the FP of the UAV10based on performance data in data tables206and the GPS208. Multiple FPs are stored in memory204, wherein the FPs can be custom programmed and downloaded by into memory204by a user of the UAV10wirelessly or by a cable.", "", "In the instance that connection with the GPS208is disrupted, the IMU210is used by the processor202to estimate the position of the UAV10until the GPS208is reconnected. For example, when the UAV10follows a flightpath FP3as shown inFIG.5from an aerial path to an underwater path, the GPS connection of the UAV becomes disrupted. The processor202uses measurements from the IMU210to estimate the position of the UAV10to continue following the FP3until the GPS208becomes reconnected.", "", "The processor202receives signals from the water sensor30to determine if the UAV10is in water. The processor202is configured to operate the UAV10in the aerial mode or the water mode depending on the sensor signals from the water sensor30. The processor202controls the propellers14at different speeds and directions dependent on the mode and movement controls of the UAV10.", "", "FIG.3illustrates a graphical representation of a flight path FP1that routes the UAV10from a starting position300to an end position302. The FP1routes the UAV10along a smooth path at varying altitudes to a target(s)304, also referred to as a point of interest (POI). The target304can comprise of many features including buildings, trees, people etc. The limited or restricted spacing around the target304constrains and may limit the maneuvering of the UAV10about target304, and thus the camera imaging. This spacing creates difficulty for the UAV10having a fixed position camera20.", "", "FIG.4illustrates a graphical representation of a more complex flight path FP2that the UAV10traverses to and about target304. The flight path FP2includes multiple waypoints WP and multiple image capture points including image capture points CP1and CP2. The flight path FP2also includes performance variables of the UAV10, and the orientation of the UAV10including a pitch angle PA of the camera20with respect to horizontal at each waypoint, including proximate the image capture points CP1and CP2. In this example, the UAV10traverses the flight path FP2having multiple waypoints to image capture point CP1proximate the target304.", "", "In an example, the flight path FP2orients the UAV10such that the camera20is directed at a pitch angle PA3facing target304when approaching, and at, image capture point CP1. The camera20captures images of target304at image capture point CP1for a predetermine image capture time and stores the images in memory204. The UAV10subsequently traverses flight path FP2to image capture point CP2proximate target304. The flight path FP2also orients the UAV10such that the camera20is directed downwardly at a pitch angle PA5toward target304. The camera20again captures images at image capture point CP2and stores the images in memory204.", "", "Since the camera20is fixed to shroud12at the fixed pitch angle, orienting the UAV10in a predetermined stable position at an angle is not an ordinary task. More importantly, establishing a predetermined camera angle of the camera20relative to the target304at capture points CP1and CP2, is not an ordinary task. The flight paths are automatically determined by electronic processor202based upon the GPS position of the capture points CP1and CP2, and the desired camera pitch angle at capture points CP1and CP2. The processor202determines the operational parameters of the UAV10, and it takes into account the weight and flight performance of the UAV10. The determined flight paths increase the image capture time at capture points CP1and CP2, at the desired pitch angle, which is very beneficial for imaging.", "", "FIG.5illustrates a graphical representation of a flight path FP3that routes the UAV10from a starting position500above water on a path that travels under water to an end position502above water. The UAV10is configured to capture images and/or video along the flight path. The FP3routes the UAV10along a flight path that transitions from the air to underwater at transition point508where the UAV10is switched from the aerial mode to the water mode. The FP3routes the UAV10along a smooth path that varies in underwater depth to targets504and506, also referred to as a point of interest (POI). The targets504and506can include many features including coral, shipwrecks, underwater structures, aquatic life, divers, etc. The UAV10then exits the water at the transition point510and returns to the aerial mode to fly back into the air to the end position502out of water.", "", "FIG.6illustrates the UAV10capturing images and video underwater while following a target, wherein the target is a diver602. In one example, the camera20has a view600that encompasses the diver602, and the processor202is configured to control the UAV10to autonomously follow the diver602to keep the diver602within the view600of the camera20by individually controlling the propellors14. The processor202controls the speed and direction of the propellors14to maneuver the UAV10. The processor202employs existing face-detection algorithms with a machine learning model to better detect humans, divers, and objects underwater.", "", "In another example, the UAV10is configured to be manually controlled remotely by a user using a remote control. The user can manually switch the UAV10between the aerial mode and water mode, and to operate the UAV10both in the air and underwater. A live video generated by the camera20is also transmitted from the UAV10to the user.", "", "FIG.7illustrates a method700of operating the UAV10in both an aerial mode and a water mode.", "", "At block702, the UAV10is operating in the aerial mode. The UAV10may fly autonomously or be flown and controlled by a remote user. The UAV10is configured to maneuver and navigate through the air. Operation of the UAV10in the air may include capturing aerial footage using the camera20.", "", "At block704, the UAV10enters a water environment. For example, the UAV10lands on the surface of a body of water.", "", "At block706, the UAV10changes its operating mode from the aerial mode to the water mode. The change may be done automatically via communication between the water sensor30and the processor202or may be done by a remote user. The UAV10is configured to maneuver and navigate underwater.", "", "At block708, the UAV10operates in the water mode. The UAV10may maneuver autonomously or be controlled by a remote user. Operation of the UAV10underwater may include capturing underwater footage using the camera20.", "", "In addition, in the foregoing Detailed Description, it can be seen that various features are grouped together in various examples for the purpose of streamlining the disclosure. This method of disclosure is not to be interpreted as reflecting an intention that the claimed examples require more features than are expressly recited in each claim. Rather, as the following claims reflect, the subject matter to be protected lies in less than all features of any single disclosed example. Thus, the following claims are hereby incorporated into the Detailed Description, with each claim standing on its own as a separately claimed subject matter.", "", "The examples illustrated herein are described in sufficient detail to enable those skilled in the art to practice the teachings disclosed. Other examples may be used and derived therefrom, such that structural and logical substitutions and changes may be made without departing from the scope of this disclosure. The Detailed Description, therefore, is not to be taken in a limiting sense, and the scope of various examples is defined only by the appended claims, along with the full range of equivalents to which such claims are entitled."], "claims": ["a waterproof shroud; a propeller opening extending through the waterproof shroud; a propeller coupled to the waterproof shroud and positioned within the propeller opening; a housing coupled to the waterproof shroud and configured to buoy the UAV in water; and a processor disposed in the waterproof shroud; the processor configured to operate the UAV in a first mode comprising navigating the UAV through air, and in a second mode comprising navigating the UAV underwater.", "2 . The UAV as specified in claim 1 , wherein the housing is selectively attachable to the shroud.", "3 . The UAV as specified in claim 2 , wherein the housing is a hollow case.", "4 . The UAV as specified in claim 3 , wherein the housing encompasses an outer edge of the waterproof shroud.", "5 . The UAV as specified in claim 1 , further comprising a water sensor, wherein the processor is configured to switch the UAV between the two modes based on signals received from the water sensor.", "6 . The UAV as specified in claim 1 , further comprising a plurality of the propellers, wherein each of the propellers is configured to be controlled independently by the processor in speed and direction.", "7 . The UAV as specified in claim 6 , wherein the UAV further comprises a camera configured to capture images and video.", "8 . The UAV as specified in claim 7 , wherein the processor is configured to use a machine learning algorithm to detect a target underwater when the UAV is in the second mode.", "9 . The UAV as specified in claim 8 , wherein the UAV is configured to autonomously follow the target underwater.", "10 . The UAV as specified in claim 7 , further comprising a global positioning system (GPS) coupled to the shroud, an inertial measurement unit (IMU), and a memory containing a flight path.", "11 . The UAV as specified in claim 10 , wherein the flight path includes a plurality of waypoints.", "12 . The UAV as specified in claim 11 , wherein the GPS and IMU are configured to be used to navigate the UAV between the plurality of waypoints.", "operating the UAV in a first mode comprising navigating the UAV through air; switching the UAV from the first mode to a second mode; and operating the UAV in the second mode comprising navigating the UAV underwater.", "14 . The method as specified in claim 13 , wherein the housing is selectively attachable to the shroud.", "15 . The method as specified in claim 14 , wherein the UAV further comprises a camera, the method further comprising capturing images using the camera.", "16 . The method as specified in claim 13 , further comprising a water sensor, wherein the processor switches the UAV between the two modes based on signals received from the water sensor.", "17 . The method as specified in claim 13 , further comprising a plurality of propellers, wherein each of the propellers are controlled independently by the processor in speed and direction.", "18 . The method as specified in claim 13 , wherein the processor uses a machine learning algorithm to detect a target underwater when the UAV is in the second mode and autonomously following the target underwater.", "19 . The method as specified in claim 13 , the UAV further comprising a global positioning system (GPS) coupled to the shroud, an inertial measurement unit (IMU), and a memory containing a flight path including a plurality of waypoints, wherein the step of navigating the UAV underwater further comprises using the GPS and IMU to navigate the UAV between the plurality of waypoints.", "operating the UAV in a first mode comprising navigating the UAV through air; switching the UAV from the first mode to a second mode; and operating the UAV in the second mode comprising navigating the UAV underwater."], "bibtex": "@patent{20240092129,\n    title = {WATERPROOF UAV FOR CAPTURING IMAGES},\n    number = {20240092129},\n    year = {2024},\n    note = {File: US20240092129A1-20240321.XML}\n    }", "classification": "B60F500FI"}, {"title": "FRONT SUSPENSION DEVICE", "doc_number": "20240092130", "filename": "US20240092130A1-20240321.XML", "abstract": "A front suspension device comprises a suspension arm, one end of which has a front-wheel support portion to support a front wheel of a vehicle and the other end of which is positioned on an inward side, in a vehicle width direction, of the front-wheel support portion and has a vehicle-body attachment portion to be attached to a vehicle-body member of the vehicle and a damper supported at a damper support portion which is provided at a portion of the suspension arm which is positioned in the vicinity of the front-wheel support portion at a lower portion thereof and connected to the vehicle-body member at an upper portion thereof. The damper support portion of the suspension arm has a breakage ease portion to cause breakage of the suspension arm.", "detailed_description": ["Hereafter, an exemplified embodiment will be described specifically referring to the drawings."], "claims": ["a suspension arm, one end of which has a front-wheel support portion to support a front wheel of a vehicle and the other end of which is positioned on an inward side, in a vehicle width direction, of said front-wheel support portion and has a vehicle-body attachment portion to be attached to a vehicle-body member of the vehicle; and a damper supported at a damper support portion which is provided at a portion of said suspension arm which is positioned in the vicinity of said front-wheel support portion at a lower portion thereof and connected to the vehicle-body member at an upper portion thereof, wherein said damper support portion of the suspension arm has a breakage ease portion to cause breakage of the suspension arm.", "2 . The front suspension device of claim 1 , wherein said damper support portion of the suspension arm has a hole portion which stores a lower end portion of said damper and penetrates in a vehicle longitudinal direction, and said breakage ease portion is provided at another portion of the damper support portion than said hole portion.", "3 . The front suspension device of claim 2 , wherein said breakage ease portion is positioned at both points of said damper support portion which are located on an upper side and a lower side of said hole portion, respectively.", "4 . The front suspension device of claim 1 , wherein said breakage ease portion is a groove portion which is configured to be recessed in a vehicle longitudinal direction.", "5 . The front suspension device of claim 1 , wherein a rear face portion of an outside portion of said suspension arm which extends from said damper support portion to said front-wheel support portion is of an arch shape which is curved toward a vehicle forward side in a plan view.", "6 . The front suspension device of claim 5 , wherein said breakage ease portion is a groove portion which is formed at a front face portion of said damper support portion and configured to be recessed in a vehicle longitudinal direction.", "7 . The front suspension device of claim 6 , wherein a position, in the vehicle width direction, of said breakage ease portion is the same as a position, in the vehicle width direction, of a curve top portion of said rear face portion which is positioned on a foremost side.", "8 . The front suspension device of claim 7 , wherein said suspension arm is formed by forging.", "9 . The front suspension device of claim 1 , wherein said suspension arm is formed by forging."], "bibtex": "@patent{20240092130,\n    title = {FRONT SUSPENSION DEVICE},\n    number = {20240092130},\n    year = {2024},\n    note = {File: US20240092130A1-20240321.XML}\n    }", "classification": "B60G700FI"}]