[{"title": "SPOKE", "doc_number": "20240051333", "filename": "US20240051333A1-20240215.XML", "abstract": "A spoke includes an axle body and two connecting elements. The axle body has a middle segment and two connecting segments. The two connecting segments are respectively connected to two opposite sides of the middle segment. The two connecting segments each have a first peripheral surface, and the two first peripheral surfaces each are formed with a friction enhancing structure. The two connecting elements respectively wrap at least a part of the two friction enhancing structures by means of injection molding. The two connecting elements each have a second peripheral surface facing away from the axle body, and the two second peripheral surfaces each are formed with a connecting structure.", "detailed_description": ["The present disclosure will now be described more specifically with reference to the following embodiments. It is to be noted that the following descriptions of preferred embodiments of this invention are presented herein for purpose of illustration and description only. It is not intended to be exhaustive or to be limited to the precise form disclosed.", "", "FIG.1is a schematic diagram of a spoke according to an embodiment of the present disclosure.FIG.2is a schematic diagram of the spoke ofFIG.1in which an axle body and two connecting elements are separated.FIG.3is a schematic diagram of the spoke ofFIG.1in which one of the two connecting elements is fixed to the axle body.FIG.4is a schematic cross-sectional diagram of the spoke ofFIG.3fixed to a nipple. Please refer toFIGS.1,2and3first. The spoke100includes an axle body110and two connecting elements120. The axle body110has a middle segment111and two connecting segments112(shown inFIGS.2and3). The two connecting segments112are respectively connected to two opposite sides of the middle segment111. The two connecting segments112each have a first peripheral surface OS1. The two first peripheral surfaces OS1each are formed with a friction enhancing structure1120. The two connecting elements120each wrap at least a part of the respective friction enhancing structure1120by means of injection molding. The two connecting elements120each have a second peripheral surface OS2facing away from the axle body110. The two second peripheral surfaces OS2each are formed with a connecting structure121.", "", "Please refer toFIGS.3and4. The material of the connecting element120in this embodiment includes, for example, thermoplastic, so as to facilitate to perform the injection molding process. For example, the material of the connecting element120may include epoxy, polyetheretherketone (PEEK), polyaryletherketone (PAEK), polyetherketoneketone (PEKK), but the present disclosure is not limited thereto. In this embodiment, the two connecting elements120each may further extend to wrap a part of the middle segment111, so that the two connecting elements120can be more firmly fixed to the axle body110, thereby further improving the structural strength of the spoke100against the axial-direction (substantially parallel to direction Z inFIG.4) tensile force.", "", "Please continue to refer toFIG.4. In this embodiment, the connecting element120may be fixed to a wheel of a bicycle (not shown) via a nipple N. The connecting structure121of the connecting element120may be thread, and the nipple N may have an inner thread corresponding to the connecting structure121. In other embodiments, it can be understood that the connecting element120may be fixed to the wheel via a hub, and the connecting structure121is not limited to be thread. In this embodiment, an axis122of each of the two connecting elements120is located on an imaginary plane. Specifically, the axis122substantially extends, for example, along the direction Z, and the imaginary plane substantially extend along the Y-Z plane. The connecting structure121is constructed by a plurality of sawtooth threads1210when viewing at the imaginary plane (i.e., viewing in a direction substantially parallel to the direction X). Please refer toFIGS.4and5together. The sawtooth threads1210each have a tooth tip T. The sawtooth thread1210is divided into a first angle A1and a second angle A2by a connecting line L passing through a central point C of the respective tooth tip T and perpendicular to the axis122. The first angle A1is close to the middle segment111, and the second angle A2is away from the middle segment111, wherein the first angle A1is less than the second angle A2. Therefore, each sawtooth thread1210can have larger tooth thickness so as to further improve the structural strength against the axial-direction tensile force. In addition, the shape of each sawtooth thread1210is asymmetrical to the connecting line L; thus, when the spoke100is subjected to an axial-direction tensile force, parts of the sawtooth thread1210located on both sides of the connecting line L bear inconsistent forces, which can also prevent the sawtooth thread1210from loosing from the nipple N due to excessive local force. In an embodiment, the first angle A1may be between 2-10 degrees, such as about 5 degrees; the second angle A2may be between 40-50 degrees, such as about 45 degrees; but the specific data of degrees is not limited thereto.", "", "Please refer toFIGS.2and3again. In this embodiment, the middle segment111and the two connecting segments112of the axle body110can be integrally formed to further improve the structural strength of the axle body110against the axial-direction tensile force. Moreover, the axle body110may be made by the injection molding process, but the present disclosure is not limited thereto. In addition, a material of the axle body110includes, for example, fiber composite or thermoplastic in this embodiment. For example, the aforementioned fiber composite may include fiberglass or carbon fiber, the aforementioned thermoplastic may include epoxy, PEEK, PAEK, PEKK etc., and the material of the axle body110is not limited by the present disclosure.", "", "Please refer toFIGS.2,3and4together. The friction enhancing structure1120may be protruded or be recessed from an outer peripheral surface of the middle segment111to enhance the friction between the connecting element120and the connecting segments112of the axle body110, thereby improving the structural strength of the spoke100against the axial-direction tensile force. For example, each of the friction enhancing structures1120includes, for example, a plurality of concave portions R1in this embodiment. The concave portions R1are disposed at intervals along the axial direction of the axle body110, and a convex portion R2is formed between each two adjacent concave portions R1. Specifically, each concave portion R1is, for example, recessed from the first peripheral surface OS1, and the concave portions R1are disposed at intervals on the first peripheral surface OS1so as to form a convex portion R2between each two adjacent concave portions R1. Further, please continue to refer toFIG.4. When the connecting element120is slid relative to the axle body110due to that the connecting element120is pulled by an excessive force along the axial direction, the connecting element120can be pushed by the convex portions R2along a radial direction (substantially parallel to, for example, a direction Y) of the axle body110, and therefore the connecting element120pushes the nipple N along the radial direction. Then, the nipple N can apply a reaction force to the connecting element120since the nipple N is pushed by the connecting element120. As a result, the connecting element120can clamp the connecting segment112of the axle body110again to prevent the connecting element120from continuously sliding relative to the axle body110. In addition, when the convex portions R2push the connecting element120along the radial direction of the axle body110, the connecting structure121of the connecting element120can be more closely abut to inner threads of the nipple N, so as to further prevent the connecting element120from loosing from the nipple N. Please refer toFIGS.2,3and4together again. The convex portions R2and the concave portions R1make the first peripheral surface OS1have a wavy surface in this embodiment. For example, the concave portions R1can make the first peripheral surface OS1have a plurality of concave curve surfaces at intervals, and the convex portion R2forms a convex curve surface between each two adjacent concave curve surfaces. The concave curve surfaces and the convex curve surfaces staggered from each other together make a part of the first peripheral surface OS1have a wavy surface. It can be understood that the specific shape of the friction enhancing structure1120is not limited toFIGS.2to4. For example, the shape of the friction enhancing structure1120may include particles in an embodiment, and the specific shape of the friction enhancing structure1120is not limited in the present disclosure. Incidentally, the axle body110of this embodiment can have two opposite end surfaces113, and the friction enhancing structure1120is located between the respective end surface113and the middle segment111. The connecting element120further extends to wrap the respective end surface113, so that the connecting element120can be more firmly fixed to the axle body110.", "", "In summary, in the spoke of the present disclosure, the connecting element wraps and is fixed to the axle body by means of injection molding, and the area of the axle body wrapped by the connecting element is disposed with the friction enhancing structure to enhance the friction between the connecting element and the axle body. Thus, based on the aforementioned structure, the connecting element can firmly wrap and be fixed to the axle body. Therefore, when the spoke is subjected to an axial-direction tensile force, the connecting element is not easily separated from the axle body, thereby improving the structural strength of the spoke against the axial-direction tensile force.", "", "While the invention has been described in terms of what is presently considered to be the most practical and preferred embodiments, it is to be understood that the invention needs not be limited to the disclosed embodiment. On the contrary, it is intended to wrap various modifications and similar arrangements included within the spirit and scope of the appended claims which are to be accorded with the broadest interpretation so as to encompass all such modifications and similar structures."], "claims": ["an axle body, having a middle segment and two connecting segments, wherein the two connecting segments are respectively connected to two opposite sides of the middle segment, the two connecting segments each have a first peripheral surface, and the two first peripheral surfaces each are formed with a friction enhancing structure; and two connecting elements, respectively wrapping at least a part of the two friction enhancing structures by means of injection molding, wherein the two connecting elements each have a second peripheral surface facing away from the axle body, and the two second peripheral surfaces each are formed with a connecting structure.", "2 . The spoke according to claim 1 , wherein the two friction enhancing structures each comprise a plurality of concave portions, the concave portions are disposed at intervals along an axial direction of the axle body, and a convex portion is formed between each two adjacent concave portions.", "3 . The spoke according to claim 2 , wherein the convex portions and the concave portions make the first peripheral surface have a wavy surface.", "4 . The spoke according to claim 1 , wherein the two connecting elements each further extend to wrap a part of the middle segment.", "5 . The spoke according to claim 1 , wherein a material of the connecting element comprises thermoplastic.", "6 . The spoke according to claim 5 , wherein a material of the connecting element comprises epoxy, PEEK, PAEK or PEKK.", "7 . The spoke according to claim 1 , wherein the connecting structure is thread, an axis of each of the two connecting elements is located on an imaginary plane, the connecting structure is constructed by a plurality of sawtooth threads when viewing at the imaginary plane, the sawtooth threads each have a tooth tip, the sawtooth threads each are divided into a first angle and a second angle by a connecting line passing through a central point of the respective tooth tip and perpendicular to the axis, the first angle is close to the middle segment, the second angle is away from the middle segment, and the first angle is less than the second angle.", "8 . The spoke according to claim 1 , wherein the axle body has two end surfaces opposite to each other, the two friction enhancing structures are respectively located between the two end surfaces and the middle segment, and the two connecting elements further respectively extend to wrap the two end surfaces.", "9 . The spoke according to claim 1 , wherein a material of the axle body comprises fiber composite or thermoplastic.", "10 . The spoke according to claim 1 , wherein the middle segment and the two connecting segments are integrally formed."], "bibtex": "@patent{20240051333,\n    title = {SPOKE},\n    number = {20240051333},\n    year = {2024},\n    note = {File: US20240051333A1-20240215.XML}\n    }", "classification": "B60B104FI"}, {"title": "INSERT, PROTECTION DEVICE, WHEEL AND VEHCILE", "doc_number": "20240051334", "filename": "US20240051334A1-20240215.XML", "abstract": "The present application relates to an insert, a protection device, a wheel and a vehicle. The insert is used for a wheel, the wheel comprises a rim, spokes, and a tire, and the insert comprises: a body provided on the rim and/or the spokes; and a protection portion provided on the body, the protection portion at least partially shielding an outer surface of the tire. The technical solution of the embodiments of the present application can form a certain protection effect on a tire of a wheel, improve the reliability and safety of the wheel, and further improve the aesthetic appearance of the wheel.", "detailed_description": ["In the following, only certain exemplary embodiments are briefly described. As can be recognized by those skilled in the art, the described embodiments may be modified in various different ways without departing from the spirit or scope of the present application. Therefore, the drawings and the description are regarded as exemplary intrinsically rather than restrictive.", "", "An insert100according to the embodiments of the present application is described with reference toFIGS.1to12below. The insert100of the embodiments of the present application may be used for a vehicle wheel1. Herein, the vehicle wheel1may include a wheel rim200, a wheel spoke300, and a tire400, and the tire400is sleeved on the outer circumference wall of the wheel rim200.", "", "As shown inFIG.1, the insert100includes a body10and a protection portion20.", "", "Specifically, the body10is provided on the wheel rim200and/or the wheel spoke300. The protection portion20is provided on the body10, and at least part of the protection portion20shields the outer surface401of the tire400.", "", "More specifically, the body10may be provided on the outer surface of the wheel rim200and/or the wheel spoke300, and the protection portion20may be provided on the outer surface of the body10.", "", "Herein, the outer surface of the wheel rim200and/or the wheel spoke300refers to a surface, on the side away from the vehicle body, of the wheel rim200and/or the wheel spoke300. The outer surface of the body10refers to a surface, on the side away from the wheel rim200or the wheel spoke300, of the body10. The outer surface401of the tire400refers to a surface, that is perpendicular to the horizontal plane and is on the side away from the vehicle body, of the tire400.", "", "Exemplarily, in the examples shown inFIGS.1and2, the body10may be provided on the wheel rim200and the wheel spoke300together, that is, the body10covers the outer surface of the wheel rim200and the wheel spoke300. In other examples of the present application, the body10may also be separately provided on the wheel rim200or separately provided on the wheel spoke300.", "", "The protection portion20is connected to the body10, and at least part of the protection portion20shields the outer surface401of the tire400, to form a certain protection effect on the outer surface401of the tire400. It can be understood that at least part of the protection portion20may only cover a part of the outer surface of the tire400, or cover the entire outer surface401of the tire400, which will be not specifically limited in the embodiments of the present application.", "", "It should be noted that the protection portion20may be attached to the outer surface401of the tire400, or may be spaced from the outer surface401of the tire400.", "", "In order to avoid the deformation of the tire400due to changes in the tire pressure and the deformation of the protection portion20caused by the deformation of the tire400, preferably, the protection portion20is spaced from the outer surface401of the tire400, that is, there is a certain gap between the protection portion20and the outer surface401of the tire400. Therefore, it can prevent the protection portion20from deforming along with the tire400, thus improving the structural stability and reliability of the protection portion20.", "", "According to the insert100of the embodiments of the present application, the protection portion20is provided on the outer surface of the body10, and at least part of the protection portion20forms shielding against the outer surface401of the tire400, so as to reduce the probability of damage to the tire400when the vehicle wheel1is scratched, thereby forming a certain protection effect on the tire400, and improving the reliability of the vehicle wheel1and the driving safety of the vehicle. Furthermore, by extending at least part of the protection portion20to a position directly opposite to the tire400, the overall size of the insert100may be increased to a certain extent, thereby visually increasing the size of the vehicle wheel1and improving the aesthetic appearance of the vehicle wheel1. In addition, the insert100of the embodiments of the present application only needs to be installed on the wheel rim200and/or the wheel spoke300, such that the protection effect on the wheel rim200and/or the wheel spoke300as well as the tire400can be achieved, which has the advantages of simple structure and easy installation.", "", "In one implementation, the material of the body10is a hard material, and the material of the protection portion20is a soft material.", "", "Exemplarily, the material of the body10may be a plastic alloy, and the material of the protection portion20may be thermoplastic vulcanized rubber.", "", "Through the above implementation, the body10may have better hardness, thereby improving the structural strength of the body10, and the protection portion20may have stronger flexibility to improve the protection performance of the protection portion20on the vehicle wheel1. In addition, when the vehicle wheel1collides or scratches with the outside world, the protection portion20has certain elastic deformation ability, thereby ensuring that the protection portion20will not be damaged due to deformation.", "", "In one implementation, the body10and the protection portion20are formed as an integral part or are separated parts.", "", "Exemplarily, the body10and the protection portion20may be integrally formed through an injection molding process. For another example, the body10and the protection portion20may be separately molded by injection molding, and then the body10is connected to the protection portion20by means of gluing, clamping, or the like. Herein, the material of the body10may be same as or different from the material of the protection portion20.", "", "Preferably, the body10and the protection portion20are formed as an integral part, and the body10and the protection portion20are integrally processed and formed through a double-shot injection molding process.", "", "It can be understood that the double-shot injection molding process refers to a forming process of injecting two different materials into a same mold, to achieve that the injection-molded part is formed from two different materials. Herein, the two materials may be of different colors or have different soft and hard textures, thereby improving the aesthetics, assembly performance, etc., of the product.", "", "Through the above implementation, the processing difficulty of the insert100is reduced and the processing efficiency of the insert100is improved.", "", "As shown inFIGS.3to5, in one implementation, the protection portion20includes a first section20A and a second section20B that are connected. The first section20A is attached to the outer surface of the body10, and at least part of the second section20B covers the outer surface401of the tire400.", "", "Exemplarily, the first section20A and the second section20B are arranged along the radial direction of the wheel rim200, and the second section20B is connected to the side, away from the center of the vehicle wheel1, of the first section20A. Herein, the inner surface of the first section20A is attached to the outer surface of the body10. At least part of the second section20B is provided directly opposite to the outer surface401of the tire400, to shield the outer surface401of the tire400. More specifically, the second section20B may shield the wheel rim200and the outer surface401of the tire400together, or the second section20B only shields the outer surface401of the tire400.", "", "It should be noted that the first section20A and the second section20B may be formed as an integral part, or may be parts spaced from each other.", "", "In an example, the first section20A and the second section20B are processed through an integrated molding process. For example, the first section20A and the second section20B may be integrally formed through an injection molding process.", "", "In another example, the first section20A and the second section20B may be separately processed and formed, and then connected by means of gluing, clamping, or the like.", "", "According to the above implementation, providing the first section20A and the second section20B may not only provide a protection effect on the tire400to a certain extent, but also provide a protection effect on the outer surface of the body10to a certain extent, to avoid direct scratching between the outer surface of the body10and the outside world when the vehicle wheel1is scratched with the outside world, thereby improving the protection effect of the insert100.", "", "As shown inFIGS.2and3, in one implementation, an arc-shaped transition face202is formed between the inner circumference wall201of the wheel rim200and the outer surface of the wheel rim200. The body10or the protection portion20is provided with a support protrusion22, and the outer surface of the support protrusion22is constructed as an arc shape, such that the outer surface of the support protrusion22is attached to the transition face202.", "", "In an example, the support protrusion22is provided on the protection portion20, and the support protrusion22is formed by the outward protrusion of the inner surface of the second section20B. For example, the support protrusion22may be constructed as a shape of convex strip. Herein, the outer surface of the support protrusion22is attached to the wheel rim200, to provide a certain support effect on the wheel rim200.", "", "In another example, the support protrusion22may be provided on the body10, and the support protrusion22is formed by the outward protrusion of the inner surface of the body10.", "", "It should be noted that the shape of the outer surface of the support protrusion22may be provided according to the actual structure of the wheel rim200.", "", "Exemplarily, the structure of the wheel rim200may be a deep groove wheel rim200. Specifically, the wheel rim200is formed as an integral part, and a groove is formed in the middle of the cross section of the wheel rim200and is used for embedding and installing the tire400. Moreover, shoulders are formed on both sides of the cross section of the wheel rim200, and the shoulders tilt towards the middle at a small angle. And, the outer surfaces of the shoulders of the wheel rim200form a transition face202that connects the inner circumference wall201of the wheel rim200and the outer surface of the wheel rim200, and the transition face202is constructed as an arc shape.", "", "In order to increase the contact area between the outer surface of the support protrusion22and the transition face202of the wheel rim200, thereby improving the support effect of the support protrusion22on the wheel rim200, the outer surface of the wheel rim200is constructed as an arc-shaped face that is matched with the shape of the transition face202.", "", "In a specific example, as shown inFIG.2andFIG.5, the transition face202of the wheel rim200is constructed as a multi-segment arc-shaped face220. Correspondingly, the outer surface of the support protrusion22is also constructed as a shape matched multi-segment arc-shaped face220, and the multi-segment arc-shaped face220includes a first arc-shaped face221and a second arc-shaped face222that are connected.", "", "According to the above implementation, by providing the support protrusion22on the second section20B, the contact area between the second section20B and the wheel rim200may be increased, thereby improving the connection stability between the second section20B and the wheel rim200. Therefore, when the vehicle wheel1is scratched with the outside world, excessive stress concentration between the second section20B and the wheel rim200may be avoided, thereby improving the protection effect on the vehicle wheel1.", "", "As shown inFIGS.2to5, in one implementation, a groove is formed between the transition face202and the outer surface401of the tire400, a clamping protrusion223is formed on the outer surface of the support protrusion22, and the clamping protrusion223is clamped in the groove.", "", "According to the above implementation, by providing the clamping protrusion223on the support protrusion22, a certain filling effect may be formed on the groove between the transition face202and the outer surface401of the tire400, thereby providing a certain support effect on the tire400, reducing the deformation of the tire400relative to the wheel rim200, and improving the durability and reliability of the tire400.", "", "As shown inFIGS.3and8, in one implementation, there are multiple support protrusions22, and the multiple support protrusions22are spaced along the circumference direction of the wheel rim200.", "", "Exemplarily, the width direction of the second section20B may be arranged along the circumference direction of the wheel rim200, and the multiple support protrusions22are spaced in the width direction of the second section20B. Herein, the shapes of the respective support protrusions22may be same or different, and the sizes of the support protrusions22in the width direction of the second section20B may also be same or different. Further, a first groove22ais provided between two adjacent support protrusions22, and the first groove22ais formed by sinking of the inner surface of the second section20B.", "", "According to the above implementation, by providing the spaced multiple support protrusions22, the material cost of the protection portion20is reduced, and it is beneficial to reduce the weight of the protection portion20, thereby reducing the weight of the insert100as a whole, and meeting the requirement of lightweight of the insert.", "", "In one implementation, the body10is installed on the wheel spoke300. Herein, the body10is connected to the wheel spoke300through a fastener16; and/or, a contact face of the body10and a contact face of the wheel spoke300are connected by adhesive.", "", "In an example, as shown inFIGS.5and6, the inner surface of the body10is provided with multiple fixing holes15, and the multiple fixing holes15are respectively provided adjacent to the outer edge13of the body10. The fastener16passes through the wheel spoke300and is securely connected to the fixing hole15, to achieve the fixation of the body10on the wheel spoke300. Herein, the fixing hole15may specifically be a screw hole, and the fastener16may specifically be a screw.", "", "In another example, the contact face of the body10and the contact face of the wheel spoke300may also be connected by adhesive. Specifically, the contact face of the body10and the contact face of the wheel spoke300may be connected by3M adhesive, to achieve the fixation of the body10on the wheel spoke300.", "", "In other examples of the present application, the inner surface of the body10may also be provided with a jack catch (not shown in the figure). Herein, there may be multiple jack catches and the multiple jack catches may be respectively provided on two side edges in the width direction of the body10. Herein, the jack catches may be clamped to two wheel spokes300corresponding to the two side edges of the body10through elastic deformation, to achieve the fixed connection of the body10on the wheel spokes300.", "", "As shown inFIGS.3and6, in one implementation, the inner surface of the body10is provided with a reinforcing rib14.", "", "Exemplarily, the body10has an inner edge12and an outer edge13, the inner surface of the body10is provided with the reinforcing rib14, and the reinforcing rib14is connected between the inner edge12and the outer edge13of the body10. Specifically, the inner edge12of the body10defines a first through hole11, and the reinforcing rib14is formed by the protrusion of the inner surface of the body10along the direction towards the vehicle wheel1. The shape of the reinforcing rib14is strip-shaped, and the length direction of the reinforcing rib14is arranged along the width direction of the body10. There are multiple reinforcing ribs14, and the multiple reinforcing ribs14are spaced in the length direction of the body10. A second groove14ais formed between two adjacent reinforcing ribs14.", "", "It should be noted that in other examples of the present application, the shape of the reinforcing rib14may also be a broken line shape or an arc shape. The embodiments of the present application do not specifically limit the shape of the reinforcing rib14.", "", "According to the above implementation, by providing the reinforcing rib14on the body10, on the one hand, the structural strength of the body10may be improved, thereby improving the structural reliability of the body10; on the other hand, the material of the body10is reduced, thereby reducing the material cost of the insert100and being beneficial to reduce the overall weight of the insert100.", "", "As the second aspect of the embodiments of the present application, an embodiment of the present application also provides a protection device1A, which includes the insert100of the above embodiment of the present application, and there is at least one insert100.", "", "The first embodiment of the protection device1A is described below with reference toFIGS.1to9.", "", "In the first embodiment, there are multiple inserts100and the multiple inserts100are spaced in the circumference direction of the vehicle wheel1. The multiple inserts100have the same shape and size.", "", "In one implementation, the protection device1A includes multiple first inserts100A, and the multiple first inserts100A have the same shape and size. It can be understood that the first insert100A may adopt the same or similar structure as the insert100in any one of the above implementations.", "", "As shown inFIG.1, the wheel spoke300may include 5 spoke plates302, to form 5 window regions301on the vehicle wheel1. Correspondingly, there are 5 first inserts100A, and the body10of each first insert100A covers the corresponding window region301. Herein, the body10of each first insert100A is respectively installed on two spoke plates302of the window region301corresponding to the body.", "", "According to the above implementation, by providing the multiple first inserts100A, the comprehensive protection of the wheel rim200and wheel spoke300may be achieved, and the shielding area of the tire400may be increased, thereby further improving the protection effect on the tire400.", "", "As shown inFIGS.8and9, in one implementation, the protection portion20of the first insert100A is provided with a first position-limit lug boss21. The first position-limit lug boss21is formed by the junction between the first section20A and the second section20B protruding in the direction towards the body10of the first insert100A, and the inner surface of the first position-limit lug boss21is in a position-limit fit with the outer edge13of the body10of the first insert100A.", "", "Herein, the inner surface of the first position-limit lug boss21refers to the surface on the side, adjacent to the center of the vehicle wheel1, of the first position-limit lug boss21.", "", "Exemplarily, the shape of the first position-limit lug boss21may be constructed as a strip shape. The first position-limit lug boss21may be provided on the first section20A, and the first position-limit lug boss21is formed by the edge, adjacent to second section20B, of the first section20A protruding in the direction towards the vehicle wheel1. Or, the first position-limit lug boss21may be provided on the second section20B, and the first position-limit lug boss21is formed by the edge, adjacent to the first section20A, of the second section20B protruding in the direction towards the vehicle wheel1. Or, the first position-limit lug boss21is jointly formed by the first section20A and the second section20B, and the first section20A and the second section20B are formed as an integral part.", "", "Further, the first position-limit protrusion is constructed as an arc shape that is matched with the inner circumference wall201of the wheel rim200, such that the outer surface of the first position-limit protrusion is attached to the inner circumference wall201of the wheel rim200, and the inner surface of the first position-limit protrusion is attached to the edge of the body10.", "", "According to the above implementation, by providing the first position-limit lug boss21on the protection portion20, the position-limit fit may be formed between the body10and the protection portion20, thereby improving the connection strength between the body10and the protection portion20, and thus improving the overall structural stability of the first insert100A.", "", "As shown inFIGS.5and6, in one implementation, the outer edge13of the body10is provided with a second position-limit lug boss17protruding in the direction towards the wheel rim200or wheel spoke300, and the outer surface of the second position-limit lug boss17is in position-limit fit the inner circumference wall201of the wheel rim200.", "", "Herein, the inner surface of the second position-limit lug boss17refers to the surface on the side, away from the center of the vehicle wheel1, of the second position-limit lug boss17.", "", "Exemplarily, the second position-limit lug boss17is provided on the edge on the side, away from the center of the vehicle wheel1, of the body10; and the second position-limit lug boss17is formed by the inner surface of the body10protruding in the direction towards the wheel rim200or wheel spoke300. Moreover, the second position-limit protrusion is constructed as an arc shape that is matched with the inner circumference wall201of the wheel rim200, such that the outer surface of the second position-limit protrusion is attached to the inner circumference wall201of the wheel rim200.", "", "Further, as shown inFIG.5, the height of the second position-limit protrusion may be greater than the height of the first position-limit protrusion, such that a part of the outer surface of the second position-limit protrusion is attached to the inner surface of the first position-limit protrusion, and another part of the outer surface of the second position-limit protrusion is attached to the inner circumference wall201of the wheel rim200.", "", "According to the above implementation, by providing the second position-limit lug boss17on the outer edge13of the body10, a certain position-limit fit may be formed between the body10and the inner circumference wall201of the wheel rim200, thereby improving the assembly effect of the body10and the wheel rim200.", "", "The second embodiment of the protection device1A is described below with reference toFIGS.10to12.", "", "In the second embodiment, there are multiple inserts100, and the multiple inserts100are spaced in the circumference direction of the vehicle wheel1. Herein, any two adjacent inserts100have different shapes and/or sizes.", "", "In one implementation, the protection device1A includes multiple second inserts100B and multiple third inserts100C. The shapes and sizes of the second inserts100B are different from the shapes and sizes of the third inserts100C. The multiple second inserts100B and the multiple third inserts100C are alternately spaced in the circumference direction of the vehicle wheel1. It can be understood that the second inserts100B or the third inserts100C may adopt the same or similar structure as the insert100in any one of the above implementations.", "", "As shown inFIG.12, in one implementation, the wheel spoke300includes multiple spoke plates302and multiple spoke strips303, and the multiple spoke plates302and the multiple spoke strips303are alternately arranged in the circumference direction of the vehicle wheel. Each spoke strip303is centered between two adjacent spoke plates302corresponding to the spoke strip303. The protection portion20of the second insert100B shields the outer surface of the wheel spoke300and the outer surface of the tire400together. The protection portion20is provided with spoke strip position-limit grooves24corresponding to the positions of the spoke strips303. The spoke strip position-limit grooves24are used to clamp the spoke strips303, such that the position-limit fit is formed between the protection portion20and the spoke strips303. Thereby, the fit effect between the protection portion20and the wheel spoke300is improved.", "", "Further, the wheel spoke300includes spoke plates302and spoke strips303. The multiple spoke plates302and spoke strips303are alternately arranged at intervals. Herein, each of multiple second inserts100B is provided between two adjacent spoke plates302, and multiple third inserts100C is provided on the spoke plates302respectively.", "", "Therefore, the distributions of the multiple second inserts100B and the multiple third inserts100C on the vehicle wheel1are relatively reasonable, and both the second inserts100B and the third inserts100C extend to the position of the tire400in the radial direction of the vehicle wheel1, which may significantly increase the size of the wheel spoke300visually, thereby further improving the aesthetic appearance of the vehicle wheel1.", "", "As shown inFIG.10, in one implementation, the body10of the second insert100B includes a first body branch18and a second body branch19. The first body branch18and the second body branch19are spaced in the circumference direction of the vehicle wheel1.", "", "Exemplarily, the first body branch18and the second body branch19are spaced in the circumference direction of the vehicle wheel1. Herein, one end of the first body branch18and one end of the second body branch19are respectively provided on the wheel rim200or the wheel spoke300of the vehicle wheel1, and the other end of the first body branch18and the other end of the second body branch19are respectively connected to the protection portion20.", "", "Exemplarily, the protection portion20may be constructed as a fan-ring shape, and the protection portion20is provided directly opposite to the outer surface401of the tire400, to form shielding against the outer surface of the tire400. The protection portion20, the first body branch18, and the second body branch19jointly defines a hollow stream guidance region101. In addition, the outer surface of the protection portion20may be provided with a stream guidance face102, and the stream guidance face102tilts inward in the direction towards the center of the vehicle wheel1.", "", "In a specific example, one end of the first body branch18and one end of the second body branch19are respectively provided with a fixing hole15, which is used to fit with the fastener16respectively, to fix the first body branch18and the second body branch19to the wheel rim200or wheel spoke300of the vehicle wheel1, respectively.", "", "In one implementation, the first body branch18and the second body branch19are respectively provided on two adjacent spoke plates302of the wheel spoke300.", "", "Exemplarily, as shown inFIG.12, the second insert100B may be provided in the window region301between two adjacent spoke plates302, and the first body branch18and the second body branch19are fixed to the two adjacent spoke plates302, respectively.", "", "Therefore, the aesthetic appearance of the second insert100B installed on the vehicle wheel may be improved, and the installation is also relatively simple.", "", "In one implementation, the first body branch18and the second body branch19tilt and extend outward in the direction away from the center of the vehicle wheel1.", "", "Exemplarily, parts of the first body branch18and the second body branch19are bent in the outside direction away from the wheel spoke, respectively, such that the protection portion20, that is connected to the other end of the first body branch18and the other end of the second body branch19, is located on the outside of the tire400, thereby avoiding interference between the protection portion20and the tire400, and enabling the protection portion20to shield the outer surface of the tire400.", "", "In one implementation, the length size and width size of the third insert100C are smaller than the length size and width size of the second insert100C. Herein, there are multiple third inserts100C and multiple second insert100B, and the multiple third inserts100C and the multiple second insert100B are arranged alternately in the circumference direction of the vehicle wheel1.", "", "Herein, the length sizes of the second insert100B and the third insert100C refer to the sizes of the second insert100B and the third insert100C in the radial direction of the vehicle wheel1, and the width sizes of the second insert100B and the third insert100C refer to the sizes of the second insert100B and the third insert100C in the circumferential direction of the vehicle wheel1.", "", "Exemplarily, a part of the body10of the third insert100C covers the spoke plate302, and at least part of the protection portion20of the third insert100C shields the outer surface of the tire400. The shape and size of the body10of the third insert100C may be provided with reference to the shape and size of the spoke plate302.", "", "The third embodiment of the protection device1A is described below.", "", "In the third embodiment, there are multiple inserts100and the multiple inserts100are spaced in the circumference direction of the vehicle wheel1. Herein, the multiple inserts100are connected to each other and processed through an integrated molding process.", "", "In an example, on the basis of the above first embodiment, the multiple inserts100are connected to each other and processed through the integrated molding process.", "", "Specifically, the protection device1A includes multiple first inserts100A. The multiple first inserts100A have the same shape and size, and are spaced in the circumference direction of the vehicle wheel1. Herein, the bodies10of any two adjacent first inserts100A are connected to each other, to enable the multiple first inserts100A to form a ring-shape whole. Moreover, the multiple first inserts100A may be integrally processed and formed through an injection molding process. Herein, the first insert100A may adopt a structure that is same as or similar to the first insert100A in the above first embodiment, which will not be repeated here.", "", "In another example, on the basis of the second embodiment, the multiple inserts100are connected to each other and processed through the integrated molding process.", "", "Specifically, multiple inserts100include multiple second inserts100B and multiple third inserts100C. The shape and size of the second inserts100B all are different from the shape and size of the third inserts100C, and the multiple second inserts100B and the multiple third inserts100C are alternately spaced in the circumference direction of the vehicle wheel1. Herein, the bodies10of any adjacent second insert100B and third insert100C are connected to each other, such that the multiple second inserts100B and the multiple third inserts100C form a ring-shape whole. Moreover, the multiple second inserts100B and the multiple third inserts100C may be integrally processed and formed through an injection molding process. Herein, the second insert100B may adopt a structure that is same as or similar to the second insert100B in the above second embodiment, and the third insert100C may adopt a structure that is same as or similar to the third insert100C in the above second embodiment, which will not be repeated here.", "", "Through the above implementation, multiple inserts100may form an interconnected overall structure, thereby simplifying the installation process of the protection device1A on the wheel spoke or the wheel rim, and improving the stability and reliability of the overall structure of the protection device1A.", "", "As the third aspect of the embodiment of the present application, the embodiment of the present application also provides a vehicle wheel1.", "", "As shown inFIG.1, the vehicle wheel1includes a wheel rim200, a wheel spoke300, a tire400, and the protection device1A according to the above embodiment of the present application.", "", "Specifically, the tire400is sleeved on the outer circumference wall of the wheel rim200, and the wheel spoke300is connected between the inner circumference wall201of the wheel rim200and the wheel hub500. The insert100of the protection device1A may be separately provided on the wheel rim200, or separately provided on the wheel spoke300, or provided on both the wheel rim200and the wheel spoke300.", "", "Exemplarily, a hollow window region301is formed between the inner circumference wall201of the wheel rim200and any two adjacent wheel spokes300. The insert100is installed on the wheel spokes300, and the body10of the insert100covers the window region301. Herein, at least part of the protection portion20of the insert100covers the outer surface401of the tire400.", "", "For the vehicle wheel1according to the embodiment of the present application, by using the protection device1A according to the above embodiment of the present application, when the vehicle wheel1is scratched, the probability of the tire400being damaged may be reduced, thereby forming a certain protection effect on the tire400, and improving the reliability of the vehicle wheel1and the driving safety of the vehicle. Furthermore, by extending at least part of the protection portion20to a position directly opposite to the tire400, the overall size of the insert100may be increased to a certain extent, thereby increasing the size of the vehicle wheel1visually and improving the aesthetic appearance of the vehicle wheel1.", "", "As shown inFIG.1, in one implementation, the wheel spoke300includes multiple spoke plates303, and a window region301is defined between the wheel rim200and any two adjacent spoke plates303.", "", "It can be understood that in the vehicle wheel1, two ends of the wheel spoke300are respectively connected to the inner circumference wall201of the wheel rim200and the wheel hub500located in the center of the wheel rim200, and the hollow window region301is formed between two adjacent wheel spokes300and the inner circumference wall201of the wheel rim200. Therefore, on the one hand, the weight of the vehicle wheel1may be reduced, and on the other hand, it is beneficial for lateral airflow to flow through the window region301, thereby reducing the wind obstruction of the lateral airflow on the vehicle wheel1.", "", "Exemplarily, the insert100may be provided on the wheel rim200and two adjacent wheel spokes300together, and the body10covers the window region301between the two adjacent wheel spokes300, and a part of the protection portion20extends to a position directly opposite to the outer surface of the wheel, such that the protection portion20forms the shielding against the outer surface401of the tire400.", "", "Therefore, by means of covering the window region301by the body10, the insert100may be roughly located in the window region301. Therefore, the diameter size of the wheel rim200may be increased from a visual perspective, thereby further improving the aesthetic appearance of the vehicle wheel1.", "", "As shown inFIGS.1,3, and4, in order to reduce the obstruction effect, formed by the insert100, on the lateral airflow flowing through the window region301, in one implementation, the body10and/or the protection portion20are defined with a stream guidance region101. The stream guidance region101runs through the insert100in the thickness direction of the insert100, such that the stream guidance region101is in communication with the window region301covered by the insert100.", "", "In an example, as shown inFIGS.6and7, the stream guidance region101may be constructed as a closed-ring structure, that is, the structure of the body10is constructed to be approximately a ring shape. Specifically, the central region of the body10is provided with a first through hole11. The first through hole11is provided to run through the body10in the thickness direction of the body10. As shown inFIGS.8and9, the protection portion20is provided with a second through hole23, and the second through hole23is provided to run through the protection portion20in the thickness direction of the protection portion20. More specifically, the second through hole23is provided on the first section20A of the protection portion20, and the second through hole23is provided directly opposite to the first through hole11, such that the first through hole11and the second through hole23jointly form the stream guidance region101of the insert100.", "", "In another example, as shown inFIG.10, the stream guidance region101may also be constructed as an open structure, that is, the body10is in a semi closed structure, to define the stream guidance region101with an opening.", "", "According to the above implementation, by providing the stream guidance region101on the insert100, and the stream guidance region101being in communication with the window region301of the vehicle wheel1, the lateral airflow flowing through the vehicle wheel1may flow through the stream guidance region101and the window region301, thereby ensuring the stream guiding effect of the vehicle wheel1on the lateral airflow and achieving the purpose of reducing the wind obstruction of the vehicle wheel1.", "", "In one implementation, as shown inFIG.4, at least part of the circumference wall of the stream guidance region101tilts in the direction towards the center of the stream guidance region101, to form a stream guidance face102.", "", "In other words, the circumference wall of the stream guidance region101tilts and extends along the direction towards the center of the stream guidance region101in the direction towards the vehicle wheel1, such that the circumference wall of the stream guidance region101forms the stream guidance face102, thereby forming a certain stream guiding effect on the lateral airflow.", "", "Therefore, the stream guiding effect on the lateral airflow flowing towards the vehicle wheel1may be improved, thereby reducing the wind obstruction of the lateral airflow on the vehicle wheel1and improving the driving stability and safety of the vehicle.", "", "As shown inFIGS.3and4, optionally, a part of the circumference wall of the stream guidance region101protrudes in a direction towards the center of the stream guidance region101, to form a stream-guide protrusion103. Herein, the outer surface of the stream-guide protrusion103tilts in the direction towards the vehicle wheel1, in the direction towards the center of the central through hole, to form a part of the stream guidance face102.", "", "In a specific example, the cross-sectional shape of the stream-guide protrusion103is approximately triangular, such that the cross-sectional shape of the stream guidance region101takes on a “heart” shape. Therefore, the aesthetic appearance of the insert100is improved.", "", "As the fourth aspect of the embodiment of the present application, the embodiment of the present application provides a vehicle including the vehicle wheel1of the above embodiment of the present application.", "", "The other components of the vehicle in the above embodiment may be employed in various technical solutions known to those skilled in the art now and in the future, and which will not be described in detail here.", "", "In the description of this specification, it is necessary to understand that, the orientation or position relationship indicated by the terms “center,” “longitudinal,” “transverse,” “length,” “width,” “thickness,” “up,” “down,” “front,” “back,” “left,” “right,” “vertical,” “horizontal,” “top,” “bottom,” “inside,” “outside,” “clockwise,” “anticlockwise,” “axial,” “radial,” “circumferential,” etc., is based on the orientation or position relationship shown in the drawings and is only for the convenience of describing the present application and simplifying the description, rather than indicating or implying that the referred apparatus or elements must have a specific orientation, be constructed and operated in a specific orientation, and therefore cannot be understood as a limitation of the present application.", "", "Additionally, the terms “first” and “second” are used for descriptive purposes only and are not to be construed as indicating or implying relative importance or implicitly indicating the number of indicated technical features. Thus, features defining “first” and “second” may explicitly or implicitly include one or more of the features. In the description of the present application, “multiple” means two or more, unless expressly limited otherwise.", "", "In the present application, unless otherwise explicitly specified and defined, the terms “installation,” “joint,” “connection,” “fixation” and other terms shall be understood in a broad sense; they may be, for example a fixed connection, a detachable connection, or a whole body; they may also be a mechanical connection, an electrical connection, or a communication; they may also be direct connection, or indirect connection through an intermediate media; they may be the internal communication of two elements or the interaction relationship between two elements. Those skilled in the art may understand the specific meaning of the above terms in the present application according to the specific circumstances.", "", "In the present application, unless otherwise explicitly specified and defined, the first feature “above” or “below” of the second feature may include direct contact between the first and second features, or may include contact between the first and second features, not directly, but through another feature between them. Moreover, the first feature “over,” “above,” and “on” the second feature includes the first feature directly above and obliquely above the second feature, or simply indicates that the first feature is higher in horizontal height than the second feature. The first feature “under,” “below,” and “underneath” the second feature includes the first feature directly below and obliquely below the second feature, or simply indicates that the first feature is lower in horizontal height than the second feature.", "", "The above disclosure provides many different implementations or examples for implementing different structures of the present application. In order to simplify the disclosure of the present application, the components and settings in specific examples are described above. Of course, they are only examples and are not intended to limit the present application. In addition, the present application may repeat reference numbers and/or reference letters in different examples; the repetition is for the purpose of simplification and clarity, and does not in itself indicate the relationship between the various implementations and/or settings discussed.", "", "The above description is only a specific implementation of the present application, but the protection scope of the present application is not limited thereto. Various alteration or replacement that may be easily conceived by any those skilled in the art within the technical scope disclosed by the present application shall fall within the protection scope of the present application. Therefore, the protection scope of the present application shall be subject to the protection scope of the claims."], "claims": ["a body, provided on the wheel rim and/or the wheel spoke; and a protection portion, provided on the body, wherein at least part of the protection portion shields an outer surface of the tire.", "2 . The insert of claim 1 , wherein a material of the body is a hard material and a material of the protection portion is a soft material.", "3 . The insert of claim 2 , wherein the body and the protection portion are integrally processed and formed through a double-shot injection molding process.", "4 . The insert of claim 1 , wherein an arc-shaped transition face is formed between an inner circumference wall of the wheel rim and an outer surface of the wheel rim, the body or the protection portion is provided with a support protrusion, and an outer surface of the support protrusion is constructed as an arc shape, such that the outer surface of the support protrusion is attached to the transition face.", "5 . The insert of claim 4 , wherein a groove is formed between the transition face and the outer surface of the tire, a clamping protrusion is formed on the outer surface of the support protrusion, and the clamping protrusion is clamped in the groove.", "6 . The insert of claim 4 , wherein there are a plurality of support protrusions and the plurality of support protrusions are spaced along a circumference direction of the wheel rim.", "7 . The insert of claim 1 , wherein the protection portion comprises a first section and a second section that are connected, wherein the first section covers an outer surface of the body, and at least part of the second section shields the outer surface of the tire.", "8 . The insert of claim 1 , wherein the body is installed on the wheel spoke, wherein the body is connected to the wheel spoke through a fastener; and/or, a contact face of the body and a contact face of the wheel spoke are connected by adhesive.", "9 . The insert of claim 1 , wherein an inner surface of the body is provided with a reinforcing rib.", "10 . A protection device, comprising at least one insert of claim 1 .", "11 . The protection device of claim 10 , wherein there are a plurality of inserts and the plurality of inserts are spaced in a circumference direction of a vehicle wheel.", "12 . The protection device of claim 11 , wherein the plurality of inserts have a same shape and size.", "13 . The protection device of claim 11 , wherein any two adjacent inserts have different shapes and/or sizes.", "14 . The protection device of claim 11 , wherein the plurality of inserts are connected to each other and processed through an integrated molding process.", "a wheel rim, a wheel spoke, and a tire, wherein the tire is sleeved on an outer circumference wall of the wheel rim; and the protection device of", "16 . The vehicle wheel of claim 15 , wherein the wheel spoke comprises a plurality of spoke plates, a window region is defined between the wheel rim and any two adjacent spoke plates, a body and/or a protection portion are defined with a stream guidance region, and the stream guidance region runs through an insert in a thickness direction of the insert, such that the stream guidance region is in communication with the window region.", "17 . The vehicle wheel of claim 16 , wherein at least part of a circumference wall of the stream guidance region tilts in a direction towards a center of the stream guidance region, to form a stream guidance face.", "18 . A vehicle, comprising the vehicle wheel of claim 15 .", "19 . A vehicle, comprising the vehicle wheel of claim 16 .", "20 . A vehicle, comprising the vehicle wheel of claim 17 ."], "bibtex": "@patent{20240051334,\n    title = {INSERT, PROTECTION DEVICE, WHEEL AND VEHCILE},\n    number = {20240051334},\n    year = {2024},\n    note = {File: US20240051334A1-20240215.XML}\n    }", "classification": "B60B706FI"}, {"title": "IMPROVEMENTS TO FASTENING ELEMENTS OF AN EXPANDABLE AUTOMOTIVE SPARE WHEEL", "doc_number": "20240051335", "filename": "US20240051335A1-20240215.XML", "abstract": "This invention refers to an improved automotive auxiliary wheel of practical installation that does not require a mechanical jack or an additional tool to raise the car, that makes possible for the car to keep moving without having to dismount the damaged tire. It is installed on the damaged wheel by means of a female grooved hub of narrower diameter that is affixed by coupling it to a shorter male grooved hub that has a concentric inner thread placed in the car's wheel and attached with a central hexagonal screw with the help of a tightening handle. The car is moved by half a meter, and the auxiliary wheel is expanded with the lever tool with octagonal die, and the car can keep moving at low speed until it reaches a mechanical service facility. The object of this invention is to improve the expansible auxiliary wheel by making it more practical and faster to install without much effort, to solve the issue of a flat tire in short time.", "detailed_description": ["FIG.1illustrates the expansible auxiliary wheel, which consists of a semicircular plate (1) with a semicircular arm (5) that expands or contracts for the installation thereof. This is made possible by a contraction spring (6) that has a point of support. The spring is coupled to a first fastening method (19) and is coupled in the other end to the semicircular arm (5). This semicircular arm is supported by a fastening bolt (18) that works as an axis and is placed close to the metallic hoop (9).", "", "The auxiliary wheel is expanded when the hub is turned counter-clockwise. This hub consists of a cam hub (3) that has a cam-shaped welded lever (4). The semicircular arm is pushed (5) and a circumference is formed.", "", "The semicircular arm (5) has in its right end a bolt (10) that moves in the rim through a slot (22) that works as a guide. It is also fitted with a cam lock (17) to prevent it from contracting when the auxiliary wheel is receiving the load of the car.", "", "Its perimeter is fitted with a metallic hoop (9) that fastens a rubber belt (2) to have traction and absorb the vibrations from the floor. The metallic hoop (9) and the rubber belt (2) consist of 2 parts; one is the rim and other is the semicircular arm (5), the metallic hoop and the rubber belt are fastened with each other by 8 anchor-shaped screws (29) and nuts (30). In its central portion there is a female grooved hub (7) of reduced diameter for the affixing thereof; this is coupled with the male grooved hub that has a concentric inner thread (11) in the car's wheel and that it is locked with a central hexagonal screw (15) with the help of the tightening handle (16).", "", "FIG.2) illustrates the contraction of the auxiliary wheel for the installation thereof. The cam hub (3) is in the opposite state without exerting pressure on the arm (5) contracted by the contraction spring (6). To contract the wheel the cam lock (17) is pressed to deactivate the wheel, and the cam hub (3) with cam (4) is turned clockwise until its limit (25) to contract the auxiliary wheel.", "", "FIG.3) illustrates a cross section of the position of the installed and locked expansible auxiliary wheel. Here, the installation thereof over the car's tire can be observed, mounted in the hub with the male grooved hub with inner thread (11) and tightened with a central hexagonal screw (15) helped by the tightening handle (16).", "", "FIG.4) illustrates the male grooved hub of reduced diameter with inner thread (11).", "", "FIG.5) illustrates the central hexagonal screw (15) and the male grooved hub of reduced diameter with inner thread (11) that the car must have fitted in each of its wheels.", "", "FIG.6) illustrates the anchor-shaped screw (29) with nut (30).", "", "FIG.7) illustrates the handle that uses side A to tighten the central hexagonal screw and side B to activate the expansible auxiliary wheel.", "", "FIG.8illustrates the triangular stop (28).", "", "This expansible auxiliary wheel is tailor made to the conditions of the car and the diameter as per the car's manufacturer.", "", "Its effectiveness lies in its use for short, low speed routes. It is a practical solution for the problem posed by a deflated or destroyed tire, to keep moving towards the destination.", "", "This expansible auxiliary wheel does not take more space in the trunk than a conventional auxiliary wheel would."], "claims": ["a semicircular plate (", "2 . The expansible auxiliary wheel in accordance with claim 1 , characterized by said semicircular plate having reinforcements ( 8 ) in the shape of triangular ribbing placed equidistantly throughout the inner periphery of said semicircular plate and that extends towards the center thereof.", "3 . The expansible auxiliary wheel in accordance with claim 1 , characterized by the semicircular plate ( 1 ) and the semicircular arm ( 5 ) being made from metal.", "4 . The expansible auxiliary wheel in accordance with claim 1 , characterized by having an octagonal predefined shape for the cam hub.", "5 . The expansible auxiliary wheel in accordance with claim 1 , characterized by a triangular stop ( 28 ) that prevents the car from moving, and that is placed at a distance between 50 and 100 cm before turning the cam hub ( 3 ) that pushes the semicircular arm ( 5 ) outwards, going from the resting to the working state."], "bibtex": "@patent{20240051335,\n    title = {IMPROVEMENTS TO FASTENING ELEMENTS OF AN EXPANDABLE AUTOMOTIVE SPARE WHEEL},\n    number = {20240051335},\n    year = {2024},\n    note = {File: US20240051335A1-20240215.XML}\n    }", "classification": "B60B1110FI"}, {"title": "HEAT SHIELD PANEL", "doc_number": "20240051336", "filename": "US20240051336A1-20240215.XML", "abstract": "A heat shield panel comprising an inner heat shield layer and an outer heat shield layer, the inner heat shield layer and the outer heat shield layer each having two outer edges wherein the outer edges of the inner heat shield layer and the outer edges of the inner heat shield layer are substantially aligned and are affixed to each other to form heat shield panel edges, and wherein the inner heat shield layer is formed of two or more segments each having an inner edge, the inner edges of the segments being arranged to move relative to each other.", "detailed_description": ["FIG.1shows a section of a typical wheel assembly comprising a wheel rim or tube well1having an outer diameter surface10, on which a tire (not shown) will usually be mounted, and an inner diameter surface20defining an interior cavity in which a brake assembly (not shown) will typically be arranged around a wheel hub30. The hub30would be attached by bearing to an axle (not shown). The hub30is connected to the wheel rim1via a web40. Rotor disc drive lugs (or torque bars)50extend axially across the tube well1for engagement with the brake discs.", "", "To protect the wheel rim1from the heat generated during hard braking or from brake disc material ejected during braking, a heat shield is mounted to the inner diameter surface20of the wheel. The heat shield may be a single tubular shield or, as shown in this example, may be formed of several heat shield panels60provided between the rotor drive lugs50. The heat shield/panels60is in the form of several thin metal sheets or layers sandwiched together, including an inner layer601and an outer layer602, and possible one or more intermediate layers603, and with insulation gaps G therebetween, as seen inFIG.4, and is attached to the wheel so as to be spaced apart from the wheel inner diameter surface20by a small insulation gap (not shown). Here, the term ‘inner layer’ is used for the layer of the heat shield panel closest to the tube well and ‘outer layer’ is the layer of the heat shield panel furthest from the tube well. Where the heat shield is made of a number of panels or segments attached together, the adjoining edges60a,60bof the panels are connected by means of connectors70. The connectors70each define a seam between adjacent panels.", "", "A typical connector70is shown inFIG.3. Such a connector70is formed to attach to adjacent edges60a,60bof adjacent panels to, in use, define the seam between two adjacent heat shield panels. In the example shown, the connector70comprises two interlocking hook parts70a,70bwhich are affixed, at one end701, to the edge of a respective heat shield panel and form a hook shape702at the opposite end. To connect the two adjacent panels, the respective hook shapes interlock. The end of the connector parts may be affixed to the respective edge of the in various ways provided a secure attachment to the panel is provided. In the example shown, the connector part is affixed to the panel edge by seam welding, but it may be envisaged that other forms of adhesion or fixation, e.g. using fixation elements, may be used. Instead of the hook shapes, other interlocking shapes or features may be used, provided the connector secures the two adjacent panels, at the seam, to each other. The example inFIG.3shows two connectors70provided between a pair of adjacent panels60, but it is also possible for there to be only a single connector or more than two connectors. As mentioned above, each panel60is formed of multiple layers601,602,603(best seen inFIG.4) and these layers will be secured to each other at the edge of the panel to ensure the entire panel is secured by the connector(s). This means that the connector(s) will be affixed to all of the layers (three layers are shown in the examples, but other numbers of layers are possible) and so the layers of a panel60will not be able to move or shift relative to each other.", "", "As mentioned above, in the harsh braking conditions experienced by e.g. wheels on an aircraft landing gear, high temperatures are reached and pieces of hot material can break off from the rotor discs. Thus, in use, the wheel assembly becomes hot and the purpose of the heat shield is to manage the heat generated in the wheel assembly. Accordingly, the heat shield materials also experience high temperatures. The temperature at the inner surface of the heat shield is higher than that at the outer surface which means that the inner layer601of the panels will become hotter than the outer layer602. Consequently, the inner layer will undergo greater thermal expansion than the outer layer. Because, as mentioned above, these layers are fixed relative to each other at the seams, the greater deformation of the inner layer relative to the outer layer causes the heat shield panel60to deform as can be seen inFIG.5where the inner layer601becomes arched or buckles. This can cause the heat shield to be damaged and/or to contact the wall of the tube well1by being deflected into the insulation gap between the heat shield and the tube well interior surface. Because the retainer is made of relatively thin, light material, deformation of the panels can cause the retainer to deflect outwards and contact the wheel rim and this can result in damage and wheel abrasion. Also, if the retainers are not sufficiently strong to retain the heat shield panels in such conditions, the heat shield panels themselves can also contact the wheel. This can cause wheel abrasion and/or heat shield damage/abrasion and require the entire wheel assembly to be replaced.", "", "The aim of the present disclosure is to provide a heat shield panel design having multiple layers, which allows for the different thermal expansion of the layers, whilst they are still connected at their edges, without resulting in deformation of the panel/inner layer.", "", "This is achieved by forming the inner layer601of the heat shield panel as a segmented layer, as seen inFIG.7—i.e. being formed of two or more layer segments601a,601bwith a separation or break601ctherebetween, such that the layer segments are able to move relative to each other in the area of the separation although they are still connected at the panel edges to the outer layer(s).", "", "An example of a heat shield panel with such a segmented inner layer can be seen inFIG.7.", "", "As can be seen, the inner layer601is formed as two layer segments that are separated at their inner edges611a,611b. In the example shown, the inner edges are at the ends of respective inner portions which, in the default state of the heat shield, overlap. The outer edges621a,621bof the layer segments substantially align with the outer edges of the other layer(s)602,603of the panel to define the edges60a,60b, shown inFIG.6, of the panel. By forming the inner layer of two or more layer segments, each layer segment can expand, due to the effects of heat, separately (in the example shown, increasing or reducing the degree of overlap at the inner ends611a,611b) thus reducing the deformation of the inner layer. The result can be seen inFIG.8where the panel stays relatively flat even when subjected to high temperatures.", "", "The panel can be formed with the inner layer segments having their inner edges free and not connected, and the tension under which the heat shield is mounted in the wheel assembly has been found to be sufficient to keep the inner layer such that its inner edges overlap without the need for any physical retaining means. In other examples, though, it may be desirable to provide some form of attachment or barrier at the inner edges which still allows relative movement of the edges and, thus, the segments, but present a barrier to any dust e.g. carbon dust from the brake components, or other contamination, passing through the break. Carbon dust can, for example, increase the heat conductivity of the heat shields which can then result in even higher temperatures at the wheel. Some examples of such attachment are shown inFIGS.9A and9B. In the example inFIG.9A, an additional plate620may be attached e.g. by a spot weld630to one of the segments and extend across the other segment to press the segments, at their inner edges, closer together whilst still allowing them to slide relative to each other. In the example inFIG.9B, the inner edges611c,611dmay be formed to interlock e.g. with a C-shape or U-shape such that the gap between the layer segments is closed to contaminants but relative movement is still possible.", "", "The examples show the inner layer having two layer segments, but this is just one example and the inner layer can be segmented into more than two layer segments.", "", "The use of a segmented inner layer for a heat shield panel provides a simple and inexpensive way of preventing or reducing deformation of the panel at high temperatures. The segmented inner layer can be easily applied to existing heat shields."], "claims": ["1 . A heat shield panel comprising an inner heat shield layer and an outer heat shield layer, the inner heat shield layer and the outer heat shield layer each having two outer edges wherein the outer edges of the inner heat shield layer and the outer edges of the inner heat shield layer are substantially aligned and are affixed to each other to form heat shield panel edges, and wherein the inner heat shield layer is formed of two or more segments each having an inner edge, the inner edges of the segments being arranged to move relative to each other.", "2 . The heat shield panel of claim 1 , further one or more intermediate heat shield layers arranged between the inner heat shield layer and the outer heat shield layer, the one or more intermediate heat shield layers having two outer edges substantially aligned with and affixed to the outer edges of the inner heat shield layer and the outer heat shield layer.", "3 . The heat shield panel of claim 1 , wherein the inner heat shield layer comprises means for preventing dust passing between the inner edges of the respective segments.", "4 . The heat shield panel of claim 3 , wherein the means for preventing dust passing between the inner edges of the respective segments comprises a plate affixed to one of the segments.", "5 . The heat shield panel of claim 4 , wherein the plate is affixed to one of the segments by a spot weld.", "6 . The heat shield panel of claim 3 , wherein the means for preventing dust passing between the inner edges of the respective segments comprises an interlocking feature provided at each of the inner edges.", "7 . The heat shield panel of claim 6 , wherein the interlocking feature comprises a C-shaped fold at the inner edge.", "8 . A heat shield assembly for a wheel assembly, comprising a plurality of arcuate heat shield panels arranged to be connected together to form a heat shield to be attached to the interior of a wheel, each heat shield panel being the heat shield panel as claimed in claim 1 .", "9 . The heat shield assembly as claimed in claim 8 , wherein one or more connectors is provided between each pair of adjacent panels.", "10 . The heat shield assembly of claim 9 , wherein the one or more connectors secure the inner and outer layers together at the outer edges.", "11 . A wheel assembly comprising a wheel rim having a radially inner surface and a radially outer surface, and the heat shield assembly as claimed in claim 8 , attached to and having a radially outer surface radially spaced from the radially inner surface of the wheel rim.", "12 . The wheel assembly of claim 11 , further comprising a plurality of torque bars arranged around the radially inner surface of the heat shield, a torque bar positioned along the central elongate panel of each retainer.", "13 . The wheel assembly of claim 11 being a wheel assembly for the landing gear of an aircraft."], "bibtex": "@patent{20240051336,\n    title = {HEAT SHIELD PANEL},\n    number = {20240051336},\n    year = {2024},\n    note = {File: US20240051336A1-20240215.XML}\n    }", "classification": "B60B2112FI"}, {"title": "WHEEL CARRIER APPARATUS FOR A MOTOR VEHICLE", "doc_number": "20240051337", "filename": "US20240051337A1-20240215.XML", "abstract": "Wheel carrier apparatus for a motor vehicle including a wheel hub to which a vehicle wheel can be fastened, and an articulation apparatus for torque transmission having an articulation housing and an articulation drive element operatively connected to the articulation housing. The articulation housing is arranged coaxially to the wheel hub and is connected to the wheel hub in a rotationally fixed manner. The wheel carrier apparatus further includes a wheel carrier on which the wheel hub and the articulation housing are borne via a wheel bearing in a rotationally fixed manner. The wheel bearing includes an outer bearing ring fastened to the wheel carrier, an inner bearing ring divided in the axial direction, and multiple rolling bodies arranged radially between the inner bearing ring and the outer bearing ring. The divided inner bearing ring includes a first inner bearing ring element and a second inner bearing ring element.", "detailed_description": ["The FIGURE shows a wheel carrier apparatus10, wherein each driven vehicle wheel of a motor vehicle is borne via such a wheel carrier apparatus10. The wheel carrier apparatus10comprises a wheel hub20, which comprises multiple circumferentially distributed through-openings22for fastening the vehicle wheel. The through-openings22in particular comprise an internal threading into which a screw inserted through an opening provided on a rim of a vehicle wheel can be screwed.", "", "The wheel carrier apparatus10further comprises a wheel carrier40and an articulation apparatus30for torque transmission. For torque transfer, the articulation apparatus30comprises an articulation housing32and an articulation drive element36that is connected in a torque-transmitting manner via a transmission apparatus34. The transmission apparatus34comprises multiple circumferentially distributed spheres38held by a cage and arranged in a respective groove of the articulation housing32and the articulation drive element36. The articulated drive element36is connected to a drive shaft12in a rotationally fixed manner for driving the vehicle wheel. Furthermore, the articulation housing32is connected in a form-fit manner to the wheel hub20in the direction of rotation. The articulation housing32comprises a fastening portion62, which engages with a through-opening64of the wheel hub20, wherein, on an outer circumferential surface of the fastening portion62and on an inner circumferential surface of the through-opening64, respectively complementary form-fit geometries of a form-fit66, in particular an inner toothing and an outer toothing, are provided. The through-opening64is closed with a lid24on a side facing away from the articulation apparatus30, which can also be releasably configured.", "", "The articulation housing32as well as the wheel hub20are rotatably supported on the wheel support40via a wheel bearing50, wherein the wheel bearing50is configured as a double-row ball bearing. The wheel bearing50comprises an outer bearing ring52, an inner bearing ring54, and multiple rolling bodies56, in particular balls, arranged between the outer bearing ring52and the inner bearing ring54.", "", "The outer bearing ring52is fastened to the wheel carrier40via a radial projection46manufactured integrally with the outer bearing ring52, wherein the outer bearing ring52radially abuts the wheel carrier40via an outer circumferential surface and axially abuts the wheel carrier40via the radial projection46. To fasten the outer bearing ring52to the wheel carrier40, the wheel carrier40comprises multiple circumferentially distributed through-holes42through which a respective bolt48is inserted. The bolt48abuts a side of the wheel carrier40facing away from the radial projection46and is screwed into a respective threaded bore44provided on the radial projection46. In the lower region of the FIGURE, the through-hole42is shown without the bolt48. On a circumferential surface facing away from the radial projection46, the outer bearing ring52comprises two bearing surfaces for the two rows of the rolling bodies56.", "", "The inner bearing ring54is configured so as to be divided and has a first inner bearing ring element58and a second inner bearing ring element60, wherein the two inner bearing ring elements58,60are spaced apart from one another by a distance A. The first inner bearing ring element58is integrally manufactured with the wheel hub20. In other words, the wheel hub20comprises a bearing portion on an outer circumferential surface, which forms a bearing surface of one of the two rows of the rolling bodies56. The second inner bearing ring element60is manufactured integrally with the articulation housing32, wherein an outer circumferential surface forms a bearing surface of the other row of rolling bodies56.", "", "The axial fastening between the wheel hub20and the articulation housing32is accomplished via a rolling rivet collar70, wherein the rolling rivet collar70is formed on a portion of the fastening portion62projecting out of the through-opening64. The projecting portion is bent radially outward and abuts axially against a surface of the wheel hub20.", "", "When assembling the wheel bearing50, the two rows of the rolling bodies56are first mounted on the outer bearing ring52, and then the wheel hub20and the articulation housing32are inserted and stuck into one another. Finally, the rolling rivet collar70is formed, wherein the biasing of the wheel bearing50is thus adjusted. For example, the wheel hub20is retained and the articulation housing32is axially displaced and stressed in a defined manner until a predefined distance A is present between the two inner bearing ring elements58,60. As soon as the predefined distance A required for the biasing is achieved, the portion of the fastening portion62projecting out of the through-opening64is outwardly deformed, thereby retaining the adjusted distance A.", "", "Thus, a wheel carrier apparatus10is provided, which can be manufactured and assembled easily and inexpensively."], "claims": ["a wheel hub to which a vehicle wheel can be fastened, an articulation apparatus for torque transmission comprising an articulation housing and an articulation drive element operatively connected to the articulation housing, wherein the articulation housing is arranged coaxially to the wheel hub and is connected to the wheel hub in a rotationally fixed manner, and a wheel carrier on which the wheel hub and the articulation housing are supported in a rotationally fixed manner via a wheel bearing, wherein the wheel bearing comprises an outer bearing ring fastened to the wheel carrier, an inner bearing ring divided in an axial direction, and multiple rolling bodies arranged radially between the inner bearing ring and the outer bearing ring, wherein the divided inner bearing ring comprises a first inner bearing ring element and a second inner bearing ring element, wherein the first inner bearing ring element is integrated with the wheel hub, and the second inner bearing ring element is integrated with the articulation housing, and wherein the articulation housing is configured to be axially fastened to the wheel hub in such a way that an axial distance (A) between the first and second inner bearing ring elements is adjustable.", "2 . The wheel carrier apparatus according to claim 1 , wherein the articulation housing includes a fastening portion that is insertable into a through-opening of the wheel hub, wherein the articulation housing is connected in a form-fit manner to the wheel hub in a direction of rotation, wherein, in each case, a form-fit geometry creating the form-fit is disposed on an outer circumferential surface of the fastening portion of the articulation housing projecting into the through-opening of the wheel hub and on an inner circumferential surface of the through-opening of the wheel hub.", "3 . The wheel carrier apparatus according to claim 2 , wherein the fastening portion projects out of the through-opening on a wheel hub side of the wheel hub and forms a rolling rivet collar in such a way that the articulation housing is axially fastened to the wheel hub via the rolling rivet collar.", "4 . The wheel carrier apparatus according to claim 1 , wherein the outer bearing ring of the wheel bearing is releasably connected to the wheel carrier.", "5 . The wheel carrier apparatus according to claim 1 , wherein the outer bearing ring of the wheel bearing comprises a radial projection, which axially abuts the wheel carrier and is releasably connected to the wheel carrier.", "6 . A motor vehicle comprising the wheel carrier apparatus of claim 1 ."], "bibtex": "@patent{20240051337,\n    title = {WHEEL CARRIER APPARATUS FOR A MOTOR VEHICLE},\n    number = {20240051337},\n    year = {2024},\n    note = {File: US20240051337A1-20240215.XML}\n    }", "classification": "B60B2700FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240051338", "filename": "US20240051338A1-20240215.XML", "abstract": "For a cap tread layer of a pneumatic tire, a rubber composition is used, which contains from 60 to 90 parts by mass of silica per 100 parts by mass of a diene rubber containing from 15 to 30 mass % of a natural rubber, from 40 to 70 mass % of a terminal-modified styrene-butadiene rubber having a vinyl content of from 35 to 45 mass %, and from 15 to 30 mass % of a modified butadiene rubber obtained by modifying an active terminal of a conjugated diene polymer with at least a hydrocarbyloxysilane compound, the total of these being 100 mass %. A hardness Hu of the undertread Layer and a hardness Hc of the cap tread layer satisfy the relationship of Hu>Hc. The hardness Hc is 63 or greater and 67 or less. A difference ΔH between the hardness Hu and the hardness Hc is 10 or more.", "detailed_description": ["Configurations of embodiments of the present technology will be described in detail below with reference to the accompanying drawings.", "", "As illustrated inFIG.1, a pneumatic tire of an embodiment of the present technology includes a tread portion1, a pair of sidewall portions2respectively disposed on both sides of the tread portion1, and a pair of bead portions3disposed on an inner side in a tire radial direction of the sidewall portions2. Note that “CL” inFIG.1denotes a tire equator. Although not illustrated inFIG.1that is a meridian cross-sectional view, the tread portion1, the sidewall portions2, and the bead portions3each extend in the tire circumferential direction and have an annular shape, forming a basic structure of a toroidal shape of the pneumatic tire. Although the description usingFIG.1is basically based on the illustrated meridian cross-sectional shape, all of the tire components extend in the tire circumferential direction and form the annular shape.", "", "A carcass layer4is mounted between the left-right pair of bead portions3. The carcass layer4includes a plurality of reinforcing cords (carcass cords) extending in the tire radial direction and covered with a coating rubber and is folded back around a bead core5disposed in each of the bead portions3from an inner side to an outer side in a tire width direction. A bead filler6is disposed on an outer periphery of the bead core5, and the bead filler6is enveloped by a body portion and a folded back portion of the carcass layer4.", "", "In an example ofFIG.1, a plurality of belt layers7(two layers) are provided on an outer circumferential side of the carcass layer4in the tread portion1. Each of the belt layers7includes a plurality of reinforcing cords (belt cords) inclining with respect to the tire circumferential direction, with the belt cords of the layers intersecting each other. In the belt layers7, an inclination angle of the belt cord with respect to the tire circumferential direction is set within a range, for example, from 10° to 40°. As the belt cord, for example, a steel cord can be used.", "", "In an example ofFIG.1, a plurality of belt cover layers8(two layers) is provided on an outer circumferential side of the belt layer7. Note that, of the two belt cover layers8of an illustrated example, one is a full cover layer8athat covers the entire region of the belt layer7, and the other is a pair of edge cover layers8bthat locally cover both end portions of the belt layers7. The belt cover layer8includes a reinforcing cord (belt cover cord) oriented in the tire circumferential direction. In the belt reinforcing layer8, an angle of the belt cover cord with respect to the tire circumferential direction is set to, for example, from 0° to 5°. As the belt cover cord, for example, an organic fiber cord can be used.", "", "In an embodiment of the present technology, these belt layers7and the belt cover layers8may hereinafter collectively be referred to as a reinforcing layer. In an embodiment of the present technology, as the reinforcing layer, only the belt layers7may be provided, or both of the belt layers7and the belt cover layers8may be provided. The “outer circumferential side of reinforcing layer” in the description below means an outer circumferential side of a belt layer7(especially, an outermost layer of the plurality of belt layers7in the tire radial direction) in a case where only the belt layers7are provided, or means an outer circumferential side of a belt cover layer8(especially, an outermost layer of the plurality of belt cover layers8in the tire radial direction) in a case where the belt layers7and the belt cover layers8are provided.", "", "In the tread portion1, a tread rubber layer10is disposed on the outer circumferential side of the above-mentioned carcass layer4and reinforcing layer (the belt layers7and the belt cover layers8). In an embodiment of the present technology, the tread rubber layer10has a structure in which two types of rubber layers having different physical properties (a cap tread layer11and an undertread layer12) are layered in the tire radial direction. The cap tread layer11is disposed on outer circumferential side of the undertread layer12and constitutes a road contact surface of the tread portion1. The undertread layer12is sandwiched between the cap tread layer11and the reinforcing layer. A side rubber layer20is disposed on the outer circumferential side (the outer side in the tire width direction) of the carcass layer4in the sidewall portion2, and a rim cushion rubber layer30is disposed on the outer circumferential side (the outer side in the tire width direction) of the carcass layer4in the bead portion3.", "", "An embodiment of the present technology relates to the tread portion1(the cap tread layer11and the undertread layer12), and thus other portions and constituent members are not limited to the structure described above. Note that, in the following description, a rubber composition constituting the cap tread layer11may be referred to as a cap tread rubber, and a rubber composition constituting the undertread layer12may be referred to as an undertread rubber.", "", "In the rubber composition constituting the cap tread layer11, the rubber component contains indispensably three types of components that are a natural rubber, a styrene-butadiene rubber, and a butadiene rubber, and the total of these is 100 mass %. In an embodiment of the present technology, combined use of these three types of rubbers in the proportions described below allows snow performance, wet performance, and rolling resistance to be improved.", "", "The natural rubber is not particularly limited as long as the natural rubber is typically used for rubber compositions for tires. Blending of the natural rubber allows snow performance to be further enhanced. A content of the natural rubber is 15 mass % or greater and 30 mass % or less, and preferably from 17 mass % to 25 mass %, per 100 mass % of the diene rubber. When the content of the natural rubber is less than 15 mass %, snow performance cannot be sufficiently improved. When the content of the natural rubber is more than 30 mass %, the improvement effect of wet performance and rolling resistance cannot be achieved.", "", "The styrene-butadiene rubber used in an embodiment of the present technology is a terminal-modified styrene-butadiene rubber having a vinyl content of from 35 mass % to 45 mass %, and preferably from 38 mass % to 43 mass %. Use of such a terminal-modified styrene-butadiene rubber allows wet performance and low rolling resistance to be improved. The type of the modification group in the terminal-modified styrene-butadiene rubber is not particularly limited as long as the vinyl content satisfies the condition described above, and examples thereof include an epoxy group, a carboxy group, an amino group, a hydroxy group, an alkoxy group, a silyl group, an alkoxysilyl group, an amide group, an oxysilyl group, a silanol group, an isocyanate group, an isothiocyanate group, a carbonyl group, and an aldehyde group. Among these modification groups, a hydroxy group, an alkoxysilyl group, and an amide group can be suitably used.", "", "A content of the styrene-butadiene rubber is 40 mass % or greater and 70 mass % or less, and preferably from 55 mass % to 65 mass %, per 100 mass % of the diene rubber. When the content of the styrene-butadiene rubber is less than 40 mass %, wet performance deteriorates. When the content of the styrene-butadiene rubber is more than 70 mass %, snow performance deteriorates.", "", "The butadiene rubber used in an embodiment of the present technology is a modified butadiene rubber obtained by modifying an active terminal of a conjugated diene polymer with at least one functional group selected from the group consisting of a hydrocarbyloxysilane compound and a polyorganosiloxane. Note that examples of the hydrocarbyloxysilane compound include N,N-bis(trimethylsilyl)-3-aminopropyltrimethoxysilane, N,N-bis(trimethylsilyl)-3-aminopropyltriethoxysilane, N,N-bis(trimethylsilyl)aminoethyltrimethoxysilane, and N,N-bis(trimethylsilyl)aminoethyltriethoxysilane. A cis-1,4 bond content in the modified butadiene rubber is preferably 75 mol % or greater, and more preferably 90 mol % or greater. With use of such a modified butadiene rubber, affinity to silica described below can be increased, dispersibility can be improved, thus the effect of silica is improved, and low rolling performance and wet performance can be improved.", "", "A content of the butadiene rubber is 15 mass % or greater and 30 mass % or less, and preferably from 17 mass % to 25 mass %, per 100 mass % of the diene rubber. When the content of the butadiene rubber is less than 15 mass %, snow performance deteriorates. When the content of the butadiene rubber is more than 30 mass %, wet performance deteriorates.", "", "Silica is indispensably blended in the rubber composition constituting the cap tread layer11. Examples of the silica that can be used include w et silica (hydrous silicic acid), dry silica (silicic anhydride), calcium silicate, and aluminum silicate. One type of these silicas may be used alone, or a combination of two or more types of these silicas may be used. Surface-treated silica, in which the surface of silica is treated with a silane coupling agent, may also be used. By the blending of the silica, rubber hardness of the rubber composition can be increased, and excellent dry performance (steering stability) can be achieved when a pneumatic tire is formed. The blended amount of the silica is from 60 parts by mass to 90 parts by mass, and preferably from 70 parts by mass to 80 parts by mass, per 100 parts by mass of the diene rubber described above. When the blended amount of the silica is less than 60 parts by mass, wet performance deteriorates. When the blended amount of the silica is more than 90 parts by mass, rolling resistance cannot be reduced.", "", "A CTAB (cetyltrimethylammonium bromide) adsorption specific surface area of the silica is not particularly limited but is preferably from 150 m2/g to 220 m2/g, and more preferably from 160 m2/g to 200 m2/g. Setting the CTAB adsorption specific surface area of the silica to 150 m2/g or greater allows wet performance to be ensured. Furthermore, setting the CTAB adsorption specific surface area of the silica to 220 m2/g or less allows dry performance and wet performance to be improved and rolling resistance to be reduced. In an embodiment of the present technology, the CTAB adsorption specific surface area of silica is a value measured in accordance with ISO (International Organization for Standardization)5794.", "", "In an embodiment of the present technology, in addition to the silica, carbon black may be blended as an inorganic filler. By the blending of the carbon black, rubber hardness of the rubber composition can be increased, and excellent dry performance (steering stability) can be achieved when a pneumatic tire is formed. The blended amount of the carbon black is preferably from 5 parts by mass to 15 parts by mass, and more preferably from 5 parts by mass to 10 parts by mass, per 100 parts by mass of the diene rubber described above. When the blended amount of the carbon black is less than 5 parts by mass, dry performance deteriorates. When the blended amount of the carbon black is more than 15 parts by mass, low rolling resistance deteriorates. As the carbon black, for example, carbon black having a nitrogen adsorption specific surface area (N2SA) of preferably 90 m2/g to 130 m2/g, and more preferably 110 m2/g to 120 m2/g, can be used. When the nitrogen adsorption specific surface area of the carbon black is less than 90 m2/g, dry performance cannot be adequately improved. When the nitrogen adsorption specific surface area of the carbon black is more than 130 m2/g, rolling resistance cannot be adequately reduced. In an embodiment of the present technology, the nitrogen adsorption specific surface area of carbon black is a value measured in accordance with JIS K 6217-2.", "", "The rubber composition constituting the cap tread layer11can contain another filler besides the silica and the carbon black described above. Examples of the other fillers include calcium carbonate, magnesium carbonate, talc, clay, alumina, aluminum hydroxide, titanium oxide, and calcium sulfate. One type of these other fillers may be used alone, or a combination of two or more types of these other fillers may be used.", "", "In the rubber composition constituting the cap tread layer11, a silane coupling agent is preferably blended together with the silica described above. The silane coupling agent can improve the dispersibility of the silica. The blended amount of the silane coupling agent is preferably from 7 mass % to 10 mass %, and more preferably from 8 mass % to 9 mass %, of the silica. When the blended amount of the silane coupling agent is less than 7 mass %, dispersibility of the silica may not be adequately improved. When the blended amount of the silane coupling agent is more than 10 mass %, premature vulcanization tends to occur in the rubber composition, and the forming processability tends to be degraded.", "", "The silane coupling agent is not particularly limited as long as the silane coupling agent can be used for a rubber composition for a tire. Examples thereof include sulfur-containing silane coupling agents such as bis(3-triethoxysilylpropyl)tetrasulfide, bis(3-triethoxysilylpropyl)disulfide, 3-trimethoxysilylpropyl benzothiazoletetrasulfide, γ-mercaptopropyl triethoxysilane, and 3-octanoylthiopropyl triethoxysilane. Among these, the silane coupling agent having a mercapto group is preferred, and the affinity to silica can be enhanced, and the dispersibility can be improved. One type of these silane coupling agents can be blended alone, or a combination of multiple types of these can be blended.", "", "In the rubber composition constituting the undertread layer12, the rubber component contains indispensably two or more types selected from the group consisting of a natural rubber, a styrene-butadiene rubber, an isoprene rubber, and a butadiene rubber, and the total of these are set to 100 mass %. Two types that are a natural rubber and a butadiene rubber are preferably contained and, optionally, a styrene-butadiene rubber and/or an isoprene rubber is preferably contained. Configuring the undertread layer12as described above is advantageous for ensuring excellent dry performance (steering stability) due to cooperative action with the cap tread layer11. That is, the cap tread rubber is advantageous for improving snow performance but may not adequately en sure dry performance; however, use of the undertread rubber described above supplements dry performance and enables a tire to provide these performances in a compatible manner.", "", "As described above, in a case where the undertread layer12contains the two types that are the natural rubber and the butadiene rubber as main components and, optionally, the styrene-butadiene rubber and/or the isoprene rubber, per 100 mass % of the rubber component, preferably 50 mass % or greater, and more preferably from 60 mass % to 80 mass %, of the natural rubber is contained, and preferably 15 mass % or greater and 35 mass % or less, and more preferably from 20 mass % to 30 mass %, of the butadiene rubber is contained. In the undertread layer12, when the blended amount of the natural rubber is less than 50 mass %, or when the blended amount of the butadiene rubber is less than 15 mass %, low rolling resistance deteriorates. When the blended amount of the butadiene rubber in the undertread layer12is more than 35 mass %, dry performance deteriorates.", "", "As described above, in a case where the undertread layer12contains the two types that are the natural rubber and the butadiene rubber as main components and, optionally, the styrene-butadiene rubber and/or the isoprene rubber, the blended amounts of the optionally blended styrene-butadiene rubber and isoprene rubber are not particularly limited. However, to further improve the rubber physical property required for the undertread layer12, the isoprene rubber is preferably blended such that the total amount of the isoprene rubber and the natural rubber is preferably 50 mass % or greater, and more preferably from 60 mass % to 80 mass %, per 100 mass % of the rubber component. Similarly, preferably from 5 mass % to 25 mass %, and more preferably from 10 mass % to 20 mass %, of the styrene-butadiene rubber is blended per 100 mass % of the rubber component.", "", "The rubber composition constituting the undertread layer12preferably contains silica and/or carbon black as inorganic fillers. Blending of the silica and/or the carbon black increases the rubber hardness. In a case where the rubber composition is used for the undertread layer12disposed on the inner circumferential side of the cap tread layer11described above, excellent dry performance (steering stability) can be ensured due to cooperative action with the cap tread layer211. The blended amount of the silica and/or the carbon black in the undertread layer12is preferably 50 parts by mass or greater, and more preferably from 55 parts by mass to 65 parts by mass, per 100 parts by mass of the rubber component described above. When the blended amount of the silica and/or the carbon black in the undertread layer12is less than 50 parts by mass, dry performance deteriorates.", "", "Examples of the silica used in the undertread layer12include wet silica (hydrous silicic acid), dry silica (silicic anhydride), calcium silicate, and aluminum silicate. One type of these silicas may be used alone, or a combination of two or more types of these silicas may be used. Surface-treated silica, in which the surface of silica is treated with a silane coupling agent, may also be used. A CTAB adsorption specific surface area of the silica is not particularly limited but is preferably from 130 m2/g to 175 m2/g, and more preferably from 138 m2/g to 168 m2/g. Setting the CTAB adsorption specific surface area of the silica to 130 m2/g or greater allows wet performance to be ensured. Furthermore, setting the CTAB adsorption specific surface area of the silica to 175 m2/g or less allows dry performance and wet performance to be improved and rolling resistance to be reduced. In an embodiment of the present technology, the CTAB adsorption specific surface area of silica is a value measured in accordance with ISO 5794.", "", "As the carbon black used in the undertread layer12, for example, carbon black having a nitrogen adsorption specific surface area (N2SA) of preferably 40 m2/g to 100 m2/g, and more preferably 80 m2/g to 100 m2/g, can be used. When the nitrogen adsorption specific surface area of the carbon black is less than 40 m2/g, dry steering stability performance cannot be adequately improved. When the nitrogen adsorption specific surface area of the carbon black is more than 100 m2/g, rolling resistance cannot be adequately reduced. In an embodiment of the present technology, the nitrogen adsorption specific surface area of carbon black is a value measured in accordance with JIS K 6217-2.", "", "The rubber composition constituting the undertread layer12can contain another filler besides the silica and the carbon black described above. Examples of the other fillers include calcium carbonate, magnesium carbonate, talc, clay, alumina, aluminum hydroxide, titanium oxide, and calcium sulfate. One type of these other fillers may be used alone, or a combination of two or more types of these other fillers may be used.", "", "In the rubber composition constituting the undertread layer12, a silane coupling agent is preferably blended together with the silica described above. The silane coupling agent can improve the dispersibility of the silica. The blended amount of the silane coupling agent is preferably from 7 mass % to 10 mass %, and more preferably from 8 mass % to 9 mass %, of the silica. When the blended amount of the silane coupling agent is less than 7 mass %, dispersibility of the silica may not be adequately improved. When the blended amount of the silane coupling agent is more than 10 mass %, premature vulcanization tends to occur in the rubber composition, and the forming processability tends to be degraded. As the silane coupling agent used in the rubber composition constituting the undertread layer12, various silane coupling agents that can be used for the cap tread layer11described above can be used. One type of the silane coupling agents can be blended alone, or a combination of multiple types of these can be blended.", "", "In an embodiment of the present technology, the rubber composition constituting the cap tread layer11and the rubber composition constituting the undertread layer12may contain various additives, such as a vulcanization or crosslinking agent, a vulcanization accelerator, various oils, an anti-aging agent, and a plasticizer, that are typically used for rubber compositions for tires besides the compounding agents described above in a range that does not impair the object of the present technology. These additives can be kneaded by a typical method to form a rubber composition to be used for vulcanization or crosslinking. The blended amounts of these additives may be known typical blended amounts without departing from the object of the present technology. The rubber composition for a tire can be produced by mixing each component described above by using a common rubber kneading machine such as a Banbury mixer, a kneader, and a roll.", "", "In the tire according to an embodiment of the present technology using the rubber composition having the compounding proportions described above, when the hardness of the cap tread rubber constituting the cap tread layer11at 20° C. is a hardness Hc and the hardness of the undertread rubber constituting the undertread layer12at 20° C. is a hardness Hu, the hardness Hc of the cap tread rubber is 63 or greater and 67 or less, and preferably 64 or greater and 66 or less, and the hardness Hu of the undertread rubber is preferably 75 or greater and 80 or less, and more preferably 77 or greater and 79 or less. Furthermore, the hardness Hc of the cap tread rubber and the hardness Hu of the undertread rubber satisfy the relationship Hu>Hc, and the difference ΔH of these hardnesses (=Hu−Hc) is 10 or more, and preferably 10 or more and 13 or less. Setting the relationship of the hardnesses as described above allows snow performance to be improved.", "", "When the hardness Hc of the cap tread rubber at this time is less than 63, dry performance cannot be improved because, in the tire, the cap tread layer11in contact with the road surface is too soft. When the hardness Hc of the cap tread rubber is more than 67, snow performance cannot be improved. When the hardness Hu of the undertread rubber is less than 75, dry performance cannot be improved. When the hardness Hu of the undertread rubber is more than 80, wet performance cannot be improved. When the magnitude relationship of the hardness Hc of the cap tread rubber and the hardness Hu of the undertread rubber is reversed, dry performance, wet performance, and snow performance cannot be improved. When the hardness difference ΔH is less than 10, the cap tread rubber and the undertread rubber have substantially the same degree of hardness, and thus dry performance, wet performance, and snow performance cannot be improved. For example, in a case where the snow performance is ensured by adequately unhardening the cap tread layer11, the undertread layer12is adequately hardened to ensure dry performance; however, a small hardness difference ΔH makes dry performance difficult to be ensured by the undertread layer12.", "", "In addition to having the hardness described above, the cap tread rubber constituting the cap tread layer11has a storage modulus E′ at −20° C. of preferably 70 MPa or less, and more preferably from 60 MPa to 68 MPa. Setting the storage modulus E′ as described above is advantageous for improving snow performance. When the storage modulus E′ of the cap tread rubber is more than 70 MPa, snow performance cannot be improved.", "", "The physical properties described above related to the rubber composition constituting the cap tread layer11and the undertread layer12can be achieved by employing the above-mentioned compounding proportions of the rubber composition constituting each of the layers. Alternatively, the physical properties described above can be appropriately set by adjusting the blended amount of process oil, sulfur, and the like besides the compounding agents for which specific blended amount ranges have been described.", "", "When the cap tread layer11and the undertread layer12described above are employed, from the perspective of achieving desired tire performance, the thickness of each of the layers is preferably set properly. Specifically, a ratio h/G of a block height h to a thickness G of the undertread layer12is set to be preferably from 9 to 12, and more preferably from 9 to 11. When the ratio h/G is less than 9, snow performance cannot be improved. When the ratio h/G is more than 12, low rolling performance cannot be improved. Note that, as illustrated inFIG.2, the block height h is a distance (maximum value) measured from a groove bottom of a groove40formed in the tread portion1to a road contact surface of the tread portion1along the perpendicular line to the road contact surface of the tread portion1. The thickness G of the undertread layer12is a distance (maximum value) measured from an outer surface of a reinforcing layer positioned on an outermost circumferential side of the reinforcing layers (belt layers7or belt cover layers8) provided in the tire to a boundary between the cap tread layer11and the undertread layer12along the perpendicular line to the outer surface of the reinforcing layer.", "", "An embodiment of the present technology will further be described below by way of Examples, but the scope of an embodiment of the present technology is not limited to Examples."], "claims": ["1 - 5 . (canceled)", "a tread portion extending in a tire circumferential direction and having an annular shape; a pair of sidewall portions disposed on both sides of the tread portion; a pair of bead portions disposed on an inner side in a tire radial direction of the pair of sidewall portions; a carcass layer mounted between the pair of bead portions; and a plurality of reinforcing layers disposed on an outer circumferential side of the carcass layer in the tread portion; the tread portion having a bilayer structure comprising an undertread layer disposed on an outer circumferential side of the reinforcing layer and a cap tread layer disposed on an outer circumferential side of the undertread layer and constituting a road contact surface of the tread portion; the cap tread layer comprising a rubber composition containing from 60 parts by mass to 90 parts by mass of silica per 100 parts by mass of a diene rubber containing 15 mass % or greater and 30 mass % or less of a natural rubber, 40 mass % or greater and 70 mass % or less of a styrene-butadiene rubber, and 15 mass % or greater and 30 mass % or less of a butadiene rubber, a total of the natural rubber, the styrene-butadiene rubber, and the butadiene rubber being 100 mass %; the styrene-butadiene rubber being a terminal-modified styrene-butadiene rubber having a vinyl content of from 35 mass % to 45 mass %; the butadiene rubber being a modified butadiene rubber obtained by modifying an active terminal of a conjugated diene polymer with at least one functional group selected from the group consisting of a hydrocarbyloxysilane compound and a polyorganosiloxane; a hardness Hu of an undertread rubber constituting the undertread layer at 20° C. and a hardness Hc of a cap tread rubber constituting the cap tread layer at 20° C. satisfying a relationship of Hu>Hc; the hardness Hc being 63 or greater and 67 or less; and a difference ΔH between the hardness Hu and the hardness Hc being 10 or more.", "7 . The pneumatic tire according to claim 6 , wherein a cis-1,4 bond content in the butadiene rubber is 75 mol % or greater.", "8 . The pneumatic tire according to claim 6 , wherein a storage modulus E′ of the cap tread rubber constituting the cap tread layer at −20° C. is 70 MPa or less.", "the undertread layer contains a rubber composition containing 70 parts by mass or greater of silica or carbon black per 100 parts by mass of a rubber component containing two or more types selected from the group consisting of a natural rubber, a styrene-butadiene rubber, an isoprene rubber, and a butadiene rubber, and the hardness Hu is 75 or greater and 80 or less.", "10 . The pneumatic tire according to claim 6 , wherein a ratio h/G of a block height h from a groove bottom of a groove formed in the tread portion to a road contact surface of the tread portion to a thickness G of the undertread layer is from 9 to 12.", "11 . The pneumatic tire according to claim 7 , wherein a storage modulus E′ of the cap tread rubber constituting the cap tread layer at −20° C. is 70 MPa or less.", "the undertread layer contains a rubber composition containing 70 parts by mass or greater of silica or carbon black per 100 parts by mass of a rubber component containing two or more types selected from the group consisting of a natural rubber, a styrene-butadiene rubber, an isoprene rubber, and a butadiene rubber, and the hardness Hu is 75 or greater and 80 or less.", "13 . The pneumatic tire according to claim 12 , wherein a ratio h/G of a block height h from a groove bottom of a groove formed in the tread portion to a road contact surface of the tread portion to a thickness G of the undertread layer is from 9 to 12."], "bibtex": "@patent{20240051338,\n    title = {PNEUMATIC TIRE},\n    number = {20240051338},\n    year = {2024},\n    note = {File: US20240051338A1-20240215.XML}\n    }", "classification": "B60C100FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240051339", "filename": "US20240051339A1-20240215.XML", "abstract": "A pneumatic tire having a tread portion and a belt layer, wherein the reinforcing cords in the belt layer are composed of monofilament cords arranged in the tire width direction at least 50 cords/5 cm in the cross section of the belt layer in the tire radial direction. A pneumatic tire that is installed on a standardized rim and satisfies the following (formula 1), where Wt (mm) is the cross-sectional width of the tire and Dt (mm) is the outer diameter of the tire when the internal pressure is 250 kPa: 1500≤(Dt 2 ×π/4)/Wt  (formula 1).", "detailed_description": [""], "claims": ["the reinforcing cords in the belt layer are composed of monofilament cords arranged in a tire width direction at 50 cords/5 cm or more in a cross section of the belt layer in the tire radial direction; and the cross-sectional width Wt (mm) and the outer diameter Dt (mm) of the tire, which is installed on a standardized rim and has an internal pressure of 250 kPa, satisfy the following (formula 1):", "2 . The pneumatic tire according to claim 1 , which satisfy the following (formula 2): 1600≤(Dt 2 ×π/4)/Wt  (formula 2).", "3 . The pneumatic tire according to claim 2 , which satisfy the following (formula 3): 1700≤(Dt 2 ×π/4)/Wt  (formula 3).", "4 . The pneumatic tire according to claim 1 , wherein the cord made of the monofilament has a cord outer diameter of 0.1 mm or more and 0.5 mm or less.", "5 . The pneumatic tire according to claim 1 , wherein the arrangement number e of the monofilament cords per 5 cm in the tire width direction (cords/5 cm) is 75 cords/5 cm or more.", "the complex modulus E* (MPa) of the rubber composition measured under conditions of temperature of 70° C., initial strain of 5%, dynamic strain of ±1%, frequency of 10 Hz, deformation mode: extension, the loss tangent (tan δ) of the rubber composition measured under conditions of temperature of 70° C., initial strain of 5%, dynamic strain of +1%, frequency of 10 Hz, deformation mode: tensile, and the arrangement number e (cords) of the reinforcing cords per 5 cm in the tire width direction in the tread portion satisfy the following (formula 4):", "7 . The pneumatic tire according to claim 6 , which satisfy the following (formula 5): [(tan δ/ E *)/ e]× 1000≤0.12  (formula 5).", "8 . The pneumatic tire according to claim 6 , wherein the (tan δ/E*) is 0.002 or more and 0.017 or less.", "9 . The pneumatic tire according to claim 1 , wherein at least two belt layers are provided, and, in at least one pair of radially adjacent belt layers of the tire, the average distance D (mm) between cords in each belt layer in the tread portion is 0.6 mm or less.", "10 . The pneumatic tire according to claim 1 , wherein at least two belt layers are provided; and, in at least one pair of radially adjacent belt layers of the tire, the angle formed by the cords in each belt layer in the tread portion at the tire circumferential direction is 650 or less.", "the complex modulus E* (MPa) of the rubber composition covering the reinforcing cord measured under conditions of temperature of 70° C., initial strain of 5%, dynamic strain of 1%, frequency of 10 Hz, deformation mode: extension, the loss tangent (tan δ) of the rubber composition covering the reinforcing cord measured under conditions of temperature of 70° C., initial strain of 5%, dynamic strain of 1%, frequency of 10 Hz, deformation mode: tensile, and the average distance D (mm) between cords in each belt layer in the tread portion satisfy the following (formula 6):", "12 . The pneumatic tire according to claim 1 , wherein, in the belt layer, the rubber composition covering the reinforcing cords contains 60 parts by mass or less of carbon black with respect to 100 parts by mass of the rubber component.", "13 . The pneumatic tire according to claim 1 , wherein the tread portion has a circumferential groove extending continuously in the tire circumferential direction, and the ratio (L 80 /L 0 ) of the groove width L 80 at 80% of the maximum depth of the circumferential groove to the groove width L 0 of the circumferential groove on the contact surface of the tread portion is 0.2 or more and 0.7 or less.", "14 . The pneumatic tire according to claim 1 , wherein the tread portion has a plurality of circumferential grooves extending continuously in the tire circumferential direction, and the total cross-sectional area of the plurality of circumferential grooves is 10% or more and 30% or less of the cross-sectional area of the tread portion.", "15 . The pneumatic tire according to claim 1 , wherein the tread portion has a plurality of lateral grooves extending in the axial direction of the tire, and the total volume of the plurality of lateral grooves is 2.0% or more and 5.0% or less of the volume of the tread portion.", "16 . The pneumatic tire according to claim 1 , wherein the tread portion has a plurality of lateral grooves extending in the axial direction of the tire, and the plurality of lateral grooves includes a lateral groove having a ratio of groove width Gw to groove depth Gd (Gw/Gd) of 0.50 or more and 0.80 or less", "17 . The pneumatic tire according to claim 1 , wherein the cross-sectional width Wt (mm) of the tire is less than 200 mm.", "18 . The pneumatic tire according to claim 1 , wherein, when the outer diameter of the tire is Dt (mm) and the cross-sectional height is Ht (mm), (Dt−2×Ht) is 450 (mm) or more and less than 560 (mm).", "19 . The pneumatic tire according to claim 1 , which is a passenger car tire."], "bibtex": "@patent{20240051339,\n    title = {PNEUMATIC TIRE},\n    number = {20240051339},\n    year = {2024},\n    note = {File: US20240051339A1-20240215.XML}\n    }", "classification": "B60C900FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240051340", "filename": "US20240051340A1-20240215.XML", "abstract": "A pneumatic tire having a tread section and a belt layer, wherein monofilament cords are used as reinforcing cords in the belt layer, and an arranged number e of the monofilament cords per 5 cm in the tire-width direction (cords/5 cm) in a tire radial direction cross-section of the belt layer, and a tire cross-sectional width Wt (mm), incorporated in a standardized rim and with an internal pressure of 250 kPa, satisfies (formula 1) and (formula 2) below: e /(0.31 Wt +14.35)>1  (formula 1); e /(0.31 Wt +56.45)  (formula 2).", "detailed_description": [""], "claims": ["the belt layer uses a monofilament cord as a reinforcing cord, and the number e of arranged monofilament cords per 5 cm in the tire width direction (cords/5 cm) in the cross section of the belt layer in the tire radial direction, and the tire cross-sectional width Wt (mm) when the tire is installed on a standardized rim and the internal pressure is set to 250 kPa satisfies the following (formula 1) and (formula 2):", "2 . The pneumatic tire according to claim 1 , wherein the tire cross-sectional width Wt is less than 200 mm, and satisfies the following (formula 3): e /(0.1924 Wt+ 37.88)>1  (formula 3).", "3 . The pneumatic tire according to claim 1 , wherein the tire cross-sectional width Wt is less than 200 mm, and satisfies the following (formula 4): e /(0.1335 Wt+ 49.644)>1  (formula 4).", "4 . The pneumatic tire according to claim 1 , wherein the arrangement number e of the monofilament cords per 5 cm in the tire width direction (cords/5 cm) is more than 80 cords/5 cm.", "5 . The pneumatic tire according to claim 1 , wherein, in the belt layer, the loss tangent (tan δ), measured under the conditions of temperature of 70° C., initial strain of 5%, dynamic strain of ±1%, frequency of 10 Hz, deformation mode: tension, of the rubber composition covering the reinforcing cords and the average distance L (mm) between the two monofilament cords adjacent in the width direction in the tread portion satisfy the following (formula 5): L ×tan δ>0.017  (formula 5).", "6 . The pneumatic tire according to claim 1 , wherein the angle formed by the reinforcing cord of the belt layer and a straight line parallel to the tire circumferential direction is 10° or more and 35° or less.", "7 . The pneumatic tire according to claim 1 , wherein at least two belt layers are provided, and at least one pair of belt layers adjacent in the tire radial direction are arranged with distance of 0.5 mm or less.", "8 . The pneumatic tire according to claim 1 , wherein the cord outer diameter of the monofilament cord is 0.1 mm or more and 0.5 mm or less.", "9 . The pneumatic tire according to claim 1 , wherein the tread portion has a circumferential groove extending continuously in the tire circumferential direction, and the ratio (L 80 /L 0 ) of the groove width L 80 at 80% of the maximum depth of the circumferential groove to the groove width L 0 of the circumferential groove on the contact surface of the tread portion is 0.3 or more and 0.7 or less.", "10 . The pneumatic tire according to claim 1 , wherein the tread portion has a plurality of circumferential grooves extending continuously in the tire circumferential direction, and the total cross-sectional area of the plurality of circumferential grooves is 10% or more and 30% or less of the cross-sectional area of the tread portion.", "11 . The pneumatic tire according to claim 1 , wherein the tread portion has a plurality of lateral grooves extending in the axial direction of the tire, and the total volume of the plurality of lateral grooves is 2.0% or more and 5.0% or less of the volume of the tread portion."], "bibtex": "@patent{20240051340,\n    title = {PNEUMATIC TIRE},\n    number = {20240051340},\n    year = {2024},\n    note = {File: US20240051340A1-20240215.XML}\n    }", "classification": "B60C900FI"}, {"title": "PNEUMATIC VEHICLE TYRE WITH A BELT PLY HAVING STEEL MONOFILAMENTS", "doc_number": "20240051341", "filename": "US20240051341A1-20240215.XML", "abstract": "A pneumatic vehicle tire having two or more belt plies which have reinforcement members crossing at an angle. The reinforcement members within each belt ply are arranged substantially parallel to and spaced apart from one another and are embedded in rubber material. The belt has at least one first belt ply, the reinforcement members of which are formed by ultra-tensile steel monofilaments having a tensile strength of 3080 N/mm 2 to 4190 N/mm 2 . The steel monofilaments have a diameter D of 0.33 mm to 0.37 mm. This provides, at lower cost, a pneumatic vehicle tyre with low rolling resistance, by way of simultaneously simplified production. This is achieved in that the steel monofilaments have a torsion value of approximately zero windings in the case of a length dimension of 200 times the diameter of the steel monofilament.", "detailed_description": [""], "claims": ["a first belt ply of the two or more belt plies has the reinforcement members formed by steel monofilaments each having a diameter D of 0.33 mm to 0.37 mm and a tensile strength of 3080 N/mm the steel monofilaments in the first belt ply each have a torsion value of zero windings in the case of a length dimension of 200 times the diameter of the steel monofilament, and the steel monofilaments in the first belt ply are arranged with 90 epdm to 130 epdm.", "the first belt ply, under load in the direction of the reinforcement member ply extent, has a layer strength in the region of A*(4400-2000*D)*(D/2)", "the first belt ply, at a predefined elongation of 1% in the direction of the reinforcement member longitudinal extent, has a stress of B*(4400-2000*D)*(D/2)", "the steel monofilaments in the first belt ply each have a tensile strength of 3820-2000*D [N/mm", "the steel monofilaments in the first belt ply are arranged with 95 epdm to 120 epdm.", "the steel monofilaments in the first belt ply have a diameter D of 0.34 mm to 0.36 mm.", "the steel monofilaments in the first belt ply have a diameter D of 0.35 mm.", "the steel monofilaments in the first belt ply each have a diameter D of 0.35 mm, and have a breaking strength of 350 N to 360 N, and an elongation of 1% in response to a force of 204 N to 242 N.", "the steel monofilaments in the first belt ply have a diameter D of 0.35 mm, the steel monofilaments in the first belt ply are arranged with 90 epdm to 100 epdm.", "every belt ply of the tire has reinforcement members crossing one another at an angle, the reinforcement members within each belt ply arranged parallel to and spaced apart from one another and are embedded in rubber material, the reinforcement members formed by steel monofilaments each having a diameter D of 0.33 mm to 0.37 mm and a tensile strength of 3080 N/mm", "every belt ply of the tire has a same construction as the first belt ply.", "the tire has only two belt plies have the same construction.", "the tire is configured as a passenger motor vehicle tire, a van tire, a light truck tire, a utility vehicle tire or a motorcycle tire.", "the first belt ply, under load in the direction of the reinforcement member ply extent, has a layer strength in the region of A*(4400-2000*D)*(D/2) the first belt ply, at a predefined elongation of 1% in the direction of the reinforcement member longitudinal extent, has a stress of B*(4400-2000*D)*(D/2)", "the steel monofilaments in the first belt ply are arranged with 95 epdm to 120 epdm.", "every belt ply of the tire has a same construction as the first belt ply.", "wherein all of the belt plies of the tire have: the reinforcement members formed by steel monofilaments each having a diameter D of 0.33 mm to 0.37 mm and a tensile strength of 3080 N/mm the steel monofilaments each have a torsion value of zero windings in the case of a length dimension of 200 times the diameter of the steel monofilament.", "the steel monofilaments are arranged with 90 epdm to 130 epdm."], "bibtex": "@patent{20240051341,\n    title = {PNEUMATIC VEHICLE TYRE WITH A BELT PLY HAVING STEEL MONOFILAMENTS},\n    number = {20240051341},\n    year = {2024},\n    note = {File: US20240051341A1-20240215.XML}\n    }", "classification": "B60C900FI"}, {"title": "TIRE", "doc_number": "20240051342", "filename": "US20240051342A1-20240215.XML", "abstract": "A belt layer includes at least one belt ply. The belt ply has a single-wire cord having a short diameter SD and a long diameter LD with a ratio SD/LD between the short diameter SD and the long diameter LD being less than 1.00, and a topping rubber covering the single-wire cord. The single-wire cord is disposed so that a direction of the short diameter SD is oriented to a thickness direction of the belt ply. The topping rubber has a complex elastic modulus (E*) of from 7 MPa to 20 MPa under a condition of temperature of 70° C., initial strain of 10%, an amplitude of dynamic strain of ±1.0%, and a frequency of 10 Hz.", "detailed_description": [""], "claims": ["the belt layer includes at least one belt ply, the at least one belt ply includes a single-wire cord having a short diameter SD and a long diameter LD with a ratio SD/LD between the short diameter SD and the long diameter LD being less than 1.00, and a topping rubber covering the single-wire cord, the single-wire cord is disposed so that a direction of the short diameter SD is oriented to a thickness direction of the belt ply, and the topping rubber has a complex elastic modulus (E*) of from 7 MPa to 20 MPa under a condition of temperature of 70° C., initial strain of 10%, an amplitude of dynamic strain of ±1.0%, and a frequency of 10 Hz.", "2 . The tire according to claim 1 , wherein the complex elastic modulus (E*) is from 9 MPa to 20 MPa.", "3 . The tire according to claim 1 , wherein the short diameter SD is from 0.15 mm to 0.42 mm.", "4 . The tire according to claim 3 , wherein the short diameter SD is from 0.15 mm to 0.35 mm.", "5 . The tire according to claim 1 , wherein the ratio SD/LD of the single-wire cord is 0.70 or less.", "6 . The tire according to claim 5 , wherein the ratio SD/LD of the single-wire cord is 0.50 or less.", "7 . The tire according to claim 1 , wherein the belt layer has a plurality of said belt plies.", "8 . The tire according to claim 7 , wherein a distance (rubber thickness) (D) between the single-wire cords between the plurality of belt plies is from 0.30 mm to 1.05 mm.", "9 . The tire according to claim 8 , wherein a difference (D-SD) between the distance (D) and the short diameter SD is from 0.20 mm to 0.45 mm.", "the tread portion has a tread rubber having a groove formed in an outer surface, and a minimum rubber thickness from a bottom of the groove to the single-wire cord is from 1.0 mm to 4.0 mm."], "bibtex": "@patent{20240051342,\n    title = {TIRE},\n    number = {20240051342},\n    year = {2024},\n    note = {File: US20240051342A1-20240215.XML}\n    }", "classification": "B60C920FI"}]