[{"title": "HUB ASSEMBLY FOR A HUB FOR A BICYCLE WHEEL, COMPENSATING ELEMENT FOR SAME, HUB, AND BICYCLE WHEEL", "doc_number": "20240391273", "filename": "US20240391273A1-20241128.XML", "abstract": "In an embodiment a hub assembly includes an axle and a hub body, wherein the axle extends through the hub body in a longitudinal direction, wherein the hub body is rotatably supported relative to the axle via at least one rolling bearing, an end body fixed to or on the axle on a side of the rolling bearing facing away from the hub body, wherein a bearing section of the end body facing the rolling bearing as seen in the longitudinal direction is arranged on the inner ring of the rolling bearing and a compensating element arranged between the bearing section of the end body and the inner ring of the rolling bearing and/or between the bearing section of the hub body and the outer ring of the rolling bearing, wherein the compensating element has a variable extension when viewed in the longitudinal direction.", "detailed_description": ["FIG.1shows a lateral sectional view of a preferred embodiment of the hub assembly2according to the invention and of a hub200according to the invention.", "", "Specifically shown here are a hub assembly2and a hub200for the front wheel of a racing bike. The hub assembly2is designed to accommodate a thru axle (not shown) with the dimensions 100×12 mm.", "", "The hub assembly2further comprises a total of 24 spoke holes4to accommodate so-called straight-pull spokes (not shown).", "", "The hub assembly2is shown facing against the direction of travel. Therefore, a brake disk mount6according to the centerlock standard can here be seen on the right side. The brake disk mount6comprises an external multi-tooth profile61and an internal thread62for the retaining ring (not shown).", "", "The hub assembly2for the hub200further comprises an axle8and a hub body10, wherein the axle8extends through the hub body10in a longitudinal direction L.", "", "The axle8is hollow here, namely designed as a simple hollow cylinder. This is possible in particular within a design to accommodate a thru axle.", "", "The hub body10is supported for rotation relative to the axle8by two opposing rolling bearings12. An inner ring121of each rolling bearing12is arranged on the axle8, and an outer ring122of each rolling bearing12is arranged in the hub body10.", "", "In this case, a bearing section101of the hub body10facing the respective rolling bearing12as viewed in the longitudinal direction L is arranged on the outer ring122of the rolling bearing12.", "", "The bearing section101of the hub body10and the hub body10are manufactured in one piece, with the bearing section101corresponding to a circular shoulder or stop in the hub body10.", "", "Furthermore, the bearing section101of the hub body10is arranged on the inner side I of the outer ring122of the rolling bearing12.", "", "There is an end body14at each of the two longitudinal ends of the axle8, which is fixed to the axle8on the side of the respective rolling bearing12which is facing away from the hub body10.", "", "The end bodies14are presently designed as end caps141for the axle8. The end caps141have corresponding passages at the ends and are thus also configured, like the axle8, to accommodate a thru axle.", "", "One end cap141has an undersize relative to the axle8, so that the end caps141are pushed or pressed onto the axle8.", "", "In this case, a bearing section142of the end body14, namely of the end cap141, which faces the rolling bearing12as viewed in the longitudinal direction L, is arranged on the inner ring121of the rolling bearing12.", "", "Furthermore, the bearing section142of the end body14is arranged on the outer side A of the inner ring121of the rolling bearing12.", "", "The bearing section142of the end body14also corresponds to an end of the end body14related to the longitudinal direction L, or as seen in the longitudinal direction L.", "", "A gap16with a gap width161(seeFIG.3) of preferably approx. 0.1-0.2 mm exists between the bearing section142of the end body14and the inner ring121.", "", "The axle8comprises no shoulder on the inside I of the inner ring121of the rolling bearing12. The inner ring121is displaceable on the axle8due to the effect of a force acting in the longitudinal direction L.", "", "In particular, the inner ring121is displaceable on the axle8due to the change in the length of the axle8.", "", "Due to a compression or a relieving of the axle8in the longitudinal direction L, the gap16may become smaller or disappear completely, or on the other hand may be enlarged. This can lead to the disadvantages already described.", "", "Therefore, here a compensating element18is arranged between the bearing section142of the end body14and the inner ring121of the rolling bearing12, which has a variable extension when viewed in the longitudinal direction L.", "", "The compensating element18is arranged in such a way that it can absorb or compensate for the change in a gap width161(seeFIG.3) between the bearing section142of the end body14and the inner ring121.", "", "The compensating element18is in direct contact with both the inner ring121and the bearing section142.", "", "In this case, the compensating element18comprises resilient properties in relation to the longitudinal direction L. The material also has damping properties.", "", "Here, the compensating element18is an O-ring made of flexible plastic material. A sealing ring made of suitable material can be used for this purpose, for example.", "", "The compensating element18is in annular contact with the axle8and along the circumference of both the inner ring121and the bearing section142.", "", "FIG.2shows a magnified representation of the section Y fromFIG.1, where the position of the compensating element18between the bearing section142of the end body14, the axle8and the inner ring121of the rolling bearing12can be clearly seen. The compensating element18contacts both the bearing section142and the inner ring121and can thus absorb, cushion and dampen changes in the width161of the gap16(seeFIG.3).", "", "FIG.3shows a magnified representation of the section Z fromFIG.2. The gap16with the gap width161between the bearing section142and the inner ring121is clearly visible here."], "claims": ["1 .- 34 . (canceled)", "an axle; a hub body, wherein the axle extends through the hub body in a longitudinal direction, wherein the hub body is rotatably supported relative to the axle via at least one rolling bearing, wherein an inner ring of the rolling bearing is arranged on the axle and an outer ring of the rolling bearing is arranged on or in the hub body, and wherein a bearing section of the hub body facing the rolling bearing as viewed in the longitudinal direction is arranged on the outer ring of the rolling bearing; an end body fixed to or on the axle on a side of the rolling bearing facing away from the hub body, wherein a bearing section of the end body facing the rolling bearing as seen in the longitudinal direction is arranged on the inner ring of the rolling bearing; and a compensating element arranged between the bearing section of the end body and the inner ring of the rolling bearing and/or between the bearing section of the hub body and the outer ring of the rolling bearing, wherein the compensating element has a variable extension when viewed in the longitudinal direction.", "wherein the axle is hollow, and/or wherein the axle is a hollow cylinder.", "37 . The hub assembly according to claim 35 , wherein the axle and the end body are configured to receive a thru axle or a quick-release.", "38 . The hub assembly according to claim 35 , wherein the axle comprises no shoulder on an inner side of the inner ring of the rolling bearing.", "wherein the bearing section of the hub body and the hub body are one piece, and/or wherein the bearing section of the hub body is arranged on an inner side of the outer ring of the rolling bearing, and/or wherein the bearing section of the hub body corresponds to an end of the hub body related to the longitudinal direction.", "40 . The hub assembly according to claim 35 , wherein the inner ring of the rolling bearing has a sliding fit relative to the axle.", "wherein the inner ring of the rolling bearing is displaceable on the axle due to a force acting in the longitudinal direction, and/or wherein the inner ring of the rolling bearing is displaceable on the axle due to a change in length of the axle.", "42 . The hub assembly according to claim 35 , wherein the end body is an end cap for the axle.", "43 . The hub assembly according to claim 42 , wherein the end cap has an undersize relative to the axle so that it is pushable or pressable onto the axle.", "wherein the bearing section of the end body is arranged on an outside of the inner ring of the rolling bearing, and/or wherein the bearing section of the end body corresponds to an end of the end body relative to the longitudinal direction.", "45 . The hub assembly according to claim 35 , further comprising a gap between the bearing section of the end body and the inner ring of the rolling bearing.", "46 . The hub assembly according to claim 35 , further comprising a gap between the bearing section of the hub body and the outer ring of the rolling bearing.", "47 . The hub assembly according to claim 35 , wherein the compensating element abuts directly on the inner ring or on the outer ring of the rolling bearing.", "48 . The hub assembly according to claim 35 , wherein the compensating element is arranged such that it absorbs or compensates for a change in a gap width between the bearing section of the end body and the inner ring, or between the bearing section of the hub body and the outer ring, respectively.", "49 . The hub assembly according to claim 48 , wherein the change in the gap width is brought about by a change in a length of the axle.", "50 . The hub assembly according to claim 49 , wherein a width of the gap is between 0.05 and 0.25 mm, inclusive.", "wherein the compensating element has resilient properties and/or damping properties with respect to the longitudinal direction, and/or wherein the compensating element is made of plastic, of a rubber material, of metal, or of a mixture or a composite of at least two of these, and/or wherein the compensating element comprises a steel spring, a wave washer or a leaf spring.", "52 . The hub assembly according to claim 35 , wherein a plurality of compensating elements are arranged along a circumference of the inner ring or the outer ring of the rolling bearing.", "53 . The hub assembly according to claim 35 , wherein the compensating element is annular and arranged along a circumference of the inner ring or the outer ring of the rolling bearing.", "wherein the compensating element is an O-ring, and/or wherein the compensating element abuts annularly on the axle, and/or on the hub body, and/or wherein a cross-section of the compensating element as seen perpendicularly to its circumference is round, oval or angular."], "bibtex": "@patent{20240391273,\n    title = {HUB ASSEMBLY FOR A HUB FOR A BICYCLE WHEEL, COMPENSATING ELEMENT FOR SAME, HUB, AND BICYCLE WHEEL},\n    number = {20240391273},\n    year = {2024},\n    note = {File: US20240391273A1-20241128.XML}\n    }", "classification": "B60B2702FI"}, {"title": "AUTOMOTIVE WHEEL WITH TOOL-LESS LUG AND INTEGRATED LUG WRENCH", "doc_number": "20240391274", "filename": "US20240391274A1-20241128.XML", "abstract": "A wheel assembly may include a wheel body having a body portion, a center lug member operably coupled to the wheel body for rotation to alternately tighten or loosen the wheel body with respect to a wheel hub of a vehicle on which the wheel body is mountable, and a lever arm having a storage position in or proximate to the wheel body and an operating position to which the lever arm is moved from the storage position to enable the center lug member to be rotated responsive to rotation of the lever arm.", "detailed_description": ["Some example embodiments now will be described more fully hereinafter with reference to the accompanying drawings, in which some, but not all example embodiments are shown. Indeed, the examples described and pictured herein should not be construed as being limiting as to the scope, applicability or configuration of the present disclosure. Rather, these example embodiments are provided so that this disclosure will satisfy applicable requirements. Like reference numerals refer to like elements throughout. Furthermore, as used herein, the term “or” is to be interpreted as a logical operator that results in true whenever one or more of its operands are true. As used herein, operable coupling should be understood to relate to direct or indirect connection that, in either case, enables functional interconnection of components that are operably coupled to each other.", "", "FIG.1illustrates a block diagram of a vehicle suspension system100in accordance with an example embodiment. The vehicle suspension system100may be operably coupled to a vehicle body, and may support the vehicle body stable while driving by allowing wheels of the vehicle to articulate independently of the vehicle body when driving on uneven driving surfaces or encountering discontinuities while driving on even surfaces. The vehicle suspension system100may be employed on a vehicle having any suitable type of propulsion, including battery electric vehicles (BEVs), vehicles powered by internal combustion engines (ICEs), and various hybrid technologies as well.", "", "The vehicle suspension system100may include a vehicle chassis110, a wheel120, and a suspension assembly130that operably couples the wheel120to the vehicle chassis110. In some embodiments, the vehicle chassis110may be the frame or platform to which the body of the vehicle is operably coupled. In some other cases, the vehicle chassis110may be integrated into the vehicle body. In an example embodiment, the wheel120may include a wheel body122and a tire124. The tire124may typically be an air-filled or pneumatic tire. However, in other cases, the tire may be an airless tire (e.g., Tweel).", "", "The tire124may, in all cases, define the contact patch between the wheel120and the driving surface upon which the vehicle operates. The contact patch may therefore be understood to define a circular circumference that is radially displaced from a center that defines an axis of rotation of the wheel120. The radial displacement may be provided by the wheel body122, which may include radial spokes or other radially extending structures that extend away from the axis of rotation and out to the tire124. Thus, as used herein, the wheel body122may refer to either a portion or an entirety of the structure that extends from the axis of rotation of the wheel120to the tire124or contact patch of the wheel120.", "", "In an example embodiment, the suspension assembly130may operably couple the wheel120to the vehicle chassis110via various structures or components that provide support that is flexible or resilient, yet rigid enough to provide a relatively smooth transit over various terrain types or features that may be encountered. Thus, for example, the suspension assembly130may include springs, dampers, links, suspension arms, linkages, knuckles, and/or the like. In an example embodiment, the suspension assembly130may include a wheel hub that is operably coupled to brake system components as well, as will be seen in more detail inFIG.3below.", "", "The wheel body122may include a center lug member140that is operable via an integral wrench142to tighten the wheel body122(and wheel120) onto the suspension assembly130. The integral wrench142may be considered “integral” in this instance due to the fact that the integral wrench142provides a lever arm for acting as a wrench to tighten or loosen the center lug member140that is permanently retained at and with the wheel body122before, during and after use. As such, the storage position and operating position of the integral wrench142are at or in the wheel body122and the integral wrench142is, although movable relative to at least a portion of the wheel body122, a necessary component required to make a wholly functional wheel body122. Thus, for example, removal of the integral wrench142(e.g., to store or use it in another location) would render the wheel body122incomplete as a functional unit.", "", "In some embodiments, the integral wrench142may include or be operably coupled to a ratchet assembly144that provides for driving rotation of the center lug member140only in one direction (and ratcheting in the opposite direction). Moreover, in some cases, the ratchet assembly144may actually be located within or as a portion of the center lug member140. The driving direction of the ratchet assembly144may be selectable via a selector. The integral wrench142may be moved, pivoted or folded in some cases between a storage position (e.g., located in a pocket146formed in a portion of the wheel body122) and an operating position (e.g., located out of the pocket146). The integral wrench142may also be locked within the pocket146and/or the center lug member140may be locked via a locking assembly150.", "", "In an example embodiment, the locking assembly150may include physical structures that are rotatable or engaged manually due to operator action. For example, the locking assembly150may include a latch structure, or other lock. However, in some cases, the locking assembly150may be magnetic. Thus, for example, a magnet may be located in the pocket146to attract the integral wrench142and retain the integral wrench142in the storage position within the pocket146unless manually rotated or folded out of the storage position to the operating position by the operator overcoming the attractive force of the magnet. The center lug member140may, in some cases, also include a magnet integrated therein to hold the center lug member140on or proximate to the wheel hub of the suspension assembly130to facilitate starting threaded engagement between the center lug member140and the wheel hub.", "", "Although not required, in some cases, a lighting assembly160may be provided to direct a light at, or generally provide light in the vicinity of, the center lug member140. Thus, in some embodiments, the lighting assembly160may include one or more lights (e.g., low voltage lighting or LED lighting) that are provided in a wheel well of the vehicle, and oriented to direct light toward the center lug member140. In such cases, a power source162(e.g., the vehicle battery) may provide power to the lighting assembly160via relatively simple wired connection. However, in some cases, the lighting assembly160could be located at, or integrated into, the wheel body122. In such examples, the power source162may still be the vehicle battery. However, a more complex electrical connection may be provided through the wheel hub of the suspension assembly130. The structure and operation of some of the components described above, such as the wheel body122, the center lug member140and the integral wrench142, for example, will be described in greater detail below in reference to some examples shown inFIGS.2-4.", "", "In this regard,FIG.2illustrates a side view of a wheel body200of an example embodiment in greater detail. Thus, the wheel body200is an example of wheel body122inFIG.1. The wheel body200includes a body portion210, which extends radially outward from an axis of rotation220of the wheel body200to a wheel rim230, at which a tire (e.g., the tire124ofFIG.1) may be mounted. The wheel body200further includes a center lug member240(e.g., an example of center lug member140ofFIG.1) that is disposed coaxial with the axis or rotation220. The center lug member240may be rotatable within the body portion210, but otherwise may be retained in the body portion210such that it is generally not removable (at least from the outside). The center lug member240may be configured either as a lug nut (i.e., a threaded fastener that attaches to a threaded protrusion coaxial with the axis of rotation220) or a lug bolt (i.e., a threaded bolt that inserts into a threaded receiver coaxial with the axis of rotation220).", "", "The center lug member240is operably coupled to an integral wrench250(an example of integral wrench142ofFIG.1), and is rotatable responsive to corresponding rotation of the integral wrench250when the integral wrench250is not disposed within a pocket260formed in the body portion210. The pocket260may be shaped complementary to a shape of the integral wrench250so that the integral wrench250fits into the pocket260without leaving substantial excess space along outer edges of the integral wrench250between the integral wrench250and the body portion210.", "", "In the example shown, the body portion210may have a number of aesthetic design elements270formed thereon to better the appearance or appeal of the wheel body200. The aesthetic design elements270could be functional as well in some cases (e.g., spokes), but in other cases the aesthetic design elements270may have no function beyond appearance. The aesthetic design elements270may be formed to extend away from the axis of rotation220with relatively equal radial spacing therebetween to generate an appealing appearance. In some embodiments, the integral wrench250may be formed to have a shape similar to that of the aesthetic design elements270such that, in the side view ofFIG.2at least, the integral wrench250appears to be one of the aesthetic design elements270when in the storage position within the pocket260.", "", "Although not required, the integral wrench250may be locked in the pocket260by a locking lever280, which is shown in a locked position inFIG.2. In this regard, the locking lever280(which is an example of the locking assembly150ofFIG.1) is pivoted or rotated to a position where it extends from a part of the body portion210that is adjacent to the pocket260over a portion of the pocket260to retain the integral wrench250in the pocket260. The locking lever280is rotatable or pivotable in the direction of arrow282to be entirely over or proximate to the body portion210thereby no longer blocking the integral wrench250to retain the integral wrench250in the pocket260. The integral wrench250may then be manually removed from the pocket260to permit rotation thereof to tighten or loosen the center lug member240.", "", "As discussed above, the center lug member240may be rotatable within the body portion210while retaining the body portion210(and therefore the wheel body200) in attachment to the vehicle (e.g., via wheel hub300ofFIG.3. Notably,FIG.3is a perspective view of the wheel body200with physical walls of the body portion210removed to facilitate a view of components otherwise located behind or in the body portion210.FIG.3therefore illustrates the integral wrench250in the storage position, which would be in the pocket260. However, the pocket260is not visible since the body portion210is removed. A location of an outer rim230′ and inner rim230″ is however shown to provide a frame of reference.", "", "The removal of the body portion210(by effectively making it transparent) specifically enables a view of the wheel hub300upon which the wheel body200is mounted. In this example, the wheel hub300also includes a brake rotor310of a brake system operably coupled thereto. However, other brake components may be used in other examples, so again the brake rotor310merely provides a frame of reference for component location in one example embodiment. As shown inFIG.3, the wheel hub300may extend through the brake rotor310to present a distal end thereof for engagement with the center lug member240. As mentioned above, the center lug member240could take the form of either a nut or bolt, and the wheel hub300may have complementary engagement threads in either alternative.", "", "The integral wrench250may be rotated or pivoted in the direction shown by arrow320about a pivot connection330formed with the center lug member240. When in the position shown inFIG.3, the integral wrench250is in the storage position within the pocket260(not shown inFIG.3, but otherwise visible inFIG.2). When rotated about the pivot connection330out of the pocket260, the integral wrench250may be rotated to either tighten or loosen the center lug member240. Moreover, in some cases, the center lug member240may include directional indicia340provided thereon to indicate which direction to rotate for tightening and/or loosening the center lug member240. In examples in which the center lug member240further employs magnetism to assist in holding the center lug member240proximate to the wheel hub300(e.g., during alignment thereof), the center lug member240may also have indicia350to notify the operator of the magnetic assistance. Additionally, as noted above, the center lug member240may be locked (e.g., when in the storage position). In the depicted example, a key lock360may be provided to provide a projection and corresponding receiver for the center lug member240and a portion of the wheel hub300that when aligned, and when the pivot connection330is rotated to the storage position, will lock the center lug member240to prevent rotation thereof in either direction. In some cases, the pivot connection330may have a shoulder portion or other portion thereof that exerts a force on the key lock360to urge the key lock360toward an opposite end of the wheel hub300from the end of the wheel hub300that the center lug member240engages.", "", "FIG.4illustrates a side view of the center lug member240and a portion of the integral wrench250that is proximate and operably coupled thereto.FIG.4illustrates the movement of the integral wrench250between the storage position (shown in solid lines and labeled250′) and the operating position (shown in dashed lines). In the storage position, the integral wrench250may be in the pocket260and may lie in a same plane as a portion of the body portion210(assuming the body portion210is planar at some portion thereof). Given that the body portion210may not always be planar, in some embodiments, the integral wrench250may translate between being substantially conformal with an external (and outwardly facing) surface of the body portion210when in the storage position to not being conformal when in the operating position. However, even while stowed in the pocket260, some portions of the integral wrench250may not be conformal in some designs. In any case, when rotated to the operating position, the integral wrench250may be out of the same plane or no longer conformal, and is certainly out of the pocket260, thereby allowing rotation of the integral wrench250. In some embodiments, the angle of pivoting of the integral wrench250between the storage position and the operating position may be about 15 degrees. However, some embodiments may rotate in a range between 10 and 35 degrees.", "", "In some embodiments, the center lug member240itself may have an inner body400and an outer body410. In such cases, the inner body400and outer body410may be operably coupled to each other by, for example, the ratchet assembly144ofFIG.1. The inner body400may physically interact with the wheel hub300(e.g., via threaded connection), and the outer body410may physically interact with the integral wrench142. The inner body400may be driven, responsive to rotation of the integral wrench250) in a direction determined by selection of the selector of the ratchet assembly144. In some examples, the outer body410may translate axially away from the wheel hub300at least some amount when the integral wrench250is folded or pivoted out of the pocket260. Such axial movement may unlock the center lug member240in some cases and/or may provide further clearance to permit full rotation of the integral wrench250without interference from the pocket260.", "", "However, it should also be appreciated that no pocket260may be employ at all in some embodiments. In such embodiments, it may be the case that the aesthetic design elements270are disposed atop an outer surface of the body portion210, and therefore extend axially away from the body portion210. The integral wrench250may therefore sit proximate to the body portion210instead of being inset therein in any pocket.", "", "Some example embodiments may also provide the center lug member240with a retention member420that may interface with lip, protrusion, channel, or other retaining feature on the body portion210or some other part of the wheel body200. In the depicted example, the retention member420may be a annular projection extending around a circumference of a portion of the center lug member240. The retention member420may prevent withdrawal of the center lug member240from the wheel body200. However, in some cases, the retention member420may be keyed to only permit withdrawal from the wheel body200when keyed portions of the retention member420are aligned with corresponding slots that permit extraction of the center lug member240from the wheel body200. In either case, the center lug member240remains fully rotatable when inserted into the wheel body200.", "", "In the examples ofFIGS.2and3, the integral wrench250is a lever arm that is formed with a first and second end that extend radially outwardly from the axis of rotation220. In this regard, the first end is at the axis of rotation220, and the second end is displaced from the axis of rotation220by the length of the lever arm. However, alternative constructions are possible, and the lever arm need not terminate at the axis of rotation220. In this regard, for example,FIG.5illustrates an alternative embodiment in which the lever arm is longer than the distance from the axis of rotation220to the second end. Thus, for example, the axis of rotation220is located at some middle portion of the lever arm instead of at an end of the lever arm. In this regard, the wheel body500ofFIG.5has a body portion510that may have an axis of rotation520and rim530similar to those described above. However, instead of the lever arm of integral wrench550extending directly at one end thereof from center lug member540, the center lug member540is engaged by the integral wrench550at an interior portion of the integral wrench550. Although not a middle portion, the interior portion at which the engagement between the lever arm and the center lug member540occurs could be at a middle portion in other embodiments, and still other constructions are also possible.", "", "A vehicle suspension system may therefore be provided. The vehicle suspension system may include a vehicle chassis, a wheel assembly, and a suspension assembly operably coupling the wheel assembly to the vehicle chassis. The wheel assembly may include a wheel body having a body portion, a center lug member operably coupled to the wheel body for rotation to alternately tighten or loosen the wheel body with respect to a wheel hub of a vehicle on which the wheel body is mountable, and a lever arm having a storage position in or proximate to the wheel body and an operating position to which the lever arm is moved from the storage position to enable the center lug member to be rotated responsive to rotation of the lever arm.", "", "The vehicle suspension system (and more particularly the wheel body) of some embodiments may include additional features, modifications, augmentations and/or the like to achieve further objectives or enhance performance of the system. The additional features, modifications, augmentations and/or the like may be added in any combination with each other. Below is a list of various additional features, modifications, and augmentations that can each be added individually or in any combination with each other. For example, the wheel body may include a pocket formed in the body portion, and the lever arm may be disposed in the pocket in the storage position and pivoted out of the pocket in the operating position. In an example embodiment, the pocket may be complementary in shape to the lever arm. In some cases, the lever arm may be conformal with the wheel body when in the storage position. In an example embodiment, the lever arm may have a first end and a second end, and the first end may be operably coupled to the center lug member proximate to an axis of rotation of the center lug member and the second end is disposed radially outward from the axis by a distance substantially equal to a length of the lever arm. As an alternative, the lever arm may be operably coupled to the center lug member proximate to an axis of rotation of the center lug member and the second end is disposed radially outward from the axis by a distance substantially less than a length of the lever arm. In an example embodiment, the wheel body may further include a locking assembly that locks the center lug member responsive to the lever arm being in the storage position. In some cases, the wheel body further includes a locking assembly that locks the lever arm in the storage position. In an example embodiment, the lever arm may drive the center lug member only in a selected direction based on operation of a ratchet assembly. In some cases, the center lug member may be magnetically attracted to the wheel hub via a magnet. In an example embodiment, the wheel body may further include a lighting assembly disposed to direct light toward the center lug member. Alternatively or additionally, a torque sensor may be operably coupled to the center lug member and the lighting assembly may display information about a torque of the center lug member via the lighting assembly. In an example embodiment, the lever arm may rotate or pivot between about 10 degrees and 30 degrees between the storage position and the operating position.", "", "Many modifications and other embodiments of the inventions set forth herein will come to mind to one skilled in the art to which these inventions pertain having the benefit of the teachings presented in the foregoing descriptions and the associated drawings. Therefore, it is to be understood that the inventions are not to be limited to the specific embodiments disclosed and that modifications and other embodiments are intended to be included within the scope of the appended claims. Moreover, although the foregoing descriptions and the associated drawings describe exemplary embodiments in the context of certain exemplary combinations of elements and/or functions, it should be appreciated that different combinations of elements and/or functions may be provided by alternative embodiments without departing from the scope of the appended claims. In this regard, for example, different combinations of elements and/or functions than those explicitly described above are also contemplated as may be set forth in some of the appended claims. In cases where advantages, benefits or solutions to problems are described herein, it should be appreciated that such advantages, benefits and/or solutions may be applicable to some example embodiments, but not necessarily all example embodiments. Thus, any advantages, benefits or solutions described herein should not be thought of as being critical, required or essential to all embodiments or to that which is claimed herein. Although specific terms are employed herein, they are used in a generic and descriptive sense only and not for purposes of limitation."], "claims": ["a wheel body having a body portion; a center lug member operably coupled to the wheel body for rotation to alternately tighten or loosen the wheel body with respect to a wheel hub of a vehicle on which the wheel body is mountable; and a lever arm having a storage position in or proximate to the wheel body and an operating position to which the lever arm is moved from the storage position to enable the center lug member to be rotated responsive to rotation of the lever arm.", "wherein the lever arm is disposed in the pocket in the storage position and pivoted out of the pocket in the operating position.", "3 . The wheel assembly of claim 2 , wherein the pocket is complementary in shape to the lever arm.", "4 . The wheel assembly of claim 2 , wherein the lever arm is conformal with the wheel body when in the storage position.", "wherein the first end is operably coupled to the center lug member proximate to an axis of rotation of the center lug member and the second end is disposed radially outward from the axis by a distance substantially equal to a length of the lever arm.", "wherein the lever arm is operably coupled to the center lug member proximate to an axis of rotation of the center lug member and the second end is disposed radially outward from the axis by a distance substantially less than a length of the lever arm.", "wherein the locking assembly locks the center lug member responsive to the lever arm being in the storage position.", "wherein the locking assembly locks the lever arm in the storage position.", "9 . The wheel assembly of claim 1 , wherein the lever arm drives the center lug member only in a selected direction based on operation of a ratchet assembly.", "10 . The wheel assembly of claim 1 , wherein the center lug member is magnetically attracted to the wheel hub via a magnet.", "11 . The wheel assembly of claim 1 , further comprising a lighting assembly disposed to direct light toward the center lug member.", "12 . The wheel assembly of claim 1 , further comprising a torque sensor operably coupled to the center lug member and a lighting assembly to display information about a torque of the center lug member via the lighting assembly.", "13 . The wheel assembly of claim 1 , wherein the lever arm rotates or pivots between about 10 degrees and 30 degrees between the storage position and the operating position.", "a vehicle chassis; a wheel assembly; and a suspension assembly operably coupling the wheel assembly to the vehicle chassis, wherein the wheel assembly comprises: a wheel body; a center lug member operably coupled to the wheel body for rotation to alternately tighten or loosen the wheel body with respect to a wheel hub of a vehicle on which the wheel body is mountable; and a lever arm having a storage position in or proximate to the wheel body and an operating position to which the lever arm is moved from the storage position to enable the center lug member to be rotated responsive to rotation of the lever arm.", "wherein the lever arm is disposed in the pocket in the storage position and pivoted out of the pocket in the operating position.", "wherein the lever arm is conformal with the wheel body when in the storage position.", "wherein the first end is operably coupled to the center lug member proximate to an axis of rotation of the center lug member and the second end is disposed radially outward from the axis by a distance substantially equal to a length of the lever arm, or wherein the lever arm is operably coupled to the center lug member proximate to an axis of rotation of the center lug member and the second end is disposed radially outward from the axis by a distance substantially less than a length of the lever arm.", "wherein the locking assembly locks the center lug member responsive to the lever arm being in the storage position, or wherein the locking assembly locks the lever arm in the storage position.", "19 . The vehicle suspension system of claim 14 , wherein the lever arm drives the center lug member only in a selected direction based on operation of a ratchet assembly.", "20 . The vehicle suspension system of claim 14 , wherein the center lug member is magnetically attracted to the wheel hub via a magnet."], "bibtex": "@patent{20240391274,\n    title = {AUTOMOTIVE WHEEL WITH TOOL-LESS LUG AND INTEGRATED LUG WRENCH},\n    number = {20240391274},\n    year = {2024},\n    note = {File: US20240391274A1-20241128.XML}\n    }", "classification": "B60B2706FI"}, {"title": "Means for fixing swivel wheels of non-motorized vehicle in parallel to one direction Description", "doc_number": "20240391275", "filename": "US20240391275A1-20241128.XML", "abstract": "A parallel fixation means for fixing two swivel wheels of a non-motorized vehicle in parallel to one direction that includes a rigid strip with connecting means for connecting the parallel fixation means to a body of the non-motorized vehicle and two locking means to be mounted on the two swivel wheels and to fix them in parallel to the one direction for preventing a rotation of the swivel wheels. The two locking means are connected to the rigid strip by means of pivot connections to be in a fixed direction or in a loose and free to rotate position. When the pivot connections are in the fixed direction the two swivel wheels are fixed in the one direction, and when the pivot connections are in the loose and free to rotate position the two swivel wheels are free to function as swivel wheels.", "detailed_description": [""], "claims": ["1 . A parallel fixation means for fixing two swivel wheels of a non-motorized vehicle in parallel to one direction; wherein the parallel fixation means comprises a rigid strip that includes connecting means for connecting the parallel fixation means to a body of the non-motorized vehicle and two locking means that are designed to be mounted on the two swivel wheels and fix them in parallel to the one direction for preventing a rotation of said two swivel wheels.", "2 . The parallel fixation means of claim 1 wherein said two locking means are connected to said rigid strip by means of pivot connections that are designed to be in a fixed direction or in a loose and free to rotate position; wherein when the pivot connections are in the fixed direction said two swivel wheels are fixed in said one direction; and wherein when the pivot connections are in the loose and free to rotate position the two swivel wheels are free to function as swivel wheels.", "3 . A non-motorized vehicle that comprises a body, at least two swivel wheels that are connected by screws to a bottom of the non-motorized vehicle, and a parallel fixation means that fix the at least two swivel wheels in parallel to one direction; wherein said parallel fixation means comprises a rigid strip which includes connecting means for connecting the parallel fixation means to the body of the vehicle and two locking means that are designed to be mounted on the swivel wheels and fix them in parallel to the one direction for preventing a rotation of said two swivel wheels.", "4 . The non-motorized vehicle of claim 3 wherein said two locking means are connected to said rigid strip by means of pivot connections that are designed to be in a fixed direction or in a loose and free to rotate position; wherein when the pivot connections are in the fixed direction said two swivel wheels are fixed in said one direction; and wherein when the pivot connections are in the loose and free to rotate position the two swivel wheels are free to function as swivel wheels."], "bibtex": "@patent{20240391275,\n    title = {Means for fixing swivel wheels of non-motorized vehicle in parallel to one direction Description},\n    number = {20240391275},\n    year = {2024},\n    note = {File: US20240391275A1-20241128.XML}\n    }", "classification": "B60B3300FI"}, {"title": "TYRE FOR VEHICLE WHEELS", "doc_number": "20240391276", "filename": "US20240391276A1-20241128.XML", "abstract": "The present invention relates to a tyre for vehicle wheels comprising a tread made with a vulcanised elastomeric compound obtained by vulcanising a vulcanisable elastomeric compound comprising: (i) 100 phr of an elastomeric polymer composition comprising, preferably consisting of: a. at least one styrene-butadiene polymer (SBR) in an amount of from 70 to 100 phr, and b. optionally, from 0 to 30 phr of at least one elastomeric polymer selected from the group consisting of isoprene polymer (IR) and butadiene polymer (BR), (ii) from 50 to 100 phr of a mixture of resins and/or plasticising oils, (iii) at least one reinforcing filler in an amount of from 50 to 130 phr, (iv) at least one vulcanising agent in an amount of from 0.1 to 12 phr, and (v) from 0.1 to 5 phr of an organic salt of zinc having the following structural formula (I), wherein the groups R 1 , R 2 and R 3 , equal or different from each other, are a hydrogen atom or a linear or branched alkyl chain comprising from 1 to 10 carbon atoms, preferably from 1 to 8 carbon atoms, and wherein the groups R 1 , R 2 and R 3 comprise a total of from 8 to 10 carbon atoms.", "detailed_description": ["The present invention will be illustrated in further detail by means of an illustrative embodiment with reference to the accompanyingFIG.1, where “a” indicates an axial direction and “r” indicates a radial direction. For simplicity,FIG.1shows only a part of the tyre, the remaining part not shown being identical and disposed symmetrically with respect to the radial direction “r”.", "", "The reference numeral100indicates inFIG.1a tyre for vehicle wheels, which generally comprises a carcass structure101having respectively opposite end flaps engaged with respective annular anchoring structures102, called bead cores, possibly associated with a bead filler104. The tyre area comprising the bead core102and the filler104forms a bead structure103intended for anchoring the tyre onto a corresponding mounting rim, not shown. Each bead structure103is associated to the carcass structure by folding back of the opposite lateral edges of the at least one carcass layer101around the bead core102so as to form the so-called carcass flaps101a as shown inFIG.1.", "", "The carcass structure101is possibly associated with a belt structure106comprising one or more belt layers106a,106bplaced in radial superposition with respect to one another and with respect to the carcass structure101, having typically metal reinforcing cords. Such reinforcing cords may have crossed orientation with respect to a circumferential extension direction of the tyre100. By “circumferential” direction we mean a direction generally facing according to the direction of rotation of the tyre, or in any case slightly inclined with respect to the direction of rotation of the tyre.", "", "The belt structure106further comprises at least one radially external reinforcing layer106cwith respect to the belt layers106a,106b. The radially external reinforcing layer106ccomprises textile or metal cords, disposed according to a substantially zero angle with respect to the circumferential extension direction of the tyre and immersed in the elastomeric material. Preferably, the cords are disposed substantially parallel and side by side to form a plurality of turns. Such turns are substantially oriented according to the circumferential direction (typically with an angle of between 0° and 5°), such direction being usually called “zero degrees” with reference to the laying thereof with respect to the equatorial plane X-X of the tyre. By “equatorial plane” of the tyre it is meant a plane perpendicular to the axis of rotation of the tyre and which divides the tyre into two symmetrically equal parts.", "", "In a radially external position with respect to the carcass structure101and/or if present (as in the illustrated case) to the belt structure106a tread band109in vulcanised elastomeric compound obtained by vulcanisation of the vulcanisable elastomeric compound according to the present invention is applied.", "", "In a radially external position, the tread band109has a rolling portion109aintended to come into contact with the ground. Circumferential grooves, which are connected by transverse notches (not shown inFIG.1) so as to define a plurality of blocks of various shapes and sizes distributed in the rolling portion109a, are generally made in this portion109a, which for simplicity is represented smooth inFIG.1.", "", "To optimise the performance of the tread, the tread band may be made in a two-layer structure.", "", "Such two-layer structure comprises the rolling layer or portion109a(called cap) and a substrate111(called base) forming the so-called cap-and-base structure. It is thus possible to use an elastomeric material capable of providing a low rolling resistance for the cap109aand at the same time high resistance to wear and to the formation of cracks while the elastomeric material of the substrate111may be particularly aimed at a low hysteresis to cooperate in reducing rolling resistance. One or both layers of the cap-and-base structure may be made with a vulcanised elastomeric compound obtained by vulcanising the vulcanisable elastomeric compound according to the present invention. The under-layer111of vulcanised elastomeric compound may be disposed between the belt structure106and the rolling portion109a.", "", "Moreover, respective sidewalls108of vulcanised elastomeric compound are further applied in an axially external position to said carcass structure101, each extending from one of the lateral edges of the tread band109up to the respective bead structure103.", "", "A strip consisting of elastomeric compound110, commonly known as “mini-sidewall”, of vulcanised elastomeric compound may optionally be provided in the connecting zone between sidewalls108and the tread band109, this mini-sidewall generally being obtained by co-extrusion with the tread band109and allowing an improvement of the mechanical interaction between the tread band109and the sidewalls108. Preferably, the end portion of sidewall108directly covers the lateral edge of the tread band109.", "", "In some specific embodiments, such as the one illustrated and described herein, the stiffness of the bead103may be improved by providing a reinforcing layer120generally known as a “flipper” in the tyre bead.", "", "The flipper120is wrapped around the respective bead core102and the bead filler104so as to at least partially surround them. The flipper120is disposed between the carcass layer101and the bead structure103. Usually, the flipper120is in contact with the carcass layer101and said bead structure103. The flipper120typically comprises a plurality of metal or textile cords incorporated in a vulcanised elastomeric compound.", "", "In some specific embodiments, such as the one illustrated and described herein, the bead structure103may further comprise a further protective layer121which is generally known by the term of “chafer”, or protective strip, and which has the function to increase the rigidity and integrity of the bead structure103.", "", "The chafer121usually comprises a plurality of cords incorporated in a vulcanised elastomeric compound; such cords are generally made of textile material (for example aramid or rayon), or of metallic material (for example steel cords).", "", "Optionally, an anti-abrasive strip105is disposed so as to wrap the bead structure103along the axially internal and external and radially internal areas of the bead structure103, thus interposing itself between the latter and the wheel rim when the tyre100is mounted on the rim.", "", "Moreover, a radially internal surface of tyre100is preferably internally lined by a layer of substantially airtight elastomeric material, or so-called liner112.", "", "According to an embodiment not shown, the tyre may be a tyre for motorcycle wheels. The profile of the straight section of the tyre for motorcycle (not shown) has a high transversal curvature since it must guarantee a sufficient footprint area in all the inclination conditions of the motorcycle. The transverse curvature is defined by the value of the ratio between the distance f of the ridge of the tread from the line passing through the laterally opposite ends of the tread itself, measured on the equatorial plane of the tyre, and the width C defined by the distance between the laterally opposite ends of the tread itself. A tyre with high transverse curvature indicates a tyre whose transverse curvature ratio (f/C) is at least 0.20.", "", "The building of the tyre100as described above is carried out by assembling respective semi-finished products onto a forming drum, not shown, by at least one assembly device.", "", "At least a part of the components intended to form the carcass structure101of the tyre100is built and/or assembled on the forming drum. More particularly, the forming drum is intended to first receive the possible liner112, and then the carcass ply101. Thereafter, devices non shown coaxially engage one of the annular anchoring structures102around each of the end flaps, position an external sleeve comprising the belt structure106and the tread band109in a coaxially centred position around the cylindrical carcass sleeve and shape the carcass sleeve according to a toroidal configuration through a radial expansion of the carcass ply101, so as to cause the application thereof against a radially internal surface of the external sleeve.", "", "After building of the green tyre100, a moulding and vulcanisation treatment is generally carried out in order to determine the structural stabilisation of the tyre100through vulcanisation of the elastomeric compounds, as well as to impart a desired tread pattern on the tread band109and to impart any distinguishing graphic signs at the sidewalls108.", "", "The present invention will be further illustrated below by means of a number of preparatory examples, which are provided for indicative purposes only and without any limitation of the present invention."], "claims": ["1 - 10 . (canceled)", "a carcass structure, having opposite side edges associated with respective bead structures; optionally, a belt structure applied in a radially external position with respect to the carcass structure; a tread band applied in a radially external position with respect to the carcass and/or belt structure; wherein the tread band comprises a vulcanised elastomeric compound comprising, before vulcanization, a vulcanizable elastomeric compound comprising, before mixing, an elastomeric composition, wherein the elastomeric composition comprises (i) 100 phr of an elastomeric polymer composition comprising: a. at least one styrene-butadiene polymer (SBR) in an amount of from 70 phr to 100 phr, and b. from 0 phr to 30 phr of at least one elastomeric polymer selected from the group consisting of isoprene polymer (IR) and butadiene polymer (BR), (ii) from 50 phr to 100 phr of a mixture of resins, a mixture of plasticising oils, or a mixture of both, (iii) at least one reinforcing filler in an amount from 50 phr to 130 phr, (iv) at least one vulcanising agent in an amount from 0.1 phr to 12 phr, and (v) from 0.1 phr to 5 phr of an organic salt of zinc having the following structural formula: wherein R", "12 . The tyre for vehicle wheels according to claim 11 , wherein R 1 , R 2 and R 3 , the same or different from each other, are a hydrogen atom or a linear or branched alkyl chain each comprising from 1 to 8 carbon atoms, and wherein the groups R 1 , R 2 and R 3 comprise a total of 8 carbon atoms.", "13 . The tyre for vehicle wheels according to claim 11 , wherein one of the alkyl chains represented by R 1 , R 2 and R 3 comprises from 2 to 6 carbon atoms, and the other two alkyl chains represented by R 1 , R 2 and R 3 comprise from 1 to 3 carbon atoms.", "14 . The tyre for vehicle wheels according to claim 11 , wherein R 1 represents a linear or branched alkyl chain comprising 8 carbon atoms, and R 2 and R 3 are a hydrogen atom.", "15 . The tyre for vehicle wheels according to claim 11 , wherein the organic salt of zinc is selected from the group consisting of the zinc salts of 2,2-dimethyl-octanoic acid, 2-methyl-2-ethyl-heptanoic acid, 2-methyl-2-isopropyl-hexanoic acid, 2,4-dimethyl-2-isopropyl-pentanoic acid, 2,2,3,5-tetramethyl-hexanoic acid, 2,2-diethyl-hexanoic acid, 4-methyl-2,2-diethyl-pentanoic acid, 2-ethyl-2-isopropyl-pentanoic acid, 2,2-isopropyl-butyric acid, 3,3,5,5-tetramethyl-hexanoic acid, 7,7-dimethyl-hexanoic acid, and mixtures thereof.", "16 . The tyre for vehicle wheels according to claim 11 , wherein the elastomeric composition comprises from 0.5 phr to 4 phr, of the organic salt of zinc.", "17 . The tyre for vehicle wheels according to claim 11 , wherein the styrene-butadiene polymer (SBR), optionally functionalized with termination or coupling agents, comprises monomeric units of styrene and butadiene, with a weight percentage of styrene ranging from 10% to 55%, and a weight percentage of vinyl (relative to butadiene) ranging of from 10% to 70%.", "18 . The tyre for vehicle wheels according claim 11 , wherein the isoprene polymer (IR) is a natural or synthetic elastomer from 1,4-cis addition of isoprene, optionally functionalized with terminating or coupling agents.", "19 . The tyre for vehicle wheels according to claim 11 , wherein the butadiene polymer (BR) is a polymer from a polymerization of 1,3-butadiene, wherein the 1,3-butadiene is present in an amount of not less than 50% by weight relative to the total weight of the polymer.", "(i) 100 phr of an elastomeric polymer composition comprising: a. at least one styrene-butadiene polymer (SBR) in an amount of from 70 phr to 100 phr, and b. from 0 phr to 30 phr of at least one elastomeric polymer selected from the group consisting of isoprene polymer (IR) and butadiene polymer (BR), (ii) from 50 phr to 100 phr of a mixture of resins, a mixture of plasticising oils, or a mixture of both, (iii) at least one reinforcing filler in an amount from 50 phr to 130 phr, (iv) at least one vulcanising agent in an amount from 0.1 phr to 12 phr, and (v) from 0.1 phr to 5 phr of an organic salt of zinc having the following structural formula wherein groups R", "21 . The vulcanisable elastomeric compound according to claim 20 , wherein R 1 , R 2 and R 3 comprise a total of from 1 to 8 carbon atoms.", "22 . The tyre according to claim 11 , wherein R 1 , R 2 and R 3 comprise a total of from 1 to 8 carbon atoms.", "23 . The tyre according to claim 16 , wherein the elastomeric composition comprises from 1 phr to 3 phr, of the organic salt of zinc.", "24 . The tyre according to claim 17 , wherein the weight percentage of styrene ranges of from 20% to 45% and the weight percentage of vinyl (relative to butadiene) ranges from 15% to 65%."], "bibtex": "@patent{20240391276,\n    title = {TYRE FOR VEHICLE WHEELS},\n    number = {20240391276},\n    year = {2024},\n    note = {File: US20240391276A1-20241128.XML}\n    }", "classification": "B60C100FI"}, {"title": "PNEUMATIC TIRE WITH 3D KERF", "doc_number": "20240391277", "filename": "US20240391277A1-20241128.XML", "abstract": "According to the invention, there is provided a pneumatic tire with a 3D kerf, including: one or more 3D kerfs; and a tire having a tread and a shoulder formed at a side surface of the tread. The tread has: one or more grooves that are sunken toward a center of the tread and are formed in a circumferential direction of the tire; one or more kerf grooves that are sunken toward the center of the tread and are formed in a central axis direction of the tire; and one or more blocks which are divided by the one or more grooves and the one or more kerf grooves, respectively. The one or more 3D kerfs come into close contact with and are fixed between the one or more blocks, respectively, as being inserted into the one or more kerf grooves, respectively.", "detailed_description": ["Hereinafter, the invention is to be described with reference to the accompanying drawings. However, the invention can be realized as various different examples and thus is not limited to an embodiment described herein. Besides, a part unrelated to the description is omitted from the drawings in order to clearly describe the invention, and similar reference signs are assigned to similar parts through the entire specification.", "", "In the entire specification, a case where a certain part is “connected to (attached to, in contact with, or coupled to)” another part means not only a case where the parts are “directly connected” to each other, but also a case where the parts are “indirectly connected” to each other with another member interposed therebetween. In addition, a case where a certain part “comprises” a certain configurational element does not mean that another configurational element is excluded but means that other configurational elements can be further included unless specifically described otherwise.", "", "Terms used in this specification are only used to describe a specific embodiment and are not intentionally used to limit the invention thereto. A singular form of a noun includes a plural meaning of the noun unless obviously implied otherwise in context. In this specification, words such as “to comprise” or “to include” are to be understood to specify that a feature, a number, a step, an operation, a configurational element, a member, or a combination thereof described in the specification is present and not to exclude a possibility of presence or addition of one or more other features, numbers, steps, operations, configurational elements, members, or combinations thereof in advance.", "", "Hereinafter, an embodiment of the invention will be described in detail with reference to the accompanying drawings.", "", "FIG.1is a perspective view in one direction illustrating a pneumatic tire with a 3D kerf according to the embodiment of the invention.", "", "First, a tire200, into which a 3D kerf100is inserted, and a tire wheel10which supports the tire200are to be described.", "", "With reference toFIG.1, the tire200has a tread210and a shoulder220formed at a side surface of the tread210. In addition, although not illustrated inFIG.1, a belt, an inner liner, a cap ply, a carcass, a bead, or the like can be formed on the tire200, and these configurational elements correspond to known technologies. Hence, the detailed description thereof is to be limited.", "", "The tread210includes a groove211, a kerf groove212, and a block213.", "", "The groove211is sunken toward a center of the tread210and is formed in a circumferential direction of the tire200, thus, fulfilling a function of drainage, and one or more (three inFIG.1) grooves211are formed as illustrated inFIG.1.", "", "The kerf grooves212are sunken toward the center of the tread210and are formed in a central axis direction of the tire200. When the tread210is formed in a vertical direction based onFIG.1, the kerf grooves212is formed in a horizontal direction, and one or more (36inFIG.1) kerf grooves212are formed as illustrated inFIG.1.", "", "In addition, a shape of the kerf groove212is not limited to the shape illustrated inFIG.1, and the kerf groove is formed to have a shape such that the 3D kerf100to be described below is inserted to come into close contact with one or more blocks213.", "", "In this respect, a side surface of the one or more blocks213can be formed in parallel with one or more blocks213to be parallel to a side surface of the 3D kerf100.", "", "The blocks213are divided by the one or more grooves211and the one or more kerf grooves212, and one or more (18inFIGS.1and57as individual blocks such as first blocks and second blocks) blocks213are formed as illustrated inFIG.1.", "", "The blocks213grips a road surface and enables a vehicle to be stopped due to a frictional force.", "", "In the invention, reference signs are assigned to a pair of blocks among adjacent blocks for the description.", "", "The pair of blocks are a first block213aand a second block213b.", "", "The first block213aand the second block213bare divided by the groove211and the kerf groove212, and thus the first block213aand the second block213bare positioned to be separated from each other as much as the kerf groove212is formed.", "", "The shoulder220is formed at a side of the tread210and comes into close contact with the tire200when the tire200is mounted on the tire wheel10.", "", "With reference toFIG.1, the tire wheel10includes a cylindrical rim11having both sides which are open, a disc12positioned at a central portion of the rim11, and one or more spokes13which connect the rim11and the disc12.", "", "Hereinafter, a pneumatic tire with a 3D kerf according to the embodiment of the invention is to be described with reference toFIGS.1to5.", "", "With reference toFIG.1, the pneumatic tire with a 3D kerf according to the embodiment of the invention includes the 3D kerf100and the tire200.", "", "The 3D kerf100is inserted into and fixed in the kerf groove212formed between a pair of adjacent blocks, and one or more 3D kerfs are formed to be inserted into the one or more kerf grooves212.", "", "In addition, since the one or more 3D kerfs100come into close contact with and are fixed between the one or more blocks213as being inserted into the one or more kerf grooves212, an interlocking phenomenon between blocks occurs to improve a ground grip force and handling and braking performances of the tire200.", "", "The 3D kerf100according to the embodiment is manufactured of one of stainless steel (SUS304, SUS301, SUS420J2, and SUS630) materials by performing bending thereon. The 3D kerf100can be manufactured by performing 3D printing on one material of maraging steel, SUS630, and Ti powder, in addition to the stainless steel materials.", "", "In addition, the frictional force changes depending on a shape of the 3D kerf100, and the detailed description thereof is to be provided below.", "", "In this respect, the 3D kerf100has a flat portion110, a recessed portion120, and a protruded portion130.", "", "FIG.2is a partially-detailed view illustrating enlargement of region S inFIG.1.", "", "The flat portion110comes into close contact with and is fixed between the pair of adjacent blocks213aand213bamong the one or more blocks213.", "", "With reference toFIG.2, the flat portion110includes a first flat member111, a second flat member112, a third flat member113, and a fourth flat member114which are one or more flat members having a flat-plate shape.", "", "The first flat member111has the flat-plate shape and is positioned inside the kerf groove212at one side.", "", "The second flat member112has the same shape and size as the first flat member111and is coupled to the first flat member111.", "", "The third flat member113has the flat-plate shape, has the same shape and size as the first flat member111and the second flat member112, and is positioned inside the kerf groove212at the other side.", "", "The fourth flat member114has the same shape and size as the third flat member113and is coupled to the third flat member113.", "", "The first and second flat members111and112are positioned on the left side based onFIG.2, and the third and fourth flat members113and114are positioned on the left side based onFIG.2.", "", "The recessed portion120has a predetermined curvature and is formed to recess in one direction of the circumferential direction of the tire200. The recessed portion120includes a first recessed member121, a second recessed member122, a third recessed member123, and a fourth recessed member124which are one or more recessed members.", "", "As illustrated inFIG.2, the first recessed member121is connected to the first flat member111. Specifically, one side of the first recessed member121is connected to the other side of the first flat member111, and the other side of the first recessed member121is connected to one side of a first protruded member131.", "", "In addition, the first recessed member121is formed to recess downward so as to have a predetermined curvature as illustrated inFIG.2.", "", "Here, a radius R1of the first recessed member121is preferably 6.6021 mm; however, the radius is not limited thereto.", "", "The second recessed member122is connected to the second flat member112and is coupled to the first recessed member121. Specifically, one side of the second recessed member122is connected to the other side of the second flat member112, and the other side of the second recessed member122is connected to one side of a second protruded member132.", "", "In addition, the second recessed member122is formed to recess downward so as to have a predetermined curvature as illustrated inFIG.2.", "", "As illustrated inFIG.2, the third recessed member123is connected to the third flat member113. In addition, the third recessed member123is formed to recess downward so as to have a predetermined curvature as illustrated inFIG.2.", "", "Here, the radius R1of the third recessed member123is preferably 6.6021 mm as the radius of the first recessed member121; however, the radius is not limited thereto.", "", "The fourth recessed member124is connected to the fourth flat member114and is coupled to the third recessed member123. In addition, the fourth recessed member124is formed to recess downward so as to have a predetermined curvature as illustrated inFIG.2.", "", "A top surface of the 3D kerf100has a wave shape which bends alternately one or more times, the top surface being parallel to a surface of the tread210.", "", "Specifically, the first and second recessed members121and122, the first and second protruded members131and132, the third and fourth recessed members123and124, and the third and fourth protruded members133and134described above are coupled to each other in consecutive order, and thus a wave shape is formed as a whole as illustrated inFIG.2.", "", "FIG.3is a cross-sectional view taken along line a-b inFIG.2.", "", "A side surface of the 3D kerf100has a trapezoid shape which bends alternately one or more times, the side surface being parallel to the one or more blocks213.", "", "Regarding a feature described above, the third and fourth recessed members123and124formed between the first and second blocks213aand213bare illustrated as an example inFIG.3and are described in detail based thereon.", "", "A thickness f of the 3D kerf100is 0.2 mm to 0.4 mm and preferably 0.4 mm. InFIG.3, the thickness is the thickness f of the third and fourth recessed members123and124. Besides, the same is true of thickness f of the first and second flat members111and112, the third and fourth flat members113and114, the first and second recessed members121and122, the first and second protruded members131and132, or the third and fourth protruded members133and134.", "", "In addition, a shortest distance (j+j) from one end of a recessed part of the 3D kerf100to one end of a protruded part of the 3D kerf100is twice a shortest distance j between both ends of the third and fourth recessed members123and124illustrated inFIG.3, and the shortest distance (j+j) is 2 mm to 3 mm and preferably 2.4 mm.", "", "In addition, inFIG.3, a depth g of the third and fourth members123and124is 7 mm.", "", "Also, a radius R2of a bent part of the fourth recessed member124is 0.4 mm, and an angle between a horizontal line in a right-left direction and a tangent line of the third recessed member123based onFIG.3is 30 degrees.", "", "The protruded portion130has one or more protruded members131,132, and133which have a predetermined curvature and are formed to protrude in the other direction of the circumferential direction of the tire200.", "", "The protruded portion130includes the first protruded member131, the second protruded member132, the third protruded member133, and the fourth protruded member134.", "", "The first protruded member131is connected to the first recessed member121. Specifically, one side of the first protruded member131is connected to the other side of the first recessed member121, and the other side of the first protruded member131is continuously connected to one side of the third recessed member123.", "", "In addition, the first protruded member131is formed to have a predetermined curvature.", "", "The second protruded member132is connected to the second recessed member122and is coupled to the first protruded member131. Specifically, one side of the second protruded member132is connected to the other side of the second recessed member122, and the other side of the second protruded member132is continuously connected to one side of the fourth recessed member124.", "", "In addition, the second protruded member132is formed to have a predetermined curvature, and the radius R1of the second protruded member132is preferably 6.6021 mm as the radius of the first recessed member121and the third recessed member123; however, the radius is not limited thereto.", "", "The third protruded member133is connected to the third recessed member123. Specifically, one side of the third protruded member133is connected to the other side of the third recessed member123, and the other side of the third protruded member133is continuously connected to one side of the third flat member113.", "", "In addition, the third protruded member133is formed to have a predetermined curvature.", "", "The fourth protruded member134is connected to the fourth recessed member124and is coupled to the third protruded member133. Specifically, one side of the fourth protruded member134is connected to the other side of the fourth recessed member124, and the other side of the fourth protruded member134is continuously connected to one side of the fourth flat member114.", "", "The flat portion110, the recessed portion120, and the protruded portion130described above are continuously connected. Specifically, the first and second flat members111and112, the first and second recessed members121and122, and the first and second protruded members131and132are connected in consecutive order, and a shortest distance d1between both ends of the first and second recessed members121and122is 5.5 mm equal to a shortest distance d2between both ends of the first and second protruded members131and132.", "", "In addition, the third and fourth flat members113and114, the third and fourth recessed members123and124, and the third and fourth protruded members133and134are connected in consecutive order, and a shortest distance d3between both ends of the third and fourth recessed members123and124is 5.5 mm equal to a shortest distance d4between both ends of the third and fourth protruded members133and134.", "", "Also, a shortest distance (d1+d2) from one end of the first and second recessed members121and122connected to the first and second flat members111and112to the other end of the first and second protruded members131and132is 5 mm to 12 mm and preferably 11 mm.", "", "In addition, a shortest distance (d3+d4) from one end of the third and fourth recessed members123and124connected to the third and fourth flat members113and114to the other end of the third and fourth protruded members133and134is 5 mm to 12 mm and preferably 11 mm.", "", "FIG.4is a perspective view illustrating shapes of the 3D kerf of the pneumatic tire with a 3D kerf according to the embodiment of the invention.FIG.5is a perspective view illustrating actual shapes of the 3D kerf of the pneumatic tire with a 3D kerf according to the embodiment of the invention.", "", "The 3D kerf100of the invention is provided to cause an interlocking phenomenon to occur between the blocks213applied to a pattern formed at the tread210of the tire200such that a ground grip force and handling and braking performances of the tire200are improved, and the frictional force changes depending on the shape of the 3D kerf.", "", "In this respect, in the invention, an experiment was carried out, in which the shape of the 3D kerf100was realized as a zigzag shape, a trapezoid shape, a wave shape, or the like.FIG.4illustrates the zigzag shape and the trapezoid shape as examples of the shape of the 3D kerf100.", "", "FIG.5illustrates 3D kerfs manufactured to have a zigzag shape, a trapezoid shape, a wave-trapezoid shape, a semi-trapezoid shape in order to evaluate the frictional force depending on the shape of the 3D kerf100, before the 3D kerf is applied to a tire.", "", "InFIG.5, (A) illustrates a 3D kerf designed to have a zigzag shape at the surface of the tread210of the tire200and a zigzag shape in a depth direction from the surface of the tread210, (B) illustrates a 3D kerf designed to have a trapezoid shape at the surface of the tread210of the tire200and a trapezoid shape in the depth direction from the surface of the tread210, (C) illustrates a 3D kerf designed to have a wave shape at the surface of the tread210of the tire200and a trapezoid shape in the depth direction from the surface of the tread210, and (D) illustrates a 3D kerf designed to have a trapezoid shape at the surface of the tread210of the tire200and a semi-trapezoid shape in the depth direction from the surface of the tread210.", "", "Experimental results thereof are shown in Table 1 and Table 2 provided below.", "", "TABLE 1Wave-Semi-ZigzagTrapezoidTrapezoidTrapezoid100N97N101N100N100N100N100N99N106N108N101N99N", "", "Table 1 shows results of evaluation of individual samples manufactured of SUS304 plates by performing the bending thereon, the samples having the zigzag shape in (A) ofFIG.5, the trapezoid shape in (B) ofFIG.5, the wave-trapezoid shape in (C) ofFIG.5, and the semi-trapezoid shape in (D) ofFIG.5. First, in a dry condition, the 3D kerf100has a difference in degree of the frictional force as Wave-Trapezoid Shape>Zigzag Shape=Semi-Trapezoid Shape>Trapezoid Shape, it was confirmed that when the 3D kerf has the wave-trapezoid shape, the maximum frictional force is generated.", "", "Next, in a wet condition, the 3D kerf100has a difference in degree of the frictional force as Wave-Trapezoid Shape=Trapezoid Shape=Zigzag Shape>Semi-Trapezoid Shape, and it was confirmed that when the 3D kerf has the semi-trapezoid shape, the minimum frictional force is generated.", "", "Lastly, in a snow condition, the 3D kerf100has a difference in degree of the frictional force as Trapezoid Shape>Zigzag Shape>Wave-Trapezoid Shape>Semi-Trapezoid Shape, and it was confirmed that when the 3D kerf has the trapezoid shape, the maximum frictional force is generated.", "", "As a result of evaluation of the frictional force, the frictional force was relatively high with the zigzag shape and the trapezoid shape; however, a defect rate was high due to those complicated shapes when the sample was manufactured of the SUS304 material by performing the bending thereon.", "", "In addition, as a result of evaluation of design strength of the manufactured wave-trapezoid shape and semi-trapezoid shape, the strength of the wave-trapezoid shape was found to be higher than the strength of the semi-trapezoid shape by about 5%, and thus the 3D kerf having the wave-trapezoid shape was determined to be applied to a mold.", "", "TABLE 2General3D kerfkerf(Wave-Trapezoid)Snow handling100108Snow braking100107.4Snow acceleration100105.3", "", "Table 2 shows evaluation of snow performance, and the tire200was manufactured as a 235/45R18V tire for all seasons. As a result of performance evaluation, the snow handling was more improved by 8% than a general kerf, the snow braking was more improved by 7.4% than the general kerf, and the snow acceleration was more improved by 5.3% than the general kerf.", "", "According the above-described configuration, an effect of the invention is as follows. The snow performance can be improved by inserting a 3D kerf into a kerf groove of a tire tread, the 3D kerf including a top surface having a wave shape and a side surface having a trapezoid shape.", "", "In addition, according the above-described configuration, another effect of the invention is as follows. Since one or more 3D kerfs come into close contact with and are fixed between one or more blocks as being inserted into one or more kerf grooves, an interlocking phenomenon between blocks can occur to improve a ground grip force and handling and braking performances of the tire.", "", "Effects of the invention are to be construed not to be limited to the above-mentioned effects but to include any effect that can be derived from configurations of the invention described in the detailed description of the preferred embodiment and claims of the invention.", "", "The description of the invention described above is provided as an example, and a person of ordinary skill in the art to which the invention pertains can understand that it is possible to easily modify the invention to another embodiment without changing the technical idea or essential feature of the invention. Therefore, the embodiments described above have to be understood as exemplary embodiments in every aspect and not as examples to limit the invention. For example, each configurational element described as a single unit can be realized in a distributed manner. Similarly, the configurational element described in a distributed manner can be realized in a combined manner.", "", "The scope of the invention has to be represented by the claims to be described below, and meaning and the scope of the claims and every modification or modified example derived from an equivalent concept of the claims have to be construed to be included in the scope of the invention."], "claims": ["a tread; and first and second shoulders formed at first and second sides of the tread and having a circular shape, wherein the tread includes: first and second grooves disposed on a surface of the tread and extend in a circumferential direction of the of the circular shape; and a plurality kerf grooves disposed on the surface of the tread to extend in an axial direction of the circular shape, the plurality of kerf grooves comprising a first set of kerf grooves provided between the first shoulder and the first groove, a second set of kerf grooves provided between the first and second grooves, and a third set of kerf grooves provided between the second groove and the second shoulder, wherein each of the plurality kerf grooves includes: a first straight portion extending in the axial direction; a first concave portion extending from the first straight portion and in the axial direction and having a first radius of curvature; a first convex portion extending from the concave portion and in the axial direction and having a second radius curvature; a second concave portion extending from the first convex portion and in the axial direction and having a third radius of curvature; a second convex portion extending from the second concave portion and in the axial direction and having a fourth radius of curvature; and a second straight portion extending from the second convex portion and in the axial direction, wherein for the second set of the kerf grooves, an end of the first straight portion opposite from the first concave portion extend to the first groove, and an end of the second straight portion opposite from the second convex portion extend to the second groove, and wherein the plurality of kerf grooves have a trapezoid shape in a depth direction of the thread.", "2 . The pneumatic tire according to claim 1 , wherein an overall shape of the plurality kerf grooves has a wave shape.", "3 . The pneumatic tire according to claim 1 , wherein a length of one of the first and second concave portions in the axial direction is equal to a length of one of the first and second convex portions in the axial direction.", "4 . The pneumatic tire of claim 1 , wherein a depth of the plurality of kerf grooves is 7 mm.", "5 . The pneumatic tire according to claim 1 , wherein a length of the first concave portion or the second concave portion in the axial direction is 5 mm to 12 mm.", "6 . The pneumatic tire according to claim 1 , wherein a length of the first convex portion or the second convex portion in the axial direction is 5 mm to 12 mm.", "7 . The pneumatic tire according to claim 1 , wherein the first radius of curvature is equal to the third radius of curvature.", "8 . The pneumatic tire according to claim 5 , wherein the second radius of curvature is equal to the fourth radius of curvature.", "9 . The pneumatic tire of claim 1 , wherein at least one of the first, second, third or fourth radius of curvature is equal to 6.6021 mm.", "10 . The pneumatic tire according to claim 1 , wherein a width the plurality kerf grooves in the circumferential direction is 0.2 mm to 0.4 mm.", "11 . The pneumatic tire according to claim 3 , wherein a length of the first straight portion is equal to a length of the second straight portion.", "first shoulder having a circular shape; a second shoulder having the circular shape and spaced apart from the first shoulder; and a tread provided between the first and second shoulders to form a surface around a circumference of the first and second shoulders, wherein the thread includes: first and second grooves provided parallel to each other and extending along the surface in a circumferential direction; and a plurality of kerf grooves provided between at least one of (a) the first and second grooves, (b) the first groove and the first shoulder, or (c) the second groove and the second shoulder, wherein each of the kerf grooves has a wave shape in an axial direction of the circular shape, and a prescribed shape in a depth direction of the kerf groove, wherein the wave shape is provided by a first concave portion having a first radius of curvature and a first convex portion having a second radius of curvature, and wherein the prescribed shape in the depth direction comprises a first linear section extending perpendicular from the surface, a second linear section extending in a first angle from the first linear section, a third linear section extending in a second angle from the second linear section, and a fourth linear section extending in a third angle from the third linear section, the first and third linear sections being parallel to each other and the second and fourth linear sections being non-parallel to each other.", "13 . The tire of claim 12 , wherein the wave shape further comprises a second concave portion having a third radius of curvature, and a second convex portion having a fourth radius of curvature, the first convex portion provided between the first and second concave portions and the second concave portion being provided between the first and second convex portions.", "14 . The tire of claim 13 , wherein the wave shape further comprises first and second linear portions, the first and second concave and convex portions being provided between the first and second linear portions, and the first and second concave, convex and linear portions having the same prescribed shape in the depth direction.", "15 . The tire of claim 12 , wherein the prescribed shape further comprises a fifth linear section extending in a fourth angle from the fourth linear section, a sixth linear section extending in the first angle from the fifth linear section, a seventh linear section extending in the second angle from the sixth linear section, and a eighth linear section extending in the third angle from the seventh linear section, wherein the first, third and fifth linear sections are parallel to each other, the second and sixth linear sections are parallel to each other, and fourth and eighth linear sections are parallel to each other.", "16 . The tire of claim 15 , wherein the prescribed shape further comprises a ninth linear section extending in the fourth angle from the eighth linear section, a tenth linear section extending in the first angle from ninth linear section, and an eleventh linear section extending in the second angle from the tenth linear section, the first and eleventh linear sections being parallel to each other, and the second and tenth linear sections being parallel to each other.", "17 . The tire of claim 16 , wherein depth of the kerf groove in the depth direction is 7 mm.", "18 . The tire of claim of claim 14 , wherein the first, second, third and fourth radius of curvature is the same.", "19 . The tire of claim 12 , wherein the width of each kerf groove in the circumferential direction is between 0.2 mm to 0.4 mm.", "20 . The tire of claim of claim 18 , wherein a length of the first and second concave and convex portions in an axial direction is at least 22 mm."], "bibtex": "@patent{20240391277,\n    title = {PNEUMATIC TIRE WITH 3D KERF},\n    number = {20240391277},\n    year = {2024},\n    note = {File: US20240391277A1-20241128.XML}\n    }", "classification": "B60C1112FI"}, {"title": "TWO-WAY TIRE PRESSURE MONITORING SYSTEM (TPMS) LEARNING AND AUTHENTICATED PAIRING", "doc_number": "20240391278", "filename": "US20240391278A1-20241128.XML", "abstract": "Systems and methods for implementing two-way tire pressure monitoring system (TPMS) learning and authenticated pairing. A random value may be used to determine a test value and a pairing PIN by use of a HMAC (Hash-based Message Authentication Code) function and a pre-shared key that is accessible to a TPMS sensor and a vehicle (e.g., controller system thereof). The random value and test value may be broadcasted by the TPMS sensor and received by the vehicle. The vehicle may calculate the pairing PIN using the random value and the pre-shared key.", "detailed_description": [""], "claims": ["one or more processors and memory storing executable instructions that cause the TPMS sensor to: determine a random value; determine, based at least in part on the random value, an input value; derive an output value based at least in part on the input value and a pre-shared secret that is also accessible to a vehicle; determine, based at least in part on a first portion of the output value, a test value; determine, based at least in part on a second portion of the output value, a pairing PIN; broadcast at least one learning mode advertisement, comprising: a Resolvable Private Addresses (RPA); sensor data measured by the TPMS sensor; the random value; and the test value; determine the TPMS sensor is connected to the vehicle; perform a pairing process with the vehicle that includes authenticating the vehicle has access to the pairing PIN; and contingent upon the pairing process successfully authenticating the vehicle: establish a secure connection with the vehicle; and receive an integrity key (IK) from the vehicle via the secure connection.", "broadcast a TPMS advertisement, comprising: a second RPA; second sensor data measured by the TPMS sensor; and a Message Authentication Code (MAC) determined based at least in part on the second sensor data and using the IK.", "3 . The TPMS sensor of claim 1 , wherein the input value comprises the random value and additional data.", "4 . The TPMS sensor of claim 1 , wherein the output value is derived using a HMAC (Hash-based Message Authentication Code) function.", "5 . The TPMS sensor of claim 1 , wherein the first portion and second portion are non-overlapping portions of the output value.", "6 . The TPMS sensor of claim 1 , wherein the pairing PIN is determined by at least truncating the output value to determine the second portion and applying a modulus operation on the second portion to produce the pairing PIN.", "7 . The TPMS sensor of claim 1 , wherein the at least one learning mode advertisement is broadcasted in plaintext.", "receive one or more learning mode advertisements from a tire pressure monitoring system (TPMS) sensor, one of the one or more learning mode advertisement comprising: a Resolvable Private Addresses (RPA); sensor data measured by the TPMS sensor; a random value; and a test value; determine, based at least in part on the sensor data, that the TPMS sensor is likely to be attached to the vehicle; determine, using the random value and a pre-shared key that is also accessible to the TPMS sensor, a calculated test value; determine that the calculated test value matches the test value received from the TPMS sensor; determine, using the random value and the pre-shared key, a pairing PIN; perform a pairing process with the TPMS sensor using the pairing PIN; establish a secure connection with the TPMS sensor; and provide an integrity key (IK) to the TPMS sensor via the secure connection.", "receive a TPMS advertisement, comprising: a second RPA; second sensor data measured by the TPMS sensor; and a Message Authentication Code (MAC); determine a calculated MAC based at least in part on the second sensor data and using the IK; and determine the TPMS advertisement is authentic based at least in part on the calculated MAC matching the MAC received in the TPMS advertisement.", "determining an input value based at least in part on the random value; using a HMAC function to calculate an output value based at least in part on the input value and the pre-shared key; and extracting the test value from at least a first portion of the output value.", "11 . The non-transitory computer-readable storage medium of claim 10 , wherein the pairing PIN is determined based at least in part on a second portion of the output value.", "12 . The non-transitory computer-readable storage medium of claim 11 , wherein the first portion and the second portion are non-overlapping.", "13 . The non-transitory computer-readable storage medium of claim 8 , wherein the one or more learning mode advertisements are received using Bluetooth Low Energy (BLE).", "determining, by a tire pressure monitoring system (TPMS) sensor, a random value; deriving, by the TPMS sensor, a pairing PIN and a test value based at least in part on the random value and a pre-shared key; transmitting, by the TPMS sensor, one or more learning mode advertisements that comprise first sensor data, the random value, and the test value; determining, by a controller system of a vehicle, that the TPMS sensor is an attached candidate sensor; determining, by the controller system of the vehicle, the pairing PIN using the random value, the test value, and the pre-shared key; performing an authenticated pairing process between the controller system and the TPMS sensor; establishing a secure connection between the controller system and the TPMS sensor; and exchanging an integrity key (IK) and identity resolving keys (IRK) between the controller system and the TPMS sensor.", "transmitting, by the TPMS sensor, one or more TPMS advertisements that comprise second sensor data and a Message Authentication Codes (MAC) based at least in part on the second sensor data; and determining, by the controller system of the vehicle, authenticity and integrity of the one or more TPMS advertisements.", "each of the one or more learning mode advertisements comprises a first resolvable private address (RPA); and each of the one or more TPMS advertisements comprises a second RPA.", "changing the second RPA to a third RPA; and using the IRK to resolve the third RPA.", "generating an HMAC (Hash-based Message Authentication Code) output using the random value and the pre-shared key; determining a first portion of the random value to be the test value; truncating a second portion of the random value to produce a truncated HMAC output; and performing a modulus operation on the truncated HMAC output to produce the pairing PIN.", "19 . The method of claim 18 , wherein the first portion and the second portion are non-overlapping portions of the HMAC output.", "20 . The method of claim 14 , wherein the one or more learning mode advertisements are transmitted in plaintext."], "bibtex": "@patent{20240391278,\n    title = {TWO-WAY TIRE PRESSURE MONITORING SYSTEM (TPMS) LEARNING AND AUTHENTICATED PAIRING},\n    number = {20240391278},\n    year = {2024},\n    note = {File: US20240391278A1-20241128.XML}\n    }", "classification": "B60C2304FI"}, {"title": "SELF-REINFLATING TIRE", "doc_number": "20240391279", "filename": "US20240391279A1-20241128.XML", "abstract": "A device for transport of air in the tire P or close to it consisting of a chamber K in the shape of a hollow compressible channel, placed along at least a part of the tire perimeter, characterized by the fact that a ring OK is placed at the inner side of the chamber K with the distance of its outer side from the tire axis of rotation equal to 1 to 1.1 multiple of the distance of the bottom side of the chamber K from the axis of rotation of the tire P.", "detailed_description": ["For illustration, the invention is described below on individual examples of its arrangement."], "claims": ["a tire, a deformable chamber at least partially defined by one or more walls and having one or more apertures, the one or more walls having shape memory, the chamber being disposed in or adjacent to the tire such that, as the tire rotates, fluid in the chamber is caused to flow to one of the one or more apertures via peristalsis, a power generator in fluid communication with the one of the one or more apertures and configured to transform kinetic energy of fluid flowing through one of the one or more apertures into electricity.", "2 . The device of claim 1 , wherein a first aperture of the chamber is in fluid communication with an environment.", "3 . The device of claim 1 , wherein the power generator is in fluid communication with the aperture.", "4 . The device of claim 1 , wherein a first aperture of the chamber is in fluid communication with a tire interior or an inner tube.", "5 . The device of claim 4 , wherein the power generator is in fluid communication with the aperture.", "6 . The device of claim 1 , wherein a first aperture of the chamber is in fluid communication with an environment, and a second aperture of the chamber is in fluid communication with a tire interior or an inner tube.", "7 . The device of claim 1 , wherein a first aperture of the chamber is in fluid communication with a tire cavity, and a second aperture of the chamber is in fluid communication with the tire cavity or an inner tube.", "8 . The device of claim 7 , wherein the power generator includes a first power generator in fluid communication with the first aperture.", "9 . The device of claim 1 , wherein the power generator includes a first power generator comprising a magnet and a coil of wire, wherein the magnet is capable of moving through the coil generating electrical current.", "10 . The device of claim 1 , wherein the power generator includes a first power generator comprising one or more of a blade wheel, an airjet, a rotating ball, a piezo electric device, a free-wheel like device, a gear-wheel pump, a piston-type generator, and a valve.", "11 . The device of claim 1 , wherein the power generator includes a first power generator comprising a source of a magnetic field and a coil of wire.", "12 . The device of claim 11 , wherein the coil generates electrical current when within range of the magnetic field."], "bibtex": "@patent{20240391279,\n    title = {SELF-REINFLATING TIRE},\n    number = {20240391279},\n    year = {2024},\n    note = {File: US20240391279A1-20241128.XML}\n    }", "classification": "B60C2312FI"}, {"title": "TOOL FOR USE WITH TIRE ASSEMBLIES", "doc_number": "20240391280", "filename": "US20240391280A1-20241128.XML", "abstract": "A tire tool, and method of using, that can be used to manipulate tires by a user. The tire tool has a platform that can engage under a tire assembly, a front section, and a rear section. The tire tool can rotate between an engagement position and a pivoted position about a pivot. When in the pivoted position, a stop abuts the surface. The tire tool can be used by a user to lift a tire assembly off the ground, remove the tire assembly from an hub, and install the tire assembly on a hub.", "detailed_description": ["It will be appreciated that for simplicity and clarity of illustration, where appropriate, reference numerals have been repeated among the different figures to indicate corresponding or analogous elements. In addition, numerous specific details are set forth in order to provide a thorough understanding of the embodiments described herein. However, it will be understood by those of ordinary skill in the art that the embodiments described herein can be practiced without these specific details. In other instances, methods, procedures, and components have not been described in detail so as not to obscure the related relevant feature being described. The drawings are not necessarily to scale, and the proportions of certain parts may be exaggerated to better illustrate details and features. The description is not to be considered as limiting the scope of the embodiments described herein. It should be noted that references to “an” or “one” embodiment in this disclosure are not necessarily to the same embodiment, and such references mean at least one.", "", "Several definitions that apply throughout this disclosure will now be presented.", "", "The term “coupled” is defined as connected, whether integral with, directly attached, or indirectly attached through intervening components, and is not necessarily limited to physical connections. The connection can be such that the objects are permanently connected or releasably connected. The term “inside” indicates that at least a portion of a region is partially contained within a boundary formed by the object. The term “substantially” is defined to be essentially conforming to the particular dimension, shape, or other word that substantially modifies, such that the component need not be exact. For example, substantially cylindrical means that the object resembles a cylinder, but can have one or more deviations from a true cylinder.", "", "The present disclosure is described in relation to a tire tool100for manipulating tires.", "", "FIG.1illustrates an embodiment of the tire tool100. In some embodiments, the tire tool100comprises one or more of the following: a platform1, a front section2, at least one pivot41, a stop42, a rear section3, and a handle5.", "", "FIG.2illustrates an embodiment of the tire tool100.", "", "In some embodiments, the platform1comprises a planar extension extending from the front section2. In some embodiments, the platform1is angled in relation to the front section2. In some embodiments, the platform1is squared, rounded, some other shape, or a combination thereof. It is to be understood that the length of the platform1can be set as desired.", "", "In some embodiments, the front section2comprises abutment section21. The abutment section21is capable of abutting a tire assembly8when the tire assembly8is located on the platform1. In some embodiments, the abutment section21prevents the tire assembly8from coming into contact with the pivot41. In some embodiments, the abutment section21extends past the pivot41. In some embodiments, the abutment section21is curved.", "", "In some embodiments, the engagement section31extends away from rear section3towards the handle5, when attached. In some embodiments, the engagement section31comprises one or more grippers310. In some embodiments, there are two grippers310, and in some embodiments, each gripper310defines a point. In some embodiments, the engagement section31extends past the stop42.", "", "In some embodiments, the tire tool100comprises a rear section3. The rear section3comprises the engagement section31. In some embodiments, the rear section3comprises33a handle connection section33. In some embodiments, the handle5is secured to the handle connection section33by a securing member51. In some embodiments, the handle5is integral with the rear section3, the front section2, between the rear section3and the front section2, or a combination thereof.", "", "In some embodiments, the one or more pivots41comprise two pivots41. In some embodiments, one or more stops42comprise two stops42. In some embodiments, one or more of the pivots41is a wheel, the one or more stops42is a wheel, or both. In some embodiments, the pivot41has a larger diameter than the stops42, and/or the pivot41and the stops42are offset from each other. In some embodiments, the pivots41will be coupled together by an axle, the stops42will be coupled together by an axle, or a combination thereof.", "", "FIG.3illustrates an embodiment of the tire tool100. In some embodiments, the handle connection section33comprises ribs331that will at least extend partially along the width of the handle5.", "", "FIGS.4-5illustrate an embodiment of the method of using an embodiment tire tool100. When a tire assembly8is located on the lugs72, gravity causes the wheel to rest on the lugs72. It is to be understood that in some applications, it will be spokes in the place of lugs72, and when described and/or claimed herein, the term ‘lugs’ also includes, but is not limited to, spokes. In order to remove the tire assembly8from the lugs72, a user must actually lift the tire assembly8, but not too much, so that the wheel holes are off the top of the lugs72and not touching the bottom of the lugs72. The tolerance is relatively small. Typically, without the tire tool100, the user is trying to remove the tire assembly8, and manually maintain the position within the tolerance, all the while handling a heavy combination of a tire assembly8and a wheel. Obviously, this becomes more difficult which larger tires assemblies8.", "", "As can be seen inFIGS.4and5, the user brings the tire tool100to the tire assembly8such that the platform1is located beneath the tire assembly8. The user then used the handle5to rotate the tire tool100and lift the tire assembly8off the lugs72. Once the user pulls the handle5, the tire tool100can rotate about the pivot41toward the pivoted state so that the stop42touches the ground. Once the tire assembly8is free from the lugs72and resting on the platform1, the tire assembly8can lean against the handle5. In some embodiments, once lifted the tire assembly8can be transported on the tire tool100. In some embodiments, when the tire assembly8leans against the handle5, it will help keep the tire tool100in the pivoted state.", "", "It is to be understood that to place a tire assembly8on the lugs72; the process can work in reverse. The user will transport the tire assembly8on the tire tool100in the pivoted state over to the vehicle. They will align the wheel holes with the lugs72. This may entail rotating the lugs72or the tire assembly8. The user will the rotate the tire tool100toward the engagement state such that the one or more lugs72are positioned inside the one or more wheel holes during the rotation.", "", "FIG.6illustrates an embodiment of the tire tool100in an engagement state wherein the platform1is substantially parallel to the surface. In some embodiments, the platform1abuts the surface when in the engagement state.", "", "FIG.7illustrates an embodiment of the tire tool100in the pivoted state. In the pivoted state, both the pivot41and the stops42are on the surface. As can be seen, once the tire tool100is in the pivoted state, the platform1is at a greater angle, relative to the surface, than the platform1in the engagement state. It is the angling of the platform1that raises the tire assembly8when the tire tool100moves from the engagement state toward the pivoted state.", "", "FIG.8illustrates an embodiment of the tire tool100in the pivoted state and moving the tire assembly8.", "", "FIGS.9and10show an embodiment a method using an embodiment of the tire tool100to lift a tire assembly8off the surface. As can be seen, a user will place the tire tool100so that the engagement section31engages the tire assembly8. In some embodiments, the engagement section31will engage the tread of the tire assembly8. The user can pull handle5so that the tire assembly8is substantially vertical and not lying on the surface. Once vertical, the user can wedge the platform1underneath the tire assembly8and then rotate the tire tool100to the pivoted state.", "", "The methods described below can be carried out using the configurations illustrated inFIGS.1-10, for example, and various elements of these figures are referenced in explaining the methods. The methods comprise one or more processes, methods or subroutines, carried out in the example methods. Furthermore, the order of steps as described is illustrative only, and the order of the steps can change according to the present disclosure. Additional steps can be added or fewer steps may be utilized, without departing from this disclosure.", "", "A method for using the tire tool100comprises one or more of the following:A) placing the platform1under the tire assembly8;B) rotating the tire tool100to the engagement state;C) place a lug in a wheel hole; andD) secure the tire assembly8to a hub71.", "", "Some embodiments of the method further comprise moving the tire tool100to the pivoted state. Some embodiments comprise moving the tire tool100with a tire assembly8on the platform1in the pivoted state. Some embodiments of the method comprise moving the tire tool100from the pivoted state to and/or toward the engagement section31state.", "", "Some embodiments comprise engaging the tire assembly8with the engagement section31. In some embodiments, engaging the tire assembly8with the engagement section31comprises the user standing on one side of the tire assembly8and engaging the tire assembly8with the engagement section31on another side. Some embodiments comprise pulling the handle5to rotate the tire assembly8toward a vertical position. In some embodiments, pulling the handle5comprises placing a foot on the tire assembly8. In some embodiments, the user will place a foot on the tire tool100or pinning it between the foot and the tire assembly8to keep it from rolling.", "", "The embodiments shown and described above are only examples. Even though numerous characteristics and advantages of the present technology have been set forth in the foregoing description, together with details of the structure and function of the present disclosure, the disclosure is illustrative only, and changes may be made in the detail, including in matters of shape, size, and arrangement of the parts within the principles of the present disclosure up to, and including, the full extent established by the broad general meaning of the terms used in the claims.", "", "It should also be noted that elements of embodiments may be described in reference to the description of a particular embodiment; however, it is disclosed that elements of disclosed embodiments can be switched with corresponding elements of embodiments with the same name and/or number of other disclosed embodiments.", "", "Depending on the embodiment, certain steps of the methods described may be removed, others may be added, and the sequence of steps may be altered. It is also to be understood that the description and the claims drawn to a method may include some indication in reference to certain steps. However, the indication used is only to be viewed for identification purposes and not as a suggestion as to an order for the steps."], "claims": ["a tire tool, wherein the tire tool comprises: a platform; a front section, wherein the platform is coupled to the front section; a rear section coupled to the front section; at least one pivot coupled to the front section; at least one stop coupled to the rear section; wherein the tire tool is configured to move between an engagement state and a pivoted state when resting on surface; in the engagement state, the at least one pivot abuts the surface and the at least one stop is located above the surface; in the pivoted state, the at least one pivot and the at least one stop abuts the surface.", "2 . The apparatus of claim 1 , wherein the at least one pivot comprises two pivots; the at least one stop comprises two stops; and the two stops are offset from the two pivots.", "3 . The apparatus of claim 1 , wherein the at least one pivot are wheels, the at least one stop are wheels, or both the at least one pivot and the at least on stop are wheels.", "4 . The apparatus of claim 3 , wherein the at least one pivot comprises two pivots; the at least one stop comprises two stops; and a center of the two stops are offset from the two pivots, the two stops are smaller than the two pivots, or a combination thereof.", "5 . The apparatus of claim 1 , wherein the rear section further comprises an engagement section.", "6 . The apparatus of claim 5 , wherein the engagement section defines one or more grippers.", "7 . The apparatus of claim 1 , wherein the tire tool further comprises a handle.", "8 . The apparatus of claim 1 , wherein the front section comprises an abutment section.", "9 . The apparatus of claim 8 , wherein the abutment section extends past each pivot.", "A) providing a tire tool according to B) placing the platform underneath the tire assembly that is mounted on one or more lugs; C) lifting the tire assembly with the tire tool; and D) removing the tire assembly from the one or more lugs.", "11 . The method of claim 10 , wherein lifting the tire assembly with the tire tool comprises moving the tire tool toward the pivoted state.", "12 . The method of claim 10 , wherein the tire tool further comprises a handle; and the removing the tire assembly comprises rotating the tire assembly so that it abuts the handle.", "13 . The method of claim 10 , further comprising F) transporting the tire assembly on the tire tool.", "14 . The method of claim 10 , further comprising G) rotating the tire tool about the at least one pivot toward the pivoted state, rotating the tire tool about the at least one pivot toward the engagement state, or a combination thereof.", "A) providing a tire tool according to B) engaging the tire assembly located on the surface with the tire tool; and C) lifting the tire assembly with the tire tool.", "16 . The method of claim 15 , wherein the engaging the tire assembly located on the surface comprises rotating the tire tool to the engagement state; and positioning the platform under the tire assembly.", "17 . The method of claim 16 , wherein the lifting the tire assembly comprises rotating the tire tool from the engagement state toward the pivoted state.", "18 . The method of claim 15 , wherein the tire tool further comprises an engagement section; and the engaging the tire assembly located on the surface comprises extending the tire tool across the tire assembly and engaging the tire assembly with the engagement section.", "19 . The method of claim 18 , wherein the lifting the tire assembly with the tire tool comprises rotating the tire assembly from a substantially horizontal position toward a substantially vertical position.", "20 . The method of claim 15 , further comprising D) rotating the tire tool about the at least one pivot toward the pivoted state, rotating the tire tool about the at least one pivot toward the engagement state, or a combination thereof."], "bibtex": "@patent{20240391280,\n    title = {TOOL FOR USE WITH TIRE ASSEMBLIES},\n    number = {20240391280},\n    year = {2024},\n    note = {File: US20240391280A1-20241128.XML}\n    }", "classification": "B60C2502FI"}, {"title": "HITCH VIBRATION DAMPENER", "doc_number": "20240391281", "filename": "US20240391281A1-20241128.XML", "abstract": "A height adjustable tow mount assembly wherein locked engagement of corresponding through holes disposed in a tow mount member and an elongate member compresses a dampener member between an abutting front surface of the hitch platform elongate member and a rear surface of the tow mount member to thereby reduce movement and associated vibration between the hitch platform and tow mount member.", "detailed_description": ["It is to be expressly understood that the illustrative embodiment is a representation of the invention for explanatory purposes only and is not meant to unduly limit the claimed invention. The representative embodiments of the present invention are intended for use with receiver hitch systems including trailer mounts but also includes other dual or triple hitch mount configurations with or without a step hitch member such as detailed below. As will be apparent in a review ofFIGS.1-6, indistinct variants or species of tow mount assembly illustrated herein are tagged by suffixed hash marks, ′ or ″, denoting congruent features of the various embodiments. The illustrated as well as alternative embodiments may be used for original equipment installations and as an after-market accessory.", "", "As illustrated and described in detail below, exemplary embodiments of the present invention illustrated inFIGS.1-6depict a hitch assembly1,50″ including tow mount member20,40wherein vibration and noise emitted between shank hitch platform10,10′ or30, and tow mount member20,40exemplifying embodiments wherein dampener member22,22′, and32may be affixed to rear surface38,38′ of recessed column8or base block24.", "", "In exemplary embodiments shown inFIGS.1-6, a shank tube of hitch platform10or30is attachable within a corresponding receiver tube mounted beneath a bumper of a vehicle by well-known mounting techniques, such as by bolting or welding (not shown). In the illustrated embodiment, shank tube2is sized and configured for telescoped seating within a 1½ inch square or 2-inch square receiver tube (internal dimensions). As is readily apparent, the hitch dampener assembly of the present invention may be employed with other sizes of shapes of hitch receiver tubes and other vehicle attachment mechanisms.", "", "In the exemplary embodiments described herein, tow mount member20is illustrated as a dual hitch ball and tow mount member40depicts a tri-ball mount with a step member6. However, the scope of the claimed invention extends to other mount assemblies including but not limited to tow mount members featuring single or multiple hitch balls, hooks, step mounts and include pintle hooks or any tow accessory mount for cargo, bicycles, motorcycles, wheelchairs, or carriers, such as, for example, cargo containers, platforms and other types of receiver mounted devices.", "", "In embodiments such as illustrated inFIGS.1-4, tow mount assembly1,1′,1″ includes a shank hitch platform10,10′,10″ including a shank tube end2,2′ configured for telescoped coupled engagement within a receiver tube attached to a tow vehicle (not shown). Hitch platform10includes elongate member24disposed on a longitudinal axis perpendicular to the shank tube end2. Opposite and perpendicularly disposed to shank tube end20is elongate member24,24′,24″ wherein spaced through holes28A,28A′ are disposed and having a front surface38,38′,38″ that may be variously configured. Exemplary embodiments are respectively illustrated as a parallelogram-shaped block base24such as shown in inFIG.2, curvilinear block base24′ such as shown in tow mount assembly1′ ofFIG.2Band polygonal block base24″ such as shown in tow hitch assembly1″ ofFIG.2C.", "", "Hence it can be readily seen that front surface36,36′,36″ has opposed sides that can be variably configured, as respectively illustrated as a parallelogram-shaped such as shown inFIG.2, curvilinear such as shown inFIG.2Bor polygonal such as shown inFIG.2C. Disposed in parallel alignment with the rear surface36,36′,36″ are a plurality of spaced apart and aligned paired holes28A disposed in opposed flanges34. Paired holes28A are configured to correspond with through holes28B sides of elongate member24. It can thus be seen that at least a portion of the front surface of hitch platform10,10′,10″ and at least a portion of the rear surface of the base member24,24′,24″ are configured for coupled correspondence when fastening member16is respectively inserted within aligned through holes28.", "", "In some embodiments, such as illustrated inFIGS.2A and2B, by dampener22,22′ may abut front surface36,36′ only of tow mount member20,20′. In other various embodiments, such as illustrated inFIG.2C, dampener22″ between corresponding surfaces of tow mount member20″ can extend about the sides of the interior walls of the hitch platform10″ so as to abut the coextensively abutting walls of base member24″.", "", "Still referring toFIGS.1-4, tow mount assembly1,1′,1″ further includes receiver tow mount member20,20′,20″ having a respective base member32,32′,32″ and rear surface38,38′,38″ disposed between a pair of opposed flanges34,34′,34″ extending outwardly from the rear surface38,38′,38″ and a front receiver end30,30′,30″ opposite respective rear surface38,38′38″. Extending rearwardly from the planar rear face38are opposed flanges34configured for slidable correspondence with the side walls of elongate member24,24′,24″ of hitch platform10,10′10″, wherein the pair of opposed flanges34,34′,34″ have paired side holes36,36′,36″ disposed in parallel alignment, wherein fastening member16is received by a pair of corresponding through holes28A,28A′ of elongate member24,24′,24″ and aligned paired side holes28B.", "", "As best illustrated inFIGS.5and6, dampener member22and22′ may be affixed to either tow mount member20,20′,20″ or hitch platform10,10′,10″.FIG.5illustrates various embodiments wherein dampener member22,22′,22″ is affixed to at least a portion of surface36,36′,36″ of tow mount member20,20′20″ base member32,32′,32″ such that coupling of fastening member16within aligned paired side holes28B and through holes28,28′,28″ compresses corresponding dampener member22,22′,22″ between front surface36,36′,36″ of elongate member24,24′,24″ of hitch platform10,10′,10″ and rear surface38,38′,38″ of tow mount member20,20′,20″.", "", "Coupling of fastening member16with aligned side holes28B and through holes28A such that respective surface36,36′,36″ of elongate member24,24′,24″ and38,38′,38″ of tow mount member20,20′,20″ is in seated alignment whereby dampener member22,22′,22″ is compressed between corresponding coextensive front surface36,36′,36″ of elongate member24,24′,24″ and rear surface38,38′,38of base member32,32′32″. Such compression of dampener member22,22′,22″ thereby reduces vibration and associated vibration and sway resulting from movement and metal-to-metal contact between abutting surfaces of tow mount member20,20′20″ and hitch platform10,10′,10″.", "", "The illustrated embodiments illustrate an exemplary fastening member16as least one two elongate pins configured for coupled engagement with corresponding aligned side holes and having a clip pin hole and wherein the clip is configured to secure the clip pin within the selected corresponding aligned side holes when coupled in locked engagement with the clip pin hole, commercially known as a cotter pin. However, the fastening member may in various embodiments comprise various other clips and retaining mechanisms configured to couple the paired side holes36,36′ with a corresponding through hole36of elongate member24, wherein the tow mount members are two hitch balls of different diameters.", "", "Now referring toFIGS.5and6, other exemplary embodiments include tow mount assembly50with a shank tube end52providing channel hitch platform30having paired aligned side holes48in flanges44for coupling a tow mount member40having dual or triple hitch balls and a step member extending from elongate base member34sized and configured for slidably fitted correspondence within the recessed column38. As illustrated inFIG.5, dampener32may be affixed to rear surface38of shank hitch platform30by a plurality of screws48.", "", "Referring toFIG.6, various embodiments illustrated as tow mount assembly50may feature tow mount member40having two pairs of through holes54disposed between two transverse pairs of opposed side walls of such that base member44adaptably rotatable to position the desired receiving hitch ball or step6in an upward use position such that paired side holes48and a corresponding pair of through holes54are positioned to thereby enable coupling with fastening member16having two elongate pins received through aligned side holes48and through holes54so as to seat base member34seat in coupled aligned engagement within flanges44and recessed column38of hitch platform such that tow mount member40thereby compresses the dampener member42upon the planar rear face48of tow mount member40so as to dampen vibration associated with the strain, noise and sway emitted by a trailer or other tow accessory.", "", "While the exemplary embodiments illustrated inFIGS.1-6depict dampener member22,22′,22″,42,42′ in exemplary configurations, alternative configurations of dampener member may vary in accordance with the use and dimensions of the respective platform, tow accessory and tow vehicle in connection with which it is being deployed.", "", "Configurations of dampener member22,22′,22″,42,42′ in various embodiments can take on various configurations which may include linear, curvilinear, convex or concave portions. In some embodiments, dampener member22,22′,22″,42,42′ may include a dampener border of at least a portion of an area within 1 inch of an upper edge, at least a portion within 1 inch of a lower edge and at least a portion within 1 inch of the side edges of a planar front face of an elongate member platform or a corner an abutment of the interior side wall of the pair of flanges. Some embodiments of the dampener member may feature a hollow center portion.", "", "In various embodiments such as illustrated inFIG.3, dampener member22is provided as an adhered layer applied to rear face38of tow mount member20. In various embodiments, dampener member is affixed to at least a portion of the planar rear face of the base member includes a dampener border of the rear planar member, wherein the dampener border includes at least a portion of an area within 1 inch of an upper edge, at least a portion within 1 inch of a lower edge and at least a portion within 1 inch of an abutment of the interior side wall of the pair of flanges.", "", "In some embodiments, the dampener member is detachably affixed. As such, dampener member22,22′,22″,42,42′ may be provided in a kit form or as an after-market component.", "", "The composition of the dampener member22,22′,22″,42,42′ may include various suitable materials, such as, for example, a polymer, elastomer, rubber or other pliable, impact or vibration-absorbing material of suitable density, flex, and durability and is functionally adaptable to dampen, buffer, dissipate or attenuate, a vibration, impact, shock, stress, strain or torque exerted by an external force. The impact absorbing or dampening composition of dampener member22,22′,22″,42,42′ is configurable in any suitable size and shape such as, for example, a curved or circular device, bumper, washer, block, sheet, sleeve or other form that is adaptable to the geometry of the tow hitch platform and mount member.", "", "In some embodiments, dampener member22,22′,22″,42,42′ such as shown inFIGS.1-6may be affixed by a single metal screw or multiple screws. Alternative embodiments may affix a dampener member by fusing, adhering of embedding the material to a front surface such as36,36′,36″,46of elongate member24,24′ or recessed column front surface46of hitch platform30. Commercially available industrial strength epoxies, lasers, milling procedures or other means or materials well known in the art may be employed to thus affix dampener member22,22′,22″,42,42′ and corresponding abutting surfaces.", "", "The scope of the present invention expressly contemplates and includes any shape as well as composition providing the impact and vibration absorbing or attenuation, the extent of which may correspond to the hitch dampener member composition's mechanical properties, including without limitation, vibration and impact absorption capacity, pliability, tensile strength and density.", "", "As will be apparent to persons of ordinary skill in the art of tow hitch assembly design and engineering, the extent and impact receiving and attenuation capacity of the device of the present invention correlates to the dampener surface area, thickness and density. More specifically, the vibration dampener member22,22′,22″,42,42′ surface area, thickness and density correspond with the connection tension of the hitch vibration dampening assembly exerted which is a function of the weight, shape and size, aerodynamics as well as force and torque exerted on the tow hitch assembly when in use.", "", "Various embodiments of the present invention may include a range of two accessory mount receivers, including various size hitch balls, hooks, clips and carabiners and other mechanisms for mounting a tow accessory. Embodiments may also include mechanisms for locking the receiver mounts in secured engagement such as provided by a pintle hook, locks, biasing members, cotter pins and similar mechanisms. In yet further embodiments, the channel member may further include horizontal cross members perpendicularly disposed between the opposed flanges and spaced between the aligned side holes whereby the horizontal cross members provide lateral support for the base member of the tow mount member.", "", "It is to be expressly understood that the descriptive embodiment is provided herein for explanatory purposes only and is not meant to unduly limit the claimed inventions. Various embodiments are intended for use with receiver hitch systems including trailer mounts as well as other tow accessories and may be used for original equipment installations or as after-market components.", "", "Hence, it is to be further expressly understood that these exemplary embodiments are provided for descriptive purposes only and not meant to unduly limit the scope of the claimed inventions. Other embodiments are also considered to be within the scope of the present inventions."], "claims": ["a hitch platform having a shank tube end configured for telescoped coupled engagement within a receiver tube attached to the vehicle, an elongate member disposed on a longitudinal axis perpendicular to the shank tube member having a front face opposite the shank tube end, and wherein the elongate member further includes a plurality of through holes orthogonally disposed to the longitudinal axis of the elongate member such that the plurality of through holes are equidistantly spaced back from the front surface of the elongate member; a tow mount member having a base member with a rear surface disposed between a pair of opposed flanges extending outwardly from the rear surface and a receiver end opposite to the rear surface, wherein the pair of opposed flanges are configured for slidable correspondence with the elongate member of the hitch platform, wherein the pair of opposed flanges have paired side holes disposed in parallel alignment for receiving a fastening member to thereby secure the tow mount member in coupled engagement with the hitch platform; a dampener member affixed to at least a portion of the planar rear surface of the base member disposed between the pair of opposed flanges; and at least one fastening member configured for coupling one of the through holes of the elongate member between the paired side holes of the opposed flanges such that seated engagement of the fastening member with the side holes squarely couples the elongate member between the pair of opposed flanges such that the rear surface of the elongate member is aligned with the front surface of the rear surface of the base member to thereby compress the dampener member upon the rear surface of the base member.", "2 . The tow mount assembly of claim 1 , wherein at least a portion of the front surface of the hitch platform and at least a portion of the rear surface of the base member are configured for coupled correspondence.", "The tow mount assembly of", "4 . The tow mount assembly of claim 1 , wherein the dampener member is affixed by adhesion, fusion or coating.", "5 . The tow mount assembly of claim 1 , wherein the dampener member is affixed to at least a portion of the planar rear surface of the base member and wherein the dampener member includes a dampener border of the rear member, wherein the dampener border includes at least a portion of an area within 1 inch of an upper edge, at least a portion within 1 inch of a lower edge and at least a portion within 1 inch of an abutment of the interior side wall of the pair of flanges.", "6 . The tow mount assembly of claim 1 , wherein the dampener member includes a hollow center portion.", "7 . The tow mount assembly of claim 1 , wherein the dampener member is detachably affixed.", "8 . The tow mount assembly of claim 1 , wherein the receiver end includes a radially disposed dual hitch ball comprising a first hitch ball and a second hitch ball of a different diameter than the first hitch ball.", "a hitch platform having a shank tube member having an elongate end portion configured for telescoped coupled engagement within a receiver tube attached to the tow vehicle, a channel member having a recessed column disposed between opposed flanges, wherein the shank tube member is affixed to a back surface of the recessed column such that the channel member is longitudinally disposed along a substantially perpendicular axis opposite to the elongate end portion of the shank tube, and wherein a plurality of spaced pairs of aligned side holes are disposed in the opposed flanges; a tow mount member having a base member configured for slidable correspondence with the channel member, wherein the base member has a planar rear surface between linear side edges, and wherein a pair of opposed side walls are perpendicularly disposed from the linear side edges, and wherein at least one through hole is disposed in parallel alignment with the planar rear surface between the opposed side walls; a dampener member affixed to at least a portion of the recessed column of the channel member; a receiver end opposite to the planar rear surface, wherein the receiver end includes a plurality of tow accessory mounts radially disposed in different directions from a pedestal; and at least one fastening member configured for coupling the through hole of the base block between the paired side holes of the channel member such that securing the base block in squared alignment with the recessed channel of the hitch platform compresses the dampener member against the channel member.", "11 . The tow mount assembly of claim 10 , wherein the plurality of tow accessory mounts include three hitch balls, wherein the three hitch balls have different diameters.", "12 . The tow mount assembly of claim 11 , wherein the plurality of tow accessory mounts further comprises a step member, a tow hook or a pintle hook.", "13 . The tow mount assembly of claim 12 , wherein the channel member further includes horizontal cross members perpendicularly disposed between the opposed flanges and spaced between the aligned side holes, wherein the horizontal cross members provide lateral support for the base member of the tow mount member.", "14 . The tow mount assembly of claim 10 , wherein the plurality of tow accessory mounts include three hitch balls, wherein the three hitch balls have different diameters.", "15 . The tow mount assembly of claim 14 , wherein the plurality of tow accessory mounts further comprises a step member or a hook member.", "16 . The tow mount assembly of claim 14 , further comprising a pintle hook.", "17 . The tow mount assembly of claim 10 , wherein the dampener member is adhered or fused to at least a portion of the recessed column of the tow hitch platform.", "18 . The tow mount assembly of claim 10 , wherein the dampener member is affixed to the recessed column by a plurality of screws.", "19 . The tow mount assembly of claim 10 , wherein the dampener member is affixed to at least a portion of the recessed column of the tow hitch member, wherein the at least a portion of the recessed column includes at least a portion of an area within 1 inch of an upper edge of the recessed column, at least a portion within 1 inch of a lower edge of the recessed column and at least a portion within 1 inch of a corner adjoining the recessed column and the interior side wall of the pair of flanges.", "20 . The tow mount assembly of claim 10 , wherein the dampener member is detachable."], "bibtex": "@patent{20240391281,\n    title = {HITCH VIBRATION DAMPENER},\n    number = {20240391281},\n    year = {2024},\n    note = {File: US20240391281A1-20241128.XML}\n    }", "classification": "B60D106FI"}, {"title": "Trailer Hitch and Trailer Hitch System", "doc_number": "20240391282", "filename": "US20240391282A1-20241128.XML", "abstract": "A vehicle hitch and a vehicle hitch system are provided. The vehicle hitch includes a frame, a receiver, a mount, a receiver locking mechanism and a mount locking mechanism. The frame is configured to be mounted to a vehicle member. The receiver includes an upper body rotatably coupled to the frame, and a lower body that defines an opening and an inner cavity. The mount is slidingly disposed within the inner cavity. The receiver locking mechanism is configured to secure the receiver in stowed and deployed positions with respect to the frame. The mount locking mechanism is configured to secure the mount in retracted and extended positions with respect to the receiver. The vehicle hitch system includes a vehicle hitch and a vehicle bumper that includes a cover that defines an opening, and a motorized panel configured to cover and uncover the opening.", "detailed_description": ["A trailer hitch connects a vehicle to, for example, a trailer, such as an open-air trailer, an enclosed trailer, a travel trailer, etc., for towing. Trailer hitches may be used for other purposes as well, such as providing a vehicle mount for a bicycle rack, a platform, a spare tire carrier, a cargo carrier, etc. Generally, a trailer hitch may also be known as a vehicle hitch. A trailer hitch typically includes a receiver mounted to the rear bumper, frame, member, etc. of the vehicle, and a ball mount that extends from the receiver. The trailer includes a tongue that extends from the front of the trailer. The tongue has a ball coupler that connects to the ball mount of the trailer hitch.", "", "Generally, the ball mount interferes with the ability of the vehicle to traverse inclined surfaces by reducing the vehicle's departure angle, i.e., the maximum angle with respect to the horizontal plane that the vehicle can climb without damage.", "", "Some trailer hitches have retractable ball mounts that rotate about a vertical axis. Unfortunately, these trailer hitches require a large rectangular opening in the lower rear bumper cover to receive the entire length of the ball mount. While a retractable ball mount may mitigate the reduction in the departure angle noted above, the large rectangular opening in lower rear bumper cover allows debris buildup behind the bumper cover and increases aerodynamic drag.", "", "Embodiments of the present disclosure advantageously provide a trailer hitch that is mounted to the reinforcement bar of the bumper or other suitable vehicle member that is disposed behind the bumper cover. The trailer hitch includes a frame, a receiver, a mount, a receiver locking mechanism and a mount locking mechanism. The frame is configured to be mounted to the vehicle member. The receiver includes an upper body rotatably coupled to the frame, and a lower body that defines an opening and an inner cavity. The mount is slidingly disposed within the inner cavity. The receiver locking mechanism is configured to secure the receiver in stowed and deployed positions with respect to the frame. The mount locking mechanism is configured to secure the mount in retracted and extended positions with respect to the receiver. The mount may include a trailer ball attached to an end, a rack for a bicycle, a stowage container, etc.", "", "In many embodiments, the frame includes two support brackets, the receiver is coupled to the support brackets using a rotational coupling, such as a pin, a bearing, etc., and the receiver rotates in a vertical plane about the horizontal axis. The receiver locking mechanism includes a body and a locking pin. The body has a lever and a cam surface, and defines an opening proximate to (e.g., near, adjoining, close to, adjacent to, etc.) the cam surface. The locking pin is displaceable within the opening, and has a shoulder that engages the cam surface. During rotation of the first locking mechanism, the cam surface displaces the locking pin in a direction parallel to a horizontal axis.", "", "In many embodiments, each support bracket includes a contact surface that defines an opening, and the receiver includes a first contact surface that defines a recess and a second contact surface that defines a recess. The first contact surface of the receiver is associated with the stowed position, while the second contact surface of the receiver is associated with the deployed position. In the stowed position, the locking pin is configured to engage the contact surfaces in each support bracket and the first contact surface of the receiver. In the deployed position, the locking pin is configured to engage the contact surfaces in each support bracket and the second contact surface of the receiver.", "", "Embodiments of the present disclosure also provide a trailer hitch system that includes a trailer hitch and a vehicle bumper. The trailer hitch includes a frame, a receiver and a mount. The frame is configured to be mounted to a vehicle member. The receiver is attached to the frame, and has a stowed position and a deployed position. The mount is coupled to the receiver. The vehicle bumper includes a cover, and a motorized panel. The cover is configured to be attached to the vehicle member, and includes a lower portion defining an opening through which the mount extends in the deployed position. The motorized panel is configured to cover and uncover the opening, and has a closed position and an open position.", "", "Embodiments of the present disclosure advantageously facilitate ground clearance, provide an advantageous maximum departure angle when the vehicle is traversing an inclined surface, and prevent debris buildup within the space behind the bumper cover. Additionally, many embodiments of the present disclosure provide advantageous aerodynamic effects when the trailer hitch is stowed and the motorized panel is closed, as well as when the ball mount is deployed and the motorized panel is open or partially closed.", "", "FIG.1Adepicts an example of electric vehicle100, in accordance with embodiments of the present disclosure.", "", "Electric vehicle100includes, inter alia, a body, a propulsion system, an energy storage system, an auxiliary or accessory system, etc. Body110includes, inter alia, a frame or chassis, front end112, driver/passenger compartment or cabin114, trunk or bed116, rear end118, rear bumper120that defines an opening protected by a motorized panel, a frunk, stowage compartments, etc. Rear bumper120includes a cover, a reinforcement bar, an absorber and a mount or mounting system.", "", "The propulsion system includes, inter alia, one or more electronic control units (ECUs), one, two or four (or more) electric motors130with associated transmissions and drivetrains, a suspension subsystem, a steering subsystem, wheels132, etc. The energy storage system includes, inter alia, one or more ECUs, battery pack140, a vehicle charging subsystem including the charging port, etc. The auxiliary or accessory system includes, inter alia, one or more ECUs, an electrical power distribution system, a heating and air conditioning system, cabin displays, interior and exterior lighting systems, integrated electrical devices, etc.", "", "FIGS.1B,1C,1Dillustrate a portion of rear bumper120of electric vehicle100, in accordance with embodiments of the present disclosure. Vertical and horizontal axes are identified for reference purposes.", "", "Rear bumper120includes, inter alia, cover122which includes upper portion123, cover lower portion124and motorized panel126. Cover upper portion123is disposed in front of the reinforcement bar and is substantially parallel to the vertical axis, while cover lower portion124is disposed beneath the reinforcement bar and is substantially parallel to the horizontal axis.", "", "Cover lower portion124defines opening128for trailer hitch200. Motorized panel126covers (e.g., closes, shuts, seals, etc.) opening128when trailer hitch200is stowed (FIG.1B), and uncovers (e.g., opens, unseals, etc.) opening128prior to (or during) trailer hitch200deployment (FIG.1C). In many embodiments, motorized panel126remains open (e.g., uncovers opening128) after trailer hitch200has been deployed (FIG.1D). In certain embodiments, trailer hitch200may need a larger opening128through cover lower portion124during deployment than after deployment. For example, trailer hitch200may rotate through a vertical plane that is skewed with respect to reinforcement bar121, such as a 45° skewed vertical plane (as depicted inFIGS.3A,3B,3C,4A,4B). Accordingly, after trailer hitch200has been deployed, motorized panel126may partially close in order to partially cover opening128.", "", "FIGS.2A,2B and2Cdepict front perspective views of trailer hitch200, in accordance with embodiments of the present disclosure.", "", "Trailer hitch200includes, inter alia, frame210, receiver220, mount230, receiver locking mechanism240and mount locking mechanism250. Vertical and horizontal axes are identified for reference purposes.", "", "Frame includes bracket212and bracket214. Bracket212includes contact surface213(identified inFIG.2F) that defines an opening to accept locking pin246of receiver locking mechanism240. Similarly, bracket214includes contact surface215that defines an opening to accept locking pin246of receiver locking mechanism240. Generally, frame210may be mounted to a suitable vehicle member that is disposed behind cover upper portion123and above cover lower portion124. In many embodiments, frame210is mounted to reinforcement bar121of rear bumper120. Rotational coupling216(identified inFIG.2F), such as a pin, a bearing, etc., couples receiver220to frame210to enable receiver220to rotate in a vertical plane about the horizontal axis.", "", "Receiver220includes upper body221(identified in dashed outline inFIG.2F) and lower body226(identified in dashed outline inFIG.2F).", "", "Upper body221includes a pair of shoulders222, lever224, and contact surface225(identified inFIG.2F). Each shoulder222includes contact surface223, and each contact surface223defines a recess to accept locking pin246of receiver locking mechanism240. Similarly, contact surface225defines a recess to accept locking pin246of receiver locking mechanism240.", "", "Lower body226includes edge227, contact surface228, and contact surface229. Edge227defines an opening leading to an inner cavity that accepts mount230. Contact surface228defines an opening to accept mount locking mechanism250. Similarly, contact surface229defines an opening to accept mount locking mechanism250. Contact surface228is associated with a locked retracted position for mount230, while contact surface229is associated with a locked extended position for mount230.", "", "Generally, mount230includes an end effector. In many embodiments, the end effector is a ball232for coupling electric vehicle100to a trailer, such as a 2 inch diameter ball, a 1⅞ inch diameter ball, a 2 1/16 diameter ball, etc. In other embodiments, the end effector may be a bicycle rack, a platform, a spare tire carrier, a cargo carrier, etc. When installed, mount230is slidingly disposed within the inner cavity of lower body226between the locked retracted position and the locked extended position. In many embodiments, mount230may be completely removed from lower body226of receiver220.", "", "Receiver locking mechanism240includes body241, lever242, cam surface244, locking pin retention tab245(identified inFIG.2E), locking pin246, locking pin shoulder247, body retention tab248, and spring249(such as a coil spring identified inFIGS.2D,2E). Body241defines opening243to accept locking pin246.", "", "When receiver220is disposed in the locked stowed position (FIG.2A), locking pin246passes through opening243and engages contact surface213, contact surfaces223and contact surface215. Locking pin246does not engage contact surface225.", "", "When receiver220is disposed in the unlocked stowed position (FIG.2B), locking pin shoulder247engages cam surface244, and locking pin246is disposed within opening243. Locking pin246may (or may not) engage contact surface213, but does not engage contact surfaces223, contact surface215or contact surface225.", "", "When receiver220is disposed in an unlocked intermediate position during deployment (FIG.2C), locking pin shoulder247engages cam surface244, and locking pin246is disposed within opening243. Locking pin246may (or may not) engage contact surface213, but does not engage contact surfaces223, contact surface215or contact surface225.", "", "When receiver220is disposed in the unlocked deployed position (FIG.2D), locking pin shoulder247engages cam surface244, and locking pin246is disposed within opening243. Locking pin246may (or may not) engage contact surface213, but does not engage contact surfaces223, contact surface215or contact surface25.", "", "When receiver220is disposed in the locked deployed position (FIG.2E,2F,2G), locking pin246passes through opening243and engages contact surface213, contact surface225and contact surface215. Locking pin246does not engage contact surfaces223.", "", "Mount locking mechanism250may be a spring-loaded pin, etc. When mount230is disposed in the locked retracted position (FIGS.2A,2B,2C,2D,2E,2F), mount locking mechanism250engages contact surface228. Similarly, when mount230is disposed in the locked extended position (FIG.2G), mount locking mechanism250engages contact surface229.", "", "Generally, to transition mount230from the locked retracted position to the locked extended position, mount locking mechanism250is disengaged, mount230is moved from the retracted to the extended position, and then mount locking mechanism250is engaged. To remove mount230from receiver220, after mount230is disposed in the locked extended position, mount locking mechanism250is disengaged and then mount230is simply removed from the inner cavity of lower body226.", "", "For example, mount locking mechanism250may be disengaged from contact surface228by depressing or pushing in the spring-loaded pin and sliding mount230along the inner cavity of lower body226until the spring-loaded pin disengages from contact surface228. When the spring-loaded pin reaches the opening defined by contact surface229, the spring-loaded pin will automatically extend through the opening and engage contact surface229, thereby locking mount230in the extended position.", "", "Generally, to transition receiver220from the locked stowed position to the locked deployed position, receiver locking mechanism240is unlocked, receiver220is rotated from the stowed position to the deployed position, and receiver locking mechanism240is then locked.", "", "FIG.2Adepicts trailer hitch200with receiver220disposed in the locked stowed position, whileFIG.2Bdepicts trailer hitch200with receiver220disposed in the unlocked stowed position.", "", "To unlock receiver locking mechanism240, lever242is depressed, which rotates receiver locking mechanism240about a rotation axis parallel to the horizontal axis and causes locking pin shoulder247to engage with, and move along, the inclined portion of cam surface244. Accordingly, the rotation of receiver locking mechanism240is translated into the linear motion of locking pin246by the interaction of locking pin shoulder247and cam surface244, resulting in the displacement of locking pin246in a direction parallel to the horizontal direction and the disengagement of locking pin246from contact surface213, contact surfaces223and contact surface215. The receiver and locking mechanism rotation axis, and the prescribed path followed by lever242from the locked stowed position to the unlocked stowed position, are depicted in dashed lines.", "", "Spring249may resist the rotation of receiver locking mechanism240during unlocking, and may assist the rotation of receiver locking mechanism240during locking (under tension in the unlocked positionFIG.2D, under minimal tension or the set tension in the locked position inFIG.2E).", "", "FIG.2Cdepicts trailer hitch200with receiver220disposed in the unlocked intermediate position in which receiver220has been rotated approximately 50% of the angular distance from the unlocked stowed position to the unlocked deployed position. The receiver and locking mechanism rotation axis, and the prescribed paths followed by edge227and lever224from the unlocked stowed position to the unlocked intermediate position, are depicted in dashed lines.", "", "FIGS.2D and2Edepict left side views of trailer hitch200, whileFIG.2Fdepicts a right side view of trailer hitch200, in accordance with embodiments of the present disclosure. Due to the change from perspective to left side view, the depth axis replaces the horizontal axis which is now perpendicular to the view.", "", "FIG.2Ddepicts trailer hitch200with receiver220disposed in the unlocked deployed position.FIG.2Edepicts trailer hitch200with receiver220disposed in the locked deployed position. The prescribed path followed by lever224from the unlocked deployed position to the locked deployed position, is depicted in dashed line.FIG.2Fdepicts trailer hitch200with receiver220disposed in the locked deployed position.", "", "FIG.2Gdepicts a front perspective view of trailer hitch200, in accordance with embodiments of the present disclosure.", "", "FIG.2Gdepicts trailer hitch200with receiver220disposed in the locked deployed position and mount230disposed in the locked extended position. Bumper mounts125are also depicted.", "", "Generally, to transition receiver220from the locked deployed position to the locked stowed position, mount locking mechanism250is unlocked, mount230is transitioned to the retracted position, mount locking mechanism250is locked, receiver locking mechanism240is then unlocked, receiver220is rotated from the deployed position to the stowed position, and receiver locking mechanism240is then locked.", "", "In certain embodiments, mount230may be removed from receiver220after mount locking mechanism250is unlocked, and then stored within the vehicle or elsewhere. After mount230is removed from receiver220, receiver locking mechanism240is unlocked, receiver220is rotated from the deployed position to the stowed position, and then receiver locking mechanism240is locked. To transition receiver220(without mount230) from the locked stowed position to the locked deployed position, mount locking mechanism250is unlocked, receiver220is transitioned to the deployed position, mount locking mechanism250is locked, and mount230is then inserted into receiver220and locked in the extended position. In some embodiments, mount230includes a locked extended position only.", "", "FIGS.3A,3B and3Cdepict diagrams of a portion of rear end118of electric vehicle100, in accordance with embodiments of the present disclosure. Vertical and horizontal axes are identified for reference purposes.", "", "As discussed above, rear bumper120includes, inter alia, reinforcement bar121, cover122which includes upper portion123, cover lower portion124and motorized panel126. Cover upper portion123is disposed in front of reinforcement bar121and is substantially parallel to the vertical axis, while cover lower portion124is disposed beneath the reinforcement bar and is substantially parallel to the horizontal axis.", "", "Cover lower portion124defines opening128for trailer hitch300. Motorized panel126covers (closes, shuts, seals, etc.) opening128when trailer hitch300is stowed (FIG.3A), and uncovers (opens, unseals, etc.) opening128prior to (or during) trailer hitch300deployment (FIG.3B). In many embodiments, motorized panel126remains open (i.e., uncovers opening128) after trailer hitch300has been deployed (FIG.3C). In certain embodiments, trailer hitch300may need a larger opening128through cover lower portion124during deployment than after deployment. For example, trailer hitch200may rotate through a vertical plane that is skewed with respect to reinforcement bar121, such as a 45° skewed vertical plane (as depicted inFIGS.3A,3B,3C,4A,4B). Accordingly, after trailer hitch300has been deployed, motorized panel126may partially close in order to partially cover opening128.", "", "FIGS.4A and4Bdepict front perspective views of trailer hitch300, in accordance with embodiments of the present disclosure.", "", "Trailer hitch includes, inter alia, frame310, receiver320including actuator360such as an electric motor, etc., and mount330including ball332. Receiver320is attached to mounting surface311of frame310, and mount330is coupled to receiver320by actuator360. Receiver320has a stowed position in which actuator360has positioned mount330behind reinforcement bar121, and a deployed position, in which actuator360has positioned mount330in front of reinforcement bar121.", "", "One or more commands from an ECU of electric vehicle100opens motorized panel126, and activates actuator360to deploy trailer hitch300. Similarly, one or more commands from the ECU activates actuator360to stow trailer hitch300, and close motorized panel126.", "", "Generally, frame310may be mounted to a suitable vehicle member that is disposed behind cover upper portion123and above cover lower portion124. In many embodiments, frame310is mounted to reinforcement bar121of rear bumper120such that mounting surface311is presented at an oblique angle with respect to the vertical axis, such as 45°.", "", "FIG.4Adepicts trailer hitch300in the stowed position, whileFIG.4Bdepicts trailer hitch300in the deployed position.", "", "The many features and advantages of the disclosure are apparent from the detailed specification, and, thus, it is intended by the appended claims to cover all such features and advantages of the disclosure which fall within the scope of the disclosure. Further, since numerous modifications and variations will readily occur to those skilled in the art, it is not desired to limit the disclosure to the exact construction and operation illustrated and described, and, accordingly, all suitable modifications and equivalents may be resorted to that fall within the scope of the disclosure."], "claims": ["a frame configured to be mounted to a vehicle member; a receiver including an upper body rotatably coupled to the frame, and a lower body defining an opening and an inner cavity; a mount slidingly disposed within the inner cavity; a receiver locking mechanism configured to secure the receiver in a stowed position with respect to the frame, and to secure the receiver in a deployed position with respect to the frame; and a mount locking mechanism configured to secure the mount with respect to the receiver.", "2 . The vehicle hitch of claim 1 , wherein the frame includes first and second support brackets, the receiver is coupled to the first and second support brackets using a rotational coupling, and the receiver rotates in a vertical plane about a horizontal axis.", "3 . The vehicle hitch of claim 2 , wherein the rotational coupling is a pin.", "4 . The vehicle hitch of claim 2 , wherein the receiver locking mechanism is rotationally coupled to the first support bracket, and is configured to rotate in the vertical plane about the horizontal axis.", "the receiver locking mechanism includes: a body having a lever and a cam surface, the body defining an opening proximate to the cam surface, and a locking pin, displaceable within the opening, having a shoulder that engages the cam surface; and during rotation of the receiver locking mechanism, the cam surface displaces the locking pin parallel to the horizontal axis.", "the first support bracket includes a first contact surface that defines a first opening; the second support bracket includes a second contact surface that defines a second opening; the receiver includes a first contact surface, associated with the stowed position, that defines a first recess; the receiver includes a second contact surface, associated with the deployed position, that defines a second recess; in the stowed position, the locking pin is configured to engage the first contact surface of the first support bracket, the second contact surface of the second support bracket, and the first contact surface of the receiver; and in the deployed position, the locking pin is configured to engage the first contact surface of the first support bracket, the second contact surface of the second support bracket, and the second contact surface of the receiver.", "7 . The vehicle hitch of claim 6 , wherein the body of the receiver locking mechanism is retained by a first retention tab, and the locking pin is retained by a second retention tab.", "a spring, coupled to the first support bracket and the body of the receiver locking mechanism, configured to resist rotation of the receiver locking mechanism during unlocking, and assist rotation of the receiver locking mechanism during locking.", "the mount locking mechanism includes a captured spring-loaded pin configured to translate parallel to the horizontal axis; the mount locking mechanism is configured to secure the mount in a retracted position with respect to the receiver; and the mount locking mechanism is configured to secure the mount in an extended position with respect to the receiver.", "the lower body of the receiver has a first side and a second side; the second side opposes the first side; the first side defines a first opening having a first contact surface and a second opening having a second contact surface; the second side defines a third opening having a third contact surface and a fourth opening having a fourth contact surface; the third opening opposes the first opening, and the fourth opening opposes the second opening; the first and third openings are associated with the retracted position, and the second and fourth openings are associated with the extended position; the captured spring-loaded pin is configured to engage the first and third contact surfaces in the retracted position; and the captured spring-loaded pin is configured to engage the second and fourth contact surfaces in the extended position.", "11 . The vehicle hitch of claim 1 , wherein the inner cavity of the lower body of the receiver and the mount have rectangular cross-sections.", "12 . The vehicle hitch of claim 1 , wherein the mount includes a trailer ball.", "a vehicle hitch, including: a frame configured to be mounted to a vehicle member, a receiver, attached to the frame, having a stowed position and a deployed position, and a mount coupled to the receiver; and a vehicle bumper, including: a cover, configured to be attached to the vehicle member, including a lower portion defining an opening through which the mount extends in the deployed position, and a motorized panel, configured to cover and uncover the opening in the lower portion of the cover, having a closed position and an open position.", "when the motorized panel is disposed in the closed position, the motorized panel covers the opening; when the motorized panel is disposed in the open position, the motorized panel uncovers the opening; when the mount is disposed in the stowed position, the mount does not extend through the opening; and when the motorized panel is disposed in the open position and the mount is disposed in the deployed position, an end of the mount extends through the opening.", "15 . The vehicle hitch system of claim 14 , wherein, when the motorized panel is disposed in the open position, the motorized panel partially covers the opening.", "16 . The vehicle hitch system of claim 14 , wherein the receiver includes an actuator that is configured to rotate the mount through a vertical plane that is skewed with respect to the vehicle bumper.", "the receiver includes an upper body rotatably coupled to the frame, and a lower body defining an opening and an inner cavity; and the mount is slidingly disposed within the inner cavity.", "a receiver locking mechanism configured to secure the receiver in a stowed position with respect to the frame, and to secure the receiver in a deployed position with respect to the frame; and a mount locking mechanism configured to secure the mount in a retracted position with respect to the receiver, and to secure the mount in an extended position with respect to the receiver.", "unlocking the receiver; rotating the receiver with respect to the frame from a stowed position to a deployed position; locking the receiver in the deployed position; unlocking the mount from the receiver; translating the mount with respect to the receiver from a retracted position to an extended position; and locking the mount in the extended position.", "the receiver locking mechanism includes: a body having a lever and a cam surface, the body defining an opening proximate to the cam surface, and a locking pin, displaceable within the opening, having a shoulder that engages the cam surface; the unlocking the receiver includes: rotating, via the lever, the receiver locking mechanism, and displacing, via the cam surface, the locking pin to disengage the locking pin from the frame and the receiver; and the locking the receiver includes: rotating, via the lever, the receiver locking mechanism, and displacing, via the cam surface, the locking pin to engage the locking pin to the frame and the receiver."], "bibtex": "@patent{20240391282,\n    title = {Trailer Hitch and Trailer Hitch System},\n    number = {20240391282},\n    year = {2024},\n    note = {File: US20240391282A1-20241128.XML}\n    }", "classification": "B60D106FI"}]