[{"title": "SPINDLE REPAIR APPARATUS AND METHOD", "doc_number": "20240075768", "filename": "US20240075768A1-20240307.XML", "abstract": "The apparatus is for use with a mechanism of the type which, when manufactured, has an axle tube terminating in a brake mount, a spindle extending from the brake mount, a spider plate mounted to the brake mount in surrounding relation to the spindle, a hub mounted to the spindle and a wheel mounted to the hub. The apparatus is adapted to receive the hub in the manner of the spindle, adapted to be mounted to the brake mount and adapted to capture the spider plate against the brake mount.", "detailed_description": ["Example embodiments of the inventive apparatus and method are described below but as an initial matter both should be understood to be for use mechanisms of the general prior art type shown inFIGS.1and2, namely, a wheel assembly100.", "", "This mechanism will be understood to include, with reference to the sequence ofFIGS.1-8:a wheel102,a hub104and caliper106which are revealed when the wheel is removed from the hub as shown inFIG.3a lock nut108and spring clip110which are accessible for removal when the axle112is removed as indicated byFIGS.5,6a spider plate114which is revealed when hub104is removed as inFIG.7a brake mount116which is revealed when the spider plate114is removed, as inFIG.8", "", "The example apparatus20is shown inFIG.11and will be understood to comprise a spindle portion22and a spider portion24, tack welded together.", "", "The spindle portion has a spindle part26that has the shape of the prior art spindle and a flange part28.", "", "The spider portion has the general shape of the prior art spider.", "", "The example method involves the example apparatus and will be understood to commence with the disassembly of a damaged wheel assembly to expose the spindle as shown inFIG.8and the following steps:severance of the (damaged) spindle from the balance of the tube by cutting or the like at the factory weld, as indicated inFIG.9mounting theFIG.11apparatus to the brake mount as indicated inFIG.13operatively reinstalling the axle as hub as inFIG.15; andmounting the wheel to the hub, as inFIG.16", "", "FIG.17through20Bshow the apparatus20in further detail. More particularly, it will be seen in these figures that the flange of the spindle portion has a stepped hollow in the rear face therein adapted to receive the brake mount and spindle stub in a clearance fit, as indicated inFIG.14.", "", "Variations on the above are possible.", "", "One variation involves a mechanism of the type shown inFIG.21Bwhich, when manufactured, has an axle tube1terminating in a brake mount1.1, a spindle1.2extending from the brake mount, a spider plate2mounted to the brake mount in surrounding relation to the spindle, a hub3mounted to the spindle and a wheel10mounted to the hub.", "", "This variation involves the structure shown inFIGS.24A through24Eand the structure shown inFIG.23A through23F.", "", "The structure shown inFIGS.24A through24Ewill be understood to be adapted to receive the hub in the manner of the spindle, adapted to be mounted to the brake mount and adapted to capture the spider plate against the brake mount and will be seen to comprise a spindle portion S, an adapter portion A and a flange part F.", "", "The spindle portion has a spindle part, the spindle part being so adapted to receive the hub.", "", "The adapter portion has a hollow H and has the spindle portion protruding therefrom.", "", "The flange part protrudes from the adapter portion and is adapted to be mounted to the brake mount and capture the spider plate thereagainst.", "", "The structure ofFIGS.23A through23F.comprises a bushing B1and a bracket B2integrally formed therewith to define a combination, the bushing being adapted to be received by the adapter portion in tight fitting engagement.", "", "The above apparatus can be used for repairing a damaged spindle in the apparatus ofFIG.21B", "", "This step is generally similar to the method previously described, i.e. requiring removal of the components necessary to expose the damaged spindle and severing the damaged spindle.", "", "However, in this method, prior to replacement of the wheel, hub, etc.:the bushing bracket combination is bolted to the brake mount in surrounding relation to the spindle stub, and beads of weld are placed at the ends of the bushing part, as indicated by the sequence ofFIGS.22B and22C;the bracket portion is severed, with a grinder or the like, from the bushing portion at waisted portion W, to permit installation of the spider plate, as indicated by the sequence ofFIGS.22C to22Dthe apparatus is mounted to the brake mount to capture thereagainst the spider plate, as indicated by the sequence ofFIGS.22D to22E", "", "Notably, although not shown, the adapter part of the apparatus is heated, with a welding torch or the like, prior to installation on the bushing, thereby to ensure tight-fitting engagement once cooled.", "", "Yet another variation involves a mechanism of the type shown inFIG.31Bwhich, when manufactured, has an axle tube1terminating in a brake mount1.1, a spindle1.2extending from the brake mount, a spider plate2mounted to the brake mount in surrounding relation to the spindle, a rotor3mounted to the spindle and a wheel10mounted to the rotor.", "", "This variation involves the structure shown inFIGS.28A through28Eand the structure shown inFIG.27AthroughFIG.27G", "", "The structure shown inFIG.28A through28Ewhich will be understood to be adapted to receive the rotor in the manner of the spindle, adapted to be mounted to the brake mount and adapted to capture the spider plate against the brake mount will be seen to comprise a spindle portion S, an adapter portion A and a flange part F.", "", "The spindle portion has a spindle part, the spindle part being so adapted to receive the rotor.", "", "The adapter portion having a hollow and has the spindle portion protruding therefrom.", "", "The flange part protrudes from the adapter portion and is adapted to be mounted to the brake mount and capture the spider plate thereagainst.", "", "The structure ofFIG.27A through27Gis identical to the structure ofFIGS.23A through23Gand will thus be understood to comprise a bushing and a bracket formed integrally therewith to define a bushing bracket combination, the bushing being adapted to be received by the adapter portion in tight fitting relation.", "", "The above apparatus can be used for repairing a damaged spindle in the apparatus ofFIG.25B", "", "This method again requires: removal of the components necessary to expose the damaged spindle; severing the damaged spindle [FIG.26B]; mounting the bushing bracket combination to the brake mount and welding the bushing [FIG.26C]; severing and removing the bracket portion; heating the adapter part; positioning the adapter part around the bushing; mounting the apparatus to the brake mount; and reinstalling the rotor, wheel, etc.", "", "However, in this embodiment, the spider plate is positioned against the brake mount before the apparatus is mounted, as indicated inFIG.26E", "", "Yet further variations are possible.", "", "Accordingly, the invention should be understood to be limited only by the accompanying claims, purposively construed."], "claims": ["an assembly adapted to receive the hub in the manner of the spindle, adapted to be mounted to the brake mount in the manner of the spider plate and adapted to receive the brake in the manner of the spider plate.", "a spindle portion having a spindle part that is adapted to receive the hub in the manner of the spindle and a flange part from which the spindle part protrudes; and a spider portion having a hollow adapted to receive the flange part, the spider portion and the flange part being adapted to be mounted to the brake mount in the manner of the spider plate and adapted to receive the brake in the manner of the spider plate.", "the method comprising: operatively mounting the apparatus of", "an assembly adapted to receive the hub in the manner of the spindle, adapted to be mounted to the brake mount and adapted to capture the spider plate against the brake mount.", "a spindle portion having a spindle part, the spindle part being so adapted to receive the hub; an adapter portion having a hollow and from which the spindle portion protrudes; and a flange part protruding from the adapter portion, the flange part being so adapted to be mounted to the brake mount and capture the spider plate thereagainst.", "6 . The apparatus of claim 5 , further comprising a bushing and wherein the adapter portion is adapted to receive the bushing in tight-fitting engagement.", "the method comprising: severing the damaged spindle; welding the bushing to the axle tube; and operatively mounting the apparatus of", "8 . The method of claim 7 , wherein the adapter part is heated to receive the bushing.", "9 . The method of claim 7 , wherein the bushing is provided in the form of a bushing bracket combination, the bushing bracket combination is bolted to the brake mount to secure the bushing for welding and a bracket portion of the bushing bracket is severed and removed after the bushing part has been welded in place.", "a structure adapted to receive the rotor in the manner of the spindle, adapted to be mounted to the brake mount and adapted to capture the spider plate against the brake mount.", "a spindle portion having a spindle part, the spindle part being so adapted to receive the rotor; an adapter portion having a hollow and from which the spindle portion protrudes; and a flange part protruding from the adapter portion, the flange part being so adapted to be mounted to the brake mount and capture the spider plate thereagainst.", "12 . The apparatus of claim 11 , further comprising a bushing and wherein the adapter portion is adapted to receive the bushing in tight-fitting engagement.", "the method comprising: severing the damaged spindle; welding the bushing to the axle tube; operatively mounting the apparatus of", "14 . The method of claim 13 , wherein the adapter part is heated to receive the bushing.", "15 . The method of claim 13 , wherein the bushing is provided in the form of a bushing bracket combination, the bracket is bolted to the brake mount to position the bushing for welding and is severed and removed after the bushing part has been welded in place."], "bibtex": "@patent{20240075768,\n    title = {SPINDLE REPAIR APPARATUS AND METHOD},\n    number = {20240075768},\n    year = {2024},\n    note = {File: US20240075768A1-20240307.XML}\n    }", "classification": "B60B2700FI"}, {"title": "WHEEL MECHANISM", "doc_number": "20240075769", "filename": "US20240075769A1-20240307.XML", "abstract": "A wheel mechanism includes a fixing base, a wheel base, a wheel, a fixing tube and a gasket. The gasket is disposed around the fixing tube to prevent the wheel with the wheel base from moving up and down. The upper gasket may be disposed between the fixing base and the wheel base to prevent the fixing base and the wheel base from colliding with each other to generate noise. The lower gasket may be disposed between the wheel base and the fixing tube to prevent the wheel base and the fixing tube from colliding with each other to generate noise. Further, when the wheel base is pivotally connected to the fixing base by the rotating shaft, the invention may selectively dispose at least one resilient member between at least two of the fixing base, the wheel base and the rotating shaft to prevent the wheel from shimmying.", "detailed_description": ["Referring toFIGS.1to3,FIG.1is a perspective view illustrating a wheel mechanism1according to an embodiment of the invention,FIG.2is an exploded view illustrating the wheel mechanism1shown inFIG.1, andFIG.3is a sectional view illustrating the wheel mechanism1shown inFIG.1.", "", "As shown inFIGS.1to3, the wheel mechanism1of the invention includes a fixing base10, a wheel base12, a wheel14, a fixing tube16and an upper gasket18. The wheel14is pivotally connected to the wheel base12, such that the wheel14can rotate. In this embodiment, there are two wheels14pivotally connected to opposite sides of the wheel base12. The fixing tube16pivotally connects the wheel base12to the fixing base10. In this embodiment, the fixing base10has a fixing hole100and the wheel base12has a through hole120. An end of the fixing tube16passes through the through hole120of the wheel base12and is fixed in the fixing hole100of the fixing base10, such that the fixing tube16pivotally connects the wheel base12to the fixing base10. Accordingly, the wheel base12with the wheel14can rotate around the fixing base10.", "", "As shown inFIG.3, in this embodiment, the upper gasket18may be sleeved on the fixing tube16, wherein the upper gasket18may be sleeved on any position between opposite ends of the fixing tube16, e.g. a middle segment of the fixing tube16or a position ⅓ away from either end of the fixing tube16. Thus, after the wheel mechanism1is assembled, the upper gasket18is disposed between the fixing base10and the wheel base12. The upper gasket18abuts against an inner surface102of the fixing base10and a top surface122of the wheel base12to prevent the wheel14with the wheel base12from moving up and down, so as to prevent the wheel14from shimmying. Furthermore, since the upper gasket18is disposed between the fixing base10and the wheel base12, it can further prevent the inner surface102of the fixing base10and the top surface122of the wheel base12from colliding with each other to generate noise. In this embodiment, the upper gasket18may be made of ethylene-vinyl acetate copolymer (EVA), rubber or other resilient materials according to practical applications.", "", "Referring toFIG.4,FIG.4is a sectional view illustrating a wheel mechanism1′ according to another embodiment of the invention. The main difference between the wheel mechanism1′ and the aforesaid wheel mechanism1is that the wheel mechanism1′ further includes a lower gasket20disposed between the wheel base12and the fixing tube16, as shown inFIG.4. In this embodiment, the lower gasket20is disposed on a lower edge160of the fixing tube16. Thus, after the wheel mechanism1′ is assembled, the lower gasket20abuts against a bottom surface124of the wheel base12and the lower edge160of the fixing tube16to prevent the wheel14with the wheel base12from moving up and down, so as to prevent the wheel14from shimmying. Furthermore, since the lower gasket20is disposed between the wheel base12and the fixing tube16, it can further prevent the bottom surface124of the wheel base12and the lower edge160of the fixing tube16from colliding with each other to generate noise. In this embodiment, the lower gasket20may be made of ethylene-vinyl acetate copolymer (EVA), rubber or other resilient materials according to practical applications.", "", "Referring toFIG.5,FIG.5is a sectional view illustrating a wheel mechanism1″ according to another embodiment of the invention. The main difference between the wheel mechanism1″ and the aforesaid wheel mechanism1′ is that the wheel mechanism1″ only includes the lower gasket20without the upper gasket18. In other words, the invention may only dispose the lower gasket20between the wheel base12and the fixing tube16without disposing the upper gasket18.", "", "Referring toFIGS.6to9,FIG.6is a perspective view illustrating a wheel mechanism3according to another embodiment of the invention,FIG.7is an exploded view illustrating the wheel mechanism3shown inFIG.6,FIG.8is a perspective view illustrating a rotating shaft320shown inFIG.7, andFIG.9is a partial sectional view illustrating the wheel mechanism3shown inFIG.6.", "", "As shown inFIGS.6to9, the wheel mechanism3of the invention includes a fixing base30, a wheel base32, a wheel34, a fixing tube36and a lower gasket40. The wheel34is pivotally connected to the wheel base32, such that the wheel34can rotate. The fixing tube36pivotally connects the wheel base32to the fixing base30. In this embodiment, the fixing tube36is fixed in the fixing base30. Furthermore, the fixing tube36has a through hole360and the wheel base32has a rotating shaft320. The rotating shaft320is rotatably disposed in the through hole360, such that the fixing tube36pivotally connects the wheel base32to the fixing base30. As shown inFIG.9, a restraining pin42may be inserted into the fixing base30and the fixing tube36from a side of the fixing base30and abuts against a restraining recess322of the rotating shaft320, such that the rotating shaft320is rotatably restrained in the through hole360of the fixing tube36. Accordingly, the wheel base32with the wheel34can rotate around the fixing base30.", "", "As shown inFIG.9, the lower gasket40is disposed between the wheel base32and the fixing tube36. As shown inFIGS.7and9, the wheel base32may have a directional plate324fixed on the rotating shaft320. As shown inFIG.8, the rotating shaft320may have a step326. The step326is used to be welded and positioned with the directional plate324, so as to determine the length of the rotating shaft320exposed out of the directional plate324. The lower gasket40may be disposed on the directional plate324. Thus, after the wheel mechanism3is assembled, the lower gasket40abuts against the directional plate324of the wheel base32and a lower edge361of the fixing tube36to prevent the wheel34with the wheel base32from moving up and down, so as to prevent the wheel34from shimmying. Furthermore, since the lower gasket40is disposed between the wheel base32and the fixing tube36, it can further prevent the directional plate324of the wheel base32and the fixing tube36from colliding with each other to generate noise. In this embodiment, the lower gasket40may be made of ethylene-vinyl acetate copolymer (EVA), rubber or other resilient materials according to practical applications. Preferably, a top of the rotating shaft320may abut against the fixing tube36to prevent the lower gasket40from being crushed. Furthermore, the lower gasket40may be interference fit with the rotating shaft320to prevent dust from entering. Still further, the lower gasket40may also be interference fit with the lower edge361of the fixing tube36. Moreover, lubricant may be added to the periphery of the lower gasket40, such that noise will not be generated while the lower gasket40and the fixing tube36are impacted.", "", "Referring toFIGS.10and11,FIG.10is a perspective view illustrating a wheel mechanism5according to another embodiment of the invention andFIG.11is a perspective view illustrating a wheel base52shown inFIG.10.", "", "As shown inFIGS.10and11, the wheel mechanism5includes a fixing base50, a wheel base52, a wheel54, a rotating shaft56and at least one resilient member58. The wheel54is pivotally connected to the wheel base52, such that the wheel54can rotate. The rotating shaft56is disposed on the wheel base52, such that the wheel base52may be pivotally connected to the fixing base50by the rotating shaft56. Accordingly, the wheel base52with the wheel54can rotate around the fixing base50. In this embodiment, the wheel mechanism5may include four resilient members58. The four resilient members58may be disposed on the wheel base52and around the rotating shaft56. It should be noted that the number and position of the resilient members58may be determined according to practical applications, so the invention is not limited to the embodiment shown in the figure. In this embodiment, the resilient member58is circular, but the invention is not so limited. In another embodiment, the resilient member58may also be rectangular, oval-shaped or other shapes according to practical applications. After the wheel mechanism5is assembled, the resilient members58are disposed between the fixing base50and the wheel base52to prevent the wheel54with the wheel base52from moving up and down, so as to prevent the wheel54from shimmying. Furthermore, since the resilient members58are disposed between the fixing base50and the wheel base52, it can further prevent the wheel base52and the fixing base50from colliding with each other to generate noise. In this embodiment, the resilient member58may be made of ethylene-vinyl acetate copolymer (EVA), rubber or other resilient materials according to practical applications.", "", "Referring toFIGS.12to14,FIG.12is a sectional view illustrating a wheel mechanism5′ according to another embodiment of the invention,FIG.13is a perspective view illustrating a fixing base50shown inFIG.12, andFIG.14is a perspective view illustrating a resilient member58shown inFIG.13. The main difference between the wheel mechanism5′ and the aforesaid wheel mechanism5is that the rotating shaft56of the wheel mechanism5′ is disposed on the fixing base50and the resilient member58of the wheel mechanism5′ is ring-shaped, as shown inFIGS.12to14. In this embodiment, the resilient member58may be sleeved on the rotating shaft56and abuts against the fixing base50. The resilient member58may be interference fit with the rotating shaft56to prevent the resilient member58from coming off the rotating shaft56as the wheel base52is detached from the fixing base50. The shape of the resilient member58may be oval-shaped, circular, rectangular or other shapes according to practical applications. In another embodiment, the resilient member58shown inFIG.13may also be replaced by the four resilient members58shown inFIG.11according to practical applications. As shown inFIG.12, after the wheel mechanism5′ is assembled, the resilient member is disposed between the fixing base50and the wheel base52to prevent the wheel54with the wheel base52from moving up and down, so as to prevent the wheel54from shimmying. Furthermore, since the resilient member58is disposed between the fixing base50and the wheel base52, it can further prevent the wheel base52and the fixing base50from colliding with each other to generate noise. The resilient member58may be interference fit with a contact surface of the wheel base52to ensure that the resilient member58is in tight contact with the wheel base52.", "", "As shown inFIG.14, the resilient member58may have at least one protruding portion580. In this embodiment, the resilient member58may have two protruding portions580. It should be noted that the number and position of the protruding portions580may be determined according to practical applications, so the invention is not limited to the embodiment shown in the figure. After the wheel mechanism5′ is assembled, the protruding portions580abut against the wheel base52. In other words, the resilient member58may be in contact with the wheel base52partially by the protruding portions580. In another embodiment, the resilient member58may not have the protruding portions580. At this time, the resilient member58is in surface contact with the wheel base52. In another embodiment, the resilient member58may also be in contact with the fixing base50partially by the protruding portions580.", "", "Referring toFIG.15,FIG.15is a sectional view illustrating a wheel mechanism5″ according to another embodiment of the invention. As shown inFIG.15, the fixing base50has a through hole500and the rotating shaft56is disposed on the wheel base52. The main difference between the wheel mechanism5″ and the aforesaid wheel mechanism5is that the resilient member58of the wheel mechanism5″ is disposed in the through hole500of the fixing base50. Then, the rotating shaft56is rotatably disposed in the through hole500of the fixing base50, such that the resilient member58is disposed between the fixing base50and the rotating shaft56to prevent the wheel54with the wheel base52from moving up and down, so as to prevent the wheel54from shimmying. Furthermore, since the resilient member58is disposed between the fixing base50and the rotating shaft56, it can further prevent the rotating shaft56and the fixing base50from colliding with each other to generate noise. The resilient member58may be interference fit with a contact surface of the rotating shaft56to ensure that the resilient member58is in tight contact with the rotating shaft56. In another embodiment, the resilient member58may also be embedded in an end of the rotating shaft56.", "", "Referring toFIG.16,FIG.16is a sectional view illustrating a wheel mechanism5′″ according to another embodiment of the invention. As shown inFIG.16, the wheel base52has a through hole520and the rotating shaft56is disposed on the fixing base50. The main difference between the wheel mechanism5′″ and the aforesaid wheel mechanism5is that the resilient member58of the wheel mechanism5′″ is disposed in the through hole520of the wheel base52. Then, the rotating shaft56is rotatably disposed in the through hole520of the wheel base52, such that the resilient member58is disposed between the wheel base52and the rotating shaft56to prevent the wheel54with the wheel base52from moving up and down, so as to prevent the wheel54from shimmying. Furthermore, since the resilient member58is disposed between the wheel base52and the rotating shaft56, it can further prevent the rotating shaft56and the wheel base52from colliding with each other to generate noise. The resilient member58may be interference fit with a contact surface of the rotating shaft56to ensure that the resilient member58is in tight contact with the rotating shaft56. In another embodiment, the resilient member58may also be embedded in an end of the rotating shaft56.", "", "As mentioned in the above, the invention disposes the gasket around the fixing tube to prevent the wheel with the wheel base from moving up and down, so as to prevent the wheel from shimmying. In an embodiment, the upper gasket may be disposed between the fixing base and the wheel base to prevent the fixing base and the wheel base from colliding with each other to generate noise. In another embodiment, the lower gasket may be disposed between the wheel base and the fixing tube to prevent the wheel base and the fixing tube from colliding with each other to generate noise. Needless to say, the invention may also dispose the upper gasket and the lower gasket around the fixing tube at the same time to improve the effect of preventing the wheel from shimmying. Furthermore, in another embodiment, when the wheel base is pivotally connected to the fixing base by the rotating shaft, the invention may selectively dispose at least one resilient member between at least two of the fixing base, the wheel base and the rotating shaft to prevent the wheel from shimmying.", "", "The foregoing are only preferred embodiments of the invention while the protection scope thereof is not limited to the above description. Any change or substitution within the technical scope disclosed by the invention should be covered by the protection scope of the invention."], "claims": ["a fixing base; a wheel base; a wheel pivotally connected to the wheel base; a fixing tube pivotally connecting the wheel base to the fixing base; and an upper gasket disposed between the fixing base and the wheel base.", "2 . The wheel mechanism of claim 1 , wherein the upper gasket is sleeved on the fixing tube.", "3 . The wheel mechanism of claim 1 , wherein the wheel mechanism further comprises a lower gasket disposed between the wheel base and the fixing tube.", "4 . The wheel mechanism of claim 3 , wherein the lower gasket is disposed on a lower edge of the fixing tube.", "5 . The wheel mechanism of claim 1 , wherein the fixing base has a fixing hole, the wheel base has a through hole, and an end of the fixing tube passes through the through hole and is fixed in the fixing hole, such that the fixing tube pivotally connects the wheel base to the fixing base.", "a fixing base; a wheel base; a wheel pivotally connected to the wheel base; a fixing tube pivotally connecting the wheel base to the fixing base; and a lower gasket disposed between the wheel base and the fixing tube.", "7 . The wheel mechanism of claim 6 , wherein the lower gasket is disposed on a lower edge of the fixing tube.", "8 . The wheel mechanism of claim 6 , wherein the wheel mechanism further comprises an upper gasket disposed between the fixing base and the wheel base.", "9 . The wheel mechanism of claim 8 , wherein the upper gasket is sleeved on the fixing tube.", "10 . The wheel mechanism of claim 6 , wherein the fixing base has a fixing hole the wheel base has a through hole, and an end of the fixing tube passes through the through hole and is fixed in the fixing hole, such that the fixing tube pivotally connects the wheel base to the fixing base.", "11 . The wheel mechanism of claim 6 , wherein the fixing tube is fixed in the fixing base, the fixing tube has a through hole, the wheel base has a rotating shaft, and the rotating shaft is rotatably disposed in the through hole, such that the fixing tube pivotally connects the wheel base to the fixing base.", "12 . The wheel mechanism of claim 11 , wherein a top of the rotating shaft abuts against the fixing tube.", "13 . The wheel mechanism of claim 11 , wherein the wheel base has a directional plate fixed on the rotating shaft and the lower gasket is disposed on the directional plate.", "a fixing base; a wheel base; a wheel pivotally connected to the wheel base; a rotating shaft disposed on one of the fixing base and the wheel base, the wheel base being pivotally connected to the fixing base by the rotating shaft; and at least one resilient member disposed between at least two of the fixing base, the wheel base and the rotating shaft.", "15 . The wheel mechanism of claim 14 , wherein the at least one resilient member is disposed between the fixing base and the wheel base and around the rotating shaft.", "16 . The wheel mechanism of claim 14 , wherein the at least one resilient member is ring-shaped and sleeved on the rotating shaft.", "17 . The wheel mechanism of claim 16 , wherein the at least one resilient member has at least one protruding portion and the at least one protruding portion abuts against one of the fixing base and the wheel base.", "18 . The wheel mechanism of claim 14 , wherein the fixing base has a through hole, the at least one resilient member is disposed in the through hole, the rotating shaft is disposed on the wheel base, and the rotating shaft is rotatably disposed in the through hole, such that the at least one resilient member is disposed between the fixing base and the rotating shaft.", "19 . The wheel mechanism of claim 14 , wherein the wheel base has a through hole, the at least one resilient member is disposed in the through hole, the rotating shaft is disposed on the fixing base, and the rotating shaft is rotatably disposed in the through hole, such that the at least one resilient member is disposed between the wheel base and the rotating shaft."], "bibtex": "@patent{20240075769,\n    title = {WHEEL MECHANISM},\n    number = {20240075769},\n    year = {2024},\n    note = {File: US20240075769A1-20240307.XML}\n    }", "classification": "B60B3300FI"}, {"title": "SYSTEMS FOR MODULAR AXLE HOUSING", "doc_number": "20240075770", "filename": "US20240075770A1-20240307.XML", "abstract": "Systems are provided for an axle housing for a vehicle. In one example, system includes a differential housing comprising a modular Salisbury style center section comprising tube mounts configured to receive tube assemblies via a press fit.", "detailed_description": ["The following description relates to a system for an axle assembly in a vehicle. For example, the vehicle may be propelled by a powertrain, such as illustrated inFIG.1. The powertrain may include at least one axle assembly, such as depicted inFIG.2. The axle assembly may include a modular central housing, various views of which are illustrated inFIGS.3A-3C. For example, the modular central housing may be adapted for varying tube wall thicknesses while reducing lubrication demands due to internal sealing.FIGS.2-3Care shown approximately to scale. However, alternative dimensions may be used if desired.", "", "Turning now toFIG.1, a vehicle100is shown comprising a powertrain101and a drivetrain103. The powertrain comprises a prime mover106and a transmission108. The prime mover106may be an internal combustion engine or an electric motor, for example, and is operated to provide rotary power to the transmission108. The transmission108may be any type of transmission, such as a manual transmission, an automatic transmission, or a continuously variable transmission. The transmission108receives the rotary power produced by the prime mover106as an input and outputs rotary power to the drivetrain103in accordance with a selected gear or setting.", "", "In some examples, such as shown inFIG.1, the drivetrain103includes a first axle assembly102and a second axle assembly112. The first axle assembly102may be configured to drive a first set of wheels104, and the second axle assembly112may be configured to drive a second set of wheels114. In one example, the first axle assembly102is arranged near a front of the vehicle100and thereby comprises a front axle, and the second axle assembly112is arranged near a rear of the vehicle100and thereby comprises a rear axle. The drivetrain103is shown in a four-wheel drive configuration, although other configurations are possible. For example, the drivetrain103may include a front-wheel drive, a rear-wheel drive, or an all-wheel drive configuration. Further, the drivetrain103may include one or more tandem axle assemblies. As such, the drivetrain103may have other configurations without departing from the scope of this disclosure, and the configuration shown inFIG.1is provided for illustration, not limitation. Further, the vehicle100may include additional wheels that are not coupled to the drivetrain103.", "", "In some four-wheel drive configurations, such as shown inFIG.1, the drivetrain103includes a transfer case110configured to receive rotary power output by the transmission108. A first driveshaft113is drivingly coupled to a first output111of the transfer case110, while a second driveshaft122is drivingly coupled to a second output121of the transfer case110. The first driveshaft113(e.g., a front driveshaft) transmits rotary power from the transfer case110to a first differential116of the first axle assembly102to drive the first set of wheels104, while the second driveshaft122(e.g., a rear driveshaft) transmits the rotary power from the transfer case110to a second differential126of the second axle assembly112to drive the second set of wheels114. For example, the first differential116is drivingly coupled to a first set of axle shafts118coupled to the first set of wheels104, and the second differential126is drivingly coupled to a second set of axle shafts128coupled to the second set of wheels114. It may be appreciated that each of the first set of axle shafts118and the second set of axle shafts128may be positioned in a housing. An embodiment of an axle assembly will be described in more detail below with respect toFIGS.2-3C", "", "In some examples, additionally or alternatively, the vehicle100may be a hybrid vehicle including both an engine an electric machine each configured to supply power to one or more of the first axle assembly102and the second axle assembly112. For example, one or both of the first axle assembly102and the second axle assembly112may be driven via power originating from the engine in a first operating mode where the electric machine is not operated to provide power (e.g., an engine-only mode), via power originating from the electric machine in a second operating mode where the engine is not operated to provide power (e.g., an electric-only mode), and via power originating from both the engine and the electric machine in a third operating mode (e.g., an electric assist mode). As another example, one or both of the first axle assembly102and the second axle assembly112may be an electric axle assembly configured to be driven by an integrated electric machine.", "", "As mentioned above, axle assemblies (e.g., the first axle assembly102and the second axle assembly112ofFIG.1) are configured to transfer power originating from a prime mover of a vehicle to wheels of the vehicle. However, it may be difficult to adapt existing axle assemblies to different vehicle load capacities and vehicle weights while increasing assembly efficiency. For example, Salisbury-style axle assemblies may have increased efficiency and reduced lubrication demands due having an internally sealed central housing, while banjo-style axle assemblies may be adapted to support higher vehicle weights than a Salisbury-style axle assembly of similar size due to having a separate structure for supporting beaming loads. However, the banjo-style axle assembly may have increased lubrication demands compared with the Salisbury-style axle assembly.", "", "Thus, with reference toFIGS.2-3C, components of a modular axle assembly that may be adapted for different vehicle loads while decreasing lubrication demands are shown.FIGS.2-3Cshow example configurations with relative positioning of the various components. If shown directly contacting each other, or directly coupled, then such elements may be referred to as directly contacting or directly coupled, respectively, at least in one example. Similarly, elements shown contiguous or adjacent to one another may be contiguous or adjacent to each other, respectively, at least in one example. As an example, components laying in face-sharing contact with each other may be referred to as in face-sharing contact. As another example, elements positioned apart from each other with only a space there-between and no other components may be referred to as such, in at least one example. As yet another example, elements shown above/below one another, at opposite sides to one another, or to the left/right of one another may be referred to as such, relative to one another. Further, as shown in the figures, a topmost element or point of element may be referred to as a “top” of the component and a bottommost element or point of the element may be referred to as a “bottom” of the component, in at least one example. As used herein, top/bottom, upper/lower, above/below, may be relative to a vertical axis of the figures and used to describe positioning of elements of the figures relative to one another. As such, elements shown above other elements are positioned vertically above the other elements, in one example. As yet another example, shapes of the elements depicted within the figures may be referred to as having those shapes (e.g., such as being circular, straight, planar, curved, rounded, chamfered, angled, or the like). Further, elements shown intersecting one another may be referred to as intersecting elements or intersecting one another, in at least one example. Further still, an element shown within another element or shown outside of another element may be referred as such, in one example. It will be appreciated that one or more components referred to as being “substantially similar and/or identical” differ from one another according to manufacturing.", "", "Further, reference axes299are provided throughoutFIGS.2-3Cin order to compare the relative orientations of the various views. The reference axes299include an x-axis parallel to a horizontal axis, a y-axis parallel to a vertical axis, and a z-axis parallel to a transverse axis and normal to each of the x- and y-axes. A direction of gravity is illustrated via an arrow292. Where applicable, smaller line width contour lines are provided to generally indicate depth and three-dimensional forms. ThroughoutFIGS.2-3C, like components are numbered the same and will not be re-introduced.", "", "Referring first toFIG.2, a front perspective view200of a drive axle210is shown. The drive axle210includes a central axis294, which is parallel to the x-axis of the reference axes299. The drive axle210may be a non-limiting example of the first axle assembly102or the second axle assembly112ofFIG.1. In an embodiment, the drive axle210is a rear axle, and thus, the drive axle210may be the second axle assembly112ofFIG.1. The central axis294may be an axis of rotation for a first axle shaft212and a second axle shaft214of the drive axle210. The first axle shaft212and the second axle shaft214may be configured to mount to and rotate vehicle wheels, such as the second wheel set114ofFIG.1. For example, the first axle shaft212and the second axle shaft214are arranged at opposite ends of the drive axle210and each comprise a terminal hub that may be used to mount the vehicle wheels. The first axle shaft212includes a first hub220, and the second axle shaft214includes a second hub222.", "", "The drive axle210further comprises a central housing230that houses a differential240. Herein, the central housing230may be interchangeably referred to as a carrier230. The central housing230comprises a body portion232having a first tube mount234on a first end of the body portion232and a second tube mount236on a second end of the body portion232that is opposite the first end relative to the central axis294. As one example, the body portion232may be a singular piece die cast of metal, including one or more of aluminum, steel, cast iron, or the like. In some examples, the first tube mount234may be larger (or smaller) than the second tube mount236. For example, the first tube mount234may have a larger (or smaller) diameter and/or a longer (or shorter) length along the central axis294compared with the second tube mount236. In other examples, the first tube mount234and the second tube mount236may be equal in size. In one example, a wall thickness of the first tube mount234and the second tube mount236may be adjusted based on a vehicle load. The carrier230shape may be maintained even when the wall thicknesses of the tube mounts are adjusted. By doing this, research and manufacturing costs for a vehicle manufacturer are reduced across a vehicle fleet comprising vehicles with different vehicle loads.", "", "The differential240may receive input from a driveshaft (e.g., the second driveshaft122ofFIG.1) via a pinion242, which may rotate along an axis296that is perpendicular to the central axis294and parallel to the z-axis of reference axes299. The pinion242may extend through a cover portion238of the central housing230, which is removably coupled to the body portion232via a plurality of fasteners244. The plurality of fasteners244may include one or more of bolts, screws, lugs, or the like arranged around a circumference of the cover portion238and the body portion232. As one example, the cover portion may be die cast of same or different material as the body portion232of the central housing230. As will be described below with respect toFIGS.3A-3C, the body portion232may be a singular, continuous piece having a cavity for housing the differential240with openings only at the first tube mount234, the second tube mount236, and where the cover portion238is attached.", "", "An assembly direction is shown via arrow295, which is parallel to axis296, wherein gears are arranged externally to the body portion232in the assembly direction. An assembly split line seam of the axle assembly may be arranged between the cover portion238and the body portion232. There may be no other seams or other coupling points with regard to the central housing230. As such, the assembly split line seam may be the only assembly seam arranged between the cover and the center section of the housing.", "", "The first tube mount234of the body portion232is arranged on a side of the differential240biased toward the first axle shaft212, while the second tube mount236of the body portion232is arranged on a side of the differential240biased toward the second axle shaft214. An axle track of the drive axle210that houses the first axle shaft212and the second axle shaft214may be defined via a first axle tube202and a second axle tube204, which are concentric about the central axis294. The first axle tube202may be pressed into the first tube mount234of the body portion232. The second axle tube204may be pressed into the second tube mount236of the body portion232. That is, at least a portion of the first axle tube202may be positioned inside of the first tube mount234of the first body portion232so that an exterior surface of the first tube mount234is in face-sharing contact with an interior surface of the first tube mount234of the body portion232, as will be elaborated below with respect toFIGS.3A and3B. Similarly, at least a portion of the second axle tube204may be pressed inside the second tube mount236so that an exterior surface of the second axle tube204may be in face-sharing contact with interior surfaces of the second tube mount236of the body portion232. The first axle tube202and the second axle tube204may be fixedly coupled to the corresponding tube mount of the body portion232, such as puddle welded in place.", "", "The first axle tube202and the second axle tube204may comprise a cylindrical shape, such as shown inFIG.2, including a central cavity configured to house the corresponding axle shaft. However, other shapes are possible, such as square boxed tube. In some examples, the first axle tube202and the second axle tube204may have substantially identical dimensions. In other examples, the length and/or diameter of the first axle tube202and the second axle tube204may be different from each other. For example, the first axle tube202may have a longer (or shorter) length than the second axle tube204. Additionally or alternatively, the first axle tube202may have a greater (or smaller) diameter than the second axle tube204.", "", "Further, each of the first axle tube202and the second axle tube204includes a wall thickness between an inner surface defining the central cavity and the outer surface. The wall thickness of the first axle tube202and the second axle tube204may vary based on vehicle load demands. The body portion232of the central housing230may be adapted to accommodate axle tubes having varying wall thicknesses. For example, the same body portion232may be used for axle tubes having smaller wall thicknesses and larger wall thicknesses due to the pressed in and welded joint between each axle tube and the corresponding tube mount of the body portion232, such as described above. As a result, the body portion232may provide a modular housing that may be adapted for a plurality of different drive axles, each configured for a different vehicle load demand. By including larger tube wall thicknesses for vehicles having higher vehicle load demands, axle durability may be increased for increased vehicle durability. By including smaller tube wall thicknesses for vehicles having smaller vehicle load demands, vehicle weight may be decreased for increased vehicle efficiency. In some examples, a shim or other material may be used in combination with axle tubes comprising smaller diameters such that the central housing230configuration may be maintained across different vehicle types.", "", "Continuing withFIG.2, the first axle shaft212may be positioned to rotate within the first axle tube202. The second axle shaft214may be positioned to rotate within the second axle tube204. The first axle shaft212may extend though the first tube mount234to the differential240, where the first axle shaft212may be engaged with a gear set (e.g., a planetary gear set) of the differential240. Similarly, the second axle shaft214may extend into the second tube mount236of the body portion232, wherein the second axle shaft214may engage with the second planetary gear set. In this way, the first axle shaft212may provide a first rotational speed to the first hub220and a wheel mounted thereon and the second axle shaft214may provide a second rotational speed, different or equal to the first rotational speed, to the second axle shaft222and a wheel mounted thereon. In one example, the speeds may be differentiated via adjusting a gearing of the differential or of the planetary gear sets, which may provide torque vectoring or other all-wheel drive capabilities.", "", "The first axle shaft212may further extend through a first spindle216that is coupled to the first axle tube202, and the second axle shaft214may extend through a second spindle218that is coupled to the second axle tube204. Together, the axle tubes202and204and the spindles216and218may provide an axle housing. The first spindle216may be removably coupled to the first axle tube202, and the second spindle218may be removably coupled to the second axle tube204. The spindles216and218may rotatably support the wheels of the vehicle on the axle housing while allowing the axle shafts to extend therethrough to rotatably drive the wheels. Although not shown inFIG.2, brake system components may be positioned around and mounted to the first spindle and the second spindle218. Further, vehicle mounts may be positioned around the axle tubes202and204and/or the spindles216and218, such as removably coupled to a first bracket206of the first axle tube202and a second bracket208of the second axle tube204. The vehicle mounts may be used to physically couple the drive axle210to an underside of the vehicle, for example.", "", "It may be understood that various bearings, gaskets, sealing rings (e.g., o-rings and snap rings), joints, washers, nuts, shims, and other components may be included in the drive axle210in order to facilitate the rotation of various components (e.g., the axle shafts212and214, the pinion242, and other differential components) as well as provide sealing for lubrication.", "", "Referring now toFIGS.3A-3C, a front perspective view (FIG.3A), a partial front perspective view (FIG.3B), and a back perspective view (FIG.3C) of the central housing230are shown.FIGS.3A-3Care described in tandem herein.", "", "The central housing230may include an interior302visible through an opening306. A rim304may circumferentially surround the opening306, wherein the rim304may include a plurality of openings308. The plurality of openings308may include threads or other engaging features configured to receive the plurality of fasteners (e.g., the plurality of fasteners244ofFIG.2). The cover portion (e.g., cover portion238) may seal the interior302of the central housing230.", "", "A first tube side310may include a first tube passage312interior to the first tube mount234. The first axle tube (e.g., first axle tube202) may extend through the first tube passage312toward the interior302. In one example, the first tube passage312may include one or more features, such as a dam, ribs, or other feature configured to alter a flow of lubricant. The first axle tube may be blocked from extending into the interior302via the first stop (e.g., first stop235ofFIG.2).", "", "A second tube side314may include a second tube passage316interior to the second tube mount236. The second axle tube (e.g., the second axle tube204) may extend through the second tube passage316toward the interior302. In one example, the second tube passage316may include one or more features, such as a dam, ribs, or other feature configured to alter a flow of lubricant. The second axle tube may be blocked from extending into the interior302via the second stop (e.g., second stop237ofFIG.2).", "", "In this way, each of the first axle tube and the second axle tube may be press fit into the first tube mount234and the second tube mount236respectively. The first and second axle tubes may be fixed in place via one or more of a fastener, an adhesive, a weld, a fusion, or the like. In one example, the first axle tube and the second axle tube are puddle welded in place.", "", "The first tube mount234may further include a plurality of first openings334and the second tube mount236may include a plurality of second openings336. The plurality of first openings334and the plurality of second openings336may be configured to admit lubricant to and/or expel lubricant from the first axle tube and the second axle tube, respectively. The plurality of first openings334and the plurality of second openings336may be arranged on a front face of the first tube mount234and the second tube mount236.", "", "The first tube mount234may further include a first opening335. The second tube mount236may further include a second opening337. The first opening335and the second opening337may be arranged on a back face of the first tube mount234and the second tube mount236. The first opening335may be opposite the plurality of first openings334. The second opening337may be opposite the plurality of second openings336.", "", "The plurality of first openings334may include three openings arranged in a triangular shape, wherein the first opening335is aligned with only one of the plurality of first openings334along the z-axis. The plurality of second openings336may include three openings arranged in a triangular shape, wherein the second opening337is aligned with only one of the plurality of second openings336along the z-axis.", "", "The housing230may include a plurality of ribs and lube channels arranged therein. The ribs and lube channels may reduce churn losses and increase overall efficiency by decreasing friction experienced therein. The housing230may include a first upper rib342and a first lower rib344coupled to the first tube mount234. The housing230may further include a second upper rib346and a second lower rib348. The ribs may be oriented in a direction parallel to the x-axis. In one example, the ribs may support a vertical axle load. A size of the ribs may be adjusted based on the vertical axle load, wherein the ribs are larger when the vertical axle load of the vehicle is higher relative to other vehicles.", "", "The first upper rib342and the first lower rib344may include a triangular shape and extend from the first tube mount234to a carrier (e.g., the central housing230). The second upper rib346and the second lower rib348may include a triangular shape and extend from the second tube mount236to the carrier. In one example, a size and a shape of the ribs are identical to one another.", "", "A plurality of main lube channels350may be arranged in the carrier, which is mounted into the modular housing. The plurality of main lube channels350may be case into a cover side of the housing aligned with a ring gear. The cast banjo style carrier may be configured to optimize oil volume and reduce churn losses.", "", "In one example, the axle assembly include a Salisbury type arrangement along with the Banjo style carrier where the housing is formed and gears are mounted externally to a center section of the housing. The Banjo style housing may include press up tubes, thereby allowing the housing to be coupled to existing carrier assemblies that mount to traditional stamped Banjo housings. The cast housing canter may support a plurality of different tube and carrier assembly configurations, such as tube assemblies with Salisbury axle assemblies.", "", "The disclosure provides support for a system including a differential housing comprising a modular Salisbury style center section comprising tube mounts configured to receive tube assemblies via a press fit. A first example of the system further includes where the differential housing is a banjo style housing where the center section comprises a round shape and the tube mounts comprise an elongated shape. A second example of the system, optionally including the first example, further includes a plurality of ribs comprising a triangular shape, wherein each of the plurality of ribs is physically coupled to the center section and one of the tube mounts. A third example of the system, optionally including one or more of the previous examples, further includes where each of the tube assemblies is puddle welded to one of the tube mounts. A fourth example of the system, optionally including one or more of the previous examples, further includes where the differential housing is arranged in a variety of vehicles with different vehicles loads, wherein the center section is identical in each of the variety of vehicles. A fifth example of the system, optionally including one or more of the previous examples, further includes where a size of one or more of the tube mounts and the tube assemblies are adjusted in each of the variety of vehicles. A sixth example of the system, optionally including one or more of the previous examples, further includes where an assembly direction is normal to a central axis of a drive axle.", "", "The disclosure provides additional support for an axle assembly including a modular differential housing comprising a first tube mount and a second tube mount, wherein a center section of the housing comprises a round shape and the first tube mount and the second tube mount comprise elongate shapes. A first example of the axle assembly further includes where the housing comprises a single assembly split line seam. A second example of the axle assembly, optionally including the first example, further includes where gears are mounted externally to the center section. A third example of the axle assembly, optionally including one or more of the previous examples, further includes where the housing comprises a central opening surrounded by a plurality of openings, and wherein a cover is physically coupled to the central opening via a plurality of fasteners engaging with the plurality of openings. A fourth example of the axle assembly, optionally including one or more of the previous examples, further includes where axle arms are press fit into each of the first tube mount and the second tube mount. A fifth example of the axle assembly, optionally including one or more of the previous examples, further includes where the axle arms are puddle welded to the first tube mount and the second tube mount. A sixth example of the axle assembly, optionally including one or more of the previous examples, further includes where the first tube mount and the second tube mount receive square boxed tube axle arms. A seventh example of the axle assembly, optionally including one or more of the previous examples, further includes where the axle assembly is coupled to a rear drive unit or a front drive unit of a vehicle.", "", "The disclosure provides further support for an axle assembly for an electric vehicle including a modular differential housing comprising a first tube mount and a second tube mount flanking a center section, wherein the center section comprises a round shape and the first tube mount and the second tube mount comprise elongate shapes and ribs physically coupled to the center section and one of the first tube mount and the second tube mount. A first example of the axle assembly further includes where gears are mounted externally to the center section, and wherein an assembly direction of the axle assembly is normal to a central axis of one or more axle arms. A second example of the axle assembly, optionally including the first example, further includes where the one or more axle arms are press fit into the first tube mount and the second tube mount. A third example of the axle assembly, optionally including one or more of the previous examples, further includes where a wall thickness of the first tube mount and the second tube mount are adjusted based on a vehicle load. A fourth example of the axle assembly, optionally including one or more of the previous examples, further includes where the axle assembly comprises only one assembly split line seam arranged between an opening of the center section and a housing cover.", "", "As used herein, the term “approximately” is construed to mean plus or minus five percent of the range unless otherwise specified.", "", "The following claims particularly point out certain combinations and sub-combinations regarded as novel and non-obvious. These claims may refer to “an” element or “a first” element or the equivalent thereof. Such claims should be understood to include incorporation of one or more such elements, neither requiring nor excluding two or more such elements. Other combinations and sub-combinations of the disclosed features, functions, elements, and/or properties may be claimed through amendment of the present claims or through presentation of new claims in this or a related application. Such claims, whether broader, narrower, equal, or different in scope to the original claims, also are regarded as included within the subject matter of the present disclosure."], "claims": ["a differential housing comprising a modular Salisbury style center section comprising tube mounts configured to receive tube assemblies via a press fit.", "2 . The system of claim 1 , wherein the differential housing is a banjo style housing where the center section comprises a round shape and the tube mounts comprise an elongated shape.", "3 . The system of claim 1 , further comprising a plurality of ribs comprising a triangular shape, wherein each of the plurality of ribs is physically coupled to the center section and one of the tube mounts.", "4 . The system of claim 1 , wherein each of the tube assemblies is puddle welded to one of the tube mounts.", "5 . The system of claim 1 , wherein the differential housing is arranged in a variety of vehicles with different vehicles loads, wherein the center section is identical in each of the variety of vehicles.", "6 . The system of claim 5 , wherein a size of one or more of the tube mounts and the tube assemblies are adjusted in each of the variety of vehicles.", "7 . The system of claim 1 , wherein an assembly direction is normal to a central axis of a drive axle.", "a modular differential housing comprising a first tube mount and a second tube mount, wherein a center section of the housing comprises a round shape and the first tube mount and the second tube mount comprise elongate shapes.", "9 . The axle assembly of claim 8 , wherein the housing comprises a single assembly split line seam.", "10 . The axle assembly of claim 9 , wherein gears are mounted externally to the center section.", "11 . The axle assembly of claim 8 , wherein the housing comprises a central opening surrounded by a plurality of openings, and wherein a cover is physically coupled to the central opening via a plurality of fasteners engaging with the plurality of openings.", "12 . The axle assembly of claim 8 , wherein axle arms are press fit into each of the first tube mount and the second tube mount.", "13 . The axle assembly of claim 12 , wherein the axle arms are puddle welded to the first tube mount and the second tube mount.", "14 . The axle assembly of claim 8 , wherein the first tube mount and the second tube mount receive square boxed tube axle arms.", "15 . The axle assembly of claim 8 , wherein the axle assembly is coupled to a rear drive unit or a front drive unit of a vehicle.", "a modular differential housing comprising a first tube mount and a second tube mount flanking a center section, wherein the center section comprises a round shape and the first tube mount and the second tube mount comprise elongate shapes; and ribs physically coupled to the center section and one of the first tube mount and the second tube mount.", "17 . The axle assembly of claim 16 , wherein gears are mounted externally to the center section, and wherein an assembly direction of the axle assembly is normal to a central axis of one or more axle arms.", "18 . The axle assembly of claim 17 , wherein the one or more axle arms are press fit into the first tube mount and the second tube mount.", "19 . The axle assembly of claim 16 , wherein a wall thickness of the first tube mount and the second tube mount are adjusted based on a vehicle load.", "20 . The axle assembly of claim 16 , wherein the axle assembly comprises only one assembly split line seam arranged between an opening of the center section and a housing cover."], "bibtex": "@patent{20240075770,\n    title = {SYSTEMS FOR MODULAR AXLE HOUSING},\n    number = {20240075770},\n    year = {2024},\n    note = {File: US20240075770A1-20240307.XML}\n    }", "classification": "B60B3516FI"}, {"title": "CONSTRUCTION OF A MOLDED BODY FOR NON-PNEUMATIC TIRES", "doc_number": "20240075771", "filename": "US20240075771A1-20240307.XML", "abstract": "A molded body is useful in non-pneumatic tires. The non-pneumatic tires containing the molded body are useful for vehicle wheels such as wheels for cars, bikes, motorcycles, trucks, e-scooters, toys, sports equipment, golf caddy, strollers, or wheelchairs. A process for manufacturing the molded body for non-pneumatic tires is also provided.", "detailed_description": ["With regards to the invention, the following can be stated specifically:", "", "According to the present invention, the object is solved by a molded body as insert for non-pneumatic tires comprising the elements of(A) a tube, which comprises a hollow cavity, and(B) at least one peripheral foam layer, which comprises a polymeric foam, wherein the elements A and B are composed.", "", "Surprisingly, it was found that with providing a molded body, which comprises the tube with a hollow cavity and at least one peripheral foam layer, and wherein both elements A and B are composed together to a composite material for the molded body, the rolling resistance is reduced, which leads to less heat generation. The hollow tube structure also leads to less heat generation. This is an improvement regarding long-term stability of the material, because material degradation is reduced. During operation of a non-pneumatic tire, due to the molded body as insert, the rebound and comfort remains while hardness can be adjusted. Furthermore, the combination of tube and peripheral foam layer enables a dedicated adjustment of hardness and rebound of the molded body according to the requirements for a particular application. For example, a combination of a hard tube structure with soft foam beads within the peripheral layer is possible to fulfill both, sufficient hardness in order to reduce the rolling resistance of the non-pneumatic tire and increase of rebound to ensure comfort requirement of the non-pneumatic tire.", "", "A further advantage of the molded body as insert for tires is that the molded body comprises a tight foam layer as element (B). Due to the tight foam layer, which prevents evaporation of air from the hollow cavity (surrounded by the foam layer) to the outside of the molded body, the pressure within the hollow cavity can be adjusted and with that the hardness of the tire.", "", "For the manufacturing of the foam layer preferably comprising foam beads which are fused together, it is referred to the application with the application number PCT/EP2021/075077. This application is hereby incorporated by reference and the described manufacturing in the examples of PCT/EP2021/075077 can be applied in the context of the present invention for the manufacturing of the foam layer, preferably comprising foam beads.", "", "Preferably the foam beads have a size in the range from 1 mm to 6 mm, preferably in the range from 2 mm to 5 mm. It is further preferred that the thickness of the foam layer of element (B) is 1.5-fold the diameter of the foam beads, more preferably 2-fold the diameter of the foam beads. In particular, the thickness of the foam layer is equal or above 1.5 mm, preferably equal or above 2 mm. More preferably, the foam layer has a thickness in the range from 2 to 12 mm and even more preferably a thickness in the range from 3 to 10 mm.", "", "Preferably, element A and element B are glued or fused together.", "", "Preferably, the tube comprises openings. It is preferred that the openings are smaller than the particle beads which can build the peripheral foam layer. The cavity of the tube for example has a diameter in the range of 5 to 90% of the diameter of the non-pneumatic tire. Further preferred is that the cavity of the tube comprises rods or lattices (grids) for stabilizing the tube. Also preferred is that the tube comprises holding pins and the tube comprising holding pins is manufactured by 3D printing or injection molding.", "", "Preferably, the material of the tube is selected from the group consisting of thermoplastic elastomers, rubber and cast elastomers. The polymer may also be selected form the group consisting of silicone rubber, polytetrafluoroethylene rubber, chloroprene rubber. Preferred are also duroplastic materials. Further preferred are polymers like for example polypropylene, polyethylene terephthalate, polyamides, polyethylene, polyoxymethylene, semi-aromatic polyesters in particular products such as ecovio and ecoflex (BASF SE), polycarbonate.", "", "It is preferred that the polymeric foam of the peripheral foam layer comprises a thermoplastic polymer. The foam is for example a particle foam or a non-particular foam. Foams, especially particle foams, have long been known and have been widely described in the literature, e.g. in Ullmann's “Encyclopedia of Technical Chemistry”, 4th edition, volume 20, p. 416 ff.", "", "Highly elastic, largely closed-cell foams, such as particle foams made of thermoplastic elastomers, which e.g. produced in an autoclave or by the extruder process show special dynamic properties and in some cases also good rebound resilience. Hybrid foams made from particles of thermoplastic elastomers and system foam or binders are also known. Depending on the foam density, the manufacturing method and the matrix material, a relatively broad level of rigidity can be adjusted. The properties of the foam can also be influenced by post-treatment of the foam, such as tempering.", "", "Foamed pellets, which are also referred to as particle foams (or bead foams, particle foam), and molded articles made therefrom, based on thermoplastic polyurethane or other elastomers, are known (for example WO 94/20568A1, WO 2007/082838 A1, WO2017/030835 A1, WO 2013/153190 A1, WO2010/010010 A1) and can be used in many different ways.", "", "A foamed pellet or also a particle foam or bead foam in the sense of the present invention refers to a foam in the form of a particle, the average length of the particles preferably being in the range of from 1 to 8 mm. In the case of non-spherical, e.g. elongated or cylindrical particles mean the longest dimension by length.", "", "Thermoplastic polymers in the context of the present invention, in particular the foams of the molded body, include amorphous or semi-crystalline rigid or elastomeric thermoplastics, such as styrene polymers (PS), polyester (PE), polyolefins (PO), polyamides (PA) or thermoplastic polyurethanes (TPU). Preferably polypropylene (PP), polyamide (PA), polyether block amide (PEBA), styrene polymers, polylactic acid (PLA) and biodegradable, aliphatic-aromatic polyesters or mixtures thereof, polyvinyl alcohol (PVOH) or thermoplastic elastomer (TPE) granulates, such as thermoplastic polyurethanes (TPU) or thermoplastic polyester (TPEE) or mixtures of the above-mentioned polymers are used as thermoplastic polymers. Most preferably thermoplastic polyurethanes are used as thermoplastic polymers.", "", "Suitable thermoplastic elastomers for producing the foams, moldings or molded bodies according to the invention are known per se to the person skilled in the art. Suitable thermoplastic elastomers are described, for example, in “Handbook of Thermoplastic Elastomers”, 2nd edition June 2014.", "", "Preferably, the thermoplastic elastomer, in particular directed to the molded body, can be thermoplastic polyurethanes (TPU), thermoplastic polyamides, for example polyether copolyamides (TPA), thermoplastic elastomer based on olefin, for example polypropylene or polyethylene (TPO), thermoplastic polyesterelastomers, for example polyetheresters or polyesteresters (TPC), thermoplastic vulcanizate (TPV), thermoplastic styrenic elastomers, for example thermoplastic styrene butadiene block copolymer (TPS), or mixtures thereof.", "", "Preferably, the thermoplastic elastomer has a soft phase with a glass transition temperature Tg in the range of from <10° C. determined by dynamic mechanical thermal analysis determined by loss factor (tan δ) according to DIN EN ISO 6721-1-2011-08 at a heating rate of 2 K/min at a frequency of 1 Hz in torsion mode. Deviant from the DIN norm, the temperature was adjusted step wise by 5 K and 35 s per step which corresponds to a continuous heating rate of 2 K/min. The measurements were conducted with a sample with a ratio of width: thickness of 1:6. The sample was prepared by injection molding followed by annealing of the material at 100° C. for 20 h.", "", "Therefore, according to a further embodiment, the present invention is also directed to the process as disclosed above, wherein the thermoplastic elastomer has a soft phase with a glass transition temperature Tg in the range of from <10° C. more preferable below −10° C., particularly preferred below −30° C. determined by dynamic mechanical thermal analysis determined by loss factor (tan δ) according to DIN EN ISO 6721-1-2011-08 at a heating rate of 2 K/min at a frequency of 1 Hz in torsion mode. Deviant from the DIN norm, the temperature was adjusted step wise by 5 K and 35 s per step which corresponds to a continuous heating rate of 2 K/min.", "", "The measurements were conducted with a sample with a ratio of width: thickness of 1:6. The sample was prepared by injection molding followed by annealing of the material at 100° C. for 20 h.", "", "According to a further embodiment, the present invention is directed to the molded body as disclosed above, wherein the thermoplastic elastomer has a soft phase with a glass transition temperature Tg in the range of from <10° C. determined by dynamic mechanical thermal analysis determined by loss factor (tan δ) according to DIN EN ISO 6721-1-2011-08 at a heating rate of 2 K/min at a frequency of 1 Hz in torsion mode. Deviant from the DIN norm, the temperature was adjusted step wise by 5 K and 35 s per step which corresponds to a continuous heating rate of 2 K/min. The measurements were conducted with a sample with a ratio of width: thickness of 1:6. The sample was prepared by injection molding followed by annealing of the material at 100° C. for 20 h.", "", "For thermoplastic polyether ester and polyester ester preparation suitable aromatic dicarboxylic acids include e.g. phthalic acid, iso- and terephthalic acid or their esters. Suitable aliphatic dicarboxylic acids include e.g. cyclohexane-1,4-dicarboxylic acid, adipic acid, sebacic acid, azelaic acid and decanedicarboxylic acid as saturated dicarboxylic acids as well as maleic acid, fumaric acid, aconitic acid, itaconic acid, tetrahydrophthalic acid and tetrahydroterephthalic acid as unsaturated dicarboxylic acids. Suitable diol components are, for example, diols of the general formula HO— (CH2) n-OH, with n=2 to 20, such as ethylene glycol, propanediol (1,3), butanediol (1,4) or hexanediol (1,6). Polyetherols of the general formula HO— (CH2)n-O—(CH2)m-OH, where n is equal to or different from m and n or m=2 to 20, unsaturated diols and polyetherols such as butenediol-(1,4); diols and polyetherols containing aromatic units; as well as polyesterols. In addition to the carboxylic acids or their esters mentioned, and the alcohols mentioned, all other common representatives of these classes of compounds can be used to provide the polyether esters and polyester esters used according to the invention.", "", "The thermoplastic polyetheramides can be obtained by the reaction of amines and carboxylic acids or their esters by all of the methods known from the literature. Amines and or carboxylic acid also contain ether units of the type R—O—R, where R=organic radical (aliphatic and/or aromatic). In general, monomers of the following classes of compounds are used: HOOC—R′—NH2, where R′ can be aromatic and aliphatic, preferably containing ether units of the type R—OR, where R=organic radical (aliphatic and/or aromatic); aromatic dicarboxylic acids, e.g. phthalic acid, isophthalic acid and terephthalic acid or their esters and aromatic dicarboxylic acids containing ether units of the type R—O—R, where R=organic radical (aliphatic and/or aromatic); aliphatic dicarboxylic acids, e.g. cyclohexane-1,4-dicarboxylic acid, adipic acid, sebacic acid, azelaic acid and decanedicarboxylic acid as saturated dicarboxylic acids as well as maleic acid, fumaric acid, aconitic acid, itaconic acid, tetrahydrophthalic acid and tetrahydroterephthalic acid as unsaturated as well as aliphatic dicarboxylic acids R=containing organic units, R being ether units, ether units can be aliphatic and/or aromatic); diamines of the general formula H2N—R″— NH2, where R″ is aromatic and aliphatic, preferably containing ether units of the type R—O—R, where R=organic radical (aliphatic and/or aromatic); lactams such as ε-caprolactam, pyrrolidone or laurolactam; as well as amino acids.", "", "In addition to the carboxylic acids or their esters mentioned, and the amines, lactams and amino acids mentioned, all other common representatives of these classes of compounds can be used to provide the polyetheramine used according to the invention.", "", "The thermoplastic elastomers with block copolymer structure used according to the invention preferably contain vinylaromatic, butadiene and isoprene as well as polyolefin and vinyl units, for example ethylene, propylene and vinyl acetate units. Styrene-butadiene copolymers are preferred.", "", "The thermoplastic elastomers with block copolymer structure, polyether amides, polyether esters and polyester esters used according to the invention are preferably selected such that their melting points are ≤300° C., preferably ≤250° C., in particular ≤220° C.", "", "The thermoplastic elastomers with block copolymer structure, polyether amides, polyether esters and polyester esters used according to the invention can be partially crystalline or amorphous.", "", "Suitable olefin-based thermoplastic elastomers (TPO) in particular have a hard segment and a soft segment, the hard segment being, for example, a polyolefin such as polypropylene and polyethylene and the soft segment being a rubber component such as ethylene-propylene rubber. Blends of a polyolefin and a rubber component, dynamically cross-linked types and polymerized types are suitable.", "", "For example, structures are suitable in which an ethylene-propylene rubber (EPM) is dispersed in polypropylene; structures in which a cross-linked or partially cross-linked ethylene-propylenediene rubber (EPDM) is dispersed in polypropylene; statistical copolymers of ethylene and an α-olefin, such as propylene and butene; or block copolymers of a polyethylene block and an ethylene/α-olefin copolymer block. Suitable α-olefins are, for example, propylene, 1-butene, 1-pentene, 1-hexene, 1-heptene, 1-octene, 1-nonen, 1-n decene, 3-methyl-1-butene and 4-methyl-1-pentene or mixtures of these olefins.", "", "Suitable semicrystalline polyolefins are, for example, homopolymers of ethylene or propylene or copolymers containing monomeric ethylene and/or propylene units. Examples are copolymers of ethylene and propylene or an alpha olefin with 4-12 C atoms and copolymers of propylene and an alpha olefin with 4-12 C atoms. The concentration of ethylene or the propylene in the copolymers is preferably so high that the copolymer is semicrystalline.", "", "In the case of statistical copolymers, for example, an ethylene content or a propylene content of about 70 mol % or more are suitable.", "", "Suitable polypropylenes are propylene homopolymers or also polypropylene block copolymers, for example statistical copolymers of propylene and up to about 6 mol % of ethylene.", "", "Suitable thermoplastic styrene block copolymers usually have polystyrene blocks and elastomeric blocks. Suitable styrene blocks are selected, for example, from polystyrene, substituted polystyrenes, poly (alpha-methylstyrenes), ring-halogenated styrenes and ring-alkylated styrenes. Suitable elastomeric blocks are, for example, polydiene blocks such as polybutadienes and polyisoprenes, poly (ethylene/butylene) copolymers and poly (ethylene/propylene) copolymers, polyisobutylenes, or also polypropylene sulfides or polydiethylsiloxanes.", "", "Further suitable thermoplastic elastomers are thermoplastic polyurethanes (TPU). Also thermoplastic polyurethanes are well known. They are produced by reaction of isocyanates with isocyanate-reactive compounds for example polyols with number-average molar mass from 500 g/mol to 10000 g/mol and optionally chain extenders with molar mass from 50 g/mol to 499 g/mol, optionally in the presence of catalysts and/or conventional auxiliaries and/or additional substances. For the purposes of the present invention, preference is given to thermoplastic polyurethanes obtainable via reaction of isocyanates with isocyanate-reactive compounds for example polyols with number-average molar mass from 500 g/mol to 10000 g/mol and a chain extender with molar mass from 50 g/mol to 499 g/mol, optionally in the presence of catalysts and/or conventional auxiliaries and/or additional substances.", "", "The isocyanate, isocyanate-reactive compounds for example polyols and, if used, chain extenders are also, individually or together, termed structural components. The structural components together with the catalyst and/or the customary auxiliaries and/or additional substances are also termed starting materials.", "", "The molar ratios of the quantities used of the polyol component can be varied in order to adjust hardness and melt index of the thermoplastic polyurethanes, where hardness and melt viscosity increase with increasing content of chain extender in the polyol component at constant molecular weight of the TPU, whereas melt index decreases.", "", "For production of the thermoplastic polyurethanes, isocyanates and polyol component, where the polyol component in a preferred embodiment also comprises chain extenders, are reacted in the presence of a catalyst and optionally auxiliaries and/or additional substances in amounts such that the equivalence ratio of NCO groups of the diisocyanates to the entirety of the hydroxyl groups of the polyol component is in the range from 1:0.8 to 1:1.3.", "", "Another variable that describes this ratio is the index. The index is defined via the ratio of all of the isocyanate groups used during the reaction to the isocyanate-reactive groups, i.e. in particular the reactive groups of the polyol component and the chain extender. If the index is 1000, there is one active hydrogen atom for each isocyanate group. At indices above 1000, there are more isocyanate groups than isocyanate-reactive groups.", "", "An equivalence ratio of 1:0.8 here corresponds to an index of 1250 (index 1000=1:1), and a ratio of 1:1.3 corresponds to an index of 770.", "", "In a preferred embodiment, the index in the reaction of the abovementioned components is in the range from 965 to 1110, preferably in the range from 970 to 1110, particularly preferably in the range from 980 to 1030, and also very particularly preferably in the range from 985 to 1010.", "", "Preference is given in the invention to the production of thermoplastic polyurethanes where the weight-average molar mass (Mw) of the thermoplastic polyurethane is at least 60 000 g/mol, preferably at least 80 000 g/mol and in particular greater than 100 000 g/mol. The upper limit of the weight-average molar mass of the thermoplastic polyurethanes is very generally determined by processibility, and also by the desired property profile. The number-average molar mass of the thermoplastic polyurethanes is preferably from 80 000 to 300 000 g/mol. The average molar masses stated above for the thermoplastic polyurethane, and also for the isocyanates and polyols used, are the weight averages determined by means of gel permeation chromatography (e.g. in accordance with DIN 55672-1, March 2016).", "", "Organic isocyanates that can be used are aliphatic, cycloaliphatic, araliphatic and/or aromatic isocyanates.", "", "Aliphatic diisocyanates used are customary aliphatic and/or cycloaliphatic diisocyanates, for example tri-, tetra-, penta-, hexa-, hepta- and/or octamethylene diisocyanate, 2-methylpentamethylene 1,5-diisocyanate, 2-ethyltetramethylene 1,4-diisocyanate, hexamethylene 1,6-diisocyanate (HDI), pentamethylene 1,5-diisocyanate, butylene 1,4-diisocyanate, trimethylhexamethylene 1,6-diisocyanate, 1-isocyanato-3,3,5-trimethyl-5-isocyanatomethylcyclohexane (isophorone diisocyanate, IPDI), 1,4- and/or 1,3-bis(isocyanatomethyl)cyclohexane (HXDI), cyclohexane 1,4-diisocyanate, 1-methylcyclohexane 2,4- and/or 2,6-diisocyanate, methylenedicyclohexyl 4,4′-, 2,4′- and/or 2,2′-diisocyanate (H12MDI).", "", "Suitable aromatic diisocyanates are in particular naphthylene 1,5-diisocyanate (NDI), tolylene 2,4- and/or 2,6-diisocyanate (TDI), 3,3′-dimethyl-4,4′-diisocyanatobiphenyl (TODI), p-phenylene diisocyanate (PDI), diphenylethane 4,4′-diisoyanate (EDI), methylenediphenyl diisocyanate (MDI), where the term MDI means diphenylmethane 2,2′, 2,4′- and/or 4,4′-diisocyanate, 3,3′-dimethyldiphenyl diisocyanate, 1,2-diphenylethane diisocyanate and/or phenylene diisocyanate.", "", "Mixtures can in principle also be used. Examples of mixtures are mixtures comprising at least a further methylenediphenyl diisocyanate alongside methylenediphenyl 4,4′-diisocyanate. The term “methylenediphenyl diisocyanate” here means diphenylmethane 2,2′-, 2,4′- and/or 4,4′-diisocyanate or a mixture of two or three isomers. It is therefore possible to use by way of example the following as further isocyanate: diphenylmethane 2,2′- or 2,4′-diisocyanate or a mixture of two or three isomers. In this embodiment, the polyisocyanate composition can also comprise other abovementioned polyisocyanates.", "", "Other examples of mixtures are polyisocyanate compositions comprising 4,4′-MDI and 2,4′-MDI, or 4,4′-MDI and 3,3′-dimethyl-4,4′-diisocyanatobiphenyl (TODI) or 4,4′-MDI and H12MDI (4,4′-methylene dicyclohexyl diisocyanate) or 4,4′-MDI and TDI; or 4,4′-MDI and 1,5-naphthylene diisocyanate (NDI).", "", "In accordance with the invention, three or more isocyanates may also be used. The polyisocyanate composition commonly comprises 4,4′-MDI in an amount of from 2 to 50%, based on the entire polyisocyanate composition, and the further isocyanate in an amount of from 3 to 20%, based on the entire polyisocyanate composition.", "", "The polyisocyanate composition may also comprise one or more solvents. Suitable solvents are known to those skilled in the art. Suitable examples are nonreactive solvents such as ethyl acetate, methyl ethyl ketone and hydrocarbons.", "", "As isocyanate-reactive compound it is possible to use a compound which preferably has a reactive group selected from the hydroxyl group, the amino groups, the mercapto group and the carboxylic acid group. Preference is given here to the hydroxyl group and very particular preference is given here to primary hydroxyl groups. It is particularly preferable that the isocyanate-reactive compound is selected from the group of polyesterols, polyetherols and polycarbonatediols, these also being covered by the term “polyols”.", "", "The statistical average number of hydrogen atoms exhibiting Zerewitinoff activity in the isocyanate-reactive compound is at least 1.8 and at most 2.2, preferably 2; this number is also termed the functionality of the isocyanate-reactive compound, and states the quantity of isocyanate-reactive groups in the molecule, calculated theoretically for a single molecule, based on a molar quantity. The isocyanate-reactive compound preferably is substantially linear and is one isocyanate-reactive substance or a mixture of various substances, where the mixture then meets the stated requirement.", "", "Suitable polyols in the invention are homopolymers, for example polyetherols, polyesterols, polycarbonatediols, polycarbonates, polysiloxanediols, polybutadienediols, and also block copolymers, and also hybrid polyols, e.g. poly(ester/amide). Preferred polyetherols in the invention are polyethylene glycols, polypropylene glycols, polytetramethylene glycol (PTHF), polytrimethylene glycol. Preferred polyester polyols are polyadipates, polysuccinic esters and polycaprolactones.", "", "In another embodiment, the present invention also provides a thermoplastic polyurethane as described above where the polyol composition comprises a polyol selected from the group consisting of polyetherols, polyesterols, polycaprolactones and polycarbonates.", "", "Examples of suitable block copolymers are those having ether and ester blocks, for example polycaprolactone having polyethylene oxide or polypropylene oxide end blocks, and also polyethers having polycaprolactone end blocks. Preferred polyetherols in the invention are polyethylene glycols, polypropylene glycols, polycaprolactone and polytrimethylene glycol. Preference is further given to polytetramethylene glycol (PTHF).", "", "In a particularly preferred embodiment, the molar mass Mn of the polyol used is in the range from 500 g/mol to 10000 g/mol, preferably in the range from 500 g/mol to 5000 g/mol, in particular from 500 g/mol to 3000 g/mol.", "", "Another embodiment of the present invention accordingly provides a thermoplastic polyurethane as described above where the molar mass Mn of at least one polyol comprised in the polyol composition is in the range from 500 g/mol to 10000 g/mol.", "", "It is also possible in the invention to use mixtures of various polyols.", "", "An embodiment of the present invention uses, for the production of the thermoplastic polyurethane, at least one polyol composition comprising at least polytetrahydrofuran. The polyol composition in the invention can also comprise other polyols alongside polytetrahydrofuran.", "", "Materials suitable by way of example as other polyols in the invention are polyethers, and also polyesters, block copolymers, and also hybrid polyols, e.g. poly(ester/amide). Examples of suitable block copolymers are those having ether and ester blocks, for example polycaprolactone having polyethylene oxide or polypropylene oxide end blocks, and also polyethers having polycaprolactone end blocks. Preferred polyetherols in the invention are polyethylene glycols and polypropylene glycols. Preference is further given to polycaprolactone as other polyol.", "", "Examples of suitable polyols are polyetherols such as polytrimethylene oxide and polytetramethylene oxide.", "", "Another embodiment of the present invention accordingly provides a thermoplastic polyurethane as described above where the polyol composition comprises at least one polytetrahydrofuran and at least one other polyol selected from the group consisting of another polytetramethylene oxide (PTHF), polyethylene glycol, polypropylene glycol and polycaprolactone.", "", "In a particularly preferred embodiment, the number-average molar mass Mn of the polytetrahydrofuran is in the range from 500 g/mol to 5000 g/mol, more preferably in the range from 550 to 2500 g/mol, particularly preferably in the range from 650 to 2000 g/mol and very preferably in the range from 650 to 1400 g/mol.", "", "The composition of the polyol composition can vary widely for the purposes of the present invention. By way of example, the content of the first polyol, preferably of polytetrahydrofuran, can be in the range from 15% to 85%, preferably in the range from 20% to 80%, more preferably in the range from 25% to 75%.", "", "The polyol composition in the invention can also comprise a solvent. Suitable solvents are known per se to the person skilled in the art.", "", "Insofar as polytetrahydrofuran is used, the number-average molar mass Mn of the polytetrahydrofuran is by way of example in the range from 500 g/mol to 5000 g/mol, preferably in the range from 550 to 2500 g/mol, particular preferably in the range from 650 to 2000 g/mol. It is further preferable that the number-average molar mass Mn of the polytetrahydrofuran is in the range from 650 to 1400 g/mol.", "", "The number-average molar mass Mn here can be determined as mentioned above by way of gel permeation chromatography.", "", "Another embodiment of the present invention also provides a thermoplastic polyurethane as described above where the polyol composition comprises a polyol selected from the group consisting of polytetrahydrofurans with number-average molar mass Mn in the range from 500 g/mol to 5000 g/mol preferably in the range from 550 to 2500 g/mol, particular preferably in the range from 650 to 2000 g/mol. It is further preferable that the number-average molar mass Mn of the polytetrahydrofuran is in the range from 650 to 1400 g/mol.", "", "It is also possible in the invention to use mixtures of various polytetrahydrofurans, i.e. mixtures of polytetrahydrofurans with various molar masses.", "", "Preferably the polyol composition comprises at least one aliphatic polyol, preferably polytetramethylene glycol (polytetrahydrofuran, PTHF).", "", "The number average molecular mass Mn of the polyol composition for example is in the range of from 650 g/mol to 5000 g/mol, preferably in the range of from 2000 g/mol to 3500 g/mol, most preferably in the range of from 2000 g/mol to 3000 g/mol.", "", "Preferably the polyol composition is comprising PTHF and PTHF has a number average molecular mass Mn in the range of from equal or below 1500 g/mol.", "", "Preferably the polyol composition is consisting of PTHF and PTHF has a number average molecular mass Mn in the range of from 1000 g/mol to 1500 g/mol.", "", "Preferably the polyol composition is comprising a block copolymer with at least one block of PTHF and preferably the number average molecular mass Mn of the block copolymer is in the range of from 2000 g/mol to 3500 g/mol.", "", "According to a further aspect, the present invention is directed to a preparation for a molded body, wherein the thermoplastic elastomer is a thermoplastic polyisocyanate reaction product obtained or obtainable by reacting the components(A) a polyisocyanate composition(B) at least one chain extender(C) a polyol composition(D) optionally water(E) optionally a cross-linker(F) optionally a plasticizer(G) optionally additional additives,", "", "wherein the preparation contains a polyol composition having a glass transition temperature Tg in the range of from equal or below −50° C., determined by dynamic mechanical thermal analysis determined by loss factor (tan δ) according to DIN EN ISO 6721-2011-08 at a heating rate of 2 K/min at a frequency of 1 Hz.", "", "Chain extenders used are preferably aliphatic, araliphatic, aromatic and/or cycloaliphatic compounds with a molar mass from 50 g/mol to 499 g/mol, preferably having 2 isocyanate-reactive groups, also termed functional groups. Preferred chain extenders are diamines and/or alkanediols, more preferably alkanediols having from 2 to 10 carbon atoms, preferably having from 3 to 8 carbon atoms in the alkylene moiety, these more preferably having exclusively primary hydroxy groups.", "", "Preferred embodiments use chain extenders, these being preferably aliphatic, araliphatic, aromatic and/or cycloaliphatic compounds with molar mass from 50 g/mol to 499 g/mol, preferably having 2 isocyanate-reactive groups, also termed functional groups. It is preferable that the chain extender is at least one chain extender selected from the group consisting of ethylene 1,2-glycol, propane-1,2-diol, propane-1,3-diol, butane-1,4-diol, butane-2,3-diol, pentane-1,5-diol, hexane-1,6-diol, diethylene glycol, dipropylene glycol, cyclohexane-1,4-diol, cyclohexane-1,4-dimethanol, neopentyl glycol and hydroquinone bis(beta-hydroxyethyl) ether (HQEE). Particularly suitable chain extenders are those selected from the group consisting of 1,2-ethanediol, propane-1,3-diol, butane-1,4-diol and hexane-1,6-diol, and also mixtures of the abovementioned chain extenders. Examples of specific chain extenders and mixtures are disclosed inter alia in PCT/EP2017/079049.", "", "The ratio of polyols and chain extender used is varied in a manner that gives the desired hard-segment content, which can be calculated by the formula disclosed in PCT/EP2017/079049. A suitable hard segment content here is below 60%, preferably below 40%, particularly preferably 25%.", "", "Crosslinkers can be used as well, moreover, examples being the aforesaid higher-functionality polyisocyanates or polyols or else other higher-functionality molecules having a plurality of isocyanate-reactive functional groups. It is also possible within the context of the present invention for the products to be crosslinked by an excess of the isocyanate groups used, in relation to the hydroxyl groups. Examples of higher-functionality isocyanates are triisocyanates, e.g. triphenylmethane 4,4′,4″-triisocyanate, and also isocyanurates, and also the cyanurates of the aforementioned diisocyanates, and the oligomers obtainable by partial reaction of diisocyanates with water, for example the biurets of the aforementioned diisocyanates, and also oligomers obtainable by controlled reaction of semiblocked diisocyanates with polyols having an average of more than two and preferably three or more hydroxyl groups.", "", "The amount of crosslinkers here, i.e. of higher-functionality isocyanates and higher-functionality polyols, ought not to exceed 3% by weight, preferably 1% by weight, based on the overall mixture of components.", "", "Preferably the cross-linker selected from the group consisting of higher-functionality polyisocyanates and higher-functionality polyols increase the stability of the molded body. Further preferred is that additional additives selected from the group consisting of filler, lubricants, stabilizer, catalysts, flame retardants or plasticizers are added for adjusting stiffness.", "", "In preferred embodiments, catalysts are used with the structural components. These are in particular catalysts which accelerate the reaction between the NCO groups of the isocyanates and the hydroxyl groups of the isocyanate-reactive compound and, if used, the chain extender.", "", "Examples of catalysts that are further suitable are organometallic compounds selected from the group consisting of organyl compounds of tin, of titanium, of zirconium, of hafnium, of bismuth, of zinc, of aluminum and of iron, examples being organyl compounds of tin, preferably dialkyltin compounds such as dimethyltin or diethyltin, or tin-organyl compounds of aliphatic carboxylic acids, preferably tin diacetate, tin dilaurate, dibutyltin diacetate, dibutyltin dilaurate, bismuth compounds, for example alkylbismuth compounds or the like, or iron compounds, preferably iron(III) acetylacetonate, or the metal salts of carboxylic acids, e.g. tin(II) isooctanoate, tin dioctanoate, titanic esters or bismuth(III) neodecanoate. Particularly preferred catalysts are tin dioctanoate, bismuth decanoate and titanic esters. Quantities preferably used of the catalyst are from 0.0001 to 0.1 part by weight per 100 parts by weight of the isocyanate-reactive compound. Other compounds that can be added, alongside catalysts, to the structural components are conventional auxiliaries. Mention may be made by way of example of surface-active substances, fillers, flame retardants, nucleating agents, oxidation stabilizers, lubricating and demolded body aids, dyes and pigments, and optionally stabilizers, preferably with respect to hydrolysis, light, heat or discoloration, inorganic and/or organic fillers, reinforcing agents and/or plasticizers.", "", "Stabilizers for the purposes of the present invention are additives which protect a plastic or in particular a molded body from damaging environmental effects. Examples are primary and secondary antioxidants, sterically hindered phenols, hindered amine light stabilizers, UV absorbers, hydrolysis stabilizers, quenchers and flame retardants. Examples of commercially available stabilizers are found in Plastics Additives Handbook, 5th edn., H. Zweifel, ed., Hanser Publishers, Munich, 2001 ([1]), pp. 98-136.", "", "According to the present invention, a composition for preparation of a molded body comprises the thermoplastic elastomer. The composition may comprise further components such as further thermoplastic elastomers or fillers. In the context of the present invention, the term fillers encompasses organic and inorganic fillers such as for example further polymers.", "", "The composition may comprise the thermoplastic elastomer in an amount in the range of from 85 to 100 wt.-% based on the weight of the composition.", "", "Unless otherwise noted, the amounts of the components of the composition add up to 100 wt.-%.", "", "According to a further embodiment, the present invention is directed to the molded body as disclosed above, wherein the composition comprises a filler in an amount in the range of from 0.1 to 20 wt.-% based on weight of the composition.", "", "According to a further embodiment, the present invention is directed to the process as disclosed above, wherein the composition comprises a filler in an amount in the range of from 0.1 to 15 wt.-% based on the weight of the composition.", "", "The filler may for example be selected from the group consisting of organic fillers such as polystyrene, polyethylene, polypropylene, polyethylene terephthalate, polycarbonates, polyamides, polybutylene terephthalate, polyethylene terephthalates and polylactic acids.", "", "Inorganic fillers such as talcum, chalk, carbon black also can be used in the context of the present invention. Suitable fillers for thermoplastic elastomers are in principle known to the person skilled in the art.", "", "According to a further embodiment, the composition may for example comprise styrene polymers such as atactic, syndiotactic or isotactic polystyrene, more preferably atactic polystyrene.", "", "Atactic polystyrene of the invention, which is amorphous, has a glass transition temperature in the range of 100° C.±20° C. (determined according to DIN EN ISO 11357-1, February 2017/DIN EN ISO 11357-2, July 2014, Inflection point method). Syndiotactic and isotactic polystyrene of the invention are each semicrystalline and have a melting point in the region respectively of 270° C. and 240° C. (DIN EN ISO 11357-1, February 2017/DIN EN ISO 11357-3, April 2013, peak melting temperature).", "", "The polystyrenes used have a modulus of elasticity in tension of more than 2500 MPa (DIN EN ISO 527-1/2, June 2012).", "", "The production and processing of the polystyrenes of the invention is described extensively in the literature, for example in Kunststoff-Handbuch Band 4, “Polystyrol” [Plastics handbook, vol. 4, “Polystyrene”], by Becker/Braun (1996).", "", "Commercially available materials can also be used, for example PS 158 K (Ineos), PS 148 H Q (Ineos), STYROLUTION PS 156 F, STYROLUTION PS 158N/L, STYROLUTION PS 168N/L, STYROLUTION PS 153F, SABIC PS 125, SABIC PS 155, SABIC PS 160.", "", "The composition of the molded body may also comprise styrene with a modulus of elasticity below 2700 MPa (DIN EN ISO 527-1/2, June 2012), such as styrene polymers selected from the group of the thermoplastic elastomers based on styrene, and of the high-impact polystyrenes (HIPS) which by way of example include SEBS, SBS, SEPS, SEPS-V and acrylonitrile-butadiene-styrene copolymers (ABS), very particular preference being given here to high-impact polystyrene (HIPS).", "", "Commercially available materials can be used here, for example Styron A-TECH 1175, Styron A-TECH 1200, Styron A-TECH 1210, Styrolution PS 495S, Styrolution PS 485N, Styrolution PS 486N, Styrolution PS 542N, Styrolution PS 454N, Styrolution PS 416N, ROchling PS HI, SABIC PS 325, SABIC PS 330.", "", "The use of fillers further reduces the required energy needed for molding to achieve a specified tensile strength, and reduced energy advantageously leads to higher compression strength of the molded body obtained.", "", "The materials obtained have a lower melting point compared to the respective materials without filler which is advantageous for the preparation process.", "", "Another preferred embodiment is a molded body obtained or obtainable by a process for preparing foamed granules for a molded body comprising the steps of(i) providing a composition containing a thermoplastic polyurethane, wherein the thermoplastic polyurethane is obtained or obtainable by reacting the components(A) a polyisocyanate composition(B) at least one chain extender(C) a polyol composition with a glass transition temperature Tg in the range of from equal or below −50° C., determined by dynamic mechanical thermal analysis determined by loss factor (tan δ) according to DIN EN ISO 6721-2011-08 at a heating rate of 2 K/min at a frequency of 1 Hz.,(D) optionally water(E) optionally a cross-linker(F) optionally a plasticizer(G) optionally additional additives,(ii) impregnating the composition from step (i) with a blowing agent under pressure,(iii) expanding the composition from step (i) via pressure drop.", "", "Suitable production processes for the thermoplastic elastomers or foams or foamed granules from the thermoplastic elastomers mentioned are likewise known to the person skilled in the art.", "", "Suitable thermoplastic polyether esters and polyester esters can be prepared by all the conventional processes known from the literature by transesterification or esterification of aromatic and aliphatic dicarboxylic acids having 4 to 20 carbon atoms or their esters with suitable aliphatic and aromatic diols and polyols (cf. “Polymer Chemistry”, Interscience Publ., New York, 1961, p.111-127; Kunststoff Handbuch, Volume VIII, C. Hanser Verlag, Munich 1973 and Journal of Polymer Science, Part A1, 4, pages 1851-1859 (1966)).", "", "According to a further embodiment, the present invention is directed to the process as disclosed above, wherein the thermoplastic polymer is selected from the group consisting of thermoplastic polyurethanes, thermoplastic polyamides and thermoplastic polyetheresters, polyesteresters and mixtures thereof.", "", "According to a further embodiment, the present invention is directed to the process as disclosed above, wherein the thermoplastic elastomer is selected from the group consisting of thermoplastic polyurethanes.", "", "The non-expanded polymer mixture of the composition for a molded body required for the preparation of the foamed granules is prepared in a known manner from the individual components as well as optionally other components such as processing aids, stabilizers, tolerability agents or pigments. Suitable methods are, for example, common mixing methods with the help of a kneader, continuous or discontinuous, or an extruder such as an identical twin-screw extruder.", "", "The thermoplastic polyurethanes may be produced batchwise or continuously by the known processes, for example using reactive extruders or the belt method by the “one-shot” method or the prepolymer process, preferably by the “one-shot” method. In the “one-shot” method, the components to be reacted, and in preferred embodiments also the chain extender in the polyol component, and also catalyst and/or additives, are mixed with one another consecutively or simultaneously, with immediate onset of the polymerization reaction. The TPU can then be directly pelletized or converted by extrusion to lenticular pellets. In this step, it is possible to achieve concomitant incorporation of other adjuvants or other polymers.", "", "In the extruder process, structural components, and in preferred embodiments also the chain extender, catalyst and/or additives, are introduced into the extruder individually or in the form of mixture and reacted, preferably at temperatures of from 100° C. to 280° C., preferably from 140° C. to 250° C. The resultant polyurethane is extruded, cooled and pelletized, or directly pelletized by way of an underwater pelletizer in the form of lenticular pellets.", "", "It is possible to introduce further additives (components, excipients, fillers) such as impact modifiers, dyes, stabilizers, antioxidants. In this step, some of the above usual excipients (additives, fillers, components) can be added to the mixture.", "", "In a preferred process, a thermoplastic polyurethane is produced from structural components isocyanate, isocyanate-reactive compound including chain extender, and in preferred embodiments the other raw materials in a first step, and the additional substances or auxiliaries are incorporated in a second extrusion step.", "", "It is preferable to use a twin-screw extruder, because twin-screw extruders operate in force-conveying mode and thus permit greater precision of adjustment of temperature and quantitative output in the extruder. Production and expansion of a TPU can moreover be achieved in a reactive extruder in a single step or by way of a tandem extruder by methods known to the person skilled in the art.", "", "Processes for producing foamed pellets from thermoplastic elastomers are known per se to the person skilled in the art. If, according to the invention, a foamed granulate made of the thermoplastic elastomer is used, the bulk density of the foamed granulate is, for example, in the range from 20 g/l to 300 g/l.", "", "The foamed granules according to the invention usually have a bulk density of 50 g/l to 200 g/l, preferably 60 g/l to 180 g/l, more preferably 80 g/l to 150 g/l. The bulk density is measured analogously to DIN ISO 697, wherein in the determination of the above values in contrast to the standard, a vessel with 0.5 l volume is used instead of a vessel with 0.5 l volume, since especially for the foam particles with low density and large mass a measurement with only 0.5 l volume is too inaccurate.", "", "As stated above, the diameter of the foamed granules is between 0.5 and 30; preferably 1 to 15 and in particular between 3 to 12 mm. For foamed granules that are not spherical, e.g. elongated or cylinder-shaped, the longest dimension is meant by diameter.", "", "The production of the foamed granules can be carried out according to the usual methods known in the prior art by(i) Providing a composition according to the invention;(ii) Impregnation of the composition with a propellant under pressure;(iii) Expanding the composition for foamed granules and/or molded body by means of pressure drop.", "", "The propellant quantity is preferably 0.1 to 40, in particular 0.5 to 35 and more preferably 1 to parts by weight, based on 100 parts by weight of the amount of composition used.", "", "In one embodiment the above-mentioned method includes:(i) Providing a composition according to the invention in the form of a granulate;(ii) Impregnation of the granulate with a propellant under pressure;(iii) Expanding the granules by means of pressure drop.", "", "Another embodiment of the above-mentioned method includes another step:(i) Providing a composition according to the invention in the form of a granulate;(ii) Impregnation of the granulate with a propellant under pressure;(iii-a) Reducing the pressure to normal pressure without foaming the granules, if necessary by reducing the temperature in advance(iii-b) foaming of the granules by increasing the temperature.", "", "Preferably, the non-expanded granules have an average minimum diameter of 0.2-10 mm (determined via 3D evaluation of the granulate, e.g. via dynamic image analysis with the use of an optical measuring apparatus called Partan 3D by Microtrac).", "", "The individual granules usually have an average mass in the range of 0.1 to 50 mg, preferably in the range of 4 to 40 mg and particularly preferably in the range of 7 to 32 mg. This mean mass of the granules (particle weight) is determined as an arithmetic method by weighing 10 granulate particles each.", "", "In a preferred embodiment the above-mentioned method includes the impregnation of a polymer granulate with a propellant under pressure and subsequent expansion of the granules in step (I) and (II):(I) Impregnation of the granulate in the presence of a propellant under pressure at elevated temperatures in a suitable closed reaction vessel (e.g. autoclaves);(II) sudden relaxation without cooling.", "", "Herein, the impregnation in step (I) can be carried out in the presence of water as well as optional suspension aids or only in the presence of the propellant and absence of water.", "", "Suitable suspension aids are e.g. water-insoluble inorganic stabilizers, such as tricalcium phosphate, magnesium pyrophosphate, metal carbonates, polyvinyl alcohol and surfactants, such as sodium dodecyl aryl sulfonate. They are usually used in amounts of 0.05 to 10 wt.-%, based on the composition of the invention.", "", "The impregnation temperatures are depending on the selected pressure in the range of 100° C.-200° C., wherein the pressure in the reaction vessel is in the range of 2 to 150 bar, preferably in the range of 5 and 100 bar, more preferably in the range of 20 and 60 bar, the impregnation period is generally 0.5 to 10 hours.", "", "The execution of the method in suspension is known to the skilled person and described e.g. in detail in WO2007/082838.", "", "When performing the process in the absence of the propellant, care must be taken to avoid the aggregation of the polymer granules.", "", "Suitable propellants for carrying out the process in a suitable closed reaction vessel are, for example, organic liquids and gases which are present in a gaseous state under the processing conditions, such as hydrocarbons or inorganic gases or mixtures of organic liquids or gases and inorganic gases, wherein these can also be combined.", "", "Suitable hydrocarbons are, for example, halogenated or non-halogenated, saturated or unsaturated aliphatic hydrocarbons, preferably non-halogenated, saturated or unsaturated aliphatic hydrocarbons.", "", "Preferred organic propellants are saturated, aliphatic hydrocarbons, in particular those with 3 to 8 C atoms such as butane or pentane.", "", "Suitable inorganic gases are nitrogen, air, ammonia or carbon dioxide, preferably nitrogen or carbon dioxide or mixtures of the gases mentioned above.", "", "In a further embodiment, the process comprises impregnation of the granules with a propellant under pressure and subsequent expansion of the granules in step (α) and (β):(α) Impregnation of the granulate in the presence of a propellant under pressure at elevated temperatures in an extruder;(β) Granulation of the mass from the extruder under conditions that prevent uncontrolled foaming.", "", "Suitable propellants in this process variant are volatile organic compounds with a boiling point at normal pressure 1013 mbar from −25° C. to 150° C., in particular −10° C. to 125° C. Well suited are hydrocarbons (preferably halogen-free), in particular C4-10 alkanes, for example, the isomers of the butane, pentane, hexane, heptane and octane, particularly preferably iso-butane. Other possible propellants are also more sterically demanding compounds such as alcohols, ketones, esters, ethers and organic carbonates.", "", "Herein, the composition in the step (ii) in an extruder is mixed under melting with the propellant under pressure, which is fed to the extruder. The propellant-containing mixture is pressed under pressure, preferably with moderately controlled back pressure (e.g. underwater granulation) and granulated. Herein, the melt string foams up, and the foamed granules are obtained by granulation.", "", "The execution of the process via extrusion is known to the skilled person and described in detail, for example, in WO2007/082838 and WO2013/153190.", "", "As extruders, all the usual screw machines can be considered, in particular single-screw and twin-screw extruders (e.g. type ZSK by Werner & Pfleiderer), co-kneaders, combi-plastic machines, MPC kneaders, FCM mixers, KEX kneader screw extruders and shear roller extruders, as they are disclosed e.g. in Saechtling (ed.), Plastic paperback, 27th edition 3.2.1 and 3.2.4. The extruder is usually operated at a temperature at which the composition (Z1) is present as a melt, for example at 120° C. to 250° C., in particular 150° C. to 210° C. and a pressure after the addition of the propellant of 40 to 200 bar, preferably 60 to 150 bar, particularly preferably 80 to 120 bar to ensure a homogenization of the propellant with the melt.", "", "Herein, the execution can be carried out in an extruder or an arrangement of one or more extruders. For example, in a first extruder, the components can be melted and blended and a propellant can be injected. In the second extruder, the impregnated melt is homogenized and the temperature and pressure is adjusted. If, for example, three extruders are combined with each other, the mixing of the components as well as the injecting of the propellant can be divided into two different process parts. If, as preferably, only one extruder is used, all process steps, melt, mix, injection of the propellant, homogenization and adjustment of the temperature and or pressure are carried out in an extruder.", "", "The foamed granules may also contain dyes. Here, the addition of dyes can be done by different means.", "", "In one embodiment, the manufactured foamed granules can be dyed after manufacture. Here, the corresponding foamed granules are contacted with a carrier liquid contained with a dye, wherein the carrier fluid has a polarity, which is suitable that a sorption of the carrier fluid is carried out in the foamed granules. The implementation may be carried out in analogy with the methods described in the EP3700969.", "", "Suitable dyes are, for example, inorganic or organic pigments. Suitable natural or synthetic inorganic pigments are, for example, soot, graphite, titanium oxides, iron oxides, zirconia oxides, cobalt oxide compounds, chromium oxide compounds, copper oxide compounds. Suitable organic pigments are, for example, azo-pigments and polycyclic pigments. In a further embodiment, the ink can be added in the preparation of the foamed granules. For example, the dye can be added to the extruder during the preparation of the foamed granules via extrusion.", "", "Alternatively, already dyed material can be used as a starting material for the preparation of the foamed granules, which is extruded or expanded in the closed vessel according to the above-mentioned methods.", "", "Furthermore, in the process described in WO2014/150122, the supercritical liquid or the heated liquid may contain a dye.", "", "The molded parts, in particular the molded body according to the invention have advantageous properties for the above-mentioned applications in the non-pneumatic tire area.", "", "Herein, the tensile and compression properties of the moldings produced from the foamed granules are characterized in that the tensile strength is above 600 kPa (DIN EN ISO 1798, April 2008), the elongation is above 100% (DIN EN ISO 1798, April 2008) and the compressive voltage above 15 kPa is 10% compression (analogous to DIN EN ISO 844, November 2014; the deviation from the standard is in the height of the sample with 20 mm instead of 50 mm and thus the adjustment of the test speed to 2 mm/min).", "", "The rebound elasticity of the moldings produced from the foamed granules is above 55% (analogous to DIN 53512, April 2000; the deviation from the standard is the test specimen height which should be 12 mm, but in this test is carried out with 20 mm in order to avoid a “smashing” of the sample and measuring the substrate).", "", "The density and compression properties of the manufactured moldings are related. Advantageously, the density of the molded parts is between 75 and 375 kg/m3, preferably between 100 to 300 kg/m3, particularly preferably between 150 to 200 kg/m3 (DIN EN ISO 845, October 2009).", "", "The ratio of the density of the molded to the bulk density of the foamed granules according to the invention is generally between 1.5 and 2.5, preferably at 1.8 to 2.0.", "", "Further object of the present invention is a molded body prepared from the foamed granules according to the invention. Therefore, the foamed pellets are preferably fused.", "", "The preparation of the corresponding moldings can be carried out according to the skilled person known methods.", "", "A preferred method for the preparation of a foam molding part includes the following steps:(A) Inserting the foamed granules according to the invention in a corresponding form,(B) Fusing of the foamed granules according to the invention from step (A).", "", "The fusion in step (B) is preferably carried out in a closed form, wherein the fusion can be carried out by water vapor, hot air (as e.g. described in EP1979401) or energetic radiation (microwaves or radio waves).", "", "The temperature at the fusion of the foamed granules is preferably below or close to the melting temperature of the polymer from which the particle foam was produced. For the common polymers, therefore, the temperature for fusion of the foamed granules is between 100° C. and 180° C., preferably between 120° C. and 150° C.", "", "Temperature profiles/residence times can be determined individually, e.g. in analogy to the methods described in the US20150337102 or EP2872309.", "", "Fusing by energetic radiation is generally carried out in the frequency range of microwaves or radio waves, if necessary in the presence of water or other polar liquids, such as polar groups having microwave-absorbing hydrocarbons (such as esters of carboxylic acids and diols or triols or glycols and liquid polyethylene glycol) and can be carried out in analogy to the methods described in EP3053732 or WO16146537.", "", "According to the present invention, fusing the foamed pellets is preferably carried out in a mold to shape the molded body obtained. In principle, all suitable methods for fusing foamed pellets can be used according to the present invention, for example fusing at elevated temperatures, such as for example steam chest molding, molding at high frequencies, for example using electromagnetic radiation, processes using a double belt press, or variotherm processes.", "", "The thermoplastic polymer foam from which the molded body is manufactured can be any open-cell or closed-cell polymer foam that can be produced from a thermoplastic. The thermoplastic polymer foam is particularly preferably a molded foam.", "", "The production of the molding made of the polymer foam can be achieved in any desired manner known to the person skilled in the art: by way of example, webs made of a foamed polymer can be produced, and the moldings can be cut out from the webs. If the polymer foam from which the molding has been produced is a molded foam, the molding can be produced by any process known to the person skilled in the art for the production of moldings made of a molded foam: it is possible by way of example to charge pellets made of an expandable thermoplastic polymer to a mold, to expand the pellets to give foam beads by heating, and then to use pressure to bond the hot foam beads to one another. The pressure is generated here via the foaming of the beads, the volume of which increases while the internal volume of the mold remains the same. Uniform heating can be achieved by way of example by passing steam through the mold. However, it is alternatively also possible to charge pre-expanded beads to the mold. In this case, the procedure begins with complete filling of the mold. In a further step, the volume of the mold is reduced by insertion of a ram at the feed aperture, which has likewise been completely filled with expanded beads, and the pressure in the mold is thus increased. The expanded beads are thus pressed against one another and can therefore become fused to give the molding. Here again, the fusion of the beads is in particular achieved via passage of steam through the system.", "", "The injection process used to apply the thermoplastic polymer can by way of example be an injection molding process, a transfer-molding process, or an injection compression-molding process. It is possible on the one hand to insert the molding made of thermoplastic polymer into a mold for the injection molding process, transfer-molding process, or injection compression-molding process, and then to apply the thermoplastic polymer. Alternatively, it is also possible to utilize, for the over molding process, the mold in which the molding made of the polymer foam is also produced. It is usual to use, for this purpose, molds with displaceable core. If the intention is that the thermoplastic polymer be applied only to one side of the molding made of polymer foam, it is alternatively also possible, after the production of the molding made of polymer foam, to remove one mold half, and to seal the second mold half in which the molding is still present by using another mold half into which the thermoplastic polymer for the functional layer is then injected or forced.", "", "For fusing with radiofrequency electromagnetic radiation, the particle foams can preferably be wetted with a polar liquid, which is suitable to absorb the radiation, for example in proportions of 0.1 to 10 wt.-%, preferably in proportions of 1 to 6 wt.-%, based on the used particle foams. Fusing with radiofrequency electromagnetic radiation of the particle foams can be achieved in the context of the present invention even without the use of a polar liquid. The thermal connection of the foam particles takes place, for example, in a form by means of radiofrequency electromagnetic radiation, in particular by means of microwaves. Electromagnetic radiation with frequencies of at least 20 MHz, for example of at least 100 MHz, is understood to be high frequency. As a rule, electromagnetic radiation is used in the frequency range between 20 MHz and 300 GHz, for example between 100 MHz and 300 GHz. Microwaves are preferred in the frequency range between 0.5 and 100 GHz, especially preferably 0.8 to 10 GHz and irradiation times between 0.1 and 15 minutes are used. Preferably, the frequency range of the microwave is adjusted to the absorption behavior of the polar liquid or vice versa the polar liquid is selected based on the absorption behavior according to the frequency range of the used microwave device. Suitable methods are described, for example, in WO2016/146537.", "", "Due to the good mechanical properties and the good temperature behavior, the polymer foams according to the invention are particularly suitable for the preparation of moldings. Molded bodies can be prepared from the foamed granules according to the invention, for example by fusing or gluing.", "", "According to a further aspect, the present invention also relates to the use of a foamed granules of the inventions or a foamed granules, obtained or available according to a method of the invention for the preparation of moldings. According to a further embodiment, the present invention also relates to the use of a foamed granules of the inventions or a foamed granulates, obtained or available according to a method of the invention for the preparation of moldings, wherein the preparation of the molding by means of fusing or gluing of the particles is carried out with each other.", "", "The present invention also relates to a further aspect a hybrid material, containing a matrix of a polymer and a foamed granules according to the present invention. Materials comprise a foamed granulate and a matrix material are referred to in this invention as hybrid materials. The matrix material can be made of a compact material or also of a foam.", "", "Polymers suitable as matrix material are known to the skilled person themselves. Suitable in the context of the present invention are, for example, ethylene-vinyl acetate copolymers, binders based on epoxy or also polyurethanes. According to the invention, polyurethane foams or compact polyurethanes such as thermoplastic polyurethanes are suitable.", "", "According to the invention, the polymer is selected in such a way that a sufficient adhesion is given between the foamed granules and the matrix in order to obtain a mechanically stable hybrid material.", "", "The matrix can surround the foamed granules in whole or in part. According to the invention, the hybrid material may contain further components, for example further fillers or also granules. According to the invention, the hybrid material may also contain mixtures of different polymers. The hybrid material may also contain mixtures of foamed granules.", "", "Foamed granules, which can be used in addition to the foamed granules according to the present invention, are known to the skilled person per se. In particular, foamed granules made of thermoplastic polyurethanes are suitable in the context of the present invention.", "", "According to an embodiment, the present invention accordingly also relates to a hybrid material, containing a matrix of a polymer, a foamed granulate according to the present invention and another foamed granules from a thermoplastic polyurethane.", "", "The matrix comprises in the present invention of a polymer suitable in the context of the present invention as matrix material, for example, elastomers or foams, in particular foams based on polyurethanes, for example elastomers such as ethylene vinyl acetate copolymers or also thermoplastic polyurethanes.", "", "Accordingly, the present invention also relates to a hybrid material as previously described, wherein the polymer is an elastomer. Furthermore, the present invention relates to a hybrid material as previously described, wherein the polymer is selected from the group consisting of ethylene vinyl acetate copolymers and thermoplastic polyurethanes.", "", "According to an embodiment, the present invention also relates to a hybrid material containing a matrix of an ethylene-vinyl acetate copolymer and a foamed granules according to the present invention.", "", "According to a further embodiment, the present invention relates to a hybrid material, containing a matrix of an ethylene-vinyl acetate copolymer, a foamed granulate according to the present invention and another foamed granules, for example from a thermoplastic polyurethane.", "", "According to one embodiment, the present invention relates to a hybrid material containing a matrix of a thermoplastic polyurethane and a foamed granulate according to the present invention.", "", "According to a further embodiment, the present invention relates to a hybrid material, containing a matrix of a thermoplastic polyurethane, a foamed granules according to the present invention and another foamed granules, for example from a thermoplastic polyurethane.", "", "Suitable thermoplastic polyurethanes are known to the skilled person themselves. Suitable thermoplastic polyurethanes are described, for example, in “Plastic Manual, Volume 7, Polyurethanes”, Carl Hanser Verlag, 3rd edition 1993, chapter 3.", "", "Preferably, the polymers in the context of the present invention are polyurethanes. Polyurethane in the sense of the invention includes all known elastic polyisocyananate polyaddition products. These include in particular massive polyisocyananate. Polyaddition products, such as viscoelastic gels or thermoplastic polyurethanes, and elastic foams based on polyisocyanate polyaddition products, such as soft foams, semi-hard foams or integral foams. Furthermore, polyurethanes in the sense of the invention elastic polymer blends, containing polyurethane and other polymers, as well as foams from these polymer blends are to be understood. Preferably, the matrix is a hardened, compact polyurethane binder, an elastic polyurethane foam or a viscoelastic gel.", "", "Under a polyurethane binder is understood in the context of the present invention a mixture consisting to at least 50 wt.-%, preferably to at least 80 wt.-% and in particular to at least 95 wt.-% of an isocyanate group having prepolymer, hereinafter referred to as isocyanate prepolymer. Here, the viscosity of the inventive polyurethane binder is preferably in a range of 500 to 4000 mPa·s, particularly preferably from 1000 to 3000 mPa·s, measured at 25° C. according to DIN 53 018.", "", "In the context of the invention, polyurethane foams are understood to be foams in accordance with DIN 7726.", "", "The density of the matrix material is preferably in the range of 1,2 to 0.01 g/cm3. Particularly preferred, the matrix material is an elastic foam or an integral foam with a density in the range of 0.8 to 0.1 g/cm3, in particular from 0.6 to 0.3 g/cm3 or compact material, for example a hardened polyurethane binder.", "", "In particular, foams are suitable as matrix material. Hybrid materials containing a matrix material from a polyurethane foam preferably have a good adhesion between matrix material and foamed granules.", "", "According to an embodiment, the present invention also relates to a hybrid material containing a matrix of a polyurethane foam and a foamed granulate according to the present invention.", "", "According to a further embodiment, the present invention relates to a hybrid material, containing a matrix of a polyurethane foam, a foamed granulate according to the present invention and another foamed granules, for example from a thermoplastic polyurethane.", "", "A hybrid material according to the invention, containing a polymer as a matrix and a foamed granulate according to the invention can be prepared, for example, by the components used for the preparation of the polymer and the foamed granules optionally mixed with further components and converted to the hybrid material, wherein the reaction is preferably under conditions under which the foamed granules is substantially stable.", "", "Appropriate methods and reaction conditions for the preparation of the polymer, in particular an ethylene vinyl acetate copolymer or a polyurethane are known to the skilled person per se.", "", "In a preferred embodiment, the hybrid materials of the invention represent integral foams, in particular integral foams based on polyurethane. Suitable methods for the production of integral foams are known to the skilled person per se. The integral foams are preferably manufactured by the one-shot process with the help of low pressure or high-pressure technology in closed, purpose-controlled molds. The molds are usually made of metal, e.g. aluminium or steel. These methods are described, for example, by Piechota and Röhr in ‘Integral Schaumstoff’, Carl-Hanser-Verlag, Munich, Vienna, 1975, or in the Plastic Manual, Volume 7, Polyurethanes, 3rd edition, 1993, chapter 7.", "", "If the hybrid material of the invention comprises an integral foam, the amount of the reaction mixture introduced into the mold is dimensioned in such a way that the obtained molds of integral foams have a density of 0.08 to 0.70 g/cm3, in particular from 0.12 to 0.60 g/cm3.", "", "The compaction degrees for the preparation of the moldings with compacted edge zone and cellular core are in the range of 1.1 to 8.5, preferably from 2.1 to 7.0.", "", "Thus, it is possible to produce hybrid materials with a matrix of a polymer and contained therein the foamed granules according to the invention, in which a homogeneous distribution of the foamed particles is present. The foamed granules according to the invention can be easily used in a method for the preparation of a hybrid material, since the individual particles are free-flowing due to their small size and do not place any special requirements on the processing. Techniques for homogeneous distribution of the foamed granules such as slow rotation of the mold can be used.", "", "The reaction mixture for the preparation of the hybrid materials of the invention can optionally also be added aids and/or additives. For example, surface-active substances, foam stabilizers, cell regulators, release agents, fillers, dyes, pigments, hydrolysis protection agents, odour-absorbing substances and fungistatic and bacteriostatic substances are mentioned.", "", "In a hybrid material according to the invention, the volume portion of the foamed granules is preferably 20 percent by volume and more, more preferably 50 percent by volume and more preferably 80 percent by volume and more and in particular 90 percent by volume and more, each based on the volume of the hybrid system according to the invention.", "", "The hybrid materials of the invention, in particular hybrid materials with a matrix of cellular polyurethane, are characterized by a very good adhesion of the matrix material with the foamed granules according to the invention. In this process, a hybrid material according to the invention preferably does not rip at the interface of matrix material and foamed granules. This makes it possible to produce hybrid materials that have improved mechanical properties, such as tear resistance and elasticity, compared to conventional polymer materials, especially conventional polyurethane materials at the same density.", "", "The elasticity of hybrid materials according to the invention in the form of integral foams is preferably greater than 40% and particularly preferably greater than 50% according to DIN 53512.", "", "Furthermore, the hybrid materials according to the invention, in particular those based on integral foams show high rebound elasticities at low density. In particular, integral foams based on hybrid materials according to the invention are therefore excellently suited as materials for shoe soles. This preserves light and comfortable soles with good durability properties. Such materials are particularly suitable as midsoles for sports shoes.", "", "The properties of the hybrid materials of the invention can vary depending on the polymer used in wide ranges and can be varied in particular by a variation of the size, shape and texture of the expanded granules, or the addition of further additives, for example also other non-foamed granules such as plastic granules, for example rubber granules, in wide limits.", "", "The hybrid materials of the invention have a high durability and load-bearing capacity, which is particularly noticeable by a high tensile strength and elongation at break. In addition, hybrid materials of the invention have a low density.", "", "The process of the present invention comprises steps (i) and (ii). The process may comprise further steps such as for example temperature treatments or a treatment of the foamed pellets. According to step (i), the foamed pellets are provided, preferably in a suitable mold, and then fused according to step (ii). Preferably, fusing is carried out by thermal fusing of the foamed pellets. According to a further embodiment, the present invention is directed to the process as disclosed above, wherein step (ii) is carried out by thermal fusing.", "", "According to a further aspect, the present invention is also directed to a molded body obtained or obtainable according to a process as disclosed above.", "", "The molded body according to the present invention can be used for a variety of applications, such as non-pneumatic tires for vehicle wheels such as wheels for cars, bikes, motorcycles, trucks, e-scooter, toys, sport equipment, golf caddy, stroller, wheelchairs.", "", "According to a further aspect, the present invention is directed to a process for the manufacturing of a molded body as insert for non-pneumatic tires comprising the steps of(i) providing the tube, which comprises the holding pins and which is manufactured by 3D printing or injection molding,(ii) providing at least one peripheral foam layer,(iii) composing the elements of step (i) and step (ii).", "", "Preferably the method in step (iii) is selected from the group consisting of steam chest molding, radio frequency (RF) molding, thermal molding, molding with pressure or combinations thereof.", "", "According to a further aspect, the present invention is directed to a use of a molded body for producing non-pneumatic tires.", "", "According to a further aspect, the present invention is directed to a non-pneumatic tire wherein the molded body is surrounded at least partwise by an outer tire and wherein the outer tire and the molded body are fused, glued or pressed together.", "", "The outer tire in particular comprises a rubber material which is selected from the group consisting of thermoplastic elastomers, vulcanizates, cast elastomers, silicone rubber, polytetrafluoroethylene rubber, chloroprene rubber, styrene butadiene rubber (SBR). Preferred are also duroplastic materials. Further preferred are polymers like for example polypropylene, polyethylene terephthalate, polyamides, polyethylene, polyoxymethylene, semi-aromatic polyesters in particular products such as ecovio and ecoflex (BASF SE), polycarbonate.", "", "Either instead of or in addition to the rubber material, which at least partly surrounds the molded body, suitable coats can be applied on the surface of the molded body. Such coatings and coating techniques are known in the state of the art and are for example disclosed in WO2019/105725. Therein coating and lacquering on plastic substrates, for example foam substrates, is described. The content of WO2019/105725 can be applied in the context of the present invention and is included by reference. In the context of the present invention it is also possible that neither a coating nor an outer tire is applied.", "", "According to a further aspect, the present invention is directed to a use of a non-pneumatic tire for vehicle wheels for cars, bikes, motorcycles, trucks, e-scooter, toys, sport equipment, golf caddy, stroller and/or wheelchair.", "", "Illustrative embodiments of the invention are shown in the figures and explained in more detail in the following description.", "", "Figures", "", "InFIG.1a molded body (10) is shown which comprises a peripheral layer (1) of foam granules, which are in particular fused together. The peripheral layer (1) is composed with a tube (2) which comprises openings (4). Furthermore, the inner (hollow) cavity (3) of the tube is shown, therefore the inner tube (2) can also be named a as hollow tube (2). The tube (2) acts as stabilization ring for the molded body (10) and the peripheral foam layer (1). The peripheral foam layer (1) and the hollow tube (2) together form the molded body (10), which preferably is used as insert for non-pneumatic tires. Therefore, the molded body (10) may be surrounded at least partly by an outer tire.", "", "FIG.2shows a mold, comprising a top side (6) and a bottom side (7), for forming the molded body comprising the inner hollow tube (2). For the process of the manufacturing of the molded body, the tube in particular comprises holding pins (5) to fix the inner tube (2) within the mold. An alternative could be to use holding pins belonging to the mold to fix the tube. Before the molding process starts and after the inner tube (2) is fixed within the open mold, the particle foam beads, which form the peripheral foam layer, are filled into the mold (not shown). Then the mold is closed (11), by bringing top side (6) and a bottom side (7) together, and the molding process can start. During molding the holding pins (5), depending on the melting point of the material, may melt or will remain and will after molding be surrounded by or part of the peripheral foam layer. During molding the foamed particles of the particle foam fuse together to form the peripheral foam layer. Furthermore, also the tube and the peripheral foam layer are fixed together. As result the molded body is formed.", "", "FIG.3. shows a wheel assembly comprising a rim (9), an outer tire (8) and the molded body (10) according to the present invention. The outer tire (8) and the molded body (10) form together the non-pneumatic tire which is fixed to a rim (9).", "", "FIG.4shows a tube (2). The tube (2) has the cavity (3) and certain openings (4). Due to the cavity (3) and/or openings (4) the heat generation during operation of the non-pneumatic tire is reduced (air circulation and/or isolation). A further function of the tube (2) is stabilizing the peripheral foam layer. Furthermore, the combination of tube (2) and peripheral foam layer enables sufficient hardness of the molded body as insert for non-pneumatic tires while rebound remains to ensure suitable comfort levels. The tube may be rigid for stabilization purpose, but also flexible to enable sufficient rebound."], "claims": ["1 - 16 . (canceled)", "(A) a tube, which comprises a hollow cavity, and (B) at least one peripheral foam layer, which comprises a polymeric foam, wherein the elements (A) and (B) are composed, and the at least one peripheral foam layer and the tube together form the molded body, wherein the cavity of the tube comprises rods for stabilizing the tube.", "18 : The molded body according to claim 17 , wherein a material of the tube is selected from the group consisting of thermoplastic elastomers, rubber, cast elastomers, duroplastic materials, polypropylene, polyethylene terephthalate, polyamides, polyethylene, polyoxymethylene, semi-aromatic polyesters, and polycarbonate.", "19 : The molded body according to claim 17 , wherein the tube comprises openings.", "20 : The molded body according to claim 17 , wherein the tube comprises holding pins to fix the tube within a mold.", "21 : The molded body according to claim 17 , wherein the polymeric foam is a foam selected from the group consisting of thermoplastic polymer, thermoplastic elastomer, polyurethane, polyamide, polyolefin, polyethylene, polypropylene, polystyrene, and mixtures thereof.", "22 : The molded body according to claim 17 , wherein the element (A) and/or element (B) is a thermoplastic elastomer and is selected from the group consisting of thermoplastic polyurethanes (TPU), thermoplastic polyamides (TPA), thermoplastic polyetheresters (TPC), thermoplastic polyesteresters (TPC), thermoplastic vulcanizates (TPV), thermoplastic polyolefins (TPU), thermoplastic styrenic elastomers (IPS), and mixtures thereof.", "23 : The molded body according to claim 17 , wherein the at least one peripheral foam layer comprises foamed granules.", "24 : The molded body according to claim 23 , wherein the at least one peripheral foam layer is a matrix in which the foamed granules are at least partly embedded.", "i. providing the tube, which is manufactured by 3D printing or injection molding, ii. providing the at least one peripheral foam layer, and iii. composing the elements of (i) and (ii), wherein the tube comprises holding pins to fix the gibe and the at least one peripheral foam layer together within a mold.", "26 : The process according to claim 25 , wherein a method in (iii) is selected from the group consisting of steam chest molding, radio frequency (RF) molding, thermal molding, molding with pressure, and combinations thereof.", "27 : A molded body, obtained by the process according to claim 25 .", "the molded body according to"], "bibtex": "@patent{20240075771,\n    title = {CONSTRUCTION OF A MOLDED BODY FOR NON-PNEUMATIC TIRES},\n    number = {20240075771},\n    year = {2024},\n    note = {File: US20240075771A1-20240307.XML}\n    }", "classification": "B60C710FI"}, {"title": "A STEEL CORD FOR RUBBER REINFORCEMENT", "doc_number": "20240075772", "filename": "US20240075772A1-20240307.XML", "abstract": "The invention is relating to a steel cord for rubber reinforcement. The steel cord has a construction comprising an outer layer and an inner strand surrounded by and adjacent to the outer layer, the inner strand comprises at least one steel filament with a number of N 1 and an average diameter of d 1 expressed in mm, the outer layer comprises steel filaments with a number of N 2 and an average diameter of d 2 expressed in mm, the inner strand has a torque T 1 and the outer layer has a torque T 2 , the relation between T 1 and T 2 are defined. By doing this, the tip rise problem of the rubber ply reinforced by steel cords is reduced.", "detailed_description": [""], "claims": ["1 - 14 . (canceled)", "wherein, D RT G is 80000 N/mm and the absolute value of RT", "16 . The steel cord as claimed in claim 15 , wherein T 1 and T 2 satisfy, |T 1 +T 2 |<50.", "17 . The steel cord as claimed in claim 16 , wherein T 1 and T 2 satisfy, T 1 +T 2 |<40.", "18 . The steel cord as claimed in claim 15 , wherein the absolute value of RT 1 is no less than 0.1 turns per meter.", "19 . The steel cord as claimed in claim 15 , wherein the absolute value of RT 2 is no less than 0.05 turns per meter.", "20 . The steel cord as claimed in claim 15 , wherein the absolute value of RT 2 is no less than 0.1 turns per meter.", "21 . The steel cord as claimed in claim 15 , wherein RT 1 and RT 2 satisfy, |RT 1 +RT 2 |<4.", "when N when N when N when N", "and the calculation formula of D when N when N when N when N", "24 . The steel cord as claimed in claim 15 , wherein said inner strand and said outer layer individually have a twist pitch of less than 40 mm.", "25 . The steel cord as claimed in claim 15 , wherein each steel filament of said steel cord has a tensile strength TS satisfying, TS≥4000-2000xd, d is the diameter of the individual steel filament.", "26 . The steel cord as claimed in claim 25 , wherein TS≥4100-2000xd.", "27 . The steel cord as claimed in claim 15 , wherein said steel cord has a construction of 1+3, 1+4, 1+5, 1+6, 1+7, 2+2, 2+3, 2+4, 2+5, 2+5 cc, 2+6, 2+7, 2+7 cc, 2+8, 3+2, 3+3, 3+6, 3+8, 3+8 cc, 3+9, 3+9 cc, 4+3, 4+6, 1+3+8, 1+4+8 cc, 1+4+9, 1+5+10, 1+5+10 cc, 1+6+11, 1+6+12, 1+6+12 cc, 2+5+10, 2+6+12, 3+8+13, 3+9+15 or 4+10+16.", "28 . A tire comprising at least one belt layer, at least one carcass layer, at least one tread layer and a pair of bead portions, wherein said belt layer and/or said carcass layer comprises at least one steel cord as claimed in claim 15 ."], "bibtex": "@patent{20240075772,\n    title = {A STEEL CORD FOR RUBBER REINFORCEMENT},\n    number = {20240075772},\n    year = {2024},\n    note = {File: US20240075772A1-20240307.XML}\n    }", "classification": "B60C920FI"}, {"title": "TYRE CHANGING MACHINE AND METHOD FOR USING A TYRE CHANGING MACHINE", "doc_number": "20240075773", "filename": "US20240075773A1-20240307.XML", "abstract": "A tyre changing machine ( 100 ) comprises: a wheel-holder unit ( 200 ); a frame ( 400 ); a bead breaker unit ( 300 ) including a bead breaking arm ( 301 ) articulated to the frame ( 400 ) to rotate about a vertical axis (Y), a bead breaker tool ( 302 ) and a bead breaker actuator ( 303 ) to move the bead breaker tool ( 302 ) towards and away from a wheel (R); a lifting device ( 500 ), including a lifting arm ( 501 ) and a supporting platform ( 502 ), defining a horizontal surface on which to rest the wheel (R) and connected to the lifting arm ( 501 ) to be movable between a lowered position and a raised position. The lifting device ( 500 ) also comprises a lifting actuator to move the supporting platform ( 502 ) between the raised position and the lowered position, and a box-shaped body ( 600 ) that is operatively coupled to the flank ( 400 b ) of the frame ( 400 ); the lifting actuator is at least partly positioned in the box-shaped body.", "detailed_description": [""], "claims": ["a wheel-holder unit rotatable about a first vertical axis of rotation and configured to support the rim of the wheel from which or to which a respective tyre (P) is to be demounted or mounted; a frame having a front portion and a flank and resting on a floor; a bead breaker unit, mounted on the flank of the frame and connected thereto and including an abutment surface, a bead breaking arm articulated to the frame to rotate about a second vertical axis, a paddle shaped bead breaker tool mounted on the bead breaking arm, a bead breaker actuator, connected to the bead breaking arm to move the bead breaker tool towards and away from the abutment surface, so as to detach the bead of the tyre from an annular edge of the rim of the wheel with the tyre tread resting on a supporting surface at floor level and the sidewall in contact with the abutment surface; a lifting device, including a lifting arm and a supporting platform defining a horizontal supporting surface on which to rest the wheel, the supporting platform being connected to the lifting arm and movable between a lowered position, where it can receive the wheel to be lifted off the floor, and a raised position, where it is lifted to make it easier to place the wheel on the wheel-holder unit, and a lifting actuator, connected to the lifting arm to move the supporting platform between the raised position and the lowered position; a box-shaped body operatively coupled to the flank of the frame, the box-shaped body having a lateral wall defining the abutment surface and internally defining a compartment, wherein the lifting actuator is at least partly positioned in the compartment in the box-shaped body.", "2 . The tyre changing machine according to claim 1 , wherein the lifting arm protrudes from one side of the box-shaped body oriented transversely to the abutment surface, the lifting arm protruding towards a zone in front of the front portion of the frame.", "3 . The tyre changing machine according to claim 1 , wherein the lifting arm is movable in a plane parallel to the abutment surface.", "4 . The tyre changing machine according to claim 1 , wherein the supporting platform is hinged to a first end of the lifting arm to rotate about the first end and wherein the lifting device comprises a connecting rod configured to define, together with the lifting arm, a four-bar linkage for keeping the supporting platform parallel to the floor while it is moving from the raised position to the lowered position and vice versa.", "5 . The tyre changing machine according to claim 1 , wherein the lifting device comprises an auxiliary platform integral with the lifting arm and configured to define an additional supporting surface for the wheel.", "6 . The tyre changing machine according to claim 5 , wherein the lifting actuator is configured to position the lifting arm substantially parallel to the floor and the auxiliary platform juxtaposed with the supporting platform, with the supporting platform at the raised position.", "7 . The tyre changing machine according to claim 5 , wherein the auxiliary platform comprises a guiding portion that defines a ramp sloping towards the supporting platform and configured to make it easier to move the wheel towards the wheel-holder unit.", "8 . The tyre changing machine according to claim 5 , wherein the auxiliary platform comprises a stopping portion oriented transversely to the lifting arm and configured to act as a mechanical stop for the wheel.", "9 . The tyre changing machine according to claim 1 , wherein the lifting actuator is connected to the lifting arm at a hinge point interposed between a first end and a second end of the lifting arm, the lifting arm being pivoted about the hinge point.", "10 . The tyre changing machine according to claim 1 , wherein the bead breaker unit comprises a driving element, mounted on the bead breaking arm and configured to drive the bead breaker actuator, the driving element alternately adopting an advance position, where it drives the bead breaker actuator to move the bead breaker tool towards the abutment surface, and a return position, where it drives the bead breaker actuator to move the bead breaker tool away from the abutment surface.", "11 . The tyre changing machine according to claim 1 , comprising a plurality of control means configured to activate the lifting actuator for lifting or for lowering and to set the wheel-holder unit in rotation.", "12 . The tyre changing machine according to claim 1 , wherein the supporting platform provides a flat surface facing upwards.", "13 . The tyre changing machine according to claim 12 , wherein the flat surface of the supporting platform is oriented horizontally.", "14 . The tyre changing machine according to claim 12 , wherein the flat surface of the supporting platform, in the raised position of the supporting platform, allows the wheel resting thereupon to be pivoted about a vertical axis.", "providing a tyre changing machine for mounting and demounting a tyre to and from a corresponding rim of a vehicle wheel, including: a wheel-holder unit rotatable about a vertical axis of rotation and configured to support the rim of the wheel from which or to which a respective tyre is to be demounted or mounted; a frame having a front portion and a flank; a bead breaker unit, mounted on the flank of the frame and including an abutment surface, a breaker tool movable towards and away from the abutment surface, so as to detach a bead of the tyre from an annular edge of the rim of a wheel with the tyre tread resting on a supporting surface at floor level and a sidewall in contact with the abutment surface; a lifting device, including a lifting arm, a supporting platform defining a horizontal supporting surface on which to rest the wheel, connected to the lifting arm and movable between a lowered position, where it can receive the wheel to be lifted off the floor, and a raised position, where it is lifted to make it easier to place the wheel on the wheel-holder unit, and a lifting actuator, connected to the lifting arm to move the supporting platform between the raised position and the lowered position; bead breaking, with the supporting platform at a lowered position, by moving the bead breaker tool towards the wheel; lifting the wheel, by rolling the wheel along the floor, loading the wheel onto the supporting platform at the lowered position and then lifting the supporting platform, wherein the tyre changing machine also includes a box-shaped body operatively coupled to the flank of the frame, the box-shaped body having a lateral wall defining an abutment surface and internally defining a compartment, wherein the lifting actuator is at least partly positioned in the compartment in the box-shaped body, and in that, in the step of bead breaking, the wheel is abutted with its sidewall against the abutment surface and the bead breaker tool is moved towards the abutment surface.", "positioning the driving element at an advance position, where it drives the bead breaker actuator to move the bead breaker tool towards the abutment surface; positioning the driving element at a return position, where it drives the bead breaker actuator to move the bead breaker tool away from the abutment surface.", "by means of at least one of the plurality of control means, activating the lifting actuator for lifting or lowering; by means of at least one of the plurality of control means, activating the wheel-holder unit to set it in rotation.", "18 . The method according to claim 15 , wherein the supporting platform provides a flat surface facing upwards.", "19 . The method according to claim 18 , wherein is oriented horizontally during in the lowered position of the supporting platform, in the raised position of the supporting platform and during the movement of the supporting platform from the lowered position to the raised position.", "20 . The method according to claim 18 , wherein, when the supporting platform is in the raised position, the wheel supported on flat surface of the supporting platform is pivoted about a vertical axis."], "bibtex": "@patent{20240075773,\n    title = {TYRE CHANGING MACHINE AND METHOD FOR USING A TYRE CHANGING MACHINE},\n    number = {20240075773},\n    year = {2024},\n    note = {File: US20240075773A1-20240307.XML}\n    }", "classification": "B60C2513FI"}, {"title": "TYRE CHANGING MACHINE AND METHOD FOR USING A TYRE CHANGING MACHINE", "doc_number": "20240075774", "filename": "US20240075774A1-20240307.XML", "abstract": "A tyre changing machine ( 100 ) for mounting and demounting a tyre (P) to and from a corresponding rim (C) of a vehicle wheel (R) comprises a wheel-holder unit ( 200 ), a frame ( 400 ) and a bead breaker unit ( 300 ) including an abutment surface (S) and a bead breaking arm ( 301 ) articulated to the frame ( 400 ) to rotate about a second vertical axis (Y). The bead breaker unit ( 300 ) comprises: a bead breaker tool ( 302 ) mounted on the bead breaking arm ( 301 ), a bead breaker actuator ( 303 ), connected to the bead breaking arm ( 301 ) to move the bead breaker tool ( 302 ) towards and away from the abutment surface (S), and a driving element ( 304 ), mounted on the bead breaking arm ( 301 ) and configured to drive the bead breaker actuator ( 303 ), the driving element ( 304 ) alternately adopting an advanced position, a return position and an intermediate position.", "detailed_description": [""], "claims": ["a wheel-holder unit rotatable about a first vertical axis of rotation and configured to support the rim of the wheel from which or to which a respective tyre is to be demounted or mounted; a frame which rests on a floor and which has a front portion and a flank; a bead breaker unit, mounted on the flank of the frame and connected thereto and including: an abutment surface configured to receive the wheel with the tread resting on a supporting surface at floor level and a sidewall abutted against the abutment surface, a bead breaking arm articulated to the frame to rotate about a second vertical axis, a paddle shaped bead breaker tool mounted on the bead breaking arm, a bead breaker actuator connected to the bead breaking arm to move the bead breaker tool towards and away from the abutment surface, so as to detach the bead of the tyre from an annular edge of the rim of the wheel that is in contact with the abutment surface and rests on the supporting surface, and a driving element, mounted on the bead breaking arm and configured to drive the bead breaker actuator, the driving element alternately adopting an advance position, where it drives the bead breaker actuator to move the bead breaker tool towards the abutment surface, and a return position, where it drives the bead breaker actuator to move the bead breaker tool away from the abutment surface, wherein the driving element is also configured to adopt an intermediate position, where it stops driving the bead breaker actuator in order to hold the bead breaking arm still.", "2 . The tyre changing machine according to claim 1 , comprising an elastic return mechanism operating on the driving element to elastically return the driving element to the intermediate position.", "3 . The tyre changing machine according to claim 1 , wherein the driving element comprises a handle grippable by an operator, and a control ring at one end of the handle and rotatable about an axis of rotation, the control ring being rotatable in a first direction corresponding to the advance position and in a second direction, opposite of the first direction, corresponding to the return position.", "4 . The tyre changing machine according to claim 1 , wherein the bead breaker actuator has a first end that is interconnected at a first connecting point inside the frame, and a second end that is connectable to the bead breaking arm at a second, adjustable connecting point so as to define a plurality of connection configurations, corresponding to a plurality of maximum distances between the first connecting point and the second connecting point, the tyre changing machine comprising an adjustment element to switch the bead breaker actuator from one connection configuration to another connection configuration.", "5 . The tyre changing machine according to claim 4 , wherein the adjustment element comprises a coupling pin, configured to define different positions of the first connecting point relative to the second connecting point.", "6 . The tyre changing machine according to claim 1 , wherein the bead breaker tool is configured to rotate about a vertical adjustment axis.", "7 . The tyre changing machine according to claim 1 , wherein the bead breaker tool is configured to rotate about a horizontal adjustment axis.", "8 . The tyre changing machine according to claim 1 , wherein the bead breaker actuator is controlled by a five-way valve with three positions corresponding, respectively, to the advance position, the return position and the intermediate position of the driving element.", "9 . The tyre changing machine according to claim 1 , wherein the bead breaking arm comprises a first stretch extending along an axis and a second stretch that is connected to the first stretch and substantially perpendicular to the first stretch, so as not to interfere with the tyre.", "a lifting arm, a supporting platform, defining a horizontal supporting surface on which to rest the wheel, connected to the lifting arm and movable between a lowered position, where it can receive the wheel (R) to be lifted off the floor, and a raised position, where it is lifted to make it easier to place the wheel on the wheel-holder unit, and a lifting actuator, connected to the lifting arm to move the supporting platform between the raised position and the lowered position.", "11 . The tyre changing machine according to claim 10 , comprising a box-shaped body having a lateral wall defining the abutment surface and internally defining a compartment, wherein the lifting actuator is at least partly positioned in the compartment in the box-shaped body.", "the bead breaker unit includes a nozzle, configured for spraying a lubricant fluid and supported on the bead breaking arm, so that the nozzle can spray the lubricant fluid on a bead of the tyre; the driving element includes a spraying command, connected to the nozzle for commanding the spraying of the lubricant fluid responsive to an activation by the user of the spraying command.", "providing a tyre changing machine for mounting and demounting a tyre to and from a corresponding rim of a vehicle wheel, comprising: a wheel-holder unit rotatable about a first vertical axis of rotation and configured to support the rim of the wheel from which or to which a respective tyre is to be demounted or mounted; a frame having a front portion and a flank; a bead breaker unit, mounted on the flank of the frame and including an abutment surface, configured to receive a sidewall of the wheel with the tread resting on a supporting surface at floor level, a bead breaking arm articulated to the frame to rotate about a second vertical axis, a paddle shaped bead breaker tool mounted on the bead breaking arm, a bead breaker actuator, connected to the bead breaking arm to move the bead breaker tool towards and away from the abutment surface, so as to detach the bead of the tyre from an annular edge of the rim of the wheel that is in contact with the abutment surface, and a driving element, connected to the bead breaking arm and configured to drive the bead breaker actuator; positioning a wheel of a vehicle whose tyre is to be demounted from a corresponding rim; positioning the driving element at an advance position, where it drives the bead breaker actuator to move the bead breaker tool towards the abutment surface; detaching the bead of the tyre of the wheel from the annular edge of the rim of the wheel using the bead breaker tool; positioning the driving element at a return position, where it drives the bead breaker actuator to move the bead breaker tool away from the abutment surface; positioning the driving element at an intermediate position, where it stops driving the bead breaker actuator in order to hold the bead breaking arm still.", "14 . The method according to claim 13 , wherein the driving element comprises, on the bead breaking arm, a handle grippable by an operator, and a control ring at one end of the handle, the method comprising a step of rotating the control ring about an axis of rotation in a first direction corresponding to the advance position and a step of rotating the control ring in a second direction, opposite of the first direction, corresponding to the return position.", "a plurality of control means; a lifting device including a lifting arm and a supporting platform, defining a horizontal surface on which to rest the wheel and connected to the lifting arm; and wherein the method comprises a step of lifting the supporting platform to facilitate placing the wheel on the wheel-holder unit and a step of setting the wheel-holder unit in rotation, these steps being performed by means of one or more of the plurality of control means.", "connecting the second end of the bead breaker actuator to the second connecting point so as to define a connection configuration corresponding to a maximum distance between the first connecting point and the second connecting point; switching the bead breaker actuator from a first connection configuration to a second connection configuration by adjusting the second connecting point using the adjustment element.", "17 . The method according to claim 13 , comprising a lubricating step, wherein a lubricant fluid is sprayed on a bead of the tyre by a nozzle mounted to the bead breaking arm, responsive to an activation of a spraying command included in the driving element, by the user who handles the driving element.", "a wheel-holder unit rotatable about a first vertical axis of rotation and configured to support the rim of the wheel from which or to which a respective tyre is to be demounted or mounted; a frame which rests on a floor and which has a front portion and a flank; a bead breaker unit, mounted on the flank of the frame and connected thereto and including: an abutment surface configured to receive the wheel with the tread resting on a supporting surface at floor level and a sidewall abutted against the abutment surface, a bead breaking arm, articulated to the frame to rotate about a second vertical axis, a paddle shaped bead breaker tool mounted on the bead breaking arm, a bead breaker actuator, connected to the bead breaking arm to move the bead breaking arm towards a first end position, proximal to the abutment surface, and towards a second end position, opposite the first end position and distal from the abutment surface, whereby the bead breaker tool moves towards and away from the abutment surface, respectively, so as to detach the bead of the tyre from an annular edge of the rim of the wheel that is in contact with the abutment surface and rests on the supporting surface, and a driving element, mounted on the bead breaking arm and configured to drive the bead breaker actuator, the driving element being manually commutable among a plurality of working positions, the plurality of working positions including: an advance position, where it drives the bead breaker actuator to move the bead breaker tool towards the abutment surface, an intermediate position, where it stops driving the bead breaker actuator in order to hold the bead breaking arm stationary.", "19 . The tyre changing machine of claim 18 , wherein the driving element is further commutable in a return position, where it drives the bead breaker actuator to move the bead breaker tool away from the abutment surface.", "20 . The tyre changing machine of claim 18 , wherein the driving element comprises a handle grippable by an operator, and a command component, located at the handle, the command component being connected to the driving element for commuting the driving element among the working positions of the plurality of working positions."], "bibtex": "@patent{20240075774,\n    title = {TYRE CHANGING MACHINE AND METHOD FOR USING A TYRE CHANGING MACHINE},\n    number = {20240075774},\n    year = {2024},\n    note = {File: US20240075774A1-20240307.XML}\n    }", "classification": "B60C25138FI"}, {"title": "Trailer Tongue System", "doc_number": "20240075775", "filename": "US20240075775A1-20240307.XML", "abstract": "The trailer tongue system is provided and includes a trailer frame, an arm support assembly secured to the trailer frame, and a trailer connection arm assembly. When the trailer tongue system is ready for deployment, the hydraulic system support activates. The hydraulic system support permits the arm support assembly to pivot between first position and second position depending on whether the user would like to connect or disconnect a trailer from a power vehicle. The arm support assembly enables the trailer arm of the trailer connection arm assembly to be either raised or lowered depending on whether the user would like to connect or disconnect the trailer.", "detailed_description": ["Embodiments of the present invention will be described hereinafter in detail with reference to the attached drawings, wherein like reference numerals refer to the like elements. The present invention may, however, be embodied in many different forms and should not be construed as being limited to the embodiments set forth herein; rather, these embodiments are provided so that the disclosure will be thorough and complete, and will fully convey the concept of the invention to those skilled in the art.", "", "With reference toFIGS.1-8, an exemplary embodiment of a trailer tongue system1according to the invention, is shown and ready for deployment to assist the hooking or unhooking of a trailer coupled to a power vehicle. In an exemplary embodiment shown, the trailer tongue system1, constructed in accordance with the present invention, generally includes the following major components: a trailer frame10, an arm support assembly40secured to the trailer frame10, and a trailer connection arm assembly100.", "", "In the exemplary embodiment, the trailer frame10generally includes the following components: a set of frame side support members12and a frame top covering18. In the exemplary embodiment, the dual set of frame side support members12are plate like. One of ordinary skill in the art would understand the applicant's design of the frame side support members12is not the exclusive embodiment. In the exemplary embodiment, the frame side support members12include two sets of arm support assembly connectors14. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the two sets of arm support assembly connectors14are receivers. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the set of frame side support members12further include a set of hydraulic piston support connectors16as shown inFIG.1. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the hydraulic piston support connectors16are receivers. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment.", "", "In the exemplary embodiment, the frame side support members12further include a set of trailer arm connector passageways22as shown inFIG.4. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the set of frame side support members12further include a set of beam connectors24. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the set of beam connectors24are receivers. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment.", "", "In the exemplary embodiment, the frame top covering18is a u-shaped beam as shown inFIG.7. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the frame top covering18includes a set of frame joining connectors20. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the set of frame joining connectors20are receivers. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the frame joining connectors20are located on the legs of the frame top covering18as shown inFIG.7. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment.", "", "In the exemplary embodiment, the arm support assembly40generally includes the following major components: an upper support arm42, a lower support arm52, and a hydraulic support system62, as shown inFIGS.1and2. In the exemplary embodiment, the upper support arm42generally includes a set of beams46and a support bracket50. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the set of beams46are elongated oval shaped members. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the set of beams46include a set of frame fasteners44. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the frame fasteners44are cylindrical pegs located at parallel points on the upper end of each of the beams46. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the set of beams46further include a set of support arm fasteners48as shown inFIG.5. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the support arm fasteners48are cylindrical pegs located at parallel points on the lower end of each of the beams46. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment.", "", "In the exemplary embodiment, the support bracket50is x-shaped and located between the set of beams46as shown inFIG.6. One of ordinary skill in the art would understand the applicant's design of the support bracket50is not the exclusive embodiment.", "", "In the exemplary embodiment, the lower support arm52generally includes an elongated lower support arm body54. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the elongated lower support arm body54is a rectangular shaped hollow member. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the elongated lower support arm body54further includes a set of support arm receivers60as shown inFIG.4. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the set of support arm receivers60are located in the upper region of the elongated lower support arm body54at parallel points as shown inFIG.1. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the elongated lower support arm body54further includes a set of trailer arm connectors58as shown inFIG.2. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. The trailer arm connectors58are cylindrical pegs located at parallel points on the lower region of the elongated lower support arm body54. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment.", "", "In the exemplary embodiment, the elongated lower support arm body54of the lower support arm52further includes an hydraulic slot receiver56as shown inFIG.2. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the hydraulic slot receiver56is an opening for a lower hydraulic support structure70of the hydraulic support system62. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the hydraulic slot receiver securing flap57is fixed above the slot receiver56as shown inFIG.1. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment.", "", "In the exemplary embodiment, the hydraulic support system62generally includes a hydraulic piston64, an upper hydraulic support structure68and the lower hydraulic support structure70as shown inFIG.2. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the hydraulic piston64is a standard piston. One of ordinary skill in the art would understand the normal components of the hydraulic piston64and applicant's design is not the exclusive embodiment. In the exemplary embodiment, the hydraulic piston64is located within the trailer frame10as shown inFIG.2. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the upper hydraulic support structure68is an elongated cylindrical member. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the upper hydraulic support structure68is fixed to the upper region of the hydraulic piston64as shown inFIG.3. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the upper hydraulic support structure68further includes a set of insertion pieces69located at each end of the upper hydraulic support structure68to secure the upper hydraulic support structure68to one of the frame side support members12. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the insertion pieces69are cylindrical pegs. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment.", "", "In the exemplary embodiment, the lower hydraulic support structure70is a hollow cylindrical rod which fixes to the lower region of the hydraulic piston64. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the lower hydraulic support structure70further includes a receiving passageway71extending the length of the lower hydraulic support structure70in the longitudinal direction. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment.", "", "In the exemplary embodiment, the trailer connection arm assembly100generally includes the following major components: a trailer arm102, a mounting plate112and a hitch receiver116as shown inFIG.3. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the trailer arm102is a v-shaped elongated member as visible inFIG.1. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the trailer arm102includes a set of middle trailer connection arm fastener receivers104located in the central region of the trailer arm102. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment.", "", "In the exemplary embodiment, the trailer arm102further includes a set of upper trailer connection arm fastener receivers106as shown inFIG.5. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the set of upper trailer connection arm fastener receivers106are located at upper ends of the trailer arm102towards the trailer frame10as shown inFIG.3. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the trailer arm102further includes a trailer arm bracket108as shown inFIG.3. The trailer arm bracket108is a triangular shaped member. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the trailer arm bracket108is located on the bottom portion of the trailer arm102, opposite a protector flap110as shown inFIG.6. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment.", "", "In the exemplary embodiment, the trailer arm102further includes the protector flap110. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the protector flap110is a plate-like trapezoidal member as shown inFIG.1. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the protector flap110is located on the top portion of the trailer arm102, opposite the trailer arm bracket108. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment.", "", "In the exemplary embodiment, the mounting plate112is a u-shaped elongated member. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the mounting plate112further includes a plurality of fastener receiving passages114as shown inFIG.5. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the plurality of fastener receiving passages114are threaded and located on the legs of the mounting plate112. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment.", "", "In the exemplary embodiment, the hitch receiver116is a standard hitch receiver. One of ordinary skill in the art would understand the components of a hitch receiver116and the applicant's design is not the exclusive embodiment.", "", "In the exemplary embodiment, the trailer tongue system1is generally constructed of the following major components: a trailer frame10, an arm support assembly40secured to the frame, and a trailer connection arm assembly100.", "", "In the exemplary embodiment, the hitch receiver116of the trailer connection arm assembly100is fastened to the mounting plate112by fasteners118being inserted into the plurality of fastener receiving passages114as shown inFIG.1. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the mounting plate112of the trailer connection arm assembly100is secured to the front face of the trailer arm102and one edge of the trailer arm bracket108as shown inFIG.3. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. Moreover, the trailer arm bracket108is fixed to both the back face of the mounting plate112and the bottom face of the trailer arm102as shown inFIG.3. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the protector flap110is attached to the top face of the trailer arm102, near the mounting plate112as shown inFIG.6. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment.", "", "In the exemplary embodiment, the trailer arm102is attached to the frame side support members12by aligning the trailer arm connector passageways22and the upper trailer connection arm fastener receivers106. Further, inserting a fastener120there through for a secure connection as shown inFIG.6. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the elongated lower support arm body54of the lower support arm52is attached to the trailer arm102by inserting the trailer arm connectors58into the middle trailer connection arm fastener receivers104as shown inFIG.2. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment.", "", "In the exemplary, the elongated lower support arm body54is attached to the upper support arm42by inserting the support arm fasteners48into the support arm receivers60as shown inFIG.7. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the support bracket50of the upper support arm42is fixed to the set of beams46at four end points of the support bracket50as shown inFIG.1. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. Further, one of ordinary skill in the art would understand there is more than one way to attach the support bracket50to the set of beams46. In the exemplary embodiment, the set of beams46are connected to the frame side support members12by inserting the frame fasteners44of the set of beams46into the set of beam connectors24as shown inFIG.6. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment.", "", "In the exemplary embodiment, the hydraulic piston64of the hydraulic support system62is connected to the lower support arm52by inserting the lower hydraulic support structure70inside the hydraulic slot receiver56of the lower support arm52as shown inFIG.2. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In an alternative view, the hydraulic piston64of the hydraulic support system62is connected to the lower support arm52by fixing the lower hydraulic support structure70directly to the head of the elongated lower support arm body54as shown inFIG.6. In the exemplary embodiment, the hydraulic piston64of the hydraulic support system62is connected to the trailer frame10by inserting the insertion pieces69of the upper hydraulic support structure68into the hydraulic piston support connectors16of the frame side support members12as shown inFIG.6. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment.", "", "In the exemplary embodiment, the frame top covering18is connected to the frame side support members12by inserting a fastener28through both sets of arm support assembly connectors14of the trailer frame10, and the set of frame joining connectors20of the frame top covering18as shown inFIG.5.", "", "In the exemplary embodiment, in order for the trailer tongue system1to be engaged, the hydraulic support system62must be activated. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, in a first position, when using the trailer tongue system1to hook-up a trailer to a power vehicle, the arm support assembly40is pivoted outward while the hydraulic piston64is in an extended position as shown inFIG.2. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment. In the exemplary embodiment, the upper support arm42is rotated clockwise along the axis of the trailer frame10while the trailer connection arm assembly100is rotated counterclockwise along the axis of the trailer frame10in order to couple the hitch receiver116with the hook-up connector of the desired trailer. In the exemplary embodiment, in a second position, when using the trailer tongue system1to un-hook a trailer, the arm support assembly40is pivoted inward while the hydraulic piston64is in the retracted position as shown inFIG.6. The upper support arm42is rotated counterclockwise along the axis of the trailer frame10while the trailer connection arm assembly100is rotated clockwise along the axis of the trailer frame10in order to raise the trailer arm102and release the hitch receiver116from the hook-up connector of the trailer. One of ordinary skill in the art would understand the applicant's design is not the exclusive embodiment.", "", "It will be understood that changes in the details, materials, steps and arrangements of parts which have been described and illustrated to explain the nature of the invention will occur to and may be made by those skilled in the art upon a reading of this disclosure within the principles and scope of the invention. The foregoing description illustrated the preferred embodiment of the invention; however, concepts, as based upon the description, may be employed in other embodiments without departing from the scope of the invention."], "claims": ["a trailer frame having a set of frame side support members connected to a frame top covering; an arm support assembly having: an upper support arm connected to the trailer frame; a lower support arm connected to both the upper support arm and a trailer arm; a hydraulic support system permitting the arm support assembly to pivot; and a trailer connection arm assembly connected to the lower support arm, wherein the trailer arm can be raised or lowered by the hydraulic support system for coupling with a trailer of a power vehicle.", "2 . The trailer tongue system of claim 1 , wherein the frame side support members are plate like.", "3 . The trailer tongue system of claim 2 , wherein the frame side support members include two sets of arm support assembly connectors.", "4 . The trailer tongue system of claim 3 , wherein the set of frame side support members further include a set of hydraulic piston support connectors.", "5 . The trailer tongue system of claim 4 , wherein the frame side support members further include a set of trailer arm connectors.", "6 . The trailer tongue system of claim 5 , wherein the set of frame side support members further include a set of beam connectors.", "7 . The trailer tongue system of claim 6 , wherein the frame top covering is a u-shaped beam.", "8 . The trailer tongue system of claim 7 , wherein the frame top covering includes a set of frame joining connectors located on a set of legs of the frame top covering.", "9 . The trailer tongue system of claim 8 , wherein the upper support arm includes a set of beams and a support bracket.", "10 . The trailer tongue system of claim 9 , wherein the set of beams include a set of frame fasteners and a set of support arm fasteners.", "11 . The trailer tongue system of claim 10 , wherein the support bracket is x-shaped and located between the set of beams.", "12 . The trailer tongue system of claim 11 , wherein the lower support arm includes an elongated lower support arm body.", "13 . The trailer tongue system of claim 12 , wherein the elongated lower support arm body further includes a set of support arm receivers, and a hydraulic slot receiver.", "14 . The trailer tongue system of claim 13 , wherein the hydraulic support system includes a hydraulic piston, an upper hydraulic support structure and a lower hydraulic support structure.", "15 . The trailer tongue system of claim 14 , wherein the hydraulic piston is located within the trailer frame.", "16 . The trailer tongue system of claim 15 , wherein the trailer connection arm assembly includes a mounting plate and a hitch receiver.", "17 . The trailer tongue system of claim 16 , wherein in a first position when using the trailer tongue system to hook-up the trailer to the power vehicle, the arm support assembly is pivoted in an outward direction while the hydraulic piston is in an extended position.", "18 . The trailer tongue system of claim 17 , wherein the upper support arm is rotated in a clockwise position along an axis of the trailer frame while the trailer connection arm assembly is rotated in a counterclockwise position along the axis of the trailer frame in order to couple the hitch receiver with a hook-up connector of the trailer.", "19 . The trailer tongue system of claim 18 , wherein in a second position, when using the trailer tongue system to un-hook the trailer, the arm support assembly is pivoted in an inward direction while the hydraulic piston is in a retracted position.", "20 . The trailer tongue system of claim 19 , wherein the upper support arm is rotated in the counterclockwise position along the axis of the trailer frame while the trailer connection arm assembly is rotated in the clockwise position along the axis of the trailer frame in order to raise the trailer arm and release the hitch receiver the from the hook-up connector of the trailer."], "bibtex": "@patent{20240075775,\n    title = {Trailer Tongue System},\n    number = {20240075775},\n    year = {2024},\n    note = {File: US20240075775A1-20240307.XML}\n    }", "classification": "B60D136FI"}, {"title": "HITCH RECEIVER", "doc_number": "20240075776", "filename": "US20240075776A1-20240307.XML", "abstract": "A height adjustable hitch receiver is disclosed and described.", "detailed_description": [""], "claims": ["a mounting portion configured to couple to a vehicle; a receiver portion configured to receive a hitch; a linkage mechanism coupling the mounting portion to the receiver portion and configured to maintain an orientation of the receiver portion along a longitudinal axis; and an actuator configured to move the linkage from a first position to a second position while the linkage mechanism maintains an opening of the receiver portion oriented along a longitudinal axis that is parallel to a longitudinal axis a frame member of the vehicle.", "2 . The height adjustable hitch receiver of claim 1 , wherein the linkage mechanism comprises a plurality of linkages.", "3 . The height adjustable hitch receiver of claim 2 , further comprising a transverse support coupled to the plurality of linkage mechanisms, wherein the receiver portion is supported by the transverse support.", "4 . The height adjustable hitch receiver of claim 2 , wherein the actuator comprises a plurality of actuators, such that at least one actuator is associated with each of the linkage mechanisms.", "5 . The height adjustable hitch receiver of claim 1 , wherein the actuator comprises a linear actuator, a rotary actuator, or a combination thereof.", "6 . The height adjustable hitch receiver of claim 5 , wherein the linear actuator comprises a hydraulic actuator, a pneumatic actuator, or a combination thereof.", "7 . The height adjustable hitch receiver of claim 5 , wherein the linear actuator is coupled to the mounting portion and the linkage mechanism.", "8 . The height adjustable hitch receiver of claim 1 , wherein the actuator comprises an inflatable bladder.", "9 . The height adjustable hitch receiver of claim 8 , further comprising a shock absorber to minimize movement of the receiver portion during transit.", "10 . The height adjustable hitch receiver of claim 1 , wherein the linkage mechanism comprises a four-bar linkage mechanism.", "a support portion; a receiver portion configured to receive a hitch, said receiver portion supported by the support portion and constrained to translational movement by the support portion; and a load measurement device disposed between the support portion and the receiver portion operable to measure a force in a direction of the translational movement, wherein a magnitude of the force measured by the load measurement device substantially equals a magnitude of a downward force on a hitch engaging the receiver portion.", "12 . The load measuring hitch receiver of claim 11 , wherein the support portion comprises a plurality of bearings to constrain the receiver portion to translational movement.", "13 . The load measuring hitch receiver of claim 12 , wherein the receiver portion comprises a channel to receive the plurality of bearings.", "14 . The load measuring hitch receiver of claim 11 , wherein the receiver portion comprises an extension member to interface with the load measurement device.", "15 . The load measuring hitch receiver of claim 14 , wherein the support member comprises a platform to interface with the load measurement device.", "16 . The load measuring hitch receiver of claim 15 , wherein the extension member extends at least partially about the load measurement device and the platform.", "17 . The load measuring hitch receiver of claim 15 , wherein the extension member and an opening of the receiver portion to receive the hitch are disposed on opposite sides of the platform.", "18 . The load measuring hitch receiver of claim 11 , further comprising a display configured to indicate the magnitude of the force on the hitch.", "19 . The load measuring hitch receiver of claim 18 , wherein the display is associated with the support portion.", "20 . The load measuring hitch receiver of claim 11 , further comprising a transmitter to communicate the magnitude of the force on the hitch to a remote display.", "21 . The load measuring hitch receiver of claim 11 , wherein the load measurement device comprises a load cell.", "22 . The load measuring hitch receiver of claim 21 , wherein the load cell comprises a strain gage load cell, a mechanical load cell, a hydraulic load cell, a pneumatic load cell, or a combination thereof.", "a reservoir having a fluid and a piston disposed therein, wherein the piston is configured to affect a pressure of the fluid as a result of the force in the direction of the translational movement; and a pressure sensor in fluid communication with the reservoir.", "obtaining a load measuring hitch receiver having a support portion, a receiver portion configured to receive a hitch, wherein the receiver portion is supported by the support portion and constrained to translational movement by the support portion, and a load measurement device disposed between the support portion and the receiver portion to measure a force in a direction of the translational movement, wherein a magnitude of the force measured by the load measurement device is substantially equal to a magnitude of a downward force on a hitch engaged with the receiver portion; engaging a hitch with the receiver portion; disposing a load on the hitch; and observing the magnitude of the downward force on a display."], "bibtex": "@patent{20240075776,\n    title = {HITCH RECEIVER},\n    number = {20240075776},\n    year = {2024},\n    note = {File: US20240075776A1-20240307.XML}\n    }", "classification": "B60D146FI"}, {"title": "ELECTRICAL CONNECTOR SYSTEMS AND METHODS FOR MOVABLE COMPONENT", "doc_number": "20240075777", "filename": "US20240075777A1-20240307.XML", "abstract": "An electrical connector system for electrically coupling a movable component to a fixed component includes a first connector including a first body and a first door. The first door is movable to expose a first electrical connector disposed within the first body. The electrical connector system includes a second connector including a second body and a second door. The second door is movable to expose a second electrical connector disposed within the second body. The electrical connector system includes an actuator coupled to the second electrical connector. The actuator is configured to move the second electrical connector to couple the second electrical connector to the first electrical connector.", "detailed_description": ["The following detailed description is merely exemplary in nature and is not intended to limit the application and uses. Furthermore, there is no intention to be bound by any expressed or implied theory presented in the preceding introduction, brief summary or the following detailed description. As used herein, the term module refers to any hardware, software, firmware, electronic control component, processing logic, and/or processor device, individually or in any combination, including without limitation: application specific integrated circuit (ASIC), an electronic circuit, a processor (shared, dedicated, or group) and memory that executes one or more software or firmware programs, a combinational logic circuit, and/or other suitable components that provide the described functionality.", "", "Embodiments of the present disclosure may be described herein in terms of functional and/or logical block components and various processing steps. It should be appreciated that such block components may be realized by any number of hardware, software, and/or firmware components configured to perform the specified functions. For example, an embodiment of the present disclosure may employ various integrated circuit components, e.g., memory elements, digital signal processing elements, logic elements, look-up tables, or the like, which may carry out a variety of functions under the control of one or more microprocessors or other control devices. In addition, those skilled in the art will appreciate that embodiments of the present disclosure may be practiced in conjunction with any number of systems, and that the systems described herein is merely exemplary embodiments of the present disclosure.", "", "For the sake of brevity, conventional techniques related to signal processing, data transmission, signaling, control, machine learning models, radar, lidar, image analysis, and other functional aspects of the systems (and the individual operating components of the systems) may not be described in detail herein. Furthermore, the connecting lines shown in the various figures contained herein are intended to represent example functional relationships and/or physical couplings between the various elements. It should be noted that many alternative or additional functional relationships or physical connections may be present in an embodiment of the present disclosure.", "", "As used herein, the term “axial” refers to a direction that is generally parallel to or coincident with an axis of rotation, axis of symmetry, or centerline of a component or components. For example, in a cylinder or disc with a centerline and generally circular ends or opposing faces, the “axial” direction may refer to the direction that generally extends in parallel to the centerline between the opposite ends or faces. In certain instances, the term “axial” may be utilized with respect to components that are not cylindrical (or otherwise radially symmetric). For example, the “axial” direction for a rectangular housing containing a rotating shaft may be viewed as a direction that is generally parallel to or coincident with the rotational axis of the shaft. Furthermore, the term “radially” as used herein may refer to a direction or a relationship of components with respect to a line extending outward from a shared centerline, axis, or similar reference, for example in a plane of a cylinder or disc that is perpendicular to the centerline or axis. In certain instances, components may be viewed as “radially” aligned even though one or both of the components may not be cylindrical (or otherwise radially symmetric). Furthermore, the terms “axial” and “radial” (and any derivatives) may encompass directional relationships that are other than precisely aligned with (e.g., oblique to) the true axial and radial dimensions, provided the relationship is predominantly in the respective nominal axial or radial direction. Also, as used herein, the terms “about” and “substantially” denote within 10% to account for manufacturing tolerances.", "", "With reference toFIG.1, an exemplary electrical connector system100is shown associated with a vehicle10in accordance with various embodiments. As will be discussed, the electrical connector system100enables an electrical connection to be made automatically, or without human input, between a first, fixed component104of the vehicle10, such as a fascia of the vehicle10, and a second, movable component106of the vehicle10, such as a hood of the vehicle10. In addition, while the electrical connector system100is disconnected, electrical connectors132,232associated with the electrical connector system100are protected from dirt, debris, moisture, etc. to ensure that the electrical connectors132,232are not inadvertently damaged while disconnected.", "", "As depicted inFIG.1, the vehicle10also generally includes a chassis12, a body14, front wheels16, and rear wheels18. The body14is arranged on the chassis12and substantially encloses components of the vehicle10. The body14and the chassis12may jointly form a frame. The vehicle wheels16-18are each rotationally coupled to the chassis12near a respective corner of the body14. The vehicle10is depicted in the illustrated embodiment as a battery electric passenger car, but it should be appreciated that any other vehicle, including motorcycles, trucks, sport utility vehicles (SUVs), recreational vehicles (RVs), etc., can also be used.", "", "As shown, the vehicle10generally includes a propulsion system20, a transmission system22, a steering system24, a brake system26, a sensor system28, an actuator system30and at least one controller34. The propulsion system20may, in various embodiments, include an internal combustion engine, an electric machine such as a traction motor, and/or a fuel cell propulsion system. The transmission system22is configured to transmit power from the propulsion system20to the vehicle wheels16-18according to selectable speed ratios. According to various embodiments, the transmission system22may include a step-ratio automatic transmission, a continuously-variable transmission, or other appropriate transmission. The brake system26is configured to provide braking torque to the vehicle wheels16and18. Brake system26may, in various embodiments, include friction brakes, brake by wire, a regenerative braking system such as an electric machine, and/or other appropriate braking systems.", "", "The steering system24influences a position of the vehicle wheels16and/or18. While depicted as including a steering wheel24afor illustrative purposes, in some embodiments contemplated within the scope of the present disclosure, the steering system24may not include a steering wheel.", "", "The sensor system28includes one or more sensing devices40a-40nthat sense observable conditions of the exterior environment and/or the interior environment of the vehicle10. In various embodiments, the sensing devices40a-40ninclude, but are not limited to, radars (e.g., long-range, medium-range-short range), lidars, global positioning systems, optical cameras (e.g., forward facing, 360-degree, rear-facing, side-facing, stereo, etc.), thermal (e.g., infrared) cameras, ultrasonic sensors, odometry sensors (e.g., encoders) and/or other sensors that might be utilized in connection with systems and methods in accordance with the present subject matter. The sensor system28is in communication with the controller34over a communication medium.", "", "The actuator system30includes one or more actuator devices42a-42nthat control one or more vehicle features such as, but not limited to, the propulsion system20, the steering system24, and the brake system26. In various embodiments, the vehicle10may also include interior and/or exterior vehicle features not illustrated inFIG.1, such as various doors, a trunk, and cabin features such as air, music, lighting, touch-screen display components, active safety seat or haptic seat, and the like.", "", "The controller34includes at least one processor44and a computer-readable storage device or media46. The processor44may be any custom-made or commercially available processor, a central processing unit (CPU), a graphics processing unit (GPU), an application specific integrated circuit (ASIC) (e.g., a custom ASIC implementing a neural network), a field programmable gate array (FPGA), an auxiliary processor among several processors associated with the controller34, a semiconductor-based microprocessor (in the form of a microchip or chip set), any combination thereof, or generally any device for executing instructions. The computer readable storage device or media46may include volatile and nonvolatile storage in read-only memory (ROM), random-access memory (RAM), and keep-alive memory (KAM), for example. KAM is a persistent or non-volatile memory that may be used to store various operating variables while the processor44is powered down. The computer-readable storage device or media46may be implemented using any of a number of known memory devices such as PROMs (programmable read-only memory), EPROMs (electrically PROM), EEPROMs (electrically erasable PROM), flash memory, or any other electric, magnetic, optical, or combination memory devices capable of storing data, some of which represent executable instructions, used by the controller34in controlling the electrical connector system100. Although only one controller34is shown inFIG.1, embodiments of the vehicle10can include any number of controllers34that communicate over any suitable communication medium or a combination of communication mediums and that cooperate to process the sensor signals, perform logic, calculations, methods, and/or algorithms, and generate control signals to automatically control features of the electrical connector system100.", "", "In one example, the movable component106is coupled to the fixed component104of the vehicle10with a latch108. In the example of the movable component106as the hood of the vehicle10, the latch108is the hood latch. In this example, the latch108includes a receptacle that captures a striker106a(FIG.11) that protrudes from the movable component106and locks to hold the movable component106fixed relative to the fixed component104. The latch108also includes a latch feedback sensor110, which is in communication with the controller34over a suitable communication media, including, but not limited to, a bus. The latch feedback sensor110observes a state of the latch108. For example, a latched state in which the movable component106is fixed and secured to the fixed component104or an unlatched state in which the movable component106is released and movable relative to the fixed component104. As will be discussed, the controller34outputs one or more control signals to the electrical connector system100based on the state of the latch108.", "", "With additional reference toFIG.2, the electrical connector system100is shown in more detail. The electrical connector system100includes a connector system102. The connector system102in this example is coupled proximate the latch108as the connection of the striker106ato the latch108has tight manufacturing tolerances. The connector system102includes a first connector120, a second connector122and an actuator124. Generally, the first connector120is a mirror image of the second connector122when the first connector120faces the second connector122. As will be discussed, the first connector120is movable relative to the second connector122along a longitudinal axis L that extends through the connector system102.", "", "In one example, with reference toFIG.2A, the first connector120includes a first body130, a first electrical connector132(FIG.3), a first spring134and a first door136. In one example, the first body130is composed of a polymeric material and formed via additive manufacturing. It should be noted that the first body130may be composed of other materials, such as a metal or metal alloy, and formed via other techniques, including, but not limited to, casting, stamping, molding, direct metal laser sintering, etc. The first body130is coupled to the movable component106via adhesives, press-fit, mechanical fasteners, etc. Generally, the first body130is coupled to the movable component106so as to be in proximity to the striker106a(FIG.11). The first body130has a first top surface140opposite a first bottom surface142, a first front end144opposite a first back end146, and a first side148opposite a second side150.", "", "With reference toFIG.2, the first top surface140is substantially cylindrical and is closed about its perimeter to enclose the first body130. The first bottom surface142is coupled to and in contact with the second connector122when the connector system102is coupled together. The first front end144defines a first door opening152, as best shown inFIG.4. The first door opening152is recessed relative to the first front end144. InFIG.4, the first door opening152extends through the first front end144and through the first bottom surface142. As will be discussed, the first door136is positioned within the first door opening152and encloses the first body130when the first connector120is disconnected from the second connector122. The first door opening152is substantially rectangular in this example, however, the first door opening152may have any desired shape that corresponds with the first door136and the first electrical connector132. The first door opening152has a first opening end154spaced a distance D apart from a second opening end156. The second opening end156is defined at the first bottom surface142. The distance D is about 23.4 millimeters (mm) to about 25.4 millimeters (mm). It should be noted, however, that the distance D is substantially directly proportional to a height of the first electrical connector132along the Y-axis. Generally, the distance D is sized to enable a movement of the first door136to expose pins associated with the first electrical connector132. The Y-axis is substantially perpendicular to an X-axis, and substantially perpendicular to a Z-axis. The Y-axis is parallel to the longitudinal axis L. The first door opening152is in communication with or is coupled to a first receptacle158. The first receptacle158extends axially from the first door opening152to the first back end146. With reference toFIG.3, the first receptacle158is substantially a rectangular prism, which extends from the first front end144toward the first back end146along an axis A. The axis A is substantially perpendicular to the longitudinal axis L, and is substantially parallel to the X-axis. The first receptacle158is substantially hollow, and receives the first electrical connector132. Generally, at the first back end146, the first receptacle158defines an opening159to enable an electrical cable or wire coupled to the first electrical connector132to pass through the first connector120. In one example, the first back end146is substantially closed and defines a hole, which enables the electrical cable or wire associated with the first electrical connector132to pass through the first back end146. Generally, as the first electrical connector132is substantially stationary, the cable associated with the first electrical connector132is fixed relative to the first back end146. The first receptacle158is in communication with the first door opening152so that the first door136protects and substantially encloses the first electrical connector132contained within the first receptacle158.", "", "With reference back toFIG.4, the first receptacle158also includes a first alignment pin160. The first alignment pin160cooperates with the second connector122to ensure that the first electrical connector132is aligned properly with the second connector122and a connection is established between the first connector120and the second connector122. In one example, the first alignment pin160is rectangular, and is defined along a wall158aof the first receptacle158. In this example, the first alignment pin160is defined along the wall158athat is at the second side150of the first body130, however, the first alignment pin160may be defined along a wall associated with the first side148. Generally, the first alignment pin160extends outwardly from the wall158a, axially along the axis A (FIG.3), to align the movement of the second connector122into engagement with the first electrical connector132.", "", "With reference toFIG.4, the first body130also defines a first door channel162. The first door channel162is defined from the first bottom surface142at the first door opening152to proximate the first top surface140. The first door channel162is in communication with the first door opening152, and cooperates with the first spring134to guide a movement of the first door136between a first, closed position and a second, opened position. In the first, closed position, the first door136is positioned within the first door opening152and encloses the first electrical connector132. In the second, opened position, the first door136is spaced apart from the first door opening152and positioned within the first door channel162so as to be contained within a first spring housing164(FIG.3) defined between the first door opening152and the first top surface140. In this example, the first door channel162is defined as opposing slots163,163adefined internally on the respective one of the first side148and the second side150and in communication with the first door opening152. The slot163adefined within the second side150includes a door stop163b. The door stop163bencloses the slot163aat the first bottom surface142, and cooperates with a first guide rail165bof the first door136to inhibit the first door136from being inadvertently removed from the first body130. As the door stop163bextends into the slot163a, the first guide rail165breceived within the slot163ahas a reduced length when compared to the first guide rail165aof the first door136. As will be discussed, the door stop163bcontacts the second guide rail265bto move the second door236as the first connector120moves toward the second connector122. The first door channel162guides the first door136from the first bottom surface142into the first spring housing164(FIG.3). The first door channel162on the first side148may be in communication with or substantially coextensive with a channel172of a first guide170. With reference toFIG.3, the first spring housing164is defined between the first receptacle158and the first top surface140. In one example, the first spring housing164is hollow, and substantially cylindrical. The first spring housing164extends in a direction parallel to the longitudinal axis L.", "", "The first side148and the second side150also cooperate to couple the first connector120to the second connector122. In the example of the first connector120, with reference toFIG.6, the first side148includes the first guide170. The first guide170is substantially cylindrical, and extends outwardly from the first side148. The first guide170is substantially parallel to the longitudinal axis L. In one example, with reference toFIG.6, the first guide170is hollow, and defines the channel172. The channel172is in communication with the respective slot163,163a. In this example, the channel172has a first cross-section172aat the first bottom surface142, and tapers to a second cross-section172bat a distance D2apart from the first bottom surface142. The first cross-section172ais substantially conical, and the second cross-section172bis substantially square. By transitioning from a substantially conical cross-section to a substantially square cross-section, the channel172assists in aligning the first connector120with the second connector122and also accommodates manufacturing tolerances between the first connector120and the second connector122. In one example, the distance D2is about 12 millimeters (mm). The distance D2is different, and greater than a distance the first alignment pin160is spaced apart from the first bottom surface142. The first guide170extends for a distance from the first bottom surface142toward the first top surface140such that the channel172is sized to receive a portion of the first door136and a second guide rail274associated with the second connector122. With brief reference toFIG.2, the first guide170extends for a distance D10, which is about two times the distance D and in one example, is different and greater than a distance D1for which a first guide rail174and a first stop surface175extends. The distance D10is sized to enable the first door guide rail165aand a second guide rail274of the second connector122to be received within the first guide170when the first connector120is coupled to the second connector122. For example, the distance D10is about 46.8 millimeters (mm) to about 50.8 millimeters (mm). The distance D1is about 43.9 millimeters (mm) to about 47.9 millimeters (mm). The distance D10is different and greater than the distance D.", "", "With reference toFIG.6, the second side150includes the first guide rail174and the first stop surface175. The first guide rail174is substantially square in cross-section (FIG.5) and has a substantially T-shape. The first guide rail174extends outwardly from the second side150from the first bottom surface142toward the first top surface140, and is substantially parallel to the longitudinal axis L (FIG.2). The first stop surface175extends outwardly from the second side150, and has a uniform surface. The second connector122contacts the first stop surface175when the first connector120is coupled to the second connector122. The first guide rail174directs a movement of the first connector120relative to the second connector122. In one example, with reference toFIG.2, the first guide rail174extends for the distance D. By providing the first guide rail174with the distance D, the distance D ensures that a second door236associated with the second connector122is moved to a second, opened position based on the movement of the first connector120as will be discussed.", "", "With reference toFIG.3, the first electrical connector132is any female electrical connector for use with the vehicle10. For example, the first electrical connector132is a female direct current (DC) power jack electrical connector, which electrically and physically couples with a second electrical connector232, for example, a male DC power jack electrical connector coupled to the second connector122. It should be noted that the female DC power jack electrical connector and the male DC power jack electrical connector are merely an example for the first electrical connector132and the second electrical connector232. The first electrical connector132and the second electrical connector232may comprise a Universal Serial Bus (USB) and a USB port, a group of electrical pins and a receiver, etc. The first electrical connector132is coupled to the first receptacle158so as to be positioned adjacent or proximate the first alignment pin160. Generally, the first electrical connector132is positioned adjacent to the first door136.", "", "With reference back toFIG.3, the first spring134is contained within the first spring housing164. In one example, the first spring134is a confined space conical compression spring, and biases the first door136into the first, closed position. The first spring134seats against an interior surface140aof the first top surface140. A second interior surface176opposite the interior surface140acontains the first spring134within the first spring housing164. An end176aof the second interior surface176also serves to guide the movement of the first door136into the first spring housing164in the second, opened position.", "", "The first door136is movable within the first door channel162to expose the first electrical connector132. The first door136is composed of a non-conductive material, such as a non-conductive polymer-based material, and is additively manufactured, for example. The first door136is substantially square, however, the first door136may have any desired shape. The first door136has a first door end178opposite a second door end180, and a first door side182(FIG.2A) opposite a second door side184(FIG.2A). The first door136also has a first door surface186opposite a second door surface188. The first spring134biases against the first door end178. The second door end180contacts the second connector122when the second connector122is coupled to the first connector120. The first door side182and the second door side184(FIG.2A) are each received in a respective one of the opposing slots163,163aof the first door channel162. In one example, each of the first door side182and the second door side184include a respective first door guide rail165a,165b, which extends axially outward from the first door136from the first door end178toward the second door end180(FIG.2A). The first door guide rails165a,165bare received within the respective one of the opposing slots163,163a. The first guide rail165ais defined along the first door side182, and the first guide rail165bis defined along the second door side184. In this example, the first guide rail165bhas a length that is different and less than the first guide rail165aas the first guide rail165bis received in the slot163a. In other words, the first guide rail165bis spaced a distance apart from the second door end180such that the first guide rail165bis not flush with the second door end180. The first guide rail165bcontacts the door stop163bof the first door channel162to retain the first door136within the first body130when the first connector120is uncoupled from the second connector122. The first door surface186defines an exterior surface of the first body130when the first door136is in the first, closed position. The second door surface188is proximate the first electrical connector132when the first door136is in the first, closed position.", "", "With reference back toFIG.2A, the second connector122includes a second body230, the second electrical connector232(FIG.3), a second spring234and a second door236. In one example, the second body230is composed of a polymeric material and formed via additive manufacturing. It should be noted that the second body230may be composed of other materials, such as a metal or metal alloy, and formed via other techniques, including, but not limited to, casting, stamping, molding, direct metal laser sintering, etc. The second body230is coupled to the fixed component104via adhesives, press-fit, etc. Generally, the second body230is coupled to the fixed component104so as to be in proximity to the latch108(FIG.11). The second body230has a second top surface240opposite a second bottom surface242, a second front end244opposite a second back end246, and a third side248opposite a fourth side250.", "", "With reference toFIG.3, the second bottom surface242is substantially cylindrical and is closed about its perimeter to enclose the second body230. The second top surface240is coupled to and in contact with the first connector120when the connector system102is coupled together. The second front end244defines a second door opening252. The second door opening252is recessed relative to the second front end244. The second door opening252extends through the second front end244and through the second top surface240. As will be discussed, the second door236is positioned within the second door opening252and encloses the second body230when the second connector122is disconnected from the first connector120. The second door opening252is substantially rectangular in this example, however, the second door opening252may have any desired shape that corresponds with the second door236and the second electrical connector232. The second door opening252has a third opening end254spaced the distance D apart from a fourth opening end256. The third opening end254is defined at the second top surface240. The second door opening252is in communication with or is coupled to a second receptacle258. The second receptacle258extends axially from the second door opening252to the second back end246. With reference toFIG.3, the second receptacle258is substantially a rectangular prism, which extends from the second front end244to the second back end246along the axis A. The second receptacle258is substantially hollow, and receives the second electrical connector232. Generally, at the second back end246, the second receptacle258defines a second opening259to enable the actuator124to pass through the second connector122and couple to the second electrical connector232. In one example, the second back end246is substantially closed and defines a hole that enables an electrical cable or wire associated with the second electrical connector232to pass through the second back end246and defines a slot for the actuator124. Generally, as the second electrical connector232is movable, the cable associated with the second electrical connector232has some slack to move with the actuator124without contacting walls of the second receptacle238. The second receptacle258is in communication with the second door opening252so that the second door236protects and substantially encloses the second electrical connector232contained within the second door opening252.", "", "The second body230also includes a second alignment pin260. The second alignment pin260cooperates with the first connector120to ensure that the second electrical connector232is aligned properly with the first connector120and a connection is established between the first connector120and the second connector122. In one example, the second alignment pin260is rectangular, and is defined along a wall276bof a connector housing276. In this example, the second alignment pin260is defined along the wall276bof the connector housing276that is at the fourth side250proximate a wall258aof the second receptacle258, however, the second alignment pin260may be defined along a wall associated with the third side248. Generally, the second alignment pin260extends outwardly from the interior surface276a, axially along the axis A, to align the movement of the second connector122into engagement with the first electrical connector132.", "", "With reference toFIG.8, the second body230also defines a second door channel262. The second door channel262is defined from the second top surface240at the second door opening252to proximate the second bottom surface242. The second door channel262is in communication with the second door opening252, and cooperates with the second spring234to guide a movement of the second door236between a first, closed position and a second, opened position. In the first, closed position, the second door236is positioned within the second door opening252and encloses the second electrical connector232. In the second, opened position, the second door236is spaced apart from the second door opening252and positioned within the second door channel262so as to be contained within a second spring housing264(FIG.3) defined between the second door opening252and the second bottom surface242. In this example, the second door channel262is defined as opposing slots263a,263defined internally on the respective one of the third side248and the fourth side250and in communication with the second door opening252. The slot263adefined within the third side248includes a door stop263b. The door stop263bencloses the slot263aat the second top surface240, and cooperates with the second guide rail265aof the second door236to inhibit the second door236from being inadvertently removed from the second body230. As the door stop263bextends into the slot263a, the second guide rail265areceived within the slot263ahas a reduced length when compared to the second guide rail256bof the second door236. The door stop263bcontacts the first guide rail165ato move the first door136as the first connector120moves toward the second connector122. The second door channel262guides the second door236from the second top surface240into the second spring housing264(FIG.3). The second door channel262on the fourth side250may be in communication with or substantially coextensive with a second channel272of a second guide270. With reference toFIG.3, the second spring housing264is defined between the second receptacle258and the second bottom surface242. In one example, the second spring housing264is hollow, and substantially cylindrical. The second spring housing264extends in a direction parallel to the longitudinal axis L.", "", "The third side248and the fourth side250also cooperate to couple the first connector120to the second connector122. In the example of the second connector122, with reference toFIG.2, the third side248includes the second guide rail274and a second stop surface275. The second guide rail274is substantially square in cross-section and has a substantially T-shape. The second guide rail274extends outwardly from the third side248from the second top surface240toward the second bottom surface242, and is substantially parallel to the longitudinal axis L. The second stop surface275extends outwardly from the third side248, and has a uniform surface. The first connector120contacts the second stop surface275when the first connector120is coupled to the second connector122. The second guide rail274directs a movement of the second connector122relative to the first connector120. In one example, the second guide rail274extends for the distance D. By providing the second guide rail274with the distance D, the distance D ensures that first door136associated with the first connector120is moved to the second, opened position based on the movement of the second connector122as will be discussed.", "", "The fourth side250includes the second guide270. The second guide270is substantially cylindrical, and extends outwardly from the fourth side250. The second guide270is substantially parallel to the longitudinal axis L (FIG.2). In one example, the second guide270is hollow, and defines the second channel272. The second channel272is in communication with the respective slot263a,263. In this example, the second channel272has a third cross-section272aat the second top surface240, and tapers to a fourth cross-section272bat the distance D2apart from the second top surface240. The third cross-section272ais substantially conical, and the fourth cross-section272bis substantially square. By transitioning from a substantially conical cross-section to a substantially square cross-section, the second channel272assists in aligning the first connector120with the second connector122and also accommodates manufacturing tolerances between the first connector120and the second connector122. The distance D2is different, and greater than a distance the second alignment pin260is spaced apart from the second top surface240. The second guide270extends for a distance from the second top surface240toward the second bottom surface242such that the second channel272is sized to receive a portion of the second door236and the first guide rail174associated with the first connector120. The second guide270extends for the distance D10, which is about two times the distance D and in one example, is different and greater than the distance D1for which the second guide rail274and the second stop surface275extends. The distance D10is sized to enable a second door guide rail265band the first guide rail174of the first connector120to be received within the second guide270when the first connector120is coupled to the second connector122.", "", "With reference toFIG.3, the second electrical connector232is any male electrical connector for use with the vehicle10that is compatible with the first electrical connector132. For example, the second electrical connector232is a male direct current (DC) power jack electrical connector, which electrically and physically couples with the first electrical connector132. The second electrical connector232is coupled to the second receptacle258so as to be positioned adjacent or proximate the second alignment pin260. Generally, the second electrical connector232is positioned adjacent to the second door236. In one example, the second electrical connector232is coupled to the connector housing276. The connector housing276is movable or slidable relative to the second receptacle258by the actuator124to electrically couple and uncouple the second electrical connector232from the first electrical connector132. In this example, the connector housing276is a hollow rectangular prism, which surrounds the second electrical connector232. The connector housing276includes an interior surface276a, which is coupled to the second electrical connector232, via welding, adhesives, etc. The wall276bextends upward from the interior surface276a. The connector housing276also includes a flange278. The flange278extends upward and outward from the interior surface276aof the connector housing276to be proximate the second opening259. The flange278may extend above the interior surface276ato facilitate coupling of the actuator124to the connector housing276, if desired. In one example, the flange278may include a post278a(FIG.2A), which engages with a bore124aof the actuator124to couple the actuator124to the connector housing276(FIG.2A). In this example, the second alignment pin260is integrally formed with the connector housing276.", "", "The second spring234is contained within the second spring housing264. In one example, the second spring234is a confined space conical compression spring, and biases the second door236into the first, closed position. The second spring234seats against a third interior surface242aof the second bottom surface242. A fourth interior surface277opposite the interior surface240acontains the second spring234within the second spring housing264. An end277aof the fourth interior surface277also serves to guide the movement of the second door236into the second spring housing264in the second, opened position.", "", "The second door236is movable within the second door channel262to expose the second electrical connector232. The second door236is composed of a non-conductive material, such as a non-conductive polymer-based material, and is additively manufactured, for example. The second door236is substantially square, however, the second door236may have any desired shape. The second door236has a first door end279opposite a second door end280, and a first door side282opposite a second door side284. The second door236also has a first door surface286(FIG.2A) opposite a second door surface288(FIG.2A). The second spring234biases against the second door end280. The first door end279contacts the first connector120when the second connector122is coupled to the first connector120. The first door side282and the second door side284are each received in a respective one of the opposing slots263a,263of the second door channel262. In one example, each of the first door side282and the second door side284include a respective second door guide rail265a,265b, which extends axially outward from the second door236from the second door end280toward the first door end279(FIG.2A). The second door guide rails265a,265bare received within the respective one of the opposing slots263a,263. The second guide rail265ais defined along the first door side282, and the second guide rail265bis defined along the second door side284. In this example, the second guide rail265ahas a length that is different and less than the second guide rail265bas the second guide rail265ais received in the slot263a. In other words, the second guide rail265ais spaced a distance apart from the first door end279such that the second guide rail265ais not flush with the first door end279. The second guide rail265acontacts the door stop263bof the second door channel262to retain the second door236within the second body230when the first connector120is uncoupled from the second connector122. The first door surface286defines an exterior surface of the second body230when the second door236is in the first, closed position. The second door surface288is proximate the second electrical connector232when the second door236is in the first, closed position (FIG.3).", "", "The actuator124is in communication with the controller34over a suitable communication media that facilitates the transfer of data, power, etc., including, but not limited to a bus (FIG.1). With reference toFIG.3, the actuator124is coupled to the flange278of the connector housing276and is controlled by the controller34to move the second electrical connector232into and out of engagement with the first electrical connector132. In one example, the actuator124is a micro linear actuator with position feedback. For example, the actuator124includes, but is not limited to, an L12-P micro linear actuator with position feedback commercially available from Actuonix Motion Devices of Victoria, British Columbia, Canada. The actuator124includes a shaft292, which is coupled to the flange278. An advancement of the shaft292by the controller34moves the second electrical connector232out of the second receptacle258and into engagement with the first electrical connector132. A retraction of the shaft292by the controller34disengages the second electrical connector232from the first electrical connector132, and moves the second electrical connector232back into the second receptacle258to enable the second door236to move to the second, closed position. The actuator124includes a position sensor294. The position sensor294observes a position of the shaft292, and generates sensor signals based on the observation. The position sensor294provides the observed position of the shaft292to the controller34(FIG.1).", "", "For example, as shown in more detail with regard toFIG.9and with continued reference toFIGS.1-8, a dataflow diagram illustrates various embodiments of a control system associated with the electrical connector system100, which may be embedded within the controller34. Various embodiments of the electrical connector system100according to the present disclosure can include any number of sub-modules embedded within the controller34. As can be appreciated, the sub-modules shown inFIG.9can be combined and/or further partitioned to similarly determine whether to extend or retract the actuator124to couple or uncouple the second electrical connector232from the first electrical connector132. Inputs to the electrical connector system100may be received from the latch feedback sensor110(FIG.1), received from the position sensor294(FIG.1), received from other control modules (not shown) associated with the vehicle10, and/or determined/modeled by other sub-modules (not shown) within the controller34. In various embodiments, the electrical connector system100includes a latch monitor module300and an actuator control module302.", "", "The latch monitor module300receives as input latch state data304. The latch state data304is sensor data from the latch feedback sensor110. The latch state data304indicates the state of the latch108. For example, the latch state data304indicates whether the latch108is in the latched state such that the movable component106is coupled to the fixed component104and is fixed relative to the fixed component104; or whether the latch108is in the unlatched state such that the movable component106is released or uncoupled from the fixed component104and is movable relative to the fixed component104. Based on the latch state data304, the latch monitor module300sets latch data306for the actuator control module302. The latch data306is data that indicates that the latch108is in the latched state or in the unlatched state.", "", "The actuator control module302receives as input the latch data306. The actuator control module302also receives as input actuator position data308. The actuator position data308is data from the position sensor294. For example, the actuator position data308is a data of a position of the shaft292(FIG.2) of the actuator124. Based on the latch state of unlatched, the actuator control module302determines the position of the shaft292of the actuator194. If the position of the shaft292is extended, such that the second electrical connector232is physically and electrically coupled to the first electrical connector132, the actuator control module302outputs actuator retract data310. The actuator retract data310is data that includes one or more control signals to the actuator124to retract the shaft292into the second receptacle258to disengage the second electrical connector232from the first electrical connector132. By disengaging the second electrical connector from the first electrical connector132and retracting the shaft292into the second receptacle258, the second spring234biases the second door236into the first, closed position when the movable component106is moved and the first connector120is disengaged from the second connector122. It should be noted that in certain embodiments, the actuator control module302may be responsive to user interface data, such as input to a human-machine interface associated with the vehicle10, to output the actuator retract data310and/or the actuator extend data312. For example, the human-machine interface may include a button for unlatching or unlatching the movable component106, and based on the receipt of the input, the actuator control module302may output the respective one of the actuator retract data310and the actuator extend data312.", "", "Based on the latch state of latched, the actuator control module302determines the position of the shaft292of the actuator194. If the position of the shaft292is retracted, such that the second electrical connector232is physically and electrically coupled to the first electrical connector132, the actuator control module302outputs actuator extend data312. The actuator extend data312is data that includes one or more control signals to the actuator124to extend the shaft292from the second receptacle258to physically and electrically couple the second electrical connector232to the first electrical connector132. This ensures that the electrical connection is established between the first electrical connector132and the second electrical connector232when the movable component106is fixed in position relative to the fixed component104.", "", "Optionally, the actuator control module302may also output actuator status data314. The actuator status data314is data that indicates whether the shaft292of the actuator124is retracted such that the second electrical connector232is disconnected from the first electrical connector132and retained within the second receptacle258; or extended such that the second electrical connector232is electrically and physically coupled to the first electrical connector132. The actuator status data314may be output to other modules associated with the controller34.", "", "Referring now toFIG.10, and with continued reference toFIGS.1-9, a flowchart illustrates a method400that can be performed by the control system of the electrical connector system100ofFIG.1in accordance with the present disclosure. In one example, the method400is performed by the processor44of the controller34. As can be appreciated in light of the disclosure, the order of operation within the method is not limited to the sequential execution as illustrated inFIG.10, but may be performed in one or more varying orders as applicable and in accordance with the present disclosure. In various embodiments, the method400can be scheduled to run based on one or more predetermined events, and/or may run continuously during operation of the vehicle10.", "", "The method begins at402. At404, the method receives as input the latch state data304from the latch feedback sensor110. At406, the method receives as input the actuator position data308from the position sensor294. At408, the method determines whether the state of the latch108is latched. If true, the method proceeds to410. Otherwise, at412, the method determines that the state of the latch108is unlatched and determines whether the shaft292of the actuator124is extended based on the actuator position data308. If the shaft292of the actuator124is extended, such that the second electrical connector232is coupled to the first electrical connector132, at414, the method outputs the actuator retract data310to retract the shaft292of the actuator124. If the shaft292of the actuator124is not extended, the method proceeds to optional416. At416, the method outputs the actuator status data314to indicate the position of the shaft292of the actuator124(retracted or extended). The method ends at418. If at412the shaft292of the actuator124is not extended or is retracted, the method proceeds to416.", "", "At410, the method determines whether the shaft292of the actuator124is extended when the state of the latch108is latched. If true, the method proceeds to416. Otherwise, at420, the method outputs the actuator extend data312to extend the shaft292of the actuator124to engage the second electrical connector232with the first electrical connector132.", "", "Thus, generally, with reference toFIG.11, when the latch108is in the unlatched state such that the striker106ais disengaged or unsecured from the latch108, the movable component106may be positioned relative to the fixed component104such that the first door136and the second door236are biased by the springs134,234into the first, closed positions to enclose the respective first body130and second body230. In the example of the movable component106as the hood of the vehicle10, as the striker106astarts to engage with the latch108, the first bottom surface142, including the door stop163b, of the first body130contacts the second door236and the second top surface240, including the door stop263b, of the second body230contacts the first door136. The first guide rail174contacts the second door guide rail265band enters into the second channel272of the second guide270, and the second guide rail274contacts the first door guide rail165aand enters into the channel172of the first guide170. The continued engagement of the striker106awith the latch108causes the first body130to move toward the second body230, which advances the guide rails174,274in the guides170,270and moves the doors136,236toward the second, opened positions.", "", "With reference toFIG.12, once the movable component106is advanced toward the fixed component104such that the latch108is engaged with the striker106a, the latch108is in the latched state and the first connector120is coupled to the second connector122. With the first connector120coupled to the second connector122, the doors136,236are in the second, opened positions and retained in the respective spring housings164,264, as shown inFIG.13. The latch feedback sensor110communicates the latch state data304to the controller34(FIGS.1and9), and based on the latch state data304, the controller34outputs the actuator extend data312to extend the shaft292of the actuator124(FIGS.1and9). As the actuator124extends, the connector housing276is advanced toward the first receptacle158, and the alignment pins160,260guide the connector housing276, and thus, the second electrical connector232into engagement with the first electrical connector132. Generally, the connector housing276is sized to move the second electrical connector232without contacting the first electrical connector132. When the shaft292of the actuator124is extended, such that the second electrical connector232is physically and electrically coupled to the first electrical connector132, the actuator status data314may be transmitted to other modules associated with the controller34(FIG.9).", "", "Thus, the electrical connector system100enables the movable component106to be electrically coupled to the fixed component104without requiring a technician or user to manually disconnect the electrical connectors132,232. In addition, the use of the first connector120and the second connector122including the doors136,236ensures that the electrical connectors132,232remain free of dirt, debris, moisture, etc. as the movable component106moves relative to the fixed component104. In addition, the first connector120and the second connector122also reduce wiring harness complexity, by enabling the electrical connection to be positioned proximate the latch108instead at a pivot point for the hood, for example. In addition, the electrical connector system100may be used to align the movement between the movable component106and the fixed component104. For example, when attaching removable doors to the body14of the vehicle10, the first body130and the second body230may be used to align the doors in the correct position relative to the body14.", "", "In addition, it should be noted that while the electrical connector system100is discussed and illustrated herein as being used to electrically couple a lighted portion of a hood to a fascia of the vehicle10, the electrical connector system100may be employed with various other components associated with the vehicle10to establish an electrical connection between a movable component and a fixed component. For example, the movable component106may be a removable touchscreen or display screen and the fixed component104may be a portion of a dashboard of the vehicle10. As a further example, the movable component106may be a taillamp, and the fixed component104may be a rear fascia, bumper, liftgate, endgate, etc. As another example, the movable component106may be a seat or a door, and the fixed component104may be the body14of the vehicle10. In addition, while the connector system102has been described herein as including the actuator124, which is powered by the controller34, the connector housing276may be coupled to the latch108via a mechanical or manual pull-cable, for example, and a movement of the latch108between the latched and unlatched states may push or pull the cable to extend or retract the second electrical connector232. Furthermore, while the second connector122and the actuator124are illustrated and described herein as being separate from the latch108, the second connector122and the actuator124may be integrated into the latch108or formed with the latch108.", "", "While at least one exemplary embodiment has been presented in the foregoing detailed description, it should be appreciated that a vast number of variations exist. It should also be appreciated that the exemplary embodiment or exemplary embodiments are only examples, and are not intended to limit the scope, applicability, or configuration of the disclosure in any way. Rather, the foregoing detailed description will provide those skilled in the art with a convenient road map for implementing the exemplary embodiment or exemplary embodiments. It should be understood that various changes can be made in the function and arrangement of elements without departing from the scope of the disclosure as set forth in the appended claims and the legal equivalents thereof."], "claims": ["a first connector including a first body and a first door, the first door movable to expose a first electrical connector disposed within the first body; a second connector including a second body and a second door, the second door movable to expose a second electrical connector disposed within the second body; and an actuator coupled to the second electrical connector, the actuator configured to move the second electrical connector to couple the second electrical connector to the first electrical connector.", "2 . The electrical connector system of claim 1 , wherein the first body includes a first guide, the second body includes a second guide rail, and engagement of the first guide of the first body with the second guide rail of the second body is configured to move the first door and the second door to expose the first electrical connector and the second electrical connector.", "3 . The electrical connector system of claim 2 , wherein the first guide defines a channel that receives the second guide rail, and the channel has a first cross-section at a first surface of the first body and transitions to a second cross-section a distance from the first cross-section, the second cross-section different than the first cross-section.", "4 . The electrical connector system of claim 1 , wherein the second body includes a second receptacle, the second electrical connector is coupled to a connector housing disposed within the second receptacle and the connector housing is slidable relative to the second receptacle by the actuator.", "5 . The electrical connector system of claim 4 , wherein the second receptacle is in communication with a second door opening defined in the second body, and the second door is configured to enclose the second receptacle in a first, closed position.", "6 . The electrical connector system of claim 5 , wherein the second body further comprises a second spring housing that is configured to receive a second spring, and the second spring biases the second door into the first, closed position.", "7 . The electrical connector system of claim 4 , wherein the connector housing includes a second alignment pin configured to be received within the first body when the first electrical connector is exposed.", "8 . The electrical connector system of claim 1 , wherein the first body is configured to move the second door to expose the second electrical connector, and the second body is configured to move the first door to expose the first electrical connector.", "9 . The electrical connector system of claim 1 , wherein the first body defines a first receptacle, the first electrical connector is disposed within the first receptacle and is fixed relative to the first receptacle, the first body defines a first door opening in communication with the first receptacle, and the first door is movable relative to the first door opening to expose the first electrical connector.", "10 . The electrical connector system of claim 1 , wherein the first electrical connector is a female electrical connector, the second electrical connector is a male electrical connector, and the movable component and the fixed component are each associated with a vehicle.", "providing a first connector including a first body and a first door coupled to the movable component, the first door movable to expose a first electrical connector disposed within the first body; providing a second connector including a second body and a second door coupled to the fixed component, the second door movable to expose a second electrical connector disposed within the second body; determining, by a processor, whether the movable component is coupled to the fixed component; and based on a determination that the movable component is coupled to the fixed component, outputting one or more control signals to an actuator coupled to the second electrical connector to move the second electrical connector into engagement with the first electrical connector.", "determining whether the movable component is uncoupled from the fixed component; and based on a determination that the movable component is uncoupled from the fixed component, outputting one or more control signals to the actuator coupled to the second electrical connector to retract the second electrical connector to disengage the second electrical connector with the first electrical connector.", "providing a latch on the fixed component configured to receive a striker coupled to the movable component; observing a state of the latch by a latch feedback sensor and generating sensor signals based on the observing; and determining, by the processor, whether the latch is in a latched state in which the movable component is coupled to the fixed component or an unlatched state in which the movable component is uncoupled from the fixed component based on the sensor signals.", "outputting one or more control signals to the actuator to disengage the second electrical connector with the first electrical connector based on the determining the latch is in the unlatched state.", "a first connector configured to be coupled to the movable component, the first connector including a first body and a first door, the first door movable to expose a first electrical connector disposed within the first body, the first body including a first guide disposed on a first side of the first body; a second connector configured to be coupled to the fixed component so as to be aligned with the first connector about a longitudinal axis that extends along the first connector and the second connector, the second connector including a second body and a second door, the second door movable to expose a second electrical connector disposed within the second body, the second body include a second guide rail defined on a second side of the second body and engagement of the first guide of the first body with the second guide rail of the second body is configured to move the first door and the second door to expose the first electrical connector and the second electrical connector; and an actuator coupled to the second electrical connector, the actuator configured to move the second electrical connector to couple the second electrical connector to the first electrical connector when the first electrical connector and the second electrical connector are exposed.", "16 . The electrical connector system of claim 15 , wherein the first guide defines a channel that receives the second guide rail, and the channel has a first cross-section at a first end of the first body and transitions to a second cross-section a distance from the first cross-section, the second cross-section different than the first cross-section.", "17 . The electrical connector system of claim 15 , wherein the second body includes a second receptacle, the second electrical connector is coupled to a connector housing disposed within the second receptacle and the connector housing is slidable relative to the second receptacle by the actuator.", "18 . The electrical connector system of claim 17 , wherein the second receptacle is in communication with a second door opening defined in the second body, and the second door is configured to enclose the second receptacle in a first, closed position.", "19 . The electrical connector system of claim 18 , wherein the second body further comprises a second spring housing that is configured to receive a second spring, and the second spring biases the second door into the first, closed position.", "20 . The electrical connector system of claim 15 , wherein the first body defines a first receptacle, the first electrical connector is disposed within the first receptacle and is fixed relative to the first receptacle, the first body defines a first door opening in communication with the first receptacle, the first door is movable relative to the first door opening to expose the first electrical connector and the movable component and the fixed component are each associated with a vehicle."], "bibtex": "@patent{20240075777,\n    title = {ELECTRICAL CONNECTOR SYSTEMS AND METHODS FOR MOVABLE COMPONENT},\n    number = {20240075777},\n    year = {2024},\n    note = {File: US20240075777A1-20240307.XML}\n    }", "classification": "B60D164FI"}]