[{"title": "APERTURED ARTICLE, INSERTION ARTICLE AND ASSOCIATED SYSTEMS", "doc_number": "20250033406", "filename": "US20250033406A1-20250130.XML", "abstract": "An apertured article, insertion article and associated systems. The apertured article having an aperture, which has an aperture periphery, the aperture periphery having an aperture inner periphery and spaced aperture protrusions that extend radially outwardly from the aperture inner periphery to an aperture outer periphery. The aperture outer periphery is defined by distal edges of the spaced aperture protrusions. The aperture inner periphery is positioned along the circumference of an inner aperture reference circle, the inner aperture reference circle inscribing the aperture periphery, and the aperture outer periphery is positioned along the circumference of an outer aperture reference circle. As viewed along a radial line whose origin is at the center of the inner aperture reference circle, the aperture inner periphery can be positioned along 0.4 to 0.6 of the entire circumference of the inner aperture reference circle. The insertion article can be configured for insertion in the apertured article.", "detailed_description": ["In some embodiments, an article or an associated system described in the present application can solve one or more problems. For example, in some embodiments, when compared to existing devices and techniques that focus on either (i) providing torque transfer or (ii) providing bearing support or acting as a bearing, optionally in the context of an article that is modular or interchangeable with at least one other article, the presently disclosed articles and systems can provide a balance of both (i) providing torque transfer and (ii) providing bearing support capability or acting as a bearing. Moreover, some embodiments of the presently disclosed articles or systems can provide torque transfer without requiring another component to be bolted onto the articles, for example, bolted onto the face of a wheel, thereby avoiding increases the thickness of the articles along at least one dimension, for example, in the direction of an axis of rotation for each article. Further, some embodiments of the presently disclosed articles and systems are compatible with other articles and systems having either a circular exterior cross-section, a polygonal exterior cross-section, for example, a hexagonal exterior cross-section, or both. Additionally, when compared to existing devices and techniques, some embodiments of the presently disclosed articles and systems have desirable attributes, for example, the ability to be used with a live axle, a dead axle, or a combination thereof; the ability to provide torque transfer, provide bearing support, act as a bearing or a combination thereof; ease of use; lower cost than alternatives for the same functionality; ease of manufacture; durability; modularity; interchangeability; combinability; or any combination thereof. For example, in some embodiments of the presently disclosed articles and systems, a single article or a fewer number of different articles can be used to achieve desired functionality, which can reduce expense and time involved in exchanging articles to change functionality. As another example, some embodiments of the presently disclosed articles and systems are easier to use, less expensive, easier to manufacture, less easily damaged, modular, interchangeable, combinable, capable of being used to provide a plurality of desired functionalities, or any combination thereof.", "", "These and other advantageous characteristics of embodiments of the presently disclosed articles and systems will be further evident upon review of the present disclosure.", "", "With reference toFIG.1, an illustrative embodiment of an apertured article0100will now be described with reference toFIG.1. As illustrated, the apertured article0100comprises an article aperture0102.", "", "The article aperture0102comprises an aperture periphery0104, and the aperture periphery0104comprises an aperture inner periphery0106and spaced aperture protrusions0108that extend radially outwardly from the aperture inner periphery0106to an aperture outer periphery0112. The aperture outer periphery0112is defined by distal edges of the spaced aperture protrusions0108.", "", "The aperture inner periphery0106is positioned along the circumference of an inner aperture reference circle0110, the inner aperture reference circle0110inscribing the aperture periphery0104, and the aperture outer periphery0112is positioned along the circumference of an outer aperture reference circle0114.", "", "In some embodiments, as viewed along a radial line0116whose origin is at the center of the inner aperture reference circle0110, the aperture inner periphery0106is positioned along the circumference of the inner aperture reference circle0110for a distance equal to 0.4 to 0.6 of the entire circumference of the inner aperture reference circle0110. The aperture inner periphery0106is deemed to be positioned along the circumference of the inner aperture reference circle0110when the aperture inner periphery0106is spaced from the circumference of the inner aperture reference circle0110by a distance of no more than 0.75 of the length of the radius of the inner aperture reference circle.", "", "In some embodiments, the aperture comprising an aperture axis that is a rotational axis0118of symmetry of the aperture, a reflection axis0120of symmetry of the aperture, or an axis0118along which the aperture is configured to receive an insertion article0800.", "", "In some embodiments, the apertured article0100has an even number of the spaced aperture protrusions0108.", "", "In some embodiments, the article aperture0102comprises at least 3 aperture protrusions and no more than 8 aperture protrusions.", "", "In some embodiments, the aperture inner periphery0106is located on the inner aperture reference circle0110, and optionally the aperture inner periphery0106consists of the portions of the aperture periphery0104located on or within a set distance from the inner aperture reference circle0110the set distance equal to 0.75 of the radius of the inner aperture reference circle0110.", "", "In some embodiments, the aperture inner periphery0106is located on an inner reference polygon that circumscribes the inner aperture reference circle0110. Optionally, the aperture inner periphery0106consists of the portions of the aperture periphery0104located on or within a set distance from the inner aperture reference circle0110the set distance equal to 0.75 of the radius of the inner aperture reference circle0110.", "", "In some embodiments, the inner peripheral surfaces0122of the apertured article0100define the aperture inner periphery0106and are configured to act as a bearing for an insertion article0800positioned in contact with the inner peripheral surfaces0122of the apertured article0100.", "", "In some embodiments, the aperture protrusion surfaces0124of the apertured article0100define the spaced aperture protrusions0108and are configured to provide torque transfer from or to an insertion article0800positioned in contact with the aperture protrusion surfaces0124of the apertured article0100.", "", "In some embodiments, the apertured article0100is configured (i) to receive and act as a bearing for a first insertion article0800configured to engage surfaces of the apertured article0100along the aperture inner periphery0106, the first insertion article0800having a circular exterior cross-section or a polygonal exterior cross-section, and (ii) to receive and transfer torque from or to a second insertion article0800having an exterior cross-section configured to engage surfaces of the apertured article0100along the spaced aperture protrusions0108.", "", "In some embodiments, the apertured article0100is configured to engage and rotate with a live axle around an axis0118of rotation.", "", "In some embodiments, the apertured article0100is configured to engage a dead axle and rotate around an axis0118of rotation oriented along the dead axle.", "", "In some embodiments, the apertured article0100is configured to have a set of edges in a plane (e.g., the plane perpendicular to an axis0118of the apertured article or the article aperture) and all of the edges in the set of edges (e.g., the edges of the article that define the article aperture) are rounded, having a radius of curvature of at least 1.5 mm.", "", "With reference toFIG.80, an illustrative embodiment of an insertion article0800will now be described. As illustrated, the insertion article0800comprises a body0802.", "", "The body0802of the insertion article0800comprises a body exterior periphery0804, and the body exterior periphery0804comprises a body inner exterior periphery0806and spaced body protrusions0808that extend radially outwardly from the body inner exterior periphery0806to a body outer exterior periphery0814. The body outer exterior periphery0814is defined by distal edges of the spaced body protrusions0808.", "", "The body inner exterior periphery0806is positioned along the circumference of an inner body reference circle0810, the inner body reference circle0810inscribing the body exterior periphery0804, and the body outer exterior periphery0814is positioned along the circumference of an outer body reference circle0812.", "", "In some embodiments, as viewed along a radial line whose origin is at the center of the inner body reference circle0810, the body inner exterior periphery0806is positioned along the circumference of the inner body reference circle for a distance equal 0.4 to 0.6 of the entire circumference of the inner body reference circle0810.", "", "In some embodiments, the insertion article0800comprises an apertured article0100, the apertured article0100comprising an article aperture0102. The article aperture0102comprises an aperture periphery0104, and the aperture periphery0104comprises an aperture inner periphery0106and spaced aperture protrusions0108that extend radially outwardly from the aperture inner periphery0106to an aperture outer periphery0112. The aperture outer periphery0112is defined by distal edges of the spaced aperture protrusions0108.", "", "The aperture inner periphery0106is positioned along the circumference of an inner aperture reference circle0110, and the aperture outer periphery0112is positioned along the circumference of an outer aperture reference circle0114.", "", "In some embodiments, the body exterior periphery0804comprises from 3 to 8 body0802protrusions.", "", "In some embodiments, the body inner exterior periphery0806is located on the inner body reference circle0810. Optionally, the body inner exterior periphery0806consists of the portions of the body exterior periphery0804located on or within a set distance from the inner body reference circle0810, the set distance equal to 0.75 of the radius of the inner body reference circle0810.", "", "With reference toFIG.1andFIG.80, an illustrative embodiment of an system will now be described. As illustrated, the system comprises the apertured article0100and the insertion article0800, which is configured to be engaged with the apertured article0100.", "", "The insertion article0800comprises a body0802. The body0802of the insertion article0800comprises a body exterior periphery0804, and the body exterior periphery0804comprises a body inner exterior periphery0806and spaced body protrusions0808that extend radially outwardly from the body inner exterior periphery0806to a body outer exterior periphery0814. The body outer exterior periphery0814is defined by distal edges of the spaced body protrusions0808.", "", "The body inner exterior periphery0806is positioned along the circumference of an inner body reference circle0810, and the body outer exterior periphery0814is positioned along the circumference of an outer body reference circle0812.", "", "In some embodiments, the system comprises a plurality of insertion articles comprising the insertion article0800, and the plurality of insertion articles comprises a first additional insertion article0800and a second additional insertion article0800, the first additional insertion article0800having a circular exterior cross-section and configured to engage surfaces of the apertured article0100along the aperture inner periphery0106, the second additional insertion article0800having a polygonal exterior cross-section and configured to engage surfaces of the apertured article0100along the aperture inner periphery0106.", "", "In some embodiments, the insertion article0800is a second apertured article0100, the second apertured article0100comprising a second article aperture0102.", "", "The second article aperture0102comprises a second aperture periphery0104, and the second aperture periphery0104comprises a second aperture inner periphery0106and second spaced aperture protrusions0108that extend radially outwardly from the second aperture inner periphery0106to a second aperture outer periphery0112.", "", "The second aperture outer periphery0112is defined by second distal edges of the second spaced aperture protrusions0108.", "", "The second aperture inner periphery0106is positioned along the circumference of a second inner aperture reference circle0110, and the second aperture outer periphery0112is positioned along the circumference of a second outer aperture reference circle0114.", "", "In some embodiments, the entire apertured article0100or at least a portion of the apertured article0100is configured to be rotatable around or to rotate around an article axis0118of rotation that passes through the article aperture0102.", "", "In some embodiments, the system comprises at least one other article, and the apertured article0100, the insertion article0800, or any combination thereof is configured to be modular or interchangeable with at least one other article in the system."], "claims": ["an apertured article including a body that defines an aperture passing through from a first side of the body to a second side of the body, wherein: the aperture comprises an outer periphery coinciding with a first reference circle with a first radius and an inner periphery coinciding with a second reference circle with a second radius that is less than the first radius, the inner periphery defines a plurality of inner peripheral surfaces forming elongated arcs that are concentric with the first reference circle and the second reference circle, and the outer periphery defines a plurality of outer peripheral surfaces forming elongated arcs that are concentric with the first reference circle and the second reference circle.", "a splined shaft slidably engaged in the aperture, wherein the splined shaft has a transverse cross-sectional area bounded by a perimeter defining a shape that is substantially similar to a shape formed by the perimeter of the aperture.", "a cylindrical body slidably engaged in the aperture, wherein the cylindrical body has a transverse cross-sectional area bounded by a perimeter defining a circle that has a circumference that engages only the plurality of inner peripheral surfaces.", "the aperture has a perimeter that includes the outer periphery and the inner periphery; the cylindrical body is a bearing defining an aperture shaped to receive a shaft, and the shaft has a transverse cross-sectional area bounded by a perimeter defining a shape that is substantially different from a shape formed by the perimeter of the aperture.", "the aperture has a perimeter that includes the outer periphery and the inner periphery, and the apertured article has a transverse cross-sectional area bounded by a perimeter defining a shape that differs from a shape formed by the perimeter of the aperture.", "6 . The assembly of claim 5 , wherein the apertured article is a wheel.", "7 . The assembly of claim 5 , wherein the apertured article is an arm.", "8 . The assembly of claim 7 , wherein the arm comprises the aperture and at least one other aperture, both having a substantially similar shape.", "a body that defines an aperture passing through from a first side of the body to a second side of the body, wherein: the aperture comprises an outer periphery coinciding with a first reference circle with a first radius and an inner periphery coinciding with a second reference circle with a second radius that is less than the first radius, the inner periphery defines a plurality of inner peripheral surfaces forming elongated arcs that are concentric with the first reference circle and the second reference circle, and the outer periphery defines a plurality of outer peripheral surfaces forming elongated arcs that are concentric with the first reference circle and the second reference circle.", "the aperture has a perimeter that includes the outer periphery and the inner periphery, and the apertured article has a transverse cross-sectional area bounded by a perimeter defining a shape that is substantially different from a shape formed by the perimeter of the aperture.", "11 . The apertured article of claim 10 , wherein the apertured article is a wheel.", "12 . The apertured article of claim 10 , wherein the apertured article is an arm.", "13 . The apertured article of claim 12 , wherein the arm comprises the aperture and at least one other aperture having a substantially similar shape.", "the aperture has a perimeter that includes the outer periphery and the inner periphery, and the aperture is sized to receive a splined shaft slidably engaged in the aperture, the splined shaft has a transverse cross-sectional area bounded by a perimeter defining a shape that is substantially similar to a shape formed by the perimeter of the aperture.", "the aperture is sized to receive a cylindrical body in the aperture, and the cylindrical body has a transverse cross-sectional area bounded by a perimeter defining a circle that has a circumference that engages only the plurality of inner peripheral surfaces.", "an elongated body that has a uniform, transverse cross-sectional area along its length, wherein: the transverse cross-sectional area has an outer perimeter including an outer periphery coinciding with a first reference circle with a first radius and an inner periphery coinciding with a second reference circle with a second radius that is less than the first radius; the inner periphery defines a plurality of inner peripheral surfaces forming elongated arcs that are concentric with the first reference circle and the second reference circle; and the outer periphery defines a plurality of outer peripheral surfaces forming elongated arcs that are concentric with the first reference circle and the second reference circle.", "17 . The insertion article of claim 16 , wherein the outer perimeter is sized to be slidably inserted into an apertured article comprising a body that defines an aperture passing through from a first side of the body to a second side of the body, wherein the aperture has a perimeter defining a shape that is substantially the same as the outer perimeter of the transverse cross-sectional area.", "18 . The insertion article of claim 17 , wherein the apertured article is a wheel.", "19 . The insertion article of claim 17 , wherein the apertured article is an arm."], "bibtex": "@patent{20250033406,\n    title = {APERTURED ARTICLE, INSERTION ARTICLE AND ASSOCIATED SYSTEMS},\n    number = {20250033406},\n    year = {2025},\n    note = {File: US20250033406A1-20250130.XML}\n    }", "classification": "B60B310FI"}, {"title": "AERODYNAMIC BICYCLE RIM AND WHEEL", "doc_number": "20250033407", "filename": "US20250033407A1-20250130.XML", "abstract": "An aerodynamic bicycle rim comprising: a circumferential outer portion comprising a circumferential outer surface, the circumferential outer portion adapted to seat a bicycle tire; a nose; and a set of sidewalls, each sidewall extending radially from the nose of the aerodynamic bicycle rim to a corresponding transition to the circumferential outer surface to form a rim body having a maximum rim body width that is greater than a maximum width of the bicycle tire. The aerodynamic bicycle rim is operable to seat the bicycle tire so that the aerodynamic bicycle rim and the bicycle tire form an asymmetrical cross-sectional shape.", "detailed_description": ["The disclosure and various features and advantageous details thereof are explained more fully with reference to the exemplary, and therefore non-limiting, embodiments illustrated in the accompanying drawings and detailed in the following description. Descriptions of known starting materials and processes may be omitted so as not to unnecessarily obscure the disclosure in detail. It should be understood, however, that the detailed description and the specific examples, while indicating several embodiments, are given by way of illustration only and not by way of limitation. Various substitutions, modifications, additions and/or rearrangements within the spirit and/or scope of the underlying inventive concept will become apparent to those skilled in the art from this disclosure.", "", "As used herein, the terms “comprises,” “comprising,” “includes,” “including,” “has,” “having” or any other variation thereof, are intended to cover a non-exclusive inclusion. For example, a process, product, article, or apparatus that comprises a list of elements is not necessarily limited to only those elements but may include other elements not expressly listed or inherent to such process, product, article, or apparatus. Further, unless expressly stated to the contrary, “or” refers to an inclusive or and not to an exclusive or. For example, a condition A or B is satisfied by any one of the following: A is true (or present) and B is false (or not present), A is false (or not present) and B is true (or present), and both A and B are true (or present).", "", "Additionally, any examples or illustrations given herein are not to be regarded in any way as restrictions on, limits to, or express definitions of, any term or terms with which they are utilized. Instead, these examples or illustrations are to be regarded as being described with respect to one particular embodiment and as illustrative only. Those of ordinary skill in the art will appreciate that any term or terms with which these examples or illustrations are utilized encompass other embodiments as well as implementations and adaptations thereof which may or may not be given therewith or elsewhere in the specification and all such embodiments are intended to be included within the scope of that term or terms. Language designating such non-limiting examples and illustrations includes, but is not limited to: “for example,” “for instance,” “e.g.,” “in one embodiment,” and the like.", "", "Embodiments described herein include bicycle rims and wheels that provide increased aerodynamics compared to previous bicycle rims and wheels. In particular, embodiments described herein provide bicycle rims and wheels that exhibit increased stall angles and reduced drag over a greater range of wind angles in comparison to previous rims and wheels.", "", "Before proceeding, it may be helpful to define several phrases used when discussing the aerodynamics of bicycles. Meteorological (true) wind angle: wind angle experienced by a stationary observer. In this definition, the direction the observer faces is 0 degrees. Meteorological wind is the angle from which the wind is blowing naturally. Apparent wind: air flow felt by the cyclists because of the combination of the meteorological wind and the movement of the cyclist. Apparent wind angle: the angle of the actual flow of air acting on the wheels of a moving cyclist. Because the observer (cyclist) is moving, the apparent wind is the relative angle of the wind in relation to the observer. Yaw angle: the angle of airflow when the wheel orientation front to back is zero degrees. Assuming a moving cyclist, yaw angle is the same as apparent wind angle. Stall angle: the yaw angle at which airflow cannot remain laminar as it both passes over and exits the wheel surface. Laminar airflow is advantageous and increases the aerodynamic efficiency of the wheel and results in faster rider speeds for a given effort. Non-laminar airflow is turbulent and decreases aerodynamic efficiency. Non-laminar airflow slows a rider's speed at a given amount of effort.", "", "FIG.1illustrates the concepts of apparent wind and yaw (apparent wind angle). Apparent wind is the wind experienced by an object from the combination of the object moving through air and meteorological wind blowing on the object. InFIG.1, a cyclist100is riding in direction105at 27 mph and the wind indicated at115is blowing at 10 mph at angle120, in this example −30° to cyclist100(for purposes of this disclosure, negative angles are to the left of the bicycle and positive angles are to the right of the bicycle). The wind felt by cyclist100is a combination of airflow created by the cyclist's movement and the meteorological wind. In this example, the bicycle will encounter an apparent wind122of 36 mph at an apparent wind angle125(also referred to as yaw) of −8°. If the cyclist slows down to 24 mph, but the meteorological wind stays the same, the apparent wind will be 33 mph with an apparent wind angle of −8.7°. This shift in apparent wind angle occurs because the meteorological wind becomes a relatively larger component of the apparent wind.", "", "The velocity of apparent wind can be characterized by EQN 1 as follows:", "", "A=((W*(cos⁡(a)-V)^2+(W*sin⁡(a))^2)^.5[EQN⁢1]", "", "where:W=meteorological wind speeda=angle of meteorological wind to rider where 0=headwind and 180=tailwindV=velocity of the rider", "", "The apparent wind angle or yaw can be characterized by:", "", "b=arccos⁡(W⁢cos⁢a-V(W⁢cos⁢a-V)2+(W⁢sin⁢a)2)", "", "where b=apparent wind angle.", "", "When a bicycle is in motion, airflow over a bicycle's wheels results from the apparent wind. For wheels that are designed to be aerodynamic only in a head wind, the airflow over the wheel will be relatively smooth for angles close to head-on, but become turbulent at greater angles, thereby increasing drag. The angle relative to the wheel at which this transition from attached to disturbed flow occurs is referred to as the stall angle. Apparent winds having a yaw greater than the stall angle result in increased drag.", "", "Embodiments of bicycle wheels described herein can exhibit increased stall angles and therefore maintain aerodynamic efficiency through a greater range of conditions. Various embodiments of bicycle rims described herein can be shaped to seat a tire of a selected size or range of sizes. The rim is shaped so that the rim is wider than the tire at or proximate to the outer edge of the rim. This allows the tire to act as a fairing for the wheel to promote attached airflow along the rim. Additionally, the rim can be shaped so that there is a tangent line that is tangent to the tire and a sidewall of the rim. The tangent line can be tangent to the sidewall at any desired point along the sidewall of the rim including at the widest part of the rim or other point along the sidewall. The widest part of the rim can occur at any point in the rim, including, but not limited to, the center of the cross-section of the rim, the center of the cross-section of the rim and tire, the inner third or outer third of the rim. The wheel with the tire mounted can be asymmetrical or symmetrical about the centerline of the rim and tire. Asymmetry can result, in various embodiments, from the placement of the widest portion of the rim, the nose shape, the sidewall shape or a combination of factors. In other embodiments the wheel can be symmetrical about the centerline of the rim and tire.", "", "In another embodiment, the rim can be shaped so that there is a tangent line tangent to the tire and tangent to the rim at any point on the rim including the sidewalls, the tire seating surface, the transition between the tire seating surface and the sidewall or other point on the rim. The tangent line can be tangent to the rim at the widest part of the rim or another portion of the rim.", "", "Embodiments described herein can be applied to with wire spokes, wheels with a smaller number of aerodynamic spokes and disc wheels. The wheels can be used for any type of bicycle including road bikes, mountain bikes, recumbent bikes or other bikes. Rims can be shaped to have a desired stall angle.", "", "FIG.2is a diagrammatic representation of one embodiment of a bicycle rim200having an annular body extending radially from radially inner edge205to a radially outer edge210. A tire can mount to rim200at a circumferential tire mounting surface215. Sidewall220extends from inner edge205to tire mounting surface215. The transition225from sidewall220to tire mounting surface215can be a square corner, an area of decreased radius compared to the remainder of sidewalls220or have another shape to transition from sidewalls220to circumferential tire mounting surface215. The sidewalls220can form a nose230proximate to inner edge205. Sidewalls220can include any desired features including, but not limited to dimpling, parallel brake surfaces, flat brake surfaces, curved brake surfaces or other features. As discussed in more detail below, rim200can be shaped to increase the stall angle of a bicycle wheel.", "", "FIG.3is a diagrammatic representation of one embodiment of a cross-section of bicycle wheel235comprising rim200and tire240. Tire mounting surface215forms a tire bed250in which tire240seats. Additionally, tire mounting surface215can form a groove255in which stitching of tire240can rest. Rim200can have a depth “d” and be configured to fit tires of a particular size or range of sizes with rim200being wider than the width of tire240at or proximate to the outer edge210. The depth of rim200can be selected as desired. Typical rim depths for non-disc wheels range from 30 mm-110 mm, though other depths can be used.", "", "The shape of rim200can be selected so that there is a tangent line270from tire240to sidewall220. Tangent line270can be tangent to rim200at any point along sidewall220. According to one embodiment, tangent line270can be tangent to sidewall220at the widest part of rim200. For example, the widest part of rim200can occur at i) the radial outer third of rim200, ii) the radial inner third of rim200, iii) the radial centerline of rim200, iv) the radial centerline of the cross section of rim200and tire240, or v) another portion of wheel240.", "", "In the embodiment ofFIG.3, wheel235is symmetrical about axis275but not symmetrical about axis280. This asymmetry results because the widest portion of rim200does not fall near axis280and nose230does not have substantially the same radius as tire240. Consequently, wheel235does not have a substantially elliptical or otherwise symmetrical shape about axis280. In other embodiments, rim200can have a substantially symmetrical shape about both axis275and axis280. Such substantially symmetrical shapes include, but are not limited to, elliptical (oval) and lenticular shapes.", "", "FIG.4is a diagrammatic representation of another embodiment of a cross section of a wheel400comprising rim405and a tire (three different sizes of tires are illustrated, represented at410′,410″ and410′″). Rim405can have a depth “d” from an outer edge470to inner edge415. Tire seating surface420can be shaped to receive the tire in a tire bed425. In one embodiment, tire bed425can include a groove430in which stitching of the tire rests. Tire bed425can be shaped to fit a tire of a selected size or tires in a range of sizes.", "", "Rim405is shaped so that the width of rim405at or proximate to the outermost radial edge470of rim405is wider than the width of the tire (e.g., at a portion of the rim that overlaps the tire bed). Additionally, rim405is shaped so that there is a line tangent to the tire (three different tangent lines are illustrated as tangent lines440′,440″ and440′″ for tires410′,410″ and410′″) and tangent to sidewall435. In one embodiment, the tangent line is tangent to rim405further outward than the widest portion of rim405radially outward from the widest portion of rim405(represented at437). In other embodiments, the tangent line can be tangent at the widest part of rim437. The widest portion of rim405can be at a desired location such as at the outermost radially outer third of rim405(including at the radially outer edge470of rim405) the radial centerline of wheel400(near the transverse centerline of the cross section of the rim and tire indicated at line475), the centerline of rim405, the radially inner third of rim405or other selected location. In the example ofFIG.4, the widest portion of rim405is widest at the radial outer third of rim405. As shown inFIG.4, the widest portion of the rim indicated at437occurs closer to the tire bed than to the centerline475of the cross section of the rim and tire. The widest portion, in this embodiment, also occurs closer to the tire bed than to the centerline of rim405. While the example ofFIG.4has an asymmetrical shape about line475with the widest portion of rim405located away from the centerline475and nose480having a diameter that is smaller than the width of the tire, other embodiments of wheel400can be substantially elliptical or have other symmetrical shapes. Furthermore, inFIG.4, the distance from the tire bed to the nose is greater than the width of the tire and more specifically, in the example ofFIG.4, greater than twice the width of the tire.", "", "FIG.4illustrates tangent lines440′,440″ and440′″ for different sized tires410′,410″ and410′″. As one example, line440′ for tire410′ has an angle of 14° to the lateral centerline, line440″ has an angle of 12° to the lateral centerline and line440″ for tire410′″ has an angle of 9° to the lateral centerline. For a given rim shape, increasing the angle of the tangent line will typically increase the stall angle of wheel400. Consequently, smaller width tires can lead to increased stall angles. It should be noted that the example angles are provided by way of example and not limitation.", "", "In the embodiment ofFIG.4, a majority of the tire is shown as exposed above the outermost portion of rim405. However, the tire is seated deeper than with traditional rims leading to a more unified aerodynamic shape. By way of example, but not limitation, 20-80% of the tire can be seated, leaving 80-20% of the tire exposed past the outermost edge of the rim. Seating the tire more deeply will increase the tangent angle, thereby increasing stall angle. Additionally, seating the tire more deeply can allow more adhesive to be used between the tire and tire bed425and allow tire bed425to provide more support for the tire. This reduces the likelihood of the tire rolling out of bed425during hard cornering, thereby decreasing the likelihood of accidents.", "", "According to one embodiment, the area of sidewall435under the tangent line (shown at465) can have a tapered or curved shape to promote attached flow. In other embodiments, area465may be straight or include a transition to surface420. The area closer to inner side415can have any desired shape. According to one embodiment, sidewalls435can have a curved shape to maintain attached or smooth flow for as long as possible. In such an embodiment, sidewall435can be curved where the bicycle's brake pads contact rim405. This can lead to better braking as the brake pads wear into a curved shape having larger braking area. In other embodiments, sidewalls435can have straight braking surfaces.", "", "FIG.5is a diagrammatic representation of a cross section of another embodiment of a wheel500having rim505and a tire (three different sizes of the tire are represented by tires510′,510″ and510′″). Rim505can be shaped to be wider than the tire at or proximate to the radially outer edge of rim505and to be widest radially closer to the tire bed than the centerline of the cross section and to be widest radially closer to the tire bed than the centerline of rim505. Additionally, rim505can be shaped so that there is a tangent line tangent to the tire and sidewall525(tangent lines from tires510′,510″ and510′″ to sidewall525are shown by520′,520″ and520′″ respectively). The tangent line can be tangent to sidewall525at the widest portion of rim505or at some other point along sidewall525. InFIG.5, for example, the tangent line is tangent to rim505radially outward on sidewall525from the widest part of rim505(represented at line530). As in the previous examples, the widest portion of rim500is located away from transverse centerline535causing rim500to be asymmetrical. In other embodiments, however, rim500can be substantially symmetrical about the transverse centerline. Furthermore, inFIG.5, the distance from the tire bed to the nose is greater than the width of the tire and more specifically, in the example ofFIG.5, greater than three times the width of the tire.", "", "Testing of various embodiments has shown that the stall angle can be at least the tangent angle and the stall angle increases as the depth of the rim depth of the rim increases. As one example, one embodiment of a 60 mm wheel with a 12.5-degree tangent angle may exhibit a stall angle of 15 degrees while a 90 mm rim with a 12.5-degree tangent angle may exhibit a stall angle of 16 degrees. Thus, if tangent lines520′,520″ and520′″ have angles as tangent lines440′,440″ and440′″ ofFIG.4, wheel500will have a higher stall angle than wheel400for each tangent angle. The amount of increase in stall angle due to depth decreases as the tangent angle increases.", "", "FIG.6is a diagrammatic representation of a cross section of another embodiment of a wheel600having a rim605with a tire610seated in tire bed615. Rim605is shaped so that there is tangent line tangent to tire610and the sidewall of rim605. In the embodiment ofFIG.6, the outer edge620of rim605has a width that is approximately equal to the width of tire610(as shown by line625). However, rim605is shaped such that rim605is wider than the width of tire610proximate to edge620at a point that overlaps tire bed615as shown by line630. Thus, even if the very outer edge620of rim605is not wider than the width of tire610, rim605is still wider than tire610near outer edge620. In one embodiment, rim605can be wider than tire610at any point that overlaps tire bed615. In other embodiments, rim605can be wider than tire610within 2 mm or less of the outer edge of rim605.", "", "FIG.7is a diagrammatic representation of a cross section of another embodiment of a wheel700having a rim705with a tire710seated in tire bed712. According to one embodiment, rim705can be shaped so that rim705is wider than the width of tire710proximate to outer edge717and so that there is a tangent line715from tire710to rim705. The tangent line715, in the example ofFIG.7, is tangent to rim705at the radially outer part of sidewall720where the transition725to the circumferential tire seating surface begins. Additionally, in the embodiment ofFIG.7, the widest portion of the rim705, represented by line730, occurs near outer edge717so that the widest area of rim705overlaps tire bed712. While tangent line715is tangent to rim705at the widest part of rim705, tangent line705can be tangent elsewhere on rim705.", "", "FIG.8is a diagrammatic representation of a cross section of another embodiment of a wheel800comprising a rim805seating a tire810. Rim805is wider than wheel810proximate to the outer edge (represented at line807) at a portion of rim805that overlaps the tire bed. Additionally, rim805is widest radially outward of the centerline of rim805(represented at line809) but more inward than the centerline of the cross section of rim805and tire810as a whole (represented at line811). Rim805is also shaped so that there is a tangent line815tangent to tire810and the sidewall820of rim805, the transition830from the sidewall820to the tire seating surface or other point on rim805. Tangent line815can be tangent to rim805at the widest portion of rim805or another portion of rim805.", "", "According to one embodiment, sidewall820includes substantially flat braking surface830. From the perspective ofFIG.8, braking surface830can be vertical or may taper outward so that rim805becomes wider. Sidewall820can also include a curved or otherwise shaped section835. According to one embodiment, braking surface830can extend from transition825to the widest portion of rim805. In other embodiments, sidewall820can bow out after braking surface830. Wheel800, in the embodiment illustrated, is not substantially elliptical as the widest part of rim805is offset from centerline809and nose835is not shaped to match the radius of tire810. In other embodiments, wheel800can be elliptical or have another substantially symmetrical shape about centerline809.", "", "In the previous embodiments, rims are shaped so that there is a tangent line tangent to the tire and the sidewall of the rim. In other embodiments, the rim can be shaped so that there is a tangent line tangent to another point on the rim.FIG.9is a diagrammatic representation of a cross section of one embodiment of a wheel900having a rim905seating a tire910. Rim905can be shaped to be wider than the width of tire910at or proximate to the outer edge of rim905. Additionally, rim905can be shaped so that there is a tangent line915tangent to tire910and rim905. In the embodiment ofFIG.9, tangent line915is tangent at the transition920from sidewall925to tire seating surface930. Transition920is illustrated as being an approximately right-angle corner, but in other embodiments, transition920between the sidewall925and tire seating surface930can have other shapes including, but not limited, curves of relatively small radius as shown in the embodiments ofFIGS.3-6.", "", "Wheel900is asymmetrical about the centerline of the cross-section of rim905and tire910(represented at935) with the widest part of rim905(represented by line940) is offset radially outward from centerline935of the cross section of the rim and tire. Additionally, nose945has a different radius than tire910. Consequently, in the embodiment illustrated, the cross-section of rim905and tire910is not substantially elliptical or otherwise symmetrical about centerline935.", "", "FIGS.3-9illustrate embodiments using tubular tires. However, aerodynamic rims can also be formed to seat clincher tires.FIG.10is a diagrammatic representation of a cross section of wheel1000having a rim1005seating a clincher tire (two size tires are illustrated, represented by1010′ and1010″). Rim1005is wider than the width of the tire radially inward from the outer edge of rim1005. Additionally, rim1005can be shaped so that there is a tangent line (represented at1015′ and1015″ for tires1010′ and1010″, respectively) tangent to rim1005and the tire1010. The tangent line can be tangent to rim1005on sidewall1020, the transition1025between the sidewall and outer surface of rim1005or at another point on rim1005. The tangent line can be tangent to rim1005at the widest portion of rim1005or another portion of rim1005. In one example, the tangent line may be tangent to rim1005further outward on rim1005than the widest portion of rim1005, as illustrated by line1015′, for example.", "", "FIG.11is a diagrammatic representation of a cross section of another embodiment of a wheel1100having a rim1105extending from a nose to a transition1125and having sidewalls (e.g., sidewall1135). Rim1105is configured for a clincher tire1110. Rim1105can include a clinching portion1115for seating clincher tire1110. Clinching portion1115can be integral with or a separate component from the rest of rim1105. According to one embodiment, clinching portion1115can provide parallel braking surfaces (e.g., braking surface1130).", "", "Rim1105is wider than tire1110at or proximate to the outer edge of clinching portion1115. Additionally, rim1105can be shaped so that there is a tangent line1120tangent to tire1110and rim1105. Tangent line1120can be tangent to rim1105at clinching portion1115or elsewhere on rim1105. While the cross-section ofFIG.11is non-elliptical or otherwise asymmetrical about the centerline of the cross section of rim1105and tire1110(represented at1140), other embodiments of rims using clincher tires can be substantially symmetrical or elliptical.", "", "As described above various embodiments of rims can be shaped so that the rim and tire form an asymmetrical cross-section. One factor that can cause the cross-section to be non-elliptical or asymmetrical is the nose shape. In the above embodiments, the nose of each rim is shown as being rounded with a smaller radius than that of the tire. However, any desired nose shape can be used.FIGS.12A-12C, for example, illustrate various embodiments of a nose, including a straight tapered nose1205, a reverse curved nose1210, and a flat nose1215that can cause a cross-section to be non-elliptical. The embodiments ofFIGS.12A-12Care provided by way of example and other embodiments of noses can be used as needed or desired.", "", "Empirical testing has shown reduced drag and increased stall angles for rims according to embodiments of the present disclosure.FIG.13is a graph comparing yaw (x-axis) to drag (y-axis) for various wheels including a 2008 model HED Stinger 6 with a 60 mm depth by HED Cycling Products USA, of Shoreview, MN (represented by line1300) and a 2009 model HED Stinger 60 (represented by line1310). The 2008 Model had a rim that was thinner than the width of the tire proximate to the outer edge and had its maximum width near the transverse axis of the wheel. The 2009 HED Stinger 60 was formed according toFIG.3having a depth “d” of 60 mm. In both cases a 21 mm tire was used.FIG.13illustrates that the 2008 has a stall angle of about 7.5 degrees while the 2009 model exhibits a stall angle of about 15 degrees. Various embodiments of rims can be shaped to have a desired stall angle.", "", "According to one embodiment, a rim shape is selected so that a tire bed is at least large enough to seat a portion of a tire having a selected width and have a rim width larger than the width of the reference circle at or proximate to the outermost edge of the rim. Additionally, the rim shape can be selected so that there is a line tangent to the tire and the rim. In one embodiment, the tangent line can be tangent to the sidewall of the rim or other portion of the rim. The line can be tangent to the sidewall at the widest part of the rim or at another part of the rim. In one embodiment, the widest part of the rim can be located at the radially outer third of the rim up to the outermost edge of the rim, the radially inner third of the rim or at another portion of the rim. The rim shape can be selected so that the wheel forms a non-elliptical shape or, in other embodiments, forms an elliptical shape.", "", "The remainder of the rim can have a tapered shape or other shape known or developed in the art. The rim can be manufactured with a tire bed adapted to receive tubular or clincher tires. According to one embodiment, a rim adapted to receive a clincher tire can be shaped so that the tire bead is frontally flush with the rim.", "", "Additionally, embodiments of rims according to this disclosure can be used with disc wheels, traditional spoke wheels, three spoke wheels or other bicycles wheels known or developed in the art. For example,FIG.14is a diagrammatic representation of one embodiment of a disc wheel1400. Disc wheel1400includes a rim body1405that can be shaped as described above that is connected to or transitions to an inner disc1410.FIG.15is a diagrammatic representation of a wire spoke wheel1500that includes a rim body1505that can be shaped as described above and is coupled to a set of wire spokes1510.", "", "Rims can be used with mountain bike tires or other bicycle tires. The rim can be sized to fit standard size bicycle forks and components or custom forks or components. The rim can be made from any suitable material including, but not limited to, steel, stainless steel, titanium, aluminum, carbon fiber or other materials including metals, composites or polymers and can be formed in a single part or multi-part process. The rim can be solid or filled with a filler material.", "", "In the foregoing specification, the disclosure has been described with reference to specific embodiments. However, as one skilled in the art can appreciate, embodiments of rims and wheels described herein can be modified or otherwise implemented in many ways without departing from the spirit and scope of the disclosure. Accordingly, this description is to be construed as illustrative only and is for the purpose of teaching those skilled in the art the manner of making and using other embodiments. It is to be understood that the forms of the disclosure herein shown and described are to be taken as exemplary embodiments. Equivalent elements or materials may be substituted for those illustrated and described herein. Moreover, certain features of the disclosure may be utilized independently of the use of other features, all as would be apparent to one skilled in the art after having the benefit of this description of the disclosure."], "claims": ["a circumferential outer portion comprising a circumferential outer surface and forming a radially outermost edge; a nose; and a set of sidewalls, each sidewall extending radially from the nose of the aerodynamic bicycle rim to a corresponding transition to the circumferential outer surface to form a rim body having a maximum rim body width at a widest part of the rim body, a second width at a centerline of the rim body, and a rim body depth, each sidewall and corresponding transition forming a continuous outer surface around the rim body from the radially outermost edge to the nose, wherein the continuous outer surface curves laterally inward at the corresponding transition and wherein the continuous outer surface has a curved shape from the widest part of the rim body to the nose; and wherein the widest part of the rim body is spaced away from the centerline of the rim body, and wherein the circumferential outer portion is adapted to seat a bicycle tire that is narrower than the maximum rim body width and narrower than the rim body is deep to form an asymmetrical cross-sectional shape having a centerline that is spaced from the widest part of the rim body.", "2 . The aerodynamic bicycle rim of claim 1 , wherein the asymmetrical cross-sectional shape of the bicycle tire and the rim body is asymmetrical about a widest portion of the asymmetrical cross-sectional shape.", "3 . The aerodynamic bicycle rim of claim 1 , wherein the aerodynamic bicycle rim is adapted to seat the bicycle tire such that there is a tangent line tangent to bicycle tire and tangent to a sidewall of the set of sidewalls, the tangent line having a tangent angle of less than 17 degrees.", "4 . The aerodynamic bicycle rim of claim 3 , wherein the tangent angle is between 8 and 17 degrees.", "5 . The aerodynamic bicycle rim of claim 3 , wherein the widest part of the rim body is located at a radially outer third of the rim body.", "6 . The aerodynamic bicycle rim of claim 5 , wherein the aerodynamic bicycle rim is adapted to seat the bicycle tire such that tangent line is tangent to the sidewall radially outward of the widest part of the rim body.", "7 . The aerodynamic bicycle rim of claim 5 , wherein the circumferential outer portion comprises a circumferential channel to receive the bicycle tire and wherein the aerodynamic bicycle rim is adapted to seat the bicycle tire such that tangent line is tangent to the sidewall at a portion of the sidewall that overlaps the circumferential channel.", "8 . The aerodynamic bicycle rim of claim 7 , wherein the widest part of the rim body overlaps the circumferential channel.", "9 . The aerodynamic bicycle rim of claim 5 , wherein the circumferential outer portion comprises a circumferential channel to receive the bicycle tire and wherein the widest part of the rim body is radially inward of the circumferential channel.", "the corresponding transition is a radiused area at a radially outer end of the corresponding sidewall, the radiused area having a smaller radius than a proximate portion of the corresponding sidewall; and wherein the tangent line is tangent to the sidewall at the corresponding transition.", "a nose; and a set of sidewalls, each sidewall extending radially outward from the nose to form a rim body having a radially outermost edge distal the nose, the rim body having a maximum rim body width at a widest part of the rim body that is spaced radially inward of the radially outermost edge of the rim body and radially outward from a centerline of the rim body, each sidewall transitioning to the radially outermost edge of the rim body at a corresponding radiused transition that curves laterally inward, wherein the rim body increases in width from the radially outermost edge of the rim body to the widest part of the rim body and decreases in width from the widest part of the rim body to the nose; and wherein, the aerodynamic bicycle rim is operable to seat a bicycle tire that is narrower than the maximum rim body width to form an asymmetrical cross-sectional shape in which the widest part of the rim body is spaced from a centerline of the asymmetrical cross-sectional shape and there is a tangent line tangent to the bicycle tire and a sidewall of the set of sidewalls, the tangent line having a tangent angle of less than 17 degrees.", "12 . The aerodynamic bicycle rim of claim 11 , wherein the widest part of the rim body is located at a radially outer third of the rim body.", "13 . The aerodynamic bicycle rim of claim 12 , wherein the tangent line is tangent to the sidewall radially outward of the widest part of the rim body.", "14 . The aerodynamic bicycle rim of claim 12 , wherein the rim body defines a circumferential channel to receive the bicycle tire and wherein the tangent line is tangent to the sidewall at a portion of the sidewall that overlaps the circumferential channel.", "15 . The aerodynamic bicycle rim of claim 14 , wherein the widest part of the rim body overlaps the circumferential channel.", "16 . The aerodynamic bicycle rim of claim 12 , wherein the rim body defines a circumferential channel to receive the bicycle tire and wherein the widest part of the rim body is radially inward of the circumferential channel.", "a nose; and a set of sidewalls, each sidewall extending radially outward from the nose to form a rim body having a radially outermost edge distal the nose, the rim body having a maximum rim body width at a widest part of the rim body that is spaced radially inward of the radially outermost edge of the rim body and radially outward from a centerline of the rim body, wherein the rim body increases in width from the radially outermost edge of the rim body to the widest part of the rim body and decreases in width from the widest part of the rim body to the nose, each sidewall transitioning to the radially outermost edge of the rim body at a corresponding radiused transition that curves laterally inward; and wherein, the aerodynamic bicycle rim is adapted to seat a bicycle tire that is narrower than the maximum rim body width and narrower than the rim body is deep to form an asymmetrical cross-sectional shape in which the widest part of the rim body is spaced from a centerline of the asymmetrical cross-sectional shape.", "18 . The aerodynamic bicycle rim of claim 16 , wherein the widest part of the rim body is located at a radially outer third of the rim body.", "19 . The aerodynamic bicycle rim of claim 18 , wherein the tangent line is tangent to the sidewall radially outward of the widest part of the rim body.", "20 . The aerodynamic bicycle rim of claim 18 , wherein the rim body defines a circumferential channel to receive the bicycle tire and wherein the tangent line is tangent to the sidewall at a portion of the sidewall that overlaps the circumferential channel.", "21 . The aerodynamic bicycle rim of claim 20 , wherein the widest part of the rim body overlaps the circumferential channel.", "22 . The aerodynamic bicycle rim of claim 18 , wherein the rim body defines a circumferential channel to receive the bicycle tire and wherein the widest part of the rim body is radially inward of the circumferential channel."], "bibtex": "@patent{20250033407,\n    title = {AERODYNAMIC BICYCLE RIM AND WHEEL},\n    number = {20250033407},\n    year = {2025},\n    note = {File: US20250033407A1-20250130.XML}\n    }", "classification": "B60B2102FI"}, {"title": "MECHANICAL ASSEMBLY TO DISENGAGE A BICYCLE REAR HUB WITH A PAWL AND RATCHET-RING CLUTCH MECHANISM", "doc_number": "20250033408", "filename": "US20250033408A1-20250130.XML", "abstract": "This invention modifies a common bicycle pawl and ratchet clutch to decouple the pawls from the ratchet so that the wheel is not able to drive the drive-train in a reverse direction, and the hub does not ratchet when freewheeling. The mechanical assembly consists of a cam plate that attaches to a freehub that hosts a plurality of sprung pawls, where the cam plate actuates the pawls as followers, and where the cam plate is also attached to a cylindrical member by a plurality of coiled members through one of their protruding ends, having a static friction against rotation relative to the cylindrical member they coil onto, and the cylindrical member is axially and rotary fixed relative to the all of the parts comprising the assembly.", "detailed_description": ["The selected embodiment of a mechanical assembly to disengage a bicycle rear hub with a pawl and ratchet-ring clutch mechanism, described with the drawings, is provided for illustration only and is not meant to limit the invention as defined by the claims; where it can be susceptible to various changes and modifications without departing from the spirit of the invention.", "", "Referring first toFIG.1, A typical embodiment of a bicycle rear hub is illustrated. The hub is attached to a rim by spokes, and with a tire mounted on the rim, they form the basic elements for a functional rear bicycle wheel that attaches to a bicycle frame.", "", "FIG.2shows the three component groups of an embodiment of a bicycle rear hub with a pawl and ratchet-ring clutch mechanism, separated by their main functions. The main axle1is axially and rotatably fixed to the bicycle frame, and stays stationary where it does not rotate relative to the ground and the bicycle frame. The axle1also serves as the common axis for all parts of the assembly, and its defined by the center line running through the length of the axle1. The hubshell2contains all the components of the hub that are rotatably fixed to the wheel attached to the hub. The hubshell2is rotatably attached to the main axle1by means of bearings so that it is allowed to spin freely on the common axis from the main axle1. The freehub3is where the drive-train of the bicycle attaches to the hub, having a singular or a plurality of cogs or sprockets attached on the exterior surface of the freehub3. The freehub3contains all the components of the hub that are rotatably fixed to the drive-train attached to the hub. The freehub3is rotatably attached to the main axle1by means of bearings so that it is allowed to spin freely on the common axis from the main axle1.", "", "FIGS.3aand3bshows an exploded view of the components of the preferred embodiment of the invention, comprising of a sleeve or cylindrical member4, which receives a single or plurality of coiled members5which are wound in series onto the cylindrical member4along its axial length, which is defined by the center line running through the length of the cylindrical member4, where the coiled members5are supported by the shoulder41of the cylindrical member4from axially sliding further towards the shoulder41end of the cylindrical member4. The coiled members5have a static fiction against rotation relative to the cylindrical member4in both directions. At the ends of the coiled members5furthest from the shoulder41of the cylindrical member4, are protruding extensions51which have a length, an axis being defined by the center line running through the length of the protruding extensions51, and the axis is parallel to the common axis. The protruding extensions51attach to a cam plate6by receiving slots61on the cam plate6, where each receiving slot61corresponds to each protruding extension51of the coiled members5, and these receiving slots61have a length, an axis being defined by the center line running through the length of the receiving slots61, and the axis is in line with the axis of the protruding extensions51. The protruding extensions51run an interference or slide fit onto the receiving slots61, and trap the coiled members5between the shoulder41of the cylindrical member4, and the inner face63of the cam plate, defined by the largest surface of the cam plate6facing the coiled members5and cylindrical member4with its surface plane perpendicular to the common axis. Disposed radially on the inner face63of the cam plate6are a plurality of slotted cams62which interact with the components of the freehub further explained on the next figures.", "", "FIGS.4aand4bshows a partial exploded view of the components of the preferred embodiment of the invention within an embodiment of a bicycle rear hub with a pawl and ratchet-ring clutch mechanism. Where the embodiment of a bicycle rear hub with a pawl and ratchet-ring clutch mechanism operates by having one or a plurality of pawls31, disposed rotationally on the freehub3along its axial length, defined by the center line running through the length of the freehub3, each of the pawls31having a serration or teeth at one end, and a pivot point at the other end, and are sprung by their corresponding springs32, which are also disposed rotationally on the freehub3along its axial length, and the springs32pivot the pawls31to extend their teeth end away from the axial length, so that the pawls31extend until in contact with the ratchet-ring21which is rotatably and axially attached to the hubshell2. This ratchet-ring21has a plurality of serrations or teeth disposed rotationally at the inner surface of the ratchet-ring21along its axial length, defined by the center line running through the length of the ratchet-ring21, and the teeth of the ratchet-ring21engage with the teeth of the pawls31so that in the direction of forward rotation7of the freehub3relative to the hubshell2, there is a wedging interference between the pawls31and the ratchet-ring21so that the freehub3is not able to rotate forwards relative to the hubshell2, with the resultant outcome of the freehub3driving the hubshell2in the direction of forward rotation7relative to the main axle1. In the direction of backwards rotation of the freehub3relative to the hubshell2, the teeth of the pawls31slide on the teeth of the ratchet-ring21by the reverse of the wedging geometry of the pawls31becoming a sloping geometry, so that by every tooth displacement between the pawls31and ratchet-ring21, the pawls31toothed end retracts from the ratchet-ring21, following by one ratchet sound from the springs32repositioning the pawls31toothed end back to the interference position, repeating this sequence for every next tooth displacement, with the resultant outcome of the freehub3being able to rotate in the direction of backwards rotation relative to the hubshell2without driving the hubshell2. The relationship of the pawls31and the ratchet-ring21in this instance is the same to the instance where the hubshell2rotates in the direction of forward rotation7relative to the freehub3and the main axle1. In the instance where the hubshell2rotates in the direction of reverse rotation8relative to the freehub3, the interference between the pawls31and the ratchet-ring21will force the freehub3to rotate in the direction of reverse rotation8together with the hubshell2.", "", "The components of the preferred embodiment of the invention attach to the existing embodiment of a bicycle rear hub with a pawl and ratchet-ring clutch mechanism, by sliding the cylindrical member4that has the coiled members5wound onto the cylindrical member4, onto the main axle1and into the freehub3cavity, so that the cylindrical member4is axially and rotatably fixed to the main axle1from the compression between the bearing components of the hubshell2and freehub3that rest on the main axle1. The cam plate6attaches onto the freehub3by an annular snap joint formed between the freehub3grooved cavity33and the cam plate6cantilever ring protrusion64. This annular snap joint allows the cam plate6to rotate relative to the freehub3at the common axis, but its rotation is limited by the interface between the slotted cams62and the pawls31; where the slotted cams62form a cam-and-follower relation with the pawls31. The protruding extensions51of the coiled members5penetrate the receiving slots61on the cam plate6by interference or sliding fit.", "", "FIG.5ashows the preferred embodiment of the invention assembled on the freehub3portion of an embodiment of the bicycle rear hub, where the proposed invention is positioned in the pawls31released position. In this position, when the freehub3is rotated in the direction of forwards rotation7, the cam plate6is forced to rotate with the freehub3from the interference wedge between the slotted cams62and the pawls31, and cam plate6rotates the coiled members5from the interference between the receiving slots61to the protruding extensions51, overcoming the coiled members5static friction against rotation towards the cylindrical member4, and sliding the coiled members5on the surface of cylindrical member4, which is axially and rotatably fixed from the rest of the components.", "", "FIG.5bshows the preferred embodiment of the invention assembled on the freehub3portion of an embodiment of the bicycle rear hub, where the proposed invention is positioned in the pawls31retracted position. This position is reached from the pawls31released position when the freehub3is rotated in the direction of reverse rotation8. During the initial reverse rotation motion of the freehub3, the cam plate6is prevented from rotating with the freehub3by the static friction of the coiled members5against rotation towards the cylindrical member4, transferred from the protruding extensions51to the receiving slots61, where this static friction was re-introduced during the directional change of the freehub rotation, where momentarily during the directional change, the coiled members5stopped rotating in relation to the cylindrical member4, or if the freehub3was rotatably stationary before initiating the rotation in the direction of reverse rotation8. As the freehub3rotates relative to the cam plate6, the sprung pawls31are forced to retract by following the slotted cams62interference to the sloping geometry of the pawls31until the pawls bottom out in their pivotal travel. Once the pawls31cant retract further, there is still an interference between the slotted cams62and the pawls31preventing further rotation of the freehub3relative to the cam plate6, and the cam plate6starts to rotate together with the freehub3in the direction of reverse rotation8, overcoming the static friction against rotation of the coiled members5towards the cylindrical member4through the interference between the receiving slots61to the protruding extensions51, sliding the coiled members5on the surface of the cylindrical member4.", "", "When the freehub3is rotated in the direction of forwards rotation7, from the pawls31retracted position, the cam plate6is prevented from rotating with the freehub3by the static friction of the coiled members5against rotation towards the cylindrical member4, transferred from the protruding extensions51to the receiving slots61, and as the freehub3rotates relative to the cam plate6, the pawls31are released from the slotted cams62by following and extending through the opening of the slotted cams62aided by the pawls31sprung forces, until reaching the pawls31released position.", "", "FIGS.5aand5billustrate how the proposed invention actuates the pawls31in the freehub3, based on the rotation direction of the freehub3, where the direction of forwards rotation7does not interfere with the function of the embodiment of a bicycle rear hub with a pawl and ratchet-ring clutch mechanism, and the direction of reverse rotation8retracts the pawls31to rotatably decouple the freehub3, with its attached drive-train, from any direction of rotation of the bicycle wheel attached to the rear hub; as well as preventing ratcheting during freewheeling.", "", "FIG.6illustrates various configurations of the embodiment of the coil members, where more than one coiled member and its corresponding protruding extensions and receiving slots are applicable. The coiled members can be coiled in series to allow the protruding extensions reach the receiving slots in an axially level fashion. The use of more coiled members disposed equally apart radially supplements the desired static friction needed to be overcome to initiate the rotation between the coiled members to the cylindrical member.", "", "The invention shown in this embodiment described is not limited by the embodiment, and it should be apparent to those skilled in the art, that there invention is susceptible to changes and modifications without departing from the spirit of the invention, which are defined in the following claims."], "claims": ["a cam plate, wherein the cam plate is a cylindrical end cap rotatably attached at a circular plane surface end of an existing cylindrical pawl carrier member, where this existing cylindrical pawl carrier member has the plurality of pawls radially disposed closest to this circular plane surface end, and the cam plate has overlapping capping extensions in the form of a plurality of slots that cap over this circular plane surface end of the existing cylindrical pawl carrier member along its length, and that the plurality of slots interact with the plurality of pawls of the existing cylindrical pawl carrier member in a cam and follower relation when the cam plate rotates relative to the existing cylindrical pawl carrier member at a common axis, this common axis defined by a center line running along the length of the existing cylindrical pawl carrier member, so that the edges that form the plurality of slots cause an interference to the plurality of pawls to retract them towards the common axis in one direction, and release the interference to the pawls in the opposite direction; wherein each of the plurality of slots correspond to a single of the plurality of pawls from the existing cylindrical pawl carrier member, and a plurality of formed edges comprised from a longest dimension of the plurality of slots have an interference with the plurality of pawls that limits the rotation of the cam plate in relation to the existing cylindrical pawl carrier member at the end of the plurality of pawls movement from the cam and follower interaction between the plurality of slots to the plurality of pawls in any direction of rotation between the cam plate and the existing cylindrical pawl carrier member along the common axis; wherein the cam plate has a hole running through the common axis, and at least one receiving slot forming at the edge of this hole, where the at least one receiving slot has a length, an axis of the at least one receiving slot being defined by a center line running through the length of this at least one receiving slot, and the axis of the at least one receiving slot is parallel to the common axis; a cylindrical sleeve member, wherein the cylindrical sleeve member has a length, an axis of the cylindrical sleeve being defined by a center line running through its length, and the axis of the cylindrical sleeve coincides with the common axis; wherein the cylindrical sleeve member has a raised shoulder at one of its ends, and the cylindrical sleeve member is rotatably fixed to the axis of the cylindrical sleeve, where it partially resides inside a bore at the circular plane surface end of the existing cylindrical pawl carrier member; at least one coiled member, coiled to the cylindrical sleeve member, wherein the at least one coiled member has a friction against rotation over the cylindrical sleeve member, such that the friction is increased in a direction that wraps it more, and the friction is decreased in a direction that unwinds it, and the at least one coiled member is allowed to rotate relative to the cylindrical sleeve member once the friction is overcome in both directions; wherein the at least one coiled member has a protruding extension at one of its ends, with the protruding extension having a length, an axis of the protruding extension being defined by a center line running through the length of the protruding extension, and the axis of the protruding extension is in parallel to the common axis; wherein the protruding extension extends into the at least one receiving slot so that the at least one coiled member is rotatably fixed to the cam plate and is not allowed to rotate relative to the cam plate.", "providing a cam plate rotatably attached to the circular plane surface end of an existing cylindrical pawl carrier member, with overlapping capping extensions forming a plurality of slots that overlap the plurality of pawls of the existing cylindrical pawl carrier member to actuate the plurality of pawls in a cam and follower manner from a rotation of the cam plate relative to the existing cylindrical pawl carrier member, that retracts the plurality of pawls into the existing cylindrical pawl carrier member in one direction and releases the plurality of pawls from its interference with the plurality of slots in the other direction, and the cam plate only rotates a specified degree relative to the existing cylindrical pawl carrier member before an interference between its capping extensions to the pawls prevents further rotation; providing the cam plate and existing cylindrical pawl carrier member rotate relative to a cylindrical sleeve member featuring a raised shoulder, where the cylindrical sleeve member is attached to the cam plate by protruding extensions at one end of a at least one coiled member coiled onto the cylindrical sleeve member and resting against the raised shoulder, and the at least one coiled member has a friction against rotation towards the cylindrical sleeve member in both rotating directions; rotating the existing cylindrical pawl carrier member in any direction relative to the cylindrical sleeve member results in the existing cylindrical pawl carrier member rotating relative to the cam plate, until the interference of the plurality of slots with the plurality of pawls at the end of the specified degree of rotation, stops the existing cylindrical pawl carrier member from rotating relative to the cam plate, where the cam plate forces the at least one coiled member to overcome the friction against rotation towards the cylindrical sleeve member through its attachment to the cam plate from their protruding extensions, so that the cam plate and the at least one coiled member rotate together with the existing cylindrical pawl carrier member relative to the cylindrical sleeve member; Retracting and releasing the plurality of pawls of the existing cylindrical pawl carrier member depending on the rotation of the cam plate relative to the existing cylindrical pawl carrier member."], "bibtex": "@patent{20250033408,\n    title = {MECHANICAL ASSEMBLY TO DISENGAGE A BICYCLE REAR HUB WITH A PAWL AND RATCHET-RING CLUTCH MECHANISM},\n    number = {20250033408},\n    year = {2025},\n    note = {File: US20250033408A1-20250130.XML}\n    }", "classification": "B60B2702FI"}, {"title": "CASTOR BRAKE FOR DOUBLE SWIVEL CASTORS FOR CASES", "doc_number": "20250033409", "filename": "US20250033409A1-20250130.XML", "abstract": "A swivel castor, having a housing which can be pivoted into a rolling direction via pivot means and two wheels rotatably mounted on the housing on a horizontal wheel axle, wherein the pivot means are arranged in front of the wheel axle, contrary to the rolling direction, and having a braking device designed to be adjustable between a braking position, in which the braking device exerts a braking force on at least one wheel, and a free-rolling position, in which the braking device releases the wheels. A brake pedal generating the braking force is pivotably mounted on the housing via a pedal axle, which extends parallel to the wheel axle and arranged between the wheels, and, in the braking position, at least one brake shoe arranged on the brake pedal exerts a braking force parallel to the wheel axle directly on one side of at least one wheel.", "detailed_description": ["The following description is merely exemplary in nature and is in no way intended to limit the present disclosure or its application or uses. It should be understood that throughout the description, corresponding reference numerals indicate like or corresponding parts and features.", "", "The present disclosure generally provides a brakeable swivel castor, having a castor housing which can be pivoted into a rolling direction via pivot means and two wheels rotatably mounted on the castor housing on a horizontal wheel axle, wherein the pivot means are arranged in front of the wheel axle, as seen contrary to the rolling direction, and having a braking device, which is designed to be adjustable between a braking position, in which the braking device exerts a braking force on at least one wheel, and a free-rolling position, in which the braking device releases the wheels.", "", "This enables a very easily producible and, at the same time, stable and durable braking device. Moreover, the wheels can be easily replaced without having to release or remove the braking device. The wheels are moreover not concealed by the castor housing or the braking device, which means that an appropriate option in terms of the shape or the design of the wheels (in particular the front surface of the wheels, wheel hubs/caps) is enabled. Moreover, this enables a braking effect without total blocking of the castors. In the event that the downhill force on the case is greater than the retaining force of the brake, subject to the weight of the case and the forces acting on the case, this enables only a slow rolling away of the case whilst preventing the case from tipping over.", "", "In an advantageous embodiment of the present disclosure, the pedal axle is arranged behind a vertical plane extending through the wheel axle, as seen contrary to the rolling direction. In particular, the brake shoes are arranged in such a way that their center points, as seen in the circumferential direction of the wheel, are located behind a vertical plane extending through the wheel axle, as seen contrary to the rolling direction L. This specific arrangement of the axles and brake shoes with respect to one another hinders or prevents the automatic release of the brake pedal upon a rotation of the wheels in the rolling direction.", "", "Moreover, in the braking position, the braking device may press the wheels apart on the side facing away from the rolling direction and press them indirectly together on the side facing the rolling direction. This enables an additional braking effect since the wheels are positioned towards one another in the rolling direction. This produces a braking effect similar to the snow plough position when skiing. Moreover, such a positioning of the brake shoes reduces or prevents a positive or negative slip of the wheels in the braking position, which in turn enables as linear and extensive a contact area as possible between the wheels and the ground and therefore enables the greatest possible traction and a surface pressure which is distributed uniformly over the whole possible contact area/wheel width. As a result of the extensive contact area (even in the braking position), the distribution of the load of the case is ensured over the whole possible contact area of the wheels.", "", "In a preferred embodiment, the castor housing and the brake pedal have cooperating latching means, which position the brake pedal in the braking position and in the free-rolling position with form fit and force fit under a defined retention force in each case. In particular, the latching means generate a haptic and/or acoustic feedback relating to the actuation of the brake pedal.", "", "The brake pedal is particularly preferably designed as a two-component injection molded part, wherein a first component forms a fastening attachment for fastening the brake pedal on the castor housing and a second molded-on part forms the brake shoes. As a result of the reduction in the number of individual parts that this achieves, simple production and installation of the assembly is enabled. The brake pedal particularly preferably has a through-opening in the region of the brake shoes and the brake shoes are formed together as a single-part injection molded component with a material connection through the through-opening. This enables simple production of the brake shoes and a particularly stable design. It is particularly advantageous here if the brake shoes are made of a plastic material whereof the Shore hardness is greater, in particular up to 10 greater, preferably 5 greater, than the Shore hardness of a plastic material of the wheels. As a result, the wear generated by the friction force of the brake shoes will occur mainly on the lateral surfaces of the wheels, whereof the active surface is considerably greater than that of the brake shoe.", "", "Further advantageous configurations of the present disclosure are revealed in more detail with reference to several embodiments illustrated in the following description of the figures. In the various figures of the drawing, the same parts are always denoted by the same reference signs.", "", "With regard to the following description, it is claimed that the present disclosure is not restricted to the exemplary embodiments, nor to all or multiple features of described feature combinations; instead, each individual sub-feature of the/each exemplary embodiment also has significance for the subject matter of the present disclosure in isolation from all other sub-features described in association therewith and also in combination with any desired features of another exemplary embodiment.", "", "FIG.1shows a three-dimensional view of an exemplary embodiment of a brakeable swivel castor1according to the teachings of the present disclosure.FIG.2shows an exploded drawing of this embodiment, in which the individual parts of the brakeable swivel castor1according to the present disclosure can be seen.FIG.3shows a rear view in the rolling direction L.", "", "The swivel castor1has a castor housing3. The castor housing3comprises, in particular, a receiving opening2for receiving at least one wheel bearing6. A horizontally extending wheel axle5is rotatably mounted in the castor housing3by means of the wheel bearing6. A respective wheel7is fastened on two outer sides of the castor housing3via the wheel axle5. In particular, the wheels7may be fastened on the wheel axle5via a rivet, screw or latching connection.", "", "The wheels7have, in particular, a rim8and a tread9applied to the rim8. The tread9is preferably made from TPU material. The wheel7advantageously has a wheel cap fastened laterally on the rim8.", "", "So that the swivel castor1is automatically aligned in a rolling direction L during a movement, the castor housing3has pivot means10arranged offset from the wheel axle5. The pivot means10are arranged in front of the wheel axle5, as seen contrary to the rolling direction L. The pivot means10preferably comprise a vertical receiving bore in the castor housing3, in which a pivot axle (not illustrated) is rotatably mounted and via which the castor housing3can be fastened on a case.", "", "A horizontally extending through-opening4for fastening a braking device is moreover preferably formed on the caster housing3. The braking device is designed to be adjustable between a braking position, in which the braking device exerts a braking force on at least one wheel7, and a free-rolling position, in which the braking device releases the wheels7.", "", "According to another aspect of the present disclosure, provision is made for a brake pedal11for generating the braking force to be pivotably mounted on the castor housing3via a pedal axle15which extends parallel to the wheel axle5and is arranged between the wheels7. To this end, the brake pedal11has, in particular, a fork-shaped fastening attachment13, which surrounds the castor housing3laterally with two limbs between the wheels7. In particular, the limbs of the fastening attachment13have a respective horizontal through-bore, which are designed to be flush with the through-opening4of the castor3and through which the pedal axle15for fastening the brake pedal11on the castor housing3is pushed. The pedal axle15may be designed, in particular, as a rivet connection.", "", "Moreover, the brake pedal11has, in particular in the radially outer region of the swivel castor1, a preferably wave-shaped curved actuating surface, via which the brake pedal11may be moved from the free-rolling position to the braking position using the front of the foot.", "", "The brake pedal11is advantageously ergonomically formed in such a way that, due to the force effect on a bottom first foot-application area, the brake pedal11may be retracted into the swivel castor1and, due to a force effect on a top second foot-application area, the brake pedal11may be extended out of the swivel castor1.", "", "The pedal axle15is advantageously arranged centrally on the brake pedal11, in particular centrally with respect to the actuating surface, in such a way that an actuation of the brake pedal11at the end facing in the direction of the pivot means10of the castor housing3moves the brake pedal11into the free-rolling position and an actuation of the brake pedal11at the end facing away from the pivot means10of the castor housing3moves the brake pedal11into the braking position.", "", "The brake pedal11has, on the side facing a wheel7, a respective brake shoe14, which, in the braking position, exerts a braking force parallel to the wheel axle5directly on one side of the adjacent wheel7.", "", "The brake shoes14are, in particular, each formed on opposite lateral surfaces of the brake pedal11, which face the wheels7.", "", "The brake pedal11is advantageously designed as a two-component injection molded part, wherein a first component forms a base body, with a fastening attachment13for fastening on the castor housing3, and the actuating surface and a second component forms the brake shoes14.", "", "The base body of the brake pedal11advantageously forms a core projection12, in particular made from PA material, which is preferably overmolded with TPU material for the brake shoes14.", "", "FIG.4shows a three-dimensional view of an advantageous embodiment of the brake pedal11and the brake shoes14formed as an overmolded part14aof the brake pedal11. For better illustration, the overmolded part14is illustrated separately. The brake pedal11has the respective core projection12on its two lateral surfaces. An injection opening12ais advantageously arranged in the core projections12, which injection opening extends through the brake pedal11from an end face of one core projection12to the end face of the other core projection12. A groove12bis preferably formed around the core projections12in the lateral surface of the brake pedal11. The core projections12are overmolded with the overmolded part14a,which forms the brake shoes14. The overmolded part14aadvantageously extends through the injection opening12aand therefore connects the two brake shoes14. The overmolded part14aparticularly advantageously engages in the groove12b.A configuration of this type enables a very stable and durable configuration of the brake shoes14.", "", "FIG.5shows a lateral inside view of the brakeable swivel castor1according to the present disclosure, with the brake pedal11in a free-rolling position.FIG.6shows the same inside view of the swivel castor1, with the brake pedal11in a braking position. So that the positions of the brake pedal11can be seen more clearly, the front wheel7, as seen in the viewing direction, has been removed from view in each case.", "", "The pedal axle15is preferably arranged behind a vertical plane E1extending through the wheel axle5, as seen contrary to the rolling direction L. The pedal axle15is advantageously arranged above a horizontal plane E2extending through the wheel axle5. The pedal axle15is particularly preferably arranged circumferentially with respect to the wheels7in such a way that it is located in a plane E3with the wheel axle5, which plane encloses an angle a of a maximum of −45° with the plane E2extending horizontally through the wheel axle5. In the illustrated embodiment, the angle α=20°.", "", "The brake shoes14are preferably arranged in such a way that their center points M, as seen in the circumferential direction of the wheel7, are located behind the vertical plane E1extending through the wheel axle5, as seen contrary to the rolling direction L. In particular, the center points M of the brake shoes14are located behind the pedal axle15, as seen in the rolling direction L.", "", "In the free-rolling position according toFIG.5, the brake shoes14of the brake pedal11are positioned radially outside the wheels7. In particular, in the free-rolling position, the brake shoes14are positioned circumferentially with respect to the wheels7in such a way that they are located in a plane E4with the wheel axle5, which plane encloses an angle β of a maximum of +15° with the plane E2extending horizontally through the wheel axle5. In the illustrated embodiment, the angle β=4°.", "", "In the braking position according toFIG.6, the brake shoes14of the brake pedal11are clamped axially between the two wheels7. To this end, the brake pedal11, together with the brake shoes14, have a thickness extending in the direction parallel to the wheel axle5which is greater than a lateral distance between the wheels7(see alsoFIG.3).", "", "In particular, in the braking position, the brake shoes14are positioned between the wheels7in such a way that their center points M, as seen in the circumferential direction of the wheels7, are located below a horizontal plane E2extending through the wheel axle5. In the braking position, the brake shoes14are preferably positioned circumferentially between the wheels7in such a way that they are located in a plane E4with the wheel axle5, which plane encloses an angle γ of a maximum of +45° with the plane E2extending horizontally through the wheel axle5. In the illustrated embodiment, the angle γ=23°.", "", "FIG.7shows an illustration of a plan view from above, in sketch form, of an embodiment of the brakeable swivel castor according to the present disclosure in the braking position. In the braking position, the brake shoes14press the wheels7apart on the side facing contrary to the rolling direction L and press them indirectly together on the side facing in the rolling direction L, wherein the wheels7are positioned towards one another in the rolling direction L at an angle Ω of 1° bis 4°, preferably 2° to 3°. In particular, this inclined position relative to the rolling direction L is set via tolerances in individual components of the swivel castor1, preferably through the tolerances of the diameter of the wheel axle5and the wheel bearing6of the wheel7and/or the embodiment of the rivet connection of the wheel axle5and/or the oversize of the brake shoes14.", "", "As can be seen inFIG.5andFIG.6, the brake pedal11is preferably held in the free-rolling position on the castor housing3with form fit and force fit via latching means. In particular, to this end, the castor housing3has at least one integrally formed latching projection16. The latching projection16is arranged, preferably integrally formed, on at least one side of the castor housing3which faces a wheel7. The castor housing3advantageously comprises a respective latching projection16on both sides. The latching projection16is designed, in particular, with an arcuate form such that, in the free-rolling position, it forms a form-fitting and force-fitting latching connection with an end face of a limb of the brake pedal11. The latching projection16is preferably designed with a curved form in the direction of the limbs of the brake pedal11. The brake shoes14are particularly advantageously made of a plastic material, in particular of TPU, whereof the Shore A hardness is greater, in particular up to 10 greater, preferably 5 greater, than the Shore A hardness of a plastic material, in particular of a TPU, of the wheels7. The Shore A hardness here is determined according to DIN ISO 48-4:2021-02.", "", "In this regard, in the braking position, a clamping action is preferably generated between the brake pedal11made of TPU and the tyres of the wheels7, which tyres are made of TPU. The brake shoes14are advantageously designed to be smooth, i.e. without a profile, whereby a high surface pressure is generated. At the same time, tilting of the brake shoes14is hindered by the material of the tyres. Ideally, the TPU materials are selected with regard to the friction values such that it is possible for the wheels to spin in excess of a certain limit value of the movement force acting on the luggage item, without the brake pedal11being released from the braking position. In particular, this may prevent the luggage item from tipping under high movement forces, in particular due to inclined surfaces of greater than 38°.", "", "In particular, the core projections12of the brake shoes14are advantageously made of a solid PA material harder than the brake shoes14, whereby a spring effect and thus the possible appearance of resultant wear in the material of the brake shoes14is reduced or even avoided.", "", "The invention is not restricted to the exemplary embodiments illustrated and described, but comprises all embodiments which have the same effect within the context of the present disclosure. It is expressively emphasised that the exemplary embodiments are not restricted to all features in combination; instead, each individual sub-feature may also have inventive significance in isolation from all other sub-features. Furthermore, the invention is hitherto not yet restricted to any specific feature combinations defined herein, but may also be defined by any other desired combination of certain features of all individual features disclosed overall. This means that, essentially, practically any individual feature may be omitted or replaced by at least one individual feature disclosed at another point in the application."], "claims": ["wherein the pivot means are arranged in front of the wheel axle, as seen contrary to the rolling direction (L), and having a braking device, which is designed to be adjustable between a braking position, in which the braking device exerts a braking force on at least one wheel, and a free-rolling position, in which the braking device releases the wheels, wherein a brake pedal for generating the braking force is pivotably mounted on the castor housing via a pedal axle, which extends parallel to the wheel axle and is arranged between the wheels, and, in the free-rolling position and in the braking position, is held on the castor housing with form fit and force fit via latching means, and, in the braking position, at least one brake shoe arranged on the brake pedal exerts a braking force parallel to the wheel axle directly on one side of at least one wheel.", "2 . The brakeable swivel castor according to claim 1 , wherein the pedal axle is arranged behind a vertical plane (E 1 ) extending through the wheel axle, as seen contrary to the rolling direction (L).", "3 . The brakeable swivel castor according to claim 1 , wherein the pedal axle is arranged above a horizontal plane (E 2 ) extending through the wheel axle.", "4 . The brakeable swivel castor according to claim 1 , wherein the pedal axles arranged circumferentially with respect to the wheels in such a way that it is located in a plane (E 3 ) with the wheel axle, which plane encloses an angle (α) of a maximum of −45° with a horizontal plane (E 2 ) extending through the wheel axle.", "5 . The brakeable swivel castor according to claim 1 , wherein the brake shoes are arranged in such a way that their center points (M), as seen in the circumferential direction of the wheel, are located behind a vertical plane (E 1 ) extending through the wheel axle, as seen contrary to the rolling direction (L).", "6 . The brakeable swivel castor according to claim 1 , wherein in the braking position, the braking device presses the wheels apart on the side facing contrary to the rolling direction (L) and presses them indirectly together on the side facing in the rolling direction (L), wherein the wheels are positioned towards one another in the rolling direction (L) at an angle of 1° to 4°.", "7 . The brakeable swivel castor claim 1 , wherein in the free-rolling position, the brake shoes are positioned circumferentially with respect to the wheels in such a way that they are located in a plane (E 4 ) with the wheel axle, which plane encloses an angle (β) of a maximum of +15° with a horizontal plane (E 2 ) extending through the wheel axle.", "8 . The brakeable swivel castor claim 1 , wherein in the braking position, the brake shoes are positioned between the wheels in such a way that, in the braking position, their center points (M), as seen in the circumferential direction of the wheels, are located below a horizontal plane (E 2 ) extending through the wheel axle.", "9 . The brakeable swivel castor claim 1 , wherein in the braking position, the brake shoes are positioned between the wheels in such a way that they are located in a plane (E 4 ) with the wheel axle, which plane encloses an angle (B) of a maximum of +45° with a horizontal plane (E 2 ) extending through the wheel axle.", "10 . The brakeable swivel castor claim 1 , wherein the pedal axle is arranged centrally on the brake pedal in such a way that an actuation of the brake pedal at the end facing in the direction of the pivot means moves the brake pedal into the free-rolling position and an actuation of the brake pedal at the end facing away from the pivot means moves the brake pedal into the braking position.", "11 . The brakeable swivel castor claim 1 , wherein the brake pedal is designed as a two-component injection molded part, wherein a first component forms a fastening attachment for fastening on the castor housing and a second component forms the brake shoes.", "12 . The brakeable swivel castor claim 1 , wherein the brake shoes are made of a plastic material whereof the Shore A hardness is greater than the Shore A hardness of a plastic material of the wheels.", "13 . The brakeable swivel castor claim 1 , wherein the brake shoes are each formed on opposite lateral surfaces of the brake pedal, which face the wheels.", "14 . The brakeable swivel castor claim 1 , wherein the brake pedal, together with the brake shoes, have a thickness extending in the direction parallel to the wheel axle which is greater than a lateral distance between the wheels.", "15 . The brakeable swivel castor claim 1 , wherein the brake pedal has a through-opening in the region of the brake shoes and the brake shoes are formed together as a single-part injection molded component with a material connection through the through-opening.", "16 . The brakeable swivel castor according to claim 6 , wherein the wheels are positioned towards one another in the rolling direction (L) at the angle of 2° to 3°.", "17 . The brakeable swivel castor according to claim 12 , wherein the Shore A hardness of plastic material of the brake shoes is up to 10 greater than the Shore A hardness of the plastic material of the wheels.", "18 . The brakeable swivel castor according to claim 17 , wherein the Shore A hardness of plastic material of the brake shoes is 5 greater than the Shore A hardness of the plastic material of the wheels."], "bibtex": "@patent{20250033409,\n    title = {CASTOR BRAKE FOR DOUBLE SWIVEL CASTORS FOR CASES},\n    number = {20250033409},\n    year = {2025},\n    note = {File: US20250033409A1-20250130.XML}\n    }", "classification": "B60B3300FI"}, {"title": "FLUID MANAGEMENT SYSTEM FOR A DRIVETRAIN", "doc_number": "20250033410", "filename": "US20250033410A1-20250130.XML", "abstract": "A fluid management system for a drivetrain includes a first reservoir, a second reservoir, a main suction line, and a second suction line. The first reservoir is positioned in a lower portion of a transmission. The first reservoir has a preselected fluid level. The second reservoir is positioned in a lower portion of the transmission. The second reservoir is separated from the first reservoir by a barrier having an opening. The main suction line has an opening positioned in a lower portion the first reservoir below the preselected fluid level. The second suction line has an opening positioned in a lower portion of the second reservoir.", "detailed_description": ["The embodiments or implementations disclosed in the above drawings and the following detailed description are not intended to be exhaustive or to limit the present disclosure to these embodiments or implementations.", "", "With reference toFIG.1, a work vehicle100, for example an agricultural tractor, can include an operator station or cab102, a hood104, one or more ground engaging apparatus106, for example wheels or track assemblies, and a frame or chassis110. The work vehicle100can include an operator interface having any number and combination of electronic devices, such as an interactive display. The work vehicle100can have a rigid or an articulated frame110. The work vehicle100can include one or more power sources108, for example an internal combustion engine, a hybrid engine, or an electric or hydraulic machine. The work vehicle100can include a transmission120transferring power from the one or more power sources108to a drivetrain, which includes the ground engaging apparatus106and one or more power take off (PTO) shafts112or other auxiliary power outputs or inputs. This disclosure also applies to other types of work vehicles in agriculture, construction, forestry, and road building.", "", "With reference toFIGS.2-11, the transmission120can include a transmission housing122, which provides an enclosure for the various transmission or other drivetrain components. The transmission housing122forms an exterior surface and an interior surface of the transmission120. The transmission120can include a plurality of shafts, gears, and clutches inside the transmission housing122. One or more of the shafts or other transmission or drivetrain components may be rotatably connected to or supported by the transmission housing122. The transmission120can include one or more electric machines124, for example electric motor-generators, inside the transmission housing122.", "", "A fluid sump or first reservoir126is located or positioned in a lower portion of the transmission120. The first reservoir126can include a fluid, such as a hydraulic or transmission fluid (e.g., transmission oil, hydraulic oil, or other lubricants). The first reservoir126can include a preselected quantity or fluid level128. A rear axle162can be in fluid communication with the first reservoir126. The PTO112can be in fluid communication with the rear axle162and the first reservoir126. A second reservoir142is located or positioned in a lower portion of the transmission120. The second reservoir142is separated or partitioned from the first reservoir126by a barrier or wall146, which can include an opening148. A front axle160can be in fluid communication with the second reservoir142.", "", "A main suction line130can be positioned in the first reservoir126. The main suction line130has an opening positioned a lower portion of the first reservoir126. The opening at one end of the main suction130is positioned below the preselected fluid level128. The main suction line130can be fluid communication with one or more of the first reservoir126, the front axle160, and the rear axle162. Alternatively, or additionally, the main suction line130can be fluid communication with a third reservoir132in fluid communication with the first reservoir126, the front axle160, and the rear axle162. A transfer pump134(e.g., hydraulic pump) is in fluid communication with the main suction line130. The transfer pump134can be in fluid communication with the first reservoir126, the front axle160, and the rear axle162to transfer fluid from the first reservoir126to the front axle160and the rear axle162. Alternatively, or additionally, the transfer pump134can be in fluid communication with the third reservoir132to transfer fluid from the first reservoir126to the third reservoir132.", "", "A scavenge or second suction line140can be positioned in the second reservoir142. The second suction line140has an opening positioned in a lower portion of the second reservoir142. The opening at one end of the second suction line140is positioned below the preselected fluid level128. The opening at one end of the second suction line140can be positioned lower than the opening in the barrier146. The opening at one end of the second suction line140can be positioned below the opening in the barrier146. The second suction line140can be in fluid communication with one or more of the second reservoir142, the front axle160, and the rear axle162. A scavenge or second pump144(e.g., hydraulic pump) is in fluid communication with the second suction line140. The second pump144can be in fluid communication with the second reservoir142and the rear axle162to transfer fluid from the second reservoir142to the rear axle162. The second pump144can be in fluid communication with the front axle160and can remove or evacuate fluid from the front axle160.", "", "According to some implementations, the barrier146includes an opening148positioned near or above the preselected fluid level128in the first reservoir126, as shown for example inFIGS.3-6. The opening148can be positioned in an upper portion of the barrier146. The opening148can be positioned above the main suction line130. The opening148can provide a passageway or conduit between the first reservoir126and the second reservoir142for any fluid exceeding the preselected fluid level128in the first reservoir126. The barrier146can include a vertical or substantially vertical portion dividing or partitioning the second reservoir142from the first reservoir126. The barrier146can include a portion which extends or projects outwardly from the second reservoir142towards the first reservoir126and includes the opening148, as shown for example inFIGS.3and4. The opening148can be positioned at or near a center of the first reservoir126. The main suction tube130draws or extracts a majority of the fluid from the first reservoir126in the transmission120. Any fluid rising above the preselected fluid level128in the first reservoir126flows through the opening148into the second reservoir142. The second suction tube140draws or extracts the overflow fluid from the second reservoir142.", "", "According to some implementations, an overflow tube150is positioned in an opening148in the barrier146, as shown for example inFIGS.7-11. The overflow tube150can provide a passageway or conduit between the first reservoir126and the second reservoir142. The overflow tube150can be angled or inclined in a fore and aft direction, as shown for example inFIGS.7-11. The overflow tube150has a first opening in a first end152, which is positioned above the opening of the main suction line130. The overflow tube150has a second opening in a second end154, which is in fluid communication with the second reservoir142. The first end152of the overflow tube150is positioned at or near a center of the first reservoir126. The first end152of the overflow tube150is positioned near or above the preselected fluid level128in the first reservoir126. Based on the position of overflow tube150in the first reservoir126, the fluid level128near the first end152of the overflow tube150can remain nearly or substantially the same when the transmission120is tilted or inclined in a fore and aft direction, as shown for example inFIGS.7and8, or a side-to-side direction, as shown for example inFIG.10.", "", "With reference toFIGS.6and11, the flow of fluid through the fluid management system can include one or more pumps, one or more drivetrain components, and one or more reservoirs. The transfer pump134can pump fluid from the first reservoir126of the transmission120via the main suction line130. The transfer pump134can pump fluid from the first reservoir to the front and rear axles160,162or to the third reservoir132connected to the front and rear axles160,162. Fluid from the rear axle162can flow into the first reservoir126. Fluid from the front axle162can flow into the second reservoir142. The second pump144can pump fluid from the second reservoir142to the rear axle162. The second pump144can pump fluid from the front axle160to the rear axle162.", "", "During operation, the fluid in the transmission120or in other drivetrain components can become agitated and air can be mixed with the fluid creating aerated fluid. This fluid and air mixture rises to the top of the preselected fluid level128in the transmission120and can exceed the preselected fluid level128. When the transmission120includes an opening148in the barrier146, the fluid and air mixture exceeding the preselected fluid level128flows from the first reservoir126through the opening148in the barrier146into the second reservoir142. When the transmission120includes an overflow tube150in the opening148, the fluid and air mixture exceeding the preselected fluid level128flows from the first reservoir126through the opening152of the overflow tube150into the second reservoir142. The second pump144then transfers the overflow fluid from the second reservoir142to the rear axle162or the third reservoir132, or both.", "", "The terminology used herein is for the purpose of describing example embodiments or implementations and is not intended to be limiting of the disclosure. As used herein, the singular forms “a,” “an.” and “the” are intended to include the plural forms as well, unless the context clearly indicates otherwise. It will be further understood that the any use of the terms “has,” “includes,” “comprises,” or the like, in this specification, identifies the presence of stated features, integers, steps, operations, elements, and/or components, but does not preclude the presence or addition of one or more other features, integers, steps, operations, elements, components, and/or groups thereof.", "", "Those having ordinary skill in the art will recognize that terms such as “above,” “below,” “upward,” “downward,” “top,” “bottom,” etc., are used descriptively for the figures, and do not represent limitations on the scope of the present disclosure, as defined by the appended claims. Furthermore, the teachings may be described herein in terms of functional and/or logical block components or various processing steps, which may include any number of hardware, software, and/or firmware components configured to perform the specified functions.", "", "Terms of degree, such as “generally,” “substantially,” or “approximately” are understood by those having ordinary skill in the art to refer to reasonable ranges outside of a given value or orientation, for example, general tolerances or positional relationships associated with manufacturing, assembly, and use of the described embodiments or implementations.", "", "As used herein, “e.g.,” is utilized to non-exhaustively list examples and carries the same meaning as alternative illustrative phrases such as “including,” “including, but not limited to,” and “including without limitation.” Unless otherwise limited or modified, lists with elements that are separated by conjunctive terms (e.g., “and”) and that are also preceded by the phrase “one or more of” or “at least one of” indicate configurations or arrangements that potentially include individual elements of the list, or any combination thereof. For example, “at least one of A, B, and C” or “one or more of A, B, and C” indicates the possibilities of only A, only B, only C, or any combination of two or more of A, B, and C (e.g., A and B; B and C; A and C; or A, B, and C).", "", "While the above describes example embodiments or implementations of the present disclosure, these descriptions should not be viewed in a restrictive or limiting sense. Rather, there are several variations and modifications which may be made without departing from the scope of the appended claims."], "claims": ["a first reservoir positioned in a lower portion of a transmission, the first reservoir having a preselected fluid level; a second reservoir positioned in a lower portion of a transmission, the second reservoir separated from the first reservoir by a barrier having an opening; a main suction line having an opening positioned in a lower portion the first reservoir below the preselected fluid level; and a second suction line having an opening positioned in a lower portion of the second reservoir.", "2 . The fluid management system of claim 1 , wherein the main suction line is in fluid communication with a front axle and a rear axle.", "3 . The fluid management system of claim 1 , wherein the main suction line is in fluid communication with a third reservoir.", "4 . The fluid management system of claim 1 , wherein the second suction line is in fluid communication with a front axle and a rear axle.", "5 . The fluid management system of claim 1 , further comprising a transfer pump in fluid communication with the first reservoir, a front axle, and a rear axle, the transfer pump configured to transfer fluid from the first reservoir to the front and rear axles.", "6 . The fluid management system of claim 1 , further comprising a second pump in fluid communication with the second suction line, the second pump configured to transfer fluid from the second reservoir to the rear axle.", "7 . The fluid management system of claim 1 , further comprising a second pump in fluid communication with the second suction line, the second reservoir in fluid communication with a front axle, and the second pump configured to transfer fluid from the front axle to the rear axle.", "8 . The fluid management system of claim 1 , wherein the opening in the barrier is positioned above the main suction line and near the preselected fluid level of the first reservoir.", "9 . The fluid management system of claim 1 , wherein the barrier includes a projection into the first reservoir, and the projection includes the opening in the barrier.", "10 . The fluid management system of claim 1 , further comprising an overflow tube positioned in the opening in the barrier, the overflow tube having a first end positioned above the opening of the main suction line and a second end in fluid communication with the second reservoir, the first end of the overflow tube positioned near a center of the first reservoir and near the preselected fluid level in the first reservoir.", "a transmission including a first reservoir and a second reservoir in a lower portion of the transmission, the second reservoir separated from the first reservoir by a barrier, the first reservoir having a preselected fluid level, and the barrier having an opening; a main suction line having an opening positioned in a lower portion of the first reservoir below the preselected fluid level; and a second suction line having an opening positioned in a lower portion of the second reservoir.", "12 . The fluid management system of claim 11 , wherein the main suction line is in fluid communication with a front axle and a rear axle.", "13 . The fluid management system of claim 11 , wherein the main suction line is in fluid communication with a third reservoir.", "14 . The fluid management system of claim 11 , wherein the second suction line is in fluid communication with a front axle and a rear axle.", "15 . The fluid management system of claim 11 , further comprising a transfer pump in fluid communication with the first reservoir, a front axle, and a rear axle, the transfer pump configured to transfer fluid from the first reservoir to the front and rear axles.", "16 . The fluid management system of claim 11 , further comprising a second pump in fluid communication with the second suction line, the second pump configured to transfer fluid from the second reservoir to the rear axle.", "17 . The fluid management system of claim 11 , further comprising a second pump in fluid communication with the second suction line, the second reservoir in fluid communication with a front axle, and the second pump configured to transfer fluid from the front axle to the rear axle.", "18 . The fluid management system of claim 11 , wherein the opening in the barrier is positioned above the main suction line and near the preselected fluid level of the first reservoir.", "19 . The fluid management system of claim 11 , wherein the barrier includes a projection into the first reservoir, and the projection includes the opening in the barrier.", "20 . The fluid management system of claim 11 , further comprising an overflow tube positioned in the opening in the barrier, the overflow tube having a first end positioned above the opening of the main suction line and a second end in fluid communication with the second reservoir, the first end of the overflow tube positioned near a center of the first reservoir and near the preselected fluid level in the first reservoir."], "bibtex": "@patent{20250033410,\n    title = {FLUID MANAGEMENT SYSTEM FOR A DRIVETRAIN},\n    number = {20250033410},\n    year = {2025},\n    note = {File: US20250033410A1-20250130.XML}\n    }", "classification": "B60B3500FI"}, {"title": "TIRES FOR VEHICLE WHEELS", "doc_number": "20250033411", "filename": "US20250033411A1-20250130.XML", "abstract": "The present invention relates to a tire for vehicle wheels comprising at least one structural component comprising at least one reinforcing element comprising an elongate member coated with, or embedded in, a vulcanised elastomeric compound obtained by vulcanising an elastomeric composition comprising per 100 phr of diene elastomeric polymer: (i) a predispersion of a diene elastomeric polymer and lignin, in an amount to provide the elastomeric composition with 100 to 10 phr of diene elastomeric polymer and an amount of lignin equal to or greater than 25 phr. (ii) 0 to 90 phr of a diene elastomeric polymer, (iii) at least 30 phr of a carbon black reinforcing filler, (iv) optionally, a reinforcing resin comprising at least 1 phr of a methylene acceptor compound associated with at least 1 phr of a methylene donor compound, and (v) 0.1 to 12 phr of at least one vulcanising agent, wherein at least 50 phr of said diene elastomeric polymer consists of natural or synthetic isoprene rubber.", "detailed_description": ["The present invention will be illustrated in further detail by means of an illustrative embodiment with reference to the accompanyingFIG.1, where “a” indicates an axial direction and “r” indicates a radial direction. For simplicity,FIG.1shows only a part of the tire, the remaining part not shown being identical and disposed symmetrically with respect to the radial direction “r”.", "", "The reference numeral100indicates inFIG.1a tire for vehicle wheels, which generally comprises a carcass structure101having respectively opposite end flaps engaged with respective annular anchoring structures102, called bead cores, possibly associated with a bead filler104. The tire area comprising the bead core102and the filler104forms a bead structure103intended for anchoring the tire onto a corresponding mounting rim, not shown. Each bead structure103is associated to the carcass structure by folding back of the opposite lateral edges of the at least one carcass layer101around the bead core102so as to form the so-called carcass flaps101aas shown inFIG.1.", "", "The carcass structure101is possibly associated with a belt structure106comprising one or more belt layers106a,106bplaced in radial superposition with respect to one another and with respect to the carcass structure101, having typically metal reinforcing cords. Such reinforcing cords may have crossed orientation with respect to a circumferential extension direction of the tire100. By “circumferential” direction we mean a direction generally facing according to the direction of rotation of the tire, or in any case slightly inclined with respect to the direction of rotation of the tire.", "", "The belt structure106further comprises at least one radially external reinforcing layer106cwith respect to the belt layers106a,106b. The radially external reinforcing layer106ccomprises textile or metal cords, disposed according to a substantially zero angle with respect to the circumferential extension direction of the tire and immersed in the elastomeric material. Preferably, the cords are disposed substantially parallel and side by side to form a plurality of turns. Such turns are substantially oriented according to the circumferential direction (typically with an angle of between 0° and) 5°, such direction being usually called “zero degrees” with reference to the laying thereof with respect to the equatorial plane X-X of the tire. By “equatorial plane” of the tire it is meant a plane perpendicular to the axis of rotation of the tire and which divides the tire into two symmetrically equal parts.", "", "A tread band109of a vulcanised elastomeric compound is applied in a radially internal position with respect to the carcass structure101and/or if present (as in the illustrated case) to the belt structure106.", "", "In a radially external position, the tread band109has a rolling portion109aintended to come into contact with the ground. Circumferential grooves, which are connected by transverse notches (not shown inFIG.1) so as to define a plurality of blocks of various shapes and sizes distributed in the rolling portion109a, are generally made in this portion109a, which for simplicity is represented smooth inFIG.1.", "", "To optimise the performance of the tread, the tread band may be made in a two-layer structure.", "", "Such two-layer structure comprises the rolling layer or portion109a(called cap) and a substrate111(called base) forming the so-called cap-and-base structure. It is thus possible to use an elastomeric material capable of providing a low rolling resistance for the cap109aand at the same time high resistance to wear and to the formation of cracks while the elastomeric material of the substrate111may be particularly aimed at a low hysteresis to cooperate in reducing rolling resistance. The under-layer111of vulcanised elastomeric compound may be disposed between the belt structure106and the rolling portion109a.", "", "Moreover, respective sidewalls108of vulcanised elastomeric compound are further applied in an axially external position to said carcass structure101, each extending from one of the lateral edges of the tread band109up to the respective bead structure103.", "", "A strip consisting of elastomeric compound110, commonly known as “mini-sidewall”, of vulcanised elastomeric compound may optionally be provided in the connecting zone between sidewalls108and the tread band109, this mini-sidewall generally being obtained by co-extrusion with the tread band109and allowing an improvement of the mechanical interaction between the tread band109and the sidewalls108. Preferably, the end portion of sidewall108directly covers the lateral edge of the tread band109.", "", "In some specific embodiments, such as the one illustrated and described herein, the stiffness of the bead103may be improved by providing a reinforcing layer120generally known as a “flipper” in the tire bead.", "", "The flipper120is wrapped around the respective bead core102and the bead filler104so as to at least partially surround them. The flipper120is disposed between the carcass layer101and the bead structure103. Usually, the flipper120is in contact with the carcass layer101and said bead structure103. The flipper120typically comprises a plurality of metal or textile cords incorporated in a vulcanised elastomeric compound.", "", "In some specific embodiments, such as the one illustrated and described herein, the bead structure103may further comprise a further reinforcing layer121which is generally known by the term of “chafer” and which has the function to increase the rigidity and integrity of the bead structure103.", "", "The chafer121usually comprises a plurality of cords incorporated in a vulcanised elastomeric compound; such cords are generally made of textile material (for example aramid or rayon), or of metallic material (for example steel cords).", "", "Optionally, an anti-abrasive strip105is disposed so as to wrap the bead structure103along the axially internal and external and radially internal areas of the bead structure103, thus interposing itself between the latter and the wheel rim when the tire100is mounted on the rim.", "", "Moreover, a radially internal surface of tire100is preferably internally lined by a layer of substantially airtight elastomeric material, or so-called liner112.", "", "According to an embodiment not shown, the tire may be a tire for motorcycle wheels. The profile of the straight section of the tire for motorcycle (not shown) has a high transversal curvature since it must guarantee a sufficient footprint area in all the inclination conditions of the motorcycle. The transverse curvature is defined by the value of the ratio between the distance f of the ridge of the tread from the line passing through the laterally opposite ends of the tread itself, measured on the equatorial plane of the tire, and the width C defined by the distance between the laterally opposite ends of the tread itself. A tire with high transverse curvature indicates a tire whose transverse curvature ratio (f/C) is at least 0.20.", "", "The reinforcing elements of the belt structure106, and/or of the carcass structure101, and/or of the bead structure103, such as the flipper120and/or the chafer121, may be advantageously rubberised with the elastomeric composition comprising the predispersion of diene elastomeric polymer and lignin previously described, because a lower hysteresis means (i) a lower dissipation of energy in the form of heat during driving, preventing the onset of operating temperatures that are too high which may risk compromising the integrity of the tire, and (ii) lower fuel consumption.", "", "The building of the tire100as described above is carried out by assembling respective semi-finished products onto a forming drum, not shown, by at least one assembly device.", "", "At least a part of the components intended to form the carcass structure101of the tire100is built and/or assembled on the forming drum. More particularly, the forming drum is intended to first receive the possible liner112, and then the carcass ply101. Thereafter, devices non shown coaxially engage one of the annular anchoring structures102around each of the end flaps, position an external sleeve comprising the belt structure106and the tread band109in a coaxially centred position around the cylindrical carcass sleeve and shape the carcass sleeve according to a toroidal configuration through a radial expansion of the carcass ply101, so as to cause the application thereof against a radially internal surface of the external sleeve.", "", "After building of the green tire100, a moulding and vulcanisation treatment is generally carried out in order to determine the structural stabilisation of the tire100through vulcanisation of the elastomeric compounds, as well as to impart a desired tread pattern on the tread band109and to impart any distinguishing graphic signs at the sidewalls108.", "", "The present invention will be further illustrated below by means of a number of preparatory examples, which are provided for indicative purposes only and without any limitation of the present invention."], "claims": ["(i) a predispersion of a diene elastomeric polymer and lignin, in an amount to provide the elastomeric composition with 100 to 10 phr of diene elastomeric polymer and an amount of lignin equal to or greater than 25 phr, (ii) 0 to 90 phr of a diene elastomeric polymer, (iii) at least 30 phr of a carbon black reinforcing filler, (iv) optionally, a reinforcing resin comprising at least 1 phr of a methylene acceptor compound associated with at least 1 phr of a methylene donor compound, and (v) 0.1 to 12 phr of at least one vulcanising agent, wherein at least 50 phr of said diene elastomeric polymer consists of natural or synthetic isoprene rubber.", "(i) a predispersion of a diene elastomeric polymer and lignin, in an amount to provide the elastomeric composition with 100 to 10 phr of diene elastomeric polymer and an amount of lignin equal to or greater than 25 phr, (ii) 0 to 90 phr of a diene elastomeric polymer, (iii) at least 30 phr of a carbon black reinforcing filler, (iv) optionally, a reinforcing resin comprising at least 1 phr of a methylene acceptor compound associated with at least 1 phr of a methylene donor compound, and (v) 0.1 to 12 phr of at least one vulcanising agent, wherein at least 50 phr of said diene elastomeric polymer consists of natural or synthetic isoprene rubber.", "(i) a predispersion of a diene elastomeric polymer and lignin, in an amount to provide the elastomeric composition with 100 to 10 phr of diene elastomeric polymer and an amount of lignin equal to or greater than 25 phr, (ii) 0 to 90 phr of a diene elastomeric polymer, (iii) at least 30 phr of a carbon black reinforcing filler, (iv) optionally, a reinforcing resin comprising at least 1 phr of a methylene acceptor compound associated with at least 1 phr of a methylene donor compound, and (v) 0.1 to 12 phr of at least one vulcanising agent, wherein at least 50 phr of said diene elastomeric polymer consists of natural or synthetic isoprene rubber.", "(i) a predispersion of a diene elastomeric polymer and lignin, in an amount to provide the elastomeric composition with 100 to 10 phr of diene elastomeric polymer and an amount of lignin equal to or greater than 25 phr, (ii) 0 to 90 phr of a diene elastomeric polymer, (iii) at least 30 phr of a carbon black reinforcing filler, (iv) optionally, a reinforcing resin comprising at least 1 phr of a methylene acceptor compound associated with at least 1 phr of a methylene donor compound, and (v) 0.1 to 12 phr of at least one vulcanising agent, wherein at least 50 phr of said diene elastomeric polymer consists of natural or synthetic isoprene rubber.", "5 . The tire for vehicle wheels according to claim 1 or the structural component according to claim 2 or the reinforcing element according to claim 3 or the elastomeric composition according to claim 4 , characterised in that said predispersion of diene elastomeric polymer and lignin is added to the elastomeric composition in an amount to provide the elastomeric composition itself with 100 to 20 phr of diene elastomeric polymer, preferably 100 to 30 phr of diene elastomeric polymer.", "6 . The tire for vehicle wheels according to claim 1 or the structural component according to claim 2 or the reinforcing element according to claim 3 or the elastomeric composition according to claim 4 , characterised in that at least 60 phr, preferably at least 70 phr, and more preferably at least 80 phr of said diene elastomeric polymer of said elastomeric composition consists of natural or synthetic, preferably natural isoprene rubber.", "7 . The tire for vehicle wheels according to claim 1 or the structural component according to claim 2 or the reinforcing element according to claim 3 or the elastomeric composition according to claim 4 , characterised in that said predispersion of diene elastomeric polymer and lignin is added to the elastomeric composition in such an amount as to provide the elastomeric composition with at least 30 phr of lignin, preferably 30 phr to 60 phr of lignin, more preferably 30 phr to 50 phr of lignin.", "8 . The tire for vehicle wheels according to claim 1 or the structural component according to claim 2 or the reinforcing element according to claim 3 or the elastomeric composition according to claim 4 , characterised in that said predispersion of diene elastomeric polymer and lignin comprises an amount of lignin equal to or greater than 45 phr, preferably equal to or greater than 50 phr, even more preferably equal to or greater than 60 phr and up to 160 phr.", "9 . The tire for vehicle wheels according to claim 1 or the structural component according to claim 2 or the reinforcing element according to claim 3 , characterised in that said elongate member is made of a polymeric material selected from the group comprising polyester, rayon, lyocell, and polyamide, or of metallic material selected from the group comprising steel and steel coated with copper/zinc, zinc/manganese, zinc/molybdenum/cobalt metal alloys, and the like.", "10 . The tire for vehicle wheels according to claim 1 , wherein said structural element is selected from the group consisting of carcass structure, belt structure, additional belt layer, rubberising layer, sidewall reinforcement layer or chafer, and bead reinforcement layer or flipper."], "bibtex": "@patent{20250033411,\n    title = {TIRES FOR VEHICLE WHEELS},\n    number = {20250033411},\n    year = {2025},\n    note = {File: US20250033411A1-20250130.XML}\n    }", "classification": "B60C100FI"}, {"title": "TIRES FOR VEHICLE WHEELS", "doc_number": "20250033412", "filename": "US20250033412A1-20250130.XML", "abstract": "The present invention relates to a tire for vehicle wheels which comprises at least one structural component comprising at least one reinforcing element constituted by an elongate element coated with, or embedded in, a vulcanised elastomeric compound obtained by vulcanising an elastomeric composition comprising per 100 phr of diene elastomeric polymer: (i) a predispersion of a diene elastomeric polymer and lignin, in an amount to provide the elastomeric composition with 100 to 10 phr of diene elastomeric polymer and a quantity of lignin equal to or greater than 20 phr, (ii) from 0 to 90 phr of a diene elastomeric polymer, (iii) at least 30 phr of a carbon black reinforcing filler, (iv) optionally, a reinforcing resin comprising at least 0.5 phr of a methylene acceptor compound associated with at least 0.2 phr of a methylene donor compound, (v) from 0.1 to 10 phr of carbon nanotubes, and (vi) from 0.1 to 12 phr of at least one vulcanising agent, wherein at least 50 phr of said diene elastomeric polymer is constituted by natural or synthetic isoprene rubber.", "detailed_description": ["The present invention will be illustrated in further detail by means of an illustrative embodiment with reference to the enclosedFIG.1, where “a” indicates an axial direction and “r” indicates a radial direction. For the sake of simplicity,FIG.1only shows a part of the tire, the remaining non-represented part being identical and arranged symmetrically with respect to the radial direction “r”.", "", "The reference number100inFIG.1indicates a tire for vehicle wheels, which generally comprises a carcass structure101having respectively opposite end flaps engaged with respective anchoring annular structures102, termed bead cores, possibly associated with a bead filler104. The zone of the tire comprising the bead core102and the filler104forms a bead structure103intended for anchoring the tire on a corresponding mounting rim, not illustrated. Each bead structure103is associated with the carcass structure by folding back the opposite lateral edges of the at least one carcass layer101around the bead core102so as to form the so-called turn-ups of the carcass101a, as illustrated inFIG.1.", "", "The carcass structure101is possibly associated with a belt structure106comprising one or more belt layers106a,106bsituated in radial superimposition with respect to each other and with respect to carcass structure101, having reinforcement cords that are typically metallic. Such reinforcement cords can have cross orientation with respect to a circumferential extension direction of the tire100. By “circumferential” direction it is intended a direction generically directed according to the rotation direction of the tire, or in any case slightly inclined with respect to the rotation direction of the tire.", "", "The belt structure106also comprises at least one reinforcement layer106cthat is radially outer with respect to the belt layers106a,106b. The radially outer reinforcement layer106ccomprises textile or metallic cords, arranged according to an angle that is substantially zero with respect to the circumferential extension direction of the tire and immersed in the elastomeric material. Preferably, the cords are arranged substantially parallel and side-by-side to form a plurality of turns. Such turns are substantially oriented according to the circumferential direction (typically with an angle between 0° and 5°), such direction normally being termed “zero-degree” with reference to its position with respect to the equatorial plane X-X of the tire. By “equatorial plane” of the tire it is intended a plane perpendicular to the rotation axis of the tire which divides the tire into two symmetrically equal parts.", "", "In radially outer position with respect to the carcass structure101and/or if present (as in the illustrated case) to the belt structure106, a tread band109is applied in vulcanised elastomeric compound.", "", "In radially outer position, the tread band109has a rolling portion109aintended to come into contact with the ground. Circumferential grooves, which are connected by transverse notches (not represented inFIG.1) such to define a plurality of blocks of various shape and size distributed in the rolling portion109a, are generally made in this portion109a, which for the sake of simplicity inFIG.1is represented smooth.", "", "In order to optimise the performances of the tread, the tread band can be attained in a two-layer structure.", "", "Such two-layer structure comprises the rolling portion or layer109a(termed cap) and an under-layer111(termed base), attaining the so-called cap-and-base structure. It is thus possible to use an elastomeric material capable of providing a low rolling resistance for the cap109aand simultaneously high resistance to wear and to the formation of cracks while the elastomeric material of the under-layer111can be particularly directed for a low hysteresis in order to cooperate with reducing the rolling resistance. The under-layer111made of vulcanised elastomeric compound can be arranged between the belt structure106and the rolling portion109a.", "", "On the lateral surfaces of the carcass structure101, respective sidewalls108of vulcanised elastomeric compound, each extended from one of the lateral edges of the tread band109up to the respective bead structure103, are also applied in axially outer position with respect to said carcass structures101.", "", "A strip constituted by elastomeric compound110, commonly known as “mini-sidewall”, made of vulcanised elastomeric compound can possibly be present in the zone of connection between the sidewalls108and the tread band109, this mini-sidewall being generally obtained via co-extrusion with the tread band109and allowing an improvement of the mechanical interaction between the tread band109and the sidewalls108. Preferably the end portion of the sidewall108directly covers the lateral edge of the tread band109.", "", "In several specific embodiments, such as that illustrated and described herein, the rigidity of the bead103can be improved by providing for a reinforcement layer120generally known as “flipper” in the bead of the tire.", "", "The flipper120is wound around the respective bead core102and the bead filler104so as to at least partially surround them. The flipper120is arranged between the carcass layer101and the bead structure103. Usually, the flipper120is in contact with the carcass layer101and said bead structure103. The flipper120typically comprises a plurality of metallic or textile cords embedded in a vulcanised elastomeric compound.", "", "In several specific embodiments, such as that illustrated and described herein, the bead structure103can also comprise a further reinforcement layer121which is generally known with the term “chafer”, and has the function of increasing rigidity and integrity of the bead structure103.", "", "The chafer121usually comprises a plurality of cords embedded in a vulcanised elastomeric compound; such cords are generally made of textile material (e.g. aramid or rayon), or of metallic material (e.g. steel cords).", "", "Possibly an anti-abrasive strip105is arranged so as to enclose the bead structure103along the axially inner, axially outer and radially inner zones of the bead structure103, thus being interposed between the latter and the rim of the wheel when the tire100is mounted on the rim.", "", "A radially inner surface of the tire100is also preferably internally coated with a layer of elastomeric material that is substantially air impermeable, or so-called liner112.", "", "According to a non-shown embodiment, the tire can be a tire for motorcycle wheels. The profile of the cross section of the tire for motorcycle (not illustrated) has a high transverse curvature, since it must ensure a sufficient footprint area in all the inclination conditions of the motorcycle. The transverse curvature is defined by the value of the ratio between the distance f of the top of the tread from the line passing through the laterally opposite ends of the tread itself, measured on the equatorial plane of the tire, and the width C defined by the distance between the laterally opposite ends of the tread itself. With tire with high transverse curvature, it is indicated a tire whose transverse curvature ratio (f/C) is at least 0.20.", "", "The reinforcing elements of the belt structure106, and/or of the carcass structure101, and/or of the bead structure103, such as the flipper120and/or the chafer121, can be advantageously rubber-covered with the elastomeric composition comprising the carbon nanotubes and the predispersion of diene elastomeric polymer and lignin described above, since a lower hysteresis accompanied by a greater conductivity signifies (i) a lower dissipation of energy in the form of heat during operation, preventing the onset of overly high operating temperatures that can risk compromising the integrity of the tire, (ii) a lower fuel consumption, and (iii) a greater dissipation and grounding of the electrostatic charges generated by the rolling of the wheels and by the consequent movement of the vehicle.", "", "The building of the tire100as described above, is actuated by assembly of respective semifinished products on a forming drum, not illustrated, by at least one assembly device.", "", "Built and/or assembled on the forming drum is at least one part of the components intended to form the carcass structure101of the tire100. More particularly, the forming drum is adapted to first receive the possible liner112, and then the carcass ply101. Subsequently, non-illustrated devices engage one of the anchoring annular structures102coaxially around each of the end flaps, they position an external sleeve comprising the belt structure106and the tread band109in position coaxially centred around the cylindrical carcass sleeve and shape the carcass sleeve according to a toroidal configuration by means of a radial dilation of the carcass ply101, so as to determine the application thereof against a radially inner surface of the external sleeve.", "", "Following the building of the green tire100, a moulding and vulcanisation treatment is executed that is aimed to determine the structural stabilisation of the tire100by means of vulcanisation of the elastomeric compounds as well as to impart a desired tread design on the tread band109and to impart possible distinctive graphic marks at the sidewalls108.", "", "The present invention will be further illustrated below by means of a number of preparatory examples, which are provided for indicative purposes only and without any limitation of the present invention."], "claims": ["1 - 10 . (canceled)", "(i) a predispersion of a diene elastomeric polymer and lignin, in an amount to provide the elastomeric composition with 100 phr to 10 phr of diene elastomeric polymer and a quantity of lignin equal to or greater than 20 phr, (ii) from 0 phr to 90 phr of a diene elastomeric polymer, (iii) at least 30 phr of a carbon black reinforcing filler, (iv) optionally, a reinforcing resin comprising at least 0.5 phr of a methylene acceptor compound associated with at least 0.2 phr of a methylene donor compound, (v) from 0.1 phr to 10 phr of carbon nanotubes, and (vi) from 0.1 phr to 12 phr of at least one vulcanising agent, wherein at least 50 phr of the diene elastomeric polymer is constituted by natural or synthetic isoprene rubber.", "12 . The elastomeric composition according to claim 11 , wherein the predispersion of diene elastomeric polymer and lignin is added to the elastomeric composition in a quantity to provide, to the elastomeric composition itself, from 100 phr to 20 phr of diene elastomeric polymer.", "13 . The elastomeric composition according to claim 11 , wherein the predispersion of diene elastomeric polymer and lignin is added to the elastomeric composition in a quantity to provide, to the elastomeric composition itself, from 100 phr to 30 phr of diene elastomeric polymer.", "14 . The elastomeric composition according to claim 11 , wherein at least 60 phr, of the diene elastomeric polymer of the elastomeric composition is constituted by natural or synthetic isoprene rubber.", "15 . The elastomeric composition according to claim 11 , wherein at least 70 phr, of the diene elastomeric polymer of the elastomeric composition is constituted by natural or synthetic isoprene rubber.", "16 . The elastomeric composition according to claim 11 , wherein at least 80 phr, of the diene elastomeric polymer of the elastomeric composition is constituted by natural or synthetic isoprene rubber.", "17 . The elastomeric composition according to claim 11 , wherein the predispersion of diene elastomeric polymer and lignin is added to the elastomeric composition in a quantity to provide, to the elastomeric composition itself, at least 30 phr of lignin.", "18 . The elastomeric composition according to claim 11 , wherein the predispersion of diene elastomeric polymer and lignin is added to the elastomeric composition in a quantity to provide, to the elastomeric composition itself, from 30 phr to 60 phr of lignin.", "19 . The elastomeric composition according to claim 11 , wherein the predispersion of diene elastomeric polymer and lignin is added to the elastomeric composition in a quantity to provide, to the elastomeric composition itself, from 30 phr to 50 phr of lignin.", "20 . The elastomeric composition according to claim 11 , wherein the predispersion of diene elastomeric polymer and lignin comprises a quantity of lignin equal to or greater than 45 phr.", "21 . The elastomeric composition according to claim 11 , wherein the predispersion of diene elastomeric polymer and lignin comprises a quantity of lignin equal to or greater than 50 phr.", "22 . The elastomeric composition according to claim 11 , wherein the predispersion of diene elastomeric polymer and lignin comprises a quantity of lignin equal to or greater than 60 phr and up to 160 phr.", "23 . A reinforcing element constituted by an elongate element coated with, or embedded in, a vulcanised elastomeric compound comprising, before vulcanisation, a vulcanisable elastomeric compound comprising, before mixing, the elastomeric composition according to claim 11 .", "24 . The reinforcing element according to claim 23 , wherein the elongate element is made with a polymeric material selected from the group consisting of polyester, rayon, lyocell, and polyamide, or with metallic material selected from the group consisting of steel and steel coated with copper/zinc, zinc/manganese, and zinc/molybdenum/cobalt metal alloys.", "25 . A structural component comprising at least one reinforcing element constituted by an elongate element coated with, or embedded in, a vulcanised elastomeric compound comprising, before vulcanisation, a vulcanisable elastomeric compound comprising, before mixing, the elastomeric composition according to claim 11 .", "26 . The structural component according to claim 25 , wherein the elongate element is made with a polymeric material selected from the group consisting of polyester, rayon, lyocell, and polyamide, or with metallic material selected from the group consisting of steel and steel coated with copper/zinc, zinc/manganese, and zinc/molybdenum/cobalt metal alloys.", "27 . A tire for vehicle wheels which comprises at least one structural component comprising at least one reinforcing element constituted by an elongate element coated with, or embedded in, a vulcanised elastomeric compound comprising, before vulcanisation, a vulcanisable elastomeric compound comprising, before mixing, the elastomeric composition according to claim 11 .", "28 . The tire for vehicle wheels according to claim 27 wherein the structural component is selected from the group that consists of carcass structure, belt structure, additional belt layer, rubberizing layer, sidewall reinforcement layer or chafer, and bead reinforcement layer or flipper."], "bibtex": "@patent{20250033412,\n    title = {TIRES FOR VEHICLE WHEELS},\n    number = {20250033412},\n    year = {2025},\n    note = {File: US20250033412A1-20250130.XML}\n    }", "classification": "B60C100FI"}, {"title": "NON-PNEUMATIC TIRE", "doc_number": "20250033413", "filename": "US20250033413A1-20250130.XML", "abstract": "A non-pneumatic tire is provided, including a tire tread ( 10 ), a tire bead ( 20 ), and a tire body ( 30 ). The tire body ( 30 ) is provided with multiple first annular cavities ( 31 ) and second annular cavities ( 32 ). The first annular cavity ( 31 ) is provided with multiple sets of bulges ( 311 ) and a first inner brim ( 313 ), and the second annular cavity ( 32 ) is provided with a second inner brim ( 323 ) and an expansion region ( 321 ). A top of the expansion region ( 321 ) has a spherical space ( 322 ). The multiple first annular cavities ( 31 ) and second annular cavities ( 32 ) are arranged side by side in the tire body ( 30 ), constructing an integrally multi-dimensional loading structure.", "detailed_description": ["As shown inFIGS.1to11, the present invention provides a non-pneumatic tire, including a tire tread10and a tire bead20that are concentric, and a tire body30that is integrally connected between the tire tread10and the tire bead20.", "", "The tire is an automotive tire, primarily applied to various types of automobiles; the tire material is selected from a special composite material with high elasticity, tear resistance, and super wear resistance (the material hardness can be selected as needed).", "", "The tire tread10is the surface of the tire in contact with the ground during driving, and lines11for increasing the ground-gripping friction force of the tire are distributed on the tire tread10. Tire shoulders12are formed at the edges on two sides of the tire tread10.", "", "The tire bead20is configured to tightly fit with an automobile hub and is of an annular structure. Multiple strip-shaped protrusions21for elastic contact with the hub are spaced apart along the circumference of the inner side wall of the tire bead20. Unloading grooves22are formed between adjacent strip-shaped protrusions21. Each strip-shaped protrusion21is provided with a step23, one side of the step23being lower than the other side (forming a height difference with the step as the boundary), where the lower side forms a gap with the hub (after the tire fits with the rim). The arrangement of the strip-shaped protrusions21allows for elastic fitting between the tire bead20and the hub. The gap between the unloading groove22and the lower side of the step23provides the deformation space for the tire to deform under squeezing during driving, such that during operation of the tire, the compressive deformation stress on the higher side of the step can be transferred to the deformation space and unloading groove on the other side of the step. This allows the stress to be dispersed and released in a timely manner, avoiding stress concentration on the tire, reducing the temperature during driving with the tire, and reducing high-temperature damage during operation of the tire, thereby prolonging the service life of the tire and improving the driving safety. The number of the strip-shaped protrusions21can be set as needed, and the side edge of the strip-shaped protrusion21adjacent to the unloading groove22is designed as an arc-shaped transition, ensuring that the opening of the unloading groove22between two adjacent strip-shaped protrusions21is fully open. This enlarges the deformation space of the tire and ensures unobstructed stress transfer during deformation under pressure.", "", "Additionally, during the assembly of the tire and hub, the tire needs to be stretched to elastically deform and sleeve the hub, achieving quick assembly of the tire and hub. The unloading groove22can provide a deformation space for the tire to be stretched in this assembly process, eliminating internal stress during the stretching of the tire and improving the assembly convenience of the tire and hub.", "", "The tire body30is provided with multiple first annular cavities31side by side along a width direction of the tire, and the multiple first annular cavities31are distributed side by side around a region between the tire tread10and the tire bead20. A second annular cavity32is provided between adjacent two of the first annular cavities31. Inner walls on two sides of the first annular cavities31separately protrude outwards to form multiple sets of bulges311, a recessed portion312is formed between adjacent two of the sets of bulges311on a same side, the recessed portion312is provided with a first inner brim313corresponding to an inner wall of the first annular cavity31, and inner walls of the bulges311on two sides of the first annular cavity31form an arc-shaped extension region314. The arc-shaped extension region314is integrally connected to the first inner brim313. An expansion region321is formed at a position of the second annular cavity32corresponding to the recessed portion312. A top of the expansion region321has a spherical space322. A second inner brim323is formed at a position of the second annular cavity32corresponding to the arc-shaped extension region314, and the second inner brim323is integrally connected the expansion region321.", "", "Each set of bulges311includes two bulges, the two bulges311are distributed along the radial direction of the tire and integrally connected in the shape of a gourd or peanut shell. A recessed center region315is formed between four bulges311in adjacent sets on the same side. Vent holes33run through the recessed center regions315of the multiple second annular cavities32, and the vent holes33pass through the expansion region321of the second annular cavities32, forming air convection between the interior of the tire body30and the outside, thereby dissipating the heat generated during tire driving in a timely manner and improving the driving safety. Additionally, the vent holes33are also used for positioning during tire molding; the bulges311are spherical or oval. Three first annular cavities31are spaced apart in the tire body30, and the second annular cavity32is provided between adjacent two of the first annular cavities31. A top of the spherical space322of the second annular cavity32is higher than a top of the first inner brim313of the first annular cavity31, and the spherical space322is wider than the expansion region321. Therefore, during the driving process with the tire, when the tire tread10is compressed, the pressure is first transferred to the wall surface of the spherical space322with a large load-bearing area, and then is quickly dispersed to both sides through the expansion region321.", "", "It should be noted that the bulges311on two sides of the first annular cavity31are symmetrically distributed with respect to the center plane316of the first annular cavity31, and asymmetric distribution can also be adopted as needed. The expansion region321and the spherical space322of the second annular cavity32are symmetrically distributed with respect to the center plane324of the second annular cavity32. The outer wall of each bulge311is spherical (here the outer wall of the bulge311mainly refers to the bulges311located on two sides of the tire body30), and may alternatively be of other convex shapes. The thickness of the recessed center region315is greater than the wall thickness of the bulge311. The purpose of designing the recessed center region315with a greater thickness is to make the recessed center region315form a strong support point for the elastic deformation of the tire under pressure, thereby improving the overall load-bearing capacity and the impact-resistance capacity of the tire. The cross-sections of the first inner brim313and the second inner brim323are closed rings in the shape of, for example, an oval or peanut shell, and the wall surface of the first inner brim313corresponding to the recessed center region315may be flat or a combination of flat and arc shapes.", "", "The walls on two sides of each first annular cavity31may serve as tire walls34of the tire, and adjacent tire walls34are integrally connected via the second annular cavity32, forming a structure where multiple sets of tire walls34jointly support the tire tread10, thus allowing for a stable overall structure. In this way, the pressure on the tire can be dispersed via the multiple tire walls34, thereby improving the overall pressure and impact resistance of the tire. The tops of the bulges311of the first annular cavity31facing the outer side of the tire are integrally connected to the lower surface of the tire shoulder12; the compressive forces on both sides of the tire tread10are transferred to the positions of the bulges311through the tire shoulder12for dispersion.", "", "It should be noted that the smaller the area of the cross section (a cross section along the width direction of the tire) of the first inner brim313, the larger the area of the arc-shaped extension region; the smaller the area of the cross section (a cross section along the width direction of the tire) of the second inner brim323, the larger the area of the expansion region321. Correspondingly, the projection area of the tire wall34along the traveling direction of the tire is larger. To be specific, the thicker the individual tire wall34, the larger the area of the load-bearing unit that can support the pressure and load of the tire, and the stronger the support performance of the tire, thereby improving the overall load-bearing performance of the tire.", "", "The second annular cavity32is located in the middle of the tire body30, the spherical space322of the second annular cavity32forms a first load-bearing unit, the expansion region321of the second annular cavity32and the first inner brim313of the first annular cavity31form a second load-bearing unit, and the arc-shaped extension region314of the first annular cavity31and the second inner brim323of the second annular cavity32form a third load-bearing unit.", "", "The first, second, and third load-bearing units transfer the load to each other and elastically support each other, forming a multi-dimensional support structure with a great elastic support capacity and load-bearing capacity. The force on the tire is sequentially transferred and dispersed by the first, second, and third load-bearing units to the inner side of the tire bead20, where the stress is dispersed by multiple structures on the inner side wall of the tire bead20. Multiple arc-shaped extension regions and expansion regions321are designed on the tire body30, which can increase the thickness of the tire walls34, increase the load-bearing area of the tire walls34, and reduce the load per unit area, thereby improving the overall load-bearing capacity of the tire. Therefore, the thickness of the tire tread10can be reduced under the same support strength, improving the comfort when the tire tread10contacts the ground. In addition, the thickness of the tire tread10can be increased as needed to further enhance the tire support strength. Moreover, the concave-convex design (with the distribution form of bulges311and recessed portions312on the side surface) of the tire wall34can improve the elasticity and rebound acceleration of the tire during load operation of the tire, so as to adapt to different road conditions. Multiple recessed center regions315on the tire walls34can form multiple support points, further improving the overall load-bearing capacity and impact-resistance capacity of the tire.", "", "As compared with the non-pneumatic tire having a honeycomb-shaped, V-shaped, or <<-shaped structure, with the left and right communicating with each other in a through manner, on the side surface, the tire wall34has multiple bulges311that are integrally connected to form a concave-convex structure, and each bulge311and recessed portion312strongly support each other, forming multiple elastic support structures, thus allowing for faster force transfer and higher rebound acceleration. Therefore, the tire in the present invention can adapt to various harsh road conditions, improving the overall load-bearing performance and impact resistance of the tire, and providing better driving experience. The projection width (for example, the distance between the tops of the bulges311on two sides) of the tire wall34of this tire in the traveling direction of the tire is equivalent to multiple times the tire wall width of the conventional pneumatic tire of the same model, thereby expanding the load-bearing area of the tire wall34of the tire, enhancing the overall structural strength of the tire, and further improving the load-bearing capacity of the tire.", "", "Air holes24corresponding to the first annular cavity31and the second annular cavity32are respectively provided on the inner wall of the tire bead20, and vent holes are also spaced apart on the fitting hub to work with the air holes24on the tire, forming air convection between the tire, the hub, and the outside. This dissipates the heat inside the tire, reduces the heat generated by material compression in the tire, and prolongs the service life of the tire. The air holes24corresponding to the first annular cavity31and the air holes24corresponding to the second annular cavity32are staggered in the width direction of the tire, which can avoid local tensile damage to the tire caused by stress concentration due to parallel distribution or other concentrated distribution methods of the air holes24. In addition, the vent holes33enable communication between the first annular cavity31and the second annular cavity32, and the arrangement of the air holes24allows for air circulation between the hub, the inside of the tire, and the outside, thus dissipating the heat inside the tire in a timely manner.", "", "The air hole24corresponding to the first annular cavity31on the tire bead20is oval and located in the unloading groove22, and communicates with the arc-shaped extension region314, and the air hole24corresponding to the second annular cavity32is provided on the strip-shaped protrusion21and circular, and communicates with the expansion region321.", "", "At one end of the multiple strip-shaped protrusions21, bumps25are provided for elastic contact with one side edge of the hub, and the strip-shaped protrusions21face the recessed portions312on two sides of the tire body30. The bump25is correspondingly located at the tail end of the recessed portion312, and the shape of the bump25may be spherical, hemispherical, or oval, with the contact surface between the bump25and the hub being flat or spherical. At the other end of the multiple strip-shaped protrusions21, recesses26are provided for close fitting with the other side edge of the hub. A lower end of the bulge311on one side of the tire body30is provided with a fitting slot27for engagement with an edge of a hub, multiple arc-shaped protruding blocks28that are configured to elastically abut against the edge of the hub are spaced apart in the fitting slot27along a circumferential direction of the tire body30, and a lower end of the bulge311on the other side of the tire body30is provided with a snap-fitting point29for engagement with an edge of the hub.", "", "The arrangement of the bump25and the arc-shaped protruding block28is mainly for forming close fitting with the edges on two sides of the hub, achieving comprehensive fitting of the tire and the hub, thus improving the tightness and firmness of the combination of the tire and the hub. This increases the friction between the tire and the hub, preventing the tire from slipping and separating from the hub due to large torque during driving with the tire, and prolonging the service life of the tire. In addition, the elastic contact between the multiple bumps25and arc-shaped protruding blocks28and the hub can improve the overall elasticity of the tire, further reducing and filtering out the rigid vibrations brought by the road conditions. Moreover, a gap is formed in the surrounding region of the contact position between the bump25and the arc-shaped protruding block28and the hub, providing a deformation space for the tire to deform under pressure and impact, further reducing high-temperature damage caused by the inability to release compressive stress in the tire. The recess26, the fitting slot27, and the snap-fitting point29are configured to allow for tighter fitting between the tire and the hub edge. They complement the bump25and the arc-shaped protruding block28in function, providing an elastic buffer space on the base of tight fitting between the tire and the hub, thereby enhancing the overall performance of the tire.", "", "The tire is integrally cast using a high-elasticity polymer material. In addition to being non-pneumatic, wear-resistant, environmentally friendly, and energy-saving, its unique high-strength multidimensional structure perfectly combines comfort and high load-bearing performance. This scientifically resolves the current problems of solid foam tires on the market, such as poor tear resistance and heat dissipation, and also resolves the problems of poor shock absorption performance and high-speed vibration of the conventional non-pneumatic honeycomb-shaped tire.", "", "Furthermore, a nearly closed structure (except for several vent holes, other parts are closed), is used on two sides of the tire, which effectively reduces the wind resistance during driving with the tire, decreases the tire noise, reduces the noise during automobile driving, and improves driving comfort.", "", "It should be noted that when a passenger car tire is made of a polyurethane material with a Shore hardness of 85 A, it can provide the same comfort as the pneumatic tire, and also produce less tire noise. Additionally, the hollow structure in the tire is designed to enable the tire tread to yield, providing a strong ground-gripping force when the tire is in contact with the ground. Specifically, the multidimensional support structure in the tire can provide strong elastic support when the tread is under pressure. After being under pressure, the multidimensional support structure can map out multiple support points on the tire tread in reverse, forming multiple support points. This allows for during driving with the tire not only contact between the tire tread and the road surface, but also dispersed and reinforced contact of multiple support points. This increases more effective and strong contact surfaces between the tire tread and the road surface, thereby increasing tire friction of the tire and effectively preventing the tire from slipping during operation.", "", "When this tire is applied to a forklift, it is made of the tire elastomer material with a Shore hardness of 93 A. It has been found through tests that this tire has not only the high load-bearing capacity of the solid rubber tire but also the comfort of the pneumatic tire. Moreover, it has a strong ground-gripping force and a wear-resistant life of more than three times that of the rubber tire.", "", "The design key point of the present invention is that the multiple first annular cavities and second annular cavities are arranged side by side in the tire body, the bulges and first inner brims are formed on the first annular cavities, the expansion regions and second inner brims are arranged on the second annular cavities, the bulges are connected to the second inner brims, and the expansion regions are connected to the first inner brims. The first annular cavities and the second annular cavities are closely connected to form three load-bearing units that can sequentially transfer load. Additionally, a concave-convex design of the tire wall is achieved via the distribution of the bulges and recessed portions, enlarging the tire wall width and increasing multiple support points. This improves the overall structural strength and elastic cushioning capability of the tire, enhancing the load-bearing capacity and impact-resistance capacity of the tire, and improving the driving comfort. In addition, multiple deformation spaces are provided on the tire wall for the tire to deform under pressure, providing a favorable condition for stress transfer when the tire is under pressure. Thus, when the tire is driven in different environments, the stress can be quickly released through deformation, reducing high-temperature damage due to stress concentration, thereby improving the driving safety of the tire and prolonging the service life of the tire.", "", "The above description shows merely preferred embodiments of the present invention and is not intended to limit the technical scope of the present invention. Any minor modifications, equivalent changes, and adjustments made based on the technical essence of the present invention still fall within the scope of the technical solution of the present invention."], "claims": ["1 . A non-pneumatic tire, comprising a tire tread and a tire bead that are concentric, and a tire body that is integrally connected between the tire tread and the tire bead, the tire body is provided with multiple first annular cavities side by side along a width direction of the tire, and the multiple first annular cavities are distributed side by side around a region between the tire tread and the tire bead; a second annular cavity is provided between adjacent two of the first annular cavities; inner walls on two sides of the first annular cavities separately protrude outwards to form multiple sets of bulges, a recessed portion is formed between adjacent two of the sets of bulges on a same side, a first inner brim is formed at a position of the recessed portion corresponding to an inner wall of the first annular cavity, and inner walls of the bulges on two sides of the first annular cavity form an arc-shaped extension region located at a periphery of the first inner brim; and a second inner brim is formed at a position of the second annular cavity corresponding to the arc-shaped extension region, an expansion region located at a periphery of the second inner brim is formed at a position of the second annular cavity corresponding to the recessed portion, and a top of the expansion region has a spherical space close to the tire tread.", "2 . The non-pneumatic tire according to claim 1 , wherein the second annular cavity is located in the middle of the tire body, the spherical space of the second annular cavity forms a first load-bearing unit, the expansion region of the second annular cavity and the first inner brim of the first annular cavity form a second load-bearing unit, and the arc-shaped extension region of the first annular cavity and the second inner brim of the second annular cavity form a third load-bearing unit.", "3 . The non-pneumatic tire according to claim 1 , wherein each set of bulges comprises two bulges, the two bulges are distributed along a radial direction of the tire and integrally connected, and a recessed center region is formed between four bulges in adjacent two of the sets of bulges on the same side of the first annular cavities.", "4 . The non-pneumatic tire according to claim 3 , wherein the recessed center region runs through the tire to be provided with a vent hole along a width direction of the tire, and the vent hole runs through the first annular cavity and the second annular cavity.", "5 . The non-pneumatic tire according to claim 1 , wherein edges of two sides of the tire tread form tire shoulders, and a top of the bulge of the first annular cavity facing an outer side of the tire is integrally connected to a lower surface of the tire shoulder.", "6 . The non-pneumatic tire according to claim 1 , wherein a contact wall of the tire bead with a hub has a deformation space for the tire to deform under pressure.", "7 . The non-pneumatic tire according to claim 6 , wherein multiple strip-shaped protrusions are spaced apart on an inner wall of the tire bead along a circumferential direction thereof, an unloading groove is formed between adjacent two of the strip-shaped protrusions, a step is formed on the strip-shaped protrusion to cut the strip-shaped protrusion into two portions with a height difference, and the steps and the unloading grooves provide the deformation space for the tire to deform under pressure.", "8 . The non-pneumatic tire according to claim 7 , wherein the inner wall of the tire bead is provided with air holes respectively corresponding to the first annular cavity and the second annular cavity, the air hole corresponding to the first annular cavity and the air hole corresponding to the second annular cavity are staggered with each other in the width direction of the tire, the air hole corresponding to the first annular cavity is oval and located in the unloading groove, and the air hole corresponding to the second annular cavity is circular and located on the strip-shaped protrusion.", "9 . The non-pneumatic tire according to claim 8 , wherein the air hole corresponding to the first annular cavity communicates with the arc-shaped extension region, and the air hole corresponding to the second annular cavity communicates with the expansion region.", "10 . The non-pneumatic tire according to claim 7 , wherein one end of the strip-shaped protrusion is provided with a bump configured to be in elastic contact with one side edge of the hub, and the other end of the strip-shaped protrusion is provided with a recess used for closely fitting with the other side edge of the hub.", "11 . The non-pneumatic tire according to claim 1 , wherein the bulge is spherical or oval, and the first inner brim and the second inner brim are oval or peanut shell-shaped.", "12 . The non-pneumatic tire according to claim 1 , wherein three such first annular cavities are spaced apart in the tire body, and the second annular cavity is provided between adjacent two of the first annular cavities.", "13 . The non-pneumatic tire according to claim 1 , wherein a lower end of the bulge on one side of the tire body is provided with a fitting slot for engagement with an edge of a hub, multiple arc-shaped protruding blocks that are configured to elastically abut against the edge of the hub are spaced apart in the fitting slot along a circumferential direction of the tire body, and a lower end of the bulge on the other side of the tire body is provided with a snap-fitting point for engagement with an edge of the hub.", "14 . The non-pneumatic tire according to claim 1 , wherein a top of the spherical space of the second annular cavity is higher than a top of the first inner brim of the first annular cavity.", "15 . The non-pneumatic tire according to claim 1 , wherein the spherical space of the second annular cavity is wider than the expansion region.", "16 . The non-pneumatic tire according to claim 7 , wherein a side edge of the strip-shaped protrusion close to the unloading groove has an arc-shaped transition.", "17 . The non-pneumatic tire according to claim 10 , wherein the strip-shaped protrusion faces the recessed portions on two sides of the tire body, and the bump is correspondingly located at a tail end of the recessed portion."], "bibtex": "@patent{20250033413,\n    title = {NON-PNEUMATIC TIRE},\n    number = {20250033413},\n    year = {2025},\n    note = {File: US20250033413A1-20250130.XML}\n    }", "classification": "B60C712FI"}, {"title": "SPOKE FOR NON-PNEUMATIC TIRE", "doc_number": "20250033414", "filename": "US20250033414A1-20250130.XML", "abstract": "A non-pneumatic wheel ( 10 ) having a hub ( 12 ), an outer tread band ( 200 ) and a plurality of spokes ( 100 ) connecting the hub with the outer tread band, each of the plurality of spokes having first and second spoke elements ( 140 ) joined by a body ( 130, 136 ) comprised of an elastomer connecting the first spoke element to the second spoke element, wherein at least one of a second ( 112 ) and a third ( 114 ) joint body has a heel portion ( 190, 191 ) made of a rubber composition having a higher rigidity.", "detailed_description": ["Embodiments of the present invention include spokes that are useful for non-pneumatic tires and more specifically, spokes that are formed at least in part of an elastomeric material, such as rubber. As noted above, the concept of non-pneumatic tires that use spokes to transmit a load between the hub and the outer tread band is well known in the industry. An improvement to the spokes that are disclosed herein provides increased durability and reduced rolling resistance for a non-pneumatic tire—and therefore improved fuel economy—when included in a non-pneumatic tire.", "", "More generally embodiments of the present invention provide a mechanical structure for resiliently supporting a load. As described more fully below, the spokes disclosed herein have a V-shaped form and extend between a hub and a band; typically embodiments of non-pneumatic tires may include an outer band having the shear band and the tread. Each leg or support element forming the V-shaped spoke includes a coating of a rubber composition and in particular embodiments, the proximal end of each leg is attached to the hub or tread band, respectively, with an elastomeric joint body formed of an ultra-low hysteresis rubber composition. An ultra-low rubber composition also forms an elastomeric joint body that is positioned within the V-shaped interior angle of the spoke that connects the distal ends of the legs, i.e., the ends opposite to the proximal ends.", "", "As previously noted, the spokes disclosed herein provide improved rolling resistance and improved durability of a non-pneumatic tire over other materials that have been found to be suitable for use in making spokes for non-pneumatic tires. To further improve the durability, particular embodiments of the present invention may further provide that the elastomeric joint bodies that attach the proximal ends of the spokes to the hub and band include a heel that is formed at their proximal ends and manufactured of a rubber composition as further discussed below.", "", "For purposes of describing the invention, reference now will be made in detail to embodiments and/or methods of the invention, one or more examples of which are illustrated in or with the drawings. Each example is provided by way of explanation of the invention, not limitation of the invention. In fact, it will be apparent to those skilled in the art that various modifications and variations can be made in the present invention without departing from the scope or spirit of the invention. For instance, features or steps illustrated or described as part of one embodiment, can be used with another embodiment or steps to yield a still further embodiments or methods. Thus, it is intended that the present invention covers such modifications and variations as come within the scope of the appended claims and their equivalents.", "", "The following terms are defined as follows for this disclosure:", "", "“Axial direction” or the letter “A” in the figures refers to a direction parallel to the axis of rotation of for example, the shear band, tire, and/or wheel as it travels along a road surface.", "", "“Radial direction” or the letter “R” in the figures refers to a direction that is orthogonal to the axial direction and extends in the same direction as any radius that extends orthogonally from the axial direction.", "", "“Equatorial plane” means a plane that passes perpendicular to the axis of rotation and bisects the outer tread band and/or wheel structure.", "", "“Circumferential direction” or the letter “C” in the figures refers to a direction is orthogonal to the axial direction and orthogonal to a radial direction.", "", "“Forward direction of travel” or the letter “F” in the figures refers to the direction the tire was designed to predominantly travel in for aesthetics and or performance reasons. Travel in a direction different than the forward direction of travel is possible and anticipated.", "", "“Direction of rotation” or the letter “D” in the figures refers to the direction the tire was designed to predominantly rotate in for aesthetics and/or performance reasons. Rotation in a direction opposite than the direction of rotation is possible and anticipated.", "", "“Radial plane” means a plane that passes perpendicular to the equatorial plane and through the axis of rotation of the wheel.", "", "“Lateral direction” or the letter “L” means a direction that is orthogonal to an equatorial plane.", "", "“Elastic material” or “Elastomer” as used herein refers to a polymer exhibiting rubber-like elasticity, such as a material comprising rubber.", "", "“Elastomeric” as used herein refers to a material comprising an elastic material or elastomer, such as a material comprising rubber.", "", "“Interior angle” or “Internal angle” as used herein means an angle formed between two surfaces that is greater than 0 degrees but less than 180 degrees. An acute angle, a right angle and an obtuse angle would all be considered “interior angles” as the term is used herein.", "", "“Exterior angle” or “External angle” or “Reflex angle” as used herein means an angle formed between two surfaces that is greater than 180 degrees but less than 360 degrees.", "", "“Deflectable” means able to be bent resiliently.", "", "“Nominal load” or “desired design load” is a load for which the structure is designed to carry. More specifically, when used in the context of a wheel or tire, “nominal load” refers to the load for which the wheel or tire is designed to carry and operate under. The nominal load or desired design load includes loads up to and including the maximum load specified by the manufacturer and, in the case of a vehicle tire, often indicated by marking on the side of a the tire. A loading condition in excess of the nominal load may be sustained by the structure, but with the possibility of structural damage, accelerated wear, or reduced performance. A loading condition of less than nominal load, but more than an unloaded state, may be considered a nominal load, though deflections will likely be less than deflections at nominal load.", "", "“Modulus” or “Modulus of elongation” (MPa) was measured at 10% (MA10) at a temperature of 23° C. based on ASTM Standard D412 on dumb bell test pieces. The measurements were taken in the second elongation; i.e., after an accommodation cycle. These measurements are secant moduli in MPa, based on the original cross section of the test piece.", "", "As used herein, “phr” is “parts per hundred parts of rubber by weight” and is a common measurement in the art wherein components of a rubber composition are measured relative to the total weight of rubber in the composition, i.e., parts by weight of the component per 100 parts by weight of the total rubber(s) in the composition.", "", "As used herein, “based upon” is a term recognizing that embodiments of the present invention are made of vulcanized or cured rubber compositions that were, at the time of their assembly, uncured. The cured rubber composition is therefore “based upon” the uncured rubber composition. In other words, the cross-linked rubber composition is based upon or comprises the constituents of the cross-linkable rubber composition.", "", "The Architecture of an Exemplary Non-Pneumatic Tire.FIG.2shows a lateral side view of an exemplary embodiment of the present invention wherein a plurality of resilient composite structures are configured as spokes100and are attached to an outer tread band200forming a part of a tire10. The tire10may be incorporated into a wheel. For example the tire10may be part of non-pneumatic wheel having a hub12which is attached to a passenger vehicle allowing the vehicle to roll across a ground surface. Other objects and vehicles may incorporate the invention, including but not limited to: heavy duty truck, trailer, light truck, off-road, ATV, bus, aircraft, agricultural, mining, bicycle, motorcycle and passenger vehicle tires. Such a non-pneumatic wheel would possess a hub12that would have a radially outer surface having an axis of revolution about a central axis20. The tire10may be attached to the hub12by any of a number of methods, for example, by mechanical fasteners such as bolts, screws, clamps or slots, and/or by adhesives such as cyanoacrylates, polyurethane adhesives, and/or by other bonding materials or a combination thereof.", "", "The tire10shown here possesses an axis of rotation20about which the tire10rotates. In this exemplary embodiment, the radially outer surface230of the outer tread band200interfaces with a ground surface30over which the tire rolls. Under a nominal load, the spokes100of the tire flex as the tire enter and exit the contact patch. Smaller deflections occur in the spokes100as the spoke rotates about the axis20outside the contact patch, but most of the deflection occurs while the spoke100enters, exits and travels through the contact patch.", "", "Each spoke100possesses a “nose” portion130which acts as a resilient hinge. The “nose” portion130is an elastomeric joint body connecting a support element forming the radially inner portion of the spoke and a support element forming the radially outer portion of the spoke. The support elements, or legs of the spoke100are initially positioned at an angle relative to each other. The angle between the spoke support elements measuring less than 180 degrees is the interior angle and the angle between the spoke support elements measuring greater than 180 degrees is the exterior angle. The elastomeric joint is comprised of an elastomer attached to each spoke support element and is positioned on the side of the spoke elements on the interior angle side.", "", "The radially inner portion of the spoke possesses a radially inner foot112which connects to another surface, which is the radially outer surface of the hub12in the present embodiment. In the present embodiment, the radially inner foot112is comprised of an elastomeric joint body that connects the radially outer support to the hub12. The radially outer portion of the spoke100possesses a radially outer foot114which is comprised of another elastomeric body which connects the outer support element to yet another surface which is in the present embodiment the radially inner surface of the outer tread band200.", "", "In the exemplary embodiment shown, the tread band200comprises an elastomeric material and allows deformation to form a planar footprint in the contact patch. In the exemplary embodiment shown, the radially outer foot114of the spoke100is attached to the radially inner surface202of the tread band200and to the opposite side of the support element from the nose portion130. In the exemplary embodiment shown, the spoke is adhered in place by an adhesive. In other embodiments, the spoke may be attached by other methods, including by adhering the elastomeric material together, for instance by using green rubber and curing the rubber components together, or using a strip of green rubber between cured or partially cured rubber components. In some embodiments, the outer tread band200may also possess a reinforcement to help carry the load circumferentially around the tire.", "", "For this particular embodiment, the size of the tire100is similar to a pneumatic tire size of 215/45R17 with the lateral width of the tread being about 215 mm and having an outer tread band diameter of about 620 mm.", "", "FIG.3shows the exemplary embodiment of the invention, configured as a spoke in a wheel10, where the embodiment is loaded in excess of its nominal load. In this particular instance, the tire was loaded with 1000 kg of mass load (approximately 9800 N force). In this case the deflection exceeded 20 mm and resulted in contact between the spoke nose portion130and spoke foot portions110. Under such conditions, the nose and foot portions may act as a “bump stop” unloading the leg portions of the spoke. The individual spokes100in this situation may make contact with one another as they enter, exit and or travel through the contact patch. The contact is illustrated as occurring between the nose portion130and the radially outer foot114where the spokes are entering the contact patch and contact is illustrated as occurring between the nose portion130and the radially inner foot portion112where the spokes are exiting the contact patch. While contact of an individual spoke with the spoke adjacent to it may occur, a portion of the load may be transferred in this case, through the radially inner foot112, through the nose portion of the spoke130, through the radially outer foot114and through the outer tread band200to the ground30. In a sense, the shape of the spokes of the present embodiment shown may act as a “bump stop” to prevent structural damage to the support elements or legs of the spoke connecting the feet112,114with the nose130of the spoke. Such conditions of loading in excess of the nominal load could occur with overloading the vehicle with excess mass, or could occur if the tire encounters an obstacle, such as a curb, while traveling at high speed. While this particular embodiment behaves in this particular manner, other embodiments of the invention may behave differently, and may or may not exhibit “bump stop” qualities.", "", "In the embodiment shown, the outer band200possesses reinforcement210to strengthen the outer band. A tread230is provided on the radially outer surface of the outer band200.", "", "Spoke Construction.FIG.4provides a perspective view of the spoke100embodiment. In this particular embodiment, the spoke maintains a similar cross section profile in the lateral direction of the spoke. It can be seen that the feet110, both the radially inner foot112and radially outer foot114, each provide an attachment point to the hub12and outer band200of the wheel10. A widening in the circumferential direction at the radially inner end of the radially inner foot112provides circumferentially broad surface122for attachment, such as adhering, bonding and/or mechanically, to the hub12. Likewise a widening in the circumferential direction at the radially outer end of the radially outer foot114provides circumferentially broad surface124for attachment, such as adhering, bonding and/or mechanically, to the outer tread band200. The radially inner surface122and radially outer surface124in the embodiment shown are shown to be slightly curved in the circumferential direction of the spoke to match the radius of curvature of the hub and radially inner surface202of the outer band200at the location where the spoke attaches in the respective positions. Alternatively, the surface of the radially inner surface122and radially outer surface124may also be flat in the circumferential direction of the spoke.", "", "The nose portion, or otherwise referred to as the “joint body”130of the spoke100of the embodiment shown is comprised of an elastomeric material and acts to connect a first and second support element, here comprising a radially inner leg142and a radially outer leg144respectively. The nose portion becomes thicker in the circumferential direction between the radially inner leg142and radially outer leg144. The circumferential direction of the spoke should be understood in this embodiment to be the same as the circumferential direction of the wheel10. In reference to a single spoke as shown in this embodiment, the circumferential direction is generally orthogonal to both the radial direction and the lateral direction.", "", "It may be observed that the radially inner leg142is slightly shorter than the radially outer leg144in the embodiment shown. This difference in length accommodates the change in radius as the spoke travels through the contact patch maximizing the space available for the adjacent spokes to “nest.”", "", "FIG.5shows a front view of the spoke in a circumferential direction. In this embodiment, the radially inner surface possesses a first and second protrusion166,168which creates radially inner surface122that is curved in the lateral direction. This causes the cross section of the spoke100to vary slightly in the lateral direction. In alternative embodiments the spoke100may maintain an identical cross section in the lateral direction.", "", "FIG.6shows a section view of the embodiment showing the main components of the spoke100. The spoke100of the embodiment shown is comprised of rubber of the general type used in the construction of conventional rubber pneumatic radial tires, polyester cord material and fiberglass reinforced resin. Particular embodiments that include more detailed materials information is provided below in the disclosure.", "", "The rubber used in the embodiment shown comprises of a relatively soft rubber having a modulus of 4.8 MPa in the areas of the radially inner elastomeric joint body112and radially outer elastomeric joint body114. Each elastomeric joint body112,114is attached to the radially inner leg142and radially outer leg144respectively. The radially inner leg142and radially outer leg144are constructed to give them flexural rigidity, that is, to allow them to resiliently deform when the spoke100is under compression or tension. The radially outer end148of the radially outer leg144is attached to the elastomeric joint body114, but in the embodiment shown is otherwise “free” and may move to compress or stretch the elastomeric joint body114when the spoke is being stretched or compressed. Likewise the radially inner end146of the radially inner leg142is attached to the elastomeric joint body112, but in the embodiment shown is otherwise “free” and may move to compress or stretch the elastomeric joint body112when the spoke100is under compression or tension. In alternative embodiments the radial inner ends146of the radially inner leg142may be retained by a reinforcement membrane, and otherwise not “free.” In the same or yet other alternative embodiments the radially outer end148of the radially outer leg144may be retained by a reinforcement membrane and be otherwise not “free.” The radially inner elastomeric joint body112becomes thicker in the circumferential direction nearer the hub12to which it is attached. In the embodiment shown, the elastomeric joint body112flairs outward forming a protrusion116nearest the hub12. Likewise, the radially outer elastomeric joint body114becomes thicker in the circumferential direction nearer the outer band200to which it is attached. In the embodiment shown, the elastomeric joint body114flairs outward forming a protrusion118nearest the outer band200.", "", "In the embodiment shown, a membrane132is used to reinforce the nose section130of the spoke100. The membrane structure132of the embodiment shown is comprised of polyester fibers made from an 1100 by 2 cord with a pace of approximately 1 mm and a tensile modulus of approximately 3,750 MPa. Such reinforcement fibers are similar to that commonly used in the radial cords of a pneumatic tire. The rubber surrounding the reinforcements of the membrane has a modulus of approximately 5 MPa. For the embodiment shown, this rubber is of a type used in the construction of a conventional pneumatic radial tire. Alternatively, other membrane reinforcement materials may be used, including using chords of other materials, such as aramid, cotton, nylon or rayon or combinations thereof. Alternatively, the reinforcement pace, filament count, cord count and diameter may vary. In the embodiment shown, the reinforcement membrane132extends approximately one-fifth of the height of the spokes, generally co-extensive with the generally triangular shaped nose elastomeric joint body136. In the embodiment shown, the elastomeric joint body136thickens and flairs outward in the circumferential direction near the middle section between the radially inner and radially outer spoke legs142,144, forming a protrusion138at approximately the midpoint of the elastomeric joint body136.", "", "The reinforcement cords of the reinforcement membranes132of the exemplary embodiment are oriented generally in the radial direction along the length of the membranes.", "", "The legs142,144of the spoke100are comprised of fiber reinforced plastic reinforcements surrounded by a rubber to form a membrane. In particular embodiments, the leg membranes142,144possess a flexural rigidity, for example, of approximately 140,000 N-mm2. In this particular embodiment, the filaments have a diameter of approximately 1 mm with a pace of about 2 mm apart. The filaments of the particular embodiment shown are glass reinforced resin formed by pultrusion. The filaments of the embodiment have a modulus of approximately 10 MPa. Alternatively other reinforcements may be used, including carbon fiber such as graphite epoxy, glass epoxy or aramid reinforced resins or epoxy or combinations thereof. Unreinforced plastic reinforcements or metallic reinforcements may also be used, provided they have sufficient flexural rigidity for the nominal loads intended to be supported. Alternatively other pacing and other diameters diameter of the membranes and reinforcements may be used. The legs142,144of the spoke100have a relatively large stiffness compared to the other components comprising the spoke100. The legs142,144resist act resiliently and have a large bending stiffness allowing the nose portion130of the spoke to act as a joint body connecting the radially inner leg142with the radially outer leg144. The feet112,114act as second and third joint bodies, connecting the radially inner leg142to the hub and the radially outer leg144with the outer band200.", "", "FIG.7shows a partial lateral section view of the exemplary embodiment of a spoke100that can be attached to an outer tread band200and hub12and forming a part of a tire10.", "", "When the spoke100is deformed radially inward, undergoing compression between the radially outer foot114and radially inner foot112, the elastomeric joint body136of the nose130undergoes compression between the radially inner leg142and radially outer leg144of the spoke. The radially outer elastomeric joint body114of the radially outer foot114undergoes compression along the portion closest to the nose130and undergoes tension on the distal portion of the elastomeric joint body114.", "", "Similarly at the radially inner foot112, when the spoke100is deformed radially inward, the elastomeric joint body112of the radially inner foot112undergoes compression along the portion closest to the nose130and undergoes tension on the distal portion of the elastomeric joint body112.", "", "The dashed lines inFIG.7show the spoke100′ undergoing compression between the radially outer foot114′ and the radially inner foot112′. The compressed spoke100′ is shown positioned with the hub mating surface122,122′ fixed in position while the radially outer foot114,114′ is displaced radially inward. As such, it may be observed that the radially inner portion146,146′ of the radially inner leg142,142′ is displaced radially outward when the spoke is compressed such that the radially inner portion146′ of the radially inner leg142′ moves radially outward relative to the radially inner surface122′ of the radially inner foot112′. Likewise, a similar displacement occurs at the radially outer foot114,114′ with the radially outer portion148,148′ of the radially outer leg144,144′ is displaced radially inward when the spoke is compressed such that the radially outer portion148′ of the radially outer leg144′ moves radially inward relative to the radially outer surface124′ of the radially outer foot114′. The construction of the spoke permitting displacement of the radially outer portion148,148′ of the radially outer leg144,144′ and radially inner portion146,146′ of the radially inner leg142,142′ is referred herein as having a “free” spoke end. Alternatively, the radially outer portion of the radially outer leg and/or the radially inner portion of the radially inner leg may have a reinforcement membrane extending along the proximal end of of inner or outer leg and extending around and along at least a portion of the radially outer surface of the radially outer foot or radially inner surface of the radially inner foot. This membrane acts to constrain the end of the spoke.", "", "The nose portion130of the present embodiment possesses a reinforcement membrane132which constrains the radially inner portion of the radially outer spoke144and radially outer portion of the radially inner spoke142, restraining them from displacing away from one another when the spoke is under compression. The elastomeric joint body136undergoes compression when the spoke100is compressed. It may be observed that the portion of the elastomeric joint body136farthest from the reinforcement membrane132is contracted radially as the spoke100is compressed. The construction of the spoke disallowing displacement of the radially inner portion of the radially outer leg144and radially outer portion of the radially inner leg142may be referred herein as being “constrained” or “not free.”", "", "FIG.8shows the same embodiment when in tension such that the radially outer foot114,114″ is displaced away from the radially inner foot112,112″. The spoke100shown generally unloaded in solid lines and also the spoke100′ is shown in tension by the dashed lines. Note how the portions of the feet112,112″,114,114″ which underwent compression when the spoke was in compression are undergoing tension when the spoke is undergoing tension as shown in the present figure. Likewise the portions of the elastomeric joint bodies of the feet112,112″,114,114″ which underwent tension when the spoke was in compression are undergoing compression when the spoke is undergoing tension as shown in the present figure. The elastomeric joint body136,136″ of the nose portion130,130″ undergoes tension in the portion closest to the feet112,112″,114,114″ of the spoke100,100″.", "", "FIG.9shows a perspective cutaway view of the spoke embodiment and further provides an example of a spoke having a heel portion as well as having a spoke leg with two different rubber coatings. Portions of the reinforcement134of the nose reinforcement membrane132are shown, as well as a portion of the elongated leg reinforcements146of the leg140and a part of the foot reinforcements of the foot reinforcement membrane are shown as well. The reinforcement of the nose membrane are shown oriented generally in the radial direction and wrapped around the nose130of the spoke100. The support element140reinforcements146are shown as elongated reinforcements oriented generally in the radial direction along the length of the support elements140.", "", "FIG.9further shows an example of an embodiment that includes a heel portion with two different rubber coatings on the spoke legs. In particular embodiments the durability of the spokes disclosed herein may be improved by adding a heel portion190,191to the proximal ends of the elastomeric joint bodies112,114. While the elastomeric joint bodies112,114are typically formed of an ultra-low hysteresis material, the heel portions190,191may be formed of an elastomeric material having a higher rigidity and improved tear characteristics.", "", "As noted, particular embodiments of the spokes disclosed herein may include two different rubber compositions coating the spoke legs. In such embodiments, the elongated leg reinforcements146are covered by a first rubber composition layer193on the same side of the leg140as the elastomeric joint bodies112,114and by a second rubber composition layer192on the opposite side of the leg140. These embodiments may be accomplished by laying down a first thin rubber skim of the first rubber composition layer, putting the elongated leg reinforcements on top of this layer and then adding a second thin rubber skim of the second rubber composition layer on top of that.", "", "Other embodiments of spokes may include using different rubber compositions on the same side of the leg140. For example, particular embodiments may include coating one or both sides of the leg140with a first rubber composition starting from the proximal end of the leg and coating at least 25% of its length, or alternatively at least 50% or at least 75% of its length and then coating the remainder of the length with a second rubber composition. In particular embodiments of the spokes disclosed herein, the side of the leg with the elastomeric joint bodies may be coated with a rubber composition having better tear properties near the for a portion of its length from the proximal end and then a second rubber composition with lower hysteresis properties for the remainder of its length. Those skilled in the art can imagine different arrangements of rubber compositions having differing properties coating different sections of the legs and such embodiments are not excluded by the particular embodiments disclosed above.", "", "Alternative embodiments of the invention are also possible and anticipated. For example,FIG.10shows a section view of an alternative embodiment wherein the nose reinforcement membrane is not present. Instead, the portion of elastomeric joint body136of the nose130farthest from the feet112,114is allowed to stretch apart in the radial direction when the spoke is under compression, much like the portion of the elastomeric joint bodies112,114farthest from the nose portion130of the spoke100. Thus in this embodiment, the radially inner end of the radially outer support element144and the radially outer end of the radially inner support element142are “free.” In this particular embodiment, additional reinforcement172is placed in the elastomeric joint body136of the nose portion130. This additional reinforcement inhibits movement of the elastomeric joint body in the circumferential direction that otherwise would occur due to the Poisson effect of compression and tension of the elastomeric joint body136. In this particular embodiment, elongated reinforcements172are oriented in the circumferential direction generally bisecting the elastomeric joint body136in to two portions; a radially outer portion and a radially inner portion.", "", "FIG.11shows a partial lateral section view of the alternative exemplary embodiment of a spoke100that can be attached to an outer tread band200and hub12and form a part of a tire10.", "", "When the spoke100is deformed radially inward, undergoing compression between the radially outer foot114and radially inner foot112, the elastomeric joint body136of the nose130undergoes compression in the radial direction between the radially inner leg142and radially outer leg144of the spoke along the portion closest to the feet112,114of the spoke100and undergoes tension in the radial direction on the portion of the elastomeric joint body farthest from the feet112,114. The radially outer elastomeric joint body114of the radially outer foot114undergoes compression along the portion closest to the nose130and undergoes tension on the portion of the elastomeric joint body114most distal from the nose portion130.", "", "Similarly at the radially inner foot112, when the spoke100is deformed radially inward, the elastomeric joint body112of the radially inner foot112undergoes compression along the portion closest to the nose130and undergoes tension on the distal portion of the elastomeric joint body112.", "", "The dashed lines inFIG.11show the spoke100′ undergoing compression between the radially outer foot114′ and the radially inner foot112′. The compressed spoke100′ is shown positioned with the hub mating surface122,122′ fixed in position while the radially outer foot114,114′ is displaced radially inward. As such, it may be observed that the radially inner portion146,146′ of the radially inner leg142,142′ is displaced radially outward when the spoke is compressed such that the radially inner portion146′ of the radially inner leg142′ moves radially outward relative to the radially inner surface122′ of the radially inner foot112′. Likewise, a similar displacement occurs at the radially outer foot114,114′ with the radially outer portion148,148′ of the radially outer leg144,144′ is displaced radially inward when the spoke is compressed such that the radially outer portion148′ of the radially outer leg144′ moves radially inward relative to the radially outer surface124′ of the radially outer foot114′. The construction of the spoke permitting displacement of the radially outer portion148,148′ of the radially outer leg144,144′ and radially inner portion146,146′ of the radially inner leg142,142′ is referred herein as having a “free” spoke end. As shown in this alternative embodiment, the radially inner portion of the radially outer support structure144and the radially outer portion of the radially inner support structure142may be referred herein as having “free” spoke ends.", "", "The nose portion130of the present embodiment possesses a reinforcement172which constrains the elastomeric body136in the circumferential direction. The elastomeric joint body136undergoes compression along the portion closest to the feet112,114when the spoke100is compressed. The Poisson effect causes bulging of the elastomeric material when it is under compression, which is restrained here by the reinforcement172.", "", "FIG.12shows the same embodiment when in tension such that the radially outer foot114,114″ is displaced away from the radially inner foot112,112″. The spoke100shown generally unloaded in solid lines and also the spoke100′ is shown in tension by the dashed lines. Note how the portions of the feet112,112″,114,114″ which underwent compression when the spoke was in compression are undergoing tension when the spoke is undergoing tension as shown in the present figure. Likewise the portions of the elastomeric joint bodies of the feet112,112″,114,114″ which underwent tension when the spoke was in compression are undergoing compression when the spoke is undergoing tension as shown in the present figure. The elastomeric joint body136,136″ of the nose portion130,130″ undergoes tension in the portion closest to the feet112,112″,114,114″ of the spoke100,100″ and the portions of the elastomeric joint body136,136″ of the nose portion130,130″ undergoes compression in the portion farthest from the feet112,112″,114,114″ of the spoke100,100″.", "", "FIG.13shows a perspective cutaway view of the spoke embodiment. Portions of the elongated leg reinforcements146of the legs140are shown. The reinforcement172of the elastomeric joint body136is shown as a plurality of reinforcements174oriented in the circumferential direction. The support element140reinforcements146are shown as elongated reinforcements oriented generally in the radial direction along the length of the support elements140. The reinforcements146,174of the present embodiment are pultruded glass resin composite.", "", "FIG.14shows a section view of an alternative embodiment wherein neither the nose reinforcement membrane, nor the elastomeric joint body reinforcement is present. Here, like the previous embodiment, the portion of elastomeric joint body136of the nose130farthest from the feet112,114is allowed to stretch apart in the radial direction when the spoke is under compression, much like the portion of the elastomeric joint bodies112,114farthest from the nose portion130of the spoke100. Thus in this embodiment, the radially inner end of the radially outer support element144and the radially outer end of the radially inner support element142are “free.” In this particular embodiment the elastomeric joint body136of the nose portion130is free of any elongated reinforcements.", "", "FIG.15shows a perspective cutaway view of the spoke embodiment. Portions of the elongated leg reinforcements146of the leg140are shown. The support element140reinforcements146are shown as elongated reinforcements oriented generally in the radial direction along the length of the support elements140. The reinforcements146of the present embodiment are pultruded glass resin composite.", "", "Spoke Elastomeric Materials. As noted above, embodiments of the spokes that are disclosed herein include a rubber coating on the spoke legs and elastomeric joint bodies that connect the proximal ends of the spoke to the hub (the hub joint body) and band (the band joint body) respectively and an elastomeric joint body at the nose section (nose joint body) of the spoke that connects the distal ends of the spoke legs. In particular embodiments, the hub and band joint bodies may include a heel portion located at their proximal ends. To maintain a lower hysteresis in the hub and band joint bodies, particular embodiments that include a heel portion in the joint bodies may provide that no more than 30 vol % of the joint body be the heel portion or alternatively, no more than 25 vol % or no more than 20 vol %. As a lower boundary of the heel volume, particular embodiments that include a heel portion may include at least 5 vol % or at least 10 vol % as the heel portion of the joint body. The percent volume is of the total volume of the joint body, i.e., total volume being the heel and the non-heel portions of the joint body.", "", "In particular embodiments, the heel portion is found to provide improved durability of the proximal ends of the spoke assembly. In such embodiments, the heel portion is of a different rubber composition than the remainder of the elastomeric joint body. The heel, if present, may form a portion of the hub joint body, the band joint body or both.", "", "The rubber compositions useful for the spokes disclosed herein differ based upon their service. For the rubber coating of the legs, particular embodiments include a rubber composition that may be characterized as having a higher rigidity than the hub, band and nose joint bodies and also having ultra-low hysteresis properties to provide the non-pneumatic tire with low rolling resistance. The higher rigidity is found to be useful in some embodiments because it provides improved lateral stiffness for the non-pneumatic tire. Particular embodiments of the rubber compositions suitable for the rubber coating of the spoke legs therefore possess at least one or more of the following set of physical properties: a modulus of elongation at 10% elongation (MA10) as measured in accordance with ASTM D412 of between 2.0 MPa and 5.0 MPa or alternatively between 2.5 MPa and 3.5 MPa or alternatively between 2.5 MPa and 3.0 MPa; an ultra-low hysteresis as determined by the tan delta measured at 23° C. and at 50% strain of between 0.015 and 0.035 or alternatively between 0.019 and 0.029; and a complex shear modulus G* measured at 23° C. and at 50% strain of at least 0.8 MPa or alternatively between 0.8 MPa and 1.2 MPa or between 0.9 MPa and 1.1 MPa.", "", "The joint bodies also have an effect on the rolling resistance of the tire so for particular embodiments it is suitable to use rubber compositions that have ultra-low hysteresis, but it is also important that they possess good tear resistance. Particular embodiments of the rubber compositions suitable for the joint bodies therefore possess at least one or more of the following set of physical properties: a modulus of elongation at 10% elongation (MA10) as measured in accordance with ASTM D412 of between 2.0 MPa and 5.0 MPa or alternatively between 3.0 MPa and 4.0 MPa; an ultra-low hysteresis as determined by the tan delta measured at 23° C. and at 50% strain of between 0.015 and 0.035 or alternatively between 0.019 and 0.029; a complex shear modulus G* measured at 23° C. and at 50% strain of at least 1.0 MPa or alternatively between 1.0 MPa and 1.3 MPa or between 1.1 MPa and 1.2 MPa; and a tear resistance property of measured on a notched test piece at 23° C. of a stress at break of between 15 MPa and 30 MPa or alternatively between 20 MPa and 25 MPa and a strain at break of between 85% and 120% or alternatively between 95% and 110%.", "", "For those embodiments that include joint bodies having a heel, the heel portion is typically formed from a rubber composition that may be characterized as having better tear properties and is much more rigid. Particular embodiments of the rubber compositions suitable for the heel portion therefore possess at least one or more of the following set of physical properties: a modulus of elongation at 10% elongation (MA10) as measured in accordance with ASTM D412 of between 4.0 MPa and 15.0 MPa or alternatively between 5.0 MPa and 12.0 MPa or 6 MPa and 10 MPa; a complex shear modulus G* measured at 23° C. and at 50% strain of between 1.2 MPa and 2.2 MPa or alternatively between 1.5 MPa and 2.0 MPa; and a tear resistance property of measured on a notched test piece at 23° C. of a stress at break of between 50 MPa and 95 MPa or alternatively between 60 MPa and 90 MPa and a strain at break of between 100% and 250% or alternatively between 125% and 200%.", "", "Each of the rubber compositions useful in the spoke embodiments disclosed herein include one or more highly unsaturated diene rubbers, which are diene elastomers that are resulting at least in part from conjugated diene monomers and having a content of such monomers that is greater than 50 mol %. Natural rubber is a highly unsaturated diene elastomer.", "", "Suitable highly unsaturated diene rubbers may include, for example, polybutadienes (BR), polyisoprenes (IR), natural rubber (NR), butadiene copolymers, isoprene copolymers and mixtures of these elastomers. Such copolymers include butadiene/styrene copolymers (SBR), isoprene/butadiene copolymers (BIR), isoprene/styrene copolymers (SIR) and isoprene/butadiene/styrene copolymers (SBIR). Suitable elastomers may also include any of these elastomers being functionalized elastomers, such functionalized elastomers being well-known in the art.", "", "For those rubber compositions that are useful as ultra-low hysteresis rubber compositions, namely those for use in the nose joint body, the hub joint body and the band joint body, and for those that are useful for the coating on the spoke legs, particularly useful rubber components include, for example, natural rubber (NR), polybutadiene rubber (BR) and copolymers of polybutadiene rubber and styrene (SBR).", "", "For particular embodiments of the joint body rubber compositions, the SBR copolymers are limited to having no more than 5 mol % bound styrene since higher amounts may provide undesired increases in the hysteresis of the rubber composition. However, when the SBR is functionalized with a moiety that can interact with a silica reinforcing filler, then the bound styrene content may be higher such as, for example, between 1 mol % and 35 mol % or alternatively between 1 mol % and 30 mol % or between 1 mol % and 20 mol % bound styrene content. In particular embodiments, higher bound styrene content, i.e., above 30 mol %, is not useful. Functionalized rubbers, i.e., those appended with active moieties, are well known in the industry and such rubbers may be functionalized by attaching these active moieties to the polymer backbone, along the branches of the polymer or at the branch ends of the polymer. Suitable functionalizing moieties that interact with a silica filling include, for example, silanol groups, polysiloxane groups, alkoxysilane groups and amino groups.", "", "Particular embodiments of the joint body rubber compositions disclosed herein may include between 50 phr and 100 phr of natural rubber or alternatively between 60 phr and 100 phr, between 75 phr and 100 phr or between 85 phr and 100 phr of natural rubber. Particular embodiments may be limited to 100 phr of natural rubber. Use of less than these amounts of natural rubber may result in not achieving the target tear properties of the cured rubber composition.", "", "In addition to the natural rubber, such rubber compositions may include between 0 phr and 50 phr of a second rubber component or alternatively between 0 phr to 40 phr, between 0 phr and 25 phr or between 0 phr and 15 phr of the second rubber component. The second rubber component may be selected from the group of polybutadiene rubber or a styrene-butadiene copolymer with a bound styrene content of no more than 5 mol % or alternatively no more than 3 mol % or combinations of the rubber components. Particular embodiments may be limited to 0 phr of the second rubber component or alternatively to 0 phr of the SBR copolymer. The inclusion of only these rubber components can help ensure that the ultra-low hysteresis targets may be reached for the disclosed rubber compositions. Particular embodiments of the rubber compositions for the joint bodies include no other rubber components other than the functionalized SBR as disclosed below.", "", "As has been noted above, when the SBR is functionalized with a moiety that interacts with a silica reinforcing filler, the embodiments of the rubber compositions disclosed herein that are reinforced at least in part with a silica filler may further include between 0 phr and 20 phr of the functionalized SBR component or alternatively between 0 phr and 15 phr or between 0 phr and 10 phr of the functionalized SBR. In particular embodiments, the amount of such functionalized SBR is limited to 0 phr.", "", "Particular embodiments of the rubber compositions useful for the coating on the spoke legs disclosed herein may include between 50 phr and 100 phr of natural rubber or alternatively between 50 phr and 95 phr, between 50 phr and 90 phr or between 60 phr and 80 phr of natural rubber. Particular embodiments may be limited to 100 phr of natural rubber.", "", "In addition to the natural rubber, such rubber compositions may include between 0 phr and 50 phr of a second rubber component selected from the group polybutadiene rubber or a styrene-butadiene copolymer with a bound styrene content of no more than 5 mol % or alternatively no more than 3 mol %. Alternatively, the amount of such second rubber component may be between 5 phr and 50 phr, between 10 phr and 50 phr or between 20 phr and 40 phr. Particular embodiments of the rubber compositions for the rubber coating of the spoke legs include no other rubber components other than the functionalized SBR as disclosed above and in the same limited quantities as were disclosed as being useful for the joint body rubber compositions.", "", "Particular embodiments of the rubber compositions useful for the heel portion of the joint bodies disclosed herein may include between 90 phr and 100 phr of natural rubber or alternatively between 95 phr and 100 phr of natural rubber. Particular embodiments may be limited to 100 phr of natural rubber. The high amounts of natural rubber help ensure that the tear property target is achieved and provide particular embodiments of the non-pneumatic tire with increased robustness.", "", "In addition to the natural rubber, such rubber compositions may include between 0 phr and 10 phr of a second highly unsaturated diene elastomer or alternatively between 0 phr and 5 phr. Such useful rubber components include, for example, any of those highly unsaturated diene elastomers disclosed above.", "", "In addition to the rubber components disclosed above, each of the rubber compositions further include a reinforcing filler. Reinforcing fillers are added to rubber compositions typically to improve, inter alia, their tensile strength and their rigidity. Reinforcing fillers that are very well known in the industry include, for example, carbon black and silica.", "", "For those rubber compositions that are useful as ultra-low hysteresis rubber compositions, namely those for use in the nose joint body, the hub joint body and the band joint body, particular embodiments are reinforced with a silica filler with only a small amount of carbon black included if desired to color the rubber composition black.", "", "Silica may take many useful forms including, for example, as powder, microbeads, granules, balls and/or any other suitable form as well as mixtures thereof. Such silicas may be fumed, precipitated and/or highly dispersible silica (known as “HD” silica).", "", "Useful silicas are those that have a surface area of between 19 m2/g and 55 m2/g or alternatively, between 29 m2/g and 55 m2/g or between 30 m2/g and 45 m2/g. Examples of useful silicas may include, for example Silene 732D (powder form, surface area 35 m2/g) available from PPG, Ultrasil 880 (powder form, 35 m2/g), which is available from Evonik, and EXP7031-1 (powder form, 42 m2/g) which is also available from Evonik. The surface area for silica fillers is determined in accordance with ASTM D1993. These useful silicas are typically in powder form.", "", "To obtain the desired physical properties of the rubber compositions for the joint bodies, the loadings of the reinforcing fillers are low. If the loadings become too high, then the ultra-low hysteresis targets cannot be achieved and if the loadings are too low, then the targets for increased rigidity and improved tear properties are not met.", "", "Therefore, particular embodiments of the rubber compositions useful for the joint bodies may include between 15 phr and 40 phr of silica or alternatively between 20 phr and 40 phr or between 25 phr and 35 phr of silica. If carbon black is added to the rubber compositions, then the amount of carbon black is limited to between 0 phr and 6 phr or alternatively to between 1 phr and 6 phr or between 1 phr and 5 phr of carbon black. Particular embodiments may limit the carbon black to one or more of those having a surface area of between 19 m2/g and 39 m2/g or alternatively between 25 m2/g and 39 m2/g or between 32 m2/g and 39 m2/g as measured in accordance with ASTM D6556.", "", "In accordance with ASTM D1765 Standard Classification of Carbon Blacks, those carbon blacks having a surface area of between 25 m2/g and 32 m2/g are classified as Group No. 7 and those carbon blacks having a surface area of between 70 m2/g and 100 m2/g are classified as Group No. 3 and those carbon blacks having a surface area of between 33 m2/g to 39 m2/g are classified as Group No. 6. Examples of such Group No. 6 carbon blacks include N630, N650, N660, N683 and examples of such Group No. 7 carbon blacks include N754, N762, N765, N772 and N787 and examples of such Group No. 3 carbon blacks include N326, N347, N375, N330, and N351. An example of a carbon black having a surface area of 19 m2/g that is available on the market is S204, available from Orion Engineered Carbon with offices in Kingwood, Texas. This carbon black has a nitrogen surface area of 19 m2/g, an OAN (ASTM D2414) of 138 ml/100 g. a COAN (ASTM D3493-09) of 76 ml/100 g and an iodine number (ASTM D1510) of 19.6 mg/g.", "", "For those rubber compositions that are useful for the rubber coating of the spoke legs, particular embodiments are reinforced with a mixture of carbon black and silica. Useful carbon blacks and silicas include those disclosed above. For those carbon blacks having a surface area of less than 25 m2/g, particular embodiments limit such carbon blacks to those further having a OAN as determined by ASTM D2414 of between 100 ml/100 g and 150 ml/100 g or alternatively, between 110 ml/100 g and 150 ml/100 g. The oil adsorption number (OAN) is a measure of the carbon blacks structure, a higher structure carbon black being those with aggregates that are joined into more chain-like clusters, having a narrow core with more branching.", "", "It should be noted that since the rigidity and cohesiveness of the rubber compositions disclosed herein are relatively low, particular embodiments of the rubber compositions useful for the joint bodies and/or the rubber coatings on the legs may include no plasticizers, including oils and/or resins. Particular embodiments of the heel portion of the joint bodies may include a plasticizer such as an oil and/or a plasticizing resin.", "", "For those rubber compositions that are useful for the heel portion of the hub joint body and the band joint body, particular embodiments of such rubber compositions include carbon black, silica or combinations thereof. In particular embodiments, the total amount of filler may be between 61 phr and 80 phr or alternatively between 65 phr and 80 phr of filler. Particularly useful carbon blacks are those having a surface area (ASTM D6556) of between 70 m2/g and 120 m2/g or alternatively between 70 m2/g and 100 m2/g. Useful silicas include, for example, Zeosil 125 GR having a CTAB of 115 m2/g and a BET of 125 m2/g; Zeosil 1115 MP having a CTAB of 110 m2/g and a BET of 115 m2/g; and Zeosil 1165 MP having a CTAB of 155 m2/g and a BET of 160 m2/g. These silica examples are all available from Rhodia.", "", "In accordance with ASTM D1765 Standard Classification of Carbon Blacks, those carbon blacks having a surface area of between 70 m2/g and 99 m2/g are classified as Group No. 3 and those carbon blacks having a surface area of between 100 m2/g to 120 m2/g are classified as Group No. 2. Examples of such Group No. 3 carbon blacks include N326, N347, N335 and examples of such Group No. 2 carbon blacks include N220, N224, and N231.", "", "For those embodiments that include silica as a reinforcing filler, a silica coupling agent may be included. Such coupling agents are well known and are at least bifunctional to provide a sufficient chemical and/or physical connection between the inorganic reinforcing filler and the diene elastomer. Examples of such coupling agents include bifunctional organosilanes or polyorganosiloxanes. Particular well-known examples of coupling agents include 3,3′-bis(triethoxysilylpropyl) disulfide (TESPD) and 3,3′-bis(triethoxysilylpropyl) tetrasulfide (TESPT).", "", "In addition to the rubber components and the reinforcing fillers discussed above, the rubber compositions disclosed herein may further include a curing system. Particular embodiments are cured with a sulfur curing system that includes free sulfur and may further include, for example, one or more of accelerators, stearic acid and zinc oxide. Suitable free sulfur includes, for example, pulverized sulfur, rubber maker's sulfur, commercial sulfur, and insoluble sulfur. The amount of free sulfur included in the rubber composition is not limited and may range, for example, between 0.5 phr and 10 phr or alternatively between 0.5 phr and 5 phr or between 0.5 phr and 3 phr. Particular embodiments may include no free sulfur added in the curing system but instead include sulfur donors.", "", "Accelerators are used to control the time and/or temperature required for vulcanization and to improve the properties of the cured rubber composition. Particular embodiments of the present invention include one or more accelerators. One example of a suitable primary accelerator useful in the present invention is a sulfenamide. Examples of suitable sulfenamide accelerators include n-cyclohexyl-2-benzothiazole sulfenamide (CBS), N-tert-butyl-2-benzothiazole Sulfenamide (TBBS), N-Oxydiethyl-2-benzthiazolsulfenamid (MBS) and N′-dicyclohexyl-2-benzothiazolesulfenamide (DCBS). Combinations of accelerators are often useful to improve the properties of the cured rubber composition and the particular embodiments include the addition of secondary accelerators.", "", "Other additives can be added to the rubber compositions disclosed herein as known in the art. Such additives may include, for example, some or all of the following: antidegradants, antioxidants, fatty acids, waxes, stearic acid and zinc oxide. Examples of antidegradants and antioxidants include 6PPD, 77PD, IPPD and TMQ and may be added to rubber compositions in an amount, for example, of from 0.5 phr and 5 phr. Zinc oxide may be added in an amount, for example, of between 1 phr and 6 phr or alternatively, of between 1.5 phr and 4 phr. Waxes may be added in an amount, for example, of between 1 phr and 5 phr.", "", "The rubber compositions that are embodiments of the present invention may be produced in suitable mixers, in a manner known to those having ordinary skill in the art, typically using two successive preparation phases, a first phase of thermo-mechanical working at high temperature, followed by a second phase of mechanical working at lower temperature.", "", "The first phase of thermo-mechanical working (sometimes referred to as “non-productive” phase) is intended to mix thoroughly, by kneading, the various ingredients of the composition, with the exception of the vulcanization system. It is carried out in a suitable kneading device, such as an internal mixer or an extruder, until, under the action of the mechanical working and the high shearing imposed on the mixture, a maximum temperature generally between 120° C. and 190° C., more narrowly between 130° C. and 170° C., is reached.", "", "After cooling of the mixture, a second phase of mechanical working is implemented at a lower temperature. Sometimes referred to as “productive” phase, this finishing phase consists of incorporating by mixing the vulcanization (or cross-linking) system (sulfur or other vulcanizing agent and accelerator(s)), in a suitable device, for example an open mill. It is performed for an appropriate time (typically between 1 and 30 minutes, for example between 2 and 10 minutes) and at a sufficiently low temperature lower than the vulcanization temperature of the mixture, so as to protect against premature vulcanization.", "", "It should be noted that the rubber compositions described herein for the different uses, e.g., elastomeric joint bodies, heels and rubber coatings, are described as having ranges of components used in the rubber compositions and ranges in the desired properties of the cured rubber compositions. As those skilled in the art will recognize, the rubber compositions for each use may be the same or different. For example, each of the nose joint bodies may be formed from exactly the same rubber composition or from different ones so long as they are all formed from the ranges of materials as described and or claimed herein. Likewise as a further example, each of the rubber coatings may be formed from exactly the same rubber compositions or from different ones so long as they are all formed from the ranges of materials as described and or claimed herein.", "", "Molds for Spokes.FIG.16shows an exploded perspective view of a particular embodiment of a mold400,410,420,430,440,450,460used to manufacture one example of an individual spoke100. The spoke components are shown separated as they are placed into the mold. Some of the spoke components show the orientation of the reinforcement fibers and cords. For example, the nose reinforcement membrane132reinforcements134are shown in the partial cutaway view of that component. The reinforcements are shown in this embodiment to run parallel to one another and along the width of the reinforcement membrane132. Both of the legs140,142,144are shown and the radially inner leg142is shown with a partial cut-away showing the composite glass resin reinforcements146positioned parallel to one another and along the width of the radially inner leg140. While the reinforcements146of the legs140are resiliently flexible, the fiber reinforcement134of the nose reinforcement membrane132are flexible enough to be permanently deformed upon molding of the surrounding rubber matrix material.", "", "FIG.17shows an exploded perspective view of an alternative mold400,410,420,430,440,450,460used to manufacture an alternative embodiment of individual spoke100. The spoke components are shown separated as they are placed into the mold. Some of the spoke components show the orientation of the reinforcement fibers and cords. For example, the elastomeric joint body136reinforcements174are shown in the partial cutaway view of that component. The reinforcements174are shown in this embodiment to run parallel to one another and along the width of the reinforcement membrane172. Both of the legs140,142,144are shown and the radially inner leg142is shown with a partial cut-away showing the composite glass resin reinforcements146positioned parallel to one another and along the width of the radially inner leg140. The reinforcements146of the legs140and the reinforcements174of the elastomeric joint body136are resiliently flexible. Note that in this particular embodiment, the nose membrane reinforcement132is omitted. Alternatively both the nose membrane reinforcement132may be included in combination with the elastomeric joint body reinforcement172.", "", "Once the various uncured components are laid in place over the mold bottom410, the mold400is closed and secured. Here the mold is closed with screw fasteners through apertures470and secured to threaded portions of the apertures470of the mold components. Tightening of the fasteners exert pressure, or/and additional pressure may be applied to the mold top during curing. Heating of the mold400heats the rubber components within and cures the rubber, adheres the rubber components together and forms a composite spoke having excellent resilient qualities of sufficient durability for use as a structural element in an automotive non-pneumatic tire. Other uses for the resilient composite structure may include vibration isolation mounts, such as motor mounts, transmission mounts or seat mounts, or used as a resilient hinge to allow movement of one object relative to another object otherwise connected by the resilient composite structure.", "", "The “V-shape” of the embodiments of the spoke shown and described herein allow the adjacent spokes to “nest” and give linear spring rate when deflected radially over a distance approximately equal to the tires vertical deflection. The nesting of the spokes avoid adjacent spokes from clashing under normal loading conditions.", "", "It should be understood by a person of ordinary skill in the art that the stiffness of the spoke may be adjusted by adjusting the length of the “V” of the “Vshaped spoke”, the constituent material moduli and the internal architecture of the spoke.", "", "It should be understood that other web element configurations and geometries may be used within the scope of the invention, including web elements which are interconnected such as where they may form a honeycomb or other pattern. While when the resilient composite structure is configured as a spoke they are configured to extend in a lateral direction across the width of the tire, it should be understood that they may be configured at other angles, such as at an angle to the lateral direction of the tire. For example, the spoke may extend at a diagonal between the circumferential direction and the lateral direction of the tire.", "", "The invention is further illustrated by the following examples, which are to be regarded only as illustrations and not delimitative of the invention in any way. The properties of the compositions disclosed in the examples were evaluated as described below and these utilized methods are suitable for measurement of the claimed properties of the claimed invention.", "", "Modulus of elongation (MPa) was measured at 10% (MA10) or 100% (MA100) at a temperature of 23° C. based on ASTM Standard D412 on dumb bell test pieces. The measurements were taken in the second elongation; i.e., after an accommodation cycle. These measurements are secant moduli in MPa, based on the original cross section of the test piece.", "", "The dynamic properties for the rubber compositions were measured at 23° C. on a Metravib Model VA400 ViscoAnalyzer Test System in accordance with ASTM D5992-96. The response of a sample of vulcanized material (double shear geometry with each of the two 10 mm diameter cylindrical samples being 2 mm thick) was recorded as it was being subjected to an alternating single sinusoidal shearing stress at a frequency of 10 Hz under a controlled temperature of 23° C. Scanning was effected at an amplitude of deformation of 0.05 to 90% (outward cycle) and then of 90% to 0.05% (return cycle). The value of the tangent of the loss angle tan delta was determined during the outward cycle at its maximum value, at 50% strain. The complex shear modulus G* was determined at 50% strain during the outward cycle.", "", "The elongation property was measured as elongation at break (%) and the corresponding elongation stress (MPa), which is measured at 23° C. in accordance with ASTM Standard D412 on ASTM C test pieces.", "", "The tear resistance indices are measured at 23° C. The breaking load (FRD) is in N/mm of thickness and the elongation at break (ARD) in percentage are measured on a test piece of dimensions 10×142×2.5 mm notched with 3 notches that each have a depth of 3 mm. The tear resistance index is then provided by the following equation:", "", "TR=(FRD*ARD)/100."], "claims": ["a first support element extending from the hub and a second support element extending from the tread band that are positioned to form an interior angle, which is an angle of greater than 0 degrees but less than 180 degrees, between a first side of the first support element and a first side of the second support element, wherein the first and second support elements comprise a coating of a first rubber composition; a first elastomeric joint body formed of a second rubber composition and positioned within the interior angle and connecting the distal ends, the distal ends being those that are opposite from the hub and the tread band ends respectively, of the first and second support elements; a second elastomeric joint body comprising a third rubber composition and connecting a second side of the first support element at its proximal end to the hub; a third elastomeric joint body comprising a fourth rubber composition and connecting a second side of the second support element at its proximal end to the band, and wherein the first, second, third, and fourth rubber compositions are based on cross-linkable rubber compositions, the first, second, third and fourth rubber composition comprising, in parts by weight per 100 parts by weight of rubber: between 50 phr and 100 phr of natural rubber; between 0 phr and 50 phr of a second rubber component selected from the group consisting of polybutadiene rubber, a copolymer of polybutadiene and styrene wherein the copolymer has no more than 5 mol % styrene and combinations thereof; between 15 phr and 40 phr of a reinforcing filler that comprises between 2 phr and 6 phr of a carbon black and between 20 phr and 40 phr of a silica, wherein the silica has a surface area of between 19 m one or more cure systems for the first, second, third and fourth rubber compositions, which cure systems may be the same or different; at least one of the second and third elastomeric joint bodies further comprise a heel at the proximal end of the elastomeric joint bodies, wherein the heel is formed of a fifth rubber composition, wherein the heel is no more than 25% of the total volume of the at least one of the second and third elastomeric joint bodies, and wherein the fifth rubber composition that forms the heel is based on cross-linkable rubber compositions which may be the same or different for each heel, the fifth rubber composition comprising, in parts by weight per 100 parts by weight of rubber: between 90 phr and 100 phr of natural rubber; up to 10 phr of a third rubber component selected from the group consisting of polybutadiene rubber, a copolymer of polybutadiene and styrene wherein the copolymer has no more than 5 mol % styrene and combinations thereof; between 61 phr and 80 phr of a second carbon black; and a cure system for the fifth rubber compositions.", "2 . The non-pneumatic wheel of claim 1 , further comprising a reinforcement membrane connecting the second side of the first support element and the second side of the second support element at their distal ends.", "3 . The non-pneumatic wheel of any of the preceding claims , wherein the first support element and the second support element each further comprise one or more reinforcements coated with the first rubber composition.", "4 . The non-pneumatic wheel of claim 3 , wherein the one or more reinforcements for each of the first and second support elements are cords of fiber reinforced plastic oriented between the distal and proximal ends of each of the first and second support elements.", "5 . The non-pneumatic wheel of any of the preceding claims , wherein the first rubber composition includes 100 phr of natural rubber.", "6 . The non-pneumatic wheel of any of the preceding claims , wherein the silica has a surface area of between 30 m 2 /g and 55 m 2 /g.", "7 . The non-pneumatic wheel of any of the preceding claims , wherein one or more of the second, third and fourth rubber compositions includes 100 phr of natural rubber.", "8 . The non-pneumatic wheel of any of the preceding claims , wherein one or more of the second, third and fourth rubber compositions includes between 25 phr and 35 phr of the silica.", "9 . The non-pneumatic wheel of any of the preceding claims , wherein the fifth rubber composition includes 100 phr of natural rubber.", "10 . The non-pneumatic wheel of any of the preceding claims , wherein the fifth rubber composition reinforcing filler is carbon black."], "bibtex": "@patent{20250033414,\n    title = {SPOKE FOR NON-PNEUMATIC TIRE},\n    number = {20250033414},\n    year = {2025},\n    note = {File: US20250033414A1-20250130.XML}\n    }", "classification": "B60C714FI"}, {"title": "NON-PNEUMATIC TIRE HAVING CURVED SPOKES AND METHOD OF MAKING SAME", "doc_number": "20250033415", "filename": "US20250033415A1-20250130.XML", "abstract": "A non-pneumatic tire includes a lower ring having a first diameter and an upper ring having a second diameter greater than the first diameter. The upper ring is substantially coaxial with the lower ring. The non-pneumatic tire further includes a plurality of curved, steel spokes extending between the lower ring and the upper ring. Each of the plurality of curved, steel spokes has a 0.2% yield strength of at least 1300 MPA, a tensile strength of at least 1400 MPa, and a hardness of at least 50 HRC.", "detailed_description": ["The following includes definitions of selected terms employed herein. The definitions include various examples and/or forms of components that fall within the scope of a term and that may be used for implementation. The examples are not intended to be limiting. Both singular and plural forms of terms may be within the definitions.", "", "“Axial” and “axially” refer to a direction that is parallel to the axis of rotation of a tire.", "", "“Circumferential” and “circumferentially” refer to a direction extending along the perimeter of the surface of the tread perpendicular to the axial direction.", "", "“Radial” and “radially” refer to a direction perpendicular to the axis of rotation of a tire.", "", "“Tread” as used herein, refers to that portion of the tire that comes into contact with the road or ground under normal inflation and normal load.", "", "While similar terms used in the following descriptions describe common tire components, it should be understood that because the terms carry slightly different connotations, one of ordinary skill in the art would not consider any one of the following terms to be purely interchangeable with another term used to describe a common tire component.", "", "Directions are stated herein with reference to the axis of rotation of the tire. The terms “upward” and “upwardly” refer to a general direction towards the tread of the tire, whereas “downward” and “downwardly” refer to the general direction towards the axis of rotation of the tire. Thus, when relative directional terms such as “upper” and “lower” or “top” and “bottom” are used in connection with an element, the “upper” or “top” element is spaced closer to the tread than the “lower” or “bottom” element. Additionally, when relative directional terms such as “above” or “below” are used in connection with an element, an element that is “above” another element is closer to the tread than the other element.", "", "The terms “inward” and “inwardly” refer to a general direction towards the equatorial plane of the tire, whereas “outward” and “outwardly” refer to a general direction away from the equatorial plane of the tire and towards the sidewall of the tire. Thus, when relative directional terms such as “inner” and “outer” are used in connection with an element, the “inner” element is spaced closer to the equatorial plane of the tire than the “outer” element.", "", "FIG.1illustrates a front view of one embodiment of a non-pneumatic tire100. The non-pneumatic tire100includes a lower ring130having a first diameter, and an upper ring140having a second diameter greater than the first diameter. The upper ring140is coaxial with the lower ring130. The lower ring130may engage a vehicle hub (not shown) for attaching the non-pneumatic tire100to a vehicle.", "", "Spokes200extend between and connect the lower ring130to the upper ring140. In the illustrated embodiment, the spokes200are curved. In an alternative embodiment, the spokes may have a more pronounced curve, such that they are substantially C-shaped. In other alternative embodiments, the spokes may have any desired shape. For example, the spokes may be substantially V-shaped or serpentine shaped. In still other alternative embodiments, the non-pneumatic tire may include spokes of two or more different shapes. For example, the non-pneumatic tire may include C-shaped spokes that alternate with V-shaped spokes along a circumferential direction of the non-pneumatic tire. In yet another alternative embodiment, the spokes may be replaced with a webbing or other support structure.", "", "A circumferential tread210is attached to the upper ring140. The circumferential tread210may be constructed of rubber or other elastomeric material, and may include tread elements (not shown) such as grooves, ribs, blocks, lugs, sipes, studs, or any other desired elements. In an alternative embodiment, the tread layer may be omitted and tread elements may be formed directly on the upper ring.", "", "Other components of the non-pneumatic tire100may be made of various materials. The lower ring130or the upper ring140may be made of an elastomeric material, plastic, composite, or metal. The spokes200may also be made of an elastomeric material, plastic, composite, or metal. In alternative embodiments, the lower ring, the upper ring, or the tread band may be made of any desired material. Certain materials may be selected for certain components in order to provide the non-pneumatic tire with desired performance characteristics.", "", "In some embodiments, it is desirable to construct spokes from very high strength steel. Forming very high strength steel into a curved shape (such as a constant radius) is difficult, however, because the steel tends to revert to its previous shape after bending. This property may be referred to as the “springback” of the steel. This tendency becomes increasingly more severe as the strength of the steel increases. Forming of very high strength steels requires much higher press forces than conventional steels, and thus requires the use of specialist high tonnage presses or rollforming equipment. This requirement for specialized equipment may considerably increase the cost of processing and thus may limit the number of companies with capability to produce such parts.", "", "Due to its springback tendency, very high strength steels are often overbent past the desired shape to allow them to relax back to the desired shape. In practice, the relaxation is often inconsistent between different coils of steel, resulting in poor dimensional control. Thus, overbent steel components must often be re-tuned. The forming operation must also be adjusted to compensate for differences in springback between coils. Residual stresses from the forming process can also vary due to the forming and re-tuning processes, causing inconsistency in fatigue durability.", "", "One known solution to this problem is to use a hot forming grade of steel which can be formed while hot and then quenched to form a martensitic structure with the required mechanical properties. One example of a hot forming grade of steel is Usibor grade press hardened steel from ArcelorMittal. This steel can only be used in a hot stamping process where individual flat blanks are heated to approximately 950° C. then quickly stamped in a die and rapidly cooled to below 200° C. while under pressure in the die to form individual spokes. This process is quite slow and expensive due to the high temperatures and complexity of the cooling systems required in the die.", "", "Another known solution is to form the steel in a lower strength structure and then use a heat treatment process to increase the strength by changing the crystalline structure of the steel to a martensite or bainite. With conventional steels classified as high strength with ultimate tensile strengths of around 400 to 600 MPa, it is possible to roll form a bend or a C-shape in a continuous section and achieve consistent results. Adjustments to compensate for minor differences in strength between coils can be made using laser measurement systems and direct feedback to tighten or loosen the forming rolls. The process may be run from a coil of steel as a continuous process. The formed channel can then either be cut into individual components or as longer lengths. For practical reasons, handling of lengths greater than 4 or 5 m becomes very difficult.", "", "Existing processes of roll forming steel and then heat treating the roll-formed steel can cause thermal distortion of the component as it is gradually heated up and residual stresses are relieved. Rapid cooling to ‘set’ the microstructure can then induce further residual stresses which can cause distortion or result in premature fatigue failure due to residual tensile stress concentrations in local areas. Taking steps such as clamping and supporting the component to prevent distortion can be successful, but this is expensive and impractical for high volume production.", "", "An improved solution to the springback problem is disclosed herein. In this improved solution, the component is rapidly heated using induction heating and then rapidly cooled through water cooling or quenching. The process of rapidly heating and cooling the component within a few seconds creates a bainite structure within the steel. The rapid heating and rapid cooling—or flash processing—reduces the opportunity for thermal distortion or residual stresses to be generated. In one test, using a 4140 steel component, the flash process described above resulted in a large increase of strength compared to a conventional process, as shown in Table 1:", "", "Conventional ProcessFlash ProcessTensile Strength655 MPa1945 MPa0.2% Yield Strength415 MPa1596 MPaElongation25%9%Hardness (HRC)1354Hardness (Vickers)207600", "", "FIG.2is a flow chart illustrating one embodiment of such a method300of making a spoke for a non-pneumatic tire. The method300includes providing a rolled sheet of heat treatable steel (310). The sheet has a thickness between 1.5 mm and 7 mm. In one embodiment, the width of the sheet is 1.5 m or less.", "", "In one embodiment, the heat treatable steel is 4130 steel. In alternative embodiments, the heat treatable steel may be 4140 or 4150 steel. The heat treatable steel may have a carbon content between 0.28% and 0.50%. In an alternative embodiment, the heat treatable steel may have a carbon content between 0.20% and 0.55%. In another alternative embodiment, the heat treatable steel may have a carbon content between 0.20% and 0.60%. The heat treatable steel may also have a manganese content between 0.40% and 1.0%.", "", "While the disclosed process is described for very high strength steel, it should be understood that other steel options may be used, such as 1080 steel. Thus, in alternative embodiments, the process may be used with steel having a carbon content between 0.001% and 4.0%. Additionally, the process may be used with steel having a manganese content of 0.30% to 1.0%.", "", "The rolled sheet of steel is unwound, and then roll formed to impart a curve, bend, or other geometry along its width. The roll forming process may form any desired spoke geometry in the strip (320). In one embodiment, an arc is formed in the strip, wherein the arc is defined by a single radius. In an alternative embodiment, a curve is formed in the strip, wherein the curve is defined by multiple radii. In another alternative embodiment, a V-shaped bend is formed in the strip. It should be understood that multiple arcs or bends may be formed in a strip.", "", "The strip is then optionally pre-heated. In one embodiment, the strip is pre-heated to a temperature between 450° C. and 650° C. The pre-heating may be performed in an electric furnace or a gas furnace. The pre-heating step may also be omitted.", "", "The strip is then heated to a temperature between 950° C. and 1400° C. (330). The strip may be heated to this temperature during a period of 2 to 10 seconds. Thus, this step may be referred to as a rapid heating step. The heating step may be performed in a heating unit. Exemplary heating units include, without limitation, electric resistance heaters, fluidized beds, electric furnaces, plasma furnaces, microwave ovens, open environment propane forges, gas fired units, solid fuels, high temperature salt baths, torches, induction heaters and any combination thereof.", "", "After the strip is heated to a temperature between 950° C. and 1400° C., it is then cooled to a temperature below 200° C. (340). The strip may be cooled to this temperature within 10 seconds. Thus, this step may be referred to as a rapid cooling step. In one embodiment, the strip is cooled by quenching the strip in a quenchant. Exemplary quenchants include, without limitation, water, water-containing aqueous solutions, oil, brine solutions, air, and powders.", "", "After the strip has been rapidly heated and then rapidly cooled, it is cut into a plurality of steel spokes (350). In one embodiment, each spoke has a width between 80 mm and 400 mm. However, it should be understood that the strip may be cut into any desired width.", "", "After the strip has been cut, optional finishing processes may be applied. For example, at least one edge of a spoke may be machined (360). The machining process may impart a rounded or beveled edge. Alternatively, the machining may impart square corners or any geometric shape to the edge. As another example, one or more surfaces may be peened, such as through a shot peening or laser peening process (370). Those of ordinary skill in the art will understand that other known finishing processes may be applied to each spoke.", "", "The spoke that results from this process has been shown to have a tensile strength of at least 1400 MPa, a 0.2% yield strength of at least 1300 MPA, and a hardness of at least 50 HRC. These properties may be varied by tuning any number of steps in the flash process.", "", "After a plurality of spokes have been formed, a tire manufacturer may provide a lower ring having a first diameter and an upper ring having a second diameter greater than the first diameter. The tire manufacturer may then arrange the lower ring and upper ring such that they are coaxial, and extend the plurality of steel spokes between the lower ring and the upper ring. The plurality of spokes may be affixed to the lower and upper rings by a welding or brazing process. Alternatively, the plurality of spokes may be connected to the lower and upper rings by pins, adhesives or other fasteners. For example, the plurality of spokes may be hingedly connected to one or both of the lower ring and the upper ring. In one known embodiment, one or more of the upper ring and the lower ring may have slots to receive the spokes.", "", "In assembling the spokes with the upper ring and lower ring, each spoke may extend axially across the entire width of the lower ring and the entire width of the upper ring. Alternatively, one or more of the spokes may extend across less than the entire width of the lower ring and the entire width of the upper ring. In certain embodiments, two or more rows of spokes may extend axially across the upper and lower rings. Where two or more rows of spokes are employed, the spokes of adjacent rows may have bends in the opposite direction. Alternatively, where two or more rows of spokes are employed, the spokes of adjacent rows may have bends in the same direction.", "", "An elastomeric tread may then be extended about the upper ring. The resulting non-pneumatic tire may be similar to the non-pneumatic tire100shown inFIG.1.", "", "FIG.3is a pictorial illustration of a method of making a spoke (400). This method is substantially the same as the method300shown in the flow chart ofFIG.2. As can be seen in this illustration, the method400includes a step of providing a steel coil (410). The steel coil may have the same properties described above with respect toFIG.2. The steel is then roll formed (420), rapidly heated (430), and quenched (440). The steel is then cut to a desired spoke length (450).", "", "FIG.4is a flow chart illustrating an alternative embodiment of a method500of making a spoke for a non-pneumatic tire. The method500includes providing a rolled sheet of heat treatable steel (510). The sheet has a thickness between 1.5 mm and 7 mm. In one embodiment, the width of the sheet is 2.0 m or less.", "", "In one embodiment, the heat treatable steel is 4130 steel. In alternative embodiments, the heat treatable steel may be 4140 or 4150 steel. The heat treatable steel may have a carbon content between 0.28% and 0.50%. In an alternative embodiment, the heat treatable steel may have a carbon content between 0.20% and 0.55%. In another alternative embodiment, the heat treatable steel may have a carbon content between 0.20% and 0.60%. The heat treatable steel may also have a manganese content between 0.40% and 1.0%.", "", "While the disclosed process is described for very high strength steel, it should be understood that other steel options may be used, such as 1080 steel. Thus, in alternative embodiments, the process may be used with steel having a carbon content between 0.001% and 4.0%. Additionally, the process may be used with steel having a manganese content of 0.30% to 1.0%.", "", "The rolled sheet of steel is unwound, and then tailor rolled (520). A tailor rolling process imparts a continuous thickness transition between a minimum thickness and a maximum thickness. In one embodiment, the sheet of steel is tailor rolled such that the thickness varies periodically along its length between a minimum thickness of 1.2 mm and a maximum thickness of 4.5 mm.", "", "The sheet of steel is then cut into blanks containing one or more thick section and one or more thin section of steel (530). The blank may be cut so that its length is equal to the width of the coil. After each blank is cut, it is rotated 90 degrees (540).", "", "The rotated blank is then roll formed to impart a curve, bend, or other geometry along its width. The roll forming process may form any desired spoke geometry in the blank (550). In one embodiment, an arc is formed in the blank, wherein the arc is defined by a single radius. In an alternative embodiment, a curve is formed in the blank, wherein the curve is defined by multiple radii. In another alternative embodiment, a V-shaped bend is formed in the blank. It should be understood that multiple arcs or bends may be formed in a blank.", "", "The blank is then optionally pre-heated. In one embodiment, the blank is pre-heated to a temperature between 450° C. and 650° C. The pre-heating may be performed in an electric furnace or a gas furnace. The pre-heating step may also be omitted.", "", "The blank is then heated to a temperature between 950° C. and 1400° C. (560). The blank may be heated to this temperature during a period of 2 to 10 seconds. Thus, this step may be referred to as a rapid heating step. The heating step may be performed in a heating unit. Exemplary heating units include, without limitation, electric resistance heaters, fluidized beds, electric furnaces, plasma furnaces, microwave ovens, open environment propane forges, gas fired units, solid fuels, high temperature salt baths, torches, induction heaters and any combination thereof.", "", "After the blank is heated to a temperature between 950° C. and 1400° C., it is then cooled to a temperature below 200° C. (570). The blank may be cooled to this temperature within 10 seconds. Thus, this step may be referred to as a rapid cooling step. In one embodiment, the blank is cooled by quenching the blank in a quenching material. Exemplary quenching materials include, without limitation, water, water-containing aqueous solutions, oil, brine solutions, air, and powders.", "", "After the blank has been rapidly heated and then rapidly cooled, it is cut into a plurality of steel spokes (580). In one embodiment, each spoke has a width between 80 mm and 400 mm. However, it should be understood that the blank may be cut into any desired width.", "", "Due to the tailor rolling and the rotation of the blanks before the roll forming process, each blank has a thickness that varies along its length. In one embodiment, the thickness varies from a minimum thickness of 1.2 mm and a maximum thickness of 4.5 mm.", "", "After the blank has been cut, optional finishing processes may be applied. For example, at least one edge of a spoke may be machined (590). The machining process may impart a rounded or beveled edge. Alternatively, the machining may impart square corners or any geometric shape to the edge. As another example, one or more surfaces may be peened, such as through a shot peening or laser peening process (595). Those of ordinary skill in the art will understand that other known finishing processes may be applied to each spoke.", "", "The spoke that results from this process has been shown to have a tensile stress of at least 1400 MPa, a 0.2% yield strength of at least 1300 MPA, and a hardness of at least 50 HRC. These properties may be varied by tuning any number of steps in the flash process.", "", "After a plurality of spokes have been formed, a tire manufacturer may provide a lower ring having a first diameter and an upper ring having a second diameter greater than the first diameter. The tire manufacturer may then arrange the lower ring and upper ring such that they are coaxial, and extend the plurality of steel spokes between the lower ring and the upper ring. The plurality of spokes may be affixed to the lower and upper rings by a welding or brazing process. Alternatively, the plurality of spokes may be connected to the lower and upper rings by pins, adhesives or other fasteners. For example, the plurality of spokes may be hingedly connected to one or both of the lower ring and the upper ring. In one known embodiment, one or more of the upper ring and the lower ring may have slots to receive the spokes.", "", "In assembling the spokes with the upper ring and lower ring, each spoke may extend axially across the entire width of the lower ring and the entire width of the upper ring. Alternatively, one or more of the spokes may extend across less than the entire width of the lower ring and the entire width of the upper ring. In certain embodiments, two or more rows of spokes may extend axially across the upper and lower rings. Where two or more rows of spokes are employed, the spokes of adjacent rows may have bends in the opposite direction. Alternatively, where two or more rows of spokes are employed, the spokes of adjacent rows may have bends in the same direction.", "", "An elastomeric tread may then be extended about the upper ring. The resulting non-pneumatic tire may be similar to the non-pneumatic tire100shown inFIG.1. It should be understood that the method500ofFIG.4is merely exemplary. In alternative embodiments, certain steps may be omitted. For example, the strip may be cut into blanks without performing a tailor rolling process.", "", "FIG.5is a pictorial illustration of a method of making a spoke (600). This method is substantially the same as the method500shown in the flow chart ofFIG.4. As can be seen in this illustration, the method600includes a step of providing a steel coil (610). The steel coil may have the same properties described above with respect toFIG.4. The steel coil is tailor rolled (620), cut (630), and rotated (640). The steel is then roll formed (650), rapidly heated (660), and quenched (670). The steel is then cut to a desired spoke length (680).", "", "To the extent that the term “includes” or “including” is used in the specification or the claims, it is intended to be inclusive in a manner similar to the term “comprising” as that term is interpreted when employed as a transitional word in a claim. Furthermore, to the extent that the term “or” is employed (e.g., A or B) it is intended to mean “A or B or both.” When the applicants intend to indicate “only A or B but not both” then the term “only A or B but not both” will be employed. Thus, use of the term “or” herein is the inclusive, and not the exclusive use. See, Bryan A. Garner, A Dictionary of Modern Legal Usage624(2d. Ed. 1995). Also, to the extent that the terms “in” or “into” are used in the specification or the claims, it is intended to additionally mean “on” or “onto.” Furthermore, to the extent the term “connect” is used in the specification or claims, it is intended to mean not only “directly connected to,” but also “indirectly connected to” such as connected through another component or components.", "", "While the present application has been illustrated by the description of embodiments thereof, and while the embodiments have been described in considerable detail, it is not the intention of the applicants to restrict or in any way limit the scope of the appended claims to such detail. Additional advantages and modifications will readily appear to those skilled in the art. Therefore, the application, in its broader aspects, is not limited to the specific details, the representative apparatus and method, and illustrative examples shown and described. Accordingly, departures may be made from such details without departing from the spirit or scope of the applicant's general inventive concept."], "claims": ["providing a rolled sheet of steel having a carbon content between 0.20% and 0.60%, the sheet having a thickness between 1.5 mm and 7 mm; unwinding the rolled sheet of steel; tailor rolling the sheet of steel, such that the thickness of the sheet varies periodically along its length between a minimum thickness and a maximum thickness, wherein the minimum thickness is at least 1.2 mm, and wherein the maximum thickness is no more than 4.5 mm; cutting the sheet into blanks containing one or more thick section and one or more thin section of steel, wherein the length of each blank is equal to the width of the sheet; rotating each blank through 90 degrees; roll forming each blank to form a curve along its width, with one or more thick section and one or more thin section in parallel along the length of the blank; heating each blank to a temperature between 950° C. and 1400° C., during a period of 2 to 10 seconds; cooling each blank to a temperature below 200° C. within 10 seconds; cutting each blank into a plurality of steel spokes having a width between 80 mm and 400 mm; providing a lower ring and an upper ring; arranging the plurality of steel spokes between the lower ring and the upper ring.", "2 . The method of claim 1 , wherein the step of heating each blank includes heating each blank with a heating unit selected from the group consisting of electric resistance heaters, fluidized beds, electric furnaces, plasma furnaces, microwave ovens, open environment propane forges, gas fired units, solid fuels, high temperature salt baths, torches, induction heaters and any combination thereof.", "3 . The method of claim 1 , wherein the step of cooling each blank includes rapidly quenching the blank with a quenching material selected from the group consisting of water, water-containing aqueous solutions, oil, brine solutions, air, and powders.", "4 . The method of claim 1 , further comprising a step of machining at least one edge of each of the plurality of steel spokes.", "5 . The method of claim 1 , further comprising a step of peening at least one surface of each of the plurality of steel spokes.", "6 . The method of claim 1 , wherein the steps of heating and cooling each blank results in a blank having a tensile strength of at least 1400 MPa.", "7 . The method of claim 1 , wherein the steps of heating and cooling each blank results in a blank having a 0.2% yield strength of at least 1300 MPA.", "8 . The method of claim 1 , wherein the steps of heating and cooling each blank results in a sheet of steel having a hardness of at least 50 HRC.", "9 . The method of claim 1 , further comprising placing a tread circumferentially about the upper ring.", "10 . The method of claim 1 , further comprising pre-heating each blank to a temperature between 450° C. and 650° C., prior to the heating of each blank to a temperature between 950° C. and 1400° C.", "11 . The method of claim 10 , wherein pre-heating of the blank to a temperature between 450° C. and 650° C. is performed with one of an electric furnace and a gas furnace.", "a lower ring having a first diameter; an upper ring having a second diameter greater than the first diameter, the upper ring being substantially coaxial with the lower ring; and a plurality of curved, steel spokes extending between the lower ring and the upper ring, wherein each of the plurality of curved, steel spokes has a 0.2% yield strength of at least 1300 MPA, a tensile strength of at least 1400 MPa, and a hardness of at least 50 HRC.", "13 . The non-pneumatic tire of claim 12 , wherein each of the plurality of curved, steel spokes has a carbon content between 0.28% and 0.50%.", "14 . The non-pneumatic tire of claim 12 , wherein at least one of the plurality of curved, steel spokes has a variable thickness.", "15 . The non-pneumatic tire of claim 14 , wherein the at least one of the plurality of curved, steel spokes having a variable thickness has a minimum thickness of 1.2 mm and a maximum thickness of 4.5 mm.", "providing a rolled sheet of steel having a carbon content between 0.28% and 0.50%; unwinding the rolled sheet of steel; roll forming the sheet of steel to form a curve along its width; heating the sheet of steel to a temperature between 950° C. and 1400° C., during a period of 2 to 10 seconds; cooling the sheet of steel to a temperature below 200° C. within 10 seconds; cutting a steel spoke from the sheet of steel, the steel spoke having a width between 80 mm and 400 mm.", "17 . The method of claim 16 , wherein the width of the sheet of steel is 1.5 m or less.", "18 . The method of claim 16 , further comprising pre-heating the sheet of steel to a temperature between 450° C. and 650° C., prior to the heating of the sheet of steel to a temperature between 950° C. and 1400° C.", "19 . The method of claim 18 , wherein pre-heating of the sheet of steel to a temperature between 450° C. and 650° C. is performed with one of an electric furnace and a gas furnace.", "machining at least one edge of the steel spoke; and peening at least one surface of the steel spoke."], "bibtex": "@patent{20250033415,\n    title = {NON-PNEUMATIC TIRE HAVING CURVED SPOKES AND METHOD OF MAKING SAME},\n    number = {20250033415},\n    year = {2025},\n    note = {File: US20250033415A1-20250130.XML}\n    }", "classification": "B60C714FI"}]