[{"title": "SPOKE-STAR UNIT MADE OF A FIBRE-REINFORCED PLASTIC", "doc_number": "20240131861", "filename": "US20240131861A1-20240425.XML", "abstract": "A spoke star is made of a fiber-reinforced plastic and formed as a star-shaped closed ring, the spoke star having spokes between a hub-side inner circumference of the spoke star and a rim-side outer circumference of the spoke star, a single fiber bundle running repeatedly in the spoke star between the inner circumference and the outer circumference along spokes of the spoke star. The spokes may be formed as double spokes, the spokes having a loop at the rim-side outer circumference of the spoke star. The loops allow for a better load transfer to the spoke star.", "detailed_description": [""], "claims": ["1 . A spoke star ( 1 ) made of a fiber-reinforced plastic and formed as a star-shaped closed ring, wherein the spoke star ( 1 ) comprises at least two spokes ( 2 ) between a hub-side inner circumference of the spoke star and a rim-side outer circumference of the spoke star, wherein a single fiber bundle runs repeatedly in the spoke star between the inner circumference and the outer circumference along spokes ( 2 ) of the spoke star, wherein the spokes ( 2 ) are formed as double spokes, wherein the two spokes ( 2 ) of the double spokes are connected by a plastic matrix and the spoke arrangement within the spoke star ( 1 ) mimic that of conventional wheels with steel spokes, wherein the spokes ( 2 ) on the rim-side outer circumference of the spoke star have a loop ( 3 ) and the spokes ( 2 ) on the hub-side inner circumference of the spoke star have a loop.", "2 . The spoke star ( 1 ) according to claim 1 , wherein at least one spoke ( 2 ) comprises a fastening means ( 4 ) on the loop ( 3 ) thereof.", "3 . The spoke star ( 1 ) according to claim 2 , wherein the fastening means ( 4 ) is interlockingly connectable to the loop ( 3 ).", "4 . The spoke star ( 1 ) according to claim 2 , wherein the fastening means ( 4 ) is fixable to a wheel rim ( 6 ) by way of a screw ( 5 ).", "5 . The spoke star ( 1 ) according to claim 4 , wherein the screw ( 5 ) aligns with the spoke ( 2 ).", "6 . A spoked wheel having a hub ( 7 ), a wheel rim ( 6 ) and a plurality of spokes ( 2 ) between the hub ( 7 ) and the wheel rim ( 6 ), wherein the spoked wheel comprises at least one spoke star ( 1 ) according to claim 1 ."], "bibtex": "@patent{20240131861,\n    title = {SPOKE-STAR UNIT MADE OF A FIBRE-REINFORCED PLASTIC},\n    number = {20240131861},\n    year = {2024},\n    note = {File: US20240131861A1-20240425.XML}\n    }", "classification": "B60B104FI"}, {"title": "SIDEWALL INSERT FOR A MOTORCYCLE TIRE", "doc_number": "20240131862", "filename": "US20240131862A1-20240425.XML", "abstract": "An assembly ( 18 ) comprises a motorcycle tire ( 12 ) and at least one insert ( 16 ) for a sidewall of the tire ( 12 ). The insert ( 16 ) is removably fastened to the sidewall. The sidewall insert ( 16 ) comprises two free end edges arranged so that, when the tire ( 12 ) is mounted on a mounting support ( 14 ) in order to form a mounted assembly ( 10 ) and when the mounted assembly ( 10 ) is mounted on the motorcycle, the insert ( 16 ) can be mounted on and removed from the sidewall of the tire ( 12 ) without removing the mounted assembly ( 10 ) from the motorcycle. An insert ( 16 ) and a set of inserts that can be used in such an assembly ( 18 ), are disclosed together with a method for mounting an insert ( 16 ) or a set of inserts in order to form such an assembly ( 18 ).", "detailed_description": [""], "claims": ["1 .- 15 . (canceled)", "wherein a sidewall insert ( wherein the insert (", "17 . The insert ( 16 ) according to claim 16 , wherein the sidewall insert forms the angular sector of a circular ring.", "18 . The insert ( 16 ) according to claim 17 , further comprising a radially inner edge ( 40 ) and a radially outer edge ( 42 ), each of the radially inner edge and the radially outer edge ( 40 , 42 ) following a circular curve.", "19 . The insert ( 16 ) according to claim 16 , further comprising removable means ( 48 ) for fastening the insert ( 16 ) to the sidewall ( 26 ) of the tire ( 12 ) comprising means ( 50 ) for fastening the insert ( 16 ) to the sidewall ( 26 ) of the tire ( 12 ) through reversible elastic clipping.", "wherein the or each sidewall insert (", "21 . The assembly ( 18 ) according to claim 20 , wherein the assembly comprises a single insert ( 16 ) for a sidewall ( 26 ) removably fastened to the sidewall ( 26 ), the sidewall insert ( 16 ) forming an angular sector of a ring, the angular sector ranging from 330° to 380°.", "each sidewall insert ( the sidewall ( each of the N inserts (", "each sidewall insert ( the sidewall ( N covered portions ( N′≥2 uncovered portions ( each covered portion (", "passing the insert ( removably fastening the insert (", "passing each sidewall insert around a fork arm ( where the or each sidewall insert ( where the or each sidewall insert ( each free end edge ( each free end edge ( removably fastening each sidewall insert ("], "bibtex": "@patent{20240131862,\n    title = {SIDEWALL INSERT FOR A MOTORCYCLE TIRE},\n    number = {20240131862},\n    year = {2024},\n    note = {File: US20240131862A1-20240425.XML}\n    }", "classification": "B60B701FI"}, {"title": "INTERNAL CONNECTION OF A BICYCLE REAR HUB", "doc_number": "20240131863", "filename": "US20240131863A1-20240425.XML", "abstract": "The invention refers to the internal connection of a rear bicycle wheel hub ( 1 ) comprising a cylindrical body ( 2 ) that surrounds an axle ( 3 ), where a proximal end ( 2 b ) of the body ( 2 ) is attached to a freehub body ( 4 ) that surrounds a freewheel system ( 6 ). A connecting mechanism ( 5 ) between the body ( 2 ) and the freewheel system ( 6 ) of the freehub body ( 4 ) is characterized in that it comprises a connecting crown ( 7 ) coupled to an inner surface ( 2 c ) of the body ( 2 ) that connects with a ring ( 6 a ) in the freewheel system ( 6 ) and an elastic ring ( 8 ) seated in a circular recess ( 9 ) on a lateral surface ( 7 c ) of the connecting crown ( 7 ) so that it can expand towards the inner surface ( 2 c ) of the body ( 2 ) and fix the connecting crown ( 7 ) inside the body ( 2 ).", "detailed_description": ["The invention refers to a rear hub system (1) of a bicycle. Specifically, it relates to the connecting mechanism (5) of the body (2) and the freehub body (4) of a rear hub (1) of a bicycle as seen inFIGS.2,3and4.", "", "FIGS.1and1Ashow an exploded view and a locally enlarged view of a rear hub system (1) known as a ratchet system, which comprises, from left to right, a distal stop (1a), a body (2), an axle (3) with wheel bearings (11,12), a freehub body (4) and a proximal stop (1b). The rear hub (1) between the body (2) and the freehub body (4) comprises a connecting part (5a) and a freewheel system (6). In this ‘ratchet’ type of rear hub, the freewheel system (6) works through the interaction between the connecting part (5a), which is normally externally threaded and has internal splines, and the two rings (6a,6b) facing each other, with external splines and laterally toothed with equal and complementary lateral teeth, pushed by two springs (6c) external to them, which make up the freewheel system (6) as shown inFIG.1A. The connecting part (5a) which is normally threaded externally for fastening to the body (2) and internally splined for holding the freewheel system (6), is the most important part in the connection and fastening of the freehub body (4) to the body (2). As a result, and based on the workload it undergoes after continued use, it generates problems when it has to be replaced, as mentioned above.", "", "Therefore, the invention refers to a bicycle wheel rear hub (1) that also comprises a cylindrical body (2) that surrounds an axle (3) and where at a distal end (2a) it comprises a distal stop (1a) and at a proximal end (2b) a freehub body (4) is attached by means of a connecting mechanism (5), where the freehub body (4) comprises a cylindrical body, a freewheel system (6) within it and a proximal stop (1b) at a proximal end (4b) of the freehub body (4). However, as shown inFIG.2, the body (2) of the rear hub (1) of the invention is characterized in that the connecting mechanism (5) between the body (2) and the freewheel system (6) comprises a connecting crown (7) and an elastic ring (8), which are the key innovative parts of the invention.", "", "On the one hand and preferably, the connecting crown (7) comprises an external crenellated and/or splined surface (7a), an inner radially toothed surface (7b) and a lateral surface (7c). The external crenellated and/or splined surface (7a) and the internal toothed surface (7b) act as a support and link between the body (2) of the hub (1) and the rings (6a,6b) of the freehub body (4) responsible for the effect of the freewheel system (6), ensuring the solidity and firmness necessary for holding the freehub body (4), by means of a sliding adjustment. In other words, the outer surface (7a) and inner surface (7b) require shapes which may be regular or irregular, but which must be complementary to the surfaces with which they are going to be matched. The lateral surface (7c) comprises a circular recess (9) where the elastic ring (8) is attached or seated.", "", "Also, preferably, the crenellated and/or splined outer surface (7a) of the connecting crown (7) is complementary to the inner surface (2c) of the body (2), while the inner radial surface (7b) of the connecting crown (7) is toothed and complementary to the outer surface of the ring (6a) of the freewheel system (6) as seen inFIG.3.", "", "On the other hand, as shown inFIGS.3and4, the elastic ring (8) of the rear hub (1) of the invention comprises a circular flat body with two free ends (8a,8b) so as to be able to expand towards the inner surface (2c) of the body (2) and fit into a groove or channel (2d) in the inner radial surface (2c) of the proximal end (2b) of the body (2) of the hub (1) and block the sliding movement of the connecting crown (7), guaranteeing the absolute immobility of the connecting crown (7) inside the body (2). In addition, the free end (8b) comprises a tab (10) that facilitates the extraction of the elastic ring (8) from the body (2) when it is seated and expanded in the groove (2d) of the inner surface (2c) of the body (2).", "", "Optionally, the freewheel system (6) comprises at least two moving rings (6a,6b) that are laterally toothed and have external splines, facing each other, and at least two springs (6c) on the other side from the toothed surface of the rings (6a,6b), which together with the rotation of the pedals determine the operation of the freewheel system (6). In other words, the first ring (6a) fits externally with the complementary splines of the inner radial surface (7b) of the connecting crown (7) and the second ring (6b) fits laterally with the complementary teeth of the first ring (6a) and externally with the inner surface of the freehub body (4). The teeth of the rings (6a,6b) form a wedge shape, one side being inclined and the other straight. In this way, when pedalling on the bicycle, the sprockets make the freehub body (4) turn and thus turn the rings (6a,6b) of the freewheel system (6), which are facing each other and in contact due to the fact that the springs (6c) are partially extended, exerting pressure on one ring (6a) against the other (6b). Therefore, when the pedals turn in the direction of travel, the teeth mesh, turning the body (2) and with it the bicycle wheel. However, when pedalling is stopped or reversed, the springs (6c) are slightly compressed and the freewheel system (6) disengages releasing and allowing both rings (6a,6b) to slide, since the teeth rotate in the opposite direction allowing the wheel to turn when the pedals are immobile or rotate in the opposite direction to the direction of travel.", "", "Another possible embodiment of the invention is when the freehub body (4) comprises at least one pawl system on an external surface of the distal end (4a) and the connecting crown (7) comprises an inner radially toothed surface (7b) complementary to the pawls of the freehub body (4). Alternatively, in another embodiment, the connecting crown (7) comprises a lateral radially toothed surface (7c) complementary to the outer surface of a ring (6b) of the free wheel system (6), where in this case, the use of one of the toothed rings (6a) is eliminated, being the connecting crown (7) the connecting mechanism (5) and ring (6a) at the same time.", "", "Additionally, as shown in the Figures, the rear hub (1) of the invention comprises wheel bearings (11,12) on the axle (3), where the wheel bearings (11) are those located inside the body (2) and the wheel bearings (12) are those located inside the freehub body (4), allowing and helping them to rotate when necessary.", "", "For all of the above and thanks to the connecting mechanism (5) of the invention, the problem of over-tightening of the threaded connecting part (5a) is solved, facilitating the disassembly and replacement of the necessary parts without the need for tools or special knowledge, thus simplifying and reducing the cost of maintenance work. In addition, it is possible to prolong the life of the hub (1) and therefore of the bicycle wheel."], "claims": ["the connecting mechanism between the body and the freewheel system of the freehub body comprises a connecting crown and an elastic ring, where the connecting crown comprises a lateral surface with a circular groove where the elastic ring is fitted so that it can expand towards the internal surface of the body and fix the connecting crown inside the body.", "2 . Rear bicycle wheel hub, according to claim 1 , where the connecting crown comprises a regular or irregular external surface with crenellations and/or splines, complementary to the inner surface of the body and an inner radial surface complementary to the outer surface of at least one toothed ring of the freewheel system.", "3 . Rear bicycle wheel hub, according to claim 1 , wherein the elastic ring comprises a circular flat body with two free ends where the free end has a tab.", "4 . Rear bicycle wheel hub, according to claim 1 , wherein the body comprises a groove or channel at the proximal end of the inner surface.", "5 . Rear bicycle wheel hub, according to claim 1 , wherein the free wheel system comprises at least two toothed rings laterally facing each other with external teeth or splines complementary to the inner surfaces of the connecting crown and the freehub body.", "6 . Rear bicycle wheel hub, according to claim 1 , wherein the freewheel system comprises at least one pawl system on the outer surface of the distal end of the freehub body.", "7 . Rear bicycle wheel hub, according to claim 6 , wherein the connecting crown comprises a regular or irregular outer surface with crenellations and/or splines, complementary to the inner surface of the body and an inner radial surface complementary to the outer surface of at least one pawl system in the freehub body.", "8 . Rear bicycle wheel hub according to claim 1 , wherein the crenellated and/or splined connecting crown comprises a toothed lateral surface complementary to the outer surface of a ring of the freewheel system.", "9 . Rear bicycle wheel hub, according to claim 1 , wherein the body comprises at least one wheel bearing inside.", "10 . Rear bicycle wheel hub, according to claim 1 , wherein the freehub body comprises at least one wheel bearing inside."], "bibtex": "@patent{20240131863,\n    title = {INTERNAL CONNECTION OF A BICYCLE REAR HUB},\n    number = {20240131863},\n    year = {2024},\n    note = {File: US20240131863A1-20240425.XML}\n    }", "classification": "B60B2702FI"}, {"title": "VEHICLE WHEEL MOUNTING APPARATUS", "doc_number": "20240131864", "filename": "US20240131864A1-20240425.XML", "abstract": "There is provided a vehicle wheel mounting apparatus according to one aspect. The apparatus includes first and second L-shaped members which telescopically couple together and rollers rotatably coupled to the L-shaped members. There is also provided a vehicle wheel mounting apparatus according to another aspect. The apparatus includes a pair of wheel-mounted elongate members, a pair of rollers rotatably coupled to respective said elongate members, and a pair of channels via which the elongate members are telescoping coupled together. Each of the channels is u-shaped in lateral section.", "detailed_description": [""], "claims": ["a pair of wheel-mounted elongate members with respective rollers coupled thereto; and an actuator configured to enable the elongate members to move from a retracted position to an extended position, with the rollers being closer together in the retracted position and more spaced-apart in the extended position, wherein the elongate members are shaped to substantially enclose the actuator along the top and sides thereof and enable the actuator to be accessible via the bottom thereof.", "2 . A vehicle wheel mounting apparatus according to claim 1 , wherein the actuator comprises an elongate threaded member threadably coupled to and extending between the elongate members, with actuation thereof selectively adjusting spacing of the rollers.", "3 . A vehicle wheel mounting apparatus according to claim 1 , wherein the elongate members telescopically couple together, with at least one of the elongate members including a channel with a longitudinally-extending portion and first and second peripheral portions coupling to and extending along sides of the longitudinally-extending portion thereof, with the first peripheral portion extending outwards at an acute angle relative to the longitudinally-extending portion and with the second peripheral portion outwards extending at an acute angle relative to the longitudinally-extending portion.", "4 . A vehicle wheel mounting apparatus according to claim 1 , wherein a longitudinally-extending portion of a first said elongate member is shaped to nest within a longitudinally-extending portion of a second said elongate member.", "5 . A vehicle wheel mounting apparatus according to claim 1 , wherein the rollers are configured to receive therebetween and selectively elevate a vehicle wheel.", "a pair of wheel-mounted elongate members; a pair of rollers rotatably coupled to respective said elongate members; and a pair of channels via which the elongate members are telescoping coupled together, each of the channels being u-shaped in lateral section.", "7 . A vehicle wheel mounting apparatus according to claim 6 , wherein each said elongate member includes a pair of spaced-apart bent portions which form respective said channels.", "8 . A vehicle wheel mounting apparatus according to claim 6 , wherein at least one said channel comprises a longitudinally-extending portion and first and second peripheral portions coupling to and extending along sides of the longitudinally-extending portion thereof, with the first peripheral portion extending at an acute angle relative to the longitudinally-extending portion and with the second peripheral portion extending at an acute angle relative to the longitudinally-extending portion.", "forming a pair of L-shaped blanks; forming a pair of telescoping said channels by bending sides of longitudinally-extending portions of the blanks; and operatively connecting the channels together via a length adjustment mechanism positioned substantially within at least one of the channels, with positioning of the rollers being adjustable thereby.", "10 . A method according to claim 9 , including within the positioning step, coupling an elongate threaded member to a distal end of a first said channel and a proximal end of a second said channel, with actuation thereof selectively adjusting spacing between the rollers.", "11 . A method according to claim 9 , including forming roller mounts by at least bending spaced-apart ends of laterally-extending portions of the blanks; and rotatably coupling rollers to the roller mounts.", "forming the L-shaped blanks using sheet metal; within the forming the pair of L-shaped blanks step, laser cutting sheet metal into L-shapes; and after the forming the L-shaped blanks step, shaping the L-shaped blanks via brake forming.", "first and second L-shaped members which telescopically couple together, the L-shaped members being made of sheet metal; and rollers rotatably coupled to the L-shaped members.", "14 . A vehicle wheel mounting apparatus according to claim 13 , including wherein each said L-shaped member includes a pair of spaced-apart bent portions via which a respective said roller is rotatably coupled thereto.", "15 . A vehicle wheel mounting apparatus according to claim 13 , wherein each said L-shaped member includes a pair of spaced-apart roller mounts integrally coupled thereto so as to form a unitary whole.", "16 . A vehicle wheel mounting apparatus according to claim 13 , wherein at least one of said L-shaped members includes a pair of spaced-apart bent portions to form a channel via which the L-shaped members telescopically couple together.", "17 . A vehicle wheel mounting apparatus according to claim 13 , wherein each said L-shaped member includes a first pair of spaced-apart bent portions via which a respective said roller is rotatably coupled thereto and wherein each said L-shaped member includes a second pair of spaced-apart bent portions which form a channel, with the L-shaped members telescopically coupling together via the channels.", "18 . A vehicle wheel mounting apparatus according to claim 13 , including dolly wheels coupled to the L-shaped members and one or more stiffening members extending along a periphery of the L-shaped members, with each said stiffening member extending between a respective pair of said dolly wheels.", "19 . A vehicle wheel mounting apparatus according to claim 18 , wherein each said stiffening member is outwardly convex in part.", "20 . A vehicle wheel mounting apparatus according to claim 15 , wherein each said L-shaped member is planar and L-shaped along a top thereof."], "bibtex": "@patent{20240131864,\n    title = {VEHICLE WHEEL MOUNTING APPARATUS},\n    number = {20240131864},\n    year = {2024},\n    note = {File: US20240131864A1-20240425.XML}\n    }", "classification": "B60B3002FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240131865", "filename": "US20240131865A1-20240425.XML", "abstract": "A pneumatic tire includes a tread portion, a pair of sidewall portions, a pair of bead portions, a carcass extending between the pair of bead portions, and an inner rubber extending between the pair of bead portions on an inner side of the carcass. The inner rubber includes a first portion extending in the tread portion with a first thickness and a second portion extending in each of or one of the pair of sidewall portions with a second thickness. The first thickness is greater than the second thickness. In a tire meridian cross-section, a cross-sectional area of the inner rubber is in a range from 1.5% to 10% of an inner-cavity cross-sectional area of the pneumatic tire.", "detailed_description": ["One or more embodiments of the present disclosure will be described below in conjunction with the accompanying drawings.", "", "The drawings may contain exaggerations and expressions that differ from the actual dimensional proportions of the structures in order to facilitate understanding of the disclosure. Throughout the specification, the same or common elements are denoted by the same reference signs, and duplicate explanations are omitted.", "", "FIG.1shows a cross-sectional view of a tire1showing an embodiment of the present disclosure (hereinafter sometimes simply referred to as the “tire1”).FIG.1is a transverse cross-sectional view of the tire1under its normal state, including the rotational axis of the tire. The tire1according to the present embodiment is, for example, suitably used as a pneumatic tire for passenger cars. The present disclosure is however, not limited to such embodiment, and may be applied to heavy duty pneumatic tires, for example.", "", "In the case of pneumatic tires for which various standards are specified, the normal state means a state of the tire which is mounted on a standard wheel rim, inflated to a standard internal pressure, and loaded with no tire load. In the case of tires for which various standards are not yet established, the normal state means a standard usage state of the tire according to the purpose of use of the tire, in which the tire is not mounted on the vehicle and no load is applied. In this specification, dimensions of each portion of the tire refer to values measured under the normal state unless otherwise noted. In the case of a structure which is difficult to measure under the normal state (for example, an internal structural portion of the tire1), the dimension is a value measured with the tire1placed in a condition as close as possible to the normal state.", "", "The standard wheel rim is a wheel rim specified for the tire in a standard system including standards on which the tire is based, for example, “Standard Rim” in the case of JATMA, “Design Rim” in the case of TRA, and “Measuring Rim” in the case of ETRTO.", "", "The standard internal pressure is air pressure specified for the tire in a standard system including standards on which the tire is based, for example, “Maximum Air Pressure” in the case of JATMA, the maximum value listed in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the case of TRA, and “Inflation Pressure” in the case of ETRTO.", "", "The tire1includes a tread portion2, a pair of sidewall portions3, a pair of bead portions4, and a tire cavity100. Each sidewall portion3is connected to a respective one of the outer ends of the tread portion2in the tire axial direction and extends in the tire radial direction. Each bead portion4is connected to the inner side in the tire radial direction of the respective one of the sidewall portions3. Further, the tire1includes a carcass6and an inner rubber10. The carcass6extends between the pair of bead portions4. In the present embodiment, the carcass6extends from one of the bead portions4through one of the sidewall portions3, the tread portion2, and the other of the sidewall portions3, to the other of the bead portions4. The inner rubber10is disposed inside the carcass6and extends between the pair of bead portions4and4. The inner rubber10according to the present embodiment is connected to the chafer rubber in each bead section4, which is composed of a different type of rubber than the inner rubber10. In the present embodiment, the inner rubber10forms a tire inner cavity surface1A. In the present embodiment, the inner rubber10is made of vulcanized rubber, and is different from a puncture sealant material.", "", "The inner rubber10includes a first portion11and a second portion12. The first portion11extends in the tread portion2with a first thickness t1. The second portion12extends in each of or one of the pair of sidewall portions3with a second thickness t2. The second portion12, for example, is arranged on both sides of the first portion11. The first thickness t1and the second thickness t2mean the thickness from the inner surface6iof the carcass6to the tire inner cavity surface1A.", "", "The first thickness t1is greater than the second thickness t2. This means that an average value of the first thickness t1is greater than an average value of the second thickness t2. Here, the average value of the first thickness t1is a value obtained by dividing the cross-sectional area of the first portion11in the tire meridian cross-section by the length of the first portion11along the tire inner cavity surface1A. The average value of the second thickness t2is a value obtained in the same manner. In the present embodiment, as a preferred aspect, the above-described thickness relationship is maintained over the entire circumference of the tire. However, the present disclosure is not limited to such an aspect.", "", "FIG.2Ais a schematic diagram showing an inner-cavity cross-sectional area A1of the tire1which is colored, andFIG.2Bis a schematic diagram showing the cross-sectional area A2of the inner rubber10. As illustrated inFIG.2AandFIG.2B, in a tire meridian cross-section, the cross-sectional area A2of the inner rubber10is equal to or more than 1.5% of the inner-cavity cross-sectional area A1of the tire1, but preferably equal to or less than 10%. In the present disclosure, by adopting the above configuration, the noise performance can be improved while maintaining the rolling resistance performance and high-speed durability performance. The reasons are as follows.", "", "As shown inFIG.1, the inner rubber10can absorb the driving vibration from the road surface, thus reducing the vehicle interior noise and improving the noise performance. In particular, the first portion11, which is relatively thicker than the tread portion2, can effectively absorb the vibration from the tread portion2. In addition, the inner rubber10that forms the tire inner cavity surface1A can maintain a high rolling resistance performance compared to the case where the rubber disposed radially outwardly of the carcass6is made thicker. Further, since the cross-sectional area A2(shown inFIG.2B) is greater than 1.5% of the inner-cavity cross-sectional area A1(shown inFIG.2A), the resonance of driving vibration from the road surface in the tire inner cavity100can be reduced. Furthermore, since the cross-sectional area A2is equal to or less than 10% of the inner-cavity cross-sectional area A1, excessive increase of the tire mass can be suppressed. In addition, the second portion12, which is relatively small in thickness, is placed in the sidewall portions3, which can enhance the effect of preventing excessive increase of the tire mass. As a result, the tire1according to the present embodiment can maintains high rolling resistance performance and high-speed durability performance. In order to exert such an action more effectively, the cross-sectional area A2is preferably equal to or more than 2.0% of the cross-sectional area A1, but preferably equal to or less than 5.0% of the cross-sectional area A1. As shown inFIG.2A, the cross-sectional area A1is the sum of the cross-sectional area Ala surrounded by the bead baseline BL and the tire inner cavity surface1A, and a cross-sectional area Alb of the first portion11located radially inwardly from an imaginary line kl extending smoothly axially inward of the tire inner cavity surface12iof the respective second portions12. The bead baseline BL is a tire axial line passing through the rim diameter position determined by the standard on which the tire1is based. The cross-sectional area Alb is the same as the cross-sectional area of the additional layer17described below, shown inFIG.10below.", "", "A more detailed configuration of the present embodiment will be described below. Each configuration described below represents a specific aspect of the present embodiment, therefore, the present disclosure can exhibit the above-described effects even if it does not have the configuration described below. Further, even if any one of the configurations described below is applied alone to the tire of the present disclosure having the features described above, it is possible to expect an improvement in performance according to the adopted configuration. Furthermore, when some of the configurations described below are applied in combination, it is possible to expect a combined improvement in performance according to the respective configurations.", "", "As illustrated inFIG.1, it is preferable that the tire1has a cross-sectional width W of not less than 205 mm and not more than 325 mm, an aspect ratio of not less than 25% and not more than 65%, and a rim diameter of not less than 16 inches and not more than 22 inches. The tire1of such a size has relatively large cross-sectional width W, low aspect ratio, and large diameter, which tends to increase the vehicle interior noise and rolling resistance, and to reduce the heat dissipation of the tire. By applying the present disclosure to the tire1, it is possible to further improve the noise performance while maintaining the rolling resistance and high-speed durability performance. In the specification, “cross-sectional width W”, “aspect ratio” and “rim diameter” are synonymous with “nominal section width”, “nominal aspect ratio” and “nominal rim diameter code” of a tire in JATMA standard. Thus, the above-mentioned “cross-sectional width W” can be obtained from the axial distance between sidewalls3and3(total width of the tire) including all the patterns and letters on the sides of the tire, excluding the patterns and letters on the sides of the tire.", "", "The cross-sectional width W of the tire1shown inFIG.1under the normal state is preferably equal to or more than 225 mm. The tire1with a large cross-sectional width W has a relatively large tread width TW, which tends to increase the horn effect. However, in the present embodiment, the first portion11can suppress the effect of the horn effect on the noise performance, so that the deterioration of the noise performance can be suppressed even if the tire1has a cross-sectional width W equal to or more than 225 mm.", "", "FIG.3illustrates how the tire1with the first portion11on the inner rubber10in this embodiment generates noise when driving.", "", "In the present embodiment, the outer diameter DM of the tire1in the normal state is equal to or more than 660 mm. For such a tire1, the angle α between the ground contact surface2sof the tread portion2and the road surface G is small, and the influence of the horn effect on the noise performance of the tire tends to become significant. However, in the tire1according to the present embodiment, the influence of the horn effect on the noise performance is suppressed by adopting the above configuration.", "", "As illustrated inFIG.1, the tire1according to the present embodiment has a designated mounting direction on a vehicle. The mounting direction on a vehicle is indicated by letters or symbols, for example, on the outer surface of the sidewalls3. The tire1according to the present disclosure is not limited to such an aspect, but may be used without specifying the mounting direction on a vehicle.", "", "The tread portion2includes the tire equator C, a first tread edge T1(left side inFIG.1) and a second tread edge T2(right side inFIG.1). In the present embodiment, when the tire is mounted on the vehicle, the first tread edge T1is located on the outside of a vehicle, and the second tread edge T2is located on the inside of the vehicle. The first tread edge T1and the second tread edge T2correspond to the outermost axial contact position of the tire when 70% of the standard tire load is applied to the tire1in the normal state and the tread portion2is grounded on a flat surface at zero camber angles. The axial distance between the first tread edge T1and the second tread edge T2is the tread width TW. The tire equator C is located at the axial distance of 50% of the tread width TW from the first tread edge T1toward the second tread edge T2. In addition, the outer surface in the tire radial direction of the tread portion2between the first tread edge T1and the second tread edge T2is the ground contact surface2s.", "", "In the case of pneumatic tires for which various standards have been established, the standard tire load is a tire load specified for the tire in a standard system including standards on which the tire is based, for example, “Maximum Load Capacity” in the case of JATMA, the maximum value listed in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the case of for TRA, and “Load Capacity” in the case of ETRTO. In the case of tires for which various standards are not yet established, the standard tire load refers to the maximum tire load that can be applied to the tire when using the tire.", "", "The carcass6is, for example, composed of a single carcass ply6A. The carcass ply6A includes, for example, a main portion6aand a pair of turn-up portions6b. The main portion6aextends, for example, between the pair of bead portions4. Each turn-up portion6bis, for example, connected to the main portion6aand turned up around a respective one of bead cores5from the inside to the outside in the tire axial direction.", "", "The carcass ply6A includes a plurality of carcass cords and a topping rubber covering them (not illustrated). As the carcass cords, organic fiber cords such as aramid and rayon are used. It is preferable that the carcass cords are, for example, arranged at an angle of from 70 to 90 degrees with respect to the tire circumferential direction.", "", "In the tire1according to the present embodiment, the twist coefficient K of the carcass cords6B is set in a range from 2000 to 2500. Here, the twist coefficient K is obtained by multiplying T by the square root of D (K=T√D), where T is the number of twists per 100 mm length, and D is the total fineness (dtex) of the carcass cord6B. It is noted that the twist coefficient K is a numerical value after the carcass cord6B is subjected to a dipping treatment.", "", "If a cord with a small twist coefficient K is used as the carcass cords6B, as the cord fatigue resistance may be deteriorated, the durability of the tire1may be affected. In the tire1according to the present embodiment, as the carcass cords6B have a twist coefficient equal to or more than 2000, the cord fatigue resistance can be increased, and the durability performance of the tire1can be improved.", "", "On the other hand, if a cord with an excessive large twist coefficient K is used as the carcass cords6B, good attenuation cannot be obtained from the sidewall portions3to the bead portions4, and the noise performance of the tire1may be affected. Further, the deformation of the case structure including the carcass6from the sidewall portions3to the bead portions4is increased, which may result in increased rolling resistance. In the tire1according to the present embodiment, as the twist coefficient K of the carcass cords6B is set to 2500 or less, good attenuation can be obtained from the sidewall portions3to the bead portions4, therefore, noise performance of the tire1can be improved, and the vehicle interior noise can be reduced. Moreover, since the deformation of the case structure can be suppressed, the rolling resistance can be reduced.", "", "In the tire1according to the present embodiment, of the inner rubber10, the first portion11extending through the tread portion2with the first thickness t1larger than the second thickness t2of the second portion12, functions as a mass damper to suppress the vibration of the tread portion2. Further, the vibrational energy of the tread portion2is attenuated by the viscoelastic properties of the rubber arranged in the first portion11.", "", "Therefore, compared to a conventional pneumatic tire without the first portion11, the tire1according to the present embodiment allows a cord with a large twist coefficient K to be applied as the carcass cord6B. On the other hand, the increase in rolling resistance which is a concern due to the provision of the first portion11, can be easily solved by the carcass cords6B having the twist coefficient K of at most 2500.", "", "That is, the tire1according to the present embodiment can reduce the vehicle interior noise without increasing the rolling resistance by the carcass cords6B whose twist coefficient K is optimized in accordance with the first thickness t1of the first portion11.", "", "The tire1according to the present embodiment may have a so-called high turn-up structure in which the radially outer end of each turn-up portion6bof the carcass6is positioned outside the maximum width position of the main portion6aof the carcass6in the tire radial direction. Such a carcass6makes it difficult for the vibration of the sidewall portion3to be transmitted to the bead portions4, which makes it possible to reduce the vehicle interior noise. Further, since deformation of the case structure can be suppressed from the sidewall portions3to the bead portions4, rolling resistance can be easily reduced. The tire1according to the present embodiment may have a so-called ultra-high turn-up structure in which the radially outer end of each turn-up portion6bof the carcass6is positioned inward in the tire axial direction, of the respective outer end in the tire axial direction of the belt layer7.", "", "For the carcass cords6B of the present embodiment, polyethylene terephthalate (PET) is used. According to the load index of the tire1, the number of carcass plies6A and the fineness of the carcass cords6B are preferably configured as follows.", "", "[When there is a Single Carcass Ply with PET Cords]", "", "When the fineness of the carcass cord6B is 1100 dtex/2, the load index is preferably 90 or less.", "", "When the fineness of the carcass cord6B is 1440 dtex/2, the load index is preferably greater than 90 and less than 100.", "", "When the fineness of the carcass cord6B is 1670 dtex/2, the load index is preferably greater than 90 and 105 or less.", "", "[When there are Two Carcass Plies with PET Cords]", "", "When the fineness of the carcass cord6B is 1110 dtex/2, the load index is preferably 110 or less.", "", "When the fineness of the carcass cord6B is 1440 dtex/2 or 1670 dtex/2, the load index is preferably 115 or less.", "", "FIG.4illustrates an enlarged cross-sectional view of the tread portion2ofFIG.1. As illustrated inFIG.4, the tread portion2according to the present embodiment includes, for example, a belt layer7and a band layer8which are arranged outside the carcass6in the tire radial direction. The belt layer7includes a first belt ply7A adjacent to the carcass6and a second belt ply7B outside the first belt ply7A in the tire radial direction. Each of the first belt ply7A and the second belt ply7B includes a plurality of belt cords oriented at an angle of from 15 to 45 degrees with respect to the tire circumferential direction, and a topping rubber (not illustrated) covering the belt cords. Note that the tread portion2is not limited to such an embodiment.", "", "It is preferable that a length L2(shown inFIG.1) in the tire axial direction of the second belt ply7B is smaller than a length L1(shown inFIG.1) in the tire axial direction of the first belt ply7A. Thereby, the outer ends7bin the tire axial direction of the second belt ply7B are located inward in the tire axial direction of the respective axially outer ends7aof the first belt ply7A. The length L2of the second belt ply7B is preferably in a range from 90% to 98% of the length L1of the first belt ply7A. The length L2of the second belt ply7B is preferably in a range from 65% to 80% of the cross-sectional width W of the tire1in its normal state. This can suppress the vibration of the tread portion2while reducing the weight increase of the tire1.", "", "The band layer8according to the present embodiment is arranged to cover the entire belt layer7. In the present embodiment, the band layer8is composed of, for example, a single band ply8A. The band ply8A includes, for example, a band cord Ga (shown inFIG.5A) arranged at an angle of not more than 5 degrees with respect to the tire circumferential direction, and a topping rubber Gb covering the band cord Ga. The band ply8A may be formed, for example, by spirally winding a band strips Gs (shown inFIG.5A) containing the band cord Ga.FIG.5Aillustrated a perspective view of the band strip Gs.FIG.5Billustrates a partial cross-sectional view of the tread portion2using the band strip Gs. As illustrated inFIGS.5A and5B, the band ply8A can be provided with a gap S separating the turns of the band strip Gs adjacent to each other in the tire axial direction, for example, in the outer portion of the tire radial direction of the first portion11. A width Ws of the gap S in the tire axial direction is preferably equal to or more than 20% of the width Wg of the band strip Gs, more preferably equal to or more than 30%, but equal to or less than 60%, more preferably equal to or less than 50%.", "", "FIG.6illustrates a development view of the ground contact surface2sof tread portion2ofFIG.1. As illustrated inFIG.6, the tread portion2is provided with a plurality of circumferential grooves20, for example. In the present embodiment, the circumferential grooves20are arranged between the first tread edge T1and the second tread edge T2. The circumferential grooves20extend continuously in the tire circumferential direction. In the present embodiment, each circumferential groove20, for example, extends linearly in parallel with the tire circumferential direction, for example. For example, each circumferential groove20may extend in a wavy manner.", "", "In the present embodiment, the plurality of circumferential grooves20include a first shoulder circumferential groove21, a second shoulder circumferential groove22, a first crown circumferential groove23and a second crown circumferential groove24. The first shoulder circumferential groove21is disposed between the first tread edge T1and the tire equator C. In the present embodiment, the first shoulder circumferential groove21is disposed closest to the first tread edge T1among the plurality of circumferential grooves20. The second shoulder circumferential groove22is disposed between the second tread edge T2and the tire equator C. In the present embodiment, the second shoulder circumferential groove22is disposed closest to the second tread edge T2among the plurality of circumferential grooves20. The first crown circumferential groove23is disposed between the first shoulder circumferential groove21and the tire equator C. The second crown circumferential groove24is disposed between the second shoulder circumferential groove22and the tire equator C.", "", "It is preferable that a distance L3in the tire axial direction from the tire equator C to the groove center line of each of the first shoulder circumferential groove21and the second shoulder circumferential groove22is, for example, in a range from 25% to 35% of the tread width TW. It is preferable that a distance L4in the tire axial direction from the tire equator C to the groove center line of each of the first crown circumferential groove23and the second crown circumferential groove24is, for example, in a range from 5% to 15% of the tread width TW.", "", "As illustrated inFIG.4, it is preferable that that the groove width Wa of each of the circumferential grooves20is at least 3 mm or more. Further, it is preferable that the groove width of each of the circumferential grooves20is, for example, in a range from 4.0% to 8.5% of the tread width TW. Additionally, the total groove width of the plurality of circumferential grooves20is, for example, in a range from 20% to 30%, preferably 25% to 30% of the tread width TW. Thereby, it is possible to improve steering stability on dry roads while reducing the vehicle exterior noise. It is preferable that, in the case of pneumatic tires for passenger cars, the depth (not illustrated) of each of the circumferential grooves20is, for example, in a range from 5 to 10 mm.", "", "As illustrated inFIG.6, it is preferable that the groove width W3of the first crown circumferential groove23is, for example, greater than the groove width W1of the first shoulder circumferential groove21. Specifically, the groove width W3is in a range from 150% to 200% of the groove width W1. It is preferable that the groove width W4of the second crown circumferential groove24is, for example, greater than the groove width W2of the second shoulder circumferential groove22. Specifically, the groove width W4is not more than 140%, preferably in a range from 105% to 120%, of the groove width W2. In some more preferred aspect, the first shoulder circumferential groove21has a smallest groove width among the plurality of circumferential grooves20. This makes it difficult for the noise generated by the circumferential grooves20to diffuse toward the outside of the vehicle while ensuring wet performance, therefore, the vehicle exterior noise can be reduced.", "", "The plurality of land portions25includes a crown land portion30, a first middle land portion28, a second middle land portion29, a first shoulder land portion26and a second shoulder land portion27. The crown land portion37is defined between the first crown circumferential groove23and the second crown circumferential groove24. The first middle land portion28is defined between the first shoulder circumferential groove21and the first crown circumferential groove23. Thus, the first middle land portion28is adjacent to the crown land portion30via the first crown circumferential groove23. The second middle land portion29is defined between the second shoulder circumferential groove22and the second crown circumferential groove24. Thus, the second middle land portion29is adjacent to the crown land portion30via the second crown circumferential groove24.", "", "The first shoulder land portion26includes the first tread edge T1and is defined on the outer side in the tire axial direction of the first shoulder circumferential groove21. Thus, the first shoulder land portion26is adjacent to the first middle land portion28via the first shoulder circumferential groove21. The second shoulder land portion27includes the second tread edge T2and is defined on the outer side in the tire axial direction of the second shoulder circumferential groove22. Thus, the second shoulder land portion27is adjacent to the second middle land portion29via the second shoulder circumferential groove22.", "", "These land portions25are each provided with a plurality of lateral grooves31. The arrangement of the lateral grooves31shown inFIG.6is merely an example, and the present disclosure is not limited to such an example.", "", "It is preferable that the first middle land portion28is not divided in the tire circumferential direction by grooves whose widths are 2 mm or more. Similarly, it is preferable that the crown land portion30and the second middle land portion29are not divided in the tire circumferential direction by grooves whose widths are 2 mm or more. Thereby, the pattern noise generated by these land portions can be reduced, and the vehicle exterior noise can be reduced.", "", "It has been known that, generally, when the land ratio of the tread portion is decreased, the pattern noise increases and vehicle exterior noise increases. On the other hand, it has been known that, when the land ratio is increased, the pattern noise is reduced, but the vibration from the road surface is more likely to be transmitted to the vehicle through the tire, resulting in an increase in vehicle interior noise. For this reason, conventional tires are often designed with a relatively small land ratio (less than 65%).", "", "In contrast, the land ratio of the tread portion2is equal to or more than 65% in the present embodiment. In this specification, the “land ratio” is defined as Sb/Sa, which is the ratio of the actual total ground area Sb to the total area Sa of the virtual ground surface after filling all the grooves and sipes on the ground surface2sof the tread portion2.", "", "By setting the land ratio to 65% or more, the tire1of the present disclosure can be reduced in pattern noise, and as a result, it is possible to reduce the vehicle exterior noise. In the tire1according to the present disclosure, as the first thickness t1(shown inFIG.1) of the first portion11is large as described above, the tread portion2can effectively absorb vibrations from the road surface, and the vehicle interior noise can be reduced even if the land ratio of the tread portion2is large. For this reason, the present disclosure can reduce both the vehicle exterior noise and vehicle interior noise.", "", "It is preferable that the land ratio Lac of the crown land portion30is greater than the land ratio Lam1of the first middle land portion28. Specifically, the land ratio Lac is greater than 105%, preferably 106% or more but less than 120%, of the land ratio Lam1. Thereby, the pattern noise generated by the crown land portion30can be reduced, and further, the steering stability and wear resistance performance on dry roads can be enhanced.", "", "It is preferable that the land ratio Lam1of the first middle land portion28is more than the land ratio Las' of the first shoulder land portion26. Specifically, the land ratio Lam1is more than 105% of the land ratio Las1, more specifically 106% or more but less than 120%. Thereby, it is possible to further enhance the steering stability and wear resistance on dry roads.", "", "From a similar point of view, it is preferable that the land ratio Lam2of the second middle land portion29is more than the land ratio Las2of the second shoulder land portion27. Specifically, the land ratio Lam2is more than 105% of the land ratio Las2, more specifically 106% or more but less than 120%.", "", "FIG.7is a tire meridian cross-sectional view of the tread portion2. As illustrated inFIG.7, a groove depth d3of the first crown circumferential groove23is the same as, for example, a groove depth d4of the second crown circumferential groove24. In the present embodiment, the groove depth d3of the first crown circumferential groove23is greater than a groove depth d1of the first shoulder circumferential groove21and a groove depth d2of the second shoulder circumferential groove22. As a result, the maximum value dx of the groove depth of the circumferential grooves20(shown inFIG.1) is the groove depth d3of the first crown circumferential groove23and the groove depth d4of the second crown circumferential groove24. Thus, by setting the groove depth d3of the first crown circumferential groove23and the groove depth4of the second crown circumferential groove24adjacent to the tire equator C, where high ground contact pressure acts during straight driving, to the maximum groove depth value dx, the volume of the tread rubber2G near the tire equator C can be reduced. This can further improve the rolling resistance performance. Preferably, although it is not limited, the groove depth d1of the first shoulder circumferential groove21is, for example, in a range from 5 to 10 mm for a passenger car pneumatic tire. The groove depth d1of the first shoulder circumferential groove21and the groove depth d2of the second shoulder circumferential groove22are preferably at least 75% of the groove depth d3of the first crown circumferential groove23, more preferably equal to or more than 80%, but preferably equal to or less than 95%, more preferably equal to or less than 90%.", "", "As illustrated inFIG.1, the maximum value tx of the first thickness t1of the first portion11is in a range from 0.25 to 0.60 times the maximum value dx of the groove depth d of the circumferential grooves20. By adopting the above configuration, the rolling resistance performance can be improved while maintaining the noise performance and steering stability performance. The reasons may be as follows.", "", "The inner rubber10can absorb vibrations from the road surface during driving, thus reducing the vehicle interior noise and enhancing the ground contact feeling, thus maintaining high noise performance and steering stability performance. In addition, the inner rubber10disposed inside the carcass6is less prone to compressive deformation when the tread portion2comes into contact with the ground, which can improve the rolling resistance performance. Furthermore, since the first portion11having a relatively thicker is provided in the tread portion2, the vibration from the tread portion2can be effectively absorbed. In addition, since the maximum value of tx is equal to or more than 0.25 times the maximum value of dx, the absorption of vibration by the first portion11is effectively demonstrated. Furthermore, since the maximum value of tx is equal to or less than 0.60 times of the maximum value of dx, the excessive increase of the volume of the inner rubber10can be suppressed and the rolling resistance performance can be enhanced. In addition, the second portion12, which is relatively small in thickness, is disposed in the sidewall portions3, so that the increase of the tire mass can be suppressed. In order to effectively demonstrate such effects more effectively, the maximum value of tx is preferably equal to or more than 0.30 times the maximum value of dx, and equal to or less than 0.55 times the maximum value of dx.", "", "As illustrated inFIG.4, the first portion11includes a first end portion13on the first tread edge T1side, a second end portion14on the second tread edge T2side, and a center portion15located between the first end portion13and the second end portion13. The center portion15includes a portion having the maximum value tx of the first thickness t1(shown inFIG.1). The thickness tc of the center portion15is substantially the same (maximum value tx) in the present embodiment.", "", "In the first end portion13, the first thickness t1continuously decreases toward an outer end11aon the first tread edge T1side, of the first portion11. In the second end portion14, the first thickness t1continuously decreases toward an outer end11bon the second tread edge T2side, of the first portion11. In the present embodiment, the positions at which the decreasing of the first thickness t1ends correspond to the outer ends11aand11bof the first portion11in the tire axial direction.", "", "In the present embodiment, the outer end11aon the first tread edge T1side of the first portion11is positioned on the first tread edge T1side with respect to the first crown circumferential groove23, more preferably on the first tread edge T1side with respect to the first shoulder circumferential groove21. This can reduce the vehicle interior noise for sure. In addition, the outer end11aon the first tread edge T1side of the first portion11is located, for example, between the first shoulder circumferential groove21and the outer end7aof the belt ply7, more preferably between the first shoulder circumferential groove21and the outer edge7bof the second belt ply7B. This can improve the rolling resistance performance and noise performance in a well-balanced manner.", "", "InFIG.8, there is shown an enlarged cross-sectional view of the first end portion13of the first portion11. As illustrated inFIG.8, it is preferable that the outer end11aof the first portion11on the first tread edge T1side is located at the same position in the tire axial direction as the outer end7bin the tire axial direction of the second belt ply7B, or on the inner side in the tire axial direction of the outer end7bof the second belt ply7B. In some more preferred embodiments, the distance L5in the tire axial direction between the outer end11aof the first portion11and the outer end7bof the second belt ply7B is equal to or less than 10 mm. Thereby, the deformation of a portion around the outer end11aof the first portion11during running of the tire can be suppressed by the belt layer7while securing a sufficient length in the tire axial direction of the first portion11, and as a result, separation of the inner rubber10around the outer end11acan be suppressed. Therefore, the improvement of noise performance can be maintained over a long period of time.", "", "In addition, the first end portion13is connected to a portion extending with a constant first thickness t1on the tire equator C side. The length L6in the tire axial direction of the first end portion13is in a range from 2.0% to 4.0% of the tread width TW (shown inFIG.1). Thereby, the thickness of the inner rubber10can be prevented from abruptly changing, and damage such as separation of the inner rubber10can be suppressed.", "", "As illustrated inFIG.4, a length L7in the tire axial direction of the first portion11is defined as a length in the tire axial direction from the outer end11aon the first tread edge T1side to the outer end11bon the second tread edge T2side of the first portion11. It is preferable that the length L7in the tire axial direction of the first portion11in the present embodiment is in a range from 90% to 110% of the tread width TW. Thereby, it is possible to reliably reduce the vehicle interior noise while suppressing an increase in tire weight. The length L7of the first portion11, for example, is equal to or more than 70% of the length L2of the second belt ply7B (shown inFIG.1), more preferably equal to or more than 80%, but preferably equal to or less than 98%, more preferably equal to or less than 95%.", "", "It is preferable that the length L7of the first portion11is in a range from 65% to 85% the sectional width W (shown inFIG.1). The vibration of the tread portion2can be suppressed over a wide area when the length L7of the first portion11is equal to or more than 65% of the cross-sectional width W. The weight increase of the inner rubber10can be suppressed when the length L7of the first portion11is equal to or less than 85% of the cross-sectional width W.", "", "In the present embodiment, the first portion11has a first length L8from the tire equator C to the outer end11aon the first tread edge T1side, and a second length L9from the tire equator C to the outer end11bon the second tread edge T1side, and the first length L8is substantially the same as the second length L9. More specifically, the difference between the first length L8and the second length L9is equal to or less than 5% the first length L8. In another embodiment, the second length L9may be greater than the first length L8, for example. Specifically, the second length L9may be in a range from 105% to 110% the first length L8. In such an embodiment, the length of the first portion11is sufficiently secured on the second tread edge T2side, which is the inside of the vehicle when installed on the vehicle, and thus the vehicle interior noise can be further reduced.", "", "The first portion11extends between the first end portion13and the second end portion14while keeping the constant first thickness t1. Thereby, the first thickness t1is substantially the same at the position of the tire equator C and at positions on the first tread edge T1side of the first shoulder circumferential groove21. In some preferred aspect, the first thickness t1is substantially the same from the position of the tire equator C to a position beyond the first shoulder circumferential groove21. Here, the term “substantially the same” means that inevitable errors in rubber products such as tires are allowable, and it shall comprise an aspect in which the difference between the maximum value and minimum value of the thickness is not more than 5% of the maximum value.", "", "In this embodiment, the outer end11aof the first portion11is located inwardly in the tire axial direction with respect to the first tread edge T1. Such a tire1can maintain superior rolling resistance and high-speed durability performance because of the reduced mass of the tire. It is noted that the first portion11may extend to the first tread edge T1with a constant first thickness t1(not illustrated). That is, from the position of the tire equator C to a position of the first tread edge T1(an imaginary line extending parallel to the tire radial direction through the first tread edge T1), the first thickness t1may be substantially the same.", "", "The first portion11has the same configuration on the second tread edge T2side as on the first tread edge T1side. The outer end11bof the first portion11on the second tread edge T2side is, for example, located on the second tread edge T2side of the second crown circumferential groove24, more preferably on the second tread edge T2side of the second shoulder circumferential groove22. In addition, it is preferable that the outer end11bof the first portion11on the second tread edge T2side is located at the same position in the tire axial direction as the outer end7bin the tire axial direction of the second belt ply7B, or on the inside in the tire axial direction of the outer end7bof the second belt ply7B. Further, the distance L5in the tire axial direction between the outer end11bof the first portion11and the outer end7bof the second belt ply7B is equal to or less than 10 mm. The second end portion14also has the same configuration as the first end portion13.", "", "Further, the first thickness t1is substantially the same at the position of the tire equator C and at a position on the second tread edge T2side of the second shoulder circumferential groove22, for example. In some preferred embodiments, the first thickness t1is substantially the same from the position of the tire equator C to a position beyond the second shoulder circumferential groove22. Furthermore, the outer end11bof the first portion11, for example, is located inwardly in the tire axial direction with respect to the second tread edge T2.", "", "It is preferable that the average value of the first thickness t1is in a range from 1.5 to 3.5 times the average value of the second thickness t2(shown inFIG.1). Specifically, the average value of the first thickness t1is preferably equal to or more than 1.5 times, more preferably equal to or more than 1.75 times, even more preferably equal to or more than 1.9 times, but preferably equal to or less than 3.5 times, more preferably equal to or less than 2.7 times, even more preferably equal to or less than 2.2 times of the average value of the second thickness t2. Thereby, it is possible to reliably reduce the vehicle interior noise while suppressing an increase in the weight of the tire1.", "", "From a similar point of view, the average value of the first thickness t1is preferably equal to or more than 2.0 mm, more preferably equal to or more than 2.5 mm, but preferably equal to or less than 4.5 mm, more preferably equal to or less than 4.0 mm, even more preferably equal to or less than 3.5 mm. On the other hand, the average value of the second thickness t2is, for example, more than 0.5 mm, and less than 2.0 mm. In some preferred embodiments, the average value of the second thickness t2may be in a range from 1.0 to 1.5 mm. Each second portion12of the present embodiment is connected to the first portion11and extends to the respective bead portion4(shown inFIG.1), and the second thickness t2is constant throughout. However, the second portion12is not limited to such an aspect.", "", "It is preferable that the average value of the first thickness t1is equal to or more than 0.45% of the outer diameter DM of the tire1(shown inFIG.3). As a result, the influence of the horn effect on the noise performance can be further suppressed, which is expected to improve the noise performance of the tire1.", "", "It is preferable that the average value of the first thickness t1is in a range from 30% to 60% of the maximum depth of the circumferential grooves20. The maximum depth means the maximum one among the depth of the first shoulder circumferential groove21, the depth of the second shoulder circumferential groove22, the depth of the first crown circumferential groove23, and the depth of the second crown circumferential groove24.", "", "The influence of the horn effect on the noise performance can be further suppressed when the average value of the first thickness t1is equal to or more than 30% of the maximum depth. The weight increase of the inner rubber10can be suppressed when the average value of the first thickness t1is equal to or less than 60% of the maximum depth.", "", "It has been confirmed by the inventor that by setting the twist coefficient K of the carcass cord6B in a range from 2000 to 2500 and the average value of the first thickness t1of the first portion11in a range from 2.0 mm to 4.5 mm, the vehicle interior noise in the low frequency band equal to or lower than 160 Hz, the medium frequency band from 160 Hz to 350 Hz and the high frequency band equal to or higher than 350 Hz can be reduced.", "", "Further, it has been confirmed by the inventor that by setting the twist coefficient K of the carcass cord6B in a range from 2000 to 2500 and the average value of the first thickness t1of the first portion11in a range from 2.0 mm to 3.5 mm, the rolling resistance does not deteriorate.", "", "In the present embodiment, the first portion11and the second portions12of the inner rubber10are made of an air impermeable rubber material. As such a rubber material, for example, a butyl-based rubber material or halogenated butyl-based rubber material can be employed. In the present embodiment, the first portion11and the second portions12are made of the same rubber material.", "", "The tread portion2includes a tread rubber2G which forms the ground contact surface2s. The tread portion2includes, for example, a cap rubber2A forming the ground contact surface2s, and a base rubber2B disposed inside the cap rubber2A in the tire radial direction. The tread portion2is not limited to such example, and may be composed of, for example, a single layer of a rubber material, or three or more layers of rubber materials.", "", "The volume V2of the inner rubber10is preferably equal to or more than 0.30 times the volume V1of the tread rubber2G, more preferably equal to or more than 0.35 times, but preferably equal to or less than 0.50 times, more preferably equal to or less than 0.45 times. When the volume V2of the inner rubber10is equal to or more than 0.30 times the volume V1of the tread rubber2G, the noise performance and the steering stability performance can be kept high. When the volume V2of the inner rubber10is equal to or less than 0.50 times the volume V1of the tread rubber2G, the increase of the tire mass can be suppressed and the rolling resistance performance can be improved. As used herein, the volume V1of tread rubber2G is the total volume of wearable material disposed between the tire radial line n1passing through the first tread edge T1(shown inFIG.7) and the tire radial line n2passing through the second tread edge T2. Here, the wearable material is the rubber material sandwiched between the outermost surface of the reinforcing layer located radially outwardly of the carcass6and the ground contact surface2s. The reinforcing layer means a ply material composed of cords and topping rubber. In this embodiment, the outermost surface is the outer surface8aon the ground contact surface2sside of the band layer8. The volume V1of the tread rubber2G shall include the cavity volume of the recesses formed in the ground contact surface2s. The recesses shall include grooves and sipes except for the circumferential grooves that extend continuously in the tire circumferential direction. In the present embodiment, the volume V1of the tread rubber2G is composed of the cap rubber2A and the base rubber2B.", "", "As illustrated inFIG.4, in the present embodiment, the loss tangent tan δ1 of the first portion11at 70 degrees C. is preferably equal to or greater than the loss tangent tan 82 of the second portion12at 70 degrees C. The first portion11can help to suppress the vibration of the tread portion2and can improve the noise performance of the pneumatic tire1.", "", "It is preferable that the loss tangent tan δ1 of the first portion11at 70 degrees C. is equal to or less than the loss tangent tan δA of the tread rubber2G at 30 degrees C. The tread rubber2G forming the ground contact surface2sis cooled by contacting with the outside air, so the measured temperature is set at 30 degrees C. Such a first portion11can further reduce the influence of the tread portion2on the rolling resistance, and is useful for improving the fuel efficiency performance of the tire1. Therefore, the tire1according to the present embodiment can achieve both the noise performance and low fuel consumption performance.", "", "Here, the loss tangent tan δ is measured according to JIS-K6394 by using a dynamic viscoelasticity measuring device under the following conditions. The rubber sample for measuring the loss tangent tan δ is taken out from the vulcanized tire1such that the longitudinal direction of the sample coincides with the circumferential direction of the tire1.", "", "Measurement temperature: 30 degrees C. or 70 degrees C.", "", "Initial strain: 5% when measuring temperature is 30 degrees C. or 10% when measuring temperature is 70 degrees C.", "", "Amplitude of dynamic strain: +/−1%", "", "Frequency: 10 Hz", "", "Deformation Mode: Tensile", "", "Incidentally, the loss tangent tan δ can be adjusted by appropriately changing the glass transition point Tg of the rubber composition and/or the types and amounts of various compounding agents. For example, it is possible to increase the loss tangent tan δ by: increasing the glass transition point Tg of the rubber composition; decreasing the average particle size of reinforcing agents such as carbon and silica; increasing the amount of reinforcing agent; and/or decreasing the amount of vulcanizing agent such as sulfur and accelerators.", "", "Here, when the first portion11is made of a single rubber material, the loss tangent tan δ1of the first portion11is that of the single rubber material. When the first portion11is composed of a plurality of rubber materials, the loss tangent tan δ1of the first portion11is a weighted average obtained by weighting the loss tangent tan δ1values of the rubber materials by the cross-sectional areas of the respective rubber materials. The same applies to the loss tangents tan δ of the other portions.", "", "As a more preferred aspect, the loss tangent tan δ1of the first portion11at 70 degrees C. is in a range from 1.0 to 2.0 times the loss tangent tan 82 of the second portion12at 70 degrees C. As the loss tangent tan δ1of the first portion11at 70 degrees C. is not less than 1.0 times the loss tangent tan 82 of the second portion12at 70 degrees C., the vibration suppressing effect of the tread portion2can be achieved reliably. From this point of view, the loss tangent tan δ1of the first portion11at 70 degrees C. is more preferably equal to or more than 1.1 times the loss tangent tan 82 of the second portion12at 70 degrees C.", "", "As the loss tangent tan δ1of the first portion11at 70 degrees C. is equal to or less than 2.0 times the loss tangent tan 82 of the second portion12at 70 degrees C., damage such as separation due to an excessive difference in physical properties can be suppressed, and the durability performance of the tire1can be improved. From this point of view, the loss tangent tan δ1of the first portion11at 70 degrees C. is more preferably equal to or less than 1.5 times the loss tangent tan 82 of the second portion12at 70 degrees C.", "", "The loss tangent tan δ1of the first portion11at 70 degrees C. is preferably in a range from 0.4 to 0.7 times the loss tangent tan δA of the tread rubber2G at 30 degrees C. By setting the loss tangent tan δ1of the first portion11at 70 degrees C. to be equal to or more than 0.4 times the loss tangent tan δA of the tread rubber2G at 30 degrees C., vibrations of the tread portion2can be reduced while maintaining the fuel efficiency of the tire1.", "", "As the loss tangent tan δ1of the first portion11at 70 degrees C. is equal to or less than 0.7 times the loss tangent tan δA of the tread rubber2G at 30 degrees C., vibrations of the tread portion2can be reduced while maintaining the high-speed durability performance of the tire1.", "", "The loss tangent tan δ1of the first portion11at 70 degrees C. is preferably equal to or more than 0.14. As the loss tangent tan δ1of the first portion11at 70 degrees C. is equal to or more than 0.14, vibrations of the tread portion2can be reliably suppressed, and noise generation can be reduced. From this point of view, the loss tangent tan δ1of the first portion11at 70 degrees C. is more preferably equal to or more than 0.15, still more preferably equal to or more than 0.20.", "", "The loss tangent tan δ of the first portion11at 30 degrees C. is preferably in a range from 0.4 to 0.7 times the loss tangent tan δ of the tread rubber2G at 30 degrees C. By setting the loss tangent tan δ of the first portion11to be equal to or more than 0.4 times the loss tangent tan δ of the tread rubber2G, vibrations of the tread portion2can be reduced. By setting the loss tangent tan δ of the first portion11to be equal to or less than 0.7 times the loss tangent tan δ of the tread rubber2G, the rolling resistance of the tire can be reduced.", "", "In the tire1according to the present embodiment, owing to the synergistic effect of the carcass cords6B having a twist coefficient K of from 2000 to 2500 and the rubber of the first portion11having the loss tangent tan δ, it becomes possible to more easily reduce the vehicle interior noise without increasing rolling resistance.", "", "Preferably, the loss tangent tan δ of the first portion11at 30 degrees C. is in a range from 0.4 to 0.7 times the loss tangent tan δ of the base rubber at 30 degrees C. As the loss tangent tan δ of the first portion11is equal to or more than 0.4 times the loss tangent tan δ of the base rubber, vibrations of the tread portion2can be reliably suppressed, and noise generation can be reduced. As the loss tangent tan δ of the first portion11is equal to or less than 0.7 times the loss tangent tan δ of the base rubber, the rolling resistance of the tire1can be reduced.", "", "It is preferable that the loss tangent tan 82 of the second portion12at 70 degrees C. is the same as the loss tangent tan δ1of the first portion11at 70 degrees C. Such an inner rubber10allows the first portion11and the second portion12to be formed as a single piece and helps to reduce the production cost of the pneumatic tire1.", "", "The loss tangent tan δA of the tread rubber2G at 30 degrees C. is preferably equal to or less than 0.30. As the loss tangent tan δA of the tread rubber2G at 30 degrees C. is not more than 0.30, the rolling resistance can be reduced, which makes it possible to improve the fuel economy performance of the tire1. From this point of view, the loss tangent tan δA of the tread rubber2G is more preferably equal to or less than 0.25, still more preferably equal to or less than 0.20.", "", "When the tread portion2is composed of a plurality of rubber materials, the tread rubber2G is the rubber material forming the ground contact surface2s, for example, the loss tangent tan δA of the tread rubber2G means the loss tangent of the rubber material that constitutes the ground contact surface2s(for example, the cap rubber2A). It is also preferable that the loss tangent tan δB of the base rubber2B at 70 degrees C. is smaller than the loss tangent tan δA of the cap rubber2A at 30 degrees C. Such a tread portion2can help to improve the fuel economy performance while maintaining superior high-speed durability performance of the tire1.", "", "The loss tangent tan δB of the base rubber2B at 70 degrees C. is preferably equal to or less than 0.21. As the loss tangent tan δB of the base rubber2B at 70 degrees C. is not more than 0.21, heat generation in the tread portion2during driving can be suppressed, which helps to maintain superior fuel efficiency performance of the tire1. From this point of view, the loss tangent tan δB of the base rubber2B at 70 degrees C. is more preferably equal to or less than 0.20.", "", "FIG.9illustrates a cross-sectional view of a portion around the first tread edge T1of the tread portion2according to another embodiment.", "", "As shown inFIG.9, the first portion11of the inner rubber10of this embodiment includes an inner liner layer16made of an air-impermeable rubber material (hereinafter referred to as the first rubber material), and an additional layer17disposed between the inner liner layer16and the carcass6. The additional layer17is made of a second rubber material different from the first rubber material. As the second rubber material, for example, a rubber material having air permeability is employed. That is, the first portion11of this embodiment is formed by combining the air-impermeable rubber material and the air-permeable rubber material.", "", "In this embodiment, as the first portion11includes the additional layer17, it is possible to improve various performances. For example, as the second rubber material forming the additional layer17, a rubber material having a loss tangent tan δ larger than that of the first rubber material forming the inner liner layer16may be employed. In this case, the maximum value of the loss tangent tan δ1of the first portion11is the loss tangent tan δ of the additional layer17. Further, the maximum value of the loss tangent tan δ2of the second portion12corresponds to the loss tangent tan δ of the inner liner layer16. This embodiment allows the tread portion2to absorb more vibration from the road surface during driving and the vehicle interior noise can be further reduced.", "", "The loss tangent tan δ of the air-impermeable rubber material at 70 degrees C. is preferably equal to or more than 0.14. With this, the vibration of the tread portion2can be further reduced.", "", "The arrangement position of the additional layer17is not limited to the embodiment shown inFIG.9.FIG.10illustrates an enlarged cross-sectional view of the first portion11and the second portion12of yet another embodiment. As shown inFIG.10, the additional layer17may be arranged inside the inner liner layer16in the tire radial direction. Moreover, the additional layer17may constitute a part of the tire inner cavity surface1A.", "", "As illustrated inFIG.9andFIG.10, even when the first portion11of the inner rubber10includes the additional layer17, the first thickness t1corresponds to the thickness from the inner surface6iof the carcass6in the tread portion2to the tire inner cavity surface1A.", "", "FIG.11illustrates an enlarged cross-sectional view of one of the sidewall portions3of another embodiment of the present disclosure. As illustrated inFIG.11, the second portion12according to this embodiment includes an inner liner layer16made of an air impermeable first rubber material, and an intermediate layer18disposed between the inner liner layer16and the carcass6. InFIG.11, the intermediate layer18is dotted. The intermediate layer18is made of a rubber material different from the first rubber material. The intermediate layer18may be made of, for example, the same second rubber material as the additional layer17of the first portion11described with reference toFIG.9andFIG.10. As a result of the second portion12including such intermediate layer18, it is possible to further suppress the transmission of vibrations generated in the tread portion2to the vehicle. It may be possible that the intermediate layer18is made of a rubber material different from the first rubber material and the second rubber material.", "", "The intermediate layer18is, for example, overlapped with the band layer8in the tire axial direction. In some preferred embodiments, the intermediate layer18is overlapped with the belt layer7in the tire axial direction. The intermediate layer18may be continuous with the first portion11of the inner rubber10. In addition, it is preferable that the intermediate layer18extends to the inner side in the tire radial direction than the outer end in the tire radial direction of the turn-up portion6bof the carcass6. In other words, in this embodiment, the intermediate layer18overlaps with the turn-up portion6bin the tire radial direction. Such an intermediate layer18can help to further reduce the vehicle interior noise.", "", "While detailed description has been made of preferred embodiments of the present disclosure, the present disclosure can be embodied in various modes without being limited to the illustrated embodiments."], "claims": ["a tread portion; a pair of sidewall portions; a pair of bead portions; a carcass extending between the pair of bead portions; and an inner rubber extending between the pair of bead portions on an inner side of the carcass; wherein the inner rubber comprises a first portion extending in the tread portion with a first thickness and a second portion extending in each of or one of the pair of sidewall portions with a second thickness, the first thickness is greater than the second thickness, and in a tire meridian cross-section, a cross-sectional area of the inner rubber is in a range from 1.5% to 10% of an inner-cavity cross-sectional area of the pneumatic tire.", "an average value of the first thickness is in a range from 1.5 to 3.5 times an average value of the second thickness.", "the average value of the first thickness is in a range from 2.0 to 4.5 mm.", "a cross-sectional width of the tire is in a range from 205 to 325 mm, an aspect ratio of the tire is in a range from 25% to 65%, and a rim diameter on which the pneumatic tire is to be mounted is in a range from 16 to 22 inches.", "the tread portion comprises a first tread edge, a tire equator, a first shoulder circumferential groove arranged between the tire equator and the first tread edge, the first portion of the inner rubber has an outer end in a tire axial direction on a first tread edge side with respect to the tire equator, and the outer end is located outwardly in the tire axial direction of the first shoulder circumferential groove.", "the tread portion comprises a tread rubber forming a ground contact surface, a loss tangent tan δ", "the tread portion comprises a plurality of circumferential grooves extending continuously in a tire circumferential direction, and a maximum value of the first thickness of the first portion is in a range from 0.25 to 0.60 times a maximum value of groove depths of the plurality of circumferential grooves.", "the tread portion comprises a tread rubber forming a ground contact surface, and a volume of the inner rubber is in a range from 0.30 to 0.50 times a volume of the tread rubber.", "the first portion is made of a composite of an air-impermeable rubber material and an air-permeable rubber material.", "an outer diameter of the tire is equal to or more than 660 mm in a normal state that the tire is mounted on a standard wheel rim with normal internal pressure but loaded with no tire load, the tread portion comprises a plurality of circumferential grooves extending continuously in a tire circumferential direction, and a total groove width of the plurality of circumferential grooves is in a range from 25% to 30% of a tread width of the tread portion.", "a cross-sectional width of the tire in the normal state is equal to or more than 225 mm.", "a length in the tire axial direction of the first portion is in a range from 65% to 85% of the cross-sectional width.", "the first thickness is equal to or more than 0.45% of the outer diameter.", "the carcass comprises carcass cords, and the carcass cords have a twist coefficient in a range from 2000 to 2500.", "the tread portion comprises a tread rubber forming a ground contact surface, and a loss tangent tan δ", "the loss tangent tan δ", "the carcass comprises a main portion extending between the pair of bead portions, and a pair of turn-up portions connected to the main portion and each turned up around a respective bead core from the inside to outside in the tire axial direction, and an outer end of at least one of the turn-up portions is positioned outwardly in the tire radial direction of a maximum width position of the main portion.", "the tread portion comprises a plurality of circumferential grooves extending continuously in a tire circumferential direction, and a maximum value of the first thickness of the first portion is in a range from 0.25 to 0.60 times a maximum value of groove depths of the plurality of circumferential grooves, and a total groove width of the plurality of circumferential grooves is in a range from 25% to 30% of a tread width of the tread portion.", "the tread portion comprises a plurality of circumferential grooves extending continuously in a tire circumferential direction, the carcass comprises carcass cords, a maximum value of the first thickness of the first portion is in a range from 0.25 to 0.60 times a maximum value of groove depths of the plurality of circumferential grooves, and the carcass cords have a twist coefficient in a range from 2000 to 2500.", "the tread portion comprises a plurality of circumferential grooves extending continuously in a tire circumferential direction, the carcass comprises carcass cords, a maximum value of the first thickness of the first portion is in a range from 0.25 to 0.60 times a maximum value of groove depths of the plurality of circumferential grooves, a total groove width of the plurality of circumferential grooves is in a range from 25% to 30% of a tread width of the tread portion, and the carcass cords have a twist coefficient in a range from 2000 to 2500."], "bibtex": "@patent{20240131865,\n    title = {PNEUMATIC TIRE},\n    number = {20240131865},\n    year = {2024},\n    note = {File: US20240131865A1-20240425.XML}\n    }", "classification": "B60C304FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240131866", "filename": "US20240131866A1-20240425.XML", "abstract": "A pneumatic tire comprises: a tread portion having a ground contacting surface; a sidewall portions having an outer surface; a bead portions; a carcass extending between the bead portions; and an inner rubber extending between bead portions. The inner rubber comprises a first portion extending through the tread portion with a first thickness t 1 , and a second portion extending through the sidewall portion with a second thickness t 2 . The first thickness t 1 is more than the second thickness t 2 . In a meridian cross section of the tire under its normal state, when a first reference point (Pb 1 ), a second reference point (Pb 2 ), a shoulder reference point (Ps), a reference line segment (Lb), and a shoulder line segment (Ls) are defined, then a length (L 1 ) of the shoulder line segment (Ls) is 85.9% to 89.3% of a length (L 2 ) of the reference line segment (Lb).", "detailed_description": ["Hereinafter, an embodiment of the present disclosure will be described in detail in conjunction with accompanying drawings.", "", "FIG.1is a cross-sectional view of a pneumatic tire1of the present embodiment (hereinafter sometimes simply referred to as the “tire1”), including the rotational axis, under its normal state.", "", "Here, the “normal state” is a state of the pneumatic tire1which is mounted on a regular rim, and inflated to a normal internal pressure, and loaded with no tire load. Hereinafter, dimensions, positions and the like of each portion or component of the pneumatic tire1refer to those under the normal state unless otherwise noted. When components of the tire1cannot be directly measured under the normal state (for example, internal components) dimensions and the like thereof refer to values measured with the tire1in a state that approximates the normal state as much as possible.", "", "If there is a standard system including standards on which the pneumatic tire1is based, the “regular rim” is a wheel rim specified for the tire by the standard system, for example, the “Standard Rim” in JATMA, “Design Rim” in TRA, and “Measuring Rim” in ETRTO.", "", "If there is no standard system including standards on which the pneumatic tire1is to be based, the “regular rim” means a wheel rim which has the smallest rim diameter among the wheel rims on which the tire can be mounted without causing air leakage, and which has the smallest rim width among them.", "", "If there is a standard system including standards on which the pneumatic tire1is based, the “normal internal pressure” means air pressure specified for the tire by the standard system, for example, the “maximum air pressure” in JATMA, the maximum value described in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in TRA, and the “INFLATION PRESSURE” in ETRTO.", "", "If there is no standard system including standards on which the tire1is to be based, the “normal internal pressure” is air pressure specified for the tire by the tire manufacturer or the like.", "", "As shown inFIG.1, the tire1of the present embodiment comprises a tread portion2, a pair of sidewall portions3, and a pair of bead portions4.", "", "The bead portions4are each provided with, for example, an annular bead core5embedded therein.", "", "The bead core5is made of a wound steel wire, for example.", "", "The tire1of the present embodiment is designed to be suitably used as a passenger car tire. But, the present disclosure is not limited to tires for passenger cars, and can be applied to various tires such as tires for heavy duty vehicles, tires for two-wheeled vehicles, tires for industrial vehicles and the like.", "", "The tire1of the present embodiment comprises a carcass6extending between the paired bead portions4, and an inner rubber10extending between the paired bead portions4, on the inner side of the carcass6.", "", "The inner rubber10in this embodiment forms the tire inner cavity surface1i.", "", "The carcass6is composed of at least one, in this embodiment, only one carcass ply6A.", "", "The carcass ply6A comprises, for example, a main portion6aand turnup portions6b.", "", "The main portion6aextends, for example, between the two bead portions4.", "", "The turnup portion6bis, for example, connected to the main portion6aand folded back around the bead core5from the inside to the outside in the tire axial direction.", "", "The inner rubber10in the present embodiment comprises a first portion11extending through the tread portion2with a first thickness t1, and a second portion12extending through the paired sidewall portions3with a second thickness t2.", "", "Here, the first thickness t1and the second thickness t2mean the thickness from the inner surface6iof the carcass6to the tire inner cavity surface1i, not including that of the topping rubber of the carcass ply6A described later.", "", "The first thickness t1in this embodiment is more than the second thickness t2. It is preferable that the first thickness t1is more than the second thickness t2over the entire circumference of the tire.", "", "Such inner rubber10can exhibit the same vibration reduction effect as that of increasing the thickness of the tread rubber2G which will be described later, with a small increase in weight.", "", "As the increase in weight on the inner side of the carcass6has little effect on the rolling resistance, the tire1of the present embodiment can improve noise performance, while maintaining good fuel efficiency performance.", "", "Here, that the first thickness t1is larger than the second thickness t2means that the average value of the first thickness t1is larger than the average value of the second thickness t2.", "", "The average value of the first thickness t1corresponds to a value obtained by dividing the cross-sectional area of the first portion11by the length of the first portion11along the tire inner cavity surface1iin the meridian cross section of the tire.", "", "The same applies to the average value of the second thickness t2.", "", "The tread portion2in this embodiment has a ground contacting surface2sbetween the first tread edge T1and the second tread edge T2.", "", "Here, the first tread edge T1and the second tread edge T2are the outermost edges in the tire axial direction when the tire1under its normal state is set on a flat horizontal surface at a camber angle of 0 degrees and loaded with 70% of the normal load.", "", "If there is a standard system including standards on which the tire1is based, the “normal load” is a load specified for the tire by the standard system, for example, the “maximum load capacity” in JATMA, the maximum value described in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in TRA, and the “LOAD CAPACITY” in ETRTO.", "", "If there is no standard system including standards on which the tire1is to be based, the “normal load” is a maximum load applicable to the tire in use, specified for the tire by the tire manufacturer or the like.", "", "The ground contacting surface2shas a tire equator C at the central position in the tire axial direction between the first tread edge T1and the second tread edge T2.", "", "The tread portion2preferably comprises a tread rubber2G which forms the ground contacting surface2s.", "", "The tread portion2may comprise, for example, a cap rubber2A which forms the ground contacting surface2s, and a base rubber2B disposed inside the cap rubber2A in the tire radial direction.", "", "Hereinafter, when the tread portion2is made of a plurality of rubber materials, the tread rubber2G means the cap rubber2A which is the rubber material forming the ground contacting surface2s, unless otherwise noted.", "", "The tread portion2is however, not limited to such example, and may be composed of, for example, only one rubber layer, or may be composed of three or more rubber layers.", "", "The paired sidewall portions3in this embodiment have outer surfaces3sextending inward in the tire radial direction from the first tread edge T1and the second tread edge T2, respectively.", "", "On the outer surface3s, there is a maximum tire width position Pm, which is the outermost position in the tire axial direction.", "", "The tire maximum width positions Pm are positions where the distance in the tire axial direction therebetween becomes the maximum width Wm on the outer surfaces3sexcluding locally projecting portions.", "", "FIG.2is a diagram for explaining shapes of the ground contacting surface2sand the outer surface3sin the meridian cross section of the tire under its normal state. As shown inFIG.2, in the meridian cross section of the tire1of the present embodiment, the tire has a profile on which a first reference point Pb1, a second reference point Pb2, a reference line segment Lb, a shoulder reference point Ps, and a shoulder line segment Ls are defined.", "", "The first reference point Pb1is an intersection of a bead base line BL with a straight line extending parallel to the tire radial direction through the tire equator C.", "", "The bead base line BL is a straight line extending parallel to the tire axial direction through a position in the tire radial direction corresponding to the rim diameter position of the regular rim, in the tire1under its normal state.", "", "The second reference point Pb2is an intersection of a straight line extending parallel to the tire axial direction through the tire equator C with a straight line extending parallel to the tire radial direction through the tire maximum width position Pm.", "", "The reference line segment Lb is a line segment extending straight between the first reference point Pb1and the second reference point Pb2.", "", "The shoulder reference point Ps is an intersection of the reference line segment Lb with the ground contacting surface2sor the outer surface3s.", "", "When the reference line segment Lb passes through a position between the first tread edge T1and the second tread edge T2as shown inFIG.1, the shoulder reference point Ps is the intersection of the reference line segment Lb with the ground contacting surface2s.", "", "When the reference line segment Lb passes through the axially outer side of the first or second tread edge T1or T2, the shoulder reference point Ps is the intersection of the reference line segment Lb with the outer surface3s.", "", "The shoulder line segment Ls is a line segment extending straight between the first reference point Pb1and the shoulder reference point Ps.", "", "The length L1of the shoulder line segment Ls in this embodiment is set in a range from 85.9% to 89.3% of the length L2of the reference segment Lb.", "", "Such tire1can reduce the wheel house/tire house, namely, the space between the tire and the vehicle body when the tire1is mounted on a vehicle, therefore, the sense of unity between the tire and the vehicle can be enhanced.", "", "Further, such tire1can suppress an increase in vibration of the tread portion2due to the change in profile because the first portion11has the large first thickness t1and is excellent in noise performance. Therefore, the tire1of the present embodiment can achieve both the appearance performance and noise performance.", "", "Preferably, the ground contacting surface2sis composed of a plurality of arcs2ahaving mutually different radii of curvature. The plurality of arcs2aincludes, for example, a first arc2bpassing through the tire equator C, a second arc2cadjacent to the first arc2bon the outer side in the tire axial direction, and a third arc2dadjacent to the second arc2con the outer side in the tire axial direction.", "", "Such ground contacting surface2sis suitable for improving the appearance performance of the tire1while suppressing uneven wear.", "", "The radius R1of curvature of the first arc2bis preferably 1.85 to 2.00 times the radius R2of curvature of the second arc2c.", "", "By setting the radius R1of curvature of the first arc2bbeing not less than 1.85 times the radius R2of curvature of the second arc2c, the wheel house when the tire is mounted on a vehicle can be reduced, namely the distance between the tire1and the vehicle body (fender) can be reduced, which helps to improve the appearance performance of tire1. From this point of view, it is more preferable that the radius R1of curvature of the first arc2bis not less than 1.90 times the radius R2of curvature of the second arc2c.", "", "By setting the radius R1of curvature of the first arc2bbeing not more than 2.00 times the radius R2of curvature of the second arc2c, uneven ground contacting surface pressure distribution is suppressed, which helps to improve the uneven wear resistance performance of the tire1.", "", "From this point of view, it is more preferable that the radius R1of curvature of the first arc2bis not more than 1.95 times the radius R2of curvature of the second arc2c.", "", "The radius R2of curvature of the second arc2cis preferably from 2.08 to 2.74 times the radius R3of curvature of the third arc2d.", "", "By setting the radius R2of curvature of the second arc2cbeing not less than 2.08 times the radius R3of curvature of the third arc2d, the distance between the tire1and the vehicle body when mounted on the vehicle can be reduced, which helps to improve the appearance performance of the tire1.", "", "From this point of view, it is more preferable that the radius R2of curvature of the second arc2cis not less than 2.30 times the radius R3of curvature of the third arc2d.", "", "As the radius R2of curvature of the second arc2cis not more than 2.74 times the radius R3of curvature of the third arc2d, uneven ground contacting surface pressure distribution is suppressed, and uneven wear resistance of the tire1can be improved. From this point of view, it is more preferable that the radius R2of curvature of the second arc2cis not more than 2.50 times the radius R3of curvature of the third arc2d.", "", "As shown inFIG.1, a tread width TW, which is the distance in the tire axial direction between the first tread edge T1and the second tread edge T2, is preferably from 74% to 84% of the maximum width Wm, which is the distance in the tire axial direction between the maximum tire width positions Pm.", "", "As the tread width TW is 74% or more of the maximum width Wm, it is possible to reduce the ground contacting surface pressure, and suppress noise generation, and improve the noise performance of the tire1.", "", "From this point of view, it is more preferable that the tread width TW is 79% or more of the maximum width Wm.", "", "By setting the tread width TW being not more than 84% of the maximum width Wm, it is possible to suppress the occurrence of slippage in the shoulder region and improve the uneven wear resistance performance of the tire1.", "", "From this point of view, it is more preferable that the tread width TW is not more than 81% of the maximum width Wm.", "", "For the tire1, for example, the mounting direction to a vehicle is designated. It is preferable that the tire1is mounted on a vehicle so that the first tread edge T1is positioned outboard of the vehicle, and the second tread edge T2is positioned inboard of the vehicle.", "", "Such mounting direction to the vehicle is, for example, indicated by letters and/or symbols on the outer surface3sof the sidewall portion3.", "", "The tire1is however, not limited to such example, and the tire1may be one for which the mounting direction to the vehicle is not specified, for example.", "", "It is preferable that the tread portion2comprises a plurality of circumferential grooves20continuously extending in the tire circumferential direction between the first tread edge T1and the second tread edge T2.", "", "The plurality of circumferential grooves20includes, for example, a first shoulder circumferential groove21, a second shoulder circumferential groove22, a first crown circumferential groove23, and a second crown circumferential groove24.", "", "However, the tread portion2is not limited to such example. For example, the tread portion2may comprise three or less circumferential grooves20or the tread portion2may comprise five or more circumferential grooves20.", "", "The first shoulder circumferential groove21is disposed between the first tread edge T1and the tire equator C, in this embodiment, disposed closest to the first tread edge T1among the plurality of circumferential grooves20.", "", "The second shoulder circumferential groove22is disposed between the second tread edge T2and the tire equator C, in this embodiment, disposed closest to the second tread edge T2among the plurality of circumferential grooves20.", "", "The first crown circumferential groove23in this embodiment is disposed between the first shoulder circumferential groove21and the tire equator C. The second crown circumferential groove24in this embodiment is deposed between the second shoulder circumferential groove22and the tire equator C.", "", "Each of the circumferential grooves20extends linearly in parallel to the tire circumferential direction, for example.", "", "The plurality of circumferential grooves20are not limited to such aspect, may be extended in the tire circumferential direction in a wavy form, for example. Further, some of the circumferential grooves20may be extended linearly, and the rest may be extended in a wavy form.", "", "It is preferable that the groove width of each of the circumferential grooves20is 3 mm or more.", "", "In this embodiment, the groove width of the first crown circumferential groove23is the smallest among the groove widths of the circumferential grooves20. Such circumferential grooves20can suppress the generation of the vehicle exterior noise when mounted on the vehicle, and can improve the noise performance while maintaining good wet performance of the tire1.", "", "FIG.3is a diagram schematically showing the shape2S of the ground contacting surface2sof the tire1.", "", "As shown inFIG.3, the shape2S of the ground contacting surface2sin the present embodiment is the shape when the tire1under its normal state is set on a horizontal flat surface at a camber angle of 0 degrees and loaded with 70% of the normal load.", "", "The shape of the ground contacting surface2scan be expressed by, for example, a ground contacting surface index F (L3/L4) which is the ratio of the length L3in the tire circumferential direction measured at the tire equator C, and the length L4in the tire circumferential direction measured in the shoulder region on the first tread edge T1side.", "", "Here, the length L4in the tire circumferential direction is the length in the tire circumferential direction of the ground contacting surface shape2S measured at a position of 80% (0.8 TW/2) of the distance (TW/2) from the tire equator C toward the first tread edge T1.", "", "The length L4in the tire circumferential direction may be, for example, the length in the shoulder region on the second tread edge T2side.", "", "The ground contacting surface index F in this embodiment is 1.05 to 1.35.", "", "By setting the ground contacting surface index F being 1.05 or more, the occurrence of slippage in the shoulder region can be suppressed, and the uneven wear resistance performance of the tire1can be improved.", "", "By setting the ground contacting surface index F being 1.35 or less, the ground contacting surface pressure is reduced, the generation of noise can be suppressed, and the noise performance of the tire1can be improved.", "", "FIG.4is a cross-sectional view of the tread portion2.", "", "In this embodiment, a loss tangent tan δ1at 70 degrees C. of the first portion11is not less than a loss tangent tan δ2at 70 degrees C. of the second portion12. Such first portion11helps to suppress vibrations of the tread portion2and can improve the noise performance of the tire1.", "", "It is preferable that the loss tangent tan δ1of the first portion11at 70 degrees C. is not more than a loss tangent tan δA of the tread rubber2G at 30 degrees C. Since the tread rubber2G forming the ground contacting surface2scontacts with the outside air and cooled thereby, 30 degrees C. is adopted as the measuring temperature.", "", "Such first portion11can reduce the influence of the tread portion2on the rolling resistance, and helps to improve the fuel efficiency performance of the tire1. Therefore, the tire1of the present embodiment can achieve both the low fuel consumption performance and noise performance.", "", "In this specification, the loss tangent tan δ is measured according to JIS-K6394 under the following conditions using a dynamic viscoelasticity measuring device. The specimen used for measuring the loss tangent tan δ is taken out from the vulcanized tire1, for example, so that the longitudinal direction of the specimen coincides with the circumferential direction of the tire1.temperature: 30 degrees C. or 70 degrees C.initial strain: 5% when the measuring temperature is 30 degrees C., and10% when the measuring temperature is 70 degrees C.amplitude of dynamic strain: +/−1%frequency: 10 Hzdeformation mode: tensile", "", "Incidentally, the loss tangent tan δ can be adjusted by changing the glass transition point Tg of the rubber composition, and the types and amounts of various compounding agents.", "", "Specifically, the loss tangent tan δ can be increased by increasing the glass transition point Tg of the rubber composition, reducing the average particle size of reinforcing agents such as carbon and silica, increasing the amount of the reinforcing agent, and/or reducing the amount of the vulcanizing agent such as sulfur, accelerators, etc.", "", "Unless otherwise noted, the loss tangent described below is measured when the specimen is at a temperature of 70 degrees C.", "", "When the first portion11is made up a single rubber material, the loss tangent tan δ1of the first portion11is the loss tangent tan δ1of the single rubber material. When the first portion11is made up a plurality of rubber materials, the loss tangent tan δ1of the first portion11is a weighted average which are obtained by weighting the loss tangent tan δ values of the rubber materials by the cross-sectional areas of the respective rubber materials.", "", "The same applies to the loss tangents tan δ of another portion.", "", "Preferably, the loss tangent tan δ1of the first portion11is set in a range from 1.0 to 2.0 times the loss tangent tan δ2of the second portion12.", "", "As the loss tangent tan δ1of the first portion11is not less than 1.0 times the loss tangent tan δ2of the second portion12, the effect suppressing the vibration of the tread portion2can be reliably exhibited.", "", "From this point of view, it is more preferable that the loss tangent tan δ1of the first portion11is not less than 1.1 times the loss tangent tan δ2of the second portion12.", "", "As the loss tangent tan δ1of the first portion11is not more than 2.0 times the loss tangent tan δ2of the second portion12, failure such as separation due to an excessive difference in physical properties can be suppressed, and the durability performance of the tire1can be improved.", "", "From this point of view, it is more preferable that the loss tangent tan δ1of the first portion11is not more than 1.5 times the loss tangent tan δ2of the second portion12.", "", "Preferably, the loss tangent tan δ1of the first portion11is set in a range from 0.4 to 0.7 times the loss tangent tan δA of the tread rubber2G As the loss tangent tan δ1of the first portion11is not less than 0.4 times the loss tangent tan δA of the tread rubber2G, it is possible to reduce vibrations of the tread portion2, while maintaining the fuel efficiency of the tire1.", "", "As the loss tangent tan δ1of the first portion11is not more than 0.7 times the loss tangent tan δA of the tread rubber2G, it is possible to reduce vibrations of the tread portion2, while maintaining the steering stability performance of the tire1.", "", "Preferably, the loss tangent tan δ1of the first portion11is 0.14 or more. As the loss tangent tan δ1of the first portion11is 0.14 or more, vibrations of the tread portion2can be reliably suppressed, and noise generation can be reduced. From this point of view, it is more preferable that the loss tangent tan δ1of the first portion11is 0.15 or more, still more preferably 0.20 or more.", "", "It is preferable that the loss tangent tan δ of the first portion11at 30 degrees C. is 0.4 to 0.7 times a loss tangent tan δ of the base rubber2B at 30 degrees C. As the loss tangent tan δ of the first portion11is not less than 0.4 times the loss tangent tan δ of the base rubber2B, it is possible to reduce vibrations of the tread portion2.", "", "As the loss tangent tan δ of the first portion11is not more than 0.7 times the loss tangent tan δ of the base rubber2B, it is possible to reduce the rolling resistance of the tire1.", "", "The loss tangent tan δA of the tread rubber2G is preferably 0.30 or less. As the loss tangent tan δA of the tread rubber2G is 0.30 or less, the rolling resistance is reduced, and it is possible to improve the fuel economy performance of the tire1. From this point of view, it is more preferable that the loss tangent tan δA of the tread rubber2G is 0.25 or less, and still more preferably 0.20 or less.", "", "When the tread portion2is made up of the cap rubber2A and the base rubber2B, the loss tangent tan δA of the tread rubber2G at 30 degrees C. is the loss tangent tan δA of the cap rubber2A at 30 degrees C.", "", "At this time, it is preferable that the loss tangent tan δB of the base rubber2B at 70 degrees C. is smaller than the loss tangent tan δA of the cap rubber2A at 30 degrees C.", "", "Such tread portion2helps to improve the fuel efficiency performance, while maintaining good steering stability performance of the tire1.", "", "The loss tangent tan δB of the base rubber2B is preferably 0.21 or less.", "", "As the loss tangent tan δB of the base rubber2B is 0.21 or less, heat generation in the tread portion2during running is suppressed, which helps to maintain the good fuel efficiency of the tire1.", "", "From this point of view, it is more preferable that the loss tangent tan δB of the base rubber2B is 0.20 or less.", "", "It is preferable that a complex elastic modulus E*A of the tread rubber2G at 30 degrees C. is 7.8 MPa or more.", "", "As the complex elastic modulus E*A of the tread rubber2G is 7.8 MPa or more, vibrations of the tread portion2are suppressed, which helps to improve the noise performance of the tire1.", "", "From this point of view, it is more preferable that the complex elastic modulus E*A of the tread rubber2G is 8.0 MPa or more, still more preferably 9.0 MPa or more.", "", "When the tread rubber2G is made up of a plurality of rubber materials, the complex elastic modulus E*A is of the rubber material which forms the ground contacting surface2s.", "", "In this specification, the complex elastic modulus E* is measured according to JIS-K6394 under the following conditions using a dynamic viscoelasticity measuring device. The specimen for measuring the complex elastic modulus E* is, for example, taken out from the vulcanized tire1so that the longitudinal direction of the specimen coincides with the circumferential direction of the tire1.initial strain: 5%amplitude of dynamic strain: +/−1%frequency: 10 Hzdeformation mode: tensilemeasuring temperature: 30 degrees C.", "", "The complex elastic modulus E* can be adjusted by changing the glass transition point Tg of the rubber composition and the types and amounts of various compounding agents. Specifically, the complex elastic modulus E* can be increased by increasing the glass transition point Tg of the rubber composition decreasing the average particle size of a reinforcing agent such as carbon and silica, increasing the amount of the reinforcing agent, decreasing the total amount of plasticize, and/or increasing vulcanizing agents such as sulfur, accelerators, etc.", "", "As shown inFIG.1, it is preferable that the tread portion2in the present embodiment is provided with a belt layer7disposed outside the carcass6in the tire radial direction.", "", "In the tread portion2in the present embodiment, a band layer8is further disposed outside the belt layer7in the tire radial direction.", "", "The carcass ply6A comprises a plurality of carcass cords6B and topping rubber covering the carcass cords.", "", "The carcass cords6B are, for example, organic fiber cords such as aramid, rayon, etc. The carcass cords6B are preferably arranged at an angle of from 70 to 90 degrees with respect to the tire equator C.", "", "The loss tangent tan δC at 70 degrees C. of the topping rubber of the carcass ply6A is preferably 0.16 or less.", "", "As the loss tangent tan δC of the topping rubber of the carcass ply6A is 0.16 or less, heat generation in the carcass ply6A is suppressed, and it becomes possible to achieve both the low fuel consumption performance and durability performance of the tire1during high-speed running.", "", "From this point of view, it is more preferable that the loss tangent tan δC of the topping rubber of the carcass ply6A is 0.15 or less.", "", "From the viewpoint of improving the noise performance of the tire1, it is preferable to make the loss tangent tan δC of the topping rubber of the carcass ply6A smaller than the loss tangent tan δ1of the first portion11.", "", "As shown inFIG.1, in the tire1of the present embodiment, the twist coefficient K of the carcass cords6B is set in a range from 2000 to 2500.", "", "The twist coefficient K is defined by the product of T and the root D (K=T√D) whereinT is the number of twists per 100 mm, andD is the total fineness (dtex) of the carcass cord6B.The twist coefficient K is of the carcass cord6B after a dip treatment.", "", "If a cord having a small twist coefficient K is used as the carcass cord6B, the fatigue resistance of the cord may be deteriorated, which may affect the durability of the tire1.", "", "In the tire1of the present embodiment, as the twist coefficient of the carcass cords6B is set to 2000 or more, the fatigue resistance of the cord is improved, and the durability performance of the tire1is improved.", "", "If a cord having a large twist coefficient K is used as the carcass cord6B, good attenuation cannot be obtained from the sidewall portions3to the bead portions4, which may affect the noise performance of the tire1.", "", "Further, the deformation of a case structure including the carcass6from the sidewall portion3to the bead portion4is increased, and the rolling resistance is increased. In the tire1of the present embodiment, as the twist coefficient K of the carcass cord6B is set to 2500 or less, good attenuation is obtained from the sidewall portions3to the bead portions4, and the noise performance of the tire1is improved, and as a result, the vehicle interior noise is reduced.", "", "Further, the deformation of the case structure is suppressed, and the rolling resistance can be reduced.", "", "In the tire1of the present embodiment, the above-described first portion11functions as a mass damper to suppress vibrations of the tread portion2.", "", "Furthermore, the vibrational energy of the tread portion2is attenuated by the viscoelastic properties of the rubber itself disposed in the first portion11.", "", "Therefore, as compared with a conventional pneumatic tire in which the first portion11is not provided, in the tire1of the present embodiment, the cord with the large twist coefficient K can be used as the carcass cord6B.", "", "On the other hand, the increase in rolling resistance, which is a concern due to the provision of the first portion11, can be suppressed as setting the upper limit of the twist coefficient K of the carcass cords6B to 2,500.", "", "In the tire1of the present embodiment, as the carcass cords6B having the twist coefficient K is optimized in accordance with the first thickness t1of the first portion11, it becomes possible to reduce the vehicle interior noise, without increasing the rolling resistance.", "", "In the tire1of the present embodiment, due to the synergistic effect of the carcass cords6B having the twist coefficient K of 2000 to 2500 and the rubber of the first portion11having the above-described loss tangent tan δ, it becomes possible to reduced the vehicle interior noise, without increasing the rolling resistance.", "", "The tire1of the present embodiment has a so-called high turned-up structure in which the radially outer ends of the turnup portions6bof the carcass6are positioned radially outside the maximum width position Pm of the tire1.", "", "Such carcass6makes it difficult for vibrations of the sidewall portion3to be transmitted to the bead portion4, thereby making it possible to reduce the vehicle interior noise. Further, since the deformation of the case structure is suppressed from the sidewall portion3to the bead portion4, the rolling resistance can be reduced.", "", "The tire1of the present embodiment may have a so-called ultra-high turned-up structure in which the radially outer ends of the turnup portions6bof the carcass6are respectively located axially inside the axially outer ends of the belt layer7.", "", "The carcass cord6B used in this embodiment is a polyethylene terephthalate (PET) fiber cord. It is preferable that the number of carcass plies6A and the fineness of the carcass cords6B are determined as follows according to the load index of the tire1. When the tire1has a load index of 90 or less, the carcass6is made up of a single carcass ply6A, and the fineness of each carcass cord6B is 1100 dtex/2.", "", "When the tire1has a load index more than 90 and not more than 100, the carcass6is made up of a single carcass ply6A, and the fineness of each carcass cord6B is 1440 dtex/2. When the tire1has a load index more than 90 and not more than 105, the carcass6is made up of a single carcass ply6A, and the fineness of each carcass cord6B is 1670 dtex/2. When the tire1has a load index of 110 or less, the carcass6is made up of two carcass plies6A, and the fineness of each carcass cord6B is 1110 dtex/2.", "", "When the tire1has a load index of 115 or less, the carcass6is made up of two carcass plies6A, and the fineness of each carcass cord6B is 1440 dtex/2.", "", "When the tire1has a load index of 115 or less, the carcass6is made up of two carcass plies6A, and the fineness of each carcass cords6B may be 1670 dtex/2.", "", "The belt layer7includes, for example, a first belt ply7A adjacent to the carcass6, and a second belt ply7B disposed outside the first belt ply7A in the tire radial direction. In the present embodiment, the first belt ply7A and the second belt ply7B each comprise a plurality of belt cords arranged at an angle of 15 to 45 degrees with respect to the tire circumferential direction, and a topping rubber covering the belt cords.", "", "It is preferable that, with respect to the tire circumferential direction, the belt cords of the first belt ply7A are inclined in opposite directions to the belt cords of the second belt ply7B. Such belt layer7can effectively reinforce the tread portion2.", "", "In the present embodiment, as shown inFIG.4, the axially outer edges7bof the second belt ply7B are respectively located axially inside the axially outer edges7aof the first belt ply7A. Accordingly, the axial length of the second belt ply7B is smaller than the axial length of the first belt ply7A.", "", "In such belt layer7, the tread portion2can be reinforced, while suppressing the second belt ply7B from becoming excessively large, which helps to achieve both the fuel efficiency performance and the noise performance of the pneumatic tire1.", "", "The loss tangent tan δD at 70 degrees C. of the topping rubber of the first belt ply7A is preferably 0.16 or less.", "", "As the loss tangent tan δD of the topping rubber of the first belt ply7A is 0.16 or less, heat generation in the first belt ply7A is suppressed, and it becomes possible to achieve both the low fuel consumption performance and durability performance of the tire1during high-speed running.", "", "From this point of view, it is more preferable that the loss tangent tan δD of the topping rubber of the first belt ply7A is 0.15 or less.", "", "From the viewpoint of improving the noise performance of the tire1, it is preferable to make the loss tangent tan δD of the topping rubber of the first belt ply7A smaller than the loss tangent tan δ1of the first portion11.", "", "The loss tangent tan δE at 70 degrees C. of the topping rubber of the second belt ply7B is preferably 0.16 or less.", "", "As the loss tangent tan δE of the topping rubber of the second belt ply7B is 0.16 or less, heat generation in the second belt ply7B is suppressed, and it is possible to achieve both low fuel consumption performance and durability performance of the tire1during high-speed running.", "", "From this point of view, it is more preferable that the loss tangent tan δE of the topping rubber of the second belt ply7B is 0.15 or less.", "", "From the viewpoint of improving the noise performance of the tire1, it is preferable to make the loss tangent tan δE of the topping rubber of the second belt ply7B smaller than the loss tangent tan δ1of the first portion11.", "", "In this embodiment, the loss tangent tan δE of the second belt ply7B is equal to the loss tangent tan δD of the first belt ply7A.", "", "Such belt layer7can make it possible to uniformly manage the materials forming the first belt ply7A and the second belt ply7B, which may reduce the manufacturing cost of the tire1.", "", "The band layer8is composed of at least one band ply8A, in this embodiment, only one band ply8A.", "", "The band ply8A comprises, for example, at least one band cord arranged at an angle of 5 degrees or less with respect to the tire circumferential direction, and a topping rubber covering the band cord or cords.", "", "The band layer8in this embodiment is arranged so as to cover the entire belt layer7.", "", "The loss tangent tan δF at 70 degrees C. of the topping rubber of the band ply8A is preferably 0.16 or less.", "", "As the loss tangent tan δF of the topping rubber of the band ply8A is 0.16 or less, heat generation in the band ply8A can be suppressed, and it is possible to achieve both the low fuel consumption performance and durability performance of the tire1during high-speed running.", "", "From this point of view, it is more preferable that the loss tangent tan δF of the topping rubber of the band ply8A is 0.15 or less.", "", "From the viewpoint of improving the noise performance of the tire1, it is preferable to make the loss tangent tan δF of the topping rubber of the band ply8A smaller than the loss tangent tan δ1of the first portion11.", "", "FIG.5shows a developed partial view of the ground contacting surface2sof the tread portion2ofFIG.1.", "", "The ground contacting surface2sof the tread portion2corresponds to a surface between the first tread edge T1and the second tread edge T2, of the outer surface of the tread portion2.", "", "In this embodiment, as shown inFIG.5, the land ratio of the tread portion2is 65% or more.", "", "In the present specification, the “land ratio” means a ratio Sb/Sa of the actual total ground contacting area Sb to the total area Sa of a virtual ground contacting surface in which all the grooves and sipes existing in the ground contacting surface2sof the tread portion2are filled.", "", "In this embodiment, by adopting the above configuration, it is possible to reduce both the vehicle exterior noise and the vehicle interior noise. The reason is as follows.", "", "It has been known that, in general, when the land ratio of the tread portion becomes smaller, the pattern noise increases and the vehicle exterior noise increases. Also, it has been known that, in general, when the land ratio is increased, although the pattern noise is reduced, the vibration from the road surface is more likely to be transmitted to the vehicle through the tire, and as a result, the vehicle interior noise is increased. For this reason, conventional tires are often designed so as to have relatively small land ratios (less than 65%).", "", "In the present embodiment, by setting the land ratio to 65% or more, the tire1is reduced in pattern noise, and thereby, the vehicle exterior noise can be reduced. Further, as described above, in the tire1of the present embodiment, the first thickness t1(shown inFIG.1) of the first portion11is large, therefore, the tread portion2can effectively absorb vibrations from the road surface. As a result, even when the land ratio of the tread portion2is large, the vehicle interior noise can be reliably reduced. For this reason, in the tire1of the present embodiment, both the vehicle exterior noise and the vehicle interior noise can be reduced.", "", "The distance in the tire axial direction L1from the tire equator C to the groove center line of the first shoulder circumferential groove21, and the distance in the tire axial direction L1from the tire equator C to the groove center line of the second shoulder circumferential groove22, are preferably 25% to 35% of the tread width TW, for example.", "", "The distance in the tire axial direction L2from the tire equator C to the groove center line of the first crown circumferential groove23, and the distance in the tire axial direction L2from the tire equator C to the groove center line of the second crown circumferential groove24, are preferably 5% to 15% of the tread width TW, for example.", "", "Incidentally, the tread width TW is the distance in the tire axial direction from the first tread edge T1to the second tread edge T2of the tire under its normal state.", "", "It is preferable that the groove width of each circumferential groove20is, for example, 4.0% to 8.5% of the tread width TW.", "", "The total groove width of the plurality of circumferential grooves20is, for example, 20% to 30%, preferably 20% to 25%, of the tread width TW.", "", "Thereby, it is possible to enhance the steering stability on a dry road surface, while reducing the vehicle exterior noise.", "", "The groove width W3of the first crown circumferential groove23is preferably larger than the groove width W1of the first shoulder circumferential groove21, for example. Specifically, the groove width W3is 150% to 200% of the groove width W1. The groove width W4of the second crown circumferential groove24is preferably larger than the groove width W2of the second shoulder circumferential groove22, for example. Specifically, the groove width W4is 140% or less of the groove width W2, preferably 105% to 120%.", "", "Thereby, the noise generated by the circumferential grooves20becomes difficult to diffuse outward of the vehicle, while ensuring wet performance, and the vehicle exterior noise can be reduced.", "", "It is preferable that the depth of each circumferential groove20is 5 to 10 mm, for example, in the case of pneumatic tires for passenger cars.", "", "The tread portion2comprises a plurality of land portions25including a crown land portion37, a first middle land portion28, a second middle land portion29, a first shoulder land portion26, and a second shoulder land portion27.", "", "The crown land portion37is defined between the first crown circumferential groove23and the second crown circumferential groove24.", "", "The first middle land portion28is defined between the first shoulder circumferential groove21and the first crown circumferential groove23. Thereby, the first middle land portion28is adjacent to the crown land portion37via the first crown circumferential groove23.", "", "The second middle land portion29is defined between the second shoulder circumferential groove22and the second crown circumferential groove24. Thereby, the second middle land portion29is adjacent to the crown land portion37via the second crown circumferential groove24.", "", "The first shoulder land portion26is defined axially outward of the first shoulder circumferential groove21, and includes the first tread edge T1. Thereby, the first shoulder land portion26is adjacent to the first middle land portion28via the first shoulder circumferential groove21.", "", "The second shoulder land portion27is defined axially outward of the second shoulder circumferential groove22, and includes the second tread edge T2. Thereby, the second shoulder land portion27is adjacent to the second middle land portion29via the second shoulder circumferential groove22.", "", "Each of the land portions25is provided with a plurality of lateral grooves41. The arrangement of the lateral grooves41shown inFIG.5is merely an example, and the present disclosure is not limited thereto.", "", "The first middle land portion28is preferably not divided in the tire circumferential direction by grooves having a groove width of 2 mm or more. The crown land portion37is preferably not divided in the tire circumferential direction by grooves having a groove width of 2 mm or more.", "", "The second middle land portion29is preferably not divided in the tire circumferential direction by grooves having a groove width of 2 mm or more.", "", "Thereby, the pattern noise generated by the land portions28,37and29is reduced, and the vehicle exterior noise can be reduced.", "", "It is preferable that the land ratio Lac of the crown land portion37is larger than the land ratio Lam1of the first middle land portion28. Specifically, the land ratio Lac is more than 105%, preferably not less than 106%, but less than 120% of the land ratio Lam1. Thereby, the pattern noise generated by the crown land portion37can be reduced, and the steering stability and wear resistance performance on dry road surfaces can be enhanced.", "", "It is preferable that the land ratio Lam1of the first middle land portion28is larger than the land ratio Las1of the first shoulder land portion26. Specifically, the land ratio Lam1is more than 105%, preferably not less than 106%, but less than 120% of the land ratio Las1. Thereby, the steering stability and wear resistance on dry road surfaces can be further enhanced.", "", "From the same point of view, it is preferable that the land ratio Lam2of the second middle land portion29is larger than the land ratio Las2of the second shoulder land portion27. Specifically, the land ratio Lam2is more than 105%, preferably not less than 106%, but less than 120% of the land ratio Las2.", "", "As shown inFIG.4, the inner rubber10is preferably made of an air impermeable rubber material.", "", "Examples of such rubber material include butyl-based rubber materials and halogenated butyl-based rubber materials.", "", "In the inner rubber10in this embodiment, the first portion11and the second portion12are made of the same rubber material.", "", "The inner rubber10is not limited to such example, and may be made of a plurality of rubber materials, for example.", "", "The first portion11of the inner rubber10in the present embodiment comprises a first end portion13on the axially outer side which is on the first tread edge T1side, and a second end portion14on the axially outer side which is on the second tread edge T2side.", "", "It is preferable that the first end portion13has the first thickness t1continuously decreasing toward the axially outer end11aof the first portion11.", "", "Similarly, the second end portion14has the first thickness t1continuously decreasing toward the axially outer end11bof the first portion11.", "", "In the present embodiment, therefore, the positions at which the first thickness t1has finished decreasing, correspond to the axially outer ends11aand11bof the first portions11.", "", "Such first portions11suppresses stress concentration at the axially outer ends11aand11b, and help to improve the durability performance of the tire1.", "", "From the viewpoint of reliably reducing the vehicle interior noise, the axially outer end11aon the first tread edge T1side of the first portion11in the present embodiment is positioned, for example, on the first tread edge T1side of the first crown circumferential groove23, more preferably, positioned on the first tread edge T1side of the first shoulder circumferential groove21.", "", "It is preferable that the axially outer end11aof the first portion11is positioned so as to overlap, in the tire axial direction, with the third arc2d(shown inFIG.2) of the ground contacting surface2s.", "", "InFIG.6, there is shown an enlarged cross-sectional view of the first end portion13of the first portion11.", "", "As shown inFIG.6, it is preferable that the axially outer end11aon the first tread edge T1side, of the first portion11is located at the same position in the tire axial direction as the axially outer edge7bof the second belt ply7B, or on the inner side in the tire axial direction of the axially outer edge7bof the second belt ply7B.", "", "It is preferable that the distance L10in the tire axial direction between the axially outer end11aof the first portion11and the axially outer edge7bof the second belt ply7B is 10 mm or less.", "", "Thereby, in the first portion11in the present embodiment, the entire first end portion13is located on the first tread edge T1side of the first shoulder circumferential groove21. As a result, while securing a sufficient length in the tire axial direction of the first portion11, deformation around the axially outer end11aof the first portion11can be suppressed by the belt layer7. Thereby, separation of the inner rubber10occurring around the axially outer end11acan be suppressed.", "", "The first end portion13is continuous with a portion extending with a constant first thickness t1on the tire equator C side as shown inFIG.1.", "", "The axial length L11(shown inFIG.6) of the first end portion13is 2.0% to 4.0% of the tread width TW.", "", "Thereby, the thickness of the inner rubber10can be prevented from changing abruptly, and failure such as separation of the inner rubber10can be suppressed.", "", "As shown inFIG.4, the first portion11on the second tread edge T2side has the same configuration as that on the first tread edge T1side.", "", "That is, the axially outer end11bon the second tread edge T2side of the first portion11is located, for example, on the second tread edge T2side of the second crown circumferential groove24, more preferably located on the second tread edge T2side of the second shoulder circumferential groove22.", "", "Further, in the present embodiment, the entire second end portion14is located on the second tread edge T2side of the second shoulder circumferential groove22.", "", "Further, it is preferable that the axially outer end11bon the second tread edge T2side of the first portion11is positioned so as to overlap, in the tire axial direction, with the third arc of the ground contacting surface2swhich is an arc obtained by inverting the third arc2don the first tread edge T1side shown inFIG.2to the second tread edge T2side. Further, it is preferable that the axially outer end11bof the first portion11on the second tread edge T2side is located at the same position in the tire axial direction as the axially outer edge7bof the second belt ply7B, or axially inside the axially outer edge7bof the second belt ply7B.", "", "Further, the distance in the tire axial direction between the axially outer end11bof the first portion11and the axially outer edge7bof the second belt ply7B is 10 mm or less. Further, the second end portion14has the same configuration as the first end portion13.", "", "It is preferable that, by arranging the axially outer ends11aand11bof the first portions11as described above, the axial length L5of the first portion11in this embodiment is set in a range from 90% to 110% of the tread width TW.", "", "Thereby, it is possible to reliably reduce the vehicle interior noise, while suppressing an increase in tire weight.", "", "In the first portions11in this embodiment, the first length L6from the tire equator C to the axially outer end11aon the first tread edge T1side, and the second length L2from the tire equator C to the axially outer end11bon the second tread edge T2side, are substantially the same.", "", "More specifically, the difference between the first length L6and the second length L7is 5% or less of the first length L6. Thereby, the uniformity of the tire can be improved. However, it may be possible that the second length L7is more than the first length L6, for example. Specifically, the second length L7may be in a range from 105% to 110% of the first length L6.", "", "In such arrangement, the length of the first portion11is sufficiently secured on the second tread edge T2side which is inboard of the vehicle when the tire is attached to the vehicle, therefore, it is possible to further reduce the vehicle interior noise.", "", "The first portion11extends between the first end portion13and the second end portion14with a constant first thickness t1.", "", "Thereby, the first thickness t1is substantially the same at the position of the tire equator C, and at a position on the first tread edge T1side of the first shoulder circumferential groove21.", "", "Preferably, the first thickness t1is substantially the same from the tire equator C to a position beyond the first shoulder circumferential groove21.", "", "Here, the expression “substantially the same” means that the thickness may include inevitable errors in rubber products or tires, and the difference between the maximum thickness and minimum thickness is 5% or less of the maximum thickness.", "", "The first portion11may have a region extending to the first tread edge T1with a constant first thickness t1.", "", "In other words, the first thickness t1may be substantially the same from the position of the tire equator C to a position of the first tread edge T1(to an imaginary line extending parallel to the tire radial direction through the first tread edge T1).", "", "In this case, the axially outer end11aof the first portion11is located outside the first tread edge T1in the tire axial direction. Such first portion11can further reduce the vehicle interior noise.", "", "It is preferable that the first portion11between the tire equator C and the second tread edge T2has the same configuration as described above. That is, the first thickness t1is substantially the same at the position of the tire equator C and at a position on the second tread edge T2side of the second shoulder circumferential groove22. Preferably, the first thickness t1is substantially the same from the tire equator C to a position beyond the second shoulder circumferential groove22.", "", "However, the first portion11may have a region extending to the second tread edge T2with a constant first thickness t1.", "", "The length L8in the tire axial direction of the portion of the first portion11having the constant first thickness t1(shown inFIG.1, and the same applies hereinafter) is preferably in a range from 82% to 106% of the tread width TW.", "", "By setting the length L8of the portion having the constant first thickness t1to not less than 82% of the tread width TW, vibrations of the tread portion2can be effectively suppressed. From this point of view, it is more preferable that the length L8of the portion having the constant first thickness t1is not less than 85%, still more preferably not less than 88% of the tread width TW.", "", "By setting the length L8of the portion having the constant first thickness t1to not more than 106% of the tread width TW, an excessive weight increase can be reliably suppressed.", "", "From this point of view, it is more preferable that the length L8of the portion having the constant first thickness t1is not more than 103%, still more preferably not more than 100% of the tread width TW.", "", "The length L8of the portion having the constant first thickness t1corresponds to the distance in the tire axial direction between the first end portion13and the second end portion14.", "", "As shown inFIG.4, the average value of the first thickness t1is preferably in a range from 1.5 to 3.5 times the average value of the second thickness t2.", "", "As the average value of the first thickness t1is not less than 1.5 times the average value of the second thickness t2, vibrations of the tread portion2can be effectively suppressed, and the noise performance of the tire1can be improved.", "", "From this point of view, it is more preferable that the average value of the first thickness t1is not less than 1.75 times, still more preferably not less than 1.9 times the average value of the second thickness t2.", "", "As the average value of the first thickness t1is not more than 3.5 times the average value of the second thickness t2, an excessive weight increase can be suppressed, and the good fuel efficiency performance of the tire1can be maintained.", "", "From this point of view, it is more preferable that the average value of the first thickness t1is not more than 2.7 times, still more preferably not more than 2.2 times the average value of the second thickness t2.", "", "The average value of the first thickness t1is preferably 2.0 to 4.5 mm.", "", "As the average value of the first thickness t1is 2.0 mm or more, vibrations of the tread portion2can be effectively suppressed, and the noise performance of the tire1can be improved.", "", "From this point of view, it is more preferable that the average value of the first thickness t1is 2.5 mm or more.", "", "As the average value of the first thickness t1is 4.5 mm or less, an excessive weight increase can be suppressed, and the good fuel efficiency performance of the tire1can be maintained.", "", "From this point of view, it is more preferable that the average value of the first thickness t1is 4.0 mm or less, even more preferably 3.5 mm or less.", "", "The average value of the second thickness t2is preferably 0.5 to 2.0 mm.", "", "As the average value of the second thickness t2is 0.5 mm or more, good air impermeability can be maintained, which helps to improve the durability performance of the tire1.", "", "From this point of view, it is more preferable that the average value of the second thickness t2is 1.0 mm or more.", "", "As the average value of the second thickness t2is 2.0 mm or less, an excessive weight increase can be suppressed, and the good fuel efficiency performance of the tire1can be maintained.", "", "From this point of view, it is more preferable that the average value of the second thickness t2is 1.5 mm or less.", "", "It has been confirmed by the inventors of the present disclosure that, by setting the twist coefficient K of the carcass cord6B to 2000 to 2500, and the first thickness t1of the first portion11to 2.0 mm to 4.5 mm as described above, the vehicle interior noise in a medium frequency range from 160 Hz to 350 Hz and in a high frequency range of 350 Hz or higher is reduced.", "", "Further, it has been confirmed by the inventors that, by setting the twist coefficient K of the carcass cords6B to 2000 to 2500, and the first thickness t1of the first portion11to 2.0 mm to 3.5 mm, the rolling resistance is not deteriorated.", "", "FIG.7is an enlarged perspective view of the sidewall portion3. As shown inFIG.7, the outer surface3sof the sidewall portion3in the present embodiment has a serration portion30positioned outside the tire maximum width position Pm in the tire radial direction.", "", "In this embodiment, the outer surface of each of the sidewall portions3includes the serration portions30.", "", "InFIG.3, the area where the serration portion30is arranged is dotted.", "", "The serration portion30occupies at least part of the outer surface of the sidewall portion3. The serration portion30may be arranged intermittently in the tire circumferential direction, or may be arranged continuously over the entire circumference of the tire.", "", "FIG.8shows an enlarged perspective view of area A inFIG.7.", "", "InFIG.8, arrow A1corresponds to the tire radial direction, and arrow A2corresponds to the tire circumferential direction.", "", "As shown inFIG.8, the serration portion30comprises a plurality of grooves31extending in the tire radial direction and arranged in the tire circumferential direction, and a plurality of ridges32divided by the plurality of grooves31.", "", "Each ridge32is formed between two adjacent grooves31and extends like a rib. The groove31extending in the tire radial direction means that the maximum angle of the center line of the groove31with respect to the tire radial direction is less than 45 degrees.", "", "Such serration portion30helps to make the bulge and dent of the sidewall portion3which are inevitable in tire manufacturing, inconspicuous.", "", "Hereinafter, such effect may be expressed as “the appearance performance is improved”. On the other hand, the serration portion30tends to generate noise (wind noise) when the vehicle is running.", "", "FIG.9shows a cross-sectional view of the groove31of the serration portion30taken along the length direction of the groove.", "", "Each groove31includes an outer end portion33and an inner end portion34in the tire radial direction as shown inFIG.9.", "", "The outer end portion33is an end portion of the groove31on the tread portion2side (shown inFIG.1), and the inner end portion34is an end portion of the groove31on the bead portion4side (shown inFIG.1).", "", "In this embodiment, the outer end portion33and the inner end portion34each have an inner walls31aextending in the depth direction of the groove31.", "", "In this embodiment, each of the plurality of grooves31has a depth d1of 0.2 mm or less at the outer end portion33.", "", "In this embodiment, the noise performance can be improved owing to that the first thickness t1(shown inFIG.1) of the first portion11of the inner rubber10is large, and that the depths of the plurality of grooves31at the outer end portions33are defined. The reason is as follows.", "", "In general, when a serration portion is provided on the sidewall portion, noise (wind noise) tends to occur due to friction between the air and the serration portion during the tire is rotation.", "", "In the radially outer end portions of the grooves which constitute the serration portion, as compared to the other portions of the grooves, a higher velocity of the air hits the tire when the tire is rotating, and is likely to generate the noise.", "", "However, in this embodiment, by setting the depth of the outer end portions33of the grooves31constituting the serration portion30to 0.2 mm or less, the noise can be reduced, and both the vehicle exterior noise and the vehicle interior noise can be reduced.", "", "Furthermore, in the tire1of the present embodiment, as the first thickness t1(shown inFIG.1) of the first portion11is large as described above, the tread portion2can effectively absorb vibrations from the road surface, and it is possible to further reduce the vehicle interior noise.", "", "For these reasons, the tire1of the present embodiment can exhibit excellent noise performance.", "", "As shown inFIG.8, the grooves31and the ridges32of the serration portion30extend linearly, for example.", "", "The grooves31and the ridges32of the serration portion30preferably extend at an angle of 15 degrees or less, more preferably 5 degrees or less with respect to the tire radial direction. However, the present embodiment is not limited to such an aspect.", "", "It is preferable that the depth of the groove31decreases from the inner end portion34to the outer end portion33as shown inFIG.9.", "", "Preferably, the depth of the groove31is continuously decreased. Therefore, the depth d2at the inner end portion34constitutes the maximum depth of the groove31.", "", "The serration portion30having such grooves31can improve the appearance performance and noise performance in a well-balanced manner.", "", "Moreover, the serration portion30configured with such grooves31is also useful for reducing the air resistance of the tire.", "", "The depth d2of the inner end portion34is, for example, 0.3 mm or more.", "", "The depth d2of the inner end portion34is preferably 1.0 mm or less, more preferably 0.8 mm or less, still more preferably 0.5 mm or less.", "", "The depth d2of the inner end portion34is preferably not less than 1.5 times, more preferably not less than 3.0 times, still more preferably not less than 5.0 times, but preferably not more than 10.0 times, more preferably not more than 9.0 times, still more preferably not more than 8.0 times the depth d1of the outer end portion33.", "", "The groove31having such outer end portion33and inner end portion34can improve the appearance performance and noise performance in a well-balanced manner.", "", "More preferably, the depth d2of the inner end portion34is smaller than the difference between the average value of the first thickness t1(shown inFIG.1) of the first portion11of the inner rubber10, and the average value of the second thickness t2(shown inFIG.1) of the second portion12.", "", "Thereby, the vibration absorption capacity of the tread portion2is sufficiently increased compared to the noise generated by the serration portion30, therefore, the noise performance can be further improved.", "", "InFIG.10, there is shown a cross-sectional view perpendicular to the longitudinal directions of the plurality of grooves31and ridges32.", "", "As shown inFIG.10, the groove width W1of the groove31is, for example, 0.6 to 1.8 mm. Thereby, the appearance performance and noise performance are improved in a well-balanced manner.", "", "The cross-sectional shape of the ridge32is, for example, triangular. The apex angle θ1of the ridge32is, for example, 60 to 90 degrees. The maximum height of the ridge32is, for example, 0.1 to 1.0 mm. The cross-sectional shape of the ridge32is not limited to such triangular shape, and various shapes such as a trapezoidal shape and a semi-circular shape can be employed.", "", "As shown inFIG.7, the outer surface of the sidewall portion3comprises at least one mark portion35including at least one letter, figure or symbol.", "", "InFIG.7, as an example of the mark portion35, the mark portion35consisting of the characters “ABC” is shown, for example.", "", "The mark portion35in this embodiment is arranged within the serration portion30. It is preferable that the mark portion35is formed by fine grooves36having a depth smaller than that of the inner end portions34(shown inFIG.9) of the grooves31. Specifically, the depths of the fine grooves36are, for example, 0.2 to 0.8 mm. Thereby, a contrast is generated between the mark portion35and the serration portion30, and it is possible to improve the visibility of the mark portion35.", "", "In some cases, the outer surface of the sidewall portion3is provided with a stepped portion38extending in the tire circumferential direction and having a minute height in the normal direction to the tire outer surface.", "", "The stepped portion38corresponds to a split portion or line of a split mold for vulcanization molding, which is formed, for example, between the tread segment and the sidewall plate.", "", "InFIG.7, the stepped portion38is indicated by thin line, omitting the height appearing in the cross section.", "", "It is desirable that the height of the stepped portion38is 0.7 mm or less. Thereby, air resistance generated by the stepped portion38is reduced, and an improvement in noise performance as well as an improvement in fuel efficiency can be expected.", "", "Further, the stepped portion38may be arranged at the boundary39between the serration portion30and other portions.", "", "Thereby, it is possible to further improve the appearance of the sidewall portion3.", "", "Furthermore, the serration portion30may be arranged to overlap the stepped portion38.", "", "Thereby, such serration portion30can make uneven shapes by such as the split lines and the bulge and dent, inconspicuous, and it is possible to further improve the appearance performance of the tire1.", "", "InFIG.11, there is shown an enlarged view of the bead portion4of the tire1under the normal state when mounted on the regular rim R.", "", "At least one of the bead portions4in this embodiment is provided with a rim guard40as shown inFIG.11. Preferably, each of the bead portions4is provided with the rim guard40.", "", "The rim guard40is a rubber member having a triangular cross-section and protruding axially outward from the carcass6.", "", "The rim guard40prevents the rim flange Rf from coming into contact with curbs and the like when the tire is running.", "", "In this embodiment, the distance L9in the tire radial direction from the radially outer end of the rim flange Rf of the regular rim R to the vertex40ain the tire axial direction of the rim guard40is 1.0 to 10.0 mm.", "", "Thereby, while protecting the rim flange Rf, air turbulence is less likely to occur between the rim guard40and the rim flange Rf, and the noise performance can be improved.", "", "FIG.12is an enlarged cross-sectional view of the inner rubber10as a second example.", "", "The same reference numerals are given to the same elements as in the above-described first example of the inner rubber10, and the description thereof is omitted.", "", "As shown inFIG.12, the first portion11of the inner rubber10of the second example comprises an inner liner layer16made of an air impermeable rubber material, and an additional layer17disposed between the inner liner layer16and the carcass6.", "", "The additional layer17of the second example is composed of a rubber material different from that of the inner liner layer16.", "", "The additional layer17is composed of, for example, a rubber material having excellent adhesion to the carcass6.", "", "Such additional layer17prevents contact between the carcass6and the inner liner layer16, thereby improving the durability performance of the tire1.", "", "The additional layer17may be composed of, for example, an air-permeable rubber material.", "", "In such inner rubber10, a wide variety of materials can be selected for the additional layer17, which is suitable for achieving various performances at low cost.", "", "In this example, as the additional layer17is included in the first portion11, various performances can be improved.", "", "For example, a rubber material having a loss tangent tan δ at 70 degrees C. which is larger than the first rubber material forming the inner liner layer16, may be used as the second rubber material forming the additional layer17. In such example, the tread portion2can further absorb vibrations from the road surface, and the vehicle interior noise can be further reduced.", "", "For the additional layer17, for example, a rubber material having a loss tangent tan δ at 70 degrees C. which is larger than that of the inner liner layer16, can be used. In this case, the above-mentioned loss tangent tan δ1of the first portion11is the weighted average which is obtained by weighting the loss tangent tan δ of the inner liner layer16and the loss tangent tan δ of the additional layer17by their cross-sectional areas. The above-mentioned loss tangent tan δ2of the second portion12corresponds to the loss tangent tan δ of the inner liner layer16.", "", "Such additional layer17can more reliably reduce vibrations of the tread portion2and improve the noise performance of the pneumatic tire1.", "", "It is preferable that the loss tangent tan δ at 70 degrees C. of the above-mentioned rubber material having air impermeability is 0.14 or more.", "", "The loss tangent tan δ of the rubber material having air impermeability can be measured as described above.", "", "As the loss tangent tan δ at 70 degrees C. of the rubber material having air impermeability is 0.14 or more, it is possible to further suppress vibrations of the tread portion2.", "", "FIG.13is an enlarged cross-sectional view of the inner rubber10as a third example. The same reference numerals are given to the same elements as in the above-described examples, and the description thereof is omitted.", "", "As shown inFIG.13, the additional layer17in this example is arranged on the inside in the tire radial direction of the inner liner layer16.", "", "The additional layer17in this example forms part of the tire inner cavity surface1i. In the inner rubber10of the third example, similarly to the inner rubber10of the second example, a wide variety of materials can be selected for the additional layer17, which is suitable for achieving various performances at low cost.", "", "Even when the first portion11of the inner rubber10comprises the additional layer17as shown inFIGS.12and13, the first thickness t1is the thickness from the inner surface6iof the carcass6in the tread portion2to the tire inner cavity surface1i, excluding the topping rubber of the carcass ply6A (shown inFIG.1).", "", "FIG.14is an enlarged cross-sectional view of the inner rubber10as a fourth example. The same reference numerals are given to the same elements as in the above-described examples, and the description thereof is omitted.", "", "As shown inFIG.14, the second portion12of the inner rubber10of the fourth example comprises an inner liner layer16made of a rubber material having air impermeability, and an intermediate layer18disposed between the inner liner layer16and the carcass6.", "", "The intermediate layer18of the fourth example is composed of a rubber material different from that of the inner liner layer16.", "", "The intermediate layer18may be composed of the same rubber material as the additional layer17(shown inFIGS.12and13), or may be composed of a different rubber material from the additional layer17, for example.", "", "In such inner rubber10, a wide variety of materials can be selected for the intermediate layer18, which is suitable for achieving various performances at low cost.", "", "The intermediate layer18overlaps with the band layer8in the tire axial direction, for example.", "", "The intermediate layer18of the fourth example overlaps with the belt layer7in the tire axial direction.", "", "The intermediate layer18may be continuous with the first portion11of the inner rubber10, for example.", "", "It is preferable that the intermediate layer18overlaps, in the tire radial direction, with the turnup portion6bof the carcass6.", "", "Such intermediate layer18helps to suppress vibrations of the sidewall portion3and can improve the noise performance of the pneumatic tire1.", "", "Even when the second portion12of the inner rubber10comprises the intermediate layer18, the second thickness t2is the thickness from the inner surface6iof the carcass6in the sidewall portion3to the tire inner cavity surface1i, excluding the topping rubber of the carcass ply6A.", "", "While detailed description has been made of preferable embodiments of the present disclosure, the present disclosure can be embodied in various forms without being limited to the above-described embodiments."], "claims": ["a tread portion; a pair of sidewall portions; a pair of bead portions; a carcass extending between the bead portions; and an inner rubber extending between the bead portions, on the inside of the carcass, wherein the inner rubber comprises a first portion extending through the tread portion with a first thickness, and a second portion extending through the sidewall portions with a second thickness; the first thickness is more than the second thickness; the tread portion has a ground contacting surface between a first tread edge and a second tread edge; the sidewall portions respectively have outer surfaces extending radially inward from the first tread edge and the second tread edge, respectively; the ground contacting surface has a tire equator at the central position in the tire axial direction between the first tread edge and the second tread edge; and the outer surfaces have tire maximum width positions which are the outermost positions in the tire axial direction, wherein in a meridian cross section of the tire under a normal state in which the tire is mounted on a regular rim, inflated to a normal internal pressure, and loaded with no load, when a first reference point is defined as an intersection of a bead base line with a straight line extending parallel to the tire radial direction through the tire equator; a second reference point is defined as an intersection of a straight line extending parallel to the tire axial direction through the tire equator with a straight line extending parallel to the tire radial direction through the tire maximum width position; a reference line segment is defined as a strain line extending between the first reference point and the second reference point; a shoulder reference point is defined as an intersection of the reference line segment with the ground contacting surface or the outer surface; and a shoulder line segment is defined as a straight line connecting between the first reference point and the shoulder reference point, then the length of the shoulder line segment is in a range from 85.9% to 89.3% of the length of the reference line segment.", "an average value of the first thickness is in a range from 1.5 to 3.5 times an average value of the second thickness.", "an average value of the first thickness is 2.0 to 4.5 mm.", "in the meridian cross section of the tire, the ground contacting surface is made up of a plurality of arcs having different radii of curvature, and the plurality of arcs includes a first arc passing through the tire equator, a second arc adjacent to the first arc on the outer side in the tire axial direction, and a third arc adjacent to the second arc on the outer side in the tire axial direction.", "a radius R", "the radius R", "a tread width which is the distance in the tire axial direction between the first tread edge and the second tread edge, is in a range from 74% to 84% of a maximum width which is the distance in the tire axial direction at a maximum tire width position.", "with respect to a shape of a ground contacting surface of the pneumatic tire when the pneumatic tire under the normal state is put on a flat surface at a camber angle of 0 degrees, and is loaded with 70% of a normal load, a tread shape index F defined as a ratio (L a length L a length L", "the outer surface of at least one of the sidewall portions comprises a serration portion, the serration portion comprises a plurality of grooves each extending in a tire radial direction and arranged in the tire circumferential direction, and a plurality of ridges divided by the plurality of grooves, and each of the plurality of grooves comprises a radially outer end portion having a depth of 0.2 mm or less.", "each of the plurality of grooves comprises a radially inner end portion, and has a depth decreasing from the radially inner end portion to the radially outer end portion.", "the tread portion comprises a tread rubber forming a ground contacting surface, and a loss tangent tan δ", "the loss tangent tan δ", "the loss tangent tan δ", "the carcass comprises carcass cords having a twist coefficient of 2000 to 2500.", "the carcass has a main portion extending between the bead portions, and a turnup portion connected to the main portion and turned up around a bead core of the bead portion from the inside to the outside in the tire axial direction, and the turnup portion has a radially outer end positioned radially outside a maximum width position of the main portion.", "the outer surface of at least one of the sidewall portions comprises a serration portion, the serration portion comprises a plurality of grooves each extending in a tire radial direction and arranged in the tire circumferential direction, and a plurality of ridges divided by the plurality of grooves, and each of the plurality of grooves comprises a radially outer end portion having a depth of 0.2 mm or less, the tread portion comprises a tread rubber forming the ground contacting surface, the loss tangent tan δ the carcass comprises carcass cords having a twist coefficient of 2000 to 2500.", "an average value of the first thickness is in a range from 1.5 to 3.5 times an average value of the second thickness; the average value of the first thickness is in a range from 2.0 to 4.5 mm; in the meridian cross section of the tire, the ground contacting surface is made up of a plurality of arcs having different radii of curvature, and the plurality of arcs includes a first arc passing through the tire equator, a second arc adjacent to the first arc on the outer side in the tire axial direction, and a third arc adjacent to the second arc on the outer side in the tire axial direction; the radius R the radius R a tread width which is the distance in the tire axial direction between the first tread edge and the second tread edge, is in a range from 74% to 84% of a maximum width which is the distance in the tire axial direction at a maximum tire width position; and with respect to a shape of a ground contacting surface of the pneumatic tire when the pneumatic tire under the normal state is put on a flat surface at a camber angle of 0 degrees, and is loaded with 70% of a normal load, a tread shape index F defined as a ratio (L a length L a length L", "the outer surface of at least one of the sidewall portions comprises a serration portion, the serration portion comprises a plurality of grooves each extending in a tire radial direction and arranged in the tire circumferential direction, and a plurality of ridges divided by the plurality of grooves, and each of the plurality of grooves comprises a radially outer end portion having a depth of 0.2 mm or less.", "the tread portion comprises a tread rubber forming the ground contacting surface, and the loss tangent tan δ", "the carcass comprises carcass cords having a twist coefficient of 2000 to 2500."], "bibtex": "@patent{20240131866,\n    title = {PNEUMATIC TIRE},\n    number = {20240131866},\n    year = {2024},\n    note = {File: US20240131866A1-20240425.XML}\n    }", "classification": "B60C304FI"}, {"title": "TIRE", "doc_number": "20240131867", "filename": "US20240131867A1-20240425.XML", "abstract": "A pneumatic tire ( 1 ) includes: a tread portion ( 2 ) including a land portion ( 24 ) divided by a plurality of main grooves ( 22 ) formed on a tread surface ( 21 ); an inner liner ( 7 ) constituting a tire inner surface ( 7 A) on an inner side of the tread portion ( 2 ); and a mount member ( 10 ) which is provided on the tire inner surface ( 7 A), and to which electric equipment can be attached. In the pneumatic tire ( 1 ), acetone extraction amount (AE 2 ) of a rubber composition constituting the inner liner ( 7 ) is larger than acetone extraction amount AE 1 of a rubber composition constituting the mount member ( 10 ).", "detailed_description": [""], "claims": ["a tread portion constituting a tire surface; an inner liner constituting a tire inner surface; and a mount member which is provided on the tire inner surface, and to which electric equipment can be attached, wherein each of a first rubber composition constituting the mount member and a second rubber composition constituting the inner liner contains a plasticizer, and acetone extraction amount AE", "the acetone extraction amount AE", "an area of an attachment surface in the tire inner surface of the inner liner to which the mount member is attached is 75 cm", "complex elastic modulus E*2 at 70° C. of the second rubber composition measured under measurement conditions: measurement temperature of 70° C., initial strain of 5%, dynamic strain of ±1%, frequency of 10 Hz, and stretch deformation mode and complex elastic modulus E*1 at 70° C. of the first rubber composition measured under the measurement conditions satisfy a formula shown below:", "loss tangent tan δ at 70° C. of the second rubber composition measured under measurement conditions: measurement temperature of 70° C., initial strain of 10%, dynamic strain of ±2.5%, frequency of 10 Hz, and stretch deformation mode is 0.18 or less.", "loss tangent tan δ at 70° C. of the second rubber composition measured under measurement conditions: measurement temperature of 70° C., initial strain of 10%, dynamic strain of ±2.5%, frequency of 10 Hz, and stretch deformation mode is 0.15 or less.", "the mount member is disposed on the tire inner surface at a position corresponding to a center part of the tread portion in a width direction.", "the mount member is disposed on the tire inner surface at a position where a straight line that passes through a center of the center part of the tread portion in the width direction coincides with a center of the mount member.", "the tread portion includes a land portion divided by a recessed groove formed on the tire surface, and the mount member is disposed on the tire inner surface at a position corresponding to the land portion.", "the mount member includes: a mounting seat portion fixed to the tire inner surface; and a main body portion to which the electric equipment is attached in a detachable manner.", "the mount member is welded to the tire inner surface.", "a plurality of mount members are provided on the tire inner surface, and the plurality of mount members are arranged on the tire inner surface at equal intervals along a peripheral direction of the tire.", "the electric equipment is a sensor, a wireless communication relay, or a signal transmitter.", "the tire is a tire for passenger car.", "the tire is a pneumatic tire."], "bibtex": "@patent{20240131867,\n    title = {TIRE},\n    number = {20240131867},\n    year = {2024},\n    note = {File: US20240131867A1-20240425.XML}\n    }", "classification": "B60C514FI"}, {"title": "TIRE", "doc_number": "20240131868", "filename": "US20240131868A1-20240425.XML", "abstract": "A tire includes a tread portion; a pair of bead portions; a pair of sidewall portions, each of which extend between the tread portion and a respective bead portion; a carcass that extends from one bead portion to the other, through the sidewall portions and tread portion; and an inner surface that defines a tire cavity; wherein the tread portion comprises a belt disposed outside of the carcass in a radial direction of the tire, the belt comprising one or more belt plies that extend in an axial direction of the tire; wherein each sidewall portion comprises an intermediate layer arranged inward in the tire radial direction from the carcass, wherein each intermediate layer comprises an outer edge that overlaps the belt and an inner edge arranged in the sidewall portion or bead portion; wherein the tire further comprises an inner layer arranged inward in the tire radial direction from the tread portion, the inner layer having a thickness in the radial direction defined by the carcass and inner surface; and wherein the thickness of the inner layer is greater than a thickness between the carcass and inner surface in the sidewall portions.", "detailed_description": ["FIG.1shows a schematic cross-section of a pneumatic tire1along a radial plane that intersects the tire's axis of rotation (not shown). In the following description, the expressions “axial” and “radial” are defined relative to the tire's axis of rotation.", "", "As shown, the tire1includes a tread portion2, a pair of sidewall portions3, and a pair of bead portions4. Each sidewall portion3extends between the tread portion2and one of the pair of bead portions4. Each bead portion4includes a bead core5, a ring-shaped reinforcing element typically formed by a bundle of wires (not shown). The tire1also includes a carcass6that extends from one bead portion4to the other via the sidewall portions3and tread portion2and a belt7disposed radially outward of the carcass6. Although the tire1ofFIG.1is schematically depicted with a pronounced corner between the tread portion2and each sidewall portion3, in many cases, the transition between the two is much smoother, giving the carcass6a more rounded shape.", "", "The carcass6can include a carcass ply6A with a plurality of carcass cords coated by topping rubber. Carcass cords can include steel, an organic fiber such as polyester fibers, nylon fibers, rayon fibers, polyethylene naphthalate fibers, and aramid fibers to name a few examples. In some cases, the carcass cords extend at an angle of approximately 80 to 90 degrees to the tire equator C, providing the carcass6with a “radial” structure. However, the concepts described herein are not limited to such an orientation. In some instances, the carcass6can include more than one ply6A.", "", "As also shown inFIG.3, the carcass ply6A can include a main portion6athat extends from one bead core5to the other and a pair of turn up portions6bthat wrap around the bead core5. In some cases, the bead portions4include a bead apex8(also called a “bead filler”) that is disposed between the main portion6aand one of the pair of turn up portions6b. The bead apex8is often made of hard rubber and have a tapered shape that extends radially outward from the bead core5. Although the bead apex8is shown as a single component inFIG.1, in some cases, the bead apex8is formed by multiple (e.g., two) parts.", "", "The belt7includes a plurality of belt plies7A,7B that extend in the axial direction of the tire. Each belt ply7A,7B includes a plurality of steel cords that extend at an angle of, e.g., approximately 10 to 60 degrees to the tire equator C. Although the tire1ofFIG.1is shown with two belt plies7A,7B, other versions of the tire1can include more than two (e.g., four) belt plies. Generally speaking, the belt7can increase the rigidity of the tread portion2and counteract the so-called “hoop effect” in which the carcass6expands outward in the radial direction of the tire.", "", "The tire1also includes an inner surface9that defines an inner cavity10along with a vehicle wheel or rim (not shown). The inner surface9is formed by a rubber layer that is impermeable to air and allows the tire1to be inflated to a predetermined pressure, as described below in more detail. For example, the rubber of the inner surface can include a natural rubber, a synthetic diene rubber, butyl rubber a halogenated butyl rubber, chlorobutyl rubber, and bromobutyl rubber to name a few examples. Often, the inner surface9is made from a butyl-type rubber, which is known to have low air permeability.", "", "Each sidewall portion3includes an intermediate layer11that is arranged inward from the carcass6in the radial direction of the tire1. In other words, the intermediate layers11are arranged between the inner surface9and the carcass6. Each intermediate layer11includes an outer edge11athat overlaps the belt7and an inner edge11barranged in the sidewall portion3or bead portion4(FIG.4). With respect to the intermediate layer11, the designations “inner” and “outer” refer to the radial direction of the tire1. The intermediate layers11can be formed, e.g., by a sheet of topping rubber compounds used for carcass plies or some sidewall compounds.", "", "The tire1also includes an inner layer12that is arranged inward from the tread portion2in the radial direction of the tire1. The inner layer12has a thickness (T, measured in the radial direction) that is defined by the carcass6and the inner surface9. The thickness T of the inner layer12is greater than a thickness t between the carcass6and the inner surface9in each of the sidewall portions3. Thus, the inner layer12forms an integral belt-shaped body or plate that protrudes radially inward from the carcass6into the tire cavity10. In many cases, the inner layer12extends along the entire circumference of the tire. However, there may be other cases in which inner layer12includes gaps or interruptions along the circumferential direction of the tire.", "", "The inner layer12can be used to increase the weight of the tread portion2relative to the rest of the tire1. The weight increase can increase the moment of inertia in the tread region2and suppress vibrations in the tread region that can lead to pass-by noise. At the same time, the frequency of oscillation that can lead to interior noise may also be reduced. As described below in more detail, the intermediate layers11are distinct from one another, i.e., there is a space or width W1in the axial direction between the outer edges11aof the two intermediate layers11. Generally speaking, the inner layer12occupies or fills this space. When manufacturing such a tire1, the space between the outer edges11aof the two intermediate layers11can serve as a point of reference that allows accurate placement of a relatively large inner layer12in some cases.", "", "For instance, a balance between noise reduction and rolling resistance may be obtained by making the inner layer12as wide as possible, but not so wide that its axially outer edges extend beyond the outer edges of the belt plies. In more specific terms, the belt7can include a radially outer belt ply7A that is stacked on a radially inner belt ply7B. The radially outer belt ply7A has an axial width W2, and the radially inner belt ply7B has an axial width W3. The axial widths W2, W3are measured from one edge of the belt ply7A,7B to the other. The inner layer12has an axial width W4that is less than both axial widths W2, W3, i.e., less than the smallest axial width out of all the belt plies. In some cases, the smallest axial width is the axial width of the outermost belt ply, in the illustrated example the radially outer belt ply7A.", "", "A ratio between the width W4of the inner layer12and the smallest axial width of all the belt plies7A,7B can range from about 0.8 to 1.0. For example, said ratio can range from 0.90 to 0.99. In other words, the inner layer12can extend as far as the axial edges of the narrowest belt ply7A without extending past its edges. As a comparative example, a pneumatic tire with a thin rubber layer adhered to the inner surface below the tread region is considered. Similarly to the inner layer12, such a thin rubber layer may increase the weight of the tread portion and reduce pass-by noise and interior noise to a certain extent. Since the thin rubber layer is applied to the built (or even vulcanized) tire, it is difficult to target placement of the rubber layer relative to the edges of the belt. The most straightforward way to ensure that the rubber layer is placed within the outer edges of the belt is to make the axial width of the rubber layer substantially smaller than the axial width of the belt although a larger axial width may generally improve noise reduction by the rubber layer. In contrast to this, the inner layer12can be integrally formed with the rest of the tire as part of the building process, which may allow accurate placement of even a relatively wide inner layer12.", "", "The tread portion2can include one or more grooves13that extend continuously in the circumferential direction of the tire. In some instances, the inner layer12overlaps all of the circumferential grooves13. To put it another way, all of the circumferential grooves13are arranged within the axial width W4of the inner layer12. However, not all tires have continuous circumferential grooves. Some tires have a “luggy” pattern that consists of a large number of blocks. The principles described herein can be applied both to tires with and without continuous circumferential grooves.", "", "In some instances, the thickness T of the inner layer12can range from about 2.0 to 4.5 mm, or more specifically, 2.5 to 3.5 mm. In addition or alternatively, a ratio (T/t) between the thickness T of the inner layer12and the thickness t between the carcass6and the inner surface9in each of the sidewall portions3can range from about 1.75 to 3.5. For example, the ratio T/t can range from 1.9 to 2.7. In some cases, the thickness T and/or the thickness t may be substantially constant. For example, the inner layer12may have a substantially rectangular cross-section having a constant thickness T (not shown). In some instances, the sidewall portions3have the same thickness t on each side of the tire1.", "", "In other cases, the thickness T and/or the thickness t may vary. In this case, the aforementioned ratios and dimensions relate to the maximum thickness. For example, the inner layer12can include a central region12ahaving a substantially constant thickness T and a tapered region12barranged on each side of the central region12a. The aforementioned ratios and dimensions are based on the thickness T of the central region12ain this example. In other cases, the thickness T of the inner layer12may continuously vary along the axial direction of the tire. Again, in this case, the aforementioned ratios and dimensions are based on the maximum thickness. In such cases, the width W4of the inner layer12is measured at the point in which the thickness between the carcass6and the inner surface9is greater than the thickness tin the sidewall portion3. For example, the axial width W4includes the tapered regions12binFIG.2.", "", "Referring still toFIG.2, the inner layer12can be formed from butyl rubber that is arranged in direct contact with the carcass in a region that overlaps the belt plies, i.e., without any other layers or materials arranged between the butyl rubber and the carcass ply6A. For example, such an inner layer12can be formed using known strip winding techniques, in which one or more strips of butyl rubber are wound about an axis of the tire to form the cross-section depicted inFIGS.1and2. In some instances, the same one or more strips of butyl rubber can be wound about the tire axis to form the inner surface9along each of the sidewall portions3. Thus, it is possible to build the integral inner layer12on a tire building drum without a substantial increase in the building duration or number of steps. Such implementations can optionally further include intermediate layers11formed by a monolithic body of extruded rubber, i.e., intermediate layers11that are not formed using strip winding techniques. Extruded intermediate layers11can be applied to the strip wound butyl rubber relatively quickly. However, the principles described herein can also be applied to intermediate layers11formed by strip winding techniques as well as to an inner layer12formed by an extruded body of rubber.", "", "Further, although the drawings depict the inner layer12as a unitary component formed by a single material (e.g., butyl rubber). The inner layer12can also include two or more layers (not shown). In any case, the inner surface9of the inner layer12includes a material that is impermeable to air.", "", "FIG.3is an enlarged view of the sidewall portion3and bead portion4inFIG.1. More specifically,FIG.3shows that the main portion6aand the turn up portion6bof the carcass ply6A can be continuous. The main portion6aextends from the tread portion2, radially inward along the sidewall portion3and towards the bead core5. The carcass ply6A the extends axially outward, along the surface of the bead core5and bead apex8and smoothly transitions into the turn up portion6b. The turn up portion6bextends outwardly in the radial direction and ends in a turn up edge6c. The turn up edge6cis arranged radially outward of the inner edge11bof the intermediate layer, such that the intermediate layer11and the turn up portion6boverlap (reference numeral14).", "", "Although the overlap14shown inFIG.3is relatively small, in some cases, the intermediate layer11can extend further to create a larger overlap14. For example, the inner edge11bof the intermediate layer11may extend past a tip8aof the bead apex8in a similar way to what is shown inFIG.3. In this case, the intermediate layer11extends along the entire sidewall portion3, i.e., from the tread portion2to the bead portion4. Such a design may help the tire1withstand greater pressure during the tire building process.", "", "WhereasFIG.3shows a “high turn up” arrangement,FIG.4shows a “low turn up” arrangement, in which the turn up portion6bis folded onto the bead apex8. Thus the turn up edge6cis arranged below the tip8aof the bead apex8. Although the bead apex8ofFIGS.1,3, and4has a relatively small radial height, in other tires, the bead apex8can be taller. In any case, the inner edge11bof the intermediate layer11extends radially inward, past the tip8aof the bead apex8. Accordingly, the intermediate layer11and the bead apex8overlap (reference numeral14).", "", "In some instances, the tire may include additional components that are not shown in the drawings but are familiar to the skilled person, e.g., cap plies that are arranged radially outward from the belt.", "", "Unless defined otherwise, the concepts and features described above and shown in the drawing apply to the tire in its “normal state.” For pneumatic tires that are subject to various standards, the “normal state” is a state in which a tire is mounted on a normal rim and inflated to a normal internal pressure, and no load is applied to the tire. The “normal rim” collectively refers to the rims defined by applicable standards, for example the “standard rim” in the JATMA standard, the “Design Rim” in the TRA standard, and the “Measuring Rim” in the ETRTO standard. Likewise, the “normal internal pressure” collectively refers to the standard air pressure defined by each applicable standard, for example, the “maximum air pressure” in the JATMA standard and the maximum value recited in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard and “INFLATION PRESSURE” in the ETRTO standard, respectively. For tires that are not subject to such standards, “normal state” refers to a state in which the tire is not mounted to a vehicle and no load is applied. Unless otherwise specified, dimensions and the like of components of the tire disclosed herein are values measured in the normal state.", "", "Although the drawings have been described in reference to a schematic of a passenger car tire, the principles described herein can also be applied to other types of tires, such as motorcycle tires, van tires, truck tires, and any other types of heavy-duty tires to name a few examples.", "", "While a number of examples have been described above for the purpose of illustration, the description is not intended to limit the scope of the invention, which is defined by the scope of the following claims."], "claims": ["a tread portion; a pair of bead portions; a pair of sidewall portions, each of which extend between the tread portion and a respective bead portion; a carcass that extends from one bead portion to the other, through the sidewall portions and tread portion; a belt outside of the carcass in a radial direction of the tire, the belt comprising one or more belt plies that extend in an axial direction of the tire; an inner surface that defines a tire cavity; and an inner layer inward in the tire radial direction from the tread portion, the inner layer having a thickness in the radial direction defined by the carcass and inner surface; wherein each sidewall portion comprises an intermediate layer inward in the tire radial direction from the carcass, wherein each intermediate layer comprises an outer edge that overlaps the belt and an inner edge in the sidewall portion or bead portion, and the thickness of the inner layer is greater than a thickness between the carcass and inner surface in the sidewall portions.", "each of the one or more belt plies and the inner layer have a width in the tire axial direction, and the width of the inner layer is less than the width of each of the one or more belt plies.", "a ratio between the width of the inner layer and the smallest width amongst the one or more belt plies ranges from 0.8 to 1.0.", "the inner layer overlaps the outer edge of each intermediate layer.", "the thickness of the inner layer ranges from 2.0 to 4.5 mm.", "the thickness of the inner layer ranges from 2.5 to 3.5 mm.", "a ratio between the thickness of the inner layer and the thickness between the carcass and inner surface in each sidewall portion ranges from 1.75 to 3.5.", "the inner layer comprises a region having a substantially constant thickness along the axial direction of the tire.", "the inner layer comprises a tapered region on each side of a central region.", "each bead portion comprises a bead core, and the carcass comprises two turn up portions in which the carcass wraps around a respective bead core and is folded onto itself; and the inner edge of each intermediate layer overlaps a corresponding turn up portion of the carcass.", "each bead portion comprises a bead core and a bead apex adjacent to the bead core, and the carcass comprises two turn up portions in which the carcass wraps around a respective bead core and is folded onto the bead apex; and wherein the inner edge of each intermediate layer overlaps the bead apex.", "the inner layer includes a butyl rubber in direct contact with the carcass.", "the inner layer comprises one or more strips of butyl rubber that are wound about an axis of the tire.", "the one or more strips of butyl rubber are wound about the tire axis in each sidewall portion to configure a butyl rubber layer inward from the intermediate layer in the tire radial direction.", "each intermediate layer comprises a monolithic body of extruded rubber.", "the thickness of the inner layer ranges from 2.0 to 4.5 mm.", "a ratio between the thickness of the inner layer and the thickness between the carcass and inner surface in each sidewall portion ranges from 1.75 to 3.5.", "each bead portion comprises a bead core, and the carcass comprises two turn up portions in which the carcass wraps around a respective bead core and is folded onto itself; and the inner edge of each intermediate layer overlaps a corresponding turn up portion of the carcass.", "each bead portion comprises a bead core and a bead apex adjacent to the bead core, and the carcass comprises two turn up portions in which the carcass wraps around a respective bead core and is folded onto the bead apex; and wherein the inner edge of each intermediate layer overlaps the bead apex.", "the inner layer includes a butyl rubber in direct contact with the carcass."], "bibtex": "@patent{20240131868,\n    title = {TIRE},\n    number = {20240131868},\n    year = {2024},\n    note = {File: US20240131868A1-20240425.XML}\n    }", "classification": "B60C920FI"}, {"title": "TIRE HAVING A REGROOVABLE TREAD", "doc_number": "20240131869", "filename": "US20240131869A1-20240425.XML", "abstract": "The invention relates to a tire ( 1 ) that can be regrooved at least once, and the tread of which has at least one re-cuttable groove ( 3 ). According to the invention, after regrooving, the height (H R ) of said at least one re-cut groove ( 3 ) is greater than or equal to 70% of the groove height (H N3 ) of said at least one re-cuttable groove of the tire when new.", "detailed_description": [""], "claims": ["1 .- 9 . (canceled)", "wherein, after regrooving, a height (H", "11 . The tire ( 1 ) according to claim 10 , wherein a height corresponding to a distance between the tread surface when new and the bottom of the at least one re-cuttable groove ( 3 ) after a regrooving operation is greater than or equal to 200% of the height (H N ) between the bottom of the at least one re-cuttable groove ( 3 ) and the tread surface when the tire is new.", "12 . The tire ( 1 ) according to claim 10 , wherein the at least one re-cuttable groove ( 3 ) is circumferential.", "13 . The tire ( 1 ) according to claim 10 , wherein the at least one re-cuttable groove ( 3 ) is transverse.", "14 . The tire ( 1 ) according to claim 10 , wherein the at least one re-cuttable groove ( 3 ) is oblique.", "15 . The tire ( 1 ) according to claim 10 , wherein the at least one re-cuttable groove ( 3 ) can be re-cut at least twice.", "16 . The tire ( 1 ) according to claim 15 , wherein an elastomer compound regrooved during a first regrooving operation is different from an elastomer compound regrooved during a second regrooving operation.", "17 . The tire ( 1 ) according to claim 10 , wherein a regroovable elastomer compound is different from at least part of the at least one elastomer compound that constitutes the tread.", "18 . The tire ( 1 ) according to claim 10 , wherein the tread comprises, at least locally, at least two layers of elastomer compounds radially superposed in the tread."], "bibtex": "@patent{20240131869,\n    title = {TIRE HAVING A REGROOVABLE TREAD},\n    number = {20240131869},\n    year = {2024},\n    note = {File: US20240131869A1-20240425.XML}\n    }", "classification": "B60C1102FI"}, {"title": "HEAVY DUTY PNEUMATIC TIRE", "doc_number": "20240131870", "filename": "US20240131870A1-20240425.XML", "abstract": "A heavy duty pneumatic tire includes a crown circumferential groove, a shoulder circumferential groove, crown lateral grooves, and crown blocks. The crown circumferential groove includes crown first-side vertexes and crown second-side vertexes and thus zigzags. The shoulder circumferential groove includes shoulder inner-side vertexes and shoulder outer-side vertexes. The crown lateral grooves are disposed at two pitch intervals of a zigzag of the crown circumferential groove and connect between the crown first-side vertexes and the shoulder inner-side vertexes. The crown blocks have crown sub-grooves having a groove width less than a groove width of the crown lateral groove. The crown sub-groove includes at least two transverse grooves extending across the crown block.", "detailed_description": ["One embodiment of the present disclosure will be described below with reference to the drawings.", "", "FIG.1is an enlarged plan view of a tread portion2of a heavy duty pneumatic tire (hereinafter, may be simply referred to as “tire”)1of the present embodiment. The tire1of the present embodiment is suitably used as a tire for, for example, trucks and buses.", "", "The tread portion2includes a crown circumferential groove3, shoulder circumferential grooves4, a plurality of crown lateral grooves5, and a plurality of crown blocks8. The crown circumferential groove3continuously extends on a tire equator C side in the tire circumferential direction. The shoulder circumferential groove4continuously extends in the tire circumferential direction, on the side outward of the crown circumferential groove3in the tire axial direction. Each crown lateral groove5connects between the crown circumferential groove3and the shoulder circumferential groove4. Each crown block8is formed by the crown circumferential groove3, the shoulder circumferential groove4, and a plurality of the crown lateral grooves5.", "", "The crown circumferential groove3includes crown first-side vertexes3aprotruding toward the shoulder circumferential groove4, and crown second-side vertexes3bprotruding in the direction opposite to that of the crown first-side vertex3a, alternately in the tire circumferential direction, and thus zigzags.", "", "The shoulder circumferential groove4includes shoulder inner-side vertexes4aprotruding toward the crown circumferential groove3, and shoulder outer-side vertexes4bprotruding in the direction opposite to that of the shoulder inner-side vertex4a, alternately in the tire circumferential direction, and thus zigzags.", "", "The plurality of crown lateral grooves5that are directly adjacent to each other in the tire circumferential direction are disposed at intervals of two pitches (2×P) of the zigzag of the crown circumferential groove3. The crown block8formed by the crown lateral grooves5having such a structure has a relatively large length in the tire circumferential direction, and has high block stiffness in the tire circumferential direction. Each crown lateral groove5connects between the crown first-side vertex3aand the shoulder inner-side vertex4a. Thus, the crown lateral groove5is disposed at a portion at which the length of the crown block8in the tire axial direction is small, so that block stiffness on both end portions of the crown block8in the tire circumferential direction is also maintained high. Therefore, the crown block8exhibits excellent uneven wear resistance. In the present embodiment, each crown lateral groove5is disposed so as to connect between an alternate one of the crown first-side vertexes3aaligned in the tire circumferential direction and an alternate one of the shoulder inner-side vertexes4aaligned in the tire circumferential direction.", "", "The plurality of crown blocks8has a plurality of crown sub-grooves10each having a groove width W3less than a groove width W2of each of the plurality of crown lateral grooves5. The crown block8having such a structure exhibits a high edge effect. The plurality of crown sub-grooves10each include at least two transverse grooves11that extend across the crown block8. The transverse grooves11having such a structure allow a water film between the crown block8and a road surface to be removed by an edge11e, whereby wet traction performance is enhanced. In the present specification, the “edge” represents a boundary between a tread surface8aof the crown block8and each groove. In the present specification, the “tread surface” refers to a ground contact surface of the crown block8that comes into contact with a plane when a standardized load is applied to the tire1in a standardized state and the tire1is in contact with the plane at a camber angle of 0°.", "", "The “standardized state” refers to a state in which the tire is mounted on a standardized rim and is inflated to a standardized internal pressure, and no load is applied. In the present specification, unless otherwise specified, the dimension and the like of each component of the tire1is represented by a value measured in the standardized state.", "", "The “standardized rim” represents a rim that is defined, in a standard system including a standard on which the tire1is based, by the standard for each tire, and is, for example, “standard rim” in the JATMA standard, “Design Rim” in the TRA standard, or “Measuring Rim” in the ETRTO standard.", "", "The “standardized internal pressure” represents an air pressure that is defined, in a standard system including a standard on which the tire1is based, by the standard for each tire, and is “maximum air pressure” in the JATMA standard, the maximum value recited in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, or “INFLATION PRESSURE” in the ETRTO standard.", "", "The “standardized load” represents a load that is defined, in a standard system including a standard on which the tire1is based, by the standard for each tire, and is “maximum load capacity” in the JATMA standard, the maximum value recited in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, or “LOAD CAPACITY” in the ETRTO standard.", "", "FIG.2is a plan view of a portion of the tread portion2between tread ends Te and Te. As shown inFIG.2, in the present embodiment, the tread portion2is formed to have a pattern that is point-symmetric with respect to any point on the tire equator C. The shape of the tread portion2is not limited to such a point-symmetric pattern.", "", "In the present specification, the “tread end Te” represents the outermost ground contact position in the tire axial direction as obtained when a standardized load is applied to the tire1in a standardized state and the tire1is in contact with a flat plane at a camber angle of 0°. A distance between the tread ends Te on both sides in the tire axial direction is a tread width TW.", "", "In the present embodiment, the crown circumferential groove3is disposed on the tire equator C. In the present embodiment, the shoulder circumferential grooves4are disposed on both sides of the crown circumferential groove3in the tire axial direction. Thus, the crown blocks8are disposed on both sides of the tire equator C. InFIG.2, the crown first-side vertex3acorresponds to a portion protruding on the left side of the crown circumferential groove3in terms of the crown circumferential groove3and a shoulder circumferential groove4A on the left side. Meanwhile, the portion protruding on the left side corresponds to a crown inner-side vertex (not shown) in terms of the crown circumferential groove3and a shoulder circumferential groove4B on the right side. In the present specification, a tread pattern on the left side of the crown circumferential groove3will be described below, and description about a tread pattern on the right side of the crown circumferential groove3is omitted.", "", "One pitch P of the zigzag is the same between the crown circumferential groove3and the shoulder circumferential groove4. Thus, a difference in block stiffness is maintained small on both sides of the crown block8in the tire axial direction, so that uneven wear resistance is maintained high.", "", "In the present embodiment, the crown circumferential groove3includes first crown groove portions15inclined in the same direction relative to the tire circumferential direction, and second crown groove portions16inclined in the direction opposite to the direction of the first crown groove portions15. InFIG.2, the first crown groove portion15is inclined in the upper-right direction. The second crown groove portion16is inclined in the upper-left direction. In the present embodiment, the first crown groove portion15and the second crown groove portion16extend linearly. The first crown groove portion15and the second crown groove portion16may extend so as to form, for example, arc-like shapes. For example, the first crown groove portions15and the second crown groove portions16alternate in the tire circumferential direction.", "", "In the present embodiment, the shoulder circumferential groove4includes first shoulder groove portions17inclined in the same direction relative to the tire circumferential direction, and second shoulder groove portions18inclined in the direction opposite to the direction of the first shoulder groove portions17. InFIG.2, the first shoulder groove portion17is inclined in the upper-right direction. The second shoulder groove portion18is inclined in the upper-left direction. In the present embodiment, the first shoulder groove portion17and the second shoulder groove portion18extend linearly. In the present embodiment, the first shoulder groove portion17and the second shoulder groove portion18may extend so as to form arc-like shapes. For example, the first shoulder groove portions17and the second shoulder groove portions18alternate in the tire circumferential direction.", "", "Each of an angle α1of the first crown groove portion15relative to the tire axial direction, an angle α2of the second crown groove portion16relative to the tire axial direction, an angle α3of the first shoulder groove portion17relative to the tire axial direction, and an angle α4of the second shoulder groove portion18relative to the tire axial direction is preferably 10 to 30°. In the present embodiment, the angle α1of the first crown groove portion15, the angle α2of the second crown groove portion16, the angle α3of the first shoulder groove portion17, and the angle α4of the second shoulder groove portion18are equal to each other.", "", "A groove width W1aof the crown circumferential groove3is, but is not particularly limited to, greater than a groove width W1bof the shoulder circumferential groove4. Thus, a water film near the tire equator C is smoothly removed. The groove width W1aof the crown circumferential groove3is preferably 1.1 times the groove width W1bof the shoulder circumferential groove z4or more and more preferably 1.2 times the groove width W1bor more, and preferably 1.5 times the groove width W1bor less and more preferably 1.4 times the groove width W1bor less. The groove width W1aof the crown circumferential groove3is preferably 8% of the tread width TW or more and more preferably 10% thereof or more, and preferably 16% thereof or less and more preferably 14% thereof or less.", "", "FIG.3is a cross-sectional view taken along a line A-A inFIG.2. As shown inFIG.3, a groove depth D1aof the crown circumferential groove3is preferably 15 to 23 mm. In the present embodiment, a groove depth D1bof the shoulder circumferential groove4is equal to the groove depth D1aof the crown circumferential groove3.", "", "FIG.4is an enlarged plan view of the tread portion2. As shown inFIG.4, in the present embodiment, the crown lateral groove5includes a first portion21connected to the crown first-side vertex3a, a second portion22connected to the shoulder inner-side vertex4a, and a third portion23connected to the first portion21and the second portion22. In the present embodiment, the first portion21, the second portion22, and the third portion23extend linearly. The first portion21, the second portion22, and the third portion23may extend so as to form arc-like shapes.", "", "For example, the first portions21are inclined in the same direction relative to the tire axial direction. For example, the second portions22are inclined in the same direction as the first portions21relative to the tire axial direction. In the present embodiment, the third portions23are inclined in the direction opposite to that of the first portions21relative to the tire axial direction. Thus, in the present embodiment, a length La of the crown lateral groove5in the tire circumferential direction is maintained relatively small, so that block stiffness is maintained higher on both end portions of the crown block8in the tire circumferential direction.", "", "For example, the first portion21includes a first constant-width portion21aextending with the same groove width in the longitudinal direction, and a first increased-width portion21bwhich is connected to the first constant-width portion21aand which extends to the crown first-side vertex3awith a continuously increased groove width. In the present embodiment, one end of the first increased-width portion21bin the tire circumferential direction is connected to the crown outer-side vertex3a. More specifically, one edge21eof the first increased-width portion21band an edge15eof the first crown groove portion15extend so as to form one straight line. Thus, occurrence of uneven wear of the crown block8can be effectively inhibited. In the present specification, the groove width is a width of a groove at a position where the groove has the maximum width in the tire radial direction, and is a width of each groove at the tread surface8ain the present embodiment.", "", "For example, the second portion22includes a second constant-width portion22aextending with the same groove width in the longitudinal direction, and a second increased-width portion22bwhich is connected to the second constant-width portion22aand which extends to the shoulder inner-side vertex4awith a continuously increased groove width. In the present embodiment, one end of the second increased-width portion22bin the tire circumferential direction is connected to the shoulder inner-side vertex4a. More specifically, one edge22eof the second increased-width portion22band an edge17eof the first shoulder groove portion17extend so as to form one straight line.", "", "Each of an angle α5of the first portion21relative to the tire axial direction and an angle α6of the second portion22relative to the tire axial direction is, but is not particularly limited to, preferably 10 to 30°. Each of an angle α7between the first portion21and the third portion23and an angle α8between the second portion22and the third portion23is preferably 90 to 140°.", "", "The groove width W2of the crown lateral groove5is less than the groove width W1bof the shoulder circumferential groove4. The groove width W2of the crown lateral groove5is preferably 60% to 90% of the groove width W1bof the shoulder circumferential groove4. A groove depth D2(shown inFIG.3) of the crown lateral groove5is less than the groove depth D1bof the shoulder circumferential groove4. The groove depth D2of the crown lateral groove5is preferably 45% to 75% of the groove depth D1bof the shoulder circumferential groove4. In the present specification, the groove width W2of the crown lateral groove5is a groove width at the first constant-width portion21aor the second constant-width portion22a.", "", "As shown inFIG.2, in each of the plurality of crown blocks8, a ratio (Lc/Wc) of the maximum length Lc in the tire circumferential direction to the maximum length Wc in the tire axial direction is preferably 1.8 or more and more preferably 1.9 or more, and preferably 2.2 or less and more preferably 2.1 or less. Since the ratio (Lc/Wc) is 1.8 or more, block stiffness of the crown block8in the tire circumferential direction can be enhanced, and high uneven wear resistance can be exhibited. Since the ratio (Lc/Wc) is 2.2 or less, the number of the crown lateral grooves5is maintained and wet traction performance is enhanced.", "", "In order to effectively exhibit the above-described effect, the maximum length Wc of the crown block8is preferably 18% of the tread width TW or more and more preferably 20% thereof or more, and preferably 32% thereof or less and more preferably 30% thereof or less. The number of the crown blocks8arranged in the tire circumferential direction is preferably 23 to 33.", "", "FIG.5is an enlarged plan view of the tread portion2. As shown inFIG.5, each of the at least two transverse grooves11includes a plurality of zigzag vertexes11tand thus zigzags. The transverse groove11having such a structure has a great edge component, and highly exhibits an effect of scraping and removing a water film.", "", "Each of the at least two transverse grooves11includes a first element25, a second element26, and a third element27between the first element25and the second element26. For example, the first element25is connected to the crown circumferential groove3or one of the shoulder circumferential grooves4, and extends such that an angle α11thereof relative to the tire axial direction is less than 20°. For example, the second element26is inclined relative to the tire axial direction at an angle α12greater than the angle of the first element25. For example, the third element27extends at an angle α13greater than the angle of the second element26relative to the tire axial direction. Thus, the first element25, the second element26, and the third element27are inclined at different angles, so that the transverse groove11has a great edge component, and exhibits an edge effect in multiple directions.", "", "In order to effectively exhibit the above-described effect, in the present embodiment, the first element25extends parallel to the tire axial direction (angle α11=0°). The angle α12of the second element26is preferably 20° or more and more preferably 25° or more, and preferably 40° or less and more preferably 35° or less.", "", "Each of an angle α16between the first element25and the third element27, and an angle α17between the second element26and the third element27is preferably 80° or more and more preferably 85° or more, and preferably 120° or less and more preferably 115° or less. Since the angle α16and the angle α17are each 80° or more, stiffness is maintained high at a portion of the crown block8between the first element25and the third element27, and a portion of the crown block8between the second element26and the third element27. Since the angle α16and the angle α17are each 120° or less, the edge effect can be exhibited for running in different directions.", "", "In the present embodiment, the first element25, the second element26, and the third element27extend linearly. For example, the first element25, the second element26, and the third element27may extend so as to form arc-like shapes.", "", "In the present embodiment, the first element25communicates with the crown second-side vertex3bor the shoulder outer-side vertex4b. The first element25having such a structure allows reduction of a difference in block stiffness between the crown blocks8on both sides, in the tire circumferential direction, of the crown second-side vertex3bor the shoulder outer-side vertex4bacross the first element25, whereby occurrence of uneven wear is inhibited. In the present embodiment, each of the second elements26is not connected to any vertex, and is connected to the first crown groove portion15or the first shoulder groove portion17. The second element26having such a structure inhibits reduction of block stiffness at a portion of the crown block8, adjacent to the crown first-side vertex3a, at which stress is concentrated, and at a portion of the crown block8, adjacent to the shoulder inner-side vertex4a, at which stress is concentrated.", "", "In the present embodiment, each transverse groove11includes a first transverse groove11A in which the first element25is connected to the crown circumferential groove3, and a second transverse groove11B in which the first element25is connected to the shoulder circumferential groove4. In the present embodiment, the first element25of the first transverse groove11A is connected to the crown second-side vertex3b. In the present embodiment, the first element25of the second transverse groove11B is connected to the shoulder outer-side vertex4b.", "", "In the present embodiment, the second element26of the first transverse groove11A is inclined relative to the tire axial direction in the same direction as the second element26of the second transverse groove11B. Thus, reduction of block stiffness of the crown block8is inhibited, and uneven wear resistance is maintained high. For example, the second element26of the first transverse groove11A extends parallel to the second element26of the second transverse groove11B. The “parallel” means that an absolute value1α12a-α12b1of a difference between the angle α12aof the second element26of the first transverse groove11A relative to the tire axial direction and the angle α12bof the second element26of the second transverse groove11B relative to the tire axial direction is 0°, and further means that the absolute value1α12a-α12blis 10° or less.", "", "In order to effectively exhibit the above-described effect, in the present embodiment, the third element27of the first transverse groove11A is preferably inclined relative to the tire axial direction in the same direction as the third element27of the second transverse groove11B. For example, the third element27of the first transverse groove11A is preferably parallel to the third element27of the second transverse groove11B.", "", "The plurality of crown sub-grooves10each include a connecting groove12for connecting a plurality of the transverse grooves11. The connecting groove12having such a structure allows an edge component to be increased and allows wet traction performance to be further enhanced. In the present embodiment, the connecting groove12extends linearly.", "", "For example, the connecting groove12connects between the zigzag vertexes11tand11tof the respective transverse grooves11. In the present embodiment, the connecting groove12connects between the vertex11tconnecting to the first element25of the first transverse groove11A and the vertex11tconnecting to the first element25of the second transverse groove11B.", "", "For example, the connecting groove12extends parallel to the second crown groove portion16and the second shoulder groove portion18. The connecting groove12having such a structure inhibits great reduction of block stiffness of the crown block8, and allows uneven wear resistance to be maintained high.", "", "The maximum groove width W3(shown inFIG.1) of each crown sub-groove10is preferably 0.25 times the maximum groove width W2of each crown lateral groove5or more and more preferably 0.30 times the maximum groove width W2or more, and preferably 0.50 times the maximum groove width W2or less and more preferably 0.45 times the maximum groove width W2or less. Since the groove width W3of the crown sub-groove10is 0.25 times the groove width W2of the crown lateral groove5or more, wet traction performance can be enhanced. Since the groove width W3of the crown sub-groove10is 0.50 times the groove width W2of the crown lateral groove5or less, block stiffness of the crown block8can be maintained high.", "", "For example, a groove width W3aof the transverse groove11is equal to a groove width W3bof the connecting groove12. In the present embodiment, a groove depth D3aof the transverse groove11is equal to a groove depth D3b(shown inFIG.3) of the connecting groove12.", "", "As shown inFIG.3, the maximum groove depth D3of the plurality of crown sub-grooves10is preferably less than the maximum groove depth D2of the plurality of the crown lateral grooves5. The crown sub-groove10having such a structure enhances wet traction performance of, in particular, a new tire. The maximum groove depth D3of each crown sub-groove10is preferably 0.1 times the maximum groove depth D2of each crown lateral groove5or more and more preferably 0.2 times the maximum groove depth D2or more, and preferably 0.4 times the maximum groove depth D2or less and more preferably 0.3 times the maximum groove depth D2or less. Since the groove depth D3of the crown sub-groove10is 0.1 times the groove depth D2of the crown lateral groove5or more, wet traction performance can be enhanced. Since the groove depth D3of the crown sub-groove10is 0.5 times the groove depth D2of the crown lateral groove5or less, block stiffness of the crown block8can be maintained high.", "", "As shown inFIG.2, the tread portion2of the present embodiment includes a pair of shoulder land portions9each disposed between the shoulder circumferential groove4and the tread end Te. In the present embodiment, each shoulder land portion9has a plurality of shoulder lateral grooves30that extends inwardly from the tread end Te in the tire axial direction, and terminates in the shoulder land portion9.", "", "For example, the shoulder lateral grooves30are disposed at intervals of one pitch P of the zigzag of the shoulder circumferential groove4. In the present embodiment, a length Lb of the shoulder lateral groove30in the tire axial direction is 30% to 50% of the maximum width Ws of the shoulder land portion9in the tire axial direction.", "", "Although one embodiment of the present disclosure has been described above in detail, the present disclosure is not limited to the above-described specific embodiment, and various modifications can be made to implement the technique of the present disclosure."], "claims": ["a tread portion, wherein the tread portion comprises a crown circumferential groove continuously extending on a tire equator side in a tire circumferential direction, a shoulder circumferential groove continuously extending in the tire circumferential direction on a side outward of the crown circumferential groove in a tire axial direction, a plurality of crown lateral grooves connecting between the crown circumferential groove and the shoulder circumferential groove, and a plurality of crown blocks formed by the crown circumferential groove, the shoulder circumferential groove, and the plurality of crown lateral grooves, wherein the crown circumferential groove comprises crown first-side vertexes protruding toward the shoulder circumferential groove, and crown second-side vertexes protruding in a direction opposite to that of the crown first-side vertexes, alternately in the tire circumferential direction, and zigzags, wherein the shoulder circumferential groove comprises shoulder inner-side vertexes protruding toward the crown circumferential groove, and shoulder outer-side vertexes protruding in a direction opposite to that of the shoulder inner-side vertexes, alternately in the tire circumferential direction, and zigzags, wherein the plurality of crown lateral grooves that are directly adjacent to each other in the tire circumferential direction are disposed at two pitch intervals of a zigzag of the crown circumferential groove and connect between the crown first-side vertexes and the shoulder inner-side vertexes, wherein the plurality of crown blocks has a plurality of crown sub-grooves each having a groove width less than a groove width of each of the plurality of crown lateral grooves, and wherein the plurality of crown sub-grooves each comprise at least two transverse grooves extending across the crown blocks.", "2 . The heavy duty pneumatic tire according to claim 1 , wherein each of the at least two transverse grooves comprises a plurality of zigzag vertexes and zigzags.", "wherein each of the at least two transverse grooves comprises a first element, a second element, and a third element between the first element and the second element, wherein the first element is connected to the crown circumferential groove or one of the shoulder circumferential grooves, and extends such that an angle of the first element relative to the tire axial direction is less than 20°, and wherein the second element is inclined relative to the tire axial direction at an angle greater than that of the first element.", "wherein the first element extends parallel to the tire axial direction, and wherein the angle of the second element relative to the tire axial direction is 20 to 40°.", "5 . The heavy duty pneumatic tire according to claim 3 , wherein an angle between the first element and the third element, and an angle between the second element and the third element are each 80 to 120°.", "6 . The heavy duty pneumatic tire according to claim 3 , wherein the first element communicates with the crown second-side vertex or the shoulder outer-side vertex.", "7 . The heavy duty pneumatic tire according to claim 3 , wherein each of the transverse grooves comprises a first transverse groove in which the first element is connected to the crown circumferential groove, and a second transverse groove in which the first element is connected to the shoulder circumferential groove.", "8 . The heavy duty pneumatic tire according to claim 7 , wherein the second element of the first transverse groove is inclined relative to the tire axial direction in a same direction as the second element of the second transverse groove.", "9 . The heavy duty pneumatic tire according to claim 1 , wherein the plurality of crown sub-grooves comprises connecting grooves for connecting the plurality of transverse grooves.", "10 . The heavy duty pneumatic tire according to claim 1 , wherein a maximum groove width of each of the plurality of crown sub-grooves is 0.25 to 0.50 times a maximum groove width of each of the plurality of crown lateral grooves.", "11 . The heavy duty pneumatic tire according to claim 1 , wherein a maximum groove depth of each of the plurality of crown sub-grooves is 0.1 to 0.4 times a maximum groove depth of each of the plurality of crown lateral grooves.", "12 . The heavy duty pneumatic tire according to claim 1 , wherein, in each of the plurality of crown blocks, a ratio (Lc/Wc) of a maximum length Lc in the tire circumferential direction to a maximum length We in the tire axial direction is 1.8 to 2.2.", "a tread portion, wherein the tread portion comprises a crown circumferential groove continuously extending on a tire equator side in a tire circumferential direction, a shoulder circumferential groove continuously extending in the tire circumferential direction on a side outward of the crown circumferential groove in a tire axial direction, a plurality of crown lateral grooves connecting between the crown circumferential groove and the shoulder circumferential groove, and a plurality of crown blocks formed by the crown circumferential groove, the shoulder circumferential groove, and the plurality of crown lateral grooves, wherein the crown circumferential groove comprises crown first-side vertexes protruding toward the shoulder circumferential groove, and crown second-side vertexes protruding in a direction opposite to that of the crown first-side vertexes, alternately in the tire circumferential direction, and zigzags, wherein the shoulder circumferential groove comprises shoulder inner-side vertexes protruding toward the crown circumferential groove, and shoulder outer-side vertexes protruding in a direction opposite to that of the shoulder inner-side vertexes, alternately in the tire circumferential direction, and zigzags, wherein the plurality of crown lateral grooves that are directly adjacent to each other in the tire circumferential direction are disposed at two pitch intervals of a zigzag of the crown circumferential groove and connect between the crown first-side vertexes and the shoulder inner-side vertexes, wherein the plurality of crown blocks has a plurality of crown sub-grooves each having a groove width less than a groove width of each of the plurality of crown lateral grooves, wherein the plurality of crown sub-grooves each comprise at least two transverse grooves extending across the crown blocks, wherein each of the at least two transverse grooves comprises a plurality of zigzag vertexes and zigzags, wherein the plurality of crown sub-grooves comprises connecting grooves for connecting the plurality of transverse grooves, and wherein, in each of the plurality of crown blocks, a ratio (Lc/Wc) of a maximum length Lc in the tire circumferential direction to a maximum length We in the tire axial direction is 1.8 to 2.2.", "14 . The heavy duty pneumatic tire according to claim 13 , wherein the connecting grooves are configured to connect the at least two transverse grooves at one of the plurality of zigzag vertexes of each of the at least two transverse grooves.", "15 . The heavy duty pneumatic tire according to claim 14 , wherein only the plurality of crown sub-grooves are provided in each of the plurality of crown blocks.", "16 . The heavy duty pneumatic tire according to claim 3 , wherein the first element, the second element and the third element are each inclined at different angles relative to the tire axial direction.", "wherein the crown circumferential groove includes a plurality of first crown groove portions inclined in a same direction relative to the tire circumferential direction, and a plurality of second crown groove portions inclined in a direction opposite to the direction of the plurality of first crown groove portions relative to the tire circumferential direction, wherein the shoulder circumferential groove includes a plurality of first shoulder groove portions inclined in a same direction relative to the tire circumferential direction, and a plurality of second shoulder groove portions inclined in a direction opposite to the direction of the plurality of first shoulder groove portions relative to the tire circumferential direction, and wherein the connecting groove extends parallel to the plurality of second crown groove portions and the plurality of second shoulder groove portions.", "18 . The heavy duty pneumatic tire according to claim 1 , wherein one pitch of a zigzag of the crown circumferential groove is the same as one pitch of a zigzag of the shoulder groove.", "19 . The heavy duty pneumatic tire according to claim 13 , wherein a depth of the connecting grooves is equal to a depth of the plurality of transverse grooves.", "20 . The heavy duty pneumatic tire according to claim 17 , wherein an angle of the first crown groove portion relative to the tire axial direction, an angle of the second crown groove portion relative to the tire axial direction, an angle of the first shoulder groove portion relative to the tire axial direction, and an angle of the second shoulder groove portion relative to the tire axial direction are each 10° to 30°."], "bibtex": "@patent{20240131870,\n    title = {HEAVY DUTY PNEUMATIC TIRE},\n    number = {20240131870},\n    year = {2024},\n    note = {File: US20240131870A1-20240425.XML}\n    }", "classification": "B60C1103FI"}]