[{"title": "Cycle Hub Assembly", "doc_number": "20240308267", "filename": "US20240308267A1-20240919.XML", "abstract": "The invention relates to a cycle hub assembly and a method of producing such cycle hub assembly. The cycle hub assembly includes a wheel hub and a plurality of spoke mounting elements. The spoke mounting elements are present in two axially spaced rows positioned around the circumference of the wheel hub. Each spoke mounting element includes at least one spoke mounting hole for receiving at least part of at least one spoke. At least two adjacent spoke mounting elements are interconnected in an efficient manner such that an optimal design of the cycle hub assembly is obtained.", "detailed_description": [""], "claims": ["a wheel hub; and a plurality of spoke mounting elements; wherein the spoke mounting elements are present in two axially spaced rows positioned around the circumference of the wheel hub, wherein each spoke mounting element comprises at least one spoke mounting hole for receiving at least part of at least one spoke, and wherein at least two adjacent spoke mounting elements are interconnected via at least one bridge piece, wherein at least part of said bridge piece has a width which is smaller than a width of at least one spoke mounting element connected with said bridge piece.", "2 . The cycle hub assembly according to claim 1 , comprising a plurality of bridge pieces, wherein the spoke mounting elements of each row are interconnected via bridge pieces which at least partially have a width which is smaller than the width of at least one spoke mounting element connected with said bridge piece.", "3 . The cycle hub assembly according to claim 1 , wherein multiple spoke mounting elements are interconnected via the same bridge piece.", "4 . The cycle hub assembly according to claim 1 , wherein at least one spoke mounting element is supported by at least one bridge piece.", "5 . The cycle hub assembly according to claim 1 , wherein at least part of the spoke mounting elements and bridge pieces are integrally connected.", "6 . The cycle hub assembly according to claim 1 , wherein all spoke mounting elements and all bridges pieces of at least one row, are integrally connected.", "7 . The cycle hub assembly according to claim 1 , wherein at least part of the spoke mounting elements and/or at least part of the bridges pieces of at least one row are integrally connected with the wheel hub.", "8 . The cycle hub assembly according to claim 1 , wherein the spoke mounting elements, the bridges pieces and the wheel hub are made of a single piece.", "9 . The cycle hub assembly according to claim 1 , wherein at least part of the spoke mounting elements and/or at least part of the bridges pieces are manufactured via 3D printing and/or wherein at least part of the wheel hub is manufactured via 3D printing.", "10 . (canceled)", "11 . The cycle hub assembly according to claim 1 , wherein at least part of the spoke mounting elements and/or at least part of the bridges pieces are at least partially made of an alloy or an alloy comprising aluminium, magnesium, and/or scandium.", "12 . The cycle hub assembly according to claim 1 , wherein the wheel hub is at least partially made of an alloy or an alloy comprising aluminium, magnesium, and/or scandium and/or wherein at least part of the spoke mounting elements and/or at least part of the bridges pieces are at least partially made of a polymer material.", "13 . (canceled)", "14 . The cycle hub assembly according to claim 1 , wherein at least part of the centre line of at least one spoke mounting hole extends in a direction substantially perpendicular to the axial direction of the wheel hub and/or, wherein at least part of the centre line of at least one spoke mounting hole extends in a direction substantially parallel to the radial direction of the wheel hub.", "15 . (canceled)", "16 . The cycle hub assembly according to claim 1 , wherein the configuration of at least part of the bridge pieces, is designed via topology optimization.", "17 . The cycle hub assembly according to claim 1 , wherein at least one bridge piece is positioned at a distance above the wheel hub and/or, wherein at least part of the bridge pieces are substantially identical.", "18 . (canceled)", "19 . The cycle hub assembly according to claim 1 , wherein at least one spoke mounting element is at least partially bowl shaped, and/or wherein at least one row comprises N spoke mounting elements and wherein at least one row, = comprises a plurality of bridge pieces, wherein the number of bridge pieces is at least 0.5 N.", "20 . (canceled)", "21 . The cycle hub assembly according to claim 1 , wherein at least one spoke mounting element comprises at least two spoke mounting holes, wherein each spoke mounting hole is configured for receiving at least part of at least one spoke.", "22 . The cycle hub assembly according to claim 17 , wherein at least one spoke mounting element comprises at least two receiving spaces which are oriented in opposite directions, wherein each receiving space is provided with at least one spoke mounting hole.", "23 . A ring shaped spoke mounting body for use in a cycle hub assembly according to claim 1 , wherein at least two adjacent spoke mounting elements are interconnected via at least one bridge piece, wherein at least part of said bridge piece has a width which is smaller than a width of at least one spoke mounting element connected with said bridge piece.", "providing a wheel hub; and providing a plurality of spoke mounting elements; wherein the spoke mounting elements are present in two axially spaced rows positioned around the circumference of the wheel hub, wherein each spoke mounting element comprises at least one spoke mounting hole for receiving at least part of at least one spoke, and wherein at least two adjacent spoke mounting elements are interconnected via at least one bridge piece, wherein at least part of said bridge piece has a width which is smaller than a width of at least one spoke mounting element connected with said bridge piece.", "25 . The method according to claim 19 , wherein at least part of the spoke mounting elements and/or at least part of the bridges pieces are manufactured via 3D printing and/or, wherein at least part of the wheel hub is manufactured via 3D printing.", "26 . (canceled)"], "bibtex": "@patent{20240308267,\n    title = {Cycle Hub Assembly},\n    number = {20240308267},\n    year = {2024},\n    note = {File: US20240308267A1-20240919.XML}\n    }", "classification": "B60B104FI"}, {"title": "WHEEL ASSEMBLY", "doc_number": "20240308268", "filename": "US20240308268A1-20240919.XML", "abstract": "Disclosed is a wheel assembly including a main rotation part that is to be rotated about a first rotation axis, a power transmitting part that receives power from the main rotation part, and a variable rotation part that receives a rotational force from the power transmitting part to be rotated about a second rotation axis when the main rotation part is rotated, and to be moved relative to the main rotation part such that the first rotation axis and the second rotation axis overlap each other or are spaced apart from each other.", "detailed_description": ["Hereinafter, some implementations of the present disclosure will be described in detail with reference to the exemplary drawings. Throughout the specification, it is noted that the same or like reference numerals denote the same or like components even though they are provided in different drawings. Further, in the following description of the present disclosure, a detailed description of known functions and configurations incorporated herein will be omitted when it may make the subject matter of the present disclosure rather unclear.", "", "Hereinafter, a moving body1according to an implementation of the present disclosure will be described with reference to the drawings.", "", "Referring toFIG.1, the moving body1according to the present disclosure may travel on a ground surface. A posture of the moving body1may be changed according to a state of a ground surface, and the moving body1may effectively pass on a ground surface, such as stairs, which has a step. Furthermore, the moving body1may implement a motion that simulates a walk of a person. The moving body1may include a wheel assembly10, a frame20, and a controller30.", "", "Referring further toFIGS.2to10, the wheel assembly10may travel toward a targeted location together with the frame20while being supported by the frame20. A plurality of wheel assemblies10may be provided. The plurality of wheel assemblies10may be disposed on opposite sides of the frame20, respectively. For example, the plurality of wheel assemblies10may be disposed to face each other. The wheel assembly10may include a rotation part100, a spoke200, a power transmitting part300, and a driving part400.", "", "Referring back toFIG.3, the rotation part100may be rotated with respect to the frame20. Furthermore, the rotation part100may transmit power to the spoke200. The rotation part100may include a main rotation part110and a variable rotation part120.", "", "The main rotation part110may be rotated about a first rotation axis X1. A relative location of the first rotation axis X1to the frame20may be fixed. The first rotation axis X1may be defined as an imaginary line that passes through a center of the main rotation part110and extends along an axial direction thereof. The axial direction may be defined as a direction that is perpendicular to a travel direction “D” and an upward/downward direction. The travel direction “D” may be defined as a direction, in which the moving body1is moved with respect to the ground surface. The main rotation part110may include a main rotation body111and a rotation support part112.", "", "Referring back toFIG.4, the main rotation body111may define an external appearance of the main rotation part110. A hollow may be formed in the main rotation body111. For example, the main rotation body111may have a ring shape that has a hole at a center thereof.", "", "The rotation support part112may be connected to a periphery of the main rotation body111to be rotatable. For example, the rotation support part112may be rotated with respect to the main rotation body111, about a rotation axis that passes a periphery of the main rotation body111and extends in an axial direction thereof. The rotation support part112may support the spoke200. The rotation support part112may be connected to an outside of the main rotation body111. An outward direction may be defined as a direction, in which the frame20faces the main rotation part110, and an inward direction may be defined as an opposite direction to the outward direction. A guide hole112amay be formed in the rotation support part112.", "", "Referring back toFIG.4, the guide hole112amay be a through-hole that is formed at a central portion of the rotation support part112in a direction that is perpendicular to an axial direction thereof. The spoke200may be inserted into the guide hole112a. The guide hole112amay guide movement of the spoke200. For example, the guide hole112amay guide translation of the spoke200with respect to the rotation support part112. In other words, the spoke200may be slid with respect to the rotation support part112along the guide hole112a.", "", "Referring back toFIG.1, a plurality of rotation support parts112may be provided. The plurality of rotation support parts112may be arranged to be spaced apart from each other along rotational directions C1and C2. The rotational directions C1and C2may be defined as directions, in which the main rotation part110is rotated about the first rotation axis X1. The rotational directions C1and C2may be understood as a concept including the forward rotational direction C1and the reverse rotational direction C2. The forward rotational direction C1may be defined as a direction, in which the main rotation part110is rotated when the moving body1travels in the travel direction “D”. The reverse rotational direction C2may be defined as an opposite direction to the forward rotational direction.", "", "Furthermore, the plurality of rotation support parts112may include a first rotation support part and a second rotation support part. The first rotation support part and the second rotation support part may be defined as, among the plurality of rotation support parts112, adjacent arbitrary two rotation support parts112.", "", "Referring back toFIGS.9and10, when the variable rotation part120is moved relatively to the main rotation part110toward a side area, the first rotation support part and the second rotation support part may be rotated with respect to the main rotation body111such that an angle defined by a first line and a second line becomes larger. The first line may be defined as an imaginary line that passes through a center of the first rotation support part and extends along the guide hole of the first rotation support part. The second line may be defined as an imaginary line that passes through a center of the second rotation support part and extends along the guide hole of the second rotation support part. Furthermore, the side area may be defined as an area of a periphery of the main rotation body111, which is formed between the first rotation support part and the second rotation support part. For example, the side area may be defined as an area that is disposed between the first rotation support part and the second rotation support part when the wheel assembly10is viewed along an axial direction thereof.", "", "The variable rotation part120may be rotated about a second rotation axis X2. The second rotation axis X2, for example, may be defined as an imaginary line that passes through a center of the variable rotation part120and extends in parallel to an axial direction thereof. In other words, the second rotation axis X2may be parallel to the first rotation axis X1. Furthermore, a variable angular velocity that is an angular velocity of the variable rotation part120may be the same as a main angular velocity that is an angular velocity of the main rotation part110. A relationship between the variable angular velocity and the main angular velocity will be described in more detail in a description of the power transmitting part300, which will be described below.", "", "Furthermore, the variable rotation part120may be moved relatively to the main rotation part110in a relative movement direction that is a direction that is different from the axial direction. The relative movement direction, as an example, may be a direction that is perpendicular to the axial direction. The variable rotation part120may be moved relatively to the main rotation part110such that the second rotation axis X2and the first rotation axis X1overlap each other or are spaced apart from each other. The variable rotation part120may be moved relatively to the main rotation part110on the movement allowable area that crosses the first rotation axis X1.", "", "The movement allowable area may be defined as an area that may pass through a center of the variable rotation part120when the variable rotation part120is moved relatively to the main rotation part110. The movement allowable area may be surrounded by an imaginary circle, a center of which is a point, at which the movement allowable area and the first rotation axis X1cross each other and a radius of which is a sum of a first driving distance and a second driving distance, which will be described below. The first driving distance may be defined as a spacing distance of a fixed center of rotation X3and a variable center of rotation X4, which will be described below. Furthermore, the second driving distance may be defined as a spacing distance between the second rotation axis X2and the variable center of rotation X4. Furthermore, a sum of the first driving distance and the second driving distance may be smaller than a spacing distance between a center of the main rotation body111and the rotation support part112. In this way, because the sum of the first driving distance and the second driving distance is smaller than the spacing distance between the center of the main rotation body111and the rotation support part112, interferences between the variable rotation part120and the rotation support part112may be prevented.", "", "Furthermore, the variable rotation part120may be disposed on an outer side of the main rotation part110. The variable rotation part120may cross an imaginary plane that passes through a center of the rotation support part112and is perpendicular to an axial direction thereof.", "", "Referring toFIGS.2and3, the spoke200may provide a ground surface repulsive force to the moving body1. The moving body1may travel on the ground surface through the ground surface repulsive force received from the spoke200. An outer end201of the spoke may contact the ground surface. The outer end201of the spoke, as an example, may have a ball shape. Furthermore, the outer end201of the spoke may be formed of a material (for example, a rubber material) that is prevented from being slid on the ground surface. Furthermore, an inner end202of the spoke may be connected to a periphery of the variable rotation part120to be rotatable.", "", "Referring back toFIG.10, the spoke200may be translated along the guide hole112awhen the variable rotation part120is moved relatively to the main rotation part110. For example, when the variable rotation part120is moved relatively to the main rotation part110to become closer to the rotation support part112, the outer end201of the spoke may be translated to become farther from the rotation support part112. In other words, when the variable rotation part120is moved relatively to the main rotation part110to become closer to the rotation support part112, a spacing distance between the outer end201of the spoke and the rotation support part112may become larger.", "", "Furthermore, when the variable rotation part120is moved relatively to the main rotation part110to become farther from the rotation support part112, the outer end201of the spoke may be translated to become closer to the rotation support part112. In other words, when the variable rotation part120is moved relatively to the main rotation part110to become farther from the rotation support part112, a spacing distance between the outer end201of the spoke and the rotation support part112may become smaller.", "", "A plurality of spokes200may be provided. The plurality of spokes200may correspond to the plurality of rotation support parts112, respectively. For example, when “n” rotation support part112(n>2) are provided, “n” spokes200may be provided to be inserted into the guide holes112aof the “n” rotation support parts112, respectively. The plurality of spokes200may be connected to a periphery of the variable rotation part120to be rotatable. For example, the plurality of spokes200may be arranged to be spaced apart from each other along a circumferential direction of the variable rotation part120. The circumferential direction of the variable rotation part120may be defined as a direction, in which the variable rotation part120is rotated about the second rotation axis X2.", "", "The plurality of spokes200may be laid in any one of a first posture and a second posture. Referring back toFIG.9, the first posture may be defined as postures of the plurality of spokes200in a state, in which the first rotation axis X1and the second rotation axis X2overlap each other. Furthermore, referring back toFIG.10, the second posture may be defined as postures of the plurality of spokes200in a state, in which the first rotation axis X1and the second rotation axis X2are spaced apart from each other.", "", "Furthermore, referring back toFIG.10, when the first rotation support part and the second rotation support part are rotated with respect to the main rotation body111such that an angle defined by the first line and the second line becomes larger, an outer end of a first spoke and an outer end of a second spoke may become farther away from each other. The first spoke may be, among the plurality of spokes200, the spoke200corresponding to the first rotation support part. Furthermore, the second spoke may be, among the plurality of spokes200, the spoke200corresponding to the second rotation support part.", "", "Referring back toFIGS.5to8, the power transmitting part300may receive power from the main rotation part110. The power transmitting part300may transmit the power received from the main rotation part110to the variable rotation part120. Furthermore, the main rotation part110, the variable rotation part120, and the power transmitting part300may be connected to each other, as an example, through a Schmidt coupling scheme. For example, when the main rotation part110is rotated at a main angular velocity, the power transmitting part300may receive a rotational force from the main rotation part110, and may be rotated at the same angular velocity as the main angular velocity. When the power transmitting part300is rotated, the variable rotation part120may receive a rotational force from the power transmitting part300, and may be rotated at the same angular velocity as a rotational angular velocity of the power transmitting part300. In other words, the rotational angular velocity and the variable angular velocity of the power transmitting part300may be the same. The power transmitting part300may include a medium rotation part310and a link part320.", "", "Referring back toFIG.8, the medium rotation part310may receive the power from the main rotation part110, and may be rotated about a medium rotation axis that passes through a center of the medium rotation part310and extends in parallel to an axial direction thereof. The medium rotation part310may include a first medium rotation part311, a second medium rotation part312, and a medium rotation body313.", "", "The first medium rotation part311may receive the power from a first link part321that will be described below to be rotated when the main rotation part110is rotated. The first medium rotation part311may transmit the power to the medium rotation body313. The first medium rotation part311may be disposed on an inner side of the main rotation part110.", "", "The second medium rotation part312may receive the power from the medium rotation body313to be rotated when the medium rotation body313is rotated. The second medium rotation part312may transmit the power to the second link part322that will be described below. The second medium rotation part312may be disposed on an outer side of the main rotation part110. For example, the main rotation part110may be disposed between the first medium rotation part311and the second medium rotation part312. As a detailed example, the first medium rotation part311, the main rotation part110, and the second medium rotation part312may be sequentially disposed along an outward direction.", "", "The medium rotation body313may extend along an axial direction thereof, between the first medium rotation part311and the second medium rotation part312. For example, an inner end of the medium rotation body313may be connected to the first medium rotation part311, and an outer end of the medium rotation body313may be connected to the second medium rotation part312. The medium rotation body313may be disposed in a hollow of the main rotation body111. For example, the medium rotation body313may be disposed to pass through the hollow of the main rotation body111.", "", "The link part320may include the first link part321and the second link part322. The first link part321may transmit the power of the main rotation part110to the first medium rotation part311. One end of the first link part321may be connected to an inner surface of the main rotation body111to be rotatable. Furthermore, an opposite end of the first link part321may be connected to an outer surface of the first medium rotation part311to be rotatable. A plurality of first link parts321may be provided.", "", "Spacing distances of opposite ends of the plurality of first link parts321may be the same. Ends of the plurality of first link parts321may be disposed to be symmetrical to each other with respect to a center of the main rotation body111. Furthermore, opposite ends of the plurality of first link parts321may be disposed to be symmetrical to each other with respect to the center of the first medium rotation part311.", "", "The second link part322may transmit the power of the second medium rotation part312to the variable rotation part120. One end of the second link part322may be connected to an inner surface of the variable rotation part120to be rotatable. Furthermore, an opposite end of the second link part322may be connected to an outer surface of the second medium rotation part312to be rotatable. A plurality of second link parts322may be provided.", "", "Spacing distances of opposite ends of the plurality of second link parts322may be the same. Ends of the plurality of second link parts322may be disposed to be symmetrical to each other with respect to a center of the variable rotation part120. Furthermore, opposite ends of the plurality of second link parts322may be disposed to be symmetrical to each other with respect to the center of the second medium rotation part312.", "", "Referring toFIGS.6and8, the driving part400may provide the power to the rotation part100. The driving part400may include a first driving part410and a second driving part420. The first driving part410may provide the power to the main rotation part110. The first driving part410may include a main rotary motor411, a driving pulley412, a driven pulley413, and a driving belt414.", "", "The main rotary motor411may rotate the driving pulley412about a pulley rotation axis XP. The pulley rotation axis XP may be defined as an imaginary line that passes a center of the driving pulley412and extends in an axial direction thereof. The pulley rotation axis XP may be spaced apart from the movement allowable area. For example, the pulley rotation axis XP may be disposed on an upper side of the movement allowable area. The main rotary motor411may be supported by the frame20such that a relative location thereof to the frame20is fixed.", "", "The driving pulley412may be rotated about the pulley rotation axis XP. The driving pulley412may provide the power to the driving belt414. The driving pulley412, as an example, may have a disk shape having a hollow.", "", "The driven pulley413may receive the power from the driving belt414to be rotated about the first rotation axis X1. The driven pulley413may be connected to the main rotation part110. For example, the driven pulley413may be connected to an inner surface of the main rotation body111. The driven pulley413may provide the power to the main rotation body111. For example, the driven pulley413and the main rotation body111may be rotated together about the first rotation axis X1. The driven pulley413, as an example, may have a disk shape having a hollow. For example, the driven pulley413may have a disk shape having a hollow, a radius of which is larger than the driving pulley412.", "", "The driving belt414may receive the power from the driving pulley412. The driving belt414may transmit the power received from the driving pulley412to the driven pulley413. The driving belt414may be disposed to surround the driving pulley412and the driven pulley413.", "", "The second driving part420may move the variable rotation part120relatively to the main rotation part110. Furthermore, the first driving part410and the second driving part420may be driven independently. The second driving part420may include a fixed driving part421and a variable driving part422.", "", "The fixed driving part421may be supported by the frame such that a relative location thereof to the frame20is fixed. The fixed driving part421may be disposed on an inner side of the rotation part100. The fixed driving part421may include a fixed motor421-1and a fixed driving arm421-2.", "", "The fixed motor421-1may provide power to the fixed driving arm421-2. The fixed motor421-1may provide the fixed center of rotation X3. The fixed center of rotation X3may be defined as an imaginary line that passes through the fixed driving arm421-2and extends in an axial direction thereof.", "", "A relative location of the fixed center of rotation X3to the first rotation axis X1may be fixed. For example, the fixed center of rotation X3may overlap the first rotation axis X1. Furthermore, the fixed center of rotation X3and the second rotation axis X2may be laid in any one of an overlapping state, in which they overlap each other, and a spacing state, in which they are spaced apart from each other.", "", "Furthermore, the first rotation axis X1, the second rotation axis X2, and the fixed center of rotation X3may overlap each other to be laid in a 3 axis overlapping state that defines one imaginary line. In other words, in the 3 axis overlapping state, the first rotation axis X1, the second rotation axis X2, and the fixed center of rotation X3may be the same one axis. In this way, as the wheel assembly10is laid in the 3 axis overlapping state, a range of the movement allowable area may be maximized.", "", "Furthermore, when the first rotation axis X1, the second rotation axis X2, and the fixed center of rotation X3deviates from the 3 axis overlapping state, any one of the first rotation axis X1, the second rotation axis X2, and the fixed center of rotation X3may be spaced apart from the others. The fixed motor421-1may rotate one end of the fixed driving arm421-2about the fixed center of rotation X3. Furthermore, the fixed motor421-1may be connected to the fixed driving arm421-2. For example, an outer end of the fixed motor421-1may be connected to an opposite end to the one end of the fixed driving arm421-2. An inner end of the fixed motor421-1may be fixed to the frame20.", "", "One end of the fixed driving arm421-2may be rotated about the fixed center of rotation X3. The one end of the fixed driving arm421-2may be connected to the variable driving part422. For example, the one end of the fixed driving arm421-2may be rotated about the fixed center of rotation X3together with the variable driving part422. The opposite end of the fixed driving arm421-2may be connected to the fixed motor421-1. Furthermore, the fixed center of rotation X3may cross the opposite end of the fixed driving arm421-2.", "", "A relative location of the variable driving part422to the frame20may be changed. The variable driving part422may be supported by the fixed driving arm421-2. The variable driving part422may be disposed on an outer side of the fixed driving part421. For example, the variable driving part422may be connected to an outer side of the one end of the fixed driving arm421-2. Furthermore, the fixed driving part421and the variable driving part422may be driven independently. The variable driving part422may include a variable motor422-1and a variable driving arm422-2.", "", "The variable motor422-1may provide power to the variable driving arm422-2. The variable motor422-1may provide a variable center of rotation X4. The variable center of rotation X4may be defined as an imaginary line that passes through the one end of the fixed driving arm421-2and extends in an axial direction thereof. The variable center of rotation X4may be spaced apart from the fixed center of rotation X3. Furthermore, the variable center of rotation X4may cross the movement allowable area.", "", "The variable motor422-1may rotate an opposite end to the one end of the variable driving arm422-2about the variable center of rotation X4. One end of the variable driving arm422-2, as an example, may mean an inner end of the variable driving arm422-2. Furthermore, an opposite end of the variable driving arm422-2, as an example, may mean an outer end of the variable driving arm422-2.", "", "An inner end of the variable motor422-1, as an example, may be connected to the one end of the fixed driving arm421-2. Furthermore, an outer end of the variable motor422-1, as an example, may be connected to the one end of the variable driving arm422-2.", "", "In some cases, the fixed motor421-1and the variable motor422-1may be driven independently.", "", "The one end of the variable driving arm422-2may be connected to the one end of the fixed driving arm421-2. In some cases, the opposite end of the variable driving arm422-2may be connected to the variable rotation part120to be rotatable. For example, the opposite end of the variable driving arm422-2may not be rotated by the rotation of the variable rotation part120. In other words, the variable rotation part120may be rotated with respect to the opposite end of the variable driving arm422-2.", "", "The opposite end of the variable driving arm422-2may be rotated about the variable center of rotation X4. The opposite end of the variable driving arm422-2and the second rotation axis X2may cross each other. The second rotation axis X2may pass through the opposite end of the variable driving arm422-2and a center of the variable rotation part120. Furthermore, the second rotation axis X2may be spaced apart from the variable center of rotation X4.", "", "The frame20may support the plurality of wheel assemblies10.", "", "Hereinafter, a process of generating a rotational force in the variable rotation part120will be described.", "", "When the main rotary motor411is driven, the driving pulley412may be rotated about the pulley rotation axis XP. When the driving pulley412is rotated, the driven pulley413may be rotated about the first rotation axis X1through the driving belt414. When the driven pulley413is rotated, the main rotation body111may be rotated about the first rotation axis X1together with the driven pulley413. When the main rotation body111is rotated, the first medium rotation part311may be rotated about the medium rotation axis through the first link part321. When the first medium rotation part311is rotated, the medium rotation body313and the second medium rotation part312may be rotated about the medium rotation axis. When the second medium rotation part312is rotated, the variable rotation part120may be rotated about the second rotation axis X2through the second link part322.", "", "Hereinafter, a process of generating power in the variable rotation part120such that the variable rotation part120is moved relatively to the main rotation part110will be described.", "", "When the fixed motor421-1is driven, the one end of the fixed driving arm421-2may be rotated about the fixed center of rotation X3. When the one end of the fixed driving arm421-2is rotated, the variable motor422-1may be rotated about the fixed center of rotation X3together with the fixed driving arm421-2. When the variable motor422-1is rotated, the variable driving arm422-2may be rotated about the fixed center of rotation X3together with the variable motor422-1. In some cases, when the variable motor422-1is driven, the opposite end of the variable driving arm422-2may be rotated about the variable center of rotation X4. In other words, an angle, by which the opposite end of the variable driving arm422-2is rotated with respect to the main rotation part110, may be defined as a sum of an angle, by which the variable motor422-1is rotated, and an angle, by which the opposite end of the variable driving arm422-2is rotated with respect to the variable motor422-1. The variable rotation part120may be moved relatively to the main rotation part110together with the opposite end of the variable driving arm422-2.", "", "The controller30may control the driving part400. The controller30may determine a main angular velocity by controlling the first driving part410. Furthermore, the controller30may determine a location of the variable rotation part120on the movement allowable area by controlling the second driving part420.", "", "The controller30may input an acceleration command such that a travel speed of the moving body1becomes higher. For example, when the acceleration command is input to the controller30, the driving part400may be controlled such that a spoke speed of a contact spoke becomes higher. The contact spoke may mean, the plurality of spokes200, a spoke that contacts the ground surface. The spoke speed may be defined as a speed of the outer end201of the spoke relative to the first rotation axis X1when the moving body1travels at the travel speed.", "", "When an acceleration command is input to the controller such that the travel speed of the moving body1reaches a speed that is lower than a threshold travel speed, the controller may control the first driving part410to increase the main angular velocity and control the second driving part420such that the plurality of spokes200is laid in the first posture. The threshold travel speed may be defined as a travel speed of the moving body1when the plurality of spokes200is laid in the first posture and the main angular velocity is maximal.", "", "Furthermore, when an acceleration command is input to the controller30such that the travel speed of the moving body1reaches a speed that is higher than the threshold travel speed, the controller30may control the first driving part410such that the main angular velocity is maximal, and may perform an angle control to control the second driving part such that the posture of the plurality of spokes200is changed from the first posture to the second posture.", "", "When the controller30performs an angle control, the second driving part420may move the variable rotation part such that an angle defined by the contact spoke and the adjacent spoke becomes larger. The adjacent spoke may be defined as, among the plurality of spokes200, the spoke200that is adjacent to the contact spoke and is disposed on a side that is closer to the reverse rotational direction C2than the contact spoke. For example, when the controller30performs an angle control, the second driving part420may move the variable rotation part120toward an included area of the main rotation part110that is an area formed between the control spoke and the adjacent spoke. The included area may be defined as an area of a periphery area of the main rotation part110, which is disposed between the contact spoke and the adjacent spoke.", "", "The controller30may be implemented by a processor that is electrically connected to the driving part400and has a function of decoding and executing a command based on information that is input in advance.", "", "In some cases, according to another implementation of the present disclosure, when an acceleration command is input to the controller30such that the travel speed of the moving body1reaches a target travel speed, the controller30may determine a plurality of target spoke speeds. The plurality of target spoke speeds may be defined as speeds of outer ends201of the plurality of spokes.", "", "The controller30may calculate the main angular velocity, the first rotation angular velocity, and the second rotation angular velocity based on the plurality of determined target spoke speeds. The first rotation angular velocity may be defined as a rotation angular velocity of the one end of the fixed driving arm421-2when the one end of the fixed driving arm421-2is rotated about the fixed center of rotation X3. The second rotation angular velocity may be defined as a rotation angular velocity of the opposite end of the variable driving arm422-2when the opposite end of the variable driving arm422-2is rotated about the variable center of rotation X4.", "", "Hereinafter, referring toFIG.11, a method S10afor controlling the wheel assembly according to an implementation of the present disclosure will be described.", "", "A method S100afor controlling the wheel assembly may include a moving body traveling operation S100a, an input operation S200a, and a speed controlling operation S300a.", "", "In the moving body traveling operation S100a, the moving body1may travel on the ground surface at a travel speed.", "", "In the input operation S200a, an acceleration command may be input to the controller30such that the travel speed of the moving body1becomes higher. For example, in the input operation S200a, an acceleration command may be input such that the travel speed of the moving body1becomes higher or lower than a threshold travel speed.", "", "In the speed controlling operation S300a, a spoke speed of, among the plurality of spokes200, a spoke that contacts the ground surface may become higher when an acceleration command is input to the controller30in the input operation S200a. The speed controlling operation S300amay include an angle controlling operation S310aand a rotation controlling operation S320a.", "", "In the angle controlling operation S310a, postures of the plurality of spokes200may be controlled. When an acceleration command is input to the controller30such that the travel speed of the moving body1reaches a speed that is higher than the threshold travel speed, the angle controlling operation S310amay be performed. In the angle controlling operation S310a, an angle defined by the contact spoke and the adjacent spoke may become larger. When the angle controlling operation S310ais performed, the wheel assembly10may show the same effects as if a stride of a person become wider as the angle defined by the contact spoke and the adjacent spoke becomes larger. Furthermore, when the angle controlling operation S310ais performed, a posture of the plurality of spokes200may be changed from the first posture to the second posture.", "", "In the rotation controlling operation S320a, the main angular velocity may be controlled. For example, when an acceleration command is input to the controller30such that the travel speed of the moving body1reaches a speed that is lower than the threshold travel speed, the main angular velocity may become higher such that the main angular velocity reaches an angular velocity that is lower than a maximum main angular velocity in the rotation controlling operation S320a. Furthermore, when an acceleration command is input to the controller30such that the travel speed of the moving body1reaches a speed that is higher than the threshold travel speed, the main angular velocity may become maximal in the rotation controlling operation S320a.", "", "Hereinafter, referring toFIG.12, a method S10bfor controlling the wheel assembly according to another implementation of the present disclosure will be described.", "", "The method S10bfor controlling the wheel assembly may include a moving body traveling operation S100b, an input operation S200b, a spoke speed determining operation S300b, a calculation operation S400b, and a speed controlling operation S500b. The description of the moving body traveling operation S100aaccording to an implementation of the present disclosure is applied to a description of the moving body traveling operation S100b.", "", "In the input operation S200b, an acceleration command (hereinafter, a target acceleration command) is input to the controller30such that the travel speed of the moving body1reaches the target travel speed.", "", "In the spoke speed determining operation S300b, when the target acceleration command is input to the controller30, a plurality of target spoke speeds that are spoke speeds of the outer ends201of the plurality of spokes may be determined.", "", "In the calculation operation S400b, a main angular velocity, a first rotation angular velocity, and a second rotation angular velocity may be calculated based on the plurality of determined target spoke speeds.", "", "In the speed controlling operation S500b, the main rotation part110is rotated based on the main angular velocity, the first rotation angular velocity, and the second rotation angular velocity that are calculated, and the variable rotation part120may be moved relatively to the main rotation part110. The speed controlling operation S500bmay include a main rotation part controlling operation S510band a variable rotation part controlling operation S520b.", "", "In the main rotation part controlling operation S510b, the main rotation part110may be rotated at the calculated main angular velocity.", "", "In the variable rotation part controlling operation S520b, the variable rotation part120may be moved relatively to the main rotation part110based on the first rotation angular velocity and the second rotation angular velocity, which are calculated. The variable rotation part controlling operation S520bmay be performed at the same time as or a different time from the main rotation part controlling operation S510b. The variable rotation part controlling operation S520bmay include a first rotation operation S521band a second rotation operation S522b.", "", "In the first rotation operation S521b, the one end of the fixed driving arm421-2may be rotated about the fixed center of rotation X3at the calculated first rotation angular velocity. Furthermore, in the second rotation operation S522b, the opposite end of the variable driving arm422-2may be rotated about the variable center of rotation X4at the calculated second rotation angular velocity. The first rotation operation S521band the second rotation operation S522bmay be performed at the same time or may be performed at different times.", "", "According to the wheel assembly according to the present disclosure, various postures may be implemented by securing a sufficient movement range of the variable rotation part.", "", "Although it may have been described above that elements of the present disclosure are coupled to one another, the present disclosure is not essentially limited to such implementations. That is, without departing from the purpose of the present disclosure, all the elements may be selectively coupled into one or more elements to be operated.", "", "The above description is a simple exemplification of the technical spirits of the present disclosure, and the present disclosure may be variously corrected and modified by those skilled in the art to which the present disclosure pertains without departing from the essential features of the present disclosure. Accordingly, the implementations disclosed in the present disclosure is not provided to limit the technical spirits of the present disclosure but provided to describe the present disclosure, and the scope of the technical spirits of the present disclosure is not limited by the implementations. Accordingly, the technical scope of the present disclosure should be construed by the attached claims, and all the technical spirits within the equivalent ranges fall within the scope of the present disclosure."], "claims": ["a main rotation part configured to be rotated about a first rotation axis; a power transmitting part configured to receive power from the main rotation part; and a variable rotation part configured to (i) receive a rotational force from the power transmitting part to be rotated about a second rotation axis when the main rotation part is rotated, and (ii) be moved relative to the main rotation part such that the first rotation axis and the second rotation axis overlap each other or are spaced apart from each other.", "a first link part having a first end that is rotatably connected to the main rotation part, the first link part being configured to receive the power of the main rotation part based on the main rotation part being rotated; and a first medium rotation part rotatably connected to a second end of the first link part opposite the first end, the first medium rotation part being configured (i) to receive the power from the first link part (ii) to transmit the received power to the variable rotation part to thereby rotate the variable rotation part.", "a second medium rotation part configured to receive the power from the first medium rotation part; and a second link part having (i) a first end that is connected to the second medium rotation part to be rotatable and (ii) a second end opposite the first end that is connected to the variable rotation part to be rotatable, and wherein the second link part is configured to receive the power of the second medium rotation part and transmit the received power to the variable rotation part to thereby rotate the variable rotation part.", "4 . The wheel assembly of claim 3 , wherein, when viewed along a direction that is perpendicular to the first rotation axis, the main rotation part is disposed between the first medium rotation part and the second medium rotation part.", "a spoke having an inner end that is rotatably connected to the variable rotation part and an outer end that is configured to contact a ground surface.", "wherein the spoke is configured, based on the variable rotation part being moved relative to the main rotation part, to be translated with respect to the rotation support part, and wherein an inner end of the spoke is rotatably connected to a periphery of the variable rotation part.", "be translated to become farther from the rotation support part when being moved relative to the main rotation part such that the variable rotation part becomes closer to the rotation support part, and be translated to become closer to the rotation support part when being moved relative to the main rotation part such that the variable rotation part becomes farther from the rotation support part.", "wherein a plurality of spokes are provided to correspond to the rotation support parts, respectively.", "9 . The wheel assembly of claim 8 , wherein the spoke is configured to be inserted into the rotation support part, and a guide hole that is configured to guide translations of the spoke with respect to the rotation support part is defined therein.", "10 . The wheel assembly of claim 9 , wherein, (i) based on adjacent arbitrary two rotation support parts among the plurality of rotation support parts being defined as a first rotation support part and a second rotation support part, respectively, and (ii) based on the variable rotation part being moved relative to the main rotation part toward an area of the periphery of the main rotation body, which is formed between the first rotation support part and the second rotation support part, the first rotation support part and the second rotation support part are rotated with respect to the main rotation body such that an angle defined by an imaginary line that extends along a guide hole of the first rotation support part and an imaginary line that extends along a guide hole of the second rotation support part becomes larger.", "a first driving part configured to rotate the main rotation part; and a second driving part configured to move the variable rotation part relative to the main rotation part, wherein the first driving part and the second driving part are configured to be driven independently.", "a main rotary motor configured to provide a pulley rotation axis that is spaced apart from the first rotation axis; a driving pulley configured to be rotated about the pulley rotation axis based on the main rotary motor being driven; and a driven pulley configured to receive a rotational force from the driving pulley to be rotated about the first rotation axis together with the main rotation part based on the driving pulley being rotated.", "13 . The wheel assembly of claim 12 , wherein the pulley rotation axis is spaced apart from the second rotation axis.", "a fixed driving part including a fixed driving arm, one end of which is rotated about a fixed center of rotation, of which a relative location with respect to the first rotation axis is fixed; and a variable driving part including a variable driving arm, one end of which is connected to the fixed driving arm and an opposite end of which is connected to the variable rotation part, and configured to be rotated about a variable center of rotation that passes through the fixed driving arm and is spaced apart from the fixed center of rotation.", "wherein the second rotation axis and the fixed center of rotation are laid in any one of an overlapping state, in which they overlap each other, and a spacing state, in which they are spaced apart from each other.", "16 . The wheel assembly of claim 15 , wherein the first rotation axis, the second rotation axis, and the fixed center of rotation overlap each other to define one imaginary line.", "wherein the variable driving part further includes a variable motor configured to provide the variable center of rotation, connected to the one end of the fixed driving arm, and connected to the variable driving arm to rotate an opposite end of the variable driving arm about the variable center of rotation.", "18 . The wheel assembly of claim 17 , wherein the fixed motor and the variable motor are configured to be driven independently.", "wherein the movement allowable area is surrounded by an imaginary circle, a center of which is a point, at which the movement allowable area and the first rotation axis cross each other and a radius of which is a sum of a first driving distance that is a spacing distance between the fixed center of rotation and the variable center of rotation and a second driving distance that is a spacing distance between the second rotation axis and the variable center of rotation."], "bibtex": "@patent{20240308268,\n    title = {WHEEL ASSEMBLY},\n    number = {20240308268},\n    year = {2024},\n    note = {File: US20240308268A1-20240919.XML}\n    }", "classification": "B60B1900FI"}, {"title": "SEAL MECHANISM FOR WHEEL ASSEMBLIES", "doc_number": "20240308269", "filename": "US20240308269A1-20240919.XML", "abstract": "In an example, a seal for a wheel assembly includes a first rim half and a second rim half. The seal comprises a cylindrical body having a hollow interior, a first seal end configured to mate with a first inner rim surface of the first rim half, and a second seal end configured to mate with a second inner rim surface of the second rim half, and one or more drain holes. The cylindrical body has a cylindrical wall with the one or more drain holes configured to substantially deflect incoming matter from impinging upon the hollow interior and to allow condensate to evacuate from the hollow interior through the one or more drain holes. The cylindrical body comprises an elastomeric material.", "detailed_description": ["A number of examples or embodiments of the present invention are described, and it should be appreciated that the present invention provides many applicable inventive concepts that can be embodied in a variety of ways. The embodiments discussed herein are merely illustrative of ways to make and use the invention and are not intended to limit the scope of the invention. Rather, as will be appreciated by one of skill in the art, the teachings and disclosures herein can be combined or rearranged with other portions of this disclosure along with the knowledge of one of ordinary skill in the art.", "", "FIG.1is an exploded view of a typical wheel assembly. From a first end to a second end, the parts include a first snap ring1, a pair of first grease seal rings2with a first grease seal3disposed between them, a first bearing cup and cone4, a nut5and a first washer6, a first or outer wheel half8, an O-ring9, a second or inner wheel half10, a second washer6and a bolt7, a second bearing cup and cone4, a pair of second grease seal rings2with a second grease seal3disposed between them, and a second snap ring1.", "", "FIG.2is a cross-sectional view of a main landing gear wheel assembly for a C-144 airplane. The wheel halves (first/lower wheel half140and second/upper wheel half240) are joined with bolts, washers, and nuts. When the wheel halves140,240are joined, a cavity forms between the wheel halves. This cavity is exposed to the outside environment via holes in the wheels. The bearings180(first/lower bearing) and130(second/upper bearing) that reside in each wheel half have no inner seal protecting them from anything that enters the cavity between the wheel halves. The bearings180and130have outer seals170and120protecting them from the outside, but nothing on the inside.", "", "In embodiments, an environmental seal (400inFIGS.3and4) is configured to be disposed between the two main landing gear rim halves. A relevant lower/first rim portion (first or lower wheel half rim portion) and a relevant upper/second rim portion (second or upper wheel half rim portion) mate with the seal. The first or lower wheel half rim portion has a first/lower bearing (910inFIG.9) residing therein. The second or upper wheel half rim portion has a second/upper bearing (920inFIG.9) residing therein.", "", "FIG.3is a top view of the seal400.FIG.4is a perspective view of the seal400with a seal wall. The seal400has a circular cylindrical body with a cylindrical wall and a hollow interior. In one example, the seal400has an outer diameter401of about 4.3 inches and an inner diameter402of about 3.9 inches.", "", "FIG.5is an elevational view of the seal400. The height of the seal400in this example is about 1.89 inches.", "", "FIG.6is a cross-sectional view of the seal400along A-A ofFIG.5.FIG.7shows detail B ofFIG.6.FIG.8shows detail C ofFIG.6. As seen inFIG.7, one side (upper side as shown) of the seal400has an inwardly oriented radius of curvature702of about R=0.28″ with a total rise704from low side to high side of about 0.07 inches in this example. As seen inFIG.8, the other side (lower side as shown) of the seal400has an inwardly oriented radius of curvature712of about R=1.01″ with a total rise714from low side to high side of about 0.02 inches in this example.", "", "FIG.9shows a cross-sectional view of the seal400as installed between and mating with the lower/first rim portion410and upper/second rim portion420of the landing gear. The first or lower wheel half rim portion410has a first/lower bearing910residing therein. The second or upper wheel half rim portion420has a second/upper bearing920residing therein. The inward pointing arrows930represent the influx of environmental contaminants that are substantially deflected by the seal wall of the seal400, as represented by the outward pointing arrows940. The seal400may include one or more drain holes through the seal wall configured to substantially deflect incoming spray into the hollow interior430but allow condensate to evacuate from the hollow interior through the one or more drain holes. For example, the seal deflects at least 90% or 95% or 98% of the incoming spray (e.g., incoming particulate and/or fluidic matters or substances) into the hollow interior and the one or more drain holes allow condensate to evacuate from the hollow interior.", "", "Because the two wheel halves (e.g.,140,240inFIG.2) have different radii, the radius taper of the seal400on the two sides are different. Edges of the seal400(seeFIGS.7and8) may conform to the different radii of the two wheel halves. The inner diameter of the seal400is larger than the outer diameter of the axle shaft. The seal400may have a slightly larger height parameter to cause a compressive interference fit to guarantee sealing with the lower/first rim portion410and upper/second rim portion420of the landing gear.", "", "FIGS.10and11illustrates an example of a seal1000having drain holes or openings1010which are normal to the seal wall or the longitudinal axis of a circular seal1000. The drain holes1010may have other shapes, different sizes, different numbers, or different arrangements. In embodiments, the drain holes1010each have an area that is equal to or less than 2% or 1% or 0.5% of the entire area (i.e., surface area) of the seal wall. The total area of the plurality of drain holes1010may be equal to or less than 6% or 4% or 2% of the entire area of the seal wall. The number of drain holes1010may be at least two or at least four or at least six. The plurality of drain holes1010are distributed evenly around the seal wall which may be a cylindrical wall.", "", "FIGS.12and13illustrate an example of a seal1200having drain holes or openings which are circumferentially angled slots1210through the seal wall. The angled slots1210may be angled or slanted to allow condensate to evacuate outwardly from the seal1200via the angled slots1210toward the direction of rotation of the wheel (axle spin direction for forward motion of the vehicle) or opposite the direction of rotation of the wheel. As seen inFIGS.12and13, the angled slots1210are slanted to allow condensate to evacuate outwardly from the seal1200via the angled slots1210opposite the direction of rotation of the wheel. The angle relative to the tangent to the circumferential surface may be about 10° to about 80°, or about 20° to about 60º, or about 30° to about 45°. The angled slots1210may have other shapes, different sizes, different numbers, or different arrangements.", "", "FIG.14illustrates an example of a portion of a seal1400having drain holes or openings with flaps1410in open positions. In the open positions, the flaps1410extend outwardly from the seal wall. The flaps1410may be centrifugal flaps oriented to allow condensate to evacuate outwardly from the seal1400via the centrifugal flaps1410toward the direction of rotation of the wheel (axle spin direction for forward motion of the vehicle) or opposite the direction of rotation of the wheel. As seen inFIG.14, the centrifugal flaps1410are oriented to allow condensate to evacuate outwardly from the seal1400via the centrifugal flaps1410opposite the direction of rotation of the wheel. The angle relative to the tangent to the circumferential surface may be about 10° to about 80°, or about 20° to about 60º, or about 30° to about 45°. The centrifugal flaps1410and their associated drain holes may have other shapes, different sizes, different numbers, or different arrangements.", "", "The centrifugal flaps1410are fixed in the open position ofFIG.14in embodiments. In alternative embodiments, the centrifugal flaps1410may be flexible and/or movable between open and closed positions. For instance, the centrifugal flaps1410may be configured to open up due to and proportional to centrifugal forces of the spinning wheel.", "", "FIG.15illustrates an example of a portion of the seal ofFIG.14showing the flaps1410in closed positions. When the wheel is not spinning, the centrifugal flaps1410may be disposed in the closed positions as shown inFIG.15or in slightly open positions (e.g., less than 20% or 10% of the angle in the open positions as seen inFIG.14when the wheel is spinning at top speed).", "", "FIG.16illustrates an example of a portion of a seal having interior surface grooves for the drain holes or openings. The interior surface of the seal1600includes one or more interior surface grooves1610. The interior surface grooves1610may be circumferential interior surface grooves that are oriented horizontally. In another embodiment, the interior surface grooves may be formed at an angle with respect to the horizontal plane to be spiral interior surface grooves. At least some of the drain holes or openings coincide with or overlap the interior surface grooves1610which encourage water egress via those coinciding or overlapping openings1620.", "", "In some embodiments, the interior surface grooves may provide one or more linear slopes to channel water to the egress holes1620. In other embodiments, the interior surface grooves may provide curved slopes to channel water to the egress holes. The curved slopes around the inside egress holes can channel the water. In specific embodiments, the interior surface grooves1610have a geometric surface design which can aid in channeling liquid such as water to the egress holes. Rotating the wheel assembly allows condensate to evacuate outwardly from the hollow interior of the flexible seal via the one or more interior surface grooves through the one or more drain holes.", "", "The inventive concepts taught by way of the examples discussed above are amenable to modification, rearrangement, and embodiment in several ways. For example, this invention may be applicable in other systems having different geometries, sizes, or arrangements of components. Accordingly, although the present disclosure has been described with reference to specific embodiments and examples, persons skilled in the art will recognize that changes may be made in form and detail without departing from the spirit and scope of the disclosure.", "", "An interpretation under 35 U.S.C. § 112(f) is desired only where this description and/or the claims use specific terminology historically recognized to invoke the benefit of interpretation, such as “means,” and the structure corresponding to a recited function, to include the equivalents thereof, as permitted to the fullest extent of the law and this written description, may include the disclosure, the accompanying claims, and the drawings, as they would be understood by one of skill in the art.", "", "To the extent the subject matter has been described in language specific to structural features or methodological steps, it is to be understood that the subject matter defined in the appended claims is not necessarily limited to the specific features or steps described. Rather, the specific features and steps are disclosed as example forms of implementing the claimed subject matter. To the extent headings are used, they are provided for the convenience of the reader and are not to be taken as limiting or restricting the systems, techniques, approaches, methods, or devices to those appearing in any section. Rather, the teachings and disclosures herein can be combined or rearranged with other portions of this disclosure and the knowledge of one of ordinary skill in the art. It is intended that this disclosure encompass and include such variation.", "", "The indication of any elements or steps as “optional” does not indicate that all other or any other elements or steps are mandatory. The claims define the invention and form part of the specification. Limitations from the written description are not to be read into the claims."], "claims": ["a cylindrical body having a hollow interior, a first seal end configured to mate with a first inner rim surface of the first rim half, and a second seal end configured to mate with a second inner rim surface of the second rim half, and one or more drain holes, the cylindrical body having a cylindrical wall with the one or more drain holes being configured to substantially deflect incoming matter into the hollow interior and to allow condensate to evacuate from the hollow interior through the one or more drain holes, the cylindrical body comprising an elastomeric material.", "wherein at least one drain hole of the one or more drain holes is normal to the cylindrical wall.", "wherein at least one drain hole of the one or more drain holes is slanted at an angle relative to the cylindrical wall.", "wherein the at least one drain hole is slanted at the angle relative to the cylindrical wall to allow condensate to evacuate outwardly from the hollow interior of the seal.", "wherein the cylindrical wall includes a flap at at least one drain hole of the one or more drain holes.", "wherein the flap is a centrifugal flap oriented at an angle relative to the cylindrical wall to allow condensate to evacuate outwardly from the seal through the at least one drain hole via the centrifugal flap opposite a direction of rotation of the wheel assembly for forward motion.", "wherein each drain hole of the one or more drain holes has an area which is equal to or less than 2% of an entire area of the cylindrical wall.", "wherein the plurality of drain holes have a total area which is equal to or less than 6% of an entire area of the cylindrical wall.", "9 . The seal of claim 1 , comprising at least four drain holes distributed evenly around the cylindrical wall.", "wherein the first seal end is graduated to match a profile of the first inner rim surface of the first rim half and the second seal end is graduated to match a profile of the second inner rim surface of the second rim half.", "wherein the profile of the first inner rim surface of the first rim half and the profile of the second inner rim surface of the second rim half are different.", "wherein the profile of the first inner rim surface of the first rim half is characterized by a first radius, the profile of the second inner rim surface of the second rim half is characterized by a second radius, and the first radius and the second radius are different.", "wherein the cylindrical body includes one or more interior surface grooves each overlapping a drain hole of the one or more drain holes.", "wherein the one or more interior surface grooves include one or more circumferential interior surface grooves.", "a first rim half having a first inner rim surface; a first bearing surrounded by the first rim half; a second rim half having a second inner rim surface; a second bearing surrounded by the second rim half; and a flexible seal having a cylindrical body which includes a hollow interior, a first seal end configured to mate with the first inner rim surface of the first rim half, and a second seal end configured to mate with the second inner rim surface of the second rim half, the cylindrical body of the flexible seal surrounding a space between the first bearing and the second bearing.", "wherein the cylindrical body includes one or more drain holes and is configured to substantially deflect incoming matter from impinging upon the hollow interior and to allow condensate to evacuate from the hollow interior through the one or more drain holes.", "wherein the cylindrical body has a cylindrical wall and at least one drain hole of the one or more drain holes is slanted at an angle relative to the cylindrical wall.", "wherein the at least one drain hole is slanted at the angle relative to the cylindrical wall to allow condensate to evacuate outwardly from the hollow interior of the flexible seal through the at least one drain hole opposite a direction of rotation of the wheel assembly for forward motion.", "wherein the cylindrical body has a cylindrical wall which includes a flap at at least one drain hole of the one or more drain holes.", "wherein the flap is a centrifugal flap oriented at an angle relative to the cylindrical wall to allow condensate to evacuate outwardly from the hollow interior of the flexible seal through the at least one drain hole via the centrifugal flap opposite a direction of rotation of the wheel assembly for forward motion.", "wherein the cylindrical body includes one or more interior surface grooves each overlapping a drain hole of the one or more drain holes.", "wherein the one or more interior surface grooves include one or more circumferential interior surface grooves.", "wherein the first seal end is graduated to match a profile of the first inner rim surface of the first rim half and the second seal end is graduated to match a profile of the second inner rim surface of the second rim half.", "wherein the cylindrical body comprises an elastomeric material.", "placing, between the first rim half and the second rim half, a flexible seal having a cylindrical body which includes a hollow interior, a first seal end mating with the first inner rim surface of the first rim half, and a second seal end mating with the second inner rim surface of the second rim half, the cylindrical body of the flexible seal surrounding a space between the first bearing and the second bearing.", "substantially deflecting incoming matter into the hollow interior with the cylindrical body of the flexible seal; and allowing condensate to evacuate from the hollow interior through the one or more drain holes.", "rotating the wheel assembly to allow condensate to evacuate outwardly from the hollow interior of the flexible seal through the at least one drain hole which is slanted at the angle relative to the cylindrical wall opposite a direction of rotation of the wheel assembly for forward motion.", "rotating the wheel assembly to allow condensate to evacuate outwardly from the hollow interior of the flexible seal through the at least one drain hole via the flap opposite a direction of rotation of the wheel assembly for forward motion.", "rotating the wheel assembly to allow condensate to evacuate outwardly from the hollow interior of the flexible seal via the one or more interior surface grooves through the one or more drain holes."], "bibtex": "@patent{20240308269,\n    title = {SEAL MECHANISM FOR WHEEL ASSEMBLIES},\n    number = {20240308269},\n    year = {2024},\n    note = {File: US20240308269A1-20240919.XML}\n    }", "classification": "B60B2700FI"}, {"title": "SWIVEL CASTOR ARRANGEMENT FOR A PIECE OF FURNITURE AND A BED WITH THE SWIVEL CASTOR ARRANGEMENT", "doc_number": "20240308270", "filename": "US20240308270A1-20240919.XML", "abstract": "A swivel castor arrangement for a piece of furniture comprises: a holder; a swivel castor including a wheel mounted rotatably about a first axis on a frame mounted rotatably about a second axis on the holder; and a U-shaped bracket having a web connecting two legs attached rotatably about a third axis. The bracket is pivotable about the third axis between first and second positions and is movable into the second position when the first and third axes are substantially parallel. The wheel is arranged in the second position between the bracket legs such that free rotation of the frame about the second axis is restricted, and the wheel in the first position is not arranged between the bracket legs such that free rotation of the frame about the second axis is possible. The bracket is pivotable by less than 90° to switch between the first and second positions.", "detailed_description": ["It is not necessary for a swivel castor arrangement according to the disclosure to have all of the features described below. It is also possible for a swivel castor arrangement according to the disclosure to have only individual features of the exemplary embodiment described below.", "", "Referring toFIGS.1,2,2a,2b, and3-7, the swivel castor arrangement L according to the disclosure has a hood1, a holder2, a first swivel castor3, a second swivel castor4and a bracket5.", "", "The holder2is made from a section of a square tube. Various recesses and holes have been created in the section through machining. Below, there is a notch21into which another rectangular tube6can be inserted, which connects two swivel castor arrangements L according to the disclosure, which together with the other rectangular tube5can form the carriage of the bed B according to the disclosure shown inFIG.6. The two holders2and the other rectangular tube6can be connected to one another by welding.", "", "On an underside of holder2, first and second swivel castors3,4are attached in areas adjacent to the longitudinal ends of holder2. Swivel castors3,4each have a frame31,41. A wheel32,42is mounted rotatably about a first axis of rotation in each frame. The first axes of rotation lie in a plane which is parallel to the floor on which the swivel castor arrangement L can move. The frames are substantially U-shaped and each have a web311,411and two legs312,412, which run parallel to one another and are connected to ends of the web of respective frame31,42.", "", "Frame31,42of each swivel castor3,4is connected to holder2via a pivot bearing33,43, which is screwed to holder2with screws34,44, so that frame31,41can rotate about a second axis of rotation. The second axes of rotation are perpendicular to the plane in which the first axes of rotation lie. The second axis of rotation of each of swivel castors3,4are skewed to the first axes of rotation of respective swivel castors3,4.", "", "The rotation of frame31of first swivel castor3about the second axis of rotation can be blocked or restricted. Bracket5is provided for this purpose. Bracket5has a web51and two legs52. Web51and legs52are arranged in a U-shape relative to one another. Legs52connect to ends of web51. The legs are parallel to one another, and the distance between legs52corresponds to the width of the square tube that forms holder2.", "", "The bracket is mounted pivotably about a third axis of rotation on holder2. For this purpose, holder2has two aligning bores21through side walls at the end of the square tube to which first swivel castor3is attached. Legs52of bracket5each have a bore that is also aligned. Bracket5is arranged on holder2so that the bores in legs52of bracket5, and the bores in the side walls are aligned. A screw8is inserted through the bores and secured with a nut. This screw8forms the third axis of rotation about which bracket5can pivot.", "", "Legs52are not straight, but curved in an S shape. They have an upward arc between the connection points with web51and the third axis of rotation, and a downward arc between the third axis of rotation and their free ends, i.e., in a part of legs52that protrudes beyond the third axis of rotation. A first holding element53and an arcuate elongated hole54are provided at the end of each leg, the arcuate elongated hole54lying on an imaginary ring around the third axis of rotation. First holding element53is formed by a circular hole, which also lies on the imaginary ring around the third axis of rotation.", "", "First holding mechanism53cooperates with a second holding mechanism9. Second holding mechanism9is formed by a ball latch which is inserted into a bore in the side wall of the square tube.", "", "Bracket5can be pivoted between two positions. In the first position, a ball of ball latch9is snapped into first holding mechanism53. In this first position, wheel32of first swivel castor3can be rotated freely. Wheel32has a pivoting range that must be free so that it can rotate freely.", "", "In the second position, web51and the parts of legs52that do not protrude beyond the third axis of rotation are lowered compared to the first position. The bracket can be pivoted downwards by a force that pushes the web downwards. The force also pushes the ball of the ball latch out of first holding elements53. By pressing down web51, legs52come into a pivoting range of wheel32of first swivel castor3. The pivoting range of wheel32and a pivoting range of legs52intersect. It should be understood that both cannot be in the intersecting area at the same time.", "", "The first position and the second position are further defined by two stops, which are formed by screws10,11, against which bracket5rests in the two positions.", "", "Three cases can be distinguished here, namely:a. that wheel32is not in the pivoting range of the legs when web51is pressed down and is positioned such that the legs will be on both sides of wheel32when web52is lowered,b. that wheel32is in the pivoting range of the legs when web51is pressed down, andc. that wheel32is not in the pivoting range of the legs when web51is pressed down and is positioned such that the legs will not be on both sides of wheel32when web52is lowered.", "", "In case a, the bracket can readily reach its second position. The ball of the ball latch then slides in elongated hole54to the lower end thereof. The second position of the bracket is defined by the lower end of elongated hole54. Legs52of bracket2arranged on both sides of wheel32restrict a rotation of frame31and thus of wheel32about the second axis of rotation. A rotation of the swivel castor is thus blocked and swivel castor3then behaves largely like a fixed castor, which improves the straight running of the swivel castor arrangement and a piece of furniture equipped with it, in particular a bed.", "", "In case b, bracket5falls onto wheel32, which is located in the pivoting range of one of legs52of the bracket. The bracket can then not reach its second position. Although the ball of the ball latch is in the slot, it will not reach the lower end thereof. A rotation of wheel32about the second axis of rotation is then not impeded or blocked. If, in case b, wheel32is rotated about the second axis of rotation, it moves below the bracket. Wheel32can be rotated about the second axis of rotation so that it will be out of the pivoting range of legs52. The bracket can then move down. In this case, wheel32can be rotated so that the legs will be on both sides of wheel32when web52is lowered. Then case a arises and rotation of wheel32about the second axis of rotation is impeded or blocked.", "", "However, wheel32can be rotated so that the legs will not be on both sides of wheel32when web52is lowered. Then case c arises, which will now be presented.", "", "If, in case c, wheel32is rotated about the second axis of rotation, it may come into the pivoting range of one of legs32, in which this leg is then also in the second position of the bracket. However, further rotation of wheel32about the second axis of rotation is then not blocked. Rather, the wheel presses against leg32such that the bracket is raised. This is possible in particular due to the upward arc of the leg in this area where wheel32comes into contact with leg52. If wheel32is then rotated further in the same direction, it is rotated away from under leg52so that it will be in the area between legs52and then case a arises. Even then wheel32is blocked by the legs.", "", "In cases b and c, the rotation of wheel32about the second axis of rotation in order to get the wheel between legs52of bracket5can be achieved by moving the swivel castor arrangement or the piece of furniture to which the swivel caster arrangement is attached on the floor, especially in the direction in which wheel32is to be locked.", "", "Bracket5has a tab55which protrudes outwards from the web. This tab55forms a pedal, which makes it easier to operate the bracket with the foot.", "", "On the top of the square tube forming holder2and the inside of hood1, cooperating parts12of a Velcro fastener are arranged, via which hood1and holder2are connected to one another when hood1is placed over holder2."], "claims": ["a holder; a first swivel castor including at least one wheel and one frame, wherein: the wheel is mounted rotatably about a first axis of rotation on the frame, the frame is mounted at least indirectly rotatably about a second axis of rotation on the holder, and the first axis of rotation lies in a first plane and the second axis of rotation is perpendicular to the first plane; and a U-shaped bracket having first and second legs and a web connecting the first and second legs, wherein: the first and second legs are attached at least indirectly rotatably about a third axis of rotation to the holder, which third axis of rotation lies in the first plane or in a plane that is parallel to the first plane, the U-shaped bracket being pivotable about the third axis of rotation between a first position and a second position, and the U-shaped bracket being movable into the second position when the first axis of rotation and the third axis of rotation are substantially parallel or coincide, wherein: the wheel is arranged in the second position between the first and second legs of the U-shaped bracket such that free rotation of the frame about the second axis of rotation is restricted, and the wheel in the first position is not arranged between the first and second legs of the U-shaped bracket such that free rotation of the frame about the second axis of rotation is possible, the U-shaped bracket is pivotable by less than 90° to change from the first position to the second position, and vice versa, and the swivel castor arrangement further has holding elements capable of holding the U-shaped bracket in the first position.", "2 . The swivel castor arrangement of claim 1 , wherein the first and second legs have an arc between connection points between the web and the first and second legs and the third axis of rotation.", "3 . The swivel castor arrangement of claim 1 , wherein the first and second legs protrude beyond the third axis of rotation when viewed from the web, and that a first holding element is provided in a portion of the first or second leg protruding beyond the third axis of rotation.", "4 . The swivel castor arrangement of claim 3 , wherein in the first position of the U-shaped bracket, the first holding element cooperates with a second holding element which is attached to the holder in order to hold the U-shaped bracket in the first position.", "5 . The swivel castor arrangement of claim 4 , wherein the first and second holding elements form or have a ball latch, a magnetic latch, a pressure magnetic latch, or a spring latch.", "6 . The swivel castor arrangement of claim 4 , wherein the first holding element has a recess and the second holding element is a ball latch.", "7 . The swivel castor arrangement of claim 6 , wherein an arcuate elongated hole is provided in the portion of the first or second leg protruding beyond the third axis of rotation, an edge the arcuate elongated hole holding a ball of the ball latch when the U-shaped bracket is not in the first position.", "8 . The swivel castor arrangement of claim 1 , wherein the U-shaped bracket has a tab that protrudes outwards from the web and forms a pedal for actuating the U-shaped bracket.", "9 . The swivel castor arrangement of claim 1 , further comprising a hood over the holder, the first swivel castor and the U-shaped bracket protruding from an opening in the hood.", "a second swivel castor having a second wheel and a second frame, wherein the second wheel is attached rotatably about a fourth axis of rotation to the frame, the fourth axis of rotation being parallel to the first axis of rotation, and wherein the frame is attached at least indirectly rotatably about a fifth axis of rotation to the holder, the fifth axis of rotation being perpendicular to the first plane.", "a base frame and an upper frame, the upper frame having a support for a mattress and the base frame having struts and/or supports via which the upper frame is supported on a floor, the base frame including the swivel castor arrangement of", "12 . The bed of claim 11 , wherein the base frame includes a mechanism for raising and lowering the upper frame.", "13 . The bed of claim 11 , wherein the upper frame includes one or more mechanisms for tilting or raising or lowering parts of the support for the mattress."], "bibtex": "@patent{20240308270,\n    title = {SWIVEL CASTOR ARRANGEMENT FOR A PIECE OF FURNITURE AND A BED WITH THE SWIVEL CASTOR ARRANGEMENT},\n    number = {20240308270},\n    year = {2024},\n    note = {File: US20240308270A1-20240919.XML}\n    }", "classification": "B60B3300FI"}, {"title": "SEAL GUARD FOR COMPACTOR", "doc_number": "20240308271", "filename": "US20240308271A1-20240919.XML", "abstract": "A guard for a seal of a wheeled industrial machine, the guard comprising an cylindrical, annular body having a first plate, a second plate with an upper portion and a lower portion, and a connecting portion extending between the first plate and the second plate; wherein the first plate extends in a radially inward direction from the connecting portion and includes a plurality of holes; wherein the upper portion is configured to extend into a corresponding slot of a rotating element of a wheel of the wheeled industrial machine; and wherein the lower portion is configured to extend toward an axle of the wheeled industrial machine.", "detailed_description": ["Referring now to the drawings, and with specific reference toFIG.1, a work machine constructed in accordance with the teachings of the present disclosure is generally referred to by reference number10. While the work machine10is depicted as a landfill compactor in the exemplary embodiment, it is to be understood that the teachings of this disclosure can be employed with equal efficiency in association with many other wheeled work machines, including but not limited to tractors, motor vehicles, articulated trucks, skid steer loaders, and the like.", "", "Compactors are relatively heavy machines, fitted with steel wheels, that are driven back and forth over refuse dumped in a landfill. Compaction of the debris allows more refuse to be received in a given volume of landfill space. The compactor10is schematically shown inFIG.1. The compactor10, may have a pair of axle assemblies12with each of the axle assemblies12including a pair of axle shafts35terminating in a wheel11on each side of the axle assembly12so that the compactor10has four wheels11. Large equipment such as those manufactured by Caterpillar R, models 826K and 836K, are examples of such compactors10. As such, each side of an axle assembly12has a final drive13on its outboard end to which a respective wheel11is removably connected via bolts17. Rotation of a wheel11requires relative rotation between a non-rotating spindle18and a final drive housing19, both of which are elements of final drive13. This relative rotation is accommodated by a duo-cone seal15that excludes dirt from entering the axle housing14and retains lubricant within the axle housing and final drive13. The duo-cone seal15, axle assembly12, final drive13, and wheel11, are all common or coaxial.", "", "FIG.2illustrates detail of a rotating guard20arranged to protect the duo-cone seal15associated with the final drive13of each of the four wheels11on a compactor10. The rotating guard20may be made from steel plate or steel castings and may be an annular structure formed by a plurality of sections21. In a primary embodiment, the rotating guard20may be formed by two generally circular half sections21, however, the seal guard may also be formed by more than two sections, or may be formed as a single unitary guard.", "", "The rotating guard20may be formed by a first plate22, a second plate23, and a connecting portion24which joins the first plate22with the second plate23. The first plate22may be an annular plate having a thickness t1, and may extend from a first plate outer diameter25to a first plate inner diameter26. Equivalently, the second plate23may also be an annular plate having a thickness t2and extending from a second plate outer diameter27to a second plate inner diameter28. It will be understood that the connecting portion24may be cylindrically formed having a thickness t3equivalent or similar to the thickness t1of the first plate22and the thickness t2of the second plate23, and may have an outer diameter equivalent to the first plate outer diameter25, and between the second plate outer diameter27and the second plate inner diameter28. The first plate22of the rotating guard20may also include holes29for allowing the rotating guard20to be mounted to final drive13by bolts, or any other suitable fastener. As shown inFIG.2, the rotating guard20may be formed into a plurality of sections21such as halves in order to facilitate ease of installation onto the axle assembly, and may include flanges30on each of the sections21. The flanges30may have holes31such that any suitable fastener (not shown) may be employed to connect the sections21.", "", "FIG.3illustrates detail of a rotating guard mount60for mounting the rotating guard20onto the final drive13. The rotating guard mount60may be formed as an annular disc-like plate61which may have a thickness t4, and may be formed as a unitary plate made from steel or similar material. The rotating guard mount60may include a first set of holes62to correspond with the holes29of the rotating guard20such that fasteners may be placed through the holes62and29to connect the rotating guard20with the rotating guard mount60. In the primary embodiment, the fasteners are bolts and nuts, however, any other suitable fasteners may be utilized. The rotating guard mount60may include a tapered portion63such that the thickness of the plate61at an inner diameter, t5, is less than the thickness at an outer diameter, t4. The rotating guard mount60may also include a second set of holes64to correspond with holes on the final drive13to connect the rotating guard mount60with the final drive13via fasteners.", "", "FIG.4illustrates detail of a fixed internal guard50arranged to protect the duo-cone seal15of the final drive13of each of the four wheels11on the compactor10. The fixed internal guard50may work in conjunction with the rotating guard20in creating a labyrinth-like set of passages that foreign material must travel though in order to reach the duo-cone seal15. The fixed internal guard50may be formed from a mounting plate51having a thickness t6and extending in a radially outward direction terminating at a mounting plate outward end53, and a perpendicular plate52having a thickness t7, which may be an annularly formed plate extending from the mounting plate51in an axial direction terminating in a perpendicular plate end54. Similar to the rotating guard20, the fixed internal guard50may also be formed in a plurality of sections55, or may be formed as a unitary guard.", "", "In order to be mounted to the axle housing14, the fixed internal guard50may be provided with a plurality of protrusions56with a plurality of holes57, corresponding with matching holes in the axle housing14. A plurality of fasteners58(not pictured) may be placed through holes57and into the corresponding holes of the axle housing14in order to mount the fixed internal guard50to the axle housing14. In the primary embodiment, the fixed internal guard50, like the rotating guard20, is formed by a plurality of steel plates joined by welding, andFIG.4shows the fixed internal guard50with a weld bead59, however, fixed internal guard50may also be formed from steel castings not requiring the weld bead59.", "", "FIGS.5-7illustrates a solution of the disclosed invention for preventing foreign material from entering the interior of a barrel of a compactor wheel and damaging a duo-cone seal. In the seal guard assembly of the disclosed invention, a wheel drum extension40, is mounted to a wheel drum16of the wheel11, and rotates with the wheel11. The final drive13may include a non-rotating spindle18which is mounted to the axle housing14, and a rotating assembly including a final drive housing19. In order to restrict debris from entering the spaces between the rotating and non-rotating components of the final drive13, a duo-cone seal15may be disposed between the spindle18and the final drive housing19. The duo-cone seal15may include a seal body151and a pair of o-rings152.", "", "The rotating guard mount60may be mounted to an inboard end of the final drive housing19of the final drive13via fasteners extending through holes64, may be mounted with a weld, may be mounted with a press fit connection, or the like. The seal guard sections21may be joined together and mounted on to the rotating guard mount60via fasteners extending through holes29and62. In the primary embodiment as shown inFIGS.6and7, the fasteners are bolts65and nuts66.", "", "As detailed inFIG.7, the wheel drum extension40may have an annular cylindrical portion41, a first protrusion42, and a second protrusion43. The first protrusion42and the second protrusion43may form annular plates extending in a radially inward direction, and may be spaced apart such that a slot may form between them. The wheel drum extension40may also include a deflection ring44in the slot between the first protrusion42and the second protrusion43. The second plate23of the rotating guard20may occupy the slot formed between the first protrusion42and the second protrusion43. The second plate23and the second plate outer diameter27may be dimensioned such that a slight gap forming a passage88may be formed around the second plate23as it occupies the slot between the first protrusion42and the second protrusion43. Gapping the second plate23of the rotating guard20within the wheel drum extension40may allow for the rotating guard20and the wheel drum extension40to rotate together, or in a similar manner, without a physical connection. Furthermore, the first protrusion42of the wheel drum extension40may be dimensioned to form a first gap81between the first protrusion42and the axle housing14. The second protrusion43may be similarly dimensioned to form a fifth gap89between the second protrusion43and the connecting portion24of the rotating guard20.", "", "The fixed internal guard50may be mounted to axle housing14with fasteners58. The mounting plate outward end53may extend from the axle housing14in a radially outward direction toward the connecting portion24of the rotating guard20. The perpendicular plate52, may extend from the mounting plate51in an axial direction towards the first protrusion42of the wheel drum extension40, and may terminate in the perpendicular plate end54. A second gap83may be formed between the perpendicular plate end54and the first protrusion42of the wheel drum extension40. The second plate23of the rotating guard20may extend in a radially inward direction toward the perpendicular plate52. However, since the fixed internal guard50is a non-rotating element, the second plate inner diameter28may be dimensioned in order to form a third gap84between the second plate23and the perpendicular plate52of the fixed internal guard50in order to facilitate free movement of the rotating guard20in relation to the fixed internal guard50. Furthermore, the mounting plate outward end53may be similarly dimensioned in order to form a fourth gap86between the mounting plate51and the connecting portion24of the rotating guard20.", "", "In order for foreign material to penetrate the seal guard assembly of the disclosed invention and access the seal area80, foreign material may enter an interior space of wheel drum16, and may first access a first space82from the first gap81. The first space82may be an annular space having a boundary formed by the axle housing14, the final drive13, the mounting plate51and the perpendicular plate52of the fixed internal guard50, and the first protrusion42of wheel drum extension40. The first space82may allow foreign material to build up, thus trapping foreign material in a confined space and preventing foreign material from accessing the seal area80. Once excess foreign material has built up, the foreign material may then breach the second gap83, and the foreign material may be diverted between two routes.", "", "In a first routing, the foreign material may breach a third gap84in order to reach a second space85. The second space85may also be an annular space, and may be bound by the mounting plate51and the perpendicular plate52of the fixed internal guard50, and the connecting portion24and the second plate23of the rotating guard20. The second space85may allow foreign material to build up once again, and thus may provide a secondary trap for preventing foreign material from reaching the seal area80. Once excess foreign material has built up in the second space85, the foreign material may then breach the fourth gap86in order to reach a third space87. The third space87may also be an annular space, and may be bound by the spindle18, the axle housing14, the perpendicular plate52of the fixed internal guard50, and the connecting portion24and the first plate22of the rotating guard20. The third space87may allow foreign material to build up once again, and thus may provide a tertiary trap for preventing foreign material from reaching the seal area80. Only once a sufficient amount of foreign material has built up within the third space87, the foreign material may travel between gaps between the spindle18, rotating guard mount60, and the final drive housing19to access the seal area80to interact with duo-cone seal15.", "", "In the second, alternate routing, foreign material may bypass the third gap84, and travel through a passage88formed by the gaps between the second plate23and the first protrusion42, the second plate outer diameter27and the deflection ring44, and the second plate23and the second protrusion43. Foreign material may then breach a fifth gap89in order to finally access the excess area90. The excess area90may be bound by wheel drum16and the final drive housing19such that access to the seal area80is further prevented. The volumes of the first space82, the second space85, the third space87, and excess area90are relatively large, providing the capacity to trap a considerable volume of foreign material between service intervals and preventing wear on duo-cone seal15.", "", "In an embodiment of the sealing assembly as shown inFIGS.6and7, lubricant is provided between non-rotating portions of the final drive13and the duo-cone seal15. The tapered portion63of the rotating guard mount60provides a gap for lubricant to fill in order to facilitate rotation of rotating elements of the sealing assembly in relation to non-rotating elements of the sealing assembly. The passage formed by the tapered portion63may extend into the third space87such that excess lubricant can mix with foreign material in third space87, further trapping the foreign material within third space87.", "", "FIG.8illustrates an alternate embodiment of the rotating guard20of the disclosed invention, where a further sealing element is provided on the rotating guard20in order to further prevent foreign material from accessing gaps between the spindle18, rotating guard mount60, and the final drive housing19leading to the seal area80. In the alternate embodiment, an alternate seal guard120may be provided. The seal guard120may be similar to the rotating guard20of the primary embodiment, however, the seal guard120may be provided with a lip seal123at a radially inner end122of a first plate121of the seal guard120. In the alternate embodiment, the lip seal123may be formed as a v-shaped seal. The lip seal123may be configured to mate with a lip seal area131, on a spindle180of a final drive130of the alternate embodiment. The lip seal area131may be formed into the spindle180, and may also be formed as an annular ring pressed onto the spindle180. The annular ring of the lip seal area may also be attached via an interference fit, a clearance fit, or any other suitable means. Foreign material is thereby prevented from accessing a passage163and thereby prevented from escaping the third space87into the seal area80.", "", "FIG.9illustrates another alternate embodiment of the rotating guard20of the disclosed invention, again where a further sealing element is provided on the rotating guard20in order to further prevent foreign material from accessing gaps between the spindle18, rotating guard mount60, and the final drive housing19leading to the seal area80. In this second alternate embodiment another alternate seal guard220may be provided. The seal guard220may be similar to the rotating guard20of the primary embodiment and the seal guard120of the first alternate embodiment. However, the seal guard220may be provided with an alternate lip seal223at a radially inner end222of a first plate221of the seal guard220. In this alternate embodiment, the lip seal223may form a C-shape having a channel. A press ring224may be configured to mate with the channel of the lip seal223, and may provide for the lip seal223to be held in place when pressed on to a final drive230of the alternate embodiment. Foreign material is thereby prevented from accessing a passage263and thereby prevented from escaping the third space87into the seal area80."], "claims": ["an axle; a plurality of wheels, each of the plurality of wheels mounted on an outboard end of the axle, and having a cylindrical shell extending axially and concentrically about the axle; and a plurality of guard assemblies, each of the plurality of guard assemblies mounted on an outboard end of the axle, and each of the plurality of wheels mounted to the axle such that each of the plurality of wheels covers a respective one of the plurality of guard assemblies, each of the plurality of guard assemblies having: a final drive rotatably supported on an outboard end of the axle and including an annular seal extending between rotating and non-rotating components of the final drive; a rotating element connected to a corresponding one of the plurality of wheels; a rotating guard connected to the final drive; and an internal guard fixed to the axle.", "2 . The work machine of claim 1 , wherein the rotating element further comprises a first protrusion extending radially inward, and a second protrusion extending radially inward, the first protrusion and the second protrusion spaced apart to form a slot.", "3 . The work machine of claim 2 , wherein the rotating guard further comprises a first plate, a second plate having an upper portion extending into the slot of the rotating element and a lower portion, and a connecting portion extending between the first plate and the second plate.", "4 . The work machine of claim 3 , wherein the internal guard further comprises a mounting plate extending toward the connecting portion of the rotating guard, and having a perpendicular plate extending toward the rotating element.", "5 . The work machine of claim 4 , further comprising a first space formed by the mounting plate and the perpendicular plate of the internal guard, the second protrusion of the rotating element, and the axle, the first space trapping material that enters the cylindrical shell of one of the plurality of wheels.", "6 . The work machine of claim 5 , further comprising a second space formed by the internal guard and the rotating guard, the second space trapping an excess of material that has built up from the first space.", "7 . The work machine of claim 6 , further comprising a third space formed by the mounting plate of the internal guard, the rotating guard, the axle, and the final drive, the third space trapping the excess of material that has built up from the second space.", "8 . The work machine of claim 3 , whereby the first plate of the rotating guard further comprises a plurality of holes such that the rotating guard may be connected to the final drive by a plurality of fasteners extending through the plurality of holes.", "9 . The work machine of claim 1 , whereby the rotating guard is annular and formed from welded steel plate or steel castings.", "10 . The work machine of claim 3 , whereby the slot of the rotating element has a thickness that is nominally larger than a thickness of the second plate of the rotating guard such that the rotating element and the rotating guard are rotatably separated and not physically connected.", "11 . The work machine of claim 3 , further comprising a lip seal formed on a radially inner end of the first plate of the rotating guard, and having a radially inward protruding seal element to mate with a corresponding surface in the final drive.", "providing a work machine having a final drive rotatably supported on an outboard end of an axle, and a wheel mounted to an outboard end of the final drive, the wheel having a cylindrical shell extending axially and concentrically about the axle: allowing a foreign material to enter an interior of a wheel drum; restricting the foreign material to pass through a first gap between the axle and a rotating element connected to the wheel drum; bounding the foreign material within a first space defined by the axle, the rotating element, and an internal guard fixed to the axle; restricting the foreign material to pass through a second gap between the rotating element and the internal guard, the second gap being accessible by the foreign material when a first volume of other foreign material has built up within the first space: restricting the foreign material to pass through a third gap between the internal guard and a rotating guard; bounding the foreign material within a second space defined by the internal guard and the rotating guard: restricting the foreign material to pass through a fourth gap between the internal guard and the rotating guard, the third gap being accessible by the foreign material when a second volume of other foreign material has built up within the second space: bounding the foreign material within a third space defined by the rotating guard, the internal guard, the axle, and the final drive: restricting the foreign material to pass through a passage formed between the rotating element and the rotating guard, the passage being accessible by the foreign material as an alternate routing to the third gap: restricting the foreign material to pass through a fifth gap between the rotating element and a rotating guard; and permitting the foreign material to access a seal area contacting an annular seal extending over the final drive, or an excess area separate from the seal area.", "13 . The method of claim 12 , whereby a first plate of the rotating guard further comprises a plurality of holes such that the rotating guard may be connected to the final drive by a plurality of fasteners extending through the plurality of holes.", "14 . The method of claim 12 , whereby the rotating guard is annular and formed from welded steel plate or steel castings.", "15 . The method of claim 12 , whereby the rotating element and the rotating guard are rotatably separated and not physically connected.", "16 . The method of claim 12 , further comprising a lip seal formed on a radially inner end of a first plate of the rotating guard, and having a radially inward protruding seal element to mate with a corresponding surface in the final drive.", "the first plate extends in a radially inward direction from the connecting portion and includes a plurality of holes: the upper portion is configured to extend into a corresponding slot of a rotating element of a wheel of the wheeled industrial machine; and the lower portion is configured to extend toward an axle of the wheeled industrial machine.", "18 . The guard of claim 17 , whereby the rotating guard is formed from welded steel plate or steel castings.", "19 . The guard of claim 17 , whereby the rotating guard may be connected to a final drive by a plurality of fasteners extending through the plurality of holes.", "20 . The guard of claim 17 , further comprising a lip seal formed on a radially inner end of the first plate of the rotating guard, and having a radially inward protruding seal element to mate with a corresponding surface in a final drive."], "bibtex": "@patent{20240308271,\n    title = {SEAL GUARD FOR COMPACTOR},\n    number = {20240308271},\n    year = {2024},\n    note = {File: US20240308271A1-20240919.XML}\n    }", "classification": "B60B3516FI"}, {"title": "RUBBER COMPOSITION FOR TIRE TREAD AND TIRE", "doc_number": "20240308272", "filename": "US20240308272A1-20240919.XML", "abstract": "Provided is a rubber composition for a tire tread that can cause a tire to display excellent wear resistance when used in a tread. The rubber composition for a tire tread contains a rubber component and carbon black. The rubber component includes modified butadiene rubber in a proportion of 5 mass % or more and unmodified butadiene rubber in a proportion of 10 mass % or more. The carbon black has a cetyltrimethylammonium bromide adsorption specific surface area (CTAB) of 130 m 2 /g or more, a ratio (CTAB/IA) of CTAB (m 2 /g) relative to iodine adsorption number (IA) (mg/g) of not less than 0.92 and not more than 1.06, and hydrogen evolution of not less than 3,500 mass ppm and not more than 4,800 mass ppm.", "detailed_description": ["The following describes embodiments of the present disclosure.", "", "However, the following description is intended for illustrative purposes only and is not intended to limit the scope of the present disclosure in any way.", "", "Compounds described in the present specification may be partially or fully derived from fossil resources, biological resources such as plant resources, or recycled resources such as used tires. Moreover, these compounds may be derived from a mixture of two or more from among fossil resources, biological resources, and recycled resources."], "claims": ["the rubber component includes modified butadiene rubber in a proportion of 5 mass % or more and unmodified butadiene rubber in a proportion of 10 mass % or more, and the carbon black has a cetyltrimethylammonium bromide adsorption specific surface area (CTAB) of 130 m", "2 . The rubber composition for a tire tread according to claim 1 , wherein the rubber component includes the modified butadiene rubber in a proportion of 30 mass % or less.", "3 . The rubber composition for a tire tread according to claim 1 , wherein CTAB of the carbon black is not less than 135 m 2 /g and not more than 150 m 2 /g.", "4 . The rubber composition for a tire tread according to claim 1 , wherein content of the carbon black is not less than 40 parts by mass and not more than 70 parts by mass relative to 100 parts by mass of the rubber component.", "5 . The rubber composition for a tire tread according to claim 1 , wherein the rubber component further includes natural rubber.", "6 . A tire comprising a tread in which the rubber composition for a tire tread according to claim 1 is used.", "7 . The rubber composition for a tire tread according to claim 2 , wherein CTAB of the carbon black is not less than 135 m 2 /g and not more than 150 m 2 /g.", "8 . The rubber composition for a tire tread according to claim 2 , wherein content of the carbon black is not less than 40 parts by mass and not more than 70 parts by mass relative to 100 parts by mass of the rubber component.", "9 . The rubber composition for a tire tread according to claim 2 , wherein the rubber component further includes natural rubber.", "10 . A tire comprising a tread in which the rubber composition for a tire tread according to claim 2 is used.", "11 . The rubber composition for a tire tread according to claim 3 , wherein content of the carbon black is not less than 40 parts by mass and not more than 70 parts by mass relative to 100 parts by mass of the rubber component.", "12 . The rubber composition for a tire tread according to claim 3 , wherein the rubber component further includes natural rubber.", "13 . A tire comprising a tread in which the rubber composition for a tire tread according to claim 3 is used.", "14 . The rubber composition for a tire tread according to claim 4 , wherein the rubber component further includes natural rubber.", "15 . A tire comprising a tread in which the rubber composition for a tire tread according to claim 4 is used.", "16 . A tire comprising a tread in which the rubber composition for a tire tread according to claim 5 is used.", "17 . The rubber composition for a tire tread according to claim 7 , wherein content of the carbon black is not less than 40 parts by mass and not more than 70 parts by mass relative to 100 parts by mass of the rubber component.", "18 . The rubber composition for a tire tread according to claim 7 , wherein the rubber component further includes natural rubber.", "19 . A tire comprising a tread in which the rubber composition for a tire tread according to claim 7 is used.", "20 . The rubber composition for a tire tread according to claim 8 , wherein the rubber component further includes natural rubber."], "bibtex": "@patent{20240308272,\n    title = {RUBBER COMPOSITION FOR TIRE TREAD AND TIRE},\n    number = {20240308272},\n    year = {2024},\n    note = {File: US20240308272A1-20240919.XML}\n    }", "classification": "B60C100FI"}, {"title": "DURABLE TIRES AND RELATED METHODS", "doc_number": "20240308273", "filename": "US20240308273A1-20240919.XML", "abstract": "A tire may include: a tread cap; a carcass that comprises a radially outermost ply; a belt structure interposed between the carcass and the tread, the belt structure comprising a radially innermost belt; a pair of sidewall portions, wherein radially outermost portions of each sidewall overlie lateral end portions of the tread cap; a pair of bead regions, wherein the radially innermost belt wraps around the bead regions; a pair wraparound gum layers, wherein each wraparound gum layer wraps around a lateral end portion of the radially innermost belt; and a pair of sidewall gum layers that each extend along an outer surface of the radially outermost ply, wherein a first end of each sidewall gum layer is between the radially outermost ply and the lateral end portion of the radially innermost belt and a second end of each sidewall gum layer is at the bead region.", "detailed_description": [""], "claims": ["first and second annular bead cores axially spaced from one another; a carcass including at least one ply wrapped around the first and second bead cores, each ply of the at least one ply defining a pair of turned up ends extending from the bead cores to outer end points of each ply; first and second bead regions wrapped by the at least one ply such that the first and second bead regions are bounded laterally by the at least one ply and the turned up ends, and bounded radially by radially innermost edges of respective annular bead cores and radially outermost end points of respective turned up ends; a belt structure disposed radially outward of the carcass, the belt structure including a radially innermost belt having first and second lateral end portions terminating in respective first and second lateral edges of the radially innermost belt respectively; and first and second sidewall gum layers each extending along a surface of the at least one ply from a first end to a second end, the first end disposed axially inward of a respective lateral edge of the radially innermost belt and radially between the at least one ply and a respective lateral end portion of the radially innermost belt, the second end disposed within a respective bead region of the first and second bead regions.", "2 . The tire of claim 1 , wherein each of the sidewall gum layers is constructed a rubber and/or an elastomer having a Shore A hardness between 80 and 95.", "3 . The tire of claim 1 , wherein each of the sidewall gum layers is constructed a rubber and/or an elastomer having a RPA G′ 1 percent of 4 MPa or greater.", "4 . The tire of claim 1 , wherein each of the sidewall gum layers has a length within a range from 50 mm to 90 mm.", "5 . The tire of claim 1 , wherein each of the sidewall gum layers has a thickness within a range from 0.2 mm to 2 mm.", "6 . The tire of claim 1 , further comprising a pair of wedges, wherein a first wedge of the pair of wedges is disposed, at least partially, axially inward of the lateral edge of the first lateral end portion of the radially innermost belt and radially between the first lateral end portion and the at least one ply, and wherein a second wedge of the pair of wedges is disposed, at least partially, axially inward of the lateral edge of the second lateral end portion of the radially innermost belt and radially between the second lateral end portion and the at least one ply.", "7 . The tire of claim 6 , wherein the first end of each of the sidewall gum layers is disposed radially between, and in contact with, the at least one ply and a corresponding wedge of the pair of wedges.", "8 . The tire of claim 1 , further comprising first and second wraparound gum layers, wherein the first wraparound gum layer wraps around the first lateral end portion of the radially innermost belt, wherein the second wraparound gum layer wraps around the second lateral end portion of the radially innermost belt, and wherein the first end of each of the sidewall gum layers is disposed radially between and contacting the at least one ply and a corresponding one of first and second of wraparound gum layers.", "9 . The tire of claim 1 , wherein the first end of each of the sidewall gum layers is radially between and contacting the at least one ply and the corresponding first or second lateral end portion of the radially innermost belt.", "10 . The tire of claim 1 , wherein each of the wraparound gum layers extends along an inner surface and an outer surface of the radially innermost belt for a cumulative distance in a range of 10 mm to 30 mm.", "11 . The tire of claim 1 , wherein the pair of wraparound gum layers is a first pair of wraparound gum layers, wherein the belt structure further comprises a second belt, and wherein the tire further comprises a second pair of wraparound gum layers that wrap around lateral end portions of the second belt.", "12 . The tire of claim 1 , wherein the first bead region further comprises a first bead filler apex disposed radially outward of the first annular bead core, wherein the second bead region further comprises a second bead filler apex disposed radially outward of the second annular bead core, and wherein the second end of each of the sidewall gum layers contacts a corresponding one of the first and second bead filler apexes.", "a tread cap; a carcass that comprises at least one ply wrapped around first and second axially spaced bead cores, each ply of the at least one ply defining a pair of turned up ends extending from the bead cores to outer end points of each ply; a belt structure interposed between the carcass and the tread cap, the belt structure comprising a radially innermost belt terminating at opposed first and second lateral edges; a pair of sidewall portions, wherein radially outermost portions of each sidewall overlie lateral end portions of the tread cap; a pair of bead regions each including an annular bead core of the first and second bead cores, wherein the carcass wraps around the pair of bead regions such that the regions are bounded laterally by the at least one ply and the turned up ends, and bounded radially by radially innermost edges of the respective annular bead cores and radially outermost end points of respective turned up ends; and a pair of sidewall gum layers, wherein a first sidewall gum layer extends along a surface of the at least one ply from a first end axially inward of the first lateral edge of the radially innermost belt to a second end within a first bead region of the pair of bead regions, and wherein a second sidewall gum layer extends along the surface of the at least one ply from a first end axially inward of the second lateral edge of the first belt to a second end within a second bead region of the pair of bead regions.", "14 . The tire of claim 13 , further comprising a pair of wedges, wherein an inner end of each wedge is disposed radially between the first belt and the at least one ply and wherein an outer end of each wedge is disposed radially between and in contact with one of the lateral end portions of the tread cap and the at least one ply.", "15 . The tire of claim 14 , further comprising a pair wraparound gum layers, wherein a first wraparound gum layer wraps around a first lateral end portion of the first belt, and wherein a second wraparound gum layer wraps around a second lateral end portion of the first belt, and wherein the inner ends of each wedge are in contact with a corresponding wraparound gum layer.", "16 . The tire of claim 15 , wherein the first end of each of the sidewall gum layers is in contact with the at least one ply and a corresponding wedge.", "17 . The tire of claim 13 , wherein each of the bead regions includes an bead filler apex therein disposed radially outward of the annular bead core therein, and wherein the second end of each sidewall gum layer is in contact with a corresponding bead filler apex.", "18 . The tire of claim 13 , wherein each of the sidewall gum layers has a length in a range of 50 mm to 90 mm.", "19 . The tire of claim 13 , wherein each of the sidewall gum layers comprise a rubber and/or an elastomer having a Shore A hardness between 80 and 95 and a RPA G′ 1 percent of 4 MPa or greater.", "a carcass that comprises at least one ply wrapped around first and second axially spaced bead cores, each ply of the at least one ply defining a pair of turned up ends extending from the bead cores to outer end points of each ply; a belt structure disposed radially outward of the carcass, the belt structure comprising a radially innermost belt having two lateral end portions; a pair of bead regions, wherein the at least one ply wraps around the pair of bead regions such that the regions are bounded laterally by the at least one ply and the turned up ends, and bounded radially by radially innermost edges of the respective annular bead cores and radially outermost end points of respective turned up ends; a pair of sidewall portions, wherein each of the sidewall portions is disposed axially outward of one of the pair of bead regions; and a pair of sidewall gum layers, wherein a first sidewall gum layer is disposed axially between a first sidewall portion of the pair of sidewall portions and extends along a surface of the at least one ply from a first end between the at least one ply and the first lateral end portion of the radially innermost belt to a second end within a first bead region of the pair of bead regions, and wherein a second sidewall gum layer is disposed axially between a second sidewall portion of the pair of sidewall portions and extends along the surface of the at least one ply from a first end between the at least one ply and the second lateral end portion of the radially innermost belt to a second end within a second bead region of the pair of bead regions.", "first and second annular bead cores axially spaced from one another; first and second bead apexes extending radially outward of the first and second annular bead cores; at least one ply, a belt having first and second lateral edges; and first and second sidewall gum layers each having a first end and a second end, wherein the second end is located radially inward of the respective first and second bead apex.", "22 . The tire of claim 21 wherein the first end is disposed axially inward of a respective lateral edge of the belt.", "23 . The tire of claim 21 wherein the first end is located between a shoulder of the tire and a midportion of the sidewall.", "24 . The tire of claim 21 wherein the first end is located radially outward of a midportion of the sidewall.", "25 . The tire of claim 21 wherein the first end is located axially outward of the lateral belt edge.", "26 . The tire of claim 21 , wherein each of the sidewall gum layers is constructed a rubber and/or an elastomer having a Shore A hardness between 80 and 95.", "27 . The tire of claim 21 , wherein each of the sidewall gum layers is constructed a rubber and/or an elastomer having a RPA G′ 1 percent of 4 MPa or greater.", "28 . The tire of claim 21 , wherein each of the sidewall gum layers has a length within a range from 50 mm to 90 mm.", "29 . The tire of claim 21 , wherein each of the sidewall gum layers has a thickness within a range from 0.2 mm to 2 mm.", "30 . The tire of claim 21 further comprising a wedge positioned between a belt lateral edge and the sidewall gum layer.", "31 . The tire of claim 30 wherein the thickness of each wedge is in the range of 0.5 to 1.5 mm.", "32 . The tire of claim 30 wherein each wedge comprises a rubber and/or an elastomer having a Shore A hardness between 80 and 95 and a RPA G′ 1 percent of 4 MPa or greater.", "33 . The tire of claim 21 further comprising a wrap around gum strip secured to the lateral belt edge.", "34 . The tire of claim 33 wherein the wrap around gum strip comprises a rubber and/or an elastomer having a Shore A hardness between 80 and 95 and a RPA G′ 1 percent of 4 MPa or greater.", "35 . The tire of claim 33 wherein the thickness of the wrap around gum strip is in the range of 0.2 mm to 0.7 mm."], "bibtex": "@patent{20240308273,\n    title = {DURABLE TIRES AND RELATED METHODS},\n    number = {20240308273},\n    year = {2024},\n    note = {File: US20240308273A1-20240919.XML}\n    }", "classification": "B60C918FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240308274", "filename": "US20240308274A1-20240919.XML", "abstract": "The present invention relates to a pneumatic tire having a tread comprising a tread base layer and a tread cap. The tread cap comprises a first tread cap layer and a second tread cap layer of different polymeric compositions, the tread cap having a central cap zone Z C and two lateral cap zones Z L the lateral cap zones Z L being located axially adjacent to the central cap zone Z C and on axially opposite sides of the central cap zone Z C .", "detailed_description": ["The present invention relates to a pneumatic tire having a tread comprisinga tread base layer;a tread cap comprising a first tread cap layer and a second tread cap layer of different polymeric compositions, the tread cap having a central cap zone ZCand two lateral cap zones ZLthe lateral cap zones ZLbeing located axially adjacent to the central cap zone ZCand on axially opposite sides of the central cap zone ZC,wherein the first tread cap layer is arranged radially outside of the tread base layer and axially extends through the central cap zone ZCand both lateral cap zones ZL,wherein the second tread cap layer is arranged within the central cap zone ZCand radially outside of both the tread base layer and at least part of the first tread cap layer, wherein the second tread cap layer comprises at least three ribs at least partially extending radially inward, wherein a central rib of the at least three ribs extends further inward than two lateral ribs of the at least three ribs.", "", "Preferably, the pneumatic tire further comprises two lateral skirt layers arranged axially adjacent to the tread base layer and the first tread cap layer and on axially opposite sides of the tread base layer and the first and second tread cap layers.", "", "Preferably, the lateral skirt layers have a different composition than the tread base layer. Preferably, the lateral skirt layers comprises one or more polymers, such as elastomeric composition. Preferably, the lateral skirt layers have a different composition than the first tread cap layer. Preferably, the lateral skirt layers have a different composition than the second tread cap layer. More preferably, the lateral skirt layer, the tread base layer, the first tread cap layer and the second tread cap layer have different physical compositions. More preferably, the lateral skirt layer, the tread base layer, the first tread cap layer and the second tread cap layer have different physical and chemical compositions.", "", "Preferably, the lateral skirt layers are arranged symmetrically about a center line C axially bisecting the tread.", "", "Preferably, the lateral skirt layers are arranged asymmetrically about a center line C axially bisecting the tread.", "", "Preferably, the central cap zone ZCis positioned axially symmetrically about a center line C axially bisecting the tread, and wherein both lateral cap zones ZLare positioned axially symmetrically with respect to each other about the center line C.", "", "Preferably, the central cap zone ZCis positioned axially asymmetrically about a center line C axially bisecting the tread, and wherein both lateral cap zones ZLare positioned axially asymmetrically with respect to each other about the center line C.", "", "The polymeric composition of the first tread cap layer can be any polymeric composition known by the skilled person to the extent that it is suitable for a tread cap layer in a pneumatic tire. Preferably, the polymeric composition of the first tread cap layer comprises one or more of an elastomer composition, silica and a silane coupling agent, such as a sulfur-containing organosilane, more preferably one or more of an elastomer composition and a silane couplig agent, more preferably an elastomer composition and a silane couplig agent.", "", "Preferably, the polymeric composition of the first tread cap layer is a rubber composition.", "", "Preferably, the central rib of the first tread cap layer is disposed axially symmetrically about a center line C axially bisecting the tread, and wherein the two lateral ribs are disposed axially symmetrically with respect to each other about the center line C.", "", "Preferably, the central rib of the first tread cap layer is disposed axially asymmetrically about a center line C axially bisecting the tread, and wherein the two lateral ribs are disposed axially asymmetrically with respect to each other about the center line C.", "", "Preferably, at least one of the ribs of the first tread cap layer have a cross-section composed of two trapezoids placed next to each other. Preferably, at least two of the ribs have a cross-section composed of two trapezoids placed next to each other. Preferably, all three of the ribs have a cross-section composed of two trapezoids placed next to each other. Preferably, the cross section composed of two trapezoids has rounded edges.", "", "Preferably, the two trapezoids each have one pair of parallel sides, wherein the two trapezoids are placed next to each other, such that the longer one of the parallel sides of each trapezoids are arranged adjacently. Preferably, the two trapezoids of different shapes have one pair of parallel sides, wherein the two trapezoids are placed next to each other, such that the longer one of the parallel sides of each trapezoids are arranged adjacently.", "", "Preferably, a bigger trapezoid cross section is arranged radially outside of a smaller trapezoid cross section. Preferably, a bigger trapezoid cross section having rounded edges is arranged radially outside of a smaller trapezoid cross section having rounded edges.", "", "Preferably, a part of the at least one rib having a bigger trapezoid cross section protrudes radially outward, while a part of the at least one rib having a smaller trapezoid cross section extends radially inward into the second tread cap layer. Preferably, a part of the at least one rib having a bigger trapezoid cross section with longer parallel sides protrudes radially outward, while a part of the at least one rib having a smaller trapezoid cross section with shorter parallel sides extends radially inward into the second tread cap layer.", "", "Preferably, a part of the two-trapezoid cross section protruding radially outward is the same for the central rib and the lateral ribs.", "", "Preferably, a part of the two-trapezoid cross section extending radially inward is the same for both the lateral ribs. Preferably, a part of the two-trapezoid cross section extending radially inward into the second tread cap is the same for both the lateral ribs. Preferably, a part of the two-trapezoid cross section of the central rib extends further radially inward than the two-trapezoid cross section of the lateral ribs.", "", "Preferably, the at least three ribs are configured for contacting ground at least with their outwards protruding parts when the tire is in use.", "", "The polymeric composition of the second tread cap layer can be any polymeric composition known by the skilled person to the extent that it is suitable for a tread cap in a pneumatic tire. Preferably, the polymeric composition of the second tread cap layer comprises one or more of an elastomer composition, silica and a coupling agent.", "", "Preferably, the polymeric composition of the first tread cap layer is a rubber composition.", "", "Preferably, the second tread cap layer has a chemical and physical composition different to the first tread cap layer composition.", "", "Preferably, the rebound at 23° C. of the polymeric composition of the first tread cap layer is higher than the rebound at 23° C. of the polymeric composition of the second tread cap layer.", "", "Preferably, the tan delta (10%) at 100° C. of the polymeric composition of the first tread cap layer is lower than the tan delta (10%) at 100° C. of the polymeric composition of the second tread cap layer.", "", "Preferably, the tan delta (10%) at 100° C. of the polymeric composition of the first tread cap layer is in the range of from 50 to 80%, more preferably from 60 to 75%, of the tan delta (10%) at 100° C. of the polymeric composition of the second tread cap layer.", "", "Preferably, the stiffness of the polymeric composition of the first tread cap layer is higher than the stiffness of the polymeric composition of the second tread cap layer.", "", "Preferably, the rolling resistance of the polymeric composition of the first tread cap layer is lower than the rolling resistance of the polymeric composition of the second tread cap layer.", "", "Preferably, the stiffness of the tread cap is higher than the stiffness of the lateral skirt layers.", "", "Preferably, the total rolling resistance impact of the lateral tread skirt layers is less than the total rolling resistance impact of the tread cap layers.", "", "Preferably, the stiffness of the tread base is higher than the stiffness of the first tread cap layer and the stiffness of the tread base is higher than the stiffness of the second tread cap layer. Preferably, the second tread cap layer in each of the lateral cap zones ZLforms a shoulder configured for contacting ground when the tire is in use.", "", "Preferably, the tread base layer comprises a polymeric composition comprising reinforcing wires embedded therein. Preferably, the tread base layer comprises a polymeric composition comprising reinforcing metal and/or textile, more preferably metal, wires embedded therein. The polymeric composition of the tread base layer can be any polymeric composition known by the skilled person to the extent that it is suitable for a tread base layer in a pneumatic tire. Preferably, the polymeric composition of the tread base layer is a rubber composition.", "", "Preferably, the tread base layer comprises a chimney structure protruding through the first and second tread cap layer and configured for conducting static electrical charge. Preferably, the chimney structure interrupts the first tread cap layer that extends through the central cap zone ZCand both lateral cap zones ZL.", "", "Preferably, the chimney structure is arranged symmetrically about a center line C axially bisecting the tread.", "", "Preferably, the chimney structure is arranged asymmetrically about a center line C axially bisecting the tread.", "", "The different polymeric compositions of the tread base layer, first thread cap layer, second tread cap layer and lateral skirt layers can be any polymeric compositions as long as they are suitable for a tread base layer, a tread cap and lateral skirt layers, respectively, as well known in the art. The physical properties of said layers, such as stiffness and rolling resistance, can be adapted depending on the layers by the addition for example of one or more additives and/or fillers in the polymeric composition as well known by the skilled person in the art.", "", "The present invention is further illustrated by the following set of embodiments and combinations of embodiments resulting from the dependencies and back-references as indicated. In particular, it is noted that in each instance where a range of embodiments is mentioned, for example in the context of a term such as “The pneumatic tire of any one of embodiments 1 to 3”, every embodiment in this range is meant to be explicitly disclosed for the skilled person, i.e. the wording of this term is to be understood by the skilled person as being synonymous to “The pneumatic tire of any one of embodiments 1, 2 and 3”. Further, it is explicitly noted that the following set of embodiments represents a suitably structured part of the general description directed to preferred aspects of the present invention, and, thus, suitably supports, but does not represent the claims of the present invention.", "", "According to embodiment 1 of the present invention relating to a pneumatic tire having a tread, the tread comprisesa tread base layer;a tread cap comprising a first tread cap layer and a second tread cap layer of different polymeric compositions, the tread cap having a central cap zone ZCand two lateral cap zones ZLthe lateral cap zones ZLbeing located axially adjacent to the central cap zone ZCand on axially opposite sides of the central cap zone ZC,wherein the first tread cap layer is arranged radially outside of the tread base layer and axially extends through the central cap zone ZCand both lateral cap zones ZL,wherein the second tread cap layer is arranged within the central cap zone ZCand radially outside of both the tread base layer and at least part of the first tread cap layer, wherein the second tread cap layer comprises at least three ribs at least partially extending radially inward, wherein a central rib of the at least three ribs extends further inward than two lateral ribs of the at least three ribs.", "", "Embodiment 2: The pneumatic tire of embodiment 1, further comprising two lateral skirt layers arranged axially adjacent to the tread base layer and the first tread cap layer and on axially opposite sides of the tread base layer and the first and second tread cap layers.", "", "Embodiment 3: The pneumatic tire of embodiment 1 or 2, wherein the lateral skirt layers have a chemical and physical composition different to the tread base layer's composition, to the first tread cap layer's composition and to the second tread cap layer's composition.", "", "Embodiment 4: The pneumatic tire of any one of embodiments 1 to 3, wherein the lateral skirt layers are arranged symmetrically about a center line C axially bisecting the tread.", "", "Embodiment 5: The pneumatic tire of any one of embodiments 1 to 3, wherein the lateral skirt layers are arranged asymmetrically about a center line C axially bisecting the tread.", "", "Embodiment 6: The pneumatic tire of any one of embodiments 1 to 5, wherein the central cap zone ZCis positioned axially symmetrically about a center line C axially bisecting the tread, and wherein both lateral cap zones ZLare positioned axially symmetrically with respect to each other about the center line C.", "", "Embodiment 7: The pneumatic tire of any one of embodiments 1 to 5, wherein the central cap zone ZCis positioned axially asymmetrically about a center line C axially bisecting the tread, and wherein both lateral cap zones ZLare positioned axially asymmetrically with respect to each other about the center line C.", "", "Embodiment 8: The pneumatic tire of any one of embodiments 1 to 7, wherein the polymeric composition of the first tread cap layer comprises one or more of an elastomer composition, silica and a silane coupling agent.", "", "Embodiment 9: The pneumatic tire of any one of embodiments 1 to 8, wherein the polymeric composition of the first tread cap layer is a rubber composition.", "", "Embodiment 10: The pneumatic tire of any one of embodiments 1 to 9, wherein the central rib of the first tread cap layer is disposed axially symmetrically about a center line C axially bisecting the tread, and wherein the two lateral ribs are disposed axially symmetrically with respect to each other about the center line C.", "", "Embodiment 11: The pneumatic tire of any one of embodiments 1 to 9, wherein the central rib of the first tread cap layer is disposed axially asymmetrically about a center line C axially bisecting the tread, and wherein the two lateral ribs are disposed axially asymmetrically with respect to each other about the center line C.", "", "Embodiment 12: The pneumatic tire of any one of embodiments 1 to 11, wherein at least one of the ribs of the first tread cap layer, preferably at least two, preferably all three of the ribs, have a cross-section composed of two trapezoids placed next to each other.", "", "Embodiment 13: The pneumatic tire of embodiment 12, wherein at least one of the ribs of the first tread cap layer, preferably at least two, preferably all three of the ribs, have a cross-section composed of two trapezoids placed next to each other, the cross section having rounded edges.", "", "Embodiment 14: The pneumatic tire of embodiment 12 or 13, wherein the two trapezoids, preferably of different shapes, each have one pair of parallel sides, wherein the two trapezoids are placed next to each other, such that the longer one of the parallel sides of each trapezoids are arranged adjacently.", "", "Embodiment 15: The pneumatic tire of any one of embodiments 12 to 14, wherein a bigger trapezoid cross section is arranged radially outside of a smaller trapezoid cross section.", "", "Embodiment 16: The pneumatic tire of any one of embodiments 12 to 15, wherein a part of the at least one rib having a bigger, preferably with longer parallel sides, trapezoid cross section protrudes radially outward, while a part of the at least one rib having a smaller, preferably with shorter parallel sides, trapezoid cross section extends radially inward into the second tread cap layer.", "", "Embodiment 17: The pneumatic tire of any one of embodiments 12 to 16, wherein a part of the two-trapezoid cross section protruding radially outward is the same for the central rib and the lateral ribs.", "", "Embodiment 18: The pneumatic tire of any one of embodiments 12 to 17, wherein a part of the two-trapezoid cross section extending radially inward, preferably into the second tread cap, is the same for both the lateral ribs.", "", "Embodiment 19: The pneumatic tire of any one of embodiments 1 to 18, wherein the at least three ribs are configured for contacting ground at least with their outwards protruding parts when the tire is in use.", "", "Embodiment 20: The pneumatic tire of any one of embodiments 1 to 19, wherein the polymeric composition of the second tread cap layer comprises one or more of an elastomer composition, silica and a coupling agent.", "", "Embodiment 21: The pneumatic tire of any one of embodiments 1 to 20, wherein the polymeric composition of the first tread cap layer is a rubber composition.", "", "Embodiment 22: The pneumatic tire of any one of embodiments 1 to 21, wherein the rebound at 23° C. of the polymeric composition of the first tread cap layer is higher than the rebound at 23° C. of the polymeric composition of the second tread cap layer.", "", "Embodiment 23: The pneumatic tire of any one of embodiments 1 to 22, wherein the tan delta (10%) at 100° C. of the polymeric composition of the first tread cap layer is lower than the tan delta (10%) at 100° C. of the polymeric composition of the second tread cap layer.", "", "Embodiment 24: The pneumatic tire of any one of embodiments 1 to 23, wherein the tan delta (10%) at 100° C. of the polymeric composition of the first tread cap layer is in the range of from 50 to 80%, preferably from 60 to 75%, of the tan delta (10%) at 100° C. of the polymeric composition of the second tread cap layer.", "", "Embodiment 25: The pneumatic tire of any one of embodiments 1 to 24, wherein the stiffness of the polymeric composition of the first tread cap layer is higher than the stiffness of the polymeric composition of the second tread cap layer.", "", "Embodiment 26: The pneumatic tire of any one of embodiments 1 to 25, wherein the rolling resistance of the polymeric composition of the first tread cap layer is lower than the rolling resistance of the polymeric composition of the second tread cap layer.", "", "Embodiment 27: The pneumatic tire of any one of embodiments 2 to 26, as far as any one of embodiments 3 to 26 depends on embodiment 2, wherein the stiffness of the tread cap is higher than the stiffness of the lateral skirt layers.", "", "Embodiment 28: The pneumatic tire of any one of embodiments 2 to 27, as far as any one of embodiments 3 to 27 depends on embodiment 2, wherein the total rolling resistance impact of the lateral tread skirt layers is less than the total rolling resistance impact of the tread cap layers.", "", "Embodiment 29: The pneumatic tire of any one of embodiments 1 to 28, wherein the stiffness of the tread base is higher than the stiffness of the second tread cap layer.", "", "Embodiment 30: The pneumatic tire of any one of embodiments 1 to 29, wherein the stiffness of the tread base is higher than the stiffness of the first tread cap layer.", "", "Embodiment 31: The pneumatic tire of any one of embodiments 1 to 30, wherein the second tread cap layer in each of the lateral cap zones ZLforms a shoulder configured for contacting ground when the tire is in use.", "", "Embodiment 32: The pneumatic tire of any one of embodiments 1 to 31, wherein the tread base layer comprises a polymeric composition comprising reinforcing wires embedded therein, preferably metal reinforcing wires; wherein the polymeric composition preferably is a rubber composition.", "", "Embodiment 33: The pneumatic tire of any one of embodiments 1 to 32, wherein the tread base layer comprises a chimney structure protruding through the first and second tread cap layer and configured for conducting static electrical charge, preferably the chimney structure interrupts the first tread cap layer that extends through the central cap zone ZCand both lateral cap zones ZL.", "", "Embodiment 34: The pneumatic tire of any one of embodiments 1 to 33, wherein the chimney structure is arranged symmetrically about a center line C axially bisecting the tread.", "", "Embodiment 35: The pneumatic tire of any one of embodiments 1 to 33, wherein the chimney structure is arranged asymmetrically about a center line C axially bisecting the tread.", "", "InFIG.1, a schematic cross-section of a tread of a pneumatic tire according to the present invention is illustrated. Specifically, the illustrated cross-section shows the tread of the pneumatic tire in an un-cured state. The pneumatic tire1comprises a tread2, wherein the tread2comprises a tread base layer4and a tread cap6. The tread cap6comprises a first tread cap layer8and a second tread cap layer10of different polymeric compositions. The tread cap6has a central cap zone ZCand two lateral cap zones ZL. The lateral cap zones ZLare located axially adjacent to the central cap zone ZCand on axially opposite sides of the central cap zone ZC. The first tread cap layer8is arranged radially outside of the tread base layer4and axially extends through the central cap zone ZCand both lateral cap zones ZL. The second tread cap layer10is arranged within the central cap zone ZCand radially outside of both the tread base layer4and at least part of the first tread cap layer8. Further, the second tread cap layer10comprises at least three ribs12at least partially extending radially inward, wherein a central rib14of the at least three ribs12extends further inward than two lateral ribs16of the at least three ribs12.", "", "Further, the tread2of the pneumatic tire1may comprise two lateral skirt layers18arranged axially adjacent to the tread base layer4and the first tread cap layer8and on axially opposite sides of the tread base layer4and both the first cap layer8and the second cap layer10.", "", "As exemplarily illustrated inFIG.1, the lateral skirt layers18may be arranged symmetrically about a center line C of the pneumatic tire1. Specifically, the center line C may be axially bisecting the tread2of the pneumatic tire1. Alternatively, however, and as not shown inFIG.1, the lateral skirt layers18may be arranged asymmetrically about the center line C of the pneumatic tire1.", "", "The tread base layer10may comprises a chimney structure20protruding through the first tread cap layer8and through the second tread cap layer10. The chimney structure20may be configured for conducting static electrical charge. Preferably the chimney structure20may interrupt the first tread cap layer8, specifically the first tread cap layer8that extends through the central cap zone ZCand both lateral cap zones ZL.", "", "In a cured state, the lines and/or borders within the tread illustrated inFIG.1may be blurred as known by the skilled person.", "", "InFIG.1, the legends are as below:1: pneumatic tire2: tread4: tread base layer6: tread cap8: first tread cap layer10: second tread cap layer12: rib14: central rib16: lateral rib18: skirt layer20: chimney structureC: center lineZL: lateral cap zoneZC: central cap zone.", "", "Variations in the present invention are possible in light of the description of it provided herein. While certain representative embodiments and details have been shown for the purpose of illustrating the subject invention, it will be apparent to those skilled in this art that various changes and modifications can be made therein without departing from the scope of the subject invention. It is, therefore, to be understood that changes can be made in the particular embodiments described which will be within the full intended scope of the invention as defined by the following appended claims."], "claims": ["a tread base layer; a tread cap comprising a first tread cap layer and a second tread cap layer of different polymeric compositions, the tread having a central zone Z wherein the first tread cap layer is arranged radially outward of the tread base layer and axially extends through the central zone Z wherein the second tread cap layer is arranged within the central zone Z wherein the tread comprises a center rib with grooves located on each side of the center rib, wherein the center rib is formed of the first tread cap layer and the second tread cap layer, and wherein a first finger-like portion of the second tread cap layer extends radially inward of at least one of the grooves.", "2 . The pneumatic tire of claim 1 , wherein the second tread cap layer is not located within the lateral zones.", "3 . The pneumatic tire of claim 1 , wherein the tread further comprises a second finger-like portion of the second tread cap layer which extends radially inward of an adjacent groove.", "4 - 17 . (canceled)", "18 . The pneumatic tire of claim 1 , wherein the tread comprises a chimney structure positioned in the center rib and first finger-like projection and configured for conducting static electrical charge.", "19 . The pneumatic tire of claim 18 , wherein the chimney structure is arranged symmetrically about a center line C axially bisecting the tread.", "20 . The pneumatic tire of claim 18 , wherein the chimney structure is arranged asymmetrically about a center line C axially bisecting the tread.", "21 - 26 . (canceled)", "27 . The pneumatic tire of claim 1 wherein the first finger-like portion of the second tread cap layer is located on the tire centerline.", "28 . The pneumatic tire of claim 1 wherein the tread further comprises a first and second lateral rib, and wherein the second finger-like portion is located radially inward of the first lateral rib.", "29 . The pneumatic tire of claim 28 wherein the tread further comprised a third finger-like portion that is located radially inward of the second lateral rib.", "30 . The pneumatic tire of claim 28 wherein the first finger-like portion extends radially inward of the second finger-like portion.", "31 . The pneumatic tire of claim 28 wherein the first finger-like portion extends radially inward of the third finger-like portion."], "bibtex": "@patent{20240308274,\n    title = {PNEUMATIC TIRE},\n    number = {20240308274},\n    year = {2024},\n    note = {File: US20240308274A1-20240919.XML}\n    }", "classification": "B60C1100FI"}, {"title": "TIRE", "doc_number": "20240308275", "filename": "US20240308275A1-20240919.XML", "abstract": "A tire can include a tread portion and a buttress portion. The tread portion can include a crown region between a tire equator and a middle position and a shoulder region between a first tread ground-contact end and the middle position. The buttress portion can have a land ratio which is a land portion ratio between the first tread ground-contact end and a first position. A land ratio of the shoulder region can be larger than a land ratio of the crown region and the land ratio of the buttress portion.", "detailed_description": ["Hereinafter, one or more embodiments of the present disclosure will be described with reference to the drawings. The drawings may contain exaggerated expressions and expressions that differ from the dimensional ratio of the actual structure in order to help the understanding of the one or more embodiments of the present disclosure. In addition, when there are a plurality of embodiments, the same or common elements may be denoted by the same reference characters throughout the description, and the redundant description thereof is omitted.", "", "One or more embodiments of the present disclosure have been made in view of the above circumstances, and an object of the present of one or more embodiments of the present disclosure, among one or more objects, can be to provide a tire that can reduce exterior noise while suppressing deterioration of mud performance.", "", "As a result of employing configurations based on the description herein, the tire according to one or more embodiments of the present disclosure can reduce exterior noise while suppressing deterioration of mud performance.", "", "FIG.1is a partially enlarged view of a tire meridian cross-section, of a tire1according to one or more embodiments of the present disclosure, including a tire rotation axis.FIG.2is a partial perspective cross-sectional view of the tire1inFIG.1. The tire1according to one or more embodiments of the present disclosure can be suitably used, for example, as a pneumatic tire for a passenger car, specifically, as a tire for a four-wheel-drive vehicle capable of running on muddy terrain. However, one or more embodiments of the present disclosure are not so limited and may be used, for example, for a heavy duty pneumatic tire, and even for a non-pneumatic tire the interior of which is not filled with pressurized air.", "", "In the present specification, unless otherwise specified, dimensions and the like of components of the tire1can be values measured in a standardized state. In the case of a pneumatic tire for which various standards are defined, the “standardized state” can be regarded as a state where the tire is fitted on a standardized rim and inflated to a standardized internal pressure and no load is applied to the tire. In the case of a tire for which various standards are not defined, the standardized state can mean a standard use state, corresponding to the purpose of use of the tire, where the tire is not mounted on a vehicle and no load is applied to the tire.", "", "The “standardized rim” can be regarded as a rim that is defined, in a standard system including a standard on which the tire is based, by the standard for each tire, and can be, for example, the “standard rim” in the JATMA standard, the “Design Rim” in the TRA standard, or the “Measuring Rim” in the ETRTO standard.", "", "The “standardized internal pressure” can be regarded as an air pressure that is defined, in a standard system including a standard on which the tire is based, by the standard for each tire, and can be the “maximum air pressure” in the JATMA standard, the maximum value indicated in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, or the “INFLATION PRESSURE” in the ETRTO standard, as examples.", "", "As shown inFIG.1andFIG.2, the tire1can include a tread portion2and a buttress portion Bt. The tread portion2can have a first tread ground-contact end T1. The buttress portion Bt can extend outward in the tire axial direction from the first tread ground-contact end T1.", "", "The tread portion2can include a middle position2cin the tire axial direction between the first tread ground-contact end T1and a tire equator C, a crown region Cr between the tire equator C and the middle position2c, and a shoulder region Sh between the first tread ground-contact end T1and the middle position2c. During tire running, the shoulder region Sh can be regarded as a region from which noise due to vibration and air column resonance is likely to leak to the outside of the tire1and which can contribute to exterior noise. Meanwhile, the crown region Cr which is located away from the first tread ground-contact end T1and the buttress portion Bt which extends outward in the tire axial direction from the first tread ground-contact end T1can contribute relatively little to exterior noise.", "", "The buttress portion Bt can have a land ratio D which can be a land portion ratio between the first tread ground-contact end T1and a first position P1separated from an outer end2ein the tire radial direction of the tread portion2inward in the tire radial direction by a distance La which is 23% of a tire cross-sectional height Ha. A land ratio B of the shoulder region Sh can be larger than a land ratio A of the crown region Cr and the land ratio D of the buttress portion Bt. Accordingly, the noise leaking from the shoulder region Sh to the outside of the tire1can be reduced. Meanwhile, in the crown region Cr and the buttress portion Bt, a shearing force on mud by grooves provided in the crown region Cr and the buttress portion Bt (hereinafter, simply referred to as “shearing force”) can be exerted. Therefore, the tire1according to one or more embodiments of the present disclosure can reduce exterior noise while suppressing deterioration of mud performance. A reason why the first position P1is adopted for the land ratio D can be that the first position P1can be the inner end in the tire radial direction of a region that can have a large opportunity to come into contact with mud during running on muddy terrain regardless of the size of the tire1(region where a shearing force is exerted). The outer end2ecan be the position at which a tread surface2sof the tread portion2and the tire equator C intersect each other. In the case where a groove (groove11described later) is provided on the tire equator C, the outer end2ecan be the position at which the tire equator C and a virtual tread surface2vobtained by filling the groove intersect each other. The tire cross-sectional height Ha can be the distance in the tire radial direction between a bead base line and the outer end2e. The bead base line can be a line extending in the tire axial direction and passing through the rim diameter position of the standardized rim.", "", "The land ratio A and the land ratio B can each be specified as a ratio (K/Ka) of a surface area K of a tread surface in the region Cr or Sh to a surface area Ka of a virtual tread surface obtained by filling all grooves11in the region Cr or Sh. The land ratio B can be specified as a ratio obtained on the assumption that an opening O1at the first tread ground-contact end T1of each buttress lateral groove23provided on the buttress portion Bt is not present. The land ratio D can be specified by the following equation (1) using a virtual surface K1and a total K2of opening areas of buttress lateral grooves23connected to the first tread ground-contact end T1. The land ratio D can be specified as a ratio obtained on the assumption that an opening O2at the first tread ground-contact end T1of each groove11provided on the tread portion2is not present.", "", "D=(K⁢1-K⁢2)/K⁢1(1)", "", "The virtual surface K1can be an annular surface formed by connecting the first tread ground-contact end T1and a first point e, on the outer surface of the buttress portion Bt, which is on the outermost side in the tire axial direction at the first position P1, by a straight line n10. The “opening area” can be the area on the virtual surface K1of the buttress lateral groove23.", "", "The land ratio B (%) of the shoulder region Sh can be larger than the land ratio D (%) of the buttress portion Bt, for instance, by preferably 20 points or more and further preferably 30 points or more, and by preferably 50 points or less and further preferably 40 points or less. Since the difference (B-D) in land ratio can be 20 points or more, the land ratio B of the shoulder region Sh can be made moderately larger, so that exterior noise can be reduced. In addition, since the difference (B-D) in land ratio can be 50 points or less, an excessive decrease in the stiffness of the buttress portion Bt can be suppressed, so that a shearing force on mud can be exerted.", "", "The crown region Cr can be a region that may generate pitch sound or air column resonance sound and that contributes more to exterior noise than the buttress portion Bt. Therefore, it may be desirable to further reduce exterior noise by making the land ratio A of the crown region Cr larger than the land ratio D of the buttress portion Bt.", "", "In order to effectively exhibit the above-described effects, according to one or more embodiments of the present disclosure, the land ratio B of the shoulder region Sh can be preferably not less than 70% and further preferably not less than 75%, and can be preferably not greater than 90% and further preferably not greater than 85%. In addition, according to one or more embodiments of the present disclosure, the land ratio A of the crown region Cr can be preferably not less than 50% and further preferably not less than 55%, and can be preferably not greater than 70% and further preferably not greater than 65%. Furthermore, according to one or more embodiments of the present disclosure, the land ratio D of the buttress portion Bt can be preferably not less than 30% and further preferably not less than 35%, and can be preferably not greater than 50% and further preferably not greater than 45%.", "", "FIG.3is a plan view of the tread portion2and the buttress portion Bt according to one or more embodiments of the present disclosure, developed or presented in a flat surface. As shown inFIG.3, the tread portion2can further have a second tread ground-contact end T2. The first tread ground-contact end T1and the second tread ground-contact end T2can both ve ends in the tire axial direction of a ground-contact surface2a(e.g., as shown inFIG.5) in a standardized load-applied state. The “standardized load-applied state” can be regarded as a state where the tire1is fitted on the standardized rim with the standardized internal pressure and is brought into contact with a flat surface at a camber angle of 0° with 80% of a load represented by a load index (LI) being applied to the tire1.", "", "In the present specification, the load index (LI) can be, for example, an index that is defined by the JATMA standard and can represent a maximum mass allowed to be applied to a tire under a specified condition, that is, a maximum load capacity, as an index number.", "", "The tread portion2can include a plurality of grooves11. According to one or more embodiments, the plurality of grooves11can include a crown circumferential groove12extending on the tire equator C, and a plurality of (e.g., a pair) shoulder circumferential grooves13provided on both sides of the tire equator C. According to one or more embodiments, the pair of shoulder circumferential grooves13can be located in the shoulder regions Sh. In addition, according to one or more embodiments of the present disclosure, the tread portion2can have a pattern that is point-symmetric with respect to any point on the tire equator C. Therefore, in the present specification, the description of the tread portion2between the tire equator C and the first tread ground-contact end T1can also serve as a description of the tread portion2between the tire equator C and the second tread ground-contact end T2. The tread portion2may not be limited to such a mode, and may have a pattern that is line-symmetric with respect to the tire equator C, or may have an asymmetric pattern.", "", "According to one or more embodiments of the present disclosure, the crown circumferential groove12and the shoulder circumferential groove13can extend in a straight manner and can be parallel to the tire circumferential direction. Each of groove widths W1of the crown circumferential groove12and the shoulder circumferential groove13can be preferably not less than 2% and further preferably not less than 3% of a tread width TW, and can be preferably not greater than 7% and further preferably not greater than 6% of the tread width TW, as examples. However, the crown circumferential groove12and the shoulder circumferential groove13may not be limited to such a mode. The tread width TW can be the separation distance in the tire axial direction between the first tread ground-contact end T1and the second tread ground-contact end T2.", "", "The tread portion2according to one or more embodiments of the present disclosure can include a crown land portion25located between the crown circumferential groove12and the shoulder circumferential groove13, and a shoulder land portion26located between the shoulder circumferential groove13and the first tread ground-contact end T1.", "", "The plurality of grooves11can also include, for example, crown grooves15provided on the crown land portion25, and shoulder grooves16provided on the shoulder land portion26. The crown grooves15can include a plurality of crown lateral grooves17traversing the crown land portion25, crown longitudinal grooves18connecting the crown lateral grooves17adjacent to each other in the tire circumferential direction, and crown sub-lateral grooves19each having an end portion19eterminating within the crown land portion25at one end thereof. The shoulder grooves16can include, for example, a plurality of shoulder lateral grooves20connected to the first tread ground-contact end T1. In the present embodiment, the shoulder grooves16can also include shoulder sub-lateral grooves21connecting the first tread ground-contact end T1and the shoulder circumferential groove13. In the present specification, the term “sub-lateral groove” can refer to a groove with a groove width of less than 2 mm in the form of a cutout, and can be distinguished from lateral grooves, longitudinal grooves, and circumferential grooves having a groove width of 2 mm or more.", "", "According to one or more embodiments, each crown lateral groove17can be inclined with respect to the tire axial direction. A groove width W2of the crown lateral groove17can be, for example, 20% to 60% of the groove width W1of the crown circumferential groove12. According to one or more embodiments, each crown longitudinal groove18can be located at the middle in the tire axial direction of the crown land portion25and can extend parallel to the tire circumferential direction. A groove width W3of the crown longitudinal groove18can be, for example, 10% to 30% of the groove width W1of the crown circumferential groove12. According to one or more embodiments, each crown sub-lateral groove19can be provided between the crown lateral grooves17adjacent to each other in the tire circumferential direction and can extend parallel to the crown lateral grooves17. The crown sub-lateral grooves19can include, for example, first crown sub-lateral grooves19A connected to the crown circumferential groove12, and second crown sub-lateral grooves19B connected to the shoulder circumferential groove13.", "", "According to one or more embodiments, each shoulder lateral groove20can have an end portion20eterminating within the shoulder land portion26and extends parallel to the tire axial direction. The end portion20eof the shoulder lateral groove20can be located, for example, at the middle in the tire axial direction of the shoulder land portion26. A groove width W4of the shoulder lateral groove20can be preferably 20% to 60% of the groove width W1of the crown circumferential groove12, as an example range. According to one or more embodiments, each shoulder sub-lateral groove21can be provided between the shoulder lateral grooves20adjacent to each other in the tire circumferential direction and can extend parallel to the shoulder lateral grooves20.", "", "A total Ja of edge components in the tire axial direction of the grooves11provided in the crown region Cr among the plurality of grooves11can be preferably not less than 30% and further preferably not less than 35% of a total Jb of edge components in the tire axial direction of the grooves11provided in the shoulder region Sh among the plurality of grooves11, and can be preferably not greater than 50% and further preferably not greater than 45% of the total Jb. Since the total Ja may be not less than 30% of the total Jb, a scratching force on mud in the crown region Cr can be maintained, for instance, so that deterioration of mud performance is suppressed. Since the total Ja may be not greater than 50% of the total Jb, the stiffness in the tire circumferential direction of the crown region Cr can be maintained, for instance, so that stable running on muddy terrain can be achieved.", "", "A total Sa of edge components in the tire circumferential direction of the grooves11provided in the crown region Cr among the plurality of grooves11can be preferably not less than 300% and further preferably not less than 350% of a total Sb of edge components in the tire circumferential direction of the grooves11provided in the shoulder region Sh among the plurality of grooves11, and can be preferably not greater than 500% and further preferably not greater than 450% of the total Sb. Since the total Sa may be not less than 300% of the total Sb, a scratching force on mud in the crown region Cr can be enhanced during cornering, for instance, so that operability on a muddy road can be improved. Since the total Sa may be not greater than 500% of the total Sb, the stiffness in the tire axial direction of the crown region Cr can be maintained.", "", "FIG.4AtoFIG.4Care each a plan view for describing specification of an edge component J in the tire axial direction and an edge component S in the tire circumferential direction of each groove11.FIG.4Ashows a groove11extending in a straight manner,FIG.4Bshows a groove11extending in a wavy manner, andFIG.4Cshows a groove11extending in a zigzag manner. As shown inFIG.4AtoFIG.4C, each edge component of each groove11is specified by a groove center line11cof the groove11. In the groove11shown inFIG.4A, the edge component J in the tire axial direction is J1, and the edge component S in the tire circumferential direction is S1. In the groove11shown inFIG.4A, the edge component J in the tire axial direction is J1, and the edge component S in the tire circumferential direction is S1+S2+S3. In the groove11shown inFIG.4C, the edge component J in the tire axial direction is J1+J2+J3, and the edge component S in the tire circumferential direction is S1+S2+S3. According to one or more embodiments, the edge components J in the tire axial direction of the crown circumferential groove12and the shoulder circumferential groove13can each be “0 (zero)”. In addition, according to one or more embodiments, the edge components S in the tire circumferential direction of the shoulder lateral grooves20and the shoulder sub-lateral grooves21can each be “0 (zero)”.", "", "As shown inFIG.3, the buttress portion Bt can include a plurality of buttress lateral grooves23connected to the first tread ground-contact end T1. The plurality of buttress lateral grooves23can include, for example, a plurality of first buttress lateral grooves23A, a plurality of second buttress lateral grooves23B, a plurality of third buttress lateral grooves23C, and a plurality of fourth buttress lateral grooves23D. Each first buttress lateral groove23A can have a largest maximum groove width among the buttress lateral grooves23, and can extend so as to be bent. Each second buttress lateral groove23B can be bent in the same direction as the first buttress lateral groove23A and can be connected to the first buttress lateral groove23A. Each third buttress lateral groove23C can be formed with an edge component in the tire radial direction smaller than that of the first buttress lateral groove23A. Each fourth buttress lateral groove23D can be formed with an edge component in the tire radial direction smaller than that of the third buttress lateral groove23C.", "", "In the plurality of buttress lateral grooves23, a total R of edge components in the tire radial direction can be preferably not less than 1000% and further preferably not less than 1100% of a total Sx of edge components in the tire circumferential direction, and can be preferably not greater than 2000% and further preferably not greater than 1900% of the total Sx. Since the total R may be not less than 1000% of the total Sx, the shearing force can be increased. Since the total R may be not greater than 2000% of the total Sx, an excessive decrease in the stiffness of the buttress portion Bt can be suppressed. The edge component in the tire radial direction and the edge component in the tire circumferential direction of each buttress lateral groove23can each be specified by a groove center line23cof the buttress lateral groove23as in each groove11.", "", "According to one or more embodiments, less than half of the plurality of shoulder lateral grooves20can be connected to any of the plurality of buttress lateral grooves23. In other words, half or more of the plurality of shoulder lateral grooves20may not be connected to any of the plurality of buttress lateral grooves23. Accordingly, noise passing through the shoulder lateral grooves20can be inhibited from being discharged to the outside of the tire1through the buttress lateral grooves23. In addition, since half or more of the plurality of shoulder lateral grooves20may not be connected to any of the plurality of buttress lateral grooves23, the frequency of the noise passing through the respective lateral grooves20and23can be dispersed. Therefore, exterior noise can be further reduced.", "", "FIG.5is a plan view of the ground-contact surface2ain the standardized load-applied state. As shown inFIG.5, in the ground-contact surface2aof one or more embodiments of the present disclosure, a ratio (F/E) of a ground-contact length F in the tire circumferential direction at a second position P2to a ground-contact length E in the tire circumferential direction on the tire equator C can be preferably not less than 0.7 and further preferably not less than 0.75, and can be preferably not greater than 0.9 and further preferably not greater than 0.85. Since the ratio (F/E) may be not less than 0.7, slipping at the shoulder region Sh during running can be suppressed, for instance, so that occurrence of noise due to slipping can be reduced. Since the ratio (F/E) may not be greater than 0.9, a shearing force can be exerted in the crown region Cr including the tire equator C rather than in the shoulder region Sh, for instance, so that mud performance can be improved. The second position P2can be a position separated from the tire equator C outward in the tire axial direction by 80% of a length TWe in the tire axial direction between the first tread ground-contact end T1and the tire equator C. In addition, each ground-contact length E or F can be or have a length obtained by filling the grooves11of the tread portion2.", "", "The tire1having the shape of the ground-contact surface2aas shown inFIG.5can be produced, for example, by changing the thickness of a tread rubber of a structure to be provided in the tread portion2and a tire component of the structure such as a carcass to be provided inside the tread portion2.", "", "Embodiments of the present disclosure are not limited to the above specific embodiments, and various modifications can be made to implement a tire according to the present disclosure."], "claims": ["a tread portion having a first tread ground-contact end; and a buttress portion extending outward in a tire axial direction from the first tread ground-contact end, wherein the tread portion includes: a middle position in the tire axial direction between the first tread ground-contact end and a tire equator, a crown region between the tire equator and the middle position, and a shoulder region between the first tread ground-contact end and the middle position, the buttress portion has a first land ratio which is a land portion ratio between the first tread ground-contact end and a first position separated from an outer end in a tire radial direction of the tread portion inward in the tire radial direction by a distance which is 23% of a tire cross-sectional height Ha, and a second land ratio of the shoulder region is larger than a third land ratio of the crown region and the first land ratio of the buttress portion.", "2 . The tire according to claim 1 , wherein the third land ratio of the crown region is larger than the first land ratio of the buttress portion.", "3 . The tire according to claim 1 , wherein the second land ratio of the shoulder region is larger than the first land ratio of the buttress portion by 20 to 50 points.", "the second land ratio of the shoulder region is 70% to 90%, the third land ratio of the crown region is 50% to 70%, and the first land ratio of the buttress portion is 30% to 50%.", "in a ground-contact surface in a standardized load-applied state where the tire is fitted on a standardized rim with a standardized internal pressure and is brought into contact with a flat surface at a camber angle of 0° with 80% of a load represented by a load index being applied to the tire, a ratio (F/E) of a ground-contact length F in a tire circumferential direction at a second position separated from the tire equator outward in the tire axial direction by 80% of a length in the tire axial direction between the first tread ground-contact end and the tire equator, to a ground-contact length E in the tire circumferential direction on the tire equator, is 0.7 to 0.9.", "the tread portion includes a plurality of grooves, the plurality of grooves include a plurality of shoulder lateral grooves connected to the first tread ground-contact end, the buttress portion includes a plurality of buttress lateral grooves connected to the first tread ground-contact end, and less than half of the plurality of shoulder lateral grooves are connected to any of the plurality of buttress lateral grooves.", "7 . The tire according to claim 6 , wherein a total of edge components in the tire axial direction of grooves provided in the crown region among the plurality of grooves is 30% to 50% of a total of edge components in the tire axial direction of grooves provided in the shoulder region among the plurality of grooves.", "8 . The tire according to claim 6 , wherein a total of edge components in a tire circumferential direction of grooves provided in the crown region among the plurality of grooves is 300% to 500% of a total of edge components in the tire circumferential direction of grooves provided in the shoulder region among the plurality of grooves.", "9 . The tire according to claim 6 , wherein, in the plurality of buttress lateral grooves, a total of edge components in the tire radial direction is 1000% to 2000% of a total of edge components in a tire circumferential direction.", "a plurality of first buttress lateral grooves, a plurality of second buttress lateral grooves different in configuration from the first buttress lateral grooves, a plurality of third buttress lateral grooves different in configuration from the first buttress lateral grooves and the second buttress lateral grooves, and a plurality of fourth buttress lateral grooves different in configuration from the first buttress lateral grooves, the second buttress lateral grooves, and the third buttress lateral grooves.", "wherein each of the first buttress lateral grooves is connected to a corresponding one of the second buttress lateral grooves, wherein none of the third buttress lateral grooves connect to any other of the plurality of buttress lateral grooves, and wherein none of the fourth buttress lateral grooves connect to any other of the plurality of buttress lateral grooves.", "12 . The tire according to claim 6 , wherein each of the first, second, third, and fourth buttress lateral grooves begins at the first tread ground contact end and extend at least partially outward in the tire axial direction.", "13 . The tire according to claim 6 , wherein the tread portion is a shoulder land portion and includes the plurality of shoulder lateral grooves, each of the shoulder lateral grooves having an end portion terminating within the shoulder land portion.", "14 . The tire according to claim 13 , wherein each of the plurality of shoulder lateral grooves extends parallel to the tire axial direction."], "bibtex": "@patent{20240308275,\n    title = {TIRE},\n    number = {20240308275},\n    year = {2024},\n    note = {File: US20240308275A1-20240919.XML}\n    }", "classification": "B60C1101FI"}, {"title": "CAR TYRE", "doc_number": "20240308276", "filename": "US20240308276A1-20240919.XML", "abstract": "A tyre having a tread is described. The tyre has a central portion located across an equatorial plane, a first shoulder portion located towards an outer side of the tyre and a second shoulder portion located towards an inner side of the tyre. The central portion is separated from the first shoulder portion by two first circumferential grooves. The first shoulder portion and the second shoulder portion have a plurality of first transverse grooves having a first end located substantially at the respective edge of the tread, having a width greater than or equal to about 4 mm and an axial extension equal to at least 50% of the width of the shoulder portion in which they are located.", "detailed_description": [""], "claims": ["1 .- 19 . (canceled)", "said first shoulder portion and said second shoulder portion comprise a plurality of first transverse grooves having a first end located substantially at a respective edge of the tread, having a width greater than or equal to about 4 mm and an axial extension equal to at least 50% of the width of the shoulder portion in which they are located; said two first circumferential grooves are a first circumferential groove facing towards the outer side of the tyre and a first circumferential groove facing towards the inner side of the tyre; the number of said first transverse grooves of the first shoulder portion is lower than the number of said first transverse grooves of the second shoulder portion; said central portion has two circumferential ribs, a first and a second circumferential rib respectively, comprising a plurality of second transverse grooves; said central portion comprises one second circumferential groove so as to define said first and second circumferential ribs said first circumferential rib being axially delimited by the first circumferential groove facing towards the outer side of the tyre and the second circumferential groove, said second circumferential rib being axially delimited by the first circumferential groove facing towards the inner side of the tyre and the second circumferential groove; said second transverse grooves have a maximum width smaller than or equal to about 3 mm and define in said at least one circumferential rib a void-to-rubber ratio smaller than 0.06.", "21 . The tyre according to claim 20 , wherein said tread comprises a module which is cyclically repeated along the circumferential development of the tyre, and wherein for each module of the tread the number of first transverse grooves of the second shoulder portion is about twice the number of first transverse grooves of the first shoulder portion.", "22 . The tyre according to claim 20 , wherein the first circumferential groove facing towards the outer side of the tyre having a width smaller than the width of the first circumferential groove facing towards the inner side of the tyre.", "23 . The tyre according to claim 20 , wherein said second circumferential grooves have a width greater than 12 mm.", "24 . The tyre according to claim 20 , wherein said first and/or second circumferential grooves have a maximum depth greater than 5 mm.", "25 . The tyre according to claim 20 , wherein said second transverse grooves are not extended over the whole width of the circumferential ribs in which they are located.", "26 . The tyre according to claim 25 , wherein said second transverse grooves extend at most over 80% of the width of the circumferential rib in which they are located.", "27 . The tyre according to claim 26 , wherein said second transverse grooves extend at most over 60% of the width of the circumferential rib in which they are located.", "28 . The tyre according to claim 20 , wherein each circumferential rib of the central portion has a set void-to-rubber ratio, said void-to-rubber ratio being greatest for a rib closest to the inner side of the tyre.", "29 . The tyre according to claim 20 , wherein each second transverse groove of the first and second circumferential rib has a centerline having an inclination α>45°, relative to the equatorial plane X-X.", "30 . The tyre according to claim 29 , wherein each second transverse groove of the first and second circumferential rib has a centerline having an inclination α>60°, relative to the equatorial plane X-X.", "31 . The tyre according to claim 20 , wherein in each circumferential rib, the second transverse grooves are located at a distance between 25 mm and 80 mm in circumferential direction.", "32 . The tyre according to claim 20 , wherein the second circumferential grooves of the first circumferential rib are positioned so as to have substantially the same distance from each other.", "33 . The tyre according to claim 31 , wherein said distance in the rib of the central portion closest to the inner side of the tyre is smaller than said distance in the rib of the central portion closest to the outer side of the tyre.", "34 . The tyre according to claim 20 , wherein the second transverse grooves of the first circumferential rib extend from the second circumferential groove towards the equatorial plane.", "35 . The tyre according to claim 20 , wherein the second circumferential grooves of the first circumferential rib are substantially parallel one another at least along a portion thereof.", "36 . The tyre according to claim 20 , wherein each second transverse groove of the second circumferential rib is counter-inclined with respect to the second transverse groove adjacent in a circumferential direction.", "37 . The tyre according to claim 20 , wherein each second transverse groove of the second circumferential rib extends from a first or a second circumferential groove.", "38 . The tyre according to claim 20 , further comprising a third circumferential groove located on the first shoulder portion, the third circumferential groove having a width smaller than the width of the first circumferential groove facing towards the outer side of the tyre.", "39 . The tyre according to claim 38 , wherein said third circumferential groove has a width smaller than 4 mm.", "40 . The tyre according to claim 38 , wherein said third circumferential groove has a maximum depth smaller than 4 mm.", "41 . The tyre according to claim 38 , wherein the plurality of first transverse grooves of the first shoulder portion traverses the third circumferential groove."], "bibtex": "@patent{20240308276,\n    title = {CAR TYRE},\n    number = {20240308276},\n    year = {2024},\n    note = {File: US20240308276A1-20240919.XML}\n    }", "classification": "B60C1103FI"}]