[{"title": "ROLLER AND WHEEL", "doc_number": "20250001799", "filename": "US20250001799A1-20250102.XML", "abstract": "A roller includes a first member having a through hole into which a support shaft is inserted and a second member that covers an outer circumference surface of the first member. The first member and the second member are integrally formed by two-color molding. Although covering most part of the outer circumference surface including a central region of the first member, the second member does not cover outer circumference surfaces of both end portions.", "detailed_description": [""], "claims": ["a first member having a through hole into which a support shaft is inserted; and a second member adapted to cover an outer circumference surface of the first member, wherein the first member and the second member are integrally formed by two-color molding.", "2 . The roller according to claim 1 , wherein the second member does not cover both end surfaces of the first member.", "3 . The roller according to claim 1 , wherein the second member does not cover outer circumference surfaces of both end portions of the first member.", "the second member is provided at an approximately uniform thickness on the outer circumference surface of the first member.", "the support shaft having a diameter smaller than 1 mm is inserted into the through hole.", "the roller includes a first member having a through hole into which a support shaft is inserted and a second member that covers an outer circumference surface of the first member, and the first member and the second member are integrally formed by two-color molding.", "7 . The wheel according to claim 6 , wherein one end side of the support shaft is secured to the wheel main body with an adhesive or secured by welding.", "8 . The wheel according to claim 6 , wherein the second member is provided at a position where it does not come in contact with the wheel main body to which the support shaft is attached.", "9 . The wheel according to claim 6 being an omni wheel or a mecanum wheel."], "bibtex": "@patent{20250001799,\n    title = {ROLLER AND WHEEL},\n    number = {20250001799},\n    year = {2025},\n    note = {File: US20250001799A1-20250102.XML}\n    }", "classification": "B60B1900FI"}, {"title": "SADDLE-RIDING VEHICLE WHEEL DRUM", "doc_number": "20250001800", "filename": "US20250001800A1-20250102.XML", "abstract": "A saddle-riding vehicle wheel drum is formed of a cast or molded article and includes: a drum body including a cylindrical body section and a flange section formed on the drum body at each of axially opposite ends of the drum body; and an annular collar fitted to an inner circumferential surface of the drum body at one of the axially opposite ends.", "detailed_description": [""], "claims": ["a drum body including a cylindrical body section and a flange section formed on the body section at each of axially opposite ends of the body section; and an annular collar fitted to an inner circumferential surface of the drum body at one of the axially opposite ends.", "a wheel drum as claimed in claim bearings; and an axle shaft supported to the wheel drum at each of axially opposite ends of the wheel drum via a respective one of the bearings, one of the bearings at one of the axially opposite ends being mounted in place in an axially movable manner, and the other of the bearings at the other of the axially opposite ends being mounted in place in an axially immovable manner.", "a drum body including a cylindrical body section and a flange section formed on the body section at each of axially opposite ends of the body section; and a constriction located at an inner circumferential surface of the drum body, the constriction defining an axially decreasing diameter towards an exterior of the drum body.", "forming a drum body in a casting or molding process, the drum body including a cylindrical body section and a flange section formed on the body section at each of axially opposite ends of the body section; forming an annular collar in a casting or molding process, as a distinct piece from the drum body; and connecting the annular collar to an inner circumferential surface of the drum body at one of the axially opposite ends.", "5 . The method for manufacturing a saddle-riding vehicle wheel drum as claimed in claim 4 , wherein the connecting comprises fitting the collar to the inner circumferential surface of the drum body at the one of the axially opposite ends.", "6 . The method for manufacturing a saddle-riding vehicle wheel drum as claimed in claim 4 , wherein the connecting comprises connecting the collar as an inseparable one piece to the inner circumferential surface of the drum body at the one of the axially opposite ends."], "bibtex": "@patent{20250001800,\n    title = {SADDLE-RIDING VEHICLE WHEEL DRUM},\n    number = {20250001800},\n    year = {2025},\n    note = {File: US20250001800A1-20250102.XML}\n    }", "classification": "B60B2702FI"}, {"title": "Wheel Hub for a Commercial Vehicle Drive Axle", "doc_number": "20250001801", "filename": "US20250001801A1-20250102.XML", "abstract": "A wheel hub for a utility vehicle drive axle includes a hollow section extending between a first axial end and a second axial end. The hollow section has centering sections defining a centering outer diameter of the hollow section for centering at least one wheel rim on the hollow section. The centering sections are separated from one another in the circumferential direction by intermediate sections, each of the intermediate sections being radially recessed relative to the centering sections. The intermediate sections are formed by machining the hollow section between the centering sections. The wheel hub has a flange section transitioning from the first axial end of the hollow section, the flange section projecting radially outwards relative to the hollow section, with the at least one wheel rim being couplable to the flange section.", "detailed_description": ["Reference will now be made to embodiments of the invention, one or more examples of which are shown in the drawings. Each embodiment is provided by way of explanation of the invention, and not as a limitation of the invention. For example, features illustrated or described as part of one embodiment can be combined with another embodiment to yield still another embodiment. It is intended that the present invention include these and other modifications and variations to the embodiments described herein.", "", "FIG.1shows a sectional view of a portion of a commercial, utility vehicle drive axle1. The utility vehicle drive axle1is shown in the region of dual tires2. In the case of the utility vehicle drive axle1, driving wheels3and4of the dual tires2are drivable via an associated drive shaft (not shown here), for the purpose of which the drive shaft is coupled via an intermediate wheel hub drive5to a wheel hub6, on which the driving wheels3and4of the dual tires2are mounted by associated wheel rims7and8, respectively. The wheel hub drive5is a planetary gear set, which is indicated only in a highly schematic manner inFIG.1. The driving wheels3and4are mounted on the wheel hub6by their wheel rims7and8via bolt connections9(only one of which is shown), with the wheel rims7and8being centered on the wheel hub6in a region10.", "", "The wheel hub6is realized according to a preferred embodiment of the invention and is also shown individually inFIGS.2and3. As is apparent, the wheel hub6has or defines a hollow section11, which transitions at a first axial end12into a circumferential flange section13and at a second axial end14into a base section15. The hollow section11has a substantially hollow cylindrical shape, relative to which the flange section13projects radially outwards. Multiple through-holes16which are equidistantly spaced apart from one another are introduced into the flange section13, through which wheel bolts are insertable in order to achieve the bolt connections9shown inFIG.1.", "", "In contrast, the base section15extends radially inward from the hollow section11and, together with the hollow section11, delimits an interior17, in which the wheel hub drive5(shown inFIG.1) is accommodated when the wheel hub6is installed. In addition, the base section15has projections18, which project axially into the interior17and are provided for guiding one planet gear of the wheel hub drive5each. In that respect, the wheel hub6is at least a portion of a planet carrier of the wheel hub drive5.", "", "The region10in which the wheel rims7,8are centered on the wheel hub6is provided in the region of the first axial end12of the hollow section11and thus adjacent to the flange section13. In this region10, the hollow section11is provided with centering sections19and intermediate sections20, which alternate with each other in the circumferential direction in the region10. Each centering section19and the next centering section19are separated by an intermediate section20arranged therebetween.", "", "By the centering sections19, a centering outer diameter21(part of which is indicated inFIG.3) of the hollow section11is defined. The intermediate sections20are radially set back relative to the centering sections19and thus are situated on a diameter22(part of which is indicated inFIG.3) which is smaller in comparison to the centering outer diameter21. As a result, a contact surface of the wheel hub6at the hollow section11with the wheel rims7and8centered thereon is reduced, whereby, in the case of corrosion, the wheel rims7and8are more easily detachable from the wheel hub6due to the reduced contact surface. Furthermore, an outer diameter of the hollow section11reduces from the region10, and thus from the centering outer diameter21, toward the axial end14.", "", "The wheel hub6is a cast part in the present case, and therefore the hollow section11, the flange section13, and the base section15have been produced within the framework of a primary shaping process. As a distinguishing feature, the intermediate sections20between the centering sections19are formed after the primary shaping process by machining the hollow section11, in that material has been removed in the relevant circumferential sections of the hollow section11by machining. As a result, the region10of the wheel hub6having the centering sections19and the intermediate sections20is therefore formed with low manufacturing outlay.", "", "By the embodiment according to the invention, a wheel hub is obtained with low manufacturing outlay.", "", "Modifications and variations can be made to the embodiments illustrated or described herein without departing from the scope and spirit of the invention as set forth in the appended claims. In the claims, reference characters corresponding to elements recited in the detailed description and the drawings may be recited. Such reference characters are enclosed within parentheses and are provided as an aid for reference to example embodiments described in the detailed description and the drawings. Such reference characters are provided for convenience only and have no effect on the scope of the claims. In particular, such reference characters are not intended to limit the claims to the particular example embodiments described in the detailed description and the drawings."], "claims": ["1 .- 7 . (canceled)", "a hollow section ( a flange section (", "9 . The wheel hub ( 6 ) of claim 8 , wherein the hollow section ( 11 ) transitions at the second axial end ( 14 ) into a base section ( 15 ), the second axial end ( 14 ) being opposite the first axial end ( 12 ), the base section ( 15 ) extending radially inwardly from the hollow section ( 11 ), the hollow section ( 11 ) and the base section ( 15 ) together delimiting an interior ( 17 ).", "10 . The wheel hub ( 6 ) of claim 9 , wherein projections ( 18 ) are formed on the base section ( 15 ) and project axially into the interior ( 17 ), each of the projections being configured to guide a respective planet gear of a planetary gear set.", "11 . The wheel hub ( 6 ) of claim 8 , wherein an outer diameter of the hollow section ( 11 ) decreases from the centering outer diameter ( 21 ) toward the second axial end ( 14 ), the second axial end ( 14 ) being opposite the first axial end ( 12 ).", "12 . The wheel hub ( 6 ) of claim 8 , wherein the centering sections ( 19 ) and the intermediate sections ( 20 ) are axially formed in a region ( 10 ) on the hollow section ( 11 ), the at least one wheel rim ( 7 , 8 ) being receivable on the hollow section ( 11 ) at the region ( 10 ) for coupling to the flange section ( 13 ).", "13 . The wheel hub ( 6 ) of claim 8 , wherein the wheel hub ( 6 ) is a cast part, the intermediate sections ( 20 ) being formed by machining the hollow section ( 11 ) between the centering sections ( 19 ) after the wheel hub ( 6 ) is cast.", "drive shafts, each of the drive shafts being coupled to a respective one of the wheel hub ("], "bibtex": "@patent{20250001801,\n    title = {Wheel Hub for a Commercial Vehicle Drive Axle},\n    number = {20250001801},\n    year = {2025},\n    note = {File: US20250001801A1-20250102.XML}\n    }", "classification": "B60B2706FI"}, {"title": "WHEEL MOUNTING GUIDE BAR", "doc_number": "20250001802", "filename": "US20250001802A1-20250102.XML", "abstract": "The disclosure is directed at a wheel mounting guide bar that is used to assist in the replacement of wheels on a vehicle. The guide bar includes a shaft portion; a sleeve portion, the sleeve portion sized to fit a stud on a wheel hub; and a connector connecting the shaft portion to the sleeve portion, the connector enabling the sleeve portion to move with respect to the shaft portion.", "detailed_description": ["The disclosure is directed at a wheel mounting guide bar that includes a handle or handle portion, a bar or shaft portion and a sleeve portion. While the term “wheel” generally refers to a rim and the term “tire” represents the rubber portion that is installed on the wheel or rim, for the following description, the term “wheel” will be used to represent the combination of a tire and rim.", "", "In some embodiments, the sleeve portion is connected to the shaft portion via a swivel, joint or elbow connector whereby the sleeve portion can move or pivot with respect to the shaft portion. In some embodiments, the sleeve portion may be permanently attached to the shaft portion while, in other embodiments, the sleeve portion may be removable such that it can be replaced by another sleeve portion to accommodate different sized studs of different vehicle wheel hubs or based on damage to an existing sleeve portion. For the embodiments where the sleeve portion may be removable, the connection may be via a threaded connection. In some embodiments, the sleeve portion is designed to fit between a stud hole within a wheel and over the corresponding stud on the wheel hub.", "", "Turning toFIG.1, a side view of a first embodiment of a wheel mounting guide bar is shown. The wheel mounting guide bar100ofFIG.1may be seen as an automotive guide bar.", "", "The wheel mounting guide bar100includes a bar, or shaft, portion,102that has a handle portion104attached at one end and a sleeve portion106attached at an opposite end. The handle portion104may be rubberized to provide a more comfortable grip to a user of the guide bar100. In other embodiments, the handle portion104may be designed for safety and comfort whereby the handle portion104protects a user's hand from pinching if the replacement wheel slides back along the shaft portion102. In some embodiments, the handle portion can be removed and/or replaced.", "", "The sleeve portion106is connected via a swivel, joint or elbow connector108either in a permanent or removable connection. For embodiments where the sleeve portion106can be removed or replaced, when required, such as to accommodate a different sized wheel nut or stud, the sleeve portion106may be connected to the shaft portion102via a threaded connection.FIG.4is a perspective view of a sleeve portion106connected to the shaft portion102via a permanent connector108(such as, but not limited to, a weld) whileFIGS.5aand5bare perspective views of a sleeve portion106connected to the shaft portion102via a threaded connector108(FIG.5a) and detached from the shaft portion102(FIG.5b).", "", "The sleeve portion106includes an opening or hollow portion110(away from the connector108) that is sized to receive a stud or nut located on a wheel hub. A set of studs (and corresponding lug nuts) is used to keep a wheel mounted in place on the vehicle by attachment of a lug nut over each stud after the replacement wheel has been mounted. Depending on the type of vehicle and/or the size of the studs on the wheel hub, the hollow portions110are sized to fit these known sizes of studs. In some embodiments, the sleeve portion106is a specific size to be able to fit through the stud holes on the wheel, and over the studs on the hub.", "", "In some embodiments, the wheel mounting guide bar100may be designed to work with European style wheel hubs where the sleeve portion is replaced by a guide pin. In these embodiments, the guide pin is inserted through the threaded stud holes on the wheel hub thereby guiding the replacement wheel onto the hub.", "", "With respect to guide bar100, in a specific embodiment, a diameter of the shaft portion102is about 12 mm and a length of the shaft portion102is about 3 feet. In other embodiments, the diameter of the shaft portion102is designed to comfortably slide through a stud hole within the replacement wheel. As a length of the shaft portion102affects the leverage that a user can apply, the longer the shaft portion102, the easier it will be for the replacement wheel to be lifted by the user. A material of the shaft portion102is selected such that it is durable and/or dense enough to hold a weight of the replacement wheel, such as a dense metal. In some embodiments, the shaft portion102may include a protective plastic coating to avoid damage to the replacement wheel when being used.", "", "In some embodiments, the hollow portion110of different sleeve portions106is sized to fit or receive 12 mm to 16 mm studs. In some embodiments, the sleeve portion106is made from a durable metal and may have a finished coating on its surface.", "", "Design of the automotive wheel mounting guide bar100is such that it is able to withstand a weight of a heavy passenger truck wheel while being able to fit through smaller sized stud holes of smaller replacement wheels.", "", "As will be understood, different guide bars may be manufactured for different sized vehicles makes and models where shaft length and diameter depend on vehicle and tire size. In other embodiments, the sleeve portion106may be of different circumferences depending on a size of stud and wheel stud holes that is designed to accommodate. In some embodiments, a cone shape is connected between the sleeve portion106and a swivel connector108to enable a smoother installation of a replacement wheel. In these embodiments, a diameter of the shaft portion and the connector may not be uniform with the sleeve portion which is a tapered cone shape to ensure the replacement wheel has a smooth transition from the shaft portion to the sleeve portion. This is described in more detail below.", "", "In another embodiment of the guide bar100, the sleeve portion106may be interchangeable on the tool100to adapt to different size vehicles and studs whereby a single guide bar100can be connected to different sleeve portions so that only a single guide bar is able to handle multiple sizes of tire studs.", "", "Turning toFIG.2, a side view of a second embodiment of a wheel mounting guide bar is shown. In the current embodiment, the wheel mounting guide bar200ofFIG.2may be seen as a commercial guide bar. The wheel mounting guide bar200includes a bar, or shaft portion,202that has a handle portion204that is attached at one end and a sleeve portion206attached at an opposite end. The sleeve portion206is connected via a swivel, joint or elbow connector208, either in a permanent connection or in a removable connection whereby the sleeve portion206can be changed when required, such as to accommodate a different sized wheel stud or nut. The sleeve portion206includes an opening or hollow portion210(away from the connector208) that is sized to receive a stud that is used to keep a wheel mounted in place.", "", "With respect to the commercial guide bar inFIG.2, in one specific embodiment, a diameter of the shaft portion202is about 18 mm and a length of the shaft portion202is about 4 feet. The hollow portion210of the sleeve portion206may be sized to receive 18 mm to 22 mm studs. As will be understood, the sleeve portions206may be interchangeable such that the guide bar200can be used for different vehicle types and different stud sizes.", "", "Turning toFIG.3, another embodiment of a wheel mounting guide bar is shown. The dual sleeve wheel mounting guide bar300ofFIG.3includes a bar, or shaft, portion302which is connected at both ends to sleeve portions304via joint, swivel or hinge connectors306. As with the sleeve portions described above, the sleeve portions304include hollow portions for mating with studs that are located on a wheel hub. In this embodiment, the user can grip the bar portion when using the guide bar300to replace a wheel.", "", "In some embodiments, the size of the sleeve portions304are different such that the guide bar300may be suitable for use with two different sizes of studs without a need to exchange the sleeve portion304. The sleeve portions304may act as handle portions when the opposite sleeve portion304is in use. The shaft portion302may include a rubber cover or guard in order to provide an improved grip to a user or it may be uncovered. This guard can be moved along the shaft portion depending on what sleeve portion is needed or being used", "", "This embodiment may be seen as a wheel mounting guide bar with an elongated metal shaft portion with swivel connectors and sleeve portions at both ends.", "", "Turning toFIG.6a, a schematic diagram of a wheel mounting guide bar within an operational or wheel changing environment is provided. In the environment ofFIG.6a, it is assumed that the old wheel has already been removed from the vehicle.", "", "Operation of a wheel mounting guide bar410, such as the automotive wheel mounting guide bar100, the commercial wheel mounting guide bar200or the dual sleeve wheel mounting guide bar300is now described. As shown inFIG.6a, the wheel mounting guide bar410is either the automotive wheel mounting guide bar100or the commercial wheel mounting guide bar200.", "", "Prior to installation or mounting, the new or replacement wheel400is placed in a position substantially parallel to a wheel hub402of a vehicle. Although not shown, the wheel hub402is attached to a vehicle within a wheel well of the vehicle. The wheel hub402includes a set of studs404which equal or correspond with a set of holes (which may also be seen as stud holes)406within a rim408of the wheel400.", "", "After positioning the replacement wheel400, the user can then slide or direct the wheel mounting guide bar410through one of the holes406. InFIG.6a, the wheel mounting guide bar410has been slid through a top stud hole. For wheel mounting guide bars100or200, the user may hold the guide bar410via the handle portion and then direct the sleeve portion of the guide bar410through the hole406until it connects or mates with the corresponding stud404on the wheel hub402. For the dual sleeve guide bar, the user may determine which sleeve portion is sized to fit with the studs404of the wheel hub402and then directs that sleeve portion through the hole406until it connects or mates with the corresponding stud. As discussed above, the sleeve portion or portions of each of the guide bars is/are sized to fit within or through a stud hole in the replacement wheel and over the corresponding stud on the wheel hub.", "", "As shown inFIG.6a, when the sleeve portion is placed over the stud, the shaft portion412is positioned within the stud hole406. As the connector between the shaft portion and the sleeve portion is able to pivot, swivel or move or enables the sleeve portion to pivot, swivel or move with respect to the shaft portion, a position of the sleeve portion can be more easily manipulated. This is helpful when the stud holes and the studs are not perfectly aligned from a horizontal standpoint.", "", "As schematically shown inFIG.6b, once the sleeve portion has been connected over the stud, the user lifts the shaft portion (for example in the direction of arrow414, such as by lifting the bar410via the handle portion (guide bars100and200) or the opposite sleeve portion (guide bar300) to direct the replacement wheel400towards the wheel hub in the direction of arrow416. It is understood that a user may also grip the shaft portion of the bar410to lift the replacement wheel. Based on that leveraging and gravity, the replacement wheel may then slide down the shaft portion and over the sleeve portion towards the wheel hub facilitating the mounting of the remaining studs holes onto their corresponding studs on the wheel hub. In one embodiment, after the replacement wheel400has slid down the shaft portion, the user may push the replacement wheel over the wheel hub whereby the studs pass through their corresponding stud holes such that the stud locks, or lug nuts, may be fastened to the studs.FIG.6cprovides a perspective view of the wheel mounting guide bar in an operational environment.", "", "Turning toFIG.7, a perspective view of another embodiment of a sleeve portion connected to a shaft portion is shown. As can be seen, the shaft portion102is connected via a connector108to the sleeve portion106. The connector108includes a hinged connector portion700that allows the shaft portion102and the sleeve portion106to pivot or move with respect to each other.", "", "Turning toFIG.8, a perspective view of another embodiment of a wheel mounting guide bar is shown. In the current embodiment, the guide bar800includes a handle portion802, a shaft portion804and a sleeve portion806. The sleeve portion806is connected to the shaft portion804via a connector808that enables the sleeve portion806to pivot or swivel with respect to the shaft portion804.", "", "In one embodiment, the wheel mounting guide tool410is used to alleviate the struggle of mounting a replacement wheel onto a wheel hub. Using leverage to lift the replacement wheel, minimizes or reduces the likelihood of injuries due to the need for a user to lift the entire weight of the replacement wheel with their arms. Using a wheel mounting guide tool410of the disclosure to guide the replacement wheel into the proper position not only minimizes or reduces the likelihood of injury, use of the guide tool may also increase the ease of which the replacement wheel falls into position with respect to the wheel hub. In some embodiments, the sleeve portion may also act as a centering pin if the user leaves the guide tool410in place over the stud while torquing up or tightening the surrounding nuts on other studs before removing the guide bar410.", "", "While various embodiments have been described above, it should be understood that they have been presented only as illustrations and examples of the present disclosure, and not by way of limitation. It will be apparent to persons skilled in the relevant art that various changes in form and detail can be made therein without departing from the spirit and scope of the disclosure. Thus, the breadth and scope of the present disclosure should not be limited by any of the above-described exemplary embodiments but should be defined only in accordance with the appended claims and their equivalents. It will also be understood that each feature of each embodiment discussed herein, and of each reference cited herein, can be used in combination with the features of any other embodiment.", "", "Applicants reserve the right to pursue any embodiments or sub-embodiments disclosed in this application; to claim any part, portion, element and/or combination thereof of the disclosed embodiments, including the right to disclaim any part, portion, element and/or combination thereof of the disclosed embodiments; or to replace any part, portion, element and/or combination thereof of the disclosed embodiments.", "", "The above-described embodiments are intended to be examples only. Alterations, modifications and variations can be effected to the particular embodiments by those of skill in the art without departing from the scope, which is defined solely by the claims appended hereto."], "claims": ["a shaft portion; a sleeve portion, the sleeve portion sized to fit a stud on a wheel hub; and a connector connecting the shaft portion to the sleeve portion, the connector enabling the sleeve portion to move with respect to the shaft portion.", "a handle portion, the handle portion connected to the shaft portion at an end of the shaft portion opposite the sleeve portion.", "a second sleeve portion; and a second connector, the second connector connected the second sleeve portion to the shaft portion at an end of the shaft portion opposite the sleeve portion.", "a guard portion, the guard portion surrounding a portion of the shaft portion.", "5 . The wheel mounting guide bar of claim 4 wherein the guard portion is a rubber guide portion.", "6 . The wheel mounting guide bar of claim 1 wherein the sleeve portion comprises a hollow portion for receiving a stud located on a wheel hub of a vehicle."], "bibtex": "@patent{20250001802,\n    title = {WHEEL MOUNTING GUIDE BAR},\n    number = {20250001802},\n    year = {2025},\n    note = {File: US20250001802A1-20250102.XML}\n    }", "classification": "B60B2900FI"}, {"title": "TIRE", "doc_number": "20250001803", "filename": "US20250001803A1-20250102.XML", "abstract": "A pneumatic tire includes: a pair of bead portions; at least one carcass layer extending between the pair of bead portions; a belt layer disposed on an outer side of the carcass layer in a tire radial direction; and a carcass inner rubber layer disposed on a tire inner cavity side with respect to the carcass layer. The pneumatic tire further includes a linear conductive portion extending continuously at least from one of the bead portions to the belt layer and disposed on the carcass inner rubber layer. The linear conductive portion is at least partially positioned in the carcass inner rubber layer and has a volume resistivity of less than 1×10{circumflex over ( )}8 Ω·cm.", "detailed_description": ["Tires according to embodiments of the present technology will be described in detail below with reference to the drawings. However, the technology is not limited to the embodiment. Constituents of the following embodiments include elements that can be substituted and easily conceived of by a person skilled in the art or that are essentially identical."], "claims": ["1 - 18 . (canceled)", "a pair of bead portions; at least one carcass layer extending between the pair of bead portions; a belt layer disposed on an outer side of the carcass layer in a tire radial direction; and a carcass inner rubber layer disposed on a tire inner cavity side with respect to the carcass layer; the tire further comprising a linear conductive portion extending continuously at least from one of the bead portions to the belt layer and disposed on the carcass inner rubber layer; and the linear conductive portion being at least partially positioned in the carcass inner rubber layer and having a volume resistivity of less than 1×10{circumflex over ( )}8 Ω·cm.", "the belt layer comprises one or more belt plies extending in a tire width direction, in drawing lines from end portions on both sides in the tire width direction of a belt ply having a largest width in the tire width direction of the belt plies toward a tire inner surface, a periphery length between intersection points of the perpendicular lines and the tire inner surface is Lbp, a length in a periphery direction of a portion positioned on an inner side in the tire radial direction of the belt layer of the linear conductive portion is La, and the linear conductive portion satisfies 0.01≤La/Lbp≤1.", "21 . The tire according to claim 19 , wherein the linear conductive portion has a relationship between a thickness t of the carcass inner rubber layer and a distance t 1 from the tire inner surface in a portion of the linear conductive portion having a shortest distance from the tire inner surface in at least a region on an outer side in the tire radial direction from the bead portion satisfying 0.2≤t 1 /t≤0.8.", "a bead portion rubber in contact with a rim flange is disposed in the bead portion, the bead portion rubber has a volume resistivity of less than 1×10{circumflex over ( )}8 Ω·cm, and the linear conductive portion includes a portion overlapping the bead portion rubber.", "the linear conductive portion extends from the tire inner surface side to at least a bead base beyond a bead toe of the bead portion and is in contact with the bead portion rubber at a position on the bead base side from the bead toe.", "24 . The tire according to claim 19 , wherein the linear conductive portion extends along the periphery direction in at least a region between the belt layer and the bead portion.", "25 . The tire according to claim 19 , wherein a portion positioned on an inner side in the tire radial direction and a portion positioned in the bead portion of the belt layer of the linear conductive portion each include a portion inclining at an inclination angle of 30° or less in the tire circumferential direction with respect to the periphery direction.", "the carcass inner rubber layer comprises a first layer and a second layer that are layered, and at least part of the linear conductive portion is disposed between the first layer and the second layer.", "the first layer is an innerliner, and the second layer is a tie rubber.", "28 . The tire according to claim 27 , wherein the linear conductive portion is sewn into the tie rubber.", "29 . The tire according to claim 28 , wherein the linear conductive portion is sewn into the tie rubber, and a length of 1 mm or more and 30 mm or less of the linear conductive portion is exposed on a surface of the tie rubber.", "30 . The tire according to claim 19 , wherein the linear conductive portion is made by intertwining a plurality of linear members including at least one conductive linear member having a volume resistivity of less than 1×10{circumflex over ( )}8 Ω·cm.", "31 . The tire according to claim 30 , wherein the linear conductive portion is made by intertwining the conductive linear member and a non-conductive linear member having a volume resistivity of 1×10{circumflex over ( )}8 Ω·cm or more.", "the conductive linear member is a metal fiber, and the non-conductive linear member is an organic fiber.", "33 . The tire according to claim 30 , wherein the conductive linear member is made by intertwining a plurality of carbon fibers.", "34 . The tire according to claim 30 , wherein the conductive linear member is a monofilament cord made of a carbon fiber.", "35 . The tire according to claim 19 , wherein the linear conductive portion has a total fineness of 20 dtex or more and 1000 dtex or less.", "36 . The tire according to claim 35 , wherein the linear conductive portion has an elongation ratio of 1.0% or more and 70.0% or less."], "bibtex": "@patent{20250001803,\n    title = {TIRE},\n    number = {20250001803},\n    year = {2025},\n    note = {File: US20250001803A1-20250102.XML}\n    }", "classification": "B60C514FI"}, {"title": "RUBBERIZED METALLIC STRENGTH MEMBER AND PNEUMATIC VEHICLE TIRE", "doc_number": "20250001804", "filename": "US20250001804A1-20250102.XML", "abstract": "A metallic strength member rubberized with a sulfur-crosslinkable, essentially cobalt-free rubberization mixture, wherein the metallic strength member is a steel cord containing one or more filaments, wherein the filaments include a steel substrate filament and a coating that partly or completely covers the steel substrate filament, wherein the coating includes brass consisting of copper and zinc, and wherein the coating is enriched with iron in the form of particles having a size between 10 and 10 000 nm in the brass. In order to optimize vulcanization times, the rubberization mixture contains 0.5 to 3 phr of at least one sulfenimide accelerator and/or at least one dibenzylamine-based sulfenamide accelerator.", "detailed_description": ["The invention is now to be elucidated in detail with reference to the table that follows.", "", "Table 1 gives example mixtures for a rubberization of metallic strength members of a pneumatic vehicle tire.", "", "In the mixtures in the table, the vulcanization accelerator and the cobalt stearate were varied.", "", "The mixtures were produced under customary conditions to produce a base mixture and subsequently the finished mixture in a tangential laboratory mixer.", "", "The conversion times for 10% and 90% conversion (t10: scorch time, t90, optimal vulcanization time) were determined using a rotorless vulcameter (MDR=moving disk rheometer) according to DIN 53 529 for vulcanization at 160° C.", "", "In addition, the mixtures from table 1 were used to conduct tests of adhesion on conventional brassed steel cord A (2×0.3 HT, brass: 63.5% by weight of copper, 36.5% by weight of zinc, iron content of the coating: 0% by weight) and on inventive iron-doped, brassed steel cord B (2×0.3 HT, where the content is composed of 64.1% by weight of copper, 32.6% by weight of zinc, 3.3% by weight of iron having a particle size distribution of the iron particles between 20 and 5000 nm) to ASTM 2229/D1871 without aging and after saturated steam aging for five days at 105° C. (test specimen production: vulcanization: 30 min, 150° C., embedded length in the rubberization mixture: 10 mm, pull-out speed: 125 mm/min). The pull-out force and coverage were determined. For the pull-out force, the value of mixture 1 was taken as 100%; the values of the other mixtures were based on mixture 1.", "", "TABLE 1Unit1234ConstituentsNatural rubber (polyisoprene)phr100100100100Carbon blackphr63636363Plasticizer and aging stabilizerphr9.69.69.69.6Cobalt stearatephr1.3———Methylene acceptor-methylenephr7.27.27.27.2donor pairAccelerator DCBSphr0.750.75——TBSI acceleratorphr——1.0—DBBS acceleratorphr———2.2Sulfur, ext. with 33.8% by wt. of oilphr6.756.756.756.75Propertiest10min1.090.980.880.85t90min11.3118.1910.7512.02Pull-out force (unaged, steel cord A)%1009791102Coverage (unaged, steel cord A)%100959592Pull-out force (unaged, steel cord B)%10099105104Coverage (unaged, steel cord B)%989610085Pull-out force (aged, steel cord A)%80576158Coverage (aged, steel cord A)%99929480Pull-out force (aged, steel cord B)%87918791Coverage (aged, steel cord B)%96979990", "", "It is apparent from the table that optimal vulcanization times can be obtained with mixtures 3 and 4. The optimal vulcanization time t90in particular, with TBSI or DBBS as accelerator, is in the region of or even below the time for the reference mixture. At the same time, these mixtures, in association with the iron-doped steel cord B, can achieve very good bonding results that are in the region of or even superior to those of reference mixture 1.Abstract"], "claims": ["1 - 10 . (canceled)", "wherein the metallic strength member is a steel cord containing one or more filaments, wherein the filaments comprise a steel substrate filament and a coating that partly or completely covers the steel substrate filament, wherein the coating comprises brass consisting of copper and zinc, and wherein the coating is enriched with iron in the form of particles having a size between 10 and 10,000 nm in the brass, wherein the rubberization mixture contains 0.5 to 3 phr (parts by weight, based on 100 parts by weight of all rubbers in the mixture) of at least one sulfenimide accelerator and/or at least one dibenzylamine-based sulfenamide accelerator.", "12 . The rubberized metallic strength member as claimed in claim 11 , wherein the coating is enriched with iron in the form of particles having a size between 20 and 5,000 nm in the brass.", "13 . The rubberized metallic strength member as claimed in claim 11 , wherein the brass comprises at least 63% by weight of copper, the balance being zinc.", "14 . The rubberized metallic strength member as claimed in claim 11 , wherein the amount of iron in the coating is not less than 1% by weight and less than 10% by weight, by comparison with the total mass of brass and iron.", "15 . The rubberized metallic strength member as claimed in claim 11 , wherein the amount of iron in the coating is not less than 3% by weight and less than 9% by weight, by comparison with the total mass of brass and iron.", "16 . The rubberized metallic strength member as claimed in claim 11 , wherein the coating is essentially free of zinc-iron alloys.", "17 . The rubberized metallic strength member as claimed in claim 11 , wherein it contains 1 to 2.5 phr of at least one sulfenimide accelerator and/or at least one dibenzylamine-based sulfenamide accelerator.", "18 . The rubberized metallic strength member as claimed in claim 11 , wherein the at least one sulfenimide accelerator is N-tert-butyl-2-benzothiazolesulfenimide (TBSI).", "19 . The rubberized metallic strength member as claimed in claim 17 , wherein the at least one sulfenimide accelerator is N-tert-butyl-2-benzothiazolesulfenimide (TBSI).", "20 . The rubberized metallic strength member as claimed in claim 11 , wherein the at least one dibenzylamine-based sulfenamide accelerator is N,N′-dibenzyl-2-benzothiazolesulfenamide (DBBS).", "21 . The rubberized metallic strength member as claimed in claim 17 , wherein the at least one dibenzylamine-based sulfenamide accelerator is N,N′-dibenzyl-2-benzothiazolesulfenamide (DBBS).", "22 . A pneumatic vehicle tire including a metallic strength member rubberized with a sulfur-crosslinked rubberization mixture as claimed in claim 11 .", "23 . The pneumatic vehicle tire as claimed in claim 22 , wherein the belt and/or carcass contains the rubberized metallic strength member."], "bibtex": "@patent{20250001804,\n    title = {RUBBERIZED METALLIC STRENGTH MEMBER AND PNEUMATIC VEHICLE TIRE},\n    number = {20250001804},\n    year = {2025},\n    note = {File: US20250001804A1-20250102.XML}\n    }", "classification": "B60C900FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20250001805", "filename": "US20250001805A1-20250102.XML", "abstract": "Provided is a pneumatic tire in which rolling resistance is reduced by gauge thinning of a belt, and a reduction in durability in an end of a belt layer and the deterioration of the moist heat resistive adhesiveness of the belt layer are suppressed. Each of the thickness of a first belt layer 5 a and the thickness of a second belt layer 5 b in the center section of the tire is 1.00 mm or less; when the shortest distance between the code 6 b of the second belt layer 5 b and the code 6 a of the first belt layer 5 a in the center section of the tire is set at a, and the shortest distance between the code 6 b of the second belt layer 5 b in an end and the code 6 a of the first belt layer 5 a is set at b, a and b satisfy a relationship represented by the following expression: 1.8≤ b/a≤4.0; and a coating rubber 7 that coats the first belt layer 5 a and the second belt layer 5 b includes: a rubber component including natural rubber; a resin component; and a sulfenamide vulcanization accelerator.", "detailed_description": [""], "claims": ["each of a thickness of the first belt layer and a thickness of the second belt layer in a center section of the tire is 1.00 mm or less, when a shortest distance between a code of the second belt layer and a code of the first belt layer in the center section of the tire is set at a, and a shortest distance between the code of the second belt layer in an end and the code of the first belt layer is set at b, a and b satisfy a relationship represented by the following expression: and a coating rubber that coats the first belt layer and the second belt layer comprises: a rubber component comprising natural rubber; a resin component; and a sulfenamide vulcanization accelerator.", "2 . The pneumatic tire according to claim 1 , wherein each of a distance from both upper and lower surfaces of the first belt layer in the center section of the tire to a code and a distance from both upper and lower surfaces of the second belt layer in the center section to a code is 0.14 mm or less.", "3 . The pneumatic tire according to claim 1 , wherein the sulfenamide vulcanization accelerator is N-cyclohexyl-2-benzothiazolylsulfenamide.", "4 . The pneumatic tire according to claim 3 , wherein an amount of the blended N-cyclohexyl-2-benzothiazolylsulfenamide is 0.1 to 3.0 parts by mass with respect to 100 parts by mass of the rubber component.", "5 . The pneumatic tire according to claim 3 , wherein a content of N-tert-butyl-2-benzothiazolylsulfenamide is 0.1 parts by mass or less with respect to 100 parts by mass of the rubber component.", "6 . The pneumatic tire according to claim 1 , wherein the resin component is a phenolic resin.", "7 . The pneumatic tire according to claim 6 , wherein the phenolic resin is phenol-formaldehyde resin.", "8 . The pneumatic tire according to claim 1 , wherein an amount of the blended resin component is 0.1 to 10 parts by mass with respect to 100 parts by mass of the rubber component.", "9 . The pneumatic tire according to claim 2 , wherein the sulfenamide vulcanization accelerator is N-cyclohexyl-2-benzothiazolylsulfenamide.", "10 . The pneumatic tire according to claim 2 , wherein the resin component is a phenolic resin.", "11 . The pneumatic tire according to claim 2 , wherein an amount of the blended resin component is 0.1 to 10 parts by mass with respect to 100 parts by mass of the rubber component.", "12 . The pneumatic tire according to claim 3 , wherein the resin component is a phenolic resin.", "13 . The pneumatic tire according to claim 3 , wherein an amount of the blended resin component is 0.1 to 10 parts by mass with respect to 100 parts by mass of the rubber component.", "14 . The pneumatic tire according to claim 4 , wherein a content of N-tert-butyl-2-benzothiazolylsulfenamide is 0.1 parts by mass or less with respect to 100 parts by mass of the rubber component.", "15 . The pneumatic tire according to claim 4 , wherein the resin component is a phenolic resin.", "16 . The pneumatic tire according to claim 4 , wherein an amount of the blended resin component is 0.1 to 10 parts by mass with respect to 100 parts by mass of the rubber component.", "17 . The pneumatic tire according to claim 5 , wherein the resin component is a phenolic resin.", "18 . The pneumatic tire according to claim 5 , wherein an amount of the blended resin component is 0.1 to 10 parts by mass with respect to 100 parts by mass of the rubber component.", "19 . The pneumatic tire according to claim 6 , wherein an amount of the blended resin component is 0.1 to 10 parts by mass with respect to 100 parts by mass of the rubber component.", "20 . The pneumatic tire according to claim 7 , wherein an amount of the blended resin component is 0.1 to 10 parts by mass with respect to 100 parts by mass of the rubber component."], "bibtex": "@patent{20250001805,\n    title = {PNEUMATIC TIRE},\n    number = {20250001805},\n    year = {2025},\n    note = {File: US20250001805A1-20250102.XML}\n    }", "classification": "B60C920FI"}, {"title": "TIRE", "doc_number": "20250001806", "filename": "US20250001806A1-20250102.XML", "abstract": "A tire has a tread portion comprising a first middle land portion provided with first middle lateral grooves, and a second middle land portion provided with second middle lateral grooves. The first middle lateral grooves are each inclined to one direction. The second middle lateral grooves each comprise a first oblique portion and a second oblique portion which are inclined to different directions. In a plan view of the tread portion, when virtual extension zones are defined by extending the respective second middle lateral grooves in parallel with the tire axial direction, an overlapping area between each of the virtual extension zones and the opening of one of the first middle lateral grooves is not more than 50% of the area of the opening.", "detailed_description": ["An embodiment of the present disclosure will now be described in detail in conjunction with accompanying drawings. Incidentally, the drawings may include exaggerated depictions different from actual dimensional relationships in order to facilitate understanding of the present disclosure.", "", "FIG.1is a developed partial view of a tread portion2of a tire1as an embodiment of the present disclosure.", "", "The tire1in this embodiment is a pneumatic tire for a passenger car, and is designed as so-called all-season tire (also called all-weather tire) which can be suitably used to drive on snowy roads in addition to wet roads and dry roads. However, the present disclosure may be applied to pneumatic tires for heavy duty vehicles such as trucks and buses as well as non-pneumatic tires so-called airless tires in which pressurized air is not used or filled to support the tire load.", "", "As shown inFIG.1, the tread portion2according to the present disclosure comprises a first tread edge T1, a second tread edge T2, a plurality of circumferential grooves3extending continuously in the tire circumferential direction positioning between the first tread edge T1and the second tread edge T2, and a plurality of land portions4divided by the circumferential grooves3.", "", "More specifically, in the tire1in this embodiment, the tread portion2is composed of five land portions4divided by four circumferential grooves3.", "", "InFIG.1, fine dot patterns are applied to openings of grooves and sipes opened at the tread surface. Such fine dot patterns are omitted in the figures other thanFIG.1.", "", "In this application, the term “sipe” refers to a fine groove or cut of which main portion has a small width of not more than 1.5 mm or has no substantial width when measured between the two opposite walls (hereinafter referred to as “sipe walls”). Here, the main portion refers to a portion where the opposite two sipe walls extend in the tire radial direction in substantially parallel to each other.", "", "The expression “substantially parallel” means that the angle formed between the two sipe walls is at most 10 degrees. Such sipe may be provided with a chamfer as described later. Further, such sipe may be provided with a so-called flask bottom, namely, the width of the sipe can be increased more than 1.5 mm in a portion near the sipe bottom.", "", "Contrary to such a sipe, what is referred to as a groove in this application, has two opposite groove walls which do not come into contact with each other even when ground pressure is applied and maintains a substantial drainage path. Thus, the groove width of each groove is, for example, 2.0 mm or more.", "", "In the tire1in this embodiment, the orientation of the tread portion2(tread pattern) when the tire is mounted on a vehicle is specified such that the first tread edge T1is to be outboard of the vehicle, and the second tread edge T2is to be inboard of the vehicle.", "", "Such tire mounting direction is indicated, for example, on the tire sidewall portions (not shown) with letters, symbols or the like.", "", "The present disclosure is, however, not limited to such embodiment, and may be embodied as a tire of which mounting direction on a vehicle is not specified.", "", "The first tread edge T1and the second tread edge T2correspond to the axially outermost edges of the ground contacting surface of the tread portion2when the tire under a standard state is placed on a flat surface at a camber angle of 0 degrees by applying 70% of a standard tire load.", "", "In the case that the tire1is a type of pneumatic tire for which various standards have been established, the standard state is a state of the tire which is mounted on a standard wheel rim and inflated to a standard tire pressure but loaded with no tire load.", "", "In the case that the tire1is a tire for which various standards are not yet established or a non-pneumatic tire, the standard state means a standard usage state according to the purpose of use of the tire and in a condition in which the tire is not installed on a vehicle and no tire load is applied.", "", "In this application including specification and claims, dimensions and positions of each part or portion of the tire refer to those under the standard state unless otherwise noted.", "", "The standard wheel rim is a wheel rim specified for the tire1in a standard system including standards on which the tire1is based, for example, the “Standard rim” in JATMA, “Design Rim” in TRA, “Measuring Rim” in ETRTO.", "", "The standard tire pressure is air pressure specified for the tire1in a standard system including standards on which the tire1is based, for example, the “maximum air pressure” in JATMA, “INFLATION PRESSURE” in ETRTO, and the maximum air pressure listed in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in TRA.", "", "The standard tire load is a load specified for the tire1in a standard system including standards on which the tire1is based, for example, the “maximum load capacity” in JATMA, “LOAD CAPACITY” in ETRTO, and the maximum tire load listed in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in TRA.", "", "In the case that various standards have not been established for the tire1, the standard tire load refers to the maximum load that can be applied when using the tire1according to the above-mentioned standards.", "", "In this embodiment, the circumferential grooves3include a first shoulder circumferential groove5, a second shoulder circumferential groove6, a first crown circumferential groove7, and a second crown circumferential groove8.", "", "The first shoulder circumferential groove5is disposed closest to the first tread edge T1among the circumferential grooves3.", "", "The second shoulder circumferential groove6is disposed closest to the second tread edge T2among the circumferential grooves3.", "", "The first crown circumferential groove7is disposed between the first shoulder circumferential groove5and the tire equator C.", "", "The second crown circumferential groove8is disposed between the second shoulder circumferential groove6and the tire equator C.", "", "The distance L1in the tire axial direction from the tire equator C to the groove center line of the first shoulder circumferential groove5is preferably not less than 20%, but not more than 35% of a tread width TW.", "", "The distance L1in the tire axial direction from the tire equator C to the groove center line of the second shoulder circumferential groove6is preferably not less than 20%, but not more than 35% of the tread width TW.", "", "The distance L2in the tire axial direction from the tire equator C to the groove center line of the first crown circumferential groove7is preferably not less than 5%, but not more than 15% of the tread width TW.", "", "The distance L2in the tire axial direction from the tire equator C to the groove center line of the second crown circumferential groove8is preferably not less than 5%, but not more than 15% of the tread width TW.", "", "Here, the tread width TW is the distance in the tire axial direction from the first tread edge T1to the second tread edge T2measured under the standard state of the tire.", "", "In this application, when a numerical range of a parameter is described, it means a numerical range of the average value of the parameter unless otherwise noted. The “average value” can be obtained for example by dividing a measurement target for the parameter into multiple micro-regions of appropriate size, measuring the parameter of each micro-region, summing up the measured values of parameter of the micro-regions. and dividing the sum total by the number of the micro-regions.", "", "It is preferable that the groove width W1of each of the circumferential grooves3is at least 3 mm.", "", "It is preferable that the groove width W1of each of the circumferential grooves3is not less than 3.0%, but not more than 7.0% of the tread width TW.", "", "The depth of each of the circumferential grooves3is preferably not less than 5 mm, but not more than 10 mm in the case that the tire1is a pneumatic tire for passenger cars.", "", "In each of the first crown circumferential groove7, the second crown circumferential groove8and the second shoulder circumferential groove6in this embodiment, each of the groove edges on both sides extends linearly on a straight line which is parallel to the tire circumferential direction.", "", "However, in the first shoulder circumferential groove5, the groove edge on the first tread edge T1side extends linearly on a straight line in parallel to the tire circumferential direction, whereas the groove edge on the second tread edge T2side extends in a zigzag shape. Such zigzag groove edge helps to improve on-snow traction performance.", "", "The land portions4in this embodiment include a crown land portion10, a first middle land portion11, a second middle land portion12, a first shoulder land portion13and a second shoulder land portion14.", "", "The crown land portion10in this embodiment is defined between the first crown circumferential groove7and the second crown circumferential groove8. Thereby, the crown land portion10is positioned on the tire equator C.", "", "The first middle land portion11is defined between the first shoulder circumferential groove5and the first crown circumferential groove7.", "", "The second middle land portion12is defined between the second shoulder circumferential groove6and the second crown circumferential groove8.", "", "The first shoulder land portion13is defined axially outside the first shoulder circumferential groove5and includes the first tread edge T1.", "", "The second shoulder land portion14is defined axially outside the second shoulder circumferential groove6and includes the second tread edge T2.", "", "FIG.2shows a partial top view of the first middle land portion11, and a partial top view of the second middle land portion12, wherein the crown land portion10between these land portions11and12is almost omitted.", "", "As shown inFIG.2, the first middle land portion11has a first longitudinal edge11aon the first tread edge T1side (the left side inFIG.2), a second longitudinal edge11bon the second tread edge T2side (the right side inFIG.2), and a ground contacting top surface11sbetween the first longitudinal edge11aand the second longitudinal edge11b.", "", "The second middle land portion12has a first longitudinal edge12aon the first tread edge T1side, a second longitudinal edge12bon the second tread edge T2side, and a ground contacting top surface12sbetween the first longitudinal edge12aand the second longitudinal edge12b.", "", "The first middle land portion11is provided with a plurality of first middle lateral grooves21extending from the first longitudinal edge11ato the second longitudinal edge11b.", "", "The first middle lateral grooves21are inclined with respect to the tire axial direction to a first direction (in the drawins, the inclination is upward to the right) while extending from the first longitudinal edge11ato the second longitudinal edge11bof the first middle land portion11.", "", "Here, the first direction means a direction toward one side in the tire circumferential direction, and the under-mentioned second direction means a direction toward the other side in the tire circumferential direction.", "", "The second middle land portion12is provided with a plurality of second middle lateral grooves22extending from the first longitudinal edge12ato the second longitudinal edge12b.", "", "Each of the second middle lateral grooves22comprises a first oblique portion22A and a second oblique portion22B.", "", "The first oblique portion22A extends from the first longitudinal edge12atoward the second longitudinal edge12bof the second middle land portion12, while inclining with respect to the tire axial direction to a second direction opposite to the first direction (in the drawing, the inclination is downward to the right).", "", "The second oblique portion22B extends from the second longitudinal edge12btoward the first longitudinal edge12aof the second middle land portion12, while inclining with respect to the tire axial direction to the second direction (in the drawing, the inclination is upward to the right, namely, opposite to the first oblique portion22A).", "", "According to the present disclosure, in the plan view of the tread portion2, when virtual extension zones23are respectively defined by extending circumferential extents of the respective second middle lateral grooves22toward the first tread edge T1in parallel to the tire axial direction (inFIG.2, only one of the virtual extension zones23is indicated by applying fine dots), the virtual extension zones23respectively overlap with openings of the respective first middle lateral grooves21so that the overlapping area between each virtual extension zone23and the opening of one of the first middle lateral grooves21is at most 50% of the area of the opening of the above-said one of the first middle lateral grooves21. In the present embodiment, as apparent fromFIG.2, the virtual extension zones23are arranged at intervals in the tire circumferential direction.", "", "Thus, according to the present disclosure, the first middle lateral grooves21and the second middle lateral grooves22are arranged in the tire circumferential direction so that the overlapping area satisfies the above limitation. By employing such groove arrangement, the tire1can be improved in wet performance and on-snow performance while maintaining steering stability on dry road surfaces (hereinafter simply referred to as the steering stability). The reason is as follows.", "", "In the present disclosure, since the first middle lateral grooves21and the second middle lateral grooves22are provided with the above-described inclining directions, they can exhibit high drainage performance on wet road surfaces and can generate shear forces in multiple directions by snow columns, namely, compacted snow blocks when running on snow. Thus, it is possible to improve the wet performance and on-snow performance.", "", "If the positions in the tire circumferential direction of the first middle lateral grooves21are the same as the positions in the tire circumferential direction of the second middle lateral grooves22, the rigidity of the tread portion2in the tire circumferential direction is locally reduced due to these coincident lateral grooves21and22, and the steering stability on dry road surfaces is liable to be deteriorated.", "", "However, in the present disclosure, since the overlapping area between the virtual extension zone23of the second middle lateral groove22and the opening of the first middle lateral groove21is limited as described above, the occurrence of the above-mentioned problems is suppressed, and thereby, it becomes possible to maintain the steering stability on dry road surfaces.", "", "According to the present disclosure, in order to surely improve the wet performance and on-snow performance, the second middle lateral grooves22are arranged in relation to the first middle lateral grooves21such that circumferential extents of the second middle lateral grooves22respectively overlap with circumferential extents of the respective first middle lateral grooves21in the tire circumferential direction.", "", "From the viewpoint of improving the wet performance, on-snow performance, and steering stability on dry road surfaces in a well-balanced manner, the above-mentioned overlapping area is preferably set to be not less than 10%, but not more than 30% of the area of the opening.", "", "More detailed configurations in the present embodiment will be described below.", "", "Each of the first middle lateral grooves21extends with a constant groove width.", "", "The angle θ6of each of the first middle lateral grooves21with respect to the tire axial direction is preferably not less than 15 degrees, more preferably not less than 20 degrees, but preferably not more than 50 degrees, more preferably not more than 40 degrees.", "", "Further, the angle θ6increases toward the second longitudinal edge11b, therefore, the first middle lateral groove21is curved. Such first middle lateral groove21can improve on-snow traction performance and on-snow cornering performance in a well-balanced manner.", "", "When the first middle lateral groove21is curved, the angle θ6means the average angle of the first middle lateral groove21with respect to the tire axial direction.", "", "Here, an average angle of a curved or nonlinear groove can be obtained by dividing the groove into a number of small groove segments, summing up the angles of the small groove segments, and dividing the sum total of the angles by the number of the small groove segments.", "", "FIG.3is a cross-sectional view of the first middle lateral groove21taken along line A-A inFIG.2.FIG.4shows a cross-sectional view of the first middle lateral groove21taken along line B-B inFIG.2.", "", "As shown inFIGS.2to4, the first middle lateral groove21in this embodiment is provided with a chamfer21c.", "", "As shown inFIGS.3and4, the chamfer21cis a sloped surface24extending from the ground contacting top surface11sto the groove wall21wat a certain angle with respect to a normal line to the ground contacting top surface in a cross section perpendicular to the length direction of the lateral groove.", "", "The lateral groove with the chamfer21ccan prevent a portion around the groove opening, of the ground contacting top surface11sfrom lifting off the road surface. This helps to uniform the ground pressure and prevent uneven wear.", "", "From the viewpoint of ensuring such effects, the width W5of the chamfer21cor sloped surface24as shown inFIG.4is 1.0 to 2.0 mm, for example.", "", "In this embodiment, it is preferable that the chamfer21cis provided on each side of the first middle lateral groove21.", "", "Further, it is preferable that the chamfers21care provided over the entire length of the first middle lateral groove21as shown inFIG.2.", "", "The width of each of the chamfers21cis constant over 80% or more of the first middle lateral groove21in the length direction thereof.", "", "In this embodiment, as shown inFIGS.2to4, the first middle lateral groove21comprises a first portion26(shown inFIG.3) in which a sipe29is provided in the groove bottom28, and a second portion27(shown inFIG.4) in which no sipe is provided in the groove bottom28.", "", "As shown inFIG.4, the second portion27has a groove depth d4.", "", "As shown inFIG.3, in the first portion26, a depth d2from the ground contacting top surface11sto the outer surface28sof the groove bottom28where the groove bottom28is provided with a sipe29, is smaller than the groove depth d4of the second portion27.", "", "When the outer surface28sof the groove bottom28is divided into three equal parts in the groove width direction, the sipe29is disposed in the central part.", "", "The depth d3from the ground contacting top surface11sto the bottom of the sipe29is set in a range from 130% to 170% of the above-mentioned depth d2.", "", "Such first portion26helps to improve the steering stability, on-snow performance and wet performance in a well-balanced manner.", "", "As shown inFIG.4, the above-mentioned depth d4of the second portion27is set in a range from 5.0 to 7.0 mm, for example.", "", "The depth d4of the second portion27is preferably set to be not less than 80%, but not more than 120% of the depth d3of the first portion26.", "", "Such second portion27helps to improve the steering stability and wet performance in a well-balanced manner.", "", "It is preferable that, as shown inFIGS.2, 20% to 50% of the first middle lateral groove21in its length direction is formed as the first portion26, and the remaining portion is formed as the second portion27.", "", "Such first middle lateral groove21can surely exhibit the above-described effects.", "", "In the present embodiment, the first middle lateral grooves21provided on the first middle land portion11include two types: one is such that the first portion26is located closer to the first tread edge T1than the second portion27, and the other is such that the second portion27is located closer to the first tread edge T1than the first portion26.", "", "These two types of first middle lateral grooves21in which the first portions26are located at different positions are preferably arranged alternately in the tire circumferential direction. Thereby, wear resistance of the first middle land portion11can be improved.", "", "In this embodiment, the first middle land portion11is provided with a plurality of terminating middle sipes30.", "", "When the ground pressure is applied to the portion around the sipe, the two sipe walls in the main portion come into contact with each other owing to the above-described configuration of the sipe, and the apparent rigidity of the portion around the sipe can be maintained.", "", "Each of the terminating middle sipes30extends from the first longitudinal edge11aor the second longitudinal edge11b, and has a closed end within the ground contacting top surface11s.", "", "In this embodiment, the terminating middle sipes30include first terminating middle sipes31extending from the first longitudinal edge11a, and second terminating middle sipes32extending from the second longitudinal edge11b.", "", "The first terminating middle sipes31and the second terminating middle sipes32help to improve the wet performance and on-snow performance as well as the wear resistance performance.", "", "In this embodiment, between every two of the circumferentially adjacent first middle lateral grooves21, there is disposed only one terminating middle sipe30. And preferably, the first terminating middle sipes31and the second terminating middle sipes32are alternately arranged in the tire circumferential direction. Thereby, wear resistance is further improved.", "", "In this example, the terminating middle sipes30each extend linearly, and are inclined with respect to the tire axial direction to the above-mentioned first direction toward the second longitudinal edge11bfrom the first longitudinal edge11a.", "", "The angle θ7of the first terminating middle sipe31with respect to the tire axial direction is, for example, not less than 15 degrees, but not more than 50 degrees, preferably not more than 25 degrees.", "", "The angle θ8of the second terminating middle sipe32with respect to the tire axial direction is larger than the angle θ7of the first terminating middle sipe31. Specifically, the angle θ8is, for example, not less than 15 degrees, preferably not less than 30 degrees, but not more than 50 degrees, preferably not more than 40 degrees. Such terminating middle sipe30improves traction performance and cornering performance on wet roads and snowy roads in a well-balanced manner.", "", "The length L6in the tire axial direction of each of the terminating middle sipes30is, for example, not less than 35%, preferably not less than 40%, but not more than 65%, preferably not more than 60% of the maximum width W6of the ground contacting top surface11sof the first middle land portion11.", "", "Thereby, while maintaining the wear resistance performance of the first middle land portion11, the above-mentioned effects can be exhibited.", "", "Here, the length L6corresponds to the length in the tire axial direction of a center line which divides the width of the sipe into two equal parts. The same applies to the description of the length of the sipe descrived below.", "", "FIG.5is a cross-sectional view of the terminating middle sipe30taken along line C-C inFIG.2. As shown inFIGS.2and5, the terminating middle sipe30is at least partially provided with a chamfer30c.", "", "As shown inFIG.5, the chamfer30cis a sloped surface19extending from the ground contacting top surface11sof the land portion to the sipe wall30wof the terminating middle sipe30at a certain angle with respect to a normal line to the ground contacting top surface11sin a cross section perpendicular to the length direction of the sipe30. The sipe with the chamfer30ccan prevent a portion around the sipe, of the ground contacting top surface11sfrom lifting off the road surface, which helps to uniform the ground pressure and prevent uneven wear.", "", "From the viewpoint of exhibiting this effect, the maximum width W4of the chamfer30c, namely, the sloped surface19is at least 50% of the sipe width W3at the main portion of the sipe.", "", "The maximum width W4of the sloped surface19is preferably not less than 0.5 mm, more preferably not less than 1.0 mm, but preferably not more than 2.0 mm, more preferably not more than 1.5 mm.", "", "The depth d1of the chamfer16cis, for example, not less than 0.5 mm, but not more than 2.0 mm.", "", "In this embodiment, as shown inFIG.2, the width of the chamfer30cof the terminating middle sipe30measured in the direction orthogonal to the length direction of the sipe, becomes smaller toward its closed end located within the ground contacting top surface11s. Thereby, while obtaining the edge effect from the terminating middle sipe30, uneven wear of the first middle land portion11can be suppressed.", "", "The second middle lateral groove22is composed of only the first oblique portion22A and the second oblique portion22B.", "", "The first oblique portion22A and the second oblique portion22B are connected with each other in the central part when the ground contacting top surface12sof the second middle land portion12is divided into three equal parts in the tire axial direction. Thus, the length L7in the tire axial direction of the first oblique portion22A and the length L8in the tire axial direction of the second oblique portion22B are between 40% and 60% of the maximum width W7of the ground contacting top surface12sof the second middle land portion12.", "", "Thereby, on-snow performance is improved while suppressing uneven wear of the second middle land portion12.", "", "The angle θ9of the first oblique portion22A with respect to the tire axial direction is, for example, not less than 5 degrees, but not more than 25 degrees.", "", "The first oblique portion22A may be curved so that the angle θ9gradually increases toward the second tread edge T2side.", "", "The angle θ10of the second oblique portion22B with respect to the tire axial direction is, for example, not less than 5 degrees, but not more than 25 degrees.", "", "The second oblique portion22B may be curved so that the angle θ10gradually increases toward the first tread edge T1side.", "", "Thereby, the drainage performance of the second middle lateral groove22is improved.", "", "The angle θ11between the first oblique portion22A and the second oblique portion22B is an obtuse angle, for example, and preferably in a range from 105 degrees to 135 degrees. Thereby, while suppressing uneven wear of the second middle land portion12, the above-mentioned effects can be obtained.", "", "When at least one of the first oblique portion22A and the second oblique portion22B is not straight, the angle θ11is defined as an angle between a straight line drawn between both ends of the groove center line of the first oblique portion22A and a straight line drawn between both ends of the groove center line of the second oblique portion22B.", "", "In each of the second middle lateral grooves22, one of the first oblique portion22A and the second oblique portion22B is provided with a sipe in the groove bottom portion, but the other of the first oblique portion22A and the second oblique portion22B is provided with no sipe in the groove bottom portion.", "", "In each of the second middle lateral grooves22, for the region where the sipe is provided in the groove bottom portion, the above described structure of the first portion26(shown inFIG.3) of the first middle lateral groove21can be employed, therefore, redundant descriptions will be omitted.", "", "On the other hand, for the region where no sipe is provided in the groove bottom portion, the structure of the second portion27(shown inFIG.4) of the first middle lateral groove21can be employed, therefore, redundant descriptions will be omitted.", "", "Such second middle lateral grooves22can surely improve the wet performance and on-snow performance while maintaining the steering stability.", "", "The second middle land portion12is provided withthe second middle lateral grooves22in which the sipe is provided in the groove bottom portion of the first oblique portion22A, andthe second middle lateral grooves22in which the sipe is provided in the groove bottom portion of the second oblique portion22B.", "", "It is preferable that these two types of second middle lateral grooves22with different sipe arrangements are alternately arranged in the tire circumferential direction.", "", "This improves the wear resistance of the second middle land portion12.", "", "The second middle land portion12is provided with a plurality of transverse middle sipes35.", "", "The transverse middle sipes35each extend from the first longitudinal edge12ato the second longitudinal edge12bof the second middle land portion12.", "", "In this embodiment, one or two transverse middle sipes35are provided between every two of the circumferentially adjacent second middle lateral grooves22.", "", "The transverse middle sipe35comprises a first sipe segment36and a second sipe segment37which has different inclining directions with respect to the tire axial direction.", "", "The first sipe segment36is inclined with respect to the tire axial direction to the second direction while extending from the first longitudinal edge12a.", "", "As a result, the first sipe segment36extends along the first oblique portion22A of the second middle lateral groove22, and the angular difference therebetween is 5 degrees or less.", "", "The angle θ12of the first sipe segment36with respect to the tire axial direction is not less than 5 degrees, but not more than 25 degrees.", "", "The second sipe segment37is inclined with respect to the tire axial direction to the first direction toward the second longitudinal edge12b.", "", "As a result, the second sipe segment37extends along the second oblique portion22B of the second middle lateral groove22, and the angular difference therebetween is 5 degrees or less.", "", "The angle θ13of the second sipe segment37with respect to the tire axial direction is not less than 5 degrees, but not more than 25 degrees.", "", "By providing the first sipe segment36and second sipe segment37as described above, the transverse middle sipe35can provide frictional force in multiple directions on wet road surfaces.", "", "The length L9in the tire axial direction of the first sipe segment36is, for example, not less than 40%, but not more than 60% of the maximum width W7in the tire axial direction, of the ground contacting top surface12sof the second middle land portion12.", "", "Preferably, the length L9of the first sipe segment36is substantially the same as the length L7in the tire axial direction of the first oblique portion22A of the second middle lateral groove22.", "", "The length L10in the tire axial direction of the second sipe segment37is, for example, not less than 40%, but not more than 60% of the maximum width W7of the ground contacting top surface12sof the second middle land portion12.", "", "Preferably, the length L10is the same as the length L8in the tire axial direction of the second oblique portion22B of the second middle lateral groove22.", "", "Thereby, while suppressing uneven wear of the second middle land portion12, the above-mentioned effects can be obtained.", "", "It is preferable that the transverse middle sipe35is provided with a chamfer35c.", "", "For the chamfer35c, the configuration of the chamfer30cof the terminating middle sipe30shown inFIG.5can be employed, therefore, redundant descriptions will be omitted.", "", "In the present embodiment, it is preferable that the width of the chamfer35cmeasured in the direction perpendicular to the length direction of the transverse middle sipe35becomes smaller toward the connection38between the first sipe segment36and the second sipe segment37.", "", "Thereby, while obtaining the edge effect of the transverse middle sipe35, uneven wear of the second middle land portion12can be suppressed.", "", "FIG.6is a partial top view of the crown land portion10.", "", "As shown inFIG.6, the crown land portion10has a first longitudinal edge10aextending in the tire circumferential direction on the first tread edge T1side, a second longitudinal edge10bextending in the tire circumferential direction on the second tread edge T2side, and a ground contacting top surface10sbetween the first longitudinal edge10aand the second longitudinal edge10b.", "", "The crown land portion10is provided with a plurality of first sipes16, a plurality of second sipes17, and a plurality of third sipes18.", "", "Each of the first sipes16extends from the first longitudinal edge10aand has a closed end within the ground contacting top surface10s.", "", "Each of the second sipes17extends from the second longitudinal edge10band has a closed end within the ground contacting top surface10s.", "", "Each of the third sipes18extends from the first longitudinal edge10ato the second longitudinal edge10b.", "", "Each of the first sipes16is inclined with respect to the tire axial direction to the first direction toward the second longitudinal edge10b.", "", "Each of the second sipes17is inclined with respect to the tire axial direction to the second direction toward the second longitudinal edge10b.", "", "Each of the third sipes18comprises a first oblique portion18A and a second oblique portion18B.", "", "The first oblique portion18A extends from the first longitudinal edge10atoward the second longitudinal edge10bwhile inclining with respect to the tire axial direction to the first direction.", "", "The second oblique portion18B extends from the second longitudinal edge10btoward the first longitudinal edge10a, while inclining with respect to the tire axial direction to the first direction.", "", "The sipes16,17and18having such configurations can provide frictional force in multiple directions when running on snow, and help to improve the on-snow performance.", "", "On the other hand, since the first sipes16and the second sipes17respectively have the closed ends within the crown land portion10, it is helpful for maintaining the rigidity of the crown land portion10and maintaining the steering stability on dry road surfaces.", "", "Further, as described above, the first sipes16and the first oblique portions18A of the third sipes18extend from the first longitudinal edge10awhile inclining to the same direction, andthe second sipes17and the second oblique portion18B of the third sipe18extend from the second longitudinal edge10bwhile inclining to the same direction.", "", "Thereby, between the first sipes16and the third sipes18, and between the second sipes17and the third sipes18, there are less likely to occur regions where the land portion rigidity is locally reduced, thereby, it becomes possible to more surely maintain the steering stability.", "", "In this embodiment, between every two of the circumferentially adjacent third sipes18, there are disposed one of the first sipes16and one of the second sipes17. Thus, the third sipes18are alternated with pairs of one of the first sipes16and one of the second sipes17in the tire circumferential direction.", "", "This sipe arrangement makes the rigidity distribution of the crown land portion10uniform, and can surely maintain the steering stability on dry road surfaces.", "", "Further, this sipe arrangement reduces the impact sound generated when the crown land portion10contacts with the ground, and improves noise performance as well as wear resistance performance of the crown land portion10.", "", "The first sipes16in this example extends linearly at a constant inclination angle toward the above-mentioned first direction. But, the first sipes16may be smoothly curved.", "", "The length L3in the tire axial direction of the first sipes16is preferably not less than 30%, more preferably not less than 40%, but preferably not more than 60% more preferably not more than 50% of the maximum width W2in the tire axial direction of the ground contacting top surface10sof the crown land portion10. Such first sipes16help to improve the steering stability and on-snow performance in a well-balanced manner.", "", "The angle θ1of the first sipes16with respect to the tire axial direction is preferably not less than 40 degrees, more preferably not less than 50 degrees, but preferably not more than 70 degrees, more preferably not more than 60 degrees. This improves the traction performance and cornering performance in a well-balanced manner when running on snow.", "", "In this embodiment, each of the first sipes16is at least partially provided with a chamfer16c.", "", "For the chamfer16cof the first sipe16, the configuration of the chamfer30c(shown inFIG.5) of the terminating middle sipe30can be employed, therefore, redundant descriptions will be omitted.", "", "In this embodiment, the chamfer16cis provided on each side of the first sipe16in the width direction. But, the chamfer16cmay be provided on only one side of the first sipes16in the width direction.", "", "Further, in this embodiment, the chamfer16cis provided over the entire length of the first sipes16. Thereby, the ground pressure can be made uniform around the first sipes16, and the steering stability can be surely improved. Further, such chamfers16creduces the impact sound when the first sipe16edges contact with the ground, and the noise performance can be improved.", "", "It is preferable that the width of the chamfer16cis constant over 80% or more of the first sipes16in the length direction.", "", "Thereby, uneven wear around the first sipes16can be suppressed, and the wear resistance performance can be improved.", "", "The second sipe17in this example extends linearly at a certain angle, inclining to the second direction toward the second longitudinal edge10b. But, the second sipe17may be smoothly curved.", "", "The length LA in the tire axial direction of the second sipe17is preferably not less than 30%, more preferably not less than 40%, but preferably not more than 60%, more preferably not more than 50% of the maximum width W2in the tire axial direction of the ground contacting top surface10sof the crown land portion10.", "", "Further, it is preferable that the length of the second sipe17measured therealong is less than 100%, more preferably from 60% to 75% of the length of the first sipe16measured therealong.", "", "Such second sipe17helps to improve the steering stability and on-snow performance in a well-balanced manner.", "", "The angle θ2of the second sipe17with respect to the tire axial direction is smaller than the angle θ1of the first sipes16with respect to the tire axial direction.", "", "Specifically, the angle θ2of the second sipe segment37with respect to the tire axial direction is preferably not less than 10 degrees, more preferably not less than 20 degrees, but preferably not more than 40 degrees, more preferably not more than 30 degrees. Such second sipes17, in cooperation with the first sipes16, help to improve the traction performance and the cornering performance in a well-balanced manner when running on snow.", "", "In this embodiment, the second sipe17is at least partially provided with a chamfer17c.", "", "For the chamfer17cof the second sipe17, the configuration of the chamfer30c(shown inFIG.5) of the terminating middle sipe30can be employed, therefore, redundant descriptions will be omitted.", "", "It is preferable that the chamfer17cis provided over the entire length of the second sipe17.", "", "Preferably, the width of the chamfer17cof the second sipe segment37is constant over 80% or more of the second sipe17in the length direction thereof.", "", "This improves the steering stability as well as the noise performance and the wear resistance.", "", "The distance L5in the tire circumferential direction betweenthe closed end of the first sipe16closed in the ground contacting top surface10sof the crown land portion10, andthe closed end of the second sipe17closed in the ground contacting top surface10s, is not more than 30%, preferably 10% to 15% of one pitch length P1of the first sipes16in the tire circumferential direction.", "", "Here, the one pitch length P1corresponds to the distance in the tire circumferential direction between the ends on the first longitudinal edge10aside, of the two first sipes16adjacent to each other in the tire circumferential direction.", "", "Thereby, the first sipe16and the second sipe17can work together to improve the on-snow performance, while maintaining the steering stability.", "", "The third sipe18in this example is composed of only the first oblique portion18A and the second oblique portion18B. Thereby, the third sipe18is bent convexly toward one side in the tire circumferential direction.", "", "In this example, the intersection of the first oblique portion18A and the second oblique portion18B is positioned in the central part of the ground contacting top surface10swhen divided into three equal parts in the tire axial direction. Thereby, while suppressing uneven wear of the crown land portion10, the above-mentioned effect can be exhibited. The third sipe18is however, not limited to such configuration.", "", "In this example, the first oblique portion18A of the third sipe18extends linearly from the first longitudinal edge10atoward the second longitudinal edge10bwhile inclining to the first direction. However, the first oblique portion18A may be smoothly curved.", "", "The angle θ3of the first oblique portion18A with respect to the tire axial direction is preferably not less than 40 degrees, more preferably not less than 50 degrees, but preferably not more than 70 degrees, more preferably not more than 60 degrees. Thereby, the traction performance and the cornering performance when running on snow are improved in a well-balanced manner.", "", "In this example, the second oblique portion18B of the third sipe18extends linearly from the second longitudinal edge10btoward the first longitudinal edge10awhile inclining to the first direction. However, the second oblique portion18B may be smoothly curved.", "", "The angle θ4of the second oblique portion18B with respect to the tire axial direction is preferably not less than 10 degrees, more preferably not less than 20 degrees, but preferably not more than 40 degrees, more preferably not more than 30 degrees. Thereby, the traction performance and cornering performance when running on snow are improved in a well-balanced manner.", "", "The angle θ3of the first oblique portion18A with respect to the tire axial direction is larger than the angle θ4of the second oblique portion18B with respect to the tire axial direction. Thereby, the energy of the impact sound generated when the edges of the first oblique portion18A and the second oblique portion18B contact with the ground is dispersed over a wide frequency band, and the noise performance is improved.", "", "The angle θ5between the first oblique portion18A and the second oblique portion18B is, for example, not less than 90 degrees, but not more than 120 degrees. Thereby, the traction performance and the cornering performance when running on snow is improved.", "", "When at least one of the first oblique portion18A and the second oblique portion18B is curved, the angle θ5is defined as an angle between a straight line drawn between both ends of the first oblique portion18A, and a straight line drawn between both ends of the second oblique portion18B.", "", "FIG.7is a cross-sectional view of the third sipe18taken along line D-D inFIG.5. As shown inFIG.7, the third sipe18is provided with no chamfer. That is, each of the opposite sipe walls18wof the third sipe18intersects with the ground contacting top surface10sof the crown land portion10, and an angled corner is formed therebetween.", "", "Further, as shown inFIG.6, the edges of the third sipe18are not chamfered along their entire length. Thereby, When driving on icy roads, the third sipes18can provide a large frictional force by their edges.", "", "FIG.8shows partial top views of the first shoulder land portion13, the first middle land portion11and the crown land portion10.", "", "As shown, the first shoulder land portion13is provided with a plurality of first shoulder lateral grooves41and a plurality of first shoulder sipes42.", "", "In this embodiment, the first shoulder lateral grooves41and the first shoulder sipes42are arranged alternately in the tire circumferential direction.", "", "The first shoulder lateral groove41extends from the first shoulder circumferential groove5to at least the first tread edge T1.", "", "The first shoulder lateral groove41in this example comprises a portion inclined with respect to the tire axial direction to the first direction toward the axially inside.", "", "The maximum angle θ14of the first shoulder lateral groove41with respect to the tire axial direction is, for example, not less than 10 degrees, but not more than 20 degrees. Such first shoulder lateral grooves41help to improve the wet performance and the on-snow performance.", "", "The first shoulder lateral groove41is provided with a chamfer41c. For the chamfer41cof the first shoulder lateral groove41, the configuration of the chamfer21cof the first middle lateral groove21(shown inFIGS.3and4) can be employed, therefore, redundant descriptions will be omitted.", "", "The first shoulder sipe42in this example extends from the first shoulder circumferential groove5to the first tread edge T1. But, it may be possible to end the first shoulder sipe42before reaching the first tread edge T1.", "", "The first shoulder sipe42in this example comprises a portion inclined with respect to the tire axial direction to the first direction toward the axially inside.", "", "The maximum angle θ15of the first shoulder sipe42with respect to the tire axial direction is not less than 10 degrees, but not more than 20 degrees.", "", "It is preferable that the first shoulder sipes42extend along the first shoulder lateral grooves41, and the angular difference between them is not more than 5 degrees.", "", "In cooperation with the first shoulder lateral grooves41, such first shoulder sipes42can provide large traction when running on wet roads and snowy roads.", "", "The first shoulder sipe42is provided with a chamfer42c.", "", "For the chamfer42cof the first shoulder sipe42, the configuration of the chamfer30c(shown inFIG.5) of the terminating middle sipe30can be employed, therefore, redundant descriptions will be omitted.", "", "It is preferable that the chamfer42cis formed over the entire length of the first shoulder sipe42, and the width of the chamfer42cis constant over 80% or more of the length of the first shoulder sipe42.", "", "Such first shoulder sipes42can improve the wet performance while suppressing uneven wear of the first shoulder land portion13.", "", "The present embodiment is attempted to further improve various performances by optimizing the arrangement of the lateral grooves and the sipes which are adjacent via the circumferential grooves in the plan view of the tread portion2.", "", "Specifically, in the plan view of the tread portion2as shown inFIG.8, when a first virtual zone51(dotted zone inFIG.8) is defined by extending the first middle lateral groove21toward the crown land portion10while keeping the groove width and the inclination angle at the first middle lateral groove21end on the crown land portion10side, the first virtual zone51overlaps with the end of the sipe16on the first crown circumferential groove7side.", "", "Further, in the plan view of the tread portion2as shown inFIG.8, when a second virtual zone52(dotted zone inFIG.8) is defined by extending the first shoulder lateral groove41toward the first middle land portion11while keeping the groove width and the inclination angle at the first shoulder lateral groove41end on the first middle land portion11side, the second virtual zone52overlaps with the end of the first middle lateral groove21on the first shoulder circumferential groove5side.", "", "Thereby, the first sipes16, the first middle lateral grooves21and the first shoulder lateral grooves41work together to provide a reaction force when running on snow, and thereby, it becomes possible to further increase the traction on the snow.", "", "FIG.9shows partial top views of the second shoulder land portion14, the second middle land portion12and the crown land portion10.", "", "As shown, the second shoulder land portion14is provided with a plurality of second shoulder lateral grooves43and a plurality of second shoulder sipes44.", "", "In this embodiment, one or two second shoulder sipes44are disposed between every two of the circumferential adjacent second shoulder lateral grooves43.", "", "The second shoulder lateral groove43extends from the second shoulder circumferential groove6to at least the second tread edge T2.", "", "The second shoulder lateral groove43in this example comprises a portion inclined with respect to the tire axial direction to the first direction toward the second tread edge T2from the second shoulder circumferential groove6.", "", "The maximum angle θ16of the second shoulder lateral groove43with respect to the tire axial direction is, for example, not less than 10 degrees, but not more than 20 degrees.", "", "Such second shoulder lateral grooves43help to improve the wet performance and on-snow performance.", "", "The second shoulder lateral groove43is provided with a chamfer43c. For the chamfer43cof the second shoulder lateral groove43, the configuration of the chamfer21c(shown inFIGS.3and4) of the first middle lateral groove21can be employed, therefore, redundant descriptions will be omitted.", "", "The second shoulder sipe44in this example extends from the second shoulder circumferential groove6to the second tread edge T2. But, it may be possible to end the second shoulder sipe44before reaching the second tread edge T2.", "", "The second shoulder sipe44in this example comprises a portion inclined with respect to the tire axial direction to the first direction toward the second tread edge T2from the second shoulder circumferential groove6.", "", "The maximum angle θ17of the second shoulder sipe44with respect to the tire axial direction is not less than 10 degrees, but not more than 20 degrees.", "", "It is preferable that the second shoulder sipes44extend along the second shoulder lateral grooves43, and the angular difference between them is not more than 5 degrees. Such second shoulder sipes44can improve the wet performance and on-snow performance while suppressing uneven wear of the second shoulder land portion14.", "", "The second shoulder sipe44is provided with a chamfer44c. For the chamfer44cof the second shoulder sipe44, the configuration of the chamfer30c(shown inFIG.5) of the terminating middle sipe30can be employed, therefore, redundant descriptions will be omitted.", "", "It is preferable that the chamfer44cis formed over the entire length of the second shoulder sipe44, and the width of the chamfer44cbecomes smaller toward the second tread edge T2.", "", "In the plan view of the tread portion2as shown inFIG.9, when a third virtual zone53(dotted inFIG.9) is defined by extending the second middle lateral groove22toward the crown land portion10while keeping the groove width and the inclination angle at the second middle lateral groove22end on the crown land portion10side, the third virtual zone53overlaps with the end of the second sipe17on the second crown circumferential groove8side.", "", "Further, in the plan view of the tread portion2as shown inFIG.9, when a fourth virtual zone54(dotted inFIG.9) is defined by extending the second shoulder lateral groove43toward the second middle land portion12while keeping the groove width and the inclination angle at the second shoulder lateral groove43end on the second middle land portion12side, the fourth virtual zone54overlaps with the second middle lateral groove22end on the second shoulder circumferential groove6side.", "", "As a result, the second sipes17, the second middle lateral grooves22and the second shoulder lateral grooves43work together to provide a reaction force when running on snow, and thereby, it becomes possible to increase the traction on the snow.", "", "While detailed description has been made of a preferable embodiment of the present disclosure, the present disclosure can be embodied in various forms without being limited to the illustrated embodiment."], "claims": ["a tread portion, having a first tread edge and a second tread edge, and provided with a plurality of circumferential grooves extending continuously in a tire circumferential direction between the first tread edge and the second tread edge to form a plurality of land portions divided by the circumferential grooves; the plurality of land portions including a first middle land portion disposed between the first tread edge and a tire equator, and a second middle land portion disposed between the second tread edge and the tire equator; each of the first middle land portion and the second middle land portion has a first longitudinal edge on the first tread edge side, a second longitudinal edge on the second tread edge side, and a ground contacting top surface between the first longitudinal edge and the second longitudinal edge; the first middle land portion provided with a plurality of first middle lateral grooves extending from the first longitudinal edge to the second longitudinal edge of the first middle land portion; the second middle land portion provided with a plurality of second middle lateral grooves extending from the first longitudinal edge to the second longitudinal edge of the second middle land portion; each of the first middle lateral grooves being inclined with respect to the tire axial direction to a first direction from the first longitudinal edge toward the second longitudinal edge; each of the second middle lateral grooves comprising a first oblique portion extending from the first longitudinal edge toward the second longitudinal edge, while inclining with respect to the tire axial direction, and a second oblique portion extending from the second longitudinal edge toward the first longitudinal edge, while inclining with respect to the tire axial direction oppositely to the first oblique portion; and in a plan view of the tread portion, when virtual extension zones are defined by extending circumferential extents of the respective second middle lateral grooves to the first tread edge in parallel with the tire axial direction, the virtual extension zones respectively overlap with openings of the first middle lateral grooves such that an overlapping area between each of the virtual extension zones and one of the openings is not more than 50% of the area of the said one of the openings.", "which has an intended mounting direction on a vehicle in which the first tread edge is located outboard of the vehicle when the tire is mounted on the vehicle.", "angles of the first middle lateral grooves with respect to the tire axial direction are not less than 20 degrees but not more than 40 degrees.", "angles of the first middle lateral grooves with respect to the tire axial direction are not less than 20 degrees but not more than 40 degrees.", "the first oblique portion is inclined with respect to the tire axial direction to a second direction opposite to the first direction toward the second longitudinal edge from the first longitudinal edge of the second middle land portion.", "the first oblique portion is inclined with respect to the tire axial direction to a second direction opposite to the first direction toward the second longitudinal edge from the first longitudinal edge of the second middle land portion.", "the first oblique portion is inclined with respect to the tire axial direction to a second direction opposite to the first direction toward the second longitudinal edge from the first longitudinal edge of the second middle land portion.", "the length in the tire axial direction of the first oblique portion is not less than 40%, but not more than 60% of the maximum width of the ground contacting top surface of the second middle land portion.", "an angle of the first oblique portion with respect to the tire axial direction is not less than 5 degrees but not more than 25 degrees.", "an angle of the second oblique portion with respect to the tire axial direction is not less than 5 degrees but not more than 25 degrees.", "the angle between the first oblique portion and the second oblique portion is not less than 105 degrees but not more than 135 degrees.", "the first middle lateral groove comprises a first portion provided with a sipe in the groove bottom, and a second portion provided with no sipe in the groove bottom.", "the first middle land portion is provided with the first middle lateral grooves in which the first portion is positioned closer to the first tread edge than the second portion, and the first middle lateral grooves in which the second portion is positioned closer to the first tread edge than the first portion.", "in each of the second middle lateral grooves, one of the first oblique portion and the second oblique portion is provided with a sipe in the groove bottom, and the other of the first oblique portion and the second oblique portion is provided with no sipe in the groove bottom.", "the second middle land portion is provided with the second middle lateral grooves in which the first oblique portion is provided with said sipe in the groove bottom, and the second middle lateral groove in which the second oblique portion is provided with said sipe in the groove bottom.", "circumferential extents of the second middle lateral grooves overlap in the tire circumferential direction with circumferential extents of the first middle lateral grooves, respectively."], "bibtex": "@patent{20250001806,\n    title = {TIRE},\n    number = {20250001806},\n    year = {2025},\n    note = {File: US20250001806A1-20250102.XML}\n    }", "classification": "B60C1103FI"}, {"title": "TIRE WITH BI-DIRECTIONAL PERFORMANCE", "doc_number": "20250001807", "filename": "US20250001807A1-20250102.XML", "abstract": "A method of mounting a tire on a vehicle includes providing a tire having a first side, a second side, and a circumferential tread disposed about the tire. The first side defines a first forward rotation direction and the second side defines a second forward rotation direction. The circumferential tread includes a plurality of tread elements, and at least one of the plurality of tread elements includes a sipe arrangement including a plurality of sipes that are angled in a depth direction of the tire. The plurality of sipes are disposed on a first half of the tread element and no sipes are disposed on a second half of the tread element. The sipe arrangement causes the tire to exhibit a first tire performance when the tire is mounted on the vehicle in the first orientation and rotated in the first forward rotation direction, and further causes the tire to exhibit a second tire performance when the tire is mounted on the vehicle in the second orientation and rotated in the second forward rotation direction. The method includes mounting the tire on the vehicle in the first orientation for driving the vehicle in a first set of conditions, and mounting the tire on the vehicle in the second orientation for driving the vehicle in a second set of conditions.", "detailed_description": ["The following includes definitions of selected terms employed herein. The definitions include various examples or forms of components that fall within the scope of a term and that may be used for implementation. The examples are not intended to be limiting. Both singular and plural forms of terms may be within the definitions.", "", "“Axial” or “axially” refer to a direction that is parallel to the axis of rotation of a tire.", "", "“Bead” refers to the part of the tire that contacts the wheel and defines a boundary of the sidewall.", "", "“Carcass ply” refers to a structural member that connects the bead to a tread, and may be continuous or discrete.", "", "“Circumferential” and “circumferentially” refer to a direction extending along the perimeter of the surface of the tread perpendicular to the axial direction.", "", "“Equatorial plane” refers to the plane that is perpendicular to the tire's axis of rotation and passes through the center of the tire.", "", "“Radial” and “radially” refer to a direction perpendicular to the axis of rotation of a tire.", "", "“Sidewall” refers to that portion of the tire between the tread and the bead.", "", "“Tread” refers to that portion of the tire that comes into contact with the road under normal inflation and load.", "", "Directions are stated in this disclosure with reference to a top view of a vehicle, with respect to a longitudinal axis of the vehicle. The terms “inward” and “inwardly” refer to a general direction towards the longitudinal axis of the vehicle, whereas “outward” and “outwardly” refer to a general direction away from the longitudinal axis of the vehicle. Thus, when relative directional terms such as “inner” and “outer” are used in connection with an element, the “inner” element is spaced closer to the longitudinal axis of the vehicle than the “outer” element. Similarly, the terms “left” and “right” are stated in reference to a top view of the vehicle on which tires are mounted, with respect to a longitudinal axis of the vehicle. The terms “front” and “rear” are also stated in reference to a vehicle on which tires are mounted.", "", "FIGS.2and3show a perspective view and side view, respectively, of a schematic drawing of one embodiment of a tire100having an axle specific rolling direction.FIG.4shows a multi-perspective view of the tire100in a first orientation110aand a second orientation110b.The tire100is described in reference to all of these figures.", "", "The tire100includes a first and second bead portion (not shown), a first sidewall120a,and a second sidewall120b.The tire100has two rotation directions. When the tire is viewed from the second sidewall120b(as shown inFIG.3), the first rotation direction of the tire100is in the clockwise direction and the second rotation direction of the tire100is in the counterclockwise direction.", "", "The tire100further includes at least one carcass ply (not shown) extending from the first bead portion to the second bead portion, a circumferential belt disposed above the carcass ply (not shown), and a circumferential tread130disposed above the belt. The circumferential tread130has a tread pattern shown schematically at140. In one embodiment, the tread pattern140has discrete rotational asymmetry of the second order, which causes the tire100to be directional. Therefore, when the tire100is in the first orientation110a,the tread pattern140has a first appearance, and when the tire100is placed in the second orientation110b,the reversed tread pattern140has a second appearance different from the first appearance.", "", "The asymmetry of the tread pattern may cause the tread to exhibit different properties when the tire100is rotated in the first direction versus the second direction. The tread pattern and the position and orientation of the carcass ply may be selected such that desirable properties for a front tire are exhibited when the tire100is rotated in the first direction, and desirable properties for a rear tire are exhibited when the tire100is rotated in the second direction.", "", "For example, the tread pattern may be selected such that when the tire is rotated in the first rotation direction, the circumferential tread exhibits a first braking performance and a first driving traction performance, and when the tire is rotated in the second direction, the circumferential tread exhibits a second braking performance that is lower than the first braking performance and a second driving traction performance that is higher than the first driving traction performance. In rear wheel drive vehicles, it may be more advantageous for the rear tires to exhibit higher driving traction performance. In front wheel drive vehicles, it may be more advantageous for the front tires to exhibit higher driving traction performance.", "", "In another example, the tread pattern may be selected such that the circumferential tread exhibits a first wear performance when rotated in the first direction, and a second wear performance different from the first wear performance when rotated in the second direction. For example, in front wheel drive vehicles, front tires tend to wear faster. In rear wheel drive tires, rear tires tend to wear faster. The tread pattern may be selected to reduce the discrepancy between the wear rates of front and rear tires.", "", "In yet another example, the tread pattern may be selected such that the circumferential tread exhibits a first snow traction performance when rotated in the first direction, and a second snow traction performance that is different from the first snow traction performance when rotated in the second direction. The tread pattern may also be selected such that other properties are affected by a change in rotation direction.", "", "Additionally, or in the alternative, the position and orientation of the carcass ply may be selected such that the carcass ply causes the tire to exhibit different properties according to the rotation direction. Such differences in carcass plies may not be readily observable from the exterior of the tire, but the tire would still exhibit asymmetric properties.", "", "In one embodiment, the first rotation direction may be indicated as a Front Rotation Direction, and the second rotation direction may be indicated as a Rear Rotation Direction on one or more locations on the tire. As can be seen in the illustrated embodiment, a first indicia150ais disposed on the first sidewall120aand a second indicia150bis disposed on the second sidewall120bof the tire100. Both the first indicia150aand the second indicia150binclude an indicator designating the first rotation direction as a front tire rotation direction and the second rotation direction as a rear tire rotation direction. While the illustrated embodiment shows arrows with a written description, it should be understood that the indicia may take any form or size.", "", "Such indicia may be used to aid a person in mounting axle specific tires on a vehicle. As shown inFIG.5, the properties of the tire100may be selected so that four tires having substantially the same sidewalls, carcass plies, and circumferential tread may be mounted on a vehicle200in such a way that first and second tires1001,1002on a front axle210exhibit different properties than third and fourth tires1003,1004mounted on a rear axle220.", "", "In the illustrated embodiment, the first tire1001is mounted on a first wheel (not shown), the second tire1002is mounted on a second wheel (not shown), the third tire1003is mounted on a third wheel (not shown), and the fourth tire1004is mounted on a fourth wheel (not shown). The first wheel and tire are mounted on a left end of the front axle210of a vehicle200, such that a first sidewall120a1of the first tire1001faces outwards, (i.e., away from the vehicle200), and a second sidewall120b1of the first tire1001faces inwards (i.e., towards the vehicle200). The second wheel and tire are mounted on a right end of the front axle210of the vehicle200, such that a first sidewall120a2of the second tire1002faces inwards, and a second sidewall120b2of the second tire1002faces outwards. The third wheel and tire are mounted on a left end of the rear axle220of the vehicle200, such that a first sidewall120a3of the third tire1003faces inwards, and a second sidewall120b3of the third tire1003faces outwards. The fourth wheel and tire are mounted on a right end of the rear axle220of the vehicle200, such that a first sidewall120a4of the fourth tire1004faces outwards, and a second sidewall120b4of the fourth tire1004faces inwards.", "", "It should be understood that the tires may be mounted on the vehicle in any order, and that certain steps described above may be performed concurrently or in a different order.", "", "When servicing the vehicle, the tires may be rotated in the manner illustrated inFIG.6, without having to dismount the tires from the wheels. The first wheel and tire are removed from the front axle210of the vehicle200and the fourth wheel and tire are removed from the rear axle220of the vehicle200. The first wheel and tire are mounted on the right end of the rear axle220of the vehicle200, such that the first sidewall120a1of the first tire1001faces outwards, and the second sidewall120b1of the first tire1001faces inwards. The fourth wheel and tire are mounted on the left end of the front axle210of the vehicle200, such that a first sidewall120a4of the fourth tire1004faces outwards, and a second sidewall120b4of the fourth tire1004faces inwards.", "", "The second wheel and tire are removed from the front axle210of the vehicle200and the third wheel and tire are removed from the rear axle220of the vehicle200. The second wheel and tire are mounted on the left end of the rear axle220of the vehicle200, such that a first sidewall120a2of the second tire1002faces inwards, and a second sidewall120b2of the second tire1002faces outwards. The third wheel and tire are mounted on the right end of the front axle210of the vehicle200, such that a first sidewall120a3of the third tire1003faces inwards, and a second sidewall120b3of the third tire1003faces outwards.", "", "It should be understood that the steps of rotating tires may be performed in any order and that certain steps described above may be performed concurrently or in a different order. Additionally, it should also be understood that the tires may be dismounted from the wheels such that they may be remounted in any position.", "", "WhileFIGS.2-6illustrate bidirectional tires that exhibit desirable front tire characteristics when rotated in a first direction, and desirable rear tire characteristics when rotated in a second direction, bidirectional tires may also be designed to exhibit desirable summer performance characteristics when rotated in a first direction, and desirable winter performance characteristics when rotated in a second direction.FIGS.7and8show a perspective view and side view, respectively, of a schematic drawing of one embodiment of a tire300having a season specific rolling direction.FIG.9shows a multi-perspective view of the tire300in a first orientation310aand a second orientation310b.The tire300is described in reference to all of these figures.", "", "The tire300includes a first and second bead portion (not shown), a first sidewall320a,and a second sidewall320b.The tire300has two rotation directions. When the tire is viewed from the second sidewall320b(as shown inFIG.8), the first rotation direction of the tire300is in the clockwise direction and the second rotation direction of the tire300is in the counterclockwise direction.", "", "The tire300further includes at least one carcass ply (not shown) extending from the first bead portion to the second bead portion, a circumferential belt disposed above the carcass ply (not shown), and a circumferential tread330disposed above the belt. The circumferential tread330has a tread pattern shown schematically at340. In one embodiment, the tread pattern340has discrete rotational asymmetry of the second order, which causes the tire300to be directional. Therefore, when the tire300is in the first orientation310a,the tread pattern340has a first appearance, and when the tire300is placed in the second orientation310b,the reversed tread pattern340has a second appearance different from the first appearance.", "", "The asymmetry of the tread pattern may cause the tread to exhibit different properties when the tire300is rotated in the first direction versus the second direction. The tread pattern and the position and orientation of the carcass ply may be selected such that desirable properties for summer performance are exhibited when the tire300is rotated in the first direction, and desirable properties for winter performance are exhibited when the tire300is rotated in the second direction.", "", "For example, the tread pattern may be selected such that the circumferential tread exhibits a first snow traction performance when rotated in the first direction, and a second snow traction performance that is different from the first snow traction performance when rotated in the second direction. The tread pattern may also be selected such that other properties are affected by a change in rotation direction.", "", "In another example, the tread pattern may be selected such that when the tire is rotated in the first rotation direction, the circumferential tread exhibits a first stopping distance performance, and when the tire is rotated in the second direction, the circumferential tread exhibits a second stopping distance performance that is lower than the first stopping performance. Stopping distance performance may be more important in summer, when vehicles tend to be driven at higher speeds.", "", "In yet another example, the tread pattern may be selected such that the circumferential tread exhibits a first wear performance when rotated in the first direction, and a second wear performance different from the first wear performance when rotated in the second direction. For example, tires tend to wear slower in the winter when they are driven over snow. The tread pattern may be selected to reduce the discrepancy between the wear rates in summer and winter.", "", "In still another example, the tread pattern may be selected such that the circumferential tread exhibits a first noise performance when rotated in the first direction, and a second noise performance different from the first noise performance when rotated in the second direction. For example, tires tend to be quieter in the winter when they are driven over snow. The tread pattern may be selected to reduce the discrepancy between the tire noise in summer and winter.", "", "Additionally, or in the alternative, the position and orientation of the carcass ply may be selected such that the carcass ply causes the tire to exhibit different properties according to the rotation direction. Such differences in carcass plies may not be readily observable from the exterior of the tire, but the tire would still exhibit asymmetric properties.", "", "In one embodiment, the first rotation direction may be indicated as a Summer Rotation Direction, and the second rotation direction may be indicated as a Winter Rotation Direction on one or more locations on the tire. As can be seen in the illustrated embodiment, a first indicia350ais disposed on the first sidewall320aand a second indicia350bis disposed on the second sidewall320bof the tire300. Both the first indicia350aand the second indicia350binclude an indicator designating the first rotation direction as a summer rotation direction and the second rotation direction as a winter rotation direction. While the illustrated embodiment shows arrows with a written description, it should be understood that the indicia may take any form or size.", "", "Such indicia may be used to aid a person in mounting season specific tires on a vehicle. As shown inFIG.10, the properties of the tire300may be selected so that four tires having substantially the same sidewalls, carcass plies, and circumferential tread may be mounted on a vehicle400in such a way that all tires3001,3002,3003,3004exhibit desirable summer performance characteristics.", "", "In the illustrated embodiment, the first tire3001is mounted on a first wheel (not shown), the second tire3002is mounted on a second wheel (not shown), the third tire3003is mounted on a third wheel (not shown), and the fourth tire3004is mounted on a fourth wheel (not shown). The first wheel and tire are mounted on a left end of the front axle410of a vehicle400, such that a first sidewall320a1of the first tire3001faces outwards, (i.e., away from of the vehicle400), and a second sidewall320b1of the first tire3001faces inwards (i.e., towards the vehicle400). The second wheel and tire are mounted on a right end of the front axle410of the vehicle400, such that a first sidewall320a2of the second tire3002faces inwards, and a second sidewall320b2of the second tire3002faces outwards. The third wheel and tire are mounted on a left end of the rear axle420of the vehicle400, such that a first sidewall320a3of the third tire3003faces outwards, and a second sidewall320b3of the third tire3003faces inwards. The fourth wheel and tire are mounted on a right end of the rear axle420of the vehicle400, such that a first sidewall320a4of the fourth tire3004faces inwards, and a second sidewall320b4of the fourth tire1004faces outwards.", "", "It should be understood that the tires may be mounted on the vehicle in any order, and that certain steps described above may be performed concurrently or in a different order.", "", "To change direction of the tires when the season changes, the tires may be rotated in the manner illustrated inFIG.11, without having to dismount the tires from the wheels. The first wheel and tire are removed from the front axle410of the vehicle400and the fourth wheel and tire are removed from the rear axle420of the vehicle400. The first wheel and tire are mounted on the right end of the rear axle420of the vehicle400, such that the first sidewall320a1of the first tire3001faces outwards, and the second sidewall320b1of the first tire3001faces inwards. The fourth wheel and tire are mounted on the left end of the front axle410of the vehicle400, such that a first sidewall320a4of the fourth tire3004faces inwards, and a second sidewall320b4of the fourth tire1004faces outwards.", "", "The second wheel and tire are removed from the front axle410of the vehicle400and the third wheel and tire are removed from the rear axle420of the vehicle400. The second wheel and tire are mounted on the left end of the rear axle420of the vehicle400, such that a first sidewall320a2of the second tire3002faces inwards, and a second sidewall320b2of the second tire3002faces outwards. The third wheel and tire are mounted on the right end of the front axle410of the vehicle400, such that a first sidewall320a3of the third tire3003faces outwards, and a second sidewall320b3of the third tire3003faces inwards.", "", "It should be understood that the steps of rotating tires may be performed in any order and that certain steps described above may be performed concurrently or in a different order. Additionally, it should also be understood that the tires may be dismounted from the wheels such that they may be remounted in any position.", "", "FIG.12shows a multi-perspective view of another embodiment of a tire500in a first orientation510aand a second orientation510b.The tire500includes a first and second bead portion (not shown), a first sidewall520a,and a second sidewall520b.The first and second sidewall520a,bdefine a first mounting position and a second mounting position of the tire, in that the first sidewall520afaces outwards in the first mounting position, and the second sidewall faces520bfaces outwards in the second mounting position.", "", "The tire500further includes at least one carcass ply (not shown) extending from the first bead portion to the second bead portion, a circumferential belt disposed above the carcass ply (not shown), and a circumferential tread530disposed above the belt. The circumferential tread530has a tread pattern shown schematically at540. The tread pattern540is asymmetric about the equatorial plane of the tire500. Therefore, when the tire500is in the first orientation shown inFIG.4, the tread pattern540has a first appearance, and when the tire500is rotated to the second orientation shown inFIG.7, the reversed tread pattern540has a second appearance different from the first appearance.", "", "The asymmetry of the tread pattern may cause the tread to exhibit different properties when the tire100is mounted in the first mounting position versus the second mounting position. For example, the tread pattern may be selected to account for first wear characteristics when a tire is mounted in the first position, and to account for second wear characteristics different from the first wear characteristics when the tire is mounted in the second position. As one of ordinary skill in the art would understand, the front and rear tires may have different cambers. Additionally, the weight of the vehicle may be distributed different on the front and rear axles. These differences may cause the front tires to have different footprints from the rear tires. The tread patterns in the first and second mounting positions of the tires may be selected to account for these different footprints.", "", "In another example, the tread pattern may be selected such that the circumferential tread exhibits a first snow traction performance when mounted in the first position, and a second snow traction performance different from the first snow traction performance when mounted in the second position.", "", "The tread pattern may also be selected such that other properties are affected by a change in mounting position. For example, the front and rear tires of a vehicle may experience different lateral forces. The tread pattern may be selected to effectively manage these different lateral forces.", "", "Additionally, or in the alternative, the position and orientation of the carcass ply may be selected such that the carcass ply causes the tire to exhibit different properties according to the mounting position. Such differences in carcass plies may not be readily observable from the exterior of the tire, but the tire would still exhibit asymmetric properties.", "", "The tread pattern and the position and orientation of the carcass ply may be designed to account for the different forces that are exhibited on the front and rear tires. Such different forces may cause the front and rear tires to wear differently.", "", "In such an embodiment, the first mounting direction may be indicated as a Front Mounting Position, and the second rotation direction may be indicated as a Rear Mounting Position on one or more locations on the tire. As can be seen in the illustrated embodiment, a first indicia550ais disposed on the first sidewall520aand a second indicia550bis disposed on the second sidewall520bof the tire500. While the illustrated embodiment shows indicia that includes a written description, it should be understood that the indicia may take any form or size.", "", "Such indicia may be used to aid a person in mounting axle specific tires on a vehicle. As shown inFIG.8, the properties of the tire500may be selected so that four tires having substantially the same sidewalls, carcass plies, and circumferential tread may be mounted on a vehicle600in such a way that first and second tires5001,5002on a front axle610exhibit different properties than third and fourth tires5003,5004mounted on a rear axle620.", "", "In the illustrated embodiment, the first tire5001is mounted on a first wheel (not shown), the second tire5002is mounted on a second wheel (not shown), the third tire5003is mounted on a third wheel (not shown), and the fourth tire5004is mounted on a fourth wheel (not shown). The first wheel and tire are mounted on a left end of the front axle610of a vehicle600, such that a first sidewall520a1of the first tire5001faces outwards, and a second sidewall520b1of the first tire5001faces inwards. The second wheel and tire are mounted on a right end of the front axle610of the vehicle600, such that a first sidewall520a2of the second tire5002faces outwards, and a second sidewall520b2of the second tire5002faces inwards. The third wheel and tire are mounted on a left end of the rear axle620of the vehicle600, such that a first sidewall520a3of the third tire5003faces inwards, and a second sidewall520b3of the third tire5003faces outwards. The fourth wheel and tire are mounted on a right end of the rear axle620of the vehicle600, such that a first sidewall520a4of the fourth tire5004faces inwards, and a second sidewall520b4of the fourth tire5004faces outwards.", "", "It should be understood that the tires may be mounted on the vehicle in any order, and that certain steps described above may be performed concurrently or in a different order.", "", "When servicing the vehicle, the tires may be rotated in the manner illustrated inFIG.9, without having to dismount the tires from the wheels. The first wheel and tire, and second wheel and tire are removed from the front axle610of the vehicle600. The first wheel and tire are mounted on the right end of the front axle620of the vehicle600, such that the first sidewall520a1of the first tire5001faces outwards, and the second sidewall520b1of the first tire5001faces inwards. The second wheel and tire are mounted on the left end of the front axle610of the vehicle600, such that a first sidewall520a2of the second tire5002faces outwards, and a second sidewall520b2of the second tire5002faces inwards.", "", "The third wheel and tire, and fourth wheel and tire are removed from the rear axle620of the vehicle600. The third wheel and tire are mounted on the right end of the rear axle620of the vehicle600, such that a first sidewall520a3of the third tire5003faces inwards, and a second sidewall520b3of the third tire5003faces outwards. The fourth wheel and tire are mounted on the left end of the rear axle620of the vehicle600, such that a first sidewall520a4of the fourth tire5004faces inwards, and a second sidewall520b4of the fourth tire5004faces outwards.", "", "It should be understood that the steps of rotating tires may be performed in any order and that certain steps described above may be performed concurrently or in a different order. Additionally, it should also be understood that the tires may be dismounted from the wheels such that they may be remounted in any position.", "", "In each of the embodiments described above, and illustrated inFIGS.2-14, directional tread elements may be selected for the tire that display first characteristics when rotated in a first direction, and second characteristics different from the first characteristics when rotated in a second direction opposite the first direction.FIGS.15-19illustrate examples of tread elements that exhibit different characteristics in different rolling directions. While each of these figures illustrate a single feature, it should be understood that tread elements may employ two or more of the illustrated features. For the sake of brevity the various combinations of features are not shown herein.", "", "FIG.15is a profile view of one embodiment of a tread element700that exhibits first characteristics in a first rolling direction D1and second characteristics in a second rolling direction D2. The tread element700includes a first wall710and a second wall720. The first wall710is disposed at a first angle α1with respect to the base730of a groove in the tire. The second wall720is disposed at a second angle α2with respect to the base730of a groove in the tire that is greater than the first angle α1. When the tire is rotated in the first direction D1, the top of the tread element700and the first wall710form a leading edge (i.e., the edge that first comes into contact with the rolling surface). When the tire is rotated in the second direction D2, the top of the tread element700and the second wall720form a leading edge. The shallower angle α1of the first wall710causes lower edge pressure on the tread element700when the tire is rotated in the first direction D1, compared to when the tire is rotated in the second direction D2. This effect is utilized to achieve directional performance of the lug related to traction, wear, noise and other tire performance characteristics.", "", "FIG.16is a profile view of another embodiment of a tread element800that exhibits first characteristics in a first rolling direction D1and second characteristics in a second rolling direction D2. The tread element800includes a first wall810and a second wall820. The tread element800includes a plurality of sipes830adjacent the second wall, and no sipes adjacent the first wall. In an alternative embodiment (not shown), the tread element may have sipes adjacent both wall, but a greater number of sipes adjacent the second wall.", "", "When the tire is rotated in the first direction D1, the top of the tread element800and the first wall810form a leading edge. When the tire is rotated in the second direction D2, the top of the tread element800and the second wall820form a leading edge, and the sipes830provide additional edges adjacent the leading edge. This effect is utilized to achieve directional performance of the lug related to traction, wear, noise and other tire performance characteristics.", "", "FIG.17is a profile view of yet another embodiment of a tread element900that exhibits first characteristics in a first rolling direction D1and second characteristics in a second rolling direction D2. The tread element900includes a first wall910and a second wall920. The tread element900includes a plurality of angled sipes930. When the tire is rotated in the first direction D1, the rolling surface provides a shear force on the top of the tread element900that causes the angled sipes930to open and provide additional edges. When the tire is rotated in the second direction D2, the rolling surface provides a shear force on the top of the tread element900that causes the angled sipes930to close, thereby eliminating the additional edges. This effect is utilized to achieve directional performance of the lug related to traction, wear, noise and other tire performance characteristics.", "", "FIG.18is a profile view of still another embodiment of a tread element1000that exhibits first characteristics in a first rolling direction D1and second characteristics in a second rolling direction D2. The tread element1000includes a first wall1010and a second wall1020. The tread element1000includes a plurality of ratchet-shaped sipes1030, that may be referred to as three-dimensional (or 3D) sipes1030. When the tire is rotated in the first direction D1, the rolling surface provides a shear force on the top of the tread element1000that causes the ratchet-shaped sipes1030to open and provide additional edges. When the tire is rotated in the second direction D2, the rolling surface provides a shear force on the top of the tread element1000that causes the ratchet-shaped sipes1030to close, thereby eliminating the additional edges. This effect is utilized to achieve directional performance of the lug related to traction, wear, noise and other tire performance characteristics.", "", "FIG.19is a profile view of still another embodiment of a tread element1100that exhibits first characteristics in a first rolling direction D1and second characteristics in a second rolling direction D2. The tread element1100includes a first wall1110and a second wall1120. The tread element1100includes an edge treatment. In this embodiment, the edge treatment is a rounded chamfer1130extending from the second wall1120to a top surface of the tread element1100. When the tire is rotated in the first direction D1, the top of the tread element1100and the first wall1110form a leading edge. When the tire is rotated in the second direction D2, the top of the tread element1100and the second wall1120form a leading edge. The rounded chamfer1130extending from the second wall1120causes lower edge pressure on the tread element1100when the tire is rotated in the second direction D2, compared to when the tire is rotated in the first direction D1. It should be understood that other edge treatments may also be employed, such as planar chamfers.", "", "It should be understood that the tread element1100may be a lug, bounded by a pair of grooves. Alternatively, the tread element1100may represent a portion of a lug, bounded by a pair of sipes.", "", "In the illustrated embodiment, the rounded chamfer1130has a length that is substantially greater than its height. In one particular embodiment, the length is four times greater than the height. In another known embodiment, the length is two times greater than the height. In an alternative embodiment (not shown), the height is greater than or equal to the length.", "", "FIG.20is a profile view of still another embodiment of a tread element1200that exhibits first characteristics in a first rolling direction D1and second characteristics in a second rolling direction D2. The tread element1200shows that multiple features may be encompassed in a single tread element. In the illustrated embodiment, the tread element1200includes a first wall1210, and an edge treatment such as a rounded chamfer1130extending from the second wall1220to a top surface of the tread element1200. The tread element further includes ratchet shaped sipes1240that are disposed at an angle and proximal to the first wall1210. However, it should be understood that any combination of the above embodiments may be included in a single tread element.", "", "To the extent that the term “includes” or “including” is used in the specification or the claims, it is intended to be inclusive in a manner similar to the term “comprising” as that term is interpreted when employed as a transitional word in a claim. Furthermore, to the extent that the term “or” is employed (e.g., A or B) it is intended to mean “A or B or both.” When the applicants intend to indicate “only A or B but not both” then the term “only A or B but not both” will be employed. Thus, use of the term “or” herein is the inclusive, and not the exclusive use. See, Bryan A. Garner, A Dictionary of Modern Legal Usage 624 (2d. Ed. 1995). Also, to the extent that the terms “in” or “into” are used in the specification or the claims, it is intended to additionally mean “on” or “onto.” Furthermore, to the extent the term “connect” is used in the specification or claims, it is intended to mean not only “directly connected to,” but also “indirectly connected to” such as connected through another component or components.", "", "While the present disclosure has been illustrated by the description of embodiments thereof, and while the embodiments have been described in considerable detail, it is not the intention of the applicants to restrict or in any way limit the scope of the appended claims to such detail. Additional advantages and modifications will readily appear to those skilled in the art. Therefore, the disclosure, in its broader aspects, is not limited to the specific details, the representative apparatus and method, and illustrative examples shown and described. Accordingly, departures may be made from such details without departing from the spirit or scope of the applicant's general inventive concept."], "claims": ["providing four tires, including a first tire, a second tire, a third tire, and a fourth tire, wherein each of the four tires has a first side, a second side, and a circumferential tread disposed about the tire, wherein the first side of each of the four tires is substantially the same, wherein the second side of each of the four tires is substantially the same, wherein the circumferential tread of each of the four tires is substantially the same, and wherein the circumferential tread of each of the four tires has a plurality of tread elements, each of the plurality of tread elements having a rolling surface and edges, with each of the tread elements having a sipe arrangement including a plurality of sipes that are angled in a depth direction of the tire, wherein the plurality of sipes are disposed on a first half of the tread element and no sipes are disposed on a second half of the tread element, wherein the sipe arrangement causes the tire to exhibit a first tire performance when the tire is mounted on a vehicle in a first orientation and rotated in a first forward rotation direction, and a second tire performance that is different from the first tire performance when the tire is mounted on the vehicle in a second orientation and rotated in a second forward rotation direction, the tire performance being selected from the group consisting of braking, dry driving traction, noise, wear performance, and snow traction performance; mounting the first tire on a first wheel; mounting the second tire on a second wheel; mounting the third tire on a third wheel; mounting the fourth tire on a fourth wheel; mounting the first wheel on a left end of a front axle of the vehicle in the first orientation, such that the first side of the first tire faces away from the vehicle; mounting the second wheel on a right end of the front axle of the vehicle in the first orientation, such that the first side of the second tire faces away from the vehicle; mounting the third wheel on a left end of a rear axle of the vehicle in the first orientation, such that the second side of the third tire faces away from the vehicle; and mounting the fourth wheel on a right end of the rear axle of the vehicle in the first orientation, such that the second side of the fourth tire faces away from the vehicle.", "2 . The method of claim 1 , wherein each of the four tires includes a first indicia disposed on the first side and a second indicia disposed on the second side, the first indicia including an indicator designating the first side, and the second indicia including an indicator designating the second side.", "removing the first wheel and first tire from the front axle of the vehicle; removing the second wheel and second tire from the front axle of the vehicle; removing the third wheel and third tire from the rear axle of the vehicle; removing the fourth wheel and fourth tire from the rear axle of the vehicle; mounting the first wheel and first tire on the right end of the front axle of the vehicle in the second orientation, such that the first side of the first tire faces away from the vehicle; and mounting the second wheel and second tire on the left end of the front axle of the vehicle in the second orientation, such that the first side of the second tire faces away from the vehicle; mounting the third wheel and third tire on the right end of the rear axle of the vehicle in the second orientation, such that the second side of the third tire faces away from the vehicle; and mounting the fourth wheel and fourth tire on the left end of the rear axle of the vehicle in the second orientation, such that the first side of the fourth tire faces away from the vehicle.", "4 . The method of claim 1 , wherein each of the plurality of sipes has an opening that extends linearly in an axial direction.", "5 . The method of claim 1 , wherein at least one of the plurality of sipes has ratchet shape in a depth direction of the tire.", "6 . The method of claim 1 , wherein at least one of the plurality of tread elements has a rounded chamfer at one end.", "providing four tires, including a first tire, a second tire, a third tire, and a fourth tire, wherein each of the four tires has a first side, a second side, and a circumferential tread disposed about the tire and having a plurality of tread elements, wherein each of the plurality of tread elements has a sipe arrangement including a plurality of sipes that are angled in a depth direction of the tire, wherein the plurality of sipes are disposed on a first half of the tread element and no sipes are disposed on a second half of the tread element, wherein the sipe arrangement causes the tire to exhibit a first tire performance when the tire is mounted on a vehicle in a first orientation and rotated in a first forward rotation direction, and a second tire performance that is different from the first tire performance when the tire is mounted on the vehicle in a second orientation and rotated in a second forward rotation direction, wherein the first side of each of the four tires is substantially the same, wherein the second side of each of the four tires is substantially the same, and wherein the circumferential tread of each of the four tires is substantially the same; mounting the first tire on a first wheel; mounting the second tire on a second wheel; mounting the third tire on a third wheel; mounting the fourth tire on a fourth wheel; mounting the first wheel on a left end of a front axle of the vehicle, such that the first side of the first tire faces away from the vehicle and such that the first tire is in the first orientation; mounting the second wheel on a right end of the front axle of the vehicle, such that the second side of the second tire faces away from the vehicle and such that the second tire is in the first orientation; mounting the third wheel on a left end of a rear axle of the vehicle, such that the first side of the third tire faces away from the vehicle and such that the third tire is in the first orientation; mounting the fourth wheel on a right end of the rear axle of the vehicle, such that the second side of the fourth tire faces away from the vehicle and such that the fourth tire is in the first orientation; removing the first wheel and first tire from the front axle of the vehicle; removing the second wheel and second tire from the front axle of the vehicle; removing the third wheel and third tire from the rear axle of the vehicle; removing the fourth wheel and fourth tire from the rear axle of the vehicle; mounting the first wheel and first tire on the right end of the rear axle of the vehicle, such that the first side of the first tire faces away from the vehicle and such that the first tire is in the second orientation; mounting the second wheel and second tire on the left end of the rear axle of the vehicle, such that the second side of the second tire faces away from the vehicle and such that the second tire is in the second orientation; mounting the third wheel and third tire on the right end of the front axle of the vehicle, such that the first side of the third tire faces away from the vehicle and such that the third tire is in the second orientation; and mounting the fourth wheel and fourth tire on the left end of the front axle of the vehicle, such that the second side of the fourth tire faces away from the vehicle and such that the fourth tire is in the second orientation.", "8 . The method of claim 7 , wherein each of the four tires includes at least one indicia disposed on each side including an indicator designating the first forward rotation direction and the second forward rotation direction.", "9 . The method of claim 8 , wherein the at least one indicia identifies the first forward rotation direction as a summer rotation direction and identifies the second forward rotation direction as a winter rotation direction.", "10 . The method of claim 7 , wherein the plurality of sipes are a plurality of 3D sipes.", "11 . The method of claim 7 , wherein each tread element has a first wall disposed at a first obtuse angle with respect to a base of a groove in the tire.", "12 . The method of claim 11 , wherein each tread element has a second wall disposed at a second obtuse angle with respect to a base of a groove in the tire, the second obtuse angle being different than the first obtuse angle.", "13 . The method of claim 7 , wherein each tread element has a rounded chamfer at a first end and an edge at a second end.", "providing a tire having a first side, a second side, and a circumferential tread disposed about the tire, wherein the first side defines a first forward rotation direction that is a rotation of the tire in a counterclockwise direction when the tire is mounted on a vehicle in a first orientation and viewed from the first side, wherein the second side defines a second forward rotation direction of the tire that is a rotation of the tire in the counterclockwise direction when the tire is mounted on the vehicle in a second orientation opposite the first orientation and viewed from the first side, wherein the circumferential tread includes a plurality of tread elements, wherein at least one of the plurality of tread elements includes a sipe arrangement including a plurality of sipes that are angled in a depth direction of the tire, wherein the plurality of sipes are disposed on a first half of the tread element and no sipes are disposed on a second half of the tread element, wherein the sipe arrangement causes the tire to exhibit a first tire performance when the tire is mounted on the vehicle in the first orientation and rotated in the first forward rotation direction, the tire performance being selected from the group consisting of braking, dry driving traction, noise, wear performance, and snow traction performance, and wherein the sipe arrangement causes the tire to exhibit a second tire performance that is different from the first tire performance when the tire is mounted on the vehicle in the second orientation and rotated in the second forward rotation direction; mounting the tire on the vehicle in the first orientation for driving the vehicle in a first set of conditions; and mounting the tire on the vehicle in the second orientation for driving the vehicle in a second set of conditions.", "15 . The method of claim 14 , wherein each tread element has a rounded chamfer at a first end and an edge at a second end.", "16 . The method of claim 14 , wherein each tread element has at least one wall disposed at an obtuse angle with respect to a base of a groove in the tire.", "17 . The method of claim 14 , wherein at least one of the plurality of sipes is a ratchet-shaped sipe.", "18 . The method of claim 14 , wherein the tire includes a first bead portion, a second bead portion, and at least one carcass ply extending from the first bead portion to the second bead portion.", "19 . The method of claim 14 , wherein the circumferential tread has a directional tread pattern.", "20 . The method of claim 14 , further comprising driving the vehicle in the first set of conditions and driving the vehicle in the second set of conditions."], "bibtex": "@patent{20250001807,\n    title = {TIRE WITH BI-DIRECTIONAL PERFORMANCE},\n    number = {20250001807},\n    year = {2025},\n    note = {File: US20250001807A1-20250102.XML}\n    }", "classification": "B60C1103FI"}, {"title": "PNEUMATIC RADIAL TIRE FOR PASSENGER VEHICLES", "doc_number": "20250001808", "filename": "US20250001808A1-20250102.XML", "abstract": "A pneumatic radial tire for passenger vehicles that satisfies a defined relationship between sectional width SW and outer diameter OD of the tire and includes one or more circumferential main grooves extending in a tire circumferential direction on a tread contact surface. A negative ratio of a half portion of the tire on a vehicle-mounted inward side, which is one side of the tire in a tread width direction with the tire equatorial plane as a boundary, is greater than a negative ratio of the other half portion of the tire on a vehicle-mounted outward side, which is the other side of the tire in the tread width direction with the equatorial plane as the boundary. A drop height (or ground contact length relationship, or tread gauge relationship) is also defined.", "detailed_description": ["Hereinafter, embodiments of the present disclosure are illustratively described in detail, with reference to the drawings.", "", "FIG.1is a schematic diagram illustrating sectional width SW and outer diameter OD of a tire.", "", "The pneumatic radial tire for passenger vehicles (hereinafter also referred to simply as “tire”) according to an embodiment of the present disclosure has a sectional width SW of less than 165 (mm), and a ratio SW/OD of the sectional width SW to the outer diameter OD of the tire is 0.26 or less, forming a narrow width and large diameter shape. By making the sectional width SW of the tire narrow, relative to the outer diameter OD of the tire, air resistance may be reduced, and by making the outer diameter OD of the tire large, relative to the sectional width SW of the tire, deformation of tread rubber in the vicinity of the contact patch of the tire may be controlled and rolling resistance may be reduced. Accordingly, fuel efficiency of the tire may be improved. The ratio SW/OD is preferably 0.25 or less, and more preferably 0.24 or less.", "", "The ratio above is preferably satisfied when the internal pressure of the tire is 200 kPa or greater, more preferably satisfied when the internal pressure of the tire is 220 kPa or greater, and even more preferably satisfied when the internal pressure of the tire is 280 kPa or greater. This allows rolling resistance to be reduced. On the other hand, the ratio above is preferably satisfied when the internal pressure of the tire is 350 kPa or less. This allows ride comfort to be improved.", "", "Here, the sectional width SW of the tire is preferably 105 mm to 145 mm, and more preferably 115 mm to 135 mm.", "", "Further, an aspect ratio of the tire when the sectional width SW and the outer diameter OD of the tire satisfy the ratio above is preferably 45 to 70, and more preferably 45 to 65.", "", "The tire is not particularly limited to a specific size. Example tire sizes include 105/50R16, 115/50R17, 125/55R20, 125/60R18, 125/65R19, 135/45R21, 135/55R20, 135/60R17, 135/60R18, 135/60R19, 135/65R19, 145/45R21, 145/55R20, 145/60R16, 145/60R17, 145/60R18, 145/60R19, 145/65R19, 155/45R18, 155/45R21, 155/55R18, 155/55R19, 155/55R21, 155/60R17, 155/65R18, 155/70R17, and 155/70R19.", "", "Alternatively, the sectional width SW of the tire is less than 165 mm, and the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the following relational equation:", "", "OD⁢(mm)≥-0.0187×SW⁡(mm)2+9.15×SW⁡(mm)-380", "", "That is, the tire has a narrow width and a large diameter.", "", "Satisfying the relational equation above reduces air resistance and reduces rolling resistance, thereby improving fuel efficiency of the tire.", "", "According to a third aspect, the sectional width SW and the outer diameter OD of the tire, in addition to satisfying the relational equation above, are such that the ratio SW/OD is preferably 0.26 or less, more preferably 0.25 or less, and even more preferably 0.24 or less. This allows fuel efficiency of the tire to be further improved.", "", "The relational equation and/or the ratio are preferably satisfied when the internal pressure of the tire is 200 kPa or greater, more preferably when the internal pressure of the tire is 220 kPa or greater, and even more preferably when the internal pressure of the tire is 280 kPa or greater. This allows rolling resistance to be reduced. On the other hand, the relational equation and/or the ratio are preferably satisfied when the internal pressure of the tire is 350 kPa or less. This allows ride comfort to be improved.", "", "Here, the sectional width SW of the tire is preferably 105 mm to 145 mm, and more preferably 115 mm to 135 mm.", "", "Further, the aspect ratio of the tire when the sectional width SW and the outer diameter OD of the tire satisfy the relational equation above is preferably 45 to 70, and more preferably 45 to 65.", "", "The tire is not particularly limited to a specific size. Example tire sizes include 105/50R16, 115/50R17, 125/55R20, 125/60R18, 125/65R19, 135/45R21, 135/55R20, 135/60R17, 135/60R18, 135/60R19, 135/65R19, 145/45R21, 145/55R20, 145/60R16, 145/60R17, 145/60R18, 145/60R19, 145/65R19, 155/45R18, 155/45R21, 155/55R18, 155/55R19, 155/55R21, 155/60R17, 155/65R18, 155/70R17, and 155/70R19.", "", "The tire according to the present embodiment is a pneumatic radial tire for passenger vehicles. This tire is particularly suitable for use as a tire mounted on a vehicle for personal mobility.", "", "FIG.2is a tire width direction cross-section diagram of the pneumatic radial tire for passenger vehicles according to an embodiment of the present disclosure.FIG.2illustrates a tire width direction cross-section under reference conditions, where the tire is mounted on a rim, filled to a prescribed internal pressure, and unloaded. As illustrated inFIG.2, the tire1includes a carcass3consisting of plies of radially arranged cords toroidally extending between a pair of bead portions2. Further, the tire1includes a belt4consisting of two belt layers4a,4bin the illustrated example, and a tread5, in this order, outward from the carcass3in the tire radial direction.", "", "In this example, a bead core2ais embedded in each of the pair of the bead portions2. According to the present disclosure, a cross-sectional shape and material of the bead core2aare not particularly limited, and may have a structure normally used in a pneumatic radial tire for passenger vehicles. According to the present disclosure, the bead core2amay be divided into a plurality of small bead cores. Alternatively, according to the present disclosure, the structure need not include the bead core2a.", "", "The tire1in the illustrated example includes a bead filler2bthat has an approximately triangular shape in cross-section, disposed outward from the bead core2ain the tire radial direction. The cross-sectional shape of the bead filler2bis not limited to this example, and the material of the bead filler2bis also not particularly limited. Alternatively, the tire may be made lighter by not including the bead filler2b.", "", "According to the present embodiment, the tire1may have a structure that includes a rim guard. Further, according to the present embodiment, the bead portion2may further include an additional member such as a rubber layer, a cord layer, or the like for reinforcement or other purposes. Such an additional member may be provided at various positions with respect to the carcass3and the bead filler2b.", "", "In the example illustrated inFIG.2, the carcass3consists of a single carcass ply. However, according to the present disclosure, the number of carcass plies is not particularly limited and may be two or more. Further, in the example illustrated inFIG.2, the carcass3includes a toroidally extending carcass body portion3athat spans between the pair of the bead portions2and turn-up portions3bthat are turned up from the carcass body portion3aaround the bead cores2a. However, according to the present disclosure, the carcass turn-up portions3bmay be wrapped around the bead cores2a, or may be sandwiched between a number of divided small bead cores. According to the illustrated example, ends3cof the carcass turn-up portions3bare positioned outward in the tire radial direction from an outermost end in the tire radial direction of the bead fillers2band inward in the tire radial direction from a tire maximum width position. This allows reduction of the weight of the tire while maintaining rigidity of the sidewall portion. However, according to the present disclosure, the ends3cof the carcass turn-up portions3bmay be positioned inward in the tire radial direction from the outermost end in the tire radial direction of the bead filler2b, or outward in the tire radial direction from the tire maximum width position. Alternatively, the ends3cof the carcass turn-up portions3bmay be an envelope structure, positioned inward in the tire width direction of ends of the belt4(for example, ends of the belt layer4b) between the carcass body portion3aand the belt4in the tire radial direction. Further, in a case where the carcass3is formed of a plurality of carcass plies, the positions of the ends3cof the carcass turn-up portions3b(for example, in the tire radial position) may be the same or different among the carcass plies. The number of cords in the carcass3is not particularly limited, and may be in a range of 20 cords to 60 cords per 50 mm, for example. Further, a carcass line may adopt various structures. For example, a carcass maximum width position in the tire radial direction may be closer to either the bead portions2or the tread5. For example, the carcass maximum width position may be in a range of 50% to 90% of a tire section height, outward in the tire radial direction from a bead base line. The above term “radially arranged” indicates at least 85° to the tire circumferential direction, preferably 90° to the tire circumferential direction.", "", "The tire according to the present embodiment preferably includes at least one inclined belt layer consisting of a rubberized layer of cords extending at an angle to the tire circumferential direction, and two layers is most preferable for the combination of weight reduction and suppression of contact patch distortion. From the viewpoint of weight reduction, one belt layer may be used, and from the viewpoint of suppressing distortion of the contact patch, three or more layers may be used. In the example illustrated inFIG.2, of the two belt layers4aand4b, the width in the tire width direction of the belt layer4boutward in the tire radial direction is smaller than the width in the tire width direction of the belt layer4ainward in the tire radial direction. However, the width in the tire width direction of the belt layer4boutward in the tire radial direction may be greater than or the same as the width in the tire width direction of the belt layer4ainward in the tire radial direction. The width in the tire width direction of the belt layer that has the greatest width in the tire width direction (the belt layer4ain the illustrated example) is preferably 90% to 115% of the ground contact width, and more preferably 100% to 105% of the ground contact width. Here, “ground contact width” refers to the distance in the tire width direction between the ground contact edges E described above.", "", "According to the present embodiment, metal cords, in particular steel cords, are most preferable as belt cords of the belt layers4a,4b, but non-metal, for example, organic fiber cords (such as Kevlar® (Kevlar is a registered trademark in Japan, other countries, or both)) may be used. The steel cords may include steel as a main component, and may contain various micro inclusions such as carbon, manganese, silicon, phosphorus, sulfur, copper, and chromium. According to the present embodiment, the belt cords of the belt layers4a,4bmay be monofilament cords, cords with a plurality of filaments drawn together, or cords with a plurality of filaments twisted together. Various twist structures may be adopted, including cross-section structure, twist pitch, twist direction, and distance between adjacent filaments. Cords obtained by twisting filaments of different materials may also be used, which may employ various twist structures such as single twist, layer twist, and multi twist, without being limited to any particular cross-section structure.", "", "According to the present embodiment, an inclination angle of the belt cords of the belt layers4a,4bis preferably 10° or more with respect to the tire circumferential direction. According to the present embodiment, the inclination angle of the belt cords of the belt layers4a,4bis preferably a high angle, specifically 20° or more, preferably 35° or more, and more preferably in a range of 55° to 85° with respect to the tire circumferential direction. By setting the inclination angle to 20° or more (preferably 35° or more), the rigidity with respect to the tire width direction may be increased, and steering stability, particularly when cornering, may be improved. Further, shearing deformation of the inter-layer rubber may be reduced, and rolling resistance may be reduced.", "", "In the illustrated example, the tread rubber of the tread5consists of one layer. However, according to the present embodiment, the tread rubber of the tread5may be formed by a plurality of different rubber layers stacked in the tire radial direction. The plurality of rubber layers may be different from one another in terms of tangent loss, modulus, hardness, glass transition temperature, material, or the like. Further, ratios of thicknesses of the plurality of rubber layers in the tire radial direction may vary in the tire width direction. Further, the circumferential main groove bottom and the like may be composed of a rubber layer different from that in a surrounding region. Further, the tread rubber of the tread5may be formed by a plurality of different rubber layers in the tire width direction. The plurality of rubber layers may be different from one another in terms of tangent loss, modulus, hardness, glass transition temperature, material, or the like. Further, ratios of thicknesses of the plurality of rubber layers in the tire width direction may vary in the tire radial direction. Further, rubber layers in a limited region, such as in the vicinity of the circumferential main grooves alone, in the vicinity of the ground contact edges E alone, in the shoulder land portions alone, or in the center land portion, may be formed as rubber layers different from the surroundings.", "", "FIG.3is a developed view illustrating a tread pattern of the pneumatic radial tire for passenger vehicles according to an embodiment of the present disclosure.", "", "As illustrated inFIG.2andFIG.3, in this example, the tire1has one or more (in the illustrated example, only one) circumferential main groove6extending in the tire circumferential direction on the contact surface of the tread5. In this example, the circumferential main groove6extends straight in the tire circumferential direction, but may extend in a zigzag shape or curved shape. The groove width (opening width) of the circumferential main groove6is not particularly limited, and may be 2 mm to 5 mm, for example. The groove depth (maximum depth) of the circumferential main groove6is not particularly limited, and may be 3 mm to 6 mm, for example. Here, according to the present embodiment, the circumferential main groove6is provided to a half portion of the tire on a vehicle-mounted inward side, which is one side in the tread width direction with the tire equatorial plane CL as a boundary. Accordingly, in the tire according to the present embodiment, a negative ratio of the half portion of the tire on the vehicle-mounted inward side, which is one side of the tire in the tread width direction with the tire equatorial plane as the boundary, is greater than a negative ratio of the other half portion of the tire on a vehicle-mounted outward side, which is the other side of the tire in the tread width direction with the equatorial plane as the boundary.", "", "In the illustrated example, the tire1does not have a width direction groove extending in the tire width direction on the contact surface of the tread5, but the tire1may have one or more width direction grooves.", "", "The tire1according to the present embodiment includes an inner liner8on an inner surface7of the tire (also referred to simply as the tire inner surface7). Thickness of the inner liner8is preferably about 1.5 mm to 2.8 mm. This may effectively reduce cabin noise in a range of 80 Hz to 100 Hz. An air permeability coefficient of a rubber composition of the inner liner8is preferably 1.0×10−14cc·cm/(cm2·s·cmHg) or greater and 6.5×10−10cc·cm/(cm2·s·cmHg) or less.", "", "As illustrated inFIG.2, according to the present embodiment, in the tire width direction cross-section, under the reference conditions described above, when a straight line passing through a point on the tread surface on the tire equatorial plane CL and parallel to the tire width direction is m1, a straight line passing through the ground contact edges E and parallel to the tire width direction is m2, a distance between the straight line m1 and the straight line m2 in the tire radial direction is a drop height LCR, and the tread width of the tire1is TW, a ratio LCR/TW is greater than 0.045 (Configuration 1).", "", "The following is an explanation of effects of the pneumatic radial tire for passenger vehicles according to the present embodiment.", "", "The pneumatic radial tire for passenger vehicles according to the present embodiment has a narrow sectional width SW of less than 165 mm, even among narrow width, large diameter tires for which the sectional width SW and the outer diameter satisfy the relational equation described above. According to such a tire, air resistance in particular may be reduced, and rolling resistance may also be reduced, thereby improving the fuel efficiency of the tire.", "", "However, as schematically illustrated on a left side of the arrow inFIG.4, with such a tire, the ground contact area may become too elongated when the camber angle changes, such as during cornering, and the ground contact area may deteriorate, resulting in reduced steering stability and the like.", "", "To address this, first, in the tire according to the present embodiment, the ratio LCR/TW is greater than 0.045. This results in a tire that has a relatively round crown shape, and therefore a rounded ground contact area, with the shoulder portion having a shorter ground contact length relative to the center portion. This inhibits the ground contact area from becoming too elongated when the camber angle changes, as illustrated schematically on the right side of the arrow inFIG.4, and suppresses deterioration of the ground contact area.", "", "Further, the narrow width tire described above has excellent drainage to the side of the tire, and therefore even when the tire has only one circumferential main groove6, drainage performance may be sufficiently secured. The negative ratio of the half portion of the tire on the vehicle-mounted inward side, which is one side of the tire in the tread width direction with the tire equatorial plane as the boundary, is greater than a negative ratio of the other half portion of the tire on a vehicle-mounted outward side, which is the other side of the tire in the tread width direction with the equatorial plane as the boundary. Accordingly, a distance until an air column resonance sound generated in the circumferential main groove6reaches the outside of the vehicle is farther (compared to a case where the negative ratio of the half portion of the tire on the vehicle-mounted outward side is greater than the negative ratio of the half portion of the tire on the vehicle-mounted inward side), enabling improvement in low-noise performance due to noise attenuation. In a case where width directional grooves are included, attenuation of pattern noise caused by the width direction grooves may improve low-noise performance.", "", "The ratio LCR/TW is more preferably 0.05 or greater. This is because deterioration of the ground contact area may be further suppressed. On the other hand, from the viewpoint of reducing rolling resistance, the ratio LCR/TW is preferably 0.1 or less.", "", "Further, the groove width (opening width) of the circumferential main groove6is preferably 20% or less of the ground contact width, and more preferably 15% or less of the ground contact width. This is because the land area can be secured. For the same reason, a negative ratio of the contact surface of the tread is preferably 20% or less, and more preferably 15% or less.", "", "Further, on the vehicle-mounted inward side, the width in the tire width direction of the land portion demarcated by the tread edge and the circumferential main grooves6is preferably 20% or greater of the ground contact width, and more preferably 25% or greater of the ground contact width. This is to mitigate a load-bearing rate and ground contact pressure concentration in the land portion and suppress uneven wear. Further, buckling in the vicinity of the circumferential main grooves6may be suppressed, which has an effect of improving grounding property.", "", "FIG.5is a schematic diagram for explanation of the ground contact area. As another aspect, a ground contact length L1on the tire equatorial plane CL is longer than an average value of ground contact lengths L2and L3((L2+L3)/2) at tire width direction positions P1and P2, which are spaced 20% of the ground contact width inward in the tire width direction from both ground contact edges E (Configuration 2). Even in this case, the ground contact area may be rounded, with the shoulder portion having a shorter ground contact length relative to the center portion. This inhibits the ground contact area from becoming too elongated when the camber angle changes, as illustrated schematically on the right side of the arrow inFIG.4, and suppresses deterioration of the ground contact area. The ground contact length L1is preferably 1.1 times the average of the ground contact lengths L2and L3or greater. On the other hand, from the viewpoint of uneven wear mitigation performance, the ground contact length L1is preferably 1.5 times the average of the ground contact lengths L2and L3or less.", "", "Further, as another aspect, as illustrated inFIG.2, a gauge G1of the tread on the tire equatorial plane is greater than an average value ((G2+G3)/2) of gauges G2and G3of the tread at positions P1and P2, which are spaced 20% of the ground contact width inward in the tire width direction from both ground contact edges E (Configuration 3). This results in a tire that has a relatively round crown shape, and therefore a rounded ground contact area, with the shoulder portion having a shorter ground contact length relative to the center portion. This inhibits the ground contact area from becoming too elongated when the camber angle changes, as illustrated schematically on the right side of the arrow inFIG.4, and suppresses deterioration of the ground contact area. Further, the thinner gauges at the positions P1and P2provide greater tread rigidity at these positions, which is advantageous for improving steering stability when cornering. The gauge G1is preferably 1.1 times the average of the gauges G2and G3or greater. On the other hand, from the viewpoint of uneven wear mitigation performance, the gauge G1is preferably 1.5 times the average value of the gauges G2and G3or less.", "", "According to the present disclosure, it suffices that any one or more of the above Configurations 1 to 3 are satisfied, and any two or all three may be satisfied.", "", "FIG.6is a developed view illustrating another example of a tread pattern. According to this example, one or more width direction sipes9(9a) extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to the land portion on a vehicle-mounted outward side that is demarcated by the circumferential main groove6and the tread edge (in the illustrated example, the width direction sipes9(9a) are provided).", "", "According to this configuration, the compressive rigidity of the land portion intersected by the tire equatorial plane CL may be somewhat reduced to equalize the ground contact pressure.", "", "Here, a “sipe” of the width direction sipes has a sipe width (opening width) of less than 2 mm.", "", "FIG.7is a developed view illustrating another example of a tread pattern. According to this example, one or more width direction sipes9(9b) extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to the land portion on a vehicle-mounted inward side that is demarcated by the circumferential main groove6and the tread edge (in the illustrated example, the width direction sipes9(9b) are provided).", "", "This configuration is able to mitigate input of force from road surface irregularities and improve noise, vibration, and harshness (NVH) performance.", "", "The sipe depth (maximum depth) of the width direction sipes9a,9band hole-shaped sipes is not particularly limited, and may be 2 mm to 6 mm, for example. The pitch interval of the width direction sipes9a,9bin the tire circumferential direction is not particularly limited, and may be 10 mm to 40 mm, for example.", "", "FIG.8illustrates an example that has two circumferential main grooves. In the example illustrated inFIG.8, the two circumferential main grooves6a,6bare both provided to one half portion in the tire width direction (vehicle-mounted inward side) with the tire equatorial plane CL as a boundary. In such a case, the negative ratio of the half portion of the tire on the vehicle-mounted inward side is of course greater then the negative ratio of the half portion of the tire on the vehicle-mounted outward side.", "", "As a further variation, one of the two circumferential main grooves may be positioned on the tire equatorial plane. In this case, the negative ratio of the half portion on the vehicle-mounted inward side may be made greater than the negative ratio of the half portion on the vehicle-mounted outward side by providing the other circumferential main groove to one half portion in the tire width direction (vehicle-mounted inward side) with the tire equatorial plane CL as a boundary."], "claims": ["sectional width SW of the tire is less than 165 mm, a ratio SW/OD of the sectional width SW to outer diameter OD of the tire is 0.26 or less, or the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the relational equation OD (mm)≥−0.0187×SW (mm) in a tire width direction cross-section, under reference conditions where the tire is mounted on a rim, filled with a prescribed internal pressure, and unloaded, when a straight line passing through a point on a tread surface on a tire equatorial plane and parallel to a tire width direction is m1, a straight line passing through ground contact edges E and parallel to the tire width direction is m2, a distance between the straight line m1 and the straight line m2 in a tire radial direction is a drop height L a contact surface of the tread has one or more circumferential main grooves extending in a tire circumferential direction, and a negative ratio of a half portion of the tire on a vehicle-mounted inward side, which is one side of the tire in a tread width direction with the tire equatorial plane as a boundary, is greater than a negative ratio of the other half portion of the tire on a vehicle-mounted outward side, which is the other side of the tire in the tread width direction with the equatorial plane as the boundary.", "sectional width SW of the tire is less than 165 mm, a ratio SW/OD of the sectional width SW to outer diameter OD of the tire is 0.26 or less, or the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the relational equation OD (mm)≥−0.0187×SW (mm) ground contact length on a tire equatorial plane is longer than an average value of ground contact lengths at positions 20% of ground contact width inward in a tire width direction from both ground contact edges, a contact surface of the tread has one or more circumferential main grooves extending in a tire circumferential direction, and a negative ratio of a half portion of the tire on a vehicle-mounted inward side, which is one side of the tire in a tread width direction with the tire equatorial plane as a boundary, is greater than a negative ratio of the other half portion of the tire on a vehicle-mounted outward side, which is the other side of the tire in the tread width direction with the equatorial plane as the boundary.", "sectional width SW of the tire is less than 165 mm, a ratio SW/OD of the sectional width SW to outer diameter OD of the tire is 0.26 or less, or the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the relational equation OD (mm)≥−0.0187×SW (mm) gauge of the tread on a tire equatorial plane is greater than an average value of gauges of the tread at positions 20% of ground contact width inward in a tire width direction from both ground contact edges, a contact surface of the tread has one or more circumferential main grooves extending in a tire circumferential direction, and a negative ratio of a half portion of the tire on a vehicle-mounted inward side, which is one side of the tire in a tread width direction with the tire equatorial plane as a boundary, is greater than a negative ratio of the other half portion of the tire on a vehicle-mounted outward side, which is the other side of the tire in the tread width direction with the equatorial plane as the boundary.", "4 . The pneumatic radial tire for passenger vehicles according to claim 1 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted outward side that is demarcated by one of the circumferential main grooves and a tread edge.", "5 . The pneumatic radial tire for passenger vehicles according to claim 1 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted inward side that is demarcated by one of the circumferential main grooves and a tread edge.", "6 . The pneumatic radial tire for passenger vehicles according to claim 2 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted outward side that is demarcated by one of the circumferential main grooves and a tread edge.", "7 . The pneumatic radial tire for passenger vehicles according to claim 3 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted outward side that is demarcated by one of the circumferential main grooves and a tread edge.", "8 . The pneumatic radial tire for passenger vehicles according to claim 2 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted inward side that is demarcated by one of the circumferential main grooves and a tread edge.", "9 . The pneumatic radial tire for passenger vehicles according to claim 3 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted inward side that is demarcated by one of the circumferential main grooves and a tread edge.", "10 . The pneumatic radial tire for passenger vehicles according to claim 4 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted inward side that is demarcated by one of the circumferential main grooves and a tread edge.", "11 . The pneumatic radial tire for passenger vehicles according to claim 6 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted inward side that is demarcated by one of the circumferential main grooves and a tread edge.", "12 . The pneumatic radial tire for passenger vehicles according to claim 7 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted inward side that is demarcated by one of the circumferential main grooves and a tread edge."], "bibtex": "@patent{20250001808,\n    title = {PNEUMATIC RADIAL TIRE FOR PASSENGER VEHICLES},\n    number = {20250001808},\n    year = {2025},\n    note = {File: US20250001808A1-20250102.XML}\n    }", "classification": "B60C1103FI"}]