[{"title": "SPOKE-STAR UNIT MADE OF A FIBRE-REINFORCED PLASTIC", "doc_number": "20240227432", "filename": "US20240227432A9-20240711.XML", "abstract": "A spoke star is made of a fiber-reinforced plastic and formed as a star-shaped closed ring, the spoke star having spokes between a hub-side inner circumference of the spoke star and a rim-side outer circumference of the spoke star, a single fiber bundle running repeatedly in the spoke star between the inner circumference and the outer circumference along spokes of the spoke star. The spokes may be formed as double spokes, the spokes having a loop at the rim-side outer circumference of the spoke star. The loops allow for a better load transfer to the spoke star.", "detailed_description": [""], "claims": ["1 . A spoke star ( 1 ) made of a fiber-reinforced plastic and formed as a star-shaped closed ring, wherein the spoke star ( 1 ) comprises at least two spokes ( 2 ) between a hub-side inner circumference of the spoke star and a rim-side outer circumference of the spoke star, wherein a single fiber bundle runs repeatedly in the spoke star between the inner circumference and the outer circumference along spokes ( 2 ) of the spoke star, wherein the spokes ( 2 ) are formed as double spokes, wherein the two spokes ( 2 ) of the double spokes are connected by a plastic matrix and the spoke arrangement within the spoke star ( 1 ) mimic that of conventional wheels with steel spokes, wherein the spokes ( 2 ) on the rim-side outer circumference of the spoke star have a loop ( 3 ) and the spokes ( 2 ) on the hub-side inner circumference of the spoke star have a loop.", "2 . The spoke star ( 1 ) according to claim 1 , wherein at least one spoke ( 2 ) comprises a fastening means ( 4 ) on the loop ( 3 ) thereof.", "3 . The spoke star ( 1 ) according to claim 2 , wherein the fastening means ( 4 ) is interlockingly connectable to the loop ( 3 ).", "4 . The spoke star ( 1 ) according to claim 2 , wherein the fastening means ( 4 ) is fixable to a wheel rim ( 6 ) by way of a screw ( 5 ).", "5 . The spoke star ( 1 ) according to claim 4 , wherein the screw ( 5 ) aligns with the spoke ( 2 ).", "6 . A spoked wheel having a hub ( 7 ), a wheel rim ( 6 ) and a plurality of spokes ( 2 ) between the hub ( 7 ) and the wheel rim ( 6 ), wherein the spoked wheel comprises at least one spoke star ( 1 ) according to claim 1 ."], "bibtex": "@patent{20240227432,\n    title = {SPOKE-STAR UNIT MADE OF A FIBRE-REINFORCED PLASTIC},\n    number = {20240227432},\n    year = {2024},\n    note = {File: US20240227432A9-20240711.XML}\n    }", "classification": "B60B104FI"}, {"title": "ALUMINUM WHEELS AND METHODS FOR CASTING ALUMINUM WHEELS USING HIGH SCRAP ALUMINUM CONTENT", "doc_number": "20240227433", "filename": "US20240227433A1-20240711.XML", "abstract": "A method for casting an aluminum wheel comprises preparing a melt having a predetermined chemistry and including silicon in a range from 8.5 to 10% mass and aluminum; degassing and refining the melt; adding a grain refiner including aluminum-titanium-vanadium-boron (Al—Ti—V—B) and a master alloy to the melt; and casting the aluminum wheel.", "detailed_description": ["The present disclosure relates to aluminum wheels and methods for casting aluminum wheels using high scrap aluminum content. The methods for casting aluminum wheels according to the present disclosure use increased silicon content, a grain refiner including aluminum-titanium-vanadium-boron (Al—Ti—V—B), and/or a die cast tool with an increased cooling rate to improve feeding efficiency.", "", "Referring now toFIG.1, aluminum (Al) dendrites50are formed during casting. The Al dendrites include a primary arm54and secondary arms58. Spacing (λ2) between the secondary arms58is referred to as second dendrite arm spacing (SDAS), which is a good indicator of a cooling rate of the Al of the cast wheel.", "", "Referring now toFIGS.2A and2B, groups of Al dendrites form during casting. Spoke regions of low pressure die cast (LPDC) Al wheels show a high percentage of casting defects due to insufficient feeding efficiency of the melt. When the Al dendrites50have large grain sizes, the Al dendrites50reduce the flow efficiency of the melt within the die. Insufficient feeding efficiency leads to shrinkage porosity. Shrinkage porosity acts a crack initiator.", "", "In addition, mechanical properties of the spoke region are sensitive to impurity iron (Fe) content. Impurity Fe combines with aluminum and silicon (Si) atoms to form a Fe-rich phase that acts as a crack initiator in deformation (e.g., degrading fracture toughness, ductility, and/or fatigue durability of the cast aluminum wheels). In addition, a slower cooling rate leads to a coarse Fe-rich phase, which impedes feeding of the melt. This, in turn, leads to larger shrinkage porosity and degraded mechanical properties of the cast Al wheels.", "", "Increased sustainability and reduced energy consumption are strong incentives for increasing the use of Al scrap when manufacturing cast Al wheels. However, the scrap Al tends to have higher levels of impurity Fe content. Typically, LPDC Al wheels are limited to less than 0.15% Fe content, which limits the use of Al scrap which typically has a higher Fe content.", "", "Methods for casting Al wheels according to the present disclosure improve feeding efficiency of the melt to reduce shrinkage porosity and/or reduce sensitivity of mechanical properties of the Al wheel to Fe content. More particularly, the methods for casting Al wheels according to the present disclosure use increased silicon content, a grain refiner (e.g., aluminum-titanium-vanadium-boron (Al—Ti—V—B)), and/or a die cast tool with an increased cooling rate to improve feeding efficiency.", "", "The increased silicon content reduces the solidus temperature and increases a flow length before solidification ends. In addition, the grain refiner adds inoculant particles to provide nucleation substrates for aluminum grains. In some examples, the die cast tool can be made using tooling steel with increased thermal conductivity to provide more uniform temperature in various locations of the die during casting. As a result, the melt can flow more efficiently through the die before solidifying since cold spots and/or large temperature gradients in the die are reduced.", "", "Aluminum wheels cast using LPDC typically use a grain refiner such as Al5Ti1B. However, the grain refiner Al5Ti1B tends to significantly increase grain sizes as the Si content increases. In contrast, the grain refiner Al—Ti—V—B reduces grain size with increasing Si content. For example, a first spoke cast using 7% Si content and Al5Ti1B with a secondary dendrite arm spacing (SDAS) of approximately 40 μm produced an average grain size of over 600 um. For example, a second spoke cast using 7% Si content and Al—Ti—V—B with a SDAS of approximately 40 μm produced an average grain size of over 400 um. For example, a third spoke cast using 9% Si content and Al—Ti—V—B with a SDAS of approximately 40 μm. In addition, the methods described herein have an average grain size that is less than 400 μm.", "", "Cooling rate is another important enabler for significantly improving feeding efficiency. For example, a fourth spoke cast using 9% Si content and Al—Ti—V—B with a SDAS of approximately 20 μm produced an average grain size of less than 250 um. Grain size smaller than 250 um will be very desirable for reducing sensitivity of spoke region to Fe content.", "", "Referring now toFIG.3, a method250for tilt casting an aluminum wheel is shown. At260, a melt is prepared at a desired chemistry. In some examples, the melt includes greater than 50%, 60%, or 70% scrap. At264, the melt is degassed and refined. At268, the grain refiner Al—Ti—V—B is added. A master alloy is added for eutectic Si modification. In some examples, the grain refiner Al—Ti—V—B includes V content greater than 1% in mass. In some examples, the master alloy comprises aluminum-strontium (Al—Sr). At272, the Al wheel is tilt cast at a temperature in range from 680° C. to 720° C. At274, the wheel is heat treated. For example, T6 heat treatment or other heat treatment may be performed.", "", "Referring now toFIGS.4A to4D, stages of tilt casting of the aluminum wheel are illustrated. A die280includes a die cavity286defining a shape of the Al wheel. The die280tilts relative to an axis284. A container288includes a melt289having a predetermined chemistry described herein. InFIG.4A, the die is tilted approximately 90° or another angle from a horizontal orientation. InFIG.4B, the container288including the melt289delivers the melt to the die280as the die280is tilted back towards a horizontal orientation. InFIG.4C, the container288including the melt289continues to deliver the melt to the die280as the die280reaches the horizontal position. InFIG.4D, a solidification sequence of an Al wheel290proceeds from a hub292to spokes294to a rim296during tilt casting as indicated by arrows.", "", "Referring now toFIG.5, a method350for low pressure die casting (LPDC) an aluminum wheel is shown. At360, a melt is prepared at a desired chemistry. In some examples, the melt includes greater than 50%, 60%, or 70% scrap.", "", "At364, the melt is degassed and refined. At368, the grain refiner Al—Ti—V—B is added, and the master alloy is added for eutectic Si modification. In some examples, the grain refiner Al—Ti—V—B includes V content greater than 1% in mass.", "", "At372, the Al wheel is cast using LPDC at a temperature in range from 680° C. to 720° C. At274, the wheel is heat treated. For example, T6 heat treatment may be performed.", "", "Referring now toFIGS.6A to6D, stages of LPDC of the aluminum wheel are illustrated. A die410includes a die cavity416defining a shape of the Al wheel. A lower portion422of the die410includes a cavity424where a melt425is heated and stored. The melt425has the predetermined chemistry described herein. A pressurized gas source432and a valve434selectively provide gas (e.g., such as clean dry air) to the cavity424. The gas displaces the melt425, which flows through a tube426into the die cavity416.", "", "InFIG.6A, the die410is shown before the gas is supplied and no melt has entered the die cavity416. InFIG.6B, the die410is shown after the gas is supplied and the melt has partially entered the die cavity416. InFIG.6C, the die410is shown after the gas is supplied and the melt has filled the die cavity416. InFIG.6D, a solidification sequence of the Al wheel290proceeds from the rim296to the spokes294to the hub292during LPDC.", "", "Normal tooling steel, like H13, has a thermal conductivity that is less than 30 W/mK over a typical temperature range of the die. In some examples, the die utilizes high thermal conductivity tooling steel having a thermal conductivity that is greater than 32 W/mK or even 40 W/mK over a typical temperature range of the die. Examples, the high thermal conductivity tooling steel include HCTS® available from Rovalma.", "", "In some examples, the composition of the wheel includes silicon (Si) in a range from 8.5 to 10.0% mass, magnesium (Mg) in a range from 0.25 to 0.4% mass, iron (Fe) in a range from 0.1 to 0.25% mass, copper (Cu) in a range from 0.01 to 0.2% mass, zinc (Zn) in a range from 0.01 to 0.2% mass, titanium (Ti) in a range from 0.01 to 0.2% mass, strontium (Sr) in a range from 10 ppm to 200 ppm, chromium (Cr) in a range from 0.01 to 0.2% mass, manganese (Mn) in a range from 0.01 to 0.2% mass, vanadium (V) in a range from 0.03 to 0.05% mass, and Al balanced (and/or in a range from 88.3 to 91.07% mass).", "", "In other examples, the composition of the wheel includes silicon (Si) in a range from 8.5 to 9.5% mass, magnesium (Mg) in a range from 0.25 to 0.4% mass, iron (Fe) in a range from 0.15 to 0.25% mass, copper (Cu) in a range from 0.01 to 0.1% mass, zinc (Zn) in a range from 0.01 to 0.1% mass, titanium (Ti) in a range from 0.01 to 0.15% mass, strontium (Sr) in a range from 50 ppm to 200 ppm, chromium (Cr) in a range from 0.01 to 0.15% mass, manganese (Mn) in a range from 0.01 to 0.15% mass, vanadium (V) in a range from 0.03 to 0.05% mass, and aluminum (Al) balanced and/or in a range from 89.15 to 91.02% mass).", "", "In some examples, the spoke region of the wheel has an average secondary dendrite arm spacing (SDAS) in a range from 20 μm to 30 μm. In some examples, the spoke region of the wheel has an average grain size in a range from 50 μm to 250 μm. In some examples, mechanical properties in the spoke region of the wheel has a yield strength greater than 170 MPa and an elongation to fracture greater than 3% mass.", "", "The foregoing description is merely illustrative in nature and is in no way intended to limit the disclosure, its application, or uses. The broad teachings of the disclosure can be implemented in a variety of forms. Therefore, while this disclosure includes particular examples, the true scope of the disclosure should not be so limited since other modifications will become apparent upon a study of the drawings, the specification, and the following claims. It should be understood that one or more steps within a method may be executed in different order (or concurrently) without altering the principles of the present disclosure. Further, although each of the embodiments is described above as having certain features, any one or more of those features described with respect to any embodiment of the disclosure can be implemented in and/or combined with features of any of the other embodiments, even if that combination is not explicitly described. In other words, the described embodiments are not mutually exclusive, and permutations of one or more embodiments with one another remain within the scope of this disclosure.", "", "Spatial and functional relationships between elements (for example, between modules, circuit elements, semiconductor layers, etc.) are described using various terms, including “connected,” “engaged,” “coupled,” “adjacent,” “next to,” “on top of,” “above,” “below,” and “disposed.” Unless explicitly described as being “direct,” when a relationship between first and second elements is described in the above disclosure, that relationship can be a direct relationship where no other intervening elements are present between the first and second elements, but can also be an indirect relationship where one or more intervening elements are present (either spatially or functionally) between the first and second elements. As used herein, the phrase at least one of A, B, and C should be construed to mean a logical (A OR B OR C), using a non-exclusive logical OR, and should not be construed to mean “at least one of A, at least one of B, and at least one of C.”", "", "In the figures, the direction of an arrow, as indicated by the arrowhead, generally demonstrates the flow of information (such as data or instructions) that is of interest to the illustration. For example, when element A and element B exchange a variety of information but information transmitted from element A to element B is relevant to the illustration, the arrow may point from element A to element B. This unidirectional arrow does not imply that no other information is transmitted from element B to element A. Further, for information sent from element A to element B, element B may send requests for, or receipt acknowledgements of, the information to element A."], "claims": ["preparing a melt having a predetermined chemistry and including silicon in a range from 8.5 to 10% mass and aluminum; degassing and refining the melt; adding a grain refiner including aluminum-titanium-vanadium-boron (Al—Ti—V—B) and a master alloy to the melt; and casting the aluminum wheel.", "2 . The method of claim 1 , wherein the melt comprises greater than 70% mass scrap aluminum.", "3 . The method of claim 1 , wherein casting the aluminum wheel includes tilt casting the aluminum wheel at a predetermined temperature in a range from 680° C. to 720° C.", "casting the aluminum wheel includes low pressure die casting (LPDC) the aluminum wheel at a predetermined temperature in a range from 680° C. to 720° C.; and a die configured to cast the aluminum wheel is made of a tooling steel having a thermal conductivity greater than 32 in a temperature range from 200° C. to 600° C.", "5 . The method of claim 1 , wherein the melt includes greater than 300 parts per million vanadium.", "6 . The method of claim 1 , wherein the melt further includes iron (Fe) in a range from 0.1 to 0.25% mass.", "magnesium (Mg) in a range from 0.25 to 0.4% mass; copper (Cu) in a range from 0.01 to 0.2% mass; zinc (Zn) in a range from 0.01 to 0.2% mass; titanium (Ti) in a range from 0.01 to 0.2% mass; strontium (Sr) in a range from 10 ppm to 200 ppm; chromium (Cr) in a range from 0.01 to 0.2% mass; manganese (Mn) in a range from 0.01 to 0.2% mass; and vanadium (V) in a range from 0.03 to 0.05% mass.", "8 . The method of claim 1 , wherein the silicon (Si) is in a range from 8.5 to 9.5% mass.", "magnesium (Mg) in a range from 0.25 to 0.4% mass; copper (Cu) in a range from 0.01 to 0.1% mass; zinc (Zn) in a range from 0.01 to 0.1% mass; titanium (Ti) in a range from 0.01 to 0.15% mass; strontium (Sr) in a range from 50 ppm to 200 ppm; chromium (Cr) in a range from 0.01 to 0.15% mass; manganese (Mn) in a range from 0.01 to 0.15% mass; and vanadium (V) in a range from 0.03 to 0.05% mass.", "10 . The method of claim 1 , wherein the aluminum wheel has an average secondary dendrite arm spacing (SDAS) in a range from 20 μm to 30 μm in a spoke region.", "11 . The method of claim 1 , wherein the aluminum wheel has an average grain size in a range from 50 μm to 250 μm in a spoke region.", "12 . The method of claim 1 , wherein a tensile sample cut from a spoke region of the aluminum wheel has a yield strength greater than 170 MPa and tensile elongation greater than 3%.", "a hub; a rim; and a plurality of spokes connected the hub to the rim, wherein the aluminum wheel is cast and includes: silicon (Si) in a range from 8.5 to 10% mass; iron (Fe) in a range from 0.1 to 0.25% mass; and aluminum comprising greater than or equal to 70% mass scrap aluminum.", "magnesium (Mg) in a range from 0.25 to 0.4% mass; copper (Cu) in a range from 0.01 to 0.2% mass; zinc (Zn) in a range from 0.01 to 0.2% mass; titanium (Ti) in a range from 0.01 to 0.2% mass; strontium (Sr) in a range from 10 ppm to 200 ppm; chromium (Cr) in a range from 0.01 to 0.2% mass; manganese (Mn) in a range from 0.01 to 0.2% mass; and vanadium (V) in a range from 0.03 to 0.05% mass.", "15 . The aluminum wheel of claim 14 , wherein the silicon (Si) is in a range from 8.5 to 9.5% mass.", "magnesium (Mg) in a range from 0.25 to 0.4% mass; copper (Cu) in a range from 0.01 to 0.1% mass; zinc (Zn) in a range from 0.01 to 0.1% mass; titanium (Ti) in a range from 0.01 to 0.15% mass; strontium (Sr) in a range from 50 ppm to 200 ppm; chromium (Cr) in a range from 0.01 to 0.15% mass; manganese (Mn) in a range from 0.01 to 0.15% mass; and vanadium (V) in a range from 0.03 to 0.05% mass.", "an average secondary dendrite arm spacing (SDAS) of spoke region in a range from 20 μm to 30 μm; and an average grain size of spoke region in a range from 50 μm to 250 μm.", "a yield strength greater than 170 MPa; and an elongation to fracture greater than 3% mass.", "a yield strength greater than 200 MPa; and an elongation to fracture greater than 3% mass."], "bibtex": "@patent{20240227433,\n    title = {ALUMINUM WHEELS AND METHODS FOR CASTING ALUMINUM WHEELS USING HIGH SCRAP ALUMINUM CONTENT},\n    number = {20240227433},\n    year = {2024},\n    note = {File: US20240227433A1-20240711.XML}\n    }", "classification": "B60B306FI"}, {"title": "FIBER REINFORCED THERMOPLASTIC SPOKE AND MANUFACTURING METHOD FOR THE SAME", "doc_number": "20240227434", "filename": "US20240227434A1-20240711.XML", "abstract": "A spoke has a rod and at least one tube. The rod is made of a composite material containing thermoplastic resin and fibers. Each one of the at least one tube is mounted on and around the rod and is heated and pressed with the rod to form at least one engaging recess radially embedded in the rod. The spoke engages the at least one tube and the rod via thermoforming the at least one tube and the rod together.", "detailed_description": ["With reference toFIGS.1and2, an embodiment of a fiber reinforced thermoplastic spoke manufactured by a manufacturing method for the same has a rod10and two tubes20A,20B. Wherein, the fiber reinforced thermoplastic spoke of the present invention is configured to connect a bicycle hub and a bicycle rim. The rod10is made of a composite material containing thermoplastic resin and fibers.", "", "With reference toFIGS.1and2, the rod10has a wind-resistant section12. The wind-resistant section12is disposed at a middle portion of the rod10and has a thin cross-section for reducing wind resistance.", "", "With reference toFIGS.1,2, and6, a cross section of the wind-resistant section12is approximately rectangular. Practically, as long as the cross-section of the wind-resistant section12is sufficiently thin for reducing wind resistance, the contour of the cross-section of the wind-resistant section12is not restricted.", "", "In the present invention, the rod10may be made of a composite material containing thermoplastic resin and fibers such as carbon fibers, Kevlar fibers, Dyneema fibers, Nylon fibers, or other fibers with tenacity.", "", "With reference toFIGS.2and3, the two tubes20A,20B are mounted on and around the rod10and are respectively adjacent to two opposite ends of the rod10. Each tube20A/20B may be made of metal or other flexible material. Each tube20A/20B can be heated and pressed together to have at least one engaging recess21radially embedded in the rod10. Each engaging recess21has a width W and a depth D. Wherein, the width W of each engaging recess21is defined along an extending direction of the rod10, and the depth D of each engaging recess21is defined along a radial direction of the rod10. Practically, said engaging recess21of each tube20A/20B may be implemented as multiple engaging recesses21. The multiple engaging recesses21surround a circumference of the rod10. Specifically, each tube20A/20B has four said engaging recesses21disposed at the circumference of the rod10in the embodiment of the present invention. Moreover, the multiple engaging recesses21of each tube20A/20B may be divided into two groups. The engaging recesses21respectively of the two groups are spaced apart and respectively surround the circumference of the rod10to enhance an engagement between each tube20A/20B and the rod10.", "", "With reference toFIGS.2,3, and5, the tube20A has a thread22, and the tube20B has an engaging head23.", "", "With reference toFIG.7, a manufacturing method for a fiber reinforced thermoplastic spoke comprises steps of a tube assembly step S1, a thermoforming step S2, a wind-resistant section formation step S3, and a finishing step S4.", "", "In the tube assembly step S1: first of all, prepare one said rod10made of a composite material containing thermoplastic resin and fibers and a said tube20A/20B. Then, mount the tube20A/20B on and around the rod10.", "", "In the thermoforming step S2: heat and press the rod10and the tube20A/20B together to deform the rod10made of a composite material containing thermoplastic resin and the tube20A/20B together. Said engaging recess21radially embedded in the rod10shown inFIGS.2to4is formed. Accordingly, the tube20A/20B and the rod10engage with each other.", "", "In the wind-resistant section formation step S3: heat and shape the middle portion of the rod10to form the wind-resistant section12with said thin cross-section to reduce wind resistance. In the present invention, the wind-resistant section formation step S3may be performed before the thermoforming step S2. Sequences of the thermoforming step S2and the wind-resistant section formation step S3are not limited.", "", "In the finishing step S4: process the rod10to remove rough edges, formed by heating and shaping, on the wind-resistant section12of the rod10especially.", "", "Compared to a conventional carbon spoke combining a carbon rod and a connecting unit by glue, the fiber reinforced thermoplastic spoke, manufactured by the manufacturing method of the present invention, fixes the tube20A/20B via heating and pressing the tube20A/20B and the rod10together. The tube20A/20B mounted on and around the rod10deform together and form said recess21circularly embedded in the rod10to engage with each other. Therefore, the connection between the rod10and the tube20A/20B is enhanced, and detachment between of the rod10and the tube20A/20B due to deterioration of the glue between the rod10and the tube20A/20B can be avoided.", "", "Please refer to the following table: the spoke of the present invention with the rod10having a maximum diameter 2.25 mm undergoes a tension test.", "", "MaximumWidthDepthTensiondiameter (mm)(mm)(mm)(kgf)2.2590.552942.2590.623562.2590.623682.2590.623652.2590.623802.2590.613612.2590.613652.2590.59361", "", "According to the above table, each engaging recess21of the tube20A/20B has the width W being 9 mm and the depth being greater than or equal to 0.3 mm and is less than or equal to 0.9 mm. The tube20A/20B detaches from the rod10when a tension subjected to the spoke exceeds 290 kgf.", "", "Even though numerous characteristics and advantages of the present invention have been set forth in the foregoing description, together with details of the structure and features of the invention, the disclosure is illustrative only. Changes may be made in the details, especially in matters of shape, size, and arrangement of parts within the principles of the invention to the full extent indicated by the broad general meaning of the terms in which the appended claims are expressed."], "claims": ["a rod made of a composite material containing thermoplastic resin and fibers; and at least one tube, each one of the at least one tube having at least one engaging recess, and each one of the at least one engaging recess radially embedded in the rod.", "each one of the at least one engaging recess of each one of the at least one tube has a width defined along an extending direction of the rod and being 9 mm; and a depth defined along a radial direction of the rod and being greater than or equal to 0.3 mm and less than or equal to 0.9 mm.", "3 . The spoke as claimed in claim 1 , wherein the at least one engaging recess of each one of the at least one tube includes multiple engaging recesses surrounding a circumference of the rod.", "4 . The spoke as claimed in claim 2 , wherein the at least one engaging recess of each one of the at least one tube includes multiple engaging recesses surrounding a circumference of the rod.", "the rod has a wind-resistant section disposed at a middle portion of the rod and formed by heating and shaping; and the wind-resistant section has a thin cross-section.", "the rod has a wind-resistant section disposed at a middle portion of the rod and formed by heating and shaping; and the wind-resistant section has a thin cross-section.", "the rod has a wind-resistant section disposed at a middle portion of the rod and formed by heating and shaping; and the wind-resistant section has a thin cross-section.", "a tube assembly step: preparing a rod made of a composite material containing thermoplastic resin and fibers and a tube and mounting the tube on and around the rod; a thermoforming step: heating and pressing the rod and the tube together to deform the rod and the tube together to form at least one engaging recess, radially embedded in the rod for engaging the tube and the rod; and a finishing step: processing the rod to remove rough edges, formed by heating and shaping, on the rod.", "the manufacturing method has a wind-resistant section formation step: heating and shaping a middle portion of the rod to form a wind-resistant section with a thin cross-section for reducing wind resistance."], "bibtex": "@patent{20240227434,\n    title = {FIBER REINFORCED THERMOPLASTIC SPOKE AND MANUFACTURING METHOD FOR THE SAME},\n    number = {20240227434},\n    year = {2024},\n    note = {File: US20240227434A1-20240711.XML}\n    }", "classification": "B60B502FI"}, {"title": "SIDEWALL INSERT FOR A MOTORCYCLE TIRE", "doc_number": "20240227435", "filename": "US20240227435A9-20240711.XML", "abstract": "An assembly ( 18 ) comprises a motorcycle tire ( 12 ) and at least one insert ( 16 ) for a sidewall of the tire ( 12 ). The insert ( 16 ) is removably fastened to the sidewall. The sidewall insert ( 16 ) comprises two free end edges arranged so that, when the tire ( 12 ) is mounted on a mounting support ( 14 ) in order to form a mounted assembly ( 10 ) and when the mounted assembly ( 10 ) is mounted on the motorcycle, the insert ( 16 ) can be mounted on and removed from the sidewall of the tire ( 12 ) without removing the mounted assembly ( 10 ) from the motorcycle. An insert ( 16 ) and a set of inserts that can be used in such an assembly ( 18 ), are disclosed together with a method for mounting an insert ( 16 ) or a set of inserts in order to form such an assembly ( 18 ).", "detailed_description": [""], "claims": ["1 .- 15 . (canceled)", "wherein a sidewall insert ( wherein the insert (", "17 . The insert ( 16 ) according to claim 16 , wherein the sidewall insert forms the angular sector of a circular ring.", "18 . The insert ( 16 ) according to claim 17 , further comprising a radially inner edge ( 40 ) and a radially outer edge ( 42 ), each of the radially inner edge and the radially outer edge ( 40 , 42 ) following a circular curve.", "19 . The insert ( 16 ) according to claim 16 , further comprising removable means ( 48 ) for fastening the insert ( 16 ) to the sidewall ( 26 ) of the tire ( 12 ) comprising means ( 50 ) for fastening the insert ( 16 ) to the sidewall ( 26 ) of the tire ( 12 ) through reversible elastic clipping.", "wherein the or each sidewall insert (", "21 . The assembly ( 18 ) according to claim 20 , wherein the assembly comprises a single insert ( 16 ) for a sidewall ( 26 ) removably fastened to the sidewall ( 26 ), the sidewall insert ( 16 ) forming an angular sector of a ring, the angular sector ranging from 330° to 380°.", "each sidewall insert ( the sidewall ( each of the N inserts (", "each sidewall insert ( the sidewall ( N covered portions ( N′≥2 uncovered portions ( each covered portion (", "passing the insert ( removably fastening the insert (", "passing each sidewall insert around a fork arm ( where the or each sidewall insert ( where the or each sidewall insert ( each free end edge ( each free end edge ( removably fastening each sidewall insert ("], "bibtex": "@patent{20240227435,\n    title = {SIDEWALL INSERT FOR A MOTORCYCLE TIRE},\n    number = {20240227435},\n    year = {2024},\n    note = {File: US20240227435A9-20240711.XML}\n    }", "classification": "B60B701FI"}, {"title": "DRIVING MODULE", "doc_number": "20240227436", "filename": "US20240227436A1-20240711.XML", "abstract": "A driving module includes a housing rotatably supported about a knuckle unit, a barrel unit rotatably supported by the housing, a first rotation input unit and a second rotation input unit rotatably supported by the knuckle unit, a first gear unit engaged with the first rotation input unit to transmit a rotation force input from the first rotation input unit to the housing or the barrel unit, a second gear unit engaged with the second rotation input unit and the first gear unit to transmit a rotation force input from the second rotation input unit to the housing or the barrel unit, and a controller configured to control rotations of the first rotation input unit and the second rotation input unit independently of each other to selectively rotate the housing or the barrel unit so that a vehicle is movable in all directions.", "detailed_description": ["Reference will now be made in detail to various embodiments of the present disclosure(s), examples of which are illustrated in the accompanying drawings and described below. While the present disclosure(s) will be described in conjunction with exemplary embodiments of the present disclosure, it will be understood that the present description is not intended to limit the present disclosure(s) to those exemplary embodiments of the present disclosure. On the other hand, the present disclosure(s) is/are intended to cover not only the exemplary embodiments of the present disclosure, but also various alternatives, modifications, equivalents and other embodiments, which may be included within the spirit and scope of the present disclosure as defined by the appended claims.", "", "Hereinafter, exemplary embodiments of the present disclosure will be described in detail with reference to the accompanying drawings.", "", "Advantages and features of the present disclosure, and a method of achieving them will become clear with reference to the exemplary embodiments to be described below in detail together with the accompanying drawings.", "", "However, the present disclosure is not limited by the exemplary embodiments to be included below but will be implemented in various different forms, only these embodiments are provided to complete the present disclosure of the present disclosure and completely convey the scope of the present disclosure to those skilled in the art to which the present disclosure pertains, and the present disclosure is only defined by the scope of the claims.", "", "Furthermore, in the description of the present disclosure, when it is determined that related known technologies may obscure the gist of the present disclosure, a detailed description thereof will be omitted.", "", "FIG.1is a view showing a driving module according to an exemplary embodiment of the present disclosure,FIG.2is a view showing a structure of the driving module according to the exemplary embodiment of the present disclosure, andFIG.3is a view showing an operating state of the driving module according to the exemplary embodiment of the present disclosure.", "", "Furthermore,FIG.4is a view showing a coupling relationship of an internal structure of the driving module according to the exemplary embodiment of the present disclosure,FIG.5is a view showing a coupled state of a barrel portion to the driving module according to the exemplary embodiment of the present disclosure, andFIG.6is a view showing the rotation of a housing with respect to the driving module according to the exemplary embodiment of the present disclosure.", "", "Furthermore,FIG.7is a view showing the rotation of the barrel portion with respect to the driving module according to the exemplary embodiment of the present disclosure,FIG.8is a view showing the rotation of the housing and the barrel with respect to the driving module according to the exemplary embodiment of the present disclosure, andFIG.9is a view showing the omni-directional movement of the driving module according to the exemplary embodiment of the present disclosure.", "", "As shown inFIG.1andFIG.2, the driving module according to the exemplary embodiment of the present disclosure is applicable to all moving objects, such as robots, as well as vehicles and may include a knuckle unit100, a first rotation input unit200, a second rotation input unit300, a first gear unit400, a second gear unit500, a barrel unit600, and a controller700.", "", "A housing1is rotatably supported about the knuckle unit100, and the knuckle unit100is connected to a general suspension mounted on the housing1to absorb a shock so that the shock of a road surface is not transmitted to a vehicle body or occupants.", "", "Unlike the conventional friction driving method, that is, a structure in which power is transmitted to each of both sides of a wheel to determine the entire rotation driving through relative motion, the knuckle unit100is provided inside the housing1, that is, on one side of the housing1, and includes the first rotation input unit200and the second rotation input unit300formed as an input shaft for steering mounted therein.", "", "Here, the first rotation input unit200and the second rotation input unit300may be rotatably supported by the knuckle unit100and provided on the one side of the housing1, and as a torque is transmitted by an actuator provided on one side of the knuckle unit100, an input for steering may be input to one side thereof.", "", "The first rotation input unit200and the second rotation input unit300include first and second rotation input shafts202and302, first and second spur gears210and310fixed to the first and second rotation input shafts202and302, and first and second ring gears200aand300aengaged with the first and second spur gears210and310, respectively.", "", "The first rotation input unit200and the second rotation input unit300are provided so that a forward or reverse rotation direction and rotation speed may be selectively adjusted as the knuckle unit100is connected to a vehicle steering system.", "", "In other words, the first rotation input unit200may perform control, such as rotating at the same speed as that of the second rotation input unit300in an opposite direction to the second rotation input unit300, rotating at the same speed in the same direction, or rotating at different speeds in the opposite directions.", "", "Therefore, the first rotation input unit200and the second rotation input unit300may change the rotation direction and the rotation speed so that the housing1rotates, that is, a vehicle moves in a longitudinal direction or as shown inFIG.3, rotate the barrel unit600together so that the vehicle moves laterally.", "", "To the present end, the first gear unit400includes a plurality of gears consecutively coupled to transmit a rotation force input from the first rotation input unit200, and as shown inFIG.3andFIG.4, includes a plurality of 1-1 gears410, a plurality of 1-2 gears420, a plurality of bevel gears430, and a plurality of connecting belts440.", "", "The 1-1 gear410is provided to be rotatably supported by the housing1together with the 1-2 gear420and has one side engaged with the first rotation input unit200and the other side engaged with the second gear unit500.", "", "In other words, the 1-1 gear410has one side engaged with and coupled to a screw of the first ring gear200arotated by the first spur gear210of the first rotation input unit200and the other side engaged with the second gear unit500.", "", "Furthermore, the 1-2 gear420is disposed on the same line as the 1-1 gear410and engaged with the 1-1 gear410and thus formed to rotate in an opposite direction to the 1-1 gear410.", "", "Furthermore, the bevel gear430is engaged with the 1-2 gear420and provided to rotate in the opposite direction to the 1-2 gear420to change a direction of the rotation force to be transmitted to the barrel unit600.", "", "In other words, the barrel unit600is coupled so that a plurality of first barrel portions610and second barrel portions620cross each other inside and outside the housing1about a rotation axis1a, cross each other upon rotation, and is consecutively in contact with the ground. At the instant time, only when the first barrel portion610and the second barrel portion620are rotated in the same direction, the vehicle may move laterally, and considering a gear coupling structure of the first gear unit400and the second gear unit500shown inFIG.5, because the first barrel portion610and the second barrel portion620are inevitably rotated in the opposite directions when the bevel gear430is omitted, the direction of the rotation force to be transmitted to the first barrel portion610may be changed through the configuration of the bevel gear430so that the rotation directions of the first barrel portion610and the second barrel portion620coupled to cross each other inside and outside the housing1are the same.", "", "Furthermore, as shown inFIG.5, the bevel gear430is formed in a structure in which a pair of bevel gears430is engaged with and coupled to each other at an angle of 60°, and thus because the plurality of first barrel portions610and second barrel portions620are coupled to cross each other inside and outside the housing1, the torsional coupling to the first barrel portion610inside the housing1may be made and arrangement states of the plurality of first barrel portions610and second barrel portions620including an elliptical shape inside the housing1may form a circular edge portion.", "", "Meanwhile, the connecting belt440connects a pulley430aprovided on one end portion of the bevel gear430and a pulley600aof the first barrel portion610so that the rotation force is transmitted to the first barrel portion610.", "", "Furthermore, the second gear unit500includes a plurality of gears consecutively coupled to transmit a rotation force input from the second rotation input unit300, and as shown inFIG.3andFIG.4, includes a plurality of 2-1 gears510, a plurality of 2-2 gears520, and a plurality of connecting belts540.", "", "Here, because the 2-1 gear510, the 2-2 gear520, and the connecting belt540are used to rotate the second barrel portion620coupled to cross the first barrel portion610from the outside of the housing1in the same manner as a structure which is used to rotate the first barrel portion610coupled to the inside of the housing1, the structural features are the same as those of the 1-1 gear410, the 1-2 gear420, and the connecting belt440of the first gear unit400, and thus a detailed description of the corresponding components will be omitted.", "", "The first barrel portion610and the second barrel portion620are respectively connected to the first gear unit400and the second gear unit500and selectively driven by the independent rotation of the first rotation input unit200and the second rotation input unit300, implementing the lateral movement of the vehicle.", "", "The first barrel portion610and the second barrel portion620may be configured for controlling the first gear unit400and the second gear unit500so that the first gear unit400is forcibly interlaced with the second gear unit500, blocking the transmission of the rotation force, and thus the vehicle may move not only in the lateral direction but also in the longitudinal direction thereof.", "", "In other words, because the housing1may be rotated about the knuckle unit100as the rotations of the first barrel portion610and the second barrel portion620are fixed, the transmission of the rotation force through the first gear unit400and the second gear unit500is blocked, and thus as described above, the longitudinal movement of the vehicle in a front and rear direction is available through the first barrel portion610and the second barrel portion620forming the circular edge portion.", "", "As shown inFIGS.4and6to8, the controller700may be configured for controlling the rotations and rotation speeds of the first rotation input unit200and the second rotation input unit300independently of each other, more specifically, control the rotation directions and rotation speeds of the first rotation input unit200and the second rotation input unit300to selectively rotate the housing1or the barrel unit600, and thus the vehicle may move in all directions, such as the longitudinal direction, lateral direction, and the diagonal direction thereof.", "", "Meanwhile, based on the above-described configuration, the traveling of the driving module in a plurality of directions will be described with reference toFIG.6,FIG.7, andFIG.8as follows."], "claims": ["a housing rotatably supported about a knuckle unit; a barrel unit rotatably supported by the housing; a first rotation input unit and a second rotation input unit rotatably supported by the knuckle unit; a first gear unit engaged with the first rotation input unit to transmit a rotation force input from the first rotation input unit to the housing or the barrel unit; a second gear unit engaged with the second rotation input unit and the first gear unit to transmit a rotation force input from the second rotation input unit to the housing or the barrel unit; and a controller configured to control rotations of the first rotation input unit and the second rotation input unit independently of each other to selectively rotate the housing or the barrel unit so that a vehicle is movable in a predetermined direction.", "a first rotation input shaft; a first spur gear fixed to the first rotation input shaft; and a first ring gear engaged with the first spur gear.", "a second rotation input shaft; a second spur gear fixed to the second rotation input shaft; and a second ring gear engaged with the second spur gear.", "4 . The driving module of claim 1 , wherein rotation directions and rotation speeds of the first rotation input unit and the second rotation input unit are selectively adjusted.", "5 . The driving module of claim 1 , wherein when the first rotation input unit and the second rotation input unit rotate at a same speed in opposite directions, a rotation of the housing is fixed, and only the barrel unit rotates.", "6 . The driving module of claim 1 , wherein when the first rotation input unit and the second rotation input unit rotate at a same speed in a same direction, a rotation of the barrel unit is fixed, and only the housing rotates.", "7 . The driving module of claim 1 , wherein when the first rotation input unit and the second rotation input unit rotate at different speeds, the barrel unit and the housing are rotated together.", "a first barrel portion connected to the first gear unit to rotate; and a second barrel portion connected to the second gear unit to rotate.", "wherein the first barrel portion includes a plurality of barrels rotatably supported by a first side of the housing, and wherein the second barrel portion includes a plurality of barrels rotatably supported by a second side of the housing.", "10 . The driving module of claim 8 , wherein the first barrel portion and the second barrel portion are disposed to cross each other in a circumferential direction of the housing about a rotation axis of the housing, and cross each other upon rotation of the housing and is consecutively in contact with the ground.", "11 . The driving module of claim 8 , wherein the first barrel portion and the second barrel portion rotate in a same direction.", "a plurality of 1-1 gears rotatably supported by the housing and including a first side connected to the first rotation input unit and a second side engaged with the second gear unit; a plurality of 1-2 gears engaged with the plurality of 1-1 gears; a plurality of bevel gears engaged with the plurality of 1-2 gears and provided to change a direction of the rotation force to be transmitted to the barrel unit; and a plurality of connecting belts connecting a pulley of the plurality of bevel gears and a pulley of the barrel unit.", "13 . The driving module of claim 12 , wherein the plurality of 1-1 gears and the plurality of 1-2 gears are rotatably supported by the housing.", "14 . The driving module of claim 12 , wherein the plurality of bevel gears is formed in a structure in which a pair of bevel gears is engaged with and coupled to each other at an angle of 60°.", "a plurality of 2-1 gears including a first side connected to the second rotation input unit and a second side engaged with the first gear unit; a plurality of 2-2 gears engaged with the plurality of 2-1 gears; and a plurality of connecting belts connecting a pulley of the plurality of 2-2 gears and a pulley of the barrel unit.", "16 . The driving module of claim 15 , wherein the plurality of 2-1 gears and the plurality of 2-2 gears are rotatably supported by the housing.", "17 . The driving module of claim 1 , further including an actuator provided on one side of the knuckle unit and configured to transmit a torque to the first rotation input unit and the second rotation input unit."], "bibtex": "@patent{20240227436,\n    title = {DRIVING MODULE},\n    number = {20240227436},\n    year = {2024},\n    note = {File: US20240227436A1-20240711.XML}\n    }", "classification": "B60B1900FI"}, {"title": "VEHICLE WHEEL", "doc_number": "20240227437", "filename": "US20240227437A1-20240711.XML", "abstract": "A vehicle wheel, includes: a rim part at which a tire is mounted; a hub part disposed at an inner side of the rim part, attached to an axle hub, and coupled to a disc rotor of a disc brake; and a side connection part configured to connect a vehicle outer side part of the rim part with the hub part, in which: in an axle direction view, between the rim part and the hub part, plural through holes penetrating in the axle direction are formed aligned in a circumferential direction, and plural fins are formed at an inner peripheral surface of the rim part in series in a row in a circumferential direction thereof, each of the fins being configured at an incline from an outer side to an inner side in the wheel axis direction toward one side in the circumferential direction of the rim part.", "detailed_description": ["Explanation follows regarding a vehicle wheel according to an exemplary embodiment of the present disclosure, with reference toFIG.1toFIG.6. Note that in these drawings, the arrow FR illustrated as appropriate indicates a front side of the vehicle, the arrow UP indicates an upper side of the vehicle, and the arrow OUT indicates an outer side in the vehicle width direction."], "claims": ["a rim part at which a tire is mounted; a hub part disposed at an inner side of the rim part, attached to an axle hub, and coupled to a disc rotor of a disc brake; and a side connection part configured to connect a vehicle outer side part of the rim part with the hub part, wherein: in an axle direction view, between the rim part and the hub part, a plurality of through holes penetrating in the axle direction are formed and are aligned in a circumferential direction, and a plurality of fins are formed at an inner peripheral surface of the rim part, in series, in a row in a circumferential direction thereof, each of the fins being configured at an incline from an outer side in a wheel axis direction to an inner side in the wheel axis direction toward one side in the circumferential direction of the rim part.", "2 . The vehicle wheel of claim 1 , wherein a position of each of the fins in the wheel axis direction overlaps with a position in a width direction of a pressed part of the disc rotor that is configured to be pressed by a brake pad, and a width of each of the fins in the wheel axis direction is wider than a width of the pressed part of the disc rotor.", "3 . The vehicle wheel of claim 1 , wherein each of the fins is configured at an incline from the outer side in the wheel axis direction to the inner side in the wheel axis direction toward an opposite side from a wheel rotation direction side during vehicle forward movement, in the circumferential direction of the rim part.", "4 . The vehicle wheel of claim 3 , wherein the fins are disposed at positions in the wheel circumferential direction of the inner peripheral surface of the rim part corresponding to the plurality of through holes. may the implemented within a range not departing from the gist of the present disclosure."], "bibtex": "@patent{20240227437,\n    title = {VEHICLE WHEEL},\n    number = {20240227437},\n    year = {2024},\n    note = {File: US20240227437A1-20240711.XML}\n    }", "classification": "B60B1910FI"}, {"title": "Firm-Grip Rim", "doc_number": "20240227438", "filename": "US20240227438A1-20240711.XML", "abstract": "A firm-grip rim includes two walls, an internal ring, an external ring and two flanges. The walls extend in an annular manner. The internal ring is formed between the walls. The external ring extends around the internal ring and includes two lateral portions connected to the walls respectively. Each of the flanges extends outward from a corresponding one of the walls in a radial direction so that there is a corner between it and a corresponding one of the lateral portions of the external ring. Each of the flanges includes an internal side formed with a grip device.", "detailed_description": ["Referring toFIGS.1through3, a firm-grip rim includes two walls10, an internal ring20, and external ring30and two flanges40according to the preferred embodiment of the present invention.", "", "Each of the walls10is an annular portion of the firm-grip rim. The walls10extend away from each other as they extend outward in a radial direction.", "", "The internal ring20is located between and connected to the walls10.", "", "The external ring30is located between and connected to the walls10. A diameter of the external ring30is larger than a diameter of the internal ring20. The external ring30extends around the internal ring20.", "", "Each of the flanges40extends outward from a corresponding one of the walls10. Each lateral portion34of the external ring30is connected to a corresponding one of the flanges40and a corresponding one of the walls10. There is a corner A between each of the lateral portions34of the external ring30and the corresponding one of the flanges40.", "", "Each of the flanges40includes a grip device41on an internal side. The grip device41includes multiple grooves411separating multiple ridges412from one another.", "", "The flanges40extend toward each other as they extend outward in a radial direction. The thickness of the flanges40is constant. Hence, there is an angle θ1 between the internal side of each of the flanges40and a vertical line or plane VL. The angle θ1 is about 2 to 6 degrees and, more preferably, 1 to 3 degrees. There is an angle θ2 between each of the lateral portions34of the external ring30and a horizontal line or plane HL. The angle θ2 is about 2 to 6 degrees and, more preferably, 1 to 3 degrees. Accordingly, an angle θ3 of the corner A is about 84 to 88 degrees.", "", "Referring toFIGS.4through6as well asFIGS.1through3, a tire50includes two beads51respectively inserted in the corners A of the firm-grip rim. Proper elasticity of the tire50allows the beads51to be in firm contact with the external ring30. External sides of the beads51are in firm contact with the grip devices41of the flanges40. As the angle θ3 of the corner A is smaller than 90 degrees, each of the flanges40and the corresponding one of the of lateral portions34of the external ring30together form a clamp for clamping the corresponding one of the beads51of the tire50as indicated by arrow heads F shown inFIG.5.", "", "During a normal ride, rigidity of the tire50is retained due to the contact, the grip and the clamp mentioned above. In case of change in a road surface, tilting of the rim, movement of the center of weight of a rider or variation of the pneumatic pressure of inadequate pressure in the tire, the tire50inevitably suffer elastic deformation. In such a case, the gripping of the beads51of the tire50by the grip devices41and the clamping of the beads51of the tire50by the corners A of which the angle θ3 are smaller than90degrees. Thus, the engagement of the beads51of the tire50with the combination of the external ring30with the flanges40is retained.", "", "The present invention has been described via the illustration of the preferred embodiment. Those skilled in the art can derive variations from the preferred embodiment without departing from the scope of the present invention. Therefore, the preferred embodiment shall not limit the scope of the present invention defined in the claims."], "claims": ["two walls ( an internal ring ( an external ring ( two flanges (", "2 . The firm-grip rim according to claim 1 , wherein the grip device ( 41 ) comprises grooves ( 411 ) and ridges ( 412 ) separated from one another by the grooves ( 411 ).", "3 . The firm-grip rim according to claim 1 , wherein each of the flanges ( 40 ) is tilted from a vertical line (VL) toward the external ring ( 30 ) for an angle of about 2 to 6 degrees.", "4 . The firm-grip rim according to claim 1 , wherein each of the lateral portions ( 34 ) of the external ring ( 30 ) is biased from a horizontal line (HL) toward the corresponding one of the flanges ( 40 ) for an angle of about 2 to 6 degrees.", "5 . The firm-grip rim according to claim 1 , wherein there is an angle of about 84 to 88 degrees between each of the lateral portions ( 34 ) of the external ring ( 30 ) and the corresponding one of the flanges ( 41 )."], "bibtex": "@patent{20240227438,\n    title = {Firm-Grip Rim},\n    number = {20240227438},\n    year = {2024},\n    note = {File: US20240227438A1-20240711.XML}\n    }", "classification": "B60B2102FI"}, {"title": "Multipiece Road Wheel", "doc_number": "20240227439", "filename": "US20240227439A1-20240711.XML", "abstract": "A road wheel for a tracked vehicle includes a first rim half and a second rim half operatively connected to the first rim half. The first rim half includes at least a first portion that is angled away from the second rim half. The second rim half includes at least a first portion that is angled away from the first rim half. A hollow cavity is formed between the first portion of the first rim half and the first portion of the second rim half.", "detailed_description": [""], "claims": ["a first rim half; and a second rim half operatively connected to the first rim half, wherein the first rim half comprises at least a first portion that is angled away from the second rim half, wherein the second rim half comprises at least a first portion that is angled away from the first rim half, wherein a hollow cavity is formed between the first portion of the first rim half and the first portion of the second rim half, and wherein the first rim half or the second rim half comprises a flange formed integral with the respective first rim half or the second rim half and that extends from an outer radial edge of the first rim half or the second rim half to support an elastomeric pad.", "2 . The road wheel as claimed in claim 1 , wherein the first rim half and the second rim half are operatively connected to one another via at least one fastener around the perimeter, and at least one lug fastener connects the rim halves at a center portion.", "3 . The road wheel as claimed in claim 1 , wherein the first rim half and the second rim half are welded together.", "4 . The road wheel as claimed in claim 1 , wherein a wear-resistant material is applied to at least one of the first rim half and the second rim half.", "5 . The road wheel as claimed in claim 1 , wherein at least one of the first rim half and the second rim half is a fabricated component made using a mold, using a tool, being machined, through additive manufacturing, being joined together from multiple pieces, or a combination thereof.", "6 . The road wheel as claimed in claim 1 , wherein the first rim half is interlocked with the second rim half via a dovetail connection.", "7 . The road wheel as claimed in claim 1 , wherein a surface coating is applied to at least one of the first rim half and the second rim half, in which the surface coating is composed of one of the following: a metallic material, a carbide, a ceramic oxide, and a combination of these materials.", "8 . (canceled)", "an elastomeric pad; and a road wheel, comprising: a first rim half; and a second rim half operatively connected to the first rim half, wherein the elastomeric pad is adhered onto the road wheel, wherein the first rim half comprises at least a first portion that is angled away from the second rim half, wherein the second rim half comprises at least a first portion that is angled away from the first rim half, wherein a hollow cavity is formed between the first portion of the first rim half and the first portion of the second rim half, and wherein the first rim half or the second rim half comprises a flange formed integral with the respective first rim half or the second rim half and that extends from an outer radial edge of the first rim half or the second rim half to support an elastomeric pad.", "10 . The road wheel assembly as claimed in claim 9 , wherein the first rim half and the second rim half are operatively connected to one another via at least one fastener.", "11 . The road wheel assembly as claimed in claim 9 , wherein the first rim half and the second rim half are welded together.", "12 . The road wheel assembly as claimed in claim 9 , wherein a wear-resistant material is applied to at least one of the first rim half and the second rim half.", "13 . The road wheel assembly as claimed in claim 9 , wherein at least one of the first rim half and the second rim half is a fabricated component made using a mold, using a tool, being machined, through additive manufacturing, being joined together from multiple pieces, or a combination thereof.", "14 . The road wheel assembly as claimed in claim 9 , wherein the first rim half is interlocked with the second rim half via a dovetail connection.", "15 . The road wheel assembly as claimed in claim 9 , wherein a surface coating is applied to at least one of the first rim half and the second rim half, in which the surface coating is composed of one of the following: a metallic material, a carbide, a ceramic oxide, and a combination of these materials.", "16 . (canceled)", "17 . The road wheel assembly as claimed in claim 9 , further comprising an additional road wheel, wherein the road wheel is connected to the additional road wheel to form a recessed region between the road wheels, wherein the recessed region is created by the configuration and dimensions of the road wheels, and is configured and dimensioned to accommodate a guide on a track.", "18 . (canceled)", "forging a first rim half; forging a second rim half; and welding the first rim half to the second rim half thereby establishing a hollow cavity defined between the first rim half and the second rim half.", "20 . The method as claimed in claim 19 , further comprising applying a wear-resistant material to at least one of the first rim half and the second rim.", "21 . The method as claimed in claim 19 , further comprising applying a surface coating to at least one of the first rim half and the second rim half, in which the surface coating is composed of one of the following: a metallic material, a carbide, a ceramic oxide, and a combination of these materials.", "22 . (canceled)"], "bibtex": "@patent{20240227439,\n    title = {Multipiece Road Wheel},\n    number = {20240227439},\n    year = {2024},\n    note = {File: US20240227439A1-20240711.XML}\n    }", "classification": "B60B2500FI"}, {"title": "INTERNAL CONNECTION OF A BICYCLE REAR HUB", "doc_number": "20240227440", "filename": "US20240227440A9-20240711.XML", "abstract": "The invention refers to the internal connection of a rear bicycle wheel hub ( 1 ) comprising a cylindrical body ( 2 ) that surrounds an axle ( 3 ), where a proximal end ( 2 b ) of the body ( 2 ) is attached to a freehub body ( 4 ) that surrounds a freewheel system ( 6 ). A connecting mechanism ( 5 ) between the body ( 2 ) and the freewheel system ( 6 ) of the freehub body ( 4 ) is characterized in that it comprises a connecting crown ( 7 ) coupled to an inner surface ( 2 c ) of the body ( 2 ) that connects with a ring ( 6 a ) in the freewheel system ( 6 ) and an elastic ring ( 8 ) seated in a circular recess ( 9 ) on a lateral surface ( 7 c ) of the connecting crown ( 7 ) so that it can expand towards the inner surface ( 2 c ) of the body ( 2 ) and fix the connecting crown ( 7 ) inside the body ( 2 ).", "detailed_description": ["The invention refers to a rear hub system (1) of a bicycle. Specifically, it relates to the connecting mechanism (5) of the body (2) and the freehub body (4) of a rear hub (1) of a bicycle as seen inFIGS.2,3and4.", "", "FIGS.1and1Ashow an exploded view and a locally enlarged view of a rear hub system (1) known as a ratchet system, which comprises, from left to right, a distal stop (1a), a body (2), an axle (3) with wheel bearings (11,12), a freehub body (4) and a proximal stop (1b). The rear hub (1) between the body (2) and the freehub body (4) comprises a connecting part (5a) and a freewheel system (6). In this ‘ratchet’ type of rear hub, the freewheel system (6) works through the interaction between the connecting part (5a), which is normally externally threaded and has internal splines, and the two rings (6a,6b) facing each other, with external splines and laterally toothed with equal and complementary lateral teeth, pushed by two springs (6c) external to them, which make up the freewheel system (6) as shown inFIG.1A. The connecting part (5a) which is normally threaded externally for fastening to the body (2) and internally splined for holding the freewheel system (6), is the most important part in the connection and fastening of the freehub body (4) to the body (2). As a result, and based on the workload it undergoes after continued use, it generates problems when it has to be replaced, as mentioned above.", "", "Therefore, the invention refers to a bicycle wheel rear hub (1) that also comprises a cylindrical body (2) that surrounds an axle (3) and where at a distal end (2a) it comprises a distal stop (1a) and at a proximal end (2b) a freehub body (4) is attached by means of a connecting mechanism (5), where the freehub body (4) comprises a cylindrical body, a freewheel system (6) within it and a proximal stop (1b) at a proximal end (4b) of the freehub body (4). However, as shown inFIG.2, the body (2) of the rear hub (1) of the invention is characterized in that the connecting mechanism (5) between the body (2) and the freewheel system (6) comprises a connecting crown (7) and an elastic ring (8), which are the key innovative parts of the invention.", "", "On the one hand and preferably, the connecting crown (7) comprises an external crenellated and/or splined surface (7a), an inner radially toothed surface (7b) and a lateral surface (7c). The external crenellated and/or splined surface (7a) and the internal toothed surface (7b) act as a support and link between the body (2) of the hub (1) and the rings (6a,6b) of the freehub body (4) responsible for the effect of the freewheel system (6), ensuring the solidity and firmness necessary for holding the freehub body (4), by means of a sliding adjustment. In other words, the outer surface (7a) and inner surface (7b) require shapes which may be regular or irregular, but which must be complementary to the surfaces with which they are going to be matched. The lateral surface (7c) comprises a circular recess (9) where the elastic ring (8) is attached or seated.", "", "Also, preferably, the crenellated and/or splined outer surface (7a) of the connecting crown (7) is complementary to the inner surface (2c) of the body (2), while the inner radial surface (7b) of the connecting crown (7) is toothed and complementary to the outer surface of the ring (6a) of the freewheel system (6) as seen inFIG.3.", "", "On the other hand, as shown inFIGS.3and4, the elastic ring (8) of the rear hub (1) of the invention comprises a circular flat body with two free ends (8a,8b) so as to be able to expand towards the inner surface (2c) of the body (2) and fit into a groove or channel (2d) in the inner radial surface (2c) of the proximal end (2b) of the body (2) of the hub (1) and block the sliding movement of the connecting crown (7), guaranteeing the absolute immobility of the connecting crown (7) inside the body (2). In addition, the free end (8b) comprises a tab (10) that facilitates the extraction of the elastic ring (8) from the body (2) when it is seated and expanded in the groove (2d) of the inner surface (2c) of the body (2).", "", "Optionally, the freewheel system (6) comprises at least two moving rings (6a,6b) that are laterally toothed and have external splines, facing each other, and at least two springs (6c) on the other side from the toothed surface of the rings (6a,6b), which together with the rotation of the pedals determine the operation of the freewheel system (6). In other words, the first ring (6a) fits externally with the complementary splines of the inner radial surface (7b) of the connecting crown (7) and the second ring (6b) fits laterally with the complementary teeth of the first ring (6a) and externally with the inner surface of the freehub body (4). The teeth of the rings (6a,6b) form a wedge shape, one side being inclined and the other straight. In this way, when pedalling on the bicycle, the sprockets make the freehub body (4) turn and thus turn the rings (6a,6b) of the freewheel system (6), which are facing each other and in contact due to the fact that the springs (6c) are partially extended, exerting pressure on one ring (6a) against the other (6b). Therefore, when the pedals turn in the direction of travel, the teeth mesh, turning the body (2) and with it the bicycle wheel. However, when pedalling is stopped or reversed, the springs (6c) are slightly compressed and the freewheel system (6) disengages releasing and allowing both rings (6a,6b) to slide, since the teeth rotate in the opposite direction allowing the wheel to turn when the pedals are immobile or rotate in the opposite direction to the direction of travel.", "", "Another possible embodiment of the invention is when the freehub body (4) comprises at least one pawl system on an external surface of the distal end (4a) and the connecting crown (7) comprises an inner radially toothed surface (7b) complementary to the pawls of the freehub body (4). Alternatively, in another embodiment, the connecting crown (7) comprises a lateral radially toothed surface (7c) complementary to the outer surface of a ring (6b) of the free wheel system (6), where in this case, the use of one of the toothed rings (6a) is eliminated, being the connecting crown (7) the connecting mechanism (5) and ring (6a) at the same time.", "", "Additionally, as shown in the Figures, the rear hub (1) of the invention comprises wheel bearings (11,12) on the axle (3), where the wheel bearings (11) are those located inside the body (2) and the wheel bearings (12) are those located inside the freehub body (4), allowing and helping them to rotate when necessary.", "", "For all of the above and thanks to the connecting mechanism (5) of the invention, the problem of over-tightening of the threaded connecting part (5a) is solved, facilitating the disassembly and replacement of the necessary parts without the need for tools or special knowledge, thus simplifying and reducing the cost of maintenance work. In addition, it is possible to prolong the life of the hub (1) and therefore of the bicycle wheel."], "claims": ["the connecting mechanism between the body and the freewheel system of the freehub body comprises a connecting crown and an elastic ring, where the connecting crown comprises a lateral surface with a circular groove where the elastic ring is fitted so that it can expand towards the internal surface of the body and fix the connecting crown inside the body.", "2 . Rear bicycle wheel hub, according to claim 1 , where the connecting crown comprises a regular or irregular external surface with crenellations and/or splines, complementary to the inner surface of the body and an inner radial surface complementary to the outer surface of at least one toothed ring of the freewheel system.", "3 . Rear bicycle wheel hub, according to claim 1 , wherein the elastic ring comprises a circular flat body with two free ends where the free end has a tab.", "4 . Rear bicycle wheel hub, according to claim 1 , wherein the body comprises a groove or channel at the proximal end of the inner surface.", "5 . Rear bicycle wheel hub, according to claim 1 , wherein the free wheel system comprises at least two toothed rings laterally facing each other with external teeth or splines complementary to the inner surfaces of the connecting crown and the freehub body.", "6 . Rear bicycle wheel hub, according to claim 1 , wherein the freewheel system comprises at least one pawl system on the outer surface of the distal end of the freehub body.", "7 . Rear bicycle wheel hub, according to claim 6 , wherein the connecting crown comprises a regular or irregular outer surface with crenellations and/or splines, complementary to the inner surface of the body and an inner radial surface complementary to the outer surface of at least one pawl system in the freehub body.", "8 . Rear bicycle wheel hub according to claim 1 , wherein the crenellated and/or splined connecting crown comprises a toothed lateral surface complementary to the outer surface of a ring of the freewheel system.", "9 . Rear bicycle wheel hub, according to claim 1 , wherein the body comprises at least one wheel bearing inside.", "10 . Rear bicycle wheel hub, according to claim 1 , wherein the freehub body comprises at least one wheel bearing inside."], "bibtex": "@patent{20240227440,\n    title = {INTERNAL CONNECTION OF A BICYCLE REAR HUB},\n    number = {20240227440},\n    year = {2024},\n    note = {File: US20240227440A9-20240711.XML}\n    }", "classification": "B60B2702FI"}, {"title": "VEHICLE WHEEL MOUNTING APPARATUS", "doc_number": "20240227441", "filename": "US20240227441A9-20240711.XML", "abstract": "There is provided a vehicle wheel mounting apparatus according to one aspect. The apparatus includes first and second L-shaped members which telescopically couple together and rollers rotatably coupled to the L-shaped members. There is also provided a vehicle wheel mounting apparatus according to another aspect. The apparatus includes a pair of wheel-mounted elongate members, a pair of rollers rotatably coupled to respective said elongate members, and a pair of channels via which the elongate members are telescoping coupled together. Each of the channels is u-shaped in lateral section.", "detailed_description": [""], "claims": ["a pair of wheel-mounted elongate members with respective rollers coupled thereto; and an actuator configured to enable the elongate members to move from a retracted position to an extended position, with the rollers being closer together in the retracted position and more spaced-apart in the extended position, wherein the elongate members are shaped to substantially enclose the actuator along the top and sides thereof and enable the actuator to be accessible via the bottom thereof.", "2 . A vehicle wheel mounting apparatus according to claim 1 , wherein the actuator comprises an elongate threaded member threadably coupled to and extending between the elongate members, with actuation thereof selectively adjusting spacing of the rollers.", "3 . A vehicle wheel mounting apparatus according to claim 1 , wherein the elongate members telescopically couple together, with at least one of the elongate members including a channel with a longitudinally-extending portion and first and second peripheral portions coupling to and extending along sides of the longitudinally-extending portion thereof, with the first peripheral portion extending outwards at an acute angle relative to the longitudinally-extending portion and with the second peripheral portion outwards extending at an acute angle relative to the longitudinally-extending portion.", "4 . A vehicle wheel mounting apparatus according to claim 1 , wherein a longitudinally-extending portion of a first said elongate member is shaped to nest within a longitudinally-extending portion of a second said elongate member.", "5 . A vehicle wheel mounting apparatus according to claim 1 , wherein the rollers are configured to receive therebetween and selectively elevate a vehicle wheel.", "a pair of wheel-mounted elongate members; a pair of rollers rotatably coupled to respective said elongate members; and a pair of channels via which the elongate members are telescoping coupled together, each of the channels being u-shaped in lateral section.", "7 . A vehicle wheel mounting apparatus according to claim 6 , wherein each said elongate member includes a pair of spaced-apart bent portions which form respective said channels.", "8 . A vehicle wheel mounting apparatus according to claim 6 , wherein at least one said channel comprises a longitudinally-extending portion and first and second peripheral portions coupling to and extending along sides of the longitudinally-extending portion thereof, with the first peripheral portion extending at an acute angle relative to the longitudinally-extending portion and with the second peripheral portion extending at an acute angle relative to the longitudinally-extending portion.", "forming a pair of L-shaped blanks; forming a pair of telescoping said channels by bending sides of longitudinally-extending portions of the blanks; and operatively connecting the channels together via a length adjustment mechanism positioned substantially within at least one of the channels, with positioning of the rollers being adjustable thereby.", "10 . A method according to claim 9 , including within the positioning step, coupling an elongate threaded member to a distal end of a first said channel and a proximal end of a second said channel, with actuation thereof selectively adjusting spacing between the rollers.", "11 . A method according to claim 9 , including forming roller mounts by at least bending spaced-apart ends of laterally-extending portions of the blanks; and rotatably coupling rollers to the roller mounts.", "forming the L-shaped blanks using sheet metal; within the forming the pair of L-shaped blanks step, laser cutting sheet metal into L-shapes; and after the forming the L-shaped blanks step, shaping the L-shaped blanks via brake forming.", "first and second L-shaped members which telescopically couple together, the L-shaped members being made of sheet metal; and rollers rotatably coupled to the L-shaped members.", "14 . A vehicle wheel mounting apparatus according to claim 13 , including wherein each said L-shaped member includes a pair of spaced-apart bent portions via which a respective said roller is rotatably coupled thereto.", "15 . A vehicle wheel mounting apparatus according to claim 13 , wherein each said L-shaped member includes a pair of spaced-apart roller mounts integrally coupled thereto so as to form a unitary whole.", "16 . A vehicle wheel mounting apparatus according to claim 13 , wherein at least one of said L-shaped members includes a pair of spaced-apart bent portions to form a channel via which the L-shaped members telescopically couple together.", "17 . A vehicle wheel mounting apparatus according to claim 13 , wherein each said L-shaped member includes a first pair of spaced-apart bent portions via which a respective said roller is rotatably coupled thereto and wherein each said L-shaped member includes a second pair of spaced-apart bent portions which form a channel, with the L-shaped members telescopically coupling together via the channels.", "18 . A vehicle wheel mounting apparatus according to claim 13 , including dolly wheels coupled to the L-shaped members and one or more stiffening members extending along a periphery of the L-shaped members, with each said stiffening member extending between a respective pair of said dolly wheels.", "19 . A vehicle wheel mounting apparatus according to claim 18 , wherein each said stiffening member is outwardly convex in part.", "20 . A vehicle wheel mounting apparatus according to claim 15 , wherein each said L-shaped member is planar and L-shaped along a top thereof."], "bibtex": "@patent{20240227441,\n    title = {VEHICLE WHEEL MOUNTING APPARATUS},\n    number = {20240227441},\n    year = {2024},\n    note = {File: US20240227441A9-20240711.XML}\n    }", "classification": "B60B3002FI"}]