[{"title": "VEHICLE WHEEL WITH REFLECTIVE SURFACE", "doc_number": "20240424828", "filename": "US20240424828A1-20241226.XML", "abstract": "A wheel for a vehicle, the wheel having a mount configured to mount the wheel to a hub of the vehicle; a colored substrate; and a contoured reflective surface that is contoured to reflect coloring of the colored substrate out of the wheel, thereby appearing to alter coloring of the reflective surface.", "detailed_description": ["The present invention adopts a new technical approach for wheel modification. In particular, the invention uses reflective surfaces in new ways to selectively reflect features to alter the visible characteristics of the wheel. Moreover, the technical approach permits the substitution of different features or coloring for further customization.", "", "Referring now to the drawings, which are shown for purposes of illustrating embodiments of the present invention only and not for the purposes of limiting the same,FIGS.1A-1Eare pictorial diagrams showing several views of an exemplary embodiment of a vehicle wheel100in accordance with one or more embodiments of the present disclosure. In one or more embodiments, wheel100includes a mount102, a rim110, one or more colored substrates104, and a base150(e.g. a wheel disc). In one or more embodiments, base150includes one or more contoured reflective surfaces106. In one or more embodiments, rim110includes an inner lip136and an outer lip138. Outer lip138faces an outside environment5(shown inFIG.1C), and inner lip136is positioned opposite of outer lip138on rim110so that inner lip136faces an undercarriage of a vehicle (e.g., undercarriage of vehicle9shown inFIG.2C) when wheel100is mounted on the vehicle. In one or more embodiments, wheel100may also include a hubcap108, which covers at least a portion of mount102to at least prevent dirt and moisture from accumulating on and damaging mount102. In one or more embodiments, wheel100may also include a cavity114. Cavity114may be defined by at least base106and/or rim110. For example, cavity114may be a toroid space defined by reflective surface106of base150, mount102, and outer lip138of rim110.", "", "In one or more embodiments, wheel100has a central axis A. When wheel100is mounted to a vehicle (e.g., vehicle9shown inFIG.2C), wheel100may be rotatable about central axis A. In one or more embodiments, rim110is symmetric about central axis A and may be concentric to mount102so that mount102and rim110share central axis A.", "", "In one or more embodiments, base150may be defined by rim110. Mount102may be configured to attach to base150so that reflective surface106of base150is disposed between mount102and rim110. In one or more embodiments, reflective surface106may be position adjacent to colored substrate104, which may be secured to mount102as discussed further herein. Colored substrate104may be hidden from an outside environment (e.g., an environment outside of cavity114). Preferably, colored substrate104is hidden from direct view in that the ordinary viewer looking towards the wheel100, in particular, in a direction that is perpendicular to the direction the mounted wheel travels, only views reflected color and not the colored substrate104itself. In one or more embodiments, colored substrate104includes one or more colored surface, such as colored surface152. In other embodiments, colored substrate104may include a plurality of colored surfaces, such as colored surfaces152a-d(shown inFIG.2B), that are each a different color and may be arranged in any orientation relative to each other.", "", "FIG.1Bis a front plan view of wheel100in accordance with one or more embodiments of the present disclosure. As shown inFIG.1B, colored substrate104and corresponding colored surface152(shown inFIG.1A) may be hidden and, thus, not directly visible to external environment5(shown inFIG.1C) outside of cavity114. That is, the colored surface152is hidden from direct view, especially when viewing at an angle that is perpendicular to the direction that the wheel100rolls. In some embodiments, the colored substrate104is angled inward to further hide its viewing.", "", "In one or more embodiments, colored surface152may be any desired color. For example, colored surface152of colored substrate104(shown inFIG.1A) may be the color blue. In one or more embodiments, light from colored surface152may reflect from reflective surface106and traverse through cavity114to an outside environment5(shown inFIG.1C) so that reflective surface106appears to be the desired color of colored surface152of colored substrate104to an observer in the outside environment. For example, reflective surface106has a blue wave-like coloration to an observer positioned in outside environment5.", "", "FIG.1Cis a cross-sectional side plan view of wheel100taken along line1C-1C ofFIG.1Bin accordance with one or more embodiments of the present disclosure. In one or more embodiments, mount102is configured to mount wheel100to a hub of a vehicle (e.g., an automobile or a motorcycle). In one or more embodiments, mount102may extend from reflective surface106along axis A for a length.", "", "In one or more embodiments, a reflected ray of light from colored surface152(e.g., reflected color10) may reflect from reflective surface106. For example, an incident ray from hidden colored surface104strikes reflective surface106and then the reflected ray reflects from reflected surface106into outside environment5where an observer can see the reflected color10. In one or more embodiments, reflective surface106is concave or parabolic, so that reflected ray10reflects outside of cavity114and into outside environment5without colored surface152being visible to outside environment5.", "", "Selective display of colored surface152may be performed by determining the spatial positioning of reflective surface106and positioning or angling of desired colored surface152such that an optical path vector intersects the desired portion of colored surface152. Such calculations may involve determining the angle or position of reflective surface106and the corresponding relation to the position of colored surface152as well as the desired optical path. Once determined, angling colored surface152may involve positioning colored substrate104on wheel100until the desired reflection (e.g., reflected color10) occurs or such that the angle of incidence equals the angle of reflection. In one or more embodiments, colored substrate104may be positioned relative to reflective surface106so that the optical path vector of, for example, reflected color10, exits cavity114relatively perpendicular to central axis A. While the above discusses proper positioning of the reflective surface106and/or colored surface152, it should be appreciated that the reflective surface106itself may include a plurality of surface modifications angled in such a way as to selectively display the final desired coloring.", "", "FIG.1Dshows an exploded perspective view of wheel100in accordance with one or more embodiments of the present disclosure. Wheel100includes rim110, colored substrate104, base150with reflective surface106, mount102and hubcap108. In one or more embodiments, mount102may be a monolithic structure or may have numerous components (e.g., disk122and post120). For example, mount102may include disk122, post120, and one or more bolts116. Bolts116may traverse through holes118of disk122and holes124in base150(shown inFIG.1E) to secure wheel100to a vehicle. Bolts116and holes118may be covered with hubcap108for aesthetic purposes or for protective purposes (e.g., to prevent moisture and dirt from damaging mount102).", "", "In one or more embodiments, colored substrate104may be configured for removable attachment to wheel100(e.g., colored substrates104are interchangeable). For example, colored substrate104may be interchangeably coupled to mount102. Colored substrate104is hidden from the view of outside environment5when wheel100is mounted to a vehicle. In one or more embodiments, colored substrate104may be any shape, size, color, or texture as understood by one skilled in the art. For example, colored surface152of colored substrate104may be smooth. In other examples, colored substrate104may be rippled, dimpled, etched, engraved, undulated, corrugated, fluted, hammered, grated, diveted, checkered, stepped, or any combinations thereof. As shown in the exemplary embodiment ofFIG.1D, colored surface104may be the shape of a conical frustum that wraps about mount102.", "", "A method of changing wheel colors on an automobile (e.g., vehicle9) may include: providing wheel100mounted to the hub of the automobile, wheel100configured to interchangeably accept a plurality of different colored substrates104having a plurality of different colored surfaces152; and interchanging one colored substrate104for another colored substrate104within wheel100.", "", "In one or more embodiments, colored substrate104may be made from paint, enamel, stone, resin, colored lights (e.g., light emitting diodes (LEDs)), or other color treatments. In one or more embodiments, colored substrate104may be mounted on mount102, base150, spokes (e.g., spokes428,430ofFIGS.4A-H), rim110, or any other location that allows colored substrate104to be hidden from outside environment5.", "", "As understood by one skilled in the art, reflective surface106may be any shape, size, or texture. For example, reflective surface106of wheel100may include a generally paraboloid reflective surface that is symmetric about central axis A. In one or more embodiments, reflective surface106may be a shape or size that is complementary to the shape and size of colored substrate104so that colored substrate104may be hidden while reflective surface106displays the one or more colors of colored surface152to outside environment5. In one or more embodiments, contoured reflective surface106is optically aligned to reflect colored surface104into view of an outside environment5when wheel100is mounted to a vehicle, thereby appearing to alter a color of reflective surface106. In one or more embodiments, base150may include a single reflective surface106(as shown inFIGS.1A-1E). In other embodiments, base150may include a plurality of reflective surfaces106, as discussed further herein. In one or more embodiments, reflective surface106may be made from any material suitable for use with a vehicle (e.g., steel, aluminum, or any other strong and reflective material).", "", "InFIGS.1A-1E, the reflective surface106is shown as being dimpled; however, as it may be understood by one skilled in the art, reflective surface106may have one or more various surface textures. Reflective surface106may include a plurality of surface features, each independently selected from the group consisting of engraved, undulated, corrugated, hammered, grated, diveted, dimpled, checkered, and stepped. The surface features may include different angles over the reflective surface106to reflect different colors or improved optical alignment. In one or more embodiments, reflective surface106of base150may be coated with a non-reflective coating to prevent reflection in certain areas of reflective surface106to create a design within reflective surfaces106.", "", "FIG.1Eshows a rear plan view of wheel100in accordance within one or more embodiments of the present disclosure. In one or more embodiments, mount102may adjoin base150. In one or more embodiments, mount102may traverse through base150. For example, post120and screws116may traverse through base150via openings124so that mount102may secure to a vehicle.", "", "In one or more embodiments, wheel100may be a monolithic structure made, for example, from a mold. In other embodiments, wheel100may include various separate components that are assembled together. In one or more embodiments, colored surface152includes a plurality of different colored surfaces. In one or more embodiments, colored surface152may be positioned underneath mount102or form part of an inward facing surface (e.g., surface facing a cavity of wheel100, such as cavity114) of mount102.", "", "FIGS.2A and2Bare pictorial diagrams showing a front plan view of another exemplary embodiment of the wheel, a wheel200, in accordance with one or more embodiments of the present disclosure. In one or more embodiments, wheel200includes a mount202, a colored substrate204with one or more colored surfaces152a-d, a base250, a hub cap208, and a rim210. Base250of wheel200includes a paraboloidal reflective surface206that is smooth, polished, and symmetric about a central axis B.", "", "InFIGS.2A and2B, colored substrate204is wrapped about mount202(e.g., mount102traverses through colored substrate204). As shown inFIG.2A, colored substrate204may be a solid color. For example, colored substrate may have only one colored surface152a, providing a first reflected color10a. As shown inFIG.2B, colored substrate204may have a plurality of colored surfaces152a-d, providing a first reflected color10a, a second reflected color10b, a third reflected color10c, and a fourth reflected color10d, respectively. For example, light reflects off of first colored surface152aand onto reflective surface206, so that the portion of surface206that reflected color10areflects off of appears to be the same color as colored surface152afrom outside environment5. Similarly, light reflected off of second colored surface152b, third colored surface152c, and fourth colored surface152deach reflect onto selective portions of reflective surface206so that base250displays bands of color.", "", "In one or more embodiments, colored substrate204may be interchangeable. For example, solid-colored substrate204ofFIG.2Amay be interchanged for multicolored colored substrate204ofFIG.2B.", "", "As understood by one skilled in the art, two or more colored surfaces (e.g., colored surfaces152a-d) of a multicolored substrate (e.g., colored substrate204) may be placed in any arrangement (e.g., design or pattern). For example, colored substrate204may be spotted, striped, checkered, marbled, or any other design or arrangement of colored surfaces152a-d. Though four different colored surfaces are discussed herein, as understood by one skilled in the art, any quantity of different colored surfaces may be used.", "", "FIG.2Cshows an exemplary use of wheel200in accordance with one or more embodiments of the present disclosure. Wheel200may have a tire7mounted to rim210. Wheel200may then be mounted to vehicle9(e.g., automobile) so that outer lip238of rim210faces outside environment5. Though the exemplary use is shown with wheel200, any of the exemplary embodiments of the wheel discussed herein may be used for the same exemplary use, as understood by one skilled in the art.", "", "The following figures show exemplary embodiments of the wheel, where the wheel may also include a structural support or lid, but is still configured to mount on vehicle9.", "", "FIGS.3A-3Eare pictorial diagrams showing several views of another exemplary embodiment of the wheel, a wheel300, in accordance with one or more embodiments of the present disclosure.FIG.3Ashows a perspective view of wheel300in accordance with one or more embodiments of the present disclosure. In one or more embodiments, wheel300may include a plurality of colored substrates304a,b,c, that each have at least one corresponding colored surfaces (e.g., colored surfaces352a,b,c). Wheel300may also include a contoured base350that includes a plurality of reflective surfaces306a,b,c.", "", "In one or more embodiments, reflective surfaces306a,b,cmay each be curved, concave surfaces and may extend along the side of a longitudinal extent of a spoke. In one or more embodiments, reflective surfaces306a,b,cmay radially extend from mount302to rim310(e.g., outer lip338of rim310) along an arcuate path to create ridges326a,b,c(e.g., spokes). For example, reflective surfaces306a,b,cmay each spiral outward from mount302and about central axis C to create sloped surfaces. In one or more embodiments, colored surfaces304a,b,cmay each define a cavity314a,314b, and314c, respectively, (shown inFIG.3B) with reflective surfaces306a,b,c,respectively. Here, one side of a spoke has a colored surface304a,b,calong one side of the longitudinal extent and a reflective surface306a,b,calong the other longitudinal extent so that at least one and preferably all spokes will reflect coloring from a neighboring spoke.", "", "In one or more embodiments, colored substrates304a,b,cmay be removably attached to base350(e.g., at ridges326a,b,c). For example, colored substrates304a,b,cmay each be secured to base350so that colored surfaces352a,b,care each optically aligned with corresponding reflective surfaces306a,b,c, respectively, to reflect colored surfaces352a,b,cinto view of outside environment5. In one or more embodiments, each colored surface352a,b,cmay be parallel to central axis C of wheel300so that colored surfaces304a,b,care hidden from outside environment5. In other embodiments, colored surfaces352a,b,cmay be angled relative to central axis C.", "", "FIG.3Bshows a cross-sectional perspective view of wheel300taken along line3B-3B ofFIG.3Ain accordance with one or more embodiments of the present disclosure. A reflection (e.g., first colored reflections10a) of each colored surface352a,b,cmay reflect off the corresponding adjacent or neighboring reflective surface306a,b,c, respectively. For example, an incident ray from colored surface352amay traverse through cavity314aand reflect off of reflective surface306ato create a reflection of a first color10athat is visible to outside environment5. As a result, reflective surface306awill appear to be the same color as colored surface352ato an observer in outside environment5.", "", "Accordingly, in some embodiments, colored surfaces352a,b,ccan be affixed along the longitudinal extent of one or more radially extending or spiral spoke and reflective surfaces306a,b,ccan be paraboloidal surfaces forming part of a neighboring spoke that faces the colored surfaces352a,b,cfor reflection. Thus, a plurality of spokes may each have one lateral side along its longitudinal extent that provides the colored surface352a,b,cand an opposing lateral side along its longitudinal extent that provides a reflective surface306a,b,cto reflect coloring from a neighboring spoke.", "", "FIG.3Cshows a front plan view of wheel300in accordance with one or more embodiments of the present disclosure. Each reflected surface306a,b,cmay reflect a reflected color10aso that wheel300appears to be colored. For example, wheel300may appear to be variations the color of the solid-colored colored surfaces352a,b,c. In other embodiments, colored surfaces352a,b,cmay be different colors relative to each other.", "", "FIG.3Dshows a rear plan view of wheel300in accordance with one or more embodiments of the present disclosure. In one or more embodiments, the rear of wheel300(e.g., underside of base350and facing inner lip336of rim310) will face the undercarriage of vehicle9when mounted thereto.", "", "FIG.3Eshows a side plan view of wheel300in accordance with one or more", "", "embodiments of the present disclosure. In one or more embodiments, a tire (e.g., tire7) may be mounted on rim310between inner lip336and outer lip338.", "", "FIGS.4A-4Hare pictorial diagrams showing several views of another exemplary embodiment of the wheel, wheel400, in accordance with one or more embodiments of the present disclosure.", "", "FIGS.4A-4Dshow several views of wheel400in accordance with one or more embodiments of the present disclosure. In one or more embodiments, wheel400includes a mount402, a base450having a plurality of reflective surfaces406, one or more colored substrates404with one or more colored surfaces452, a rim410having an inner lip436and an outer lip438, and a support structure456.", "", "In one or more embodiments, mount402includes holes418, which may receive hardware or fasteners (e.g., bolts116or threaded posts of a vehicle hub that are compatible with lug nuts) to secure wheel400to vehicle9(shown inFIG.2C). In one or more embodiments, mount402may be a separate component or mount402may be an integrated component of support structure456. In one or more embodiments, support structure456may include a plurality of integrated spokes (e.g., flared spokes428and/or straight spokes430) that radially extend from mount402to rim410(e.g., outer lip438). In one or more embodiments, reflective surfaces406are visible to outside environment5through apertures426(shown inFIG.4G), which are between spokes428and430.", "", "As shown inFIG.4C, a rear view of wheel400, base450may reside behind (e.g., closer to inner lip436and farther from outer lip438) spokes428and430. In one or more embodiments, reflective surfaces406may be individual components that can be stacked and/or staggered, or reflective surfaces406may be a monolithic component with a plurality of reflective surfaces (as shown inFIGS.4A-H). In an exemplary embodiment, reflective surfaces406may each be a Reuleaux triangle shape and centrally joined, as shown inFIGS.4A-4H. In other exemplary embodiments, reflective surfaces406may each be a vesical piscis shape. In other embodiments, each reflective surface406may be any shape or size that allows colored surfaces452to be optically aligned with corresponding reflective surfaces406.", "", "FIGS.4E and4Fare pictorial diagrams showing partial cross-sectional views of wheel400taken along line4E-4E ofFIG.4Bin accordance with one or more embodiments of the present disclosure. In one or more embodiments, colored substrates404may be secured to an underside (e.g., rear) of support structure456so that colored surfaces452are hidden from outside environment5and disposed within cavity414, which is defined by base450, mount412, rim410, and support structure456. In one or more embodiments, straight spokes430may each have a colored substrate404secured to an underside of each spoke430(e.g., facing corresponding reflective surface406). In other embodiments, flare spokes428and straight spokes430may each have colored surfaces404disposed on the undersides.", "", "FIGS.4G and4Hare pictorial diagrams showing an exploded perspective view and a partial cross-sectional perspective view of wheel400, respectively, in accordance with one or more embodiments of the present disclosure. In one or more embodiments, each reflective surface406may be optically aligned with a corresponding colored surface404. For example, colored substrates404may be mounted to the underside of each straight spoke430. Each reflective surface406may be positioned centrally behind a straight spoke430so that each colored surface452is optically aligned with a corresponding reflective surface406. Each reflective surface406may be visible through one or more apertures426of support structure456. Gaps424of base450may be positioned behind flared spokes428so that gaps are not visible to outside environment5. In one or more embodiments, gaps424of base450may be the same shape as flared spokes428so that gaps424are hidden from the outside environment5.", "", "In one or more embodiments, mount402may be a geometric shape that traverses through a complementary opening434of base450. In one or more embodiments, mount402may be a polygonal shape that engages the complementary surfaces of opening434and prevents base450from rotating freely relative to rim410. In one or more embodiments, reflective surfaces406may be fixed to mount402or rim410. In other embodiments, reflective surfaces406may freely rotate about central axis D, separately from mount402or rim410.", "", "One skilled in the art will recognize that the structural shape and configuration of base450may vary widely and may incorporate planar, concave, or convex surfaces and the like. Reflective surfaces406are configured to selectively reflect one or more colors from colored surfaces452. In one or more embodiments, each of reflective surfaces406may be angled relative to corresponding colored surface452to provide an optimally visible reflection to outside environment5. In other embodiments, when using one or more colored surfaces452, each reflective surface406may be configured to be independently angled to selectively reflect and display only a single color from a colored surface having two or more colored regions of different colors.", "", "As understood by one skilled in the art, though spokes428,430are shown as flared and straight, respectively, each spoke may be any shape or dimension. Furthermore, any quantity of spokes may be used with wheel400, as shown in exemplary embodiments discussed further herein.", "", "FIG.5is a pictorial diagram showing a front plan view of an exemplary embodiment of the wheel, wheel500, in accordance with one or more embodiments of the present disclosure. In one or more embodiments, wheel100may include a rim510, a base550with a reflective surface506, a mount502, and a support structure556that includes spokes530. In one or more embodiments, wheel500may have a colored substrate504that includes LEDs, which illuminate at least of portion of reflective surface506with at least one colored light. As shown in exemplaryFIG.5, reflective surface506may be corrugated and positioned behind straight spokes530.", "", "FIG.6is a pictorial diagram showing a front plan view of an exemplary embodiment of the wheel, wheel600, in accordance with one or more embodiments of the present disclosure. Wheel600includes a rim610, a mount602, a base650with a plurality of reflective surfaces606, and a support structure656that includes straight spokes630. In one or more embodiments, base650may include a plurality of reflective surface606that are positioned behind spokes630. Colored surfaces652of colored substrates604may be mounted on the underside of spokes630or along an inner surface of rim610. In one or more embodiments, spokes630may define apertures626, and reflective surfaces606may be visible through apertures626.", "", "FIGS.7A and7Bare pictorial diagrams showing front plan views of exemplary embodiments of the wheel, a wheel700, in accordance with one or more embodiments. Wheel700may include rim710, mount702, base750, and support structure756. Wheel700is shown with a tire7mounted on rim710. Spokes730may be slightly skewed and radially extend from mount702. As shown inFIG.7A, wheel700may have a base750that includes a polished reflective surface that is “O”-shaped (e.g. ring about an inner circumference of rim710).", "", "As shown inFIG.7B, wheel700may instead have a base750that includes a first layer of reflective surfaces706aand a second layer of reflective surfaces706b. In one or more embodiments, only one of the layers of reflective surfaces706a,bmay be colored by a colored substrate (not shown). In other embodiments, both layers of reflective surfaces706a,bmay reflect colored surfaces to display one or more colors. For example, a first colored substrate may be secured to the rear of spokes730to color first layer of reflective surface706a, and a second colored substrate may be secured to the rear of the first layer of reflective surface706ato color second layer of reflective surface706b. In another example, the colored layers may be placed at various depths along rim710(e.g., between the inner lip and outer lip) to color each layer of reflective surfaces706a,b.", "", "FIGS.8A and8Bare pictorial diagrams of other exemplary embodiments of the wheel, a wheel800, in accordance with one or more embodiments of the present disclosure. In one or more embodiments, spokes830may include reflective surfaces806and colored substrates804, which reflect off reflective surfaces806of spokes830to display a reflected color. In one or more embodiments, a base with additional reflective surfaces may be positioned behind spokes830(not shown).", "", "FIG.9is a pictorial diagram of an exemplary embodiment of the wheel, wheel900, in accordance with one or more embodiments of the present disclosure. Wheel900may include spokes930. In one or more embodiments, apertures926are disposed between spokes930, and reflective surfaces906of base950are visible through apertures926. In one or more embodiments, a second set of spokes may be positioned under a first set of spokes (not shown).", "", "FIG.10is a pictorial diagram showing a front plan view of another exemplary embodiment of the wheel, wheel1000, in accordance with one or more embodiments of the present disclosure. Wheel1000may include a rim1010, a base1050with one or more reflective surfaces1006, one or more colored substrates with one or more colored surfaces (not shown), and a mount802. In one or more embodiments, wheel1000may also include an ornamental lid1060(e.g., wheel cover). Lid1060may include one or more apertures1062and may be configured to removably couple to mount1002. For example, hubcap1008may secure lid1060to mount1002. In one or more embodiments, lid1060at least partially encloses cavity1014. Reflective surfaces1006are visible to the external environment through the one or more apertures1062of lid1060. In one or more embodiments, lid1060is configured to rotate freely about central axis X and relative to rim1010. In other embodiments, lid1060is fixed relative to rim1010.", "", "In one or more embodiments, lid1060may have one or more spokes1030that define apertures1062. For example, lid1060may include ribbed spiral spokes1030with apertures1062disposed on either side of each spoke1030. Lid1060may be a removable component secured to wheel1000using hubcap1008of mount1002or by securing lid1060to rim1010(e.g., outer lip1038).", "", "In one or more embodiments, lid1060may be configured to interchangeably accept a plurality of different colored substrates, thereby providing a plurality of different colors for reflection. In one or more embodiments, lid1060is configured to be removably attached to wheel1000.", "", "FIGS.11A-11Gare pictorial diagrams showing several front plan views of exemplary embodiments of lids1060of wheel1000in accordance with one or more embodiments of the present disclosure. Lid1060may include one or more apertures1062(e.g., cutaways) through which reflective surface1006may be viewed by an observer in the outside environment. As understood by one skilled in the art, lid1060and apertures1062may be any shape, size, or design, as shown inFIGS.11A-11G.", "", "As shown inFIGS.11F and11G, lid1060may also include reflective surfaces, such as recessed reflective surfaces1064, disposed on the outer surface of lid1060so that the reflective surfaces1064are visible to an outside environment. Colored substrates (not shown) may be disposed within or near reflective surfaces1064so that reflective surfaces1064may display the reflection of the colored surfaces of the colored substrates.", "", "FIG.12is a pictorial diagram showing a front plan view of an exemplary view of the wheel, a wheel1200, in accordance with one or more embodiments of the present disclosure. Outer lip1238of rim2010may extend inward toward mount1202. In one or more embodiments, outer lip1238may be various ornamental designs (e.g., scalloped, bezeled, or other edging techniques).", "", "In one or more embodiments, base1250may include layers of reflective surfaces. For example, base1250may include a first layer of reflective surfaces1206aand a second layer of reflective surfaces1206b. First layer of reflective surfaces1206amay be behind outer lip1238and in front of second layer of reflective surfaces1206b. Second layer of reflective surfaces1206bmay be between first layer of reflective surfaces1206aand inner lip1236of rim1210.", "", "In one or more embodiments, layers of reflective surfaces1206a,bmay be any shape or size. In one or more embodiments, layers of reflective surfaces1206a,bmay include cutaways (e.g., apertures1226). For example, first layer of reflective surfaces1206amay provide apertures1226so that second layer of reflective surfaces1206bis visible to outside environment5through apertures1226. First layer of reflective surfaces1206amay display a different reflected color than second layer of reflective surfaces1206b. As understood by one skilled in the art, the quantity of layers of reflective surfaces is not limited to two layers.", "", "The disclosure is not intended to limit the present invention to the precise forms or particular fields of use disclosed. It is contemplated that various alternate embodiments and/or modifications to the present invention, whether explicitly described or implied herein, are possible in light of the disclosure. For example, it is contemplated that the various embodiments set forth herein may be combined together and/or separated into additional embodiments where appropriate. Where applicable, the ordering of various steps described herein can be changed, combined into composite steps, and/or separated into sub-steps to provide features described herein.", "", "Although the invention has been described with reference to the above example, it will be understood that modifications and variations are encompassed within the spirit and scope of the invention. Accordingly, the invention is limited only by the following claims."], "claims": ["a. a mount configured to mount the wheel to a hub of the vehicle; b. a colored substrate; and c. a contoured reflective surface that is contoured to reflect coloring of the colored substrate out of the wheel, thereby appearing to alter coloring of the reflective surface.", "2 . The wheel of claim 1 , wherein the wheel comprises spokes, wherein the colored surface is affixed to at least one of the spokes.", "3 . The wheel of claim 2 , wherein the colored surface is affixed to an underside of the at least one spoke or along a lateral side of a longitudinal extent of the at least one spoke.", "4 . The wheel of claim 3 , wherein the colored surface is affixed to the underside of the at least one spoke and the reflective surface is a paraboloidal reflective surface positioned under the at least one spoke.", "5 . The wheel of claim 3 , wherein the colored surface is affixed along the longitudinal extent of the at least one spoke and the reflective surface is a paraboloidal reflective surface forming part of a neighboring spoke.", "6 . The wheel of claim 1 , further comprising at least two sets of spokes, wherein a first set of spokes is positioned over a second set of spokes, wherein the contoured reflective surface comprises a set of contoured surfaces positioned on the second set of spokes and the colored surface comprises a set of colored surfaces affixed to an underside of the first set of spokes, thereby optically reflecting the set of colored surfaces via the second set of spokes.", "7 . The wheel of claim 1 , further comprising a lid that covers the mount and the colored surface is affixed underneath and to the lid.", "8 . The wheel of claim 7 , wherein the lid is configured to interchangeably accept a plurality of different colored substrates, thereby providing a plurality of different colors for refection.", "9 . The wheel of claim 1 , where the reflective surface comprises a plurality of surface features, each independently selected from the group consisting of engraved, undulated, corrugated, hammered, grated, diveted, dimpled, checkered, and stepped.", "10 . The wheel of claim 1 , wherein the wheel is a monolithic structure.", "a. providing the wheel of b. interchanging one colored substrate for another within the wheel."], "bibtex": "@patent{20240424828,\n    title = {VEHICLE WHEEL WITH REFLECTIVE SURFACE},\n    number = {20240424828},\n    year = {2024},\n    note = {File: US20240424828A1-20241226.XML}\n    }", "classification": "B60B310FI"}, {"title": "Hub Embellisher Fixing Device", "doc_number": "20240424829", "filename": "US20240424829A1-20241226.XML", "abstract": "A hub embellisher fixing device comprises two clamp feet arranged opposite to each other on the back of the embellisher body and a metal clip, fixed on the embellisher body through a fixed base; each of the two clamp feet comprises a standing plate and a clamp station located at the upper position on the inner side of the standing plate; the fixed base has slots on both sides; the metal clip is consisting of a connecting part and two support parts located at both ends of the connecting part; the connecting part is formed by two connecting steel wires, and the end parts of the two connecting steel wires are bent upward and connected to form the two support parts in contact with the outer side of the clamp feet, and the two connecting steel wires are located on both sides of the fixed base and within the slots.", "detailed_description": ["The following further explains this utility model in conjunction with the drawings.", "", "As shown inFIGS.1and2, a hub embellisher comprises a plastic body4and a fixing device located on the back of the plastic body4. The plastic body4is fixed on the spoke of the hub through the fixing device. The fixing device comprises two clamp feet1arranged opposite to each other on the back of the embellisher body and a metal clip2for supporting the clamp feet1. The two clamp feet1are fixed on the plastic body4through a fixed base3. The plastic body4, the two clamp feet1and fixed base3are integrally injection-moulded. Each of the two clamp feet1comprise a standing plate11and a clamp station12located at the upper position on the inner side of the standing plate11. After the clamping assembly, the two clamp feet1are located on both sides of the spoke, fixed by the clamping force of the two clamp feet1, and the setting of the clamp station12provides better anti-detachment. The fixed base3comprises a rectangular plate31connecting the bases of the two clamp feet1, several transverse support plates33parallelly set at the bottom of the rectangular plate31, and longitudinal support plates34located at the ends of the transverse support plates33. The rectangular plate31is positioned between the two clamp feet1, the bottom of the rectangular plate31is connected to the plastic body4through the transverse support plates33, and the transverse support plates33are perpendicular to the longitudinal support plates34, ensuring high structural strength of the entire fixed base3with minimal deformation. The two sides of the rectangular plate31have slots32, and the slots32are formed by notches on both sides of the transverse support plates33. The two sides of the rectangular plate31in the length direction have guide rails35with guiding slopes, and the slots32are located below the guide rails35. the metal clip2are formed by bending and welding steel wires, and the metal clip2comprise a connecting part21and support parts22located at both ends of the connecting part21. The connecting part21is formed by two connecting steel wires, and the end parts of the two connecting steel wires are bent upward and connected to form the two support parts22. The support parts22are in contact with the outer side of the clamp feet1, and the two connecting steel wires are located on both sides of the fixed base3and within the slots32. During installation, the metal clip2are inserted from above into the two clamp feet1. When the metal clip2move to the position of the fixed base3, the two connecting steel wires are guided into the slots32through the guide rails, completing the installation.", "", "The principle of this utility model is to fix the embellisher on the hub spoke by clamping with two oppositely arranged clamp feet1, avoiding the need to drill holes in the hub surface, especially for aluminium alloy hubs. the metal clip2support the clamp feet1, ensuring stability and preventing the embellisher from detaching. the metal clip2are formed by bending and welding steel wires, providing a simple structure and manufacturing process."], "claims": ["two clamp feet arranged opposite to each other on the back of the embellisher body and a metal clip for supporting the clamp feet; the two clamp feet being fixed on the embellisher body through a fixed base; the embellisher body, the two clamp feet and the fixed base being integrally injection-moulded; each of the two clamp feet comprises a standing plate and a clamp station located at the upper position on the inner side of the standing plate; the fixed base has slots on both sides; the metal clip is formed by bending and welding steel wires, consisting of a connecting part and two support parts located at both ends of the connecting part; the connecting part is formed by two connecting steel wires, and the end parts of the two connecting steel wires are bent upward and connected to form the two support parts; the two support parts are in contact with the outer side of the clamp feet, and the two connecting steel wires are located on both sides of the fixed base and within the slots.", "2 . The hub embellisher fixing device according to claim 1 , wherein the fixed base comprises a rectangular plate connecting the bases of the two clamp feet, several transverse support plates parallelly set at the bottom of the rectangular plate, and longitudinal support plates located at the ends of the transverse support plates.", "3 . The hub embellisher fixing device according to claim 2 , wherein the two sides of the rectangular plate are equipped with guide rails, and the guide rails have guiding slopes, with the slots located below the guide rails."], "bibtex": "@patent{20240424829,\n    title = {Hub Embellisher Fixing Device},\n    number = {20240424829},\n    year = {2024},\n    note = {File: US20240424829A1-20241226.XML}\n    }", "classification": "B60B706FI"}, {"title": "PRESSURE-SENSITIVE ADHESIVE SHEET FOR BICYCLE RIM", "doc_number": "20240424830", "filename": "US20240424830A1-20241226.XML", "abstract": "Provided is a bicycle rim pressure-sensitive adhesive (PSA) tape having good workability. The bicycle rim PSA tape is a pressure sensitive adhesive sheet used for sealing a spoke hole in a bicycle rim; includes a support substrate, and a PSA layer on one surface of the support substrate; has a peel strength of 2 N/20 mm or more, as attached onto an aluminum plate as an adherend for 10 seconds and then measured under conditions at a tensile rate of 300 mm/min and a peel angle of 180°, under a temperature condition of 0° C.; and has a shear adhesive strength of 200 N/400 mm 2 or more, as measured with employing an aluminum plate as an adherend under a temperature condition of 0° C.", "detailed_description": [""], "claims": ["a support substrate, and a pressure sensitive adhesive layer on one surface of the support substrate; wherein the peel strength of the pressure sensitive adhesive sheet is 2 N/20 mm or more, as attached onto an aluminum plate as an adherend and then, 10 seconds after the attachment, measured under conditions at a tensile rate of 300 mm/min and a peel angle of 180°, under a temperature condition of 0° C.; and wherein the shear adhesive strength of the pressure sensitive adhesive sheet is 200 N/400 mm", "2 . The pressure sensitive adhesive sheet according to claim 1 , wherein the pressure sensitive adhesive layer has a storage modulus of 1.0×10 5 to 1.0×10 6 Pa at 0° C.", "3 . The pressure sensitive adhesive sheet according to claim 1 , wherein the pressure sensitive adhesive layer is an acrylic pressure sensitive adhesive layer comprising an acrylic polymer.", "4 . The pressure sensitive adhesive sheet according to claim 1 , wherein the thickness of the pressure sensitive adhesive layer is 30 μm or more to 75 μm or less.", "5 . The pressure sensitive adhesive sheet according to claim 1 , wherein the support substrate is a resin film substrate.", "6 . The pressure sensitive adhesive sheet according to claim 1 , wherein the support substrate includes a polyester film as a base film.", "7 . The pressure sensitive adhesive sheet according to claim 6 , wherein the support substrate further includes a colored layer on a surface of the base film facing the pressure sensitive adhesive layer.", "8 . The pressure sensitive adhesive sheet according to claim 1 , wherein the thickness of the support substrate is 60 μm or more to 100 μm or less.", "9 . The pressure sensitive adhesive sheet according to claim 1 , used for sealing a spoke hole in a bicycle rim for a tubeless tire."], "bibtex": "@patent{20240424830,\n    title = {PRESSURE-SENSITIVE ADHESIVE SHEET FOR BICYCLE RIM},\n    number = {20240424830},\n    year = {2024},\n    note = {File: US20240424830A1-20241226.XML}\n    }", "classification": "B60B2112FI"}, {"title": "Wheel Assembly", "doc_number": "20240424831", "filename": "US20240424831A1-20241226.XML", "abstract": "A wheel assembly comprising a wheel that is rotatable about a shaft. The wheel is supported by a plurality of connecting members to rotate about a plurality of motors that are arranged on the shaft. The plurality of motors are operable to control the connecting members so as to adjustably shift a central axis through the wheel relative to a central axis through the shaft. The wheel assembly may thus be used to dynamically adjust a position of the wheel axis relative to the central axis of the motors.", "detailed_description": ["Referring to the drawings, there is illustrated an embodiment of a wheel assembly100. As would be appreciated by one skilled in the technical field, the wheel assembly100can be incorporated into a vehicle or any power-driven wheeled device, such as a motorised wheelchair. Where like reference numerals are used in the following description, the features are considered to be the same unless specified as being otherwise.", "", "Referring toFIGS.1to4, the wheel assembly100is formed as a pivotable hub that comprises a wheel10that is rotatable about a wheel shaft12. Being a hub, the wheel assembly100does not utilise components that are commonly associated with conventional vehicles including transmissions, constant velocity joints, differentials or a drive shaft which spans across the width of the vehicle. The wheel assembly100is instead driven by a plurality of motors20,20′,20″ that are arranged concentrically on a shaft12that is itself a component of the individual wheel assembly100. The plurality of motors20,20′,20″ are arranged on the shaft12such that they locate within the boundaries of the wheel, thereby defining an in-wheel motor arrangement. In some forms, as best seen inFIGS.5to7, the motors20,20′,20″ can be wholly contained within the boundary defined by the diameter of the wheel10whilst being partially in-line with, and partially protruding beyond, the boundary defined by the width of the wheel10. The wheel assembly100may thus simplify the drive chain of the vehicle. In addition, the vehicle may in some forms have a reduced total weight, may produce less noise, and may require less raw materials in order to be manufactured.", "", "The wheel10is supported relative to the shaft12about which it rotates by a plurality of connecting members in the form of spokes18,18′,18″ which extend between each of the motors20,20′,20″ that are arranged on the shaft12and the inner rim of the wheel14, thereby linking the wheel10to the shaft12. Each spoke18,18′,18″ is coupled at a first distal end to one of the plurality of motors20,20′,20″ to define a motor linkage22,22′,22″, and coupled at the opposing second distal end to the inner rim of the wheel14defining a wheel linkage24. A single spoke18,18′,18″ extends from each of the plurality of motors20,20′,20″ to engage the inner rim of the wheel14. For example, with reference to the Figures, an embodiment of the wheel assembly100is shown having three spokes18.18′,18″ and three motors20,20′,20″, with a first spoke18extending from a first motor20, a second spoke18′ extending from a second motor20′, and a third spoke18″ extending from a third motor20″, where each of the three motors20,20′,20″ are configured side by side to rotate concentrically about a single shaft12. In a variation, two or more spokes can be arranged to extend from each of the plurality of motors, with each of the two or more spokes being equidistantly spaced around the singular motor from which they stem towards the wheel rim.", "", "A control system, mounted on a control system board80, is integrated with the wheel assembly100to individually control the operation of each of the plurality of motors20,20′,20″ in real-time such that they can be operated to drive the rotation of the wheel10thereabout simultaneously, yet independently from one another. Each of the motors20,20′,20″ can be independently controlled by the control system to accelerate, decelerate and/or maintain a velocity, such that the velocities of each motor20,20′,20″ can be controlled to simultaneously be the same, or simultaneously be different, from each other. The control system coordinates the velocity and direction of rotation of each of the motors20,20′,20″ such that the motors20,20′,20″ operate via the control system in a communicative manner to rotate the wheel10about the shaft12.", "", "When each of the plurality of motors20,20′,20″ are controlled to operate in unison at a substantially identical velocity, regardless of whether the wheel is accelerating, decelerating or maintaining a constant velocity, the central axis through the wheel10remains in a neutral configuration, where the central axis through the wheel10is concentric with the central axis through the shaft12, and thus with each of the motors20,20′,20″ (e.g.FIG.10B).", "", "The control system controls the motors20,20′,20″ of the wheel assembly100independently of any other wheel assemblies100that are integrated with the vehicle. A centralised control system communicates with each wheel assembly100control system to direct each control system's individual operation, including, but not limited to, the acceleration and deceleration of the wheel10, steering of the wheel assembly100, brake control, traction control and stability control of the wheel assembly100. In this manner, the wheel assembly100are operated as a collective in unison to drive the vehicle as a synchronised unit. In some forms, the independent control of the velocity of each wheel10of a vehicle can facilitate improved torque vectoring for the vehicle, where a unique torque force may be applied to each wheel10during cornering of the vehicle, whilst simultaneously increasing the velocity of any wheels10that locate on the outer side of the corner travelled. This may improve the predictability of the vehicle control.", "", "The spokes18,18′,18″ are rigid along their length, and are arranged to pivot relative to each of the motor20,20′,20″ and the wheel10about each of the motor linkage22,22′,22″ and wheel linkage24, respectively. The relative location of the wheel linkages24are fixed relative to one another around the circumference of the wheel rim14, with each wheel linkage24being spaced equidistantly therearound. However, the relative spacing between the motor linkages22,22′,22″ of each of the different motors20,20′,20″ around the circumference of the motors20,20′,20″ is able to be adjustably lengthened or shortened when the velocity of an individual motor of the plurality of motors20,20′,20″ differs from the velocity of one or more of the other motors of the plurality of motors20,20′,20″ during a single revolution of the wheel10. For example, if the first motor20accelerates whilst the second motor20′ either accelerates at a lesser rate, maintains its velocity, or decelerates, the relative distance between the first motor linkage22and the second motor linkage22′ will change accordingly whilst the relative instant velocities of rotation of each motor20,20′ remain different.", "", "During operation of the wheel assembly100, the control system can direct each of the plurality of motors20,20′,20″ to sinusoidally accelerate and decelerate during a single revolution of the wheel10, with the sinusoidal acceleration and deceleration of an individual motor of the plurality of motors20,20′,20″ being at a different time to the other motors of the plurality of motors20,20′,20″, whilst enabling each individual motor to achieve a peak and/or trough velocity at substantially the same angular position as the other motors of the plurality of motors20,20′,20″ during a revolution of the wheel10. The sinusoidal acceleration and deceleration of an individual motor of the plurality of motors20,20′,20″ is thus offset relative to the sinusoidal acceleration and deceleration of the other motors of the plurality of motors20,20′,20″, with the precise phase of the acceleration and deceleration being defined by the control system.", "", "An acceleration of one of the motors20,20′,20″ relative to the other motors20,20′,20″ can cause the rigid spoke18,18′,18″ attached to that motor20,20′,20″ to pivot about both the corresponding motor linkage22,22′,22″ and wheel linkage24. As the wheel linkages24are fixed to remain equidistantly angularly spaced around the circumference of the wheel rim14, as the motor linkage22,22′,22″ of the accelerating motor20,20′,20″ increases the relative angular distance between it and the motor linkage22,22′,22″ of the trailing motor20,20′,20″, the corresponding spoke18,18′,18″ between the motor linkage22,22′,22″ of the accelerating motor20,20′,20″ and corresponding wheel linkage24is urged to orient to increase the relative angular distance between the motor linkage22,22′,22″ of the accelerating motor20,20′,20″ and corresponding wheel linkage24so as to compensate for the differential in relative velocities. The orientation of the pivoting spoke18,18′,18″ acts to collapse the wheel linkage24towards the shaft12, decreasing the distance between the wheel rim14and the motors20,20′,20″ at that angular position during a single revolution of the wheel10.", "", "In a similar manner, as the motor linkage22,22′,22″ of a decelerating motor20,20′,20″ decreases the relative angular distance between it and the motor linkage22,22′,22″ of the trailing motor20,20′,20″, the corresponding spoke18,18′,18″ between the motor linkage22,22′,22″ of the accelerating motor20,20′,20″ and corresponding wheel linkage24is urged to orient to decrease the relative angular distance between the motor linkage22,22′,22″ of the accelerating motor20,20′,20″ and corresponding wheel linkage24so as to compensate for the differential in relative velocities. In this instance, the orientation of the pivoting spoke18,18′,18″ acts to pull the wheel linkage24in order to extend away from the shaft12, increasing the distance between the wheel rim14and the motors20,20′,20″ at that angular position during a single revolution of the wheel10.", "", "Thus, by controllably adjusting the phase of the sinusoidal cycles of each of the plurality of motors20,20′,20″, the angular position where each of the motors20,20′,20″ achieves a peak and/or a trough velocity during a revolution of the wheel10can be defined by the control system. The control system can thus operate the plurality of motors20,20′,20″ to dynamically control and adjust the relative distance between wheel rim14and the shaft12by shifting the position of the central axis through the wheel10relative to a central axis through the shaft12and motors20,20′,20″. The operation of the motors20,20′,20″ at varying velocities simultaneously, can controllably adjust the orientation of the spokes18,18′,18″ as they rotate about the shaft12, thereby shifting the central axis through the wheel10relative to a central axis through the shaft12to the position determined by the control system. The magnitude of the shift in position of the central axis through the wheel10relative to a central axis through the shaft12can be controllably adjusted by the control system by driving each of the motors20,20′,20″ to rotate through a sinusoidal cycle with a greater amplitude of acceleration and deceleration during a single revolution of the wheel10.", "", "In some forms, the control system can dynamically control the position of the central axis through the wheel10relative to a central axis through the shaft12in any of the 360 degrees around the shaft12, providing a full range of relative motion along both the X-axis X-X and Y-axis Y-Y of the wheel assembly100, and only limited by the relative diameters of the wheel rim14and motors20,20′,20″.", "", "The spokes18,18′,18″ can define a curved body that can facilitate a close engagement of the spoke18,18′,18″ with one or both of the inwardly facing surface of the wheel rim14and the outer surface of one or more of the plurality of motors20,20′,20″ when the distance between the wheel rim14and the motors20,20′,20″ is decreased in use. The curved body can help the spokes18,18′,18″ to generally conform with the curvature of the wheel rim14whilst folding towards, and wrapping over, the motors20,20′,20″.", "", "In some forms, the spokes18,18′,18″ can be formed to have a width at the motor linkage22,22′,22″ end of the spokes18,18′,18″ that is slightly wider than the cumulative width of the plurality of motors20,20′,20″ as they are arranged side by side on the shaft12. A supporting plate can be arranged to spin freely on the shaft12, with a supporting plate being located adjacent to on one or both ends of the shaft12one either side of the plurality of motors20,20′,20″. The motor linkage22,22′,22″ can thus be linked to, and supported by, a respective one of the motors20,20′,20″ in addition to the supporting plate/s, thereby strengthening the joint. In some forms, permanent magnets can be mounted within the supporting plate/s to assist with balancing the opposing forces of the various magnets within the plurality of motors20,20′,20″, for example, such that the forces in each of motors20and20″ are balanced with that of motor20′.", "", "Referring now toFIGS.5to8, in some forms of the wheel assembly100, the relative movement of the central axis through the wheel10relative to a central axis through the shaft12can be restrained mechanically to a movement aligned with the Y-axis of the wheel assembly100. In the event of a control system failure, the mechanical restraint30, hydraulic cylinder75within the wheel assembly100, and opposing magnetic fields of each motor20,20′,20″ can combine to assist in the continued control of the position of the central axis through the shaft12relative to the wheel rim14. In some forms, the mechanical restraint30may help reduce the energy consumption of the plurality of motors20by reducing the amount of active control required to restrict the central axis through the shaft12in the X-direction X-X, allowing only for relative movement along the Y-axis Y-Y.", "", "Each motor20,20′,20″ can be connected to a limiter rotor34via a respective one of a plurality of linkages32,32′,32″ that are arranged behind the motors20,20′,20″, on the vehicle facing inner side of the wheel assembly100. The linkages32,32′,32″ link the motors20,20′,20″ to a disc-shaped limiter rotor34which is arranged to revolve around a limiter hub36. The limiter hub36in turn is constrained by a mechanical limiter30to motion along the Y-axis Y-Y in line with a central axis through the shaft12, with the mechanical limiter30being configured to pivot up and down about a pin31that lies parallel to the X-axis X-X and is fixed in alignment with the central axis through the shaft12. The mechanical limiter30thus acts to restrict the central axis through the wheel10against movement along the X-axis X-X, allowing only movement along, and in alignment with, the Y-axis Y-Y that passes through the central longitudinal axis through the shaft12.", "", "In use, the control system of the wheel assembly100can thus operate the motors20,20′,20″ to determine the position of the central axis through the wheel10relative to a central axis through the shaft12along, and in alignment with, the Y-axis Y-Y. When each of the plurality of motors20,20′,20″ are operated simultaneously at the same velocity, the wheel assembly100maintains a neutral configuration where the central axis through the wheel10aligns concentrically with the central axis through the shaft12(e.g.FIGS.5A,5B and10B). When each of the plurality of motors20,20′,20″ are operated to oscillate sinusoidally between acceleration and deceleration during a single rotation of the wheel10, with each motor20,20′,20″ reaching a peak velocity in an offset manner as the corresponding spoke18,18′,18″ rotates through the lowest point of the revolution (i.e. approximately 270 degrees on a unit circle), thereby causing the corresponding spoke18,18′,18″ to be contracted towards the motors20,20′,20″ as it nears that angular position. The central axis through the wheel10is thus shifted upwards relative to a central axis through the shaft12, towards an elevated configuration, with the mechanical limiter30ensuring that the movement of the central axis through the shaft12remains in alignment with the Y-axis Y-Y (e.g.FIGS.6A and6B,10A, and11A to11E). However, when each motor20,20′,20″ reaches a peak velocity as the corresponding spoke18,18′,18″ rotates through the highest point of the revolution (i.e. approximately 90 degrees on a unit circle), the corresponding spoke18,18′,18″ is caused to be contracted towards the motors20,20′,20″ as it nears that angular position, thereby shifting the central axis through the wheel10downwards relative to a central axis through the shaft12, towards a lowered configuration, with the mechanical limiter30again ensuring that the movement of the central axis through the shaft12remains in alignment with the Y-axis Y-Y as the wheel10extends outwardly from the shell of the wheel assembly100(e.g.FIGS.7A and7B,10C, and12A to12D.).", "", "In some forms, each linkage32,32′,32″ has a longitudinal length that equates to approximately half the longitudinal length of the spokes18,18′,18″. A first distal end of each linkage32,32′,32″ pivotably engages a respective one of the motors20,20′,20″ via an extended portion of the respective motor linkages22,22′,22″, with the pivot point of the extended portion of the respective motor linkages22,22′,22″ being at a radial length C-C from the central axis of the motors20,20′,20″ that equates to approximately half the radius D-D of the motors20,20′,20″. An opposing second distal end of each linkage32,32′,32″ pivotably engage the limiter rotor34at a radial length A-A from the central axis of the shaft12that equates to approximately half the radial distance B-B of the wheel linkage24from the central axis of the shaft12.", "", "In some forms, the limiter rotor34is configured to function as a disc brake, with a brake rotor35and calliper37assembly mounted thereto in order to provide smooth mechanical braking for the wheel assembly100. Although in some forms the motors20,20′,20″ can be configured to produce regenerative braking force, the addition of a mechanical braking assembly can be used to compliment the regenerative braking system and help improve the safety of the vehicle operation should the regenerative braking system fail. Similarly, the mechanical limiter30can act as an additional safety control in instances where the control system or motors20,20′,20″ experience a failure whilst the vehicle is moving, as the limiter can retain the wheel10from movement along the X-axis X-X which could compromise vehicle control.", "", "A regenerative braking system, when incorporated with the wheel assembly100, may improve the range of distance with which the vehicle distance can travel. Any electrical power generated from the regenerative braking system can be supplied back to the main vehicle power supply, located external from the wheel assembly100, for example to a battery and/or a super capacitor that are integrated with the vehicle chassis.", "", "The wheel assembly100further comprises one or more sensors, not shown, that are configured to detect the state of the ground surface surrounding the vehicle, and in particular the ground surface forward of the wheel assembly100that is anticipated to imminently come into contact with the wheel10. These sensors can be configured to detect a variety of inputs including, but not limited to, the relative distance between each corner of the vehicle chassis and the ground surface beneath the vehicle chassis, the topology of the ground surface forward of the moving vehicle and each wheel assembly100, the acceleration and g-forces experienced by an occupant of the vehicle cabin, and when an impact with an external object is imminent. The sensor/s can communicate the detected state of the ground surface directly and in-real time to the control system of the relevant wheel assembly100. In some forms, the sensed data can be communicated by the one or more sensors in-real time to the centralised control system. The centralised control system can centrally collate all of the sensor data, and then process the data in order to compute and determine if any corrective actions are required in-real time by one or more wheel assembly100in order to improve the operation of the vehicle.", "", "For example, in some forms the one or more sensors can include an accelerometer that is configured to measures the acceleration forces acting on the wheel assembly100, in order to detect the roll, yaw and position in space of the wheel10in real time. The data detected by the accelerometer can be processed in real time by the control system, or centralised control system. In turn, the control system, or centralised control system, can controllably direct the motors20,20′,20″ to instantaneously, and in real-time, begin to oscillate sinusoidally between acceleration and deceleration during a single rotation of the wheel10. The control system, or centralised control system, can controllably time the peak and/or a trough velocity of each motor in an offset manner, whilst positioning the peak and/or a trough velocity at an angular position of the revolution of the motors20,20′,20″ whereby the phase of the sinusoidal oscillations determines whether the position of the central axis through the wheel10relative to the central axis through the shaft12is adjustably shifted upwards towards an elevated configuration of the wheel assembly100(e.g.FIG.10A) where the wheel10is contracted within the shells of the steering assembly60, and/or extended downwards towards a lowered configuration of the wheel assembly100(e.g.FIG.10C) to effect a real-time force dampening for the wheel assembly100which can compensate for the detected state of the ground surface. In this manner, the wheel assembly100can be provided with active suspension in real-time within the wheel10in response to the detected state of the ground surface, in order to maintain the central axis through the shaft12at a substantially constant level, which helps to maintain a substantially level operation of the vehicle as a whole in a relatively smooth manner.", "", "In some forms, the active suspension of each wheel assembly100of the vehicle can be proactively used to adjustably control the pitch and roll of the vehicle in order to shift the centre of mass of the vehicle during cornering. This may be used to effectively equalise the forces applied to the wheels10of the vehicle by the ground surface as the vehicle travels through the curved trajectory of the bend or corner, thereby optimising the grip of each of the wheels10against the ground surface. By using a plurality of in-wheel motors20,20′,20″ to simultaneously effect both the drive of the vehicle and the active suspension of an individual wheel10, the singular set of in-wheel motors20,20′,20″ can serve a dual purpose whilst helping to reduce the overall weight and bulk of the vehicle.", "", "In a variation, the wheel assembly can comprise two motors that are arranged side by side on the same shaft, with one spoke extending from each of the motors to support the wheel therearound. In a further variation, the wheel assembly can comprise two motors that each have two spokes extending away therefrom from diametrically opposed sides of the motors. In yet a further variation, the wheel assembly can comprise four motors that are arranged side by side on the same shaft. As would be appreciated by one skilled in the technical field, numerous further variations are contemplated within the scope of the present disclosure.", "", "In some forms, it may be preferable for the wheel assembly to utilise an even number of spokes. In some forms, an even number of spokes may improve the smoothness with which the wheel assembly can be operated, as each spoke can be balanced against an opposing spoke on the same motor, or on a different motor, as the inertia from a first motor accelerating can be substantially balanced out by the inertia of an opposing deceleration of a second motor.", "", "Referring now toFIGS.9to12, a graph is presented depicting an example of the some of the phases of operation of the wheel assembly100, and in particular how the angular velocity of each of the motors20,20′,20″ of the wheel assembly100can be controlled by the control system over time to adjustably shift the relative position of the central wheel axis.", "", "Starting with the motors20,20′,20″ and wheel10of the wheel assembly100at rest in the first stage81, the relative position96of the central axis through the wheel10is held in the neutral configuration (e.g.FIG.10B), where it is aligned to be concentric with that of the central axis through the shaft12.", "", "At the second stage82, the control system begins to controllably operate the plurality of in-wheel motors20,20′,20″, directing them to steadily accelerate in unison until the angular velocity of rotation of the wheel94reaches the desired magnitude (e.g. 180 degrees per second). At the third stage83, the plurality of motors20,20′,20″, continue to rotate in unison at the desired angular velocity94, thereby maintaining the wheel10at the same constant angular velocity94. During the second82and third stages83, the operation of each of the plurality of motors20,20′,20″ is synchronised such that the each of the plurality of motors20,20′,20″ drives the wheel rim14with the same torque and angular velocity94in unison. The relative position96of the central axis through the wheel10is thus maintained in the neutral configuration.", "", "At the fourth stage84, the control system controllably adjusts the operation of each of the motors20,20′,20″ individually, directing them to begin to sinusoidally accelerate and decelerate at individually offset timing phases. For example, the control system could initiate such an operation in response to a detected state of the ground surface forward of the wheel assembly100, such as a protrusion, in order to effectively provide active suspension to the wheel assembly100. Although the individual motors20,20′,20″ accelerate and/or decelerate, the resulting cumulative effect of the sinusoidal oscillations being at offset phases is that the angular velocity of rotation of the wheel94remains the same as in the third stage83. However, as each motor20,20′,20″ is controlled to reach a peak velocity93,93′,93″ in an offset manner as the corresponding spoke18,18′,18″ rotates through the lowest point of the revolution (e.g.FIGS.11A to11E), the corresponding spokes18,18′,18″ are urged to orient to decrease the relative angular distance between the motor linkage22,22′,22″ of the accelerating motor20,20′,20″ and corresponding wheel linkage24as they near that angular position (i.e. approximately 270 degrees on a unit circle), in order to compensate for the differential in relative velocities. The contraction of the18,18′,18″ proximal to the lowest point of the revolution about the shaft12, effects a steady upward shift of the position96of the central axis through the wheel10relative to a central axis through the shaft12, towards the elevated configuration (e.g.FIG.10A). During the deceleration of each motor20,20′,20″, the corresponding spokes18,18′,18″ are urged to orient to decrease the relative angular distance between the motor linkage22,22′,22″ of the accelerating motor20,20′,20″ and corresponding wheel linkage24so as to compensate for the differential in relative velocities. The magnitude of the sinusoidal oscillations between can be increased, thereby increasing the magnitude of the shift in the relative position96of the central axis through the wheel10. During the fifth stage85, the magnitude of the sinusoidal oscillations is maintained at a constant magnitude, with the relative position96of the central axis through the wheel10maintained in an eccentric elevated configuration. Again, the angular velocity of rotation of the wheel94remains constant as the offset phase of the sinusoidal oscillations of the motors20,20′,20″ balance out each other to have a net zero effect.", "", "At the sixth stage86, the control system controllably adjusts the magnitude and phase of the sinusoidal acceleration and deceleration of each of the motors20,20′,20″ individually, shifting the timing and angular position of the peak93,93′,93″ and trough92,92′,92″ angular velocities of each motors20,20′,20″, respectively, such that each motor20,20′,20″ reaches a peak velocity as the corresponding spoke18,18′,18″ rotates through the highest point of the revolution (e.g.FIGS.12A to12D). As each spoke18,18′,18″ nears the angular position of the peak velocity93,93′,93″ (i.e. approximately 90 degrees on a unit circle), the spokes18,18′,18″ are urged to orient to decrease the relative angular distance between the motor linkage22,22′,22″ of the accelerating motor20,20′,20″ and corresponding wheel linkage24so as to compensate for the differential in relative velocities. As a result, the relative position96of the central axis through the wheel10is shifted downwards relative to a central axis through the shaft12, through the neutral configuration, and towards an eccentric lowered configuration. For example, the control system could initiate such an operation in response to a detected state of the ground surface forward of the wheel assembly100, such as a pot-hole in the ground surface, in order to effectively provide active suspension to the wheel assembly100. During the seventh stage87, the magnitude of the sinusoidal oscillations is maintained at a constant magnitude, with the relative position96of the central axis through the wheel10maintained in an eccentric lowered configuration. During the eighth stage88, the magnitude of the sinusoidal oscillations is gradually decreased in magnitude until the plurality of motors20,20′,20″ are again synchronised such that the each of the plurality of motors20,20′,20″ drives the wheel rim14with the same torque and angular velocity94in unison. As the sinusoidal oscillations are decreased, and the velocities of each of the motors20,20′,20″ return to a synchronised constant velocity, the relative position96of the central axis through the wheel10is adjustably shifted to return to the neutral configuration. The angular velocity of rotation of the wheel94remains constant throughout the sixth86, seventh87, and eighth88stages, as the control system directs the operation of the motors20,20′,20″ in a manner where the offset phases of the sinusoidal oscillations continues to balance out each other to have a net zero effect.", "", "At the ninth stage89, the plurality of motors20,20′,20″, again rotate in unison at the desired angular velocity94, thereby maintaining the wheel10at the same constant angular velocity94. The operation of each of the plurality of motors20,20′,20″ is again synchronised such that the each of the plurality of motors20,20′,20″ drives the wheel rim14with the same torque and angular velocity94in unison. The relative position96of the central axis through the wheel10is maintained in the neutral configuration.", "", "At the tenth stage90, the control system begins to steadily decelerate the plurality of in-wheel motors20,20′,20″ in unison until the angular velocity of rotation of the wheel94returns to zero and the wheel10is at rest. The relative position96of the central axis through the wheel10is again held in the neutral configuration, where it is aligned to be concentric with that of the central axis through the shaft12. This continues into the eleventh stage81′, which replicates the first stage81.", "", "Referring now toFIGS.13A and13B, each motor20,20′,20″ of the wheel assembly is comprised of a rotor40and a stator42that are located therein. The rotor40and a stator42of each motor20,20′,20″ are both arranged concentrically along the shaft12, whereby the shaft12aligns with the centre of mass of each of the rotors40and stators42, with the rotor/s40of each motor20,20′,20″ being arranged to rotate about the shaft12relative to a corresponding stator42.", "", "In some forms, each motor20,20′,20″ can be an axial flux motor that is arranged as a brushless twelve-phase DC motor. The rotor40comprises a plurality of permanent magnets41that are arranged to define a ring of magnets adjacent each of the opposing sides of a copper stator42, so as to balance the magnetic forces on either side of the stator42. The central axis though each ring of magnets aligns concentrically with the axis through the shaft12. The stator42is arranged in plurality of parallel planar segments43. In some forms, each ring of magnets of the rotor40may comprise the same quantity of magnets41as the quantity of segments43of the corresponding stator42. Half of the segments43are configured to be excited by a current within the stator42segments43that forms a magnetic field therearound having a first polarity. The other half of the segments43are configured to be excited by a current within the stator42segments43that forms a magnetic field of an opposing second polarity therearound. For example, in some forms, the stator42may comprise twenty four copper segments43, where twelve of the segments43can be excited to form a magnetic field having a positive polarity, whilst the other twelve copper segments43are excited to form a magnetic field having a negative polarity. The current within the stator42segments43is generated from a power source stored within the vehicle chassis (e.g. the car battery). The current is distributed from the power source by the centralised control system to the individual wheel assemblies100of the vehicle, and then by the individual control system to the stator segments43through conduits in the shaft12.", "", "The permanent magnets41in each ring of magnets are arranged whereby the surface facing towards, and proximally adjacent to, the segments43provide a magnetic field having an opposing polarity to that of the magnetic field around the segments43of the stator40. By reversing the current on the leading43′ and trailing43″ segments of the stator42, the magnetic field within the segments43of the stator42can be rotated about the shaft12. As the magnetic field within the segments43is rotated, the magnetic field within the permanent magnets41of the rotor40is urged to simultaneously rotate in order to return the opposing magnetic fields to a position in which the polarities of the adjacent magnetic fields facilitates a magnetic attraction force therebetween. The control system can thus drive the angular velocity rotation of the rotor40of each of the plurality of motors20,20′,20″ by controllably reversing the current on the leading43′ and trailing43″ segments of the stator42in order to rotate the magnetic field within the segments43at the desired angular velocity.", "", "The permanent magnets41of the rotor40are positioned such that they also generate a magnetic field on the outer facing side of each rotor40. The magnetic field of a first rotor40is positioned such that it acts in opposition to, and repels, the magnetic field generated by an adjacent second rotor40. The permanent magnets41are thus configured so as to effectively replicate the functional performance of torsional springs between the rotors40of adjacent motors20,20′,20″, whereby, when the motors20,20′,20″ are at rest the opposing magnetic fields resiliently rotate the rotors40so as to return the corresponding spokes18,18′,18″ to their at-rest starting position. In some forms, the rotor magnetic fields can be configured whereby the rotors40of the plurality of motors20,20′,20″ are inclined to return the wheel assembly100to the neutral configuration with the spokes18,18′,18″ located in a substantially equidistant spacing around the circumference of the plurality of motors20,20′,20″ when the plurality of motors operate at a common velocity. The common velocity can be a common angular velocity of zero or greater, whether the motors20,20′,20″ are accelerating, decelerating, or maintaining the velocity. For example, where there are three spokes the spacing can be 120° apart. In some forms, depending on the strength of the permanent magnets41used in the rotor40it may be necessary to integrate one or more resilient springs, or a hydraulic cylinder75and accompanying piston, that engages and lifts the mechanical limiter30along the Y-axis Y-Y, whereby the spring/s or hydraulic cylinder and piston are configured to act as an auxiliary support for the permanent magnets41and assist with resiliently returning and maintaining the wheel assembly100to the at-rest starting position and neutral configuration where the central axis through the wheel10is concentric to the central axis through each of the motors20,20′,20″.", "", "In some forms, one or more sensors can be located on the stator42proximal the rotor40, with the sensor/s being configured to detect the orientation of the rotor40by measuring variations in the magnetic field. In some forms, the sensor/s can be used to measure angular velocity of an individual motor20,20′,20″. In some forms, one or more sensors be located on the stator42, with the sensor/s being configured to detect a temperature within the respective motor20,20′,20″. The electrical wiring that provides current to each of the stator segments43and the one or more sensors within each of the stators40can be ducted through the shaft12of the wheel assembly100in order to communicate with the control system.", "", "For example, a Hall effect sensor can be located proximal to each rotor, and a temperature sensor can be installed within each stator. The Hall effect sensors are statically fixed relative the stator42, and configured to detect the relative presence and magnitude of the magnetic field of the adjacent permanent magnets41of the ring of magnets of the rotor40. The control system can translate the communicated output voltage of the Hall effect sensor, which is directly proportional to the strength of the magnetic field, in order to calculate the relative position and thus rotational velocity, rotational direction, and y-axis position of each of the rotors40, the motors20,20′,20″ and thus the wheel rim14. The communicated information from each of the Hall effect and temperature sensors can be processed by the control system and compared against pre-determined limits. The control system can thus process if one or more of the motors is stalling and/or over-heating, and take preventative action if required. The Hall effect and temperature sensors can communicate any detected information to the control system, whereby the control system can, in response, controllably adjust the angular velocity of the rotation of the magnetic field around the stator42, or alternatively, adjustably control the amount of electrical current that is provided to the stator segments43in order to increase or decrease the magnetic field strength, as required.", "", "The sensor/s may assist the control system in maintaining a synchronised rotation of the magnetic field around the permanent magnets41of the rotor40with the rotating magnetic field of the stator42. The sensor/s may also assist the control system in preventing the motors20,20′,20″ of the wheel assembly100from over-heating. For example, in some forms when the vehicle is being driven to travel up a sloped ground surface an increased torque load may be applied against the wheel10which acts to reduce the speed of rotation of the rotor40relative to the rotational speed of the magnetic field around the stator42. In such instances, the one or more Hall Effect sensors can communicate the reduction in relative angular velocity between the magnetic field around rotor40and the magnetic field around the stator42to the control system. The control system, in response, can counteract the increased torque by either controllably increasing the magnitude of the magnetic field strength around the stator42by increasing the electrical current therein, or controllably reduce the rotational speed of the magnetic field around the stator40such that the relative angular velocity between the magnetic field around the rotor40and the magnetic field around the stator42remains substantially synchronised.", "", "The control system can also use the received information from each Hall effect sensor to calculate in-real time if a change in the y-axis position is required or if the y-axis position should be maintained, by comparing the calculation of the actual y-axis position from each Hall effect sensor with the required y-axis position. The control system can then control the y-axis position such that it is changed or maintained in real-time, in response to the determined differential between the calculated y-axis position and the required y-axis position.", "", "The centralised control system collects the information communicated thereto by the control system of each of the wheel assemblies100of the vehicle. The centralised control system can process and compare the information from a single wheel assembly100with the information gathered from each of the other wheel assemblies100of the vehicle. The centralised control system can use this information to assist in identifying the status of a specific wheel assembly100. For example, the information collected by the centralised control system can be processed to identify instances where a specific one of the wheel assemblies100has experienced a loss of traction, or to calculate the relative force of each wheel10on the road. The centralised control system can also use the collected information to calculate the overall velocity of the vehicle. The centralised control system can also use the collected information, for example from the accelerometer, to identify any undulations in the surface beneath a wheel assembly100, calculate the distance between the wheel10and the ground surface, and ascertain the relative level of each wheel10of the vehicle. Data inputs from other sensors that are spaced around the vehicle chassis, such as accelerometers and road topology scanners, can be used in conjunction with the sensors of the wheel assembly100to complement the information communicated by the control system of an individual wheel assembly100. This can assist the centralised control system with collating a high level of detail regarding the vehicle's surroundings. The centralised control system can use this information to assist with optimising the safety, comfort, and efficiency of the vehicle. For example, the centralised control system can utilise the data to controllably adjust the y-axis position of one or more of the wheels10in order to maintain a substantially level relative pitch and roll angle for the vehicle, thereby facilitating active suspension of the vehicle.", "", "The control system can be housed between the inner two shells of the wheel assembly100, adjacent a distal end of the shaft12. This may help to reduce the amount of cabling that is required within the wheel assembly100. The control system is in wired communication with a power supply that is located externally from the wheel assembly100and can be wired to communicate with the centralised control system, also located externally from the wheel assembly100, in order to exchange information regarding the individual wheel assembly100. In some forms, the control system can be configured to communicate wirelessly and in-real time with the centralised control system. Where required, the cabling from the control system can be fed out from the wheel assembly100into the chassis of the vehicle via the pivot neck72about which the wheel assembly100is steered.", "", "Referring now toFIGS.14to40, the hub-style in-wheel motors20,20′,20″ enable the wheel assembly100to be operated without drive axles and cv joints. The wheel assembly100is thus free to be steered to turn with a high degree of manoeuvrability. In some forms, the wheel assembly100can be configured to pivot more than a full 360° of rotation about the Y-axis Y-Y of the wheel assembly100. In some forms, the wheel assembly100can be steered to an angle whereby the vehicle can be manoeuvred through a zero-point turning circle. In some forms the wheel assembly100can be steered to an angle whereby the vehicle can be manoeuvred sideways relative to the forward facing direction of the vehicle.", "", "For example, the wheel assembly100can comprise a steering assembly60comprised of four concentric partially spherical or hemispherical shells, with each shell being configured to pivot relative to the other shells, without exposing the bearing surfaces. In some forms, the bearings about which each shell is configured to pivot can utilise a bearing seal, without requiring a protective rubber boot thereat.", "", "Referring toFIGS.18to20, the outermost shell62is fixed to be stationary relative to the vehicle and acts as a cover for the remaining shells of the steering assembly60. The outermost shell62is formed to have a hollow substantially spherical shape, with the outer surface54of the shell62being roughly one quarter of a sphere, with a flat base surface55, and angled side edges that slope outwardly as they rise from the base surface55to the front edge57of the shell62. The pivot neck72about which the wheel assembly100is steered is located on the interior surface59of the shell62at the zenith of the spherical shape, such that an axis through the pivot neck72is collinear with a vertical axis therethrough. A steering gear77is mounted within a chamber58that is provided adjacent the base surface55of the outermost shell62. The steering gear77meshes with, and drives, a rotation of the idler gear73which is mounted alongside the steering gear77within the chamber58. The idler gear73protrudes through into the interior surface59of the outermost shell62, and is arranged to mesh with a slave gear71that is provided around a first ring bearing63that is able to nest within a substantially circular indented portion56of the interior surface59. The chamber58is coverable with a cover plate so as to provide a substantially smooth surface that is contiguous with the outwardly facing surface of the outermost shell62, with the exception of the steering control49which protrudes outwardly therethrough. The steering control49provides a mechanical coupling between the driver steering wheel and the steering assembly60. In a variation, not shown, the steering control can be formed to fit within the chamber, so as to not project outside of the outer facing surface of the outermost shell.", "", "Referring toFIGS.21to23, the first rotating shell64defines a spherical cap shape, with an outwardly facing surface46that substantially conforms to the contours of the profile of the interior surface59of the outermost shell62, whereby the first rotating shell64is nested adjacent to the interior surface59within the outermost shell62. A first ring bearing63is fixedly coupled to the upper surface of the first rotating shell64, with the centre points of each of the first ring bearing63and first rotating shell64being arranged concentrically. The first ring bearing63projects away from the upper surface and is sized and shaped to couple with first ring bearing retainer63′, so as to fit within the indented portion56of the stationary outermost shell62, whereby the first ring bearing63and first ring bearing retainer63′ facilitates the coupling of the first rotating shell64to the outermost shell62. When located within the indented portion56, the slave gear71that is formed around the circumference of the first ring bearing63is able to mesh with the idler gear73, which thereby drives the angular rotation of the first rotating shell64relative to the stationary outermost shell62. A gap78is provided between the outer rim of the first rotating shell64and the surface of the first rotating shell64that supports the first ring bearing63, the gap extending for approximately 270 degrees around the circular first rotating shell64. The gap78allows the pivot neck72to connect to the third rotating shell68through the first rotating shell64, whilst not inhibiting the relative angular rotation of the shells64,66,68. An additional bearing surface74is defined by a corresponding pair of ridges provided on each of the interior surface59of the outermost shell62and the outwardly facing surface46of the first rotating shell64. The corresponding bearing surfaces74are arranged to assist with further distributing the forces applied to the pivot neck72by the angular movement of the third rotating shell68(and the wheel10) by spreading a portion of the force load from the outermost shell62across the first rotating shell64. By improving the force load distribution, the steering assembly60can utilise smaller and/or lighter bearings, which in turn helps in further reducing the overall bulk and weight of the steering assembly60.", "", "Referring toFIGS.24to26, the second rotating shell66is coupled to, and configured to pivotally rotate about, a second ring bearing65that is located within the first rotating shell64on an interior facing surface47, and adjacent to an outer rim thereof. The second rotating shell66defines a spherical cap shape, with the second ring bearing65being provided on an outwardly facing surface44, also adjacent to an outer rim thereof. The outwardly facing surface44is otherwise a substantially smooth continuous surface that conforms to the contour of the interior facing surface47of the first rotating shell64. The relative location of the second ring bearing retainer65′ and second ring bearing65adjacent respective outer rims of each of the first rotating shell64and second rotating shell66provides an for eccentric offset movement during angular rotation of the first rotating shell64, with the second rotating shell66being pivotally shifted in an opposite direction to the first rotating shell64for a corresponding magnitude of angular rotation. The interior facing surface45of the second rotating shell66comprises a centrally located third ring bearing retainer67′ through which the second rotating shell66is pivotally coupled to the third ring bearing67of the third rotating shell68. An additional bearing surface76is defined by a corresponding pair of ridges provided on each of the interior facing surface45of the second rotating shell66and the outwardly facing surface48of the third rotating shell68. The corresponding bearing surfaces76are arranged to assist with further distributing the forces applied to the pivot neck72by the angular movement of the third rotating shell68(and the wheel10) by spreading a portion of the force load from the second rotating shell66across the third rotating shell68.", "", "Referring toFIGS.27to29, the third rotating shell68provides a hub within which an upper portion of the wheel10is housed. The shaft12projects perpendicularly away from an interior wall39of the third rotating shell68(and the innermost shell70that is fixed within the third rotating shell68), with the surrounding substantially quarter-spherical shape providing sufficient clearance for the wheel10to be shifted vertically upwards or downwards by the suspension system of the wheel assembly100, as required. The outwardly facing surface48of the third rotating shell68is shaped like roughly one quarter of a sphere, with a curved base portion29within which the innermost shell70having the control system and motors20,20′,20″ are housed, and from which the shaft12extends into the hollow interior of the third rotating shell68. The innermost shell70is fixed within the third rotating shell68. The pivot neck72about which the wheel assembly100is steered is located on the outwardly facing surface48at the zenith of the generally spherical shape, such that an axis through the pivot neck72is collinear with a vertical axis therethrough. The third rotating shell68is coupled to, and configured to pivot about, a third ring bearing67located centrally within the interior facing surface45of the second rotating shell66. A circular recessed portion33of the outwardly facing surface48of the third rotating shell68is provided in order to receive the second rotating shell66, with the third ring bearing67being substantially centrally located within the circular recessed portion33. The third ring bearing67allows for eccentric offset movement of the third rotating shell68relative to first rotating shell64for a corresponding angular rotation in the same angular direction as the first rotating shell64, and in the opposing angular direction to the second rotating shell66. The additional bearing surface76is provided around a circumference of the recessed portion33on the outwardly facing surface48of the third rotating shell68in order to assist with further distributing the forces applied to the pivot neck72.", "", "Referring again toFIGS.14to17, the steering assembly60configuration may facilitate a turning angle of up to 95° relative to a straight direction (i.e.) 0° of the vehicle when the wheel10is steered in either direction of rotation. In use, the steering assembly60is operable to rotate by the mechanical rotation of the steering gear77which is mounted to rotate within the stationary outermost shell62. The steering gear77meshes with, and drives, a rotation of the idler gear73which is mounted alongside the steering gear77within the stationary outermost shell62. A slave gear71arranged around, and coupled to, the first ring bearing63meshes with the corresponding idler gear73to mechanically rotate the first rotating shell64about a first shell axis relative to the stationary outermost shell62(e.g. seeFIG.30). As the first rotating shell64is rotated relative to the neutral position (i.e. 0 degrees), the second ring bearing65allows for eccentric offset movement of the second rotating shell66for a corresponding, and opposite, angular rotation about a second shell axis. Similarly, as the second rotating shell66is rotated relative to the neutral position (i.e. 0 degrees) by the movement first rotating shell64, the third ring bearing67allows for eccentric offset movement of the third rotating shell68relative to first rotating shell64for a corresponding angular rotation in the same angular direction first rotating shell64about a third shell axis, and in the opposing angular direction to the second rotating shell66. The rotation of steering gear77thus controls the angular rotation and degree of angular movement of the third rotating shell68, the movement being translated through the various corresponding gears71,73and rotating shells64,66to dictate the steering angle of the wheel10. The third rotating shell68is mounted concentrically to the second rotating shell66. The second rotating shell66is mounted eccentrically relative to first rotating shell64. The first rotating shell64is mounted concentrically to the stationary outermost shell62.", "", "The shells of the steering assembly60are inherently strong due to their substantially spherical shape, thereby allowing for the shells to be formed from less material which may reduce the overall weight and space required. Each shell of the steering assembly60is designed as a relatively lightweight and relatively compact casing that is adapted to distribute the steering loads of the wheel assembly100more evenly, whilst minimising the stress forces at each of the connection points therebetween. The shells of the steering assembly60are nested into each other in a compact manner and partially wrap around the wheel10, motors20,20′,20″ and shaft12, so as to closely conform to the space that the wheel10and motors20,20′,20″ occupy, thereby reducing the overall size of the wheel assembly100. The gaps between each shell of the steering assembly60may be adapted to provide a large surface areas for heat sinks.", "", "The structure of the disclosed steering assembly60is configured to distribute the dynamic load applied between the wheel assembly100and the vehicle chassis away from the singular pivot neck72about which the wheel assembly100is angularly rotated during steering of the vehicle. Referring toFIGS.31to33, the steering assembly60can be represented in a simplified form as a plurality of linkages62′,64′,66′,68′ connected by a plurality of pivot points50,51,52,53. The primary pivot50corresponds to the wheel assembly pivot neck72at which the dynamic load between the wheel assembly100and the vehicle chassis is applied. Each of the static linkage62′, corresponding to the stationary outermost shell62, and wheel linkage68′, corresponding to the third rotating shell68, are pivotally coupled to one another at respective first ends thereof with a primary pivot50defined therebetween. A first end of a first rotating linkage64′ corresponding to the first rotating shell64, is pivotally coupled to the static linkage62′ at a juncture that is a distance away from the primary pivot50along the static linkage62′, defining a first pivot51therebetween. The second end of the first rotating linkage64′ is pivotally coupled to a first end of a second rotating linkage66′, corresponding to the second rotating shell66, defining a second pivot52therebetween. The second end of the second rotating linkage66′ is pivotally coupled to the wheel linkage68′ at a juncture that is a distance away from the primary pivot50along the wheel linkage68′, defining a third pivot53therebetween.", "", "In order to rotate the wheel linkage68′ angularly about the primary pivot50relative to the static linkage62′ the first rotating linkage64′ is controlled to rotated about the first pivot51so as to drive second rotating linkage66′ to rotate about each of the second and third pivots52,53and thereby adjust the relative angular position of the wheel linkage68′ relative to the static linkage62′. Such an arrangement is able to more efficiently support and distribute the dynamic load away from the primary pivot50whilst pivoting the wheel linkage68′ relative to the static linkage62′, as each of the spaced pivot points50,51,52,53are arranged such that an axes passing through each respective one of the pivot points50,51,52,53is angled to converge at a single point of origin. By reducing the magnitude of the dynamic point loads borne at the primary pivot50, and spreading these forces more evenly across a plurality of linkages and pivots, the size of the bearings used to facilitate the pivoting motion can be reduced.", "", "Referring toFIG.33, the diameter of each of bearing74(between the stationary outermost shell62and the first rotating shell64) and bearing76(between the second rotating shell66with the third rotating shell68) are each sufficiently large so as to facilitate an overlap of the bearings74,76. This may help to further spread the load distribution across the steering assembly60when steering the wheel10. The coupling of the stationary outermost shell62to the first rotating shell64and the coupling of the second rotating shell66with the third rotating shell68are both structural in nature, and thus require the support of a larger additional bearing74,76, respectively. The coupling of the first rotating shell64with the second rotating shell66, by contrast, is a means of connecting the two structures together to form the steering assembly60, and therefore requires only the second ring bearing65without the support of an additional larger bearing. The overlap of the paths of the bearings74,76acts to effectively blend the outer two shells62,64together with the inner two shells66,68so as to act as a substantially continuous steering assembly60rather than two separate pivoting structures with one being effectively cantilevered off the other. The nested overlap of the bearings74,76help to spread the point loads acting at the respective pivots to improve the structural strength and integrity of the steering assembly60, even when driving at the maximum angular extension of the wheel10. By distributing the force across thinner bearings74,76of larger diameter, the shells of the steering assembly60can utilise lighter bearings63,65,67which in turn helps to further reduce the overall bulk and weight of the steering assembly60.", "", "As would be appreciated by one skilled in the art, in a similar manner, each of the first, second and third rotating shells64,66,68respectively are configured to rotate about a set of axes that pass through an origin that is concentric to each of the partially spherical or hemispherical shells of the steering assembly60, with the axes radiating in three-dimensions. Thus, the first64and second66rotating shells are configured to swivel eccentrically relative to one another, despite the respective axes through each internal shell being arranged so as to align with a central axis through the shells.", "", "As would be appreciated by one skilled in the art, numerous alternative steering assemblies are possible based on the same principle. Referring toFIGS.34A to34F, an alternative structure is provided having two pivot points50,51supporting the static linkage62″ and three pivot points50,53,53′ supporting the pivoting movement of the wheel linkage68″. The width of the opposing pair of third pivots53,53′ away from the axis through the primary pivot50helps to spread the load experienced by the steering assembly during the rotation of the wheel linkage68″ further away from the primary pivot50. Referring toFIGS.35A to35F, a further alternative structure is provided having three pivot points50,51,51′ supporting the static linkage62′″ and two pivot points50,53supporting the pivoting movement of the wheel linkage68′″. Referring toFIGS.36A to36F, a further alternative structure is provided having three pivot points50,51,51′ supporting the static linkage62″″ and three pivot points50,53,53′ supporting the pivoting movement of the wheel linkage68″″. Referring toFIGS.37A to37F, a further alternative structure is provided having three pivot points50,51,51′ supporting the static linkage62′″″ and three pivot points50,53,53′ supporting the pivoting movement of the wheel linkage68′″″. As a general rule, the more links and/or pivot points used in the steering structure, the more the force distribution is improved, provided all axes through each pivot point converge at a single point along the axis through the primary pivot. However, the increased points of connection may act to limit the range of the angular rotation of the wheel linkage relative to the static linkage.", "", "Furthermore, as would be appreciated by one skilled in the art, the linkages of the steering assembly do not need to be curved or define a substantially spherical-looking steering assembly. The principle behind the steering assembly, as explained above, can be applied to alternative geometric shapes that have converging axes that restrict the freedom of movement based on the axes of the primary pivot.", "", "For example, with reference toFIGS.38to40, the principles of the disclosed steering system can be applied to a bicycle. The design of the bicycle distributes the forces on the frame and front forks further apart than a conventional bicycle frame. The bearing and structure around the primary pivot50can thus be lightweight and compact because the other pivots51,52,53act to support and brace the primary pivot50whilst simultaneously allowing the degree of freedom required for steering the bicycle. The steering assembly may thus be more efficient, utilising less materials, and have a lighter structure whilst exhibiting improved structural strength. A conventional bicycle frame experiences a concentration of forces on one axis in the head tube through which the handles turn the front wheel. The head tube also has to be of sufficient length, diameter, or strength, to retain the front fork within their constraints. By dividing the force across two separate axes, the bicycle can instead use a very short, lightweight head tube, which in turn allows for a greater magnitude of suspension of the front wheel, which is no longer impeded by the head tube. The steering braces in the bicycle allow for a front fork that is rigid enough to support a front swing arm suspension. The bicycle suspension can be extended to hold the wheel in a lowered configuration (e.g.FIGS.39A to39F) or contracted to hold the wheel in an elevated configuration (e.g.FIGS.40A to40F). The front swing arm suspension design acts as a passive anti-dive arrangement that uses the torsional forces generated from braking to counter the diving tendency caused by the forward movement of the centre of mass when braking.", "", "The principles disclosed above in relation to the steering assembly60can also be extended to applications beyond vehicle wheel steering to axial positioning in general. For example, additional applications may include, but are not limited to, slewing pivot assemblies for cranes and excavation machinery, gimbal assemblies for cameras, radar dishes, and two axis joints for robotics etc.", "", "In the foregoing description of preferred embodiments, specific terminology has been resorted to for the sake of clarity. However, the invention is not intended to be limited to the specific terms so selected, and it is to be understood that each specific term includes all technical equivalents which operate in a similar manner to accomplish a similar technical purpose. Terms such as “front” and “rear”, “inner” and “outer”, “above”, “below”, “upper” and “lower” and the like are used as words of convenience to provide reference points and are not to be construed as limiting terms.", "", "The reference in this specification to any prior publication (or information derived from it), or to any matter which is known, is not, and should not be taken as, an acknowledgement or admission or any form of suggestion that prior publication (or information derived from it) or known matter forms part of the common general knowledge in the field of endeavour to which this specification relates.", "", "In this specification, the word “comprising” is to be understood in its “open” sense, that is, in the sense of “including”, and thus not limited to its “closed” sense, that is the sense of “consisting only of”. A corresponding meaning is to be attributed to the corresponding words “comprise”, “comprised” and “comprises” where they appear.", "", "The word “about” or “approximately” when used in relation to a stated reference point for a quality, level, value, number, frequency, percentage, dimension, location, size, amount, weight or length may be understood to indicate that the reference point is capable of variation, and that the term may encompass proximal qualities on either side of the reference point. In some embodiments, the word “about” may indicate that a reference point may vary by as much as 30 percent.", "", "As used herein, the word “substantially” may be used merely to indicate an intention that the term it qualifies should not be read too literally and that the word could mean “sufficiently”, “mostly” or “near enough” for the patentee's purposes.", "", "In addition, the foregoing describes only some embodiments of the invention(s), and alterations, modifications, additions and/or changes can be made thereto without departing from the scope and spirit of the disclosed embodiments, the embodiments being illustrative and not restrictive.", "", "Furthermore, invention(s) have been described in connection with what are presently considered to be the most practical and preferred embodiments, it is to be understood that the invention is not to be limited to the disclosed embodiments, but on the contrary, is intended to cover various modifications and equivalent arrangements included within the spirit and scope of the invention(s). Also, the various embodiments described above may be implemented in conjunction with other embodiments, e.g., aspects of one embodiment may be combined with aspects of another embodiment to realize yet other embodiments. Further, each independent feature or component of any given assembly may constitute an additional embodiment."], "claims": ["1 . A wheel assembly, the wheel assembly comprising a wheel that is rotatable about a shaft, the wheel being supported by a plurality of connecting members to rotate about a plurality of motors arranged on the shaft, the plurality of motors being operable to control the connecting members so as to adjust a distance between the shaft and a rim of the wheel.", "2 . The wheel assembly of claim 1 , wherein the plurality of motors locate within the boundaries of the wheel.", "3 . The wheel assembly of claim 2 , wherein the wheel assembly comprises a control system that is configured to simultaneously control an acceleration and/or deceleration of each of the plurality of motors whereby, in use, the plurality of motors are operative in a communicative manner to rotate the wheel about the shaft.", "4 . The wheel assembly of claim 3 , wherein each of the plurality of motors is controlled to accelerate and/or decelerate independently of the other motors of the plurality of motors, whereby in use a velocity of each of the plurality of motors is simultaneously variable.", "5 . The wheel assembly of claim 3 , wherein each of the plurality of motors is controlled to sinusoidally accelerate and decelerate during a single revolution of the wheel.", "6 . The wheel assembly of claim 5 , wherein a timing of the sinusoidal acceleration and deceleration of an individual motor is offset relative to the sinusoidal acceleration and deceleration of the other motors of the plurality of motors.", "7 . The wheel assembly of claim 1 , wherein the plurality of connecting members are spokes that extend between the plurality of motors and the wheel, each spoke defining a motor linkage where the spoke is coupled to one of the plurality of motors, and a wheel linkage where the spoke is coupled to the wheel.", "8 . The wheel assembly of claim 7 , wherein the spokes are pivotable about each of the motor linkage and the wheel linkage, and/or wherein each wheel linkage is spaced equidistantly around a circumference of the wheel, and/or wherein, in use, a relative spacing between each of the plurality of motor linkages is adjustable, and/or wherein a single spoke extends between the wheel and each of the plurality of motors, and/or wherein each of the spokes is rigid.", "9 .- 12 . (canceled)", "13 . The wheel assembly of claim 7 , wherein, in use, an acceleration of one of the plurality of motors relative to the other motors of the plurality of motors controllably orientates a corresponding one of the spokes that is attached to said one of the plurality of motors, whereby a distance between a corresponding motor linkage and the wheel is decreased.", "14 . The wheel assembly of claim 7 , wherein, in use, a deceleration of one of the plurality of motors relative to the other motors of the plurality of motors controllably orientates a corresponding one of the spokes that is attached to said one of the plurality of motors, whereby a distance between a corresponding motor linkage and the wheel is increased.", "15 . The wheel assembly of claim 13 , wherein a timing of the sinusoidal acceleration and deceleration of an individual motor is offset relative to the sinusoidal acceleration and deceleration of the other motors of the plurality of motors, and, wherein, in use, each one of the plurality of motors are controlled to reach a peak velocity, respectively, when a corresponding one of the spokes that is attached to said one of the plurality of motors is at a position during each revolution that substantially corresponds to 90 degrees of a unit circle, whereby the rim of the wheel is adjusted to move downwards relative to the shaft.", "16 . The wheel assembly of claim 13 , wherein a timing of the sinusoidal acceleration and deceleration of an individual motor is offset relative to the sinusoidal acceleration and deceleration of the other motors of the plurality of motors, and wherein, in use, each one of the plurality of motors are controlled to reach a peak velocity, respectively, when a corresponding one of the spokes that is attached to said one of the plurality of motors is at a position during each revolution that substantially corresponds to 270 degrees of a unit circle, whereby the rim of the wheel is adjusted to move upwards relative to the shaft.", "17 . The wheel assembly of claim 1 , wherein the rim of the wheel is restricted to movement in the Y-axis relative to the shaft.", "18 . The wheel assembly of claim 3 , wherein the wheel assembly further comprises a mechanism that detects a state of the ground surface that contacts the wheel assembly in use, and communicates said state of the ground surface to the control system.", "19 . The wheel assembly of claim 18 , wherein, in response to the detected state of the ground surface, the control system controls the acceleration and/or deceleration of each of the plurality of motors to adjustably shift the rim of the wheel relative to the shaft to effect a force dampening on the shaft and/or the wheel.", "20 . The wheel assembly of claim 18 , wherein the mechanism is an accelerometer.", "21 . The wheel assembly of claim 1 , wherein the assembly comprises three motors.", "22 .- 27 . (canceled)", "28 . The wheel assembly of claim 7 , wherein each motor linkage is spaced equidistantly around a circumference of the plurality of motors when the plurality of motors operate at a common velocity.", "29 . A wheel assembly, the wheel assembly comprising a wheel that is rotatable about a shaft, the wheel being supported by a plurality of connecting members to rotate about a plurality of motors that are arranged on the shaft, the plurality of motors being operable to control the connecting members so as to adjustably shift a central axis through the wheel relative to a central axis through the shaft.", "30 . A wheel assembly, the wheel assembly comprising one or more motors that are arranged on a shaft and coupled by one or more connecting members to a wheel such that the wheel is driven by the one or more motors to rotate about a central axis of the shaft, the shaft being fixed so as to not rotate about the central axis therethrough, wherein the one or more motors are operable to control the one or more connecting members so as to adjustably shift a central axis through the wheel relative to the central axis through the shaft.", "31 .- 53 . (canceled)"], "bibtex": "@patent{20240424831,\n    title = {Wheel Assembly},\n    number = {20240424831},\n    year = {2024},\n    note = {File: US20240424831A1-20241226.XML}\n    }", "classification": "B60B2704FI"}, {"title": "TIRE INCORPORATING A RUBBER COMPOSITION INCLUDING A SPECIFIC HYDROCARBON RESIN", "doc_number": "20240424832", "filename": "US20240424832A1-20241226.XML", "abstract": "Described herein are tires comprising a rubber composition based on at least an elastomer and a hydrocarbon resin. The hydrocarbon resin is based on a cyclic monomer selected from the group consisting of a distillation cut from a petroleum refinery stream, C 4 , C 5 and C 6 cyclic olefins and mixtures thereof. The hydrocarbon resin has a content of aromatic protons (H Ar, expressed in mol %), a glass transition temperature (Tg, expressed in ° C.), and a number average molecular weight (Mn, expressed in g/mol) that are represented by (1) 12 mol %≤H Ar≤19 mol %, (2) Tg≥95-2.2*(H Ar), (3) Tg≥−53+(0.265*Mn) and (4) 300 g/mol≤Mn≤450 g/mol.", "detailed_description": ["Provided herein are tires comprising a rubber composition based on at least an elastomer and a hydrocarbon resin, wherein said hydrocarbon resin is based on a cyclic monomer selected from the group consisting of a distillation cut from a petroleum refinery stream, C4, C5and C6cyclic olefins and mixtures thereof, and wherein the hydrocarbon resin has a content of aromatic protons (H Ar, expressed in mol %), a glass transition temperature (Tg, is expressed in ° C.), and a number average molecular weight (Mn, expressed in g/mol) that are represented by (1) 12 mol %≤H Ar≤19 mol %, (2) Tg≥95−2.2*(H Ar), (3) Tg≥−53+(0.265*Mn) and (4) 300 g/mol≤Mn≤450 g/mol."], "claims": ["1 .- 15 . (canceled)", "wherein the hydrocarbon resin is based on a cyclic monomer selected from the group consisting of a distillation cut from a petroleum refinery stream, C wherein the hydrocarbon resin has a content of aromatic protons H Ar expressed in mol %, a glass transition temperature Tg expressed in ° C., and a number average molecular weight Mn expressed in g/mol that are represented by", "17 . The tire according to claim 16 , wherein the transition temperature Tg ranges from 70° C. to 95° C.", "18 . The tire according to claim 16 , wherein the hydrocarbon resin is further characterized by a Z-average molecular weight M z of less than 1000 g/mole.", "19 . The tire according to claim 16 , wherein the hydrocarbon resin comprises the cyclic monomer in an amount between 10 wt. % and 90 wt. %.", "20 . The tire according to claim 16 , wherein the cyclic monomer is selected from the group consisting of cyclopentene, cyclopentadiene, dicyclopentadiene, cyclohexene, 1,3-cyclohexadiene, 1,4-cyclohexadiene, methylcyclopentadiene, di(methylcyclopentadiene) and mixtures thereof.", "21 . The tire according to claim 16 , wherein the hydrocarbon resin comprises methylcyclopentadiene in an amount between 0.1 wt. % and 15 wt. %.", "22 . The tire according to claim 16 , wherein the hydrocarbon resin is further based on an aromatic monomer.", "23 . The tire according to claim 22 , wherein the aromatic monomer is selected from the group consisting of olefin-aromatic compounds, aromatic distillation cuts and mixtures thereof.", "24 . The tire according to claim 22 , wherein the aromatic monomer is an aromatic distillation cut.", "25 . The tire according to claim 22 , wherein the aromatic monomer comprises an olefin-aromatic compound selected from the group consisting of indene derivatives, vinylaromatic compounds and mixtures thereof.", "wherein R", "a number average molecular weight (Mn) of between 350 and 420 g/mol, a glass transition temperature (Tg) represented by Tg≥100−2.2*(H Ar), and a glass transition temperature (Tg) represented by Tg≥−32+(0.265*Mn).", "28 . The tire according to claim 16 , wherein a content of the hydrocarbon resin is within a range extending from 15 to 150 phr.", "29 . The tire according to claim 16 , wherein the elastomer predominantly comprises an elastomer having a glass transition temperature Tg of less than −40° C.", "30 . The tire according to claim 16 , wherein the elastomer predominantly comprises an elastomer selected from the group consisting of essentially unsaturated diene elastomers."], "bibtex": "@patent{20240424832,\n    title = {TIRE INCORPORATING A RUBBER COMPOSITION INCLUDING A SPECIFIC HYDROCARBON RESIN},\n    number = {20240424832},\n    year = {2024},\n    note = {File: US20240424832A1-20241226.XML}\n    }", "classification": "B60C100FI"}, {"title": "TIRE INCORPORATING A RUBBER COMPOSITION INCLUDING A SPECIFIC HYDROCARBON RESIN", "doc_number": "20240424833", "filename": "US20240424833A1-20241226.XML", "abstract": "Described herein are tires comprising a rubber composition based on at least an elastomer matrix comprising at least one copolymer of butadiene and of vinylaromatic monomer and a hydrocarbon resin. The hydrocarbon resin is based on a cyclic monomer selected from the group consisting of a distillation cut from a petroleum refinery stream, C 4 , C 5 and C 6 cyclic olefins and mixtures thereof. The hydrocarbon resin has a content of aromatic protons (H Ar, expressed in mol %), a glass transition temperature (Tg, expressed in ° C.), and a number average molecular weight (Mn, expressed in g/mol) that are represented by (1) 12 mol %≤H Ar≤19 mol %, (2) Tg≥95−2.2*(H Ar), (3) Tg≥−53+(0.265*Mn) and (4) 300 g/mol≤Mn≤450 g/mol.", "detailed_description": ["Provided herein are tires comprising a rubber composition based on at least an elastomer matrix comprising from 50 to 100 phr of one or more copolymers of butadiene and of vinylaromatic monomer, having a content of vinylaromatic units of between 0 and 5% by weight and a Tg within a range extending from −110° C. to −70° C.; and a hydrocarbon resin, wherein said hydrocarbon resin is based on a cyclic monomer selected from the group consisting of a distillation cut from a petroleum refinery stream, C4, C5and C6cyclic olefins and mixtures thereof, and wherein the hydrocarbon resin has a content of aromatic protons (H Ar, expressed in mol %), a glass transition temperature (Tg, is expressed in ° C.), and a number average molecular weight (Mn, expressed in g/mol) that are represented by (1) 12 mol %≤H Ar≤19 mol %, (2) Tg≥95−2.2*(H Ar), (3) Tg≥−53+(0.265*Mn) and (4) 300 g/mol≤Mn≤450 g/mol."], "claims": ["1 .- 15 . (canceled)", "wherein the hydrocarbon resin is based on a cyclic monomer selected from the group consisting of a distillation cut from a petroleum refinery stream, C wherein the hydrocarbon resin has a content of aromatic protons H Ar expressed in mol %, a glass transition temperature Tg expressed in ° C., and a number average molecular weight Mn expressed in g/mol that are represented by", "17 . The tire according to claim 16 , wherein the transition temperature Tg of the hydrocarbon resin ranges from 70° C. to 95° C.", "18 . The tire according to claim 16 , wherein the hydrocarbon resin is further characterized by a Z-average molecular weight M z of less than 1000 g/mole.", "19 . The tire according to claim 16 , wherein the hydrocarbon resin comprises the cyclic monomer in an amount between 10 wt. % and 90 wt. %.", "20 . The tire according to claim 16 , wherein the cyclic monomer is selected from the group consisting of cyclopentene, cyclopentadiene, dicyclopentadiene, cyclohexene, 1,3-cyclohexadiene, 1,4-cyclohexadiene, methylcyclopentadiene, di(methylcyclopentadiene) and mixtures thereof.", "21 . The tire according to claim 16 , wherein the hydrocarbon resin comprises methylcyclopentadiene in an amount between 0.1 wt. % and 15 wt. %.", "22 . The tire according to claim 16 , wherein the hydrocarbon resin is further based on an aromatic monomer.", "23 . The tire according to claim 22 , wherein the aromatic monomer is selected from the group consisting of olefin-aromatic compounds, aromatic distillation cuts and mixtures thereof.", "24 . The tire according to claim 22 , wherein the aromatic monomer is an aromatic distillation cut.", "wherein R wherein R", "a number average molecular weight (M a glass transition temperature (Tg) represented by Tg≥100−2.2*(H Ar), and a glass transition temperature (Tg) represented by Tg≥−32+(0.265*Mn).", "27 . The tire according to claim 16 , wherein a content of the hydrocarbon resin is within a range extending from 15 to 150 phr.", "28 . The tire according to claim 16 , wherein the at least one copolymer of butadiene and of vinylaromatic monomer has a Tg within a range extending from −110° C. to −80° C.", "29 . The tire according to claim 16 , wherein the at least one copolymer of butadiene and of vinylaromatic monomer has a content of vinylaromatic units of 1 to 4% by weight relative to the total weight of the copolymer, and a content of vinylaromatic units, relative to the diene portion, ranging from 8 to 15% by weight.", "30 . The tire according to claim 16 , wherein at least 70% by weight of the at least one copolymer of butadiene and of vinylaromatic monomer is functionalized."], "bibtex": "@patent{20240424833,\n    title = {TIRE INCORPORATING A RUBBER COMPOSITION INCLUDING A SPECIFIC HYDROCARBON RESIN},\n    number = {20240424833},\n    year = {2024},\n    note = {File: US20240424833A1-20241226.XML}\n    }", "classification": "B60C100FI"}, {"title": "TIRE COMPRISING A LOW ANGLE BELT", "doc_number": "20240424834", "filename": "US20240424834A1-20241226.XML", "abstract": "The present invention is directed to a tire comprising a tread and a belt portion located radially below the tread, wherein the belt portion comprises a pair of working belts and a low angle belt. The low angle belt has reinforcement elements having an angle of less than 5° with a circumferential direction of the tire. In a first aspect, the low angle belt comprises a first layer and one or more further layers, wherein the first layer extends over at least 70% of the axial width of the axially largest working belt, and wherein each layer of the one or more further layers extends over at most 50% of the width of the axially largest working belt and is arranged radially below one of the shoulder grooves.", "detailed_description": ["In the first aspect, the present invention is directed to a tire comprising a tread and a belt portion located radially below the tread, wherein the tread has two shoulder portions, each shoulder portion comprising a, preferably circumferentially extending, shoulder groove. The belt portion comprises a pair of working belts and a low angle belt, wherein the low angle belt has reinforcement elements having an angle of less than 5° (preferably less than 2° or 1°) with a circumferential direction of the tire. The low angle belt comprises a first layer and one or more further layers, wherein the first layer extends over at least 70% (preferably, over at least 75%, and/or less than 95%) of the axial width of the axially largest working belt. Each layer of the one or more further layers of the low angle belt extends over at most 50% (preferably at most 30%, and/or preferably over at least 5%) of the axial width of the axially largest working belt and is arranged radially below one of the shoulder grooves.", "", "Such a construction of the tire having a pair of working belts and a low angle belt, particularly comprising a layer provided radially below a shoulder groove, has been found to improve robustness of the tire, especially in the shoulder area of the tread and/or belt portion. In particular, such a multilayer design of the low angle belt helps to improve durability of the low angle belt, and particularly of its reinforcements, in a shoulder area of the tire.", "", "In one embodiment, the low angle belt comprises at least one ply strip. The ply strip is preferably a wound ply strip. It can be considered as wound (e.g., spirally/helically wound) about an axial direction of the tire, e.g., to form at least one layer of the low angle belt. The strip may be wound at an angle of less than 5° with the circumferential direction of the tire. Preferably, such an angle is between 0.1° and 4°, or between 0.1° and 2°, or even more preferably between 0.2° and 1°. This angle is preferably the same angle as the angle of the parallel and/or elongated reinforcement elements of the ply strip. The reinforcement elements of the ply strip are preferably coated with a (coating) rubber composition so as to form the ply strip. In other words, the ply strip comprises reinforcement elements coated by a rubber composition.", "", "In another embodiment, each of the one or more further layers (e.g., a second layer and/or a third layer) extends over an axial width corresponding to 5% to 30% (preferably 5% to 20%) of the axial width of the axially largest working belt. Alternatively, or in addition, each of the one or more further layers (e.g., a second layer and/or a third layer) extends over an axial width corresponding to a range of 90% to 300% (preferably, of 100% or 110% to 250%) of the axial width of the (radially outer or outermost) opening of a respective shoulder groove located radially above the respective further layer of the low angle belt.", "", "In another embodiment, the one or more further layers comprise a second layer arranged radially below a first shoulder groove, and a third layer arranged radially below a second shoulder groove. Preferably, the low angle belt comprises only these three layers.", "", "In another embodiment, the tread comprises four circumferential grooves, including two shoulder grooves, wherein one of the shoulder grooves is located at each axially/laterally outer side of the tread.", "", "In still another embodiment, the axially largest working belt (which is preferably the radially inner working belt) extends over an axial width which is within a range of 110% to 200%, preferably from 115% to 160%, of the axial distance between the axially (and radially) outer edges of the shoulder grooves. An axially (and radially) outer edge of a shoulder groove can also be described as an axially outer edge of a radially outer opening of such a groove.", "", "In another embodiment, each of the first layer, the second layer, and the third layer are formed by at least one ply strip comprising the reinforcement elements. It is possible that each layer is formed by one or more separate ply strips. Optionally, each strip is wound and/or constructed as mentioned herein above.", "", "In another embodiment, the first layer, the second layer and the third layer are formed by the same ply strip. For instance, it is possible that the second layer is helically wound about a radially lower working belt from an axially inner position towards a first axially outer position. From the first axially outer position the strip is wound radially on top of the second layer in an axially inner direction so as to form the first layer, covering at least 70% of the axial width of the axially largest working belt. From a second axially outer (or outermost) position (e.g., on an opposite axial/lateral side of the tire) of the first layer, the axial winding direction of the strip is reversed so as to provide the third layer on top of the first layer. Providing all three layers with one strip is particularly fast and cost efficient. Also, different tire widths and diameters can be built with such a method, e.g., by using only a single strip type.", "", "In another embodiment, one or more of the first layer, the second layer, and the third layer are each formed by at least one separate ply strip.", "", "In still another embodiment, the second layer is located radially below the first layer and the third layer is located radially above the first layer. Such a preferred construction is easy to manufacture in one strip winding step.", "", "In still another embodiment, both of the second layer and the third layer are located either radially below the first layer or radially above the first layer. It is also possible that the second layer and the third layer are provided at essentially the same radial height. However, each of the second layer and the third layer preferably forms a circumferential band radially below each shoulder groove or shoulder of the tire. A position radially below each shoulder groove or shoulder of the tire does not exclude that one or more further belts are provided radially above the second and/or third layer between the second and/or third layer and the shoulder groove.", "", "In still another embodiment, the low angle belt (including its layers) is provided radially between the two working belts of the pair of working belts.", "", "In still another embodiment, the ply strip has an axial width within a range of 1.5 mm to 25 mm (preferably from 3 mm to 16 mm, or from 3 mm to 9 mm), and/or a radial thickness within a range of 0.5 mm to 3 mm, (preferably from 1 mm to 3 mm). Such radial thickness values may also apply to other belts or belt plies mentioned herein, including one or more of working belts, transition belts and top belts.", "", "In still another embodiment, the ply strip comprises from 1, preferably from 2 to 5 parallel reinforcement elements selected from one or more of cords and wires.", "", "In still another embodiment, the ply strip has a density of parallel reinforcement elements ranging from 10 EPI to 20 EPI.", "", "In still another embodiment, the working belts have a density of parallel reinforcement elements ranging from 8 EPI to 15 EPI, preferably from 10 EPI to 14 EPI.", "", "In still another embodiment, the said reinforcement elements are one or more of: elongated reinforcement elements; metal reinforcement elements; metal and/or hybrid cords, optionally comprising multiple metal wires/filaments. A preferred metal herein is steel. Metal reinforcement elements may optionally be coated with brass. In a most preferred embodiment, the reinforcement elements are brass-coated steel cords, particularly comprising multiple steel wires.", "", "In still another embodiment, the reinforcement elements (e.g., of the working belts and/or the low angle belts) are metal cords having a construction a+b×d, wherein a is ranging from 2 to 5 (metal wires/filaments), b is ranging from 2 to 4 (metal wires/filaments) and d (the respective diameter of the metal wires/filaments) is ranging from 0.2 mm to 0.5 mm (preferably from 0.3 mm to 0.45 mm. In particular such a construction is considered to be relatively open for rubber penetration which further improves robustness of the tire.", "", "In another embodiment, the cords (e.g., of the working belts and/or the low angle belts, preferably of all of them) have the construction 4+3×0.35. In this examples, four inner filaments (or wires) are straight, and three filaments are twisted over the four inner filaments. Alternatively, the thickness of the single wires/filaments forming the cord is preferably within a range t of 0.15 to 0.35 mm. Accordingly, the metal cord may have the construction 4+3×t, such as with t as mentioned above.", "", "In another embodiment, the reinforcement elements or cords have an elongation at 10% of their breaking force which is higher than 0.2% or 0.21%, and preferably lower than 0.4%, 0.35%, 0.3%, or 0.29%, measured after extraction from the cured tire. Preferably such values apply to the cords of the working belts and/or the cords of the low angle belt. Cord elongation or tensile tests on the cords are carried out herein for cords extracted out of the cured tire according to ISO 6892-1B, with a preload of 20 MPa.", "", "In still another embodiment, the pair of working belts comprises a first working belt and a second working belt, wherein the low angle belt is arranged between the first working belt and the second working belt, wherein each working belt of the pair of working belts comprises parallel reinforcement elements, and wherein the reinforcement elements of the first working belt and the reinforcement elements of the second working belt cross each other at an opposing angle, or in other words, with an opposite angular orientation.", "", "In still another embodiment, the absolute value of the angle of the (respective) reinforcement elements of each working belt with the circumferential direction ranges from 10° to 50°, preferably from 15° to 30°, or more preferably from 15° to 25°. Alternatively, or in addition, the difference between i) the absolute value of the angle of the reinforcement elements of the first working belt and ii) the absolute value of the angle of the reinforcement elements of the second working belt is at least 2° (preferably at least 3° and/or at most 15°, or at most 8°, or only at most 6°). Preferably, the radially innermost working belt has the larger absolute angle. This is for instance preferred to have this angle closer to an angle of an/the at least one carcass ply, which has preferably an angle of 90° with the circumferential direction. Preferably, the belt portion has no transition belt in such an embodiment between the radially innermost working belt and the adjacent carcass ply, which is provided radially below said innermost working belt.", "", "In still another embodiment, each working belt of the pair of working belts comprises parallel reinforcement elements, wherein at least one of i) the reinforcement elements of the workings belts, and ii) the reinforcement elements of the low angle belt have a relative elongation at 10% of their/the breaking force which is lower than 0.4% (preferably, lower than 0.3%, or lower than 0.29%). Optionally, said elongation is at least 0.2% or 0.21%.", "", "In still another embodiment, the tire further comprises a top belt arranged radially above the low angle belts and the pair of working belts. The top belt preferably comprises parallel reinforcement elements having an angle within a range of 10° to 25°, preferably 14° to 21°, with the circumferential direction of the tire. Optionally, the top belt is axially narrower than each of the workings belts and the first layer of the low angle belt.", "", "In still another embodiment, the top belt comprises a rubber composition reinforced by cords (e.g., metal, textile, or hybrid cords). Preferably, the cords are metal cords. Suitable cord constructions include for example, 3+2×0.35 and/or 5×0.35 and/or 5×0.38.", "", "In still another embodiment, the belt portion has exactly four belts, i.e., the two working belts, the low angle belt (with multiple layers, preferably exactly three layers) and the top belt.", "", "In still another embodiment, the top belt has an axial width of at least 50% of the axial width of the axially largest working belt and/or the radially innermost working belt. In addition, or alternatively, the axial width of the top belt is within a range of 50% to 90% (preferably 60% to 80%) of the axially largest working belt and/or the radially innermost working belt.", "", "In yet another embodiment, the tire further comprises a transition belt arranged radially below the low angle belts and the pair of working belts. Optionally, the transition belt comprises parallel reinforcement elements having an angle within a range of 35° to 90° (preferably of 50° to 90°, or more preferably of 50° to) 75° with the circumferential direction of the tire. Preferably, the transition belt is axially narrower than each of the workings belts and the first layer of the low angle belt.", "", "In still another embodiment, the tire further comprises a rubber ply arranged between the radially inner working belt and the radially outermost carcass ply. Such a rubber ply is preferably devoid of reinforcements. Optionally, it has a radial thickness within a range of 0.5 mm to 3 mm, preferably within a range of 1 mm to 2.5 mm. Preferably, it has a stiffness which is at most the stiffness of the rubber composition of the radially inner working belt. Preferably, such a stiffness of the rubber composition of the rubber ply is at least 5% lower than the stiffness of the rubber composition of the radially inner working belt. Stiffness is determined herein as G′ (1%). G′ is obtained herein at 100° C. and 1 Hz at 1% strain with an RPA 2000™ Rubber Process Analyzer of the company Alpha Technologies, based on ASTM D5289, or equivalent.", "", "In still another embodiment, one or more of the first layer, the second layer, and the third layer (of the low angle belt), do not axially extend beyond an adjacent axially outer edge of the one or more of the working belts.", "", "In still another embodiment, one or more of the first layer, the second layer, and the third layer, extends axially beyond an adjacent axially outer edge of a top belt (if present). Preferably, one or more of the first layer, the second layer, and the third layer extend less than 10%, (preferably less than 5%) of the total axial width of the top belt beyond an axially outer edge of the top belt.", "", "In still another embodiment, the belt portion has one or more of the following: a first layer of the low angle belt which is axially larger than a top belt; a first working belt which is axially larger than the first layer, and a second working belt which is axially larger than the first working belt (and which is preferably provided between the top belt and the low angle belt), wherein the first working belt is preferably provided radially below the top belt, the second working belt, and the layers of the low angle belt.", "", "In another embodiment, each of the belts extends in an axially outer direction so as to support a shoulder groove on each lateral/axial side of the tire. In other words, each belt optionally extends to an outer axial position which is axially outside a radial outermost end of an axially outer sidewall of a respective shoulder groove.", "", "In still another embodiment, at least one of the working belts and/or the low angle belt have a rubber penetration of at least 90%, preferably of at least 95%, even more preferably of at least 99% or 100%. Rubber penetration is measured herein through an air permeability test according to L. BOURGOIS, Survey of Mechanical Properties of Steel Cord and Related Test Methods, Special Technical Publication 694, ASTM, 1980. Such a high rubber penetration provides an even higher durability of the respective belt layers and helps to avoid cord breaking.", "", "According to the second aspect of the present invention, the invention is directed to a tire comprising a tread and a belt portion located radially below the tread, wherein the belt portion comprises a pair of working belts and a low angle belt comprising at least one ply strip. The ply strip has parallel reinforcement elements having an angle of less than 5° with a circumferential direction of the tire. The pair of working belts comprises a first working belt and a second working belt, wherein each working belt of the pair of working belts comprises parallel reinforcement elements, and wherein the reinforcement elements of the first working belt and the reinforcement elements of the second working belt cross each other at an opposing angle, or, in other words, at opposite angular orientation. Furthermore, an absolute value of the angle of the reinforcement elements of each working belt with the circumferential direction ranges from 10° to 50° preferably from 15° to 30°, or 15° to 25°. Still in accordance with the second aspect of the present invention, the difference between i) the absolute value of the angle with the circumferential direction of the reinforcement elements of the first working belt and ii) the absolute value of the angle with the circumferential direction of the reinforcement elements of the second working belt is at least 2° (preferably at least 3° and/or at most 10°, or at most 8°, or only at most 6°).", "", "Such a combination of a low angle belt with a pair of working belts has been found to be particularly desirable to provide a robust belt portion for a tire, such as a truck tire.", "", "Preferably, the low angle belt is provided between the first working belt and the second working belt.", "", "In one embodiment, the absolute value of the angle of a radially inner working belt is from 2° to 10° (preferably from 3° to 8°) larger than the absolute value of the angle of a radially outer working belt. In particular, it has been found by the inventors that such a relatively small difference is of advantage for the durability of the belt portion.", "", "In another embodiment, the tread has two shoulder portions, with each shoulder portion optionally comprising a shoulder groove, and wherein the low angle belt comprises a first layer and one or more further layers. Optionally, the first layer of the low angle belt extends over at least 70% of the axial width of the axially largest working belt. In addition, or alternatively, each layer of the one or more further layers of the low angle belt extends over at most 50%, preferably at most 30%, of the width of the axially largest working belt and/or is arranged radially below one of the shoulder grooves, particularly to support at least the whole axial width of the respective shoulder groove (measured at the radially outermost opening of such a shoulder groove).", "", "In still another embodiment, the reinforcement elements of the workings belts, and/or the reinforcement elements of the low angle belt have a relative elongation at 10% of their/the breaking force which is within a range of 0.2% and 0.29%.", "", "In still another embodiment, one or more, preferably all layers, of the low angle belt are formed by a single ply strip.", "", "In still another embodiment, the tire is one or more of: a pneumatic tire; a radial tire; one of a 17.5, 19.5, 22.5 and a 24.5 inch tire; a truck tire; a tire having at least one steel reinforced carcass ply; a tire comprising steel reinforced working belts and/or a reinforced low angle belt formed by steel reinforced ply strip.", "", "In the third aspect, the invention is directed to a tire comprising a tread and a belt portion located radially below the tread, wherein the tread has a first shoulder portion on a first lateral (or axial) side of the tire and a second shoulder portion on a second lateral (or axial) side of the tire, which is opposite to said first side. The belt portion comprises a pair of working belts and a low angle belt, wherein the low angle belt comprises at least one helically wound ply strip (e.g., helically wound about the axial direction) comprising at least one elongated reinforcement element (such as at least one cord) having an angle of less than 5° with a circumferential direction of the tire. Furthermore, the low angle belt comprises a first layer, a second layer and a third layer, formed by said at least one helically wound ply strip. The first layer extends over at least 70% of the axial width of the axially largest working belt, and the second layer is arranged radially below the first layer and below the first shoulder portion, and optionally below a circumferential shoulder groove of said portion. The third layer is arranged radially above the first layer and below the second shoulder portion, and optionally below a circumferential shoulder groove of said portion, wherein each of the second layer and the third layer extends over at most 50% (preferably at most 30% and/or at least 5% or 10%) of the axial width of the axially largest working belt.", "", "In one embodiment, the second layer and/or the third layer is arranged axially outside a respective shoulder groove of the respective shoulder portion.", "", "It is emphasized herein that embodiments and/or features of the first aspect and/or the second aspect can also be applied to the third aspect.", "", "According to the fourth aspect of the present invention, the present invention is directed to a method of building a tire (such as one of the tires mentioned herein above) having a tread with two shoulder portions, each shoulder portion having preferably a circumferential shoulder groove, wherein the method comprises one or more of the following steps:Providing at least one carcass ply, e.g., on a tire building drum;Optionally applying a transition belt onto the carcass ply;Applying a first working belt onto the carcass ply and/or the transition belt;Applying a low angle belt onto the first working belt, preferably including one or more of the following sub-steps a) to c):a) Winding, in a first winding step, a ply strip about (or around) the first working belt so as to form a circumferential band (or layer) of the low angle belt extending over an axial portion of the first working belt, radially below a first one of the shoulder portions and/or a first one of the shoulder grooves (wherein said band or layer has preferably an axial width of at most 50% or 30% (and/or at least 5%) of the axial width of the first working belt);b) Continue winding, in a second winding step, the same ply strip (preferably in a reversed axial orientation than in the first winding step) so as to form another layer of the low angle belt covering at least 70% (and/or at most 95%) of the width of the first working belt and preferably also said band or layer formed in the first winding step;c) Continue winding, in a third winding step, the same ply strip (preferably in the same axial orientation as in the first winding step) so as to form a further circumferential band (or layer) of the low angle belt extending over an axial portion of the low angle belt and/or said another layer formed in the second winding step, radially below a second shoulder portion and/or a second shoulder groove (on a side of the tire axially opposite to said first one of the shoulder portions and/or grooves), wherein said further band (or layer) has preferably an axial width of at most 50% or 30% (and/or at least 5%) of the axial width of the first working belt;Applying a second working belt onto the low angle belt;Applying a top belt onto the second working belt, wherein the second working belt and the top belt may optionally be applied together as one member onto the low angle belt;Applying a tread onto the second working belt and/or the top belt, if present.", "", "The above method provides a very efficient way to provide a low angle belt to increase robustness of the belt portion and the tread, such as to the shoulder portions, particularly the shoulder grooves.", "", "In one embodiment, the first winding step, the second winding step and the third winding step are carried out continuously, e.g., in one pass.", "", "In another embodiment, said winding is helically winding, such as about the axial direction, and/or as described in other passages herein.", "", "It is emphasized that the method of building a tire is not limited to the mentioned steps and that such a method does not exclude further manufacturing or mounting steps of further tire components, e.g., sidewalls, chafers, beads, apexes, overlays, etc. Such steps could also be present between one or more of the above-mentioned steps.", "", "FIG.1shows a tire1in accordance with a preferred embodiment of the present invention. The tire1has a tread20, a pair of sidewalls30, a pair of bead portions40, a carcass ply50, and an innerliner60. Each bead portion40comprises a bead41and a bead apex42. Moreover, the tire1has a belt portion100comprising multiple belts including a first working belt110, a second working belt130, a low angle belt120(sometimes also referred to as a zero-degree belt), and a top belt140. In accordance with the embodiment ofFIG.1, the low angle belt120comprises three layers, i.e., a first layer121, a second layer122and a third layer123. Each of the second layer122and third layer123are arranged radially below a respective shoulder groove21of the tread20.", "", "The first working belt110and the second working belt130have parallel and elongated reinforcements or reinforcement elements, in this case metal cords, which have an angle with the circumferential direction c within a range of 10° to 50°. The reinforcement elements of the first working belt110cross the reinforcement elements of the second working belt130with opposite angular orientation, wherein that angle of the first working belt110with the circumferential direction c is in a preferred embodiment 4° larger than such an angle of the second working belt130with the circumferential direction c. As further schematically shown inFIG.1, the low angle belt comprises at least one ply strip which is wound to form the low angle belt120. In particular, the metal cords of the low angle belt120, particularly in the ply strip of the low angle belt120, have an angle with the circumferential direction c which is smaller than 1° in the present example. The ply strip is helically wound about the axial direction a on top of the circumferential first working belt110. In the preferred embodiment shown inFIG.1, the whole low angle belt120, comprising three layers, is formed by a single ply strip. In particular, such a ply strip is helically wound from an axially inner position to an axially outer end position so as to form the second layer122. After having reached an axially outer end position of the second layer122, the ply strip is still wound about the axial direction of the tire1but is moved during continued winding in an axially inner direction so as to form the first layer121(inFIG.1from the left-hand side to the right-hand side). After continued winding of the ply strip radially above the first working belt110, the axially outer movement during winding is stopped and reversed again at an axially outer end position on the right-hand side of the tire1and so as to continue moving during winding again in an axially inner direction of the tire1. By said axially inner movement, the third layer123of the low angle belt120is formed. Finally, the axially inner movement and the winding is stopped as soon as the desired width of the third layer123has been obtained. In the present embodiment, it is desired that each of the second and third layers covers at least the bottom of the respective shoulder groove radially above each of the second and third layers121,123. The overall axial width of the low angle belt120is preferably larger than the total axial width of the top belt140, e.g. at least 1% axially larger and/or at most 10% axially larger than the axial width of the top belt140. The width of the first working belt110is larger than the width of the second working belt130, preferably within a range of 5% to 20% larger than the width of the second working belt130. On the one hand, the total axial width of one of the second layer122and the third layer123of the low angle belt120is preferably within a range of 10% to 30% of the axial width of the first working belt110(which is in this case the axially largest belt of the belt portion100). On the other hand, the width of the second layer122or the third layer123of the low angle belt120is preferably within a range of 90% to 250% of the axial width of the outermost opening of the respective shoulder groove21located radially above the second layer122or the third layer123. The top belt140is the axially narrowest belt in the present embodiment. As shown in the present embodiment, it is preferred to have four belts in total. Moreover, the tread20has preferably four circumferential grooves. In an alternative embodiment it has five of such grooves.", "", "The ply strip, or in other words the helically wound ply strip, which forms the layers of the low angle belt120, has as such a width within a range of 3 mm to 25 mm and a radial thickness within a range of 0.5 mm to 3 mm. In a preferred embodiment of the invention, the strip has 5 mm width and about 2 mm thickness. In another specific embodiment, it has 15 mm width and 2 mm thickness.", "", "The axial direction a, the circumferential direction c and the radial direction r are indicated inFIG.1for the sake of better comprehensibility. The axial direction a is parallel to the axis of rotation of the tire. The circumferential direction c is in parallel to the circumference of the tire and the radial direction r is perpendicular to the axial direction a and the circumferential direction c. It is emphasized that each of these directions can have different orientations so that mentioning one of these directions is not generally limited to a specific orientation, unless indicated otherwise herein.", "", "As mentioned above,FIG.1is a schematic drawing. For instance, the distances between the belts and/or layers shown inFIG.1are shown larger than in reality. Thus, the void spaces between the depicted belt layers and/or belts will typically be closed upon tire curing. The same applies to the further drawings shown herein.", "", "FIG.2shows another embodiment of a tire10in accordance with the present invention.FIG.2utilizes, where appropriate, the same reference signs asFIG.1for various components, including the tread20, shoulder grooves21, sidewall30, bead portions40, apexes42, beads41, carcass ply50and innerliner60. In contrast to the embodiment of tire1shown inFIG.1, the tire10according toFIG.2has a different belt portion200. This belt portion200comprises a first working belt210, a second working belt230, a low angle belt220and a top belt240. The low angle belt does not comprise three layers but a single layer220formed by a helically wound ply strip. In particular, it does not comprise two further layers arranged radially below each of the shoulder grooves21. However, the low angle belt220extends also below each shoulder groove21. In addition, the working belts210,230each comprise parallel metal cords which have an angle with the circumferential direction. The absolute value of the angle of parallel cords of the first working belt210is 4° larger than the absolute value of the (opposite) angle of the parallel cords of the second working belt230. In particular, the cords of the first working belt210have an absolute angle of 23° and the cords of the second working belt230have an absolute angle of 19°. It has been found that the combination of such a pair of working belts210,230and a low angle belt provided radially between both working belts210,230results in an even more robust construction further improving the robustness of the working belts.", "", "FIG.3shows an alternative belt portion300which could be used in a tire, such as in one of the tires1or10. The belt portion300comprises a radially inner working belt310, a radially outer working belt330, a low angle belt320provided between the first working belt310and the second working belt330, and a top belt340. The low angle belt320comprises a first layer321, a second layer322and a third layer323. In this embodiment, each layer is formed by a separate ply strip. The remaining construction can be the same or similar as described in relation to the embodiment ofFIG.2. The embodiment ofFIG.3also intends to provide second and third low angle belt layers below radially upper shoulder grooves (not explicitly shown herein).", "", "FIG.4shows yet another embodiment of a belt portion400which comprises a first working belt410, a second working belt430, a low angle belt420and a top belt440. The low angle belt420comprises a first layer421, a second layer422, and a third layer423, wherein each of said layers is formed by a separate ply strip. In contrast to the embodiment shown inFIG.3, the third and second layers422and423are provided radially above the first layer421, whereas similar layers have been provided radially below the respective first layer321in the embodiment ofFIG.3.", "", "FIG.5shows another embodiment of a possible belt portion500which comprises belts similar to the embodiment ofFIG.4. In particular, the belt portion500comprises a first working belt510, a second working belt530, a low angle belt520and a top belt540. The low angle belt520comprises a first layer521and two radially outer layers522and523, which are arranged radially on top of the first layer521, radially below respective shoulder grooves (not explicitly shown herein). In addition to the construction shown inFIG.4, the belt portion500ofFIG.5has a filler layer555consisting of a helically wound rubber strip which is not reinforced, in particular free of fabric or metal cords. It can be used in case of relatively thick layers of the low angle belt, such as the second and/or third layers522and523. However, such a provision is not essential as typically the various belts of the tire will attach to each other during tire cure.", "", "In each of the non-limiting embodiments shown in the Figures herein, the low angle belts have elongated reinforcement elements in the form of metal cords, in particular steel cords, which are preferably brass coated. In a preferred example they have the following cord construction: 4+3×0.35. In this example, four inner filaments (or wires) are straight and three filaments are twisted over the four inner filaments which provides a relatively open construction which allows for example a good rubber (coating) penetration.", "", "For instance, the metal or steel cords in the working belts may have one of the following cord constructions: 3×7×0.22; 3×4×0.22; 4×4×0.22; 4+3×0.35; 3+2×0.35 and have an elongation at 10% of their breaking force which is larger than 0.4%, and preferably smaller than 1%. The thickness of a single wire forming such a cord is preferably within a range of 0.15 to 0.35 mm.", "", "However, even more preferred herein are working belts having the same or similar cords as the low angle belt. For instance, those may have the following cord constructions: 4+3×0.35 and/or 3+2×0.35.", "", "The cords may also have constructions selected from: 3+2×0.35; 3+3×0.35; 3+4×0.35; 4+2×0.35; 4+3×0.35; 4+4×0.35; 5+2×0.35; 5+3×0.35; 5+4×0.35; 4×6×0.19; 4×5×0.20; and a+b×d, wherein a is ranging from 3 to 5, b is ranging from 2 to 4 and d is ranging from 0.2 mm to 0.5 mm (preferably from 0.3 mm to 0.45 mm).", "", "An end per inch (EPI) range of cords in the working belts is preferably ranging from 8 to 14 EPI. An end per inch range in the low angle belt ply strips is preferably within a range of 10 EPI to 20 EPI, preferably from 10 EPI to 16 EPI, or more preferably from 14 EPI to 16 EPI. Preferably, an EPI range of the cords in the top belt is from 8 EPI to 14 EPI, preferably less than 10 EPI.", "", "Preferably, the cords utilized herein have an elongation (or relative elongation) at 10% of their breaking force which is larger than 0.2%, preferably smaller than 0.4%.", "", "In relation to the inventive examples of a belt portion100shown inFIG.1, the inventors have carried out a finite element analysis (FEA) comparing a tire having only the first layer of the low angle belt (not shown) and the tire shown inFIG.1having a third layer radially below the respective shoulder groove. This analysis concludes that the maximum force in the low angle belt is reduced by about 25% by the addition of the third layer123, which is a significant improvement. Thus, tire durability is further improved.", "", "Moreover, the inventors have tested the rubber penetration in the belts, and their layers used in the embodiments herein. The test results show a 100% rubber penetration in the low angle belt, including all of its layers and across the whole axial width. The same applies to each of the working layers. Such a very high rubber penetration makes the tire more robust.", "", "The present invention, and optionally one or more of its embodiments, help to provide robust tires, particularly having an advanced belt portion. For instance, stability of the shoulder and/or groove areas can be improved. Moreover, simple and/or cost-effective manufacturing is possible.", "", "The above first, second, third, and fourth aspects, and/or one or more of their respective embodiments and/or features, may be combined with one another.", "", "Variations in the present invention are possible in light of the description of it provided herein. While certain representative embodiments and details have been shown for the purpose of illustrating the subject invention, it will be apparent to those skilled in this art that various changes and modifications can be made therein without departing from the scope of the subject invention. It is, therefore, to be understood that changes can be made in the particular embodiments described which will be within the full intended scope of the invention as defined by the following appended claims."], "claims": ["wherein the tread has two shoulder portions, each shoulder portion comprising a shoulder groove, wherein the belt portion comprises a pair of working belts and a low angle belt, wherein the low angle belt has reinforcement elements having an angle of less than 5° with a circumferential direction of the tire, and wherein the low angle belt comprises a first layer and one or more further layers, wherein the first layer of the low angle belt extends over at least 70% of the axial width of the axially largest working belt, and wherein each layer of the one or more further layers of the low angle belt is arranged radially below one of the shoulder grooves and extends over at most 50% of the axial width of the axially largest working belt.", "2 . The tire according to claim 1 , wherein the low angle belt comprises a helically wound ply strip.", "3 . The tire according to claim 1 , wherein the one or more further layers comprise a second layer arranged radially below a first shoulder groove, and a third layer arranged radially below a second shoulder groove.", "4 . The tire according to claim 3 , wherein each of the first layer, the second layer, and the third layer are formed by a helically wound ply strip.", "5 . The tire according to claim 4 , wherein the first layer, the second layer and the third layer are formed by a single ply strip.", "6 . The tire according to claim 5 , wherein the second layer is located radially below the first layer and the third layer is located radially above the first layer.", "7 . The tire according to claim 4 , wherein the second layer and the third layer are both located radially below the first layer or radially above the first layer.", "8 . The tire according to claim 4 , wherein the ply strip has an axial width within a range of 1.5 mm to 25 mm and a radial thickness within a range of 0.5 mm to 3 mm.", "9 . The tire according to claim 4 , wherein the ply strip comprises from 1 to 5 parallel, elongated reinforcement elements.", "10 . The tire according to claim 9 , wherein said reinforcement elements are one or more of metal cords and metal wires.", "wherein the pair of working belts comprises a first working belt and a second working belt, wherein the low angle belt is arranged between the first working belt and the second working belt, wherein each working belt of the pair of working belts comprises parallel reinforcement elements, and wherein the reinforcement elements of the first working belt and the reinforcement elements of the second working belt cross each other at an opposite angular orientation.", "wherein an absolute value of the angle of the reinforcement elements of each working belt with the circumferential direction ranges from 10° to 50°, and wherein the difference between i) the absolute value of the angle of the reinforcement elements of the first working belt and ii) the absolute value of the angle of the reinforcement elements of the second working belt is at least 2°.", "wherein each working belt of the pair of working belts comprises parallel reinforcement elements, and wherein the reinforcement elements of the workings belts and the reinforcement elements of the low angle belt are metal cords having a relative elongation higher than 0.2% and lower than 0.35% at 10% of their breaking force.", "a top belt arranged radially above the low angle belts and the pair of working belts, and comprising parallel reinforcement elements having an angle within a range of 8 EPI to 14 EPI with the circumferential direction of the tire, and wherein the top belt is axially narrower than each of the workings belts and the first layer of the low angle belt; a transition belt arranged radially below the low angle belt and the pair of working belts, wherein the transition belt comprises parallel reinforcement elements having an angle within a range of 35° to 90° with the circumferential direction of the tire, and wherein the transition belt is axially narrower than each of the workings belts and the first layer of the low angle belt.", "wherein the ply strip has parallel reinforcement elements having an angle of less than 5° with a circumferential direction of the tire; and wherein the pair of working belts comprises a first working belt and a second working belt, wherein each working belt of the pair of working belts comprises parallel reinforcement elements, and wherein the reinforcement elements of the first working belt and the reinforcement elements of the second working belt cross each other with an opposite angular orientation, wherein an absolute value of the angle of the reinforcement elements of each working belt with the circumferential direction ranges from 10° to 50°, and wherein the difference between i) the absolute value of the angle with the circumferential direction of the reinforcement elements of the first working belt and ii) the absolute value of the angle with the circumferential direction of the reinforcement elements of the second working belt is at least 2°.", "16 . The tire according to claim 15 , wherein the absolute value of the angle of a radially inner working belt is from 2° to 10° larger than the absolute value of the angle of a radially outer working belt.", "wherein the tread has two shoulder portions, each shoulder portion comprising a shoulder groove, and wherein the low angle belt comprises a first layer and one or more further layers, wherein the first layer of the low angle belt extends over at least 70% of the axial width of the axially largest working belt, wherein each layer of the one or more further layers of the low angle belt extends over at most 50% of the width of the axially largest working belt and is arranged radially below one of the shoulder grooves, and wherein the reinforcement elements of the workings belts and the reinforcement elements of the low angle belt have a relative elongation within a range of 0.2% to 0.29% at 10% of their breaking force.", "18 . The tire according to claim 17 , wherein all layers of the low angle belt are formed by a single ply strip.", "wherein the tread has a first shoulder portion on a first lateral side of the tire and a second shoulder portion on a second lateral side of the tire, which is opposite to the first side; wherein the belt portion comprises a pair of working belts and a low angle belt, wherein the low angle belt comprises at least one helically wound ply strip comprising at least one elongated reinforcement element having an angle of less than 5° with a circumferential direction of the tire, and wherein the low angle belt comprises a first layer, a second layer and a third layer, formed by said at least one helically wound ply strip, wherein the first layer extends over at least 70% of the axial width of the axially largest working belt, wherein the second layer is arranged radially below the first layer and below the first shoulder portion, wherein the third layer is arranged radially above the first layer and below the second shoulder portion, and wherein each of the second layer and the third layer extends over at most 50% of the axial width of the axially largest working belt.", "one of a 22.5 inch and a 24.5 inch tire; a truck tire; a tire having at least one steel reinforced carcass ply; a tire comprising steel reinforced working belts and a reinforced low angle belt formed by steel reinforced ply strip."], "bibtex": "@patent{20240424834,\n    title = {TIRE COMPRISING A LOW ANGLE BELT},\n    number = {20240424834},\n    year = {2024},\n    note = {File: US20240424834A1-20241226.XML}\n    }", "classification": "B60C920FI"}, {"title": "PNEUMATIC RADIAL TIRE FOR PASSENGER VEHICLES", "doc_number": "20240424835", "filename": "US20240424835A1-20241226.XML", "abstract": "A pneumatic radial tire for passenger vehicles that satisfies a defined relationship between sectional width SW and outer diameter OD of the tire and includes one or more circumferential main grooves extending in a tire circumferential direction on a tread contact surface. A negative ratio of a half portion of the tire on a vehicle-mounted outward side, which is one side of the tire in a tread width direction with the tire equatorial plane as a boundary, is greater than a negative ratio of the other half portion of the tire on a vehicle-mounted inward side, which is the other side of the tire in the tread width direction with the equatorial plane as the boundary. A drop height (or ground contact length relationship, or tread gauge relationship) is also defined.", "detailed_description": ["Hereinafter, embodiments of the present disclosure are illustratively described in detail, with reference to the drawings.", "", "FIG.1is a schematic diagram illustrating sectional width SW and outer diameter OD of a tire.", "", "The pneumatic radial tire for passenger vehicles (hereinafter also referred to simply as “tire”) according to an embodiment of the present disclosure has a sectional width SW of less than 165 (mm), and a ratio SW/OD of the sectional width SW to the outer diameter OD of the tire is 0.26 or less, forming a narrow width and large diameter shape. By making the sectional width SW of the tire narrow, relative to the outer diameter OD of the tire, air resistance may be reduced, and by making the outer diameter OD of the tire large, relative to the sectional width SW of the tire, deformation of tread rubber in the vicinity of the contact patch of the tire may be controlled and rolling resistance may be reduced. Accordingly, fuel efficiency of the tire may be improved. The ratio SW/OD is preferably 0.25 or less, and more preferably 0.24 or less.", "", "The ratio above is preferably satisfied when the internal pressure of the tire is 200 kPa or greater, more preferably satisfied when the internal pressure of the tire is 220 kPa or greater, and even more preferably satisfied when the internal pressure of the tire is 280 kPa or greater. This allows rolling resistance to be reduced. On the other hand, the ratio above is preferably satisfied when the internal pressure of the tire is 350 kPa or less. This allows ride comfort to be improved.", "", "Here, the sectional width SW of the tire is preferably 105 mm to 145 mm, and more preferably 115 mm to 135 mm.", "", "Further, an aspect ratio of the tire when the sectional width SW and the outer diameter OD of the tire satisfy the ratio above is preferably 45 to 70, and more preferably 45 to 65.", "", "The tire is not particularly limited to a specific size. Example tire sizes include 105/50R16, 115/50R17, 125/55R20, 125/60R18, 125/65R19, 135/45R21, 135/55R20, 135/60R17, 135/60R18, 135/60R19, 135/65R19, 145/45R21, 145/55R20, 145/60R16, 145/60R17, 145/60R18, 145/60R19, 145/65R19, 155/45R18, 155/45R21, 155/55R18, 155/55R19, 155/55R21, 155/60R17, 155/65R18, 155/70R17, and 155/70R19.", "", "Alternatively, the sectional width SW of the tire is less than 165 mm, and the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the following relational equation:", "", "OD⁢(mm)≥-0.0187×SW⁢(mm)2+9.1⁢5×SW⁢(mm)-380", "", "That is, the tire has a narrow width and a large diameter.", "", "Satisfying the relational equation above reduces air resistance and reduces rolling resistance, thereby improving fuel efficiency of the tire.", "", "According to a third aspect, the sectional width SW and the outer diameter OD of the tire, in addition to satisfying the relational equation above, are such that the ratio SW/OD is preferably 0.26 or less, more preferably 0.25 or less, and even more preferably 0.24 or less. This allows fuel efficiency of the tire to be further improved.", "", "The relational equation and/or the ratio are preferably satisfied when the internal pressure of the tire is 200 kPa or greater, more preferably when the internal pressure of the tire is 220 kPa or greater, and even more preferably when the internal pressure of the tire is 280 kPa or greater. This allows rolling resistance to be reduced. On the other hand, the relational equation and/or the ratio are preferably satisfied when the internal pressure of the tire is 350 kPa or less. This allows ride comfort to be improved.", "", "Here, the sectional width SW of the tire is preferably 105 mm to 145 mm, and more preferably 115 mm to 135 mm.", "", "Further, the aspect ratio of the tire when the sectional width SW and the outer diameter OD of the tire satisfy the relational equation above is preferably 45 to 70, and more preferably 45 to 65.", "", "The tire is not particularly limited to a specific size. Example tire sizes include 105/50R16, 115/50R17, 125/55R20, 125/60R18, 125/65R19, 135/45R21, 135/55R20, 135/60R17, 135/60R18, 135/60R19, 135/65R19, 145/45R21, 145/55R20, 145/60R16, 145/60R17, 145/60R18, 145/60R19, 145/65R19, 155/45R18, 155/45R21, 155/55R18, 155/55R19, 155/55R21, 155/60R17, 155/65R18, 155/70R17, and 155/70R19.", "", "The tire according to the present embodiment is a pneumatic radial tire for passenger vehicles. This tire is particularly suitable for use as a tire mounted on a vehicle for personal mobility.", "", "FIG.2is a tire width direction cross-section diagram of the pneumatic radial tire for passenger vehicles according to an embodiment of the present disclosure.FIG.2illustrates a tire width direction cross-section under reference conditions, where the tire is mounted on a rim, filled to a prescribed internal pressure, and unloaded. As illustrated inFIG.2, the tire1includes a carcass3consisting of plies of radially arranged cords toroidally extending between a pair of bead portions2. Further, the tire1includes a belt4consisting of two belt layers4a,4bin the illustrated example, and a tread5, in this order, outward from the carcass3in the tire radial direction.", "", "In this example, a bead core2ais embedded in each of the pair of the bead portions2. According to the present disclosure, a cross-sectional shape and material of the bead core2aare not particularly limited, and may have a structure normally used in a pneumatic radial tire for passenger vehicles. According to the present disclosure, the bead core2amay be divided into a plurality of small bead cores. Alternatively, according to the present disclosure, the structure need not include the bead core2a.", "", "The tire1in the illustrated example includes a bead filler2bthat has an approximately triangular shape in cross-section, disposed outward from the bead core2ain the tire radial direction. The cross-sectional shape of the bead filler2bis not limited to this example, and the material of the bead filler2bis also not particularly limited. Alternatively, the tire may be made lighter by not including the bead filler2b.", "", "According to the present embodiment, the tire1may have a structure that includes a rim guard. Further, according to the present embodiment, the bead portion2may further include an additional member such as a rubber layer, a cord layer, or the like for reinforcement or other purposes. Such an additional member may be provided at various positions with respect to the carcass3and the bead filler2b.", "", "In the example illustrated inFIG.2, the carcass3consists of a single carcass ply. However, according to the present disclosure, the number of carcass plies is not particularly limited and may be two or more. Further, in the example illustrated inFIG.2, the carcass3includes a toroidally extending carcass body portion3athat spans between the pair of the bead portions2and turn-up portions3bthat are turned up from the carcass body portion3aaround the bead cores2a.However, according to the present disclosure, the carcass turn-up portions3bmay be wrapped around the bead cores2a,or may be sandwiched between a number of divided small bead cores. According to the illustrated example, ends3cof the carcass turn-up portions3bare positioned outward in the tire radial direction from an outermost end in the tire radial direction of the bead fillers2band inward in the tire radial direction from a tire maximum width position. This allows reduction of the weight of the tire while maintaining rigidity of the sidewall portion. However, according to the present disclosure, the ends3cof the carcass turn-up portions3bmay be positioned inward in the tire radial direction from the outermost end in the tire radial direction of the bead filler2b,or outward in the tire radial direction from the tire maximum width position. Alternatively, the ends3cof the carcass turn-up portions3bmay be an envelope structure, positioned inward in the tire width direction of ends of the belt4(for example, ends of the belt layer4b) between the carcass body portion3aand the belt4in the tire radial direction. Further, in a case where the carcass3is formed of a plurality of carcass plies, the positions of the ends3cof the carcass turn-up portions3b(for example, in the tire radial position) may be the same or different among the carcass plies. The number of cords in the carcass3is not particularly limited, and may be in a range of 20 cords to 60 cords per 50 mm, for example. Further, a carcass line may adopt various structures. For example, a carcass maximum width position in the tire radial direction may be closer to either the bead portions2or the tread5. For example, the carcass maximum width position may be in a range of 50% to 90% of a tire section height, outward in the tire radial direction from a bead base line. The above term “radially arranged” indicates at least 85° to the tire circumferential direction, preferably 90° to the tire circumferential direction.", "", "The tire according to the present embodiment preferably includes at least one inclined belt layer consisting of a rubberized layer of cords extending at an angle to the tire circumferential direction, and two layers is most preferable for the combination of weight reduction and suppression of contact patch distortion. From the viewpoint of weight reduction, one belt layer may be used, and from the viewpoint of suppressing distortion of the contact patch, three or more layers may be used. In the example illustrated inFIG.2, of the two belt layers4aand4b,the width in the tire width direction of the belt layer4boutward in the tire radial direction is smaller than the width in the tire width direction of the belt layer4ainward in the tire radial direction. However, the width in the tire width direction of the belt layer4boutward in the tire radial direction may be greater than or the same as the width in the tire width direction of the belt layer4ainward in the tire radial direction. The width in the tire width direction of the belt layer that has the greatest width in the tire width direction (the belt layer4ain the illustrated example) is preferably 90% to 115% of the ground contact width, and more preferably 100% to 105% of the ground contact width. Here, “ground contact width” refers to the distance in the tire width direction between the ground contact edges E described above.", "", "According to the present embodiment, metal cords, in particular steel cords, are most preferable as belt cords of the belt layers4a,4b,but non-metal, for example, organic fiber cords (such as Kevlar® (Kevlar is a registered trademark in Japan, other countries, or both)) may be used. The steel cords May include steel as a main component, and may contain various micro inclusions such as carbon, manganese, silicon, phosphorus, sulfur, copper, and chromium. According to the present embodiment, the belt cords of the belt layers4a,4bmay be monofilament cords, cords with a plurality of filaments drawn together, or cords with a plurality of filaments twisted together. Various twist structures may be adopted, including cross-section structure, twist pitch, twist direction, and distance between adjacent filaments. Cords obtained by twisting filaments of different materials may also be used, which may employ various twist structures such as single twist, layer twist, and multi twist, without being limited to any particular cross-section structure.", "", "According to the present embodiment, an inclination angle of the belt cords of the belt layers4a,4bis preferably 10° or more with respect to the tire circumferential direction. According to the present embodiment, the inclination angle of the belt cords of the belt layers4a,4bis preferably a high angle, specifically 20° or more, preferably 35° or more, and more preferably in a range of 55° to 85° with respect to the tire circumferential direction. By setting the inclination angle to 20° or more (preferably 35° or more), the rigidity with respect to the tire width direction may be increased, and steering stability, particularly when cornering, may be improved. Further, shearing deformation of the inter-layer rubber may be reduced, and rolling resistance may be reduced.", "", "In the illustrated example, the tread rubber of the tread5consists of one layer. However, according to the present embodiment, the tread rubber of the tread5may be formed by a plurality of different rubber layers stacked in the tire radial direction. The plurality of rubber layers may be different from one another in terms of tangent loss, modulus, hardness, glass transition temperature, material, or the like. Further, ratios of thicknesses of the plurality of rubber layers in the tire radial direction may vary in the tire width direction. Further, the circumferential main groove bottom and the like may be composed of a rubber layer different from that in a surrounding region. Further, the tread rubber of the tread5may be formed by a plurality of different rubber layers in the tire width direction. The plurality of rubber layers may be different from one another in terms of tangent loss, modulus, hardness, glass transition temperature, material, or the like. Further, ratios of thicknesses of the plurality of rubber layers in the tire width direction may vary in the tire radial direction. Further, rubber layers in a limited region, such as in the vicinity of the circumferential main grooves alone, in the vicinity of the ground contact edges E alone, in the shoulder land portions alone, or in the center land portion, may be formed as rubber layers different from the surroundings.", "", "FIG.3is a developed view illustrating a tread pattern of the pneumatic radial tire for passenger vehicles according to an embodiment of the present disclosure.", "", "As illustrated inFIG.2andFIG.3, in this example, the tire1has one or more (in the illustrated example, only one) circumferential main groove6extending in the tire circumferential direction on the contact surface of the tread5. In this example, the circumferential main groove6extends straight in the tire circumferential direction, but may extend in a zigzag shape or curved shape. The groove width (opening width) of the circumferential main groove6is not particularly limited, and may be 2 mm to 5 mm, for example. The groove depth (maximum depth) of the circumferential main groove6is not particularly limited, and may be 3 mm to 6 mm, for example. Here, according to the present embodiment, the circumferential main groove6is provided to a half portion of the tire on a vehicle-mounted outward side, which is one side of the tire in the tread width direction with the tire equatorial plane CL as a boundary. Accordingly, in the tire according to the present embodiment, a negative ratio of the half portion of the tire on the vehicle-mounted outward side, which is one side of the tire in the tread width direction with the tire equatorial plane as the boundary, is greater than a negative ratio of the other half portion of the tire on a vehicle-mounted inward side, which is the other side of the tire in the tread width direction with the equatorial plane as the boundary.", "", "In the illustrated example, the tire1does not have a width direction groove extending in the tire width direction on the contact surface of the tread5, but the tire1may have one or more width direction grooves.", "", "The tire1according to the present embodiment includes an inner liner8on an inner surface7of the tire (also referred to simply as the tire inner surface7). Thickness of the inner liner8is preferably about 1.5 mm to 2.8 mm. This may effectively reduce cabin noise in a range of 80 Hz to 100 Hz. An air permeability coefficient of a rubber composition of the inner liner8is preferably 1.0×10−14cccm/(cm2·s·cmHg) or greater and 6.5×1031 10cccm/(cm2·s·cmHg) or less.", "", "As illustrated inFIG.2, according to the present embodiment, in the tire width direction cross-section, under the reference conditions described above, when a straight line passing through a point on the tread surface on the tire equatorial plane CL and parallel to the tire width direction is m1, a straight line passing through the ground contact edges E and parallel to the tire width direction is m2, a distance between the straight line m1and the straight line m2in the tire radial direction is a drop height LCR, and the tread width of the tire1is TW, a ratio LCR/TW is greater than 0.045 (Configuration 1).", "", "The following is an explanation of effects of the pneumatic radial tire for passenger vehicles according to the present embodiment.", "", "The pneumatic radial tire for passenger vehicles according to the present embodiment has a narrow sectional width SW of less than 165 mm, even among narrow width, large diameter tires for which the sectional width SW and the outer diameter satisfy the relational equation described above. According to such a tire, air resistance in particular may be reduced, and rolling resistance may also be reduced, thereby improving the fuel efficiency of the tire.", "", "However, as schematically illustrated on a left side of the arrow inFIG.4, with such a tire, the ground contact area may become too elongated when the camber angle changes, such as during cornering, and the ground contact area may deteriorate, resulting in reduced steering stability and the like.", "", "To address this, first, in the tire according to the present embodiment, the ratio LCR/TW is greater than 0.045. This results in a tire that has a relatively round crown shape, and therefore a rounded ground contact area, with the shoulder portion having a shorter ground contact length relative to the center portion. This inhibits the ground contact area from becoming too elongated when the camber angle changes, as illustrated schematically on the right side of the arrow inFIG.4, and suppresses deterioration of the ground contact area.", "", "Further, the narrow width tire described above has excellent drainage to the side of the tire, and therefore even when the tire has only one circumferential main groove6, drainage performance may be sufficiently secured. The negative ratio of the half portion of the tire on the vehicle-mounted outward side, which is one side of the tire in the tread width direction with the tire equatorial plane as the boundary, is greater than a negative ratio of the other half portion of the tire on a vehicle-mounted inward side, which is the other side of the tire in the tread width direction with the equatorial plane as the boundary. Accordingly, the area of the land portion on the vehicle-mounted inward side is sufficiently secured to reduce the load burden and to suppress uneven wear caused by localized wear of the land portion. Further, having the circumferential main groove on the vehicle-mounted outward side also has an effect of securing flowability (escape area) of the rubber when lateral force is generated, thereby suppressing the occurrence of buckling.", "", "The ratio LCR/TW is more preferably 0.05 or greater. This is because deterioration of the ground contact area may be further suppressed. On the other hand, from the viewpoint of reducing rolling resistance, the ratio LCR/TW is preferably 0.1 or less.", "", "Further, the groove width (opening width) of the circumferential main groove6is preferably 20% or less of the ground contact width, and more preferably 15% or less of the ground contact width. This is because the land area can be secured. For the same reason, a negative ratio of the contact surface of the tread is preferably 20% or less, and more preferably 15% or less.", "", "Further, on the vehicle-mounted outward side, the width in the tire width direction of the land portion demarcated by the tread edge and the circumferential main grooves6is preferably 20% or greater of the ground contact width, and more preferably 25% or greater of the ground contact width. This allows steering stability to be improved. Further, buckling in the vicinity of the circumferential main grooves6may be suppressed, which has an effect of improving grounding property.", "", "FIG.5is a schematic diagram for explanation of the ground contact area. As another aspect, a ground contact length L1on the tire equatorial plane CL is longer than an average value of ground contact lengths L2and L3((L2+L3)/2) at tire width direction positions P1and P2, which are spaced 20% of the ground contact width inward in the tire width direction from both ground contact edges E (Configuration 2). Even in this case, the ground contact area may be rounded, with the shoulder portion having a shorter ground contact length relative to the center portion. This inhibits the ground contact area from becoming too elongated when the camber angle changes, as illustrated schematically on the right side of the arrow inFIG.4, and suppresses deterioration of the ground contact area. The ground contact length L1is preferably 1.1 times the average of the ground contact lengths L2and L3or greater. On the other hand, from the viewpoint of uneven wear mitigation performance, the ground contact length L1is preferably 1.5 times the average of the ground contact lengths L2and L3or less.", "", "Further, as another aspect, as illustrated inFIG.2, a gauge G1of the tread on the tire equatorial plane is greater than an average value ((G2+G3)/2) of gauges G2and G3of the tread at positions P1and P2, which are spaced 20% of the ground contact width inward in the tire width direction from both ground contact edges E (Configuration 3). This results in a tire that has a relatively round crown shape, and therefore a rounded ground contact area, with the shoulder portion having a shorter ground contact length relative to the center portion. This inhibits the ground contact area from becoming too elongated when the camber angle changes, as illustrated schematically on the right side of the arrow inFIG.4, and suppresses deterioration of the ground contact area. Further, the thinner gauges at the positions P1and P2provide greater tread rigidity at these positions, which is advantageous for improving steering stability when cornering. The gauge G1is preferably 1.1 times the average of the gauges G2and G3or greater. On the other hand, from the viewpoint of uneven wear mitigation performance, the gauge G1is preferably 1.5 times the average value of the gauges G2and G3or less.", "", "According to the present disclosure, it suffices that any one or more of the above Configurations 1 to 3 are satisfied, and any two or all three may be satisfied.", "", "FIG.6is a developed view illustrating another example of a tread pattern. According to this example, one or more width direction sipes9(9a) extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to the land portion on a vehicle-mounted inward side that is demarcated by one of the circumferential main grooves6and the tread edge (in the illustrated example, the width direction sipes9(9a) are provided).", "", "According to this configuration, the compressive rigidity of the land portion intersected by the tire equatorial plane CL may be somewhat reduced to equalize the ground contact pressure.", "", "Here, a “sipe” of the width direction sipes has a sipe width (opening width) of less than 2 mm.", "", "FIG.7is a developed view illustrating another example of a tread pattern. According to this example, one or more width direction sipes9(9b) extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to the land portion on a vehicle-mounted outward side that is demarcated by one of the circumferential main grooves6and the tread edge (in the illustrated example, the width direction sipes9(9b) are provided).", "", "This configuration is able to mitigate input of force from road surface irregularities and improve noise, vibration, and harshness (NVH) performance.", "", "The sipe depth (maximum depth) of the width direction sipes9a,9band hole-shaped sipes is not particularly limited, and may be 2 mm to 6 mm, for example. The pitch interval of the width direction sipes9a,9bin the tire circumferential direction is not particularly limited, and may be 10 mm to 40 mm, for example.", "", "FIG.8illustrates an example that has two circumferential main grooves. In the example illustrated inFIG.8, the two circumferential main grooves6a,6bare both provided to one half portion in the tire width direction (vehicle-mounted outward side) with the tire equatorial plane CL as a boundary. In such a case, the negative ratio of the half portion of the tire on the vehicle-mounted outward side is of course greater then the negative ratio of the half portion of the tire on the vehicle-mounted inward side.", "", "As a further variation, one of the two circumferential main grooves May be positioned on the tire equatorial plane. In this case, the negative ratio of the half portion on the vehicle-mounted outward side may be made greater than the negative ratio of the half portion on the vehicle-mounted inward side by providing the other circumferential main groove to one half portion in the tire width direction (vehicle-mounted outward side) with the tire equatorial plane CL as a boundary. Alternatively, one circumferential main groove may be provided to each of the half portion on the vehicle-mounted inward side and the half portion on the vehicle-mounted outward side, and the groove width of the circumferential main groove provided to the half portion on the vehicle-mounted outward side may be greater than the groove width of the circumferential main groove provided to the half portion on the vehicle-mounted inward side, so that the negative ratio of the half portion on the vehicle-mounted outward side is greater than the negative ratio of the half portion on the vehicle-mounted inward side."], "claims": ["sectional width SW of the tire is less than 165 mm, a ratio SW/OD of the sectional width SW to outer diameter OD of the tire is 0.26 or less, or the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the relational equation OD (mm)≥−0.0187×SW (mm) in a tire width direction cross-section, under reference conditions where the tire is mounted on a rim, filled with a prescribed internal pressure, and unloaded, when a straight line passing through a point on a tread surface on a tire equatorial plane and parallel to a tire width direction is m a contact surface of the tread has one or more circumferential main grooves extending in a tire circumferential direction, and a negative ratio of a half portion of the tire on a vehicle-mounted outward side, which is one side of the tire in a tread width direction with the tire equatorial plane as a boundary, is greater than a negative ratio of the other half portion of the tire on a vehicle-mounted inward side, which is the other side of the tire in the tread width direction with the equatorial plane as the boundary.", "sectional width SW of the tire is less than 165 mm, a ratio SW/OD of the sectional width SW to outer diameter OD of the tire is 0.26 or less, or the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the relational equation OD (mm)≥−0.0187×SW (mm) ground contact length on a tire equatorial plane is longer than an average value of ground contact lengths at positions 20% of ground contact width inward in a tire width direction from both ground contact edges, a contact surface of the tread has one or more circumferential main grooves extending in a tire circumferential direction, and a negative ratio of a half portion of the tire on a vehicle-mounted outward side, which is one side of the tire in a tread width direction with the tire equatorial plane as a boundary, is greater than a negative ratio of the other half portion of the tire on a vehicle-mounted inward side, which is the other side of the tire in the tread width direction with the equatorial plane as the boundary.", "sectional width SW of the tire is less than 165 mm, a ratio SW/OD of the sectional width SW to outer diameter OD of the tire is 0.26 or less, or the sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the relational equation OD (mm)≥−0.0187×SW (mm) gauge of the tread on a tire equatorial plane is greater than an average value of gauges of the tread at positions 20% of ground contact width inward in a tire width direction from both ground contact edges, a contact surface of the tread has one or more circumferential main grooves extending in a tire circumferential direction, and a negative ratio of a half portion of the tire on a vehicle-mounted outward side, which is one side of the tire in a tread width direction with the tire equatorial plane as a boundary, is greater than a negative ratio of the other half portion of the tire on a vehicle-mounted inward side, which is the other side of the tire in the tread width direction with the equatorial plane as the boundary.", "4 . The pneumatic radial tire for passenger vehicles according to claim 1 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted inward side that is demarcated by one of the circumferential main grooves and a tread edge.", "5 . The pneumatic radial tire for passenger vehicles according to claim 1 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted outward side that is demarcated by one of the circumferential main grooves and a tread edge.", "6 . The pneumatic radial tire for passenger vehicles according to claim 2 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted inward side that is demarcated by one of the circumferential main grooves and a tread edge.", "7 . The pneumatic radial tire for passenger vehicles according to claim 3 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted inward side that is demarcated by one of the circumferential main grooves and a tread edge.", "8 . The pneumatic radial tire for passenger vehicles according to claim 2 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted outward side that is demarcated by one of the circumferential main grooves and a tread edge.", "9 . The pneumatic radial tire for passenger vehicles according to claim 3 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted outward side that is demarcated by one of the circumferential main grooves and a tread edge.", "10 . The pneumatic radial tire for passenger vehicles according to claim 4 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted outward side that is demarcated by one of the circumferential main grooves and a tread edge.", "11 . The pneumatic radial tire for passenger vehicles according to claim 6 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted outward side that is demarcated by one of the circumferential main grooves and a tread edge.", "12 . The pneumatic radial tire for passenger vehicles according to claim 7 , wherein one or more width direction sipes extending in the tread width direction or at an angle of 45° or less to the tread width direction, and/or one or more hole-shaped sipes having a diameter of 2 mm or less, are provided to a land portion on a vehicle-mounted outward side that is demarcated by one of the circumferential main grooves and a tread edge."], "bibtex": "@patent{20240424835,\n    title = {PNEUMATIC RADIAL TIRE FOR PASSENGER VEHICLES},\n    number = {20240424835},\n    year = {2024},\n    note = {File: US20240424835A1-20241226.XML}\n    }", "classification": "B60C1103FI"}, {"title": "BI-DIRECTIONAL SIPE AND/OR SLOT", "doc_number": "20240424836", "filename": "US20240424836A1-20241226.XML", "abstract": "In one aspect, a tire is provided, comprising: a tread portion comprising a tread rib or a tread block, a sipe included in tread rib or the tread block, wherein the sipe includes a center section located axially between opposing outer sections, and wherein the center section and each outer section include a radially outer portion and a radially inner portion, wherein the radially outer portion of each outer section has a circumferential width WT 1, wherein the radially outer portion of the center section has a circumferential width WT 2, wherein the circumferential width WT 1 is greater than the circumferential with WT 2, wherein the radially inner portion of each outer section includes an axially outer portion having a radial depth DB 1 E and an axially inner portion having a radial depth DB 1 I, and wherein the radial depth DB 1 E is less than the radial depth DB 1 I.", "detailed_description": ["FIGS.1A-1Eillustrate a tire tread100having a tread block106with a bi-directional sipe and/or slot110. Tire tread100may be utilized on any of a variety of tires, including for example tires intended for use in both dry running surfaces and snow and ice-covered running surfaces.", "", "Axes and planes described herein are illustrated inFIGS.1A-1E, and include a circumferential axis C oriented in the circumferential direction of the tire, a radial axis R oriented in the radial direction of the tire, and an axial axis A oriented in the axial direction of the tire.", "", "Tire tread100may include at least one block row102defined by parallel circumferential grooves104. Axial slots/sipes108may extend at least partially across block row102to define individual tread blocks106. At least one tread block106includes a bi-directional sipe and/or slot110. Alternatively, tire tread100may include at least tread rib in lieu or tread blocks, and the tread rib includes a bi-directional sipe and/or slot110.", "", "Sipe/slot110includes a center section112located between (e.g., axially between) opposing outer sections114. Sipe/slot110includes opposing key edges116limited to center section112. Key edges116are a negative, or undercut angle with respect to the radial direction R at the radially outer surface, which results in block106having opposing, inwardly-facing acute angles at the radially outer portion.", "", "Opposing key edges116result in a bi-directional (that is, the tire is not required to have a specific direction of rolling) that result in increased snow and ice traction. The bi-directional nature of opposing key edges116allows the tire to function as intended regardless of the rolling direction of the tire, such that an installer can mount the tire on the vehicle with the tread rolling either direction without tire performance degradation. Additionally, the bi-directional nature of opposing key edges116may provide a benefit in snow and ice traction both when the tire is accelerating and braking. That is, the acute angle key edge116“bites” into snow and ice surfaces to increase traction of the tire on those surfaces. The shape of key edge116is most easily viewed inFIG.1E.", "", "Sipe/slot110includes opposing chamfered edges118limited to outer sections114. Chamfered edges118are a positive angle with respect to the radial direction R at the radial outer surface. That is, chamfered edge118are angled in the opposite direction as key edges116. The shape of chamfered edge118is most easily viewed inFIG.1E.", "", "Outer section opposing sidewalls120extend substantially in the radial direction R radially inwardly from chamfered edges118to an outer base122. Center section opposing sidewalls124extend substantially in the radial direction R radially inwardly from key edges116to a center base126.", "", "Outer sections114may include a step resulting from a shorter radial depth (D1E described below) at an outermost, exterior portion, and a longer radial depth (D1I described below) at an innermost, interior portion. The result is the formation of tie bars129within sipe/slot110. Tie bars129may act to “tie” together the two halves of block106that is bisected by sipe/slot110, resulting in increased stiffness in block106.", "", "The relative dimensions and angles of sipe/slot110are outlined below with respect to the sipe blade230.", "", "FIGS.2A-2Fillustrate a tire sipe/slot blade230for forming a bi-directional sipe and/or slot, such as sipe/slot110.", "", "Blade230includes a center section232located between (e.g., axially between) opposing outer sections234. Center section232includes a top center section surface235and each outer section234includes a top outer section surface237.", "", "Blade230includes opposing key forming edges236limited to center section232. Key forming edges236form negative, or undercut angle (key edges116) with respect to the radial direction R at the radially outer surface of tire tread100, which results in block106having opposing, inwardly-facing acute angles (key edges116) at the radially outer portion. The shape of key forming edge236is most easily viewed inFIGS.2A and2C-2E.", "", "Blade230includes opposing chamfered forming edges238limited to outer sections234. Chamfered forming edges238form a positive angle with respect to the radial direction R at the radial outer surface. That is, chamfered forming edge238are angled in the opposite direction as key forming edges236. The shape of chamfered forming edge238is most easily viewed inFIGS.2A and2C-2E.", "", "Outer sections234include outer section opposing sidewalls240that form sidewalls120. Sidewalls240extend downward from chamfered forming edges238. Center section232includes center section opposing sidewalls244that form sidewalls124. Sidewalls244extend downward from key forming edges236.", "", "Top outer section surface237includes a width (e.g., circumferential width) WT1. In one aspect, width WT1is between about 1.0 mm and about 3.0 mm. In another aspect, width WT1is between 1.0 mm and 3.0 mm. In another aspect, width WT1is between about 1.5 mm and about 2.5 mm. In another aspect, width WT1is between 1.5 mm and 2.5 mm. In another aspect, width WT1is between about 1.75 mm and about 2.25 mm. In another aspect, width WT1is between 1.75 mm and 2.25 mm. In another aspect, width WT1is about 2.0 mm. In another aspect, width WT1is 2.0 mm.", "", "Top center section surface235includes a width (e.g., circumferential width) WT2. In one aspect, width WT2is between about 0.5 mm and about 2.0 mm. In another aspect, width WT2is between 0.5 mm and 2.0 mm. In another aspect, width WT2is between about 0.7 mm and about 1.8 mm. In another aspect, width WT2is between 0.7 mm and 1.8 mm. In another aspect, width WT2is between about 0.8 mm and about 1.5 mm. In another aspect, width WT2is between 0.8 mm and 1.5 mm. In another aspect, width WT2is about 1.0 mm. In another aspect, width WT2is 1.0 mm.", "", "Width WT1is greater than width WT2. In one aspect, width WT1is about 2.0 times the value of width WT2. In another aspect, width WT1is 2.0 times the value of width WT2. In another aspect, width WT1is between 1.5 and 2.5 times the value of width WT2.", "", "Sidewalls240are separated by a width (e.g., circumferentially) WB1.", "", "Sidewalls244are separated by a width (e.g., circumferentially) WB1.", "", "Width WB1is less than width WT1. Width WB2is greater than width WT2. Width WB1is less than width WB2. In one aspect, width WB1and width WB2are both less than width WT1.", "", "In one aspect, width WB1is equal to width WT2. In another aspect, width WB2is equal to width WT1.", "", "Each of outer sections234may include a length (e.g., axially) L1.", "", "Each of outer sections234may include an outermost exterior portion having a shorter radial depth (D1E) and a length (e.g., axially) L1E, and an interior portion having a longer radial depth (D1I) and a length L1I. Length L1is equal to length L1E plus length L1I.", "", "FIG.2Cillustrates a cross-sectional view of a tire sipe blade230taken about a plane formed by reference line A-A inFIG.2B.FIG.2Dillustrates a cross-sectional view of a tire sipe blade230taken about a plane formed by reference line B-B inFIG.2B.FIG.2Eillustrates a cross-sectional view of a tire sipe blade230taken about a plane formed by reference line C-C inFIG.2B.", "", "Outermost exterior portion of each outer section234may include a total radial depth D1E, with chamfered forming edges238having a radial depth DT1E and sidewalls240having a radial depth DB1E. Depth D1E is equal to depth DT1E plus depth DB1E.", "", "Interior portion of each outer section234may include a total radial depth D1I, with chamfered forming edges238having a radial depth DT1I and sidewalls240having a radial depth DB1I. Depth D1I is equal to depth DT1I plus depth DB1I.", "", "In one aspect, radial depth DB1E is less than radial depth DB1I. In one aspect, radial depth DT1E is equal to radial depth DT1I. In another aspect, radial depths DT1E, DT1I, and DT2are all equal to one another.", "", "Center section232may include a total radial depth D2, with key forming edges236having a radial depth DT2and sidewalls244having a radial depth DB2. Depth D2is equal to depth DT2plus depth DB2.", "", "In one aspect, radial depth DB2is greater than radial depth DB1E. In another aspect, depth DB2is equal to depth DB1I. In another aspect, depth D2is equal to depth D1. In another aspect, depth DT2is equal to depth DT1I.", "", "Center section232may include a length (e.g., axially) L2.", "", "Key forming edges236include an angle A1relative to the axial direction. In one aspect, angle A1is between about 45 degrees and about 75 degrees. In another aspect, angle A1is between 45 degrees and 75 degrees. In another aspect, angle A1is between about 50 degrees and about 70 degrees. In another aspect, angle A1is between 50 degrees and 70 degrees. In another aspect, angle A1is between about 55 degrees and about 65 degrees. In another aspect, angle A1is between 55 degrees and 65 degrees. In another aspect, angle A1is about 60 degrees. In another aspect, angle A1is 60 degrees.", "", "Chamfered forming edges238include an angle A2relative to the axial direction. In one aspect, angle A2is between about 45 degrees and about 75 degrees. In another aspect, angle A2is between 45 degrees and 75 degrees. In another aspect, angle A2is between about 50 degrees and about 70 degrees. In another aspect, angle A2is between 50 degrees and 70 degrees. In another aspect, angle A2is between about 55 degrees and about 65 degrees. In another aspect, angle A2is between 55 degrees and 65 degrees. In another aspect, angle A2is about 60 degrees. In another aspect, angle A2is 60 degrees.", "", "Angle A1may be equal to angle A2, with each being relative to the axial direction A, but one being positive and the other being negative.", "", "To the extent that the term “includes” or “including” is used in the specification or the claims, it is intended to be inclusive in a manner similar to the term “comprising” as that term is interpreted when employed as a transitional word in a claim. Furthermore, to the extent that the term “or” is employed (e.g., A or B) it is intended to mean “A or B or both.” When the applicants intend to indicate “only A or B but not both” then the term “only A or B but not both” will be employed. Thus, use of the term “or” herein is the inclusive, and not the exclusive use. See Bryan A. Garner, A Dictionary of Modern Legal Usage 624 (2d. Ed. 1995). Also, to the extent that the terms “in” or “into” are used in the specification or the claims, it is intended to additionally mean “on” or “onto.” To the extent that the term “substantially” is used in the specification or the claims, it is intended to take into consideration the degree of precision available in tire manufacturing. To the extent that the term “selectively” is used in the specification or the claims, it is intended to refer to a condition of a component wherein a user of the apparatus may activate or deactivate the feature or function of the component as is necessary or desired in use of the apparatus. To the extent that the term “operatively connected” is used in the specification or the claims, it is intended to mean that the identified components are connected in a way to perform a designated function. As used in the specification and the claims, the singular forms “a,” “an,” and “the” include the plural. Finally, where the term “about” is used in conjunction with a number, it is intended to include ±10% of the number. In other words, “about 10” may mean from 9 to 11.", "", "As stated above, while the present application has been illustrated by the description of embodiments and aspects thereof, and while the embodiments and aspects have been described in considerable detail, it is not the intention of the applicants to restrict or in any way limit the scope of the appended claims to such detail. Additional advantages and modifications will readily appear to those skilled in the art, having the benefit of the present application. Therefore, the application, in its broader aspects, is not limited to the specific details, illustrative examples shown, or any apparatus referred to. Departures may be made from such details, examples, and apparatuses without departing from the spirit or scope of the general inventive concept."], "claims": ["a tread portion comprising at least one of a tread rib or a tread block, a sipe included in the tread rib or the tread block, wherein the sipe includes a center section located axially between opposing outer sections, and wherein the center section and each outer section include a radially outer portion and a radially inner portion, wherein the radially outer portion of each outer section has a circumferential width WT wherein the radially outer portion of the center section has a circumferential width WT wherein the circumferential width WT wherein the radially inner portion of each outer section includes an axially outer portion having a radial depth DB wherein the radial depth DB", "2 . The tire of claim 1 , wherein the sipe center section has opposing key edges on its radially outer portion.", "3 . The tire of claim 2 , wherein the opposing key edges are angled by an angle A 1 relative to an axial direction of the tire, and wherein the angle A 1 is 60 degrees.", "4 . The tire of claim 1 , wherein the width WT 1 is 2.0 times the value of the width WT 2 .", "5 . The tire of claim 1 , wherein the width WT 1 is between 1.5 and 2.5 times the value of the width WT 2 .", "6 . The tire of claim 1 , wherein the radially inner portion of each outer section has a circumferential width WB 1 , and wherein the width WB 1 is less than the width WT 1 .", "7 . The tire of claim 1 , wherein the radially inner portion of the center section has a circumferential width WB 2 , and wherein the width WB 2 is greater than the width WT 2 .", "8 . The tire of claim 1 , wherein the radially inner portion of each outer section has a circumferential width WB 1 , wherein the radially inner portion of the center section has a circumferential width WB 2 , wherein the width WB 1 is less than the width WB 2 , and wherein the width WB 1 and the width WB 2 are both less than the width WT 1 .", "a tread portion comprising at least one of a tread rib or a tread block, a sipe included in the tread rib or the tread block, wherein the sipe includes a center section located axially between opposing outer sections, and wherein the center section and each outer section include a radially outer portion and a radially inner portion, wherein the radially outer portion of each outer section has a circumferential width WT wherein the radially outer portion of the center section has a circumferential width WT wherein the circumferential width WT wherein the radially inner portion of each outer section has a circumferential width WB wherein the radially inner portion of the center section has a circumferential width WB wherein the circumferential width WB", "10 . The tire of claim 9 , wherein the sipe center section has opposing key edges on its radially outer portion.", "11 . The tire of claim 10 , wherein the opposing key edges are angled by an angle A 1 relative to an axial direction of the tire, and wherein the angle A 1 is 60 degrees.", "12 . The tire of claim 9 , wherein the radially inner portion of each outer section includes an axially outer portion having a radial depth DB 1 E and an axially inner portion having a radial depth DB 1 I, and wherein the radial depth DB 1 E is less than the radial depth DB 1 I.", "13 . The tire of claim 9 , wherein the width WT 1 is 2.0 times the value of the width WT 2 .", "a center section located axially between opposing outer sections, wherein the center section and each outer section include a radially outer portion and a radially inner portion, wherein the radially outer portion of each outer section has a circumferential width WT wherein the radially outer portion of the center section has a circumferential width WT wherein the circumferential width WT wherein the radially inner portion of each outer section includes an axially outer portion having a radial depth DB wherein the radial depth DB", "15 . The tire of claim 14 , wherein the sipe blade center section has opposing key forming edges on its radially outer portion.", "16 . The tire of claim 15 , wherein the opposing key forming edges are angled by an angle A 1 relative to an axial direction, and wherein the angle A 1 is 60 degrees.", "17 . The tire of claim 14 , wherein the width WT 1 is 2.0 times the value of the width WT 2 .", "18 . The tire of claim 14 , wherein the radially inner portion of each outer section has a circumferential width WB 1 , and wherein the width WB 1 is less than the width WT 1 .", "19 . The tire of claim 14 , wherein the radially inner portion of the center section has a circumferential width WB 2 , and wherein the width WB 2 is greater than the width WT 2 .", "20 . The tire of claim 14 , wherein the radially inner portion of each outer section has a circumferential width WB 1 , wherein the radially inner portion of the center section has a circumferential width WB 2 , wherein the width WB 1 is less than the width WB 2 , and wherein the width WB 1 and the width WB 2 are both less than the width WT 1 ."], "bibtex": "@patent{20240424836,\n    title = {BI-DIRECTIONAL SIPE AND/OR SLOT},\n    number = {20240424836},\n    year = {2024},\n    note = {File: US20240424836A1-20241226.XML}\n    }", "classification": "B60C1112FI"}, {"title": "TIRE AND TIRE TREAD", "doc_number": "20240424837", "filename": "US20240424837A1-20241226.XML", "abstract": "The present invention is directed to a tread and a tire having a tread, wherein over most of a circumferential length i) a maximum axial width in a top portion of a tread groove is at least 5% smaller than an axial width of the tread groove in its bottom portion, ii) the axial width of the tread groove in the bottom portion is at least 5% smaller than the maximum axial width of the tread groove in a radial intermediate portion of the tread groove, and iii) a maximum axial width of the tread groove in the intermediate portion is within a range of 15% to 50% of the total radial height of the tread groove.", "detailed_description": ["In one aspect, the present invention is directed to a tire tread, wherein the tire tread comprises two tread shoulder portions comprising a first tread shoulder portion and a second tread shoulder portion, and a tread center portion arranged axially between the two tread shoulder portions. The first tread shoulder portion comprises a first circumferential shoulder rib and the second tread shoulder portion comprises a second (or another) circumferential shoulder rib, wherein each shoulder rib is delimited by a circumferential shoulder groove. The tread center portion comprises at least two adjacent circumferential tread ribs delimiting (between them) a circumferential tread groove. The tread groove has a (radial) top portion, a (radial) bottom portion and an intermediate portion radially between the top portion and the bottom portion. The tread groove has over most of its circumferential length a cross-section in which a maximum axial width in the top portion is at least 5% (preferably at least 10%) smaller than an axial width of the tread groove in the bottom portion, measured at 5% of the total radial height of the tread groove from the bottom of the groove (in the cross-section). Furthermore, in said cross-section, the axial width of the tread groove in the bottom portion, also measured at 5% of the total radial height of the tread groove from the bottom of the groove and in the cross-section, is at least 5% (preferably at least 10%) smaller than a maximum axial width of the tread groove in the intermediate portion of the cross-section. Moreover, still in the cross-section, the (length of the) maximum axial width of the tread groove in the intermediate portion is within a range of 15% to 50% of the (length of the) total radial height of the tread groove.", "", "Thus, a tire and/or a tread design in accordance with the present invention has circumferential tread grooves having over most of their circumferential length a relatively narrow top portion, a relatively wide intermediate portion, and an again narrower bottom portion. Taking into account the ranges mentioned above, the inventors have found that rolling resistance can be reduced in early tire life, whereas wet traction can be significantly improved after reduction of the non-skid level upon further wear of the tire.", "", "In one embodiment of the invention, in said cross-section, the top portion (radially) extends over 20% to 40% (preferably, over 22% to 40%) of the total radial height of the tread groove. Thus, the relatively narrow top portion extends over a significant height of the groove, which helps to provide the unworn or new tire tread with stiffness and/or reduced rolling resistance.", "", "In another embodiment of the invention, still in said cross-section, the bottom portion extends (down) from the height of the maximum axial width of the intermediate portion to the bottom of the groove.", "", "In still another embodiment, in said cross-section, the bottom portion has one or more of:", "", "a radial height within a range of 35% to 65% (preferably from 40% to 50%, or to 49%) of the total radial height of the tread groove;", "", "two (opposite) sidewalls tapering along or in an inner radial direction;", "", "two sidewalls, wherein at least one of the sidewalls has an angle with the axial direction which is within a range of 65° to 85°, preferably 70° to 85°. Preferably, the angles and/or orientations of two sidewalls are opposite to each other.", "", "In still another embodiment, in said cross-section, the top portion has one or more of:", "", "(essentially) parallel sidewalls;at least partially straight sidewalls;two sidewalls extending (essentially) in parallel to the radial direction;a constant (axial) width along the radial height;a maximum axial width within a range of 1%, preferably of 2% to 10%, preferably to 5%, of the total radial height of the tread groove; anda radially innermost end (e.g., at which the two sidewalls cease to be parallel) at a radial height within a range of 55% to 80%, preferably 60% to 75%, of the total radial height of the tread groove, measured in the radial direction from the bottom of the tread groove.", "", "In another embodiment, in the cross-section, the intermediate portion has at its radially outermost position an axial width which is identical to the axial width of the top portion (e.g., at the radially innermost end of the top portion) and which widens or increases along a radially inner direction to the maximum axial width of the intermediate portion.", "", "Preferably, still in the cross-section, the maximum axial width of the intermediate portion is also the (overall) maximum axial width of the tread groove in the cross-section.", "", "In still another embodiment, the width of the tread groove widens or increases continuously (from the radially outermost position of the intermediate portion) along the radially inner direction so as to reach the maximum axial width of the intermediate portion, all within the cross-section.", "", "In still another embodiment, and still in the cross-section, the bottom portion extends from the radial position of the maximum axial width of the intermediate portion (and/or the tread groove) down to the bottom of the tread groove.", "", "In still another embodiment of the present invention, and in the cross-section, the bottom portion tapers, e.g., continuously, and/or is preferably straight over at least 70% of its radial height, from its radially outermost position or radially outer position towards the bottom of the groove. In particular, such a feature may support improved demolding of the tread and/or helps to limit undesired stone collection upon driving.", "", "In yet another embodiment, in the cross-section, the maximum axial width of the tread groove, and/or the intermediate portion is or corresponds to one or more of:", "", "less than 60% (preferably less than 50%) of the maximum axial width of the shoulder groove, for instance, each shoulder groove;", "", "more than 30% of the maximum axial width of the shoulder groove;", "", "20% to 50% of the total radial height of one or more of the tread groove and the shoulder groove;", "", "present at a radial height within a range of 35% to 65% (preferably 40% to 60% or even more preferably 45% to 55%) of the total height of the tread groove, measured in the radial direction from the bottom of the tread groove.", "", "In an embodiment, one or more of ranges mentioned herein for tread grooves, apply to each tread groove of the tread. It is also possible that the ranges mentioned herein for shoulder grooves apply to each shoulder groove of the tread. In addition, or alternatively, one or more of ranges, percentages and values mentioned herein apply to said cross-section.", "", "In another embodiment, in said cross-section, a total cross-sectional area of the tread groove is less than 35% of a total cross-sectional area of the shoulder groove, preferably in the same circumferential position, and/or more than 15% of a total cross-sectional area of the shoulder groove, preferably in the same circumferential position.", "", "In still another embodiment, a cross-section is a plane comprising or spanned by the axial and the radial directions of the tire, and/or which is perpendicular to the circumferential direction.", "", "In still another embodiment, in the cross-section, the maximum axial width of the top portion (which may be essentially constant, or constant, radially along the top portion) of the tread groove has one or more of:", "", "less than 25%, preferably less than 20%, of a maximum axial width of the intermediate portion and/or the tread groove;", "", "more than 5%, preferably more than 10%, of the maximum axial width of the intermediate portion and/or the tread groove;", "", "less than 10% of a maximum axial width of the shoulder groove;", "", "more than 3% of the maximum axial width of the shoulder groove;", "", "Typically, the maximum axial width of the shoulder groove is present at its radially outermost opening.", "", "In another embodiment, the tread shoulder groove has over most of its circumferential length one or more of:", "", "an essentially V-shaped cross-section, or a V-shape, wherein, optionally, the bottom of the shoulder groove has a curved shape;", "", "two sidewalls having opposite angles within a range of 75° to 85° with the axial direction;", "", "a shape tapering from its radially outermost portion or side to its radially innermost bottom.", "", "In another embodiment, in the cross-section, one or both sidewalls of the bottom portion extend straightly over at least 70% of the radial height of the bottom portion.", "", "In still another embodiment, in the cross-section, one or both sidewalls of the intermediate portion extend straightly over at least 25% of the radial height of the intermediate portion. Preferably, such straight portion or section may have an angle with the axial direction within a range of 25° to 60°, preferably from 30° to 55°.", "", "In still another embodiment, in the cross-section, the tread groove has an amphora-like cross-sectional shape. Optionally, in a cross-sectional view, it has a bottleneck portion (i.e., top portion) which is narrower than the area radially below the bottle neck and which widens below the lower end of the bottle neck in a first portion (i.e., intermediate portion) so as to reach a maximum width, and which constricts again in a bottom portion below the first portion or intermediate portion towards its radial bottom.", "", "The present invention and embodiments mention different types of circumferential ribs or circumferential tread ribs. The term rib or circumferential rib preferably also encompasses circumferential rows of tread blocks, which are optionally arranged behind one another in a circumferential direction. This may particularly apply to shoulder ribs and/or center ribs. In addition, or alternatively, rows of tread blocks comprise tread blocks separated by lateral grooves. Lateral grooves can have angles with the axial direction. Such angles are preferably smaller than 40°, 30°, or 20°. Lateral grooves may comprise sipes, such as zig-zag sipes. An angle of a zig-zag sipe mentioned herein is determined between the axial direction and a line connecting both axially outermost ends of the zig-zag sipe.", "", "In still another embodiment, in the cross-section, the tread groove, and/or the bottom portion of the tread groove, has at 5% of its total radial height, measured from the bottom of the tread groove, an axial width within a range of 30% to 60% of the maximum axial width of the tread groove and/or the intermediate portion of the tread groove.", "", "In still another embodiment, and still in the cross-section, each sidewall of the tread groove has, in the intermediate portion, an/at least one inflection point between a radial height of maximum axial thickness and a radial height of minimum axial thickness of the tread groove in the intermediate portion.", "", "In still another embodiment, a tangent fitted to said inflection point of the sidewall has an angle with the axial direction within a range of 25° to 60°, preferably from 30° to 55°.", "", "In another aspect, the invention is directed to a tire comprising such as tread.", "", "In one embodiment, the tire is selected from one or more of a truck tire; a trailer tire; a 22.5 inch tire; a 24.5 inch tire; a pneumatic tire; a tire having three circumferential tread grooves and two circumferential shoulder grooves; a tire having four steel reinforced belt plies; a tire retreaded with the tread; a tire having a steel reinforced carcass ply; a tire having two bead areas comprising each a bead, a carcass ply extending between the two bead areas, wherein the carcass ply is radially covered by reinforced belt plies in a crown area of the tire, and/or wherein the belt plies are arranged radially below the tread; a multilayered tread having at least two radially superposed tread (e.g. tread cap) layers, wherein the tread layer (e.g., tread cap layer) contacting the road when driving defines or forms the bottoms and/or sidewalls of the grooves.", "", "In another embodiment, the tire is one of a 22.5 inch truck tire, a 24.5 inch truck tire, a 22.5 inch truck trailer tire, and a 24.5 inch truck trailer tire.", "", "In the second aspect, the present invention is directed to a tire having a tread comprising two tread shoulder portions comprising a first tread shoulder portion and a second tread shoulder portion, and a tread center portion arranged axially between the two tread shoulder portions. The first tread shoulder portion comprises a first circumferential shoulder rib comprising a circumferential row of shoulder tread blocks, and the second tread shoulder portion comprises a second circumferential shoulder rib comprising a second circumferential row of shoulder tread blocks, wherein each shoulder rib is delimited by a circumferential shoulder groove. The tread center portion comprises at least two adjacent circumferential tread ribs delimiting a circumferential tread groove. Each circumferential tread rib comprises a circumferential row of center tread blocks separated by lateral grooves. The tread groove has a top portion, a bottom portion and an intermediate portion radially between the top portion and the bottom portion. Furthermore, the tread groove has over most of its circumferential length a cross-section in which a maximum axial width in the top portion is at least 5% smaller than an axial width in the bottom portion (of the cross-section), measured at 5% of a total radial height of the tread groove from the bottom of the tread groove (in the cross-section). Moreover, in the cross-section, the axial width in the bottom portion, measured at 5% of the total radial height of the tread groove from the bottom of the tread groove, is at least 5% smaller than a maximum axial width of the tread groove in the intermediate portion of the cross-section. In addition, still in the cross-section, the maximum axial width in the intermediate portion is within a range of 15% to 50% of the total radial height of the tread groove.", "", "In one embodiment, the tread has two, three, or four circumferential center ribs and two circumferential shoulder ribs. Preferably, the tread has three circumferential center ribs.", "", "In another embodiment, a majority of the lateral grooves comprise a lateral sipe, preferably comprising a zig-zag shape.", "", "In still another embodiment, a majority of the lateral grooves comprise a lateral cut-out at each of both axially outer ends of the lateral groove and/or each of the adjacent tread blocks.", "", "In still another embodiment, in the circumferential rows of center tread blocks of two axially outer (or outermost and/or opposite) center ribs, circumferentially adjacent tread blocks are separated by sipes comprising a zig-zig shape. Optionally, every second sipe comprising the zig-zag shape extends to the radially outermost surface of the adjacent tread blocks and the remaining sipes having the zig-zag shape of the same rows of center tread blocks extend from their radially inner bottom to a radial position at least 10%, or 20% (and optionally at most 70%) below the radially outermost surface of the adjacent tread blocks. Optionally, the respective lateral groove is circumferentially broader than the zig-zag shape and/or linear, radially above said radial position.", "", "In another embodiment, in a circumferential row of center tread blocks which is crossed by the equatorial plane of the tire, all tread blocks are separated by lateral zig-zag sipes.", "", "In still another embodiment, the tire comprises a circumferential tread groove axially divided by the equatorial plane of the tire.", "", "FIG.1shows a schematic cross section of a tire1according to a preferred embodiment of the invention. The tire1has a tread10, an inner liner13, a belt structure11comprising four belts, a carcass ply9, two sidewalls2, and two bead regions3comprising bead filler apexes5and beads4. The example tire1is suitable, for example, for mounting on a rim of a vehicle, e.g. a truck. The carcass ply9includes a pair of axially opposite end portions6, each of which is secured to a respective one of the beads4. Each axial end portion6of the carcass ply9is turned up and around the respective bead4to a position sufficient to anchor each axial end portion6. The carcass ply9may be a rubberized ply having a plurality of substantially parallel carcass reinforcing members, e.g., made of metal. The turned-up portions6of the carcass ply9may engage the axial outer surfaces of two flippers8and axially inner surfaces of two chippers7. As shown inFIG.1, the example tread10can have four circumferential grooves.", "", "Still in accordance with the embodiment shown inFIG.1, the tire tread10has two axially outer shoulder ribs40and three center tread center ribs50. A shoulder rib40is delimited by one of the shoulder grooves20. The grooves formed between center tread ribs50are mentioned herein as tread grooves30. As visible inFIG.1, shoulder grooves20and tread grooves30have different cross-sectional shapes as shown in further detail inFIGS.3aand3b. As mentioned herein above, the tread ribs40,50may comprise or be formed of circumferential rows of tread blocks.", "", "The axial direction a, the radial direction r and the circumferential direction c are indicated in multiple Figures herein. The axial direction a is parallel to the axis of rotation of the tire, the radial direction r is perpendicular to the axial direction a, and the circumferential direction c is perpendicular to the radial and axial directions. A reference to one of these directions does not mandatorily include a specific orientation if not indicated otherwise.", "", "FIG.3Ashows a tread groove30between two tread center ribs50. The tread groove30has a total height h. Along its height h, the groove30has three adjacent and/or consecutive portions or sections, i.e., a top portion31having the height ht, a bottom portion33having the height hband an intermediate portion32arranged directly adjacent and radially between the top portion31and the bottom portion33, wherein the intermediate portion32has the radial height hi. The top portion31has in the present embodiment the width wt, which is constant along the radial direction in this example. The intermediate portion32has a varying width with a maximum axial with wmax. In particular, the width of the intermediate portion32continuously increases from a radially upper position to a radially lower position. The bottom portion33also has a varying width with an axial width wb, measured at a radial position of 5% of the total radial height h from the bottom of the tread groove30. While the top portion31has preferably a constant axial groove width, the axial width of the intermediate portion32of the groove30increases until reaching a maximum at its bottom/the lower end of the intermediate portion32. From that radial position, the axial width of the groove30tapers in its bottom portion33towards the bottom of the groove30. Unless otherwise indicated herein, widths of grooves are measured in an axial direction from one sidewall35of a groove to the opposite sidewall36of the same groove, and/or heights are measured in the radial direction.", "", "It is noted herein that the cross-section of groove30shown inFIG.3applies to most portions along the circumferential length of groove30. In particular, the tread10and/or ribs40,50may comprise lateral grooves, e.g., separating adjacent tread blocks. For instance, such a cross-section, or other circumferential cross-sections shown herein, may be present over at least 50%, or over at least 70% of the circumferential length of the respective circumferential groove. Similarly, it is also possible that such cross-sections are present over at least 50%, or over at least 70% of the circumferential length of tread blocks (or, in other words, each tread block) forming sidewalls of the respective groove.", "", "Still in accordance with the same non-limiting embodiment, the width wtis preferably within a range of 2% to 10%, preferably to 6%, of the total radial height h and/or less than 25% of the maximum axial width wmaxof the intermediate portion32/tread groove30. In an example, the width wtis within a range of 0.5 mm to 2 mm, preferably to 1.5 mm.", "", "The maximum width wmaxof the groove30and/or the intermediate portion32is preferably within a range of 20% to 45%, preferably 20% to 35%, or 20% to 30% of the total radial height h, and/or in an example, within a range of 4 mm to 9 mm, or preferably 5 mm to 8 mm.", "", "The width wbis preferably in a range of 30% to 60% of wmaxand/or within a range of 6% to 19% of the height h. In an example, the width wbmay be in a range of 1.5 mm to 4 mm, or from 2 mm to 3.5 mm.", "", "In the present embodiment, the total height h is optionally within a range of 20 mm to 50 mm (or to 40 mm, or just to 30 mm).", "", "The height htis preferably within a range of 30% to 40% of the radial height h, and/or 7 mm to 12 mm, preferably from 7 mm to 10 mm.", "", "The height hiis preferably within a range of 10% to 25% of the radial height h, and/or preferably within a range of 2 mm to 7 mm, or 3 mm to 6 mm.", "", "The height hbis preferably within a range of 40% to 55% of the radial height h, and/or from 9 mm to 14 mm.", "", "In the tapering bottom portion33, the sidewalls35,36(and/or their straight sections mentioned herein) can have an angle β with the axial direction a, which is preferably within a range of 75° to 89°, preferably from 75° to 85°.", "", "Preferably, portions or sections of the sidewalls35,36in the bottom portion33can linearly extend over at least 70% of their length from a radially outer position to a radially inner position.", "", "The intermediate portion32preferably has an inflection point between its radial top and radial bottom. In this inflection point, a tangent fitted to one of the sidewalls35,36has preferably an angle α with the axial direction a within a range of 40° to 55°, preferably from 40° to 50°.", "", "Optionally, one or both sidewalls35,36, or sections of those, are straight over at least 25% of the radial height of the intermediate portion32. Such a straight section may have an angle α with the axial direction a within a range of 40° to 55°, preferably from 40° to 50°.", "", "FIG.3bshows a magnification of a shoulder groove20, at essentially the same scale as the (center) tread groove30shown inFIG.3a. The total height of the groove20is shown as H and essentially corresponds in this example to the height h of groove30. The sidewalls25,26of the shoulder groove20, tapering in a radially inner direction, have each an absolute angle γ with the axial direction a, which is within a range of 75° to 85°. The shoulder groove's20width at the (radially outermost) groove opening to the (outermost) tread surface is W, which is within a range of 50% to 70% (preferably 55% to 65%) of the total radial groove height H, which may be for instance from 12 mm to 16 mm or from 13 mm to 15.5 mm. The width Wbis measured at a position of 5% of the radial height H and can be within a range of 15% to 25% of H, and/or from 25% to 40% of W, and/or from 3 mm to 7 mm, preferably from 4 mm to 6 mm.", "", "Similar toFIG.3a,FIG.4ashows another embodiment of a tread groove30′ corresponding to the design schematically shown inFIG.2.", "", "In particular, in accordance with this embodiment of the present invention,FIG.2shows a tire1′ having a tread10′ with shoulder ribs40′, (center) tread ribs50′, shoulder grooves20′ and (center) tread grooves30′. The groove design of this tire tread10′ is different than that of tread10according toFIG.1.", "", "FIG.4a, which shows a magnified view of a groove30′ between two tread grooves50′ of the tire1′ as shown inFIG.2, indicates the full groove height h′, the height of the a top portion31′ of the groove30′ as ht′, the height of the intermediate portion32′ as hi′, the height of the bottom portion33′ as hb′, the width of the top portion31′ as we′, the maximum width of the intermediate portion32′ as wmax′, and the width of the bottom portion33′ of the groove30′, determined at 5% of the total height h′ of the groove30′, as wb′. The sidewalls35′,36′ (particularly, straight parts or sections thereof) have an angle β′ with the axial direction in the bottom portion33′. Furthermore, in the intermediate portion32′, the sidewalls35′,36′ (or straight parts or sections thereof) have an angle α′ with the axial direction at an inflection point between the radially inner end of the top portion31′ and the radially outer end of the bottom portion33′.", "", "For the embodiment ofFIG.4a, the width wt′ is preferably within a range of 4% to 10% of the total radial height h′ and/or less than 20% of the maximum axial width wmax′ of the intermediate portion32′/the entire groove30′. In an example, the width wt′ is within a range of 0.5 mm to 2 mm, preferably to 1.5 mm.", "", "The maximum width of the groove30′ or the intermediate portion32′ wmax′ is preferably within a range of 20% to 50%, preferably from 30% to 50% of the total radial height h′, and/or in an example within a range of 4 mm to 9 mm, or preferably 5 mm to 8 mm.", "", "The width wb′ is preferably in a range of 30% to 60% of wmaxand/or within a range of 10% to 25%, preferably 15% to 25% of the height h′. In an example, the width wb′ may be within a range of 1.5 mm to 4 mm, or from 2 mm to 3.5 mm.", "", "The total height h′ is optionally within a range of 10 mm to 30 mm (alternatively from 10 mm to 25 mm or to 20 mm).", "", "The height ht′ is preferably within a range of 15% (or 20%) to 40% (or 30%) of the radial height h′, and/or 2 mm to 7 mm, preferably from 3 mm to 6 mm.", "", "The height hi′ is preferably within a range of 20% to 40% of the radial height h′, and/or preferably within a range of 4 mm to 6 mm.", "", "The height hb′ is preferably within a range of 35% to 55% of the radial height h′, and/or from 4 mm to 8 mm.", "", "At least one of the sidewalls35′,36′ (and/or straight sections thereof), tapering in the bottom portion33′, encloses an angle β′ with the axial direction, which is preferably within a range of 65° to 80°, preferably from 70° or 71° to 79° or 75°.", "", "The intermediate portion32′ has preferably an inflection point between its radial top and radial bottom. In this inflection point, a sidewall35′,36′ has preferably an angle α′ with the axial direction a within a range of 30° to 55°, preferably from 35° to 50°. In addition, or alternatively, a straight section of a sidewall35′,36′ encloses in the intermediate section32′ an angle α′ with the axial direction a within a range of 30° to 55°, preferably from 35° to 50°.", "", "FIG.4bshows a magnified view of a shoulder groove20′, at essentially the same scale as the (center) tread groove30′ shown inFIG.4a. The total height of the groove20′ is shown as H′ and essentially corresponds in this example to the height h′ of tread groove30′. The sidewalls25′,26′ of the shoulder groove20′, which taper in a radially inner direction, have an absolute angle γ′ with the axial direction, which is within a range of 75° to 85°. The shoulder groove width at the (radially outermost) groove opening to the (outermost) tread surface is indicated as W′, which is within a range of 60% to 80% of the total radial groove height H′, and which may be for instance from 9 mm to 14 mm or from 10 mm to 13 mm. The width Wb′ is measured at a position of 5% of the radial height H′ and can be within a range of 15% to 35% of H′, and/or from 25% to 40% of W′, and/or from 3 mm to 7 mm, preferably from 4 mm to 6 mm.", "", "In general, the treads10,10′ may have further axial/lateral grooves not depicted herein. They may also have sipes, such as winter/snow sipes and/or zig-zag sipes. They may also have additional grooves extending in further directions and/or depths.", "", "Grooves mentioned herein can typically have two opposite sidewalls and/or may have opposite sidewalls extending from a groove bottom in a radially outer direction with opposite angles. In particular, opposite sidewalls (or portions or sections thereof) may have opposite angles such that the sidewalls taper from a radially outer position to a radially inner position with such opposite angles.", "", "The description of groove geometries and/or designs assumes herein a new and/or unworn tire if not otherwise indicated. Groove width and/or cross-sectional shape will (intentionally) change upon wear of the tire tread.", "", "FIG.5shows a perspective sideview of another tire1″ in accordance with a preferred embodiment of the present invention. The tire1″ comprises a tread100having two shoulder ribs400. Each shoulder rib400comprises a circumferential row of shoulder tread blocks. Furthermore, tire1″ has a tread center portion comprising three tread center ribs comprising two axially outer center ribs510and an axially inner center rib520which is arranged along the equatorial plane of the tire (not explicitly shown). Each of the center ribs510,520comprises a circumferential row of tread blocks which are separated by lateral grooves. In particular, center rib520comprises tread blocks separated by lateral grooves comprising zig-zag sipes630. The axially outer center ribs510comprise tread blocks which are also separated by lateral grooves comprising zig-zag sipes. However, while every second tread block of an axially outer center rib510is separated from its circumferentially adjacent tread block by a groove620comprising a zig-zag sipe, similar to the grooves630, its remaining tread blocks are separated by a groove610which comprises a sipe (particularly a zig-zag sipe) only in a radially lower portion of the groove610. In other words, in the grooves620and630, a respective zig-zag sipe extends to the radially outermost surface of the adjacent tread blocks, whereas in groove610, the zig-zag sipe extends only over a portion of the total radial depth of the groove610. A radial top portion of the groove610is circumferentially broader than its zig-zag sipe and laterally essentially linear or straight.", "", "In accordance with the present embodiment of the invention, the tire1″ further comprises circumferential tread grooves300axially separating axially adjacent center ribs510,520. In this case the tire1″ has two such circumferential tread grooves300. Preferably, these grooves300have over at least 50% of their circumferential length a cross-section which has been described in other embodiments herein. In particular, this applies to the cross-section between two axially neighboring tread blocks of two axially neighboring tread center ribs510,520.", "", "As further shown inFIG.5, the lateral grooves610,620,630have cut-outs710,720at their respective axially outer ends. In particular, these cut-outs710,720extend in a radial direction to the bottom of the lateral and/or circumferential grooves. In other words, preferably, a cut-out is provided at each of the four corners of a tread block. At positions in which four corners of four tread blocks are facing and/or neighboring one another, the cut-outs of these four neighboring corners form together a radially extending channel, which preferably extends from the radially outer surface of the tread100to the bottom of the adjacent lateral grooves.", "", "In addition, the tread100has two circumferential shoulder grooves200which have over at least 50% of their circumferential length a V-shaped cross-section. This particularly applies to cross-sections between axially neighboring tread blocks.", "", "The invention and/or one or more of its embodiments provide an improved tread design. In particular, groove designs disclosed herein can help to improve tread stiffness and/or rolling resistance in early tire life. The increased tread stiffness also helps to improve treadwear in early tire life. Moreover, wet traction may be improved, especially when the tread is partially worn. In other words, the suggested groove design can help to improve treadwear and/or rolling resistance by at least partially increasing tread stiffness when there is higher void from tread features (such as lateral grooves, sipes, etc.). When tread features are not as abundant, the groove width increases to improve worn traction and/or water evacuation. The groove cross-sections suggested herein can also allow easier demolding and/or have reduced stone holding properties.", "", "The above-mentioned aspects, their embodiments and features may be combined with one another.", "", "Variations in the present invention are possible in light of the description of it provided herein. While certain representative embodiments and details have been shown for the purpose of illustrating the subject invention, it will be apparent to those skilled in this art that various changes and modifications can be made therein without departing from the scope of the subject invention. It is, therefore, to be understood that changes can be made in the particular embodiments described which will be within the full intended scope of the invention as defined by the following appended claims."], "claims": ["a tread having a tread groove extending continuously in the circumferential direction; wherein the tread groove has a top portion, a bottom portion and a transition portion located between the top portion and the bottom portion, wherein a maximum axial width of the tread groove in the top portion is 2 mm, wherein the tread groove has opposed sidewalls, and wherein the opposed sidewalls are tapered towards each other in the bottom portion, wherein the opposed sidewalls in the transition portion are tapered away from each other.", "2 . The tire according to claim 1 , wherein the bottom portion has a minimum width Wb in the range of 1.5-3.5 mm.", "3 . The tire according to claim 1 , wherein the groove has a maximum width Wmax in the range of 4-9 mm.", "4 . The tire according to claim 1 , wherein the groove has a maximum width Wmax in the range of 5-7 mm.", "5 . The tire according to claim 1 , wherein the groove has a maximum width Wmax in the transition section.", "6 . The tire according to claim 1 , wherein the ratio of Wmax to Wb is in the range of 1.5-2.5.", "7 . The tire of claim 1 wherein the maximum width of the groove is located at a radial height in the range of 40-60% of the total radial height.", "8 . The tire of claim 1 wherein the maximum width of the groove is located at 50% of the radial height.", "9 . The tire tread according to claim 1 , wherein the groove is located on the centerline of the tread.", "less than 50% of the maximum axial width of the shoulder groove; more than 30% of the maximum axial width of the shoulder groove; 20% to 45% of the total radial height of one or more of the tread groove and the shoulder groove; present at a radial height within a range of 35% to 65% of the total height of the tread groove, measured in the radial direction from the bottom of the tread groove.", "less than 35% of a total cross-sectional area of the shoulder groove; more than 15% of a total cross-sectional area of the shoulder groove.", "less than 25% of a maximum axial width of the tread groove; more than 10% of the maximum axial width of the tread groove; less than 10% of a maximum axial width of the shoulder groove; more than 3% of the maximum axial width of the shoulder groove.", "an essentially V-like shape; two sidewalls having opposing angles within a range of 75° to 85° with the axial direction; a shape tapering from its radially outermost portion to its radially innermost bottom.", "14 . The tire tread according to claim 1 , wherein the tread groove has an amphora-like cross-sectional shape.", "15 . The tire tread according to claim 1 , wherein the tread groove has at 5% of its total axial height, measured from the bottom of the tread groove, an axial width within a range of 30% to 60% of the maximum axial width of the tread groove.", "16 . The tire tread according to claim 1 , wherein each sidewall of the tread groove has in the intermediate portion an inflection point between a radial height of maximum axial thickness and a radial height of minimum axial thickness of the tread groove in the intermediate portion.", "17 . The tire tread according to claim 16 , wherein a tangent fitted in the inflection point of the sidewall has an angle with the axial direction within a range of 25° to 60°.", "18 . A tire comprising the tread according to claim 1 .", "a truck tire; a trailer tire; a 22.5 inch tire; a pneumatic tire; a tire having three circumferential tread grooves and two circumferential shoulder grooves; a tire having four steel reinforced belt plies; a tire retreaded with the tread; a tire having a steel reinforced carcass ply; a tire having two bead areas comprising each a bead, a carcass ply extending between the two bead areas, wherein the carcass ply is radially covered by reinforced belt plies in a crown area of the tire, and wherein the belt plies are arranged radially below the tread; a tread having at least two radially superposed tread layers, wherein the tread layer contacting the road when driving defines the bottoms and sidewalls of the grooves.", "20 . The tire according to claim 18 , wherein the tire is one of a 22.5 inch truck tire and a 22.5 inch truck trailer tire.", "two tread shoulder portions comprising a first tread shoulder portion and a second tread shoulder portion; a tread center portion arranged axially between the two tread shoulder portions, wherein the first tread shoulder portion comprises a first circumferential shoulder rib and the second tread shoulder portion comprises a second circumferential shoulder rib and wherein each shoulder rib is delimited by a circumferential shoulder groove, wherein the tread center portion comprises at least two adjacent circumferential tread ribs delimiting a circumferential tread groove, wherein the tread groove has a top portion, a bottom portion and an intermediate portion radially between the top portion and the bottom portion; wherein the tread groove has over most of its circumferential length a cross-section in which a maximum axial width in the top portion is at least 5% smaller than an axial width in the bottom portion, measured at 5% of a total radial height of the tread groove from the bottom of the tread groove; in which the axial width in the bottom portion, measured at 5% of the total radial height of the tread groove from the bottom of the tread groove, is at least 5% smaller than a maximum axial width of the tread groove in the intermediate portion; and in which the maximum axial width of the tread groove in the intermediate portion is within a range of 15% to 50% of the total radial height of the tread groove.", "22 . The tire tread according to claim 21 , wherein, in the cross-section, the top portion extends over 20% to 40% of the total radial height of the tread groove.", "23 . The tire tread according to claim 21 , wherein, in the cross-section, the bottom portion extends from the height of the maximum axial width of the intermediate portion to the bottom of the groove.", "a radial height within a range of 35% to 65% of the total radial height of the tread groove; two opposite sidewalls tapering along an inner radial direction; two opposite sidewalls, wherein at least one of the sidewalls has an angle with the axial direction which is within a range of 65° to 85°.", "parallel sidewalls; straight sidewalls; two sidewalls extending in parallel to the radial direction; a constant width along the radial height; a maximum axial width within a range of 1% to 10% of the total radial height of the tread groove; a radially innermost end at a radial height within a range of 55% to 80% of the total radial height of the tread groove, measured in the radial direction from the bottom of the tread groove."], "bibtex": "@patent{20240424837,\n    title = {TIRE AND TIRE TREAD},\n    number = {20240424837},\n    year = {2024},\n    note = {File: US20240424837A1-20241226.XML}\n    }", "classification": "B60C1113FI"}]