[{"title": "VEHICLE COMPONENT WITH A MULTI-LAYER PAINT SYSTEM AND METHOD FOR PRODUCING SAME", "doc_number": "20240190168", "filename": "US20240190168A1-20240613.XML", "abstract": "A vehicle component with a multi-layer paint system and a method for producing the same. The vehicle component has a multi-layer paint system applied to a base body of the vehicle component. The multi-layer paint system has at least a first color-giving coating layer and a second color-giving coating layer covering the first color-giving paint layer. The first color-giving coating layer and the second color-giving coating layer are separated from each other by a light-permeable intermediate coating layer. The second color-giving coating layer is removed in partial areas of the multi-layer paint system, such that the first color-giving coating layer is visible in these partial areas.", "detailed_description": ["FIG.1shows a wheel rim1with a so-called dual-color appearance. This dual-color appearance is achieved by two color-giving coating layers2,3, which are coated one over the other, wherein a lower first color-giving coating layer2is partially covered by the upper second color-giving coating layer3, so that only in partial areas in which the upper second color-giving coating layer3has been removed, the lower first color-giving coating layer2is visible. This creates areas of different colors for the viewer. The removal of the second color-giving coating layer3can, for example, be carried out mechanically by means of a lathe tool4, as is represented exemplarily inFIG.2.", "", "The structure of the multi-layer paint system is schematically represented inFIGS.3to5. A primer6is first applied to a metallic base body5of the wheel rim1. On this primer6then the first color-giving coating layer2, on this first color-giving coating layer2a transparent intermediate coating layer7, and on this intermediate coating layer7the second color-giving coating layer3is applied. This state is represented inFIG.3. In the state represented inFIG.3, the second color-giving coating layer3completely covers the first color-giving coating layer2, so that the first color-giving coating layer2is not visible from the outside.", "", "In order to make the first color-giving coating layer2visible from the outside, partial areas of the second color-giving coating layer3are removed by means of a cutting machining process, as is represented exemplarily inFIG.2. In this case, the intermediate coating layer7serves as a buffer layer to prevent the lathe tool4from penetrating into the first color-giving coating layer2.", "", "The result after the partial removal of the second color-giving coating layer3is represented schematically inFIG.4. In this state, the first color-giving coating layer2is visible from the outside in the areas in which the second color-giving coating layer3has been removed, despite the remaining intermediate coating layer7, since the intermediate coating layer7is transparent.", "", "After the removal or partial removal of the second color-giving coating layer3, an outer transparent coating layer8is applied, which then covers the underlying coating layers2,3,7and also fills the gaps created by the partial removal of the second color-giving coating layer3. This final state is represented inFIG.5. The coating material of the outer transparent coating layer8and the coating material of the intermediate layer7may be a clearcoat."], "claims": ["a base body; and a multi-layer paint system applied to the base body, wherein the multi-layer paint system has at least one first color-giving coating layer and a second color-giving coating layer covering the first color-giving coating layer, wherein the first color-giving coating layer and the second color-giving coating layer are separated from each other by a light-permeable intermediate coating layer, wherein the second color-giving coating layer is absent in partial regions of the multi-layer paint system such that the first color-giving coating layer is visible in the partial regions.", "2 . The vehicle component as claimed in claim 1 , wherein the vehicle component is a vehicle wheel.", "3 . The vehicle component as claimed in claim 1 , wherein the light-permeable intermediate coating layer is transparent or translucent.", "4 . The vehicle component as claimed in claim 1 , wherein the light-permeable intermediate coating layer is a clearcoat layer.", "5 . The vehicle component as claimed in claim 1 , wherein the multi-layer paint system has an outermost coating layer, which completely covers the color-giving coating layers and the intermediate coating layer, and wherein the outermost coating layer is light-permeable.", "6 . The vehicle component as claimed in claim 5 , wherein the intermediate coating layer has a greater layer thickness than the outermost coating layer.", "7 . The vehicle component as claimed in claim 1 , wherein paint of the first color-giving coating layer is a metal effect paint.", "8 . A vehicle comprising the vehicle component of claim 1 .", "i. applying the multi-layer paint system to the base body, wherein the multi-layer paint system has at least a first color-giving coating layer and a second color-giving coating layer covering the first color-giving coating layer, wherein the first color-giving coating layer and the second color-giving coating layer are separated from each other by a light-permeable intermediate coating layer applied to the first color-giving coating layer; and ii. removing the second color-giving coating layer in partial areas of the multi-layer coating in such a way that the first coloring coating layer becomes visible in the partial areas.", "10 . The method as claimed in claim 9 , wherein the intermediate coating layer is at least partially removed when the second coating layer is being removed.", "11 . The method as claimed in claim 9 , wherein the removal of the second coating layer is carried out mechanically."], "bibtex": "@patent{20240190168,\n    title = {VEHICLE COMPONENT WITH A MULTI-LAYER PAINT SYSTEM AND METHOD FOR PRODUCING SAME},\n    number = {20240190168},\n    year = {2024},\n    note = {File: US20240190168A1-20240613.XML}\n    }", "classification": "B60B700FI"}, {"title": "Wheel for a Chassis of a Rail Vehicle, Chassis for Rail Vehicles and Method for Producing the Wheel for the Chassis of the Rail Vehicle", "doc_number": "20240190169", "filename": "US20240190169A1-20240613.XML", "abstract": "A forged wheel for a chassis of a rail vehicle includes a wheel web, a wheel hub and a wheel rim with a running surface and a wheel flange, where material is recessed out of the wheel web, which is solid in sections, between the wheel hub and the wheel rim, in sections extending in the circumferential direction or transversely with respect to a radial direction of the wheel web, and where at least a first distance and a second distance between a recess centre point of a first recess in the wheel web and an edge of the first recess differ in size such that a lightweight wheel that can be manufactured with little outlay and that has high strength and quality is obtained.", "detailed_description": ["FIG.1shows a layout of an exemplary embodiment of an inventive wheel. The wheel, which is a solid wheel and which is formed as a forged wheel made of steel, is provided for a chassis of a rail vehicle, and has a single straight wheel web1, a wheel hub2and a tempered wheel rim3with a running surface4and a wheel flange5.", "", "Via a central hole6in the wheel hub2, the wheel can be connected to a wheelset shaft (not shown) of a wheelset or, if the chassis is formed as an idler gear chassis, to an axle stub (not shown) of the idler gear chassis.", "", "By way of the running surface4and the wheel flange5the wheel can roll on a rail (not shown) of a track.", "", "A forged material of the wheel has a carbon content of less than 0.6%.", "", "In the region of the wheel rim3, the forged material has an upper yield point of greater than 520 MPa and a tensile strength of greater than 820 MPa.", "", "In the region of the wheel rim3, an individual value of the notch impact energy of the forged material is greater than 12 J (Charpy U test; at a temperature of 20° C.), an average value of the notch impact energy is more than 17 J (Charpy U test; at a temperature of 20° C.).", "", "In the region of the wheel rim3, an individual value of the fracture toughness of the forged material is greater than 70 MPa·m0.5, and an average value of the fracture toughness is more than 80 MPa·m0.5. The forged material hence has toughness properties particularly suitable for use in the wheel.", "", "The wheel web1is solid in sections. In turn, material is recessed in sections from the wheel web1, between the wheel hub2and the wheel rim3, extending in the circumferential direction of the wheel web1, so that the wheel is unbalanced or balanced.", "", "A center of mass7of the wheel is arranged in a geometric center point8of the wheel, where an axis of rotation of the wheel runs through the center of mass7or the geometric center point8.", "", "Arranged in the wheel web1are a first recess9, a second recess10, a third recess11and a fourth recess12. Arranged between the first recess9, the second recess10, the third recess11and the fourth recess12and surrounding them are solidly formed sections of the wheel web1or of the wheel.", "", "The first recess9, the second recess10, the third recess11and the fourth recess12are arranged symmetrically. As a result, the wheel is unbalanced.", "", "The first recess9, the second recess10, the third recess11and the fourth recess12are arranged and formed symmetrically with respect to a first wheel front axis13and a second wheel front axis14. The first wheel front axis13and the second wheel front axis14are arranged orthogonally to one another.", "", "In its center section15the first recess9is formed in the shape of a circular ring sector and has a first end section16and a second end section17, which are arranged adjacent to the center section15and are formed as rounded in the shape of a semicircle.", "", "A first distance a1and a second distance a2between a recess center point MAof the first recess9and an edge uAof the first recess9differ in size. The first recess9is formed as rounded, but not circular.", "", "An arc length b, defined by a center radius r of the first recess9, of the first recess9is greater than an eighth and less than a quarter of a circumference u, defined by the center radius r, of an imaginary circle18arranged concentrically to the wheel web1.", "", "The arc length b of the first recess9is around a fifth of the circumference u.", "", "The first recess9is arranged radially spaced apart from the wheel hub2and adjoins a curve19, which is formed in a transitional region between the wheel web1and the wheel rim3.", "", "The curve19is associated with the wheel web1. In accordance with the invention, it is also possible for the first recess9to protrude into the curve19or extend into a rounded section directly adjoining the wheel hub2, etc.", "", "The first recess9is structured to extend over an entire thickness of the wheel web1. Edges of the first recess9that appear projecting inFIG.1in the direction of thickness of the wheel web1are formed as straight and orthogonal to front faces of the wheel web1. The first end section16and the second end section17are hence each formed as semi-cylindrical.", "", "In accordance with the invention, it is also conceivable for the edges of the first recess9extending in the direction of thickness of the wheel web1to be formed as curved; for example, if the wheel web1is designed as corrugated.", "", "The second recess10, the third recess11and the fourth recess12are formed identically to the first recess9and are positioned radially identically to the first recess9in the wheel web1, but in the circumferential direction have different positions than the first recess9.", "", "Various three-dimensional geometries can be imagined for the first recess9, the second recess10, the third recess11and the fourth recess12. For example, it is conceivable to form the first recess9, the second recess10, the third recess11and the fourth recess12as transverse to radial directions of the wheel web1(a radial direction is indicated, for example, by the center radius r), rectangular or trapezoidal with rounded corners, oval or elliptical. For base and top surfaces of the first recess9, the second recess10, the third recess11and the fourth recess12any geometric shapes optimized for wheel mass, wheel strength and/or wheel noise are possible.", "", "The first recess9, the second recess10, the third recess11and the fourth recess12, i.e., the recessed material, are milled out with a form milling cutter following a forging process of the wheel via a CNC (Computerized Numerical Control) milling machine (not shown).", "", "In accordance with the invention, it can, however, also be imagined that the recessed material is punched out. For example, the punching out of the first recess9, the second recess10, the third recess11and the fourth recess12can be performed during the forging process of the wheel, as is described in connection withFIG.3.", "", "FIG.2shows a section from an exemplary embodiment of an inventive chassis of a rail vehicle as a side view, which comprises wheels in accordance withFIG.1.", "", "The chassis has a chassis frame20, which is connected to a first wheelset25via a first primary spring21, a first wheelset guide bushing22, a first swing arm23and a first wheelset bearing24and, not visible inFIG.2, via a second primary spring, a second wheelset guide bushing, a second swing arm and a second wheelset bearing.", "", "The chassis frame20is further coupled to a second wheelset of the chassis, not shown inFIG.2, via a third primary spring, a fourth primary spring, a third wheelset guide bushing, a fourth wheelset guide bushing, a third swing arm, a fourth swing arm, a third wheelset bearing and a fourth wheelset bearing, which are likewise not shown inFIG.2.", "", "A first wheel and a second wheel, not visible inFIG.2, opposite the first wheel, is connected to a first wheelset shaft, likewise not visible inFIG.2, of the first wheelset25.", "", "A third wheel and a fourth wheel of the second wheelset are connected to a second wheelset shaft of the second wheelset.", "", "The first wheel is structured as described in connection withFIG.1and comprises a wheel web1, a wheel hub2and a wheel rim3with a running surface4and a wheel flange5. A first recess9, a second recess10, a third recess11and a fourth recess12are formed in the wheel web1.", "", "The second wheel, the third wheel and the fourth wheel are structured identically to the first wheel.", "", "FIG.3discloses a flow diagram for an exemplary embodiment of an inventive method for producing a wheel for a chassis of a rail vehicle, as shown by way of example inFIG.1andFIG.2, via a forging process performed as hot forming.", "", "In a heating step26, a temperature of a forged workpiece made of steel in a furnace is first set to a value of approx. 1000° C., i.e., above a recrystallization temperature. Depending on the type of steel used for the forged workpiece, it is possible to set a temperature in a range between approx. 950° C. and approx. 1250° C.", "", "In a transformation step27, following on from the heating step26, for which the temperature of the forged workpiece is kept at approximately 1000° C. or cooling to a temperature of below 950° C. is prevented, a body with a wheel shape is formed from the workpiece, i.e., a wheel web1, a wheel hub2and a wheel rim3with a running surface4and a wheel flange5are produced by formation under pressure in a die.", "", "During the forging process, immediately after the transformation step27, a first recess9, a second recess10, a third recess11and a fourth recess12are punched out from the wheel web1in a punching-out step28via a punching tool. The temperature of the forged workpiece or of the wheel has a value of above the recrystallization temperature of steel during the punching-out step28. For this exemplary embodiment of the inventive method, the temperature is more than 950° C.", "", "After the punching-out step28, the wheel cools down completely and achieves its strength properties necessary for use in the chassis.", "", "Thus, while there have been shown, described and pointed out fundamental novel features of the invention as applied to a preferred embodiment thereof, it will be understood that various omissions and substitutions and changes in the form and details of the methods described and the devices illustrated, and in their operation, may be made by those skilled in the art without departing from the spirit of the invention. For example, it is expressly intended that all combinations of those elements and/or method steps which perform substantially the same function in substantially the same way to achieve the same results are within the scope of the invention. Moreover, it should be recognized that structures and/or elements and/or method steps shown and/or described in connection with any disclosed form or embodiment of the invention may be incorporated in any other disclosed or described or suggested form or embodiment as a general matter of design choice. It is the intention, therefore, to be limited only as indicated by the scope of the claims appended hereto."], "claims": ["1 .- 20 . (canceled)", "a wheel web; a wheel hub; and a wheel rim with a running surface and a wheel flange; wherein the wheel is formed as a forged wheel; wherein material is recessed out of the wheel web, which is solid in sections, between the wheel hub and the wheel rim, in sections extending in the circumferential direction or transversely with respect to a radial direction of the wheel web; and wherein at least one first distance and one second distance between a recess center point of a first recess in the wheel web and an edge of the first recess differ in size.", "22 . The wheel as claimed in claim 21 , wherein the first recess is formed as rounded.", "23 . The wheel as claimed in claim 21 , wherein the wheel web is arranged as a single wheel web of the wheel.", "24 . The wheel as claimed in claim 22 , wherein the wheel web is arranged as a single wheel web of the wheel.", "25 . The wheel as claimed in claim 21 , wherein a center of mass of the wheel is arranged at least approximately in a geometric center point of the wheel.", "26 . The wheel as claimed in claim 21 , wherein a forged material of the wheel has a carbon content of less than 0.6%.", "27 . The wheel as claimed in claim 21 , wherein a forged material of the wheel has an upper yield point of greater than 520 MPa.", "28 . The wheel as claimed in claim 21 , wherein a forged material of the wheel has a tensile strength of greater than 820 MPa.", "29 . The wheel as claimed in claim 21 , wherein a forged material of the wheel has a notch impact energy of greater than 12 J.", "30 . The wheel as claimed in claim 21 , wherein a forged material of the wheel has a fracture toughness of greater than 70 MPa·m 0.5 .", "31 . The wheel as claimed in claim 21 , wherein at least the first recess and a second recess are arranged in the wheel web.", "32 . The wheel as claimed in claim 31 , wherein the first recess and the second recess are arranged and formed as symmetrical at least in respect of a first wheel front axis.", "33 . The wheel as claimed in claim 31 , wherein a third recess and a fourth recess are arranged in the wheel web.", "34 . The wheel as claimed in claim 32 , wherein a third recess and a fourth recess are arranged in the wheel web.", "35 . The wheel as claimed in claim 33 , wherein the third recess and the fourth recess are arranged and formed symmetrically at least with respect to a second wheel front axis.", "36 . The wheel as claimed in claim 21 , wherein at least the first recess is formed at least in a center section in the shape of a circular ring sector.", "37 . The wheel as claimed in claim 36 , wherein an arc length), defined by a center radius of the first recess, of the first recess is established to be greater than an eighth and less than a quarter of a circumference, defined by the center radius of a circle.", "38 . The wheel as claimed in claim 21 , wherein at least the first recess has at least one first end section formed as semicircular.", "39 . The wheel as claimed in claim 21 , wherein the recessed material is milled out.", "40 . The wheel as claimed in claim 21 , wherein the recessed material is punched out.", "41 . A chassis for rail vehicles with wheels as claimed in claim 21 .", "forging the wheel; and recessing material out of the wheel web; wherein material is recessed out of the wheel web, which is solid in sections, between the wheel hub and the wheel rim, in sections extending in the circumferential direction or transversely with respect to a radial direction of the wheel web; and wherein at least one first distance and one second distance between a recess center point of a first recess in the wheel web and an edge of the first recess differ in size."], "bibtex": "@patent{20240190169,\n    title = {Wheel for a Chassis of a Rail Vehicle, Chassis for Rail Vehicles and Method for Producing the Wheel for the Chassis of the Rail Vehicle},\n    number = {20240190169},\n    year = {2024},\n    note = {File: US20240190169A1-20240613.XML}\n    }", "classification": "B60B1700FI"}, {"title": "BICYCLE WHEEL", "doc_number": "20240190170", "filename": "US20240190170A1-20240613.XML", "abstract": "A bicycle wheel comprising an annular rim having an inner circumferential portion, an outer circumferential portion and a pair of side portions that extend between the inner circumferential portion and the outer circumferential portion. Each side portion comprises a primary surface and a plurality of pockets that are recessed below the primary surface.", "detailed_description": [""], "claims": ["1 . A bicycle wheel comprising an annular rim having an inner circumferential portion, an outer circumferential portion and a pair of side portions that extend between the inner circumferential portion and the outer circumferential portion, wherein each side portion comprises a primary surface and a plurality of pockets that are recessed below the primary surface.", "2 . A bicycle wheel according to claim 1 , wherein each pocket has an area S of at least 0.25 cm 2 .", "3 . A bicycle when according to claim 1 , wherein each pocket has an area S of less than 50 cm 2 .", "4 . A bicycle wheel according to claim 1 , wherein each pocket has a recess depth R greater than 0.1 mm.", "5 . A bicycle wheel according to claim 1 , wherein each pocket has a recess depth R less than 4 mm, preferably less than 2 mm, preferably less than 1 mm.", "6 . A bicycle wheel according to claim 1 , wherein each pocket comprises a base portion and at least one side wall that extends between the base portion and the primary surface.", "7 . A bicycle wheel according to claim 6 , wherein the at least one side wall is inclined relative to the primary surface at an angle in the range 5-30 degrees.", "8 . A bicycle wheel according to claim 1 , wherein the pockets extend substantially radially.", "9 . A bicycle wheel according to claim 8 , wherein each pocket includes a base portion and a pair of side walls that extend between the base portion and the primary surface, wherein each side wall extends at an angle A relative to a radial direction, where the angle A is in the range 0-30 degrees.", "10 . A bicycle wheel according to claim 9 , wherein said pair of side walls converge in a radially outward direction.", "11 . A bicycle wheel according to claim 1 , wherein each of the pockets extends across the inner circumferential portion and then extends outwards across the side portions of the rim.", "12 . A bicycle wheel according to claim 1 , wherein the rim has a rim depth D measured radially between the inner circumferential portion and the outer circumferential portion, and each pocket extends radially for a pocket radial distance P, where P has a value of at least 0.4D.", "13 . A bicycle wheel according to claim 1 , wherein each side portion includes a number N of pockets spaced circumferentially around the rim, where the number N is in the range 8-50.", "14 . A bicycle wheel according to claim 1 , wherein each side portion includes a plurality of pockets spaced circumferentially around the rim, and wherein each pocket is spaced from an adjacent pocket by a spacing angle B in the range 7-45 degrees.", "15 . A bicycle wheel according to claim 1 , wherein the rim has a rim depth D measured radially between the inner circumferential portion and the outer circumferential portion, wherein the rim depth D is in the range 30-200 mm.", "16 . A bicycle wheel according to claim 1 , wherein the rim has a cross-sectional profile that is substantially U shaped, or substantially V shaped, or U/V shaped.", "17 . A bicycle wheel according to claim 1 , further comprising a hub and a plurality of connecting elements that connect to the annular rim to the hub.", "18 . A bicycle wheel according to claim 1 , wherein the inner circumferential portion contacts an axle of the wheel, whereby the bicycle wheel comprises a solid disc.", "19 . A bicycle wheel comprising a disc having an axis of rotation, an outer circumferential portion and a pair of side portions that extend between the axis of rotation and the outer circumferential portion, wherein each side portion comprises a primary surface and a plurality of pockets that are recessed below the primary surface.", "20 . A bicycle wheel according to claim 19 , wherein each pocket has an area S of at least 1 cm 2 .", "21 . A bicycle when according to claim 19 , wherein each pocket has an area S of less than 50 cm 2 .", "22 . A bicycle wheel according to claim 19 , wherein each pocket has a recess depth R greater than 0.2 mm.", "23 . A bicycle wheel according to claim 19 , wherein each pocket has a recess depth R less than 4 mm.", "24 . A bicycle wheel according to claim 19 , wherein each pocket comprises a base portion and at least one side wall that extends between the base portion and the primary surface.", "25 . A bicycle wheel according to claim 24 , wherein the at least one side wall is inclined relative to the primary surface at an angle in the range 5-30 degrees.", "26 . A bicycle wheel according to claim 19 , wherein the pockets extend substantially radially.", "27 . A bicycle wheel according to claim 26 , wherein each pocket includes a base portion and a pair of side walls that extend between the base portion and the primary surface, wherein each side wall extends at an angle A relative to a radial direction, where the angle A is in the range 0-30 degrees.", "28 . A bicycle wheel according to claim 27 , wherein said pair of side walls converge in a radially outward direction.", "29 . A bicycle wheel according to claim 19 , wherein each side portion includes a number N of pockets spaced circumferentially around the rim, where the number N is in the range 8-50.", "30 . A bicycle wheel according to claim 19 , wherein each side portion includes a plurality of pockets spaced circumferentially around the rim, and wherein each pocket is spaced from an adjacent pocket by a spacing angle B in the range 7-45 degrees.", "31 . A bicycle wheel according to claim 19 , wherein the wheel has a wheel radius W measured radially between the axis of rotation and the outer circumferential portion, and each pocket is located in a radially outer part of the wheel at a distance X from the axis of rotation, where X is at least 0.4W."], "bibtex": "@patent{20240190170,\n    title = {BICYCLE WHEEL},\n    number = {20240190170},\n    year = {2024},\n    note = {File: US20240190170A1-20240613.XML}\n    }", "classification": "B60B2106FI"}, {"title": "RIM FOR AN AT LEAST PARTIALLY MUSCLE-POWERED BICYCLE", "doc_number": "20240190171", "filename": "US20240190171A1-20240613.XML", "abstract": "A rim, having a rim body with rim flanks, a rim well and a rim base, in which the flanks abut in the radially most inwardly point, and with opposed rim flanges, each extending from one of the flanks up to a radially most outwardly point, so that the rim flanges form opposed side walls with the flanks. The widest spot of the rim body lies beneath the rim well and above a horizontal centerline. The width in the widest spot is at least one quarter larger than a clear rim width between the rim flanges. The side walls show a defined curvature shape with an inflection point which is disposed between the radially most outwardly point and the widest spot and lies external of the rim flange. In the inflection point, a concave curvature makes a transition to a convex curvature lying between the inflection point and the widest spot.", "detailed_description": ["FIG.1shows an at least partially muscle-powered bicycle100, which is presently configured as a sports bicycle for cross-country races and e.g. as a gravel bike or a cyclo-cross bicycle. The bicycle100has a front wheel101and a rear wheel102having one rim1each according to the application. The two wheels101,102are provided with spokes109for connecting the rim1with the hubs110. To this end, the rim1is provided e.g. with spoke holes. To allow fast and safe riding also on drystone and unpaved roads, the rims1are equipped with tires114, whose width is e.g. 30 mm to 50 mm.", "", "The bicycle100comprises a frame104, a handlebar101with grips114, a saddle107, a fork or suspension fork105. For cross-country races in particularly difficult terrain, a rear wheel damper, not shown, may be provided. A pedal crank112with pedals serves for driving. Optionally, the pedal crank112and/or the wheels102,103may be provided with an electrical auxiliary drive. The hubs of the wheels102,103may each be fastened to the frame104or the fork105by means of a clamping system113(such as a through axle or a quick release).", "", "The rim1employed in the bicycle100will now be described with reference to theFIGS.2and3. The rim1comprises a rim body2, which comprises opposed rim flanks3, a rim well12and a rim base22, and opposed rim flanges4. Supplementarily to the rim body2, the rim1may comprise further components, for example sealants for the use of tubeless tires. The rim body2shown is equipped without any brake flanks.", "", "The rim flanks2abut in a radially most inwardly point15, extending from there to the rim flanges4. The rim flanges4start from the rim flanks3, extending up to a radially most outwardly point5. This results in opposed side walls20, extending from the radially most inwardly point15up to the radially most outwardly point5. The rim flange4begins where a horizontal plane of the rim well12intersects the side wall20. In the example shown, the reference numeral12points toward this plane. This plane also corresponds to the supporting surface of the tire and serves to determine the size of the rim1according to ETRTO.", "", "The rim base22may show recesses where spokes109respectively nipples can be attached. The rim well12may comprise openings through which to access the spokes109respectively nipples for installation and servicing.", "", "The clear rim width14between the rim flanges4shown is dimensioned such that the usual tire widths in cross-country races can be safely operated on the rim1. Particularly preferably, for example tires between 30 mm and 40 mm can be employed. For aerodynamic optimization of the rim1or the combination of the rim1with cross-country tires, the clear rim width14chosen is the narrowest possible and is for example 24 mm. The clear rim width14is measured in the narrowest spot24between the rim flanges4.", "", "In order to offer the best possible aerodynamic properties, the widest spot25of the rim body2lies beneath the rim well12and above a horizontal centerline35. It has been shown to be of particular advantage for the widest spot25to lie at least at 65% of the height45of the rim body2. For example, the height45shown is 50 mm, and the widest spot25lies at a height45aof 35 mm. Then the difference45bis 15 mm. In this example, the widest spot25then lies at 70% of the height45of the rim body2.", "", "For the rim1to provide optimal aerodynamics including in combination with the appropriately wide cross-country tires, the width250in the widest spot25is at least one quarter larger than is the clear rim width14. For example a width250of 36.5 mm is advantageous. This is why the maximum width250is 12.5 mm larger than the clear rim width14. Thus, the rim1can be equipped with a wide range of cross-country tires, without risking that the widest spot25is too narrow compared to the tire. This ensures that even cross-country tires do not laterally protrude beyond the widest spot25.", "", "However, the dimensioning described above results in the problem that the difference250bmust be overcome across a very small portion of the height45(for example, difference45b=15 mm). To avoid material accumulations or aerodynamic problem areas, the side walls20are provided with special curvature shapes6. The curvature shape6of the pertaining side wall20has an inflection point16in which a concave curvature26makes a transition to a convex curvature36. The curvature shapes6provide the side walls20with a cross-sectional geometry32having an S-shaped outside surface.", "", "The concave curvature26runs from the inflection point16up to a further inflection point46on the rim flange4. A further convex curvature56follows, from the further inflection point46in the direction to the radially most outwardly point5. At its top end, the further convex curvature56makes a transition to a straight section66, which extends up to the radially most outwardly point5. The curvature shape6as well as the further convex curvature56are illustrated in theFIG.3on the left side wall20by an enlarged line width. The curvature shape6with its special cross-sectional geometry32extends from the further inflection point46downwardly to the widest spot25.", "", "TheFIGS.4and5show an exemplary rim1to illustrate the curvature shape6. To this end, a so-called curvature ridge is inserted in theFIG.4along the left side wall20. The curvature ridge shows a plurality of rays which by their length represent the curvature at the starting point of the ray. The longer the rays, the larger the curvature. Since the curvature corresponds to the reciprocal value of the pertaining radius, the radius is smaller the longer the rays are. To enhance comprehensibility,FIG.5shows the rays of the curvature ridge proportionally shorter compared toFIG.4.", "", "The curvature ridge enables clear recognition of which positions are located the inflection point16, the concave curvature26and the convex curvature36, and the further inflection point46, and the further convex curvature56. One can also clearly see that the further convex curvature56shows a continuous radius. For example, the radius is 1.5 mm.", "", "The curvatures26,36, however, show a variable radius. For example, the concave curvature26has a maximal curvature with a radius of 22 mm+/−10%. For example, the convex curvature36has a maximal curvature with a radius of 11 mm+/−10%. In other words, the convex curvature36has a minimal radius which is smaller than the minimal radius of the concave curvature26.", "", "Moreover, one can clearly recognize the geometric smoothness of the transition from the convex curvature36to the further curvature shape60lying beneath, of the side wall20. The jump60ain the curvature ridge indicates a G1smoothness respectively a tangent smoothness. In the region of the transition to the convex curvature36, the further curvature shape60has e.g. a maximal curvature with a radius of 59 mm+/−10%.", "", "This concave curvature26consists of a rim flange curvature section261and a rim flank curvature section262(seeFIG.5). The rim flange curvature section261extends from the further inflection point46along the rim flange4up to the rim well12respectively its horizontal plane (shown in broken lines). This is where the rim flank curvature section262begins, extending up to the inflection point16.", "", "FIG.5shows broken, vertical lines, illustrating the width increase along the individual sections of the curvature shape6. What is shown is, the increase6aof the width along the concave curvature26and the convex curvature36(thus along the entire curvature shape6from the further inflection point46as far as the widest spot25). Also shown are: the increase26ain width along the concave curvature26, the increase36ain width along the convex curvature36, the increase261ain width along the rim flange curvature section261, the increase262ain width along the rim flank curvature section262.", "", "In an exemplary configuration of the rim1(preferably the rim1described above) the increase6ais 3.055 mm. Thereof, the increase36ais 1.353 mm, and the increase26ais 1.702 mm. The increase26aincludes the increase262aat 1.017 mm and the increase261A, as little as 0.68 mm. Thus, the width increases only very little along the rim flange curvature section261. The width then increases very rapidly in the rim flank curvature section beneath, and along the convex curvature36. The width increase along the rim flank curvature section262and the convex curvature36is more than three times the width increase along the rim flange curvature section261.", "", "Thus, more than 70% of the increase6aof the width, on the whole taking place between the further inflection point46and the widest spot25, is achieved external of the rim flange4. The increase6aof the width in the example shown takes place over a height difference of as little as 13.7 mm. Of this height difference, 9.5 mm lie beneath the rim well12and external of the rim flange4. Given a total height45of the rim body2of 50 mm, the height difference of 9.5 mm provides a portion of 19%. Thus, more than 70% of the increase6ain width along the concave curvature26and the convex curvature36are achieved over as little as 19% of the height45of the rim body2and at the same time external of the rim flange4.", "", "FIG.6shows an exemplary embodiment of the rim1, where the rim flanges4are inclined at a defined angle. A tangent34adjacent to the further inflection point46e.g. shows an angle of 84° to the (not visible) horizontal centerline35. Moreover, an inside surface44of the rim flange4is inclined at an angle of 87° to the horizontal centerline35. This results in a setting angle for the rim flange4on its outside surface of 6° and on its inside surface44, of 3° to the vertical axis.", "", "These setting angles enhance the demolding process in manufacturing the rim1, which is manufactured for example from a fibrous composite material in a suitable shaping tool. Again, the curvature shape6offers considerable advantages for the steep setting angle to not lead to a conflict of goals with the widest spot25which is to lie the closest possible to the rim flanges4. The invention presently represented overcomes the large difference250bover a very minor portion of the height45, without requiring the rim flanges4to be configured inclined or with a large wall thickness.", "", "While a particular embodiment of the present rim for an at least partially muscle-powered bicycle have been described herein, it will be appreciated by those skilled in the art that changes and modifications may be made thereto without departing from the invention in its broader aspects and as set forth in the following claims.", "", "List of reference numerals:1rim2rim body3rim flank4rim flange5most outwardly point6curvature shape6aincrease12rim well14rim width15most inwardly point16inflection point20sidewall22rim base24closest spot25widest spot26concave curvature26aincrease32cross-sectional geometry34tangent35centerline36convex curvature36aincrease44inside surface45height45aheight45bdifference46inflection point56convex curvature60curvature shape60ajump66straight section100bicycle101handlebar, handle102wheel, front wheel103wheel, rear wheel104frame105fork, suspension fork107saddle109spoke112pedal crank113clamping system114tire250width250bdifference261rim flange curvature section261aincrease262rim flank curvature section262aincrease"], "claims": ["in the widest spot, the width is at least one quarter larger than is a clear rim width between the rim flanges, and that the side walls each show a defined curvature shape with at least one inflection point, which is disposed between the radially most outwardly point and the widest spot and lies external of the rim flange; and in the inflection point, a concave curvature makes a transition to a convex curvature; and the convex curvature lies between the inflection point and the widest spot, and the concave curvature lies between the inflection point and the radially most outwardly point.", "2 . The rim according to claim 1 , wherein the side walls each comprise a cross-sectional geometry with an S-shaped outside surface between the radially most outwardly point and the widest spot.", "3 . The rim according to claim 1 , wherein the widest spot is closer to the rim flange than to the horizontal centerline.", "4 . The rim according to claim 1 , wherein the maximum width is at least 1.4 times the clear rim width.", "5 . The rim according to claim 1 , wherein the clear rim width is less than 32 mm, and wherein the maximum width is at least 8 mm larger than the clear rim width.", "6 . The rim according to claim 1 , wherein the concave curvature runs from the inflection point continuously up to the rim flange and terminates on the rim flange at a distance from the radially most outwardly point.", "7 . The rim according to claim 1 , wherein the width of the rim body also increases along the concave curvature.", "8 . The rim according to claim 1 , wherein at least 70% of the width increase, which takes place along the concave curvature and the convex curvature on the whole, is achieved over maximally 25% of the height of the rim body and external of the rim flange.", "9 . The rim according to claim 1 , wherein the convex curvature has a minimal radius, which is smaller than the minimal radius of the concave curvature, and wherein the minimal radius of the concave curvature lies on the rim flange.", "10 . The rim according to claim 1 , wherein the concave curvature consists of a rim flange curvature section running along the rim flange, and of a rim flank curvature section running along the rim flank, and wherein the width of the rim body on the whole increases less along the rim flange curvature section than along the rim flank curvature section.", "11 . The rim according to claim 10 , wherein the width of the rim body increases more along the rim flank curvature section at least by the factor of 1.2 than it does along the rim flange curvature section.", "12 . The rim according to claim 10 , wherein the width of the rim body increases by a first width along the rim flank curvature section and the convex curvature, and wherein the width of the rim body increases by a second width along the rim flange curvature section, and wherein the first width increase is at least twice the second width increase.", "13 . The rim according to claim 1 , wherein the total width increase deviates along the concave curvature by maximally 10% from the total width increase along the convex curvature.", "14 . The rim according to claim 1 , wherein the concave curvature and the convex curvature each show a radius whose value varies over the length of the curvature shape.", "15 . The rim according to claim 1 , wherein a further inflection point is disposed on the rim flange, and wherein the further inflection point lies between the inflection point and the radially most outwardly point, and wherein in the further inflection point, the concave curvature makes a transition to a further convex curvature which extends at least up to the radially most outwardly point.", "16 . The rim according to claim 15 , wherein at least 70% of the width increase taking place between the further inflection point and the widest spot of the rim body on the whole, is achieved external of the rim flange, and wherein the width of the rim body decreases from the further inflection point up to the radially most outwardly point.", "17 . The rim according to claim 15 , wherein a tangent adjacent to the further inflection point at the rim flange shows an angle of at least 82° to the horizontal centerline.", "18 . The rim according to claim 1 , wherein an inside surface of the rim flange is inclined to the horizontal centerline at an angle of at least 85°.", "19 . The rim according to claim 1 , wherein the rim body is free of brake flanks.", "20 . The rim according to claim 1 , wherein the rim body is manufactured of a plastic."], "bibtex": "@patent{20240190171,\n    title = {RIM FOR AN AT LEAST PARTIALLY MUSCLE-POWERED BICYCLE},\n    number = {20240190171},\n    year = {2024},\n    note = {File: US20240190171A1-20240613.XML}\n    }", "classification": "B60B2110FI"}, {"title": "VEHICLE WHEEL WITH A PARTICLE COLLECTOR", "doc_number": "20240190172", "filename": "US20240190172A1-20240613.XML", "abstract": "A wheel assembly having a wheel rotation axis; a rim with an outer surface around the wheel rotation axis; wherein the outer surface comprising suction ports; two tires mounted on the outer surface of the rim; a particle collector adapted to trap particles entering said particle collector; a particle suction system with a bladed suction structure configured for generating a suction air flow in the rim upon rotation of said bladed suction structure about the wheel rotation axis; an air passage connecting the suction ports to the bladed suction structure via the particle collector in order to suck particles through the suction ports by means of the suction air flow generated by the bladed suction structure.", "detailed_description": ["FIG.1represents a wheel assembly10in accordance with the invention. The wheel assembly10is adapted for an automotive vehicle, such as a personal car, a public transportation vehicle, or a heavy-duty vehicle.", "", "The wheel assembly10comprises a wheel rotation axis12. The wheel assembly10further comprises a center hub14and a rim16. The rim16is around the wheel rotation axis12and comprises an outer surface18. The rim16may comprise an outer ring20forming the outer surface18. The outer surface18exhibits an annular shape. The outer ring20form a tube.", "", "The wheel assembly10may comprise a single tire or tires. In the embodiment illustrated inFIG.1, the wheel assembly comprises two tires, namely a first tire22and a second tire24. The first tire22and the second tire24are separate and distinct. They may exhibit a tire outer diameter. By convention, the first tire22may be in the foreground ofFIG.1. Each defined in connection with the first tire22also applies to the second tire24, except if the contrary is explicitly mentioned. The first tire22may be an outboard tire, and the second tire may be an inboard tire.", "", "The one or more tires (22,24) comprise a tread and can be pneumatic or non-pneumatic. In the embodiment wherein the first tire22and the second tire24are pneumatic, each one further comprises a carcass. In a non-limiting list, the tread exhibits: grooves, blocks, ribs and lugs.", "", "The wheel assembly10further comprises a particle collector26adapted to trap particles entering said particle collector26. The particle collector26is arranged at a central position. The particles may be wear particles, or worn residues, of the first tire22and the second tire24, resulting from their contact with the ground. The particles may also be dust particles.", "", "The outer surface18comprises an annular array of suction ports30. The suction ports30are angularly distributed about the wheel rotation axis12. The annular array may comprise between four to twenty suction ports30. The annular array may comprise between eight to twelve suction ports30. The suction ports30may be aligned. They may be at a same position along the wheel rotation axis12.", "", "The wheel assembly10further comprises a suction system40with a bladed suction structure42configured for generating a suction airflow within the rim upon rotation of said bladed suction structure about the wheel rotation axis. The bladed suction structure42comprises at least one circular array of blades. The blades are optionally planar facets which are parallel to the wheel rotation axis12and which extend radially from the rim16. The bladed suction structure and the rim are optionally one piece. This monobloc configuration increases strength and optimizes the assembly steps.", "", "In addition, the wheel assembly10encloses an air passage connecting the suction ports30to the bladed suction structure42through the particle collector26to suck particles through the suction ports30using the suction airflow resulting from the rotation of the suction system40. As an option, the centrifugal force contributes to generating the suction airflow sucking the particles on the ground or tearing off the first tire22and the second tire24.", "", "At least one, preferably each of the two tires (22;24) comprises channels88. The channels88are extending toward the suction ports30. The suction ports30are axially at distance from the first tire22and the second tire24. The channels88are angularly distributed around the wheel rotation axis12. The channels88are formed on the sides of the tires (22;24) which are adjacent to the suction ports30. The channels88define dimples guiding the airflow toward the suction ports30upon rotation of the wheel assembly10. The channels88may have helicoidal shapes.", "", "FIG.2is a through cut of a wheel assembly10per the invention. The through cut is along the wheel rotation axis12.", "", "The wheel assembly10exhibits a wheel rotation axis12, a first face44and a second face46axially at the opposite of the first face44with respect to the rotation axis12. The wheel assembly10further comprises a rim16around the wheel rotation axis12. The rim16receives, around the outer surface18, a first tire22and a second tire24which are respectively at the first face44and the second face46. The first tire22and the second tire24are of the same diameter. They comprise a tire outer diameter TD. In addition, the wheel assembly10exhibits a first side at the first face44, and a second side at the second face46.", "", "In addition, the wheel assembly10exhibits an outer circular groove48. The outer circular groove48exhibits a toroidal shape. It encircles the rim16. The outer circular groove48is open radially outward. The outer circular groove48exhibits a circular bottom surface50. The outer circular groove48is a circular suction groove. The circular bottom surface50partially forms the rim16. It is axially between the first tire22and the second tire24. The circular bottom surface50comprises a bottom diameter BD which is smaller than the tire outer diameter TD.", "", "The first tire22and the second tire24each comprise channels88extending toward the other of the two tires. The channels88are open toward the suction ports30, and extend from the tread. At each side (44;46), the channels88are converging toward each other. Pairs of channels88are arranged in a “V” configuration, wherein the peak of the “V” is pointing toward the suction ports30, or toward the circular groove48in which they are settled. The “V” configuration cases the particle motion toward the suction ports30. This promotes the cleaning effect of the invention.", "", "The wheel assembly10comprises suction ports30through the circular bottom surface50and a particle collector26which is housed in the center hub14. The suction ports30are open toward the particle collector26. The particle collector26comprises a cylindrical body extending along the wheel rotation axis12. The particle collector26is configured for trapping particles entering therein. The particle collector26may comprise a filtering element such as a foam body. As an alternative or in addition, it may comprise a chicane wall separating particles from the suction airflow36blown inside the particle collector26. The particle collector26is removably mounted in the center hub14. Then, upon servicing the particle collector26may be cleared out; and cleaned. The trapped particles may be collected and recycled.", "", "The wheel assembly10comprises a particle suction system40configured for generating a suction airflow36through the wheel assembly10upon rotation of said particle suction system40about the wheel rotation axis12. In other words, the particle suction system40is configured for generating a suction airflow36adapted to accelerate particles toward and through the suction ports30.", "", "An air passage52connects the suction ports30to the particle suction system40via the particle collector26to suck particles and drive them to, to catch them in the particle collector26. The bladed suction structure42is configured for sucking air through the rim16and to blow said suction airflow36axially outside the rim16upon rotation of the bladed suction structure42. The suction airflow36enters the rim radially and leaves it axially.", "", "The wheel assembly10comprises at least one, preferably two separation walls54projecting within the air passage52. The separation walls54are axially facing the bladed suction structure42. The separation walls54are perpendicular to the wheel rotation axis12. The separation walls54are partitioning the air passage52. The separation walls54comprise center holes38crossed by the particle collector26. The center holes38maintain the particle collector26.", "", "The bladed suction structure42is axially and radially arranged within the rim16which forms a radial separation between the bladed suction structure42, and the first tire22and the second tire24respectively. The tires (22;24) are separated by an axial portion of the rim16. The wheel assembly10comprises an axial separation55, for instance, said axial portion of the rim16, separates the first tire22from the second tire24. The suction ports30are circularly aligned within said axial separation55.", "", "The particle suction system42comprises a first bladed suction structure56arranged at the first face44, and a second bladed suction structure58arranged at the second face46. The particle collector26axially extends along the first bladed suction structure56and the second bladed suction structure58. Then, the inner volume of the particle collector26is increased. Its ability to trap particles is improved.", "", "The air passage52comprises a first disc-shaped portion60radially extending from and along the suction structure40toward the wheel rotation axis12, and a second disc-shaped portion62extending from the suction ports30toward the wheel rotation axis12. The first disc-shaped portion60may comprise sub-portions64, also designates as side portions. The second disc-shaped portion62is arranged between said sub-portions64. The first disc-shaped portion60is in fluid flow communication with each of the first bladed suction structure56and the second bladed suction structure58; for instance through the sub-portions64. The sub-portions64are separated from the second disc-shaped portion62by the separation walls54. The separation walls54are demarcating the second disc-shaped portion62. They divide the air passage52.", "", "The suction ports30may have meshes at their entrances. These meshes exhibits calibrated perforations having a filter effect. This avoids that large particles enter in the wheel assembly10. Such large particles could clog the second disc-shaped portion62and the particle collector26.", "", "The particle collector26comprises two circular outlets66, and a circular inlet68arranged axially between the two circular outlets66. The circular outlets66and the circular inlet68generally form circular apertures. The circular outlets66are connected to the first disc-shaped portion60, and more precisely with the sub-portions64. The circular inlet68is connected to the second disc-shaped portion62which spans therefrom. The circular inlet68is between the separation walls54.", "", "As a non-illustrated alternative, the wheel assembly10comprises a first face and a second face axially at the opposite of the first face; the at least one tire comprising a single tire at the first face, and the suction ports30being at the second face.", "", "FIG.3represents an angular segment of a through cut of a wheel assembly10for a vehicle (not illustrated). The through cut may be at the equatorial plane of the wheel assembly10. It may be through the second disc-shaped portion62. The wheel assembly10is partially represented, however, the description provided in connection with the current angular segment applies to the whole wheel assembly. The wheel assembly10may be similar or identical to the wheel assembly10as presented in any ofFIG.1or2.", "", "The wheel assembly10exhibits a wheel rotation axis12, a rim16with an outer surface18around the wheel rotation axis12. The outer surface18is provided with a plurality of suction ports30; a center hub14in the rim16. The wheel assembly10is provided with at least one tire (22;24) (only one represented). Each tire (22;24) is maintained by the outer surface18of the rim16. The tires each present an annular tread portion. Each of the suction ports30may be a tread suction port. The suction ports30may be arranged at the equatorial plane of the wheel assembly10. The tires (22;24) form circular beads protruding from the outer surface18, and thus away from the suction ports30. Accordingly, the suction ports30are kept at distance from the ground surface72. The suction ports30are in elevation with respect to the ground surface72. This aspect protects the inner surfaces of the suction ports30.", "", "The wheel assembly10encloses a particle collector26adapted to trap particles entering said particle collector26. The particle collector26is nested in the center hub14and fixed therein in a removable fashion.", "", "A particle suction system40is configured for generating a suction airflow adapted to suck particles at an interface70between the at least one tire and a ground surface72. The air passage52connects the suction ports30to the particle suction system40through the particle collector26in order to suck particles through the suction ports26by means of the suction air flow generated by the particle suction system40. The suction ports30may be particle suction ports, preferably, radially opened particle suction ports.", "", "The rim16comprises an outer ring20surrounding the particle suction system40. The bladed suction structure42physically connects the center hub14to the outer ring20. The outer ring20partially forms the outer surface18and surrounds the bladed suction structure42. The suction ports30radially cross said outer ring20. The outer ring20closes the sub-portions of the first disc-shaped portion. The bladed suction structure42may be a bladed particle suction structure.", "", "The center hub14radially separates the particle suction system40from the particle collector26. The center hub14comprises a fixation device76adapted to secure the particle collector to the center hub14. The fixation device76may comprise a resilient element engaging a retention ball. It may comprise a fixation pin.", "", "As apparent in the current illustration, the wheel assembly10comprises an outer circular groove48with a circular bottom surface50. The circular bottom surface50is radially at distance from the ground surface72. The suction ports30are open through the circular bottom surface50and are facing said ground surface72.", "", "The wheel assembly10comprises a main rotation direction78in which the bladed suction structure generates the suction airflow. The suction airflow may be a particle suction airflow. At least one or each suction port comprises a ramp80with a depth reduction along the main rotation direction78. The depth decrease implies a closer distance with the wheel rotation axis12. The ramp80increases the opening size of the suction ports30. Then, their active areas are extended for better efficiency.", "", "The bladed suction structure comprises a circular array of radially projecting blades82. The radially projecting blades82are distributed around the wheel rotation axis12. The radially projecting blades82(represented in dotted lines) may form a blower or a fan. Upon rotation, they generate an axial air flow through the particle suction system40. The radially projecting blades82are currently masked by one of the separation walls54.", "", "The radially projecting blades82comprise curved airfoils. Each curved airfoil comprises at least one of: a concave intrados surface, a convex extrados, a curved leading edge, a curved trailing edge86. The curved trailing edge86are at the first face or at the second face. The curved leading edges are axially at distance from the first face and the second face. By convention, an airfoil comprises a radial stacking of chords. A chord is a line joining the curved leading edge to the curved trailing edge86of the corresponding airfoil. The curved airfoils comprise chords which are inclined with respect to the wheel rotation axis. This configuration increases the suction air flow generated by the bladed suction structure42upon rotation.", "", "The rim16comprises spokes physically connecting the center hub14to the rim16. The spokes are formed by the bladed suction structure, notably the radially projecting blades82.", "", "As an option, the wheel assembly10comprises a brake disc84surrounded by the suction ports30. In an embodiment, the suction system is at one side of the wheel assembly10. The brake disc84is axially arranged at the opposite with respect to the particle suction system40. The brake disc84and the particle suction system40are both housed in the rim to improve compactness.", "", "FIG.4represents a diagram of a particle suction process in accordance with the invention. The wheel assembly may be similar or identical to the one as described in relation with any one ofFIGS.1to3.", "", "The particle suction process comprises providing100a wheel assembly in accordance with the invention; rotating102the wheel assembly at a first rotation speed; generating104an airflow across and/or in the wheel assembly; sucking air106between the ground surface and the wheel assembly; accelerating108particles at the contact interface or rearward side of the wheel assembly toward the suction ports, and optionally, trapping110said particles in a particle collector; preferably in the wheel assembly.", "", "At rotating102, the first rotation speed may be at least 2 rounds per second or at least 10 rounds per second. This rotation speed may be in both rotation directions, or the main rotation direction.", "", "Accelerating108particles may comprise sucking particles through suction ports.", "", "Variations in the present invention are possible in light of the description of it provided herein. While certain representative embodiments and details have been shown for the purpose of illustrating the subject invention, it will be apparent to those skilled in this art that various changes and modifications can be made therein without departing from the scope of the subject invention. It is, therefore, to be understood that changes can be made in the particular embodiments described which will be within the full intended scope of the invention as defined by the following appended claims."], "claims": ["a wheel rotation axis; two tires mounted on the outer surface of the rim; a rim with an outer surface around the wheel rotation axis; said outer surface comprising suction ports between the two tires; a particle collector adapted to trap particles entering said particle collector; a bladed suction structure configured for generating a suction air flow in the rim upon rotation of said bladed suction structure about the wheel rotation axis; an air passage connecting the suction ports to the bladed suction structure via the particle collector to suck particles through the suction ports using the suction air flow generated by the bladed suction structure.", "2 . The wheel assembly according to claim 1 , wherein the wheel assembly further comprises a main rotation direction in which the bladed suction structure generates the suction air flow; each suction port comprises a ramp with a depth reduction along the main rotation direction.", "3 . The wheel assembly according to claim 1 , wherein the wheel assembly according to claim 1 , wherein the wheel assembly further comprises at least one separation wall projecting within the air passage and axially facing the bladed suction structure; and wherein said separation wall is perpendicular to the wheel rotation axis.", "4 . The wheel assembly according to claim 1 , wherein the bladed suction structure comprises a circular array of radially projecting blades; and wherein said radially projecting blades are distributed around the wheel rotation axis; each radially projecting blade comprises curved airfoils, each curved airfoil comprises at least one of a concave intrados surface, a convex extrados, a curved trailing edge, and a curved leading edge.", "5 . The wheel assembly according to claim 1 , wherein the rim comprises spokes physically connecting the center hub to the rim, the spokes being formed by the bladed suction structure; and at least one of the two tires being a non-pneumatic tire.", "6 . The wheel assembly according to claim 1 , wherein the bladed suction structure is axially and radially arranged within the rim, the rim separating each tire from the bladed suction structure.", "7 . The wheel assembly according to claim 1 , wherein at least one of the two tires comprises channels which are extending toward the suction ports; and the second tire being axially at distance from the first tire; the suction ports being axially at distance from the first tire and the second tire.", "8 . The wheel assembly according to claim 8 , wherein the wheel assembly comprises an axial separation separating the first tire from the second tire; the suction ports being within said axial separation.", "9 . The wheel assembly according to claim 1 , wherein the rim comprises a side face and an outer ring forming the outer surface and surrounding the bladed suction structure, the suction ports radially crossing said outer ring, and the bladed suction structure being at said side face.", "a wheel rotation axis; a first face; a second face axially at the opposite of the first face; a rim around the wheel rotation axis; a first tire and a second tire which are mounted around the rim, which are respectively at the first face and at the second face, and which comprise a tire outer diameter; an outer circular groove with a circular bottom surface forming the rim and axially between the first tire and the second tire, said circular bottom surface comprising a bottom diameter which is smaller than the tire outer diameter; suction ports through the circular bottom surface; a particle collector; a particle suction system configured for generating a suction airflow through the wheel assembly upon rotation of said particle suction system about the wheel rotation axis; an air passage connecting the suction ports to the particle suction system in order to suck particles with the suction ports.", "11 . The wheel assembly according to claim 10 , wherein the particle suction system comprises a first bladed suction structure arranged at the first face, and a second bladed suction structure arranged at the second face, the particle collector axially extending along the first bladed suction structure and the second bladed suction structure, and the suction ports being arranged axially between the first bladed suction structure and the second bladed suction structure.", "12 . The wheel assembly according to claim 10 , wherein the air passage comprises a first disc-shaped portion radially extending from the suction structure toward the wheel rotation axis, and a second disc-shaped portion extending from the suction ports toward the wheel rotation axis.", "13 . The wheel assembly according to claim 10 , wherein the suction ports define a circular array surrounding the particle collector, said particle collector comprising a cylindrical body extending along the wheel rotation axis.", "14 . The wheel assembly according to claim 10 , wherein the particle collector comprises a filtering body which is arranged at one of the first face and the second face, the particle collector being rotatably mounted with respect to the particle suction system; the air passage connecting the suction ports to the particle collector through the particle suction system.", "a wheel rotation axis; a rim with an outer surface around the wheel rotation axis; said outer surface comprising suction ports; two tires mounted on the outer surface of the rim; a center hub; a particle collector adapted to trap particles entering said particle collector, said particle collector being arranged in the center hub; a particle suction system configured for generating a suction airflow adapted to suck particles at an interface between the two tires and a ground surface; an air passage connecting the suction ports to the particle suction system through the particle collector in order to suck particles through the suction ports by means of the suction air flow generated by the particle suction system.", "16 . The wheel assembly according to claim 15 , wherein the rim comprises an outer ring and the particle suction system comprises a bladed suction structure physically connecting the center hub to the outer ring.", "17 . The wheel assembly according to claim 15 , wherein the center hub separates the particle suction system from the particle collector; and wherein the center hub comprises a fixation device adapted to secure the particle collector to the center hub, and wherein the particle collector comprises two circular outlets, and one circular inlet arranged axially between the two circular outlets.", "18 . The wheel assembly according to claim 15 , wherein the wheel assembly comprises an outer circular groove with a circular bottom surface, the suction ports being through the circular bottom surface.", "19 . The wheel assembly according to claim 15 , wherein the wheel assembly comprises a brake disc surrounded by the suction ports, the brake disc being axially at the opposite with respect to the particle suction system.", "20 . The wheel assembly according to claim 15 , wherein the wheel assembly comprises a first side and a second side axially at the opposite of the first side; the wheel assembly further comprises a filtering body at the first side, and the second side is an inboard side."], "bibtex": "@patent{20240190172,\n    title = {VEHICLE WHEEL WITH A PARTICLE COLLECTOR},\n    number = {20240190172},\n    year = {2024},\n    note = {File: US20240190172A1-20240613.XML}\n    }", "classification": "B60B2112FI"}, {"title": "RACING WHEEL", "doc_number": "20240190173", "filename": "US20240190173A1-20240613.XML", "abstract": "A wheel is provided that combines the principles of a beadlock wheel and a liner wheel for improved performance in motor racing, in particular drag racing. The wheel has beadlock rings that fasten to inner and outer rims of the wheel to secure an outer tire, and the wheel has knurls interior to the inner and outer rims to secure an inner tire. Projections from the inner and outer rims are arranged to accommodate the various functions of the combination of the beadlock rings and the inner tire. The projections counterintuitively add weight to the wheel, yet the combination of beadlock rings and an inner tire results in improved stability and safety as well as faster times on the racetrack.", "detailed_description": ["Although the following text sets forth a detailed description of numerous different embodiments, it should be understood that the legal scope of the description is defined by the words of the claims set forth at the end of this disclosure. The Detailed Description is to be construed as exemplary only and does not describe every possible embodiment of the wheel since describing every possible embodiment would be impractical, if not impossible. Numerous alternative embodiments could be implemented, using either current technology or technology developed after the filing date of this patent, which would still fall within the scope of the claims. Additionally, any combination of features shown in the various figures can be used to create additional embodiments of the present invention. Thus, dimensions, aspects, and features of one embodiment of the wheel can be combined with dimensions, aspects, and features of another embodiment of the wheel to create the claimed embodiment.", "", "FIGS.1A and1Bare an inner side elevation view and an outer side elevation view, respectively, of a wheel2for use in motor racing such as drag racing. The wheel2combines the principles of a beadlock wheel and a liner wheel for an improvement in performance despite the inclusion of additional structure and weight, as described herein. The wheel2has a hub4with apertures6through which fasteners join the wheel2to a wheel hub assembly of a vehicle. While five apertures6are shown in the figures, the present disclosure encompasses embodiments of the wheel2with any number and configuration of apertures6. The wheel2also has an inner rim8and an outer rim14.", "", "As shown inFIG.1A, the inner rim8has an enhanced surface or an inner rim knurl10. Enhanced surfaces can be any surface that increases the ability to grip or secure a tire. A knurl is a type of enhanced surface, and the inner rim knurl10is at least one cut made into the surface of the inner rim8to create a pattern that increases the ability of the inner rim8to grip or secure a tire. The at least one cut can be a series of straight and/or curved cuts, a crisscross pattern of cuts, etc. InFIG.1A, the inner rim knurl10extends around a circumference of the inner rim8and wheel2as multiple, discrete areas of patterns. It will be appreciated that the inner rim knurl10can be a single, continuous pattern around the circumference of the inner rim8.", "", "FIG.1Bshows an outer rim14that is similarly configured as the inner rim8. The outer rim14has an outer rim knurl16in a similar pattern as the inner rim8, but it will be appreciated that the outer rim14can have an outer rim knurl16with a different pattern and configuration than the inner rim knurl10. Each of the inner rim8and the outer rim14has respective apertures12,18extending around a circumference of the rims8,14. These apertures12,18are configured to receive fasteners to secure an inner beadlock ring to the inner rim8and secure an outer beadlock ring to the outer rim14, which secures bead portions of an outer tire to the wheel2as described in further detail herein.", "", "FIGS.2A and2Bare inner and outer side elevation views, respectively, of wheel2with beadlock rings20,24attached. Specifically, fasteners extend through apertures22in an inner beadlock ring20and into the apertures of the inner rim8to secure the inner beadlock ring20to the inner rim8and to secure an inner bead of an outer tire to the wheel2. Similarly, fasteners extend through apertures26in an outer beadlock ring24and into the apertures of the outer rim14to secure the outer beadlock ring24to the outer rim14and to secure an outer bead of the outer tire to the wheel2.FIG.2Balso shows line3A-3A.", "", "Note that the apertures12of the inner rim8are sized, shaped, and positioned to align with the apertures22in the inner beadlock ring20such that fasteners can extend through the apertures12of the inner rim8and apertures22of the inner beadlock ring20to secure the inner beadlock ring20to the inner rim8. Similarly, the apertures18of the outer rim14are sized, shaped, and positioned to align with the apertures26in the outer beadlock ring24such that fasteners can extend through the apertures18of the outer rim14and apertures26of the outer beadlock ring24to secure the outer beadlock ring24to the outer rim14.", "", "FIG.3Ais a cross-sectional view of the wheel2taken along line3A-3A inFIG.2B. Generally, the wheel2has an inner portion28, a middle portion30, and an outer portion32. The outer portion32is positioned closer to the outside of the vehicle and the inner portion28is positioned closer to the center of the vehicle when the wheel is attached to a vehicle, such as a racecar. The middle portion30joins the inner portion28and the outer portion32, and the hub4of the wheel is connected to the middle portion30. Moreover, the inner rim8is positioned at a distal end9of the inner portion28, and the outer rim14is positioned at a distal end15of the outer portion32. These parts of the wheel2can be made as a single continuous structure by a manufacturing process such as molding, injection molding, or additive manufacturing or printing. In some embodiments, some or all of these parts of the wheel2can be made separately and then combined by a manufacturing process such as stir welding or friction welding. The present disclosure encompasses any method of manufacturing the wheel2. Moreover, the present disclosure encompasses any type of material used to construct the wheel2. For example, the wheel2may be made from a steel alloy, an aluminum alloy, a magnesium alloy, a titanium alloy, a carbon fiber material, another composite material, etc.", "", "Several enhanced surfaces help join an outer tire and an inner tire with the wheel2. The inner beadlock ring20has an inner beadlock knurl34, and this knurl34in combination with the inner rim knurl10grips the inner bead of an outer tire to secure the outer tire to the wheel2. The outer tire is made of rubber or an otherwise elastic material which partially deforms in the knurls34,10once the inner beadlock ring20is secured to the inner rim8. Similarly, the outer beadlock ring24has an outer beadlock knurl36, and this knurl36in combination with the outer rim knurl16grips the outer bead of an outer tire to secure the outer tire to the wheel2. Therefore, the outer tire is secured to the wheel2even when a large torque is applied to the wheel by the drivetrain of a vehicle.", "", "Next, knurls help secure an inner tire to the wheel2. An inner portion knurl38is formed on an outer surface of the inner portion28near the distal end9of the inner portion28and near the inner rim8, and an outer portion knurl40is formed on an outer surface of the outer portion32near the distal end15of the outer portion32and near the outer rim14. When an inner tire is fit over and past one of the inner rim8or the outer rim14and into position between the rims8,14, the inner bead of the inner tire presses into the inner portion knurl38, and the outer bead of the inner tire presses into the outer portion knurl40to secure the inner tire to the wheel2. The inclusion of an inner tire, which is inflated to a higher pressure than the outer tire, gives the outer tire shape and stability under the extreme conditions of motor racing. Moreover, the inner tire does not directly receive forces from the outer tire, unlike a conventional liner wheel, which improves the reliability and performance of the inner tire.", "", "The outer rim14includes a channel42that extends radially into the outer rim14and that extends continuously around a circumference of the outer rim14. The radial direction is substantially perpendicular to the axis of rotation or axial direction of the wheel2(shown as the centerline90inFIG.4A), and the channel42serves multiple functions. The channel42takes weight out of the outer rim14to make the wheel2lighter, which improves the overall performance of the vehicle. In addition, the channel42is a location through which a hole can be drilled and tapped to receive a valve stem46for the outer tire. With air passing through the valve stem46in this location, any seal between the inner tire and the wheel2is not disrupted, which allows for more precise inflation of the tires.FIG.3Aalso shows an inner tire valve stem44in the outer portion32of the wheel through which the inner tire is inflated. Finally, Details3B and3C are identified inFIG.3A.", "", "FIG.3Bdepicts Detail3B fromFIG.3Awhere various aspects of the inner rim8and the inner beadlock ring20promote and serve the functions of the wheel. The inner beadlock ring20has an inner beadlock projection48and the inner rim8has an inner rim projection50between which the inner bead of the outer tire is secured. The heights of these projections48,50can be measured in a radial direction from a reference line52, which is used to determine the nominal radius or diameter of the wheel2for tires sizes that fit onto the wheel2. Specifically, the height58of the inner rim projection50from the reference line52is between approximately 0.5 and 0.7 inches (12.7 and 17.78 mm) in various embodiments. In some embodiments, the height58of the inner rim projection50is approximately 0.6 inches (15.25 mm). This height58allows an inner tire to pass over the inner rim projection50relatively easily for a faster mounting process while still securing the inner and outer tires.", "", "The height54of the inner beadlock projection48from the reference line52is equal to or greater than the height58of the inner rim projection50. As the inner tire does not need to pass over the inner beadlock ring20, the inner beadlock projection48can extend farther than the inner rim projection50to promote the securing of the inner bead of the outer tire. In some embodiments, the height54of the inner beadlock projection48is at least 1 mm greater than the height58of the inner rim projection50, i.e., is between about 13.7 and 18.78 mm, or about 16.25 mm in preferred embodiments. In various embodiments, the height54of the inner beadlock projection48is at least 2 mm greater than the height58of the inner rim projection50, i.e., is between about 14.7 and 19.78 mm, or about 17.25 mm in preferred embodiments. In other embodiments, the height54of the inner beadlock projection48is the same as the height58of the inner rim projection50, i.e., is between about 12.7 and 17.78 mm, or about 15.25 mm in some embodiments.", "", "These projections48,50also have widths in an axial direction (see the centerline90inFIG.4A) where, in this embodiment, a width60of the inner rim projection50is greater than a width56of the inner beadlock projection48. This arrangement is counterintuitive because prior art beadlock wheels have similar components that are equal or nearly equal in width to minimize weight. However, the inner rim projection50serves the beadlock function as well as an additional function of securing an inner tire. Accordingly, in some embodiments, the width60of the inner rim projection50is between approximately 0.3 and 0.5 inches (7.62 and 12.7 mm). In various embodiments, the width60of the inner rim projection50is approximately 0.4 inches (10.1 mm). In some embodiments, the width56of the inner beadlock projection48is between approximately 0.15 and 0.35 inches (3.81 and 8.89 mm). In various embodiments, the width56of the inner beadlock projection48is approximately 0.25 inches (6.3 mm). Stated in relative terms, in some embodiments, the width60of the inner rim projection50is between approximately 40 to 80% greater than the width56of the inner beadlock projection48where the relative difference is determined by the difference in widths56,60divided by the width56of the inner beadlock projection48. In various embodiments, the width60of the inner rim projection50is approximately 60% greater than the width56of the inner beadlock projection48.", "", "FIG.3Cdepicts Detail3C fromFIG.3Awhere various aspects of the outer rim14and the outer beadlock ring24promote and serve the functions of the wheel. The outer beadlock ring24has an outer beadlock projection64and the outer rim14has an outer rim projection62between which the outer bead of the outer tire is secured. The heights of these projections62,64can be measured in a radial direction from the reference line52. Specifically, the height66of the outer rim projection62from the reference line52is between approximately 0.5 and 0.7 inches (12.7 and 17.78 mm) in various embodiments. In some embodiments, the height66of the outer rim projection62is approximately 0.6 inches (15.25 mm). This height66allows an inner tire to pass over the outer rim projection62relatively easily for a faster mounting process while still securing the inner and outer tires.", "", "The height74of the outer beadlock projection64from the reference line52is equal to or greater than the height66of the outer rim projection62. As the inner tire does not need to pass over the outer beadlock ring24, the outer beadlock projection64can extend farther than the outer rim projection62to promote the securing of the outer bead of the outer tire. In some embodiments, the height74of the outer beadlock projection64is at least 1 mm greater than the height66of the outer rim projection62, i.e., is between about 13.7 and 18.78 mm, or about 16.25 mm in preferred embodiments. In various embodiments, the height74of the outer beadlock projection64is at least 2 mm greater than the height66of the outer rim projection62, i.e., is between about 14.7 and 19.78 mm, or about 17.25 mm in preferred embodiments. In other embodiments, the height74of the outer beadlock projection64is the same as the height66of the outer rim projection62, i.e., is between about 12.7 and 17.78 mm, or about 15.25 mm in some embodiments.", "", "These projections62,64also have widths in an axial direction (see the centerline90inFIG.4A) where, in this embodiment, a width68of the outer rim projection62is greater than a width72of the outer beadlock projection64. This arrangement is counterintuitive because prior art beadlock wheels have similar components that are equal or nearly equal in width to minimize weight. However, the outer rim projection62serves the beadlock function as well as an additional function of securing an inner tire. Accordingly, in some embodiments, the width68of the outer rim projection62is between approximately 0.45 and 0.65 inches (11.43 and 16.51 mm). In various embodiments, the width68of the outer rim projection62is approximately 0.56 inches (14.1 mm). In some embodiments, the width76of the outer beadlock projection64is between approximately 0.15 and 0.35 inches (3.81 and 8.89 mm). In various embodiments, the width76of the outer beadlock projection64is approximately 0.25 inches (6.3 mm). Stated in relative terms, in some embodiments, the width68of the outer rim projection62is between approximately 100 to 150% greater than the width76of the outer beadlock projection64where the relative difference is determined by the difference in widths68,76divided by the width76of the outer beadlock projection64. In various embodiments, the width68of the outer rim projection62is approximately 124% greater than the width76of the outer beadlock projection64.", "", "The outer rim projection62also has a channel42that extends radially into a surface of the outer rim projection62. As described herein, the channel42removes some weight from the outer rim projection62and, thus, the overall wheel. The channel42is also a location to drill and tap a hole to receive a valve stem46for the outer tire as shown inFIG.3C. In prior art devices, a hole for a valve stem may be drilled and tapped onto a surface. This presents a higher possibility of drilling a hole that does not conform to a specification of a manufacturer. Once a hole is improperly drilled, the wheel is scrapped. In the present wheel, the channel42directs a drill bit to a precise location at the trough or lowest point of the channel42, which reduces the possibility of a misaligned hole.", "", "In some embodiments, a depth70of the channel44is between approximately 0.1 and 0.3 inches (2.54 and 7.62 mm). In various embodiments, the depth70is approximately 0.20 inches (5.1 mm). In some embodiments, a width72of the channel44is between approximately 0.15 and 0.35 inches (3.81 and 8.89 mm). In various embodiments, the width72is approximately 0.28 inches (7 mm). In addition, the channel44has a semi-circular shape where the lowest point is at a centerline of the channel44, but the channel44can have another shape such as a generally curved shape or even a V-shape where the lowest point is on or off of the centerline. These aspects of the channel44balance several functions including removing weight from the wheel, directing a drill bit to the lowest point of the semi-circular, curved, or V-shape, and allowing enough material or structure of the outer rim projection62to remain so that the outer rim projection62can secure the inner and outer tires.", "", "Moreover, as a result of the inclusion of the channel42, the width68of the outer rim projection62can be described as greater than the width (60inFIG.3B) of the inner rim projection (50inFIG.3B). Specifically, the width68of the outer rim projection62is between approximately 20 to 60% greater than the width60of the inner rim projection50where the relative difference is determined by the difference in widths60,68divided by the width60of the inner rim projection50. In various embodiments, the width68of the outer rim projection62is approximately 40% greater than the width60of the inner rim projection50.", "", "In other embodiments, the width68of the outer rim projection62is approximately the same as the width60of the inner rim projection50or is at least smaller than that shown inFIG.3Cin part because the channel42is smaller. Thus, instead of a true channel42, the outer rim projection62could have a divot or cutout extending around the circumference of the outer rim projection62to direct the user where to drill and tap a hole to receive a valve stem46for the outer tire. If the outer rim projection62has a divot or cutout (e.g., cut with an end mill) that is smaller than the channel42shown inFIG.3C, then the width68of the outer rim projection62can be smaller while still maintaining enough material or structure of the outer rim projection62so that the outer rim projection62can secure the inner and outer tires to the wheel.", "", "FIG.4Ashows a further cross-sectional view of the wheel2like the cross-sectional view shown inFIG.3Ataken along line3A-3A, with the inclusion an inner tire84and an outer tire78secured in place. The inner beadlock ring20secures an inner bead80of the outer tire78against the inner rim8, and an outer beadlock ring24secures an outer bead82of the outer tire78against the outer rim14. Moreover, an inner bead86of the inner tire84is located on the interior side of the inner rim projection50(i.e., closer to the hub), and an outer bead88of the inner tire84is located on the interior side of the outer rim projection62(i.e., closer to the hub). The rim projections50,62can secure the inner tire84in a number of ways. The inner bead86of the inner tire84may contact the inner rim projection50, and the outer bead88of the inner tire84may contact the outer rim projection62to secure the inner tire84. Additionally or alternatively, the inner tire84may not initially contact the inner rim projection50of the outer rim projection62, but these projections50,62may serve as a physical limit for lateral movement of the inner tire84when the wheel2experiences extreme forces.", "", "The inner tire84is inflated to a higher pressure than the outer tire78. In an exemplary embodiment, the inner tire84is inflated to a pressure of approximately 50 to 60 psi (345 to 414 kPa), and the outer tire is inflated to a pressure of approximately 5 to 10 psi (34.5 to 68.9 kPa). As noted herein, if the inner tire84does not properly seal to the wheel2, the outer tire78is still locked in place on the wheel2, which improves the safety of the wheel2and vehicle. Further, the various aspects of the wheel2allow for precise control of the pressure in each tire78,84. Considering a vehicle will have multiple wheels, the precise control allows for more balanced and stable contact with the ground surface.", "", "Next, a centerline90of the wheel2is shown, and the centerline90is also the axis of rotation for the wheel2and denotes the axial direction. A distance between the reference line52and the centerline90is a nominal radius92of the wheel2. The nominal diameter of the wheel2(twice the nominal radius92) is used for sizing the tires78,84that fit onto the wheel2. In this embodiment, the nominal diameter is approximately 16 inches (406.4 mm), but other diameters are possible in other embodiments without deviating from the present disclosure. Moreover, certain key aspects of the wheel2that are critical to the operation and improved performance of the wheel2can be expressed in terms relative to the nominal diameter of the wheel2for various wheel2sizes. For example, in some embodiments, the height (58inFIG.3B) of the inner rim projection is between approximately 3.5% and 4% of the nominal diameter to allow the inner tire84to pass over the inner rim and to secure the inner and outer tires. Likewise, the height (66inFIG.3C) of the outer rim projection is between approximately 3.5% and 4% of the nominal diameter.", "", "FIG.4Aalso shows a width94of the wheel in the axial direction as measured between an outer surface of the inner rim8and an outer surface of the outer rim14. In some embodiments, the width94is between approximately 16 and 19 inches (406.4 to 482.6 mm). In various embodiments, the width94is approximately 17.34 inches (440.4 mm). Accordingly, existing liner tires can be used with the wheel, or even larger inner and outer tires can be used with the wheel for improved traction with the ground surface. Lastly,FIG.4Ashows Detail4B.", "", "FIG.4Bdepicts Detail4B ofFIG.4Awhere the inner tire84and the outer tire78are secured to the wheel2. Specifically, the outer bead88of the inner tire84is positioned against the outer portion knurl40. In addition, the outer bead88contacts the outer rim projection62, and similarly, the inner bead of the inner tire contacts the inner rim projection to secure the inner tire84to the wheel2. The inner tire84depicted inFIG.4Bis a conventional inner or liner tire with voids96that extend into an outer surface. These voids96can be discrete and non-continuous around the circumference of the inner tire84such that at least a portion of the inner tire still contacts the outer rim projection62. The voids96provide a passage to transmit air pressure to the outer tire in a conventional liner wheel, as described herein. However, it will be appreciated that the inner tire84may not have any voids96, and the entire outer surface of the outer bead88contacts the outer rim projection62. Finally, the outer bead84of the outer tire78is secured between the outer rim knurl16and the outer beadlock knurl36.", "", "While various embodiments of the present invention have been described in detail, it is apparent that modifications and alterations of those embodiments will occur to those skilled in the art. However, it is to be understood that such modifications and alterations are within the scope and spirit of the present invention, as set forth in the following claims. Further, the invention(s) described herein is capable of other embodiments and of being practiced or of being carried out in various ways. It is to be understood that the phraseology and terminology used herein is for the purpose of description and should not be regarded as limiting."], "claims": ["an inner portion, a middle portion, and an outer portion, wherein the middle portion joins the inner and outer portions, and a hub extends from the middle portion and is configured to engage a wheel hub assembly of a vehicle; an inner rim positioned at a distal end of the inner portion, wherein the inner rim has an inner rim projection that extends radially outwardly relative to the inner portion, and the inner rim projection has a width; an outer rim positioned at a distal end of the outer portion, wherein the outer rim has an outer rim projection that extends radially outwardly relative to the outer portion, and the outer rim projection has a width, and wherein the width of the outer rim projection is larger than the width of the inner rim projection; a channel extending radially into the outer rim projection; an inner beadlock ring configured to engage the inner rim and to secure an inner bead of an outer tire; and an outer beadlock ring configured to engage the outer rim and to secure an outer bead of the outer tire.", "an inner portion knurl on an outer surface of the inner portion and proximate to the inner rim, wherein the inner portion knurl is configured to engage an inner bead of an inner tire; and an outer portion knurl on an outer surface of the outer portion and proximate to the outer rim, wherein the outer portion knurl is configured to engage an outer bead of the inner tire.", "3 . The wheel of claim 1 , wherein the outer beadlock ring has an outer beadlock projection with a width, wherein the width of the outer rim projection is larger than the width of the outer beadlock projection.", "4 . The wheel of claim 1 , wherein the inner beadlock ring has an inner beadlock projection with a width, wherein the width of the inner rim projection is larger than the width of the inner beadlock projection.", "5 . The wheel of claim 1 , wherein the width of the outer rim projection is between approximately 0.45 and 0.65 inches.", "6 . The wheel of claim 1 , wherein the channel is configured to receive a valve stem, and the channel has a width that is between approximately 0.15 and 0.35 inches.", "7 . The wheel of claim 1 , wherein the outer rim projection has a height that is between approximately 3.5% and 4% of a nominal diameter of the inner portion.", "an inner portion, a middle portion, and an outer portion, wherein the middle portion joins the inner and outer portions, and a hub extends from the middle portion and is configured to engage a wheel hub assembly of a vehicle; an inner rim positioned at a distal end of the inner portion; an outer rim positioned at a distal end of the outer portion; an inner beadlock ring configured to engage the inner rim and to secure an inner bead of an outer tire; an outer beadlock ring configured to engage the outer rim and to secure an outer bead of the outer tire; an inner enhanced portion on an outer surface of the inner portion and proximate to the inner rim, wherein the inner enhanced portion is configured to engage an inner bead of an inner tire; and an outer enhanced portion on an outer surface of the outer portion and proximate to the outer rim, wherein the outer enhanced portion is configured to engage an outer bead of the inner tire.", "9 . The wheel of claim 8 , wherein the inner enhanced portion is a knurl, and the outer enhanced portion is a knurl.", "an inner rim projection of the inner rim, wherein the inner rim projection extends radially outwardly relative to the inner portion, and the inner rim projection has a width in an axial direction and is configured to separate the outer tire and the inner tire; an outer rim projection of the outer rim, wherein the outer rim projection extends radially outwardly relative to the outer portion, and the outer rim projection has a width in an axial direction, and wherein the width of the outer rim projection is larger than the width of the inner rim projection, and the outer rim projection is configured to separate the outer tire and the inner tire; and a channel extending radially into the outer rim projection, wherein the channel is configured to receive a valve stem.", "11 . The wheel of claim 10 , wherein the outer beadlock ring has an outer beadlock projection with a width in an axial direction, wherein the width of the outer rim projection is larger than the width of the outer beadlock projection.", "12 . The wheel of claim 8 , wherein the inner enhanced portion extends around a circumference of the inner portion, and the outer enhanced portion extends around a circumference of the outer portion.", "an inner beadlock knurl on the inner beadlock ring; and an inner rim knurl on the inner rim, wherein the inner beadlock knurl and the inner rim knurl are configured to contact and secure the inner bead of the outer tire.", "an outer beadlock knurl on the outer beadlock ring; and an outer rim knurl on the outer rim, wherein the outer beadlock knurl and the outer rim knurl are configured to contact and secure the outer bead of the outer tire.", "an inner portion, a middle portion, and an outer portion, wherein the middle portion joins the inner and outer portions, and a hub extends from the middle portion and is configured to engage a wheel hub assembly of a vehicle; an inner rim positioned at a distal end of the inner portion; an outer rim positioned at a distal end of the outer portion, wherein the outer rim has an outer rim projection that extends radially outwardly relative to the outer portion, and the outer rim projection has a width; an inner beadlock ring configured to engage the inner rim and to secure an inner bead of an outer tire; and an outer beadlock ring configured to engage the outer rim and to secure an outer bead of the outer tire, wherein the outer beadlock ring has an outer beadlock projection with a width, and wherein the width of the outer rim projection is larger than the width of the outer beadlock projection.", "an inner portion knurl on an outer surface of the inner portion and proximate to the inner rim, wherein the inner portion knurl is configured to engage an inner bead of an inner tire; and an outer portion knurl on an outer surface of the outer portion and proximate to the outer rim, wherein the outer portion knurl is configured to engage an outer bead of the inner tire.", "an inner rim projection of the inner rim, wherein the inner rim projection extends radially outwardly relative to the inner portion, and the inner rim projection has a width, wherein the width of the outer rim projection is larger than the width of the inner rim projection; and a channel extending radially into the outer rim projection, wherein the channel is configured to receive a valve stem.", "18 . The wheel of claim 17 , wherein the outer portion is configured to receive a second valve stem.", "19 . The wheel of claim 15 , wherein the inner portion, the middle portion, the outer portion, and the hub are a continuous structure.", "20 . The wheel of claim 19 , wherein the continuous structure is made of one of an aluminum alloy, a steel alloy, a magnesium alloy, a titanium alloy, or a carbon fiber material."], "bibtex": "@patent{20240190173,\n    title = {RACING WHEEL},\n    number = {20240190173},\n    year = {2024},\n    note = {File: US20240190173A1-20240613.XML}\n    }", "classification": "B60B2510FI"}, {"title": "WHEEL HUB BEARING UNIT WITH OPTIMIZED POSITIONING OF OUTBOARD BALLS", "doc_number": "20240190174", "filename": "US20240190174A1-20240613.XML", "abstract": "A wheel hub bearing unit includes a hub rotatable about an axis and having a flange connectable with a wheel, an inner ball raceway and an inner roller raceway. An outer ring is connectable with the vehicle and disposed about the hub and has an outer ball raceway and an outer roller raceway. A plurality of balls roll upon the inner and outer ball raceways and a plurality of tapered rollers roll upon the inner and outer roller raceways. A contact angle between the balls and the ball raceways has a value between ten degrees and forty degrees. Each line extending through ball inner and outer contact points intersects with a line extending through a roller midpoint circle at a vertex, the vertex being spaced from a midpoint of a spacing line segment between ball and roller pitch circles by an axial distance of no greater than 7.5 millimeters.", "detailed_description": ["Certain terminology is used in the following description for convenience only and is not limiting. The words “inner”, “inwardly” and “outer”, “outwardly” refer to directions toward and away from, respectively, a designated centerline or a geometric center of an element being described, the particular meaning being readily apparent from the context of the description. The terminology includes the words specifically mentioned above, derivatives thereof, and words of similar import.", "", "Referring now to the drawings in detail, wherein like numbers are used to indicate like elements throughout, there is shown inFIGS.1-8a wheel hub bearing unit10for rotatably coupling a wheel1with a vehicle2, particularly a steering knuckle or a suspension component (either being indicated by the same reference element3), the wheel1being rotatable about a central axis AC. The wheel hub bearing unit10basically comprises a hub12rotatable about the central axis AC, an outer ring14disposed about the hub12, a plurality or “row”15of balls16disposed between the hub12and the outer ring14and a plurality or “row”17of tapered rollers18disposed between the hub12and the ring14and spaced axially from the plurality of balls16, the balls16and the rollers14rotatably coupling the hub12with the outer ring14. The hub12and the outer ring14are configured, i.e., constructed, assembled, etc., so as to position the rolling elements16,18in locations which optimize the performance of the wheel hub bearing unit10, as discussed in detail below.", "", "Referring toFIGS.1and2, the hub12includes a generally cylindrical body20having an outboard axial end20a, an opposing inboard axial end20band an annular flange22extending radially outwardly from the outboard end20a. The hub flange22is configured to connect with the wheel1, preferably by means of a plurality of fasteners4extending through holes21in the flange22. The body20has an outer circumferential groove24providing an inner ball raceway26and a frustoconical outer circumferential surface28spaced axially from the outer circumferential groove24and providing an inner roller raceway30. Preferably, the outer circumferential groove24has partially circular axial cross-sections and has a section24afacing generally toward the inboard axial end20b. Further, the frustoconical outer circumferential surface28preferably faces generally toward the outboard axial end20aof the hub12.", "", "Further, the hub cylindrical body20preferably includes or is formed of a main body portion32and an annular ring34disposed about the main body portion32adjacent to the inboard axial end20b. The annular ring34has an outer circumferential surface35A including the outer frustoconical surface28providing the inner roller raceway30and an inner circumferential surface35B providing a bore for receiving a portion of the main body portion32. Furthermore, the hub body20preferably has an inner circumferential surface23defining a bore for receiving an axle (not shown) and a plurality of axial splines25formed in the inner surface23for engaging with mating splines of the axle.", "", "Referring toFIGS.1and3, the outer ring14is configured to connect with the vehicle2, preferably with a steering knuckle or suspension component3, and includes a generally circular cylindrical body40with an outboard axial end40aand an opposing inboard axial end40b. Most preferably, the outer ring body40has at least one flange41extending radially outwardly from the outer circumferential surface43, each outer ring flange41having outer and inner axial ends41a,41band being configured to connect with a steering knuckle or a suspension component3by means of threaded fasteners (none shown). The outer ring cylindrical body40further has an inner circumferential groove42providing an outer ball raceway44and a frustoconical inner circumferential surface46spaced axially from the inner circumferential groove42and providing an outer roller raceway48. When the outer ring14is disposed about the hub12, the outboard end40aof the ring14is disposed adjacent to the hub flange22, the ring inboard end40bis disposed adjacent to the hub inboard end20b, the outer ball raceway44is disposed about the inner ball raceway26and the outer roller raceway48is disposed about the inner roller raceway30.", "", "Preferably, the inner circumferential groove42is spaced axially from and has a section42afacing generally toward the ring outboard axial end20a, and also facing toward the section24aof the inner groove24, and the frustoconical inner surface46is spaced axially from faces generally toward the ring inboard axial end40b, and also faces toward the frustoconical outer surface28. As such, the balls16and the rollers18are generally arranged in an O-type configuration when disposed on the raceway pairs26,44and30,48, as is generally well known in the field of bearings. Further, the outer roller raceway48has first and second axial ends48a,48band a midpoint circle49centered between the first and second axial ends48a,48b. The midpoint circle MC is a theoretical construct which indicates the path traversed by the center CLCof the line of contact LCO(FIG.5) of each roller18on the outer raceway48as the rollers18circulate about the central axis AC, as best shown inFIG.3and discussed in further detail below. The midpoint circle MC extends about the central axis ACand is spaced therefrom by a midpoint radius RMC.", "", "Referring now toFIGS.1,4and6-8, the plurality of balls16are disposed between the hub12and the outer ring14and are spaced circumferentially about the central axis AC. The balls16are simultaneously rollable upon the inner ball raceway26and the outer ball raceway44when the hub12rotates about the central axis AC. Specifically, during rotation of the hub12, the balls16traverse a theoretical pitch circle BPC extending through the center of each ball16and about the central axis AC, the pitch circle BPC having a radius RBP about the axis AC. As shown inFIG.4, the ball raceways26,44are configured such that each ball16contacts the ball inner raceway26at an inner contact point BCIand simultaneously contacts the ball outer raceway44at an outer contact point BCO, the specific portions of each ball16contacting the raceways26,44continuously changing during the rolling motion of the balls16. Each line LBCextending through a ball inner contact point BCIand through a ball outer contact point BCOdefines a ball contact angle αB with a line perpendicular LBCto the central axis AC, as discussed in further detail below.", "", "Further, the plurality of tapered rollers18are disposed between the hub12and the outer ring14and are spaced circumferentially about the central axis AC. The rollers18are rollable simultaneously upon the inner roller raceway30and the outer roller raceway48operate function with the balls16in rotatably coupling the hub12and the outer ring14. As with the balls16, the rollers18similarly traverse a theoretical pitch circle RPC through the geometric center of each roller16, the roller pitch circle RPC having a radius RRP about the central axis ACand the roller pitch circle RPC being spaced from the ball pitch circle BPC by a spacing line segment LSSalong the central axis AC. As discussed above and shown inFIG.5, each roller18simultaneously contacts the outer raceway48along a contact line LCOextending axially between the axial ends48a,48bof the raceway48, as well as contacting the inner raceway30along a contact line LCIextending axially between the axial ends30a,30bof the raceway30.", "", "Referring now toFIGS.6and7, to optimize the performance of the wheel hub bearing unit10, the hub12and the outer ring14are formed or constructed to position the balls16in a manner that has been determined to best balance considerations of friction on the rolling elements16,18and the stiffness, mass and fatigue life of the wheel hub bearing unit10. Specifically, the inner and outer ball raceways26,44are each configured such that the ball contact angle αB has a value between ten degrees (10°) and forty degrees (40°). Additionally, the inner and outer ball raceways26,44and the inner and roller outer raceways30,48are configured such that each line LBCextending through the ball inner and outer contact points BCI, BCOintersects with a line LRextending through the roller midpoint circle MC perpendicular to the roller outer raceway48at a rolling element intersection vertex VE, the vertex VE being spaced from a midpoint ms of the spacing line segment LSSby an axial distance VS of no greater than seven and one-half millimeters (7.5 mm), i.e., plus or minus seven and one-half millimeters (+/−7.5 mm).", "", "Most preferably, the axial spacing distance VS is related to the ball contact angle αB such that, for a particular value of the ball contact angle αB, the vertex axial spacing distance VS may be calculated as follows:", "", "VS=[RBP-RRP+(LS×tan⁡(π2-α⁢R))tan⁡(π2-α⁢B)+tan⁡(π2-α⁢R)]-LS2", "", "The above equation was discovered by the inventors of the present invention as a novel mechanism for expressing the relationship between the various dimensional parameters of the hub bearing unit10incorporated within this mathematical formula, and is a useful tool for designing such bearing units. More specifically, this formula may be used by a bearing manufacturer to test and to produce the wheel hub bearing units10with a greater reliability by reducing the testing phase and the samples needed to validate these products.", "", "When using the above formula to calculate the value of the vertex axial spacing distance VS, the vertex VE is spaced from the spacing line segment midpoint ms in a direction toward the rollers18when the value of VS is positive and is spaced from the spacing line segment midpoint ms in a direction toward the balls16when the value of VS is negative. Further, the wheel hub bearing unit10is preferably configured or constructed such that, as the ball contact angle αB approaches a value of ten degrees (10°), the vertex axial spacing distance VS approaches a value of negative seven and one-half millimeters (−7.5 mm), as depicted inFIG.6, and conversely, as the ball contact angle αB approaches a value of forty degrees (40°), the vertex axial spacing distance VS approaches a value of positive seven and one-half millimeters (+7.5 mm), as shown inFIG.7.", "", "The above mathematical relationship provides the most optimal combination of ball contact angle αB and axial spacing distance VS. However, any other combination of ball contact angle αB within the range of ten degrees (10°) and forty degrees (40°) and vertex axial spacing distance VS within the range of +/−7.5 mm from the spacing line segment midpoint ms provides enhanced performance of the wheel hub bearing unit10.", "", "With such a relative positioning of the rolling elements16,18and particularly the angular orientation of the balls16, the stiffness and friction of the hub bearing unit10are relatively less when the ball contact angle αB is more proximal to ten degrees (10°) and the vertex axial spacing distance VS is more proximal to negative seven and one-half millimeters (−7.5), indicating that the rolling element intersection vertex VE is located more proximal to the balls16. Alternatively, the bearing unit stiffness and friction are relatively greater when the ball contact angle αB is more proximal to forty degrees (40°) and the vertex axial spacing distance VS is more proximal to positive seven and one-half millimeters (+7.5 mm), indicating that the rolling element intersection vertex VE is located more distally from the balls16, and thus relatively more proximal to the rollers18.", "", "However, less improvement of the product life or fatigue life of the wheel hub bearing unit10has been observed when both the ball contact angle αB is more proximal to 10° and the vertex axial spacing distance VS is more proximal to −7.5 mm and alternatively, greater improvement in the product/fatigue life of the unit10has been observed when both the ball contact angle αB is more proximal to 40° and the vertex axial spacing distance VS is more proximal to +7.5 mm. In any case, any combination of a ball contact angle αB within 10° and 40° and a vertex axial spacing distance VS within +/−7.5 mm provides the wheel hub bearing unit10with a beneficial combination of stiffness, friction and product life.", "", "Referring now toFIG.8, to further optimize the wheel hub bearing unit10, the hub12and the outer ring14are also preferably formed or constructed to position the rollers18in a manner that has been determined to best balance considerations of friction on the rolling elements16,18and stiffness, mass and fatigue life of the wheel hub bearing unit10. Specifically, the inner and outer ball raceways26,44and the inner and outer roller raceways30,48are configured such that a difference between the ball pitch circle radius RBP and the midpoint circle radius RMC, the “rolling element radius differential” or “RER differential” is between plus or minus five millimeters (+/−5 mm), i.e., no greater than five millimeters (5 mm). Additionally, the raceways26,44,30and48are also configured such that a vertex VR is defined at the intersection of each line LRextending through the midpoint circle MC perpendicular to the outer roller raceway48and a line Ls extending through the midpoint ms of, and perpendicular to, the spacing line segment LSS, the vertex VR being spaced from the central axis ACby a radial spacing distance RV and a ratio of the vertex radial spacing distance RV to the midpoint circle radius RMC, or RV:RMC, the “vertex-roller radius ratio” or “VRR ratio”, is between one and one-half (1.5) and three (3.0).", "", "With such a relative positioning of the rolling elements16,18and particularly the angular orientation of the rollers18, the stiffness of the bearing assembly10is relatively greater and both friction and mass is relatively less when the RER differential is more proximal to negative five millimeters (−5 mm), indicating that the rollers18are spaced radially inwardly from the balls16, and the VRR ratio is more proximal to 1.5, indicating a shallower contact angle of the rollers18. Alternatively, the bearing assembly stiffness is relatively less and friction and mass are relatively greater when the RER differential is more proximal to positive 5 millimeters (+5 mm) and the VRR ratio is more proximal to 3.0, indicating a steeper contact angle of the rollers18. However, less improvement in the product life or fatigue life has been observed when both the RER differential is more proximal to −5 mm and the VRR ratio is more proximal to 1.5 and conversely, greater improvement in product/fatigue life has been observed when both the RER differential is more proximal to +5 mm and the VRR ratio is more proximal to 3.0. In any case, any combination of the RER differential within the range of plus or minus five millimeters (+/−5 mm) and a VRR of between 1.5 and 3.0 gives the wheel hub bearing unit10a beneficial combination of stiffness, mass, friction and product life.", "", "Referring toFIGS.6-8, preferably, the outer axial end41aof each outer ring flange41is located proximal to any line Ls extending perpendicularly through the midpoint ms of the spacing line segment LSS, with the inner axial end41bbeing disposed between the flange outer axial end41aand the inboard end40bof the outer ring14. Such a positioning of the outer ring flange(s)40reduces deflections in the wheel hub bearing unit10for a given bending moment exerted on each flange41.", "", "Representative, non-limiting examples of the present invention were described above in detail with reference to the attached drawings. This detailed description is merely intended to teach a person of skill in the art further details for practicing preferred aspects of the present teachings and is not intended to limit the scope of the invention.", "", "Moreover, combinations of features and steps disclosed in the above detailed description may not be necessary to practice the invention in the broadest sense, and are instead taught merely to particularly describe representative examples of the invention. Furthermore, various features of the above-described representative examples, as well as the various independent and dependent claims below, may be combined in ways that are not specifically and explicitly enumerated in order to provide additional useful embodiments of the present teachings.", "", "All features disclosed in the description and/or the claims are intended to be disclosed separately and independently from each other for the purpose of original written disclosure, as well as for the purpose of restricting the claimed subject matter, independent of the compositions of the features in the embodiments and/or the claims. In addition, all value ranges or indications of groups of entities are intended to disclose every possible intermediate value or intermediate entity for the purpose of original written disclosure, as well as for the purpose of restricting the claimed subject matter. The invention is not restricted to the above-described embodiments, and may be varied within the scope of the following claims."], "claims": ["a hub rotatable about the central axis and having an outboard axial end, an inboard axial end, an annular flange extending radially outwardly from the outboard axial end and configured to connect with the wheel, an outer circumferential groove providing a ball inner raceway and a frustoconical outer circumferential surface section spaced axially from the outer circumferential groove and providing a roller inner raceway; an outer ring disposed about the hub and configured to connect with the vehicle, the outer ring having an inner circumferential groove providing a ball outer raceway and a frustoconical inner circumferential surface section spaced axially from the inner circumferential groove and providing a roller outer raceway, the roller outer raceway having first and second axial ends and a midpoint circle centered between the first and second axial ends and extending about the central axis; a plurality of balls disposed between the hub and the outer ring so as to be rollable upon the ball inner and outer raceways to traverse a pitch circle extending through the center of each ball and about the central axis, each ball contacting the hub groove at an inner contact point and contacting the outer ring groove at an outer contact point, a line extending through each ball inner contact point and each ball outer contact point defining a ball contact angle with a line perpendicular to the central axis; and a plurality of tapered rollers disposed between the hub and the outer ring so as to be rollable upon the roller inner and outer raceways to traverse a pitch circle extending through a center of each roller and about the central axis, the roller pitch circle being spaced from the ball pitch circle by a spacing line segment along the central axis; wherein the inner and outer ball raceways are each configured such that the ball contact angle has a value between ten degrees (10°) and forty degrees (40°) and the inner and outer ball raceways and the inner and roller outer raceways are each configured such that each line extending through the ball inner and outer contact points intersects with a line extending through the midpoint circle perpendicular to the roller outer raceway at a vertex, the vertex being spaced from a midpoint of the spacing line segment by an axial distance of no greater than seven and one-half millimeters (7.5 mm).", "each line extending through the midpoint circle perpendicular to the roller outer raceway defines a roller contact angle with a line perpendicular to the central axis; the roller pitch circle has a radius about the central axis; and the axial spacing distance of the vertex from the midpoint of the spacing line segment for a particular value of the ball contact angle is calculated as follows: wherein: VS is the axial spacing distance of the vertex from the midpoint of the spacing line segment in millimeters, the vertex being spaced from the spacing line segment midpoint toward the rollers when the value of VS is positive and spaced from the spacing line segment midpoint toward the balls when the value of VS is negative; RBP is the radius of the ball pitch circle; RRP is the radius of the roller pitch circle; LS is the length of the spacing line segment in millimeters; αB is the value of the ball contact angle in degrees; and αR is the value of the roller contact angle in degrees.", "3 . The wheel hub bearing unit as recited in claim 1 , wherein the ball inner and outer raceways and the roller inner and outer raceways are configured such that as the ball contact angle approaches the value of ten degrees (10°), the axial spacing distance of the vertex from the midpoint of the spacing line segment approaches a value of seven and one-half millimeters (7.5 mm) in a direction toward the balls and as the ball contact angle approaches the value of forty degrees (40°), the axial spacing distance of the vertex from the midpoint of the spacing line segment approaches the value of seven and one-half millimeters (7.5 mm) toward the rollers.", "the outer circumferential groove of the hub has a section facing generally toward the inboard axial end and the frustoconical outer circumferential surface of the hub faces generally toward the outboard axial end; and the outer ring has an outboard axial end and an inboard axial end, the outboard axial end of the outer ring being disposed adjacent to the hub flange, the inner circumferential groove of the outer ring being spaced axially from and having a section facing generally toward the outboard axial end and the frustoconical inner surface of the outer ring is spaced axially from faces generally toward the inboard axial end.", "5 . The wheel hub bearing unit as recited in claim 1 , wherein the hub has a cylindrical main body portion and an annular ring disposed about the main body portion adjacent to the inboard axial end, the annular ring having an outer circumferential surface including the outer frustoconical surface providing the inner roller race.", "6 . The wheel hub bearing unit as recited in claim 1 , wherein the outer ring has an outer circumferential surface and an annular flange extending radially outwardly from the outer circumferential surface, the outer ring flange being configured to connect with a steering knuckle or a suspension member of the vehicle.", "7 . The wheel hub bearing unit as recited in claim 6 , wherein the flange of the outer ring has outer and inner axial ends, the outer axial end of the flange being located proximal to any line extending perpendicularly through the midpoint of the spacing line segment and the inner axial end being disposed between the outer axial end and the inboard end of the outer ring.", "8 . The wheel hub bearing unit as recited in claim 1 , wherein the inner and outer ball raceways and the roller inner and outer raceways are configured such that a difference between the ball pitch circle radius and the midpoint circle radius is no greater than five millimeters (5 mm).", "9 . The wheel hub bearing unit as recited in claim 8 , wherein a roller vertex is defined at the intersection of each line extending through the midpoint circle perpendicular to the roller outer raceway and a line extending through the midpoint of and perpendicular to the spacing line segment, the roller vertex being spaced from the central axis by a radial spacing distance and a ratio of the roller vertex radial spacing distance to the midpoint circle radius is between 1.5 and 3.0.", "10 . The wheel hub bearing unit as recited in claim 1 , wherein a roller vertex is defined at the intersection of each line extending through the midpoint circle perpendicular to the roller outer raceway and a line extending through the midpoint of and perpendicular to the spacing line segment, the roller vertex being spaced from the central axis by a radial spacing distance and a ratio of the roller vertex radial spacing distance to the midpoint circle radius is between 1.5 and 3.0.", "a hub rotatable about the central axis and having an outboard axial end, an inboard axial end, an annular flange extending radially outwardly from the outboard axial end and configured to connect with the wheel, an outer circumferential groove providing a ball inner raceway and a frustoconical outer circumferential surface section spaced axially from the outer circumferential groove and providing a roller inner raceway; an outer ring disposed about the hub and configured to connect with the vehicle, the outer ring having an inner circumferential groove providing a ball outer raceway and a frustoconical inner circumferential surface section spaced axially from the inner circumferential groove and providing a roller outer raceway, the roller outer raceway having first and second axial ends and a midpoint circle centered between the first and second axial ends and extending about the central axis; a plurality of balls disposed between the hub and the outer ring so as to be rollable upon the ball inner and outer raceways to traverse a pitch circle extending through the center of each ball and about the central axis, each ball contacting the hub groove at an inner contact point and contacting the outer ring groove at an outer contact point, a line extending through each ball inner contact point and each ball outer contact point defining a ball contact angle with a line perpendicular to the central axis; and a plurality of tapered rollers disposed between the hub and the outer ring so as to be rollable upon the roller inner and outer raceways to traverse a pitch circle extending through a center of each roller and about the central axis, the roller pitch circle being spaced from the ball pitch circle by a spacing line segment along the central axis; wherein the inner and outer ball raceways and the inner and roller outer raceways are each configured such that each line extending through the ball inner and outer contact points intersects with a line extending through the midpoint circle perpendicular to the roller outer raceway at a vertex and such that as the ball contact angle approaches the value of ten degrees (10°), an axial spacing distance of the vertex from a midpoint of the spacing line segment approaches a value of seven and one-half millimeters (7.5 mm) in a direction toward the balls and as the ball contact angle approaches the value of forty degrees (40°), the axial spacing distance of the vertex from the midpoint of the spacing line segment approaches the value of seven and one-half millimeters (7.5 mm) toward the rollers.", "each line extending through the midpoint circle perpendicular to the roller outer raceway defines a roller contact angle with a line perpendicular to the central axis; the roller pitch circle has a radius about the central axis; and the axial spacing distance of the vertex from the midpoint of the spacing line segment for a particular value of the ball contact angle is calculated as follows: wherein: VS is the axial spacing distance of the vertex from the midpoint of the spacing line segment in millimeters, the vertex being spaced from the spacing line segment midpoint toward the rollers when the value of VS is positive and spaced from the spacing line segment midpoint toward the balls when the value of VS is negative; RBP is the radius of the ball pitch circle; RRP is the radius of the roller pitch circle; LS is the length of the spacing line segment in millimeters; αB is the value of the ball contact angle in degrees; and αR is the value of the roller contact angle in degrees.", "the outer circumferential groove of the hub has a section facing generally toward the inboard axial end and the frustoconical outer circumferential surface of the hub faces generally toward the outboard axial end; and the outer ring has an outboard axial end and an inboard axial end, the outboard axial end of the outer ring being disposed adjacent to the hub flange, the inner circumferential groove of the outer ring being spaced axially from and having a section facing generally toward the outboard axial end and the frustoconical inner surface of the outer ring is spaced axially from faces generally toward the inboard axial end.", "14 . The wheel hub bearing unit as recited in claim 11 , wherein the hub has a cylindrical main body portion and an annular ring disposed about the main body portion adjacent to the inboard axial end, the annular ring having an outer circumferential surface including the outer frustoconical surface providing the inner roller race.", "15 . The wheel hub bearing unit as recited in claim 11 , wherein the outer ring has an outer circumferential surface and an annular flange extending radially outwardly from the outer circumferential surface, the outer ring flange being configured to connect with a steering knuckle or a suspension member of the vehicle.", "16 . The wheel hub bearing unit as recited in claim 15 , wherein the flange of the outer ring has outer and inner axial ends, the outer axial end of the flange being located proximal to any line extending perpendicularly through the midpoint of the spacing line segment and the inner axial end being disposed between the outer axial end and the inboard end of the outer ring.", "17 . The wheel hub bearing unit as recited in claim 11 , wherein the inner and outer ball raceways and the roller inner and outer raceways are configured such that a difference between the ball pitch circle radius and the midpoint circle radius is no greater than five millimeters (5 mm) and a roller vertex is defined at the intersection of each line extending through the midpoint circle perpendicular to the roller outer raceway and a line extending through the midpoint of and perpendicular to the spacing line segment, the roller vertex being spaced from the central axis by a radial spacing distance and a ratio of the roller vertex radial spacing distance to the midpoint circle radius is between 1.5 and 3.0."], "bibtex": "@patent{20240190174,\n    title = {WHEEL HUB BEARING UNIT WITH OPTIMIZED POSITIONING OF OUTBOARD BALLS},\n    number = {20240190174},\n    year = {2024},\n    note = {File: US20240190174A1-20240613.XML}\n    }", "classification": "B60B2700FI"}, {"title": "Drive Module for a Motor Vehicle", "doc_number": "20240190175", "filename": "US20240190175A1-20240613.XML", "abstract": "A drive module ( 1, 1 a ) includes an axle casing ( 2 ) and a shaft ( 3 ) rotatably mounted in an interior space ( 11 ) of the axle casing ( 2 ). Two bearing units ( 6, 6 a ) lie opposite each other and are secured in the axle casing ( 2 ) in an axial direction. Each bearing unit ( 6, 6 a ) includes an inner bearing ring ( 7, 7 a ) fixedly connected to the shaft ( 3 ), an outer bearing ring ( 8, 8 a ) fixedly connected to the axle casing ( 2 ), and rolling elements ( 9, 9 a ) arranged between the inner bearing ring ( 7, 7 a ) and the outer bearing ring ( 8, 8 a ). A lubricating fluid is present at least in the interior space ( 11 ). The lubricating fluid forming a fluid reservoir at a bottom of the interior space ( 11 ). The axle casing ( 2 ) includes a fluid opening extending, in each case, from the interior space ( 11 ) to a respective bearing unit ( 6, 6 a ) for conducting the lubricating fluid to the rolling elements ( 9, 9 a ). At least one conduction device is fluidically connected to the fluid reservoir and is configured for conducting the lubricating fluid the interior space ( 11 ) to the respective fluid opening.", "detailed_description": ["Reference will now be made to embodiments of the invention, one or more examples of which are shown in the drawings. Each embodiment is provided by way of explanation of the invention, and not as a limitation of the invention. For example, features illustrated or described as part of one embodiment can be combined with another embodiment to yield still another embodiment. It is intended that the present invention include these and other modifications and variations to the embodiments described herein.", "", "FIG.1schematically shows a sectioning of a drive module1,1aalong an axial axis A. The drive module1,1ahas an axle casing2in which a shaft3is rotatably mounted, the shaft3having a flange5at the end. A cooling and lubricating fluid circulates in the axle casing2and, at the bottom, which faces the roadway, forms an oil sump12(FIG.2), which has an oil level21.", "", "Furthermore, a shield plate4is provided, as well as sealing lips13for sealing.", "", "A bearing unit6,6ais also provided. The bearing unit6,6aincludes an inner bearing ring7,7a, which is connected to the shaft3, and an outer bearing ring8,8awhich is fixed to the axle casing2. Rolling elements9,9aare arranged between the inner bearing ring7,7aand the outer bearing ring8,8a. In particular, the bearing units6,6aare tapered roller bearings.", "", "The bearing units6,6aare used essentially to guide the rotational motion and to support the weight of the motor vehicle.", "", "Furthermore, such bearing units6,6amust effectuate the transmission of the drive torque via the shaft3which is connected to a hub, in order to set the hub into rotation.", "", "In particular, the bearing units6,6acan be braced in the axle casing2.", "", "Furthermore, the drive module1includes a drive shaft20, which is arranged in an interior space11in the axle casing2underneath in the direction of gravity and transversely to the shaft3.", "", "FIG.2shows the drive module1in a first example embodiment.", "", "The drive module1includes the bearing units6,6ahaving the inner bearing ring7,7aand an outer bearing ring8,8aand the rolling elements9,9a.", "", "Furthermore, the axle casing2has the interior space11which is partially filled with oil for lubricating the surrounding components. The oil has an oil level21and thus forms an oil sump12.", "", "Furthermore, the drive module1includes a drive shaft20which is arranged in the interior space11in the axle casing2underneath in the direction of gravity and transversely to the shaft3. The drive shaft20is arranged between the two bearing units6,6asuch that the drive shaft20plunges above or at least only partially in the oil sump12.", "", "Furthermore, the drive module1has a turbulizer10. The turbulizer10is arranged on the drive shaft20such that the turbulizer10churns in the oil during rotation. As a result, the oil is swirled and sprays onto the shaft3and onto the side walls of the interior space11.", "", "Furthermore, fluid bores14,14aare provided as fluid openings which form a connection from the interior space11to the bearing units6,6a. In particular, the fluid bores14,14aare fluidically connected to the rolling elements9,9a; for example, this can be effectuated via a corresponding opening in the respective bearing units6a,6, for example, directly ahead of or at the rolling elements9,9a.", "", "The fluid bore14acan, for example, also taper, such that the fluid bore14ahas a large opening to the interior space11, in order to practically collect upwardly spraying oil. Due to the rotation, the oil is subsequently transported to the rolling elements9aand lubricates these. As a result, continuous lubrication of the bearing unit6ais effectuated.", "", "Furthermore, the upwardly spraying oil can also run along the shaft3and flow into the fluid bore14in order to lubricate the rolling elements9. The shaft3can include fluid-conducting channels (not shown), for example, in an axial direction A. Grooves or other elements which are suitable for conducting oil can also be used, however. This ensures that the upwardly spraying oil does not immediately drip off the shaft3in the direction of gravity, but rather is conducted to the fluid bore14by the fluid-conducting channels due to the rotation.", "", "The fluid-conducting channels (not shown) can be introduced over the circumference of the shaft3.", "", "Furthermore, a combination of a tapering fluid bore14aand the fluid-conducting channels formed as grooves can also be present in order to effectuate a lubrication of the bearing units6,6a.", "", "Due to such a mechanical turbulizer10and the fluid-conducting channels, simple lubrication of the bearing units6,6acan be effectuated.", "", "The turbulizer10can be formed as a simple welded-on protrusion.", "", "FIG.3shows such a mechanical turbulizer10in detail, the mechanical turbulizer10being formed as a protrusion and being welded on the drive shaft20.", "", "FIG.4shows one further example embodiment of a turbulizer10a.", "", "The turbulizer10ais designed as a rotating spinner having one prong22as a churning element. The spinner can be fastened on the drive shaft20via a spring force due to a clamping effect.", "", "The spinner or the protrusion can also be fastened on the drive shaft20by a bolt connection.", "", "The spinner or the protrusion can be, for example, cast.", "", "Furthermore, multiple turbulizers10,10acan be arranged on the drive shaft20or variously designed turbulizers10,10acan be present, which effectuate a uniform turbulence and/or increased turbulence also at the sides of the interior space11.", "", "FIG.5shows the further example embodiment of a drive module1aaccording to the invention.", "", "The drive module1aincludes the bearing units6,6ahaving the inner bearing ring7,7aand an outer bearing ring8,8aand the rolling elements9,9a.", "", "Furthermore, the axle casing2has the interior space11which is partially filled with oil for lubricating the surrounding components. The oil has an oil level21and thus forms an oil sump12.", "", "The drive module1aalso has an external oil pump15.", "", "The external oil pump15can be connected to the oil sump12via a first bore16in the axle casing2. The oil can be conducted above the bearing units6,6athrough external lines17counter to the direction of gravity by the oil pump15. There, the oil can be distributed onto the two bearing units6,6athrough second bores18in the axle casing2. The second bores18can be introduced above the respective bearing units6,6a. By the second bores18, the oil can be conducted to the rolling elements9,9athrough respective openings in the bearing unit6a,6. As a result, an adjustable amount of oil can be supplied to the bearing units6,6aas lubricant.", "", "Furthermore, a bypass channel19,19acan be provided for each of the bearing units6,6a, each bypass channel19,19aforming a fluidic connection from the bearing units6,6ato the interior space11.", "", "The bypass channel19,19ais arranged at the bottom of the bearing unit6,6a, respectively, and is used to return excess amounts of supplied oil into the interior space11.", "", "In this way, oil in the bearing unit6,6acan be prevented from overheating. The particular bypass channel19,19acan also be formed, for example, as a simple bore.", "", "Furthermore, the particular bypass channel19,19acan be arranged axially on the end opposite the respective fluid openings. This means, the lubricating fluid, in particular the oil, passes through the rolling elements9,9ain an axial direction A and only then flows back into the oil sump12.", "", "As a result, the bearing units6,6acan be sufficiently oiled during their entire period of operation and thus have a longer service life. Due to the two example embodiments, the problem of an oil level21being too low to lubricate the bearing units6,6acan be overcome.", "", "Modifications and variations can be made to the embodiments illustrated or described herein without departing from the scope and spirit of the invention as set forth in the appended claims. In the claims, reference characters corresponding to elements recited in the detailed description and the drawings may be recited. Such reference characters are enclosed within parentheses and are provided as an aid for reference to example embodiments described in the detailed description and the drawings. Such reference characters are provided for convenience only and have no effect on the scope of the claims. In particular, such reference characters are not intended to limit the claims to the particular example embodiments described in the detailed description and the drawings."], "claims": ["1 - 15 : (canceled)", "an axle casing ( a shaft ( two bearing units ( wherein a lubricating fluid is present at least in the interior space ( wherein the axle casing ( wherein at least one conduction device is fluidically connected to the fluid reservoir and is configured for conducting the lubricating fluid from the interior space (", "17 . The drive module ( 1 , 1 a ) of claim 16 , further comprising a drive shaft ( 20 ) arranged in the axle casing ( 2 ) underneath the shaft ( 3 ) and disposed transversely to the shaft ( 3 ), wherein the drive shaft ( 20 ) is arranged between the two bearing units ( 6 , 6 a ) in the interior space ( 11 ) of the axle casing ( 2 ), and wherein the at least one conduction device is formed as at least one mechanical turbulizer ( 10 , 10 a ) co-rotationally mounted on the drive shaft ( 20 ) and configured for at least partially plunging into the fluid reservoir during rotation of the drive shaft ( 20 ).", "18 . The drive module ( 1 , 1 a ) of claim 17 , wherein the at least one mechanical turbulizer ( 10 , 10 a ) is fastened on the drive shaft ( 20 ) by a clamp or by a bolt.", "19 . The drive module ( 1 , 1 a ) of claim 17 , wherein the at least one mechanical turbulizer ( 10 , 10 a ) is integrally arranged on the drive shaft ( 20 ).", "20 . The drive module ( 1 , 1 a ) of claim 17 , wherein the at least one mechanical turbulizer ( 10 , 10 a ) comprises a plurality of mechanical turbulizers ( 10 , 10 a ) differently designed and/or distributed over a circumference of the drive shaft ( 20 ).", "21 . The drive module ( 1 , 1 a ) of claim 17 , wherein a plurality of fluid openings in the axle casing ( 2 ) are arranged facing from a respective one of the two bearing units ( 6 , 6 a ), in each case, toward the interior space ( 11 ) in order to establish a fluidic connection between the two bearing units ( 6 , 6 a ) and the fluid reservoir.", "22 . The drive module ( 1 , 1 a ) of claim 21 , wherein the plurality of fluid openings in the axle casing ( 2 ) are arranged underneath the shaft ( 2 ).", "23 . The drive module ( 1 , 1 a ) of claim 22 , wherein at least some of the plurality of fluid openings are disposed in the axle casing ( 2 ) to align with the rolling elements ( 9 , 9 a ) in order to guide the lubricating fluid to the rolling elements ( 9 , 9 a ).", "24 . The drive module ( 1 , 1 a ) of claim 21 , characterized in that the plurality of fluid openings in the axle casing ( 2 ) are formed as bores.", "25 . The drive module ( 1 , 1 a ) of claim 24 , wherein at least some of the plurality of fluid openings are disposed in the axle casing ( 2 ) to align with the rolling elements ( 9 , 9 a ) in order to guide the lubricating fluid to the rolling elements ( 9 , 9 a ).", "26 . The drive module ( 1 , 1 a ) of claim 17 , wherein the shaft ( 3 ) comprises at least one fluid-conducting channels extending in the axial direction to a respective one of the at least one fluid opening.", "27 . The drive module ( 1 , 1 a ) of claim 26 , wherein the at least one fluid-conducting channel are grooves on the shaft ( 3 ).", "28 . The drive module ( 1 , 1 a ) of claim 27 , wherein the at least one fluid-conducting channel are distributed over a circumference of the shaft ( 3 ).", "29 . The drive module ( 1 , 1 a ) of claim 16 , further comprising a lubricating fluid pump, wherein the at least one fluid opening is formed by a fluid channel, at least some of which are disposed in the axle casing ( 2 ), and an external line ( 15 ) for conducting the lubricating fluid from the fluid reservoir via the lubricating fluid pump to the bearing units ( 6 , 6 a ).", "30 . The drive module ( 1 , 1 a ) of claim 16 , wherein the two bearing units ( 6 , 6 a ) each comprise at least one bypass channel forming a fluidic connection from the respective one of the two bearing units ( 6 , 6 a ) to the interior space ( 11 ).", "31 . The drive module ( 1 , 1 a ) of claim 30 , wherein the at least one bypass channel is arranged, in each case, opposite the respective fluid openings in the axial direction."], "bibtex": "@patent{20240190175,\n    title = {Drive Module for a Motor Vehicle},\n    number = {20240190175},\n    year = {2024},\n    note = {File: US20240190175A1-20240613.XML}\n    }", "classification": "B60B3516FI"}, {"title": "APEX AXLE TRUSS SYSTEM", "doc_number": "20240190176", "filename": "US20240190176A1-20240613.XML", "abstract": "An apex axle truss system includes a first apex axle truss including a sheet of metal that has been bent to form a first substantially vertical wall, second substantially vertical wall, first angled wall, and second angled wall. The first substantially vertical wall is configured to be secured to a first lateral side of an axle housing. The second substantially vertical wall is configured to be secured to a second lateral side of the axle housing. The first angled wall is disposed between the first substantially vertical wall and the second substantially vertical wall. The second angled wall is disposed between the first angled wall and the second substantially vertical wall. The first angled wall and the second angled wall form an apex that is configured to be disposed over an upper surface of the axle housing.", "detailed_description": ["An apex axle truss system is described. An axle assembly of a vehicle may couple two wheels (e.g., two front wheels or two back wheels). The axle assembly may include a first axle shaft to couple with a first wheel (e.g., without a joint or with a joint, such as a universal joint (U-joint) or constant-velocity (CV) joint) and a second axle shaft to couple to a second wheel. A component (e.g., differential housing) may be disposed between the first axle shaft and the second axle shaft. First axle housing may surround the first axle shaft and may connect to (e.g., be welded to, plug welded to) the component (e.g., differential housing) between the first and second axle shafts on a first side of the component. Second axle housing may surround the second axle shaft and may connect to (e.g., be welded to, plug welded to) the component (e.g., differential housing) on a second side of the component. The first and second axle housings may be a tubular (e.g., cylindrical) shape that has a corresponding curved upper surface. A first coil spring bracket with a curved lower surface may interface with (e.g., be disposed on) the upper surface of the first axle housing and a second coil spring bracket (e.g., suspension bracketry) with a curved lower surface may interface with (e.g., be disposed on the upper surface of the second axle housing.", "", "The axle assembly may span from proximate a first wheel to proximate a second wheel (e.g., from a first inner C to a second inner C, etc.). The axle assembly may be used for one or more of: transmitting driving torque to the wheels; maintaining position of the wheels relative to each other and to the vehicle body; bearing the weight of the vehicle plus any cargo; providing suspension; and/or providing steering.", "", "Axle assemblies are designed for driving on even surfaces (e.g., pavement) at standard accelerations without the vehicle incurring any impacts (e.g., impacts resulting from jumping the vehicle, hitting a curb, an automobile accident, etc.). Responsive to a vehicle driving on uneven surfaces (e.g., dirt roads, washboard, rocks, potholes, off-roading), a vehicle undertaking sudden acceleration (e.g., peeling out, drag racing, etc.), a vehicle undergoing an impact (e.g., jumping the vehicle, hitting a curb, an accident), and/or the like, an axle assembly may become damaged. For example, an axle assembly may become bent, the axle housing may at least partially separate from one or more other components (e.g., the differential housing), etc. An original equipment manufacturer (OEM) axle assembly may be inherently weak for off-road activities and the like and may bend or break. A damaged axle assembly may cause a vehicle to be inoperable, may cause the occupants of the vehicle to be stranded and/or incur injury, may damage other components of the vehicle, may be costly and time-consuming to repair, and may require new parts.", "", "Conventional solutions may include welding a series of metal plates together vertically and horizontally (e.g., forming a pi-shape (7r-shape)) and then welding the welded metal plates to the axle housing to create a bridge along the axle housing. The welding of metal plates together and then to the axle housing may be time consuming and may cause additional potential failure points. Conventional trusses may not span the entire length of the axle and may only reinforce certain sections of the axle housing while other sections of the axle housing remain un-reinforced (e.g., providing a weakened area where failure may incur). Conventional solutions may including attaching the metal plates to the bottom or rear of the axle housing so as not to interfere with components that interface with the upper surface of the axle housing, such as the coil spring bracket. Metal plates attached to the bottom of the axle housing are in tension (e.g., stresses are trying to pull the plates apart) and metal plates attached to the rear of the axle housing are also partially in tension. The metal plates in tension may be weaker and have an increased thickness requirement compared to metal plates in compression. Metal plates attached to the bottom and rear of the axle housing are at least partially under the axle housing. The portion of the metal plates under the axle housing are to be a greater thickness and weight and have more welding to the axle housing to withstand impact with objects under the axle housing. The portion of the metal plates under the axle housing decreases ground clearance, thereby making off-roading more difficult.", "", "Aspects of the present disclosure address the deficiencies of conventional axle assemblies by providing an apex axle truss system. In some embodiments, the apex axle truss system includes a first apex axle truss including a first substantially vertical wall, second substantially vertical wall, first angled wall, and second angled wall. In some embodiments, the first apex axle truss includes a sheet of metal shaped (e.g., bent) to form the first substantially vertical wall, second substantially vertical wall, first angled wall, and second angled wall. The first substantially vertical wall is configured to be secured (e.g., welded) to a first lateral side of an axle housing. The second substantially vertical wall is configured to be secured to (e.g., welded to a second lateral side of the axle housing. The first angled wall is disposed between the first substantially vertical wall and the second substantially vertical wall. The second angled wall is disposed between the first angled wall and the second substantially vertical wall. The first angled wall and the second angled wall form an apex that is configured to be disposed over an upper surface of the axle housing. In some embodiments, the first apex axle truss of the apex axle truss system is sized and shaped to be disposed under a coil spring bracket disposed on the axle housing (e.g., a first portion of the coil spring bracket is disposed on the first apex axle truss and one or more second portions of the coil spring bracket interface with the axle housing).", "", "In some embodiments, the apex axle truss system includes an apex differential truss that includes a first angled wall and a second angled wall. In some embodiments, the apex differential truss includes a sheet of metal that has been bent to form the first angled wall and the second angled wall. The first angled wall includes a first distal end configured to be secured to a first portion of a differential housing. The second angled wall includes a second distal end configured to be secured to a second portion of a differential housing. In some embodiments, the apex axle truss system further includes suspension bracketry (e.g., configured to connect to one or more control arms to prevent axle housing movement) secured to an upper surface of the apex differential truss.", "", "In some embodiments, the apex axle truss system includes an apex coil spring bracket truss including a flat upper wall, a first angled wall, a first substantially vertical wall, a second angled wall, and a second substantially vertical wall. In some embodiments, the apex coil spring bracket truss includes a sheet of metal that has been bent to form the flat upper wall, the first angled wall, the first substantially vertical wall, the second angled wall, and the second substantially vertical wall. The flat upper wall is configured to be disposed over an axle housing. In some embodiments, the flat upper wall is configured to interface with a coil spring. The first angled wall is configured to be secured (e.g., welded) to a first lateral side of the axle housing. The first substantially vertical wall is disposed between the first angled wall and the flat upper wall. The second angled wall is configured to be secured (e.g., welded) to a second lateral side of the axle housing. The second substantially vertical wall is disposed between the second angled wall and the flat upper wall.", "", "Aspects of the present disclosure have advantages over conventional systems. The apex axle truss system increases the strength of an axle assembly. Responsive to the apex axle truss being a sheet of metal that has been bent, the apex axle truss system may be stronger, have less points of potential failure, and be easier to manufacture than conventional systems that are made of metal plates welded together. Responsive to the apex axle truss having an apex, the apex axle truss system may be stronger than conventional systems that have a flat upper surface welded to sidewalls (e.g., where the flat upper surface perpendicular to the sidewalls). Responsive to the apex of the apex truss being disposed on an upper surface of axle housing, the apex axle truss system is to be in compression (e.g., pushing the components of the apex axle truss system together) which is stronger than a conventional system that has a truss disposed on the bottom or rear of an axle housing (e.g., where the components would be in tension). The apex axle truss system in compression may be stronger than and/or not as thick as conventional systems that have trusses disposed on the bottom or rear of the axle housing. The apex axle truss system may span substantially the entire length of the axle assembly (e.g., including the coil spring brackets) which has an increased strength and reinforcement compared to conventional systems that have trusses that do not span substantially the entire length of the axle assembly (e.g., do not span the portion of the axle assembly corresponding to the coil spring brackets). The apex axle truss system may be less complex and may be installed with less welding, resulting in a stronger system with less potential points of failure compared to a conventional system. The apex axle truss system of the present disclosure provides the increased strength of an apex shape (e.g., without welding) and the increased strength of the apex axle truss system being in compression while still providing suspension (e.g., interfacing with coil spring bracketry).", "", "The apex axle truss system minimizes components (e.g., has no components) under the axle housing and differential housing. By minimizing components under the axle housing and differential housing, the apex axle truss system can have a smaller thicknesses, less weight, and less welding than conventional systems. By minimizing components under the axle housing and differential housing, the apex axle truss system provides greater ground clearance than conventional systems. By providing greater ground clearance, the apex axle truss system makes off-roading easier than with conventional systems.", "", "In some embodiments, the apex axle truss system provides suspension bracketry secured to the apex differential truss to better prevent axle housing movement (e.g., prevent frontward, rearward, and rotational movement of the axle assembly) than conventional systems that do not have suspension bracketry or that have a weak connection of suspension bracketry to the differential housing that is prone to breaking. The apex axle truss system provides suspension bracketry secured closer to the differential housing via the apex differential truss which provides greater clearance between the suspension bracketry and other components (e.g., oil pan) to reduce damage to the other components.", "", "The apex axle truss system may be simple to manufacture and use. The apex axle truss system may have a reduction in installation time due to less welding and may have inherent stability of the overall structure allowing lighter material thickness to be used.", "", "FIGS.1A-Billustrate views of an apex axle truss110(e.g., of an apex axle truss system), according to certain embodiments.FIG.1Ais a side view of the apex axle truss110, according to certain embodiments.FIG.1Bis a front view of the apex axle truss110, according to certain embodiments. In some embodiments, an apex axle truss system includes multiple apex axle trusses110(e.g., apex axle truss, apex differential truss, apex coil spring bracket truss, etc.). In some embodiments, the multiple apex axle trusses110run from end to end of the axle (e.g., from inner C to inner C, over the first axle housing and the second axle housing, etc.) for full axle reinforcement (e.g., when used with inner C gussets). In some embodiments, apex axle truss110extends under the coil spring bracket (e.g., under OEM coil spring bucket, apex axle truss110is welded in between the coil spring bracket and the axle housing). In some embodiments, the apex axle truss system provides an apex coil spring bracket truss (e.g., to interface with the coil spring) and/or an apex differential truss (e.g., to be disposed over the differential housing).", "", "The apex axle truss110includes an apex112that includes angled walls114A-B. The apex112is configured to be disposed over an upper surface of an axle housing (e.g., axle tube). The peaked apex shape of apex112provides more rigidity than a flat top truss.", "", "In some embodiments, the apex axle truss110includes a vertical wall120A configured to be secured (e.g., welded) to a first lateral side of the axle housing and a second substantially vertical wall120B configured to secured (e.g., welded) to a second lateral side of the axle housing. The angled wall114A is disposed between the vertical wall120A and the angled wall114B. The angled wall114B is disposed between the angled wall114A and the vertical wall120B. As used in the present disclosure, a vertical wall refers to a wall that is substantially vertical. In some embodiments, a vertical wall is in a plane that is at about 90 degrees from a horizontal plane. In some embodiments, a vertical wall is in a plane that is about 80 degrees from a horizontal plane. In some embodiments, a vertical wall is in a plane that is about 85 degrees from a horizontal plane. In some embodiments, the vertical wall is in a plane that is 85-95 degrees from a horizontal plane. In some embodiments, the vertical wall is in a plane that is 80-100 degrees from a horizontal plane.", "", "In some embodiments, the apex axle truss110includes a sheet of metal that has been shaped (e.g., bent, folded, machined, molded, etc.) for form an apex112. In some examples, the sheet of metal has a bend line116A between the vertical wall120A and the angled wall114A, has a bend line116B between the angled wall114A and the angled wall114B, and has a bend line116C between the angled wall114B and vertical wall120B. In some embodiments, bend lines116A and116C are substantially in the same horizontal plane and the bend line116B is in a vertical plane that is substantially perpendicular to the horizontal plane. In some embodiments, bend lines116A-C are parallel to each other.", "", "In some embodiments, the apex axle truss110is made of a single sheet of metal. The formed single-piece construction has higher strength than welded three-piece construction and is faster to install and has less warping due to less heat from welding. In some embodiments, the apex axle truss110includes two or more sheets of metal that have been joined together.", "", "In some embodiments, vertical wall120A and/or vertical wall120B forms one or more corresponding openings122. In some embodiments, vertical wall120A includes a conical feature124A that forms an opening122(e.g., dimpled hole). In some embodiments, the openings122in the sheet of metal are pressed in a cone shape using a dimple die for more strength. The opening112A (e.g., dimpled hole) pushes material into a conical shape (e.g., conical feature124A, hollow conical frustum, truncated hollow right circular cone, etc.) that thickens the material for extra rigidity.", "", "Angled wall114A has a perimeter including bend line116A, lateral end118A, bend line116B, and lateral end118B. Angled wall114B has a perimeter including bend line116C, lateral end118C, bend line116B, and lateral end118D.", "", "Vertical wall120A has a perimeter including bend line116A, lateral end128A, distal end130A, and lateral end128B. Vertical wall120A has a perimeter including bend line116C, lateral end129C, distal end130B, and lateral end128D.", "", "In some embodiments, one or more of distal ends130A-B, lateral ends118A-D, and/or lateral ends128A-D has one or more cut-outs132. In some embodiments, the apex axle truss110includes cut-outs132(e.g., cut-out contour) around one or more features of the axle assembly, such as OEM coil spring bracket, OEM center axle disconnect (CAD) or front axle disconnect (FAD) casting, OEM upper control arm bracket, OEM differential (e.g., differential housing, differential casting), and/or the like.", "", "In some embodiments, one or more of distal ends130A-B, lateral ends118A-D, and/or lateral ends128A-D is secured (e.g., welded) to one or more other components (e.g., another apex axle truss110, an apex differential truss, an apex coil bracket truss, axle housing, differential housing, coil spring bracket, inner c gusset, etc.). In some examples, distal end130A, lateral end128A, and/or lateral end128B is welded to a first lateral side of the axle housing and distal end130B, lateral end128C, and/or lateral end128D is welded to a second lateral side of the axle housing. In some embodiments, only distal end130A and distal end130B are welded to the axle housing. In some examples, one or more of lateral ends118A,118C,128A, and/or128C are interlocked with and/or welded to a second apex axle truss and/or one or more of lateral ends118B,118D,128B, and/or128D are interlocked with and/or welded to a third apex axle truss.", "", "FIGS.2A-Gillustrate a system200including an apex axle truss system202and an axle assembly220, according to certain embodiments. In some embodiments, features inFIGS.2A-Gwith similar numbering as those ofFIG.1Aand/orFIG.1Bhave the same or similar structure and/or functionalities as those ofFIG.1Aand/orFIG.1B.", "", "FIG.2Ais an exploded front view of the system200, according to certain embodiments.FIG.2Bis an assembled front view of the system200, according to certain embodiments.FIG.2Cis an exploded perspective view of the system200, according to certain embodiments.FIG.2Dis an assembled perspective view of the system200, according to certain embodiments.", "", "Axle assembly220includes one or more components. In some embodiments, axle assembly220includes axle housing222A-C, axles (e.g., axle shafts) disposed in the axle housing222A-C, differential housing224attached to the axle housing222, differential (not shown) disposed in the differential housing224, coil spring brackets226A-B disposed on the axle housing222, inner C228A-B attached to the axle housing222, suspension bracketry (e.g., upper control arm (UCA) bracket230A-B), and/or the like. In some embodiments, the axle assembly220further includes a center axle disconnect (CAD) or front axle disconnect (FAD) housing232connected to the axle housing222.", "", "In some embodiments, a first axle (e.g., axle shaft) extends from the inner C228A to the differential in the differential housing224and a second axle (e.g., axle shaft) extends from the inner C228B to the differential disposed in the differential housing224.", "", "In some embodiments, the first axle extends from the inner C228A through axle housing222A to differential housing224. In some embodiments, the first axle extends from the inner C228A through axle housing222A to CAD or FAD housing230to axle housing222C to differential housing224. The second axle extends from the inner C228B through axle housing222B to the differential housing224. In some embodiments, one or more first axles extend from the inner C228A to the differential and/or one or more first axles extend from the differential to the inner C228B. In some examples, a first axle extends from the inner C228A to the CAD or FAD housing232, a second axle extends from the CAD or FAD housing232to the differential housing224.", "", "The axle housing222(e.g., axle tube) is cylindrical and is configured to prevent damage to the axles. In some embodiments, the axle housing222A is secured (e.g., welded) to the inner C228A and the differential housing224. In some embodiments, the axle housing222A is secured (e.g., welded) to the inner C228A and the CAD or FAD housing232and the axle housing222B is secured (e.g., welded) to the CAD or FAD housing232and the differential housing224. The axle housing22B is secured (e.g., welded) to the differential housing224and the inner C228B. The coil spring bracket226A is disposed on (e.g., secured to, welded to, etc.) the axle housing222A. The coil spring bracket226B is disposed on (e.g., secured to, welded to, etc.) the axle housing222B.", "", "The axle may extend through the axle housing222and inner C228(e.g., axle knuckle, inner knuckle, etc.) to couple to a joint, such as a universal joint (U-joint), a constant-velocity (CV) joint, and/or the like. In some embodiments, the inner C228is the final outer piece of the axle assembly220. Beyond the inner C228are moving pieces (e.g., U-joint, CV joint, etc.) which may not be strengthened by the apex axle truss system202.", "", "The coil spring bracket226(e.g., coil spring bucket) has a cylindrical protrusion attached to the upper surface of the coil spring bracket226. The cylindrical protrusion centers the coil spring on the coil spring bracket226. The coil spring bracket may have one or more rounded features shaped to interface with the rounded upper surface of the axle housing222.", "", "In some embodiments, the axle assembly220includes an axle disconnect system (e.g., CAD system or a FAD system) housed by the CAD or FAD housing230(e.g., CAD or FAD casting). An axle disconnect system may be used in front drive axles on four wheel drive vehicles, where the axle shaft is split into a first piece connected to the differential and a second piece connected to the wheel. The axle disconnect system engages the axle by connecting the two split axle shafts. In some embodiments, the CAD or FAD housing230is made of cast iron or cast steel.", "", "The differential housing224(e.g., differential casting) houses a gear train that is coupled to the drive shaft and the axles. The differential may drive a pair of wheels (e.g., via the axles) while allowing them to rotate at different speeds.", "", "Certain movements of the components of the axle assembly220cause damage to the axle assembly220and may cause damage to the vehicle and/or users (e.g., driver and passengers). For example, if the axle assembly220were to move forward, backward, or rotate, damage may occur. Suspension bracketry (e.g., UCA bracket230) is used to prevent certain movement of the axle assembly220. The UCA bracket230A is secured to (e.g., integral to, welded to, etc.) the differential housing224. In some embodiments, the UCA bracket230A is secured to (e.g., integral to, welded to, etc.) the CAD or FAD housing230. The UCA brackets230A-B are configured to connect to one or more control arms to prevent axle housing movement (e.g., prevent frontward movement, rearward movement, rotation, etc. of the axle assembly220). The one or more control arms are configured to connect to brackets on a vehicle frame.", "", "The apex axle truss system202reinforces and prevents damage to axle assemblies220, including current axle assemblies (e.g., OEM front axle, OEM rear axle, etc.), custom axle assemblies, and future axle assemblies. The apex axle truss system202reinforces the axle assembly220to withstand forces resulting from driving on uneven surfaces, sudden acceleration, impact, and/or the like.", "", "The apex axle truss system202includes one or more apex axle trusses210(e.g., apex axle truss110ofFIG.1). In some embodiments, the apex axle truss system202includes apex axle trusses210A-E (hereinafter apex axle trusses210) that span from a first distal end of the axle assembly220(e.g., proximate a first wheel, the inner C228A) to a second distal end of the axle assembly220(e.g., proximate a second wheel, the inner C228B). In some embodiments, the apex axle trusses210are shaped to interlock with each other. The apex axle trusses210are configured to be secured (e.g., welded) to the axle housing222. The apex axle trusses210may be welded to each other. One or more of the apex axle trusses210are configured to be secured (e.g., welded) to one or more components of the axle assembly220(e.g., differential housing224disposed between the axle housing222A or222C and the axle housing222B).", "", "In some embodiments, each apex axle truss210is a sheet of metal that has been bent to form a first substantially vertical wall (e.g., vertical wall120A ofFIGS.1A-B), a second substantially vertical wall (e.g., vertical wall120B ofFIG.1A), and two or more walls (e.g., angled walls114A-B ofFIG.1A) between the first substantially vertical wall and the second substantially vertical wall. For example, an apex axle truss210may have three bends (e.g., bend lines116A-C ofFIG.1A) forming a first substantially vertical wall, a second substantially vertical wall, a first angled wall (e.g., angled wall114A ofFIG.1A), and a second angled wall (e.g., angled wall114B ofFIG.1), where the first angled wall and second angled wall form an apex (e.g., apex112ofFIGS.1A-B). A first bend (e.g., bend line116A ofFIGS.1A-B) may be between the first substantially vertical wall and the first angled wall, a second bend (e.g., bend line116B ofFIGS.1A-B) may be between the first angled wall and the second angled wall, and a third bend (e.g., bend line116C ofFIG.1A) may be between the second angled wall and the second substantially vertical wall. Each of the bends may be parallel to each other. In some embodiments, the apex axle truss210may include greater than three bends forming first and second substantially vertical walls and greater than two angled walls disposed between the first and second substantially vertical walls, wherein the greater than two angled walls form a multi-point apex.", "", "One example of an apex axle truss system202is shown inFIGS.2A-D. The apex axle truss system202may be shaped and sized for different types of axle assemblies220. For example, an apex axle truss system202may be shaped and sized for a front axle assembly, a rear axle assembly, axle assemblies of a sport utility vehicle (SUV), axle assemblies of a truck, axle assemblies of a semi-trailer truck, axle assemblies of construction vehicles, axle assemblies of farming vehicles, axle assemblies of muscle vehicles, axle assemblies of racing vehicles, axle assemblies of off-roading vehicles, axle assemblies of front-wheel drive vehicles, axle assemblies of rear-wheel drive vehicles, axle assemblies of four-wheel or all-wheel drive vehicles, axle assemblies of taller vehicles, axle assemblies of vehicles with after-market wheels that are larger than the original wheels, and/or the like.", "", "Metal material (e.g., sheet of metal) may be cut into a shape and bent so as to have four or more sides (e.g., three or more bends all parallel to each other, bend lines116A-C ofFIG.1A, etc.) creating two vertical surfaces on opposite sides with a taller section in the middle. The design of the structure height, width, length, and clearance cutouts (e.g., cut-outs132ofFIG.1B) can all be adjusted independently so as to accommodate different sizes of drive axles (e.g., axle assemblies220). The overall length of the apex axle truss system202may be designed so as to span from one side of the (e.g., axle assembly220(e.g., drive axle) over the center differential section (e.g., differential housing224) to the other side of the axle assembly220. The truss structure of the apex axle trusses210the apex axle truss system202may then be placed on the axle assembly220(e.g., drive axle) and welded to each side of the axle housing222(e.g., axle tube) at or above the midpoint of the axle tube. The overall shape of the apex axle truss system202provides increased stability, better ground clearance under the vehicle, and ease of installation which in turn provides greater value to the user.", "", "Conventionally, one or more components may interface with an upper surface of the axle housing. For example, a coil spring bracket226(e.g., conventional coil spring bracket, new coil spring bracket) may have a curved lower surface that is sized and shaped to interface with a curved upper surface of the axle housing222. The apex axle trusses210have an angled upper surface (e.g., an apex upper surface).", "", "In some embodiments, the apex axle truss system202may include a coil spring bracket226that has an angled lower surface (e.g., reverse apex upper surface) that is sized and shaped to interface with the apex axle truss210.", "", "In some embodiments, the apex axle truss system202may form one or more slots (e.g., slot cut into the apex axle truss210, slot formed by two interlocking apex axle trusses210) for receiving the coil spring bracket226. The slot may be located and sized in the apex axle truss system202to positively locate the coil spring bracket226in relation to the apex axle truss210. The coil spring bracket226may have a curved lower surface (e.g., sized and shaped to interface with an upper surface of the axle housing222) that enters through a slot in the apex axle truss system202(e.g., apex axle truss210, etc.) to interface with the curved upper surface of the axle housing222.", "", "In some embodiments, the apex axle trusses210span across the axle assembly220, leaving a slot above the upper surface of the axle housing222and that is between a first apex axle truss210and a second apex axle truss210to receive a curved surface of the coil spring bracket226to interface with an upper surface of the axle housing222. For example, apex axle trusses210A-B are sized and shaped to receive a portion of the corresponding coil spring bracket226A and apex axle trusses210D-E are sized and shaped to receive a portion of the corresponding coil spring bracket. Apex axle truss210A may be sized and shaped to extend under the corresponding coil spring bracket226A and the apex axle truss210E may be sized and shaped to extend under the corresponding coil spring bracket226B.", "", "In some embodiments, the coil spring bracket226is coupled to (e.g., welded to) one or more apex axle trusses210and/or the axle housing222.", "", "In some embodiments, an apex axle truss system202including the apex axle trusses210and coil spring brackets226may be part of a kit to be attached to the axle assembly220of an existing vehicle. In some embodiments, the coil spring bracket226(under which an apex axle truss210is to be disposed) is OEM. In some embodiments, the coil spring bracket226(under which an apex axle truss210is disposed) is custom made.", "", "The apex axle truss system202may be configured to interface with other components in addition to or instead of coil spring brackets226(e.g., portions of the CAD or FAD housing, suspension bracketry, such as UCA bracket230, etc.). The apex axle trusses210may be sized and shaped (e.g., have cut-outs132ofFIG.1B) to go around existing portions of the axle assembly220.", "", "In some embodiments, the apex axle trusses210may be made of ¼-inch thick mild steel. In some embodiments, the apex axle trusses210may be made of 3/16-inch thick mild steel. In some embodiments, the apex axle trusses210may be made of ⅛-inch thick mild steel. In some embodiments, the apex axle trusses210are thinner than (e.g., have about half the thickness of) conventional trusses while providing the same or greater reinforcement to the axle assembly220. In some embodiments, one or more portions of the apex axle truss system202has a thickness (e.g., thickness of the sheet of metal) that is about 0.25 inches. In some embodiments, one or more portions of the apex axle truss system202has a thickness (e.g., thickness of the sheet of metal) that is about 0.1875 inches In some embodiments, one or more portions of the apex axle truss system202has a thickness (e.g., thickness of the sheet of metal) that is about 0.125 inches In some embodiments, one or more portions of the apex axle truss system202has a thickness (e.g., thickness of the sheet of metal) that is about 0.120 inches. In some embodiments, one or more portions of the apex axle truss system202has a thickness (e.g., thickness of the sheet of metal) that is about 0.1 to 0.2 inches. In some embodiments, one or more portions of the apex axle truss system202has a thickness (e.g., thickness of the sheet of metal) that is about 0.2 to 0.3 inches. In some embodiments, one or more portions of the apex axle truss system202has a thickness (e.g., thickness of the sheet of metal) that is about 0.3 to 0.5 inches.", "", "In some embodiments, an apex axle truss system202may be installed both on top of the axle assembly220(e.g., as shown inFIGS.2A-D) and on the bottom of the axle assembly220(e.g., similar to the apex axle truss system202shown inFIGS.2A-Dbut on the bottom surface of the axle assembly220). For an axle assembly220that includes an apex axle truss system202on top and on bottom of the axle assembly220, a thinner thickness of metal for the apex axle trusses210may be used and/or a metal of a lower strength may be used.", "", "FIGS.2E-Hillustrate views of coil spring bracket226, apex axle truss210, and axle housing222of a system200, according to certain embodiments.FIG.2Eis an exploded front view of the coil spring bracket226, apex axle truss210, and axle housing222of system200.FIG.2Fis an assembled front view of the coil spring bracket226mounted on the axle housing over the apex axle truss210of system200.FIG.2Gis an exploded perspective view of the coil spring bracket226, apex axle truss210, and axle housing222of system200.FIG.2His an assembled perspective view of the coil spring bracket226mounted on the axle housing over the apex axle truss210of system200.", "", "The apex axle truss210may extend under the coil spring bracket226. Conventional truss designs do not extend under the coil spring bracket, creating a stress point under the coil spring bracket where the axle housing is not reinforced and results in failure of the axle assembly. The apex axle truss system202extends under the coil spring bracket226, thus providing full reinforcement end-to-end of the axle. In some embodiments, the apex axle truss210is welded in between the coil spring bracket226and the axle housing222.", "", "FIGS.3A-Dillustrate an apex axle truss310of an apex axle truss system302of system300, according to certain embodiments.FIG.3Aillustrates the apex differential truss310, according to certain embodiments.FIG.3Billustrates an assembled perspective view of a system300including an apex axle truss system302and an axle assembly320, according to certain embodiments.FIG.3Cillustrates an exploded front view of a system300including an apex axle truss system302and an axle assembly320, according to certain embodiments.FIG.3Dillustrates an assembled front view of a system300including an apex axle truss system302and an axle assembly320, according to certain embodiments. Features with similar reference numbers as those in one or more ofFIGS.1A-2Gmay have the same or similar structure or function as those described in conjunction with one or more ofFIGS.1A-2G.", "", "In some embodiments, apex axle truss310(e.g., apex differential truss) is configured to be disposed over at least a portion of axle housing322A-B (e.g., axle housing222A-B ofFIGS.2A-G) and at least a portion of differential housing324(e.g., differential housing224A-B ofFIGS.2A-D). In some embodiments, apex axle truss310is referred to as an apex differential truss. In some embodiments, apex axle truss310is configured to secure (e.g., weld) to one or more portions of axle housing322A-B and differential housing324. In some embodiments, apex axle truss310is configured to be disposed adjacent to, interlock with, secure (e.g., weld) to, and/or the like one or more apex axle trusses (e.g., one or more apex axle trusses210ofFIGS.2A-G).", "", "Apex axle truss310includes one or more sheets of metal that have been bent to form a flat upper wall350and angled walls314A-D (e.g., angled walls114ofFIGS.1A-B). The angled walls314A-D form apex312(e.g., apex112ofFIGS.1A-B). In some embodiments, the one or more sheets of metal of apex axle truss310have further been bent to form vertical walls340A-D (e.g., vertical walls120ofFIGS.1A-B). In some embodiments, one or more of angled walls314A-D, flat upper wall350, and/or vertical walls340A-D form openings342(e.g., opening122A ofFIG.1B) and/or cut-outs344(e.g., cut-outs132A-B ofFIG.1B).", "", "In some one or more of the angled walls314A-D and/or vertical walls340A-D are configured to be secured (e.g., welded) to the differential housing324and/or the axle housing322A-B.", "", "In some embodiments, a suspension bracketry (e.g., UCA bracket230A ofFIGS.2A-D) is secured to (e.g., welded to, integral to, fastened to, etc.) an upper surface of the flat upper wall350. The suspension bracketry is configured to connect one or more control arms to prevent axle housing movement (e.g., prevent frontward movement, rearward movement, and/or rotation). The control arms are configured to connect to brackets on the vehicle (e.g., vehicle frame).", "", "In some embodiments, the suspension bracketry is more securely attached to (e.g., less likely to disengage from) the apex axle truss310of system300than in conventional systems (e.g., mounting the suspension bracketry directly to the differential housing). In some embodiments, suspension bracketry secured to the upper surface of the flat upper wall350provides more clearance from vehicle components (e.g., oil pan) and is less likely to cause damage than conventional systems.", "", "FIGS.4A-Jillustrate an apex axle truss system402of a system400, according to certain embodiments. Features with similar reference numbers as those in one or more ofFIGS.1A-3Dmay have the same or similar structure or function as those described in conjunction with one or more ofFIGS.1A-3D.", "", "FIG.4Aillustrates a front perspective view of the apex axle truss system402, according to certain embodiments. The system400includes an apex axle truss system402including an apex axle truss410(e.g., apex differential truss, apex axle truss310ofFIGS.3A-D) and apex coil spring bracket trusses426A-B. The apex axle truss410is configured to be placed adjacent to, interlock with, and/or secure (e.g., weld, fasten, etc.) to the apex coil spring bracket trusses426A-B.", "", "The apex axle truss410is similar to the apex axle truss310ofFIGS.3A-D. The apex axle truss410includes a flat upper wall450and angled walls414A-D forming apex412A-B. In some embodiments, apex axle truss410includes vertical walls440A-D. The apex axle truss410(e.g., one or more vertical walls440A-D) include one or more openings442and one or more cut-outs.", "", "In some embodiments, the apex axle truss410includes a triangular wall452that has a three-sided perimeter. The first side of the three-sided perimeter borders angled wall414C, the second side of the three-sided perimeter borders angled wall414D, and the third side of the three-sided perimeter is configured to be secured to the flat upper wall460of the apex coil spring bracket truss426B.", "", "The apex coil spring bracket truss426includes a flat upper wall460, angled walls462A-B, and vertical walls464A-B. The flat upper wall460is configured to be disposed over the axle housing422. The angled wall462A angled towards and configured to be secured (e.g., welded) to a first lateral side of the axle housing422. The vertical wall464A is disposed between the angled wall462A and the flat upper wall460. The angled wall462B angled towards and configured to be secured (e.g., welded) to a second lateral side of the axle housing422. The vertical wall464B is disposed between the angled wall462B and the flat upper wall460. In some embodiments, the flat upper wall460forms one or more openings466. The flat upper wall460is to be secured (e.g., welded) to an upper surface of the axle housing422via the one or more openings466.", "", "In some embodiments, a cylindrical structure468is disposed on an upper surface of the flat upper wall460(e.g., secured to the flat upper wall460via one or more openings466of the flat upper wall460). The cylindrical structure468is configured to locate a coil spring on the apex coil spring bracket truss426(e.g., on the flat upper wall460). The apex coil spring bracket truss426A and426B may be substantially identical.", "", "One or more components (e.g., brackets, skids, etc.) may be secured to the apex coil spring bracket truss426A and/or426B.", "", "The apex412A-B of the apex axle truss410strengthens the apex axle truss410. In some embodiments, suspension bracketry is secured to the flat upper wall450of the apex axle truss410e.g., providing greater strength than suspension bracketry in conventional systems). The triangular walls452A-B provides greater strength (e.g., distributes load) between the apex axle truss410and the apex coil spring bracket trusses426A-B to prevent weak portions in the end-to-end apex axle truss system402.", "", "The apex coil spring bracket truss426being secured (e.g., welded) to the axle housing422via angled walls462A-B and openings466of the flat upper wall460strengthens the apex coil spring bracket truss426(e.g., distributing the load between three points of attaching, distributing the load via the angled walls462A-B).", "", "In some embodiments, the bottom portion of one or more of the vertical walls440of the apex axle truss410have angled walls444(e.g., that are substantially similar to the vertical walls464of the apex coil spring bracket truss426). In some embodiments, the apex axle truss410is secured (e.g., welded) to the axle housing422via angled walls444A-D. Being secured to the axle housing422via angled walls444A-D strengthens the apex axle truss410(e.g., distributing the load via the angled walls444A-D).", "", "In some embodiments, one or more of the triangular wall452A-B, vertical walls440A-D, and/or angled wall444A-D of the apex axle truss410is secured (e.g., welded) to one or more of the flat upper wall460, vertical walls464A-B, and/or angled walls462A-B of the apex coil spring bracket trusses426A-B.", "", "In some embodiments, each of the angled walls462are at about a 45-degree angle from the plane of the corresponding vertical wall464. In some embodiments, each of the angled walls444are at about a 45-degree angle from the plane of the corresponding vertical wall440.", "", "FIGS.4B-Cillustrate views of the apex coil spring bracket truss426, according to certain embodiments.FIG.4Billustrates a front perspective view of the apex coil spring bracket truss426andFIG.4Cillustrates a side view of the apex coil spring bracket truss426. The openings466, cut-outs, and/or slots can be used to one or more of secure a cylindrical structure468to the flat upper wall460, secure (e.g., via welding) the flat upper wall460to the upper surface of the axle housing422, secure to (e.g., weld to, interlock with, fasten to) one or more components (e.g., bracketry, skids, apex axle truss410, etc.), and/or the like. In some embodiments, the flat upper wall460has one or more protrusions to secure to (e.g., weld to, interlock with, fasten to) one or more components (e.g., bracketry, skids, apex axle truss410, etc.).", "", "The apex coil spring bracket trusses426(e.g., apex coil buckets) are configured to secure (e.g., weld) to the axle housing422by adding two peaks (e.g., via the angled walls462A-B) at opposing 45 degrees instead of directly above. The apex coil spring bracket trusses426also connect to different brackets in different orientations (e.g., all needed brackets in needed orientations). The coil spring sits directly on top of the apex coil spring bracket truss426. The apex coil spring bracket truss426can rotate independently of apex axle truss system402for fine tuning of the suspension geometry. In some examples, the apex coil spring bracket truss426is rotated around the axle housing422to a desired orientation before securing (e.g., welding) to the axle housing422.", "", "FIGS.4D-Gillustrates views of the apex coil spring bracket truss426, according to certain embodiments.FIG.4Dillustrates a front perspective view,FIG.4Eillustrates a front view,FIG.4Fillustrates a top view, andFIG.4Gillustrates a side view of the apex coil spring bracket truss426, according to certain embodiments.", "", "FIG.4Hillustrates an exploded front view of a system400including an apex axle truss system402and an axle assembly420, according to certain embodiments.FIG.4Iillustrates an assembled front view of a system400including an apex axle truss system402and an axle assembly420, according to certain embodiments.FIG.4Jillustrates an assembled rear perspective view of a system400including an apex axle truss system402and an axle assembly420, according to certain embodiments.", "", "FIGS.5A-Jillustrate an apex axle truss system502of a system500, according to certain embodiments. Features with similar reference numbers as those in one or more ofFIGS.1A-4Jmay have the same or similar structure or function as those described in conjunction with one or more ofFIGS.1A-4J.", "", "FIGS.5A-Cillustrate a front perspective view of an apex axle truss system502, according to certain embodiments.", "", "The apex axle truss system502includes apex axle trusses510A-E (e.g., one or more of apex axle truss110ofFIG.1, apex axle truss210ofFIGS.2A-G, apex axle truss310ofFIGS.3A-D, apex axle truss410ofFIGS.4A and4H-J). The apex axle truss system502further includes coil spring brackets526A-B and one or more brackets528.", "", "In some embodiments, apex axle truss510A is configured to be disposed on the axle housing522A under coil spring bracket526A and apex axle truss510E is configured to be disposed on the axle housing522B under coil spring bracket526B. In some embodiments, apex axle trusses510A and510E have a lower profile than the apex axle truss510B. In some embodiments, the apex axle truss510B has substantially the same height of apex axle truss510A (e.g., at a first distal end of apex axle truss510B proximate the apex axle truss510), slopes to a taller height, and substantially maintains the taller height (e.g., until the second distal end proximate the apex axle truss510C. The apex axle trusses510A-B are disposed over the axle housing522A, the apex axle truss510C is disposed over the differential housing524, and the apex axle truss510D is disposed over the axle housing522B.", "", "In some embodiments, the apex axle truss510C is referred to as an apex differential truss. The apex axle truss510C includes one or more angled walls514A and one or more second angled walls514B, where the angled walls514A-B form one or more apex512. In some embodiments, the apex axle truss510C includes a sheet of metal that has been bent to form the angled walls514A and the angled walls514B. One or more of the angled walls514A have a corresponding distal end configured to be secured (e.g., welded) to a corresponding portion of the differential housing524and one or more of the angled walls514B have a corresponding distal end configured to be secured (e.g., welded) to a corresponding portion of the differential housing524.", "", "In some embodiments, the apex axle trusses510are configured to be secured to (e.g., welded to, fastened to, interlocked with) each other.", "", "In some embodiments, the apex axle truss system502includes a bracket528(e.g., suspension bracketry) secured (e.g., integral, welded, fastened, etc.) to an upper surface of one or more of the apex axle trusses510. In some embodiments, the apex axle truss510C secures a bracket528A proximate to the surface of the differential housing524. In some embodiments, the brackets528are at substantially the same height. In some embodiments, one or more of the brackets528are used to connect to one or more control arms to prevent axle housing movement (e.g., prevent frontward movement, rearward movement, rotation, etc.).", "", "The apex axle truss510D extends under the coil spring bracket526B to strengthen the junction between the axle housing522B and the differential housing524(e.g., differential casting).", "", "FIG.5D-Fillustrate views of a system500including an apex axle truss system502and an axle assembly520, according to certain embodiments.FIG.5Dillustrates an exploded front view,FIG.5Eillustrates an assembled front view, andFIG.5Fillustrates an assembled perspective view of a system500including an apex axle truss system502and an axle assembly520, according to certain embodiments.", "", "FIG.5G-Jillustrate views of a system500including an apex axle truss system502and an axle assembly520, according to certain embodiments.FIG.5Gillustrates a front view,FIG.5Hillustrates a rear view,FIG.5Iillustrates a perspective rear view, andFIG.5Jillustrates a top view of a system500including an apex axle truss system502and an axle assembly520, according to certain embodiments.", "", "The apex axle truss510C (e.g., apex differential top cap) conforms to the shape of the differential housings524(e.g., OEM differential castings) using a series of bends. This allows the apex axle truss510C to sit directly on the differential housing524tightly to be secured (e.g., welded) directly to the differential housing524. Since the apex axle truss510C is so tight to the differential housing524, this allows the bracket528A (e.g., UCA bracket) to be mounted as low as physically possible which maintains close to factory suspension geometry which improves ride quality and off-road performance. Welding the bracket528A to the apex axle truss510C instead of the differential housing524(e.g., casting) is far stronger because the bracket528A and the apex axle truss510C are similar or the same type of materials and spreads the load to the apex axle truss510C instead of the localized weld on the differential housing524. Securing the bracket528A to the apex axle truss510C ties the bracket528A to the other components of the apex axle truss system502(e.g., other apex axle trusses510, coil spring bracket526, etc.) and ties both sides of the differential housing524together for extra strength.", "", "Any of the features, embodiments, functionalities ofFIGS.1A-5Jmay be used in conjunction with each other. Similar features in different embodiments may have the same or similar structure, advantages, and/or functionalities as similar features in other embodiments.", "", "The above description of illustrated implementations of the disclosure, including what is described in the Abstract, is not intended to be exhaustive or to limit the disclosure to the precise forms disclosed. While specific implementations of, and examples for, the disclosure are described herein for illustrative purposes, various equivalent modifications are possible within the scope of the disclosure, as those skilled in the relevant art will recognize.", "", "Various operations are described as multiple discrete operations, in turn, in a manner that is most helpful in understanding the present disclosure, however, the order of description should not be construed to imply that these operations are necessarily order dependent. In particular, these operations need not be performed in the order of presentation.", "", "The terms “over,” “under,” “between,” “disposed on,” and “on” as used herein refer to a relative position of one material layer or component with respect to other layers or components. For example, one layer disposed on, over, or under another layer may be directly in contact with the other layer or may have one or more intervening layers. Moreover, one layer disposed between two layers may be directly in contact with the two layers or may have one or more intervening layers. Similarly, unless explicitly stated otherwise, one feature disposed between two features may be in direct contact with the adjacent features or may have one or more intervening layers.", "", "Various embodiments can have different combinations of the structural features described above. For instance, all optional features of apex axle truss systems described above can also be implemented in an apex axle truss system and specifics in the examples can be used anywhere in one or more embodiments.", "", "While the present disclosure has been described with respect to a limited number of embodiments, those skilled in the art will appreciate numerous modifications and variations therefrom. It is intended that the appended claims cover all such modifications and variations as fall within the true spirit and scope of this present disclosure.", "", "In the description herein, numerous specific details are set forth, such as examples of specific types of material, specific sizes, specific surfaces, specific structures, specific details, specific configurations, specific types, specific system components, specific operations, etc. in order to provide a thorough understanding of the present disclosure. It will be apparent, however, to one skilled in the art that these specific details need not be employed to practice the present disclosure. In other instances, well known components or methods, such as specific and alternative material, sizes, surfaces, structures, details, configurations, types, system components, operations, etc. have not been described in detail in order to avoid unnecessarily obscuring the present disclosure.", "", "Although some of the embodiments herein are described with reference to an axle assembly of a vehicle, other embodiments are applicable to other types of structures and surfaces. Similar techniques and teachings of embodiments of the present disclosure can be applied to other types of structures and surfaces that can benefit from strengthening a system. In addition, the description herein provides examples, and the accompanying drawings show various examples for the purposes of illustration. However, these examples should not be construed in a limiting sense as they are merely intended to provide examples of embodiments of the present disclosure rather than to provide an exhaustive list of all possible implementations of embodiments of the present disclosure.", "", "As used herein, the terms “substantially,” “about,” and/or the like, in some embodiments refer to a range of 2% greater and 2% less, in some embodiments refer to a range of 5% greater and 5% less, in some embodiments refer to a range of 10% greater and 10% less, in some embodiments refer to a range of 15% greater and 15% less, and in some embodiments refer to a range of 20% greater and 20% less,", "", "Use of the phrase ‘configured to,’ in one embodiment, refers to arranging, putting together, manufacturing, offering to sell, importing and/or designing an apparatus, hardware, logic, or element to perform a designated or determined task. In this example, an apparatus or element thereof that is not operating is still ‘configured to’ perform a designated task if it is designed, coupled, and/or interconnected to perform said designated task.", "", "Furthermore, use of the phrases ‘to,’ ‘capable of/to,’ and or ‘operable to,’ in one embodiment, refers to some apparatus, hardware, and/or element designed in such a way to enable use of the apparatus, hardware, and/or element in a specified manner. Note that use of to, capable to, or operable to, in one embodiment, refers to the latent state of an apparatus, hardware, and/or element, where the apparatus, hardware, and/or element is not operating but is designed in such a manner to enable use of an apparatus in a specified manner.", "", "Reference throughout this specification to “one embodiment” or “an embodiment” means that a particular feature, structure, or characteristic described in connection with the embodiment is included in at least one embodiment of the present disclosure. Thus, the appearances of the phrases “in one embodiment” or “in an embodiment” in various places throughout this specification are not necessarily all referring to the same embodiment. Furthermore, the particular features, structures, or characteristics can be combined in any suitable manner in one or more embodiments.", "", "In the foregoing specification, a detailed description has been given with reference to specific exemplary embodiments. It will, however, be evident that various modifications and changes can be made thereto without departing from the broader spirit and scope of the disclosure as set forth in the appended claims. The specification and drawings are, accordingly, to be regarded in an illustrative sense rather than a restrictive sense. Furthermore, the foregoing use of embodiment and other exemplarily language does not necessarily refer to the same embodiment or the same example, but can refer to different and distinct embodiments, as well as potentially the same embodiment.", "", "The words “example” or “exemplary” are used herein to mean serving as an example, instance or illustration. Any aspect or design described herein as “example” or “exemplary” is not necessarily to be construed as preferred or advantageous over other aspects or designs. Rather, use of the words “example” or “exemplary” is intended to present concepts in a concrete fashion. As used in this application, the term “or” is intended to mean an inclusive “or” rather than an exclusive “or.” That is, unless specified otherwise, or clear from context, “X includes A or B” is intended to mean any of the natural inclusive permutations. That is, if X includes A; X includes B; or X includes both A and B, then “X includes A or B” is satisfied under any of the foregoing instances. In addition, the articles “a” and “an” as used in this application and the appended claims should generally be construed to mean “one or more” unless specified otherwise or clear from context to be directed to a singular form. Moreover, use of the term “an embodiment” or “one embodiment” or “an implementation” or “one implementation” throughout is not intended to mean the same embodiment or implementation unless described as such. Also, the terms “first,” “second,” “third,” “fourth,” etc. as used herein are meant as labels to distinguish among different elements and can not necessarily have an ordinal meaning according to their numerical designation."], "claims": ["a first axle truss comprising a sheet of metal that has been bent to form: a first substantially vertical wall configured to be secured to a first lateral side of an axle housing; a second substantially vertical wall configured to be secured to a second lateral side of the axle housing; a first angled wall disposed between the first substantially vertical wall and the second substantially vertical wall, wherein a first bend line is between the first substantially vertical wall and the first angled wall; and a second angled wall disposed between the first angled wall and the second substantially vertical wall, wherein a second bend line is between the second substantially vertical wall and the second angled wall, and wherein a third bend line is between the first angled wall and the second angled wall.", "2 . The axle truss system of claim 1 , wherein the first angled wall and the second angled wall form an apex portion that is configured to be disposed above an upper surface of the axle housing.", "3 . The axle truss system of claim 1 , wherein the first axle truss is configured to be disposed above the axle housing without extending under the axle housing.", "4 . The axle truss system of claim 1 , wherein the first axle truss further comprises a substantially flat portion disposed between the first angled wall and the second angled wall.", "the first substantially vertical wall configured to be welded to the first lateral side of the axle housing; and the second substantially vertical wall configured to be welded to the second lateral side of the axle housing.", "disposed under a coil spring bracket; disposed adjacent to the coil spring bracket; or disposed over at least a portion of a differential housing, wherein the differential housing is secured to the axle housing.", "7 . The axle truss system of claim 1 , wherein the axle truss system runs from a first inner C to a second inner C.", "8 . The axle truss system of claim 1 , wherein the first axle truss is configured to interlock with a second axle truss.", "a first substantially vertical wall configured to be secured to a first lateral side of an axle housing; a second substantially vertical wall configured to be secured to a second lateral side of the axle housing; a first angled wall disposed between the first substantially vertical wall and the second substantially vertical wall, wherein a first bend line is between the first substantially vertical wall and the first angled wall; and a second angled wall disposed between the first angled wall and the second substantially vertical wall, wherein a second bend line is between the second substantially vertical wall and the second angled wall, wherein a substantially horizontal wall is disposed between the first angled wall and the second angled wall.", "10 . The axle truss system of claim 9 , wherein a first axle truss comprises a sheet of metal that has been bent to form at least the first substantially vertical wall, the second substantially vertical wall, the first angled wall, and the second angled wall.", "11 . The axle truss system of claim 10 , wherein the first axle truss is configured to be disposed above the axle housing without extending under the axle housing.", "the first substantially vertical wall configured to be welded to the first lateral side of the axle housing; and the second substantially vertical wall configured to be welded to the second lateral side of the axle housing.", "13 . The axle truss system of claim 10 , wherein the first axle truss is configured to interlock with a second axle truss.", "14 . The axle truss system of claim 9 , wherein the first angled wall and the second angled wall form an apex portion that is configured to be disposed above an upper surface of the axle housing.", "a first axle truss comprising a sheet of metal that has been bent to form: a first angled wall; and a second angled wall, wherein a bend line is between the first angled wall and the second angled wall, wherein the first angled wall and the second angled wall are configured to be disposed over an upper surface of an axle housing system, wherein a first portion of the first axle truss is configured to be welded to a first side surface of the axle housing system, and wherein a second portion of the first axle truss is configured to be welded to a second side surface of the axle housing system.", "the axle truss system further comprises suspension bracketry secured to the upper surface of the first axle truss; and the suspension bracketry is configured to connect to one or more control arms to prevent axle housing system movement.", "the first angled wall and the second angled wall form an apex portion that is configured to be disposed above the upper surface of the axle housing system; and the first axle truss is configured to be disposed above the axle housing system without extending under the axle housing system.", "18 . The axle truss system of claim 15 , wherein the first axle truss further comprises a substantially flat portion disposed between the first angled wall and the second angled wall.", "the first axle truss is a differential truss; the axle housing system comprises a differential housing; and the differential truss is to be welded to the differential housing.", "a second axle truss configured to be disposed over a first axle housing of the axle housing system; and a third axle truss configured to be disposed over a second axle housing of the axle housing system, wherein the differential housing is disposed between the first axle housing and the second axle housing, and wherein the first axle truss is configured to couple to the second axle truss and the third axle truss."], "bibtex": "@patent{20240190176,\n    title = {APEX AXLE TRUSS SYSTEM},\n    number = {20240190176},\n    year = {2024},\n    note = {File: US20240190176A1-20240613.XML}\n    }", "classification": "B60B3516FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240190177", "filename": "US20240190177A1-20240613.XML", "abstract": "A pneumatic tire comprises a tread portion provided with a band layer disposed radially inside a tread rubber provided with a first circumferential groove. Cords of the band layer are a hybrid cord formed by twisting together a first filament and a second filament having an elastic modulus lower than that of the first filament. In a region radially inside the first circumferential groove, a maximum thickness t 1 of topping rubber on the radially outer side of the band cords is not more than 1.0 mm; a minimum distance d 1 from the bottom of the first circumferential groove to the radially outer surface of the band layer is not more than 2.0 mm; and a distance d 2 from a groove edge of the first circumferential groove to the radially outer surface of the band layer is not more than 15.0 mm.", "detailed_description": [""], "claims": ["the tread portion comprises a tread rubber forming a ground contacting surface, and a band layer disposed radially inside the tread rubber, the tread rubber is provided with a first circumferential groove extending continuously in the tire circumferential direction in the ground contacting surface, the band layer comprises band cords arranged substantially parallel to the tire circumferential direction, and a topping rubber covering the band cords, the band cords are a hybrid cord in which a first filament and a second filament having an elastic modulus lower than that of the first filament are twisted together, in a region radially inside the first circumferential groove, a maximum thickness t a minimum distance d a distance d", "2 . The pneumatic tire according to claim 1 , wherein the first filament and the second filament are made of organic fibers.", "3 . The pneumatic tire according to claim 2 , wherein the band cord has a total fineness of not more than 4400 dtex.", "4 . The pneumatic tire according to claim 3 , wherein a stress σ 1 of the band cord when elongated by 3% is not more than 0.03 (N/tex).", "5 . The pneumatic tire according to claim 4 , wherein a product σ 1 d 2 of the stress σ 1 (N/tex) and the distance d 2 (mm) is 0.05 to 0.40 (N·mm/tex).", "6 . The pneumatic tire according to claim 3 , wherein a stress σ 2 of the band cord when elongated by 5% is 0.04 to 0.06 (N/tex).", "7 . The pneumatic tire according to claim 6 , wherein the product σ 2 d 2 of the stress σ 2 (N/tex) and the distance d 2 (mm) is 0.30 to 0.60 (N·mm/tex).", "8 . The pneumatic tire according to claim 1 , wherein a sea ratio of the ground contacting surface of the tread portion is 15% to 50%.", "9 . The pneumatic tire according to claim 8 , wherein a ratio t 1 /d 1 (%) between the thickness t 1 and the distance d 1 is smaller than the shear ratio (%).", "10 . The pneumatic tire according to claim 1 , wherein the tread rubber includes a rubber compound having a complex elastic modulus E* 1 of not more than 10 (MPa) at 30 degrees C.", "11 . The pneumatic according to claim 10 , wherein the product d 1 ·E* 1 of the distance d 1 (mm) and the complex elastic modulus E* 1 (MPa) is 5.0 to 30.0 (MPa·mm).", "12 . The pneumatic tire according to claim 11 , wherein the product σ 2 ·E* 1 of the stress 62 (N/tex) at 5% elongation of the band cord and the complex elastic modulus E* 1 (MPa) is 0.40 to 1.60 (N·MPa/tex).", "13 . The pneumatic tire according to claim 10 , wherein a sea ratio of the ground contacting surface of the tread portion is 15% to 50%, and the product of the complex elastic modulus E* 1 (MPa) and the sea ratio (%) of the ground contacting surface of the tread portion is not more than 5.0 (MPa).", "14 . The pneumatic tire according to claim 1 , wherein a sea ratio of the ground contacting surface of the tread portion is 15% to 50%, and a ratio σ 1 /d 2 (%) of the stress 1 (N/tex) at 3% elongation of the band cord to the stress σ 2 (N/tex) at 5% elongation of the band cord is greater than the sea ratio (%) of the ground contacting surface of the tread portion.", "15 . The pneumatic tire according to claim 1 , wherein the thickness t 1 is 0.05 to 0.30 mm, the distance d 1 is 0.5 to 1.5 mm, and the distance d 2 is 5.0 to 12.0 mm."], "bibtex": "@patent{20240190177,\n    title = {PNEUMATIC TIRE},\n    number = {20240190177},\n    year = {2024},\n    note = {File: US20240190177A1-20240613.XML}\n    }", "classification": "B60C900FI"}]