[{"title": "Wheel With High Strength Flexible Spokes", "doc_number": "20240316985", "filename": "US20240316985A1-20240926.XML", "abstract": "A wheel with high strength flexible spokes of the present invention, including a rim and hub, and spokes between the rim and hub made of fibrous material that causes the spokes to be both lighter in weight and stronger than comparable steel spokes. The spokes are also flexible and resilient such that they can bend while retaining their integrity and strength. The wheel includes a nipple within the rim that receives the high strength spoke and allows for flexibility in adapting the spoke to wheels having differing shapes and sizes.", "detailed_description": ["Referring toFIG.1, a side view of a first preferred embodiment of the wheel with flexible spokes of the present invention is shown and generally designated100. InFIG.1, the side of wheel100facing the viewer can be referred to as the right side of the wheel100. The side of wheel100opposite the right side can be referred to as the left side of the wheel100. The wheel100has a wheel axis104, and a rim110which has an inner perimeter112and an outer perimeter114.", "", "Still referring toFIG.1, with reference toFIG.3, distributed symmetrically along inner perimeter112are spoke holes120. Each spoke hole120has a spoke hole width122. Along the outer perimeter114are nipple access holes124(not visible inFIG.1), one nipple access hole124adjacent each spoke hole120. Wheel100further includes a hub130having a right flange132and a left flange134(not visible, behind right flange132). Each flange132and134has an inner surface136and an outer surface138. In each flange132and134are flange holes140, each flange hole140corresponding to a unique spoke hole120. Each flange hole140has an inner opening142in the corresponding inner surface136, and an outer opening144in the corresponding outer surface138. Hub130also has a barrel148which receives an axle of a bicycle.", "", "Wheel100further includes non-rigid spoke members, or spokes150. Each spoke150has non-rigid fibers152(not visible this Figure) covered by a jacket154having an inner diameter156(not visible) and an outer diameter158which is also the width158of spoke150. Each spoke150has a length160. Fibers152are substantially continuous along the length160of spoke150. Alternatively, one or more of fibers152may be less than continuous along the length of spoke150.", "", "Each spoke150has an inner end162adjacent hub130, and an outer end164adjacent rim110. Each spoke150has a tube170about its outer end164, and each tube170is formed with a tapered bore171opening away from the midpoint of the spoke. Each tube170is affixed to its corresponding outer end164by inserting the fibers into the tube, and filling the tube with epoxy175. Once hardened, the epoxy175and fibers152form a wedge within the tapered bore171such that any tension on the spoke draws the hardened wedge against the taper thereby securing the fiber within the tube. Alternatively, tube170may be affixed to outer end164by any other material of similar strength.", "", "Tube170may be equipped with a hexagonal, reinforced head165which provides for added strength at the hub-end of the tube170. This is helpful in preventing breakage for a non-axial tension on spoke150, and facilitates the tightening of spoke150.", "", "Each tube170has a tube axis172and external spoke threads174. Each spoke150also has an anchor (or eyelet or ferrule)180about its inner end162. Each anchor180is formed with a tapered bore181opening away from the midpoint of the spoke. Each anchor180is affixed to its corresponding inner end162by inserting the fibers into the anchor, and filling the tapered bore181with epoxy163. Once hardened, the epoxy and fibers form a wedge within the tapered bore181formed in the anchor180such that any tension on the spoke draws the hardened wedge against the taper thereby securing the fiber150within the anchor180. Alternatively, anchor180may be affixed to inner end162by any other material of similar strength.", "", "Each flange hole140is wider than spoke150but narrower than anchor180, such that tube170about outer end164can be passed into inner opening142and out of outer opening144, and such that the rest of spoke150can then be passed through flange hole140until anchor180comes into contact with inner surface136around inner opening142, which causes inner end162to be retained in flange hole140by anchor180.", "", "Wheel100also includes nipples190. One nipple190is shown inFIG.1in broken line, inside rim110. There is a nipple190between each spoke hole120and its corresponding nipple access hole124. Each nipple190has a nipple opening192, nipple threads194inside nipple opening192, a collar196, and a nipple head198. Once each spoke150is passed through flange hole140until anchor180comes into contact with inner surface136around inner opening142, tube170is positioned and threaded into the corresponding nipple190via inter-engagement of spoke threads174with nipple threads194. This causes tube170to be retained in nipple190such that tube axis172is perpendicular to wheel axis104(shown inFIG.1). The retention of tube170in nipple190, and of inner end162in flange hole140by anchor180, causes spoke150to be held taut between rim110and hub130.", "", "FIG.1shows eight (8) spokes150attached to right flange132, and eight (8) spokes150attached to left flange134(not visible, behind right flange132), for a total of sixteen (16) spokes150. Wheel100may alternatively have more or fewer than sixteen (16) spokes150. For example, wheel100may have twelve (12) spokes150, six (6) spokes150attached to each of flanges132and134. While it is also possible to have different numbers of spokes150attached to each of flanges132and134, having the same number of spokes attached to each of flanges132and134balances the load on the flanges132and134.", "", "FIG.2is a rear view of hub130.FIG.2shows the angle that one of the spokes150is attached to right flange132, and the angle that one of the spokes150is attached to left flange134. InFIG.2, the right side of wheel100is on the right side ofFIG.2, and the left side of wheel100is on the left side ofFIG.2. Broken line230inFIG.2represents a plane230that bisects wheel100between the right side and left side of wheel100. Plane230is perpendicular to wheel axis104. Each outer surface138has the shape of a conical section that has an angle240to wheel axis104. Each spoke150extends perpendicularly from the corresponding outer surface138.", "", "Therefore, each spoke150extends from outer surface138at an angle250to plane230. This means that the magnitude of angle260between spoke150attached to right flange132and spoke150attached to left flange134, is twice the magnitude of angle250.", "", "FIG.3shows a partial cross-sectional detail view of a spoke150with its inner end162retained in flange hole140by anchor180, and tube170about to be received in nipple190in rim110.FIG.3shows how nipple190is retained in spoke hole120. Spoke hole width122allows the portion of nipple190around nipple opening192to pass through spoke hole120, but does not allow collar196to pass through spoke hole120, such that nipple is retained in spoke hole120by the tension of spoke150on nipple190once tube170is threaded into nipple190.FIG.3also shows spoke threads174which inter-engage with nipple threads194to thread tube170into nipple190. With tube170retained in nipple190, tube axis172is perpendicular to wheel axis104(not shown) and intersects the corresponding spoke hole120. Spoke holes120lie in plane230. While spoke holes120may alternatively be adjacent plane230, spoke holes120being in plane230causes the forces of spokes150to be placed on rim110where plane230intersects rim110, which is the middle of the inner perimeter112of rim110. With spoke holes120in plane230, and each tube170received in the corresponding nipple190, tube axis172also lies in plane230.", "", "InFIG.3, tube axis172coincides with the broken line representing plane230. However, because each spoke150extends at angle250to plane230, each spoke150extends from its tube170at angle250to tube axis172. This means that there is a bend in spoke150at an angle250at the point320where spoke150protrudes from tube170. With steel spokes, such a bend would weaken the spoke and ultimately cause the spoke to fail. However, with spokes150, such a bend does not damage spokes150, because fibers152are flexible and resilient yet strong such that spokes150retain their integrity and strength even when bent under tension in the manner described. Therefore, spokes150can bend without weakening or failing. Furthermore, each of spokes150is three times as strong, and weighs half as much, as a steel spoke that would otherwise be used in its place. This allows the width158of each of spokes150to be greater than that of a steel spoke that would be used in its place. In the alternative, the width158of each spoke150may be less than or equal to the width of a steel spoke that would be used in its place; the strength of each of spokes150may be greater or less than three times that of a steel spoke that would be used in its place; and the weight of each of spokes150may be greater or less than half that of a steel spoke that would be used in its place.", "", "Rim110, hub130, tube170, anchor180and nipple190, in a preferred embodiment, are made of aluminum. Alternatively, any of rim110, hub130, tube170, anchor180or nipple190may be made of any other material of comparable strength. In a preferred embodiment of the present invention, fibers152are a bundle of thermotropic liquid crystal fibers that exhibit high strength, low creep, and weather resistance. For instance, the fibers could be a PBO fiber such as Zylon®, a strong yet lightweight fiber, available from Toyobo. Alternatively, fibers152may be made of any other material having comparable weight and strength. Jacket154is made of Rilsan®, a high-performance polyamide. Alternatively, jacket154may be made of any other material having comparable weight and strength. Each nipple access hole124allows access to nipple head198so that it can be turned to facilitate the threading of nipple190onto tube170. For instance, a hexagonal head nut-driver may be positioned over nipple190and rotated to tighten spoke150in place.", "", "FIG.4shows a cross-sectional detail view of the inside of a spoke150, showing the fibers152, and inner diameter156of jacket154. Fibers152are gathered in forty-four (44) bundles410of nine-hundred ninety-six (996) filaments each bundle, for a total of 43,824 filaments in spoke150. This great number of filaments is one factor contributing to the great strength of spoke150, while minimizing the weight of spoke150. Spoke150has a breaking strength of 3,600 pounds. Alternatively, the number of bundles410may be greater or less than 44; the number of filaments in each bundle410may be greater or less than 996; and the breaking strength of spoke150may be greater or less than 3,600 pounds.", "", "Referring toFIG.5, a cross-sectional view of the first preferred embodiment of the wheel with flexible spokes of the present invention showing cross-sectional portions of the rim and hub is shown. As can be appreciated fromFIG.5, the width of rim110is just slightly wider than the width of nipple190. As a result, it is necessary that the nipple be aligned so that the tube extends radically inward from rim110. Because of this positioning, it is important that spoke150be flexible as it leaves tube190so as to accommodate angle250without any decrease in strength and durability. Due to the number of fiber strands contained within spoke150, there is no noticeable decrease in strength despite the off-axis tension.", "", "When tension is applied to spoke150, collar196strikes the inside surface of rim110and maintains the nipple, and corresponding sleeve, in its perpendicular arrangement.", "", "Referring now toFIGS.6through9, a number of alternative embodiments of the wheel with high strength flexible spokes of the present invention are shown and include variations on the nipple and rim.", "", "Referring initially toFIG.6, the wheel with high strength flexible spokes of the present invention is shown and includes a shortened nipple generally designated450. Shortened nipple450is sized to be fully received within the rim110. Nipple450includes a nipple head452and a collar460sized to rest against the interior of the rim110and allow nipple opening456with diameter458to pass through spoke hole120. Shortened nipple450is formed with a threaded bore454passing longitudinally along axis172from nipple opening456. Threaded bore454is sized to threadably receive head tube170.", "", "Shortened nipple450is formed with a keyway462to receive a key when secured during assembly of the wheel. More specifically, nipple head452is formed with a pattern of keyways462to receive a correspondingly shaped key to maintain the rotational position of nipple450along axis172during the installation of spoke150. By inserting a key into keyways462, the nipple450may be held in place while head tube is rotated such that head tube threads174enter nipple450.", "", "As shown inFIG.6, spoke150may extend away from axis172by an angle250as described in conjunction with alternative embodiments.", "", "Referring now toFIG.7, a cross-sectional view of an alternative embodiment of the wheel with high strength flexible spokes of the present invention is equipped with a shouldered nipple generally designated480. Shouldered nipple480includes an insert483having a diameter484which is slightly less than the diameter of spoke hole120of rim110. Shoulder494is larger in diameter than insert diameter484such that the shoulder494rests on the inside surface of rim110.", "", "Shouldered nipple480is formed with a threaded bore488which passes from nipple insert483through to nipple head486, and includes threads492matching threads174. Threaded bore488is sized to threadably receive threads174on tube head170during the assembly of the wheel with high strength flexible spokes of the present invention.", "", "FromFIG.7it can been seen that shoulder494is rounded and corresponds with a mating surface121of said spoke hole120on rim110such that the axis172of nipple480may vary slightly within rim110. Specifically, the mating surface121allows the shouldered nipple480to pivot slightly within the rim110to accommodate slight angular adjustments within the rim, such that the spoke150can extend away at an angle250from the nipple480and rim110.", "", "A number of keyways490are formed in nipple head486such that a corresponding key (not shown) can be inserted into keyways490to maintain the rotational position of nipple480during the threading of tube head170into threaded bore488, and when tightening the spoke150using hexagonal head165. Also, nipple480is sized to be fully received within access hole124in rim100.", "", "Referring now toFIGS.8and9, cross-sectional views of an alternative embodiment of wheel with high strength flexible spokes of the present invention showing cross-sectional portions of the rim and hub, and showing a spherical, or rounded, nipple generally designated500. Rounded nipple500is formed with a spherical or near spherical body502having a bore506along axis172and formed with threads504through end510.", "", "Rim110is formed with nipple seat508that is shaped to receive rounded nipple500to retain nipple500in position along axis172of rim100.FIG.9depicts the insertion of a spoke150into rounded nipple500by threadably rotating spoke150along axis518and advancing the spoke150in direction514.", "", "Rounded nipple500is formed with a number of keyways512sized to receive a key, such as the key550shown inFIG.10, having a handle552and a shaft554leading to a head556formed with keys558positioned and sized to correspond to keyways512on rounded nipple500. It is to be appreciated that the number, size, positioning of the keys558may vary to accommodate keyway size, shapes, and patterns of nipples described herein.", "", "Head556of key550is formed to have a diameter560that is less than the diameter of access hole124. Accordingly, key550can be inserted into rim110during the wheel assembly process to engage keys558into keyways512to maintain the rotational position of rounded nipple500as head tube170is threaded into nipple500.", "", "Also fromFIG.9, the rotation of rounded nipple500within rim110is shown. Rounded nipple500rotates within the rim110to accommodate the angular positioning of a spoke150extending away from the rim110with little or no angular change with the tube head and spoke. Specifically, rounded nipple500rests against nipple seats508and can rotate about a center of rotation522such that the axis518of tube head174can move within range520. This range520allows the spoke150to maintain a relatively straight line between tube head174and anchor180of hub130. This straightness along axis518provides additional strength as all fibers152within spoke150are stressed similarly along the longitudinal axis of the spoke.", "", "Referring now toFIG.10, an exemplary embodiment of a key tool for tightening the high strength flexible spokes of the present invention is shown and generally designated550. Key tool550includes a handle552having a shaft554leading to a head556formed with a number of keys558sized and positioned to cooperatively engage the keyways on nipples of the present invention. The diameter560of head556is intended to be sized to be insertable through the access hole124in the rim110as disclosed herein to engage the nipples described to facilitate the high strength flexible spokes of the present invention. It is to be appreciated that the key tool550is shown inFIG.10to have four keys558which, in a preferred embodiment, correspond to the inserts shown to have four keyways. It is to be appreciated further, that the number, size and positioning of keys558can vary to accommodate a nipple formed with different configurations of keyways.", "", "While the wheel with high strength flexible spokes of the present invention as herein shown and disclosed in detail is fully capable of obtaining the objects and providing the advantages herein before stated, it is to be understood that it is merely illustrative of preferred and alternative embodiments of the invention and that no limitations are intended to the details of construction or design herein shown other than as described in the appended claims."], "claims": ["a plurality of flexible spoke assemblies attached between a hub and a rim; wherein each of said plurality of flexible spoke assemblies comprises a braided fiber shaft.", "2 . The wheel of claim 1 wherein said braided fiber shaft has a first end and a second end and is capable of bending at an angle without a decrease in strength.", "3 . The wheel of claim 2 wherein said braided fiber shaft comprises a plurality of non-rigid fiber material.", "an anchor secured to first end of said braided fiber shaft; a nipple configured to be secured to said second end of said braided fiber shaft.", "5 . The wheel of claim 4 , wherein said anchor is an eye loop formed by said first end of braided fiber shaft.", "6 . The wheel of claim 5 wherein said anchor attaches to said hub and said nipple attaches to said rim."], "bibtex": "@patent{20240316985,\n    title = {Wheel With High Strength Flexible Spokes},\n    number = {20240316985},\n    year = {2024},\n    note = {File: US20240316985A1-20240926.XML}\n    }", "classification": "B60B102FI"}, {"title": "TIRE AND RIM SEAL FOR A WHEEL", "doc_number": "20240316986", "filename": "US20240316986A1-20240926.XML", "abstract": "A tire and rim seal is disclosed by which to reliably seal the beads of a tire against the rim of a wheel on which the tire is mounted so as to advantageously prevent the tire from leaking air and slipping off the beads of the rim. The tire and rim seal includes an elastomer that is seated on the rim and a rigid backing that lays on top of the elastomer. A plurality of threaded bolts extend from the rigid backing and run through the elastomer and the rim of the wheel. A corresponding plurality of threaded nuts are rotated around the threaded bolts and tightened against the rim so as to pull the rigid backing towards the rim. Accordingly, a compressive force is generated by which to cause the elastomer to be sandwiched between the rigid backing and the rim so as to expand along the rim and move into sealing engagement with the rim and the beads.", "detailed_description": [""], "claims": ["a rim having a pair of lips extending around the periphery thereof; a tire mounted on the rim to be inflated with air, said tire including a pair of sidewalls having respective beads that lie against the pair of lips of the rim, where each of the beads has an inside surface and an opposite outside surface; and a seal lying on the rim between the beads of the pair of sidewalls, said seal including an elastomeric material that is responsive to a compressive force applied thereto in order to change its shape and become flattened, whereby the seal expands so as to be pressed against the rim and against the inside surfaces of the beads by which the outside surfaces of the heads are correspondingly pressed against the pair of lips of the rim so as to seal the interface between the beads and the rim and thereby prevent air with which the tire is inflated from leaking out of the tire; and a force generating backing that communicates with the elastomeric material of said seal by which to apply the compressive force to cause said elastomeric material to be flattened so as to expand and press against the rim and the inside surfaces of the beads in order to seal the interface between the beads and the rim.", "2 . The wheel recited in claim 1 , wherein said seal extends continuously around the rim on which the tire is mounted.", "3 . (canceled)", "4 . (canceled)", "5 . (canceled)", "6 . The wheel recited in claim 1 , wherein said force generating backing is a stiff spine that lays on the elastomeric material of said soul to apply said compressive force thereto.", "7 . The wheel recited in claim 6 , wherein said stiff spine that lays on and applies said compressive force to the elastomeric material of said seal extends completely around the rim of the wheel.", "8 . The wheel recited in claim 7 , further comprising at least one fastener extending from the stiff spine and running through each of the elastomeric material of said seal and the rim of the wheel on which said seal lays, said at least one fastener pulling said stiff spine against said elastomeric material so that said elastomeric material is compressed between and stiff spine and the rim.", "9 . The wheel recited in claim 8 , wherein said at least one fastener is a threaded bolt, said threaded bolt having a threaded nut that is rotated around said threaded bolt and tightened against the bottom of the rim of the wheel through which said threaded bolt extends so as to cause said threaded bolt to pull said stiff spine towards the rim on which said elastomeric seal lays, whereby the elastomeric material of said seal is compressed between said stiff spine and the rim.", "10 . The wheel recited in claim 9 , wherein said threaded bolt is hollow by which an air channel is established through which the tire is inflated with air.", "11 . The wheel recited in claim 1 , wherein said seal includes a plurality of elastomeric seal segments that are responsive to the compressive force applied to said seal by which to change the shape of said seal, and said force generating backing includes a corresponding plurality of spine segments to generate the compressive force to be applied to said seal, said plurality of elastomeric seal segments and said plurality of spine segments extending completely around the rim of the wheel and laying one on top of the other.", "12 . The wheel recited in claim 11 , further comprising a plurality of fasteners extending from respective ones of said plurality of spine segments and running through respective ones of said plurality of elastomeric seal segments on which said plurality of spine segments ley and through the rim of the wheel, said plurality of fasteners pulling said plurality of spine segments against said plurality of elastomeric seal segments in generate said compressive force so that said plurality of elastomeric seal segments change their shape and are compressed between said plurality of spine segments and the rim.", "a rim; a tire mounted on the rim to be inflated with air, said tire including a pair of sidewalls having respective beads that lie on the rim; an elastomeric sealing material lying on the rim of the wheel between the beads of the tire; and a backing surrounding the rim of the wheel and lying on said elastomeric sealing material, said backing moving towards the rim and the elastomeric sealing material that lies on the rim to generate a pressure for causing said elastomeric sealing material to be compressed between said backing and the rim, whereby said elastomeric scaling material undergoes a change of its shape so as to move along the rim and press against the rim and the beads of the tire to seal the interface between the beads and the rim and thereby prevent air with which the tire is inflated from leaking out of the tire through said interface.", "14 . The wheel recited in claim 13 , wherein said backing that lays on said elastomeric sealing material is a C-shaped spine having first and opposite ends and a space located between said first and opposite ends, said wheel further comprising a spine tensioning device connected between the first and opposite ends of said C-shaped spine and being operable to pull said first and opposite ends towards one another through said space therebetween such that said C-shaped spine is tightened around said elastomeric sealing material to generate the pressure for causing said elastomeric sealing material to be compressed between said C-shaped spine and the rim of the wheel.", "15 . The wheel recited in claim 14 , wherein each of said elastomeric sealing material and the rim of the wheel on which said elastomeric sealing material lays has a mounting hole formed therein, said spine tensioning device having a fastener received through each of the mounting holes of said elastomeric sealing material and the rim by which said spine tensioning device is attached to the rim.", "16 . The wheel recited in claim 15 , wherein said spine tensioning device also has a rotatable drive shaft extending below the rim of the wheel on which said elastomeric sealing material lays, and a first gear wheel coupled to said rotatable drive shaft, said first gear wheel being rotated in response to a rotation of said rotatable drive shaft for causing the first and opposite ends of said C-shaped spine to be pulled towards one another.", "17 . The wheel recited in claim 16 , wherein said spine tensioning device also has a rotatable drive shaft controller mated to the rotatable drive shaft below the rim of the wheel, said rotatable drive shaft controller being rotated to cause a corresponding rotation of each of said rotatable drive shaft and said first gear wheel coupled to said rotatable drive shaft for causing the first and opposite ends of said C-shaped spine to be pulled towards one another.", "18 . The wheel recited in claim 17 , wherein said spine tensioning device also has a pair of rotatable gear shafts and second and third gear wheels connected to respective ones of said pair of rotatable gear shafts and coupled to said first gear wheel, said pair of rotatable gear shafts also being coupled to the first and opposite ends of said C-shaped spine such that a rotation of said first gear wheel is imparted to said second and third gear wheels for causing a corresponding rotation of said pair of rotatable gear shafts and the first and opposite ends of said C-shaped spine to be pulled toward one another.", "19 . The wheel recited in claim 18 , further comprising first and opposite end caps, each of said first and opposite end caps being connected to a respective one of the first and opposite ends of said C-shaped spine and having a threaded coupler, each of said pair of rotatable gear shafts being threaded and received by a respective one of the threaded couplers of said first and opposite end caps so as to move in opposite directions through said threaded couplers and axially within said first and opposite ends to thereby cause said first and opposite ends to move towards one another in response to the rotation of the second and third gear wheels and said pair of rotatable gear shafts connected thereto.", "a rim; a tire mounted on the rim to be inflated with air, said tire including a pair of sidewalls having respective beads that lie on the rims, a plurality of elastomeric rim seal segments that lie end-to-end one another and extend around the rim of the wheel; a plurality of spine segments that lie end-to-end one another on top of respective ones of said plurality of elastomeric rim seal segments; a plurality of rim seal containment segments that are surrounded by respective ones of said plurality of elastomeric rim seal segments; and a plurality of fasteners connected to the rim of the wheel and positioned to force respective ones of said plurality of spine segments towards the rim and against respective ones of said plurality of elastomeric rim seal segments above which said spine segments lay and against respective ones of said plurality of rim seal containment segments that are surrounded by said elastomeric rim seal segments such that said plurality of elastomeric rim seal segments are compressed by said plurality of spine segments so as to expand along the rim and seal against the rim and the tire beads on the rim, said plurality of rim seal containment segments controlling the expansion of said plurality of elastomeric rim seal segments.", "a rim; a tire mounted on the rim to be inflated with air, said fire including a pair of sidewalls having respective bards that lie on the rim, where each of said beads has an inside surface and an outside surface; and an elastomeric sealing material lying on the rim of the wheel between the beads of the tire and being responsive to a compressive force for causing said elastomeric sealing material to be compressed, whereby said elastomeric sealing materiel undergoes a change of its shape so as to move along the rim and press against the rim and the inside surfaces of the beads to correspondingly press the outside surfaces of the beads against the rim so as to seal a first interface lying between the sealing material and the rim and a second interface lying between the sealing material and the inside surfaces of the beads in order to prevent air with which the tire is inflated from leaking out of the tire through said first and second interfaces.", "a one-piece rim having a beadwell and a pair of lips extending continuously around the periphery of the beadwell; a tire mounted on the one-piece rim to be inflated with air, said tire including a pair of sidewalls having respective beads that lie within the beadwell and against the pair of lips of the rim, where each of the beads has an inside surface and an opposite outside surface; and a resilient seal lying within the beadwell of the one-piece rim between the beads of the pair of sidewalls, said resilient seal being responsive to a pressure applied thereto when said tire is inflated with air, whereby the seal is pressed against the beadwell of the one-piece rim and against the inside surfaces of the beads by which the outside surfaces of the beads are correspondingly pressed against the pair of lips of the one-piece rim so as to seal a first interface lying between the seal and the one-piece rim and a second interface lying between the seal and the inside surfaces of the beads in order to prevent air with which the tire is inflated from leaking out of the tire.", "23 . The wheel recited in claim 22 , further comprising a force generating backing that lays on the resilient seal to apply the pressure thereto and thereby cause said resilient seal to change its shape and expand along the beadwell of said one-piece rim towards the beads of the tire, said resilient seal extending continuously around the beadwell of said rim."], "bibtex": "@patent{20240316986,\n    title = {TIRE AND RIM SEAL FOR A WHEEL},\n    number = {20240316986},\n    year = {2024},\n    note = {File: US20240316986A1-20240926.XML}\n    }", "classification": "B60B2112FI"}, {"title": "HALF SHAFT AND HUB BEARING ASSEMBLY", "doc_number": "20240316987", "filename": "US20240316987A1-20240926.XML", "abstract": "A half shaft and hub bearing assembly includes a half shaft including a CV joint outer race and a stub axle extending from the CV joint outer race. The CV joint outer race includes a first axial face including an annular groove and the half shaft includes a first chamfered shoulder having a chamfer angle. A hub bearing includes a body having a bore therethrough that receives the stub axle. The body includes a second axial face opposing the first axial face of the CV joint outer race with a gap therebetween and a second chamfered shoulder engaging the first chamfered shoulder. The hub bearing includes a hub flange extending radially from the body. A seal ring is received in the annular groove in the first axial face of the CV joint outer race and the seal ring being disposed against the second axial face of the hub bearing.", "detailed_description": ["Referring now toFIG.1, a cross-sectional view of a half shaft and a hub bearing assembly10is shown. The assembly10includes a half shaft12having a CV joint outer race14and a stub axle16extending in an axial direction from the CV joint outer race14. With reference toFIGS.1and2, the CV joint outer race14includes an axial face18that includes a recessed annular groove20. The stub axle16includes an external chamfered shoulder22having a chamfer angle, relative to an axis of the stub axle16of between 30 and 60 degrees and more preferably about 45 degrees. By the word “about” it is intended to include a variance of +10%. The stub axle16can include a distal end with a threaded interface24for receiving a hub nut26thereon. The CV joint outer race14is designed to engage with axle bar shaft and inboard joint (not shown) as is known in the art.", "", "The assembly10further includes a hub bearing30having an annular body32with an internally splined bore34therethrough. The hub bearing30includes a radially extending wheel mounting flange36having a plurality of apertures for mounting a wheel to the flange. The hub bearing30further includes a first race surface38that is configured to receive a first bearing assembly and a second race surface42that is configured to receive a second bearing assembly. The bore34of the hub bearing30includes an internal chamfered shoulder46that engages the external chamfered shoulder22of the stub axle. The internal chamfered shoulder46has a chamfer angle that matches the chamfer angle of the external chamfered shoulder22(between 30 and 60 degrees and more preferably about 45 degrees). The annular body32of the hub bearing30includes an axial face48that opposes the axial face18of the CV joint outer race14. An O-ring50is received in the recessed annular groove20of the axial face18of the CV joint outer race14and is in engagement with the axial face48of the hub bearing30. The engagement of the internal chamfered shoulder46and the external chamfered shoulder22maintain a gap space between the axial face18of the CV joint outer race14and the axial face48of the hub bearing30.", "", "The external chamfered shoulder22can include one or more grease pockets52. In particular, a plurality of grease pockets52can be defined by a plurality of spaced recesses54in the chamfered shoulder22. The spaced recesses54can be filled with grease56. The grease pockets52can have a depth (relative to the chamfered shoulder) of between 1 and 4 mm and more preferably a depth of 3 mm. The grease pockets can further have a width (relative to a longitudinal direction) of between 2 and 3 mm and more preferably 2.5 mm.", "", "In an assembled condition, the stub axle16is inserted into the bore34of the annular body32of the hub bearing30, and there is a spline engagement between the stub axle16and the bore34of the annular body32of the hub bearing30. The hub nut26can be threadedly engaged with the threaded interface24and disposed against the annular body32to secure the stub axle16within the bore34. Grease56can be disposed in the spaced recesses54and the internal chamfered shoulder46is disposed against the external chamfered shoulder22of the stub axle16. The axial face48of the hub bearing30opposes the axial face18of the CV joint outer race14and engages the O-ring50that is received in the annular groove20. The gap between the axial face48of the hub bearing30and the axial face18of the CV joint outer race14eliminates noises caused by engagement between the hub bearing30and the CV joint outer race14. The gap distance can be between 0.5 and 2 mm and more preferably, 1 mm. The O-ring50prevents contaminants or water from entering the gap between the axial face48of the hub bearing30and the axial face18of the CV joint outer race14. The grease56further prevents noises from being created by the hub bearing30stub axle16interface. The engagement between the external chamfered shoulder22and the internal chamfered shoulder46receives the axial force due to nut tightening and minimizes the difference in torsional stiffness between the half shaft12and the hub bearing30.", "", "The foregoing description is merely illustrative in nature and is in no way intended to limit the disclosure, its application, or uses. The broad teachings of the disclosure can be implemented in a variety of forms. Therefore, while this disclosure includes particular examples, the true scope of the disclosure should not be so limited since other modifications will become apparent upon a study of the drawings, the specification, and the following claims. It should be understood that one or more steps within a method may be executed in different order (or concurrently) without altering the principles of the present disclosure. Further, although each of the embodiments is described above as having certain features, any one or more of those features described with respect to any embodiment of the disclosure can be implemented in and/or combined with features of any of the other embodiments, even if that combination is not explicitly described. In other words, the described embodiments are not mutually exclusive, and permutations of one or more embodiments with one another remain within the scope of this disclosure.", "", "When an element or layer is referred to as being “on,” “engaged to,” “connected to,” or “coupled to” another element or layer, it may be directly on, engaged, connected, or coupled to the other element or layer, or intervening elements or layers may be present. In contrast, when an element is referred to as being “directly on,” “directly engaged to,” “directly connected to,” or “directly coupled to” another element or layer, there may be no intervening elements or layers present. Other words used to describe the relationship between elements should be interpreted in a like fashion (e.g., “between” versus “directly between,” “adjacent” versus “directly adjacent,” etc.).", "", "Although the terms first, second, third, etc. may be used herein to describe various elements, components, regions, layers and/or sections, these elements, components, regions, layers and/or sections should not be limited by these terms. These terms may be only used to distinguish one element, component, region, layer or section from another region, layer, or section. Terms such as “first,” “second,” and other numerical terms when used herein do not imply a sequence or order unless clearly indicated by the context. Thus, a first element, component, region, layer, or section discussed below could be termed a second element, component, region, layer, or section without departing from the teachings of the example embodiments.", "", "Spatially relative terms, such as “inner,” “outer,” “beneath,” “below,” “lower,” “above,” “upper,” and the like, may be used herein for ease of description to describe one element or feature's relationship to another element(s) or feature(s) as illustrated in the figures. Spatially relative terms may be intended to encompass different orientations of the device in use or operation in addition to the orientation depicted in the figures. For example, if the device in the figures is turned over, elements described as “below” or “beneath” other elements or features would then be oriented “above” the other elements or features. Thus, the example term “below” can encompass both an orientation of above and below. The device may be otherwise oriented (rotated 90 degrees or at other orientations) and the spatially relative descriptors used herein interpreted accordingly.", "", "As used herein, the term “and/or” includes any and all combinations of one or more of the associated listed items. As used herein, the phrase at least one of A, B, and C should be construed to mean a logical (A OR B OR C), using a non-exclusive logical OR, and should not be construed to mean “at least one of A, at least one of B, and at least one of C.”"], "claims": ["a half shaft including a CV joint outer race and a stub axle extending from the CV joint outer race, the CV joint outer race having a first axial face including an annular groove, the half shaft including a first chamfered shoulder having a chamfer angle; a hub bearing including a body having a bore therethrough that receives the stub axle therein, the body including a second axial face opposing the first axial face of the CV joint outer race and a second chamfered shoulder engaging the first chamfered shoulder, the second axial face being spaced from the first axial face by a gap distance, the hub bearing including a hub flange extending radially from the body; and a seal ring received in the annular groove in the first axial face of the CV joint outer race and the seal ring being disposed against the second axial face of the hub bearing.", "2 . The half shaft and hub bearing assembly according to claim 1 , wherein the stub axle includes a threaded end configured to receive a hub nut.", "3 . The half shaft and hub bearing assembly according to claim 1 , wherein the seal ring is an O-ring.", "4 . The half shaft and hub bearing assembly according to claim 1 , wherein the hub bearing includes an outer race surface.", "5 . The half shaft and hub bearing assembly according to claim 1 , further comprising at least one grease pocket formed in the first chamfered shoulder.", "6 . The half shaft and hub bearing assembly according to claim 1 , wherein the first chamfered shoulder and the second chamfered shoulder have a chamfer angle relative to an axis of the half shaft of between 30 and 60 degrees.", "7 . The half shaft and hub bearing assembly according to claim 1 , wherein the first chamfered shoulder and the second chamfered shoulder have a chamfer angle relative to an axis of the half shaft of 45 degrees.", "a half shaft including a CV joint outer race and a stub axle extending from the CV joint outer race, the CV joint outer race includes a first axial face, the half shaft including a first chamfered shoulder having a chamfer angle; a hub bearing including a body having a bore therethrough that receives the stub axle therein, the body including a second axial face opposing the first axial face of the CV joint outer race and a second chamfered shoulder engaging the first chamfered shoulder, the second axial face being spaced from the first axial face by a gap distance, the hub bearing including a hub flange extending radially from the body; and a seal ring received between the first axial face of the CV joint outer race and the second axial face of the hub bearing.", "9 . The half shaft and hub bearing assembly according to claim 8 , wherein the stub axle includes a threaded end configured to receive a hub nut.", "10 . The half shaft and hub bearing assembly according to claim 8 , wherein the seal ring is an O-ring.", "11 . The half shaft and hub bearing assembly according to claim 8 , wherein the hub bearing includes an outer race surface.", "12 . The half shaft and hub bearing assembly according to claim 8 , further comprising at least one grease pocket formed in the first chamfered shoulder.", "13 . The half shaft and hub bearing assembly according to claim 8 , wherein the first axial face of the CV joint outer race includes an annular groove that receives the seal ring therein.", "14 . The half shaft and hub bearing assembly according to claim 8 , wherein the first chamfered shoulder and the second chamfered shoulder have a chamfer angle relative to an axis of the half shaft of between 30 and 60 degrees.", "15 . The half shaft and hub bearing assembly according to claim 8 , wherein the first chamfered shoulder and the second chamfered shoulder have a chamfer angle relative to an axis of the half shaft of 45 degrees.", "a half shaft including a CV joint outer race and a stub axle extending from the CV joint outer race, the CV joint outer race having a first axial face including an annular groove, the half shaft including a first chamfered shoulder having a chamfer angle, a grease pocket formed in the first chamfered shoulder; a hub bearing including a body having a bore therethrough that receives the stub axle therein, the body including a second axial face opposing the first axial face of the CV joint outer race and a second chamfered shoulder engaging the first chamfered shoulder, the second axial face being spaced from the first axial face by a gap distance, the hub bearing including a hub flange extending radially from the body; and a seal ring received in the annular groove in the first axial face of the CV joint outer race and the seal ring being disposed against the second axial face of the hub bearing.", "17 . The half shaft and hub bearing assembly according to claim 16 , wherein the stub axle includes a threaded end configured to receive a hub nut.", "18 . The half shaft and hub bearing assembly according to claim 16 , wherein the seal ring is an O-ring.", "19 . The half shaft and hub bearing assembly according to claim 16 , wherein the hub bearing includes an outer race surface.", "20 . The half shaft and hub bearing assembly according to claim 16 , wherein the first chamfered shoulder and the second chamfered shoulder have a chamfer angle relative to an axis of the half shaft of between 30 and 60 degrees."], "bibtex": "@patent{20240316987,\n    title = {HALF SHAFT AND HUB BEARING ASSEMBLY},\n    number = {20240316987},\n    year = {2024},\n    note = {File: US20240316987A1-20240926.XML}\n    }", "classification": "B60B2700FI"}, {"title": "LOW WEIGHT FLANGED INNER RING OF A WHEEL HUB UNIT", "doc_number": "20240316988", "filename": "US20240316988A1-20240926.XML", "abstract": "A flanged inner ring of a wheel hub unit includes a flange extending transverse to a central axis of symmetry and having a plurality of fixing holes for attaching a wheel. The flanged inner ring also includes a continuous tubular body projecting axially from the flange, the continuous tubular body having a plurality of polygonal recesses. The polygonal recesses reduce weight of the wheel hub unit and improve water drainage from the wheel hub unit.", "detailed_description": ["FIG.2depicts a wheel hub unit235in accordance with an embodiment of the present invention. The wheel hub unit235includes a flanged inner ring205. The flanged inner ring includes a flange210extending transverse to a central axis X of symmetry and includes a plurality of fixing holes215a,215b,215c. . . for attaching a wheel spaced circumferentially about the central axis X. It must be noted that there are more than three holes215a,215b,215c. . . shown inFIG.2.", "", "The flanged inner ring205includes a continuous tubular body220projecting axially from the flange210. The continuous tubular body220includes a plurality of polygonal recesses225a,225b. . . or grooves spaced circumferentially about the central axis X. More specifically, the tubular body220has an axial end integrally formed with the flange210and an opposing, free axial end, and the polygonal recesses225a,225b. . . are formed at the junction between the tubular body220and the flange210. The polygonal recesses225a,225b. . . or grooves are preferably formed in a forging process. It must be noted that there are more than two recesses225a,225b. . . shown inFIG.2.", "", "The polygonal recesses or grooves are formed on unloaded or non-loaded flange areas of the flanged inner ring205. The unloaded or non-loaded areas correspond to flange surface areas located between the holes215a,215b,215c. . . . For example, the polygonal recess225acorresponds to a flange surface area between the pair of adjacent holes215aand215band the polygonal recess225bcorresponds to a flange area between the pair of adjacent holes215band215c.", "", "The flange210is configured to retain a wheel rim (not shown) to the wheel hub unit235. The wheel hub unit235further includes an outer ring230disposed about the flanged inner ring205. In one embodiment, the outer ring230may be flanged. Further, a plurality of rolling bodies (not indicated) are positioned between the flanged inner ring205and the outer ring230so as to rotatably couple the rings205,230, as shown inFIG.3.", "", "The polygonal recesses225a,225bin the flanged inner ring205reduce the weight of the wheel hub unit235. By removing material in the non-loaded part of the flange210, weight is reduced without degrading the structural strength or integrity of the wheel hub unit235.", "", "The polygonal recesses225a,225bin the flanged inner ring205also improve water drainage from the wheel hub unit235.FIG.3depicts water drainage from the wheel hub unit235, a drainage path from the wheel hub unit being indicated by an arrow, in accordance with an embodiment of the present invention.", "", "The following are some of the main benefits of the wheel hub unit235with the flanged inner ring205:weight reduction.improved water drainage due to increased space for drainage between a rim, a brake disk, the flange of the inner ring205and a spigot.cost reduction due to less forging material.ease of manufacturing.", "", "In addition to the embodiments of the invention, as described above, it is to be understood that numerous further variants exist. It must also be understood that said embodiments are only examples and do not limit either the scope of the invention, nor its applications, nor its possible configurations. On the contrary, although the description provided above enables the person skilled in the art to implement the present invention at least in one of its examples of configuration, it must be understood that numerous variations of the components described are feasible, without thereby departing from the scope of the invention, as defined in the accompanying claims, interpreted literally and/or in accordance with their legal equivalents.", "", "Representative, non-limiting examples of the present invention were described above in detail with reference to the attached drawings. This detailed description is merely intended to teach a person of skill in the art further details for practicing preferred aspects of the present teachings and is not intended to limit the scope of the invention.", "", "Moreover, combinations of features and steps disclosed in the above detailed description may not be necessary to practice the invention in the broadest sense, and are instead taught merely to particularly describe representative examples of the invention. Furthermore, various features of the above-described representative examples, as well as the various independent and dependent claims below, may be combined in ways that are not specifically and explicitly enumerated in order to provide additional useful embodiments of the present teachings.", "", "All features disclosed in the description and/or the claims are intended to be disclosed separately and independently from each other for the purpose of original written disclosure, as well as for the purpose of restricting the claimed subject matter, independent of the compositions of the features in the embodiments and/or the claims. In addition, all value ranges or indications of groups of entities are intended to disclose every possible intermediate value or intermediate entity for the purpose of original written disclosure, as well as for the purpose of restricting the claimed subject matter. The invention is not restricted to the above-described embodiments, and may be varied within the scope of the following claims."], "claims": ["a flange extending transverse to a central axis of symmetry and comprising a plurality of fixing holes for attaching a wheel; and a continuous tubular body projecting axially from the flange and having a plurality of polygonal recesses.", "2 . The flanged inner ring as recited in claim 1 , wherein each one of the polygonal recesses correspond to a flange surface area between a separate pair of adjacent fixing holes.", "3 . The flanged inner ring as recited in claim 1 , wherein the tubular body has an axial end integrally formed with the flange and an opposing, free axial end, the polygonal recesses being formed at a junction between the tubular body and the flange.", "4 . The flanged inner ring as recited in claim 1 , wherein the plurality of polygonal recesses are formed in a forging process.", "5 . The flanged inner ring as recited in claim 1 , wherein the flange is configured to retain a wheel rim to a wheel hub.", "6 . The flanged inner ring as recited in claim 1 , wherein the wheel hub unit comprises an outer ring.", "7 . The flanged inner ring as recited in claim 1 , wherein the plurality of polygonal recesses in the flanged inner ring are provided to reduce weight of the wheel hub unit.", "8 . The flanged inner ring as recited in claim 1 , wherein the plurality of polygonal recesses in the flanged inner ring are configured to improve water drainage from the wheel hub unit.", "a flanged inner ring having a central axis and including a flange extending transverse to the central axis, the flange having a plurality of fixing holes for attaching a wheel and being spaced circumferentially about the central axis, and a continuous tubular body projecting axially from the flange and having a plurality of polygonal recesses spaced circumferentially about the central axis.", "10 . The wheel hub unit as recited in claim 9 , wherein each one of the polygonal recesses is formed in a flange surface area located circumferentially between a separate pair of adjacent fixing holes.", "11 . The wheel hub unit as recited in claim 9 , wherein the tubular body has an axial end integrally formed with the flange and an opposing, free axial end, the polygonal recesses being formed at a junction between the tubular body and the flange.", "12 . The wheel hub unit as recited in claim 9 , wherein the plurality of polygonal recesses are formed in a forging process.", "13 . The wheel hub unit as recited in claim 9 , wherein the flange is configured to retain a wheel rim to a wheel hub.", "14 . The wheel hub unit as recited in claim 9 , wherein the wheel hub unit further comprises an outer ring disposed about the flanged inner ring.", "15 . The wheel hub unit as recited in claim 9 , wherein the plurality of polygonal recesses in the flanged inner ring are provided to reduce weight of the wheel hub unit.", "16 . The wheel hub unit as recited in claim 9 , wherein the plurality of polygonal recesses in the flanged inner ring are configured to improve water drainage from the wheel hub unit."], "bibtex": "@patent{20240316988,\n    title = {LOW WEIGHT FLANGED INNER RING OF A WHEEL HUB UNIT},\n    number = {20240316988},\n    year = {2024},\n    note = {File: US20240316988A1-20240926.XML}\n    }", "classification": "B60B2702FI"}, {"title": "DUPLEX CORD FOR USE AS A REINFORCEMENT IN A BELT BANDAGE OF A PNEUMATIC VEHICLE TYRE", "doc_number": "20240316989", "filename": "US20240316989A1-20240926.XML", "abstract": "The invention relates to a duplex cord for use as strength member in a belt bandage of a pneumatic vehicle tire, consisting of exactly two yarns that are twisted together at the ends, wherein the first yarn has a Z value of 600 mN/tex or more, and wherein the second yarn has a Z value of 75 mN/tex or less and a Y value of 150 mN/tex or less, where Z is the force normalized to the linear yarn density at which an elongation of 1% is obtained in the force-elongation diagram, where Y is the force normalized to the linear yarn density at which an elongation of 4% is obtained in the force-elongation diagram, and where the quotient X of the linear density of the first yarn divided by the linear density of the second yarn is in the range from 1.0 to 1.3.", "detailed_description": ["The development and manufacture of high-performance vehicle tires is an area in which there is a constant need to further improve the components known from the prior art. A tire component that is particularly important in optimizing the high-speed properties of vehicle tires is what are known as reinforcing cords, which are used as strength members in the belt bandage of a pneumatic vehicle tire. These reinforcing cords serve, inter alia, to ensure the necessary stiffness in the tire and, with their mechanical properties, significantly influence the subsequent running properties of the tire, in particular through the hysteresis characteristics and the profile resulting for the reinforcing cords in the force-elongation diagram.", "", "In the prior art, for particularly high-performance pneumatic vehicle tires, which are optimized in particular with respect to high-speed performance, high-modulus triplex cords are currently used, in which two aramid yarns with relatively high modulus and a low-modulus nylon yarn are twisted together. The helical twisting allows here an extension of the aramid at relatively low forces, which is necessary in order not to cause any unwanted deformation in the manufacturing process of the vehicle tires, especially when introducing them into the mold.", "", "Even though the established triplex cords enable the manufacture of pneumatic vehicle tires with advantageous performance characteristics, these triplex cords are also regularly perceived as disadvantageous. The production from three individual yarns requires a comparatively complex and cost-intensive two-stage twisting process in which the rather brittle aramid is subjected in total two times to mechanical stress, which should in principle rather be avoided. In addition, triplex cords regularly have a comparatively high thickness, which in the later operation of the vehicle tire is perceived as a disadvantage with respect to the temperature development and thus also ultimately the high-speed performance. In addition, the hysteresis characteristics of such triplex cords in some cases worsen the rolling resistance of the corresponding vehicle tires.", "", "As an alternative to triplex cords, the prior art also discloses what are known as duplex cords, in which only two yarns are twisted together and which are therefore much simpler to produce. Duplex cords are also frequently thinner than triplex cords here. The disadvantage of duplex cords, which in many cases limits their use in high-performance tires for high-speed applications, is that the force-elongation characteristics are regularly perceived as being disadvantageous compared to triplex cords, with the necessary high modulus of the entire cord not being achieved in particular.", "", "Duplex cords and triplex cords are known in principle from the prior art.", "", "DE 10 2008 037 615 A1, for example, discloses hybrid cords for use as strength members in a belt bandage with specific first-twisting numbers of the respective yarns.", "", "EP 1 878 591 B1 discloses a ply of strength members embedded in an unvulcanized rubber mixture for the belt bandage of pneumatic vehicle tires, wherein in the strength members a maximum linear density is defined for the yarn with the high modulus of elasticity.", "", "EP 2 055 817 A1 discloses a tire with at least one cord, wherein the yarns of the cord are formed from specific materials.", "", "EP 2 065 222 B1 discloses a pneumatic vehicle tire with reinforcing cords, wherein the high-modulus yarn has an elastic modulus of not less than 10 000 MPa and the low-modulus yarn is nylon 46.", "", "EP 3 006 228 B1 discloses a hybrid cord, wherein the high-modulus yarn is a filament yarn and the low-modulus yarn is a staple fiber yarn.", "", "EP 3 196 343 B1 discloses a hybrid cord with a core-covering structure, wherein the hybrid cord is defined by a specific twist number and also a specific tensile strength and a specific Young's modulus of the high-modulus yarn.", "", "EP 3 365 187 B1 discloses a carcass for pneumatic tires with a multiplicity of two-ply hybrid cords, wherein the hybrid cords have a specific nylon content, a specific linear overall density value and a predetermined degree of twisting.", "", "US 2018/0099529 A1 discloses a reinforcing element, wherein a high-modulus yarn and a low-modulus yarn are twisted together in a specific manner.", "", "WO 2014/104680 A1 discloses a hybrid cord comprising twisted nylon and twisted aramid yarn which in turn are twisted together at the ends.", "", "WO 2018/075305 A1 discloses a hybrid cord in which a nylon yarn and an aramid yarn have the same twist and an approximately equal length.", "", "The object of the present invention was to overcome or at least to reduce the disadvantages known from the prior art.", "", "In particular, the object of the present invention was to specify a reinforcing cord for use as strength member in a belt bandage of a pneumatic vehicle tire, which reduces or even completely eliminates the disadvantages known for triplex cords.", "", "In particular, the reinforcing cord to be specified should be easier and more cost-effective to produce than corresponding triplex cords while having force-elongation characteristics that are as similar as possible. In addition, the reinforcing cord to be specified should ideally have a relatively small diameter and possess a relatively low value for the overall linear density while having force-elongation characteristics that are as similar as possible.", "", "Compared to the duplex cords known from the prior art, the object was on the other hand to specify a reinforcing cord which has exceptional force-elongation properties corresponding to those of triplex cords known from the prior art.", "", "In this respect, the object was to specify a reinforcing cord which is particularly suitable for use in such pneumatic vehicle tires that are optimized for high-speed applications.", "", "In this context, it was a supplementary requirement that the reinforcing cord to be specified should ideally be producible using customary production processes and should have the highest possible chemical compatibility with the customary sulfur-curable compositions used in pneumatic vehicle tires.", "", "It was a supplementary object of the present invention that the reinforcing cord to be specified should lead to improved rolling properties, in particular to a more favorable rolling resistance.", "", "The inventors of the present invention have now discovered that the above objects can surprisingly be achieved if a duplex cord as defined in the appended claims is provided as reinforcing cord. In particular, the inventors of the present invention have discovered that favorable force-elongation characteristics for the duplex cord can be surprisingly achieved if, in comparison to the higher-modulus yarns such as aramid typically used from the prior art, a different yarn is used which has a markedly increased modulus compared to the prior art.", "", "In this respect, however, the inventors of the present invention have also discovered that, in order to obtain force-elongation properties comparable to triplex cords known from the prior art, a certain ratio between the linear densities of the two yarns used in the duplex cord must also be established, meaning that the very high-modulus first yarn should have a linear density that is not too much higher than that of the second yarn.", "", "The objects mentioned above are correspondingly achieved by duplex cords, composite materials, vulcanized composite materials, vehicle tires and uses as defined in the claims. Preferred configurations according to the invention will emerge from the subclaims and from the statements below.", "", "Those features of duplex cords, composite materials, vulcanized composite materials, vehicle tires and uses according to the invention which are described below as being preferred are combined in particularly preferred embodiments with other features described as being preferred. Combinations of two or more of the embodiments that are described below as being particularly preferred are therefore very particularly preferred. Embodiments are likewise preferred in which a feature described as being preferred to a certain degree is combined with one or more further features described as being preferred to a certain degree. Features of preferred composite materials, vulcanized composite materials, vehicle tires and uses according to the invention emerge from the features of preferred duplex cords.", "", "The invention relates to a duplex cord for use as strength member in a belt bandage of a pneumatic vehicle tire, consisting of exactly two yarns that are twisted together at the ends,wherein the first yarn has a Z value of 600 mN/tex or more, andwherein the second yarn has a Z value of 75 mN/tex or less and a Y value of 150 mN/tex or less,where Z is the force normalized to the linear yarn density at which an elongation of 1% is obtained in the force-elongation diagram,where Y is the force normalized to the linear yarn density at which an elongation of 4% is obtained in the force-elongation diagram, andwhere the quotient X of the linear density of the first yarn divided by the linear density of the second yarn is in the range from 1.0 to 1.3.", "", "The duplex cord according to the invention is suitable for use as strength member in a belt bandage of a pneumatic vehicle tire and is particularly preferred for this use.", "", "The duplex cord consists exactly of two yarns that are twisted together at the ends. This means that no further yarn is present in the duplex cord.", "", "According to the invention, the first yarn has a specific Z value, where Z is the force normalized to the linear yarn density at which an elongation of 1% is obtained in the force-elongation diagram. The value Z accordingly correlates with the modulus of the yarn, with the chosen definition via the chord modulus being a representation of this property that is customary for a person skilled in the art and allows a particularly meaningful definition of the materials. The first yarn is therefore a particularly high-modulus yarn, which in particular has a higher chord modulus than the aramid yarns used in prior art reinforcing cords.", "", "The second yarn is a low-modulus yarn. In accordance with the understanding of a person skilled in the art, not just the value Z for the chord modulus at an elongation of 1% but also the value Y as chord modulus at an elongation of 4% are specified for sufficient definition of the second yarn.", "", "The values Y and Z are determined in accordance with the understanding of a person skilled in the art from the force-elongation diagram and can be calculated using the known linear density of the yarns. In the context of the present invention, the force-elongation diagram used for the determination of Y and Z is recorded with a tensile testing machine from Zwick in accordance with the standard ASTM D885/D885M of 2014.", "", "In the duplex cord according to the invention, the linear densities of the first and of the second yarn are also specifically matched to each other in order to achieve force-elongation characteristics which correspond to those of a triplex cord. This is done via the quotient X, which is calculated by dividing the linear density of the first yarn by the linear density of the second yarn. According to the assessment by the inventors, the quotient X must lie within the specified range in order to reliably obtain a duplex cord according to the invention that achieves the objects set.", "", "The term linear density is clear to a person skilled in the art in the field of textiles. This parameter correlates with the thickness of a yarn and represents a mass per unit length commonly indicated with the unit tex or dtex.", "", "With duplex cords according to the invention, the objects defined above are achieved and reinforcing cords are obtained as strength members, the use of which in the belt bandage of a pneumatic vehicle tire makes it possible to obtain high-performance tires that have exceptional high-speed properties.", "", "The inventors of the present invention have come to the assessment that it is particularly advantageous if the ratio of the linear densities is set to very specific values, where the high-modulus first yarn should ideally have values that lie within a certain range just above the linear density of the second yarn. In particular, in the case of duplex cords according to the invention in which the quotient X is about 1.15, force-elongation characteristics were observed which were particularly similar to those of a triplex cord acting as a reference system. Preference is correspondingly given to a duplex cord according to the invention, wherein the quotient X of the linear density of the first yarn divided by the linear density of the second yarn is in the range from 1.05 to 1.25, preferably in the range from 1.1 to 1.2, particularly preferably in the range from 1.13 to 1.17.", "", "The inventors of the present invention have discovered that it is particularly advantageous to choose a particularly high-modulus first yarn, since as a result it is surprisingly possible to obtain particularly high-performance duplex cords the resulting force-elongation characteristics of which are advantageously comparable to those of triplex cords in which several yarns made from conventional high-modulus material, for example aramid, are used. Preference is namely given to a duplex cord according to the invention, wherein the first yarn has a Z value of 650 mN/tex or more, preferably 700 mN/tex or more.", "", "In addition, the inventors propose selecting the second yarn with a modulus that is as small as possible, so that there is deliberately a large difference between the moduli of the two yarns used. With a corresponding construction, duplex cords according to the invention which can be processed particularly easily and efficiently are routinely obtained. Preference is consequently given to a duplex cord according to the invention, wherein the second yarn has a Z value of 65 mN/tex or less, preferably of 55 mN/tex or less, and/or wherein the second yarn has a Y value of 140 mN/tex or less, preferably of 135 mN/tex or less.", "", "In the course of the development work, the inventors of the present invention have succeeded in identifying particularly suitable materials that can be used as the first or second yarn in duplex cords according to the invention. For the high-modulus yarn, specific, particularly high-modulus aramid (which is also referred to as HM aramid) that is optimized with respect to its modulus, and also the material known as Zylon, have proven here in particular to be suitable. These materials differ significantly in their modulus from the regular aramid typically used in the prior art for duplex cords. With regard to the low-modulus second yarn, polyamides in particular have proven to be suitable, with the material known as nylon being particularly preferred, in particular nylon PA6.6.", "", "Preference is therefore given to a duplex cord according to the invention, wherein the first yarn comprises a material selected from the group consisting of aromatic polyamides, in particular poly(p-phenyleneterephthalamide), and polyoxazoles, in particular poly(p-phenylene-2,6-benzobisoxazole), the first yarn preferably consisting of this material. Particular preference is therefore given to a duplex cord according to the invention, wherein the first yarn consists of poly(p-phenyleneterephthalamide) or poly(p-phenylene-2,6-benzobisoxazole). The specific configuration of these materials as a particularly high-modulus embodiment ensues here from the Z value defined above.", "", "Accordingly, preference is also given to a duplex cord according to the invention, wherein the second yarn comprises a material selected from the group consisting of polyamides, in particular polyhexamethyleneadipamide, the second yarn preferably consisting of this material.", "", "According to the assessment by the inventors, to obtain particularly high-performance duplex cords according to the invention, the first and the second yarn should have linear densities the values of which are each above 1000 dtex, with particular upper limits being proposed by the inventors in view of the thickness of the resulting duplex cord, above which limits more intense heat development can arise more readily in the later use in the vehicle tire. In this respect, preference is given to a duplex cord according to the invention, wherein the first yarn has a linear density in the range from 1000 to 3000 dtex, preferably in the range from 1500 to 2000 dtex. Preference is likewise given to a duplex cord according to the invention, wherein the second yarn has a linear density in the range from 1000 to 2000 dtex, preferably in the range from 1300 to 1700 dtex.", "", "Proceeding from the statements made above, it is the assessment of the inventors that the overall linear density of the duplex cord should ideally also lie in a particular, middle range. Preference is therefore given to a duplex cord according to the invention, wherein the duplex cord has a linear density in the range from 2500 to 4000 dtex, preferably in the range from 2800 to 3500 dtex.", "", "In the course of development, the inventors of the present invention were able to identify a force-elongation profile which can be established with duplex cords according to the invention and which is particularly similar in its characteristics to that of triplex cords for high-speed applications. Such preferred duplex cords can accordingly be used to produce vehicle tires that are particularly advantageous for these high-speed applications and in particular had the necessary stiffness.", "", "Preference is given to a duplex cord according to the invention, wherein the duplex cord has the following force-elongation properties:13 to 17 N at 1% elongation,29 to 33 N at 2% elongation,57 to 63 N at 3% elongation,102 to 112 N at 4% elongation,160 to 180 N at 5% elongation,240 to 280 N at 6% elongation.", "", "Even though, according to the assessment by the inventors, the duplex cords according to the invention are comparatively flexible with respect to the twisting between the yarns, the inventors propose, on the basis of the knowledge available to them, specific twist factors that lead to particularly suitable duplex cords according to the invention. Preference is namely given to a duplex cord according to the invention, wherein the duplex cord has a twist factor in the range from 150 to 200, preferably in the range from 170 to 230, particularly preferably in the range from 185 to 215.", "", "In the light of the statements above, it is evident that the invention also relates to a composite material comprising one or more of the duplex cords according to the invention. The invention therefore also relates to a composite material, in particular for use in the manufacture of a belt bandage of a pneumatic vehicle tire, comprising one or more duplex cords according to the invention which are at least partially covered by a crosslinkable rubberization mixture.", "", "In accordance with the understanding of a person skilled in the art, the crosslinkable rubberization mixtures used here can be the rubberization mixtures known from the prior art that are routinely used in the production of pneumatic vehicle tires. In this respect, it can also be considered an advantage of the duplex cords according to the invention that they permit a choice of material that has high chemical compatibility with the crosslinkable rubberization mixtures known from the prior art.", "", "The advantageous properties of the composite material according to the invention can be seen in particular in the fact that it can be used in the production of pneumatic vehicle tires which have a favorable rolling resistance and the stiffness necessary for high-speed applications, with optimized hysteresis characteristics. In this case, the composite material according to the invention has very similar properties to those materials employed by triplex cords, but is usually markedly more favorable to produce as a result of the simpler production process here.", "", "It has proven to be particularly advantageous to use two or more duplex cords according to the invention in corresponding composite materials according to the invention and to arrange them preferably substantially parallel to one another. The parameter familiar to a person skilled in the art for describing a corresponding arrangement is the EPDM here, which specifies the number of reinforcing cords per decimeter along a direction perpendicular to the longitudinal axis of the duplex cords. Preference is accordingly given to a composite material according to the invention, wherein the composite material comprises two or more duplex cords according to the invention, wherein the duplex cords are preferably arranged substantially parallel to one another.", "", "Preference is given to a composite material according to the invention, wherein the duplex cord(s) is/are completely covered by the crosslinkable rubberization mixture, wherein the duplex cord(s) is/are preferably completely surrounded by the crosslinkable rubberization mixture.", "", "Vulcanizing the composite material according to the invention makes it possible to obtain a vulcanized composite material that can be used in pneumatic vehicle tires according to the invention. The composite material according to the invention/the vulcanized composite material can be used to produce belt bandages/vehicle tires that have exceptional high-speed properties and an advantageous rolling resistance, wherein the duplex cords according to the invention ensure the necessary stiffness and due to the lower diameter compared to comparable triplex cords contribute to a reduction in the buildup of heat in the corresponding vehicle tires.", "", "The invention thus also relates to a vulcanized composite material, producible by vulcanization of a composite material according to the invention.", "", "The invention also discloses a belt bandage for use in the manufacture of a pneumatic vehicle tire, comprising one or more duplex cords according to the invention, a composite material according to the invention or a vulcanized composite material according to the invention.", "", "The invention also relates to a vehicle tire, in particular pneumatic vehicle tire, comprising one or more duplex cords according to the invention, a composite material according to the invention or a vulcanized composite material according to the invention.", "", "Lastly, the invention also relates to the use of one or more duplex cords according to the invention in the belt bandage of a pneumatic vehicle tire for improving the high-speed properties and the rolling resistance properties.", "", "Preferred embodiments of the invention are explained and described in more detail below with reference to the accompanying experimental data.", "", "Provided as reference system V1 was a triplex cord comprising two yarns of regular aramid and one yarn of nylon with a twist level of 320 T/m. The linear density of the aramid yarns used was 1680 dtex and the linear density of the nylon was 470 dtex.", "", "In the duplex cord E1 according to the invention, a high-modulus aramid (HM aramid) with a linear density of 1610 dtex was used and was end-twisted with a nylon yarn with 1400 dtex.", "", "The Z value of the high-modulus aramid was 678 mN/tex. The Z value of the nylon was 50 mN/tex and the Y value of the nylon was 135 mN/tex. The corresponding values were determined from the force-elongation diagrams of the yarns, which were determined with a tensile testing machine from Zwick in accordance with the standard ASTM D885/D885M of 2014.", "", "The corresponding reinforcing cords were processed in composite materials into belt bandages and also used in 245/40 ZR18 (“extreme contact” DWS06) tires. The tires with duplex cords according to the invention exhibited a lower rolling resistance and comparable high-speed properties here.", "", "It is evident from the following table 1 that the force required for a specific elongation (LASE; “load at specified elongation”) in duplex cords according to the invention advantageously excellently matches the values obtained for the triplex cords from the prior art. It is also evident here from table 1 that the overall diameter of the duplex cord according to the invention is significantly below the overall diameter of the reference system and that accordingly a thinner ply thickness can be established with the same amount of rubber coating over the cord. The duplex cord according to the invention is easier and more cost-effective to produce here because of the one-stage manufacturing process (“twist-process”) used.", "", "In the light of the data shown in table 1 below, it is also evident to a person skilled in the art that, with duplex cords according to the invention, for the same overall diameter, reinforcing cords could also be obtained which have a higher modulus than the corresponding triplex cord.", "", "TABLE 1UnitV1E2Yarns—1680 × 21610 × 1(aramid) +(HM aramid) +470 × 1 (nylon)1400 × 1 (nylon)EPDM—8090LASE 2%N3631N/cm288279LASE 4%N122107N/cm976963Diametermm0.900.75Spacingmm0.350.36Ply thicknessmm1.301.15Rubber over cordmm0.200.20TwistT/m320361Twist factor—198198Twist process—2 steps1 stepLinear density—7.141.15quotient X"], "claims": ["1 .- 10 . (canceled)", "two yarns that are twisted together at the ends; the first yarn has a Z value of 600 mN/tex or more; the second yarn has a Z value of 75 mN/tex or less and a Y value of 150 mN/tex or less; where Z is the force normalized to the linear yarn density at which an elongation of 1% is obtained in the force-elongation diagram; where Y is the force normalized to the linear yarn density at which an elongation of 4% is obtained in the force-elongation diagram; and where the quotient X of the linear density of the first yarn divided by the linear density of the second yarn is in the range from 1.0 to 1.3.", "12 . The duplex cord of claim 11 , wherein the quotient X of the linear density of the first yarn divided by the linear density of the second yarn is in the range from 1.05 to 1.25, preferably in the range from 1.1 to 1.2, particularly preferably in the range from 1.13 to 1.17.", "13 . The duplex cord of claim 11 , wherein the first yarn has a Z value of 650 mN/tex or more, preferably 700 mN/tex or more.", "14 . The duplex cord of claim 11 , wherein the first yarn comprises a material selected from the group consisting of aromatic polyamides, in particular poly(p-phenyleneterephthalamide), and polyoxazoles, in particular poly(p-phenylene-2,6-benzobisoxazole), the first yarn preferably consisting of this material.", "15 . The duplex cord of claim 11 , wherein the first yarn has a linear density in the range from 1000 to 3000 dtex, preferably in the range from 1500 to 2000 dtex.", "16 . The duplex cord of claim 11 , wherein the second yarn has a linear density in the range from 1000 to 2000 dtex, preferably in the range from 1300 to 1700 dtex.", "a composite material comprising the duplex cord at least partially covered by a crosslinkable rubberization mixture.", "18 . The duplex cord of claim 17 , wherein the composite material is vulcanized.", "a plurality of duplex cords employed in composite material; the plurality of cords each comprising: two yarns that are twisted together at the ends; the first yarn has a Z value of 600 mN/tex or more; the second yarn has a Z value of 75 mN/tex or less and a Y value of 150 mN/tex or less; where Z is the force normalized to the linear yarn density at which an elongation of 1% is obtained in the force-elongation diagram; where Y is the force normalized to the linear yarn density at which an elongation of 4% is obtained in the force-elongation diagram; and where the quotient X of the linear density of the first yarn divided by the linear density of the second yarn is in the range from 1.0 to 1.3.", "20 . The tire of claim 19 , further comprising a belt bandage having the plurality of cords.", "two yarns comprising a first yarn and a second yart that are twisted together at the ends; the first yarn is a high-modulus yarn and has a Z value of 600 mN/tex or more; the second yarn is a low-modulus yarn and has a Z value of 75 mN/tex or less and a Y value of 150 mN/tex or less; the first yarn and the second yarn have matched linear densities to force-elongation characteristics; where Z is the force normalized to the linear yarn density at which an elongation of 1% is obtained in the force-elongation diagram; where Y is the force normalized to the linear yarn density at which an elongation of 4% is obtained in the force-elongation diagram; where the quotient X of the linear density of the first yarn divided by the linear density of the second yarn is in the range from 1.13 to 1.17; the first yarn has a Z value of 700 mN/tex or more; the first yarn comprises a material selected from the group consisting poly(p-phenyleneterephthalamide), and polyoxazoles, in particular poly(p-phenylene-2,6-benzobisoxazole); the first yarn has a linear density in the range from 1500 to 2000 dtex; and the second yarn has a linear density in the range from 1300 to 1700 dtex."], "bibtex": "@patent{20240316989,\n    title = {DUPLEX CORD FOR USE AS A REINFORCEMENT IN A BELT BANDAGE OF A PNEUMATIC VEHICLE TYRE},\n    number = {20240316989},\n    year = {2024},\n    note = {File: US20240316989A1-20240926.XML}\n    }", "classification": "B60C900FI"}, {"title": "PNEUMATIC TIRE CAPABLE OF MAINTAINING STEERING ABILITY AND IMPROVING DRAINAGE", "doc_number": "20240316990", "filename": "US20240316990A1-20240926.XML", "abstract": "A pneumatic tire capable of maintaining steering ability and improving drainage includes a tire body, a plurality of first auxiliary grooves, a plurality of second auxiliary grooves, and a plurality of third auxiliary grooves. Each first auxiliary groove is gradually tapered from a first outer end toward an outer side. Each second auxiliary groove is gradually tapered from a second outer end toward an inner side. Each third auxiliary groove is gradually tapered from a third inner end toward the outer side. Each groove is in the form of a tapered, jagged groove to improve drainage efficiency and increase the rigidity of two shoulder portions of the tire body.", "detailed_description": ["Embodiments of the present invention will now be described, by way of example only, with reference to the accompanying drawings.", "", "As shown inFIG.1andFIG.2, the present invention discloses a pneumatic tire capable of maintaining steering ability and improving drainage, comprising a tire body1, a plurality of first auxiliary grooves2, a plurality of second auxiliary grooves3, and a plurality of third auxiliary grooves4.", "", "The tire body1defines an outer side and an inner side opposite to the outer side, that is, when the tire is installed to a vehicle, the side far away from the vehicle is defined as the outer side, and the side close to the vehicle is defined as the inner side. The tire body1has an outer shoulder portion11, an outer main groove12, an inner main groove13, and an inner shoulder portion14. The outer shoulder portion11is located on the outer side. The inner shoulder portion14is located on the inner side. Between the outer shoulder portion11and the inner shoulder portion14, the outer main groove12is adjacent to the outer shoulder portion11, and the inner main groove13is adjacent to the outer main groove12and the inner shoulder portion14.", "", "The tire body1has a circumferential direction and an axial direction perpendicular to the circumferential direction. A ground contact pressure line P and a ground contact end line Te adjacent to the ground contact pressure line P are defined on each of the outer shoulder portion11and the inner shoulder portion14along the circumferential direction. The ground contact pressure line P refers to the pressure generated when the tire body1is in contact with the ground, which is distributed on the outer shoulder portion11where the pressure is higher. A ground contact width TW is defined along the axial direction between the two ground contact end lines Te. The ground contact width TW is between 185 and 245 mm.", "", "The plurality of first auxiliary grooves2are disposed on the outer shoulder portion11. The first auxiliary grooves2each include a first inner end21, a first outer end22, a first notch23, and a first tip24. The first inner end21is close to the inner side. The first notch23is close to the inner side and extends toward the inside of the corresponding first auxiliary groove2. The first outer end22is on the edge of the first notch23close to the outer side and away from the inside of the corresponding first auxiliary groove2. The first tip24is on the edge of the first notch23close to the outer side and close to the inside of the corresponding first auxiliary groove2. In the axial direction, the first tip24is located on the outer side of the first outer end22.", "", "The plurality of second auxiliary grooves3are adjacent to the first auxiliary grooves2and are disposed on the outer shoulder portion11. Preferably, the first auxiliary grooves2and the second auxiliary grooves3are alternately arranged on the outer shoulder portion11along the circumferential direction. The second auxiliary grooves3each include a second inner end31, a second outer end32, a second notch33, and a second tip34. The second inner end31is close to the inner side. The second notch33is close to the outer side and extends toward the inside of the corresponding second auxiliary groove3. The second outer end32is on the edge of the second notch33close to the inner side and away from the inside of the corresponding second auxiliary groove3. The second tip34is on the edge of the second notch33close to the inner side and close to the inside of the corresponding second auxiliary groove3. In the axial direction, the second tip34is located on the inner side of the second outer end32.", "", "The plurality of third auxiliary grooves4are disposed on the inner shoulder portion14. The third auxiliary grooves4each include a third inner end41, a third outer end42, a third notch43, and a third tip44. The third outer end42is close to the outer side. The third notch43is close to the inner side and extends toward the inside of the corresponding third auxiliary groove4. The third inner end41is on the edge of the third notch43close to the outer side and away from the inside of the corresponding third auxiliary groove4. The third tip44is on the edge of the third notch43close to the outer side and close to the inside of the corresponding third auxiliary groove4. In the axial direction, the third tip44is located on the outer side of the third inner end41.", "", "Each first auxiliary groove2is gradually tapered from the first outer end22toward the outer side. Each second auxiliary groove3is gradually tapered from the second outer end32toward the inner side. Each third auxiliary groove4is gradually tapered from the third inner end41toward the outer side. Each groove is in the form of a tapered, jagged groove.", "", "The sharp edges of the first inner end21, the first outer end22, the first tip24, the second inner end31, the second outer end32, the second tip34, the third inner end41, the third outer end42and the third tip44are beneficial to wet grip performance.", "", "Referring toFIG.2andFIG.3, the ground contact pressure line P and the ground contact end line Te on the outer shoulder portion11pass through the first auxiliary grooves2and the second auxiliary grooves3. A first ground contact pressure groove width W1is defined along the ground contact pressure line P on each first auxiliary groove2. A first ground contact end groove width W2is defined along the ground contact end line Te on each first auxiliary groove2. A second ground contact pressure groove width W3is defined along the ground contact pressure line P on each second auxiliary groove3. A second ground contact end groove width W4is defined along the ground contact end line Te on each second auxiliary groove3.", "", "The ground contact pressure line P and the ground contact end line Te on the inner shoulder portion14pass through the third auxiliary grooves4. A third ground contact pressure groove width W5is defined along the ground contact pressure line P on each third auxiliary groove4. A third ground contact end groove width W6is defined along the ground contact end line Te on each third auxiliary groove4.", "", "The first ground contact pressure groove width W1is between 7.5 and 11.3 mm. The second ground contact pressure groove width W3is between 9.3 and 12.5 mm. The third ground contact pressure groove width W5is between 9.8 and 17.2 mm. By selecting the values of the first ground contact pressure groove width W1, the second ground contact pressure groove width W3and the third ground contact pressure groove width W5, the pneumatic tire can maintain steering ability and improve drainage performance.", "", "The first ground contact end groove width W2is between 3 and 4.5 mm. The second ground contact end groove width W4is between 3.7 and 5 mm. The third ground contact end groove width W6is between 6.4 and 10.2 mm.", "", "Preferably, the first ground contact end width W2is between 30% and 40% of the first ground contact pressure groove width W1. The second ground contact end width W4is between 30% and 40% of the second ground contact pressure groove width W3. The third ground contact end width W6is between 58% and 68% of the third ground contact pressure groove width W5. The first ground contact pressure groove width W1is less than the second ground contact pressure groove width W3. The second ground contact pressure groove width W3is less than the third ground contact pressure groove width W5.", "", "The first ground contact pressure groove width W1, the second ground contact pressure groove width W3and the third ground contact pressure groove width W5on the ground contact pressure line P are wider, which increases the groove capacity to enhance the drainage efficiency, so that the vehicle can retain excellent grip even on slippery roads.", "", "The first ground contact end groove width W2, the second ground contact end groove width W4and the third ground contact end groove width W6on the ground contact end line Te are narrower, which improves the rigidity of the outer shoulder portion11and the inner shoulder portion14. Further, the ratio of the first ground contact end groove width W2, the second ground contact end groove width W4and the third ground contact end groove width W6can be adjusted. With different ratios, the outer shoulder portion11and the inner shoulder portion14may obtain different rigidities, thereby achieving excellent steering stability.", "", "The first ground contract pressure groove width W1is between 2% and 7% of the ground contact width TW. The second ground contract pressure groove width W3is between 2% and 7% of the ground contact width TW. The third ground contract pressure groove width W5is between 2% and 7% of the ground contact width TW.", "", "Referring toFIG.2throughFIG.4, a first distance L1is defined between the first auxiliary groove2and the outer main groove12. The first distance L1is between 2% and 6% of the ground contact width TW. A second distance L2is defined between the second auxiliary groove3and the outer main groove12. The second distance L2is between 11% and 15% of the ground contact width TW. A third distance L3is defined between the third auxiliary groove4and the inner main groove13. The third distance L3is between 4% and 8% of the ground contact width TW.", "", "A second groove length La is defined along the axial direction from the second inner end31to the second outer end32. The second groove length La is between 14% and 18% of the ground contact width TW. A third groove length Lb is defined along the axial direction from the third inner end41to the third outer end42. The third groove length Lb is between 14% and 18% of the ground contact width TW.", "", "The pneumatic tire capable of maintaining steering ability and improving drainage provided by the present invention is tested in a real vehicle as a first embodiment and a second embodiment according to the parameters in the following Table 1, and a conventional tire is tested as a comparative example according to the parameters in the following Table 1.", "", "In the following Table 1, W2/W1is the ratio of the first ground contact end groove width W2to the first ground contact pressure groove width W1. W4/W3is the ratio of the second ground contact end groove width W4to the second ground contact pressure groove width W3. W6/W5is the ratio of the third ground contact end groove width W6to the third ground contact pressure groove width W5. W1/TW is the ratio of the first ground contact pressure groove width W1to the ground contact width TW. W3/TW is the ratio of the second ground contact pressure groove width W3to the ground contact width TW. W5/TW is the ratio of the third ground contact pressure groove width W5to the ground contact width TW.", "", "Dry grip and wet grip are measured in points. The higher points, the better grip. The control stability and drainage performance are the proportions of the values of dry traction and wet traction divided by the values of the corresponding comparative example, respectively.", "", "TABLE 1Test parameters and results:comparativefirstsecondexampleembodimentembodimentW2/W1—39%39%W4/W3—40%34%W6/W5—64%61%W1/TW—4%6%W3/TW—4%6%W5/TW—4%6%dry grip77.257wet grip777.25dry traction90.987.889.0wet traction18.818.618.5steering stability100%103%102%drainage performance100%101%102%", "", "According to the results of real vehicle tests, the pneumatic tire capable of maintaining steering ability and improving drainage provided by the present invention has good performance in terms of grip and traction in dry handling test. In the wet grip test, the ride passing through the water surface is smooth, without any obvious driving resistance and hydroplaning.", "", "Referring toFIG.2andFIG.5relating to the turning power test. The following Table 2 andFIG.5show the turning power test results of the comparative example and the first embodiment.", "", "TABLE 2Turning power test results:tire vertical load (Newton)10052533420155087036cornering powercomparative6541580237928713082(Newton/degree)examplefirst embodiment6831647251630923392", "", "MTS's Flat-Trac steady state system is used. Since turning power is the rate at which the turning force increases as the slip angle increases, the higher the cornering power, the higher the cornering ability and stability of the tire.", "", "From the data of Table 2 above, it can be seen that the pneumatic tire capable of maintaining steering ability and improving drainage provided by the present invention has better cornering power and stability than the comparative example, regardless of the amount of vertical load.", "", "Although particular embodiments of the present invention have been described in detail for purposes of illustration, various modifications and enhancements may be made without departing from the spirit and scope of the present invention. Accordingly, the present invention is not to be limited except as by the appended claims."], "claims": ["a tire body, defining an outer side and an inner side opposite to the outer side, the tire body having an outer shoulder portion located on the outer side and an inner shoulder portion located on the inner side, the tire body having a circumferential direction and an axial direction perpendicular to the circumferential direction; a plurality of first auxiliary grooves, disposed on the outer shoulder portion; a plurality of second auxiliary grooves, adjacent to the first auxiliary grooves and disposed on the outer shoulder portion; and a plurality of third auxiliary grooves, disposed on the inner shoulder portion; the first auxiliary grooves each including a first inner end close to the inner side, a first notch close to the inner side and extending toward an inside of the corresponding first auxiliary groove, a first outer end on an edge of the first notch close to the outer side and away from the inside of the corresponding first auxiliary groove, and a first tip the edge of the first notch close to the outer side and close to the inside of the corresponding first auxiliary groove, each first auxiliary groove being gradually tapered from the first outer end toward the outer side; the second auxiliary grooves each including a second inner end close to the inner side, a second notch close to the outer side and extending toward an inside of the corresponding second auxiliary groove, a second outer end on an edge of the second notch close to the inner side and away from the inside of the corresponding second auxiliary groove, and a second tip on the edge of the second notch close to the inner side and close to the inside of the corresponding second auxiliary groove, each second auxiliary groove being gradually tapered from the second outer end toward the inner side; the third auxiliary grooves each including a third outer end close to the outer side, a third notch close to the inner side and extending toward an inside of the corresponding third auxiliary groove, a third inner end on an edge of the third notch close to the outer side and away from the inside of the corresponding third auxiliary groove, and a third tip on the edge of the third notch close to the outer side and close to the inside of the corresponding third auxiliary groove, each third auxiliary groove being gradually tapered from the third inner end toward the outer side; in the axial direction, the first tip being located on the outer side of the first outer end, the second tip being located on the inner side of the second outer end, the third tip being located on the outer side of the third inner end.", "2 . The pneumatic tire as claimed in claim 1 , wherein a ground contact end line is defined on each of the outer shoulder portion and the inner shoulder portion along the circumferential direction; the ground contact end line on the outer shoulder portion passes through the first auxiliary grooves and the second auxiliary grooves, a first ground contact end groove width is defined along the ground contact end line on each first auxiliary groove, a second ground contact end groove width is defined along the ground contact end line on each second auxiliary groove; the ground contact end line on the inner shoulder portion passes through the third auxiliary grooves, a third ground contact end groove width is defined along the ground contact end line on each third auxiliary groove; the first ground contact end groove width is between 3 and 4.5 mm, the second ground contact end groove width is between 3.7 and 5 mm, and the third ground contact end groove width is between 6.4 and 10.2 mm.", "3 . The pneumatic tire as claimed in claim 2 , wherein a ground contact pressure line is defined on each of the outer shoulder portion and the inner shoulder portion along the circumferential direction; the ground contact pressure line on the outer shoulder portion passes through the first auxiliary grooves and the second auxiliary grooves, a first ground contact pressure groove width is defined along the ground contact pressure line on each first auxiliary groove, a second ground contact pressure groove width is defined along the ground contact pressure line on each second auxiliary groove; the ground contact pressure line on the inner shoulder portion passes through the third auxiliary grooves, a third ground contact pressure groove width is defined along the ground contact pressure line on each third auxiliary groove; the first ground contact pressure groove width is between 7.5 and 11.3 mm, the second ground contact pressure groove width is between 9.3 and 12.5 mm, and the third ground contact pressure groove width is between 9.8 and 17.2 mm.", "4 . The pneumatic tire as claimed in claim 3 , wherein the first ground contact end width is between 30% and 40% of the first ground contact pressure groove width, the second ground contact end width is between 30% and 40% of the second ground contact pressure groove width, and the third ground contact end width is between 58% and 68% of the third ground contact pressure groove width.", "5 . The pneumatic tire as claimed in claim 3 , wherein a ground contact width is defined along the axial direction between the two ground contact end lines on the outer shoulder portion and the inner shoulder portion, the ground contact width is between 185 and 245 mm, the first ground contract pressure groove width is between 2% and 7% of the ground contact width, the second ground contract pressure groove width is between 2% and 7% of the ground contact width, and the third ground contract pressure groove width is between 2% and 7% of the ground contact width.", "6 . The pneumatic tire as claimed in claim 1 , wherein a ground contact pressure line is defined on each of the outer shoulder portion and the inner shoulder portion along the circumferential direction; the ground contact pressure line on the outer shoulder portion passes through the first auxiliary grooves and the second auxiliary grooves, a first ground contact pressure groove width is defined along the ground contact pressure line on each first auxiliary groove, a second ground contact pressure groove width is defined along the ground contact pressure line on each second auxiliary groove; the ground contact pressure line on the inner shoulder portion passes through the third auxiliary grooves, a third ground contact pressure groove width is defined along the ground contact pressure line on each third auxiliary groove; the first ground contact pressure groove width is between 7.5 and 11.3 mm, the second ground contact pressure groove width is between 9.3 and 12.5 mm, and the third ground contact pressure groove width is between 9.8 and 17.2 mm.", "7 . The pneumatic tire as claimed in claim 6 , wherein the first ground contact pressure groove width is less than the second ground contact pressure groove width, and the second ground contact pressure groove width is less than the third ground contact pressure groove width.", "8 . The pneumatic tire as claimed in claim 1 , wherein a ground contact end line is defined on each of the outer shoulder portion and the inner shoulder portion along the circumferential direction, a ground contact width is defined along the axial direction between the two ground contact end lines on the outer shoulder portion and the inner shoulder portion; the tire body further has an outer main groove adjacent to the outer shoulder portion and an inner main groove adjacent to the outer main groove and the inner shoulder portion; a first distance is defined between the first auxiliary groove and the outer main groove, the first distance is between 2% and 6% of the ground contact width; a second distance is defined between the second auxiliary groove and the outer main groove, the second distance is between 11% and 15% of the ground contact width; a third distance is defined between the third auxiliary groove and the inner main groove, and the third distance is between 4% and 8% of the ground contact width.", "9 . The pneumatic tire as claimed in claim 1 , wherein a ground contact end line is defined on each of the outer shoulder portion and the inner shoulder portion along the circumferential direction, a ground contact width is defined along the axial direction between the two ground contact end lines on the outer shoulder portion and the inner shoulder portion; a second groove length is defined along the axial direction from the second inner end to the second outer end, the second groove length is between 14% and 18% of the ground contact width; a third groove length is defined along the axial direction from the third inner end to the third outer end, and the third groove length is between 14% and 18% of the ground contact width.", "10 . The pneumatic tire as claimed in claim 1 , wherein the first auxiliary grooves and the second auxiliary grooves are alternately arranged on the outer shoulder portion along the circumferential direction."], "bibtex": "@patent{20240316990,\n    title = {PNEUMATIC TIRE CAPABLE OF MAINTAINING STEERING ABILITY AND IMPROVING DRAINAGE},\n    number = {20240316990},\n    year = {2024},\n    note = {File: US20240316990A1-20240926.XML}\n    }", "classification": "B60C1103FI"}, {"title": "TIRE", "doc_number": "20240316991", "filename": "US20240316991A1-20240926.XML", "abstract": "A tire comprises a tread portion comprising circumferential grooves and land portions divided thereby. The land portions include a first shoulder land portion and a first middle land portion adjacent thereto. The first shoulder land portion is provided with first shoulder sipes. The middle land portion is provided with first middle sipes. Each of the first shoulder sipes and the first middle sipes comprises a main portion extending in the tire radial direction, and a widened portion having a width greater than the main portion and opened at the tread surface of the land portion. The opening width of the first shoulder sipe at the tread surface is larger than the opening width of the first middle sipe at the tread surface.", "detailed_description": [""], "claims": ["the tread portion comprises a plurality of circumferential grooves extending continuously in the tire circumferential direction between a first tread edge and a second tread edge, and a plurality of land portions divided by the circumferential grooves, the plurality of land portions include a first shoulder land portion including the first tread edge and a first middle land portion adjacent to the first shoulder land portion, the first shoulder land portion is provided with a plurality of first shoulder sipes extending in the tire axial direction, the first middle land portion is provided with a plurality of first middle sipes extending in the tire axial direction, each of the first shoulder sipe and the first middle sipe comprises a maim portion extending in the tire radial direction and a widened portion which opens at the tread surface of the land portion and has a width greater than that of the maim portion, and an opening width of the first shoulder sipe at the tread surface is larger than an opening width of the first middle sipe at the tread surface.", "the first shoulder sipe comprises a portion whose angle with respect to the tire axial direction increases toward the second tread edge.", "the circumferential grooves include a first shoulder circumferential groove between the first shoulder land portion and the first middle land portion, and each of the first shoulder sipe and the first middle sipe communicates with the first shoulder circumferential groove.", "in a tread plan view, the widened portion of the first middle sipe overlaps with a region obtained by extending the widened portion of the first shoulder sipe along its longitudinal direction.", "the first shoulder land portion is provided with sipes only.", "the tread portion has a specified mounting direction to a vehicle, and the first tread edge is positioned on an outer side of the vehicle when mounted on the vehicle.", "the depth of the widened portion of the first shoulder sipe is smaller than the depth of the widened portion of the first middle sipe.", "the first shoulder sipe comprises a shallow portion where the bottom is locally raised.", "the first middle land portion comprises a first longitudinal edge on the first tread edge side, a second longitudinal edge on the second tread edge side, and a tread surface between the first longitudinal edge and the second longitudinal edge, and the first middle sipes include an outer first middle sipe extending from the first longitudinal edge and having a terminal end within the first middle land portion, and an inner first middle sipe extending from the second longitudinal edge and having a terminal end within the first middle land portion.", "the maximum depth of the outer first middle sipe is less than the maximum depth of the inner first middle sipe.", "the tread portion has a specified mounting direction to a vehicle, the first tread edge is positioned on an outer side of the vehicle when mounted on the vehicle, the plurality of land portions include a second shoulder land portion including the second tread edge, the second shoulder land portion is provided with a plurality of second shoulder sipes extending in the tire axial direction, and the total number of the second shoulder sipes is larger than the total number of the first shoulder sipes.", "the first shoulder sipe and the second shoulder sipe are inclined to the same direction with respect to the tire axial direction.", "the maximum angle of the first shoulder sipe with respect to the tire axial direction is larger than the maximum angle of the second shoulder sipe with respect to the tire axial direction.", "the second shoulder sipes include a transverse second shoulder sipe which completely crosses the second shoulder land portion in the tire axial direction, and a terminated second shoulder sipe which extends in the tire axial direction from at least the second tread edge and having a terminal end terminated within the second shoulder land portion.", "the circumferential groove comprises a first groove wall and a second groove wall facing each other, the first groove wall is provided with a plurality of first recesses which are recessed outward in the groove width direction from a groove edge of the circumferential groove which appears in the tread surface of the tread portion, the second groove wall is provided with a plurality of second recesses which are recessed outward in the groove width direction from a groove edge of the circumferential groove which appears in the tread surface of the tread portion, in each of the first recess and the second recess, the amount of recession from the groove edge gradually decreases from the deepest portion which is most recessed outward in the groove width direction toward both sides thereof in the tire circumferential direction, the land portion adjacent to the circumferential groove is provided with a plurality of sipes communicating with the circumferential groove and arranged in the tire circumferential direction, and one of the first recesses and one of the second recesses are provided per a length of 1.0 to 3.0 times one pitch length of the sipes."], "bibtex": "@patent{20240316991,\n    title = {TIRE},\n    number = {20240316991},\n    year = {2024},\n    note = {File: US20240316991A1-20240926.XML}\n    }", "classification": "B60C1112FI"}, {"title": "APPARATUS FOR ESTIMATING WEAR AMOUNT OF TIRE AND METHOD THEREOF", "doc_number": "20240316992", "filename": "US20240316992A1-20240926.XML", "abstract": "An embodiment apparatus for estimating a wear amount of a tire includes a memory storing a model configured to learn a correlation between a driving pattern and the wear amount of the tire and a controller configured to estimate the wear amount of the tire corresponding to the driving pattern of a driver based on the model.", "detailed_description": ["Hereinafter, some embodiments of the present disclosure will be described in detail with reference to the exemplary drawings. In adding the reference numerals to the components of each drawing, it should be noted that the identical or equivalent component is designated by the identical numeral even when it is displayed on other drawings. Further, in describing the embodiments of the present disclosure, a detailed description of the related known configuration or function will be omitted when it is determined that it interferes with the understanding of the embodiments of the present disclosure.", "", "In describing the components of the embodiments according to the present disclosure, terms such as first, second, A, B, (a), (b), and the like may be used. These terms are merely intended to distinguish the components from other components, and the terms do not limit the nature, order, or sequence of the components. Unless otherwise defined, all terms including technical and scientific terms used herein have the same meaning as commonly understood by one of ordinary skill in the art to which this disclosure belongs. It will be further understood that terms, such as those defined in commonly used dictionaries, should be interpreted as having a meaning that is consistent with their meaning in the context of the relevant art and will not be interpreted in an idealized or overly formal sense unless expressly so defined herein.", "", "FIG.1is a block diagram illustrating a configuration of an apparatus for estimating a wear amount of a tire according to an embodiment of the present disclosure.", "", "As shown inFIG.1, an apparatus100for estimating a wear amount of a tire according to an embodiment of the present disclosure may include a memory (i.e., a storage)10, a vehicle network connection device20, an output device30, and a controller40. In this case, depending on a scheme of implementing the apparatus100for estimating a wear amount of a tire according to an embodiment of the present disclosure, components may be combined with each other to be implemented as one, or some components may be omitted.", "", "Regarding each component, the memory10may store a model (e.g., a regression model) that learns a correlation between a driving pattern of a driver and a wear amount of a tire. In this case, the memory10may store a plurality of different models for each vehicle type and tire type. In addition, the tire refers to a left front wheel tire and a right front wheel tire of a vehicle.", "", "The memory10may store various logic, algorithms, and programs required in the process of estimating a wear amount of a tire corresponding to a driving pattern of a driver based on the model.", "", "The memory10may store various logic, algorithms, and programs required in the processes of estimating a wear amount of a tire corresponding to a driving pattern of a driver based on the model and providing the wear amount of the tire to the driver.", "", "The memory10may store various logic, algorithms, and programs required in the processes of estimating a wear amount of a tire corresponding to a driving pattern of a driver based on the model and warning the driver to replace the tire when the wear amount of the tire exceeds a threshold value.", "", "The memory10may store various logic, algorithms, and programs required in the processes of estimating a wear amount of a tire corresponding to a driving pattern of a driver based on the model and providing the wear amount of the tire to an external vehicle management server.", "", "The memory10may include at least one type of a storage medium of memories of a flash memory type, a hard disk type, a micro type, a card type (e.g., a secure digital (SD) card or an extreme digital (XD) card), and the like, and a random access memory (RAM), a static RAM, a read-only memory (ROM), a programmable ROM (PROM), an electrically erasable PROM (EEPROM), a magnetic memory (MRAM), a magnetic disk, and an optical disk type memory.", "", "The vehicle network connection device20may provide a connection interface with a vehicle network. In this case, the vehicle network may include a controller area network (CAN), a controller area network with flexible data-rate (CAN FD), a local interconnect network (LIN), FlexRay, a media oriented systems transport (MOST), Ethernet, and the like.", "", "The output device30may visually or audibly provide the wear amount of the tire of the vehicle to the driver, and when the wear amount of the tire exceeds a threshold value, notify the driver visually or audibly of tire replacement.", "", "The controller40may perform overall control such that each component performs its function. The controller40may be implemented in the form of hardware or software, or may be implemented in a combination of hardware and software. Preferably, the controller40may be implemented as a microprocessor, but is not limited thereto.", "", "In addition, the controller40may estimate the wear amount of the tire corresponding to the driving pattern of a driver based on the model stored in the memory10.", "", "In addition, the controller40may estimate the wear amount of the tire corresponding to the driving pattern of a driver based on the model stored in the memory10and provide the wear amount of the tire to the driver.", "", "In addition, the controller40may estimate the wear amount of the tire corresponding to the driving pattern of a driver based on the model stored in the memory10and warn the driver to replace the tire when the wear amount of the tire exceeds a threshold value.", "", "In addition, the controller40may estimate the wear amount of the tire corresponding to the driving pattern of a driver based on the model stored in the memory10and provide the wear amount of the tire to an external vehicle management server300.", "", "In addition, the controller40may obtain a longitudinal acceleration, a lateral acceleration, a gear ratio, a steering angle, a slope, a yaw rate, a vehicle speed, a tire air pressure, a mileage, a brake operation, and the like from a vehicle network.", "", "Hereinafter, with reference toFIG.2, the process of selecting the type of the model will be described in detail.", "", "FIG.2is a diagram illustrating a process of selecting the type of model provided in an apparatus for estimating a wear amount of a tire according to an embodiment of the present disclosure.", "", "The model may be implemented as, for example, a regression model. Such a regression model is an algorithm for finding a stochastic or statistical correlation in which an estimated value and an actual value correspond 1:1 and is suitable for estimating the wear amount of a tire. Therefore, it is desired to select the optimal regression model from various regression models such as linear regression, ridge regression, K neighbors regressor, decision tree regressor, extratrees regressor, random forest regressor, bagging regressor, Bayesian ridge regression, Huber regressor, gradient boosting regressor, and XGBoost regressor.", "", "As shown inFIG.2, for each regression model, Train root mean square error (RMSE), Test RMSE, a determination coefficient (R-Squared), Train mean absolute percentage error (MAPE), and Test MAPE were calculated.", "", "The optimal regression model for estimating the wear amount of a tire corresponding to the driver's driving pattern should have a low Test RMSE and Test MAPE, a small gap between Train RMSE and Test RMSE, and a high R-Squared.", "", "Because there are Bayesian Ridge regression and Huber regressor as the regression models corresponding to this, it is preferable to select Bayesian Ridge regression and Huber regressor as the optimal regression models. In this case, the variables input to the regression model may include a gear ratio, a steering angle, a slope, a yaw rate, a vehicle speed, a left front wheel tire air pressure, a right front wheel tire air pressure, and a mileage as basic variables, and include a braking energy, an amount of work, and the count percentage of the longitudinal acceleration-lateral acceleration region as derived variables. In this case, the slope means the slope of the road on which the vehicle travels.", "", "When Bayesian Ridge regression is selected as the optimal regression model, the controller40may estimate the wear amount (Y) of a tire corresponding to the driver's driving pattern based on, for example, the following Equation 1. In this case, Equation 1 may be changed according to the type of vehicle and the type of tire.", "", "Y=a1⁢X1+a2⁢X2+a3⁢X3-a4⁢X4-a5⁢X5+a6⁢X6+a7⁢X7-a8⁢X8-a9⁢X9-a10⁢X10+a11⁢X11+a12⁢X12+a13⁢X13-a14⁢X14-a15⁢X15+a16⁢X16-a17⁢X17-a18⁢X18+a19⁢X19-a20⁢X20-a21⁢X21+a22⁢X22-a23⁢X23+a24⁢X24+a25⁢X25-a26⁢X26+a27⁢X27-a28⁢X28-a29⁢X29+a30⁢X30+a31⁢X31-a32⁢X32+a33⁢X33-a34⁢X34+a35⁢X35-a36⁢X36+a37⁢X37+0.601Equation⁢1", "", "In Equation 1, a1to a37are constants as weights.", "", "When Huber regressor is selected as the optimal regression model, the controller40may estimate the wear amount (Y) of a tire corresponding to the driver's driving pattern based on, for example, the following Equation 2. In this case, Equation 2 may be changed according to the type of vehicle and the type of tire.", "", "Y=-b1⁢X1+b2⁢X2+b3⁢X3-b4⁢X4+b5⁢X5+b6⁢X6+b7⁢X7+b8⁢X8-b9⁢X9-b10⁢X10+b11⁢X11-b12⁢X12-b13⁢X13-b14⁢X14-b15⁢X15+b16⁢X16-b17⁢X17-b18⁢X18+b19⁢X19-b20⁢X20+b21⁢X21+b22⁢X22-b23⁢X23-b24⁢X24+b25⁢X25-b26⁢X26+b27⁢X27-b28⁢X28+b29⁢X29+b30⁢X30+b31⁢X31-b32⁢X32+b33⁢X33-b34⁢X34+b35⁢X35-b36⁢X36+b37⁢X37+0.602Equation⁢2", "", "In Equation 1, b1to b37are constants as weights.", "", "Hereinafter, the factors used in Equation 1 and Equation 2 are defined as follows.", "", "X1represents braking energy and represents a value obtained by subtracting the kinetic energy at the end of a brake operation from the kinetic energy at the start of the brake operation. For reference, when braking energy is calculated for 100 seconds in units of 1 second, braking energy in a time period in which braking does not occur becomes zero.", "", "X2is the amount (W) of work while the brake is operating, and the controller40may calculate it based on following Equation 3. For reference, because the weights of vehicles are the same, the weight of a vehicle is not taken into account when calculating the amount of work.", "", "W=|longitudinal acceleration×vehicle speed|+|lateral acceleration×yaw rate×vehicle speed|  Equation 3:", "", "In Equation 3, ∥ represents an absolute value.", "", "X3to X7represent the count ratio of the longitudinal acceleration-lateral acceleration region and will be described in detail with reference toFIG.3.", "", "FIG.3is a diagram illustrating a count ratio of a longitudinal acceleration-lateral acceleration region determined by a controller provided in an apparatus for estimating a wear amount of a tire according to an embodiment of the present disclosure.", "", "InFIG.3, the vertical axis represents the longitudinal acceleration, the horizontal axis represents the lateral acceleration, and a region composed of the longitudinal acceleration and the lateral acceleration forms a plurality of grids having a size of 0.02 m/s2.", "", "33.2% of a plurality of points corresponding to the longitudinal acceleration and lateral acceleration collected in units of 1 second, for example, during a preset time is included in a first grid310, 44.5% is included in a second grid320, 15.8% is included in a third grid330, 4.1% is included in a fourth grid340, and 0.8% is included in a fifth grid350.", "", "Accordingly, X3is 33.2 as a ratio of points included in the first grid310, X4is 44.5 as a ratio of points included in the second grid320, X5is 15.8 as a ratio of points included in the third grid330, X6is 4.1 as a ratio of points included in the fourth grid340, and X7is 0.8 as a ratio of points included in the fifth grid350.", "", "X8to X11are variables representing the number of times each gear ratio is set while the brake is operating, where X8represents the number of times the park (P) and neutral (N) stages are set, X9represents the number of times a random gear ratio is set among gear ratios greater than or equal to the first gear ratio and less than the fifth gear ratio, X10represents the number of times a random gear ratio is set among gear ratios greater than or equal to the fifth gear ratio and less than the ninth gear ratio, and X11represents the number of times that the ninth gear ratio or higher is set. For example, it is assumed that the brake is operated for 10 seconds, the third gear ratio is set from the 1st second to the 7th second, and the fifth gear ratio is set from the 8th second to the 10th second. When data is collected in units of 1 second, the third gear ratio is collected 7 times, and the fifth gear ratio is collected 3 times. Therefore, X9is ‘7’ and X10is ‘3’. In this case, X8and X11become ‘0 (zero)’.", "", "X12to X17are variables representing the number of times each steering angle is collected while the brake is operating, where X12represents the number of times the steering angle is included in the section where the steering angle is less than −90 (zero) degrees, X13represents the number of times the steering angle is included in the section where the steering angle is more than −90 (zero) degrees and less than −45 degrees, X14represents the number of times the steering angle is included in the section where the steering angle is greater than or equal to −45 degrees and less than 0 (zero) degrees, X15represents the number of times the steering angle is included in the section where the steering angle is greater than or equal to 0 (zero) degrees and less than 45 degrees, X16represents the number of times the steering angle is included in the section where the steering angle is greater than or equal to 45 degrees and less than 90 (zero) degrees, and X17represents the number of times included in the section where the steering angle is 90 (zero) degrees or more. For example, it is assumed that the brake is applied for 10 seconds, the steering angle is −60 (zero) degrees from the 1st second to the 3rd second, the steering angle is −30 (zero) degrees from the 4th second to the 7th second, and the steering angle is 0 from the 8th second to the 10th second. When the steering angle is collected in units of 1 second, −60 (zero) degrees is collected 3 times, −30 (zero) degrees is collected 4 times, and 0 (zero) degrees is collected 3 times. Therefore, X13is 3, X14is 4, and X15is 3. In this case, X12, X16, and X17become ‘0 (zero)’.", "", "X18to X21are variables representing the number of times each slope is collected while the brake is operating, where X18represents the number of times the slope is included in the section where the slope is less than −5 degrees, X19represents the number of times the slope is included in the section where the slope is equal to or more than −5 degrees and less than 0 (zero) degrees, X20represents the number of times the slope is included in the section where the slope is equal to or more than 0 (zero) degrees and less than 5 degrees, and X21represents the number of times the slope is included in the section where the slope is equal to or more than 5 degrees. For example, it is assumed that the brake is applied for 10 seconds, the slope is −3 degrees from the 1st second to the 7th second, and the slope is 0 (zero) degrees from the 8th second to the 10th second. When data is collected in units of 1 second, −3 degrees is collected 7 times and 0 (zero) degrees is collected 3 times. Therefore, X19is 7 and X20is 3. In this case, X18and X21become 0 (zero).", "", "X22to X25are variables representing the number of times each yaw rate is collected while the brake is operating, where X22represents the number of times the yaw rate is included in the section where the yaw rate is less than −5, X23represents the number of times the yaw rate is included in the section where the yaw rate is equal to or more than −5 and less than 0 (zero), X24represents the number of times the yaw rate is included in the section where the yaw rate is equal to or more than 0 (zero) and less than 5, and X25represents the number of times the yaw rate is included in the section where the yaw rate is equal to or more than 5.", "", "X26to X30are variables representing the number of times each vehicle speed is collected while the brakes were operating, where X26represents the number of times a stop state occurs, X27represents the number of times the vehicle speed is included in the section where the vehicle speed is less than 20 km/h, X28represents the number of times the vehicle speed is included in the section where the vehicle speed is equal to or more than 20 km/h and less than 50 km/h, X29represents the number of times the vehicle speed is included in the section where the vehicle speed is equal to or more than 50 km/h and less than 100 km/h, and X30represents the number of times the vehicle speed is included in the section where the vehicle speed is equal to or more than 100 km/h.", "", "X31to X33are variables representing the number of times the air pressure of each tire of the right front wheel is collected while the brake is operating, where X31represents the number of times the right front wheel tire pressure is included in the section where the right front wheel tire pressure is less than 38, X32represents the number of times the right front wheel tire pressure is included in the section where the right front wheel tire pressure is equal to or more than 38 and less than 41, and X33represents the number of times the right front wheel tire pressure is included in the section where the right front wheel tire pressure is 41 or more.", "", "X34to X36are variables representing the number of times the air pressure of each tire of the left front wheel is collected while the brake was operating, where X34represents the number of times the left front wheel tire pressure is included in the section where the left front wheel tire pressure is less than 38, X35represents the number of times the left front wheel tire pressure is included in the section where the left front wheel tire pressure is equal to or more than 38 and less than 41, and X36represents the number of times the left front wheel tire pressure is 41 or more.", "", "X37represents the mileage of the vehicle.", "", "Meanwhile, when Bayesian Ridge regression is selected as the optimal model among the regression models, among the factors that determine the driving pattern of the driver, the order of having a large effect on the wear amount of the tire is X37, X27, X25, X33, X30, X31, X2, X11, X19, X16. This indicates the order of higher weights.", "", "In addition, when the Huber regressor is selected as the optimal model among the regression models, among the factors that determine the driver's driving pattern, the order of having a significant effect on the amount of tire wear is X27, X21, X37, X33, X16, X2, X11, X31, X22, X19. This indicates the order of higher weights.", "", "FIG.4is a block diagram illustrating a vehicle management system to which an apparatus for estimating a wear amount of a tire according to an embodiment of the present disclosure is applied.", "", "As shown inFIG.4, a vehicle management system may include a plurality of vehicles200and the vehicle management server300.", "", "As a first embodiment, the apparatus100for estimating a wear amount of a tire may be provided in each vehicle200to estimate the wear amount of the tire corresponding to the driving pattern of the driver.", "", "As a second embodiment, the apparatus100for estimating a wear amount of a tire, which is provided in the vehicle management server300, may receive factors (X1˜X37) used to grasp the driving pattern of the driver from each vehicle200, and based on the factors, determine the wear amount of the tire corresponding to the driving pattern of the driver for each vehicle.", "", "Each vehicle200may include at least one of a mobile communication module, a wireless Internet module, and a short-range communication module, which is a module providing a communication interface with the vehicle management server300.", "", "The mobile communication module may communicate with the vehicle management server300through a mobile communication network constructed according to a technical standard or communication scheme for mobile communication (e.g., global system for mobile communication (GSM), code division multi access (CDMA), code division multi access 2000 (CDMA2000), enhanced voice-data optimized or enhanced voice-data only (EV-DO), wideband CDMA (WCDMA), high speed downlink packet access (HSDPA), high speed uplink packet access (HSUPA), long term evolution (LTE), long term evolution-advanced (LTEA), and the like).", "", "The wireless Internet module, which is a module for wireless Internet access, may communicate with the vehicle management server300through wireless LAN (WLAN), wireless-fidelity (Wi-Fi), Wi-Fi direct, digital living network alliance (DLNA), wireless broadband (WiBro), world interoperability for microwave access (WiMAX), high speed downlink packet access (HSDPA), high speed uplink packet access (HSUPA), long term evolution (LTE), long term evolution-advanced (LTE-A), and the like.", "", "The short-range communication module may support short-range communication with the vehicle management server300by using at least one of Bluetooth™, radio frequency identification (RFID), infrared data association (IrDA), ultra wideband (UWB), ZigBee, near field communication (NFC), and wireless universal serial bus (USB) technology.", "", "FIG.5is a flowchart of a method of estimating a wear amount of a tire according to an embodiment of the present disclosure.", "", "First, in501, the memory10stores the model that learns a correlation between the driving pattern and the wear amount of a tire.", "", "Then, in502, the controller40estimates the wear amount of the tire corresponding to the driving pattern of the driver based on the model. To this end, the controller40may collect at least one of a longitudinal acceleration, a lateral acceleration, a gear ratio, a steering angle, a slope, a yaw rate, a vehicle speed, a tire air pressure, a mileage, or a combination thereof through a vehicle network. In addition, the controller40may grasp the driving pattern of the driver based on at least one of braking energy, a count ratio of longitudinal acceleration-lateral acceleration, an amount of work, a gear ratio, a steering angle, a slope, a yaw rate, a vehicle speed, a right front wheel tire air pressure, a left front wheel tire air pressure, a mileage, or a combination thereof.", "", "FIG.6is a block diagram illustrating a computing system for executing a method of estimating a wear amount of a tire according to an embodiment of the present disclosure.", "", "Referring toFIG.6, a method of estimating a wear amount of a tire according to an embodiment of the present disclosure described above may be implemented through a computing system. A computing system1000may include at least one processor1100, a memory1300, a user interface input device1400, a user interface output device1500, a memory (i.e., a storage)1600, and a network interface1700connected through a bus1200.", "", "The processor1100may be a central processing device (CPU) or a semiconductor device that processes instructions stored in the memory1300and/or the memory1600. The memory1300and the memory1600may include various types of volatile or non-volatile storage media. For example, the memory1300may include a ROM (read only memory)1310and a RAM (random access memory)1320.", "", "Accordingly, the processes of the method or algorithm described in relation to the embodiments of the present disclosure may be implemented directly by hardware executed by the processor1100, a software module, or a combination thereof. The software module may reside in a storage medium (that is, the memory1300and/or the memory1600), such as a RAM, a flash memory, a ROM, an EPROM, an EEPROM, a register, a hard disk, a solid state drive (SSD), a detachable disk, or a CD-ROM. The exemplary storage medium is coupled to the processor1100, and the processor1100may read information from the storage medium and may write information in the storage medium. In another method, the storage medium may be integrated with the processor1100. The processor1100and the storage medium may reside in an application specific integrated circuit (ASIC). The ASIC may reside in a user terminal. In another method, the processor1100and the storage medium may reside in the user terminal as an individual component.", "", "According to one embodiment of the present disclosure, a model that learns a correlation between a driving pattern of a driver and a wear amount of a tire is provided and a wear amount of a tire corresponding to a driving pattern of a driver is estimated based on the model, so that it is possible to estimate a tire replacement time with high accuracy without requiring the driver to frequently check the wear amount of the tire before driving, and a method thereof.", "", "According to another embodiment of the present disclosure, a model that learns a correlation between a driving pattern of a driver and a wear amount of a tire is provided, a wear amount of a tire corresponding to a driving pattern of a driver is estimated based on the model, and the wear amount of the tire is provided to the driver, so that the driver may easily check the tire condition at any time even while driving, and a method thereof.", "", "According to still another embodiment of the present disclosure, a model that learns a correlation between a driving pattern of a driver and a wear amount of a tire is provided, and a wear amount of a tire corresponding to a driving pattern of a driver is estimated based on the model, so that it is possible to notify the driver of tire replacement when the wear amount of the tire exceeds a threshold value, thereby allowing the driver to replace the tire at an appropriate tire replacement time.", "", "According to still another embodiment of the present disclosure, a model that learns a correlation between a driving pattern of a driver and a wear amount of a tire is provided, a wear amount of a tire corresponding to a driving pattern of a driver is estimated based on the model, and the wear amount of the tire is provided to an external vehicle management server, so that the vehicle management server may provide a potentiometer service, an aftermarket service, or a tire replacement reservation service for each vehicle.", "", "Although exemplary embodiments of the present disclosure have been described for illustrative purposes, those skilled in the art will appreciate that various modifications, additions and substitutions are possible, without departing from the scope and spirit of the disclosure. Therefore, the exemplary embodiments disclosed in the present disclosure are provided for the sake of descriptions, not limiting the technical concepts of the present disclosure, and it should be understood that such exemplary embodiments are not intended to limit the scope of the technical concepts of the present disclosure. The protection scope of the present disclosure should be understood by the claims below, and all the technical concepts within the equivalent scopes should be interpreted to be within the scope of the right of the present disclosure."], "claims": ["a memory storing a model configured to learn a correlation between a driving pattern and the wear amount of the tire; and a controller configured to estimate the wear amount of the tire corresponding to the driving pattern of a driver based on the model.", "2 . The apparatus of claim 1 , wherein the controller is configured to collect at least one of a longitudinal acceleration, a lateral acceleration, a gear ratio, a steering angle, a slope, a yaw rate, a vehicle speed, a tire air pressure, a mileage, or a combination thereof through a vehicle network.", "3 . The apparatus of claim 2 , wherein the model comprises Bayesian Ridge regression or Huber regressor.", "the model comprises Bayesian Ridge regression; and the controller is configured to: collect a mileage through a vehicle network; collect a longitudinal acceleration, a lateral acceleration, a gear ratio, a steering angle, a slope, a yaw rate, a vehicle speed, or a tire air pressure through the vehicle network; and assign a highest weight to the mileage.", "the model comprises Huber regressor; the controller is configured to: collect a vehicle speed through a vehicle network; collect a longitudinal acceleration, a lateral acceleration, a gear ratio, a steering angle, a slope, a yaw rate, a tire air pressure, or a mileage through the vehicle network; and assign a highest weight to the vehicle speed.", "6 . The apparatus of claim 1 , wherein the controller is configured to grasp the driving pattern of the driver based on at least one of a braking energy, a count ratio of longitudinal acceleration-lateral acceleration, an amount of work, a gear ratio, a steering angle, a slope, a yaw rate, a vehicle speed, a right front wheel tire air pressure, a left front wheel tire air pressure, a mileage, or a combination thereof.", "7 . The apparatus of claim 1 , wherein the controller is configured to provide the wear amount of the tire to the driver.", "8 . The apparatus of claim 1 , wherein the controller is configured to warn the driver to replace the tire when the wear amount of the tire exceeds a threshold value.", "9 . The apparatus of claim 1 , wherein the controller is configured to provide the wear amount of the tire to a vehicle management server.", "10 . The apparatus of claim 1 , wherein the memory is configured to store different models corresponding to a type of vehicle and a type of tire.", "storing in a memory a model that learns a correlation between a driving pattern and the wear amount of the tire; and estimating by a controller the wear amount of the tire corresponding to the driving pattern of a driver based on the model.", "12 . The method of claim 11 , wherein estimating the wear amount of the tire comprises collecting, by the controller, at least one of a longitudinal acceleration, a lateral acceleration, a gear ratio, a steering angle, a slope, a yaw rate, a vehicle speed, a tire air pressure, a mileage, or a combination thereof through a vehicle network.", "13 . The method of claim 12 , wherein the model comprises Bayesian Ridge regression or Huber regressor.", "the model comprises Bayesian Ridge regression; and estimating the wear amount of the tire comprises: collecting, by the controller, a mileage through a vehicle network; collecting, by the controller, a longitudinal acceleration, a lateral acceleration, a gear ratio, a steering angle, a slope, a yaw rate, a vehicle speed, or a tire air pressure through the vehicle network; and assigning, by the controller, a highest weight to the mileage.", "the model comprises Huber regressor; and estimating the wear amount of the tire comprises: collecting, by the controller, a vehicle speed through a vehicle network; collecting, by the controller, a longitudinal acceleration, a lateral acceleration, a gear ratio, a steering angle, a slope, a yaw rate, a tire air pressure, or a mileage through the vehicle network; and assigning, by the controller, a highest weight to the vehicle speed.", "16 . The method of claim 11 , wherein estimating the wear amount of the tire comprises grasping, by the controller, the driving pattern of the driver based on at least one of a braking energy, a count ratio of longitudinal acceleration-lateral acceleration, an amount of work, a gear ratio, a steering angle, a slope, a yaw rate, a vehicle speed, a right front wheel tire air pressure, a left front wheel tire air pressure, a mileage, or a combination thereof.", "17 . The method of claim 11 , wherein estimating the wear amount of the tire comprises providing, by the controller, the wear amount of the tire to the driver.", "18 . The method of claim 11 , wherein estimating the wear amount of the tire comprises warning, by the controller, the driver to replace the tire when the wear amount of the tire exceeds a threshold value.", "19 . The method of claim 11 , wherein estimating the wear amount of the tire comprises providing, by the controller, the wear amount of the tire to a vehicle management server.", "20 . The method of claim 11 , wherein storing the model comprises storing, by the memory, different models corresponding to a type of vehicle and a type of tire."], "bibtex": "@patent{20240316992,\n    title = {APPARATUS FOR ESTIMATING WEAR AMOUNT OF TIRE AND METHOD THEREOF},\n    number = {20240316992},\n    year = {2024},\n    note = {File: US20240316992A1-20240926.XML}\n    }", "classification": "B60C1124FI"}, {"title": "TIRE", "doc_number": "20240316993", "filename": "US20240316993A1-20240926.XML", "abstract": "Provided is a tire having a cross-sectional height (SH) ranging from 50 mm to 150 mm, in an unloaded state where the tire is mounted on a specified rim and inflated to a specified internal pressure, an opening distance (A) between the tire and a rim flange on a perpendicular line drawn from an outermost point of the rim flange in a radial direction to an outer surface of the tire with respect to the cross-sectional height (SH) satisfies a relationship 0.01≤A/SH≤0.16 and a projection amount (W) corresponding to one half of a difference between a total width of the tire and a rim width of the specified rim satisfy a relationship 0.03≤A/W≤1.60.", "detailed_description": ["Configurations of embodiments of the present technology will be described in detail below with reference to the accompanying drawings.FIGS.1to12illustrate a pneumatic tire according to an embodiment of the present technology. InFIG.1, one side of the pneumatic tire delimited by a tire equator CL is illustrated, but the pneumatic tire has a symmetrical structure or an asymmetrical structure on both sides of the tire equator CL.", "", "As illustrated inFIG.1, a pneumatic tire10of the present embodiment includes a tread portion1extending in a tire circumferential direction and formed in an annular shape, a pair of sidewall portions2,2disposed on both sides of the tread portion1, and a pair of bead portions3,3disposed on an inner side of the sidewall portions2in a tire radial direction.", "", "A carcass layer4is mounted between the pair of bead portions3,3. The carcass layer4includes a plurality of reinforcing cords extending in the tire radial direction and is folded back around a bead core5disposed in each of the bead portions3from a tire inner side to a tire outer side. A bead filler6having a triangular cross-sectional shape and formed of a rubber composition is disposed on the outer circumference of the bead core5. The carcass layer4includes a body portion4A delimited by the bead core5and a turned-up portion4B.", "", "On the other hand, a plurality of belt layers7are embedded on the outer circumferential side of the carcass layer4in the tread portion1. The belt layers7include a plurality of reinforcing cords that are inclined with respect to the tire circumferential direction, and the reinforcing cords are disposed so as to intersect each other between the layers. In the belt layers7, the inclination angle of the reinforcing cords with respect to the tire circumferential direction is set to fall in a range from 10° to 40°, for example. Steel cords are preferably used as the reinforcing cords of the belt layers7. To improve high-speed durability, at least one belt cover layer8formed by arranging reinforcing cords at an angle of, for example, 5° or less with respect to the tire circumferential direction is disposed on an outer circumferential side of the belt layers7. Organic fiber cords such as nylon and aramid are preferably used as the reinforcing cords of the belt cover layer8.", "", "Note that the tire internal structure described above represents a typical example for the pneumatic tire10, but the pneumatic tire is not limited thereto. InFIG.1, a tread rubber layer11is disposed in the tread portion1, a sidewall rubber layer12is disposed in the sidewall portion2, and a rim cushion rubber layer13is disposed in the bead portion3. An innerliner rubber layer14is disposed on the inner surface of the tire10along the carcass layer4. Additionally, a rim protector15for protecting a rim flange22is formed on the sidewall portion2so as to protrude toward an outer side in a tire width direction.", "", "The tire10described above has a cross-sectional height SH ranging from 50 mm to 150 mm and is mainly a tire for a passenger vehicle. The following configuration is applied to such a tire10. In other words, as illustrated inFIGS.1and2, in an unloaded state where the tire10is mounted on a specified rim21and inflated to the specified internal pressure, an opening distance between the tire10and the rim flange22on a perpendicular line drawn from an outermost point Tr of the rim flange22in a radial direction to the outer surface of the tire10is defined as A (mm), and the opening distance A with respect to the cross-sectional height SH (mm) satisfies the relationship 0.01≤A/SH≤0.16, and a projection amount corresponding to one half of a difference between a total width TW of the tire10and a rim width DW of the specified rim21is defined as W (mm), and the opening distance A with respect to the projection amount W satisfies the relationship 0.03≤A/W≤1.60. When the rim flange22has a portion extending parallel to the tire width direction at the outermost position in the radial direction, the outermost point Tr of the rim flange22in the radial direction is a point that is on the innermost side of the rim flange22in the radial direction in the outermost position of the rim flange22in the radial direction. The total width TW of the tire10is a total width of the tire10at a position in which the carcass layer4is most bulged toward an outer side in the tire width direction. In other words, the rim protector15for protecting the rim flange22is excluded from the total width TW.", "", "In the tire10described above, the opening distance A between the tire10in the unloaded state and the rim flange22with respect to the cross-sectional height SH (mm) satisfies the relationship 0.01≤A/SH≤0.16, and the opening distance A with respect to the projection amount W corresponding to one half of the difference between the total width TW of the tire10and the rim width D W of the specified rim21satisfies the relationship 0.03≤A/W≤1.60. This can properly set the opening distance A with respect to the amount of deflection and deformation of the tire10and effectively reduce a failure due to deflection of the tire10and a failure due to rubbing between the tire10and the flange22. This can reduce a failure at or near the bead portion3and improve the durability of the tire10. In particular, when the aspect ratio of the tire10is 55% or less, excellent durability is required, and in such a case, the effect of improving the durability can be enjoyed to the maximum.", "", "Here, the ratio A/SH of less than 0.01 causes the opening distance A to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the ratio A/SH of more than 0.16 causes the opening distance A to be too large, thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur, and further pebbles or the like to be likely to enter, which may cause the durability to significantly decrease. In particular, it is preferable to satisfy the relationship 0.015≤A/SH≤0.14 and further satisfy the relationship 0.02≤A/SH≤0.12.", "", "Similarly, the ratio A/W of less than 0.03 causes the opening distance A to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the ratio A/W of more than 1.60 causes the opening distance A to be too large, thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur, and further pebbles or the like to be likely to enter, which may cause the durability to significantly decrease. In particular, it is preferable to satisfy the relationship 0.035≤A/W≤1.5 and further satisfy the relationship 0.04≤A/W≤1.4.", "", "In the tire10described above, as illustrated inFIG.3, in a state where the tire10is mounted on the specified rim21, inflated to the specified internal pressure, and loaded with 100% of specified load capacity, an opening distance between the tire10and the rim flange22on the perpendicular line drawn from the outermost point Tr of the rim flange22in the radial direction to the outer surface of the tire10is defined as A100(mm), and the opening distance A100with respect to the cross-sectional height SH (mm) preferably satisfies the relationship 0.003≤A100/SH≤0.100. The measurement position of the opening distance A100is identical to the measurement position of the opening distance A. Thus optimizing the opening distance A100when the tire10is deflected allows the effect of improving the durability to be enhanced.", "", "Here, the ratio A100/SH of less than 0.003 causes the opening distance A100to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the ratio A100/SH of more than 0.100 causes the opening distance A100to be too large and thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In either case, the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 0.005≤A100/SH≤0.070 and further satisfy the relationship 0.007≤A100/SH≤0.065.", "", "In the tire10described above, the opening distance A100(mm) with respect to the projection amount W (mm) preferably satisfies the relationship 0.010≤A100/W≤1.000. This can enhance the effect of improving the durability.", "", "Here, the ratio A100/W of less than 0.010 causes the opening distance A100to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the ratio A100/W of more than 1.000 causes the opening distance A100to be too large and thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In either case, the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 0.015≤A100/W≤0.800 and further satisfy the relationship 0.020≤A100/W≤0.800.", "", "In the tire10described above, the opening distance A (mm) and the opening distance A100(mm) satisfy the relationship 0.20≤A100/A≤0.80. This can reduce stress due to repeated deformation and enhance the effect of improving the durability.", "", "Here, the ratio A100/A of less than 0.20 causes deformation at or near the rim flange22to significantly increase when the tire10is deflected, and thus the effect of improving the durability may decrease. In contrast, the ratio A100/A of more than 0.80 causes deformation at a position away from the rim flange22to significantly increase when the tire10is deflected, and thus the effect of improving the durability may decrease. In particular, it is preferable to satisfy the relationship 0.23≤A100/A≤0.75 and further satisfy the relationship 0.25≤A100/A≤0.70.", "", "In the tire10described above, the opening distance A is preferably in the range 1.5 mm≤A≤8.0 mm. This can reduce stress due to repeated deformation and enhance the effect of improving the durability.", "", "Here, the opening distance A of less than 1.5 mm causes the opening distance A to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the opening distance A of more than 8.0 mm causes the opening distance A to be too large and thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In either case, the effect of improving the durability decreases. In particular, the opening distance A is preferably in the range of 1.8 mm≤A≤7.5 mm, and it is further preferably in the range 2.0 mm A S 7.0 mm.", "", "In the tire10described above, the opening distance A (mm) with respect to a height SDH (mm) in the tire radial direction to the maximum width position (measurement position of the total width TW) of the tire10preferably satisfies the relationship 0.01≤A/SDH≤0.50. Specifying the opening distance A with respect to the height SDH having a significant influence on the deformation of the bead portion3allows stress due to repeated deformation to be reduced and the effect of improving the durability to be enhanced.", "", "Here, the ratio A/SDH of less than 0.01 causes the opening distance A to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the ratio A/SDH of more than 0.50 causes the opening distance A to be too large and thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In either case, the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 0.02≤A/SDH≤0.45 and further satisfy the relationship 0.03≤A/SDH≤0.40.", "", "In the tire10described above, as illustrated inFIG.2, in an unloaded state where the tire10is mounted on the specified rim21and inflated to the specified internal pressure, an opening distance between the tire10and the rim flange22on a perpendicular line drawn from an intermediate point Ur between the outermost point Tr of the rim flange22in the radial direction and an opening start point S at which the rim flange22separates from the tire10to the outer surface of the tire10is defined as A′ (mm), and the opening distance A′ with respect to the cross-sectional height SH (mm) preferably satisfies the relationship 0.006≤A′/SH≤0.150. This can reduce stress due to repeated deformation and enhance the effect of improving the durability.", "", "Here, the ratio A′/SH of less than 0.006 causes the opening distance A′ to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the ratio A′/SH of more than 0.150 causes the opening distance A′ to be too large and thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In either case, the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 0.010≤A′/SH≤0.130 and further satisfy the relationship 0.014≤A′/SH≤0.110.", "", "In the tire10described above, the opening distance A (mm) and the opening distance A′ (mm) preferably satisfy the relationship 0.50≤A′/A≤0.%.", "", "This can reduce stress due to repeated deformation and enhance the effect of improving the durability.", "", "Here, the ratio A′/A of less than 0.50 causes the opening distance A′ to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the ratio A′/A of more than 0.96 causes the opening distance A′ to be too large and thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In either case, the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 0.53≤A′/A≤0.94 and further satisfy the relationship 0.56≤A′/A≤0.92.", "", "In the tire10described above, the opening distance A′ is preferably in the range 1.0 mm≤A′≤7.5 mm. This can reduce stress due to repeated deformation and enhance the effect of improving the durability.", "", "Here, the opening distance A′ of less than 1.0 mm causes the opening distance A′ to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the opening distance A′ of more than 7.5 mm causes the opening distance A′ to be too large and thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In either case, the effect of improving the durability decreases. In particular, the opening distance A′ is preferably in the range 1.2 mm≤A′≤7.0 mm and is further preferably in the range 1.4 mm≤A′≤6.5 mm.", "", "In the tire10described above, as illustrated inFIG.4, in an unloaded state where the tire10is mounted on the specified rim21and inflated to the specified internal pressure, a point at which a horizontal line in the tire width direction passing through the outermost point Tr of the rim flange22in the radial direction intersects with the outer surface of the tire10is defined as P, a point specifying the rim width DW and a rim diameter DO of the specified rim21is defined as Q, and an angle α formed by a straight line connecting the points P and Q and a horizontal line in the tire width direction is preferably in the range 50°≤α≤80°.", "", "The angle α corresponding to the inclination angle of the bead portion3is in the range 50°≤α≤80° in this manner. This can properly set the opening distance A with respect to the amount of deflection and deformation of the tire10and effectively reduce a failure due to deflection of the tire10and a failure due to rubbing between the tire10and the flange22. This can reduce a failure at or near the bead portion3and further enhance the effect of improving the durability of the tire10.", "", "Here, the angle α of less than 50° causes the opening distance A to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the angle α of more than 80° causes the opening distance A to be too large, thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur, and further pebbles or the like to be likely to enter, which may cause the durability to significantly decrease. In particular, it is preferable to satisfy the range 55°≤α≤750 and further satisfy the range 600≤α≤70°.", "", "In the tire10as described above, as illustrated inFIGS.1and5, in an unloaded state where the tire10is mounted on the specified rim21and inflated to the specified internal pressure, a point specifying the total width TW of the tire10is defined as L. and an angle θ formed by the straight line connecting the points P and Q and a straight line connecting the points L and Q is preferably in the range 2°≤θ≤30°. This can properly set the opening distance A with respect to the amount of deflection and deformation and enhance the effect of improving the durability.", "", "Here, the angle θ of less than 2° causes the opening distance A to be insufficient and stress at or near the rim flange to increase when the tire10is deflected, leading to a failure. In contrast, the angle θ of more than 30° causes the opening distance A to be too large and thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In either case, the effect of improving the durability decreases. In particular, it is preferable to satisfy the range 4°≤θ≤250 and further satisfy 6°≤θ≤20°.", "", "In the tire10described above, as illustrated inFIG.6, in an unloaded state where the tire10is mounted on the specified rim21and inflated to the specified internal pressure, the opening start point at which the rim flange22separates from the tire10is defined as S, the outermost point of the rim flange22in the radial direction is defined as Tr, a point at which the perpendicular line drawn from the point Tr to the outer surface of the tire10intersects with the outer surface of the tire10is defined as T. and an angle θ formed by a straight line connecting the points S and T and a straight line connecting the points S and Tr is preferably in the range 15°≤β≤65°. This can enhance the effect of improving the durability.", "", "Here, the angle β of less than 15° causes stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the angle β of more than 65° causes a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In particular, it is preferable to satisfy the range 20°≤β≤60° and further satisfy the range 25°≤β≤55°.", "", "In the tire10described above, as illustrated inFIG.7, a horizontal distance B (mm) in the tire width direction between the points Q and S with respect to the cross-sectional height SH (mm) preferably satisfies the relationship 0.02≤B/SH≤0.18. This allows stress due to repeated deformation to fall within an appropriate range and the effect of improving the durability to be enhanced.", "", "Here, the ratio B/SH of less than 0.02 causes a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In contrast, the ratio B/SH of more than 0.18 causes stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In either case, the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 0.03≤B/SH≤0.15 and further satisfy the relationship 0.04≤B/SH≤0.13.", "", "In the tire10described above, the horizontal distance B is preferably in the range 3.0 mm≤B≤9.0 mm. This allows stress due to repeated deformation to fall within an appropriate range and the effect of improving the durability to be enhanced.", "", "Here, the horizontal distance B of less than 3.0 mm causes a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In contrast, the horizontal distance B of more than 9.0 mm causes stress at or near the rim flange12to increase when the tire10is deflected, leading to a failure. In either case, the effect of improving the durability decreases. In particular, the horizontal distance B is preferably in the range 3.2 mm≤B≤8.5 mm and is further preferably in the range 3.4 mm≤B≤8.0 mm.", "", "In the tire10described above, as illustrated inFIG.8, a point at which the perpendicular line drawn from the outermost point Tr of the rim flange22in the radial direction to the outer surface of the tire10intersects with the outer surface of the tire10is defined as T. and the arc (radius of curvature Rb) of the tire10passing through the points S. P, and T preferably has a center on an outer side in the tire width direction. This makes it difficult for compressive stress to be applied to a portion that comes into contact with the rim flange22of the tire10and thus can enhance the effect of improving the durability.", "", "In particular, as illustrated inFIG.8, the point at which a perpendicular line drawn from the point P to the outer surface of the tire10intersects with the outer surface of the rim flange22is defined as Pr, and the radius of curvature Rb (mm) of the arc of the tire10passing through the points S, P, and T with respect to a radius of curvature Rr (mm) of the arc of the rim flange22passing through the points S, Pr, and Tr preferably satisfies the relationship 1.2≤Rb/Rr≤14.5. This makes it difficult for compressive stress to be applied to a portion that comes into contact with the rim flange22of the tire10and thus can enhance the effect of improving the durability.", "", "Here, when the ratio Rb/Rr is out of the range described above, compressive stress is likely to be applied to a portion of the tire10that comes into contact with the rim flange22, and thus the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 1.5≤Rb/Rr≤12.2 and further satisfy the relationship 2.0≤Rb/Rr≤10.0.", "", "In the tire10described above, as illustrated inFIG.9, in an unloaded state where the tire10is mounted on the specified rim21and inflated to the specified internal pressure, a point at which a horizontal line in the tire width direction passing through an edge portion of the belt layer7on the innermost side in the tire radial direction of the plurality of belt layers7intersects with the outer surface of the tire10is defined as V, the point specifying the total width TW of the tire10is defined as L, and an angle γ formed by a straight line connecting the points L and V and a horizontal line in the tire width direction is preferably in the range 45°≤γ≤80°. This allows stress due to repeated deformation to fall within an appropriate range and the effect of improving the durability to be enhanced.", "", "Here, when the angle γ is out of the range described above, stress due to repeated deformation is out of an appropriate range, and thus the effect of improving the durability decreases. In particular, it is preferable to satisfy the range 50°≤γ≤75° and further satisfy the range 55°≤γ≤70°.", "", "In the tire10described above, as illustrated inFIG.9, a point located at the center between the points L and V in the tire radial direction on the outer surface of the tire10is defined as W, and a radius of curvature Rs of the arc of the tire10passing through the points V, W. and L with respect to the cross-sectional height SH preferably satisfies the relationship 0.3≤Rs/SH≤2.5. This allows stress due to repeated deformation to fall within an appropriate range and the effect of improving the durability to be enhanced.", "", "Here, when the ratio Rs/SH is out of the range described above, stress due to repeated deformation is out of an appropriate range, and thus the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 0.4≤Rs/SH≤2.3 and further satisfy the relationship 0.5≤Rs/SH≤2.0.", "", "In the tire10described above, as illustrated inFIG.10, in an unloaded state where the tire10is mounted on the specified rim21and inflated to the specified internal pressure, the opening start point at which the rim flange22separates from the tire10is defined as S, the point at which the perpendicular line drawn from the outermost point Tr of the rim flange22in the radial direction to the outer surface of the tire10intersects with the outer surface of the tire10is defined as T, two perpendicular lines are drawn from the points S and T to the turned-up portion4B of the carcass layer4, and a cross-sectional area Sr of a rubber portion R (hatched portion) included in a region surrounded by these two perpendicular lines and the turned-up portion4B of the carcass layer4is preferably in the range 12 mm2≤Sr≤101 mm2. The cross-sectional area Sr of the rubber portion R is the cross-sectional area of a portion located further on an outer side than carcass cords constituting the carcass layer4.", "", "As described above, the cross-sectional area Sr of the rubber portion R bearing the buffering function with respect to the rim flange22is in the range 12 mm2≤Sr≤101 mm2. This can properly set the opening distance A with respect to the amount of deflection and deformation of the tire10and effectively reduce a failure due to deflection of the tire10and a failure due to rubbing between the tire10and the flange22. This can reduce a failure at or near the bead portion3and further enhance the effect of improving the durability of the tire10.", "", "Here, the cross-sectional area Sr of the rubber portion R of smaller than 12 mm2causes compressive stress to be likely to be applied to the carcass layer4at or near the rim flange22when the tire10is deflected, leading to a failure. In contrast, the cross-sectional area Sr of larger than 101 mm2makes it difficult to sufficiently have the opening distance A and causes stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In particular, it is preferable to satisfy the range 14 mm2≤Sr≤98 mm2and further satisfy the range 16 mm2≤Sr≤93 mm2.", "", "In the tire10described above, as illustrated inFIG.11, the thickness of the rubber portion R on the perpendicular line drawn from the point S to the turned-up portion4B of the carcass layer4is defined as Gl (mm), the thickness of the rubber portion R on the perpendicular line drawn from the point T to the turned-up portion4B of the carcass layer4is defined as Gu (mm), and the thicknesses Gl and Gu preferably satisfy the relationship 0.40≤Gl/Gu≤0.90. This allows a good buffering function to be ensured and the effect of improving the durability to be enhanced.", "", "Here, when the ratio GI/Gu is out of the range described above, the buffering function decreases, and the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 0.45≤Gl/Gu≤0.85 and further satisfy the relationship 0.50≤Gl/Gu≤0.80. Preferably, the thickness Gl of the rubber portion R satisfies the range 0.5 mm≤Gl≤4.0 mm and further satisfies the range 1.5 mm≤Gl≤3.0 mm. The thicknesses Gl and Gu of the rubber portion R can also be measured in a cut sample of the tire10.", "", "In the tire10described above, as illustrated inFIG.11, in an unloaded state where the tire10is mounted on the specified rim21and inflated to the specified internal pressure, a point at which the perpendicular line drawn from the point S to the turned-up portion4B of the carcass layer4intersects with the turned-up portion4B of the carcass layer4is defined as Sc, a point at which a perpendicular line drawn from the point T to the turned-up portion4B of the carcass layer4intersects with the turned-up portion4B of the carcass layer4is defined as Tc, an intermediate point between the points Sc and Tc is defined as Uc, and the arc (radius of curvature RC) of the carcass layer4passing through points Sc. Tc, and Uc preferably has a center on an outer side in the tire width direction. This makes it difficult for compressive stress to be applied to the carcass layer4when the tire is deformed and thus can enhance the effect of improving the durability. The arc of the carcass layer4passing through the points Sc, Tc, and Uc preferably has a center on an outer side in the tire width direction even in a state where the tire10is a single body while not being mounted on a rim or in a state where a 100% load is applied to the tire.", "", "In particular, as illustrated inFIG.11, the intermediate point between the points S and Tr is defined as Ur, and the radius of curvature Rc (mm) of the arc of the carcass layer4passing through the points Sc, Tc, and Uc with respect to the radius of curvature Rr (mm) of the arc of the rim flange22passing through the points S. Tr, and Ur preferably satisfies the relationship 1≤Rc/Rr≤55. This makes it difficult for compressive stress to be applied to the carcass layer4when the tire is deformed and thus can enhance the effect of improving the durability.", "", "Here, when the ratio Rc/Rr is out of the range described above, compressive stress is likely to be applied to the carcass layer4when the tire is deformed, and thus the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 2≤Rc/Rr≤50 and further satisfy the relationship 3≤Rc/Rr≤45.", "", "FIG.12illustrates a modified example of the bead portion. InFIG.12, the body portion4A and the turned-up portion4B of the carcass layer4are in contact with each other without a bead filler interposed therebetween and thus form a closed region including the bead core5. In other words, the carcass layer4is wound up around the bead core5from the inner side to the outer side of the tire such that the body portion4A and the turned-up portion4B are disposed in close contact with each other at the upper end position of the bead core5. Adopting such a turned-up structure of the carcass layer4allows the carcass layer4to be kept away from the rim flange22at a contact portion with the rim flange22, allowing compressive stress applied to the carcass layer4to be significantly reduced and the effect of improving the durability to be enhanced. The rubber distribution in the closed region formed by the carcass layer4is preferably 15% or less, more preferably 10% or less, and further more preferably 5% or less. The rubber distribution mentioned here is a percentage of a rubber portion (for example, an insulation rubber of a bead wire or a small bead filler) in the closed region formed by the carcass layer4in a tire meridian cross-section.", "", "Additionally, in the structure ofFIG.12, the durability can be improved by disposing the secondary bead filler9on an outer side of the turned-up portion4B of the carcass layer4in the tire width direction or by increasing the thickness of the rim cushion rubber layer13. In this case, the cross-sectional area Sr of the rubber portion R can be set in the range 36 mm2≤Sr≤101 mm2. In particular, it is preferable to satisfy the range 42 mm2≤Sr≤98 mm2and further satisfy the range 48 mm2≤Sr≤93 mm2.", "", "In the tire10described above, as illustrated inFIG.10, when the tire10includes the rim cushion rubber layer13disposed in the region in contact with the rim flange22and the sidewall rubber layer12disposed on an outer side of the rim cushion rubber layer13in the tire radial direction, a boundary point X between the rim cushion rubber layer13and the sidewall rubber layer12on the outer surface of the tire10is preferably located further on an outer side in the tire radial direction than the point T in an unloaded state in which the tire10is mounted on a specified rim and inflated to the specified internal pressure. In other words, the rim cushion rubber layer13preferably extends from the lower side of the bead core5toward the outer side in the tire radial direction at least to the position of the point T. This makes it difficult for compressive stress to be applied to the carcass layer4when the tire is deformed and thus can enhance the effect of improving the durability.", "", "The hardness of the rim cushion rubber layer13at 20° C. is preferably 55 or more and 80 or less. This can improve the durability of the rim cushion rubber layer13. Here, when the hardness of the rim cushion rubber layer13is out of the range described above, the effect of improving the durability decreases. The hardness is the durometer hardness measured in accordance with JIS (Japanese Industrial Standard)-K6253 with the use of a type A durometer and under a temperature of 20° C.", "", "The 100% modulus of the rim cushion rubber layer13at 20° C. is preferably 2.0 MPa or more and 9.5 MPa or less. This can improve the durability of the rim cushion rubber layer13. Here, when the 100% modulus of the rim cushion rubber layer13is out of the range described above, the effect of improving the durability decreases. The 100% modulus is a predetermined tensile stress measured at a temperature of 20° C. in accordance with JIS-K6251.", "", "The loss tangent (tan δ) at 20° C. of the rim cushion rubber layer13is preferably 0.05 or more and 0.35 or less. This can suppress an increase in rolling resistance while having the thickness (durability) of the rim cushion rubber layer13. Here, the loss tangent of the rim cushion rubber layer13of more than 0.35 will cause the rolling resistance to increase. Loss tangent (tan δ) is measured according to JIS-K6394 using a viscoelastic spectrometer (available from Toyo Seiki Seisaku-sho, Ltd.) at a frequency of 20 Hz, an initial strain of 10%, a dynamic strain of 2%, and a temperature of 60° C.", "", "The intermediate elongation of the carcass cords constituting the carcass layer4under a load of 1.5 cN/dtex is preferably 3.3% or more and 6.2% or less. This can enhance the effect of improving the durability. Here, when the intermediate elongation under a load of 1.5 cN/dtex of the carcass cords constituting the carcass layer4is out of the range described above, the effect of improving the durability decreases. In particular, the intermediate elongation of the carcass cords under a load of 1.5 cN/dtex is preferably 3.8% or more and 5.9% or less. The intermediate elongation is measured by performing a tensile test, on the carcass cords removed from the sidewall portion of the tire10, in accordance with JIS-L1017 at a length between grips of 250 mm and a tensile speed of 300±20 mm/minute.", "", "The carcass cords constituting the carcass layer4are organic fiber cords. When, for example, high-modulus rayon cords are used as the carcass cords, the durability is improved. The total thickness of the carcass layer4is preferably 0.8 mm or more and 1.5 mm or less. In the case of the rayon cords, the cord diameter is preferably 0.6 mm or more and 1.1 mm or less, and the cord density is preferably 43 cords or more/50 mm and 59 cords or less/50 mm. Polyester cords having excellent fatigue resistance are also preferable as carcass cords. In the case of the polyester cords, the cord diameter is preferably 0.7 mm or more and 1.2 mm or less, and the cord density is preferably 44 cords or more/50 mm and 60 cords or less/50 mm.", "", "Further, the angle of the carcass cords constituting the carcass layer4with respect to the tire circumferential direction can be set in the range of 75° or more and 90° or less. In particular, when the angle of the carcass cords is set to be less than 88°, the tire rigidity is increased and thus the durability is improved. Furthermore, the turned-up portion4B of the carcass layer4preferably extends beyond the tire maximum width position to a position overlapped with the edge portion of the belt layer7. Adopting such a turned-up portion structure increases the tire rigidity, thus improving the durability."], "claims": ["1 - 9 . (canceled)", "10 . A tire having a cross-sectional height SH ranging from 50 mm to 150 mm, in an unloaded state where the tire is mounted on a specified rim and inflated to a specified internal pressure, an opening distance between the tire and a rim flange on a perpendicular line drawn from an outermost point of the rim flange in a radial direction to an outer surface of the tire being defined as A, and the opening distance A with respect to the cross-sectional height SH satisfying a relationship 0.01≤A/SH≤0.16, and a projection amount corresponding to one half of a difference between a total width TW of the tire and a rim width DW of the specified rim being defined as W, and the opening distance A with respect to the projection amount W satisfying a relationship 0.03≤A/W≤1.60.", "11 . The tire according to claim 10 , wherein in a state where the tire is mounted on the specified rim, inflated to the specified internal pressure, and loaded with 100% of specified load capacity, an opening distance between the tire and the rim flange on the perpendicular line drawn from the outermost point of the rim flange in the radial direction to the outer surface of the tire is defined as A 100 , and the opening distance A 100 with respect to the cross-sectional height SH satisfies a relationship 0.003≤A 100 /SH≤0.100.", "12 . The tire according to claim 11 , wherein the opening distance A 100 with respect to the projection amount W satisfies a relationship 0.010≤A 100 /W≤1.000.", "13 . The tire according to claim 11 , wherein the opening distance A and the opening distance A 100 satisfy a relationship 0.20≤A 100 /A≤0.80.", "14 . The tire according to claim 10 , wherein the opening distance A is in a range 1.5 mm≤A≤8.0 mm.", "15 . The tire according to claim 10 , wherein the opening distance A with respect to a height SDH in a tire radial direction to a maximum width position of the tire satisfies a relationship 0.01≤A/SDH≤0.50.", "16 . The tire according to claim 10 , wherein in an unloaded state where the tire is mounted on the specified rim and inflated to the specified internal pressure, an opening distance between the tire and the rim flange on a perpendicular line drawn from an intermediate point between the outermost point of the rim flange in the radial direction and an opening start point at which the rim flange separates from the tire to the outer surface of the tire is defined as A′, and the opening distance A′ with respect to the cross-sectional height SH satisfies a relationship 0.006≤A′/SH≤0.150.", "17 . The tire according to claim 16 , wherein the opening distance A and the opening distance A′ satisfy a relationship 0.50≤A′/A≤0.96.", "18 . The tire according to claim 16 , wherein the opening distance A′ is in a range 1.0 mm≤A′≤7.5 mm.", "19 . The tire according to claim 12 , wherein the opening distance A and the opening distance A 100 satisfy a relationship 0.20≤A 100 /A≤0.80.", "20 . The tire according to claim 19 , wherein the opening distance A is in a range 1.5 mm≤A≤8.0 mm.", "21 . The tire according to claim 20 , wherein the opening distance A with respect to a height SDH in a tire radial direction to a maximum width position of the tire satisfies a relationship 0.01≤A/SDH≤0.50.", "22 . The tire according to claim 21 , wherein in an unloaded state where the tire is mounted on the specified rim and inflated to the specified internal pressure, an opening distance between the tire and the rim flange on a perpendicular line drawn from an intermediate point between the outermost point of the rim flange in the radial direction and an opening start point at which the rim flange separates from the tire to the outer surface of the tire is defined as A′, and the opening distance A′ with respect to the cross-sectional height SH satisfies a relationship 0.006≤A′/SH≤0.150.", "23 . The tire according to claim 22 , wherein the opening distance A and the opening distance A′ satisfy a relationship 0.50≤A′/A≤0.96.", "24 . The tire according to claim 23 , wherein the opening distance A′ is in a range 1.0 mm≤A′≤7.5 mm."], "bibtex": "@patent{20240316993,\n    title = {TIRE},\n    number = {20240316993},\n    year = {2024},\n    note = {File: US20240316993A1-20240926.XML}\n    }", "classification": "B60C15024FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240316994", "filename": "US20240316994A1-20240926.XML", "abstract": "A pneumatic tire includes a reinforcing filler arranged along a bead core. The reinforcing filler includes an inner portion extending in the tire radial direction, outer portion extending in the tire radial direction, and a middle portion extending in the tire axial direction on the radially inner side of the bead core so as to connect the inner portion and the outer portion. The outer portion has an outer end in the tire radial direction located radially inside an outer end in the tire radial direction of the inner portion and located radially outside a center position of a section height of the bead core in the tire radial direction.", "detailed_description": ["An embodiment of the present disclosure will now be described in conjunction with accompanying drawings.", "", "The drawings contain exaggerated representations and representations that differ from the actual dimensional ratios of the structure in order to aid in the understanding of the present disclosure. Further, in cases where there are multiple embodiments, the identical or common elements are denoted by the same reference numerals throughout the specification, and redundant explanations will be omitted.", "", "FIG.1is a tire meridian section of a pneumatic tire1according to an embodiment of the present disclosure (hereinafter, may be simply referred to as “tire1”) in a standard state. The tire meridian section is a cross section passing all through the tire rotational axis (not shown) of the tire1.FIG.1shows the tire1for motorcycles (motor cycle tire) as a preferred embodiment. The tire1has a tread width TW, which is an axial distance between tread edges (i.e., a distance between the axially outermost ground contacting positions of the ground contacting surface of a tread portion2described below) and the maximum width of the tire. However, the present disclosure may be employed in tires for passenger cars or for heavy duty tires, for example.", "", "In the present specification, unless otherwise noted, the dimensions and the like of various parts of the tire1are measured under the standard state. The term “standard state” refers to a state in which the tire1is assembled on a standard rim (R), inflated to a standard inner pressure, and loaded with no tire load.", "", "The “standard rim (R)” refers to a wheel rim specified for the concerned tire by a standard included in a standardization system on which the tire is based, for example, the “normal wheel rim” in JATMA, “Design Rim” in TRA, and “Measuring Rim” in ETRTO.", "", "The term “standard inner pressure” refers to air pressure specified for the concerned tire by a standard included in a standardization system on which the tire is based, for example, the maximum air pressure in JATMA, maximum value listed in the “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” table in TRA, and “INFLATION PRESSURE” in ETRTO.", "", "The tire1in the present embodiment includes a pair of bead portions4. Each of the bead portions4includes a bead bottom surface (4a) and a bead outer side surface (4b). The bead bottom surface (4a) is the outer surface of each of the bead portions4facing inward in the tire radial direction, and contacts a rim seat (Rs) of the standard rim (R) (hereinafter, may be simply referred to as “rim (R)”). Generally, the bead bottom surface (4a) has a tapered angle that slopes inward in the tire radial direction toward the inner side in the tire axial direction. The bead outer side surface (4b) is the outer surface of each of the bead portions4facing outward in the tire axial direction and contacts a rim flange (Rf) of the rim (R).", "", "Each of the bead portions4is provided with a bead core5. Further, the tire1includes a pair of sidewall portions3each disposed radially outside a respective one of the bead portions4, and the tread portion2that connects the sidewall portions3, for example.", "", "At least one of the bead portions4is provided with a reinforcing filler10made of a rubber composition and arranged along the bead core5of the at least one of the bead portions4. In the present embodiment, the reinforcing filler10is disposed in each of the bead portions4.", "", "The reinforcing filler10includes an inner portion11, an outer portion12, and a middle portion13. The inner portion11has a part located axially inside the bead core5and extends therefrom in the tire radial direction on the axially inner side of the bead core5. The outer portion12extends in the tire radial direction on the axially outer side of the bead core5. The middle portion13extends in the tire axial direction on the radially inner side of the bead core5so as to connect the inner portion11and the outer portion12, more specifically, so as to connect the radially inner end of the inner portion11and the radially inner end of the outer portion12. The middle portion13configured as such increases the rubber volume on the radially inner side of the bead core5, therefore, the rim tightening force is increased, thereby, the cornering performance is improved.", "", "The outer portion12has an outer end (12e) in the tire radial direction located radially inside an outer end (11e) in the tire radial direction of the inner portion11. The outer portion12configured as such suppresses an excessive increase in the rigidity of the tire, therefore, the vibration during running is suppressed, thereby, the vibration absorbing performance is maintained high. Further, the region where the inner portion11is located is a region where a large amount of deflection occurs during running since the region where the inner portion11is located is further away from the rim flange (Rf) than the region where the outer portion12is located. Therefore, by arranging the inner portion11, which has the outer end (11e) located radially outside the outer end (12e) of the outer portion12, in the area where the inner portion11should be arranged, the deflection of the tire during running can be effectively suppressed, thereby, the cornering performance can be further improved.", "", "FIG.2is an enlarged partial view of the tire1ofFIG.1. As shown inFIG.2, the outer end (12e) of the outer portion12is located radially outside a center position (5c) in the tire radial direction of a section height (Ha) of the bead core5. The outer portion12configured as such positions the bead core5on the axially inner side, i.e., the bead core5is shifted more toward axially inner side, therefore, a larger rubber volume is secured in the radially inner part of the bead core5, thereby, the cornering performance is further improved. As a result, the tire1of the present embodiment can improve the cornering performance while maintaining the vibration absorbing performance.", "", "The reinforcing filler10configured as such is formed from the following rubber composition. The rubber composition has a loss tangent tan δ at 70 degrees Celsius of preferably 0.06 or more, more preferably 0.2 or more, and preferably 1.5 or less, more preferably 1.0 or less. Since the loss tangent tan δ is 0.06 or more, a vibration absorbing effect can be maintained high. Since the loss tangent tan δ is 1.5 or less, a decrease in the rigidity due to heat generation can be suppressed, therefore, the cornering performance can be improved. Further, the rubber composition has a rubber hardness at 23 degrees Celsius of preferably 65 degrees or more, more preferably 70 degrees or more, and preferably 85 degrees or less, more preferably 80 degrees or less. Since the rubber hardness is 65 degrees or more, the rigidity of the tire1is ensured and the cornering performance can be improved. Since the rubber hardness is 85 degrees or less, the vibration absorbing effect can be maintained high. Furthermore, the rubber composition has an elongation at break at 23 degrees Celsius of preferably 200% or more, and more preferably 350% or more. Since the elongation at break is 200% or more, the deformation of the sidewall portions3and the bead portions4can be suppressed, thereby, the cornering performance can be improved. If the elongation at break is excessively large, the vibration absorbing performance may be deteriorated. Therefore, it is preferred that the elongation at break is 550% or less and more preferably 500% or less. The reinforcing filler10in the present embodiment does not contain any cord.", "", "In the present specification, the “loss tangent tan δ” is measured in accordance with Japanese Industrial Standards JIS-K6394 under the following conditions by using a dynamic viscoelasticity measurement device (EPLEXOR series) manufactured by GABO QUALIMETER Testanlagen GmbH.Initial strain: 10%Amplitude: ±1%Frequency: 10 HzDeformation mode: tensionMeasurement temperature: 70 degrees Celsius", "", "Further, in the present specification, the “rubber hardness” refers to hardness measured by using a type-A durometer in accordance with Japanese Industrial Standards JIS-K6253 at a standard temperature of 23 degrees Celsius±2 degrees Celsius.", "", "Furthermore, in the present specification, the “elongation at break” can be measured in accordance with Japanese Industrial Standards JIS K6251 in the section “Rubber, vulcanized or thermoplastic—Determination of tensile stress-strain properties”, for example.", "", "As shown inFIG.1, the tire1in the present embodiment includes a carcass6extending between the bead portions4. The carcass6is formed of at least one, in the present embodiment, one carcass ply6A, for example. The carcass ply6A includes, for example, a main body portion (6a) extending between the bead cores5of the bead portions4, and turned up portions (6b) each turned up around a respective one of the bead cores5from the inside to the outside in the tire axial direction to extend further in the tire radial direction.", "", "Further, the tire1includes a belt layer7disposed radially outside the carcass6and in the tread portion2. The belt layer7includes at least one belt ply, in the present embodiment two belt plies7A and7B. The belt ply7A (radially inner belt ply), which is arranged radially inside the belt ply7B (radially outer belt ply), is adjacent to (in contact with in the present embodiment) the carcass6on the outside in the tire radial direction, for example. The belt ply7B is adjacent to (in contact with in the present embodiment) the inner belt ply7A on the outside in the tire radial direction so as to be overlaid with each other in the tire radial direction in the present embodiment, and has a larger width in the tire axial direction than the inner belt ply7A. The two belt plies7A and7B and the carcass ply6A in the present embodiment are made of well-known constituent materials including cords and topping rubber.", "", "Further, the tire1in the present embodiment includes an inner liner9and a chafer14. The inner liner9constitutes an inner cavity surface (1b) of the tire1, for example. The inner liner9has excellent air shielding properties. The inner liner9holds the internal pressure of the tire1. The chafer14in the present embodiment contacts the rim seat (Rs) and the rim flange (Rf) of the rim (R). The chafer14is made of a well-known rubber material with excellent wear resistance and is harder than the inner liner9and the reinforcing filler10. The inner liner9and the chafer14are each formed from well-known rubber materials.", "", "As shown inFIG.2, in each of the bead portions4in the present embodiment, the turned up portion (6b), the outer portion12, and the chafer14are disposed axially outside the bead core5over the section height (Ha) in the tire radial direction of the bead core5. Further, in the present embodiment, the turned up portions (6b), the middle portion13, the inner liner9, and the chafer14are disposed radially inside the bead core5over a cross sectional width (Wa) in the tire axial direction of the bead core5.", "", "Each of the bead portions4has a tire thickness (d1) (first tire thickness) between the outer surface (bead outer side surface (4b)) of the bead portion4and the turned up portion (6b) in the section height (Ha) (i.e., in the radial range corresponding to the section height (Ha) or in the radial range from the radially innermost end to the radially outermost end of the bead core5). The tire thickness (d1) is preferably 1.5 mm or more. more preferably 2.0 mm or more, and preferably 4.0 mm or less, and more preferably 3.5 mm or less. Since the tire thickness (d1) is 1.5 mm or more, the bead core5can be positioned more toward axially inner side, therefore, the effect of increasing the rubber volume of the radially inner part of the bead core5can be exerted. In addition, damage to the bead portions4due to contact between the turned up portions (6b) and the rim flange (Rf) can be suppressed, thereby, the cornering performance can be improved. Since the tire thickness (d1) is 4.0 mm or less, the rim tightening force can be maintained high.", "", "Each of the bead portions4has a tire thickness (d2) (second tire thickness) between the turned up portion (6b) and the outer surface (bead bottom surface (4a)) of the bead portion4in the cross sectional width (Wa) in the tire axial direction (i.e., in the axial range corresponding to the cross sectional width (Wa) or in the axial range from the axially innermost end to the axially outermost end of the bead core5). The tire thickness (d2) is preferably 2.0 mm or more, more preferably 3.0 mm or more, and preferably 8.0 mm or less, more preferably 7.0 mm or less. Since the tire thickness (d2) is 2.0 mm or more, the rim tightening force can be increased. Since the tire thickness (d2) is 8.0 mm or less, excessive increase in the rim tightening force can be suppressed, therefore, rim assembly performance, which is the ease of mounting the tire on the rim (R), can be maintained.", "", "FIG.3is an enlarged partial view of the tire1ofFIG.1. As shown inFIG.3, in each of the bead portions4, the outer portion12is disposed axially outside the turned up portion (6b). The outer portion12in the present embodiment is disposed between the turned up portion (6b) and the chafer14. Since the outer portion12is axially outside the turned up portion (6b), it is expected to suppress the transmission of vibration from the bead core5to the rim (R) when riding over gaps in the road surface.", "", "The outer end (12e) of the outer portion12is located radially inside an outer end (Re) in the tire radial direction of the rim flange (Rf). The bead portions4which are in contact with the rim flange (Rf) are areas where deformation (including deflection) during running is relatively small. By providing the outer end (12e) radially inside the outer end (Re) of the rim flange (Rf), an excessive increase in the rigidity of the bead portions4can be further suppressed, thereby, the vibration absorbing performance can be maintained high. From the point of view of achieving both the vibration absorbing performance and the cornering performance, a separation distance (La) (first separation distance) in the tire radial direction between the outer end (12e) of the outer portion12and the outer end (Re) of the rim flange (Rf) is preferably 5 mm or less, and more preferably 3 mm or less, for example. In each of the bead portions4, the outer end (Re) of the rim flange (Rf) in the present embodiment is located radially inside an outer end (6e) in the tire radial direction of the turned up portion (6b).", "", "In each axial half of the tire1, the outer end (12e) of the outer portion12is located radially inside the outer end (6e) in the tire radial direction of the turned up portion (6b), for example. As a result, the outer end (6e) of the turned up portion (6b) and the outer end (12e) of the outer portion12are misaligned in the tire radial direction, therefore, changes in the rigidity of the sidewall portion3and the bead portion4can be decreased, thereby, the deflection during running can be reduced. In order to achieve both the cornering performance and the vibration absorbing performance, a separation distance (Lb) (second separation distance) in the tire radial direction between the outer end (12e) of the outer portion12and the outer end (6e) of the turned up portion (6b) is preferably 2 times or more, more preferably 2.5 times or more the separation distance (La) and preferably 4 times or less, more preferably 3.5 times or less the separation distance (La), for example.", "", "The inner portion11is located axially inside the main body portion (6a). The inner portion11configured as such performs a compressive deformation during running and applies a tensile force to the above-mentioned cords in the main body portion (6a), which helps to increase the rigidity of the sidewall portions3and improve the cornering performance. In addition, the inner portion11configured as such acts like a damper against the load during running, thereby, the vibration absorbing performance is improved. The inner portion11in the present embodiment is arranged between the main body portion (6a) and the inner liner9.", "", "The outer end (11e) of the inner portion11is located in the tread portion2and axially inside an outer end (7e) in the tire axial direction of the belt layer7, for example. Therefore, the outer end (11e) is separated from the sidewall portions3, where the deflection during running is relatively large, thereby, the cornering performance can be further improved. The outer end (11e) of the inner portion11in the present embodiment is located in the tread portion2and axially inside an outer end (7x) in the tire axial direction of the radially inner belt ply7A, which has a width smaller than a width of the radially outer belt ply7B. Although not particularly limited, a separation distance (Lc) (third separation distance) in the tire axial direction between the outer end (11e) of the inner portion11and the outer end (7x) of the radially inner belt ply7A is preferably 1% or more, more preferably 5% or more of the tread width TW, and preferably 20% or less, more preferably 15% or less of the tread width TW.", "", "While detailed description has been made of an especially preferred embodiment of the present disclosure, the present disclosure can be embodied in various forms without being limited to the illustrated embodiment."], "claims": ["a pair of bead portions each provided with a bead core; and a reinforcing filler made of a rubber composition and arranged along the bead core of one or each of the bead portions, wherein, in the one or each of the bead portions, the reinforcing filler comprising: an inner portion extending in the tire radial direction on the axially inner side of the bead core; an outer portion extending in the tire radial direction on the axially outer side of the bead core; and a middle portion extending in the tire axial direction on the radially inner side of the bead core so as to connect the inner portion and the outer portion, wherein the outer portion has an outer end in the tire radial direction located radially inside an outer end in the tire radial direction of the inner portion and located radially outside a center position in the tire radial direction of a section height of the bead core of the one or each of the bead portions.", "in a standard state, the pneumatic tire is mounted on a standard rim, inflated to a standard inner pressure, and loaded with no tire load, and the outer end of the outer portion is located radially inside an outer end in the tire radial direction of a rim flange of the standard rim in a tire meridian section of the pneumatic tire in the standard state.", "the carcass includes a main body portion extending between the bead cores of the bead portions and turned up portions each turned up around a respective one of the bead cores from the inside to the outside in the tire axial direction to extend further in the tire radial direction, in the one or each of the bead portions, the outer portion is located axially outside the turned up portion, and the inner portion is located axially inside the main body portion.", "the one or each of the bead portions, in the section height thereof, has a first tire thickness between the axially outer surface thereof and the turned up portion, and the first tire thickness is from 1.5 to 4.0 mm.", "the one or each of the bead portions has a cross sectional width in the tire axial direction and a second tire thickness, in the cross sectional width, between the turned up portion and the axially outer surface of the one or each of the bead portions, and the second tire thickness is from 2.0 to 8.0 mm.", "the tread portion includes a belt layer arranged radially outside the carcass, and the outer end of the inner portion is located in the tread portion and axially inside an outer end in the tire axial direction of the belt layer.", "7 . The pneumatic tire according to claim 1 , wherein the reinforcing filler is formed of a rubber composition having a loss tangent tan δ from 0.06 to 1.5 at 70 degrees Celsius, a rubber hardness from 65 to 85 degrees at 23 degrees Celsius, and an elongation at break of 200% or more at 23 degrees Celsius.", "8 . The pneumatic tire according to claim 1 , wherein the pneumatic tire is a motorcycle tire having a tread width being the maximum width of the pneumatic tire.", "9 . The pneumatic tire according to claim 3 , wherein a first separation distance in the tire radial direction between the outer end of the outer portion and the outer end of the rim flange is 5 mm or less.", "in the one or each of the bead portions, a second separation distance in the tire radial direction between the outer end of the outer portion and an outer end in the tire radial direction of the turned up portion is from 2 to 4 times the first separation distance.", "11 . The pneumatic tire according to claim 9 , wherein the outer end of the rim flange is located radially inside an outer end in the tire radial direction of the turned up portion in the one or each of the bead portions.", "12 . The pneumatic tire according to claim 11 , wherein the outer end of the outer portion is located radially inside the outer end of the turned up portion in the one or each of the bead portions.", "the belt layer comprises a radially inner belt ply and a radially outer belt ply overlaid in the tire radial direction, and the radially outer belt ply has a width in the tire axial direction larger than a width in the tire axial direction of the radially inner belt ply.", "in the one or each of the bead portions, the outer end of the inner portion is located in the tread portion and axially inside an outer end in the tire axial direction of the radially inner belt ply, and a third separation distance in the tire axial direction between the outer end of the inner portion and the outer end of the radially inner belt ply is from 1% to 20% of a tread width.", "15 . The pneumatic tire according to claim 2 further comprising a chafer configured to contact the rim flange and a rim seat, wherein the chafer is formed of a rubber material harder than the reinforcing filler.", "16 . The pneumatic tire according to claim 7 , wherein the loss tangent tan δ at 70 degrees Celsius of the rubber composition of the reinforcing filler is from 0.2 to 1.0.", "17 . The pneumatic tire according to claim 7 , wherein the rubber hardness at 23 degrees Celsius of the rubber composition of the reinforcing filler is from 70 to 80 degrees.", "18 . The pneumatic tire according to claim 7 , wherein the elongation at break at 23 degrees Celsius of the rubber composition of the reinforcing filler is 550% or less.", "19 . The pneumatic tire according to claim 18 , wherein the elongation at break at 23 degrees Celsius of the rubber composition of the reinforcing filler is from 350% to 500%.", "20 . The pneumatic tire according to claim 15 , wherein the outer portion is disposed between the turned up portion and the chafer in the one or each of the bead portions."], "bibtex": "@patent{20240316994,\n    title = {PNEUMATIC TIRE},\n    number = {20240316994},\n    year = {2024},\n    note = {File: US20240316994A1-20240926.XML}\n    }", "classification": "B60C1506FI"}]