[{"title": "DECORATIVE SECURITY WHEEL FASTENER", "doc_number": "20250065668", "filename": "US20250065668A1-20250227.XML", "abstract": "A security fastener assembly is provided with a cap having a decorative bearing surface and a lower retention portion. A fastener body has: a threaded portion or securing the fastener assembly to a corresponding threaded feature on a vehicle; a stem opposite the threaded portion for receiving the cap, the stem having a security protrusion defining a distal end, an undercut formed adjacent the stem for cooperating with the lower retention portion of the cap, where the lower retention portion of the cap is secured in the undercut to maintain the cap on the fastener body; a keyed security drive feature formed between the threaded portion the stem portion where the fastener body is removable with the keyed security feature. Engaging the decorative bearing surface of the cap and rotating does not rotate the threaded portion of the fastener body.", "detailed_description": ["As required, detailed embodiments of the present invention are disclosed herein; however, it is to be understood that the disclosed embodiments are merely exemplary of the invention that may be embodied in various and alternative forms. The figures are not necessarily to scale; some features may be exaggerated or minimized to show details of particular components. Therefore, specific structural and functional details disclosed herein are not to be interpreted as limiting, but merely as a representative basis for teaching one skilled in the art to variously employ the present invention.", "", "The application relates to security wheel fasteners that have the same styling, tension and friction performance as the existing wheel fasteners.", "", "Available security fasteners may not have matching styling, size, form, or fit of existing wheel fasteners. Available security fasteners also may not meet tension and friction requirements of existing wheel fasteners.", "", "A decorative security fastener deters the theft of automotive wheels, through performing as a security fastener, without sacrificing styling or performance of the original equipment wheel fastener.", "", "FIG.1is side view of the decorative security fastener assembly10shown in a section view of a mounting location and shown in use with an installation tool20.FIGS.2-3show the side view and top view of the decorative security fastener10in more detail and having a decorative cap12and a fastener body14.", "", "The decorative security fastener10has a threaded portion16with internal or external threads. As shown in the Figures, the decorative security fastener10may be a bolt having external threads. The decorative wheel fastener may also be formed as a nut with internal threads. The decorative wheel fastener10matches the styling and performance of a standard wheel fastener. For example, the decorative security fastener assembly10includes a decorative fastener cap12coupled to a security fastener body14. The fastener cap12has a wrenching surface22being common with the wrenching surfaces of other wheel fasteners on the vehicle. As shown in the Figures, the decorative fastener cap12may have a hexagonal wrenching surface22. The cap12may have six wrenching surfaces oriented in a hexagonal shape. However, it is possible for the cap12to have a different polygonal shape with a different number of wrenching surfaces or, any suitable shape, configuration or standard of tool wrenching surface may be used. For example, a fastener cap having a three-pointed tool wrenching surface may be used, such as U.S. patent application Ser. No. 15/487,805 by Larry Wilson et al., or a hybrid wrenching surface, such as in U.S. patent application Ser. No. 15/872,386 by Steven Tomaszewski et al., the disclosures of which are hereby incorporated by reference herein.", "", "The threaded portion16of the fastener body14has standard thread specifications allowing for standard torque specifications. However, while the decorative cap12appears the same as a standard fastener, when the cap is engaged by a standard tool, the cap12would spin freely or rotate without affecting the threaded portion and clamping forces.", "", "The decorative security fastener is installed and removed using a special matching tool20that engages on the keyed security drive feature30. The matching keyed security tool20is required to remove the fastener body14from the wheel W and the drive feature30is not able to be gripped by a standard tool to apply enough torque to remove the fastener body14. As shown, the keyed security drive feature30may be formed on a flange24of the fastener body and may be formed as a plurality of security notches formed along the periphery of the flange24. The plurality of notches30may have any suitable shape, number or spacing along the flange24. Alternatively, the keyed security drive feature30may be formed as a unique shaped recess on the top surface32of the flange24or other portion of the fastener body14. The security drive feature30may have different undulating, serpentine, irregular or unique shaped recess, or plurality of recesses that are not able to be gripped by a standard tool to transmit sufficient torque to unseat the fastener body14from the vehicle. The security drive feature30may be positioned in various locations on the fastener body14in combination with the decorative cap12as discussed in International Application No. PCT/US20/66090 filed Dec. 18, 2020, and U.S. provisional application Ser. No. 62/950,096 filed Dec. 18, 2019, the disclosures of which are hereby incorporated in their entirety by reference herein.", "", "The fastener body14may also have a tapered, spherical or frustoconical bearing surface26that is formed between the flange24and the threaded portion16. The bearing surface26may also be defined by a washer in combination with the fastener body. When the threads are fully seated at standard torque levels, the bearing surface26may be compressed and in tension with a corresponding surface to reduce the tendency for the bolt to loosen, thereby maintaining the fastener10securely seated. The fastener body may have a coating, or multi-layer coatings, that provide corrosion resistance and also provide a desired coefficient of friction. For example, the fastener body may have a coating such as described in U.S. patent application Ser. No. 17/716,979, the disclosure of which is hereby incorporated in its entirety by reference herein.", "", "The cap12has a decorative wrenching surface that matches the size and styling of the existing wheel fasteners. The cap12will rotate separately to the fastener and will not remove the fastener or affect tension in the joint. The cap may be secured to the fastener body after any coating is applied to the fastener body so the cap does not have a coating or has a coating different than the fastener body. For example, the cap12may be formed of stainless steel and may be polished, and not require additional coatings. The cap12may also have a decorative coating, such as black coating as described in International Patent Application No. PCT/US22/22811 by MacLean Fogg Company, the disclosure of which is hereby incorporated by reference herein.", "", "As shown in the Figures, the decorative cap12may have a decorative hexagonal shape to have the same styling as standard hexagonal fasteners. The cap12is formed of metal, such as stainless steel. By forming the cap12of metal, the cap will have the same aesthetic and durability of the standard fasteners. The cap12may also have a decorative finish and can be bright, black, variations of DLC colors, and have logos and/or branding etched and/or annealed onto the exposed surfaces. A decorative cap12can match the styling of the existing wheel fasteners that can be customized with different finishes, colors, logos, and branding.", "", "The decorative cap12is placed over a stem40on the fastener body14. The stem40defines a security protrusion shaped to prevent a standard tool or an extractor tool from being able to grip or engage the security protrusion to apply torque to remove the fastener from the wheel if the cap is removed. The geometry of the security protrusion of the stem40may have several different configurations. As shown inFIGS.5-6, the stem40may be round forming a circular cylinder protrusion that extends from the flange24of the fastener body14. The stem40may generally be the same size as the inside dimension of the polygon shaped decorative cap12. The inside shape of the cap12is different than the outer shape of the stem40. The different shapes provide reduced contact surface between the cap12and the stem40and allow the cap to rotate relative to the fastener body14. A polygon shaped cap is fitted to the fastener stem40so that the cap12will rotate when a torque that is less than the torque necessary to loosen the fastener is applied.", "", "FIG.5is a section view of the decorative security fastener like that shown inFIGS.1-4according to one embodiment.FIG.6is a top perspective view of the fastener body of the security fastener assembly inFIG.5shown with the cap removed.", "", "The decorative cap12may be attached to the fastener body14with various attachment methods that displace a lower retention portion42of the cap12into a retention feature44on the fastener body14. The retention feature44retains the cap12to the fastener body14while still allowing the cap12to rotate relative to the fastener body14. As shown in detail inFIGS.7-9, the retention feature44has a diameter and width that is less than the stem40of the fastener body14and forms a groove, or undercut, for example.", "", "As shown inFIGS.7-8, the decorative cap12may be attached to the retention feature44by various attachment methods such as swagging, crimping, staking, rolling, metal working tooling and machine tools that displace the lower portion of the cap into the retention feature44on the fastener body14. The cap forming methods may allow the cap attachment method feature to be a separate manufacturing process, or part of the fastener forming process. For example, the retention feature44adjacent the fastener stem, or formed as part of the stem, allows displacement of the cap by swagging, crimping, staking, rolling, or other forms of metal cold-working, in order to secure the cap to the fastener.", "", "The decorative cap12may be attached to the fastener body64with various attachment methods that displace a lower retention portion42of the cap12into a retention feature44on the fastener body64. The attachment methods or manufacturing process may use compressive forces to deform the cap12along the lower retention portion42. The manufacturing method may shape or deform the lower retention portion42inward into the undercut or groove to create an attachment joint that retains the cap12to the fastener body14with a process such as swagging, stacking, crimping, roll-forming or other cold-working or forging process. The attachment joint may allow the cap12to rotate relative to the fastener body14. As shown in detail inFIG.4, the decorative cap12may be attached to the retention feature44by crimping the cap12into the retention feature44on the fastener body64along each of the flat portions72. Therefore, in the embodiment illustrated, the cap12is crimped to the fastener body64in three places adjacent each of the flat portions72of the stem70. The crimping process includes applying a radial force to the cap12. For example, as shown inFIG.4, the cap12may be crimped in up to in three crimp-locations80, however, any number of crimp locations may be provided.", "", "The cap12may be retained to the fastener body10by swagging or forming the cap to the fastener body continuously along the circumference of the undercut retention feature44. The cap forming methods may allow the cap attachment method feature to be a separate manufacturing process, or part of the fastener forming process. As shown inFIG.7, the cap12may be a straight cap that has a swage, stake, roll-form, crimp or other suitable attachment method to the cap. As shown inFIG.8, the lower retention portion42of the decorative cap12may have an extended shoulder46that extends toward the security drive feature.", "", "Some cap forming methods allow the cap shoulder to engage into the retention feature44on the fastener body14during cap assembly without requiring crimping, staking, rolling, metal working tooling and machine tools to displace a portion of the cap. As shown inFIG.9, a folded portion48of the cap12may be created that will engage into the retention feature44on the fastener body14with an interference fit such as a snap-fit or snap-lock. For example, the lower retention portion42of the cap12may engage the retention feature44on the fastener body12with an interference fit. The folded portion48may be formed with the cap12and may not require a separate process to attach the cap12to the fastener body14, such as swagging, crimping, staking, rolling, metal working tooling and machine tools to displace a portion of the cap.", "", "The retention feature44of the fastener body14can also act as a breakaway feature where the stem40detaches from the fastener body14under excess force. When the stem40detaches it prevents removal of the fastener if a thief manages to pry away the rotating cap then wants to try and use an easy out fastener removal tool.", "", "The installation and removal tool20can be designed to not damage wheel surfaces. The tool has a cavity to receive the cap12and flange24of the fastener body14, as shown inFIG.1. The tool20has a corresponding keyed security element to engage the keyed security drive30on the fastener body14. For example, the corresponding keyed security elements may be pin or protrusion that engages the grooves on the flange24of the fastener body14. As shown inFIG.1, the tool20may bottom on the flange24but have no contact with the wheel. The tool20may have a clearance to the wheel of 1 mm, for example.", "", "FIGS.10-12illustrate a decorative security fastener assembly60having a fastener body64according to another embodiment. The security fastener60may use the decorative cap12, as discussed above. The decorative security fastener60has a threaded portion16with internal or external threads. As shown in the Figures, the decorative security fastener60may be a bolt having external threads. The decorative wheel fastener may also be formed as a nut with internal threads. The decorative wheel fastener60matches the styling and performance of a standard wheel fastener and includes the decorative fastener cap12coupled to the security fastener body64.", "", "The decorative cap12is placed over a stem70the forms a protrusion on the fastener body64. As shown inFIGS.10-12, the stem70may have flat portions72and arc segments74. The arc segments74may be tangential to flats sides on the cap12, such as hexagonal sides, as shown inFIG.12. The flat portions72reduce the material or the weight and may provide material cost savings as well as lightweighting of the fastener. The inside shape of the cap12only contacts the stem70along the arc segments74so the cap12spins freely with little friction so that the cap12will rotate when a torque that is less than the torque necessary to loosen the fastener is applied.", "", "The threaded portion16of the fastener body64has standard thread specifications allowing for standard torque specifications. However, while the decorative cap12appears the same as a standard fastener, when the cap is engaged by a standard tool, the cap12would spin freely or rotate without affecting the threaded portion and clamping forces.", "", "FIGS.13-14illustrate a decorative security fastener assembly100having a fastener body104according to another embodiment. The security fastener100may use the decorative cap12, as discussed above.", "", "The decorative cap12is placed over a stem110on the fastener body104. As shown inFIGS.13-14, the stem110may have thin side walls112. The stem110may crumple or deform if a torque that is less than the fastener breakaway clam load is applied to the stem110.", "", "FIG.15-17illustrate decorative security fastener assemblies with a fastener body and stem according to other embodiments. As shown, the stem may have a distal end being sloped or pointed. The protrusion formed by the stem has insufficient length and is too short for gripping by an extractor or removal tool. In addition, the distal end does not provide a surface that can easily be engaged by a screw-extractor tool, such as an easy-out tool. The protrusion may be a domed surface, a conical surface, or other shaped surface that slopes away from a distal end.", "", "InFIG.15, a fastener assembly160has a fastener body164with the stem170with protrusion having a pointed distal end174having a conical surface. The security fastener160may use the decorative cap12, as discussed above. The decorative cap12is placed over the stem170on the fastener body164. The lower retention portion64is deformed inward into an undercut176being an angled groove and asymmetrical. As shown, the undercut176extends at an angle from the base of the conical surface. The undercut176is formed below the conical stem and has a radius and/or diameter less than a base of the stem170.", "", "FIGS.16-17illustrate a fastener assembly190having a fastener body194with the stem192with protrusion having a pointed distal end196having a conical surface. An undercut198is defined by a groove that is generally symmetrical in the axial direction. The undercut198may be taller to define a larger groove between the stem170and the flange24. For example, the undercut198may have a dimension of 2-4 mm, or larger. The security fastener190may use the decorative cap12, as discussed above. The undercut198may allow for the cap to be deformed inward by swagging the cap12around a majority of the circumference at the undercut198.", "", "FIG.18illustrates a fastener assembly200according to another embodiment. The fastener assembly has a fastener body204with a stem202. The stem202may have a protrusion forming the distal end that is cylindrical, conical, or other suitable shape. The security fastener200also has a washer210. The washer210is positioned between the flange24and the threaded portion16and defines the bearing surface26. The washer210abuts the flange24and may be compressed and in tension with a corresponding surface in the wheel to reduce the tendency for the bolt to loosen, thereby maintaining the fastener assembly200securely seated. The washer210may rotate on the fastener body204. As discussed above, the fastener body204has a keyed security feature30formed along the flange24. The security fastener assembly200may use the decorative cap12that can be cold-worked and deformed to be retained on the fastener body204in a retention feature44such as an undercut, as discussed above.", "", "While exemplary embodiments are described above, it is not intended that these embodiments describe all possible forms of the invention. Rather, the words used in the specification are words of description rather than limitation, and it is understood that various changes may be made without departing from the spirit and scope of the invention. Additionally, the features of various implementing embodiments may be combined to form further embodiments of the invention."], "claims": ["a cap shaped with a standard tool bearing surface and a lower retention portion; a fastener body having: a threaded portion or securing the fastener assembly to a corresponding threaded segment on a vehicle; a conical stem opposite the threaded portion and defining a distal end, wherein the cap conceals the conical stem, an undercut formed below the conical stem and having a radius less than a base of the conical stem, wherein the lower retention portion of the cap is deformed inward into the undercut with a cold-working process to maintain the cap on the fastener body; and a keyed security drive feature formed between the threaded portion and the conical stem and not concealed by the cap for engagement by a corresponding security tool, wherein rotating the cap does not rotate the threaded portion of the fastener body, wherein the fastener body is removable from the corresponding threaded segment with the keyed security feature.", "2 . The security fastener assembly of claim 1 , wherein the lower retention portion is swagged to deform the lower retention portion into the undercut continuously along at least a portion of the circumference of the undercut.", "3 . The security fastener assembly of claim 1 , wherein the cold-working processes forms a plurality of retention locations that deform the lower retention portion into the undercut at each of the plurality of retention locations.", "4 . The security fastener assembly of claim 1 , further comprising the corresponding security tool having a cavity to receive the cap and flange of the fastener body and having a corresponding keyed security element to engage the keyed security drive feature on the fastener body.", "a cap having a decorative bearing surface and a lower retention portion; a fastener body having: a threaded portion or securing the fastener assembly to a corresponding threaded feature on a vehicle; a stem opposite the threaded portion for receiving the cap, the stem having a security protrusion defining a distal end, an undercut formed adjacent the stem for cooperating with the lower retention portion of the cap, wherein the lower retention portion of the cap is secured in the undercut to maintain the cap on the fastener body; a keyed security drive feature formed between the threaded portion the stem portion wherein the fastener body is removable with the keyed security feature, wherein engaging the decorative bearing surface of the cap and rotating does not rotate the threaded portion of the fastener body.", "6 . The security fastener assembly of claim 5 , wherein the cap is secured to cap with a cold-working process to deform the lower retention portion into the undercut.", "7 . The security fastener assembly of claim 6 , wherein the cold-working process applies an inward radial force to deform the lower retention portion into the undercut such that an inner surface of the cap faces an outer surface of the undercut.", "8 . The security fastener assembly of claim 7 , wherein the plurality of retention locations comprises at least three crimp locations.", "9 . The security fastener assembly of claim 5 , wherein the cold-working process forms a swage location to deform the lower retention portion into the undercut continuously along at least a portion of the circumference of the undercut.", "10 . The security fastener assembly of claim 9 , wherein the swage location extends continuously along a majority of the circumference of the undercut.", "11 . The security fastener assembly of claim 5 , wherein the undercut comprises an angled groove having an asymmetric cross-section.", "12 . The security fastener assembly of claim 5 , wherein the security protrusion comprises a conical surface.", "13 . The security fastener assembly of claim 5 , wherein the security protrusion comprises a circular cylinder with a circular inner opening.", "14 . The security fastener assembly of claim 13 , wherein the circular cylinder has a plurality of flat portions spaced apart along an outer circumference by circular cylinder portions, wherein an inner surface of the cap contacts the security protrusion only along the circular cylinder portions.", "15 . The security fastener assembly of claim 13 , wherein the circular cylinder has a thin wall having a thickness less than a radial depth of the undercut.", "16 . The security fastener assembly of claim 5 , further comprising a washer secured to the fastener body.", "providing a fastener body having a threaded portion and a stem protrusion defining a distal end opposite the threaded portion, wherein an undercut is formed below the stem protrusion, and wherein a keyed security drive feature is formed between the threaded portion and the stem portion for engagement by a corresponding security drive tool; providing a cap having a standard tool bearing surface and a lower retention portion; placing the cap on the fastener body to cover the stem protrusion; cold-working the cap to deform the lower retention portion into the undercut thereby retaining the cap on the fastener body.", "18 . The method of claim 17 , wherein the cold-working comprises applying an inward radial force with a tool to deform the lower retention portion into the undercut such that an inner surface of the cap faces an outer surface of the undercut.", "19 . The method of claim 17 , wherein the cold-working comprises swagging the lower retention portion into the undercut continuously along at least a portion of the circumference of the undercut.", "20 . The method of claim 17 , wherein the cold-working comprises crimping the lower retention portion into the undercut at each of the plurality of retention locations."], "bibtex": "@patent{20250065668,\n    title = {DECORATIVE SECURITY WHEEL FASTENER},\n    number = {20250065668},\n    year = {2025},\n    note = {File: US20250065668A1-20250227.XML}\n    }", "classification": "B60B316FI"}, {"title": "SYSTEMS AND METHODS FOR PROVIDING WHEELS HAVING VARIABLE SPRING RATES", "doc_number": "20250065669", "filename": "US20250065669A1-20250227.XML", "abstract": "A wheel is disclosed that includes an inner hub, an outer rim, and a plurality of resilient elements that exhibit a first spring constant that is the same for all elements, and a second spring constant that is higher than the first spring constant for elements being compressed beyond a threshold deflection.", "detailed_description": ["In accordance with an aspect, the invention provides an efficient wheel that is constructed with resilient elements to maintain traction, isolate ground forces, and manage vehicle height under varying loads. In accordance with certain aspects, the wheel may be constructed with resilient elements that allow for bouncing. A wheel is therefore provided that can roll and bounce. In accordance with further aspects, the invention provides a system having multiple wheels, and in accordance with yet further aspects, such a system where the wheels are different.", "", "As shown inFIG.5, wheel10has a rigid inner hub12, a substantially rigid outer rim14, and a resilient interface15disposed in the space between the hub12and rim14. The resilient interface15is comprised of a series of resilient elements16spaced around the wheel. The elements16extend generally in the radial direction between the hub12and rim14. Hub12rotates about an axis of rotation10x. The hub12can be driven by a power source, such as an electric motor, or can be unpowered and freely rotate. Resilient interface15transfers the rotational forces between the hub12and the outer surface18of the rim14.", "", "Wheel10may be formed as a single monolithic structure that is injection molded, 3D printed, or otherwise formed as a whole. The material used for the structure preferably has some resiliency to be able to provide adequate traction under a variety of conditions, while also having the strength to support intended loads. The elasticity should also be adequate to urge the outer surface18against the driving surface to maintain traction and mitigate transmission of vibration to the vehicle while traveling over rough surfaces or areas with rapid changes in surface heights.", "", "In accordance with an aspect therefore, the invention provides a resilient interface between a hub and a rim that includes spring elements that act in both tension and compression to support the hub. As opposed to a simple linear spring, however, the spring elements are arranged to contact adjacent elements when they deflect under load conditions. This contact dramatically changes the spring rate of the elements, significantly stiffening the interface against further deflection.", "", "Resilient elements16are formed as pre-bent (e.g., molded) leaf springs that extend substantially the full width of the wheel, providing lateral stability. The bend in the resilient elements16alternate, so that each element will be bent toward another element that is likewise bent towards it. Elements16have a hub connection portion162that rigidly connects the elements16to the hub, and a rim connection portion164that rigidly connects the elements16to the rim14. Between the hub connection portion162and the rim connection portion164there is a peak16p, which is the point farthest from a line passing through the hub connection portion162and the rim connection portion164. The elements16have substantially the same spring constant in tension as in compression until, when so compressed as to contact an adjacent element as described in more detail below, the element becomes much stiffer (i.e., has a higher effective spring constant).", "", "In accordance with various aspects, therefore, the invention provides a wheel having a resilient interface between a hub and a rim that can act in both tension and compression to supports a vehicle. The resilient interface uses curved resilient elements spaced around the wheel that bow outward when compressed. When compressed beyond a threshold level the elements will contact an adjacent element, causing the stiffness of the elements to increase dramatically, limiting further deflection. This dual spring rate system allows a vehicle to maintain a vehicle height under large range of loads while having enough resilience to maintain traction with the driving surface.", "", "FIG.6shows another aspect of the wheel where the outer surface18includes a textured tread28. The tread28may be formed of the same material as the rest of the wheel20, or may be formed from a layer of elastic or highly frictional material molded or otherwise fitted to the outer surface28of the rim24. This tread28may provide improved traction through enhanced frictional contact with a driving surface. Friction will be impacted by several factors, including the material chosen, the texture of the ground engaging surface, the contact footprint under various loads, presence of liquids or thin films, and temperature. If the tread28is made from a separate material from the rest of the wheel, it can be selected to provide another layer of resiliency to the wheel by absorbing energy from bumps or vibrations transferred from the driving surface.", "", "Typical forces that act on a wheel30are shown inFIG.7. The weight of the vehicle and its cargo applies a downward load force FLthat causes element36and outer rim34to deflect. If the wheel30is powered, a torque Twis applied to hub32to cause rotation about axis A. The torque Twis transferred through resilient interface35to the rim34. The ground G then applies a reactive tractive force Ftto the outer surface38of the rim34to cause the wheel to turn. Once the wheel30begins turning, a rolling resistance moment Mrris created in the outer surface38acting to oppose the rotation. This rolling resistance moment Mrris primarily caused by the hysteresis in tire materials due to the deflection of the outer surface material while rolling. The leading half of the tire's contact patch39is compressed, which rebounds with lower energy as the wheel rolls on and the compression is released. In order to reduce this rearward force, the tire may be made of a harder material that deforms less, or the contact patch area may be reduced by decreasing the load force FL, by designing the outer rim38to be stiffer, or by changing the geometry of the outer surface38. Certain of these solutions however, may have the drawback of reducing traction.", "", "FIGS.8A-8Dillustrate the compression of elements46in an illustratively simplified manner where the elements46are side by side with vertically applied forces.FIG.8Ashows four alternating elements46in an uncompressed state, with a deformation level of d0. Elements46aare bent toward one another, while elements46bare bent away from elements46a, and, for the purposes of this example, do not face another element. Each of the elements46has a peak46p. InFIG.8B, the elements46have been compressed under a load FL1to deformation level d1. As the elements46are compressed, the peaks46pextend farther out. InFIG.8C, force FL2has deflected the elements46to deflection level d2. This has caused the elements46ato bend to a point where their peaks46phave contacted one another, and cannot move outwardly any further. InFIG.8D, increased force FL3has deflected the elements46to deflection level d3. Peaks46pof adjacent elements46ahave begun to flatten against one another. The force required to deflect elements46ato this level is different from the force it takes to move the unconstrained elements46bthe same amount. This is due to the change in the spring rate, or spring constant k, when the peaks46pbecome constrained.", "", "To calculate the increased spring constant of adjacent elements between its unconstrained and constrained states, the process begins with the equation:", "", "F=kd", "", "where F is the force applied, k is the spring constant of the spring, and d is the deflection of the spring. The deflection of the spring element may be approximated using the equation for the deflection of a beam with rectangular cross section:", "", "δ=q⁢FL3E⁢bt3", "", "whereq=a constant based on boundary conditions of the beamF=the force applied to the beamL=the length of the beamE=the Modulus of Elasticity of the beam materialb=the width of the beamt=the thickness of the beam", "", "Thus, the original effective spring constant of two adjacent but non-touching elements may be calculated by finding their equivalent unconstrained spring constant. For each element, the spring constant is calculated as:", "", "k1=Fδd⁢e⁢s=E⁢b⁢t3q⁢L3", "", "Because the two springs act in parallel, their effective spring constant is:", "", "keff⁢1=k1+k1=2⁢k1", "", "As the spring elements46adeflect and contact the adjacent element46a, the effective length of the leaf spring is halved, with upper parts46a1and lower parts46a2of the elements46aacting as springs in parallel. The resultant effective spring constant keff2of the two touching, constrained elements is a combination of the two halved segments of each elements in series, being in parallel with the adjacent two segments that are in series. Each half segment will have the new constant:", "", "k2=E⁢b⁢t3q⁢(L2)3=8*E⁢b⁢t3q⁢L3=8⁢k1", "", "With the two halves in series, each elements will have a new constant of:", "", "ks⁢e⁢r⁢i⁢e⁢s=(1k2+1k2)-1=k22keff⁢2=ks⁢e⁢r⁢i⁢e⁢s+ks⁢e⁢r⁢i⁢e⁢s=k22+k22=k2=8⁢k1", "", "To understand the change in spring constant, review the ratio of keff2and keff1:", "", "keff⁢2keff⁢1=8⁢k12⁢k1=41", "", "The effective spring constant is therefore four times the old spring constant, which means that it takes four times the load force to compress the constrained elements46ato the same deformation level as the unconstrained elements46b.", "", "Adjacent elements around a wheel deflect a little differently, but the concept remains the same.FIGS.9A-9Dshow wheel50through four stages of deflection of the resilient interface55, where the inner hub52deflects downward toward the ground G. Outer rim54remains rigid, with dashed centerlines57illustratively emanating from the center of the outer rim54. When un-deflected as shown inFIG.9A, centerlines57pass between the hub attachment portions56hand rim attachment portions56rof adjacent elements56aand56bthat are curved away from one another. As the hub52moves downward, each hub connection portion56hof element56moves with it. For each element56around the wheel50, the hub connection portion56hmoves relative its corresponding rim connection portion56r. InFIG.9B, the elements56have begun to deflect, but adjacent elements that are curved toward one another have not yet made contact. At this stage, the elements closest to the ground G are in compression with the same spring constant as the elements farthest from the ground G, which are in tension. InFIG.9C, adjacent elements56closest to the ground G have begun to make contact with one another, greatly increasing the spring constant of the lower elements to stiffen the resilient interface55, while the elements56farthest from the ground G continue to act on the hub52in tension at the original unconstrained spring constant. As the hub52continues to deflect as inFIG.5D, more elements56begin making contact with one another, further stiffening the resilient interface55.", "", "FIGS.10A-10Kcorrespond to elements6A-6K inFIG.9D. Each of those elements is illustrative of the elements across their respective centerline57. Each of the elements10A-10K on the right side of wheel50is also symmetric with elements on the left side of the wheel, reflected across a vertical axis. Elements shown inFIGS.10A-10Kare each acted on by a force F. At the topmost part of wheel50, force F acts on the element in pure vertical tension aligned in the radial direction. As the elements go around the wheel, the force component is always vertically down, but skews from the radial direction. This applies the force F to the elements in two components-a radial component acting on the element in either tension or compression, and a circumferential component acting on elements in a shearing direction. Element6F, being the rightmost element, is acted on in substantially only a shearing direction, and bottommost element shown inFIG.10K, is acted on substantially only in compression. The shearing components acting on the elements act to move the elements near the bottom of the wheel into contact sooner than elements deflecting under just compression. The spacing, geometry, and material of the elements may all be adjusted to provide a maximum deflection before the elements come into contact with one another and stiffening the resilient interface.", "", "The dramatic stiffening of the resilient interface acts to substantially limit the deflection of the hub, as well as the vehicle attached thereto. Conventional solutions do not have a limiting mechanism to ride height other than bottoming out or reaching the physical limits of the materials used. Tension based wheels, such as the typical bicycle wheel70having thin metal spokes76shown inFIG.1, rely most heavily on the spokes' tensile strength as opposed to their strength in compression to support hub72. The spokes76are tightened to remain in tension and stiffen the outer rim74. This stiffness creates a harsh ride by itself, which may be mitigated by the selection of pneumatic tire78or other resilient ground engaging material on the outside rim.", "", "FIG.2shows the standard pneumatic automotive tire80. The pneumatic tire80is a flexible toroidal structure filled with a compressed gas, typically air. The tire body88is made of flexible structural elements, or cords, having a high modulus of elasticity surrounded by a low modulus rubber compound that surrounds the cords and creates a tread87. The structural elements are attached to the rim84of a wheel80through a bead that supports the rim when the tire is inflated. The load transmission of the pneumatic wheel is analogous to that of the bicycle wheel ofFIG.1, where the hub hangs on the spokes76from the upper part of the rim74, which is in turn supported at its lower part by the ground G. The inflation pressure causes tension to develop in the cords, depicted by radial arrows, causing them to act like the spokes of the bicycle wheel.", "", "Another top-loaded, or tension-based conventional solution is the wheel assembly roughly depicted inFIG.3. The wheel assembly includes a wheel90with a hub92, a rim94, and a resilient interface95between and connecting the hub92and rim94. The resilient interface is made of spokes that are strong in tension, with upper spokes96asupporting the hub92like the spokes of a bicycle wheel, but may deform without substantial resistance when under compression like spokes96bbeneath the hub92. Like the pneumatic tire body, the rim94of the wheel90is compliant such that encountering an obstacle, such as rock R, allows the wheel to travel over the obstacle without transmitting the force of the impact to the vehicle platform91.", "", "While the ability for the tire body88and rim94to deform locally on an outer surface thereof is suitable for circumstances where large obstacles may be readily encountered, in the field of warehousing robotics the driving surface is generally a prepared, flat surface. Wheels traveling over hard, generally flat surfaces do not require large vertical wheel movements or deformations, and are impacted more by rolling resistance and traction compared to wheels designed for unprepared terrain with large obstacles or soft surfaces. Both the pneumatic tire80and wheel assembly90exhibit generally constant spring rates. As the load continually increases, the deflection will also continually increase.", "", "Referring again toFIG.2, when the wheel80is subjected to a force F, the tire body88flattens out at its contact patch89, which causes the wheel to deflect downward an amount dp. Similarly, with reference toFIG.4, wheel90subjected to force F also flattens out at a contact patch99, causing the wheel to deflect downward an amount dr. In both of these cases, the increased contact patches would reduce the efficiency of the wheels in a warehousing environment, and would continue to deflect downward under increasing loads.", "", "FIG.11shows an illustrative graphical representation of the deflection of three types of wheels under varying loads. As can be seen, the dotted line representing a pneumatic tire shows the wheel compressing essentially linearly as the load increases. The wheel assembly90on the other hand, represented by the dashed line, becomes less stiff as the load increases, as more spokes buckle and are unable to support the hub. A wheel in accordance with an aspect of the present invention, represented as the solid line, is linear to a point, becomes much stiffer at a threshold deflection, and becomes stiffer as load increases as more resilient elements make contact with adjacent elements increasing the effective spring constant of the resilient interface.", "", "In warehousing environments, a maximum anticipated load can be known, as well as a maximum allowable deflection that allows for proper loading and unloading of objects onto and from shelving or conveyors, for example. As seen in the graph ofFIG.11, both the pneumatic tire and wheel assembly90exceed the maximum allowable deflection threshold at the maximum anticipated load.", "", "As shown inFIG.12, a warehouse may include shelves124, conveyors126, and mobile devices (e.g., robot vehicles)121. Shelves have a platform124pto hold bins or boxes, and a ramp portion124hthat defines the minimum loading height. Likewise, ramp126has a ramp portion126hthat defines a minimum loading height for the ramp. These minimum loading heights determine what the maximum allowable deflection may be for the vehicle121. Vehicle121has a pair of platform rails127that hold the bins or boxes being transported. Paddles128can be actuated to turn upwards as shown inFIG.12to maintain an object on the platform rails127, or can be individually activated to assist in loading and unloading objects onto the shelves124or conveyors126. Vehicle121is supported by wheels120, and powered by motors123.", "", "FIG.13Ashows a side view of mobile device (e.g., robot vehicle)121approaching a shelf124. Vehicle121is carrying a box B causing wheel120to compress. As a result, the height hvof the vehicle platform127is lower than its unloaded state. For box B to be successfully loaded onto the shelf124, vehicle height hvmust be between the height hpof the shelf platform124pand the minimum height hrof the platform ramp124h. If the vehicle height hvis above the height hpof the shelf platform124p, the vehicle121would be unable to unload the box B as it relies on the paddle128to push the box up the ramp124hto rest on the shelf platform124p. Otherwise the box B would remain on the vehicle121. If the vehicle height hvis below the height hrof the shelf ramp124h, the vehicle121would be unable to unload the box B as the leading edge of the box B would be below the shelf ramp124h, and could not slide up onto the shelf platform124p.", "", "FIG.13Bshows the vehicle121after it has unloaded box B onto the shelf platform124p. Once the box B has been unloaded, the wheels120revert to their unloaded state, raising the vehicle height hvto an unloaded height that must be below the height hpof the shelf platform124p. If the vehicle platform rebounded to a height at or above the platform height hp, the vehicle platform127would drag the box B at least partially off the shelf124. Maintaining the unloaded vehicle height to be less than the shelf platform height allows the vehicle to drive under the shelf124, turn a paddle128up to engage the box B, and pulled off the shelf platform124pas shown inFIGS.13C and13D.", "", "Vehicle height dynamics may be customized to allow for a relatively soft unloaded state while still increasing stiffness significantly once a critical deflection is achieved.FIG.14shows a resilient element146that varies from a first thickness t1near the ends of the elements to a second thickness t2at the peak of the element. As seen in the equation above for spring constants, the spring constant k is proportional to the thickness taken to the third power. Therefore, as the element deflects and contacts an adjacent element, the spring constant of the element will increase both because the length of the spring segments has been roughly halved, but also because the thickness is increasing as the peaks flatten against one another.", "", "Similarly, but less dramatically, the spring constant of the element156may be customized by changing the width of the element along its length. InFIG.15, element156is at a maximum width w1at the ends of the element, with a minimum width w2at the center of the element. The spring constant is directly proportional to element width, which will increase as elements156contact adjacent elements. In addition to element thickness and width, the spacing, shape, material, and interaction between adjacent elements may be modified to customize ride height characteristics.", "", "FIG.16shows an aspect of the invention that includes with a wheel160that has resilient elements166with a more pronounced curve than the wheel ofFIG.5. A more pronounced curve translates into less lateral motion of the curve's peak, and more motion in the tensile/compressive directions. This provides a softer ride under no or light loads, a low critical load as deflection will occur under lighter loads.", "", "FIG.17shows a wheel170with resilient elements176having a similar shape to the elements166of wheel160, but the adjacent, non-contacting elements share a hub connection portion1762and rim connection portion1764. This connection places more stress on the connection points, but otherwise is still able to deflect and contact adjacent elements.", "", "FIGS.18A and18Bshow aspects of the invention with wheel180having curved elements186with the curve's peak186plocated closer to the hub182than the rim184. The peaks186pof elements186will contact one another sooner under a shorter deflection in the direction of the arrow inFIG.18B.", "", "FIG.19shows an aspect of the invention where wheel190has alternating resilient elements, with elements196hhaving a peak196pcloser to the hub192than to the rim194, and elements196rhaving a peak196pcloser to the rim194than to the hub192. Adjacent elements that curve away from one another define a generally elliptical shape therebetween, the elliptical shape having a major axis that is tilted at an angle V as shown inFIG.20A. This creates a directionality, having a different energy transfer when a moment MT+is applied to the elements as inFIG.20Athan when a moment MT−is applied as shown inFIG.20B.", "", "The torque applied to the resilient elements transfers the torque to the rim through moments applied to the elements. The ability of the elements to resist moments translates into more efficient and immediate transfer of energy to the outer rim. When a clockwise moment is applied to the elements196, the energy transfer is more direct, resulting in less deflection of the elements. Efficient and immediate transfer of energy may be beneficial when there is sufficient traction to propel the vehicle. In cases where maintaining traction is problematic, such as when driving on smooth services or when loads are light reducing frictional forces, a softer transfer of shearing forces from the hub to the rim may be preferable. In this case, applying a motive force to the hub in the clockwise direction softens the transfer of forces to the ground-engaging surface, allowing a slower transfer of forces to the ground to allow for a buffer to not exceed the static friction threshold. When unpowered, the elements196will deform normally to oppose forces due to load or object on the driving surface.", "", "Wheels can be installed in opposite directions and powered selectively based on direction of acceleration and braking. As shown inFIG.21, when vehicle210moves in the B direction, wheels200acan apply torque to the hub in a counter-clockwise direction. This will translate softly to the ground G as the elements deform. Once up to speed, wheels200bcan be powered to provide additional power if needed with less worry of losing traction. When braking, wheels200bcan be used to apply torque in a clockwise direction, softly applying force to the ground G.", "", "The shape of elements206aand206bmay be tailored to provide a softer start or softer braking by allowing more flexure of the elements as the torque is applied to the hub. This can help prevent wheel slip as the power transfer to the contact area of the tire is applied over a longer time period. Instant power transfer, such as that from electric motors, can result in slipping. Conversely, when slipping isn't a problem, the orientation of the elements can provide firmer power transfer, allowing for faster acceleration or harder braking. If the wheel is not being powered or braking, the elements will act predominantly in the normal direction.", "", "FIGS.22and23show two types of vehicles employing directional resilient elements. InFIG.22, vehicle220has two sets of wheels220aand220bwith oppositely directional resilient elements226aand226b, respectively. The wheels have motors230that may be independently actuated to provide power or braking, as well as being progressively actuated to turn the vehicle using friction turning. InFIG.23, vehicle221has three wheels, with one wheel220aproviding power and turning using motor223, and two wheels226bon a common shaft powered by a motor223.", "", "The materials used for the wheels embodied in the invention is an important design choice. Elastomeric wheels, like those made of urethane, come in a variety of hardnesses. Many wheels used in industrial operations comprise wheels rigidly attached to a vehicle chassis, with rubberized or otherwise resilient ground-engaging materials to provide increased traction. Generally, the less hard the wheel, the greater the traction and vibration or surface-variation compensation. Softer outer surfaces also typically result in increased rolling resistance, requiring greater force to drive and turn, and decreased durability, more readily wearing or delaminating when repeatedly subjected to high shear forces.", "", "For battery operated vehicles, increased rolling resistance leads to more downtime to recharge or swap batteries and greater energy consumption, decreasing the vehicle's operating efficiency. Soft wheels can also peel or delaminate when repeatedly subjected to high lateral forces. Increased wear on the treads also means more downtime and increased cost to replace wheels. The wheel or portions thereof, notably the resilient elements, may be covered in a material that aids in vibrations damping, such as a rubber or other viscoelastic material that can convert motion into heat.", "", "Those skilled in the art will appreciate that numerous variations and modifications may be made to the above disclosed embodiments without departing from the spirit and scope of the present invention."], "claims": ["1 .- 17 . (canceled)", "rotating the at least one wheel in a first direction such that the vehicle is moving, the at least one wheel including a hub, a rim, and a resilient interface between the hub and the rim; and permitting the resilient interface of the at least one wheel to change its shape as the at least one wheel rotates, the resilient interface including mutually adjacent resilient elements, each of which defines an elliptical void therebetween, the elliptical void having a major axis that is angled with respect to a generally radial direction of the adjacent resilient elements, and wherein each apex of arcuate portions of the adjacent resilient elements alternates from being closer to the outer rim than to the inner hub and closer to the inner hub than the outer rim, such that power is transferred from the inner hub to the outer rim faster when a rotational direction of the inner hub is in the direction of the major axis than when the rotational direction of the inner hub is opposite the direction of the major axis.", "22 . The method of claim 21 , wherein the resilient elements exhibit a first spring constant that is the same for all resilient elements when not compressed, and a second spring constant that is higher than the first spring constant for resilient elements that are compressed beyond a threshold compression.", "23 . The method of claim 21 , wherein the resilient elements are curved, wherein each curved resilient element has a peak defined as an area a maximum distance away from a line going through its respective inner connection portion and outer connection portion, wherein, upon compression of the resilient member beyond a threshold deflection, the peak of one resilient member comes into contact with the peak from an adjacent resilient member.", "24 . The method of claim 23 , wherein the peaks of the resilient elements are in the center of the curved portions.", "25 . The method of claim 23 , wherein the peaks of the resilient members are closer to the inner connection portions than to the outer connection portions.", "26 . The method of claim 23 , wherein the relative location of peaks of adjacent resilient elements alternate being closer to the inner connection portions and closer to the outer connection portions.", "27 . The method of claim 23 , wherein the resilient elements have a first thickness at the inner and outer connection portions, and a second thickness at the peak, wherein the first thickness is thicker than the second thickness.", "rotating the at least one wheel in a first direction such that the vehicle is moving, the at least one wheel including a hub, a rim, and a resilient interface between the hub and the rim; and absorbing a compressive force by the resilient interface of the at least one wheel as the at least one wheel rotates, the resilient interface including mutually adjacent resilient elements, each of which defines an elliptical void therebetween, the elliptical void having a major axis that is angled with respect to a generally radial direction of the adjacent resilient elements, and wherein each apex of arcuate portions of the adjacent resilient elements alternates from being closer to the outer rim than to the inner hub and closer to the inner hub than the outer rim, such that power is transferred from the inner hub to the outer rim faster when a rotational direction of the inner hub is in the direction of the major axis than when the rotational direction of the inner hub is opposite the direction of the major axis.", "29 . The method of claim 28 , wherein the resilient elements exhibit a first spring constant that is the same for all resilient elements when not compressed, and a second spring constant that is higher than the first spring constant for resilient elements that are compressed beyond a threshold compression.", "30 . The method of claim 28 , wherein the resilient elements are curved, wherein each curved resilient element has a peak defined as an area a maximum distance away from a line going through its respective inner connection portion and outer connection portion, wherein, upon compression of the resilient member beyond a threshold deflection, the peak of one resilient member comes into contact with the peak from an adjacent resilient member.", "31 . The method of claim 30 , wherein the peaks of the resilient elements are in the center of the curved portions.", "32 . The method of claim 30 , wherein the peaks of the resilient members are closer to the inner connection portions than to the outer connection portions.", "33 . The method of claim 30 , wherein the relative location of peaks of adjacent resilient elements alternate being closer to the inner connection portions and closer to the outer connection portions.", "34 . The method of claim 30 , wherein the resilient elements have a first thickness at the inner and outer connection portions, and a second thickness at the peak, wherein the first thickness is thicker than the second thickness.", "rotating the at least one wheel in a first direction such that the vehicle is moving, the at least one wheel including a hub, a rim, and a resilient interface between the hub and the rim, the resilient interface including mutually adjacent resilient elements, each of which defines an elliptical void therebetween, the elliptical void having a major axis that is angled with respect to a generally radial direction of the adjacent resilient elements, and wherein each apex of arcuate portions of the adjacent resilient elements alternates from being closer to the outer rim than to the inner hub and closer to the inner hub than the outer rim, such that power is transferred from the inner hub to the outer rim faster when a rotational direction of the inner hub is in the direction of the major axis than when the rotational direction of the inner hub is opposite the direction of the major axis; applying a compressive force to the at least one wheel as it is rotating; and absorbing a compressive force by the resilient interface.", "36 . The method of claim 35 , wherein the resilient elements exhibit a first spring constant that is the same for all resilient elements when not compressed, and a second spring constant that is higher than the first spring constant for resilient elements that are compressed beyond a threshold compression.", "37 . The method of claim 35 , wherein the resilient elements are curved, wherein each curved resilient element has a peak defined as an area a maximum distance away from a line going through its respective inner connection portion and outer connection portion, wherein, upon compression of the resilient member beyond a threshold deflection, the peak of one resilient member comes into contact with the peak from an adjacent resilient member.", "38 . The method of claim 37 , wherein the peaks of the resilient elements are in the center of the curved portions.", "39 . The method of claim 37 , wherein the peaks of the resilient members are closer to the inner connection portions than to the outer connection portions.", "40 . The method of claim 37 , wherein the relative location of peaks of adjacent resilient elements alternate being closer to the inner connection portions and closer to the outer connection portions.", "41 . The method of claim 37 , wherein the resilient elements have a first thickness at the inner and outer connection portions, and a second thickness at the peak, wherein the first thickness is thicker than the second thickness."], "bibtex": "@patent{20250065669,\n    title = {SYSTEMS AND METHODS FOR PROVIDING WHEELS HAVING VARIABLE SPRING RATES},\n    number = {20250065669},\n    year = {2025},\n    note = {File: US20250065669A1-20250227.XML}\n    }", "classification": "B60B904FI"}, {"title": "WHEEL ASSEMBLY", "doc_number": "20250065670", "filename": "US20250065670A1-20250227.XML", "abstract": "Disclosed is a wheel assembly including a wheel portion, and optionally, a hub portion transmitting driving force transmitted through a drive shaft to the wheel portion. The wheel portion further includes a wheel flange portion connected to the hub portion, and the wheel flange portion includes a foreign matter discharge portion having a first discharge surface and a second discharge surface indented in different directions on an inner side surface.", "detailed_description": ["Since the present disclosure may make various changes and have various embodiments, some embodiments are illustrated in the drawings and described in detail. However, this is not intended to limit the present disclosure to the embodiments, and should be understood to include all modifications, equivalents, and substitutes included in the spirit and scope of the present disclosure.", "", "It is understood that the term “vehicle” or “vehicular” or other similar term as used herein is inclusive of motor vehicles in general such as passenger automobiles including sports utility vehicles (SUV), buses, trucks, various commercial vehicles, watercraft including a variety of boats and ships, aircraft, and the like, and includes hybrid vehicles, electric vehicles, plug-in hybrid electric vehicles, hydrogen-powered vehicles and other alternative fuel vehicles (e.g. fuels derived from resources other than petroleum). As referred to herein, a hybrid vehicle is a vehicle that has two or more sources of power, for example both gasoline-powered and electric-powered vehicles.", "", "The terminology used herein is for the purpose of describing particular embodiments only and is not intended to be limiting of the disclosure. As used herein, the singular forms “a,” “an” and “the” are intended to include the plural forms as well, unless the context clearly indicates otherwise. These terms are merely intended to distinguish one component from another component, and the terms do not limit the nature, sequence or order of the constituent components. It will be further understood that the terms “comprises” and/or “comprising,” when used in this specification, specify the presence of stated features, integers, steps, operations, elements, and/or components, but do not preclude the presence or addition of one or more other features, integers, steps, operations, elements, components, and/or groups thereof. As used herein, the term “and/or” includes any and all combinations of one or more of the associated listed items. Throughout the specification, unless explicitly described to the contrary, the word “comprise” and variations such as “comprises” or “comprising” will be understood to imply the inclusion of stated elements but not the exclusion of any other elements. In addition, the terms “unit”, “-er”, “-or”, and “module” described in the specification mean units for processing at least one function and operation, and can be implemented by hardware components or software components and combinations thereof.", "", "Although exemplary embodiment is described as using a plurality of units to perform the exemplary process, it is understood that the exemplary processes may also be performed by one or plurality of modules. Additionally, it is understood that the term controller/control unit refers to a hardware device that includes a memory and a processor and is specifically programmed to execute the processes described herein. The memory is configured to store the modules and the processor is specifically configured to execute said modules to perform one or more processes which are described further below.", "", "Further, the control logic of the present disclosure may be embodied as non-transitory computer readable media on a computer readable medium containing executable program instructions executed by a processor, controller or the like. Examples of computer readable media include, but are not limited to, ROM, RAM, compact disc (CD)-ROMs, magnetic tapes, floppy disks, flash drives, smart cards and optical data storage devices. The computer readable medium can also be distributed in network coupled computer systems so that the computer readable media is stored and executed in a distributed fashion, e.g., by a telematics server or a Controller Area Network (CAN).", "", "Unless specifically stated or obvious from context, as used herein, the term “about” is understood as within a range of normal tolerance in the art, for example within 2 standard deviations of the mean. “About” can be understood as within 10%, 9%, 8%, 7%, 6%, 5%, 4%, 3%, 2%, 1%, 0.5%, 0.1%, 0.05%, or 0.01% of the stated value. Unless otherwise clear from the context, all numerical values provided herein are modified by the term “about”.", "", "Terms such as first and second may be used to describe various components, but the components should not be limited by the terms. These terms are only used for distinguishing one component from another. For example, a first element may be termed a second element, and similarly, a second element may be termed a first element, without departing from the scope of the present disclosure. The term ‘and/or’ includes a combination of a plurality of related recited items or any one of a plurality of related recited items.", "", "Terms used in this application are only used to describe embodiments, and are not intended to limit the present disclosure. Singular expressions include plural expressions unless the context clearly dictates otherwise. In this application, the terms “include”, “have” and the like are intended to designate that there is a feature, number, step, operation, component, part, or combination thereof described in the specification, but it should be understood that it does not preclude the possibility of the presence or addition of one or more other features, numbers, steps, operations, components, parts, or combinations thereof.", "", "Unless defined otherwise, all terms used herein, including technical or scientific terms, have the same meaning as commonly understood by one of ordinary skill in the art to which the present disclosure belongs. Terms such as those defined in commonly used dictionaries should be interpreted as having a meaning consistent with the meaning in the context of the related art, and unless expressly defined in this application, it is not to be construed in an ideal or overly formal sense.", "", "Hereinafter, with reference to the accompanying drawings, embodiments of the present disclosure will be described in more detail.", "", "FIG.1is a perspective cross-sectional view of a wheel assembly according to an embodiment,FIG.2is a side cross-sectional view of a wheel assembly according to an embodiment, andFIG.3is an enlarged view of a wheel assembly illustrating a movement path (E) of foreign matter introduced through a hubcap140according to an embodiment.", "", "Referring toFIGS.1and2, a wheel assembly according to an embodiment may include a wheel portion100, a brake disk portion200, and a hub portion300. In the wheel assembly, the brake disc portion200is disposed between the wheel portion100and the hub portion300, and the wheel portion100, the brake disc portion200, and the hub portion300are coupled by a coupling bolt (B) penetrating therethrough.", "", "For example, the wheel portion100, the brake disc portion200, and the hub portion300may respectively include coupling holes formed in corresponding positions, and may be coupled to each other through the coupling bolt (B) passing through the coupling holes formed in corresponding positions.", "", "The wheel portion100may include a rim portion110supporting a tire, and a wheel disc portion120having an outer circumferential surface coupled to the rim portion110and supported thereby, and coupled to the brake disc portion200and the hub portion300.", "", "In this case, the wheel portion100may be integrally formed by welding the inner peripheral surface of the rim portion110and the outer peripheral surface of the wheel disk portion120.", "", "The wheel disk portion120may have a hub hole150disposed in the center. The hub hole150may be formed by a cylindrical hubcap coupling portion130protruding from the center of the wheel disk portion120to one side.", "", "In this case, a drive shaft400may protrude from the hub hole150formed by the hubcap coupling portion130. By combining the hubcap coupling portion130with the hubcap140, the drive shaft400protruding from the hub hole150may be prevented from being exposed externally.", "", "The brake disc portion200may include a brake flange portion210and a sliding portion220.", "", "The brake flange portion210is coupled to the drive shaft400by the coupling bolt (B) and is coupled to the hub portion300that rotates, and the sliding portion220has a disk-shaped disk structure and may generate braking force by frictionally contacting a brake pad (not illustrated).", "", "In more detail, the sliding portion220of the brake disc portion200is disposed between a pair of brake pads (not illustrated) provided in the vehicle, and when the brake pad (not illustrated) moves toward the sliding portion220of the brake disc portion and contacts and presses the same, frictional force is generated between the brake pad (not illustrated) and the sliding portion220, thereby slowing down or stopping the rotational speed of the wheel portion100and the hub portion300combined with the flange portion of the brake disc portion200.", "", "The hub portion300may include a hub flange portion310that is fixed and supported together with the brake disk portion200and the wheel portion100through the coupling bolt (B), a disk guide portion320having a hollow cylindrical shape and inserted into and supported by the brake flange portion210, and a body portion330having a hollow cylindrical shape and coupled to the drive shaft400therein.", "", "On the other hand, referring toFIG.3, foreign matter such as moisture and the like may pass through the coupling portion of the hubcap coupling portion130and the hubcap140. Foreign matter flowing in through the hubcap coupling portion130may cause corrosion. Accordingly, foreign matter that has entered the coupling portion of the hubcap coupling portion130and the hubcap140is discharged to the outside of the wheel by centrifugal force generated by the rotation of the wheel.", "", "In more detail, foreign matter introduced into the coupling portion of the hubcap coupling portion130and the hubcap140may pass through the space formed by the inner side surface of the cylindrical hubcap coupling portion130of the wheel portion100and the outer side surface of the guide portion of the hub portion300, and may be discharged externally through the space formed by the outer side surface F2of the brake flange portion210and a foreign matter discharge portion122of the wheel portion100.", "", "FIG.4is a side cross-sectional view of the wheel portion100according to an embodiment,FIG.5is a perspective view of a wheel flange portion121viewed from the inner side according to an embodiment,FIG.6is a perspective cross-sectional view of the wheel flange portion121according to an embodiment, andFIG.7is an enlarged view of the foreign matter discharge portion122formed by a wheel, a brake disc, and a hub assembly according to an embodiment.FIG.8Ais a perspective view of a foreign matter discharge portion122according to the related art, andFIG.8Bis a perspective view of the foreign matter discharge portion122according to an embodiment of the present disclosure.", "", "Referring toFIGS.4to6, the wheel flange portion121of the wheel according to an embodiment of the present disclosure may include a plurality of first coupling holes N1penetrating through the wheel flange portion121and a foreign matter discharge portion122formed on the inner side surface of the wheel flange portion121.", "", "In this case, a plurality of foreign matter discharge portions122may be disposed between the plurality of first coupling holes N1, and the first coupling holes (N1) may have a cross-sectional shape that is indented from the outside to the inside, and the foreign matter discharge portion122may have a cross-sectional shape that is indented from the inside to the outside.", "", "The first coupling hole (N1) may be formed by penetrating through the inner side and outer side surfaces of the wheel flange portion121, and the plurality of first coupling holes N1may be formed to be spaced apart from each other at equal intervals while forming a circle along the center of the wheel flange portion121.", "", "The foreign matter discharge portion122may form a space for discharging foreign matter introduced into the space between the hubcap140and the hubcap coupling portion130to the outside of the wheel assembly.", "", "The foreign matter discharge portion122may be formed on the inner side surface of the wheel flange portion121, and may be formed in the space between the first coupling holes (N1), which are spaced apart from each other at equal intervals and are disposed while forming a circle along the center of the flange portion.", "", "The wheel flange portion121may be indented from the outer side to the inner side in the position where the first coupling hole N1is formed, and may be formed by indenting from the inner side to the outer side in the location where the foreign matter discharge portion122is formed.", "", "The foreign matter discharge portion122may include a first outlet123, a foreign matter discharge groove125, and a second outlet124formed by being recessed from the inner side of the wheel flange portion121toward the outer side.", "", "Additionally, the first outlet123, the foreign matter discharge groove125, and the second outlet124may be connected to each other. Foreign matter flowing into the space between the hubcap140and the hubcap coupling portion130may be discharged externally by centrifugal force generated by the rotational force of the wheel along the first outlet123, the foreign matter discharge groove125, and the second outlet124that are formed by indenting from the inner side to the outer side of the wheel flange portion121.", "", "The first outlet123may be formed over a portion of the hubcap coupling portion130and a portion of the inner side surface of the wheel flange portion121.", "", "In detail, the first outlet123may include a first discharge surface S1and a second discharge surface S2.", "", "The first discharge surface S1may be formed to be substantially parallel to the inner side surface of the wheel flange portion121. Additionally, the second discharge surface S2may be formed on the inner side surface of the hubcap coupling portion130at a predetermined angle (θ).", "", "InFIG.7, the dotted line exemplarily illustrates a cross section of the first outlet123according to the related art. Referring to the dotted line portion ofFIG.7andFIG.8A, the first outlet123according to the related art forms only a first discharge surface S1formed substantially parallel to the inner side surface of the wheel flange portion121. In addition, the first outlet123according to the related art is formed to have a relatively deep depth from the inner side surface of the wheel flange portion121to smoothly discharge foreign matter only through the first discharge surface S1.", "", "On the other hand, the first discharge surface S1forming a deep depth from the inner side surface of the wheel flange portion121reduces the rigidity of the wheel flange portion121, which causes a problem in that the NVH performance of the vehicle deteriorates.", "", "Referring toFIGS.5to7and8B, the first outlet123according to an embodiment of the present disclosure has a second discharge surface S2indented into the inner side surface of the hubcap coupling portion130and formed with a predetermined slope, and a first discharge surface S1formed by indenting the inner side surface of the wheel flange portion121.", "", "Therefore, the first outlet123according to an embodiment may be formed to have a higher height than a height of the first outlet123according to the related art, and accordingly, the rigidity of the wheel flange portion121is improved, and the NVH performance of the vehicle may be improved.", "", "In addition, the second discharge surface S2is formed with a predetermined slope by being indented in the inner side surface of the hubcap coupling portion130in the direction of the movement path (E) of foreign matter discharged externally by centrifugal force, thereby helping foreign matter inside the hub hole150to be smoothly discharged externally.", "", "In addition, by adjusting the starting height (H1) of the second discharge surface S2, the wheel portion100according to an embodiment of the present disclosure may be compatible with the wheel portion100of the wheel, brake disc, and hub assembly according to the related art.", "", "In this case, the starting height (H1) of the second discharge surface S2may be formed by using the outer surface (F2) of the brake flange portion (210) so as not to interfere with the disk guide portion320of the hub portion300.", "", "For example, in the case of the first outlet123of a wheel according to the related art, the first outlet123may be formed at a distance of 12 mm from the outer side surface F2of the brake flange portion210.", "", "In this case, if the starting height H1of the second discharge surface S2of the first outlet123according to an embodiment of the present disclosure is formed smaller than 12 mm based on the outer side surface (F2) of the brake flange portion210, interference with the brake disc portion200or other parts may occur.", "", "Therefore, when the starting height H1of the second discharge surface S2of the first outlet123according to an embodiment is formed to be 12 mm or more based on the outer side surface (F2) of the brake flange portion210, which is same as the wheel portion100having the first outlet123according to the related art and may thus be compatible therewith, without interference with other parts including the brake disc portion200.", "", "In the wheel, brake disc and hub assembly according to the related art, even if replaced with the wheel portion100according to an embodiment, foreign matter such as moisture and the like flowing into the hubcap140through the space between the upper surfaces of the disk guide portion320at the starting height H1of the second discharge surface S2may pass more smoothly and be discharged externally.", "", "Referring again toFIG.7, the second discharge surface S2may form a predetermined angle θ based on the inner side surface of the cylindrical hubcap coupling portion130. The angle θ of the second discharge surface S2may be formed such that the depth of the groove increases as it moves away from the hubcap coupling portion130from the starting point of the second discharge surface S2.", "", "The second discharge surface S2forming a predetermined angle θ is formed to be inclined in the direction of the centrifugal force of the foreign matter introduced through the hubcap140, and thus, foreign matter may be discharged externally more smoothly.", "", "In this case, the predetermined angle (θ) may be about 8 degrees (°). The wheel portion100may be manufactured using a casting method, and in detail, the predetermined angle may be set to be greater than about 8 degrees (°) by considering the possibility of missing the casting mold and ease of molding, but the present disclosure is not limited thereto.", "", "Additionally, if the predetermined angle θ is formed too large, there is a risk that the rigidity of the wheel assembly may decrease and the NVH improvement effect of the vehicle may be reduced. Therefore, the predetermined angle (θ) may be set, in detail, to be smaller than about 45 degrees (°), but the present disclosure is not limited thereto.", "", "Referring again toFIG.8A, the first discharge portion according to the related art forms a one-dimensional passage. In more detail, the first discharge portion forms a first discharge surface S1in the direction from the hub hole150to the foreign matter discharge groove125.", "", "Referring again toFIG.8B, the first discharge portion according to an embodiment of the present disclosure may form a two-dimensional passage. The first discharge portion may have a first discharge surface S1in the direction from the hub hole150to the foreign matter discharge groove125, and a second discharge surface S2formed in the direction of the inner side surface of the wheel flange portion121.", "", "Accordingly, the height from the bottom of the foreign matter discharge groove125to the first discharge surface S1according to an embodiment of the present disclosure may be higher than the height from the bottom of the foreign matter discharge groove125to the first discharge surface S1according to the related art. In the wheel portion100according to an embodiment of the present disclosure, due to the material filled to the height from the bottom of the foreign matter discharge groove125to the first discharge surface S1, the rigidity of the wheel flange portion121may be strengthened to improve the NVH performance of the vehicle.", "", "FIG.9is a perspective view of the hub portion300according to an embodiment,FIG.10is a side cross-sectional view of the hub portion300according to an embodiment, andFIG.11is a plan view of the hub portion300according to an embodiment.", "", "Referring toFIGS.9to11, in the hub portion300according to an embodiment, a body portion330of a cylindrical shape that supports the drive shaft400transmitting engine driving force transmitted through the transmission to the wheels, a hub flange portion310extending in the radial direction of the cylindrical body portion330and forming a third coupling hole N3, and a disc guide portion320, which is provided on the axially outer end of the body portion330and into which the brake flange portion210of the brake disc portion200is inserted and supported, may be formed.", "", "In this case, on the inner side surface of the cylindrical body portion330, a shaft coupling portion331repeatedly protruding in the inner diameter direction along the longitudinal direction of the body portion330such that it may rotate integrally with the drive shaft400, may further be included.", "", "The drive shaft400has a cross-sectional shape corresponding to the cross-section of the cylindrical portion including the shaft coupling portion331, and is inserted into the cylindrical portion and fixedly supported, so as not to slip, and thus, the engine driving force transmitted through the transmission may be transmitted to the wheels.", "", "The disk guide portion320may further include a plurality of third discharge surfaces S3formed along the outer circumferential surface at one end.", "", "Referring again toFIG.7, as the disk guide portion320further includes the third discharge surface S3, the movement path (E) of the incoming foreign matter may secure sufficient space for the foreign matter to pass through, and foreign matter may be smoothly discharged externally.", "", "In this case, the third discharge surface S3of the disk guide portion320may be formed to correspond to the position of the foreign matter discharge portion122of the wheel portion100, in more detail, the first outlet123.", "", "As the first outlet123and the third discharge surface S3face each other, the space of the movement path E of foreign matter may be further expanded.", "", "FIG.12Ais a plan view illustrating an annular mold (M) for forming the hub portion300and the third discharge surface S3according to an embodiment, by way of example, andFIG.12Bis a side view illustrating an annular mold (M) for forming the hub portion300and the third discharge surface S3according to an embodiment, by way of example.", "", "A wheel assembly according to an embodiment may be assembled by the first coupling hole (N1) of the wheel portion100, the second coupling hole (N2) of the brake disc portion200, the third coupling hole (N3) of the hub portion300, and the coupling bolt (B) penetrating through the first to third coupling holes N1to N3.", "", "Accordingly, as the foreign matter discharge portion122of the wheel portion100and the third discharge surface S3of the hub portion300are aligned based on the respective coupling holes formed in corresponding positions, the foreign matter discharge portion122and the third discharge surface S3may be formed in positions corresponding to each other, and a movement path (E) for foreign matter may be formed such that foreign matter may be discharged smoothly.", "", "Referring toFIGS.5,9,11, and12A, the first coupling holes (N1), the second coupling holes (N2), and the third coupling holes (N3) may be formed in five, respectively, but the present disclosure is not limited thereto.", "", "The wheel portion100may generally be manufactured through casting. In the case in which the wheel portion100is manufactured through casting, the foreign matter discharge portion122of the wheel portion100may be formed simultaneously with the first coupling hole N1.", "", "Therefore, in the casting operation, the wheel portion100may be manufactured by manufacturing an upper or lower mold that reflects the position and shape of the foreign matter coupling portion based on the first coupling hole N1.", "", "The hub portion300may be manufactured using a forging process.", "", "For example, after first manufacturing the hub portion300in which no coupling hole is formed through a forging process by cutting and heating the raw material, the coupling hole may be processed by heat treatment, shorting, and the like.", "", "In this case, referring toFIGS.12A and12B, the third discharge surface S3may be formed using an annular mold.", "", "After disposing the annular mold (M) according to the position of the foreign matter discharge portion122, the third discharge surface S3may be formed by pressing the annular mold (M) using a forging press (P).", "", "For example, by disposing five annular molds M to form the same angle from the center of the hub, the third discharge surface S3may be formed according to the position of the foreign matter discharge portion122of the wheel portion100.", "", "In this case, when the positions of the foreign matter discharge portion122and the third discharge surface S3are determined based on the positions of the first to third coupling holes N1, N2, and N3, the foreign matter discharge portion122and the third discharge surface S3may be formed in positions corresponding to each other.", "", "In the configuration in which the first to third coupling holes N1, N2and N3are formed, although the wheel portion100, the brake disk portion200, and the hub portion300are different from each other, since the coupling bolt penetrates through the first to third coupling holes N1, N2, and N3to connect the wheel portion100, the brake disk portion200and the hub portion300, the positions of the first to third coupling holes may correspond to each other in the wheel portion100, the brake disc portion200, and the hub portion300.", "", "For example, when a foreign matter discharge portion122is formed at the exact center of the two first coupling holes and a third discharge surface S3is formed at the exact center of the two third coupling holes (N3) connected to the two first coupling holes (N1), the foreign matter discharge portion122and the third discharge surface S3may form positions corresponding to each other.", "", "Since the wheel portion100is generally formed by casting, the coupling hole and the foreign matter discharge portion122may be formed simultaneously during the process of preparing the upper mold. On the other hand, the hub portion300may generally be formed by a forging process, and the third discharge surface S3may also be formed by forging.", "", "Therefore, for continuity of the forging process, the hub portion300may be formed by first forging the third discharge surface and then setting the third coupling hole (N3) based on the position of the third discharge surface (S3) and drilling the same.", "", "However, without being limited thereto, after forging the hub portion300, the third coupling hole (N3) is first formed by drilling, and the third discharge surface S3may be set based on the position of the third coupling hole (N3).", "", "Additionally, by adjusting the size of the radius (R) of the annular mold (M), a width (d2) of the third discharge surface S3may be adjusted.", "", "For example, when the size of the radius (R) of the annular mold (M) is increased or decreased, the width d2of the third discharge surface S3may increase or decrease. Accordingly, the width d2of the third discharge surface S3may be formed to correspond to the width d1of the first outlet123by adjusting the size of the radius R of the annular mold M.", "", "By matching the width d2of the third discharge surface S3and the width d1of the first outlet123, rigidity may be significantly increasing by securing the movement path (E) of foreign matter and also significantly reducing material loss.", "", "Referring again toFIG.7, the starting height (H2) of the third discharge surface S3formed by pressing the annular mold (M) may be set based on the outer surface (F2) of the brake flange portion210, like the second discharge surface S2of the wheel portion100.", "", "For example, the starting height H2of the third discharge surface S3may be forged to be 5 mm based on the outer side surface F2of the brake flange portion210.", "", "In this case, by setting the starting height H2of the third discharge surface S3and the starting height H1of the second discharge surface S2based on the outer side surface F2of the brake flange portion210, compatibility with wheel assemblies according to the related art may be improved.", "", "For example, the height of the first outlet according to the related art may be confirmed based on the outer side surface (F2) of the brake flange portion210, and by forming the starting height (H1) of the second discharge surface S2according to an embodiment of the present disclosure depending on the height of the confirmed first outlet, assembly with brake discs and hubs according to the related art may be obtained.", "", "In addition, by forming the starting height H2of the third discharge surface S3based on the outer side surface F2of the brake flange portion210, the movement path (E) of foreign matter may be sufficiently secured, and the foreign matter discharge performance may be maintained or further improved compared to the related art.", "", "As set forth above, the wheel assembly according to an embodiment may have improved NVH performance of a vehicle by improving rigidity of the wheel.", "", "Additionally, the wheel assembly according to an embodiment may smoothly discharge foreign matter flowing into the hubcap.", "", "In addition, in a method of manufacturing a hub according to another embodiment, by forming a foreign matter discharge passage along with a wheel with improved rigidity, a hub helping to smoothly discharge foreign matter flowing into the hubcap while improving vehicle's NVH performance may be manufactured.", "", "In addition, in a method of manufacturing a hub according to another embodiment, by forming a foreign matter discharge passage along with a wheel with improved rigidity, a hub helping to smoothly discharge foreign matter flowing into the hubcap while improving vehicle's NVH performance may be manufactured.", "", "While example embodiments have been illustrated and described above, it will be apparent to those skilled in the art that modifications and variations could be made without departing from the scope of the present disclosure as defined by the appended claims."], "claims": ["a wheel portion comprising a wheel flange portion, wherein the wheel flange portion comprises a foreign matter discharge portion having a first discharge surface and a second discharge surface indented in different directions on an inner side surface of the wheel flange portion.", "a hub portion transmitting driving force transmitted through a drive shaft to the wheel portion, wherein the wheel flange portion is connected to the hub portion.", "the first discharge surface is provided along the inner side surface of the wheel flange portion, and the second discharge surface is provided along an inner side surface of the hubcap coupling portion.", "4 . The wheel assembly of claim 3 , wherein the second discharge surface is provided with a predetermined slope with respect to the inner side surface of the hubcap coupling portion.", "5 . The wheel assembly of claim 4 , wherein the predetermined slope has an angle of about 8 degrees (°) to about 45 degrees (°) relative to the inner side surface of the hubcap coupling portion.", "wherein a starting height of the second discharge surface is set based on a surface facing the wheel portion of the brake disc portion.", "wherein the disk guide portion comprises a third discharge surface formed by indenting an outer circumferential surface of the one side.", "wherein a starting height of the third discharge surface is set based on a surface facing the wheel portion of the brake disc portion.", "9 . The wheel assembly of claim 7 , wherein the third discharge surface is provided in a position facing the foreign matter discharge portion such that the foreign matter discharge portion and the third discharge surface form a foreign matter movement path through which a foreign matter passes.", "10 . The wheel assembly of claim 7 , wherein the third discharge surface has a width corresponding to a width of the foreign matter discharge portion.", "a wheel portion comprising a wheel flange portion having a foreign matter discharge portion; a hub portion connected to the wheel portion, wherein the hub portion has a discharge surface formed by being indented in a position corresponding to the foreign matter discharge portion.", "a brake disc portion connected to the wheel portion and transmitting braking force, wherein the hub portion comprises a disk support portion supporting the brake disk portion.", "13 . The wheel assembly of claim 12 , wherein positions of the foreign matter discharge portion and the discharge surface are set based on a position of a coupling hole.", "14 . The wheel assembly of claim 13 , wherein the coupling hole is formed in the wheel portion, the brake disk portion, and the hub portion, respectively, and the wheel portion, the brake disk portion, and the hub portion are connected using a coupling bolt penetrating through the coupling hole.", "15 . The wheel assembly of claim 13 , wherein the foreign matter discharge portion is formed in a number corresponding to that of the coupling hole.", "16 . The wheel assembly of claim 12 , wherein the foreign matter discharge portion comprises a first discharge surface formed in a circumferential direction of the wheel portion and a second discharge surface formed in an axial direction.", "17 . The wheel assembly of claim 16 , wherein a starting height of the second discharge surface and a starting height of the discharge surface are set based on a surface facing the wheel portion of the brake disc portion.", "18 . The wheel assembly of claim 11 , wherein the discharge surface is formed by forging using an annular mold.", "19 . The wheel assembly of claim 18 , wherein the discharge surface adjusts a width by changing a size of a radius of the annular mold.", "20 . The wheel assembly of claim 18 , wherein a width of the discharge surface increases or decreases in proportion to an increase or decrease in a radius of the annular mold."], "bibtex": "@patent{20250065670,\n    title = {WHEEL ASSEMBLY},\n    number = {20250065670},\n    year = {2025},\n    note = {File: US20250065670A1-20250227.XML}\n    }", "classification": "B60B2102FI"}, {"title": "Portal Axle for a Rail Vehicle and Method for Manufacturing a Portal Axle of This Type", "doc_number": "20250065671", "filename": "US20250065671A1-20250227.XML", "abstract": "A portal axle as well as a method for manufacturing a portal axle for a rail vehicle, which has an axle centre part extending along a longitudinal axis and two kingpins one of which sits on a first end section of the axle centre part and a second on a second end section of the axle centre part formed opposite to the first end section. The kingpins are oriented away from the axle centre part and form an axis of rotation in use for a rail wheel rotatably mounted on the respective kingpin. The portal axle has optimised usage properties with minimised weight. This is achieved by a longitudinal opening extending in the longitudinal direction of the portal axle being formed in at least one of the mould components. The invention further provides a method for manufacturing an axle of this type.", "detailed_description": [""], "claims": ["1 - 14 . (canceled)", "an axle centre part extending along a longitudinal axis, and two kingpins, one of which sits on a first end section of the axle centre part and a second on a second end section of the axle centre part formed opposite to the first end section, wherein the kingpins are oriented away from the axle centre part and form an axis of rotation in use for a rail wheel rotatably mounted on the respective kingpin, wherein the axle centre part has an upper side assigned to a body of the rail vehicle in use and wherein the kingpins are positioned on the upper side of the axle centre part and wherein a longitudinal opening extending in the longitudinal direction of the portal axle is formed in at least one of the mould components, characterized in that at least one longitudinal opening is moulded into the mould components and in that the longitudinal opening is designed as a through-opening that passes through the respective mould component.", "16 . The portal axle according to claim 15 , wherein the kingpins each have a longitudinal opening formed as a through-opening and in that the longitudinal opening has a first section extending in the longitudinal direction of the longitudinal opening and a second section extending up to the free end face of the kingpin originating from its outlet assigned to the axle centre part, the diameter of which is smaller than the diameter of the first section.", "17 . The portal axle according to claim 15 , wherein at least two longitudinal openings are moulded into the axle centre part.", "18 . The portal axle according to claim 15 , wherein it is manufactured from a steel material with its moulded components in one piece.", "19 . The portal axle according to claim 18 , wherein the longitudinal opening is treated with corrosion protection at least on its inner surface.", "20 . The portal axle according to either claim 18 , wherein it has a hardness at least in the region of the inner surface of the longitudinal opening in an edge layer adjacent to the respective inner surface of the longitudinal opening which is increased as a result of a chemical/thermal edge layer treatment compared to the hardness that the portal axle has in a core region present outside the edge layer.", "21 . The portal axle according to any one of claim 18 , wherein at least the inner surface of the longitudinal opening is provided with an oxide layer.", "a) provision of a portal axle blank comprising the “axle centre part” and “kingpin” moulded components; b) introduction of a longitudinal opening in at least one of the mould components; c) optional edge layer treatment of the portal axle in the region of an inner surface of the longitudinal opening and/or in the region of an outer surface of the portal axle; d) optional oxidation of an inner surface of the longitudinal opening and/or an outer surface of the portal axle.", "23 . The method according to claim 22 , wherein the portal axle is subjected to edge layer treatment throughout after the longitudinal opening has been introduced.", "24 . The method according to either claim 22 , wherein work step c) is carried out as chemical/thermal surface layer treatment.", "25 . The method according to claim 24 , wherein the edge layer treatment increases the N and/or C content at least in the region of the inner surface of the longitudinal opening in an edge layer adjacent to the respective inner surface of the longitudinal opening.", "26 . The method according to claim 22 , wherein the provision of the portal axle blank (work step a)) comprises forging and/or casting the blank from a steel material."], "bibtex": "@patent{20250065671,\n    title = {Portal Axle for a Rail Vehicle and Method for Manufacturing a Portal Axle of This Type},\n    number = {20250065671},\n    year = {2025},\n    note = {File: US20250065671A1-20250227.XML}\n    }", "classification": "B60B3500FI"}, {"title": "TIRE", "doc_number": "20250065672", "filename": "US20250065672A1-20250227.XML", "abstract": "The tire of the present disclosure is a tire having at least one land portion 1 defined on a tread surface of the tire, wherein at least one of the land portions comprises at least one sipe 4 extending in the tire circumferential direction or the tire width direction, the sipe 4 has: a narrow section 41 extending continuously inward in the tire radial direction from the tread surface 1, a widened section 42 on the inner side in the tire radial direction of the narrow section 41 where the sipe width is larger than the narrow section 41, and a plurality of bottom grooves 43 at the bottom of the widened section 42 extending in the extending direction of the sipe.", "detailed_description": ["The tire of the present disclosure can be used for any type of tire, but can suitably be used for passenger car tires and bus or truck tires.", "", "The following is illustrative descriptions of embodiments of the tire according to the present disclosure, with reference to the drawings. In each figure, common components are given the same reference numerals."], "claims": ["at least one of the land portions comprises at least one sipe extending in the tire circumferential direction or the tire width direction, the sipe has: a narrow section extending continuously inward in the tire radial direction from the tread surface, a widened section on the inner side in the tire radial direction of the narrow section where the sipe width is larger than the narrow section, and a plurality of bottom grooves at the bottom of the widened section extending in the extending direction of the sipe.", "2 . The tire according to claim 1 , wherein each of the sipes has 2 to 5 of the bottom grooves.", "3 . The tire according to claim 1 , wherein the length of the bottom groove in the sipe depth direction is ½ or less of the total length of the widened section and the bottom groove in the sipe depth direction.", "the tire is a passenger vehicle tire, the tread surface has a circumferential main groove extending in the tire circumferential direction, and shoulder land portions defined by the circumferential main groove and the tread edges, and the sipe is provided in the shoulder land portions and extends in the tire width direction.", "the tire is a bus or truck tire, the tread surface has at least two circumferential main grooves extending in the tire circumferential direction, a center land portion defined by the two circumferential main grooves, and shoulder land portions defined by the two circumferential main grooves and the tread edges, the sipe is provided in the center land portion and/or the shoulder land portions and extends in the tire circumferential direction.", "6 . The tire according to claim 2 , wherein the length of the bottom groove in the sipe depth direction is ½ or less of the total length of the widened section and the bottom groove in the sipe depth direction.", "the tire is a passenger vehicle tire, the tread surface has a circumferential main groove extending in the tire circumferential direction, and shoulder land portions defined by the circumferential main groove and the tread edges, and the sipe is provided in the shoulder land portions and extends in the tire width direction.", "the tire is a bus or truck tire, the tread surface has at least two circumferential main grooves extending in the tire circumferential direction, a center land portion defined by the two circumferential main grooves, and shoulder land portions defined by the two circumferential main grooves and the tread edges, the sipe is provided in the center land portion and/or the shoulder land portions and extends in the tire circumferential direction.", "the tire is a passenger vehicle tire, the tread surface has a circumferential main groove extending in the tire circumferential direction, and shoulder land portions defined by the circumferential main groove and the tread edges, and the sipe is provided in the shoulder land portions and extends in the tire width direction.", "the tire is a bus or truck tire, the tread surface has at least two circumferential main grooves extending in the tire circumferential direction, a center land portion defined by the two circumferential main grooves, and shoulder land portions defined by the two circumferential main grooves and the tread edges, the sipe is provided in the center land portion and/or the shoulder land portions and extends in the tire circumferential direction.", "the tire is a passenger vehicle tire, the tread surface has a circumferential main groove extending in the tire circumferential direction, and shoulder land portions defined by the circumferential main groove and the tread edges, and the sipe is provided in the shoulder land portions and extends in the tire width direction.", "the tire is a bus or truck tire, the tread surface has at least two circumferential main grooves extending in the tire circumferential direction, a center land portion defined by the two circumferential main grooves, and shoulder land portions defined by the two circumferential main grooves and the tread edges, the sipe is provided in the center land portion and/or the shoulder land portions and extends in the tire circumferential direction."], "bibtex": "@patent{20250065672,\n    title = {TIRE},\n    number = {20250065672},\n    year = {2025},\n    note = {File: US20250065672A1-20250227.XML}\n    }", "classification": "B60C1112FI"}, {"title": "HEAVY TRUCK TIRE TREAD WITH RIB ELEMENT TO MANAGE IRREGULAR WEAR", "doc_number": "20250065673", "filename": "US20250065673A1-20250227.XML", "abstract": "A heavy truck tire tread is provided that has an outer surface and a circumferential groove ( 24 ) that extends in the circumferential direction completely around the tread. A rib ( 26 ) is present that has a rib element ( 28 ) that defines a portion of the circumferential groove ( 24 ) and has an upper surface ( 30 ) in the radial direction. The upper surface has a leading edge ( 32 ) and a tailing edge ( 34 ) in the circumferential direction. The leading edge ( 32 ) and the tailing edge ( 34 ) are at different distances to the central axis in the radial direction. A first micro sipe ( 40 ) extends into the rib and opens into the circumferential groove ( 24 ), and a second micro sipe ( 42 ) extends into the rib ( 26 ) and opens into the circumferential groove ( 24 ). The rib element ( 28 ) extends from the first micro sipe ( 40 )) to the second micro sipe ( 42 ) in the circumferential direction.", "detailed_description": ["Reference will now be made in detail to embodiments of the invention, one or more examples of which are illustrated in the drawings. Each example is provided by way of explanation of the invention, and not meant as a limitation of the invention. For example, features illustrated or described as part of one embodiment can be used with another embodiment to yield still a third embodiment. It is intended that the present invention include these and other modifications and variations.", "", "The present invention provides for a heavy truck tire tread12for a heavy truck tire10that has a rib26with a rib element28that is adjacent and defines a portion of a circumferential groove24. A plurality of micro sipes40,42extend from the circumferential groove24in the lateral direction18and are angled relative to the circumferential direction14. The rib element28has an upper surface30with a leading edge32and tailing edge34relative to the circumferential direction14. The edges32and34are located at different distances36,38to the central axis16in the radial direction20. This architecture cause a change in the amount of coupling force that is provide by the micro sipe40,42and rib element28arrangement which can improve the resistance of the tread12to irregular wear", "", "FIG.1shows a tire10that is a heavy duty truck tire10. In this regard, the tire10is not designed for nor used with a car, motorcycle, or light truck (payload capacity less than 4,000 pounds), but is instead designed for and used with heavy duty trucks such as18wheelers, garbage trucks, or box trucks. The tire10may be a steer tire, a drive tire, a trailer tire, or an all position tire. The tire10includes a casing54onto which a tread12is disposed thereon. The tread12can be manufactured with the casing54and formed as a new tire10, or the tread12can be a retread band that is attached to the casing54at some point after the casing54has already been used to form a retreaded tire10. This is the case with all of the designs shown and described herein. They may all be tread designs of a brand new tire10, or may be tread designs of a tread12for use in a retread tire10. The central axis16of the tire10extends through the center of the casing54, and the lateral direction18of the tire10is parallel to the central axis16. The radial direction20, referred to also as the thickness direction20, of the tire10is perpendicular to the central axis16and the tread12is located farther from the central axis16in the thickness direction20than the casing54. The tread12extends all the way around the casing54in the circumferential direction14, also referred to as the longitudinal direction14, of the tire10and circles the central axis 360 degrees. The tread12includes a series of grooves and ribs that form a tread pattern.", "", "The tread12can be part of a tire10or a retread band that is produced and subsequently attached to a casing54to form a retread tire10. The same tread pattern can repeat throughout the entire longitudinal length of the tread12in the circumferential direction14. With reference toFIG.2, a more detailed view of a prior tread10is shown that includes a number of circumferential ribs and grooves. One of the circumferential ribs26is adjacent one of the circumferential grooves24and these features extend completely around the circumferential length of the tire10. At the lateral ends of the tread12, sacrificial ribs are present and are adjacent the shoulder ribs separated therefrom via decoupling grooves.", "", "The grooves of the tread10, such as the circumferential groove24, have widths that are 2 millimeters or larger. Sipes are features of the tread12that are smaller cuts within the tread12that have widths smaller than that of the grooves. The ribs include a series of micro sipes40,42that are spaced from one another in the circumferential direction14and the plurality extends completely around the tread12. These micro sipes40,42have a width that is less than 2 millimeters. Micro sipes40,42are sipes and can be thought of as a subset of sipes in that they extend a relatively short length across the tread12in the lateral direction18. In most instances, the micro sipes40,42are blind in that they terminate within the rib26and do not extend all the way between laterally adjacent circumferential grooves. Although four ribs are present along with the two sacrificial ribs, any number of ribs can be present in accordance with other embodiments and in these other embodiments the two sacrificial ribs may or may not be present.", "", "The rolling direction44is the direction in the circumferential direction14the tread12is designed to rotate. The various features of the tread12can be arranged so that the tread12experiences improved irregular wear performance characteristics when the tread12rotates in the rolling direction44, as opposed to opposite the rolling direction44. This improvement will generally lead to an increased removal mileage, since tires10with irregular wear may be removed from service well before reaching the normal removal tread depth or wear bars. Some of these directional features could be the angularity of grooves and sipes within the tread12. Although described with respect to directional treads12, the tread12need not be directional in accordance with various exemplary embodiments.", "", "FIGS.3-6show one exemplary embodiment of the tread12. The tread12includes a rib26and a circumferential groove24that is adjacent to and partially defined by the rib26. A series of micro sipes40,42are positioned around the entire circumferential length of the rib26and are open into the circumferential groove24and terminate within the rib26so as to be blind. The micro sipes40,42are open at the outer surface22of the tread12. The first micro sipe40and the second micro sipe42define a rib element28of the rib26as the rib element28is located in the circumferential direction14between the micro sipes40,42such that the rib element28extends from the first micro sipe40to the second micro sipe42. The rib element28is thus a portion of the rib26that is at the end of the rib26between the micro sipes40,42and is in this instance adjacent the circumferential groove24and defining a portion thereof.", "", "The part of the outer surface22that is the outer surface of the rib element28is designated as the upper surface30. This upper surface30is more generally oriented in the radial direction20, while the inner side of the rib element28is more generally oriented in the lateral direction18and defines a portion of the circumferential groove24. The upper surface30is not oriented so as to have a surface normal that extends in the radial direction20, but instead the upper surface30is angled or otherwise varied in depth to the central axis16such that some of the upper surface30is closer to the central axis16than other portions of the central axis16. As shown inFIG.3, another circumferential groove56adjacent circumferential groove24is illustrated and features rib elements that do not have upper surfaces30that are configured in this manner. Instead, the upper surfaces of the rib elements adjacent circumferential groove56all have surface normals that extend completely in the radial direction20. The upper surface30associated with the circumferential groove24can be present on all of the rib elements in all of the grooves of the tread12, or only on certain ones of the circumferential grooves of the tread12. Further, the upper surfaces30associated with the circumferential groove24can be present on the shoulder rib adjacent the decoupling groove if present, and can be located in the sacrificial rib as well.", "", "FIG.4is a close-up view of the circumferential groove24ofFIG.3and shows additional detail from within the circumferential groove24. The micro sipes40,42can extend to a position in the radial direction20near, but not all the way to, the bottom of the circumferential groove24. The very bottom of the circumferential groove24may be closer to the central axis16than the bottoms of the micro sipes40,42are to the central axis16in the radial direction20. All of the upper surfaces30are configured and oriented the same way on all of the rib elements28extending about the tread12. The outer surface22of the rib26adjacent the upper surfaces30is smooth and located at the same distance from the central axis16in the radial direction20. The upper surfaces30on both sides of the circumferential groove24in the lateral direction18can be configured in the same manner and orientation. The upper surface30has a leading edge32that is the end of the upper surface30that is forward in the rolling direction44. The tailing edge34is the end of the upper surface30rearward in the rolling direction44. In this regard, the leading edge32is forward of the tailing edge34in the rolling direction44. In instances where the tread12is a non-directional tread12, the leading edge32can be designated as either one of the edges, and the tailing edge34will be designated as the opposite edge of the upper surface30in the circumferential direction14.", "", "With reference in particular toFIG.5, a side view from within the circumferential groove24is shown of a portion of the tread fromFIGS.3-6. The upper surface30is a flat surface along its entire length from the leading edge32to the tailing edge34. Since the upper surface30is also inclined relative to the circumferential direction14, the top of the rib elements28can be described as wedge shaped. The leading edge32is located a distance36to the central axis16as measured in the radial direction20. The tailing edge34is located a distance38from the central axis16in the radial direction20. It is to be understood that the radial direction20is perpendicular to the central axis16and thus is dependent upon the particular location being evaluated in the circumferential direction14. In this regard, the distances36,38as drawn on the figure are not parallel to one another but are perpendicular to the central axis. The placement of the central axis16in the figures is not to scale.", "", "The distance36is shorter than the distance34such that the leading edge32is closer to the central axis16than the tailing edge34is to the central axis16. This configuration causes the “toe” of the rib element28to be lower than the “heel” of the rib element28in relation to the rolling direction44. A vertical force applied at the outer surface22toward the central axis16in the radial direction20will generate an increase in the coupling force provided due to this difference in distances36,38. Increasing the coupling force of the rib element28and micro sipe40,42arrangement will further reduce irregular wear of the tread12. It can be seen that since the difference in distances36,38causes a coupling force increase, it need not be the case that the micro sipes40,42be angled relative to the radial direction20. However, the distance36,38difference plus the angled micro sipes40,42can compliment one another to produce a greater coupling force than either of them could alone.", "", "The difference between distance36and38can be up to and including 2 millimeters when the spacing of the micro sipes40,42in the circumferential direction14is 5 millimeters. A preferred distance difference between distances36and38is 1 millimeter. The difference in distances between distance36and38may be from and including 0.5 millimeters-1.5 millimeters, from and including 1.5 millimeters-2.5 millimeters, from and including 2.5 millimeters-3.5 millimeters, from and including 3.5 millimeters-4.5 millimeters, from and including 4.5 millimeters-5.5 millimeters, and from and including 5.5 millimeters-6.5 millimeters in accordance with different embodiments. The upper surface30when flat thus causes a continuous inclination from the leading edge32to the tailing edge34. The upper surface30need not be flat in other embodiments and can have varying features such as steps, rounds, fillets, various inclined surfaces, or other features.", "", "The first micro sipe40is inclined relative to the radial direction20such that a portion46of the first micro sipe40is located forward of another portion48of the first micro sipe40in the rolling direction44. In this regard, the portion46is located closer to the axis16in the radial direction20than the portion48is located to the axis16in the radial direction20. The portion46is thus closer to the bottom of the circumferential groove24and is forward in the rolling direction44from the portion48which is closer to the outer surface22. The first micro sipe40is oriented at an angle to the radial direction20and this angle may be 8.5 degrees in some embodiments. Manufacturing capabilities set a limit on the amount of angle the first micro sipe40can be oriented relative to the radial direction20. Generally, the upper limit of the angle the first micro sipe40can be oriented relative to the radial direction20is 15 degrees. With greater spacing between the first and second micro sipes40,42, the angle could be increased to 20 degrees. The first micro sipe40may thus be oriented at an angle between and including 0-20 degrees to radial direction20. The second micro sipe42can be oriented relative to the radial direction20in a similar manner as just discussed relative to the first micro sipe40. The orientation of the micro sipes40,42, and all of the micro sipes extending completely around the central axis16in the circumferential direction14at the circumferential groove24may all be at the same orientation angle relative to the radial direction20. However, other embodiments are possible in which the micro sipes extending from the circumferential groove24have different angular orientations.", "", "FIG.6shows a top view of a portion of the tread12ofFIGS.3-6. The rib element28has a first end50and a second end52that are separated from one another in the lateral direction18. The second end52engages the circumferential groove24and defines a portion of the circumferential groove24. The top of the second end52may be located at an edge of the upper surface30that extends from the leading edge32to the tailing edge34. The bottom of the second end52can be the portion of the rib element28that extends as far into the tread12in the radial direction20as the micro sipes40,42that bound the second end52. The oppositely disposed first end50is located on the outer surface22and is likewise bound by the micro sipes40,42only this time the boundary is the extent of the first and second micro sipes40,42into the rib26in the lateral direction18. Drawing a line between the farthest extent of the first micro sipe40into the rib26to the farthest extent of the second micro sipe42into the rib26yields the boundary of the first end50. The boundary50is complete in the circumferential direction14because the first and second micro sipes40,42extend the same distance as one another into the rib26in the lateral direction18. However, if the micro sipes40,42extend a different amount into the rib26in the lateral direction18the first end50would be angled relative to the circumferential direction14. The rib element28may thus be described as being the portion of the rib26that is bound in the lateral direction18by the first and second ends50,52, and bound in the circumferential direction14by the first and second micro sipes40,42.", "", "The micro sipes40,42are shown as extending completely in the lateral direction18at the outer surface22. However, they could in fact be angled relative to the lateral direction18so that the micro sipes40,42have a component of extension both in the lateral direction18and in the circumferential direction14upon their extension in the outer surface22. The micro sipes40,42may extend in the lateral direction18a distance that is from 2 millimeters to 10 millimeters. If the length of extension were smaller than this range the micro sipes40,42may not be effective in providing irregular wear protection. The preferred length of extension in the lateral direction18is from 4 to 6 millimeters.", "", "An alternate embodiment of the tread12is shown with reference toFIGS.7and8. Here, the first and second micro sipes40,42are again angled relative to the circumferential direction14to introduce a coupling force to the tread12when a vertical, radial load is applied to the tread12to function to reduce irregular wear on the tread12. However, the arrangement of the upper surface30will work against this coupling force to reduce it so long as the tire10is operated in the rolling direction44. This is because the leading edge32is located a longer distance36from the central axis16than the tailing edge34distance38to the central axis16in the radial direction20. This arrangement is opposite to that of the one previously discussed in theFIGS.3-6embodiment and is not additive to the coupling force introduced by the angled micro sipes40,42, but is instead subtractive to the coupling force of the angled micro sipes40,42. The difference between the distances36,38can be the same as discussed above with respect to theFIGS.3-6embodiment. In some embodiments, the distance32is 2 millimeters greater than the distance38in the radial direction20. In other embodiments, the distance32is 1 millimeter greater than the distance38in the radial direction20. It is therefore the case that the distances36,38can be larger or smaller than one another in different embodiments.", "", "The shape of the upper surface30can be varied.FIG.9shows an alternate embodiment from the circumferential groove24looking in the lateral direction18in which four rib elements are shown and given the designations58,60,62and64. Rib elements58and60are configured in the same manner. Rib element60is bound by angled micro sipes40,42and has an upper surface30with a leading edge32a distance36to the central axis16in the radial direction20, and a tailing edge34a distance38to the central axis16in the radial direction20. Distance36is less than distance38to cause the rib element60to increase the coupling force along with the inclined micro sipes40,42. The upper surface30is not all the way from the leading edge32to the tailing edge34. Instead, the upper surface30extends from the leading edge32as a rounded surface, in this case a concave shape towards the tailing edge34in the circumferential direction14. Upon reaching a distance in the radial direction20to the central axis16that is at the same distance as the outer surface22of the rib26is to the central axis16in the radial direction20, the upper surface30flattens and extends to the tailing edge34at the same distance to the central axis16as the outer surface22is to the central axis16. In this regard, the distance38is the longest distance to the central axis16and a certain amount of the upper surface30also shares this same distance38. The leading edge32is at the distance36and some additional portions of the upper surface30may also share this same distance in certain embodiments.", "", "The orientation of the upper surface30is additive with the first and second micro sipe40,42coupling force effect. The rib element58is configured the same way as the rib element52. The rib element62does not have an upper surface between its micro sipes that has different distances such that its leading edge and tailing edge are located the same distance to the central axis16in the radial direction20. The upper surface of the rib element62is the same in the radial direction20as the outer surface22of the rib26. There is no additional coupling force generated by the upper surface of the rib element62.", "", "The rib element64is configured differently than rib elements58,60,62in that its upper surface is arranged in a stepped arrangement. The upper surface has an inward most point in the radial direction20at the leading edge and then steps outwards upon extension back towards the tailing edge that is the most outward point in the radial direction20. Three steps are shown in the disclosed embodiment and more or less can be used in other embodiments. Each step can be at the same location in the radial direction20, and convex and concave features can be used to transition from one step to the next.", "", "The various rib elements28used in the tread12can all be the same as one another, or may be different from one another with respect to their upper surfaces30, size, or angle as defined by the micro sipes between which they extend. Although shown as all being angled at the same orientation, the micro sipes can be variously angled in accordance with different embodiments, and all of the micro sipes extending into the same circumferential groove24may or may not all be angled at the same orientation.", "", "FIG.10shows a rib element28with the distance36again shorter than distance38to achieve an additive coupling force with the orientation of the micro sipes40,42. The transition from the upper surface30to the outer surface22of the rib26can be smoothed out from those shown in previous embodiments so that a stress concentration or other abrupt transition can be avoided. The first end50is rounded to achieve a smooth transition between the upper surface30and the outer surface22of the rib26. The round that is present in a combination of both convex and concave, but in other embodiments only convex or only concave rounds could be used. When the first end50is provided with a transition, the majority of the upper surface30is flat. Any of the previously described embodiments can be modified from that shown to include the transition at the first end50ofFIG.10or any other transition to smooth out this area of the rib26and rib element28. This transition at the first end50could be a round that is convex, concave, or combinations there of in any amount.", "", "The rib elements28with the upper surface30described herein can be present on any rib of the tread12such as the center rib, intermediate rib, shoulder rib, or sacrificial rib.", "", "The spacing of the micro sipes40,42in the circumferential direction14, sometimes referred to as density since it determines the number per length, will also impact the irregular wear performance reduction. If the micro sipe40,42spacing is small, the micro sipes40,42will not be robust, and if the spacing is too large then the micro sipes40,42will not be effective in fighting irregular wear. Acceptable micro sipe40,42spacing is from 3 millimeters to 10 millimeters. Preferred micro sipe spacing is from 4 millimeters to 6 millimeters. Other spacing distances can be used in other embodiments.", "", "The width of the micro sipes40,42is their wall to wall distance. The widths of the micro sipes40,42can be the same along their entire lengths or may vary. If varied, the widths of the micro sipes40,42can be measured as the width of the majority of the length of the micro sipes40,42. Acceptable micro sipe40,42widths may be from 0.1 to 2.0 millimeters. Preferred widths of the micro sipes40,42is from 0.4 millimeters to 0.6 millimeters. Thinner micro sipes40,42are not practical, and micro sipes40,42greater than the acceptable range may reduce wear performance of the tread12. Although shown as being linear in shape, the micro sipes40,42could be wavy, angled, curved, non-linear, have sections of differing widths, or may be irregular in shape. A teardrop could be located at the inner portion of the micro sipes40,42in the radial direction20.", "", "While the present subject matter has been described in detail with respect to specific embodiments and methods thereof, it will be appreciated that those skilled in the art, upon attaining an understanding of the foregoing may readily produce alterations to, variations of, and equivalents to such embodiments. Accordingly, the scope of the present disclosure is by way of example rather than by way of limitation, and the subject disclosure does not preclude inclusion of such modifications, variations and/or additions to the present subject matter as would be apparent."], "claims": ["a circumferential direction that extends about a central axis, a lateral direction that extends parallel to the central axis, and a radial direction that is perpendicular to the central axis, wherein the tread has an outer surface; a circumferential groove that extends in the circumferential direction completely around the tread; a rib that has a rib element that defines a portion of the circumferential groove, wherein the rib element has an upper surface in the radial direction, wherein the upper surface has a leading edge and a tailing edge in the circumferential direction, wherein the leading edge and the tailing edge are at different distances to the central axis in the radial direction, wherein the outer surface of the tread at a portion of the rib that is adjacent the upper surface of the rib element in the lateral direction is located at a same distance from the central axis in the radial direction about the circumferential direction; a first micro sipe that extends into the rib and that opens into the circumferential groove; a second micro sipe that extends into the rib and that opens into the circumferential groove; wherein the rib element extends from the first micro sipe to the second micro sipe in the circumferential direction.", "2 . The heavy truck tire tread as set forth in claim 1 , wherein the tread is a directional tread and has a rolling direction that is in the circumferential direction, and wherein the leading edge is forward of the tailing edge in the rolling direction, wherein the first micro sipe is inclined relative to the radial direction such that a portion of the first micro sipe closer to the central axis in the radial direction is forward in the rolling direction of a portion of the first micro sipe farther from the central axis in the radial direction, and wherein the second micro sipe is inclined relative to the radial direction such that a portion of the second micro sipe closer to the central axis in the radial direction is forward in the rolling direction of a portion of the second micro sipe farther from the central axis in the radial direction.", "3 . The heavy truck tire tread as set forth in claim 1 , wherein the leading edge is closer to the central axis in the radial direction than the tailing edge is to the central axis in the radial direction.", "4 . The heavy truck tire tread as set forth in claim 1 , wherein the tailing edge is closer to the central axis in the radial direction than the leading edge is to the central axis in the radial direction.", "5 . The heavy truck tire tread as set forth in claim 1 , wherein the entire upper surface of the rib element is flat.", "6 . The heavy truck tire tread as set forth in claim 1 , wherein at least a portion of the upper surface of the rib element is flat.", "7 . The heavy truck tire tread as set forth in claim 1 , wherein the first micro sipe and the second micro sipe extend the same distance into the rib in the lateral direction from the circumferential groove, wherein the rib element has a first end that is located at the same position in the lateral direction on the tread as is the farthest extent of the first and second micro sipes into the rib in the lateral direction, wherein the rib element has a second end that engages the circumferential groove.", "8 . The heavy truck tire tread as set forth in claim 1 , wherein the distance between the leading edge to the central axis in the radial direction is from up to and including 2 millimeters different than the distance between the tailing edge to the central axis in the radial direction.", "9 . The heavy truck tire tread as set forth in claim 8 , wherein the distance between the leading edge to the central axis in the radial direction is 1 millimeter different than the distance between the tailing edge to the central axis in the radial direction.", "10 . The heavy truck tire tread as set forth in claim 1 , wherein the first and second micro sipes are blind and terminate within the rib at a distance from and including 4 millimeters to 6 millimeters from the circumferential sipe in the lateral direction at the outer surface of the tread.", "11 . The heavy truck tire tread as set forth in claim 1 , wherein the first micro sipe and the second micro sipe extend parallel to the central axis in the lateral direction and do not have a component of extension in the circumferential direction.", "12 . The heavy truck tire tread as set forth in claim 1 , wherein the first micro sipe and the second micro sipe each have a width from and including 0.4 millimeters to 0.6 millimeters.", "13 . The heavy truck tire tread as set forth in claim 1 , wherein the outer surface of the tread is rounded at the first end of the rib element.", "14 . A heavy truck tire that has the heavy truck tire tread of claim 1 ."], "bibtex": "@patent{20250065673,\n    title = {HEAVY TRUCK TIRE TREAD WITH RIB ELEMENT TO MANAGE IRREGULAR WEAR},\n    number = {20250065673},\n    year = {2025},\n    note = {File: US20250065673A1-20250227.XML}\n    }", "classification": "B60C1112FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20250065674", "filename": "US20250065674A1-20250227.XML", "abstract": "A pneumatic tire can include a carcass, a belt layer, and reinforcing rubber layers. Turned-up portions of a carcass ply each include a first portion located between a body portion and the belt layer, a second portion adjacent to each reinforcing rubber layer in a tire axial direction, on an outer side in a tire radial direction with respect to a rim flange of a standardized rim, and a third portion located between the first portion and the second portion. A length of the third portion is 0.8 to 1.4 times a sum (La+Lb) of a length La of the first portion and a length Lb of the second portion.", "detailed_description": ["One or more embodiments of the present disclosure have been made in view of the above circumstances, and an object of one or more embodiments of the present disclosure, among one or more objects, can be to provide a pneumatic tire capable of achieving weight reduction while maintaining durability.", "", "Thus, the pneumatic tire according to one or more embodiments of the present disclosure can have a configuration that can achieve weight reduction while maintaining durability.", "", "Hereinafter, an embodiment of the present disclosure will be described with reference to the drawings. The drawings contain exaggerated expressions and expressions that differ from the dimensional ratio of the actual structure in order to help the understanding of the present invention. In addition, when there are a plurality of embodiments, the same or common elements are denoted by the same reference characters throughout the description, and the redundant description thereof is omitted.", "", "FIG.1is a tire meridional cross-sectional view, including a tire rotation axis, of the right half of a pneumatic tire (hereinafter, may be simply referred to as “tire”)1according to one or more embodiments of the present disclosure.FIG.1shows the tire1for a passenger car. One or more embodiments of the present disclosure may be suitable for a tire to be mounted to a commercial vehicle (e.g., van) designed for high-load applications. However, embodiments of the present disclosure may be applied to a tire1for a small-sized truck or a heavy-load vehicle, for example.", "", "In the present description, unless otherwise specified, dimensions and the like of components of the tire1are values measured in a standardized state. The “standardized state” can be regarded as a state where the tire1is fitted on a standardized rim (hereinafter, may be simply referred to as “rim”) R and inflated to a standardized internal pressure and no load is applied to the tire1.", "", "The “standardized rim R” can be regarded as a rim that is defined, in a standard system including a standard on which the tire is based, by the standard for each tire, and can be, for example, the “standard rim” in the JATMA standard, the “Design Rim” in the TRA standard, or the “Measuring Rim” in the ETRTO standard.", "", "The “standardized internal pressure” can be regarded as an air pressure that is defined, in a standard system including a standard on which the tire is based, by the standard for each tire, and can be the “maximum air pressure” in the JATMA standard, the maximum value indicated in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, or the “INFLATION PRESSURE” in the ETRTO standard, as examples.", "", "The tire1of the present embodiment can include a tread portion2, a pair of sidewall portions3, and a pair of bead portions4respectively having bead cores5.FIG.1shows only one of the sidewall portions3and one of the bead portions4. In the present embodiment, the tire1can also include a carcass6extending between the pair of bead portions4, a belt layer7disposed outward of the carcass6in a tire radial direction, and reinforcing rubber layers10respectively provided at the pair of bead portions4.", "", "The carcass6can be a carcass ply6A which can include a body portion6aextending between the bead cores5of the pair of bead portions4, and a pair of turned-up portions6brespectively turned up around the bead cores5from an inner side toward an outer side in a tire axial direction, extending outward in the tire radial direction, and having outer ends6e. Thus, the carcass6of the present embodiment can be formed of one carcass ply6A, which can thus achieve weight reduction.", "", "In the tire meridional cross-section in a standardized state, the pair of turned-up portions6bcan include first portions11, second portions12, and third portions13. The first portions11can be located between the body portion6aand the belt layer7. The second portions12can be adjacent to the reinforcing rubber layers10in the tire axial direction, on an outer side in the tire radial direction with respect to rim flanges Rf of the rim R. The third portions13can be located between the first portions11and the second portions12. The first portions11and the second portions12can be respectively supported by the belt layer7and the reinforcing rubber layers10, and tension that acts on each turned-up portion6bcan be alleviated, thereby maintaining durability. In addition, the reinforcing rubber layers10can serve to keep the carcass ply6A away from the rim flanges Rf, whereby damage to the carcass ply6A can be inhibited, thereby maintaining durability at a higher level.", "", "Each first portion11can include a portion of the turned-up portion6bthat comes into contact with the belt layer7when the belt layer7is bent on the assumption that, in a case where a rubber material (e.g., sidewall rubber3G) is disposed between the belt layer7and the turned-up portion6b, no sidewall rubber3G is provided. In addition, the first portion11can be specified by a belt ply disposed on an innermost side in the tire radial direction (inner belt ply7A in the present embodiment), in a case where the belt layer7is formed of a plurality of belt plies. In addition, each second portion12can be formed outward of an outer end e1in the tire radial direction of each rim flange Rf, in the tire radial direction. For convenience, inFIG.1, the first portion11and the second portion12are indicated by hatching.", "", "FIG.2is a development of the carcass ply6A according to one or more embodiments of the present disclosure. As shown inFIG.2, a length Lc of the third portion13can be not less than 0.8 times, and more preferably not less than 0.9 times a sum (La+Lb) of a length La of the first portion11and a length Lb of the second portion12, and can be not greater than 1.4 times, and more preferably not greater than 1.3 times the sum (La+Lb) of the length La of the first portion11and the length Lb of the second portion12. Since the length Lc of the third portion13can be not less than 0.8 times the sum (La+Lb), the weight reduction of tire1can be achieved. In addition, since the length Lc of the third portion13can be not greater than 1.4 times the sum (La+Lb), the effect that tension is alleviated by the first portion11and the second portion12can be maintained at a high level. Therefore, the tire1of one or more embodiments of the present disclosure can achieve weight reduction while maintaining durability. Such an effect can effectively contribute to, in particular, the pneumatic tire1to be mounted to a commercial vehicle designed for high-load applications.", "", "In general, during running with the tire1, a relatively large tension can act on the carcass ply6A at the bead portions4. Thus, the length Lb of the second portion12can be greater than the length La of the first portion11. Although not particularly limited, the length Lb of the second portion12can be not less than 1.05 times, and more preferably not less than 1.08 times the length La of the first portion11, and can be not greater than 1.18 times, and more preferably not greater than 1.15 times the length La of the first portion11.", "", "As shown inFIG.1, in the present embodiment, the belt layer7can be formed of two belt plies7A,7B which can be respectively disposed on an inner side and an outer side in the tire radial direction. The inner belt ply7A, for example, can terminate outward of the outer belt ply7B in the tire axial direction. In the present embodiment, each of the belt plies7A,7B can have highly elastic belt cords, such as steel cords, inclined at an angle of 15 to 40° relative to a tire equator C, and a topping rubber for covering the belt cords.", "", "As shown inFIG.2, the carcass ply6A can include a plurality of carcass cords6cand a topping rubber Gt that can cover the carcass cords6c. One or more suitable materials may be used as appropriate for the carcass cords6cand the topping rubber Gt.", "", "A length Wa (shown inFIG.1) in the tire axial direction between the outer ends6eof the pair of turned-up portions6bcan be preferably not less than 0.10 times and more preferably not less than 0.15 times a length L1of the body portion6a, and can be preferably not greater than 0.30 times and more preferably not greater than 0.25 times the length L1of the body portion6a. Since the length Wa between the outer ends6ecan be not less than 0.10 times the length L1of the body portion6a, the weight reduction of the tire1can be maintained at a high level. Since the length Wa between the outer ends6ecan be not greater than 0.30 times the length L1of the body portion6a, the effect of supporting the turned-up portions6bcan be highly exerted. The length L1of the body portion6acan be regarded as a length between positions6i(shown inFIG.1) located on an innermost side in the tire radial direction of the carcass ply6A. When a plurality of the positions6ilocated on the innermost side in the tire radial direction are formed, the length L1can be regarded as the length between positions located on the innermost side in the tire radial direction and further on an innermost side in the tire axial direction.", "", "As shown inFIG.1, in the tire meridional cross-section, each bead core5of the present embodiment can be formed in a rectangular shape. The bead core5can include an outer surface5ain the tire radial direction, an inner surface5bin the tire radial direction, an inner-side surface5cin the tire axial direction, and an outer-side surface5din the tire axial direction. The inner-side surface5cand the outer-side surface5dcan be connected to the outer surface5aand the inner surface5b. The bead core5can be regarded as structure that is formed by winding a non-stretchable bead wire, for example.", "", "In the present embodiment, an outer end10ein the tire radial direction of each reinforcing rubber layer10can be preferably located outward of the outer end e1of each rim flange Rf in the tire radial direction. With such reinforcing rubber layers10, deflection of the bead portion4can be inhibited from being generated during running, and damage to the carcass ply6A can be further suppressed. In addition, deflection of the bead portion4can be inhibited, whereby separation of tire components can be suppressed. Although not particularly limited, a distance H1in the tire radial direction between the outer end10eof the reinforcing rubber layer10and the outer end e1of the rim flange Rf can be preferably not less than 15% and more preferably not less than 20% of a tire cross-sectional height H, and can be preferably not greater than 35% and more preferably not greater than 30% of the tire cross-sectional height H. In the present description, the “tire cross-sectional height H” can be regarded as a distance in the tire radial direction from a bead base line BL to an outermost-side position in the tire radial direction. In addition, the “bead base line BL” can be regarded as a line passing, in the tire axial direction, through a rim diameter (see JATMA) position defined by the standard on which the tire1is based.", "", "FIG.3is an enlarged view of the bead portion4inFIG.1. As shown inFIG.1andFIG.3, an inner end10iin the tire radial direction of each reinforcing rubber layer10can be located outward of the outer surface5ain the tire radial direction of each bead core5, in the tire radial direction. Such reinforcing rubber layers10can suppress increase in mass of the tire1. In addition, the inner end10iof the reinforcing rubber layer10can be, for example, located inward of the outer end e1of each rim flange Rf in the tire radial direction. Thus, the stiffness of the bead portions4can be maintained at a high level.", "", "The reinforcing rubber layer10can be, for example, formed of a sheet-shaped rubber member. Such reinforcing rubber layers10can enhance the stiffness of the bead portions4uniformly in the tire radial direction, and can inhibit increase in the mass of the tire1. A thickness (maximum thickness) t1of each reinforcing rubber layer10can be 0.5 to 3.0 mm, as an example. In addition, for example, a complex elastic modulus E*c of the reinforcing rubber layer10can be preferably not less than 15 MPa and more preferably not less than 20 MPa, and can be preferably not greater than 100 MPa and more preferably not greater than 80 MPa. Thus, the stiffness of the bead portions4can be maintained at a high level. In the present description, the complex elastic modulus E* can be regarded as a value measured by using a viscoelasticity spectrometer such as “EPLEXOR (registered trademark)” manufactured by GABO under the following conditions in accordance with JIS K 6394.Initial strain: 10%Amplitude: ±2%Frequency: 10 HzDeformation mode: tensionTemperature: 70° C.", "", "As shown inFIG.1, the tire1of the present embodiment can further include bead apex rubbers8, reinforcing layers15, the sidewall rubbers3G, and clinch rubbers4G. For example, the bead apex rubbers8can be respectively provided at the pair of bead portions4, and can extend outward in the tire radial direction from the outer surfaces5ain the tire radial direction of the bead cores5. For example, the reinforcing layers15can be respectively provided at the pair of bead portions4, and can each be disposed between the bead core5and the carcass ply6A. In the present embodiment, the sidewall rubbers3G can be disposed outward of the turned-up portions6bin the tire axial direction, and can be adjacent to the third portions13. For example, each clinch rubber4G can be located outward of the reinforcing rubber layer10in the tire axial direction, and can form an outer surface, of the tire1, in contact with the rim R.", "", "As shown inFIG.3, each reinforcing layer15of the present embodiment can include an inner-side portion15A and an outer-side portion15B. The inner-side portion15A can be adjacent to the inner-side surface5cof each bead core5, for example. The outer-side portion15B can be connected to the inner-side portion15A, and can be turned up around the bead core5from the inner side toward the outer side in a the tire axial direction and can extend outward in the tire radial direction, for example.", "", "An outer end15eof the inner-side portion15A and an outer end15iof the outer-side portion15B can be located outward of the outer surface5aof the bead core5in the tire radial direction. In addition, the outer end15eof the inner-side portion15A and the outer end15iof the outer-side portion15B can be located outward of the inner end10iin the tire radial direction of the reinforcing rubber layer10, in the tire radial direction. Such reinforcing layers15can reduce a possibility that each bead core5and the carcass ply6A come into contact with each other. Thus, there can be less risk of breaking of the carcass cords6cof the carcass ply6A, thereby improving durability. The outer end15eof the inner-side portion15A and the outer end15iof the outer-side portion15B can be located inward of the outer end e1of the rim flange Rf in the tire radial direction.", "", "The outer end15ein the tire radial direction of the inner-side portion15A and the outer end15iin the tire radial direction of the outer-side portion15B can be at the same position in the tire radial direction. Such reinforcing layers15can suppress movement of the bead cores5and/or rotation around the shown bead cores5, thereby further inhibiting contact between the carcass ply6A and each bead core5. In the present description, the “same position” can refer to not only a case where a separation distance Lt in the tire radial direction between the outer end15eand the outer end15iis 0 mm but also a case where the separation distance Lt is not greater than 3 mm.", "", "A distance Lp in the tire radial direction between the outer end15iof the outer-side portion15B and the outer surface5aof the bead core5can be preferably not less than 30% and more preferably not less than 35% of a height H2(shown inFIG.5) in the tire radial direction of each bead apex rubber8, and can be preferably not greater than 50% and more preferably not greater than 45% of the height H2in the tire radial direction of the bead apex rubber8. Since the distance Lp is not less than 30% of the height H2of the bead apex rubber8, contact between the carcass ply6A and each bead core5can be effectively suppressed. Since the distance Lp may be not greater than 50% of the height H2of the bead apex rubber8, the adhesion strength between each bead apex rubber8and the carcass ply6A can be maintained at a high level, thereby inhibiting damage due to separation. The height H2of the bead apex rubber8can be a length in the tire radial direction between an outer end8eof the bead apex rubber8and the outer surface5aof the bead core5.", "", "FIG.4is a sectional view taken along a line A-A inFIG.3. As shown inFIG.4, in the present embodiment, each reinforcing layer15can be a reinforcing ply15pincluding a plurality of organic fiber cords15cand a first rubber G1for covering the organic fiber cords15c. For the organic fiber cords15c, for example, polyester fibers, nylon fibers, rayon fibers, vinylon fibers, aramid fibers, or polyurethane fibers can be used.", "", "A product (Ca×E*1) of a cord density Ca of the carcass ply6A and a complex elastic modulus E*1 of the topping rubber Gt can be greater than a product (Cb×E*2) of a cord density Cb of the reinforcing ply15pand a complex elastic modulus E*2 of the first rubber G1. Thus, the reinforcing layer15can be accurately disposed along the inner-side surface5cor the inner surface5bof each bead core5, and damage to the carcass ply6A can be suppressed. The product (Ca×E*1) can be, for example, preferably 90000 to 110000 (the number of the cords·MPa). The product (Cb×E*2) can be, for example, preferably 15000 to 25000 (the number of the cords·MPa). In the present description, the “cord density” can be the number of cords included per ply width of 50 mm in each ply.", "", "FIG.5is an enlarged view of the bead portion4inFIG.1. As shown inFIG.5, each bead apex rubber8can be inclined outward in the tire axial direction, toward the outer side in the tire radial direction. For the bead apex rubber8of the present embodiment, a suitable bead apex rubber can be used as appropriate.", "", "The outer end8ein the tire radial direction of the bead apex rubber8can be, for example, located outward of the outer end e1of each rim flange Rf in the tire radial direction. Thus, deflection of the bead portions4during running can be further suppressed, and, for example, separation between the carcass ply6A and each reinforcing rubber layer10, separation between the body portion6aand each turned-up portion6b, or the like can be inhibited, thereby improving durability. In the present embodiment, the bead apex rubber8can extend inward and outward of the outer end e1of the rim flange Rf in the tire radial direction.", "", "The height H2in the tire radial direction of the bead apex rubber8can be not greater than 30 mm, for instance, not greater than 28 mm. Since the height H2of the bead apex rubber8can be not greater than 30 mm, the outer end8eof the bead apex rubber8and a bending point to be generated in the bead portion4during running can be inhibited from coming excessively close to each other, thereby maintaining durability at a high level. Although not particularly limited, the height H2of the bead apex rubber8can be not less than 5 mm, for instance, not less than 10 mm.", "", "In the present embodiment, the inner end3iin the tire radial direction of each sidewall rubber3G can be located inward of the outer end e1of the rim flange Rf in the tire radial direction. An outer end3e(shown inFIG.1) in the tire radial direction of the sidewall rubber3G can be, for example, located between the inner belt ply7A and each turned-up portion6b.", "", "A thickness (maximum thickness) t3(shown inFIG.1) of each sidewall rubber3G can be preferably not less than 2.0 mm and more preferably not less than 2.5 mm, and can be preferably not greater than 6.0 mm and more preferably not greater than 5.0 mm. Since the thickness t3of the sidewall rubber3G can be not less than 2.0 mm, the stiffness of the sidewall portion3can be enhanced. Since the thickness t3of the sidewall rubber3G can be not greater than 6.0 mm, weight reduction in the tire1can be maintained. The thickness t3of the sidewall rubber3G can be regarded as a length in the direction normal to an outer surface in the tire axial direction of the turned-up portion6bof the carcass ply6A.", "", "In the present embodiment, an outer end4ein the tire radial direction of each clinch rubber4G can be located outward of the outer end8eof the bead apex rubber8in the tire radial direction. The clinch rubber4G can be adjacent to the outer-side surface5dof each bead core5and can extend inward of the inner surface5bof the bead core5in the tire radial direction, for example.", "", "A complex elastic modulus E*5 of each bead apex rubber8can be preferably not less than 15 MPa and more preferably not less than 20 MPa, and can be preferably not greater than 100 MPa and more preferably not greater than 80 MPa. In addition, a complex elastic modulus E*6 of each sidewall rubber3G can be preferably not less than 3 MPa and more preferably not less than 5 MPa, and can be preferably not greater than 20 MPa and more preferably not greater than 15 MPa. A complex elastic modulus E*7 of each clinch rubber4G can be preferably not less than 5 MPa and more preferably not less than 8 MPa, and can be preferably not greater than 20 MPa and more preferably not greater than 15 MPa.", "", "Bead toes Bt can each be an innermost contact point with the rim R in the tire axial direction. Bead heels Bh can each be a point that is in contact with the rim R and lies on the bead base line BL. A length Wb in the tire axial direction between the bead toe Bt and the bead heel Bh at each of the pair of bead portions4can be not greater than 16 mm, as an example. With such length Wb, rim fittability when the tire1is fitted on the rim R can be improved. In order to ensure stability during running, the length Wb can be not less than 12 mm, for instance.", "", "Although aspects of one or more embodiments have been described in detail above, one or more embodiments of the present disclosure are not limited to the illustrated embodiment, and various modifications can be made to implement one or more embodiments of the present disclosure."], "claims": ["a tread portion; a pair of sidewall portions; a pair of bead portions respectively having bead cores; a carcass extending between the pair of bead portions; a belt layer outward of the carcass in a tire radial direction; and reinforcing rubber layers respectively at the pair of bead portions, wherein the carcass is a carcass ply which includes: a body portion extending between the bead cores of the pair of bead portions, and a pair of turned-up portions respectively turned up around the bead cores from an inner side toward an outer side in a tire axial direction, extending outward in the tire radial direction, and having outer ends, and in a tire meridional cross-section in a standardized state where the pneumatic tire is fitted on a standardized rim and inflated to a standardized internal pressure and no load is applied to the pneumatic tire, each of the pair of turned-up portions includes: a first portion between the body portion and the belt layer, a second portion adjacent to each reinforcing rubber layer in the tire axial direction, on an outer side in the tire radial direction with respect to a rim flange of the standardized rim, and a third portion between the first portion and the second portion, and a third length of the third portion is 0.8 to 1.4 times a sum of a first length of the first portion and a second length of the second portion.", "2 . The pneumatic tire according to claim 1 , wherein a length in the tire axial direction between the outer ends of the pair of turned-up portions is 0.1 to 0.3 times a length of the body portion.", "3 . The pneumatic tire according to claim 2 , wherein each of the bead portions includes a reinforcing layer between the bead core and the carcass ply.", "each of the bead portions includes a bead apex rubber extending outward in the tire radial direction from an outer surface in the tire radial direction of the bead core, and in the standardized state, an outer end in the tire radial direction of the bead apex rubber and an outer end in the tire radial direction of the reinforcing rubber layer are outward of an outer end in the tire radial direction of the rim flange of the standardized rim, in the tire radial direction.", "the reinforcing layer includes an inner-side portion adjacent to an inner-side surface in the tire axial direction of the bead core, and an outer-side portion which is connected to the inner-side portion and is turned up around the bead core from the inner side toward the outer side in the tire axial direction and extends outward in the tire radial direction, and an outer end in the tire radial direction of the inner-side portion and an outer end in the tire radial direction of the outer-side portion are at the same position in the tire radial direction.", "6 . The pneumatic tire according to claim 5 , wherein the outer end in the tire radial direction of the inner-side portion and the outer end in the tire radial direction of the outer-side portion are outward of an inner end in the tire radial direction of the reinforcing rubber layer, in the tire radial direction.", "7 . The pneumatic tire according to claim 3 , wherein the reinforcing layer is a reinforcing ply including a plurality of organic fiber cords and a first rubber the covers the organic fiber cords.", "8 . The pneumatic tire according to claim 1 , wherein an inner end in the tire radial direction of the reinforcing rubber layer is located outward of an outer surface in the tire radial direction of the bead core, in the tire radial direction.", "the carcass ply includes a plurality of carcass cords and a topping rubber that covers the carcass cords, and a product of a cord density of the carcass ply and a complex elastic modulus of the topping rubber is greater than a product of a cord density of the reinforcing ply and a complex elastic modulus of the first rubber.", "in each of the bead portions, a length in the tire axial direction between a bead toe and a bead heel is not greater than 16 mm.", "a sidewall rubber is adjacent to an outer side in the tire axial direction of the third portion, and a thickness of the sidewall rubber is 2.0 to 6.0 mm.", "the second length of the second portion is greater than the first length of the first portion.", "an inner end in the tire radial direction of each of the reinforcing layers is outward of an outer surface of the bead core in the tire radial direction, and the inner end of each of the reinforcing layers is inward of an outer end in the tire radial direction of the rim flange of the standardized rim, in the tire radial direction.", "a tread portion; a pair of sidewall portions; a pair of bead portions respectively having bead cores; a carcass extending between the pair of bead portions; a belt layer outward of the carcass in a tire radial direction; and reinforcing rubber layers respectively at the pair of bead portions, wherein the carcass is a carcass ply which includes: a body portion extending between the bead cores of the pair of bead portions, and a pair of turned-up portions respectively turned up around the bead cores from an inner side toward an outer side in a tire axial direction, extending outward in the tire radial direction, and having outer ends, and in a tire meridional cross-section in a standardized state where the pneumatic tire is fitted on a standardized rim and inflated to a standardized internal pressure and no load is applied to the pneumatic tire, each of the pair of turned-up portions includes: a first portion between the body portion and the belt layer, a second portion adjacent to each reinforcing rubber layer in the tire axial direction, on an outer side in the tire radial direction with respect to a rim flange of the standardized rim, and a third portion between the first portion and the second portion, and a third length of the third portion is 0.8 to 1.4 times a sum of a first length of the first portion and a second length of the second portion, each of the bead portions includes a bead apex rubber extending outward in the tire radial direction from an outer surface in the tire radial direction of the bead core, and in the standardized state, an outer end in the tire radial direction of the bead apex rubber and an outer end in the tire radial direction of the reinforcing rubber layer are outward of an outer end in the tire radial direction of the rim flange of the standardized rim, in the tire radial direction.", "an inner end in the tire radial direction of each of the reinforcing layers is outward of an outer surface of the bead core in the tire radial direction."], "bibtex": "@patent{20250065674,\n    title = {PNEUMATIC TIRE},\n    number = {20250065674},\n    year = {2025},\n    note = {File: US20250065674A1-20250227.XML}\n    }", "classification": "B60C1506FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20250065675", "filename": "US20250065675A1-20250227.XML", "abstract": "A pneumatic tire of the present invention includes a tire inner cavity 1 B and a porous sound damper 10 . The sound damper 10 is an annular body extending in a tire circumferential direction and is not adhered to a surface of the tire inner cavity 1 B. An average thickness T (mm) of the sound damper 10 and an inner cavity surface radius R (mm) satisfy the following formula (1). An average circumferential length L (mm) in a circumferential direction of the sound damper 10 in a state where the sound damper 10 is removed from the pneumatic tire, and an inner cavity surface circumferential length C (mm), satisfy the following formulas (2) and (3). 0.04 ≤ T / R ≤ 0 .18 ( 1 ) 1.02 - 1.1 × T / R ≤ L / C ≤ 0 . 9 ⁢ 5 + 1.4 × T / R ( 2 ) L / C ≤ 1 . 1 ( 3 )", "detailed_description": ["Hereinafter, one embodiment of the present invention will be described with reference to the drawings. The drawings are depicted so as to include the features of the present invention, but may contain exaggerated expressions and expressions that differ from the dimensional ratio of the actual structure in order to help the understanding of the present invention. In addition, the same or common elements are denoted by the same reference characters throughout each embodiment, and the redundant description thereof is omitted.", "", "FIG.1a tire meridian cross-sectional view of a pneumatic tire (hereinafter sometimes referred to simply as “tire”)1, showing one embodiment of the present invention, in a standardized state.FIG.1shows a cross-section of the tire1when the tire1extending in an annular shape is cut along a virtual plane passing through the tire rotation axis and orthogonal to the tire circumferential direction. As shown inFIG.1, in the present embodiment, a pneumatic tire1for a passenger car is shown. However, the present invention may be applied to, for example, a heavy duty pneumatic tire1.", "", "In the case of a pneumatic tire for which various standards are defined, the “standardized state” is a state where the tire is fitted on a standardized rim and inflated to a standardized internal pressure and no load is applied to the tire. In the case of a tire for which various standards are not defined, the standardized state means a standard use state, corresponding to the purpose of use of the tire, where the tire is not mounted on a vehicle and no load is applied to the tire. In the present specification, unless otherwise specified, dimensions and the like of components of the tire are values measured in the standardized state. In addition, dimensions of components (e.g., an inner member of the tire1) that cannot be measured in the standardized state are values measured in a state where the tire1is made to approximate the standardized state as much as possible.", "", "The “standardized rim” is a rim that is defined, in a standard system including a standard on which the tire is based, by the standard for each tire, and is, for example, the “standard rim” in the JATMA standard, the “Design Rim” in the TRA standard, or the “Measuring Rim” in the ETRTO standard.", "", "The “standardized internal pressure” is an air pressure that is defined, in a standard system including a standard on which the tire is based, by the standard for each tire, and is the “maximum air pressure” in the JATMA standard, the maximum value indicated in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, or the “INFLATION PRESSURE” in the ETRTO standard.", "", "The tire1of the present embodiment is mounted, for example, on a vehicle equipped with a puncture repair kit including a puncture sealing agent. The puncture repair kit performs puncture repair by injecting the puncture sealing agent through the air valve of a punctured tire. The puncture sealing agent injected into the tire can harden when passing through the puncture hole to seal the puncture hole. The tire1of the present invention allows puncture repair to be performed by injecting the puncture sealing agent into the tire through the air valve thereof as described above. Therefore, the tire1of the present embodiment has such stiffness in a tread portion2thereof that a sealed puncture hole does not reopen even when the tire1runs after puncture repair, and specifically, the tire1includes at least a carcass6and a belt layer7described below.", "", "The carcass6extends from a bead portion4on one side through a sidewall portion3on the one side, the tread portion2, and a sidewall portion3on the other side to a bead portion4on the other side. The carcass6has at least one carcass ply, and has two carcass plies6A in the present embodiment. Each carcass ply6A is formed, for example, by covering an array of carcass cords with a topping rubber. The carcass cords are placed, for example, at an angle of 75 to 90° with respect to the tire circumferential direction. For example, organic fibers such as polyester fibers, nylon fibers, rayon fibers, polyethylene naphthalate fibers, and aramid fibers are used for the carcass cords.", "", "The carcass ply6A includes, for example, a body portion6aand turned-up portions6b. The body portion6aextends from the tread portion2through each sidewall portion3to each bead core5. Each turned-up portion6bis connected to the body portion6a, is turned up from the inner side to the outer side in the tire axial direction around the bead core5, and extends outward in the tire radial direction.", "", "The belt layer7is placed outward of the carcass6in the tire radial direction in the tread portion2. The belt layer7includes at least one belt ply, and the belt layer7of the present embodiment is composed of two belt plies7A and7B. Each of the belt plies7A and7B is formed, for example, by covering an array of belt cords with a topping rubber.", "", "The tire1of the present invention includes a tire inner cavity1B, a pneumatic tire body1A defining the tire inner cavity1B, and a porous sound damper10placed in the tire inner cavity1B.FIG.2shows an enlarged perspective view of the pneumatic tire body1A and the sound damper10inFIG.1. As shown inFIG.1andFIG.2, the sound damper10can absorb air vibrations inside the tire1during running, and serves to reduce noise generated by the tire1.", "", "The sound damper10of the present invention is an annular body extending in the tire circumferential direction and is not adhered to a surface Is of the tire inner cavity1B. That is, since an adhesive for adhering the sound damper10is not used, the tire1of the present invention is lightweight and has excellent workability of mounting the sound damper10during tire manufacturing. Furthermore, when the tire1of the present invention is punctured and puncture repair is attempted using a puncture sealing agent, since the sound damper10is not adhered to the surface Is of the tire inner cavity1B, the puncture sealing agent easily reaches the puncture hole, so that excellent puncture repair performance can be exhibited.", "", "The sound damper10has the circumferential direction of the annular body, a thickness direction which is the same direction as the radial direction of the annular body, and a width direction which is orthogonal to the thickness direction and the circumferential direction. In the present embodiment, the circumferential direction of the sound damper10substantially coincides with the tire circumferential direction. The thickness direction of the sound damper10substantially coincides with the tire radial direction. The width direction of the sound damper10substantially coincides with the tire axial direction. Here, the above “substantially coincide” includes a mode in which the angular difference between the circumferential direction, the thickness direction, or the width direction and the tire circumferential direction, the tire radial direction, or the tire axial direction is 5° or less.", "", "As shown inFIG.1, in the present invention, an average thickness T (mm) of the sound damper10and an inner cavity surface radius R (mm) which is the distance in the tire radial direction from the tire rotation axis to the surface Is of the tire inner cavity1B on a tire equator plane Cs, satisfy the following formula (1). As the average thickness T, a value obtained by dividing the sum of measured thicknesses of a plurality of minute regions, into which the sound damper10is virtually divided and which include the outer and inner surfaces in the thickness direction, by the number of the minute regions, is adopted.", "", "0.04≤T/R≤0.1⁢8(1)", "", "In the present invention, an average circumferential length L (mm) in the circumferential direction of the sound damper10in a state where the sound damper10is removed from the tire1, and an inner cavity surface circumferential length C (mm) which is the length in the tire circumferential direction of the surface Is of the tire inner cavity1B on the tire equator plane Cs, satisfy the following formulas (2) and (3). As the circumferential length L, a value obtained by dividing the sum of measured circumferential lengths of minute annular bodies, into which the sound damper10is virtually divided, by the number of the minute annular bodies, is adopted.", "", "1.02-1.1×T/R≤L/C≤0.9⁢5+1.4×T/R(2)L/C≤1.1(3)", "", "By having the above-described features, the tire1of the present invention can maintain its uniformity and the durability of the sound damper10. The reasons for this are as follows.", "", "Generally, when the length of the sound damper is small, the position of the sound damper in the tire inner cavity is not stable, and it is difficult to maintain the shape of the sound damper. In addition, when the length of the sound damper is large, deformation such as buckling is likely to occur. Such defects may deteriorate the uniformity of the tire or damage the sound damper due to rubbing of the sound damper against the surface of the tire inner cavity or a rim. Therefore, in order to maintain the uniformity of the tire and the durability of the sound damper, it is essential to set the length of the sound damper to be in an appropriate range.", "", "When the thickness of the sound damper is small, it is difficult to maintain the shape thereof (annular body). In addition, when the thickness of the sound damper is large, great stress is likely to act on the sound damper, so that defects such as damage to or wear of the sound damper are likely to occur along with running of the tire. Therefore, in order to maintain the uniformity of the tire and the durability of the sound damper, it is essential to consider not only the length of the sound damper but also the thickness of the sound damper and set these dimensions to be in an appropriate range.", "", "Based on the above findings, the inventors conducted various experiments.FIG.3shows the relationship between the dimensions of the sound damper and the occurrence of damage, etc., to the sound damper, as an illustration of the results of the above experiments. InFIG.3, the horizontal axis indicates a ratio T/R of the average thickness T of the sound damper to the inner cavity surface radius R. The vertical axis indicates a ratio L/C of the circumferential length L of the sound damper to the inner cavity surface circumferential length C.", "", "The inventors created sound dampers with T/R and L/C varied as appropriate, and test tires in which these sound dampers were placed. In addition, the inventors also evaluated the durability of the sound dampers in these test tires. This evaluation is overall evaluation performed by dropping a tire having a sound damper mounted thereon onto a floor from a height of 1 m to check whether or not the sound damper comes off (hereinafter referred to as “drop test”), and also by causing a test tire to run for a certain distance on a drum tester and then checking whether or not the sound damper becomes disarranged or damaged. InFIG.3, a circle “∘”, a triangle “Δ”, and a cross “x” indicate results of the durability evaluation for the respective test tires. “∘” indicates that the sound damper did not become disarranged or damaged and is in good condition. “Δ” indicates that the sound damper became slightly disarranged or damaged at a level that causes no problem in use. “x” indicates that the sound damper easily came off in the above-described drop test, and the sound damper was excessively large, impairing durability and uniformity, etc., for which improvements are desirable.", "", "As a result, it was found that good results were obtained at coordinates in a specific range (dotted inFIG.3) as shown inFIG.3. As a result of further analysis, it was found that the above specific range is a region surrounded by graphs G1 to G5 shown by broken lines inFIG.3. In addition, it was found that the graphs G1 to G5 are specified by the following formulas.", "", "Graph⁢G⁢1:T/R=0.04Graph⁢G⁢2:T/R=0.1⁢8Graph⁢G⁢3:L/C=1.02-1.1×T/RGraph⁢G⁢4:L/C=0.9⁢5+1.4×T/RGraph⁢G⁢5:L/C=1.1", "", "The inventors also confirmed by experiment that good results can be obtained in the above specific range even when various conditions, such as the type of the sound damper and the tire size, are changed, and thus completed the present invention. That is, in the present invention, the uniformity of the tire1and the durability of the sound damper10can be maintained by setting the dimensions of the sound damper10to be in a specific range (range satisfying the above formulas (1) to (3)).", "", "In a preferable mode, any one, more preferably any two, of the following formulas (4) to (6) are satisfied. In a further preferable mode, all of the following formulas (4) to (6) are satisfied. Accordingly, the above-described effects are assuredly exhibited.", "", "0.06≤T/R≤0.16(4)1.04-1.1×T/R≤L/C≤0.9⁢4+1.4×T/R(5)L/C≤1.08(6)", "", "Hereinafter, more detailed configurations of the present embodiment will be described. Each configuration described below shows a specific mode of the present embodiment. Therefore, it is needless to say that the present invention can achieve the above-described effect even when the configurations described below are not provided. In addition, even when any one of the configurations described below is independently applied to the tire according to the present invention having the above-described characteristics, performance improvement corresponding to each configuration can be expected. Furthermore, when some of the configurations described below are applied in combination, complex performance improvement corresponding to each configuration can be expected.", "", "Unless otherwise noted, the dimensions of the sound damper10described below are dimensions measured in a state where the tire1is not fitted on a rim, the distance between a pair of the bead cores5is caused to coincide with that in the above standardized state, and the sound damper10is placed in the tire inner cavity1B.", "", "As shown inFIG.1, for example, a porous sponge material is employed for the sound damper10. For example, a material obtained by foaming a rubber or a synthetic resin and having open cells is employed as the sponge material. In a preferable mode, a polyurethane sponge having both ether and ester bonds is employed for the sound damper10. However, the present invention is not limited to such modes.", "", "If the air permeability of the sound damper10is in a specific range, when a puncture of the tire1is repaired using a puncture sealing agent, the sound damper10absorbs and holds the puncture sealing agent, and the puncture sealing agent is less likely to reach the puncture hole. From this viewpoint, the air permeability of the sound damper10is, for example, preferably 27 ml/cm2/s or lower. Accordingly, the above defect can be suppressed. The air permeability is measured in accordance with JIS K6400-7.", "", "If the air permeability of the sound damper10is high, even when the sound damper10absorbs the puncture sealing agent, the puncture sealing agent is easily discharged again therefrom, so that the above defect can be suppressed. From this viewpoint, the air permeability of the sound damper10may be, for example, 62 ml/cm2/s or higher.", "", "The density of the sound damper10is, for example, 5 to 60 kg/m3and preferably 10 to 50 kg/m3. Such a sound damper10can exhibit an excellent sound-damping effect while suppressing an increase in tire weight. In addition, the hardness of the sound damper10is 20 to 120 N and preferably 40 to 100 N. Accordingly, it is possible to inhibit the sound damper10from being disarranged, while maintaining the workability of mounting the sound damper10during tire manufacturing. Here, the hardness of the sound damper10is a value measured in accordance with the D method in Section 6.7 among the measurement methods in Section 6 of JIS K6400.", "", "As shown inFIG.2, the sound damper10is positioned so as to intersect the tire equator plane Cs. The sound damper10is in contact with (but not adhered to) the surface of the tread portion2on the tire inner cavity1B side. In addition, the sound damper10has a rectangular cross-section orthogonal to the tire circumferential direction. In a preferable mode, the cross-section of the sound damper10has a rectangular shape that is long in the tire axial direction. In addition, substantially the entirety (80% or more) in the circumferential direction of the sound damper10is in contact with the tire inner cavity1B. Such a sound damper10can exhibit an excellent sound-damping effect and durability.", "", "FIG.4shows an enlarged cross-sectional view of the sound damper10. As shown inFIG.4, a maximum thickness t1 in the tire radial direction of the sound damper10is 10 to 40 mm. In addition, a maximum width W1 of the sound damper10is 20% to 80% and preferably 20% to 40% of a cross-sectional width Wt (shown inFIG.1) of the tire1. Such a sound damper10is less likely to separate from the pneumatic tire body1A during tire running. Therefore, wear of the sound damper10is suppressed.", "", "The transverse cross-sectional area of the sound damper10(which is the cross-sectional area in a tire meridian cross-section) is 3 to 20% of the cross-sectional area of the tire1excluding the sound damper10. Accordingly, an excellent sound-damping effect is exhibited while an increase in tire weight is suppressed.", "", "FIG.5shows a diagram conceptually showing a side surface of the tire1. InFIG.5, the sound damper10is shown by broken lines. As shown inFIG.5, the sound damper10of the present embodiment is bonded at both ends in the tire circumferential direction thereof to form the annular body. InFIG.5, an adhered portion13between these ends is dotted. Such a sound damper10can inhibit end portions of the sound damper10from coming into contact with a rim, etc., and wearing, and excellent durability can be achieved.", "", "Both ends of the sound damper10are adhered to each other, for example, by means of an adhesive. In another embodiment, these ends may be welded together (bonded to each other after the sponge material is melted by heat).", "", "FIG.6shows enlarged views of both ends in the circumferential direction of a sound damper10of still another embodiment. As shown inFIG.6, the sound damper10of this embodiment has a fitted portion20in which a projection16provided at one end in the circumferential direction thereof and a recess17provided at the other end in the circumferential direction thereof are fitted to each other. Accordingly, the sound damper10can be made into an annular body without using an adhesive or the like, so that the uniformity of the tire is further improved.", "", "FIG.7shows enlarged views of both ends in the circumferential direction of a sound damper10of still another embodiment. As shown inFIG.7, the sound damper10of this embodiment is provided with a plurality of projections16at one end in the circumferential direction thereof, and is also provided with a plurality of recesses17at the other end in the circumferential direction thereof. Each projection16has, for example, a columnar shape, and each recess17has an internal shape corresponding to the projection16. A fitted portion20having such projections16and recesses17can suppress deformation of the sound damper10in the thickness direction.", "", "FIG.8shows enlarged views of both ends in the circumferential direction of a sound damper10of still another embodiment. As shown inFIG.8, the sound damper10of this embodiment is provided with a projection16and a recess17at each of one end and the other end in the circumferential direction thereof. Each projection16has, for example, a columnar shape, and each recess17has an internal shape corresponding to the projection16. In this embodiment, even when stress in multiple directions acts on a fitted portion20, each projection16and each recess17are less likely to become disengaged from each other, so that excellent durability can be exhibited.", "", "Although some embodiments of the pneumatic tire of the present invention have been described in detail above, the present invention is not limited to the above specific embodiments, and various modifications can be made to implement the present invention."], "claims": ["the sound damper is an annular body extending in a tire circumferential direction and is not adhered to a surface of the tire inner cavity, the sound damper has a circumferential direction of the annular body and a thickness direction which is the same direction as a radial direction of the annular body, an average thickness T (mm) of the sound damper and an inner cavity surface radius R (mm) which is a distance in a tire radial direction from a tire rotation axis to the surface of the tire inner cavity on a tire equator plane, satisfy the following formula (1), and an average circumferential length L (mm) in the circumferential direction of the sound damper in a state where the sound damper is removed from the pneumatic tire, and an inner cavity surface circumferential length C (mm) which is a length in the tire circumferential direction of the surface of the tire inner cavity on the tire equator plane, satisfy the following formulas (2) and (3),", "the sound damper has a width direction orthogonal to the thickness direction and the circumferential direction, and the sound damper has a maximum width which is 20% to 80% of a cross-sectional width of the pneumatic tire.", "3 . The pneumatic tire according to claim 2 , wherein the sound damper is positioned so as to intersect the tire equator plane.", "4 . The pneumatic tire according to claim 1 , wherein the sound damper is bonded at both ends in the circumferential direction thereof to form the annular body.", "5 . The pneumatic tire according to claim 1 , wherein the sound damper has a fitted portion in which a projection provided at one end in the circumferential direction thereof and a recess provided at another end in the circumferential direction thereof are fitted to each other.", "6 . The pneumatic tire according to claim 1 , wherein the sound damper has a rectangular cross-section.", "7 . The pneumatic tire according to claim 1 , wherein the sound damper has a density of 5 to 60 kg/m 3 .", "8 . The pneumatic tire according to claim 1 , wherein the sound damper has a hardness of 20 to 120 N.", "9 . The pneumatic tire according to claim 1 , wherein the sound damper has a transverse cross-sectional area which is 3 to 20% of a cross-sectional area of the pneumatic tire excluding the sound damper."], "bibtex": "@patent{20250065675,\n    title = {PNEUMATIC TIRE},\n    number = {20250065675},\n    year = {2025},\n    note = {File: US20250065675A1-20250227.XML}\n    }", "classification": "B60C1900FI"}, {"title": "SYSTEM, METHOD, AND APPARATUS FOR MAINTAINING A TIRE INFLATION PRESSURE", "doc_number": "20250065676", "filename": "US20250065676A1-20250227.XML", "abstract": "In one aspect, a passive tire inflation device is provided, comprising: a reservoir, a migration chamber containing a migration plug, and a post-plug outlet, wherein the migration chamber is fluidically connected to the reservoir, wherein the migration chamber is fluidically connected to the post-plug outlet, and wherein the migration plug is formed from a rubber compound. In another aspect, a tire and wheel assembly including a passive tire inflation device is provided, comprising: a vehicle wheel including a rim and at least one spoke, a tire mounted on the vehicle wheel forming a tire air chamber, the device comprising: a reservoir, a migration chamber containing a migration plug, and a post-plug outlet, wherein the post-plug outlet is fluidically connected to the tire air chamber. The device may be attached to or contained within at least one wheel spoke. The device may extend circumferentially about the wheel rim.", "detailed_description": ["FIG.1illustrates a graph showing tire inflation pressure loss over the course of24months. The graph illustrates the design maximum pressure (1), minimum pressure (2), and reserve minimum pressure (6), as well as the pressure of a front tire (3) and a rear tire (4) on a vehicle during that 24 month period, and finally a fluctuation based only upon pressure increase and decrease due to temperature changes (5) (and not accounting for a tire's natural leakage due to molecular migration of the contained air). As illustrated, a tire initially inflated to 28 psi is outside of design limits (below minimum pressure) in just over a year due to inflation loss. In a real world case, a tire's pressure would be a combination of lines (3) and (5), or lines (4) and (5), experiencing both pressure loss due to the natural molecular migration of the contained air, as well as the pressure fluctuation experienced by the tire's contained air due to temperature fluctuation throughout the year.", "", "FIG.2illustrates a schematic of a passive tire inflation system200. System200includes a reservoir202, a pre-plug inlet204A, a migration plug206, a post-plug outlet204B, and a tire air chamber208.", "", "Reservoir202may be a container that is sealed other than an aperture that is in fluid communication with inlet204A. Reservoir202may be formed from an air impermeable material. Reservoir202may contain a fluid, including without limitation, a liquid such as liquid nitrogen, a gas, an inert gas, or the like. Reservoir202may contain a pressurized fluid, including without limitation, a pressurized liquid such as liquid nitrogen, a pressurized gas, an inert gas, or the like. Use of a high density liquid form of nitrogen may allow the reservoir202to be smaller than if used with a gas form of a fluid. System200may remove the need for compression of local air with contaminants such as H2O or O2that may damage sensors, wheels, and/or the tire. Using an inert gas, such as CO2, N2, or the like, may act to extend the life of the tire. Reservoir202(and all like reservoirs discussed herein) may be replaced or refilled upon exhausting the supply of pressurized fluid contained therein.", "", "In one aspect, the use of nitrogen gas within the tire may have many benefits. For example, as nitrogen is inert, it is not prone to damaging the metal within the tire or wheel. Other gases, such as oxygen, oxidize and react negatively with these metal elements. Additionally, nitrogen has a larger molecular size than other gases, such as oxygen, and thus migrates more slowly through the molecular matrix of the tire.", "", "The use of other gases, including for example atmospheric air (which is a mixture of many molecules), may be problematic as the smaller molecules in the air migrate quicker out of the tire, leaving the larger molecules. This results in a pressure loss that is not constant, and rather, has a higher rate at first (as the small molecules quickly escape the tire), and a lower rate later (as the remaining larger molecules take longer to escape the tire).", "", "Inlet204A includes a hollow tube or aperture configured to permit a fluid from reservoir202to travel through inlet204A and into contact with migration plug206. Migration plug206may be formed from any of a variety of polymers, including without limitation, a rubber compound used in an actual tire. Migration plug206may include a fiber reinforced rubber to maintain the size and shape of plug206.", "", "Migration plug206may receive a fluid on its first end (the end in contact with reservoir202), and via the natural migration of the molecules being dissolved through the tire, will allow a fluid to slowly pass through plug206, into outlet204B, and finally into tire air chamber208. The aforementioned natural migration may be the same natural migration of particles that causes a tire to gradually lose inflation pressure as discussed above, only instead of air particles migrating out of the tire's air chamber and into the ambient atmosphere, the air particles migrate from reservoir202into tire air chamber208. In one aspect, the fluid inside reservoir202may be a liquid nitrogen, and thus the fluid contacting plug206is in liquid form on the inlet204A side of plug206, but is in a gas form on the outlet204B side of plug206. Boyle's Law dictates the phase (liquid or gas) of the fluids in question.", "", "Because plug206may be formed from a tire compound, plug206is subject to the same migration rate variations due to temperature fluctuations that are experienced in the rest of the tire. Plug206may be made from a compound, or compounds, that is the same as a compound, or compounds, used in the remainder of the tire. That is, plug206and the subject tire react in the same manner to temperature fluctuations, such that if the tire is losing air to the ambient atmosphere quicker due to a temperature, then plug206is refilling the tire quicker due to the same temperature. The advantage of using a tire compound for plug206is that plug206will behave, from a temperature fluctuation standpoint, like the remainder of the tire.", "", "Plug206may have a size, shape, thickness, and compound selected to mimic the rate of migration experienced by the tire. That is, if the tire loses 2% inflation pressure per month, then plug206is designed to add 2% inflation pressure back into the tire each month. As illustrated inFIG.2, plug206may be designed such that “designed leak” is equal to “expected loss,” to maintain tire air chamber208at “designed pressure.” Plug206and system200may be designed for a specific tire, tire segments, tire load ratings, tire load indexes (load index is dependent upon air volume within tire air chamber208), or the like, such that the same plug206and system200may be used on one specific tire, a segment of tires, tires of the same load ratings, tires of the same load indexes, or the like. A plug206and/or a system200may thus be compatible with various tire brands for universal application.", "", "As migration of the contents of reservoir202is dependent upon migration, rather than a pressure differential between reservoir202and tire air chamber208, the pressure inside of reservoir202has no effect on the rate of migration. Also, because the rate of migration is not dependent upon a pressure differential, the rate of migration does not change as the pressure of a fluid in reservoir202decreases over time, through the life of reservoir202and/or system200.", "", "FIGS.3A-3Fillustrate a passive tire inflation device310. Device310includes a reservoir302, a pre-plug inlet304A, a migration plug306, and a post-plug outlet304B.", "", "Migration plug306may be contained within a migration chamber312. Device310may additionally include a restriction plate318oriented within migration chamber312with plug306. Migration chamber312may be fluidically connected to inlet304A and outlet304B. Inlet304A may extend between reservoir302and chamber312.", "", "Restriction plate318may be a disk, plate, or the like, having one or more orifice within it that permits gas to flow through plate318after migration through plug306. Varying the size and/or number of orifices within restriction plate318will vary the flow rate of gas from migration chamber312into outlet304B. As illustrated inFIG.4, restriction plates418may have different sized orifices, such that a restriction plate418with a smaller orifice has a lower flow rate, while a restriction plate418with a larger orifice has a higher flow rate.", "", "FIG.4illustrates a schematic of a passive tire inflation device410. Device410includes a reservoir402, a pre-plug inlet404A, a migration chamber412, a migration plug406, a post-plug outlet404B, and one or more restriction plates418. The flow rate of gas into the tire air chamber may be increased or decreased through varying one or more of the following: (A) the size of migration chamber412, (A1, A2) the size of the orifice(s) within one or more restriction plates418contained within migration chamber412, (B1) the thickness of migration plug406, and (C) the rubber/polymer composite material. The thicker plug406, the lower the migration rate. The higher the cross-sectional area of plug406and/or migration chamber412, the higher the migration rate. The larger and/or higher number of the orifice(s) within restriction plate418, the higher the migration rate.", "", "Any of post-plug outlets204B,304B, and404B may be fluidically connected to the interior of a tire air chamber. Any of post-plug outlets204B,304B, and404B may be fluidically connected to a tire fill valve, a vehicle rim, or contained wholly within the interior of a tire air chamber.", "", "FIGS.5A-5Dillustrate a tire and wheel assembly520including a passive tire inflation device510. Assembly520includes a tire522mounted on a vehicle wheel523. Wheel523includes a rim524and at least one spoke526. Assembly520may include at least one device510. As illustrated inFIGS.5B-5D, at least one device510may be attached to at least one spoke526, and the at least one device510includes a post-plug outlet504B fluidically connected to and/or extending through rim524. In this manner, the interior of outlet504B is fluidically connected to the tire air chamber528.", "", "Alternatively, one or more device510may be contained within one or more spoke526rather than simply being connected to one or more spoke526. One or more device510may be oriented on the inboard side of one or more spoke526, both to conceal and protect device(s)510.", "", "Device510may be substantially the same as one or both of devices310and410.", "", "FIGS.6A-6Dillustrate a tire and wheel assembly620including a passive tire inflation device630. Assembly620includes a tire622mounted on a vehicle wheel623. Wheel623includes a rim624and at least one spoke626. Assembly620may include at least one device630. As illustrated inFIGS.6B-6D, at least one device630may be attached to, or integrated into, rim624, and the at least one device630includes a migration chamber612, and a post-plug outlet604B fluidically connected to and/or extending through rim624. The interior of outlet604B is fluidically connected to the tire air chamber628.", "", "Device630may include a reservoir extending circumferentially about the radially inner side of rim624, forming an annular reservoir functioning the same way as reservoir202,302, and402. Alternatively, device630may include a reservoir extending circumferentially about the radially outer side of rim624(inside of tire air chamber628), forming an annular reservoir functioning the same way as reservoir202,302, and402. Alternatively, device630may include one or more reservoir extending circumferentially about the radially inner side and/or radially outer side of rim624.", "", "Device630includes a migration chamber612, which includes one or both of a migration plug (not shown) and one or more restriction plate (not shown). The arrangement and function of migration chamber612may be substantially the same as migration chamber312and/or412. The plugs may be substantially the same as plugs206,306, and/or406. The restriction plates may be substantially the same as restriction plates318and/or418.", "", "The use of the passive inflation systems and devices described herein may permit tires to be manufactured without the inclusion of a tire innerliner. The tire innerliner is tasked with helping to mitigate the migration of gas molecules from the interior of the tire air chamber into the ambient environment. The innerliner makes up approximately 10% of the weight of the tire, so elimination of the innerliner will lower the weight of the tire. The innerliner additionally helps to insulate the tire and makes it harder for the tire to shed heat. Elimination of the innerliner may make the tire shed heat more easily. Finally, the innerliner is often the most expensive compound contained in the tire. Elimination of the innerliner may decrease the cost of making the tire.", "", "The use of the passive inflation systems and devices described herein may target as little as 0.5% to 3% loss of inflation pressure per month where the innerliner remains, and as much as 20% loss of inflation pressure per month where the innerliner is eliminated.", "", "The use of the passive inflation systems and devices described herein may be used with running tires or spare tires. The use of the passive inflation systems and devices described herein may be used with any of a variety of types of tires, including off-the-road tires (e.g., mining tires or heavy equipment tires), aircraft tires, truck and bus radial tires, agricultural tires, passenger tires, truck tires, and the like.", "", "The use of the passive inflation systems and devices described herein may help alter tire pressure management from a “check” item to a “maintenance” item, where a technician simply replaces or refills the system reservoir at some time interval, which may be combined with other maintenance items, such as rotating the tires, changing oil or filters, and the like.", "", "To the extent that the term “includes” or “including” is used in the specification or the claims, it is intended to be inclusive in a manner similar to the term “comprising” as that term is interpreted when employed as a transitional word in a claim. Furthermore, to the extent that the term “or” is employed (e.g., A or B) it is intended to mean “A or B or both.” When the applicants intend to indicate “only A or B but not both” then the term “only A or B but not both” will be employed. Thus, use of the term “or” herein is the inclusive, and not the exclusive use. See Bryan A. Garner, A Dictionary of Modern Legal Usage 624 (2d. Ed. 1995). Also, to the extent that the terms “in” or “into” are used in the specification or the claims, it is intended to additionally mean “on” or “onto.” To the extent that the term “substantially” is used in the specification or the claims, it is intended to take into consideration the degree of precision available in tire manufacturing. To the extent that the term “selectively” is used in the specification or the claims, it is intended to refer to a condition of a component wherein a user of the apparatus may activate or deactivate the feature or function of the component as is necessary or desired in use of the apparatus. To the extent that the term “operatively connected” is used in the specification or the claims, it is intended to mean that the identified components are connected in a way to perform a designated function. As used in the specification and the claims, the singular forms “a,” “an,” and “the” include the plural. Finally, where the term “about” is used in conjunction with a number, it is intended to include ±10% of the number. In other words, “about 10” may mean from 9 to 11.", "", "As stated above, while the present application has been illustrated by the description of embodiments and aspects thereof, and while the embodiments and aspects have been described in considerable detail, it is not the intention of the applicants to restrict or in any way limit the scope of the appended claims to such detail. Additional advantages and modifications will readily appear to those skilled in the art, having the benefit of the present application. Therefore, the application, in its broader aspects, is not limited to the specific details, illustrative examples shown, or any apparatus referred to. Departures may be made from such details, examples, and apparatuses without departing from the spirit or scope of the general inventive concept."], "claims": ["a reservoir, a migration chamber containing a migration plug, and a post-plug outlet, wherein the migration chamber is fluidically connected to the reservoir, wherein the migration chamber is fluidically connected to the post-plug outlet, and wherein the migration plug is formed from a rubber compound.", "2 . (canceled)", "3 . The passive tire inflation device of claim 1 , wherein the reservoir contains an inert gas.", "4 . The passive tire inflation device of claim 1 , further comprising a pre-plug inlet oriented between the reservoir and the migration chamber.", "5 . The passive tire inflation device of claim 1 , wherein the post-plug outlet is fluidically connected to a tire air chamber.", "6 . The passive tire inflation device of claim 1 , further comprising at least one restriction plate oriented within the migration chamber between the migration plug and the post-plug outlet.", "7 . The passive tire inflation device of claim 6 , wherein the restriction plate includes at least one orifice.", "a vehicle wheel including a rim and at least one spoke, a tire mounted on the vehicle wheel forming a tire air chamber, the device comprising: a reservoir, a migration chamber containing a migration plug, and a post-plug outlet, wherein the post-plug outlet is fluidically connected to the tire air chamber.", "9 . (canceled)", "10 . The tire and wheel assembly of claim 8 , further comprising a pre-plug inlet oriented between the reservoir and the migration chamber.", "11 . The tire and wheel assembly of claim 8 , further comprising at least one restriction plate oriented within the migration chamber between the migration plug and the post-plug outlet.", "12 . The tire and wheel assembly of claim 11 , wherein the restriction plate includes at least one orifice.", "13 . The tire and wheel assembly of claim 8 , wherein the device is attached to at least one spoke.", "14 . The tire and wheel assembly of claim 8 , wherein the device is contained within at least one spoke.", "15 . The tire and wheel assembly of claim 8 , wherein the post-plug outlet extends through the rim.", "a vehicle wheel including a rim and at least one spoke, a tire mounted on the vehicle wheel forming a tire air chamber, the device comprising: a reservoir extending circumferentially about the rim, a migration chamber containing a migration plug, and a post-plug outlet, wherein the post-plug outlet is fluidically connected to the tire air chamber.", "17 . (canceled)", "18 . The tire and wheel assembly of claim 16 , further comprising a pre-plug inlet oriented between the reservoir and the migration chamber.", "19 . The tire and wheel assembly of claim 16 , further comprising at least one restriction plate oriented within the migration chamber between the migration plug and the post-plug outlet.", "20 . The tire and wheel assembly of claim 19 , wherein the restriction plate includes at least one orifice.", "21 . The tire and wheel assembly of claim 16 , wherein the reservoir extends circumferentially about the radially inner side of the rim.", "22 . The tire and wheel assembly of claim 16 , wherein the post-plug outlet extends through the rim.", "23 . The tire and wheel assembly of claim 16 , wherein the reservoir extends circumferentially about the radially outer side of the rim."], "bibtex": "@patent{20250065676,\n    title = {SYSTEM, METHOD, AND APPARATUS FOR MAINTAINING A TIRE INFLATION PRESSURE},\n    number = {20250065676},\n    year = {2025},\n    note = {File: US20250065676A1-20250227.XML}\n    }", "classification": "B60C2300FI"}, {"title": "SLOW LEAK DETECTION SYSTEMS AND METHODS", "doc_number": "20250065677", "filename": "US20250065677A1-20250227.XML", "abstract": "A system communicatively coupled with a vehicle is disclosed. The system may include a detection unit configured to measure sound in proximity to a vehicle tire, and a processor communicatively coupled with the detection unit. The processor may be configured to obtain inputs from the detection unit, and identify a slow leakage in the vehicle tire based on the inputs. The processor may be further configured to output a notification responsive to a slow leakage identification. The system may be a part of the vehicle or may be part of a user device communicatively coupled to the vehicle.", "detailed_description": [""], "claims": ["a detection unit configured to measure sound in proximity to a vehicle tire; and a processor communicatively coupled with the detection unit, wherein the processor is configured to: obtain inputs from the detection unit; identify a slow leakage in the vehicle tire based on the inputs; and output a notification responsive to a slow leakage identification.", "determine a vehicle tire location responsive to the slow leakage identification; and output the notification responsive to the vehicle tire location, wherein the notification comprises information associated with the vehicle tire location.", "3 . The system of claim 1 , wherein the system is part of at least one of a mobile device or a smart watch.", "4 . The system of claim 3 , wherein the detection unit comprises built-in ultrasonic sensors in the mobile device or the smart watch.", "determine that the system that is communicatively coupled with the vehicle is in proximity to the vehicle; and activate the detection unit.", "6 . The system of claim 1 , wherein the system is part of the vehicle.", "7 . The system of claim 6 , wherein the detection unit comprises built-in ultrasonic sensors in the vehicle.", "obtain inputs from the TPMS; determine pressure of the vehicle tire based on the inputs; compare the pressure with a first threshold value; and activate the detection unit when the pressure is less than the first threshold value.", "determine pressure of all vehicle tires based on the inputs; calculate a difference in pressure between all the vehicle tires; and activate the detection unit when the difference is greater than a second threshold value.", "10 . The system of claim 6 , wherein the processor is configured to output the notification on a vehicle Human-Machine Interface (HMI) or mobile device HMI.", "obtaining, by a processor of a system, inputs from a detection unit of the system, wherein the detection unit is configured to measure sound in proximity to the vehicle tire, and wherein the system is communicatively coupled with a vehicle; identifying, by the processor, a slow leakage in the vehicle tire based on the inputs; and outputting, by the processor, a notification responsive to a slow leakage identification.", "determining a vehicle tire location responsive to the slow leakage identification; and outputting the notification responsive to the determination of the vehicle tire location, wherein the notification comprises information associated with the vehicle tire location.", "13 . The method of claim 11 , wherein the system is part of at least one of a mobile device or a smart watch.", "14 . The method of claim 13 , wherein the detection unit comprises built-in ultrasonic sensors in the mobile device or the smart watch.", "determining that the system that is communicatively coupled with the vehicle is in proximity to the vehicle; and activating the detection unit responsive to the determination.", "16 . The method of claim 11 , wherein the system is part of the vehicle.", "17 . The method of claim 16 , wherein the detection unit comprises built-in ultrasonic sensors in the vehicle.", "obtaining inputs from a Tire Pressure Monitoring System (TPMS); determining pressure of the vehicle tire based on the inputs; comparing the pressure with a first threshold value; and activating the detection unit when the pressure is less than the first threshold value.", "determining pressure of all vehicle tires based on the inputs; calculating a difference in pressure between all the vehicle tires; and activating the detection unit when the difference is greater than a second threshold value.", "obtain inputs from a detection unit of a system, wherein the detection unit is configured to measure sound in proximity to a vehicle tire, and wherein the system is communicatively coupled with a vehicle; identify a slow leakage in the vehicle tire based on the inputs; and output a notification responsive to a slow leakage identification."], "bibtex": "@patent{20250065677,\n    title = {SLOW LEAK DETECTION SYSTEMS AND METHODS},\n    number = {20250065677},\n    year = {2025},\n    note = {File: US20250065677A1-20250227.XML}\n    }", "classification": "B60C2304FI"}]