[{"title": "WHEEL LOCK DEVICE FOR AUTOMOBILES", "doc_number": "20240359502", "filename": "US20240359502A1-20241031.XML", "abstract": "A wheel lock device including a stopper member configured as one of a disc member, a conical frustum member, and a clamp member, is provided. The stopper member encloses an axle cover and together therewith, attaches to an axle hub of an automobile. The stopper member secures and precludes a wheel rim from dislodging from the automobile, when fasteners that attach the wheel rim to the automobile are unfastened accidentally. An outer diameter of the stopper member is larger than a central opening defined in the wheel rim, thereby restricting and precluding the wheel rim from dislodging from the automobile. The stopper member includes openings annularly disposed about a central opening of the stopper member for receiving bolts extending from an outer end of the axle hub. The stopper member is secured to the bolts extending from the outer end of the axle hub using bolt nuts.", "detailed_description": ["Disclosed herein is a wheel lock device100/800/1100comprising a stopper member101/801/1103configured to enclose an axle cover204and together with the axle cover204, attach to an axle hub206of an automobile200as illustrated inFIG.2,FIGS.3A-3B,FIGS.4-5,FIGS.6A-6B,FIG.7,FIGS.9A-9B,FIG.10,FIGS.12A-12B, andFIG.13. In various embodiments of the disclosure herein, the stopper member is configured as a disc member101as illustrated inFIGS.1A-1E, a conical frustum member801as illustrated inFIGS.8A-8F, and a clamp member1103as illustrated inFIGS.11A-11F. The stopper member101/801/1103is configured to secure and preclude a wheel rim202from dislodging from the automobile200illustrated inFIG.2andFIGS.3A-3B, when fasteners, for example, lug nuts211illustrated inFIGS.3A-3B,FIGS.4-5,FIGS.6A-6B,FIGS.9A-9B,FIG.10,FIGS.12A-12B, andFIG.13, that attach the wheel rim202to the automobile200are unfastened accidentally as disclosed in the various embodiments below. The wheel lock devices100,800, and1100are made, for example, from steel, cast iron, aluminum, stainless steel, carbon steel, etc.", "", "FIGS.1A-1Billustrate a front perspective view and a rear perspective view of an embodiment of a wheel lock device100, respectively. In the embodiment illustrated inFIGS.1A-1B, the wheel lock device100comprises a disc member101configured as a stopper to secure a wheel rim202and preclude the wheel rim202from dislodging from an automobile200illustrated inFIG.2, when fasteners, for example, lug nuts211illustrated inFIGS.3A-3B, that attach the wheel rim202to the automobile200are unfastened accidentally. In an embodiment, the wheel rim is a single rim utilized in a single-rim automobile. In another embodiment, the wheel rim is a dual-rim utilized in a dual-rim automobile200as illustrated inFIG.2. In an embodiment, the wheel lock device100is configured to be installed in any automobile that utilizes dual rims. Dual rims are utilized on both ends of a rear axle or a non-steering axle of the automobile200. Examples of dual-rim automobiles comprise medium duty trucks, heavy duty trucks, semi-trucks, mining trucks, pickup trucks, utility trucks, dump trucks, tractors, tractor trailers, electric tractors with electric tandems, etc. In an embodiment as illustrated inFIGS.1A-1B, the disc member101comprises a generally circular plate101awith a central opening102, and a generally hollow cylindrical wall101b. In an embodiment, the generally circular plate101ais a ring-shaped plate. The generally hollow cylindrical wall101bis configured to extend substantially perpendicularly from an edge101cof the generally circular plate101aas illustrated inFIGS.1A-1B. The generally circular plate101aand the generally hollow cylindrical wall101bof the disc member101define an inner space101das illustrated inFIG.1BandFIG.1E, configured to receive and enclose an axle cover204illustrated inFIGS.3A-3B.", "", "In an embodiment, the disc member101comprises multiple openings103annularly disposed about the central opening102of the disc member101. The openings103are disposed on the generally circular plate101aof the disc member101as illustrated inFIGS.1A-1BandFIG.1D. The openings103are configured, for example, as generally cylindrical openings with circular ends, to receive bolts207extending from an outer end206aof an axle hub206as illustrated inFIGS.3A-3B. In an example, the diameter of each of the openings103is about 1.25 inches. The distance between the centers of adjacent openings103on the generally circular plate101ais, for example, about 2.6788 inches. The distance between the centers of diametrically opposite openings103is, for example, about 7 inches. The axle hub206is used to attach the wheel lock device100and the axle cover204shown inFIGS.3A-3Bto the automobile200as disclosed in the descriptions ofFIGS.3A-3BandFIG.4.", "", "FIG.1Cillustrates a left-side elevation view of the wheel lock device100, the right-side elevation view being a mirror image thereof.FIG.1Dillustrates a rear elevation view of the wheel lock device100. As illustrated inFIG.1D, the generally circular plate101aof the disc member101of the wheel lock device100comprises an inner diameter101edefining the central opening102and an outer diameter101f. The inner diameter101eof the generally circular plate101ais, for example, about 5.5 inches. The outer diameter101fof the generally circular plate101ais, for example, about 8.5 inches. The thickness of the generally circular plate101aof the disc member101is, for example, about 0.5625 inches. The thickness of the generally hollow cylindrical wall101bis, for example, about 0.75 inches. The height of the generally hollow cylindrical wall101bis, for example, about 1 inch. The outer diameter101gof the disc member101is, for example, about 10 inches. The outer diameter101gof the wheel lock device100is generally larger than the outer diameter of a central opening in a wheel rim of a single-rim automobile or larger than the outer diameter of a central opening202cin an outer rim202of a dual-rim automobile200shown inFIGS.3A-3B. The single-rim or the outer rim202, therefore, cannot get past the wheel lock device100.", "", "FIG.1Eillustrates a cross-sectional view of the wheel lock device100, taken along a sectional line E-E′ shown inFIG.1D. The cross-sectional view inFIG.1Eillustrates the inner space101ddefined by the generally circular plate101aand the generally hollow cylindrical wall101bof the disc member101. The cross-sectional view inFIG.1Ealso illustrates the openings103disposed on the generally circular plate101aof the disc member101. The openings103are, for example, generally cylindrical openings as illustrated inFIGS.1A-1BandFIG.1E.", "", "FIG.2illustrates a perspective view of a dual-rim automobile200, showing wheel lock devices100securing wheel rims202to the dual-rim automobile200. The wheel rims202that house tires of the dual-rim automobile200are secured to corresponding axle hubs206of the dual-rim automobile200by fastening lug nuts211onto studs208extending from inner ends206bof the axle hubs206as illustrated inFIGS.3A-3B. The lug nuts211prevent the wheel rims202from being dislodged from the dual-rim automobile200. Each wheel lock device100is configured to enclose an axle cover204and together with the axle cover204, attach to the corresponding axle hub206of the dual-rim automobile200as illustrated inFIG.6B. The outer diameter101gof the disc member101illustrated inFIG.1D, is generally larger than a central opening202cdefined in the wheel rim, for example, the outer rim202, thereby restricting and precluding the outer rim202from dislodging from the dual-rim automobile200.", "", "FIG.3Aillustrates an exploded view of a dual-rim assembly201utilized in the dual-rim automobile200shown inFIG.2, showing the wheel lock device100configured to enclose an axle cover204and attach to an axle hub206of the dual-rim automobile200. The dual-rim assembly201comprises an outer rim202and an inner rim203as illustrated inFIG.3A. The outer rim202comprises a central disc202awith lug holes202b. The central disc202aof the outer rim202defines a central opening202cas illustrated inFIG.3A. Similarly, the inner rim203comprises a central disc203awith lug holes203b. The central disc203aof the inner rim203defines a central opening203cas illustrated inFIG.3A. The outer diameter of each of the central openings202cand203cof the outer rim202and the inner rim203, respectively, is generally smaller than the outer diameter101gof the wheel lock device100. The central openings202cand203cof the outer rim202and the inner rim203, respectively, are configured to fit over the axle hub206. The central openings202cand203cof the outer rim202and the inner rim203, respectively, accommodate the axle hub206. The axle hub206extends from the axle housing209as illustrated inFIG.3A. Multiple elongate studs208extend outwardly from a lip member206bof the axle hub206. Furthermore, multiple bolts207extend outwardly from the outer end206aof the axle hub206. Furthermore, a closed cylindrical member, that is, a brake drum205, is configured to be attached to a wheel of the automobile200, against which a brake shoe (not shown) presses to make the automobile200decelerate or stop. The brake drum205and the brake shoe form a friction pair, which decelerates the rotation of the wheel. The axle hub206is attached to the brake drum205and the axle housing209as illustrated inFIGS.6A-6BandFIG.7. The brake drum205comprises a central disc205awith lug holes205b. The central disc205aof the brake drum205defines a central opening205cas illustrated inFIG.3A.FIG.3Aalso illustrates the lug nuts211configured to fasten the outer rim202, the inner rim203, and the brake drum205to the axle hub206. Furthermore,FIG.3Aillustrates bolt nuts210configured to fasten the wheel lock device100and the axle cover204to the axle hub206.", "", "During assembly, the axle hub206is inserted into the central opening205cof the brake drum205and thereafter into the central openings203cand202cof the inner rim203and the outer rim202, respectively, such that the studs208of the axle hub206enter into the lug holes205bof the brake drum205and thereafter into the lug holes203band202bof the inner rim203and the outer rim202, respectively. The brake drum205and thereafter the inner rim203and the outer rim202are fit about the axle hub206and secured to the axle hub206by fastening the lug nuts211onto the studs208extending from an inner end defined by the lip member206bof the axle hub206. The axle cover204comprises openings204aconfigured to be in fluid communication with the openings103of the wheel lock device100. The wheel lock device100is fit over the axle cover204. The bolts207extending from the outer end206aof the axle hub206are configured to be inserted into the openings204aand103of the axle cover204and the wheel lock device100, respectively. The wheel lock device100together with the enclosed axle cover204is secured to the bolts207of the axle hub206using the bolt nuts210.", "", "FIG.3Billustrates an exploded view of an embodiment of the dual-rim assembly201utilized in the dual-rim automobile200shown inFIG.2, showing the wheel lock device100configured to enclose an embodiment of the axle cover204and attach to the axle hub206of the dual-rim automobile200. In this embodiment, the axle cover204is configured as an axle flange attached to a shaft212as illustrated inFIG.3B. The shaft212extends perpendicularly from a lower surface204bof the axle cover204. In this embodiment, the axle hub206comprises an opening206cconfigured to receive the shaft212. During assembly, the shaft212that extends from the lower surface204bof the axle cover204is inserted through the openings202c,203c,205c, and206cof the outer rim202, the inner rim203, the brake drum205, and the axle hub206, respectively. Shaft teeth213configured on one end212aof the shaft212facilitate the transmission of torque from the shaft212to the axle hub206. The disc member101of the wheel lock device100together with the enclosed axle cover204is secured to the bolts207of the axle hub206using the bolt nuts210.", "", "FIG.4illustrates an assembled view of the dual-rim assembly201shown inFIGS.3A-3B, with the wheel lock device100and the enclosed axle cover204attached to the axle hub206of the dual-rim automobile200. As illustrated inFIG.4, the inner rim203and the outer rim202are secured to the axle hub206using the lug nuts211. The disc member101of the wheel lock device100encloses the axle cover204. The disc member101together with the enclosed axle cover204is attached to the outer end206aof the axle hub206illustrated inFIGS.3A-3B. In an embodiment, the disc member101is secured to the bolts207extending from the outer end206aof the axle hub206by fastening the bolt nuts210to the bolts207illustrated inFIGS.3A-3B. The one-piece, disc-shaped, wheel lock device100utilizes, for example, a minimum of four bolt nuts210to hold the disc member101in place on the axle cover204, and in an embodiment, utilizes all the bolt nuts210available, for example, eight bolt nuts210, for fastening the axle cover204.", "", "FIG.5illustrates a front elevation view of the dual-rim assembly201shown inFIG.4, with the wheel lock device100and the enclosed axle cover204attached to the axle hub206shown inFIGS.3A-3B, of the dual-rim automobile200shown inFIG.2. The axle cover204enclosed by the wheel lock device100is visible through the central opening102of the wheel lock device100.FIG.5also shows the lug nuts211used to fasten the outer rim202and the inner rim203to the axle hub206shown inFIGS.3A-3B, and the bolt nuts210used to fasten the wheel lock device100with the enclosed axle cover204to the axle hub206.", "", "FIG.6Aillustrates a cross-sectional, side elevation view of the dual-rim assembly201, showing the wheel lock device100configured to attach to the axle cover204at the outer end206aof the axle hub206using bolts207and bolt nuts210. The brake drum205, the inner rim203, and the outer rim202are coaxially secured to the axle hub206by fastening the lug nuts211to the studs208as illustrated inFIG.6A. The axle hub206passes through the central openings205c,203c, and202cof the brake drum205, the inner rim203, and the outer rim202, respectively, while the studs208pass through the lug holes205b,203b, and202bof the brake drum205, the inner rim203, and the outer rim202, respectively, illustrated inFIGS.3A-3B. The bolts207extending from the outer end206aof the axle hub206are inserted into the openings204aof the axle cover204shown inFIGS.3A-3B. The axle cover204is typically attached to the outer end206aof the axle hub206by fastening the bolt nuts210to the bolts207. The wheel lock device100is attached to the axle cover204and in turn to the outer end206aof the axle hub206by unfastening the bolt nuts210from the axle cover204, placing the wheel lock device100over the axle cover204such that the bolts207pass through the openings103of the wheel lock device100, and fastening the bolts nuts210to the bolts207.FIG.6Aillustrates the position of the wheel lock device100with respect to the axle cover204, before the wheel lock device100encloses the axle cover204and together with the axle cover204attaches to the outer end206aof the axle hub206.", "", "FIG.6Billustrates a cross-sectional, side elevation view of the dual-rim assembly201, showing the wheel lock device100attached to the axle cover204at the outer end206aof the axle hub206using bolts207and bolt nuts210. The outer rim202and the inner rim203are secured to the axle hub206using the studs208on the axle hub206and the lug nuts211.FIG.6Bshows the lug nuts211fixed to the studs208to prevent the outer rim202and the inner rim203from dislodging from the axle hub206. When the wheel lock device100is placed over the axle cover204, the axle cover204is received within the inner space101dof the wheel lock device100shown inFIG.1BandFIG.1E. The wheel lock device100, therefore, encloses the axle cover204at the outer end206aof the axle hub206as illustrated inFIG.6B. On attaching the wheel lock device100to the axle cover204by fastening the bolts nuts210to the bolts207, the fastened bolt nuts210lie flush against the generally circular plate101aof the wheel lock device100.", "", "FIG.7illustrates a cross-sectional, side elevation view of the dual-rim assembly201, showing operation of the wheel lock device100as a stopper that secures and precludes a wheel rim, for example, an outer rim202, from dislodging from an automobile200shown inFIG.2, when fasteners, for example, the lug nuts211, that attach the outer rim202to the automobile200are unfastened accidentally. When the automobile200is in motion, if the lug nuts211accidentally unfasten, disengage from the studs208, and fall off as illustrated inFIG.7, the wheel lock device100secures and precludes the outer rim202and/or the inner rim203of the automobile200from dislodging from the automobile200. When the lug nuts211unfasten, the outer rim202and the inner rim203may disengage and separate from each other as illustrated inFIG.7. Since the outer diameter101gof the wheel lock device100illustrated inFIG.1Dis larger than the central openings202cand203cdefined in the outer rim202and the inner rim203, respectively, the wheel lock device100restricts and precludes the outer rim202and the inner rim203from dislodging from the automobile200, thereby preventing serious accidents.FIG.7shows the outer rim202and the inner rim203disengaged from each other due to the unfastening of the lug nuts211, and being precluded from dislodging from the automobile200by the wheel lock device100acting as a stopper.", "", "If the lug nuts211unfasten from the studs208, the wheel lock device100precludes the outer rim202and the inner rim203, and in turn, tires housed thereon, from coming off the axle hub206of the automobile200. In this scenario, if the automobile200loses power to its rear wheels, the automobile200can pull over safely with the rims202and203and in turn, the tires, still attached to the automobile200. The wheel lock device100is configured to be attached to any axle having bolts on an outermost part of the axle, for example, bolts207on an axle cover204.", "", "FIGS.8A-8Billustrate a front perspective view and a rear perspective view of another embodiment of the wheel lock device800, respectively. In this embodiment, the wheel lock device800is shaped similar to a bell. In this embodiment, the stopper member is configured as a conical frustum member801comprising a generally circular plate101a, for example, a ring-shaped plate, with a central opening102, and a generally hollow frustum wall801a. The conical frustum member801is configured to secure a wheel rim202illustrated inFIGS.9A-9BandFIG.10, and preclude the wheel rim202from dislodging from an automobile200illustrated inFIG.2, when fasteners, for example, lug nuts211, that attach the wheel rim202to the automobile200are unfastened accidentally. The generally hollow frustum wall801ais configured to extend angularly from an edge101cof the generally circular plate101aand terminate at a tapered end801bof the generally hollow frustum wall801a. In an example, the generally hollow frustum wall801aextends from a plane of the circular plate101aby an angle of about 30 degrees to about 60 degrees. The generally circular plate101aand the generally hollow frustum wall801aof the conical frustum member801define an inner space801eas illustrated inFIG.8BandFIG.8F, configured to receive and enclose an axle cover204illustrated inFIGS.9A-9BandFIG.10. In an embodiment, the tapered end801bof the generally hollow frustum wall801aof the conical frustum member801comprises an outward edge801cand an inward edge801dconfigured to firmly secure the conical frustum member801to the wheel rim202.", "", "In an embodiment, the conical frustum member801comprises multiple openings103annularly disposed about the central opening102of the conical frustum member801. The openings103are disposed on the generally circular plate101aof the conical frustum member801as illustrated inFIGS.8A-8BandFIGS.8D-8E. The structure and the function of the openings103are disclosed in the description ofFIGS.1A-1B.", "", "FIG.8Cillustrates a left-side elevation view of the wheel lock device800. The tapered end801bof the conical frustum member801of the wheel lock device800is illustrated inFIG.8C.FIGS.8D-8Eillustrate a front elevation view and a rear elevation view of the wheel lock device800, respectively. The structure and dimensions of the generally circular plate101aof the conical frustum member801is disclosed in the description ofFIG.1D. In an example, the height of the generally hollow frustum wall801aof the conical frustum member801is about 10 inches to about 20 inches; the inner diameter801fof the generally hollow frustum wall801ais about 17 inches to about 20 inches, and the outer diameter801gof the generally hollow frustum wall801ais about 17.5 inches to about 20.5 inches. The outer diameter801gof the conical frustum member801is generally larger than the outer diameter of a central opening in a wheel rim of a single-rim automobile or generally larger than the outer diameter of a central opening202cin an outer rim202of a dual-rim automobile200shown inFIGS.9A-9BandFIG.2, therefore, precluding the single-rim or the outer rim202from getting past the wheel lock device800. The wheel lock device800, therefore, restricts and precludes the outer rim202from dislodging from the dual-rim automobile200.", "", "FIG.8Fillustrates a cross-sectional view of the wheel lock device800, taken along a sectional line F-F′ shown inFIG.8E. The cross-sectional view inFIG.8Fillustrates the inner space801edefined by the generally circular plate101aand the generally hollow frustum wall801aof the conical frustum member801. The cross-sectional view inFIG.8Falso illustrates the openings103disposed on the generally circular plate101aof the conical frustum member801. The openings103are, for example, generally cylindrical openings as illustrated inFIGS.8A-8BandFIGS.8D-8E.", "", "FIG.9Aillustrates an exploded view of a dual-rim assembly201utilized in the dual-rim automobile200shown inFIG.2, showing the wheel lock device800configured to enclose an axle cover204and attach to an axle hub206of the dual-rim automobile200. The structure and the assembly of the dual-rim assembly201comprising the outer rim202, the inner rim203, the brake drum205, the axle hub206, and the axle housing209are disclosed in the descriptions ofFIG.2andFIGS.3A-3B. After the assembly of the dual-rim assembly201, the wheel lock device800is fit over the axle cover204. The bolts207extending from the outer end206aof the axle hub206are configured to be inserted into the openings204aand103of the axle cover204and the generally circular plate101aof the wheel lock device800, respectively. The wheel lock device800together with the enclosed axle cover204is secured to the bolts207of the axle hub206using the bolt nuts210.", "", "FIG.9Billustrates an exploded view of an embodiment of the dual-rim assembly201utilized in the dual-rim automobile200shown inFIG.2, showing the wheel lock device800configured to enclose an embodiment of the axle cover204and attach to the axle hub206of the dual-rim automobile200. In this embodiment, the axle cover204is configured as an axle flange attached to a shaft212as illustrated inFIG.9B. The shaft212extends perpendicularly from the lower surface204bof the axle cover204. In this embodiment, the axle hub206comprises an opening206cconfigured to receive the shaft212. During assembly, the shaft212is inserted through the openings202c,203c,205c, and206cof the outer rim202, the inner rim203, the brake drum205, and the axle hub206, respectively. The wheel lock device800together with the enclosed axle cover204is secured to the bolts207of the axle hub206using the bolt nuts210.", "", "FIG.10illustrates a cross-sectional, side elevation view of the dual-rim assembly201, showing the wheel lock device800attached to the axle cover204at the outer end206aof the axle hub206using the bolts207and the bolt nuts210. As illustrated inFIG.10, the inner rim203and the outer rim202are secured to the axle hub206using the lug nuts211. The brake drum205, the inner rim203, and the outer rim202are coaxially secured to the axle hub206by fastening the lug nuts211to the studs208as illustrated inFIG.10.FIG.10shows the lug nuts211fixed to the studs208to prevent the outer rim202and the inner rim203from dislodging from the axle hub206. The axle hub206passes through the central openings205c,203c, and202cof the brake drum205, the inner rim203, and the outer rim202, respectively, while the studs208pass through the lug holes205b,203b, and202bof the brake drum205, the inner rim203, and the outer rim202, respectively, illustrated inFIGS.9A-9B. The bolts207extending from the outer end206aof the axle hub206are inserted into the openings204aof the axle cover204shown inFIGS.9A-9B. The axle cover204is typically attached to the outer end206aof the axle hub206by fastening the bolt nuts210to the bolts207. The wheel lock device800is attached to the axle cover204and in turn to the outer end206aof the axle hub206by unfastening the bolt nuts210from the axle cover204, placing and fitting the wheel lock device800over the axle cover204such that the bolts207pass through the openings103of the wheel lock device800, and fastening the bolts nuts210to the bolts207.", "", "The wheel lock device800is fit over the axle cover204, such that the axle cover204is enclosed within the inner space801edefined by the generally circular plate101aand the generally hollow frustum wall801aof the conical frustum member801, and the openings103of the generally circular plate101aare aligned with the openings204aof the axle cover204. The wheel lock device800, therefore, encloses the axle cover204at the outer end206aof the axle hub206as illustrated inFIG.10. The coaxially disposed openings204aand103of the axle cover204and the generally circular plate101aof the conical frustum member801, respectively, receive the bolts207extending from the outer end206aof the axle hub206. The wheel lock device800is secured to the bolts207using the bolt nuts210. The tapered end801bof the conical frustum member801is tightened firmly to or proximal to the central disc202aof the outer rim202as illustrated inFIG.10.", "", "In an embodiment, the wheel lock device800further comprises a compression material802provided on the tapered end801bof the generally hollow frustum wall801aof the conical frustum member801. The compression material802at the tapered end801bof the generally hollow frustum wall801ais configured to compress against the wheel rim, that is, the outer rim202, and firmly secure the conical frustum member801to the outer rim202. In an embodiment, a layer of clastic material is fastened or glued to the tapered end801bof the generally hollow frustum wall801aof the conical frustum member801. The clastic material is configured to cushion the tapered end801bof the generally hollow frustum wall801awhen the central disc202aor an area proximal to the central disc202aof the outer rim202contacts the tapered end801bof the generally hollow frustum wall801a. In another embodiment (not shown), the tapered end801bof the generally hollow frustum wall801aof the conical frustum member801is disposed a predetermined distance away from the outer rim202. For example, the tapered end801bof the generally hollow frustum wall801aof the conical frustum member801is disposed within an inch of the outer rim202. The conical frustum member801together with the enclosed axle cover204is attached to the outer end206aof the axle hub206by inserting the bolts207extending from the outer end206aof the axle hub206into the openings204aand103of the axle cover204and the generally circular plate101aof the wheel lock device800, respectively, and securing the conical frustum member801to the bolts207by fastening the bolt nuts210to the bolts207as illustrated inFIG.10. On attaching the wheel lock device800to the axle cover204by fastening the bolts nuts210to the bolts207, the fastened bolt nuts210lie flush against the generally circular plate101aof the wheel lock device800. Similar to the wheel lock device100illustrated inFIG.6B, the wheel lock device800together with the enclosed axle cover204bolts onto the outer end206aof the axle hub206with a further tightening of the conical frustum member801to the central disc202aof the outer rim202.", "", "Once installed, the bell-shaped wheel lock device800applies pressure on the outer rim202or in an embodiment, is disposed within an inch of the outer rim202. The bell-shaped wheel lock device800prevents the outer rim202from coming off of the studs208if the lug nuts211are unfastened accidentally and fall off. Due to the types of wheel rims available and the possibility of having two different wheel rims202and203on the same axle hub206, in an embodiment, a shim or an extension ring (not shown) is provided to ensure there is minimal distance between the wheel rims202and203and the wheel lock device800. The shim or the extension ring is made of a hard plastic material, for example, polyethylene or polypropylene. There are different combinations of two wheel rims used in an automobile, for example, (a) two steel rims comprising an inner steel rim and an outer steel rim; (b) an inner steel rim and an outer aluminum rim; and (c) two aluminum rims comprising an inner aluminum rim and an outer aluminum rim. Each steel rim has a thickness of, for example, about 0.5 inch and each aluminum rim has a thickness of, for example, about 1 inch. The total thickness of the two wheel rim ranges, for example, from about 1 inch to about 2 inches. The bell-shaped wheel lock device800illustrated inFIGS.8A-8Fis of a larger size than that of the disc-shaped wheel lock device100illustrated inFIGS.1A-1E, has additional parts, requires more material, requires more machining, and weighs more than the disc-shaped wheel lock device100. The bell-shaped wheel lock device800is applicable for trailers due to the design of a trailer hub versus the design of a truck hub. A truck comprises an axle that connects to each truck hub on one end and connects to a differential in the center. A tractor hub has a larger diameter than that of the truck hub and has, for example, eight ⅜-inch bolts that secure the axle cover204thereon. The trailer hub is smaller in size than the truck hub and the tractor hub and is hollow due to the absence of an axle inside. The smaller trailer hub has, for example, five 5/16-inch bolts to secure a grease cap thereon. The 5/16-inch bolts may not be able to withstand the force of a wheel rim applying pressure thereon. Replacing the five bolts with high grade studs may be sufficient to hold the wheel lock device800thereon and withstand the force. Trailer hubs can be manufactured to have the same dimensions as the truck hubs for fitting the wheel lock device800thereon.", "", "When an automobile is in motion, if the lug nuts211accidentally unfasten, disengage from the studs208, and fall off, the wheel lock device800secures and precludes the outer rim202and/or the inner rim203of the automobile200, from dislodging from the automobile. When the lug nuts211unfasten, the outer rim202and the inner rim203may disengage and separate from each other. Since the outer diameter801gof the wheel lock device800illustrated inFIG.8Eis larger than the central openings202cand203cdefined in the outer rim202and the inner rim203, respectively, illustrated inFIGS.9A-9B, the wheel lock device800restricts and precludes the outer rim202and the inner rim203from dislodging from the automobile, thereby preventing serious accidents.", "", "If the lug nuts211unfasten from the studs208, the wheel lock device800precludes the outer rim202and the inner rim203, and in turn, tires housed thereon, from coming off the axle hub206of the automobile. In this scenario, if the automobile loses power to its rear wheels, the automobile can pull over safely with the rims202and203and in turn, the tires, still attached to the automobile. The wheel lock device800is configured to be attached to any axle having bolts on an outermost part of the axle, for example, bolts207on an axle cover204.", "", "FIGS.11A-11Billustrate a left-side perspective view and a right-side perspective view of another embodiment of the wheel lock device1100, respectively. In this embodiment, the stopper member is configured as a clamp member1103comprising a first clamping element1101and a second clamping element1102configured to surround and enclose the axle cover204illustrated inFIGS.12A-12B. In an embodiment, the first clamping element1101and the second clamping element1102of the clamp member1103are generally hemispherical in shape. The first clamping element1101and the second clamping element1102represent two halves that bolt together using fasteners1106and1107illustrated inFIGS.11C-11F. For example, the first clamping element1101is placed on a first half of an outer circumference of the axle cover204, and the second clamping element1102is placed on a second half of the outer circumference of the axle cover204opposite to the first clamping element1101. In an embodiment, the first clamping element1101comprises arms1104aand1104bextending outwardly from opposing ends1101aand1101bof the first clamping element1101, respectively. Similarly, the second clamping element1102comprises arms1105aand1105bextending outwardly from opposing ends1102aand1102bof the second clamping element1102, respectively. Each of the arms1104a,1104b,1105a, and1105bare, for example, of a rectangular shape. In an embodiment, the arms1104aand1104bof the first clamping element1101are attached to corresponding arms1105aand1105bof the second clamping element1102using the fasteners1106and1107to secure the clamp member1103around the axle cover204and preclude a wheel rim, for example, an outer rim202illustrated inFIGS.12A-12BandFIG.13, from dislodging from an automobile.", "", "The fastener1106comprises a bolt1106a, a locking nut1106c, and washers1106band1106dconfigured to pressure-fit connect the arms1104aand1105aof the first clamping element1101and the second clamping element1102, respectively, as disclosed in the description ofFIG.11C. Similarly, the fastener1107comprises a bolt1107a, a locking nut1107c, and washers1107band1107dconfigured to pressure-fit connect the arms1104band1105bof the first clamping element1101and the second clamping element1102, respectively, as disclosed in the description ofFIG.11C. The fastened first clamping element1101and second clamping element1102of the clamp member1103define a space1108configured to receive and enclose the axle cover204.", "", "FIG.11Cillustrates an exploded, front elevation view of the embodiment of the wheel lock device1100shown inFIG.11A. The arms1104aand1104bof the first clamping element1101comprise openings1104cand1104d, respectively, as illustrated inFIGS.12A-12B. Similarly, the arms1105aand1105bof the second clamping element1102comprise openings1105cand1105d, respectively, as illustrated inFIGS.12A-12B. In an embodiment, the washers1106b,1106dand1107b,1107dof the fasteners1106and1107, respectively, are ring-shaped washers comprising openings1106f,1106eand1107f,1107econfigured to receive the bolts1106aand1107aof the fasteners1106and1107, respectively, as illustrated inFIGS.12A-12B. For example, the washers1106b,1106dand1107b,1107dare nylon rings. The first clamping element1101and the second clamping element1102are configured to face each other for mutually aligning their respective upper arms1104aand1105aand their respective lower arms1104band1105b. Mutual alignment of the upper arms1104aand1105aand the lower arms1104band1105bof the first clamping element1101and the second clamping element1102mutually aligns their respective openings1104c,1105cand1104d,1105d. The openings1106fand1106eof the washers1106band1106d, respectively, are mutually aligned with the openings1104cand1105cof the upper arms1104aand1105a, respectively. The openings1107fand1107eof the washers1107band1107d, respectively, are mutually aligned with the openings1104dand1105dof the lower arms1104band1105b, respectively.", "", "FIG.11Dillustrates an assembled, front elevation view of the embodiment of the wheel lock device1100shown inFIG.11A. The clamp member1103fits around the axle cover204illustrated inFIGS.12A-12B. To fasten the wheel lock device1100around the axle cover204, the first clamping element1101and the second clamping element1102are mutually aligned and fastened by the fasteners1106and1107. That is, the upper arms1104aand1105aof the first clamping element1101and the second clamping element1102, respectively, are connected to each other using the bolt1106a, and the lower arms1104band1105bof the first clamping element1101and the second clamping element1102, respectively, are connected to each other using the bolt1107aas illustrated inFIGS.11A-11B. The bolt1106ais inserted through the opening1106fof the washer1106b, and then into the openings1104cand1105cof the upper arms1104aand1105a, respectively, and then into the opening1106eof the washer1106dand the locking nut1106cillustrated inFIGS.12A-12B. The locking nut1106cfastens the inserted bolt1106aagainst the upper arm1105aof the second clamping element1102via the washer1106das illustrated inFIG.11D. Similarly, the bolt1107ais inserted through the opening1107fof the washer1107b, and then into the openings1104dand1105dof the lower arms1104band1105b, respectively, and then into the opening1107eof the washer1107dand the locking nut1107cillustrated inFIGS.12A-12B. The locking nut1107cfastens the inserted bolt1107aagainst the lower arm1105bof the second clamping element1102via the washer1107das illustrated inFIG.11D.", "", "In an example, the inner diameter1109aof the clamp member1103is about 8.5 inches to about 12 inches; and the outer diameter1109bof the clamp member1103is about 10 inches to about 12.5 inches. In another example, the inner diameter1109aof the clamp member1103is about 3 inches to about 24 inches; and the outer diameter1109bof the clamp member1103is about 8.5 inches to about 25 inches. The thickness of the first clamping element1101, the second clamping element1102, and each of the arms1104a,1104b,1105a, and1105bof the clamp member1103is, for example, about 0.25 inch to about 2 inches. Moreover, the width of the first clamping element1101, the second clamping element1102, and each of the arms1104a,1104b,1105a, and1105bof the clamp member1103is, for example, about 1 inch to about 5 inches. Furthermore, the height of the clamp member1103is, for example, about 4.5 inches to about 27 inches.", "", "FIG.11Eillustrates a left-side elevation view of the wheel lock device1100.FIG.11Fillustrates a cross-sectional view of the wheel lock device1100, taken along a sectional line X-X′ shown inFIG.11E. The cross-sectional view inFIG.11Fshows the connection of the upper arms1104a,1105aand the lower arms1104band1105bby the inserted bolts1106aand1107afastened by the nuts1106cand1107c, respectively.", "", "FIG.12Aillustrates an exploded view of a dual-rim assembly201utilized in the dual-rim automobile200shown inFIG.2, showing the wheel lock device1100configured to enclose an axle cover204and attach to an axle hub206of the dual-rim automobile200. The structure and the assembly of the dual-rim assembly201comprising the outer rim202, the inner rim203, the brake drum205, the axle hub206, and the axle housing209are disclosed in the descriptions ofFIG.2andFIGS.3A-3B. The bolts207extending from the outer end206aof the axle hub206are configured to be inserted into the openings204aof the axle cover204. The two halves of the wheel lock device1100, that is, the first clamping element1101and the second clamping element1102of the clamp member1103, match the circumference of the outermost part, for example, the lip member206b, of the axle hub206. The wheel lock device1100is clamped around the axle cover204and secured by the fasteners1106and1107illustrated inFIGS.11C-11F. The axle cover204surrounded and clamped by the wheel lock device1100is secured to the bolts207of the axle hub206using the bolt nuts210.", "", "Due to varying design of the axle hub206where the clamp member1103is configured to mount, the clamp member1103is configured with multiple clamp sizes determined by axle application. In an example, the clamp size of the clamp member1103is about 9 inches. The arms1104a,1104band1105a,1105bare bent out on the opposing ends1101a,1101band1102a,1102bof the clamping elements1101and1102, respectively, for the bolts1106aand1107ato pass through. A gap is provided between the upper arms1104aand1105aand the lower arms1104band1105bto allow the bolts1106aand1107ato squeeze the two halves, that is, the first clamping element1101and the second clamping element1102, of the clamp member1103together. The locking nuts1106cand1107care provided to preclude one or more of the bolts1106aand1107afrom unfastening the clamp member1103. In an embodiment, the locking nuts1106cand1107care castle nuts with cotter pins. The locking nuts1106cand1107care tightened to an appropriate tension to optimally lock the bolts1106aand1107a, respectively, and preclude the clamp member1103from unfastening. For example, about 90 pound-foot (lb-ft) of torque is used to tighten the locking nuts1106cand1107cto optimally lock the bolts1106aand1107a, respectively, and in turn, secure the clamp member1103about the axle cover204. In an embodiment, the amount of torque, tension, or pressure to be applied to secure the clamp member1103about the axle cover204is determined by circumference of the axle cover204. In another embodiment, fastening devices such as cotter pins, split pins, spring washers, nylon insert lock nuts, etc., or any combination thereof, are used for locking the first clamping element1101and the second clamping element1102of the clamp member1103together and for preventing the bolts1106aand1107afrom loosening.", "", "FIG.12Billustrates an exploded view of the dual-rim assembly201utilized in the dual-rim automobile200shown inFIG.2, showing the wheel lock device1100configured to enclose an embodiment of the axle cover204and attach to the axle hub206of the dual-rim automobile200. In this embodiment, the axle cover204is configured as an axle flange attached to a shaft212as illustrated inFIG.12B. The shaft212extends perpendicularly from the lower surface204bof the axle cover204. In this embodiment, the axle hub206comprises an opening206cconfigured to receive the shaft212. During assembly, the shaft212is inserted through the openings202c,203c,205c, and206cof the outer rim202, the inner rim203, the brake drum205, and the axle hub206, respectively. The wheel lock device1100is clamped around the axle cover204. The axle cover204surrounded and clamped by the wheel lock device1100is secured to the bolts207of the axle hub206using the bolt nuts210.", "", "FIG.13illustrates a cross-sectional, side elevation view of the dual-rim assembly201, showing the wheel lock device1100clamped around the axle cover204shown inFIGS.12A-12B. As illustrated inFIG.13, the inner rim203and the outer rim202are secured to the axle hub206using the lug nuts211. The brake drum205, the inner rim203, and the outer rim202are coaxially secured to the axle hub206by fastening the lug nuts211to the studs208as illustrated inFIG.13.FIG.13shows the lug nuts211fixed to the studs208to prevent the outer rim202and the inner rim203from dislodging from the axle hub206. The axle hub206passes through the central openings205c,203c, and202cof the brake drum205, the inner rim203, and the outer rim202, respectively, while the studs208pass through the lug holes205b,203b, and202bof the brake drum205, the inner rim203, and the outer rim202, respectively, illustrated inFIGS.12A-12B. The bolts207extending from the outer end206aof the axle hub206are inserted into the openings204aof the axle cover204shown inFIGS.12A-12B. The axle cover204is attached to the outer end206aof the axle hub206by fastening the bolt nuts210to the bolts207. The wheel lock device1100is clamped around the attached axle cover204by pressure-fit connecting the upper arms1104aand1105aand the lower arms1104band1105bof the clamp member1103using the fasteners1106and1107, respectively, as disclosed in the descriptions ofFIGS.11A-11D. The wheel lock device1100precludes the wheel rim, that is, the outer rim202, from dislodging from an automobile.", "", "The wheel lock device1100is fit around the axle cover204, such that the axle cover204is tightly enclosed within the space1108defined by the fastened first clamping element1101and the second clamping element1102of the clamp member1103illustrated inFIGS.11A-11B,FIG.11D, andFIG.11F. The wheel lock device1100, therefore, encloses the axle cover204at the outer end206aof the axle hub206as illustrated inFIG.13. The enclosed axle cover204together with the wheel lock device1100is attached to the outer end206aof the axle hub206by inserting the bolts207extending from the outer end206aof the axle hub206into the openings204aof the axle cover204illustrated inFIGS.12A-12B, and securing the axle cover204to the bolts207by fastening the bolt nuts210to the bolts207as illustrated inFIG.13. On attaching the axle cover204to the outer end206aof the axle hub206, the fastened bolt nuts210lie flush against the axle cover204. The upper arms1104aand1105aand the lower arms1104band1105bof the clamp member1103extend outwardly and preclude a wheel rim, for example, an outer rim202illustrated inFIGS.12A-12BandFIG.13, from dislodging from the automobile.", "", "When an automobile is in motion, if the lug nuts211accidentally unfasten, disengage from the studs208, and fall off, the wheel lock device1100secures and precludes the outer rim202and/or the inner rim203of the automobile, from dislodging from the automobile. When the lug nuts211unfasten, the outer rim202and the inner rim203may disengage and separate from each other. Since the diameter1109band height of the wheel lock device1100illustrated inFIG.11Dis larger than the central openings202cand203cdefined in the outer rim202and the inner rim203, respectively, illustrated inFIGS.12A-12B, the wheel lock device1100restricts and precludes the outer rim202and the inner rim203from dislodging from the automobile, thereby preventing serious accidents. Furthermore, the outwardly extending upper arms1104aand1105aand the lower arms1104band1105bof the clamp member1103restrict and preclude the outer rim202and the inner rim203from dislodging from the automobile.", "", "If the lug nuts211unfasten from the studs208, the wheel lock device1100precludes the outer rim202and the inner rim203, and in turn, tires housed thereon, from coming off the axle hub206of the automobile. In this scenario, if the automobile loses power to its rear wheels, the automobile can pull over safely with the rims202and203and in turn, the tires, still attached to the automobile.", "", "In another embodiment (not shown), an axle is configured such that the axle cover has a larger outer diameter than the opening(s)202c/203cof the wheel rim(s)202/203. This method comprises breaking an axle seal and pulling the axle out to remove the wheel rim(s)202/203. In this embodiment, the larger axle cover is configured as the wheel lock device. Any time the wheel(s) needs to come off the automobile for servicing, the axle seal between the axle cover and the axle hub is broken and needs to be re-scaled. In this embodiment, all eight bolts of the axle cover would have to be removed as opposed to pulling four bolts and leaving the axle cover and the axle seal undisturbed.", "", "FIG.14illustrates an embodiment of an electric truck axle hub1400. The electric truck axle hub1400comprises about 5 sets1402of axle hub bolts1402aand1402b. InFIG.14, one of the 5 sets1402of axle hub bolts1402aand1402bis not visible. Each of the sets1402of axle hub bolts1402aand1402bcomprise about 4 bolts each, as shown inFIG.14. Two of the axle hub bolts1402aare located in the middle of each of the sets1402, and two of the axle hub bolts1402bare located on either end of each of the sets1402.", "", "FIG.15illustrates a front elevation view of another embodiment of the wheel lock device1500. The wheel lock device1500comprises a disc member1501configured as a stopper to secure a wheel rim, for example, wheel rim202or a wheel rim (not shown) of an electric truck (not shown) and preclude the wheel rim from dislodging from the electric truck, when fasteners, for example, lug nuts211illustrated inFIGS.3A-3B, that attach the wheel rim to the electric truck are unfastened accidentally. In an embodiment as illustrated inFIG.15, the disc member1501comprises a generally circular plate1501awith a central opening1502. The central opening1502is configured to accommodate an axle cover1401of the electric truck axle hub1400as illustrated inFIG.14. In an embodiment, the central opening1502encircles the axle cover1401of the electric truck axle hub1400.", "", "In an embodiment, the wheel lock device1500shown inFIG.15is configured to be attached to the electric truck axle hub1400shown inFIG.14. The electric truck axle hub1400comprises 5 sets1402of 4 axle hub bolts1402aeach. In an embodiment, 10 of the 20 axle hub bolts1402awould hold the wheel lock device1500in place i.e., attached to the electric truck axle hub1400. For example, the axle hub bolts1402blocated on either end of each of the sets1402are configured to be inserted through openings1503in the wheel lock device1500. The center section1504of the wheel lock device1500directly above or corresponding to axle hub bolts1402aof each set1402of 4 axle hub bolts1402aand1402bis machined out to fit around the axle hub bolts1402awhich are factory fit bolt. This will ensure that the electric truck axle hub1400will not have to be completely loosened up for the installation of the wheel lock device1500. This will also allow the wheel lock device1500to be easily removed when wheels need to be removed. The factory fit (10) ½ inch bolts corresponding to the axle hub bolts1402bwould be replaced with longer high grade bolts to accommodate the thickness of the wheel lock device1500. The bolts for example, axle hub bolts1402band/or1402awould be torqued to 45 pound-foot (lb-ft). The outside diameter of the wheel lock device1500would be the same as the embodiments of the wheel lock device100and/or1100. In an embodiment, about 90 pound-foot (lb-ft) of torque is used to tighten the axle hub bolts1402band/or1402aon a ⅝ nut and or stud on axel. The wheel lock device1500may be available in various disc member1501diameters and various diameters of the central opening1502. Furthermore, the diameters of openings1503may also vary based on the need. The number of openings1503and their location may also vary based on the need.", "", "The foregoing examples and illustrative implementations of various embodiments have been provided merely for explanation and are in no way to be construed as limiting the embodiments disclosed herein. Dimensions of various parts of the wheel lock device100/800/1100disclosed above are exemplary, and are not limiting of the scope of the embodiments herein. While the embodiments have been described with reference to various illustrative implementations, drawings, and techniques, it is understood that the words, which have been used herein, are words of description and illustration, rather than words of limitation. Furthermore, although the embodiments have been described herein with reference to particular means, materials, techniques, and implementations, the embodiments herein are not intended to be limited to the particulars disclosed herein; rather, the embodiments extend to all functionally equivalent structures, methods and uses, such as are within the scope of the appended claims. It will be understood by those skilled in the art, having the benefit of the teachings of this specification, that the embodiments disclosed herein are capable of modifications and other embodiments may be effected and changes may be made thereto, without departing from the scope and spirit of the embodiments disclosed herein."], "claims": ["a disc member configured to enclose an axle cover and together with the axle cover, attach to an axle hub of an automobile, wherein the disc member is configured as a stopper to secure and preclude a wheel rim from dislodging from the automobile, when fasteners that attach the wheel rim to the automobile are unfastened accidentally.", "2 . The wheel lock device of claim 1 , wherein an outer diameter of the disc member is generally larger than a central opening defined in the wheel rim, thereby restricting and precluding the wheel rim from dislodging from the automobile.", "3 . The wheel lock device of claim 1 , wherein the disc member comprises a generally circular plate with a central opening and a generally hollow cylindrical wall, wherein the generally hollow cylindrical wall is configured to extend substantially perpendicularly from an edge of the generally circular plate.", "4 . The wheel lock device of claim 3 , wherein the generally circular plate and the generally hollow cylindrical wall of the disc member define an inner space configured to receive and enclose the axle cover.", "5 . The wheel lock device of claim 1 , wherein the disc member comprises a plurality of openings annularly disposed about a central opening of the disc member, wherein the openings are configured to receive bolts extending from an outer end of the axle hub, and wherein the disc member is secured to the bolts using bolt nuts.", "6 . The wheel lock device of claim 1 , wherein the wheel rim is secured to the axle hub by fastening the fasteners onto studs extending from an inner end of the axle hub, wherein the fasteners comprise lug nuts.", "7 . The wheel lock device of claim 1 , wherein the wheel rim comprises an opening configured to fit over the axle hub.", "8 . The wheel lock device of claim 1 , wherein the axle hub is attached to a brake drum and an axle housing of the automobile.", "9 . The wheel lock device of claim 1 , wherein the wheel rim is one of a single rim utilized in a single-rim automobile and a dual-rim utilized in a dual-rim automobile.", "a stopper member configured to enclose an axle cover and together with the axle cover, attach to an axle hub of an automobile, wherein the stopper member is configured to secure and preclude a wheel rim from dislodging from the automobile, when fasteners that attach the wheel rim to the automobile are unfastened accidentally.", "11 . The wheel lock device of claim 10 , wherein an outer diameter of the stopper member is generally larger than a central opening defined in the wheel rim, thereby restricting and precluding the wheel rim from dislodging from the automobile.", "12 . The wheel lock device of claim 10 , wherein the stopper member is configured as a disc member comprising a generally circular plate with a central opening and a generally hollow cylindrical wall, wherein the generally hollow cylindrical wall is configured to extend substantially perpendicularly from an edge of the generally circular plate.", "13 . The wheel lock device of claim 12 , wherein the generally circular plate and the generally hollow cylindrical wall of the disc member define an inner space configured to receive and enclose the axle cover.", "14 . The wheel lock device of claim 10 , wherein the stopper member is configured as a conical frustum member comprising a generally circular plate with a central opening and a generally hollow frustum wall, wherein the generally hollow frustum wall is configured to extend angularly from an edge of the generally circular plate and terminate at a tapered end of the generally hollow frustum wall.", "15 . The wheel lock device of claim 14 , wherein the tapered end of the generally hollow frustum wall of the conical frustum member comprises an outward edge and an inward edge configured to firmly secure the conical frustum member to the wheel rim.", "16 . The wheel lock device of claim 15 , further comprising a compression material provided on the tapered end of the generally hollow frustum wall of the conical frustum member and configured to compress against the wheel rim and firmly secure the conical frustum member to the wheel rim.", "17 . The wheel lock device of claim 14 , wherein the tapered end of the generally hollow frustum wall of the conical frustum member is disposed a predetermined distance away from the wheel rim.", "18 . The wheel lock device of claim 10 , wherein the stopper member comprises a plurality of openings annularly disposed about a central opening of the stopper member, wherein the openings are configured to receive bolts extending from an outer end of the axle hub.", "19 . The wheel lock device of claim 10 , wherein the stopper member is secured to bolts extending from an outer end of the axle hub using bolt nuts.", "20 . The wheel lock device of claim 10 , wherein the stopper member is configured as a clamp member comprising a first clamping element and a second clamping element configured to surround and enclose the axle cover, wherein the first clamping element and the second clamping element are generally hemispherical in shape, wherein the clamp member further comprises arms extending outwardly from opposing ends of each of the first clamping element and the second clamping element, and wherein the arms of the first clamping element are pressure-fit connected to corresponding arms of the second clamping element using fasteners to secure the clamp member around the axle cover and preclude the wheel rim from dislodging from the automobile."], "bibtex": "@patent{20240359502,\n    title = {WHEEL LOCK DEVICE FOR AUTOMOBILES},\n    number = {20240359502},\n    year = {2024},\n    note = {File: US20240359502A1-20241031.XML}\n    }", "classification": "B60B316FI"}, {"title": "Wheel with Deformable Interfacing Spokes", "doc_number": "20240359503", "filename": "US20240359503A1-20241031.XML", "abstract": "A wheel that deforms to absorb force is provided. The wheel includes one or more deformable spokes that extend from a central portion of the wheel to an outer portion of the wheel. The spokes are configured to interface against neighboring spokes after a spoke is sufficiently deformed. The neighboring spoke provides some support to the deformed spoke, thereby requiring an increased marginal force to further deform the first spoke. In one embodiment the wheel includes a plurality of pairs of spokes that are configured to interface against each other.", "detailed_description": ["Referring generally to the figures, various embodiments of a wheel are shown, such as may be used with a mobile modular storage system, a mobile tool storage system, a mobile worksite device or machine (e.g., a generator, a compressor, etc.), a hand truck or dolly, etc. In some prior wheel designs when the wheel was deformed for a long period of time under a large amount of weight (e.g., hundreds of pounds), the wheel may remain at least partially deformed even after the weight is removed.", "", "Various embodiments of the wheel described herein utilize elastically deformable spokes that extend from a central portion of the wheel to an outer portion of the wheel. The deformable spokes absorb at least some of the force when the wheel is rolled across uneven surfaces (e.g., over rocks, curbs, etc.) and/or when the wheel is subject to a large amount of weight (e.g., hundreds of pounds). In one embodiment, as a first spoke deforms the first spoke bends towards a neighboring second spoke. When the first spoke is sufficiently deformed to interface with the second spoke, the second spoke physically supports the first spoke thereby requiring an increased amount of force to continue to deform the first spoke even further. Thus, the wheel has a first spring constant for deforming when the first amount of force applied and has a greater spring constant for deforming after the first spoke has been deformed to interface against the second spoke. In this way, the wheel has a progressive and increasing stiffness that is dependent on the amount of weight born by the center hub. Further, because the deformation under both sets of loading are within the elastic range of the spoke design, the wheel returns to unloaded shape (e.g., with the wheel defining a generally circular outer perimeter once the load is removed).", "", "Referring toFIG.1, various aspects of a wheel, shown as compliant wheel10, are shown. In specific embodiments, wheel10is utilized in combination with an airless tire. In specific embodiments, wheel10is a deformable wheel. Wheel10is utilized to facilitate transporting other objects, such as a modular storage system shown in International Patent Application No. PCT/US2018/044629, which is incorporated herein by reference in its entirety. In another specific embodiment, a storage device that utilizes a wheel10described herein has coupling interfaces on both the top and bottom that permit the storage device to couple to a modular storage unit via an interface compatible with the coupling mechanism(s) described in International Patent Application No. PCT/US2018/044629, which is incorporated herein by reference in its entirety.", "", "As shown inFIG.1, wheel10includes a hub, shown as central hub14, that defines a channel16, and a rim, shown as outer rim20, located further from the rotational axis12than central hub14. When assembled, an axle is inserted into channel16, permitting wheel10to rotate around rotational axis12with respect to the axle. When wheel10is rotated around rotational axis12, central hub14and outer rim20also rotate about rotational axis12.", "", "Spokes30extend from central hub14to outer rim20. In a specific embodiment, spokes30are rigidly coupled to outer surface18of central hub14and to inner surface24of outer rim20. As wheel10is utilized and absorbs forces spokes30are deformed. Spokes30thus provide both the function of facilitating movement via rotating around axis12and providing a force-absorbing functionality similar to a shock absorber. It is considered that spokes30may deform for forces that are transitory, such as when wheel10goes over an uneven surface, or permanent forces, such as when wheel10is supporting a weight for a period of time. In specific embodiments, because the deformation of the spokes remains within the elastic range of the spokes, the spokes return to their original position/shape once the load is removed.", "", "In a specific embodiment, central hub14, spokes30and outer rim20are made of the same first material. In a specific embodiment, the first material may have a modulus of elasticity in a given range between 1500 and 2500 MPa. In some embodiments, a second material (e.g., rubber) may be adhered to outer surface22of outer rim20, thus providing an improved grip for wheel10against other surfaces (e.g., the ground).", "", "Turning toFIGS.2and3, spokes30are arranged in a plurality of spoke sets32. In the embodiment shown inFIG.2, there are five sets32of spokes30, with each set32including two spokes30. Spokes30within a set32are symmetrical with respect to a radius extending from axis12. In a specific embodiment, each set32includes a first spoke38and a second spoke42. In a specific embodiment, each of the first spokes38are located circumferentially between two second spokes42. In a specific embodiment, each of the second spokes42are located circumferentially between two first spokes38. In a specific embodiment, each set of spokes includes three spokes30, includes first spoke38, second spoke42, and third spoke43. As will be described in more detail below, when wheel10absorbs a force, one or more of spokes30within a particular set32deform towards the other spoke30. When sufficient force is applied to wheel10, one or more of spokes30within a set32deforms towards and ultimately interfaces against the other spoke30within the respective set32. As will be discussed in more detail below, once spokes30within a set32interface with each other, further deformation requires additional load, and thus in this manner, wheel10is designed to have a rigidity that increases as the load on the wheel increases.", "", "Turning toFIGS.3and4, outer ends36of spokes30are each coupled to outer rim20, and inner ends34of spokes30are each coupled to central hub14. Spokes30within a particular set32define a distance74, measured in radians with respect to axis12, between the outer ends36of adjacent spokes30, and distance84, measured in radians with respect to axis12, between outer ends36of the spokes30of adjacent sets32with respect to axis12. In a specific embodiment, distance84is measured between outer section36of second spoke42and outer section36of third spoke43when the wheel is not deformed. A distance83is measured between inner section34of second spoke42and inner section34of third spoke43. As shown inFIG.3, distance83is less than distance84. Turning toFIG.4in particular, within a particular set32of spokes30, spokes30define distance74, measured in radians with respect to axis12, at outer end36, spokes30define distance70, measured in radians with respect to axis12, at inner end34, and spokes30define distance72, measured in radians with respect to axis12at a middle of spokes30. In a specific embodiment, distance72is defined as the smallest distance between spokes30with respect to axis12. In a specific embodiment, the smallest distance between first spoke38and second spoke42as measured in radians with respect to the rotational axis12is between middle section52of first spoke38and middle section52of the second spoke42when the wheel10is not deformed. In a specific embodiment, distance83is less than distance70.", "", "Spokes30extend a radial distance78from inner end34to outer end36. Because of the curvature of spokes30, spokes30have an actual length76that is greater than radial distance78.", "", "Turning toFIG.5, a particular set32of spokes30includes first spoke38and opposing second spoke42. In a specific embodiment, each set32includes a first spoke38and opposing second spoke42. In a specific embodiment, wheel10includes a plurality of first spokes38extending from central hub14to outer rim20and a plurality of second spokes42extending from central hub14to outer rim20. In the embodiment shown inFIG.5, first spoke38and second spoke42are shaped to be mirror images of each other (e.g., symmetric) about a radius39equidistant between both spokes38,42. As will be described in more detail below, when wheel10absorbs enough force then one of first spoke38and second spoke42is deformed towards the other spoke. When first spoke38and/or second spoke42is sufficiently deformed, inner surface40of first spoke38interfaces against inner surface44of second spoke42, thus such that spokes support each other so that an even greater amount of force is required to further deform spoke.", "", "Turning toFIG.6, in a specific embodiment, spokes30include a series of curves and inflection points. In a specific embodiment, each spoke30includes an inner section46extending from the central hub14, an outer section58extending from the outer rim20, and a central section52extending between inner section46and outer section58.", "", "In a specific embodiment, central hub14and outer rim20are separated by radial distance78. In a specific embodiment, inner section46extends from central hub14and has a length between 5% and 50% of radial distance78or actual length76, and more specifically between 5% and 25%, and more specifically between 10% and 15%. In a specific embodiment, middle section52extends between 25% and 80% of radial distance78or actual length76, and more specifically between 30% and 70%, and more specifically between 35% and 55%. In a specific embodiment, outer section58extends from outer rim20and has a length between 5% and 25% of radial distance78or actual length76.", "", "Inner section46of spoke30is radius48from center50, middle section52is radius54from center56, and outer section58is radius60from center62. Center50and center62are on first side64of spoke30, and center56is on second side66of spoke30. Inner inflection section51is the transition from inner section46to middle section52, and outer inflection section57is the transition from middle section52to outer section58. In a specific embodiment, middle section52of first spoke38and the middle section52of second spoke42are convex with respect to each other when wheel10is not deformed. In a specific embodiment, inner section46of first spoke38and the inner section46of second spoke42are concave with respect to each other when wheel10is not deformed. In a specific embodiment, outer section58of first spoke38and the outer section58of second spoke42are concave with respect to each other when wheel10is not deformed.", "", "Turning toFIG.7, shown are various aspects of wheel10when deformed by force90, according to an exemplary embodiment. As shown, inner surface40of first spoke38deforms towards inner surface44of second spoke42. During loading of the wheel10sufficient to cause deformation of wheel10, one of the first spokes38engages against one of the second spokes42when the wheel10is deformed a first amount such that the engagement resists further deformation of the wheel10. When first spoke38is sufficiently deformed and first spoke38interfaces against second spoke42, first spoke38is structurally supported by second spoke42such that the first spoke38and the second spoke42bias each other from being deformed further when first spoke38and second spoke42are interfacing against each other. As a result, the interface between first spoke38and second spoke42biases wheel10from further deformation because further deformation of first spoke38requires that second spoke42also be deformed, and thus occurs when force90is substantially increased. When force90is removed spokes30return to their original shape.", "", "Stated another way, to be further deformed, before first spoke38is interfacing against second spoke42then first spoke38requires a first amount of additional force to force90of X to deform further. After first spoke38is interfacing against second spoke42, first spoke requires a second amount of additional force to force90of Y to deform further, wherein Y is greater than X because both first spoke38and second spoke42are being deformed.", "", "In a specific embodiment, wheel10has diameter80of 9 inches and width82of 2.5 inches. In a specific embodiment, wheel10includes a different number of sets32of spokes30, such as seven sets32of spokes30or eight sets32of spokes30.", "", "Referring toFIGS.8-9, various aspects of a wheel, shown as compliant wheel110, are shown according to an exemplary embodiment. Wheel110is similar to wheel10except for the differences described herein. Wheel110includes a plurality of ribs192that extend between inner wall196of outer portion120and outer wall198of outer portion120. In a specific embodiment, ribs192extend radially with respect to rotational axis112of wheel110, and are spaced angle194apart from each other with respect to axis112. In a specific embodiment, ribs192are positioned symmetrically with respect to each other around wheel110with respect to axis112.", "", "Spokes130have a thickness (e.g., area of the cross-section) that varies along their length in the radial direction with respect to the rotational axis. In a specific embodiment, spokes130are thinner (e.g., a smaller cross-section area177) at central portion187as compared to cross-sectional area176of inner portion186, which is closer to axis112than central portion187. Spokes130are also thinner (e.g., a smaller cross-section area177) at central portion187as compared to cross-sectional area178of outer portion188, which is further from axis112than central portion187.FIG.9depicts a comparison of the sizes of cross-section area176,177, and178overlaid on top of each other according to an exemplary embodiment.", "", "This varying thickness (e.g., cross-section) of spokes130causes spokes130to primarily bend at central portion187when wheel110is deformed. As a result, when spokes130deform the central portions187of neighboring spokes130interface with each other before inner portions186or outer portions188interface with each other.", "", "In a specific embodiment, a support structure (e.g., such as ribs192extending inwardly from inner wall196) can be added in area189to support spokes130.", "", "The stiffness of wheel110depends on several factors, including for example the modulus of elasticity of the material that the wheel110and/or spokes130are formed from, the geometry of the wheel110(e.g., the length, the thickness, and/or the number of ribs192), and the spacing of spokes130. For example, additional ribs192can be added to wheel110to increase an amount of force necessary to deform wheel110.", "", "It should be understood that the figures illustrate the exemplary embodiments in detail, and it should be understood that the present application is not limited to the details or methodology set forth in the description or illustrated in the figures. It should also be understood that the terminology is for description purposes only and should not be regarded as limiting.", "", "Further modifications and alternative embodiments of various aspects of the disclosure will be apparent to those skilled in the art in view of this description. Accordingly, this description is to be construed as illustrative only. The construction and arrangements, shown in the various exemplary embodiments, are illustrative only. Although only a few embodiments have been described in detail in this disclosure, many modifications are possible (e.g., variations in sizes, dimensions, structures, shapes and proportions of the various elements, values of parameters, mounting arrangements, use of materials, colors, orientations, etc.) without materially departing from the novel teachings and advantages of the subject matter described herein. Some elements shown as integrally formed may be constructed of multiple parts or elements, the position of elements may be reversed or otherwise varied, and the nature or number of discrete elements or positions may be altered or varied. The order or sequence of any process, logical algorithm, or method steps may be varied or re-sequenced according to alternative embodiments. Other substitutions, modifications, changes and omissions may also be made in the design, operating conditions and arrangement of the various exemplary embodiments without departing from the scope of the present disclosure.", "", "Unless otherwise expressly stated, it is in no way intended that any method set forth herein be construed as requiring that its steps be performed in a specific order. Accordingly, where a method claim does not actually recite an order to be followed by its steps or it is not otherwise specifically stated in the claims or descriptions that the steps are to be limited to a specific order, it is in no way intended that any particular order be inferred. In addition, as used herein, the article “a” is intended to include one or more component or element, and is not intended to be construed as meaning only one. As used herein, “rigidly coupled” refers to two components being coupled in a manner such that the components move together in a fixed positional relationship when acted upon by a force.", "", "Various embodiments of the disclosure relate to any combination of any of the features, and any such combination of features may be claimed in this or future applications. Any of the features, elements or components of any of the exemplary embodiments discussed above may be utilized alone or in combination with any of the features, elements or components of any of the other embodiments discussed above."], "claims": ["a rotational axis; a hub configured to rotate with respect to rotational axis; a rim configured to rotate with respect to rotational axis, the rim positioned radially further from the rotational axis than the hub; a first spoke extending between the hub and the rim; a second spoke extending between the hub and the rim, the second spoke comprising: an inner section extending from the hub; an outer section extending from the rim; and a middle section extending between the inner section and the outer section; a third spoke extending between the hub and the rim, the third spoke comprising: an inner section extending from the hub; an outer section extending from the rim; and a middle section extending between the inner section and the outer section, wherein the middle section of the third spoke and the middle section of the second spoke are concave with respect to each other when the wheel is not deformed; a first distance defined between a first portion of the inner section of the second spoke coupled to the hub and a second portion of the inner section of the third spoke coupled to the hub; and a second distance extending between a third portion of the outer section of the second spoke coupled to the rim and a fourth portion of the outer section of the third spoke coupled to the rim; wherein the first distance is less than the second distance; and wherein during loading of the wheel sufficient to cause deformation of the wheel, the first spoke engages against the second spoke when the wheel is deformed a first amount such that the engagement resists further deformation of the wheel.", "2 . The wheel of claim 1 , wherein the first spoke and the second spoke bias each other from being deformed further when the first spoke and second spoke interface against each other.", "3 . The wheel of claim 2 , wherein the interface between the first spoke and the second spoke biases the wheel to resist further deformation.", "4 . The wheel of claim 1 , wherein the first spoke comprises an inner section extending from the hub with a fifth portion of the inner section of the first spoke coupled to the hub, an outer section extending from the rim with a sixth portion of the outer section of the first spoke coupled to the rim, and a middle section extending between the inner section and the outer section, wherein the middle section of the first spoke and the middle section of the second spoke are convex with respect to each other, when the wheel is not deformed.", "5 . The wheel of claim 4 , further comprising a third distance defined between the first portion of the inner section of the second spoke and the fifth portion of the inner section of the first spoke, wherein the first distance is less than the third distance.", "6 . The wheel of claim 5 , further comprising a fourth distance defined between the third portion of the outer section of the second spoke and the sixth portion of the outer section of the first spoke, wherein the third distance is less than the fourth distance.", "7 . The wheel of claim 6 , wherein the second distance is less than the fourth distance.", "8 . The wheel of claim 1 , wherein the second spoke is positioned between the first spoke and the third spoke.", "a rotational axis; a hub configured to rotated around rotational axis; a rim configured to rotated around rotational axis and positioned further from the rotational axis than the hub; a first set of spokes, comprising: a first spoke extending between the hub and the rim, the first spoke comprising an inner section extending from the hub, an outer section extending from the rim, and a middle section extending between the inner section and the outer section; and a second spoke extending between the hub and the rim, the second spoke comprising an inner section extending from the hub, an outer section extending from the rim, and a middle section extending between the inner section and the outer section, wherein the middle section of the first spoke and the middle section of the second spoke are convex with respect to each other when the wheel is not deformed; and a second set of spokes adjacent to the first set of spokes, the second set of spokes, comprising: a third spoke extending between the hub and the rim, the third spoke comprising an inner section extending from the hub, an outer section extending from the rim, and a middle section extending between the inner section and the outer section; and a fourth spoke extending between the hub and the rim, the fourth spoke comprising an inner section extending from the hub, an outer section extending from the rim, and a middle section extending between the inner section and the outer section, wherein the middle section of the third spoke and the middle section of the fourth spoke are convex with respect to each other when the wheel is not deformed; a first distance between the inner section of the second spoke and the inner section of the third spoke when the wheel is not deformed; and a second distance between the outer section of the second spoke and the outer section of the third spoke when the wheel is not deformed, wherein the second distance is greater than the first distance.", "10 . The wheel of claim 9 , wherein the middle section of the second spoke and the middle section of the third spoke are concave with respect to each other when the wheel is not deformed.", "11 . The wheel of claim 9 , wherein during loading of the wheel sufficient to cause deformation of the wheel, the first spoke engages the second spoke when the wheel is deformed a first amount such that the engagement resists further deformation of the wheel.", "12 . The wheel of claim 9 , wherein the outer section of the second spoke and the outer section of the third spoke are convex with respect to each other, when the wheel is not deformed.", "13 . The wheel of claim 9 , wherein the inner section of the first spoke and the inner section of the second spoke are concave with respect to each other, when the wheel is not deformed.", "14 . The wheel of claim 13 , wherein the outer section of the first spoke and the outer section of the second spoke are concave with respect to each other, when the wheel is not deformed.", "15 . The wheel of claim 9 , wherein the middle section of the first spoke extends between 25% and 80% of a length of the first spoke from the hub to the rim.", "16 . The wheel of claim 9 , wherein the first spoke comprises a thickness that varies along a length of the first spoke in a radial direction with respect to the rotational axis.", "a rotational axis; a hub configured to rotate with respect to the rotational axis; a rim configured to rotate with respect to the rotational axis, the rim positioned radially further from the rotational axis than the hub; a first spoke extending between the hub and the rim, the first spoke comprising: a middle section; an inner section extending from the hub to the middle section; and an outer section extending from the rim to the middle section; a second spoke extending between the hub and the rim the first spoke comprising: a middle section; an inner section extending from the hub to the middle section; and an outer section extending from the rim to the middle section; a third spoke extending between the hub and the rim the first spoke comprising: a middle section; an inner section extending from the hub to the middle section; and an outer section extending from the rim to the middle section; wherein the second spoke is positioned between the first spoke and the third spoke; wherein a smallest distance between the second spoke and the third spoke as measured in radians with respect to the rotational axis is between the inner section of the second spoke and the inner section of the third spoke; wherein the smallest distance between the second spoke and the third spoke is less than a first distance measured between the outer section of the second spoke and the outer section of the third spoke when the wheel is not deformed; wherein the smallest distance between the second spoke and the third spoke is less than a second distance measured between the inner section of the first spoke and the inner section of the second spoke when the wheel is not deformed; and wherein during loading of the wheel sufficient to cause deformation of the wheel, the first spoke engages the second spoke when the wheel is deformed a first amount such that the engagement resists further deformation of the wheel.", "18 . The wheel of claim 17 , wherein the middle section of the first spoke and the middle section of the second spoke are convex with respect to each other, when the wheel is not deformed.", "19 . The wheel of claim 18 , wherein the middle section of the second spoke and the middle section of the third spoke are concave with respect to each other, when the wheel is not deformed.", "20 . The wheel of claim 17 , wherein a smallest distance between the first spoke and the second spoke as measured in radians with respect to the rotational axis is between the middle section of the first spoke and the middle section of the second spoke, when the wheel is not deformed."], "bibtex": "@patent{20240359503,\n    title = {Wheel with Deformable Interfacing Spokes},\n    number = {20240359503},\n    year = {2024},\n    note = {File: US20240359503A1-20241031.XML}\n    }", "classification": "B60B926FI"}, {"title": "HUB-BEARING ASSEMBLY FOR A WHEEL OF A MOTOR VEHICLE", "doc_number": "20240359504", "filename": "US20240359504A1-20241031.XML", "abstract": "A hub-bearing assembly includes a stationary radially outer ring, a flanged hub extending into an interior of the radially outer ring and configured to rotate relative to the radially outer ring, and a radially inner ring mounted on the flanged hub and axially abutting a portion of the flanged hub. A toothed sleeve is mounted to the hub axially inward of and adjacent to the radially inner ring and is rotationally fixed relative to the flanged hub. An auxiliary ring is mounted on the flanged hub in contact with the toothed sleeve. The flanged hub includes an axially inner rolled edge in contact with the auxiliary ring and configured to maintain a preload on the radially inner ring, and the auxiliary ring is configured to accommodate deformations induced by the formation of the rolled edge.", "detailed_description": ["By way of non-limiting example, the present disclosure is described below with reference to a hub-bearing assembly for motor vehicles provided with a bearing unit.", "", "With reference toFIG.1, a hub-bearing assembly according to a preferred embodiment of the disclosure is denoted as a whole using reference sign10. The figure shows a detail of an example arrangement.", "", "When in use, the hub-bearing assembly10is interposed between a wheel and a frame, both of which are known and not illustrated, of a vehicle, and may be selectively coupled to a constant velocity joint, which is known and not illustrated, via a transmission device, which is also known and not illustrated, to transmit or otherwise the drive torque to the respective wheel (not illustrated).", "", "The hub-bearing assembly comprises a rotary flanged hub20and a bearing unit30having a central axis of rotation X, a stationary radially outer ring31, and a radially inner ring. The radially inner ring is defined by a portion20aof the flanged hub20and a further radially inner ring34mounted on and rigidly connected to the flanged hub20, both of the radially inner rings20a,34being rotatable with respect to the radially outer ring31as a result of the interposition of two rows of rolling bodies32,33, in this case balls between the inner and outer rings.", "", "Throughout the present description and in the claims, terms and expressions indicating positions and orientations, such as “radial” and “axial”, are to be understood with reference to the central axis of rotation X of the bearing unit30. On the other hand, expressions such as “axially outer” and “axially inner” refer to the mounted state of the hub-bearing assembly, and in this case preferably refer to a wheel side and to a side opposite the wheel side respectively.", "", "To simplify the graphical representation, reference signs32,33are used to denote both individual balls and rows of balls. Again for the sake of simplicity, the term “ball” shall be used by way of example in the present description and in the attached drawing instead of the more generic term “rolling body” (and the same reference signs shall be used).", "", "The flanged hub20has a central through-hole21that extends along the axis X that is configured to be engaged by the constant velocity joint and comprises, on an axially outer side thereof, a flange25for fastening the hub-bearing assembly10to a wheel of a vehicle, and, on an axially inner side thereof, a rolled edge24(obtained, e.g., by orbital roll forming) that is designed to axially preload both the inner ring34and a toothed sleeve55against a radially outer shoulder22of the flanged hub20. The toothed sleeve55, which is mounted close to the inner ring34, is coupled to a toothed profile23of the flanged hub20.", "", "Bearings are required between the hub and the constant velocity joint to enable the flanged hub20to rotate independently of the constant velocity joint when the flanged hub20is disengaged from the constant velocity joint. In the present embodiment, the flanged hub20has a first radially inner shoulder26and a second radially inner shoulder27formed inside the central through-hole21, close to which are mounted at least two sets of radial ball bearings59,60(exactly two sets in the configuration illustrated inFIG.1). The two sets of radial ball bearings59,60are mounted in a radially inner position with respect to the flanged hub20. In particular, the first radial ball bearings59are mounted in an axially outer position against the first shoulder26and the second radial ball bearings60are mounted in an axially inner position against the second shoulder27. There may also be an additional set of radial ball bearing in the axially inner position.", "", "According to the present disclosure and also with reference toFIG.2, a ring50of rectangular section, sometimes referred to as an “auxiliary ring,” is provided between the rolled edge24of the flanged hub20and the toothed sleeve55. Therefore, according to the disclosure, the rolled edge24of the flanged hub20axially preloads and blocks three axially adjacent components against the shoulder22of the flanged hub20, namely, the radially inner ring34, the toothed sleeve55and the ring50.", "", "The ring50, which has a solid rectangular section, supports the material of the rolled edge24. Indeed, whereas in the prior art the material of the rolled edge is deformed and pushed against the discontinuous surface of the toothed sleeve, according to the present disclosure the material of the rolled edge24is pressed against an axially inner annular surface50aof the ring50, the annular surface resulting from the fact that the ring50has a rectangular section, and not for example a circular section. The annular surface50ais a solid surface and is continuous for 360°, i.e. it has no gaps. Consequently, the ring50of rectangular section is able to absorb the deformations induced by the orbital roll forming process without these deformations being transferred to the toothed sleeve55.", "", "Advantageously and more specifically, the ring50includes the axially inner annular surface50a, a radially inner cylindrical surface51, and an axially inner, radially inner curvilinear surface50bthat has a radius of curvature R and that is located between the annular surface50aand to the cylindrical surface51.", "", "Advantageously, the connection radius R is selected so that an axially outer, radially outer profile24′ of the plastically deformed rolled edge24can be fitted to the radially inner, axially inner profile of the ring50formed by the annular surface50aand the cylindrical surface50b. Indeed, the material of the rolled edge24is deformed and pressed against the annular surface50aand the curvilinear surface50b, both of which are continuous and have no gaps around the full 360° of the circumference. The combination of the two surfaces50a,50bprovides a broad support area for the material of the rolled edge24, and therefore reduces a concentration of stresses on the rolled edge24of the flanged hub20as compared to the stresses that would occur without the use of the ring50.", "", "The ring50is accommodated in a seat (recess)56of the toothed sleeve55, the seat56comprising a radially inner cylindrical surface56aand an axially inner annular surface56bthat blocks axial movement of the ring50.", "", "The fit between the cylindrical surface56aof the toothed sleeve55and a radially outer cylindrical surface52of the ring50is preferably a clearance fit. This clearance fit enables the ring50, after being pressed axially by the orbital roll forming process, to freely expand radially without the radial expansion being transferred to the toothed sleeve55. This prevents the external toothed profile57of the toothed sleeve55from expanding radially, thereby avoiding potential coupling problems between the toothed sleeve and the ring gear of the disconnection system during operation.", "", "Advantageously, the coupling between the ring50and the flanged hub20, in particular between the radially inner cylindrical surface51of the ring50and a radially outer cylindrical surface20′ of the flanged hub20, may be a coupling with slight interference (on the borderline, or even with minimum clearance) on the basis of the actual dimensions of the two components according to the respective specified tolerances. Preferably, the coupling may vary between a diametric clearance of 0.01 mm to an interference of 0.05 mm (in all cases relative to the diameters of the two coupling surfaces). Indeed, greater interference would excessively deform the ring50and, in particular, would increase the external diameter thereof with a consequent impact on the coupling between the cylindrical surface56aof the toothed sleeve55and the cylindrical surface52of the ring50, for which adequate clearance is required, as mentioned above. Furthermore, low interference values require low press-fitting forces and consequently simplify assembly, while guaranteeing that the components are centered and that the stresses caused by press-fitting both on the ring50and on the neighboring areas of the flanged hub20are reduced.", "", "Advantageously, the profile of the rolled edge24remains absolutely unchanged from rolled edges formed on conventional wheel hubs. In particular, the diameter of the cylindrical surface20′ on which lies the bending point F from which the rolled edge24bends radially outwards remains unchanged. This feature enables the internal geometry of the flanged hub20to remain unchanged, and does not reduce the diameter of the central hole21on which the shoulders26,27are formed for the radial ball bearings59,60. Consequently, the disclosed arrangement does not adversely affect the structural strength of the flanged hub20or the available internal radial space. Consequently, the size of the radial ball bearings also remains unchanged.", "", "With reference toFIG.3, the axial stop for the second radial ball bearing60is advantageously formed by a spacer70located radially inside the flanged hub20and axially outside the radial ball bearing60. The spacer70is in turn axially blocked against the second axial shoulder27of the flanged hub20.", "", "More specifically, the two radial bearings59,60and the spacer70can be pressed by a ring (known and not illustrated) against the shoulders26,27, thereby exerting axial compression forces through the outer rings of the bearings59,60and the spacer70onto the flanged hub20that, in response to the stresses transmitted by the wheel, generate reactive forces on the shoulders26,27and in particular on the axially inner second shoulder27, since it is located in the part of the flanged hub20with a radial section SR of reduced thickness. Indeed, this radial section SR coincides with a radially outer relief groove29of the flanged hub20that is required to machine the toothed coupling profile23between the flanged hub20and the toothed sleeve52, and therefore necessarily has a reduced thickness.", "", "The presence of the spacer70helps to improve the performance under stress of the geometry of the flanged hub20. Indeed, to enable grinding operations to be carried out on the radially inner seat28of the flanged hub20, which accommodates the second radial ball bearing60and the spacer70, a relief groove80has to be defined between the seat28and the second axial shoulder27of the flanged hub20. The relief groove80is therefore axially outside the seat28and radially inside the entire flanged hub20. The presence of the spacer70enables the relief groove80to be positioned sufficiently far away from the radial section SR of reduced thickness of the flanged hub20(a more critical section in terms of stress). This enables the relief groove80to be designed with greater freedom, for example with a sufficiently large radius R, but primarily does not concentrate stresses in the vicinity of the narrow section SR of the flanged hub20.", "", "Consequently, the inclusion of the spacer70, which is used as an axial shoulder for the axially inner radial ball bearing60, is primarily intended to enable the provision of a radially inner relief groove80that is different in shape and position compared to the relief groove that would be possible to provide without the spacer70.", "", "This resolves several structural criticalities. Indeed, if there were no spacer, the radially inner relief groove would coincide (be aligned) with the radial ball bearing60and would therefore be in a position axially “facing” the radially outer relief groove29. Furthermore, if the radially inner relief groove coincides with the radial ball bearing, the shape therefore would be conditioned by the geometry of the radial ball bearing, with very limited axial length and radius (for example, axial length in the order of 2 mm and radius in the order of 0.8 mm). All of this creates a very reduced narrow section SR of the flanged hub, and a notch effect caused by the presence of the radially inner relief groove.", "", "The flanged hub is subjected to high bending loads in this zone, which generate high stresses that have an adverse effect on the service life of the flanged hub itself.", "", "Conversely, the inclusion of the spacer70provides numerous advantages. For one, the radially inner relief groove80is provided in a more axially outer position, which is therefore further away from the radially outer relief groove29and the narrow section SR. In addition, the geometry of the relief valve80is characterized by larger radii and a greater overall length, with a consequent reduction in the notch effect. When required by the application, it is also possible to include an axially inner second radial ball bearing beside the first ball bearing without modifying the flanged hub but by merely reducing the axial dimension of the spacer70. The second radial ball bearing may be useful where one ball bearing is not enough to withstand the stresses coming from the constant velocity joint.", "", "With reference toFIG.4, one key geometric parameter for optimizing the relief groove80and eliminating the structural problems of the flanged hub is the geometry of the groove itself. The radius R of the relief groove80should preferably be between 1.8 mm and 2.2 mm, while the axial length L can preferably vary between 3.8 mm and 4.2 mm. A second geometric parameter is the axial position of the relief groove80. The limit positions, both on the axially inner side and the axially outer side, can advantageously be identified to avoid structural criticalities. In particular, the axially inner limit position of the relief groove80could coincide with the projection on the axis X of rotation of the pressure center C between the rolling bodies33and the raceway34′ of the radially inner ring34, since the forces coming from the external loads are mainly discharged in this zone.", "", "Furthermore, the axially outer limit position of the relief groove80could be defined at a distance D of between 2.4 mm and 2.6 mm in an axially inward direction with respect to the shoulder22of the flanged hub20that forms the stop of the radially inner ring34on the flanged hub20. This prevents the relief groove80from being aligned with the shoulder22and with the adjacent connection22bof the flanged hub20, so as not to generate increased stress at the radius RA of the connection22b, as deduced from the results of the structural analyses carried out.", "", "Consequently, the axial position of the relief groove80is inside the stretch RP defined by the two limit positions mentioned above and indicated by the double arrow inFIG.3.", "", "In short, the adoption of the ring50between the rolled edge24of the flanged hub20and the toothed sleeve55provides the a plurality of advantages. These include the rolled material being deformed and pressed against a continuous surface with no gaps (about the full 360° of the circumference). This prevents discontinuities in the material that could cause a concentration of stresses and potential starting points for cracks on the rolled edge24, in particular in the vicinity of the bending point F from which the rolled edge24bends radially outwards. In addition, no deformations are induced on the radially inner ring34that could alter the raceway34′ thereof and/or modify the osculation thereof. Such deformations may also increase the fatigue stresses between the rolling bodies and the raceway and reduce the service life of the hub-bearing assembly. Also, as a result of the clearance fit between the ring50and the toothed sleeve55, no radial expansion is induced in the external toothed profile57of the toothed sleeve55, thereby avoiding any malfunction (failed or difficult coupling) between the toothed sleeve and the ring gear of the disconnection system during operation. Finally, there is a substantial reduction in stresses and consequently deformations of the seat of the axially inner radial ball bearing of the flanged hub.", "", "The use of the spacer70together with the ring50provides further advantages. These include a greater robustness of the flanged hub20in the zone between the shoulder27and the rolled edge24, i.e. in the most structurally stressed zone, improving the capacity thereof to withstand loads. Also, the zone of the relief groove does not require local thermal treatment, which has a positive impact on the process and resulting costs. Furthermore, the solution is flexible in that the length of the spacer can be modified to enable two axially inner radial ball bearings to be inserted without modifying the design of the flanged hub. Indeed, the decision to use one or two axially inner radial ball bearings (naturally in addition to the axially outer radial ball bearing) can be taken at any stage of development without resulting in design modifications to the flanged hub.", "", "In addition to the embodiment of the disclosure as described above, it is to be understood that there are numerous other variants. It is also to be understood that the embodiments are solely exemplary and do not limit the scope of the disclosure, its applications, or its possible configurations. Indeed, although the above description enables the person skilled in the art to carry out the present disclosure according to at least one example embodiment thereof, many variants of the described components can also be used without thereby departing from the scope of the disclosure as defined in the attached claims, which should be understood literally and/or according to the legal equivalents thereof."], "claims": ["a rotation axis; a stationary radially outer ring; a flanged hub extending into an interior of the radially outer ring and configured to rotate around the rotation axis and relative to the radially outer ring; a radially inner ring mounted on the flanged hub and axially abutting a portion of the flanged hub; a toothed sleeve mounted axially inward of and adjacent to the radially inner ring, the toothed sleeve being rotationally fixed relative to the flanged hub; an auxiliary ring mounted on the flanged hub in contact with the toothed sleeve, wherein the flanged hub includes an axially inner rolled edge in contact with the auxiliary ring and configured to maintain a preload on the radially inner ring; and wherein the auxiliary ring is configured to accommodate deformations induced by a formation of the rolled edge.", "wherein the auxiliary ring has a radially outer cylindrical surface, a radially inner cylindrical surface parallel to the radially outer cylindrical surface, an axially inner annular surface, an axially outer annular surface parallel to the axially inner annular surface and a curvilinear surface between the axially inner annular surface and the radially inner cylindrical surface.", "wherein the toothed sleeve includes an annular recess forming a seat for the auxiliary ring, the seat having a radially inwardly facing cylindrical surface and an axially inwardly facing annular surface, and wherein the auxiliary ring is mounted in the recess.", "wherein the auxiliary ring and the toothed sleeve are configured such that a radial gap exists between the inwardly facing cylindrical surface of the toothed sleeve and the radially outer cylindrical surface of the auxiliary ring.", "wherein a fit between the radially inner cylindrical surface of the auxiliary ring and a radially outer cylindrical surface of the flanged hub varies from a diameter clearance of 0.01 mm to a diameter interference of 0.05 mm.", "wherein a central opening of the flanged hub includes a first enlarged portion on an axially outer side and a first radial ball bearing in the first enlarged portion and a second enlarged portion on an axially inner side and at least one second radial ball bearing in the second enlarged portion, and a radially outer first relief groove surrounding the second enlarged portion, and wherein the hub-bearing assembly further includes a spacer mounted in the second enlarged portion axially between and in contact with the at least one second radial ball bearing and a shoulder defining an axial end of the second enlarged portion.", "wherein the second enlarged portion includes a second radially inner relief groove located axially outward of the first relief groove.", "8 . The assembly according to claim 7 , wherein the at least one second radially ball bearing is a single ball bearing.", "9 . The assembly according to claim 7 , wherein the at least one second radially ball bearing is exactly two second ball bearings.", "wherein a central opening of the flanged hub includes a first enlarged portion on an axially outer side and a first radial ball bearing in the first enlarged portion and a second enlarged portion on an axially inner side and at least one second radial ball bearing in the second enlarged portion, and a radially outer first relief groove surrounding the second enlarged portion, and wherein the hub-bearing assembly further includes a spacer mounted in the second enlarged portion axially between and in contact with the at least one second radial ball bearing and a shoulder defining an axial end of the second enlarged portion.", "wherein the second enlarged portion includes a second radially inner relief groove located axially outward of the first relief groove.", "inserting a flanged hub into a stationary radially outer ring; mounting a radially inner ring on the flanged hub in axial abutment with a portion of the flanged hub; mounting a toothed sleeve on the flanged hub axially inward of and adjacent to the radially inner ring such that the toothed sleeve is rotationally fixed relative to the flanged hub; mounting an auxiliary ring on the flanged hub in contact with the toothed sleeve, forming a rolled edge on the flanged hub such that the rolled edge contacts the auxiliary ring and maintains a preload on the radially inner ring and accommodates deformations induced by a formation of the rolled edge.", "wherein the auxiliary ring has a radially outer cylindrical surface, a radially inner cylindrical surface parallel to the radially outer cylindrical surface, an axially inner annular surface, an axially outer annular surface parallel to the axially inner annular surface and a curvilinear surface between the axially inner annular surface and the radially inner cylindrical surface.", "wherein the toothed sleeve includes a recess; and wherein the method includes mounting the auxiliary ring in the recess."], "bibtex": "@patent{20240359504,\n    title = {HUB-BEARING ASSEMBLY FOR A WHEEL OF A MOTOR VEHICLE},\n    number = {20240359504},\n    year = {2024},\n    note = {File: US20240359504A1-20241031.XML}\n    }", "classification": "B60B2700FI"}, {"title": "CASTER", "doc_number": "20240359505", "filename": "US20240359505A1-20241031.XML", "abstract": "A caster whose overall height can be reduced. A caster includes a wheel, a wheel support portion having a plate shape provided with an opening where the wheel is disposed and rotatably supporting the wheel, and a swivel mechanism portion that holds an outer peripheral portion of the opening in the wheel support portion in a horizontally swivelable manner.", "detailed_description": [""], "claims": ["a wheel; a wheel support portion that is provided with a first opening where the wheel is disposed and rotatably supports the wheel; and a swivel mechanism portion that holds an outer peripheral portion of the first opening in the wheel support portion in a horizontally swivelable manner.", "wherein the swivel mechanism portion includes a plate whose lower surface has an annular recess, a plurality of rolling elements disposed in the recess, and a bracket attached to the plate in a horizontally swivelable manner together with the wheel support portion, and the outer peripheral portion is held by the bracket and is in contact with the plurality of rolling elements from below.", "wherein the plate is provided with a second opening inside the recess, and the bracket includes a locking portion that locks on a circumferential edge portion of the second opening on an upper surface of the plate, and an engaging portion that extends downward from the locking portion, passes through the second opening, and engages with the outer peripheral portion.", "wherein the plurality of rolling elements are movable in a circumferential direction due to upward movement and outward movement of the plurality of rolling elements being restricted by the recess, downward movement of the plurality of rolling elements being restricted by the outer peripheral portion, and inward movement of the plurality of rolling elements being restricted by the engaging portion.", "wherein the plate includes an attachment portion to be attached to a mounting body that enables movement on the wheel.", "wherein the plate includes the attachment portion to be attached to the mounting body that enables movement on the wheel.", "wherein the plate includes the attachment portion to be attached to the mounting body that enables movement on the wheel.", "wherein the plate includes the attachment portion to be attached to the mounting body that enables movement on the wheel."], "bibtex": "@patent{20240359505,\n    title = {CASTER},\n    number = {20240359505},\n    year = {2024},\n    note = {File: US20240359505A1-20241031.XML}\n    }", "classification": "B60B3300FI"}, {"title": "TYRE FOR COMMERCIAL VEHICLE WHEELS", "doc_number": "20240359506", "filename": "US20240359506A1-20241031.XML", "abstract": "Tyre ( 1 ) particularly suitable for applications for commercial vehicles, comprising a tread band ( 2 ) which has a plurality of blocks ( 7, 8 ) facing each other in pairs and delimited in a circumferential and/or axial direction by a first plurality of main grooves ( 10, 20 ) which extend continuously up to the opposite shoulder regions ( 4, 5 ) starting from the central region ( 6 ), where they are connected to each other and by a second plurality of main grooves ( 30, 40 ), also extending from the central region ( 6 ) towards the shoulder regions ( 4, 5 ), connected to the first main grooves ( 10, 20 ) by means of a portion ( 30 b, 40 b ) preferably tapered in width until it becomes a thin connecting sipe ( 30 c, 40 c ).", "detailed_description": ["With reference toFIGS.1-3, reference numeral1generally indicates a tyre for vehicle wheels made in accordance with the present invention.", "", "The tyre (1) comprises a tyre structure in itself conventional, not shown in the attached figures, as well as a tread band (2) on which a tread surface (3) is defined, arranged in a position radially external to the tread band (2) and intended for contact with a road surface. The tyre (1) has a conventional generally toroidal shape developed around a rotation axis, defining, on the tread surface,3an axial direction parallel to it, and crossed by an equatorial plane (X), perpendicular to the axis of rotation and defining on the tread surface3a circumferential direction parallel to it.", "", "On the tread band (2), an effective width (L) is identified, defined as the maximum width of the tread band intended for contact with the ground in standard use conditions (i.e., under nominal pressure and load).", "", "The tyre (1) is a directional type tyre, in which a preferential rolling direction of the tyre is defined, indicated in the figures by the arrow (F).", "", "On the tread band (2) a first shoulder region (4) is also defined, delimited from the axially external side by a first lateral edge of the tread band (2), a second shoulder region (5), axially opposite to the first shoulder region (4) and delimited from the axially external side by a second lateral edge of the tread band (2), as well as a central region (6), interposed between the first and second shoulder regions, (4) and (5), and extending across the equatorial plane (X).", "", "A plurality of first pairs of main grooves are defined on the tread band (2), arranged in regular succession along the circumferential development of the tread band (2).", "", "Each first pair of main grooves is formed by a first main groove (10), extending from the first shoulder region4towards the central region6, as well as a second main groove (20) extending from the second shoulder region (5) towards the central region (6). The first and second main grooves (10), (20) of each first pair of main grooves are substantially opposed to each other with respect to the equatorial plane (X) and disposed at least partially axially side by side with each other (i.e., there is at least one straight line parallel to the axial direction that intersects both grooves).", "", "Each first main groove (10) comprises a first segment (11), extending from a respective axially external end open in the first shoulder region4towards the central region (6), and a terminal segment (12), axially internal, extending as a continuation of the first segment (11) up to lead with one of its axially internal ends10binto a second main groove (20) of a subsequent pair of first main grooves.", "", "The first segment (11) has a curvilinear course, devoid of inflection points, with an inclination with respect to the circumferential direction generally decreasing starting from the first shoulder region (4) towards the central region (6).", "", "Preferably, the inclination with respect to the circumferential direction of the first segment (11) of the first main grooves (10) in correspondence with the first shoulder region (4) is between 70° and 90°.", "", "Preferably, the inclination with respect to the circumferential direction of the first segment (11) of the first main grooves (10) in correspondence with the central region (6) is between 30° and 60°.", "", "The terminal segment (12) of each first main groove (10) has a broken line configuration and comprises a first portion (13), extending as a continuation of the first segment (11) towards the first shoulder region (4) and a second portion (14), extending as a continuation of the first portion (13) towards the second shoulder region (5).", "", "The first portion (13) and the second portion (14) of the terminal segment (12) extend across the equatorial plane (X) of the tread band (2) and are inclined in discordant way from each other with respect to the circumferential direction.", "", "Each second main groove (20) comprises a first segment (21), extended from a respective axially external end open in the second shoulder region (5) towards the central region (6). Similarly to the first segment (11) of the first main groove (10), the first segment (21) of the second main groove (20) also has a curvilinear course, devoid of points of inflection, with an inclination with respect to the circumferential direction generally decreasing starting from the second shoulder region (5) towards the central region (6).", "", "Preferably, the inclination with respect to the circumferential direction of the first segment (21) of the second main grooves (20) in correspondence with the second shoulder region (5) is between 70° and 90°.", "", "Preferably, the inclination with respect to the circumferential direction of the first segment (21) of the second main grooves (20) in correspondence with the central region (6) is between 30° and 60°.", "", "The first segment (21) extends from an axially external end of the second main groove (20), open in the second shoulder region (5) up to an axially internal end (20b) of the second main groove (20), open on the first segment (11) of the first main groove (10).", "", "In particular, the second main groove (20) joins the first main groove (10) shortly after crossing the equatorial plane (X).", "", "On the first segment (11) of each first main groove (10), an internal end portion (15) remains thus defined, delimited by the end (20b) of the second main groove (20) and by the beginning of the terminal segment (12).", "", "Furthermore, on the first segment (21) of each second main groove (20), an internal end portion (22) remains defined, delimited by the end (20b) of the second main groove (20) and from the end (10b) of the first main groove (10).", "", "In this way, therefore, a broken, zigzag line is formed, defined by the internal end portion (22) of the second main groove (20), by the internal end portion (15) of the first main groove (10), from the first portion (13) of the terminal segment (12), from the second portion (14) of the terminal segment (12). This broken line develops continuously along the entire circumferential extension of the equatorial plane (X) and, preferably, crosses it in each of its subsequent sections.", "", "The first and second main grooves, (10) and (20), of each first pair of main grooves have generally similar trends, with a significant part of the respective first segments, (11) and (21), substantially symmetrical with respect to the equatorial plane (X) and with concavities facing the same side of the band tread.", "", "The second main groove (20), however, is axially offset with respect to the first transverse groove (10). For example, the respective axially external ends of the first and second main grooves (10), (20) can be offset by a measure comprised between 5 and 20 mm, preferably between 10 and 20 mm, measured along the circumferential direction.", "", "By the misalignment between the axially external ends of the first and second main grooves (10), (20) it is possible to contribute to the reduction of the noise emitted during the rolling of the tyre (1), optimising the entry into the footprint of the relative edges.", "", "On the tread band (2), there is also defined a plurality of second pairs of main grooves, arranged in regular succession along the circumferential development of the tread band (2), in alternating position with the first pairs of main grooves, (10) and (20).", "", "Each second pair is formed by a third main groove (30), extending from the first shoulder region (4) towards the central region (6) and by a fourth main groove (40), extending from the second shoulder region (5) towards the central region (6). The third and fourth main grooves (30), (40) of each second pair of main grooves are opposite each other with respect to the equatorial plane (X) and at least partially axially disposed side by side with each other (i.e., there is at least one straight line parallel to the axial direction that intersects both grooves).", "", "Preferably, the inclination with respect to the circumferential direction of the third and fourth main grooves30,40in correspondence with the first/second shoulder region (4), (5) is between 70° and 90°.", "", "Preferably, the inclination with respect to the circumferential direction of the third and fourth main grooves (30), (40) in correspondence with the central region6is between 30° and 60°. In particular, each third main groove (30) extends between an axially external end open in the first shoulder region (4) and an axially internal end (30b).", "", "Similarly, each fourth main groove (40) extends between an axially external end open in the second shoulder region (5) and an axially internal end (40b).", "", "The third and fourth main grooves, (30) and (40), have a curvilinear trend analogous and substantially parallel to the first and second main grooves, (10) and (20), respectively.", "", "Furthermore, the third and fourth main grooves, (30) and (40), have a substantially symmetrical course with respect to the equatorial plane (X), even though they are axially offset from each other. In particular, the respective axial ends of the third and fourth main grooves (30), (40) can be offset by a measure comprised between 5 and 20 mm, preferably between 10 and 20 mm, measured along the circumferential direction. By misaligning the axially outer ends of the third and fourth main grooves30,40it is possible to contribute to reducing the noise emitted during the rolling of tyre (1), optimising the entry into the footprint of the relative edges.", "", "Advantageously, the first portion (13) of the terminal segment (12) of the first main groove (10) is located on the theoretical extension of the fourth main groove (40). More specifically, the axially internal end (40b) of the fourth main groove (40) is extended by a respective sipe (40c), which connects the end (40b) to the first portion (13) of the terminal segment (12) of the first main groove (10). Preferably, the width of the sipe (40c) is less than or equal to 1 mm. The extension of the axially internal end (40b) of the fourth main groove (40) in the respective sipe (40c) can take place by means of a groove portion tapered in width, so as to take place in a gradual manner.", "", "Similarly, the second portion (14) of the terminal segment (12) of the first main groove (10) is located on the theoretical extension of the third main groove (30). More particularly, the axially internal end (30b) of the third main groove (30) is extended by a respective sipe (30c), which connects the end (30b) to the second portion (14) of the terminal segment (12) of the first main groove (10). Preferably, the width of the sipe (30c) is less than or equal to 1 mm. The extension of the axially internal end (30b) of the third main groove (30) in the respective sipe (30c) can take place by means of a groove portion tapered in width, so as to take place in a gradual manner.", "", "All of the first, second, third and fourth main grooves, (10), (20), (30) and (40), can have a maximum depth of at least 7 mm, preferably of at least 8 mm. Preferably, the sipes (30c), (40c) have a maximum depth that is less than the maximum depth of the first, second, third and fourth main grooves, (10), (20), (30), (40).", "", "All of the first, second, third and fourth main grooves, (10), (20), (30) and (40), can have variable width, decreasing starting from the shoulder regions (4), (5) towards the central region (6). For example, the width of said main grooves can vary from about 9-12 mm in correspondence of the respective shoulder region (4), (5) up to a measure of approximately 2.5-5 mm in correspondence of the central region (6).", "", "Furthermore, on the tread band (2), there is a plurality of first pairs of secondary grooves (50), (60) arranged in regular succession along the circumferential development of the tread band (2).", "", "Each first pair of secondary grooves is formed by a first secondary groove (50), extended from a respective first main groove (10), preferably between two first main grooves (10) which are successive to each other, and by a second secondary groove (60) extended from a second main groove (20), preferably between two second main grooves (20) which are subsequent to each other.", "", "More particularly, each first secondary groove (50) intersects a third main groove (30) in correspondence with an axially internal end region thereof, close to its end (30b). In this way, each first secondary groove50can be divided into a first portion, extending between a first main groove (10) and a third main groove (30) and a second portion extending between the third main groove (30) and a first subsequent main groove (10).", "", "The first and second portions of each first secondary groove (50) can be mutually aligned (although not necessarily) along a substantially rectilinear direction.", "", "Each first secondary groove (50) preferably extends according to a direction inclined with respect to the circumferential direction of an angle less than or equal to 30°, in a discordant way with respect to the inclination of the first segments (11) of the first main grooves (10) that it intersects.", "", "Preferably, each first secondary groove50has a maximum width smaller than the maximum width of the first main grooves (10). For example, each first secondary groove (50) can have a width (possibly variable along its extension) comprised between 2 mm and 5 mm.", "", "The second secondary grooves (60) are substantially mirrored to the first secondary grooves (50) with respect to the equatorial plane (X).", "", "More particularly, each second secondary groove (60) intersects a fourth main groove (40) at an axially internal end region thereof, close to its end (40b). In this way, each second secondary groove (60) can be subdivided into a first portion, extending between a second main groove (20) and a fourth main groove (40), and a second portion extending between the fourth main groove (40) and a subsequent second main groove (20). The first and second portions of each second secondary groove (60) can be mutually aligned (although not necessarily) along a substantially rectilinear direction.", "", "Each second secondary groove (60) preferably extends according to a direction inclined with respect to the circumferential direction by an angle less than or equal to 30°, in a discordant way with respect to the inclination of the first segments (21) of the second main grooves (20) that it intersects.", "", "Preferably, each second secondary groove (60) has a maximum width smaller than the maximum width of the second main grooves (20). For example, each second secondary groove60can have a width (possibly variable along its extension) comprised between 2 mm and 5 mm.", "", "The first pairs of secondary grooves (50), (60) can axially delimit the central region (6) of the tread band (2).", "", "Along the circumferential development of the central region (6), the first, second, third and fourth main grooves, (10), (20), (30), (40), as well as the first pairs of secondary grooves (50), (60) form a plurality of pairs of first blocks (7) and second blocks (8) arranged in regular succession. For each pair, a first block (7) and a second block (8) are at least partially aligned with each other along the axial direction. In other words, the respective projections along the axial direction of the first and second block (7), (8) of each pair of blocks result in a partial overlap.", "", "In particular, the first block (7) and the second block (8) have respective concavities facing each other, said cavities being formed by the broken line, zigzagging, defined by the internal end portion (22) of the second main groove (20), by the inner end portion (15) of the first main groove (10), by the first portion (13) of the terminal segment (12) of the first main groove (10), by the second portion (14) of the terminal segment (12) of the first main groove (10).", "", "The first and second blocks, (7), (8), are also axially offset, so that a portion of the first block (7) can be at least partially received in the concavity of the corresponding second block (8) and a portion of the second block8can be at least partially received in the concavity of the corresponding first block (7).", "", "In this way, the first and second blocks, (7) and (8), of each pair are partially interlocked with each other.", "", "More particularly, the third and fourth main grooves (30), (40) end within the first and second blocks (7), (8) with their axially internal ends (30b), (40b). Furthermore, by extending the ends (30b), (40b) by means of the respective first sipes (30c), (40c), a connection is made with the terminal segment (12) of each first main groove (10), so as to circumferentially separate the first and said second block (7), (8) into respective first portions of block (7a), (8a) and second portions of block (7b), (8b). The first portions of block (7a), (8a) preferably have a substantially quadrangular shape. Also the second portions of block (7b), (8b) can have a substantially quadrangular shape, but for a protruding portion thereof formed by the ends (30b), (40b) tapered in width.", "", "Furthermore, on the tread band (2), a plurality of second pairs of secondary grooves (70), (80) are arranged in regular succession along the circumferential development of the tread band (2).", "", "Each second pair of secondary grooves is formed by a third secondary groove (70), extending into the first shoulder region (4) from a respective first main groove (10) and by a fourth secondary groove (80) extending into the second shoulder region (5) from a respective second main groove (20).", "", "Preferably, two third secondary grooves (70) extend into the first shoulder region (4) starting from two first main grooves (10) subsequent to each other. Preferably (although not necessarily), these two third secondary grooves (70) can be arranged in a way not aligned with each other, for example along directions substantially parallel to each other.", "", "More particularly, each third secondary groove (70) intersects a third main groove (30) at an intermediate portion thereof.", "", "Each third secondary groove (70) extends preferably according to a direction inclined with respect to the circumferential direction by an angle less than or equal to 40°, in a discordant way with respect to the inclination of the first segments (11) of the first main grooves (10) from which it departs.", "", "Preferably, each third secondary groove (70) has a maximum width less than the maximum width of the first main grooves (10). Preferably, each third secondary groove (70) has a maximum width greater than the maximum width of the first secondary grooves (50). For example, each third secondary groove (70) can have a width (possibly variable along its extension) comprised between 3 mm and 5 mm.", "", "The fourth secondary grooves (80) are substantially mirrored to the third secondary grooves (70) with respect to the equatorial plane (X).", "", "Preferably, two fourth secondary grooves (80) extend into the second shoulder region (5) starting from two second main grooves (20) subsequent to each other. Preferably (although not necessarily), these two fourth secondary grooves (80) can be arranged in a way not aligned with each other, for example, along directions that are substantially parallel to each other.", "", "More specifically, each fourth secondary groove80intersects a fourth main groove (40) at an intermediate portion thereof.", "", "Each fourth secondary groove (80) preferably extends in direction inclined with respect to the circumferential direction of an angle of less than or equal to 40°, in a discordant way with respect to the inclination of the first segments (21) of the second main grooves (20) from which it departs.", "", "Preferably, each fourth secondary groove (80) has a maximum width smaller than the maximum width of the second main grooves (20). Preferably, each fourth secondary groove (80) has a maximum width greater than the maximum width of the second secondary grooves (60). For example, each fourth secondary groove (80) can have a width (possibly variable along its extension) comprised between 3 mm and 5 mm.", "", "By means of the plurality of second pairs of secondary grooves, (70), (80), on the shoulder regions (4), (5) of the tread band (2), in addition to the first and second blocks (7) and (8), shoulder blocks9aand9bremain defined.", "", "The shoulder blocks (9a) are delimited by the first and second pairs of main grooves (10,30or20,40) as well as by the first and second pairs of secondary grooves (50,70or60,80).", "", "The shoulder blocks (9b) are delimited by the first and second pairs of main grooves (10,30or20and40), by the second pairs of secondary grooves (70or80) and by the lateral edges of the tread band.", "", "On the blocks indicated above sipes are preferably formed, which favour the performance of the tyre in snowy conditions.", "", "In particular, on the first and second blocks (7and8) (preferably on each of the portions of block (7a,7b,8a,8b)) second sipes (90) are formed, which have a course substantially parallel to said first, second, third or fourth main grooves (10), (20), (30), (40). In the embodiment shown in the figures, on the first portions of block (7a), (8a) the second sipes (90) have a course substantially parallel to the first and second main grooves (10), (20), whilst on the second portions of block (7b), (8b) the second sipes (90) have a trend substantially parallel to the third and fourth main grooves (30), (40), with a respective deviation which follows the tapered portion of the ends (30b), (40b).", "", "Third sipes (91) are also formed on the shoulder blocks (9a), (9b), which have a trend substantially parallel to said first, second, third or fourth main grooves (10), (20), (30), (40).", "", "The second and/or third sipes (90), (91) can have variable depth along their extension. Furthermore, they can have a three-dimensional conformation, i.e. they cause, in the walls of the blocks on which they are formed, the formation of protrusions and corresponding recesses. In one preferred embodiment, the second and/or third sipes (90), (91) form protrusions (and corresponding recesses) having a substantially pyramidal conformation, comprising an apex connected to an extension plane of the respective sipe by means of substantially flat connecting surfaces, as described, for example, in patent application WO 2017/212399 in the name of said Applicant. Even more preferably, in each second and/or third sipe (90), (91) these projections all face in the opposite direction with respect to the preferential rolling direction (F) of the tyre (1).", "", "Preferably, at least some of the first and second blocks (7), (8) and/or at least some of said shoulder blocks (9a), (9b) have at least one chamfered transverse edge. In the embodiment shown in the figures, the block portions (7a), (8a), (7b), (8b), as well as the shoulder blocks (9a), (9b) have a chamfered portion on their respective edge arranged in the opposite direction to the preferential rolling direction of the tyre (1) indicated by the arrow (F). Preferably, the second and/or third sipes (90), (91) can also have at least one chamfered transverse edge.", "", "The tread pattern results formed by the repetition in continuous succession of a single module (M) formed by the portion of the tread band comprised between two subsequent first pairs of main grooves (10) and (20), as better shown inFIG.3.", "", "Each module (M), in turn, is formed by a first elementary portion, extended from a first pair of main grooves (10) and (20) up to the second pair of main grooves (30) and (40) and by a second elementary portion, extended from the second pair of main grooves (30) and (40) up to the subsequent first pair of main grooves (10) and (20).", "", "Each first elementary portion and each second elementary portion can have a circumferential dimension corresponding to a long pitch, or of a measure corresponding to a short pitch, smaller than the long pitch.", "", "Each module (M) can be formed by a first and a second elementary portion with a short pitch or a long pitch variously combined with each other, so that on the tread pattern modules are provided having both the first and the second elementary portion with a long pitch, or modules having both the first and the second elementary portion with a short pitch, or modules with the first elementary portion with a short pitch and the second elementary portion with a long pitch, or, lastly, modules with the first elementary portion with a long pitch and the second elementary portion with a short pitch."], "claims": ["1 - 19 . (canceled)", "a first shoulder region and a second shoulder region axially opposite each other; a central region interposed between the first region and the second shoulder region; a plurality of pairs of first blocks and second blocks, arranged in regular succession along a circumferential development of the central region, wherein each first block and each second block of each of the pairs is at least partially aligned with each other along an axial direction defined on the tread band, a plurality of first pairs of main grooves, arranged in regular succession along the circumferential development of the tread band to partially delimit the first and the second blocks, wherein each first pair of main grooves are formed by a first main groove extending from the first shoulder region towards the central region and by a second main groove extending from the second shoulder region towards the central region, a plurality of second pairs of main grooves, arranged in regular succession along the circumferential development of the tread band in an alternating position with the first pairs of main grooves, wherein each second pair of main grooves are formed by a third main groove extending from the first shoulder region towards the central region and by a fourth main groove extending from the second shoulder region towards the central region, wherein in each first pair of main grooves, the second main groove comprises an axially internal end connected with the first main groove; wherein in each first pair of main grooves, the first main groove comprises an terminal segment, axially internal, connected with a second main groove circumferentially subsequent to the second main groove, to axially separate a first block and a second block of one of the pairs of first and second blocks; and wherein in each second pair of main grooves, the third and the fourth main groove comprise respective axially internal ends extended by respective first sipes connected to the terminal segment of the first main groove, to circumferentially separate the first and the second block into respective first and second portions of block, and in which a plurality of first pairs of secondary grooves are formed on the tread band, arranged in regular succession along the circumferential development of the tread band to at least partially delimit the first and the second blocks from their axially outer side, and each first pair of secondary grooves comprising a first secondary groove extending from a first main groove and a second secondary groove extended from a second main groove.", "21 . The tyre according to claim 20 , wherein the first and second main groove comprise respective first segments having a curvilinear course, extending starting from the first and the second shoulder region towards an equatorial plane (X) of the tread band, and having a generally decreasing inclination starting from the first and the second shoulder region towards the central region.", "22 . The tyre according to claim 21 , wherein the terminal segment of the first main groove comprises a first portion extending as a continuation of the first segment of the first main groove towards the first shoulder region, and a second portion extending as a continuation of the first portion towards the second shoulder region.", "23 . The tyre according to claim 22 , wherein the first portion and the second portion of the terminal segment extend across an equatorial plane (X) of the tread band.", "24 . The tyre according to claim 22 , wherein the first portion of the terminal segment extends over the extension of the fourth main groove.", "25 . The tyre according to claim 22 , wherein the second portion of the terminal segment extends over the extension of the third main groove.", "26 . The tyre according to claim 20 , wherein the third and fourth main grooves have a curvilinear course, starting from the first and the second shoulder region towards an equatorial plane (X) of the tread band, with a generally decreasing inclination starting from the first and the second shoulder region towards the central region.", "27 . The tyre according to claim 20 , wherein the third and fourth main grooves have a substantially symmetrical course with respect to a circumferential direction.", "28 . The tyre according to claim 20 , wherein the ends of the third and fourth main grooves are tapered in width to form the first sipes connected to the terminal segment of the first main groove.", "29 . The tyre according to claim 20 , wherein the first and second blocks of each pair have mutually facing concavities.", "30 . The tyre according to claim 20 , wherein the first and second blocks of each pair are axially offset.", "31 . The tyre according to claim 20 , wherein at least one of the first and second block portions has a substantially quadrangular shape.", "32 . The tyre according to claim 20 , wherein in each of the first pairs of secondary grooves, the first secondary groove intersects a third main groove, and the second secondary groove intersects a fourth main groove.", "33 . The tyre according to claim 20 , wherein a plurality of second pairs of secondary grooves are formed in the tread band, and arranged in regular succession along the circumferential development of the tread band, wherein each second pair of secondary grooves are formed by a third secondary groove, extended in the first shoulder region from a first main groove, and by a fourth secondary groove, extended in the second shoulder region from a second main groove.", "34 . The tyre according to claim 33 , wherein in each of the second pairs of secondary grooves, the third secondary groove intersects a third main groove, and the fourth secondary groove intersects a fourth main groove.", "35 . The tyre according to claim 33 , wherein the first and second pairs of main grooves and the first and second pairs of secondary grooves axially delimit a plurality of shoulder blocks.", "36 . The tyre according to claim 20 , wherein second sipes are formed on the first and second blocks having a course substantially parallel to the first, second, third or fourth main grooves.", "37 . The tyre according to claim 36 , wherein third sipes are formed on the shoulder blocks having a course substantially parallel to the first, second, third or fourth main grooves.", "38 . The tyre according to claim 35 , wherein at least some of the first and second blocks, at least some of the shoulder blocks, or both have at least one chamfered transverse edge."], "bibtex": "@patent{20240359506,\n    title = {TYRE FOR COMMERCIAL VEHICLE WHEELS},\n    number = {20240359506},\n    year = {2024},\n    note = {File: US20240359506A1-20241031.XML}\n    }", "classification": "B60C1103FI"}, {"title": "Mixed-Use Heavy-Duty Vehicle Tire with Low Road Noise", "doc_number": "20240359507", "filename": "US20240359507A1-20241031.XML", "abstract": "A tire ( 1 ) for a heavy goods vehicle having a tread ( 2 ) with low road noise. Two consecutive rows of blocks are in the form of a chevron ( 6 ) of the tread ( 2 ) and are separated by a transverse cut-out in the form of a chevron ( 52 ) which extends continuously from one edge of the tread to the other so that the leading or trailing edges ( 41 ) of the blocks ( 4 ) are positioned in the same line (L) and any transverse cut-out in the form of a chevron ( 52 ) has a mean line (Lt) which is constituted by two branches (Lt 1 , Lt 2 ) which each form, with the axial direction (YY′), a mean angle (B 1 , B 2 ) at a minimum of 15° and at a maximum of 55°.", "detailed_description": [""], "claims": ["the arrangement of blocks being constituted, in a circumferential direction (XX′) of the tire, by a circumferential distribution of rows of blocks in the form of a chevron so that all the chevrons are orientated in the travel direction (XX′) of the tire and have their respective tips, which are positioned in the same circumferential plane (P), perpendicular to the rotation axis of the tire, each row of blocks in the form of a chevron extending from one edge of the tread to the other and being constituted in an axial direction (YY′) of the tire by a juxtaposition of blocks, the blocks of the same row of blocks in the form of a chevron being separated in pairs by a circumferential cut-out which has a mean line (Lc) which forms, with the circumferential direction (XX′), a mean angle (A) less than 45°, two consecutive rows of blocks in the form of a chevron are separated by a transverse cut-out in the form of a chevron which extends continuously from one edge of the tread to the other so that the leading or trailing edges of the blocks which delimit, in the travel surface, the transverse cut-out in the form of a chevron are positioned in the same line (L), and wherein any transverse cut-out in the form of a chevron has a mean line (Lt) which is constituted by two branches (Lt", "2 . The tire as claimed in claim 1 , wherein the mean angle (B 1 , B 2 ) of each branch (Lt 1 , Lt 2 ) of the mean line (Lt) of each transverse cut-out in the form of a chevron, relative to the axial direction (YY′), is at a minimum 25°.", "3 . The tire as claimed in claim 1 , wherein the mean angle (B 1 , B 2 ) of any branch (Lt 1 , Lt 2 ) of the mean line (Lt) of each transverse cut-out in the form of a chevron, relative to the axial direction (YY′), is at a maximum 40°.", "4 . The tire as claimed in claim 1 , wherein each branch (Lt 1 , Lt 2 ) of the mean line (Lt) of any transverse cut-out in the form of a chevron has a concave curvilinear shape so that the center of curvature (C) at any point (M) of the branch (Lt 1 , Lt 2 ) is positioned, in the travel direction of the tire, in front of the branch (Lt 1 , Lt 2 ).", "5 . The tire as claimed in claim 4 , wherein the radius of curvature R at any point (M) of the branch (Lt 1 , Lt 2 ) of concave curvilinear shape is at least equal to the width W of the tread.", "6 . The tire as claimed in claim 1 , wherein any transverse cut-out in the form of a chevron has a maximum depth D 2 and a mean width W 2 so that the ratio W 2 /D 2 is at least 20%, preferably at least 30%.", "7 . The tire as claimed in claim 1 , wherein any transverse cut-out in the form of a chevron has a maximum depth D 2 and a mean width W 2 so that the ratio W 2 /D 2 is at the most 150%.", "8 . The tire as claimed in claim 1 , wherein any transverse cut-out in the form of a chevron comprises a protuberance at the base of the cut-out, in the region of the tip of the chevron-like shape.", "9 . The tire as claimed in claim 1 , wherein any circumferential cut-out has a maximum depth D 1 and a mean width W 1 so that the ratio W 1 /D 1 is at least 20%.", "10 . The tire as claimed in claim 1 , wherein any circumferential cut-out has a maximum depth D 1 and a mean width W 1 so that the ratio W 1 /D 1 is at the most 150%.", "11 . The tire as claimed in claim 1 , wherein the circumferential plane (P), which contains the respective tips ( 61 ) of the rows of blocks in the form of a chevron ( 6 ) is non-median and axially positioned relative to the central circumferential plane (P 0 ), which is perpendicular to the rotation axis of the tire and which extends through the center of the tread ( 2 ), at an axial distance Yp which is at the most 20%, of the width W of the tread.", "12 . The tire as claimed in claim 1 , wherein the circumferential plane (P), which contains the respective tips of the rows of blocks in the form of a chevron is non-median and axially positioned relative to the central circumferential plane (P 0 ), which is perpendicular to the rotation axis of the tire and which extends through the center of the tread ( 2 ), at an axial distance Yp which is at the most 10% of the width W of the tread"], "bibtex": "@patent{20240359507,\n    title = {Mixed-Use Heavy-Duty Vehicle Tire with Low Road Noise},\n    number = {20240359507},\n    year = {2024},\n    note = {File: US20240359507A1-20241031.XML}\n    }", "classification": "B60C1111FI"}, {"title": "Adaptive Sensor Data Acquisition", "doc_number": "20240359508", "filename": "US20240359508A1-20241031.XML", "abstract": "A method includes: monitoring sensor data including one or more representations of a treaded surface captured by a device; detecting, based on the sensor data, that the device has traversed a boundary of the treaded surface; in response to detecting that the device has traversed the boundary, determining a scan trigger point within the one or more representations; and generating a profile of the treaded surface from the one or more representations based on the scan trigger point.", "detailed_description": ["Examples disclosed herein are directed to a method including: monitoring sensor data including one or more representations of a treaded surface captured by a device; detecting, based on the sensor data, that the device has traversed a boundary of the treaded surface; in response to detecting that the device has traversed the boundary, determining a scan trigger point within the one or more representations; and generating a profile of the treaded surface from the one or more representations based on the scan trigger point.", "", "Additional examples disclosed herein are directed to a computing device, comprising: an emitter; a sensor; and a processor configured to: monitor sensor data including one or more representations of a treaded surface captured by the sensor; detect, based on the sensor data, that the device has traversed a boundary of the treaded surface; in response to detecting that the device has traversed the boundary, determine a scan trigger point within the one or more representations; and generate a profile of the treaded surface from the one or more representations based on the scan trigger point.", "", "Tire tread depth can be measured with a tire tread depth gauge, which generally includes a plunger or other movable rod, post, or the like, extending from a gauge housing. The housing supports a sensor configured to indicate the extent to which the plunger is currently extended from the housing (e.g., into a tread of a tire, to contact the bottom of the tread). Assessing tread wear of a tire may involve collecting several distinct measurements from several different treads with such a gauge, which can be time-consuming.", "", "Image-based tread depth measurement can facilitate the collection of tread depth measurements, e.g., across a plurality of tire treads, more quickly than manual measurement of each tread with a gauge as set out above.FIG.1illustrates an example computing device100for collecting image-based depth measurements, e.g., from a tire104. The device100can also be used to collect depth measurements for objects other than the tire104.", "", "The tire104may be mounted on a vehicle, such as an automobile, delivery van, trailer, or the like, but is shown in isolation. The device100is configured to generate depth measurements for a plurality of treads of the tire104. The depth measurements generated by the device100are also referred to as a tire tread profile, or simply a profile, of the treaded surface of the tire104. The treads of the tire104can include major treads108, and minor treads112. The major treads108, of which the tire104as illustrated has four, typically extend continuously around the circumference of the tire104. The minor treads112do not necessarily extend continuously around the circumference of the tire104. For example, the minor treads112can be arranged at various angles relative to the major treads112, and have various lengths smaller than the circumference of the tire104. The minor treads112can also have smaller tread depths than the major treads108.", "", "In the present example, the device100is a mobile computing device, such as a mobile computer (e.g., a handheld computer) configured to generate the depth measurements by traversing (e.g., via manipulation by an operator, not shown) the tire104or other object to be scanned in a scan direction S, from an initial position shown in dashed lines to a final position shown in solid lines. In the present example, the scan direction S is parallel to an axis A of the tire. That is, the scan direction S, in this example, is perpendicular to the major treads108. As will be apparent, to scan the full width of the tire104, the device100traverses a leading boundary116of the tire104, and a trailing boundary120of the tire104. The leading and trailing boundaries116and120can correspond, for example, to the sidewalls of the tire104, and define boundaries of the treaded surface to be measured.", "", "As the device100traverses the tire104in the scan direction S, the device100can collect depth measurements across the treaded surface of the tire104, e.g., by emitting a beam of light and capturing reflections of the beam of light from the tire104, as discussed below in connection withFIG.2.", "", "FIG.2illustrates the device100and the treaded surface of the tire104from the side, as the device100traverses the treaded surface in the scan direction S. The device100includes a light emitter200(e.g., a laser emitter such as a laser diode) and an image sensor204, such as a charge-coupled device (CCD), complementary metal oxide semiconductor (CMOS) or the like, as well as associated optics (e.g. lenses, filters or the like). The image sensor204can be implemented, in some examples, as a one-dimensional array, e.g., a line of pixels. In other examples, the sensor204can include a depth sensor such as a time-of-flight (ToF) sensor, an ultrasonic sensor, or the like. The emitter200and the image sensor204are disposed within a housing of the device100, and the device100further includes a transparent scan window208permitting the exit of light emitted by the emitter200, and the entry of light reflected from the tire104for capture by the image sensor204.", "", "The device100, and specifically the emitter200, thus emits a beam212of light (e.g., a laser beam) through the window208. The beam212impacts the treaded surface of the tire104, and a portion of the emitted light is reflected back towards the device100, in the form of a reflection216of the beam212. The reflection216returns through the window208and is captured by the image sensor204. The positions of the image sensor204, the emitter200and the window208relative to one another can be stored as calibration data in the device100. The calibration data can be used along with a location at which the reflection216impacts the image sensor204(e.g., pixel coordinates at the image sensor204) to determine a depth D from the image sensor204to the point on the tire104at which the reflection216originated.", "", "To collect depth measurements as the device100traverses the tire104, the sensor204is configured to capture a sequence of representations of the tire104, such as images of the tire104, each depicting or otherwise representing a corresponding reflection216. For example, the representations can include one-dimensional or two-dimensional images with brightness values of one or more pixels indicating the position at which a reflection216impacted the sensor204. In other examples, the representations can include depth measurements, e.g., obtained from an ultrasonic sensor or the like. The position at which the reflection216impacts the sensor204varies with the distance between the sensor204and the treaded surface of the tire104. Turning toFIG.3, a sequence300of images is illustrated, captured as the device100traverses the tire104in the scan direction S. Each individual image304includes a region308corresponding to a reflection216(e.g., distinguished by a higher intensity, different color, or the like, than the remainder of the image304). As the device100traverses the tire104, the positions of successive regions308in successive images304changes with the tread depth of the tire104. The device100can be configured to combine the reflections308from the sequence300of images into a tire profile312. For example, the tire profile312can include an image in which the “X” coordinate corresponds to a distance along the scan direction S, and the “Y” coordinate corresponds to a depth. The profile312can be provided to another computing device, displayed by the device100, analyzed to convert the Y positions of the reflections308to tread depth measurements, and the like.", "", "Traversing the tire104with the device100may involve an operator holding the device100over the tire104and swiping the device100across the tire in the scan direction S, while maintaining a substantially constant distance between the device100and the tire104(e.g., while keeping the device100substantially horizontal). Some devices100are configured to capture images such as the sequence300for a predetermined period of time upon initiation of a scan (e.g., four seconds, although a wide variety of other time periods can also be employed).", "", "However, a fixed-length time period may result in termination of the scan before the device100has completely traversed the tire104. For example, an inexperienced operator and/or a large tire, may require more time than permitted by the fixed scan period to traverse the treaded surface with the device100. The resulting tire profile312may therefore be incomplete. In other scenarios, the fixed-length time period may result in inefficient deployment of the device100. For example, an experienced operator and/or a small tire may require less than time than dictated by the fixed scan period to traverse the treaded surface with the device100. The scan may therefore be completed, but the device100may not be ready to initiate a further scan until the fixed scan period has elapsed. As discussed below, the device100therefore implements certain functionality to adaptively alter the duration of a scan, by detecting either or both of the leading and trailing boundaries116and120of the tire104, and determining scan trigger points based on such detections.", "", "Turning toFIG.4, certain internal components of the device100are illustrated. The device100includes a processor400, such as one or more central processing units (CPUs) or graphics processing units (GPUs), interconnected with a non-transitory computer readable storage medium, such as a memory404. The memory404includes any suitable combination of volatile memory (e.g., Random Access Memory (RAM)) and non-volatile memory (e.g., read only memory (ROM), Electrically Erasable Programmable Read Only Memory (EEPROM), flash memory). The processor400and the memory404each comprise one or more integrated circuits.", "", "The computing device100also includes at least one input device408interconnected with the processor400. The input device408is configured to receive input and provide data representative of the received input to the processor400. The input device408can include any one of, or any suitable combination of, a touch screen, a keypad, a trigger button, a microphone, or the like. The computing device100also includes a display412(e.g., a display panel integrated with the above-mentioned touch screen) interconnected with the processor400. The computing device100can also include one or more output devices in addition to the display412, such as a speaker, a notification LED, and the like (not shown).", "", "The computing device100also includes a communications interface416interconnected with the processor400. The communications interface416includes any suitable hardware (e.g., transmitters, receivers, network interface controllers and the like) allowing the computing device100to communicate with other computing devices via wired and/or wireless links (e.g., over local or wide-area networks). The specific components of the communications interface416are selected based on the type(s) of network(s) or other links that the computing device100is required to communicate over.", "", "The computing device100also includes a depth scanning assembly420, also referred to as a depth scanner420, interconnected with the processor400. The depth scanning assembly420, in the present example, includes the emitter200and image sensor204mentioned in connection withFIG.2. In other examples, the depth scanning assembly420can include additional emitters and/or images sensors, or other depth-sensing components instead of the emitter200and image sensor204. The computing device100can also include a motion sensor424, such as an accelerometer, gyroscope, or a combination thereof (e.g., an inertial measurement unit, IMU).", "", "The memory404of the computing device100stores computer readable instructions executable by the processor400. The instructions can be implemented as one or more software applications, and execution of the above-mentioned instructions by the processor400causes the computing device100to implement certain functionality. In the present example, the memory404stores a boundary detection application428, also referred to herein as the application428. In other examples, the processor400, as configured by the execution of the application428, is implemented as one or more specifically-configured hardware elements, such as field-programmable gate arrays (FPGAs) and/or application-specific integrated circuits (ASICs).", "", "The computing device100is configured, via execution of the application428by the processor400, to capture image data as discussed above, and to assess certain attributes of the captured image data to detect boundaries of the object being scanned (e.g., the leading and/or trailing boundaries116and120of the tire104). The device100is further configured to determine scan trigger points based on the detected boundaries. Scan trigger points can be, for example, initial and/or final samples of image data, with any captured images outside the trigger points being discarded or otherwise marked as not forming part of the resulting profile312. The device100can therefore generate the profile312using the determined scan trigger points, and interrupt data capture to place the device100in a state ready to initiate a further scan. The dynamic detection of scan trigger points permits the device100to perform scans of variable lengths, e.g., to accommodate a range of tire sizes, a range of operator experience levels, and the like.", "", "The functionality implemented by the computing device100via execution of the application224will now be described in greater detail, with reference toFIG.5.FIG.5illustrates a method500for adaptive sensor data acquisition. The method500will be described in conjunction with its performance by the computing device100, in particular via the execution of the application428by the processor400. In other examples, certain blocks of the method500can be performed by a separate computing device, as noted below.", "", "At block505, the device100receives a scan initiation command, to begin emitting light via the emitter200and capturing reflections216at the image sensor204. The scan initiation command can be received at the processor400from the input device408, e.g., in the form of a trigger pull, a selection of a command element via a touch screen, activation of a button, or the like. In other examples, the emitter200and image sensor204operate continuously, and block505can therefore be omitted. In the discussion below however, the scan initiation command is assumed to be an explicit input provided to the processor400via the input device408, and the emitter200and image sensor204are assumed to be inactive prior to receipt of the initiation command at block505.", "", "At block510, the processor400is configured, responsive to receiving the initiation command, to activate the emitter200and the image sensor204, and to begin monitoring image data captured by the image sensor204. In some examples, the processor400can also be configured to begin monitoring motion data generated by the motion sensor424, such as data defining an orientation of the device relative to a gravity vector, and/or acceleration of the device in one or more directions.", "", "As discussed in connection withFIG.3, the image data received at block510includes a sequence of images each indicating a location on the image sensor204impacted by a reflection216. The images can be stored in the memory404, e.g., temporarily for further processing as discussed below.", "", "At block515, the processor400can be configured to determine whether the device100has traversed a leading boundary of the object being scanned, such as the leading boundary116of the tire104. Traversing the leading boundary of an object means that as the device100travels along the scan direction, the emitter200passes over the leading boundary116, and thus image data captured at the sensor204includes a sequence of images depicting reflections216from portions of the tire104surrounding and/or at the leading boundary116. More generally, as will be apparent in the discussion herein, the device100traverses a boundary (whether leading or trailing) of an object when the emitter200passes over the boundary and the sensor204captures images representing reflections216, from which depth measurements can be derived, originating from the object around and/or at the boundary.", "", "Detecting whether the device100has traversed the leading boundary can include, for example, determining whether a position of a reflection indicated in a captured image meets a predetermined threshold. In other examples, the positions of reflections in the captured images can be converted to depth measurements (e.g., based on the calibration data mentioned earlier), and the device100can determine whether the depth measurement derived from each image meets a predetermined threshold.", "", "For example, turning toFIG.6, a portion of the tire104is shown, including a sidewall600divided from the treaded surface of the tire104by the leading boundary116. As the device100moves along the scan direction, a set of images604-1,604-2, and604-3are captured. The image604-1is captured at the position of the device100shown in dashed lines. The image604-3is captured at the position of the device100shown in solid lines, at which the beam212impacts the tire104at a point608. The image604-2is captured at a position of the device100in between the two positions mentioned above, at which the beam212impacts the tire104at a point612. In practice, a larger number of images than three may be captured during travel of the device100between the positions illustrated inFIG.6.", "", "In response to capturing each image604, the processor400can compare the position of a reflection in the image, or the depth represented by that position, to a threshold616. The threshold616is shown inFIG.6as a position superimposed on the images604, but can also be defined as a depth measurement rather than an image position. As shown inFIG.6, some images (e.g., the image604-1) contain no reflection, because the beam212does not impact the sidewall600of the tire104, or impacts the sidewall600but does not generate a reflection sufficiently intense to reach the sensor204. Other images may produce reflections216that reach the sensor204, but correspond to depths greater than the threshold616. The determination at block515in connection with the image604-2is affirmative, because the reflection in the image604-2indicates a smaller depth than the threshold616.", "", "In other examples, the determination at block515can include comparing a set of successive images, such as the set of images604, to a predetermined pattern, such as the pattern620shown inFIG.6, to determine whether the reflections shown in the set of images match the pattern620(e.g., fit the pattern within a predetermined degree of error, or the like). In other examples, the set of images can be provided as inputs to a classification model trained on labelled sets of images representing leading boundaries of various tires. The model, in other words, represents a predetermined pattern, and can return a classification indicating whether the input set of images corresponds to a leading boundary of the tire104.", "", "Returning toFIG.5, when the determination at block515is negative, the device100can continue monitoring sensor data at block510. In some examples, the processor400can also monitor a timeout period initiated in response to the command from block505. If no affirmative determination at block515is made within the timeout period, the method500may be terminated, e.g., and an error notification can be generated on the display412, via a speaker, or the like. The processor400can also monitor data from the motion sensor424during the timeout period in some examples, e.g., to determine whether the orientation of the device100indicates that the device100is positioned for scanning (e.g., positioned horizontally), and/or whether the device100is moving substantially linearly (e.g., indicating movement along the scan direction). When the device is idle (e.g., not moving linearly), and/or when the device is not in an active scanning orientation (e.g., substantially horizontal, as shown inFIG.1), the above error notification can be generated when the timeout period expires.", "", "When the determination at block515is affirmative, the device100proceeds to block520. In some examples, block515can be omitted, and the scan command from block505can lead directly to block520. In other words, in some examples a trigger pull or other input command can immediately begin a profile capture, rather than initiating monitoring of sensor data for a leading edge of the tire104.", "", "At block520, the device100is configured to capture a profile (e.g., a profile of the tire104). Capturing the profile includes storing or otherwise processing images from the sequence of images captured by the sensor204to generate a profile. In other words, certain images from the sequence contribute to the profile, while others, such as those captured before the affirmative determination at block515, do not contribute to the profile. The device100is configured, based on the detection of the leading boundary at block515, to determine a scan trigger point, e.g., such as an initial image in the sequence captured by the sensor204that will contribute to the profile. The scan trigger point determined at block520, in other words, marks the start of a set of images in the full sequence that will contribute to the profile. The other scan trigger point, marking the end of the set, is determined later in the method500. That is, at block520, the scan operation has begun, but need not have a defined time period.", "", "At block525, having begun accumulating image data for profile generation, the processor400is configured to detect whether the device100has traversed a trailing boundary of the object being scanned, such as the tire104. The detection of the trailing boundary can include, for example, determining whether a depth of the treaded surface as indicated in an image captured by the sensor204is greater than the threshold616(rather than being smaller than the threshold616, as at block515. The detection of the trailing boundary can also be based on matching a predetermined pattern corresponding to a trailing boundary of a tire104, as noted above in connection with leading boundary detection at block515.", "", "When the determination at block525is negative, the device100can be configured to continue capturing data for the profile. In some examples, the device100can determine whether to terminate the scan at block530, despite not yet having detected a trailing boundary. For example, the device100can determine whether motion data from the motion sensor424indicates that the device100has returned to a non-scanning orientation, has stopped moving linearly, or the like. In some examples, the device100can compare the time elapsed since initiating profile capture at block520has exceeded a timeout threshold (e.g., a period expected to exceed most or all scans, even those performed on large tires by inexperienced users).", "", "When the determination at block530is negative, the device100continues capturing data for the profile, and monitoring incoming sensor data for a trailing boundary. When the determination at block530is affirmative, or following an affirmative determination at block525, the device proceeds to block535.", "", "At block535, the device100is configured to complete capture of the profile initiated at block520. Completing the profile can include determining, based on the detection at block525that the device100traversed the trailing boundary120, a further scan trigger point representing the final sample of image data that contributes to the profile. The device100can therefore select the contiguous set of images between the initial and final scan trigger points, and generate a profile (e.g., of the treaded surface of the tire104) based on the selected images.", "", "Turning toFIG.7, a sequence700of images is illustrated. A set704of images is selected from the sequence700according to a first scan trigger point708and a second scan trigger point712. As will be apparent, the first scan trigger point708is an image for which an affirmative determination was made at block515, and the second scan trigger point712is an image for which an affirmative determination was made at block525. The set704of images is used to generate a profile716, e.g., as discussed in connection withFIG.3. The images outside the set704can be discarded.", "", "As noted above, the device100can also complete the profile at block535in response to an affirmative determination at block530, without detecting a trailing boundary of the tire104. For example, turning toFIG.8, the device100may be lifted from the scanning orientation shown in dashed lines (e.g., substantially horizontal) towards a portrait orientation shown in solid lines, before the trailing boundary120is detected in the image data captured by the sensor204. In response to detecting that an angle of orientation of the device100deviates from the scanning orientation by more than a threshold (e.g., ten degrees, although a wide variety of other thresholds can also be employed), the determination at block530may be affirmative. The angle of orientation assessed at block530can include any combination of a pitch angle800, a yaw angle804, and a roll angle808.", "", "Turning toFIG.9, in response to the affirmative determination at block530, the device100may, at block535, complete the profile by determining a second trigger point900within the sequence700, and generate a profile916based on the images between the first scan trigger point708and the second scan trigger point900. The profile916, as seen by comparison with the profile716shown inFIG.7, is cut off earlier and may not depict the trailing boundary120of the tire104. The profile916may still be usable, however. When the device100generates a profile following an affirmative determination at block530, the device100can generate a notification (e.g., an audible beep, a warning on the display412, or the like) indicating that the profile may have been completed prematurely.", "", "Returning toFIG.5, at block540the device100can be configured to determine whether to initiate another scan. For example, the ability of the device100to dynamically determine scan trigger points permits the device to generate sequential profiles for sets of tires104, e.g., mounted on tractor trailers, aircraft, or other systems with multiple banks of adjacent tires104. The device100can, for example, be operated in a single-scan mode or a multi-scan mode, and the determination at block540can include determining whether the multi-scan mode is active. When the determination at block540is affirmative, the device100can return to block510and begin monitoring image and, optionally, motion data for a further leading boundary (e.g., of another tire104). When the determination at block540is negative, the device100can terminate the performance of the method500, e.g., by disabling the image sensor204and the motion sensor424.", "", "In some examples, certain processing described above as being performed by the device100can be performed by a host computing device, such as a tablet computer or the like communicatively coupled with the device100(e.g., via a short-range connection such as a Bluetooth™ connection). For example, the device100can be configured to transmit image and motion data to the host computing device, substantially in real time. The host computing device can then be configured to perform the determinations at one or more of blocks515,525, and530, and return commands to the device100indicating the outcome of such determinations.", "", "In the foregoing specification, specific embodiments have been described. However, one of ordinary skill in the art appreciates that various modifications and changes can be made without departing from the scope of the invention as set forth in the claims below. Accordingly, the specification and figures are to be regarded in an illustrative rather than a restrictive sense, and all such modifications are intended to be included within the scope of present teachings.", "", "The benefits, advantages, solutions to problems, and any element(s) that may cause any benefit, advantage, or solution to occur or become more pronounced are not to be construed as a critical, required, or essential features or elements of any or all the claims. The invention is defined solely by the appended claims including any amendments made during the pendency of this application and all equivalents of those claims as issued.", "", "Moreover in this document, relational terms such as first and second, top and bottom, and the like may be used solely to distinguish one entity or action from another entity or action without necessarily requiring or implying any actual such relationship or order between such entities or actions. The terms “comprises,” “comprising,” “has”, “having,” “includes”, “including,” “contains”, “containing” or any other variation thereof, are intended to cover a non-exclusive inclusion, such that a process, method, article, or apparatus that comprises, has, includes, contains a list of elements does not include only those elements but may include other elements not expressly listed or inherent to such process, method, article, or apparatus. An element proceeded by “comprises . . . a”, “has . . . a”, “includes . . . a”, “contains . . . a” does not, without more constraints, preclude the existence of additional identical elements in the process, method, article, or apparatus that comprises, has, includes, contains the element. The terms “a” and “an” are defined as one or more unless explicitly stated otherwise herein. The terms “substantially”, “essentially”, “approximately”, “about” or any other version thereof, are defined as being close to as understood by one of ordinary skill in the art, and in one non-limiting embodiment the term is defined to be within 10%, in another embodiment within 5%, in another embodiment within 1% and in another embodiment within 0.5%. The term “coupled” as used herein is defined as connected, although not necessarily directly and not necessarily mechanically. A device or structure that is “configured” in a certain way is configured in at least that way, but may also be configured in ways that are not listed.", "", "Certain expressions may be employed herein to list combinations of elements. Examples of such expressions include: “at least one of A, B, and C”; “one or more of A, B, and C”; “at least one of A, B, or C”; “one or more of A, B, or C”. Unless expressly indicated otherwise, the above expressions encompass any combination of A and/or B and/or C.", "", "It will be appreciated that some embodiments may be comprised of one or more specialized processors (or “processing devices”) such as microprocessors, digital signal processors, customized processors and field programmable gate arrays (FPGAs) and unique stored program instructions (including both software and firmware) that control the one or more processors to implement, in conjunction with certain non-processor circuits, some, most, or all of the functions of the method and/or apparatus described herein. Alternatively, some or all functions could be implemented by a state machine that has no stored program instructions, or in one or more application specific integrated circuits (ASICs), in which each function or some combinations of certain of the functions are implemented as custom logic. Of course, a combination of the two approaches could be used.", "", "Moreover, an embodiment can be implemented as a computer-readable storage medium having computer readable code stored thereon for programming a computer (e.g., comprising a processor) to perform a method as described and claimed herein. Examples of such computer-readable storage mediums include, but are not limited to, a hard disk, a CD-ROM, an optical storage device, a magnetic storage device, a ROM (Read Only Memory), a PROM (Programmable Read Only Memory), an EPROM (Erasable Programmable Read Only Memory), an EEPROM (Electrically Erasable Programmable Read Only Memory) and a Flash memory. Further, it is expected that one of ordinary skill, notwithstanding possibly significant effort and many design choices motivated by, for example, available time, current technology, and economic considerations, when guided by the concepts and principles disclosed herein will be readily capable of generating such software instructions and programs and ICs with minimal experimentation.", "", "The Abstract of the Disclosure is provided to allow the reader to quickly ascertain the nature of the technical disclosure. It is submitted with the understanding that it will not be used to interpret or limit the scope or meaning of the claims. In addition, in the foregoing Detailed Description, it can be seen that various features are grouped together in various embodiments for the purpose of streamlining the disclosure. This method of disclosure is not to be interpreted as reflecting an intention that the claimed embodiments require more features than are expressly recited in each claim. Rather, as the following claims reflect, inventive subject matter lies in less than all features of a single disclosed embodiment. Thus the following claims are hereby incorporated into the Detailed Description, with each claim standing on its own as a separately claimed subject matter."], "claims": ["monitoring sensor data including one or more representations of a treaded surface captured by a device; detecting, based on the sensor data, that the device has traversed a boundary of the treaded surface; in response to detecting that the device has traversed the boundary, determining a scan trigger point within the one or more representations; and generating a profile of the treaded surface from the one or more representations based on the scan trigger point.", "2 . The method of claim 1 , wherein detecting that the device has traversed the boundary includes comparing a depth derived from a representation to a threshold depth.", "comparing a set of successive representations to a predetermined pattern; and determining that the set of representations matches the predetermined pattern.", "4 . The method of claim 1 , wherein the sensor data further includes motion data, and wherein detecting that the device has traversed the boundary includes determining, based on the motion data, that an orientation of the device matches a predetermined scan orientation.", "5 . The method of claim 1 , wherein the boundary of the treaded surface is a leading boundary, and wherein the determined scan trigger point corresponds to a start of the profile.", "6 . The method of claim 1 , wherein the boundary of the treaded surface is a trailing boundary, and wherein the determined scan trigger point corresponds to an end of the profile.", "prior to the detecting, receiving a scan command at an input of the device, wherein the capture command corresponds to a beginning of the profile.", "8 . The method of claim 7 , further comprising: in response to generating the profile, terminating monitoring of the sensor data.", "9 . The method of claim 7 , further comprising: in response to generating the profile, monitoring the sensor data to detect, based on the sensor data, that the device has traversed a further boundary of a further treaded surface.", "10 . The method of claim 1 , wherein the sensor data is captured by a sensor, and wherein the one or more representations depict reflections of a beam of light emitted by a device configured to traverse a treaded surface.", "11 . The method of claim 1 , wherein the one or more representations of the treaded surface includes one or more images of the treaded surface.", "an emitter; a sensor; and a processor configured to: monitor sensor data including one or more representations of a treaded surface captured by the sensor; detect, based on the sensor data, that the device has traversed a boundary of the treaded surface; in response to detecting that the device has traversed the boundary, determine a scan trigger point within the one or more representations; and generate a profile of the treaded surface from the one or more representations based on the scan trigger point.", "13 . The computing device of claim 12 , wherein the processor is configured to detect that the device has traversed the boundary by comparing a depth derived from an representation to a threshold depth.", "comparing a set of successive representations to a predetermined pattern; and determining that the set of representations matches the predetermined pattern.", "15 . The computing device of claim 12 , wherein the sensor data further includes motion data, and wherein the processor is configured to detect that the device has traversed the boundary by determining, based on the motion data, that an orientation of the device matches a predetermined scan orientation.", "16 . The computing device of claim 12 , wherein the boundary of the treaded surface is a leading boundary, and wherein the determined scan trigger point corresponds to a start of the profile.", "17 . The computing device of claim 12 , wherein the boundary of the treaded surface is a trailing boundary, and wherein the determined scan trigger point corresponds to an end of the profile.", "prior to the detecting, receiving a scan command at an input of the device, wherein the capture command corresponds to a beginning of the profile.", "in response to generating the profile, terminating monitoring of the sensor data.", "in response to generating the profile, monitoring the sensor data to detect, based on the sensor data, that the device has traversed a further boundary of a further treaded surface.", "21 . The computing device of claim 12 , wherein the one or more representations depict reflections of a beam of light emitted by a device configured to traverse a treaded surface.", "22 . The computing device of claim 12 , wherein the one or more representations of the treaded surface includes one or more images of the treaded surface."], "bibtex": "@patent{20240359508,\n    title = {Adaptive Sensor Data Acquisition},\n    number = {20240359508},\n    year = {2024},\n    note = {File: US20240359508A1-20241031.XML}\n    }", "classification": "B60C1124FI"}, {"title": "PNEUMATIC VEHICLE TIRE", "doc_number": "20240359509", "filename": "US20240359509A1-20241031.XML", "abstract": "A pneumatic vehicle tire having a tread, a belt assembly, a radial carcass, and having sidewalls which in each case in their radially outer region have at least two rows of parallelogram-shaped elevations with a height of 0.80 mm to 1.50 mm, determined in relation to the remaining level of the sidewall, said rows running so as to be concentric with the annular shape of the sidewall, wherein in which intermediate spaces are present between the elevations within one row and between mutually adjacent rows. The rows of elevations are mutually offset in the circumferential direction of the sidewall, with the elevations overlapping one another, wherein the intermediate spaces between the elevations are also mutually offset in the circumferential direction from row to row, so as not to be co-aligned.", "detailed_description": ["Pneumatic vehicle tires embodied according to the invention are radial tires for motor vehicles, preferably tires for passenger motor vehicles, SUVs, vans or light trucks.", "", "The pneumatic vehicle tire shown inFIG.1has as substantial components a tread1, which in a way not shown is provided with a tread profile, bead regions2with bead cores3, sidewalls4, a multi-layer belt assembly5, and a carcass insert6. Installed radially outside the bead core3is a core profile7which, conjointly with the bead core3, encircles the tire.", "", "The sidewalls4consist of a rubber material and run along the outside of the tire along the carcass insert6, between the belt assembly5and the bead regions2. In order to facilitate a low rolling resistance of the pneumatic vehicle tire by reducing weight, the sidewalls4are kept relatively thin. In the case of thin sidewalls4, the risk that the carcass insert6is also damaged when contacting curb edges or the like is greater than in the case of thicker sidewalls.", "", "In order to make the sidewalls4more robust in relation to external influences, they are reinforced, as shown in particular inFIG.3andFIG.4, with rows9,9′ of block-shaped elevations8,8′ which run in parallel and next to one another and protrude from the remaining sidewall level4a(FIG.2) and in relation to this level have a top face8′awith a constant height h, the latter being 0.80 mm to 2.00 mm, in particular 1.00 mm. The elevations8,8′ have lateral faces8b,8′bdescending from the top face8a,8′ato the sidewall level4a. In the embodiment according toFIG.2andFIG.3, the lateral faces8bare inclined at an angle of 30° to 60°, in particular 45°, in relation to the sidewall level4a; in the embodiment according toFIG.4, the lateral faces8′bare inclined at an angle of 70° to 90° in relation to the sidewall level4a. The rows9,9′, the number of which is at least two and in particular up to five, follow concentrically the annular shape of the sidewall4and are therefore annular segments which run continuously within a wider sidewall portion4bthat comprises all of the rows9,9′ and runs over the circumference of the sidewall4, or part of the circumference, for example at least three quarters of the circumference.", "", "As shown in particular inFIG.1, the sidewall portion4bcovers a sidewall region in the radial direction between a first height h1, which is 30% to 50% of the cross-sectional height H and a second height h2, which is 80% to 97% of the cross-sectional height H.", "", "In the preferred embodiment shown inFIG.3andFIG.4, the number of elevations8,8′ in rows9,9′ is identical within a sidewall portion4b, wherein elevations8,8′ of identical size and identical design are preferably present in a parallelogram shape, when viewed from above, within each row9,9′.", "", "FIG.3shows an embodiment having parallelogram-shaped elevations8with two acute angles from 30° to 70° and two corresponding obtuse angles, two longer sides which are slightly curved in the circumferential extent of the sidewall4and in accordance with the annular shape, having a length l of 15.00 mm to 30.00 mm, in particular at least 20.00 mm, determined along their chord, wherein the length l of the elevations8located within the radially innermost row9is less than the length l of the elevations8in the radially outermost row9and increases from the innermost to the outermost. The width b of the elevations8, determined in the radial direction, is 5.00 mm to 12.00 mm, wherein the width b is identical in all or some rows9, or increases from the radially innermost row9in the direction toward the radially outermost row9.", "", "Intermediate spaces11are located between the elevations8within the rows9, the width a1of said intermediate spaces11at the sidewall level4abeing in the order of 1.00 mm to 5.00 mm, in particular at least 2.00 mm, and preferably being constant between the elevations8within a specific row9. Also present between adjacent rows9are intermediate spaces12, the width a2of which being 1.00 mm to 5.00 mm, in particular 2.00 mm to 5.00 mm, wherein the width a2can be increasingly larger the further radially outside a row9is located.", "", "The mutual arrangement of the elevations8in the adjacent rows9is of such a type that they are mutually offset from row9to row9in the same circumferential direction over, for example, 25% to 50% of their lengths L and therefore overlap one other in such a manner that no co-aligned intermediate spaces11are present.", "", "The intermediate spaces11,12between the elevations8and between adjacent rows9in the preferred embodiment shown inFIG.3are provided with a crosshatch of parallel running micro-ribs10with a dome-shaped or triangular cross section, with a maximum height of 0.20 mm to 0.30 mm in relation to the other sidewall level4a, and a likewise width at their base. These micro-ribs10can furthermore have a mutual spacing of 0.10 mm to 0.20 mm at their base. For design reasons, it can also be provided that micro-ribs10extend beyond the surfaces of the elevations8. Additionally, a narrow, approximately 1.50 mm to 2.00 mm wide boundary strip can be provided radially within the radially innermost row9and radially outside the radially outermost row9with micro-ribs10, as described. As shown inFIG.3, an inscription of any characters can be configured as local additional elevations across one row9or across a plurality of rows9.", "", "Instead of the parallelogram shape with two acute and two obtuse angles when viewed from above, as illustrated and described, the elevations8may also have the shape of rhombs. Alternatively, the elevations have the shape of rectangles which are elongate in the circumferential direction.", "", "FIG.4shows a design which, when viewed from above, has square elevations8′ with an edge length I′ from 6.00 mm to 20.00 mm. The further radially inside the elevations8′ are, the smaller their edge length l′. The intermediate spaces11′,12′ between the elevations8′ have a width a1′ of 3.0 mm to 7.00 mm; the width a2′ between adjacent rows9′ is 1.5 mm to 5.00 mm. Intermediate spaces11′,12′ between elevations8′ are provided with a hatching of micro-ribs10′ running parallel to one another in such a manner that, when viewed onto the sidewall4, the impression of cube-shaped elevations8′ is created. In this case, micro-ribs10′ can also run across surfaces of elevations8′. The design of the micro-ribs10′ corresponds to that of the micro-ribs10.", "", "In another embodiment not shown, the number of elevations provided in one row differs from the number of elevations provided in at least one further row, for example in that one elevation is in each case present instead of the two elevations otherwise provided. The dimensions of the elevations and the intermediate spaces between them are mutually adapted in order to ensure mutual overlapping of the elevations from the adjacent rows."], "claims": ["1 .- 14 . (canceled)", "wherein intermediate spaces are present between the elevations within one row and between mutually adjacent rows, wherein the rows of elevations are mutually offset in the circumferential direction of the sidewall, with the elevations overlapping one another, wherein the intermediate spaces between elevations are also mutually offset in the circumferential direction from row to row, so as not to be co-aligned.", "16 . The pneumatic vehicle tire as claimed in claim 15 , wherein the intermediate spaces between the elevations have constant widths.", "17 . The pneumatic vehicle tire as claimed in claim 15 , wherein the elevations in all rows when viewed from above have a parallelogram shape with two acute angles of 30° to 70°, which angles in the elevations match within all rows, wherein the elevations in all rows are identically aligned in the circumferential direction.", "18 . The pneumatic vehicle tire as claimed in claim 15 , characterized in that the elevations in all rows are rectangular when viewed from above.", "19 . The pneumatic vehicle tire as claimed in claim 15 , wherein all rows within a sidewall portion which extends in the circumferential direction have the same number of elevations.", "20 . The pneumatic vehicle tire as claimed in claim 15 , wherein the elevations in the rows within a sidewall portion which extends in the circumferential direction are in each case of identical design.", "21 . The pneumatic vehicle tire as claimed in claim 15 , wherein the elevations in the circumferential direction of the sidewall have a length of 15.00 mm to 30.00 mm, and in the radial direction have a width of 5.00 mm to 12.00 mm.", "22 . The pneumatic vehicle tire as claimed in claim 21 , wherein the elevations in the circumferential direction of the sidewall have a length of 20.00 mm to 30.00 mm.", "23 . The pneumatic vehicle tire as claimed in claim 18 , wherein, when viewed from above, the rectangular elevations are square elevations and have an edge length of 6.00 mm to 20.00 mm.", "24 . The pneumatic vehicle tire as claimed in claim 15 , wherein the elevations have lateral faces which run at an angle of 30° to 90° in relation to the level of the sidewall.", "25 . The pneumatic vehicle tire as claimed in claim 15 , wherein the elevations have lateral faces which run at an angle of 30° to 60° in relation to the level of the sidewall.", "26 . The pneumatic vehicle tire as claimed in claim 15 , wherein the widths of the intermediate spaces between the elevations within a row are 1.00 to 7.00 mm, and between adjacent rows are 1.00 to 5.00 mm.", "27 . The pneumatic vehicle tire as claimed in claim 15 , wherein the widths of the intermediate spaces between the elevations within a row are 2.00 to 7.00 mm, and between adjacent rows are 1.50 to 5.00 mm.", "28 . The pneumatic vehicle tire as claimed in claim 15 , wherein the number of rows is three to five.", "29 . The pneumatic vehicle tire as claimed in claim 15 , wherein the rows on the sidewall cover a sidewall portion which in the radial direction extends between a first height, which is 40% to 50% of the cross-sectional height of the tire, and a second height, which is 80% to 97% of the cross-sectional height of the tire.", "30 . The pneumatic vehicle tire as claimed in claim 15 , wherein the rows run continuously over at least a major part of the circumference of the sidewall.", "31 . The pneumatic vehicle tire as claimed in claim 15 , wherein the rows run continuously over at least three quarters of the circumference of the sidewall.", "32 . The pneumatic vehicle tire as claimed in claim 15 , wherein the intermediate spaces between elevations and/or between adjacent rows are provided with a crosshatch of parallel micro-ribs, with a maximum height of 0.20 mm to 0.30 mm in relation to the sidewall level, and a likewise width at their base.", "33 . The pneumatic vehicle tire as claimed in claim 32 , wherein the micro-ribs are dome-shaped or triangular cross-section.", "34 . The pneumatic vehicle tire as claimed in claim 32 , wherein the micro-ribs also run over surfaces of elevations."], "bibtex": "@patent{20240359509,\n    title = {PNEUMATIC VEHICLE TIRE},\n    number = {20240359509},\n    year = {2024},\n    note = {File: US20240359509A1-20241031.XML}\n    }", "classification": "B60C1302FI"}, {"title": "SYSTEM AND METHOD FOR AUTOMATIC PRESSURE MANAGEMENT", "doc_number": "20240359510", "filename": "US20240359510A1-20241031.XML", "abstract": "A pressure management system for a tire assembly on a vehicle including: a housing unit, a pump, and a power interface.", "detailed_description": [""], "claims": ["a wheel-end inflation system mounted to a wheel of a vehicle, comprising: a pump configured to inflate a tire mounted to the wheel; a local control system configured to control the pump based on a set of control instructions; and a set of sensors configured to collect measurements about the wheel-end inflation system; and a communications system mounted to the vehicle and configured to: transmit the measurements to a remote control system configured to dynamically determine new control instructions based on the measurements; receive the new control instructions from the remote control system; and transmit the new control instructions to the local control system, wherein the local control system controls the pump based on the set of new control instructions.", "2 . The system of claim 1 , wherein the new control instructions comprise a target pressure.", "3 . The system of claim 1 , wherein the new control instructions are dynamically determined during operation of the vehicle.", "4 . The system of claim 1 , wherein the measurement transmission is based on a wheel rotation speed.", "5 . The system of claim 4 , wherein the measurements are transmitted when the wheel rotation speed is zero.", "6 . The system of claim 1 , wherein the local control system is configured to wirelessly transmit measurements to the communications system.", "7 . The system of claim 1 , wherein the communications system is mounted to the wheel-end inflation system.", "8 . The system of claim 1 , wherein the pump is driven by an eccentric mass moving relative to the pump during vehicle operation.", "9 . The system of claim 8 , wherein the local control system is powered by a battery mounted to the wheel of the vehicle.", "controls the pump based on an operation mode; and dynamically switches operation modes based on the measurements.", "11 . The system of claim 1 , wherein the communications system is further configured to send notifications to a user device.", "a set of tire inflation systems, each configured to mount to a wheel of a vehicle, wherein each tire inflation system comprises: a pressurized fluid source; a set of sensors configured to sample a set of measurements; and a processing system configured to control operation of the pressurized fluid source based on a set of tire pressure targets; and a remote controller, remote from the set of tire inflation systems and configured to: determine a new set of tire pressure targets based on each set of measurements; and transmit the new set of tire pressure targets to a plurality of tire inflation systems during operation of the vehicle, wherein the processing system of each tire inflation system is configured to control operation of the respective pressurized fluid source based on the new set of tire pressure targets.", "13 . The system of claim 12 , wherein the set of tire pressure targets comprise a set of tire pressure ranges.", "14 . The system of claim 12 , wherein each tire inflation system additionally comprises a valve fluidly connected to the pressurized fluid source, and wherein the processing system is additionally configured to control the valve.", "15 . The system of claim 14 , wherein the valve is configured to facilitate a flow of air.", "16 . The system of claim 12 , wherein the new set of tire pressure targets comprises different tire pressure targets for each tire inflation system in the set of tire inflation systems.", "17 . The system of claim 12 , wherein each tire inflation system in the set of tire inflation systems is mounted to a wheel hub.", "18 . The system of claim 12 , wherein the new set of tire pressure targets are determined based on route parameters.", "19 . The system of claim 18 , wherein the new set of tire pressure targets are determined based on data captured by tire inflation systems on other vehicles.", "20 . The system of claim 19 , wherein the data captured by tire inflation systems on other vehicles comprises historic operation data."], "bibtex": "@patent{20240359510,\n    title = {SYSTEM AND METHOD FOR AUTOMATIC PRESSURE MANAGEMENT},\n    number = {20240359510},\n    year = {2024},\n    note = {File: US20240359510A1-20241031.XML}\n    }", "classification": "B60C2300FI"}, {"title": "SCALE FOR A TOWABLE VEHICLE", "doc_number": "20240359511", "filename": "US20240359511A1-20241031.XML", "abstract": "A scale including a frame configured to mount a caravan or trailer at a very similar height and location as a trailer hitch, to provide the trailer with weighing geometry similar to real towing conditions. There is also described a scale which mounts on a prime mover hitch, having a weighing station adjacent the hitch, disposed at the same level as the hitch. Also, there is described a tow ball load scale including: a frame including: a mount for mounting the frame to a coupler, towball or hitch of a prime mover; a towball or coupler receiver spaced along the frame from the mount, the towball or coupler mount being configured to cooperate with a trailer coupler for measuring a vertical towball load, and further including one or more load cells disposed thereon. There is also described a method of measuring a trailer towball downforce, the method including the steps of: receiving downforce load cell signal data relating to towball load in a computer processor from a towball or coupler receiver; using the downforce load cell signal data in a fit function saved in the computer processor to output a calculated trailer downforce load data; comparing the calculated trailer downforce load data with threshold load data to produce a safety data signal; sending the safety data signal and/or calculated trailer downforce data to a mobile device, or selecting a lamp or alert actuation signal and sending to a selected lamp or loudspeaker mounted on the frame, based on the safety data signal.", "detailed_description": [""], "claims": ["a frame including: a mount at a proximal end for mounting the frame to a coupler, towball or hitch of a prime mover; a weighing station disposed on a second coupling region, adjacent the mount on the frame.", "2 . The scale in accordance with claim 1 wherein the weighing station includes a towball, or coupler receiver, spaced along the frame from the mount towards a distal end, the towball or coupler mount being configured to cooperate with a trailer coupler for measuring a vertical towball load, and further including one or more load cells disposed thereon.", "3 . The scale in accordance with claim 2 wherein the mount includes a hitch receiving zone to receive a hitch.", "4 . The scale in accordance with claim 3 wherein the hitch receiving zone includes a towball retainer.", "5 . The scale in accordance with claim 4 wherein the hitch receiving zone includes a skirt for locating the frame on a hitch tongue.", "6 . The scale in accordance with claim 5 wherein the towball retainer includes a towball retaining bar at a proximal end of the frame, to hook under the shoulder of a towball, inhibiting release under load.", "7 . The scale in accordance with claim 6 wherein the hitch receiving zone is at a proximal end of the frame, and the weighing station is spaced from the hitch receiving zone, toward the distal end of the frame.", "8 . The scale in accordance with claim 7 wherein an adjuster is provided which adjusts the level of the weighing station relative to the mount.", "9 . The scale in accordance with claim 8 wherein there is provided a lock to lock the frame onto the hitch tongue of the prime mover.", "10 . The scale in accordance with claim 9 wherein the lock is a threaded screw or bolt mounted on the riser or skirt, which can lock the frame to the hitch of the towing vehicle.", "11 . The scale in accordance with claim 3 wherein the weighing station is a mock towball.", "12 . The scale in accordance with claim 11 wherein the mock towball includes a single 1-axis load cell, oriented to measure vertical load.", "13 . The scale in accordance with claim 12 wherein the mock towball includes a hollow towball with a bore for receiving a load cell actuator pin.", "14 . The scale in accordance with claim 13 wherein the load cell actuator pin is fastened in the bore with a fastener and/or adhesive resin.", "15 . The scale in accordance with claim 14 wherein the weighing station includes alert lights of different colours for different load conditions calculated by the processor.", "16 . The scale in accordance with claim 15 wherein the weighing station includes loudspeaker for making alert sounds.", "17 . The scale in accordance with claim 16 wherein the weighing station is powered by a trailer plug.", "18 . The scale in accordance with claim 17 wherein the weighing station includes a trailer plug with at least one power pin to the auxiliary pin on the prime mover socket and/or the lights pin on the prime mover socket."], "bibtex": "@patent{20240359511,\n    title = {SCALE FOR A TOWABLE VEHICLE},\n    number = {20240359511},\n    year = {2024},\n    note = {File: US20240359511A1-20241031.XML}\n    }", "classification": "B60D106FI"}]