[{"title": "AUTOMATICALLY ACTUATED SELF-SEALING VENT PLUG", "doc_number": "20250121628", "filename": "US20250121628A1-20250417.XML", "abstract": "A vent plug having a main vent aperture that extends from an inner side into the plug and connects to a transverse vent passage that intersects the main vent aperture. The main vent aperture and the transverse vent passage are connected to provide a continuous path for fluid communication. The main vent aperture includes a conical surface that is tapered to be narrower nearer the inner side of the vent plug. A poppet is located within the main vent passage and the poppet has a stem that extends from a distal portion of the poppet. The stem has a shoulder that is opposite the distal portion. The distal portion is adjacent to the conical portion of the main vent aperture. The distal portion has an annular recess for receiving a seal. The poppet is movable between an open and closed position.", "detailed_description": ["FIG.1shows a perspective view of a hubcap8into which a plug10is inserted. The hubcap8fits into the hub and seals the chamber holding wheel bearings. The hub and bearings are not shown but the use of a hubcap to seal the open end of a bearing chamber is well known in the trailer industry where the plug10of the present invention is particularly useful. The plug10fits into a hole14in the hubcap8.", "", "The plug10has an inner surface20that faces toward the bearings when it is installed in a hubcap8. The plug10has an apron26that is designed to be on the inside of the hubcap8when the plug10is installed within it. The apron26has a retention groove28that is designed to be an interference fit within the hole14of the hubcap8. The plug10is typically made of an elastomeric material having a relatively stiff durometer (approximately 75) and will resiliently bend to form an airtight and watertight seal with the hubcap8. Because the apron26is larger than the hole14into which the plug10is installed, it will be securely retained in the hubcap8. The apron26surrounds an annular channel32that allows for flexing of the apron26inwardly as it is installed into the hubcap8.", "", "Within the plug10is a valve assembly38.FIG.9shows the valve assembly38that is a separate part from the plug10itself. The valve assembly38may be made of harder materials than the plug10itself and is insertable within the plug10itself. The valve assembly38may be made of metal or plastic. The valve assembly38has a housing42that is a shape of revolution designed to be insertable into the plug10. The housing42has a collar44on its outer diameter48and the outer diameter48on either side of the collar44is generally a cylindrical shape. The housing42has a main vent aperture50that extends through the housing42. The main vent aperture50includes an inner shoulder54near side of the housing42facing the inner surface20of the plug10. Directly adjacent to the inner shoulder54in the main vent aperture50is a pilot diameter56that is a relatively narrow diameter adjacent to the inner shoulder54. The pilot diameter56is a smooth guiding surface that continues into a conical surface60. The conical surface60is narrower near the side of the housing42that faces the inner surface20of the plug10. The conical surface60is widest near the end of the housing42opposite where it faces the inner surface20of the plug10.", "", "A poppet68is held within the main vent aperture50. The poppet68has a pair of shoulders70at one end. The shoulders70of the poppet68are designed to be a clearance fit within the main vent aperture50near the inner surface of the plug10. A stem74extends from the shoulders70of the poppet68in the opposite direction of the inner surface20of the plug10. The stem74is a flat bar that extends away from the shoulders70. The stem74has rounded sides78that act as a guide within the pilot diameter56of the main vent aperture50. The stem74also has flat sides79that are well spaced from the pilot diameter56as shown inFIG.8. A spring80is compressed between the shoulders70of the poppet68and the inner shoulder54of the main vent aperture50. As shown inFIGS.6-9, the spring80is a compression spring that circumscribes the stem74and pushes against the shoulders70of the poppet68and the inner shoulder54of the main vent aperture50. It is contemplated that other types of springs or biasing mechanisms could be used to bias the poppet68in the same manner as spring80. The rounded sides78of the stem74allow the poppet68to slide within the pilot diameter56of the main vent aperture50without cocking in a fashion that would cause the poppet68to jamb at an awkward angle. The clearance between the rounded sides78and the pilot diameter56is small enough that simultaneous engagement of both rounded sides78is possible on opposite sides of the stem74. It should also be noted that the shoulders70are rounded to slidingly engage an inboard diameter75in the main vent aperture50and this also facilitates smooth movement of the poppet68. The shoulders70slide smoothly within the inboard diameter75and this sliding enhances the guided length of the poppet68so that it is less likely to cock within the pilot diameter56. This configuration significantly reduces the chance that the poppet68will bind in the pilot diameter56. The shoulders70are centered with respect to the rounded sides78of the stem74. This allows unobstructed passage of fluid around the stem74through the pilot diameter56because of the relatively distant spacing of the flat sides79and the pilot diameter when compared to the much close spacing of the rounded sides78and the pilot diameter56. As can be seen inFIGS.6and7, the poppet68is movable in an axial direction from a closed position (shown inFIG.7) to an open position (shown inFIG.8). The poppet68has a distal portion88that is opposite to its shoulders70. The distal portion88of the poppet68is different than the stem74in that it is a shape of revolution having a recess90for receiving an O-ring92that acts as a seal. The distal portion88of the poppet68has an outer end surface93. The O-ring92is an elastomeric part that has a larger outer diameter than the pilot diameter56of the main vent aperture50. The recess90is located on the poppet68so that when the spring80is fully compressed, the recess90will be located beyond the outer surface96of the valve assembly38. Compressing the spring80to near its fully compressed height will leave the recess90outside of the housing42so that is accessible for installing the O-ring92into the recess90. Once the O-ring92is snugly held into the recess90by its own elasticity tightening it down within the recess90, the spring80will bias the poppet68into its closed position. The closed position of the poppet68pulls the O-ring92into sealing contact with the conical surface60. Due to the size of the O-ring92, the spring80cannot pull the poppet68back through the pilot diameter56once the O-ring92is installed. The elastomeric nature of the O-ring92will ensure a continuous annular seal around the conical surface60for the entirety of its contact with the conical surface60. The conical surface60serves as a self-centering feature to locate the poppet68at a central location within the main vent aperture50. This self-centering nature of the interface between the O-ring92ensures that when poppet68is moved it begins movement from a position that is centrally aligned within the main vent aperture50. As such, the likelihood that the poppet68will bind or be hindered from movement within the main vent aperture50is minimal.", "", "The valve assembly38is designed to be installed as a unit into the plug10. An inner boss98is spaced from the apron26by the annular channel32so that the annular sidewall100of boss98may flex outwardly to accept the valve assembly38being pushed into the plug10. Once the valve assembly38is installed into the plug10, there is a continuous flow path through the main vent aperture50and into transverse holes104in the plug10itself. The transverse holes104act as transverse vent passages. The transverse holes104intersect with the main vent aperture50to form a continuous flow path through the plug10when the poppet68is in its open position. Because the valve assembly38is tightly held within the plug10and has a collar44the only flow path for any fluid out of the plug10is through the main vent aperture50and the transverse holes104. The spring80is chosen so that a slight pressure rise will allow excess fluid (most likely air) to be expelled through the main vent aperture50and outwardly through the transverse holes104. As fluid is expelled thought the plug10as described, contaminants will not flow backwardly into the plug10and into the main vent aperture50where the contaminants will damage the bearings behind the hubcap8. The transverse holes104prevent direct entry for contaminants, particularly water from pressure washers, because the contaminants would be required to make a ninety degree turn before impinging on the closed poppet68. In other words, the sharp turn lessens the force by which contaminants could enter the main vent aperture50. The seal of the O-ring92is further distanced from the transverse holes104because it is below the outer surface96of the housing42and not in the same plane as the transverse holes104where they connect with the main vent aperture50. The outer end surface93is at or below the outer end surface96of the valve assembly98in the closed position and that allows an unobstructed path for water to travel through oppositely located transverse holes104. This location of the outer end surface93of the poppet68is located to not intersect or obstruct the transverse holes104. In the closed position of the poppet This configuration allows the larger diameter of the distal portion88of the poppet68to shield the O-ring92from damage and contaminants. This shielding will minimize the likelihood that pressure washing the plug10will force contaminants past the O-ring92as it seals on the conical surface60. Operation of the trailer onto which the plug10is installed will generate centrifugal forces that will tend to fling contaminants out of the transverse holes104.", "", "The poppet68of the present invention facilitates a rapid response to any pressure rise within the bearing chamber behind the hubcap8. As can be seen inFIG.8, a predetermined rise in pressure behind the hubcap8, will move the poppet68in an axial direction into its open position as shown inFIG.8. The shape of the stem74facilitates a high flow rate of fluid through the main vent aperture50. Because the stem74is generally rectangular in cross section, with rounded sides78, there is a significant amount of space between the stem74and the pilot diameter56adjacent to the flat sides of the stem74, as shown inFIG.8. This facilitates rapid discharge of fluid past the poppet68, and then a quick return of the poppet68into the closed position because the spring80will bias the poppet68into the closed position once there is no pressure differential. The rapid flow of fluid past the poppet68when it is in its open condition is also enhanced by the fact that the distal portion88is generally conical adjacent to the conical surface60. It is possible in certain circumstances that the bearing chamber behind the hubcap8will have a lower pressure than the ambient air outside of the bearing chamber. This condition is referred to as a negative pressure condition. The negative pressure condition may be caused by the opposite conditions that cause a pressure rise in the bearing chamber. At times, a rapid cooling of the bearing chamber can occur in a marine application. Submerging a hub to which the hubcap8is attached can cause this negative pressure condition. When that negative pressure condition arises, it is usually a transient condition and the plug10can accommodate a negative pressure condition by having the O-ring92deform as the poppet86is pulled slightly inward toward the bearing chamber. In this manner, the poppet68can minimize the negative pressure condition. In this manner of function, the poppet68functions as a bidirectional valve that can stabilize pressure in a negative pressure condition and a positive pressure condition where the pressure in the bearing chamber is higher than outside ambient air."], "claims": ["a main vent aperture extending from an inner side into said plug and connecting to a transverse vent passage intersecting said main vent aperture, said main vent aperture and said transverse vent passage connected to provide a continuous path for fluid communication, said main vent aperture including a conical surface being tapered as to be narrower nearer said inner side of said plug and wider farther from said inner side, said main vent aperture including a shoulder opposite said conical surface; a poppet located within said main vent passage, said poppet having a stem extending from a distal portion of said poppet and said stem having a shoulder opposite said distal portion, said distal portion of said poppet adjacent to said conical surface, said distal portion including an annular recess for receiving a seal, said poppet movable between a closed position, in which said seal contacts said conical surface, and an open position wherein said seal is spaced from said conical surface; a spring located between said shoulder of said main vent aperture and said shoulder of said poppet, said spring biasing said poppet into said closed position.", "2 . The vent plug of claim 1 , wherein said plug includes a pilot diameter within said main vent aperture and said stem includes rounded sides for engaging said pilot diameter within said main vent aperture, said stem including flat sides between said rounded sides and said flat sides being spaced farther from said pilot diameter than said rounded sides.", "3 . The vent plug of claim 2 , wherein said stem includes a pair of shoulders, said shoulders of said stem slidingly engaging said main vent aperture opposite said shoulder of said main vent aperture.", "4 . The vent plug of claim 3 , wherein said stem is surrounded by a coil spring and said coil spring contacts said shoulders of said main vent aperture and said shoulders of said stem.", "5 . The vent plug of claim 1 , wherein said conical surface extends into a pilot diameter for slidingly engaging said stem, said distal portion of said poppet being passable through said pilot diameter when said seal is absent from said annular recess, and said poppet being restrained from passing through said pilot diameter when said seal is retained in said annular recess.", "6 . The vent plug of claim 5 , wherein said poppet includes an outer end surface opposite said shoulder on said distal portion of said poppet, said outer end surface located to not intersect said transverse holes in said closed position.", "7 . The vent plug of claim 5 , wherein said vent plug includes a resiliently deformable apron adjacent to a retention groove, said apron capable of flexing inwardly when installed in a hole.", "a main vent aperture extending from an inner side into said plug and connecting to a transverse vent passage intersecting said main vent aperture, said main vent aperture and said transverse vent passage connected to provide a continuous path for fluid communication, said main vent aperture including a conical surface being tapered as to be narrower nearer said inner side of said plug and wider farther from said inner side; a poppet located within said main vent passage, said poppet having a stem extending from a distal portion of said poppet and said stem having a shoulder opposite said distal portion, said distal portion of said poppet adjacent to said conical surface, said distal portion including an annular recess for receiving a seal, said poppet movable between a closed position in which said seal contacts said conical surface and an open position wherein said seal is spaced from said conical surface; a spring located between said shoulder of said poppet and said plug, said spring biasing said poppet into said closed position.", "9 . The vent plug of claim 8 , wherein said plug includes a pilot diameter within said main vent aperture and said stem includes rounded sides for engaging said pilot diameter within said main vent aperture, said stem including flat sides between said rounded sides and said flat sides being spaced farther from said pilot diameter than said rounded sides.", "10 . The vent plug of claim 9 , wherein said stem is surrounded by a coil spring and said coil spring contacts said plug and said shoulders of said stem.", "11 . The vent plug of claim 8 , wherein said plug includes a pilot diameter within said main vent aperture and said stem includes rounded sides for engaging said pilot diameter within said main vent aperture, said stem including flat sides between said rounded sides and said flat sides and said flat sides being spaced farther from said pilot diameter than said rounded sides.", "12 . The vent plug of claim 8 , wherein said conical surface extends into a pilot diameter for slidingly engaging said stem, said distal portion of said poppet being passable through said pilot diameter when said seal is absent from said annular recess, and said poppet being restrained from passing through said pilot diameter when said seal is retained in said annular recess.", "13 . The vent plug of claim 12 , wherein said poppet includes an outer end surface opposite said shoulder on said distal portion of said poppet, said outer end surface located not to intersect said transverse holes in said closed position.", "14 . The vent plug of claim 12 , wherein said vent plug includes a resiliently deformable apron adjacent to a retention groove, said apron capable of flexing inwardly when installed in a hole.", "including a main vent aperture extending from an inner side into said plug and connecting to a transverse vent passage intersecting said main vent aperture, said main vent aperture and said transverse vent passage connected to provide a continuous path for fluid communication, said main vent aperture including a conical surface being tapered as to be narrower nearer said inner side of said plug and wider farther from said inner side, a resiliently deformable apron adjacent to a retention groove, said apron capable of flexing inwardly when installed in a hole; a poppet located within said main vent passage, said poppet having a stem extending from a distal portion of said poppet and said stem having a shoulder opposite said distal portion, said distal portion of said poppet adjacent to said conical surface, said distal portion including an annular recess for receiving a seal, said poppet movable between a closed position in which said seal contacts said conical surface and an open position wherein said seal is spaced from said conical surface; a spring located between said shoulder of said poppet and said plug, said spring biasing said poppet into said closed position.", "16 . The vent plug of claim 15 , wherein said plug includes a pilot diameter within said main vent aperture and said stem includes rounded sides for engaging said pilot diameter within said main vent aperture, said stem including flat sides between said rounded sides and said flat sides and said flat sides being spaced farther from said pilot diameter than said rounded sides.", "17 . The vent plug of claim 15 , wherein said conical surface extends into a pilot diameter for slidingly engaging said stem, said distal portion of said poppet being passable through said pilot diameter when said seal is absent from said annular recess, and said poppet being restrained from passing through said pilot diameter when said seal is retained in said annular recess.", "18 . The vent plug of claim 17 , wherein said poppet includes an outer end surface opposite said shoulder on said distal portion of said poppet, said outer end surface located not to intersect said transverse holes in said closed position."], "bibtex": "@patent{20250121628,\n    title = {AUTOMATICALLY ACTUATED SELF-SEALING VENT PLUG},\n    number = {20250121628},\n    year = {2025},\n    note = {File: US20250121628A1-20250417.XML}\n    }", "classification": "B60B700FI"}, {"title": "DEFORMABLE WHEEL WITH NON-PNEUMATIC LOAD BEARING AND WITH TREAD HEATING FOR LUNAR AND MARTIAN CONDITIONS", "doc_number": "20250121629", "filename": "US20250121629A1-20250417.XML", "abstract": "Disclosed herein is a deformable wheel with non-pneumatic load bearing intended to equip a vehicle for driving in extreme conditions such as those encountered on the Moon and on Mars, comprising a hub, a laminated strip comprising a plurality of ferrules assembled with the interposition of interposition layers, and a plurality of metal cables connecting the hub to the laminated strip, the laminated strip being covered with at least one thermal insulation coating made of at least one material having a thermal conductivity of less than 0.2 Wm −1 K −1 , and the wheel further comprising means for heating the interposition layers of the laminated strip.", "detailed_description": ["The application relates to a deformable wheel with non-pneumatic load bearing as shown inFIG.1which is suitable for equipping a vehicle intended to run in extreme conditions such as those encountered on the Moon and on Mars.", "", "The wheel2shown inFIG.1mainly comprises a hub4, a laminated annular strip6intended to be in contact with the ground, and a plurality of metal cables8radially connecting the hub to the laminated strip.", "", "As shown inFIGS.2and4, the laminated strip6is composed of a plurality of concentric ferrules6awhich are assembled together by sandwiching interposition layers6beach composed of a material the Young's modulus of which is 600000 to 1000 times lower than that of the ferrules.", "", "The ferrules6amay be metallic (for example made of steel) or made of composite material.", "", "As for the interposition layers6b, they are advantageously made of a hyperelastic elastomer having a glass transition temperature of less than 120° C.", "", "By such a composition of the laminated strip6, the part of the laminated strip which is in contact with the ground deforms under a load applied from the outside but in a shape which matches the surface of the ground while maintaining an essentially constant length of the ferrules6awhich compose it. The relative movement of the ferrules of the laminated strip occurs by shearing in the interposition layers6b.", "", "As shown in particular inFIG.1, the hub4of the wheel carries two disks12,14which project radially outwards. These two disks12,14are spaced from each other along the axis X-X of the wheel and each have an external diameter against which the internal surface of the laminated strip6is able to abut in order to limit the deformations thereof.", "", "The cables8radially connect the laminated strip6to the hub4. For this purpose, each cable8comprises an outer end8awhich is fastened to rods16themselves mounted against an outer surface of the laminated strip.", "", "In this configuration, the outer ends8aof the cables pass through all the ferrules6aand interposition layers6bof the laminated strip. Of course, it is possible to consider that the outer ends8aof the cables are fastened on the inner surface of the laminated strip.", "", "At their respective inner ends, the cables8are fastened to the hub4preferably by means of an elastic member18allowing to modulate the radial stiffness of the cables. Here too, the inner ends8bof the cables pass through the hub in its thickness.", "", "In the embodiment ofFIGS.1to3, the elastic members18are leaf springs which each have the shape of an elongated plate and which are fastened at their center by rivets against an inner surface4aof the hub.", "", "In another embodiment not shown in the figures (but described in patent application EP22192685), the elastic members may be in the form of blades folded into a U (that is to say at 180°) forming springs allowing to modulate the radial stiffness of the cables.", "", "Each cable8is composed of an assembly of metal wires (for example made of steel) made up of strands, themselves assembled around a metal core. For example, each cable includes 6 or 7 strands each composed of 7 to 61 metal wires, the assembly having an external diameter comprised between 0.2 mm and 5 mm.", "", "In addition, each cable8can advantageously have a ratio between its mechanical stiffness in tension Kt and its mechanical stiffness in compression Kc which is comprised between 50000 and 300000 (that is to say 5000≤Kt/Kc≤300000), and preferably comprised between 25000 and 150000 (that is to say 25000≤Kt/Kc≤150000).", "", "These mechanical stiffness values Kt and Kc were obtained by following the recommendations of the ISO 2408:2017 and ISO 17893:2004 standards (relating to the requirements of steel cables) and by using a testing machine of the brand “INSTRON®”, model 34TM-10.", "", "In other words, the cables8have a stiffness asymmetry with a mechanical stiffness in tension Kt which is significantly greater than their mechanical stiffness in compression Kc.", "", "Moreover, in the embodiment of the figure, the cables8have a particular distribution all around the axis X-X of the wheel with a first double row of n cables the respective inner ends of which are positioned on the inner side of the wheel, and a second double row of m cables the respective inner ends of which are positioned on the outer side of the wheel.", "", "More specifically, for each double row of cables, the inner ends are mounted on the hub by being positioned laterally between one of the two disks12,14and the lateral (internal and external) edge of the hub. The number n, m of cables can be the same for each double row of cables.", "", "In addition, as shown inFIG.2, each cable8is advantageously inclined relative to a plane Pr radial to the hub4by an angle α comprised (in absolute value) between 0.1° and 45°, and preferably equal to 10° (in absolute value).", "", "In particular, for the same row of cables, it may be advantageous to provide for alternating inclinations between adjacent cables (one of the cables would have a positive inclination angle α− noted “α+” inFIG.2—and the adjacent cable would have a negative inclination angle α− noted “α−” inFIG.2).", "", "Similarly, as shown inFIG.4, each cable8is advantageously inclined relative to a plane Pt transverse to the hub4by an angle β comprised between 0.1° and 45° (in absolute value), and preferably equal to 10° (in absolute value).", "", "In particular, for each of the two double rows of cables, it may be advantageous to provide that all the cables belonging to one of the two rows have a positive inclination angle β (denoted “β+” inFIG.4) and all cables belonging to the other of the two rows have a negative inclination angle β (denoted “β−” inFIG.4).", "", "These inclinations α, β of the cables8allow to increase the rigidity of the wheel when it is stressed laterally (for example in a bend) or when the vehicle equipped with such a wheel brakes.", "", "The laminated strip6of the wheel2may be covered with at least one thermal insulation coating20which is made of at least one material having a thermal conductivity of less than 0.2 Wm−1K−1, that is to say very low.", "", "For example, this thermal insulation coating20can be made from one or more of the following materials: synthetic aramid fiber (in particular Kevlar®), fiberglass, polyvinyl acetate, and leather.", "", "Moreover, in order to further reduce the effective thermal conductivity of the thermal insulation coating, it is advantageous to provide it with “pockets” or vacuum openings on the inside. This is achieved, for example, by means of a woven material.", "", "In addition, the thermal insulation coating20can be made by assembling several materials, in particular by stacking several layers of different materials. For example, the thermal insulation coating20can be made by stacking a 3 to 5 mm thick layer of leather, a layer of aluminum to limit radiation, a 5 to 10 mm thick layer of aramid fabric, and a 1 to 2 mm thick layer of polyvinyl acetate.", "", "More generally, the thermal insulation coating20is advantageously covered under an internal face with a metallic coating (for example a layer of aluminum) to limit the transfer of thermal energy by radiation.", "", "The wheel2further may comprise means for heating the interposition layers6bof the laminated strip.", "", "These means for heating the interposition layers6bof the laminated strip may comprise rotating contacts for establishing a rotating electrical connection between the hub4of the wheel and the ferrules6aof the laminated strip.", "", "FIG.2shows an example of implementation of such rotating contacts: a block of brushes22is secured to the vehicle equipped with the wheel2and supplied with electricity from the latter via power cables23. This block of brushes22is in electrical contact with a ring24centered on the axis X-X of the wheel and secured to the hub4thereof in order to ensure a transfer of the electrical power supply to the ferrules6aof the laminated strip via electric heating wires26which are wound in the thickness of the ferrules6aof the laminated strip.", "", "Advantageously, as shown inFIG.4, when the ferrules6aof the laminated strip are made of composite material and the interposition layers6bare composed of a hyperelastic elastomer, the electric heating wires26can be embedded in the composite material of one of the ferrules when manufactured in order to convey calories to the hyperelastic elastomer making up the interposition layers6b.", "", "In this case, the electric heating wires26are preferably positioned at a neutral fiber in the circumferential direction (that is to say the fiber which does not undergo any variation in length, regardless of the bending deformation of the ferrule) of the composite material in a plurality of loops26awhich are circumferentially spaced from each other.", "", "Moreover, as shown in detail inFIG.5, the electric heating wires26can advantageously run inside a spring28, one end of which is screwed on the side of the laminated strip onto a collar30itself fastened to the ferrule6aof the laminated strip containing the electric heating wire, and an opposite end which is fastened to the hub.", "", "The use of such a spring to route the electric heating wires has many advantages, in particular that of being able to guarantee the protection of the wires against possible contact with stones, and of allowing a movement of several centimeters between the hub and the laminated strip.", "", "According to another advantageous arrangement (not shown in the figures), means for measuring the temperature (for example thermocouples or other sensors of different types) of the interposition layers6bof the laminated strip may be provided in order to control the heating power to be conveyed thereto to prevent their temperature from approaching the glass transition temperature of the material of which they are composed.", "", "For example, the temperature of the interposition layers6bof the laminated strip can be monitored using Bragg grating optical fibers (known per se) which are directly inserted into the thickness of the ferrules6a.", "", "The advantage of using Bragg grating optical fibers is that they also allow deformations to be monitored and the stresses undergone by the material making up the ferrules of the laminated strip to be deduced.", "", "Alternatively, monitoring the temperature of the interposition layers6bof the laminated strip can be achieved by means of a temperature probe, for example a platinum resistance thermometer (also called RTD probe for “Resistance Temperature Detector”).", "", "According to yet another advantageous arrangement (not shown in the figures), means may be provided for measuring the deformations and stresses of the laminated strip, for example using Bragg grating optical fibers.", "", "It will be noted that the means for measuring the temperature of the interposition layers of the laminated strip and the means for measuring the deformations and stresses of the laminated strip can advantageously pass through the spring used to route the electric heating wires."], "claims": ["a hub; a laminated annular strip intended to be in contact with the ground, positioned around the hub which is concentric therewith and comprising a plurality of concentric ferrules that are assembled with the interposition of interposition layers each composed of a material the Young's modulus of which is 600000 to 1000 times lower than that of the ferrules; and a plurality of metal cables radially connecting the hub to the laminated strip while being fastened, on the one hand by an outer end to the laminated strip, and on the other hand by an inner end to the hub; wherein the laminated strip is covered with at least one thermal insulation coating made of at least one material having a thermal conductivity of less than 0.2 Wm wherein the wheel further comprises means for heating the interposition layers of the laminated strip.", "2 . The wheel according to claim 1 , wherein the means for heating the laminated strip comprise rotating contacts for establishing a rotating electrical connection between the hub of the wheel and the ferrules of the laminated strip.", "3 . The wheel according to claim 2 , wherein the rotating contacts are coupled to electric heating wires which are wound in the thickness of the ferrules of the laminated strip.", "4 . The wheel according to claim 3 , wherein the ferrules of the laminated strip are made of composite material and the interposition layers are composed of a hyperelastic elastomer, the electric heating wires of the heating means of the laminated strip being embedded in the composite material during the manufacture of the ferrules in order to convey calories to the elastomer making up the interposition layers.", "5 . The wheel according to claim 4 , wherein the electric wires are positioned at a neutral fiber in the circumferential direction of the composite material in a plurality of loops circumferentially spaced from each other.", "6 . The wheel according to claim 3 , wherein the electric heating wires run inside a spring one end of which is screwed on the side of the laminated strip onto a collar fastened to a ferrule of the laminated strip containing the electric heating wire, and an opposite end is fastened to the hub.", "7 . The wheel according to claim 1 , wherein the thermal insulation coating is made of one or more of the following materials: synthetic aramid fiber, fiberglass, polyvinyl acetate, and leather.", "8 . The wheel according to claim 1 , wherein the thermal insulation coating is covered under an internal face with a metallic coating to limit the transfer of thermal energy by radiation.", "9 . The wheel according to claim 1 , further comprising means for measuring the temperature of the interposition layers of the laminated strip.", "10 . The wheel according to claim 1 , further comprising means for measuring the deformations and stresses of the laminated strip.", "a hub; a laminated annular strip intended to be in contact with the ground, positioned around the hub which is concentric therewith and comprising a plurality of concentric ferrules that are assembled with the interposition of interposition layers each composed of a material the Young's modulus of which is 600000 to 1000 times lower than that of the ferrules; and a plurality of metal cables radially connecting the hub to the laminated strip while being fastened, on the one hand by an outer end to the laminated strip, and on the other hand by an inner end to the hub; wherein the laminated strip is covered with at least one thermal insulation coating made of at least one material having a thermal conductivity of less than 0.2 Wm", "12 . The wheel according to claim 11 , wherein the wheel comprises rotating contacts for establishing a rotating electrical connection between the hub of the wheel and the ferrules of the laminated strip.", "13 . The wheel according to claim 12 , wherein the rotating contacts are coupled to electric heating wires which are wound in the thickness of the ferrules of the laminated strip.", "14 . The wheel according to claim 13 , wherein the ferrules of the laminated strip are made of composite material and the interposition layers are composed of a hyperelastic elastomer, the electric heating wires of the laminated strip being embedded in the composite material during the manufacture of the ferrules in order to convey calories to the elastomer making up the interposition layers.", "15 . The wheel according to claim 14 , wherein the electric heating wires are positioned at a neutral fiber in the circumferential direction of the composite material in a plurality of loops circumferentially spaced from each other.", "16 . The wheel according to claim 13 , wherein the electric heating wires run inside a spring one end of which is screwed on the side of the laminated strip onto a collar fastened to a ferrule of the laminated strip containing the electric heating wire, and an opposite end is fastened to the hub.", "17 . The wheel according to claim 11 , wherein the thermal insulation coating is made of one or more of the following materials: synthetic aramid fiber, fiberglass, polyvinyl acetate, and leather.", "18 . The wheel according to claim 11 , wherein the thermal insulation coating is covered under an internal face with a metallic coating to limit the transfer of thermal energy by radiation.", "19 . The wheel according to claim 11 , further comprising a sensor for measuring the temperature of the interposition layers of the laminated strip.", "20 . The wheel according to claim 11 , further comprising Bragg grating optical fibers."], "bibtex": "@patent{20250121629,\n    title = {DEFORMABLE WHEEL WITH NON-PNEUMATIC LOAD BEARING AND WITH TREAD HEATING FOR LUNAR AND MARTIAN CONDITIONS},\n    number = {20250121629},\n    year = {2025},\n    note = {File: US20250121629A1-20250417.XML}\n    }", "classification": "B60B900FI"}, {"title": "BICYCLE HUB KIT", "doc_number": "20250121630", "filename": "US20250121630A1-20250417.XML", "abstract": "A bicycle hub kit has a hub body, a driver disposed to a first end of the hub body, a sprocket connected to the driver, a clutch sleeve disposed inside the hub body and connected to the driver, and a shaft kit. The shaft kit includes a shaft body, an end base fixed to the shaft body, a ball retainer sleeved on the end base and supporting between the hub body and the end base, and a positioning kit disposed between the end base and the clutch sleeve. The positioning kit can be selected from a sleeve positioning kit and a braking positioning kit. The shaft kit can be detached from the hub body for replacing the positioning kit to transform the bicycle hub kit between with and without a coaster brake.", "detailed_description": ["With reference toFIGS.1to5, a first embodiment of a bicycle hub kit in accordance with the present invention comprises a hub body10, a driver20, a sprocket25, a clutch sleeve30, and a shaft kit50A.", "", "The shaft kit50A includes a shaft body51, an end base53A, a ball retainer55, and a positioning kit. The positioning kit is disposed between the end base53A and the clutch sleeve30and is selected from a sleeve positioning kit60as shown inFIG.4and a braking positioning kit70as shown inFIG.9. In the first embodiment, the positioning kit is the sleeve positioning kit60.", "", "With reference toFIGS.1to5, the hub body10surrounds the shaft body51and has a first end and a second end opposite to each other. The driver20surrounds the shaft body51, is disposed at the first end of the hub body10, and has an outer end extending out of the hub body10and an inner end extending into the hub body10. The sprocket25is connected to the outer end of the driver20and is connected to a front sprocket connected to paddles via a chain ring, and is driven to rotate by the paddles. The clutch sleeve30surrounds the shaft body51and is disposed inside the hub body10and is able to move along the shaft body51. The clutch sleeve30may be a single piece and comprises a first segment31extending away from the driver20and a second segment32adjacent to the driver20. The second segment32surrounds and is connected to the inner end of the driver20via a threaded engagement. An outer diameter of the second segment32is larger than an outer diameter of the first segment31.", "", "The shaft body51extends through the hub body10and the clutch sleeve30. The end base53A is fixed to and surrounds the shaft body51and extends into the second end of the hub body10. The ball retainer55is sleeved on and surrounds the end base53A and supports between the hub body10and the end base53A.", "", "The sleeve positioning kit60is disposed between the end base53A and the clutch sleeve30and includes a positioning sleeve61and a bearing kit63. The positioning sleeve61is sleeved on and surrounds an external periphery of the first segment31of the clutch sleeve30. The bearing kit63is disposed between the end base53A and the positioning sleeve61and includes a positioning block631and a bearing633. The positioning block631is connected to the shaft body51via a threaded engagement. The bearing633is sleeved on and surrounds the positioning block631and is adjacent to an end of the positioning block631facing toward the end base53A. The bearing633has two opposite end surfaces respectively abutting against the end base53A and the positioning sleeve61. The bearing633includes an inner ring and an outer ring being rotatable relative to the inner ring. The end base53A has a flat end facing toward the clutch sleeve30and abutting against the inner ring of the bearing633. The positioning sleeve61abuts against the outer ring of the bearing633. The sleeve positioning kit60further includes a sleeve spring set65and a sleeve washer66. The sleeve spring set65is disposed between the positioning block631and the positioning sleeve61and includes a spring holder651and a sleeve spring655. The spring holder651is sleeved on the positioning block631and is adjacent to an end of the positioning block631facing away from the end base53A. The sleeve spring655is fixed to the spring holder651and extends into the first segment31of the clutch sleeve30. The sleeve washer66is adjacent to an end of the sleeve spring655away from the end base53A and is disposed in the first segment31of the clutch sleeve30. The end of the sleeve spring655away from the spring holder651abuts against the sleeve washer66.", "", "During a rider reversing paddles to reverse the sprocket25, the clutch sleeve30is limited by the positioning sleeve61to be kept in position relative to the shaft body51, cannot be moved toward the end base53A along the shaft body51, and is rotatable relative to the shaft body51via the bearing kit63. Accordingly, the bicycle hub kit does not have the function of a coaster brake.", "", "With reference toFIGS.4to6, an outer diameter of the positioning sleeve61is larger than an outer diameter of the second segment32of the clutch sleeve30. An outer diameter of the bearing633is larger than an inner diameter of an opening of an end of the positioning sleeve61facing toward the bearing633to prevent the bearing633from entering into the positioning sleeve61and to ensure the clutch sleeve30is able to smoothly rotate. An outer diameter of the sleeve washer66is larger than the inner diameter of the second segment32of the clutch sleeve30, so the sleeve washer66is kept inside the first segment31of the clutch sleeve30, is unable to enter the second segment32of the clutch sleeve30, and can conveniently support the sleeve spring655.", "", "Specifically, the clutch sleeve30has an internal thread322formed at an inner peripheral surface of the second segment32to engage with an external thread on the driver20. So the clutch sleeve30can be driven by the driver20. The clutch sleeve30has anti-slip textures323formed at the external surface of the second segment32to increase friction.", "", "With reference toFIGS.7to10, in the second embodiment, the positioning kit of the shaft kit50B is a braking positioning kit70. The braking positioning kit70comprises a braking spring set71and at least one brake pad73. The braking spring set71is disposed between the end base53B and the clutch sleeve30. The braking spring set71includes a braking spring711and a positioning holder713. The positioning holder713is fixed to an end of the braking spring711facing toward the end base53B. The braking spring711extends into the first segment31of the clutch sleeve30. The at least one brake pad73is disposed between an internal peripheral surface of the hub body10and outer peripheries of the clutch sleeve30and the end base53B. When the sprocket25is rotated reversely, the clutch sleeve30is driven by the driver20to move toward the end base53B. The at least one brake pad73is pushed by the second segment32of the clutch sleeve30to move toward and abut against the internal peripheral surface of the hub body10to brake the hub body10.", "", "With reference toFIGS.7,8, and12, each brake pad73is curved for fitting the outer peripheries of the clutch sleeve30and the end base53B. Whereby, an assembling space can be reduced. Each brake pad73has a concave surface facing the outer peripheries of the clutch sleeve30and the end base53B, a convex surface facing the internal surface of the hub body10, and multiple grooves732formed in the convex surface at spaced intervals. Roughness at the convex surface of the brake pad73can be increased via the multiple grooves732, and the friction between the brake pad73and the hub body10is increased to improve the braking effect. The outer periphery of the end base53B has a tapered surface facing the clutch sleeve30. Each brake pad73abuts against the tapered surface of the outer periphery of the end base53B. The at least one brake pad73may include two said brake pads73disposed at diametrically opposite sides of the end base53B to enhance the braking effect.", "", "When the coaster brake is needed, the shaft kit50A is detached from the hub body10and is replaced with the shaft kit50B. The sleeve positioning kit60is replaced with the braking positioning kit70. The positioning sleeve61and the bearing kit63are removed, the braking spring set71is disposed between the end base53B and the clutch sleeve30, and the at least one brake pad73is disposed inside the hub body10. When the sprocket25is driven to rotate reversely, the clutch sleeve30is driven by the driver20rotating reversely to move toward the end base53B, the at least one brake pad73is pushed toward the internal peripheral surface of the hub body10by the second segment32of the clutch sleeve30and rubs the internal peripheral surface of the hub body10to slow down and brake the hub body10.", "", "When the coaster brake is not required, the shaft kit50B is detached from the hub body10and is replaced with the shaft kit50A. The braking positioning kit70is replaced with the sleeve positioning kit60. The braking spring set71and the at least one brake pad73are removed, and the positioning sleeve61and the bearing kit63are disposed between the end base53A and the clutch sleeve30. When the sprocket25is driven to rotate reversely, the clutch sleeve30is kept in position by the positioning sleeve61, is unable to be move toward the end base53A, and is rotatable relative to the shaft body51.", "", "Accordingly, the bicycle hub kit can be transformed between with and without a coaster brake. By alternating the shaft kit50A/50B, the hub body10does not have be detached from a wheel set. The user can easily replace the shaft kit50A/50B by himself/herself free from reconnecting the bicycle hub kit to the spokes and wheel set, thereby saving time and labor and reducing maintenance costs."], "claims": ["a hub body having a first end and a second end; a driver disposed at the first end of the hub body and having an outer end extending out of the hub body; and an inner end extending into the hub body; a sprocket connected to the outer end of the driver; a clutch sleeve moveably disposed inside the hub body and having a first segment extending away from the driver; and a second segment adjacent to the driver, surrounding and connected to the inner end of the driver, and having an outer diameter being larger than an outer diameter of the first segment; and a shaft kit comprising a shaft body extending through the hub body and the clutch sleeve; an end base fixed to and surrounding the shaft body and extending into the second end of the hub body; a ball retainer sleeved on and surrounding the end base and supporting between the hub body and the end base; and a positioning kit disposed between the end base and the clutch sleeve; wherein the positioning kit is selected from the group consisting of a sleeve positioning kit and a braking positioning kit; the sleeve positioning kit includes a positioning sleeve sleeved on and surrounding an external periphery of the first segment of the clutch sleeve; and a bearing kit disposed between the end base and the positioning sleeve and including a positioning block connected to the shaft body via a threaded engagement; and a bearing sleeved on and surrounding the positioning block and having two opposite end surfaces respectively abutting against the end base and the positioning sleeve; the braking positioning kit includes a braking spring set disposed between the end base and the clutch sleeve and including a braking spring extending into the first segment of the clutch sleeve; and at least one brake pad disposed between an internal peripheral surface of the hub body and outer peripheries of the clutch sleeve and the end base; when the positioning kit is the sleeve positioning kit, the clutch sleeve is kept positioned by the positioning sleeve; when the positioning kit is the braking positioning kit, the clutch sleeve is driven to move along the shaft body by the driver.", "2 . The bicycle hub kit as claimed in claim 1 , wherein the end base has a flat end facing toward the clutch sleeve.", "the sleeve positioning kit includes a sleeve spring set and a sleeve washer; the sleeve spring set is disposed between the positioning block and the positioning sleeve and includes a spring holder and a sleeve spring; the spring holder is sleeved on the positioning block and is adjacent to an end of the positioning block facing away from the end base; the sleeve spring is fixed to the spring holder and extends into the first segment of the clutch sleeve; and the sleeve washer is disposed to an end of the sleeve spring away from the end base.", "4 . The bicycle hub kit as claimed in claim 1 , wherein an inner diameter of the first segment of the clutch sleeve is larger than an inner diameter of the second segment of the clutch sleeve.", "5 . The bicycle hub kit as claimed in claim 1 , wherein the clutch sleeve has an internal thread formed at an inner peripheral surface of the second segment of the clutch sleeve.", "an outer diameter of the positioning sleeve is larger than an outer diameter of the second segment of the clutch sleeve; an outer diameter of the bearing is larger than an inner diameter of an opening of an end of the positioning sleeve facing toward the bearing; and an outer diameter of the sleeve washer is larger than an inner diameter of the second segment of the clutch sleeve.", "7 . The bicycle hub kit as claimed in claim 1 , wherein each of the at least one brake pad is curved and has a convex surface and multiple grooves recessed in the convex surface at spaced intervals."], "bibtex": "@patent{20250121630,\n    title = {BICYCLE HUB KIT},\n    number = {20250121630},\n    year = {2025},\n    note = {File: US20250121630A1-20250417.XML}\n    }", "classification": "B60B2700FI"}, {"title": "DEFORMABLE WHEEL WITH NON-PNEUMATIC LOAD BEARING AND A ROTARY STOP DISC FOR LUNAR AND MARTIAN CONDITIONS", "doc_number": "20250121631", "filename": "US20250121631A1-20250417.XML", "abstract": "A deformable wheel with non-pneumatic load bearing, intended to equip a vehicle for rolling under extreme conditions, such as those encountered on the Moon and on Mars may comprise a hub bearing at least one stop disc which projects radially towards the outside, a tread layer having an outer surface which is intended to be in contact with the ground being able to deform under an externally applied load in order to match the surface of the ground, and an inner surface which is able to come to bear against the stop disc in order to limit the deformations of the tread layer in the radial direction, and a plurality of radial reinforcements linking the tread layer to the hub.", "detailed_description": ["The application relates to a deformable wheel with non-pneumatic load bearing as shown inFIG.1, which is suitable for equipping a vehicle intended to roll under extreme conditions such as those encountered on the Moon and on Mars.", "", "The wheel2represented inFIG.1mainly comprises a hub4, an annular tread layer6having an outer surface which is intended to be in contact with the ground, being able to deform under an externally applied load in order to match the surface of the ground, and a plurality of radial reinforcements (here metal cables8) radially linking the hub to the tread layer.", "", "In this embodiment, the tread layer6is a flexure strip which comprises a metal core10provided with a plurality of corrugations12sandwiched between a ferrule14and a plurality of circumferential springs16giving the tread layer the ability to deform in flexion.", "", "More precisely, as shown inFIGS.2and3, the corrugations12of the core10of the tread layer are formed from metal sheets which are folded into V-shapes in the longitudinal direction (in other words parallel to the longitudinal axis of rotation X-X of the wheel2).", "", "It will be noted that the tip of the V-shapes of the metal sheet which form the corrugations12is pointing towards the inside of the wheel (in other words towards the axis of rotation X-X thereof) and opens out towards the outside of the5wheel.", "", "It will also be noted that each correlation12of the core of the tread layer is symmetric with respect to a plane P radial to the wheel (and passing through the tip of the V-shape of the corrugation).", "", "It will also be noted that the metal sheets which compose the corrugations advantageously have holes18which are distributed over their entire length in order to reduce the weight of the wheel.", "", "The ferrule14of the tread layer6of the wheel according to this embodiment is made of metal or of composite material (for example with glass fibres or carbon fibres).", "", "Finally, the tread layer6of the wheel according to this embodiment comprises a plurality of circumferential springs16giving the tread layer the ability to deform in flexion.", "", "As previously indicated, in this embodiment, the radial reinforcements radially linking the hub4of the wheel to the tread layer6are composed of metal cables8.", "", "It will also be noted that in place of metal cables, the radial reinforcements radially linking the hub4of the wheel to the tread layer6can be composed of springs (this embodiment is not shown in the figures).", "", "Similarly, in another embodiment (not shown in the figures), the tread layer is a laminated annular strip comprising a plurality of concentric ferrules which are assembled with interposition of interposing layers, each composed of a material for which Young's modulus is 600,000 to 1000 times less than that of the ferrules.", "", "The ferrules of such a laminated strip can be made of metal or of a composite material, while the interposing layers can be composed of a hyperelastic elastomer having a glass transition temperature below 120° C.", "", "Reference can be made to patent application EP22192685 filed by the applicant on 29 Aug. 2022, which describes such a wheel architecture with laminated tread layer.", "", "Whatever the embodiment, the hub4of the wheel bears at least one stop disc20which projects radially towards the outside of the wheel.", "", "When the surface of the ground on which the wheel2is rolling presents a significant obstacle (for example a rock), the part of the tread layer6which is in contact with the ground deforms in order to match the profile of the obstacle. In such a situation, depending on the size of the obstacle, the inner surface of the tread layer can abut against the outside diameter of the stop disc20borne by the hub4in order to limit the deformations undergone by the tread layer. A similar situation is possible during low-speed rolling and under heavy overload.", "", "The stop disc20may be rotatably mounted on the hub4in such a way as to be able to be rotated about the axis X-X of the wheel, when the inner surface of the tread layer6comes to bear against the stop disc.", "", "More precisely, in the embodiment ofFIGS.1to3, the stop disc20is mounted on an outer surface of the hub4by means of a roller bearing22.", "", "This roller bearing22preferably comprises a plurality of cylindrical rollers24which are mounted between the outer surface of the hub4and an inner annular strip26of the stop disc. The cylindrical rollers24are regularly distributed all around the axis of rotation X-X of the wheel.", "", "In this way, when the inner surface of the tread layer6abuts against the outside diameter of the stop disc20(in particular when the wheel rolls on a significant obstacle), it can roll around the hub and this despite the different speeds of rotation of the hub and the tread layer.", "", "According to an advantageous provision, the stop disc20also comprises an outer annular strip28which is mounted around the inner strip26by means of a plurality of spring connections30.", "", "In the embodiment ofFIGS.1to3, the spring connections are each formed by a deformable ring30, advantageously composed of a plurality of windings of a stainless-steel strip (for example twelve windings of a strip of thickness 0.15 mm). Alternatively, these rings can be made of composite materials of the glass fibre and resin type.", "", "It will be noted that the deformable rings30are preferably regularly distributed around all of the axis of rotation X-X of the wheel.", "", "According to another advantageous provision, each spring connection further comprises a bushing32forming a rigid stop which is mounted inside the ring30.", "", "This bushing32can be fixed on the inner strip side26of the stop disc or on the outer strip side28of the stop disc. it can prevent the deformable rings30from deforming too much in the case of strong deformation of the tread layer.", "", "According to yet another advantageous provision, the outer strip28of the stop disc is covered with an outer protection34, made of leather for example.", "", "In another embodiment which is not shown, the hub of the wheel bears two stop discs, spaced apart from one another along the axis of rotation X-X of the wheel."], "claims": ["a hub bearing at least one stop disc which projects radially outwards; an annular tread layer positioned around the hub and having an outer surface which is intended to be in contact with the ground, being able to deform under an externally applied load in order to match the surface of the ground, and an inner surface which is able to come to bear against the stop disc in order to limit the deformation of the tread layer in the radial direction; and a plurality of radial reinforcements linking the tread layer to the hub; wherein the stop disc is rotatably mounted on the hub in such a way as to be able to be rotated when the inner surface of the tread layer comes to bear against the stop disc.", "2 . The wheel according to claim 1 , wherein the stop disc is mounted on an outer surface of the hub by a roller bearing.", "3 . The wheel according to claim 2 , wherein the roller bearing comprises a plurality of cylindrical rollers mounted between the outer surface of the hub and an inner annular strip of the stop disc.", "4 . The wheel according to claim 3 , wherein the stop disc comprises an outer annular strip which is mounted around the inner strip by a plurality of spring connections.", "5 . The wheel according to claim 4 , wherein the spring connections are each formed by a deformable ring.", "6 . The wheel according to claim 5 , wherein the deformable ring of the spring connections is composed of windings of a stainless-steel strip.", "7 . The wheel according to claim 5 , wherein each spring connection further comprises a bushing forming a rigid stop mounted inside the ring.", "8 . The wheel according to claim 3 , wherein the cylindrical rollers are regularly distributed on the outer surface of the hub around an axis of rotation (X-X) of the wheel.", "9 . The wheel according to any one of claim 4 , wherein the outer annular strip of the stop disc is covered with an outer protection made of leather.", "10 . The wheel according to claim 1 , wherein the hub bears two stop discs spaced apart from one another along an axis of rotation (X-X) of the wheel.", "11 . The wheel according to claim 1 , wherein the tread layer is a metal shear strip comprising a metal core provided with corrugations sandwiched between a ferrule and a plurality of circumferential springs giving the tread layer the ability to deform in flexion.", "at least one deformable wheel with non-pneumatic load bearing, wherein the at least one wheel comprises: a hub bearing at least one stop disc which projects radially outwards; an annular tread layer positioned around the hub and having an outer surface which is intended to be in contact with the ground, being able to deform under an externally applied load in order to match the surface of the ground, and an inner surface which is able to come to bear against the stop disc in order to limit the deformation of the tread layer in the radial direction; and a plurality of radial reinforcements linking the tread layer to the hub; wherein the stop disc is rotatably mounted on the hub in such a way as to be able to be rotated when the inner surface of the tread layer comes to bear against the stop disc.", "a hub bearing at least one stop disc which projects radially outwards; an annular tread layer positioned around the hub and having an outer surface which deforms under an externally applied load, and an inner surface which limits deformation of the tread layer; and a plurality of radial reinforcements linking the tread layer to the hub; wherein the stop disc is rotatably mounted on the hub.", "14 . The deformable wheel of claim 13 , wherein the stop disc is rotatably mounted on the hub in such a way as to be able to be rotated when the inner surface of the tread layer comes to bear against the stop disc.", "15 . The deformable wheel of claim 13 , wherein the outer surface is intended to be in contact with the ground.", "16 . The wheel according to claim 13 , wherein the stop disc is mounted on an outer surface of the hub by a roller bearing.", "17 . The wheel according to claim 16 , wherein the roller bearing comprises a plurality of cylindrical rollers mounted between the outer surface of the hub and an inner annular strip of the stop disc.", "18 . The wheel according to claim 17 , wherein the stop disc comprises an outer annular strip which is mounted around the inner strip by way of a plurality of spring connections.", "19 . The wheel according to claim 18 , wherein the spring connections are each formed by a deformable ring.", "20 . The wheel according to claim 19 , wherein the deformable ring of the spring connections is composed of windings of a stainless-steel strip."], "bibtex": "@patent{20250121631,\n    title = {DEFORMABLE WHEEL WITH NON-PNEUMATIC LOAD BEARING AND A ROTARY STOP DISC FOR LUNAR AND MARTIAN CONDITIONS},\n    number = {20250121631},\n    year = {2025},\n    note = {File: US20250121631A1-20250417.XML}\n    }", "classification": "B60C714FI"}, {"title": "MOTORCYCLE TIRE", "doc_number": "20250121632", "filename": "US20250121632A1-20250417.XML", "abstract": "A motorcycle tire comprises a tread portion having a first tread edge, a second tread edge and a ground contacting surface. The ground contacting surface comprises a first ground contacting surface from the tire equator to the first tread edge. When the first ground contacting surface is equally axially divided into a first, a second, a third, a fourth and a fifth zone in order from the tire equator to the first tread edge, a land ratio of the second zone is larger than a land ratio of the first zone and larger than a land ratio of the third zone.", "detailed_description": ["Hereinafter, an embodiment of the present disclosure will be described in detail in conjunction with accompanying drawings.", "", "Although the drawings illustrate features of the embodiment, the illustrated features may contain exaggeration different from the actual dimensional relationship for easy understanding.", "", "FIG.1is a cross-sectional view of a motorcycle tire1of the present embodiment showing a tire meridian cross section including a tire rotational axis under a standard state of the tire1.", "", "In the present embodiment, the tire1is for the front wheel of a motorcycle suitable for on-road sports driving. The size of the tire1is, for example, 120/70ZR17.However, the present disclosure is not limited to such tire.", "", "In the case that the tire1is a type of pneumatic tire for which various standards have been established, the “standard state” means a state of the tire when mounted on a standard wheel rim, and inflated to a standard tire pressure, but loaded with no tire load.", "", "In the case that the tire1is a tire for which various standards are not yet established, the “standard state” means a standard usage state depending on the purpose of use of the tire and in a condition in which the tire is not attached to a vehicle and no tire load is applied,", "", "In this application including specification and claims, dimensions and positions of each part or portion of the tire refer to those under the standard state unless otherwise noted.", "", "Incidentally, even if the dimensions or positions cannot be measured directly under the standard state, for example, in the case of internal tire components, these can be measured using x-ray equipment etc.", "", "The “standard wheel rim” is a wheel rim specified for the tire in a standard system including standards on which the tire is based, for example, the “Standard rim” in JATMA, “Design Rim” in TRA, “Measuring Rim” in ETRTO.", "", "The “standard tire pressure” is the air pressure specified for the tire in a standard system including standards on which the tire is based, for example, the “maximum air pressure” in JATMA, “INFLATION PRESSURE” in ETRTO, and the maximum air pressure listed in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in TRA.", "", "As shown inFIG.1, the tire1in the present embodiment comprises a tread portion2, a pair of sidewall portions3, and a pair of bead portions4.", "", "The sidewall portions3are respectively connected to both sides in the tire axial direction of the tread portion2.The bead portions4are respectively connected to inner sides in the tire radial direction of the respective sidewall portions3. In each bead portion4, a bead core5is embedded.", "", "The tire1comprises a carcass6extending between the paired bead portions4. The carcass6comprises, for example, a carcass ply6A comprising a plurality of carcass cords.", "", "The carcass cords (not shown) are arranged at an angle from 65 to 90 degrees with respect to the tire circumferential direction, for example.The carcass6in the present embodiment is composed of only one carcass ply6A, but, it may be composed of a plurality of overlaid carcass plies.The carcass ply6A comprises a main portion6aand turnup portions6b.The main portion6aextends from the tread portion2through the sidewall portions3on both sides to the bead cores5of the bead portions4on both sides.The turnup portions6bare continuous with the main portion6a,and are each folded back around the bead core5from the inside to the outside in the tire axial direction.", "", "The tread portion2comprises a tread reinforcing layer9disposed outside the carcass6in the tire radial direction, and a tread rubber2G disposed outside the tread reinforcing layer9in the tire radial direction.", "", "The tread reinforcing layer9includes a belt layer7and a band layer8disposed outside the belt layer7in the tire radial direction.", "", "The belt layer7is disposed adjacently to the outer side in the tire radial direction of the carcass6. The belt layer7is arranged so as to reinforce a substantially entire width in the tire axial direction of the tread portion2.", "", "The belt layer7is composed of, for example, two belt plies7A and7B. Each of the belt plies7A and7B is composed of rubberized belt cords arranged at an angle in a range from of 10 to 40 degrees with respect to the tire circumferential direction.", "", "The band layer8is arranged, for example, in a center part in the tire axial direction of the tread portion2, and extends across the tire equator C.", "", "The band layer8comprises, for example, at least one band cord wound helically in the tire circumferential direction in order to suppress growth of the outer diameter of the tread portion2during high-speed running.", "", "The tread portion2has a first tread edge T1, a second tread edge T2and a ground contacting surface10between the first tread edge T1and the second tread edge T2.", "", "Here, the ground contacting surface10refers to the entire radial outer surface of the tread portion2that may come into contact with the ground when running straight or turning.", "", "In the tire meridian cross section, the ground contacting surface10is curved in an arc shape being convex outwardly in the tire radial direction so that a sufficient ground contacting area can be secured even when turning with a large camber angle or cornering with a large motorcycle lean angle.", "", "The first tread edge T1and the second tread edge T2correspond to the axially outermost ends of the ground contacting surface10which can come into contact with the road surface at the maximum camber angle.", "", "The tread width Wa is the distance in the tire axial direction from the first tread edge T1to the second tread edge T2.", "", "In the present embodiment, since the ground contacting surface10is curved as described above, the tread width Wa corresponds to the maximum cross-section width of the tire.", "", "FIG.2is a developed partial view of the ground contacting surface10of the tread portion2. Specifically,FIG.2shows a part in the tire circumferential direction of the ground contacting surface10which is developed in a plane.", "", "In this specification, the width in the tire axial direction of each part of the tread portion in this developed state is referred to as the developed width.", "", "Further, in this specification, the developed width from the first tread edge T1to the second tread edge T2is referred to as the developed tread width TW.Furthermore, the developed width from the tire equator C to the first tread edge T1and that from the tire equator C to the second tread edge T2are each referred to as the half developed tread width TWh.", "", "In this embodiment, as shown inFIG.2, the tread portion2is provided with a unidirectional tread pattern for which an intended rotational direction R of the tire is specified to maximize tire performance.", "", "The intended rotational direction R may be indicated by letters or symbols, e.g. arrows which are formed, for example, in the sidewall portion3or the tread portion2.However, the present disclosure is not limited to such a unidirectional tread pattern.In the drawings, the intended rotational direction R is indicated by an outline arrow.", "", "In the ground contacting surface10, a part from the tire equator C to the first tread edge T1is referred to as the first ground contacting surface10A, and a part from the tire equator C to the second tread edge T2is referred to as the second ground contacting surface10B.", "", "In this embodiment, the first ground contacting surface10A and the second ground contacting surface10B have substantially same symmetrical configurations except that tread pattern components on one side of the tire equator are circumferentially shifted from those on the other side.", "", "In the present disclosure, the first ground contacting surface10A is divided equally in the developed width direction of the first ground contacting surface10A into five zones which are a first zone11, a second zone12, a third zone13, a fourth zone14and a fifth zone15in order from the tire equator C to the first tread edge T1.", "", "In the same way, the second ground contacting surface10B is divided into a first zone11, a second zone12, a third zone13, a fourth zone14and a fifth zone15in order from the tire equator C to the second tread edge T2.Accordingly, the developed width W1of each of these zones is 20% of the half tread developed width TWh.", "", "In the first ground contacting surface10A, the first zone11is located closest to the tire equator C; the second zone12is adjacent to the first zone11on the first tread edge T1side; the third zone13is adjacent to the second zone12on the first tread edge T1side; the fourth zone14is adjacent to the third zone13on the first tread edge T1side; and the fifth zone15is adjacent to the fourth zone14on the first tread edge T1side, and is located closest to the first tread edge T1.", "", "The second ground contacting surface10B is also similar. That is, the above description can also be applied by replacing “first tread edge T1” with “second tread edge T2”, so the description is omitted.In the drawings, the boundaries16of these zones are indicated by dash-dot lines.", "", "In the tire1according to the present disclosure, the land ratio of each zone is specified.", "", "Here, the “land ratio” of a zone means a ratio Sb/Sa of the actual ground contact area Sb of the zone to the overall ground contact area Sa of the zone assuming there are no voids (grooves, recesses, sipes and the likes) at all.", "", "In the present disclosure, the land ratio La2of the second zone12is set to be larger than the land ratio La1of the first zone11and larger than the land ratio La3of the third zone13.", "", "This can be applied to both the first ground contacting surface10A and the second ground contacting surface10B.Thereby, the step wear of the tread portion2can be suppressed. The reason is as follows.", "", "FIG.3is a diagram conceptually showing changes in the profile of the tread portion2.", "", "InFIG.3, a solid line indicates a profile2A of the tread portion2when not worn, and a two-dot chain line indicates a profile2B of the tread portion2when tread wear has progressed to some extent.In this figure, however, the degree of wear is somewhat exaggerated for easy understanding.", "", "Since the profile of the tread portion2of the motorcycle tire is curved in an arc shape as shown inFIG.3, the tread portion2tends to wear easily in the vicinity of the tire equator C.", "", "On the other hand, when the motorcycle is running straight or when running at a camber angle of 0 degrees in substance,the edges in the tire axial direction of the ground contact patch are located near the second zones12of the tread portion2.As a result, the so-called step wear tends to occur in the vicinities of the second zones12.", "", "In the present disclosure, since the land ratio La2of the second zones12where step wear is likely to occur is made to be larger than the land ratios of the adjacent first zone11and third zone13, the progressions of wear in these respective regions become uniform. Therefore, in the tire1according to the present disclosure, the step wear of the tread portion2can be effectively prevented.", "", "The features described below for the first ground contacting surface10A can also be applied to the second ground contacting surface10B. Therefore, if the descriptions are made for only the first ground contacting surface10A, since such descriptions can be applied to the second ground contacting surface10B, those of the second ground contacting surface10B will be omitted.", "", "Hereinafter, more detail of features of the motorcycle tire1according to the present embodiment will be explained.", "", "The features described below are optional in the present disclosure, but preferable in the present embodiment.", "", "The land ratio La1of the first zone11is, for example, 81% to 91%, preferably 84% to 88%.", "", "Preferably, the land ratio La1of the first zone11is smaller than the land ratio La2of the second zone12by 8 to 12 percentage points.Further, the first zone11has the smallest land ratio among the five zones11to15. Thereby, wet performance during straight running can be improved while achieving the above-described effects.", "", "The land ratio La2of the second zone12is, for example, 91% to 97%, preferably 93% to 95%.", "", "Further, in the present embodiment, it is preferable that the second zone has the largest land ratio among the five zones11to15.Thereby, the step wear of the tread portion2can be surely suppressed.", "", "The land ratio La3of the third zone13is, for example, 83% to 93%, preferably 86% to 90%.", "", "Preferably, the land ratio La3of the third zone13is smaller than the land ratio La2of the second zone12by 4 to 8 percentage points.Further, the land ratio La3of the third zone13is preferably larger than the land ratio La1of the first zone11. Specifically, it is preferable that the land ratio La3is larger than the land ratio La1by 2 to 6 percentage points.Thereby, when turning at a relatively small camber angle where up to the third zone13comes into contact with the ground, the transient characteristic with respect to the response when leaning the motorcycle become linear. Hereinafter, such effect will be sometimes expressed simply as “the transient characteristic when turning is improved”.", "", "The land ratio La4of the fourth zone14is, for example, 89% to 93%.", "", "Preferably, the land ratio La4of the fourth zone14is larger than the land ratio La3of the third zone13. Specifically, it is preferable that the land ratio La4is larger than the land ratio La3by 1 to 3 percentage points.Thereby, the transient characteristic when turning may be further improved.", "", "The land ratio La5of the fifth zone15is, for example, 91% to 95%.", "", "Preferably, the land ratio La5of the fifth zone15is larger than the land ratio La4of the fourth zone14. Specifically, it is preferable that the land ratio La5is larger than the land ratio La4by 2 to 6 percentage points.Thereby, during cornering at the maximum camber angle, excellent cornering performance can be exerted.", "", "Further, it is preferable for the tire1in the present embodiment that the land ratios La1to La5of the first to fifth zones satisfy the following condition (1) in order to further improve the transient characteristics during turning:", "", "La2>La5>La4>La3>La1(1)", "", "In the tread portion2of the present embodiment, in order to achieve the above-mentioned land ratio relationship, the first ground contacting surface10A is provided with a plurality of main oblique grooves20and a plurality of auxiliary oblique grooves25which are arranged in the tire circumferential direction as shown inFIG.2.", "", "However, tires according to the present disclosure are not to be limited to the tread pattern shown inFIG.2.", "", "In the first ground contacting surface10A, the main oblique grooves20are arranged circumferentially of the tire at a circumferential pitch length P1(namely, the circumferential distance between every two of the adjacent main oblique grooves20) which is, for example, in a range from 70% to 90% of the developed tread width TW.", "", "Further, the auxiliary oblique grooves25are also arranged in the same manner, namely, at the circumferential pitch length P1.", "", "It is preferable that, in the developed view of the tread portion2as shown inFIG.2, a region which is formed by virtually moving in parallel one main oblique groove20toward the first tread edge T1, overlaps with another main oblique groove20adjacent to the above-said one main oblique groove20on one side in the tire circumferential direction (e.g. the upper side inFIG.2).", "", "In the present embodiment, the main oblique grooves20disposed in each of the first and second ground contacting surfaces10A and10B are arranged over the entire circumference of the tire while satisfying the above-described positional relationship.", "", "In other words, the circumferential extents of every two of the circumferentially adjacent main oblique grooves20are overlapped with each other in the tire circumferential direction.Thereby, uneven wear of the tread portion2can be suppressed, and the transient characteristics during turning can also be improved.", "", "Further, it is preferable that a region which is formed by virtually moving in parallel one main oblique groove20toward the first tread edge T1overlaps with two of the auxiliary oblique grooves25.", "", "In other words, the circumferential extent of each of the main oblique grooves20overlaps in the tire circumferential direction with the circumferential extents of two of the circumferentially adjacent auxiliary oblique grooves25which are located axially outside the above-said each of the main oblique grooves20.Thereby wet performance can be improved.", "", "FIG.4is an enlarged view showing one of the main oblique grooves20and one of the auxiliary oblique grooves25.", "", "As shown inFIG.4, each main oblique groove20is inclined toward the opposite direction to the intended rotational direction R while extending from the axially inside toward the axially outside of the tire.The average inclination angle θ1of the main oblique groove20with respect to the tire circumferential direction is, for example, set in a range from 5 to 10 degrees.Such main oblique grooves20can exhibit excellent drainage performance by utilizing the rotation of the tire when running in wet conditions.", "", "Here, the average inclination angle θ1corresponds to a value obtained by dividing the groove center line of the main oblique groove20into a plurality of minute sections,", "", "summing up angles of the minute sections with respect to the tire circumferential direction, anddividing the sum of the angles by the number of the minute sections.The same applies to average inclination angles appearing in the following description of this specification.", "", "The main oblique groove20in this example extends from the first zone11to the fourth zone14through the second zone12and the third zone13. And the main oblique groove20does not exist in the fifth zone15.", "", "Preferably, the main oblique groove20does not extend across the tire equator C.Preferably, the main oblique groove20has a length L1in the tire circumferential direction which is in a range from 130% to 200% of the above-said one pitch length Pl of the main oblique grooves20.", "", "The main oblique groove20in this example comprises a narrow groove section21, an inner groove section22and an outer groove section23in the longitudinal direction of the main oblique groove20.", "", "The narrow groove section21is positioned in a center portion of the main oblique groove20in the longitudinal direction, and extends over the entire length with a relatively small constant groove width W2.The inner groove section22is connected to the narrow groove section21on the tire equator side, and has a groove width larger than that of the narrow groove section21.The outer groove section23is connected to the narrow groove section21on the first tread edge T1side, and has a groove width larger than that of the narrow groove section21.", "", "The constant groove width W2of the narrow groove section21is 3.0 mm or less, preferably 0.5 to 2.5 mm, more preferably 1.0 to 2.0 mm.", "", "Further, an almost entire part of the narrow groove section21is located in the second zone12. More specifically, 80% or more of the opening area of the narrow groove section21is located in the second zone12. Thereby, the land ratio La2of the second zone12is increased, and it becomes possible to achieve the above-described land ratio relationship.", "", "The inner groove section22is arranged so that an almost entire part thereof is located in the first zone11. Specifically, 80% or more, preferably 90% or more, in this example 100% of the opening area of the inner groove section22is located in the first zone11.", "", "The inner groove section22has a groove width larger than the narrow groove section21as described above. To say this accurately, the average groove width of the inner groove section22is larger than the constant groove width W2of the narrow groove section21.", "", "Thereby, wet performance during straight running can be ensured.", "", "Here, the average groove width corresponds to a value obtained by dividing the opening area of the inner groove section22by the length of the groove center line of the inner groove section22.", "", "The same applies to average groove widths appearing in the following description of this specification.", "", "The outer groove section23is arranged from the third zone13into the fourth zone14, and does not exist in either the second zone12or the fifth zone15.", "", "The average groove width of the outer groove section23is larger than the constant groove width W2of the narrow groove section21.", "", "Further, 50% or more, preferably 60% or more of the opening area of the outer groove section23exists in the third zone13, and accordingly, the remaining part of the opening area exists in the fourth zone14. Thereby, the transient characteristics during turning can be improved.", "", "In the main oblique groove20in this example,", "", "the axially outer groove edge thereof extends substantially straight or is smoothly slightly curved between the axially outer end20aand the axially inner end of the main oblique groove20, andthe axially inner groove edge thereof is bulged out on both sides of the narrow groove section21, namely, in the inner groove section22and the outer groove section23.", "", "The auxiliary oblique grooves25are disposed on the first tread edge T1side of the main oblique grooves20.", "", "The auxiliary oblique grooves25are inclined in the same direction as the main oblique grooves20with respect to the tire circumferential direction in each of the first and second ground contacting surfaces10A and10B as shown inFIG.2.", "", "The average inclination angle θ2of the auxiliary oblique grooves25with respect to the tire circumferential direction is, for example, set in a range from 30 to 50 degrees.", "", "Preferably, the average inclination angle θ2of the auxiliary oblique grooves25is larger than the average inclination angle θ1of the main oblique grooves20.This improves stability when turning at a relatively large camber angle where the fourth zone14or the fifth zone15contacts with the ground.", "", "In the auxiliary secondary oblique groove25,", "", "the axially outer groove edge thereof extends substantially straight or is smoothly slightly curved between the axially outer end and the axially inner end of the auxiliary secondary oblique groove25, andthe axially inner groove edge thereof is bulged out.", "", "The auxiliary oblique groove25is arranged from the fourth zone14into the fifth zone15.", "", "The auxiliary oblique groove25does not exist in the third zone13.Further, the auxiliary oblique groove25is not open at the first tread edge T1. Namely, the auxiliary oblique groove25ends without reaching the first tread edge T1.", "", "Preferably, a region which is formed by virtually moving in parallel the auxiliary oblique groove25toward the tire equator in the tire axial direction, overlaps with both the narrow groove section21and the outer groove section23of the axially adjacent main oblique groove20.", "", "The distance in the tire axial direction between the end25aon the tire equator C side, of the auxiliary oblique groove25and the end20aon the first tread edge T1side, of the main oblique groove20is preferably 10% or less, more preferably 5% or less of the developed width W1(shown inFIG.2) of one of the five zones.", "", "The length L2in the tire circumferential direction of the auxiliary oblique groove25is 10% to 25% of the length L1in the tire circumferential direction of the main oblique groove20.", "", "As a result, the transient characteristics during turning may be further improved.", "", "FIG.5is a cross-sectional view of the tread portion2ofFIG.1.", "", "The tread portion2comprises a tread rubber2G which includes a crown tread rubber31, and a shoulder tread rubber32disposed on each side in the tire axial direction of the crown tread rubber31as shown inFIG.5.The crown tread rubber31and the shoulder tread rubbers32are made of different rubber compounds.The crown tread rubber31is disposed so as to extend across the tire equator C.The two shoulder tread rubbers32extend axially outwardly from the crown tread rubber31to the first and second tread edges T1and T2, respectively.Thereby, the ground contacting surface10of the tread portion2is formed by the radially outer surfaces of the crown tread rubber31and the two shoulder tread rubbers32.", "", "In each of the first and second ground contacting surfaces10A and10B, the boundary surface33abetween the crown tread rubber31and the shoulder tread rubber32is located axially outside the second zone12, and preferably located in the third zone13or the fourth zone14.", "", "Thereby, it becomes possible to more effectively suppress the step wear of the tread portion2.", "", "The crown tread rubber31and the shoulder tread rubber32have different loss tangent values.", "", "It is preferable that the loss tangent tanδ at 0 degrees C. of the crown tread rubber31is larger than the loss tangent tanδ at 0 degrees C. of the shoulder tread rubber32. This makes it easier to warm the crown tread rubber31up to appropriate temperatures at the beginning of running.It is also preferable that the loss tangent tanδ at 70 degrees C. of the shoulder tread rubber32is larger than the loss tangent tanδ at 70 degrees C. of the crown tread rubber31. This makes it easier to warm the shoulder tread rubber32up to appropriate temperatures to exert high road grip performance during cornering.", "", "In this application, the loss tangent tanδ refers to a value measured under the following conditions in accordance with Japanese Industrial Standard (JIS) K6394, using a viscoelastic spectrometer manufactured by Iwamoto Seisakusho KK.Initial strain: 10%Amplitude: +/−1%Frequency: 10 HzDeformation mode: tensile", "", "In the cross-sectional view of the tread portion2, as shown inFIG.5, the boundary surface33ain each boundary33between the crown tread rubber31and the shoulder tread rubber32extends linearly, and the boundary surface33ais inclined at an angle θ3in a range from 30 to 50 degrees, for example, with respect to the normal direction to the radially outer surface of the tread rubber2G as shown inFIG.5.", "", "Further, in the present embodiment, the boundary surface33ais inclined to the axially inside while extending from the radially inner edge to the radially outer edge of the boundary surface33a.", "", "The crown tread rubber31is disposed on the radially outside of the band layer8such that the edges8ain the tire axial direction of the band layer8are positioned axially inside the boundary surfaces33a,respectively.", "", "In the present embodiment, the boundary surfaces33aare respectively located in the third zones13, anda straight line8bdrawn normally to the radially outer surface of the tread rubber2G passing through each edge8aof the band layer8is located in the second zone12.Owing to such arrangement of the band layer8, it becomes possible to further suppress the step wear of the tread portion2.", "", "Further, in the present embodiment, the shoulder tread rubber32is disposed on the radially outside of the belt layer7such that the boundary33is located on the radially outside of the belt layer7, and edges in the tire axial direction of the belt plies7A and7B are located axially outside the boundary line between the fourth zone14and the fifth zone15as shown inFIG.5.", "", "While detailed description has been made of a motorcycle tire as an embodiment of the present disclosure, the present disclosure can be embodied in various forms without being limited to the illustrated specific embodiment."], "claims": ["the ground contacting surface comprising a first ground contacting surface from a tire equator to the first tread edge, when the first ground contacting surface is divided equally in a developed width direction of the first ground contacting surface into five zones which are a first zone, a second zone, a third zone, a fourth zone and a fifth zone in order from the tire equator to the first tread edge, a land ratio La", "the land ratio La", "a land ratio La a land ratio La", "the land ratio La", "the land ratio La the land ratio La the land ratio La", "the first ground contacting surface is formed by a crown tread rubber and a shoulder tread rubber which are made of different rubber compounds, and in the first ground contacting surface, a boundary between the crown tread rubber and the shoulder tread rubber is positioned on the first tread edge side of the second zone.", "the boundary is located in the third zone or alternatively in the fourth zone.", "a loss tangent tanδ at 0 degrees C. of the crown tread rubber is larger than a loss tangent tanδ at 0 degrees C. of the shoulder tread rubber.", "a loss tangent tanδ at 0 degrees C. of the crown tread rubber is larger than a loss tangent tanδ at 0 degrees C. of the shoulder tread rubber.", "a loss tangent tanδ at 70 degrees C. of the shoulder tread rubber is larger than a loss tangent tanδ at 70 degrees C. of the crown tread rubber.", "a loss tangent tanδ at 70 degrees C. of the shoulder tread rubber is larger than a loss tangent tanδ at 70 degrees C. of the crown tread rubber.", "a loss tangent tanδ at 70 degrees C. of the shoulder tread rubber is larger than a loss tangent tanδ at 70 degrees C. of the crown tread rubber.", "a loss tangent tanδ at 70 degrees C. of the shoulder tread rubber is larger than a loss tangent tanδ at 70 degrees C. of the crown tread rubber.", "the ground contacting surface comprises a second ground contacting surface from the tire equator to the second tread edge, when the second ground contacting surface is divided equally in the developed width direction of the second ground contacting surface into five zones which are a first zone, a second zone, a third zone, a fourth zone and a fifth zone in order from the tire equator to the second tread edge, a land ratio La", "wherein when the half ground contacting surface is divided equally in a developed width direction of the half ground contacting surface into five zones which are a first zone, a second zone, a third zone, a fourth zone and a fifth zone in order from the tire equator to the one of the tread edges, a land ratio La the half ground contacting surface is formed by a crown tread rubber and a shoulder tread rubber which are made of different rubber compounds, wherein a loss tangent at 0 degrees C. of the crown tread rubber is larger than a loss tangent at 0 degrees C. of the shoulder tread rubber, and a loss tangent at 70 degrees C. of the shoulder tread rubber is larger than a loss tangent at 70 degrees C. of the crown tread rubber, and a boundary between the crown tread rubber and the shoulder tread rubber in the half ground contacting surface is positioned in the third zone or alternatively in the fourth zone.", "the boundary between the crown tread rubber and the shoulder tread rubber is positioned in the third zone.", "a land ratio La", "a land ratio La", "a land ratio La", "the land ratio La the land ratio La the land ratio La the land ratio La the land ratio La"], "bibtex": "@patent{20250121632,\n    title = {MOTORCYCLE TIRE},\n    number = {20250121632},\n    year = {2025},\n    note = {File: US20250121632A1-20250417.XML}\n    }", "classification": "B60C1103FI"}, {"title": "SYSTEM AND METHOD FOR CREATING CONTRAST ON A SURFACE", "doc_number": "20250121633", "filename": "US20250121633A1-20250417.XML", "abstract": "A tire or other rubber item is described that has a surface such as a sidewall. A region on the surface includes a plurality of protrusions. The protrusions are positioned in a pseudo-random pattern within the region. Various features of the protrusions may be varied in a random or pseudo-random manner.", "detailed_description": ["Disclosed herein are various embodiments of varying a surface of a structure such as the sidewall of a tire. Reference will now be made in detail to the description of the embodiments as illustrated in the drawings, wherein like reference numbers indicate like parts throughout the several views.", "", "Referring then toFIG.1, shown is an example of a tire103that includes various surfaces106according to various embodiments of the present disclosure. Various features may be disposed on the surfaces106of the tire103. In one embodiment, an example of a surface106of the tire103comprises a sidewall or other surfaces of the tire103that may include lettering, images, or other items. For example, the surface106may comprise the side of a tread or any other surface of a tire103. In addition, the various embodiments of the present disclosure may apply to surfaces of a non-pneumatic tire. Such surfaces may be located, for example, on the side of a tread of a non-pneumatic tire or some other surface. In one embodiment, the tire103is constructed of materials comprising various forms of rubber. Alternatively, the tire103may be constructed from other materials. For example, in the case that the tire103comprises a non-pneumatic tire, the tire103may include a tread and spokes, where the spokes or potentially other structures are made of a material such as polyurethane, plastics, or other material. The surface106may comprise, for example, a surface of a tire103that is manufactured from rubber. Alternatively, the surface106may be a surface may be constructed from some other material such as polyurethane, plastic, other material.", "", "The surface106of the tire103includes a region109that has a pattern113of protrusions116that extend from the surface106. Alternatively, the pattern113of protrusions116can be engraved or molded on a surface106other than the sidewall of a tire103. In one embodiment, the pattern113of protrusions116comprises a pseudo-random pattern as will be described. According to various aspects, a number of features of the pattern113of protrusions116may be varied in a pseudo-random or random manner. For example, the features that may vary include the position of the protrusions116in the pattern113, the shape of the protrusions116, the height of the protrusions116, and/or the volume of the protrusions116.", "", "In addition, the angular position of individual ones of the protrusions116may be varied randomly or pseudo-randomly relative to each other or relative to a predefined radial axis of the tire. Still further, a surface contour at a distal end of the respective protrusions116may vary relative to each other as will be described. In addition, other aspects of the respective protrusions116may be varied.", "", "The protrusions116in a region109create a contrast between the region109and other portions of the surface106as perceived when viewed by individuals. Given the angle of incidence at which light strikes the region109, the protrusions116will cast shadows onto the surface106and onto adjacent ones of the protrusions116. As contemplated herein, an angle of incidence is an angle that an incident ray makes relative to a perpendicular axis to the surface106.", "", "The shadows that are created and the actual structures of the protrusions themselves impart a darker appearance to the region109relative to other portions of the surface106. According to one embodiment, due to the randomization or pseudo-randomization of one or more features in the pattern113of the protrusions116as mentioned above, when the region109of the surface106is viewed, the appearance of the region109remains more uniform from one vantage point to the next. Also, the appearance of lightened artifacts due to alignment of respective protrusions116is reduced or eliminated.", "", "According to one embodiment, the overall size of the protrusions116(FIG.1) is specified so that the structure of the protrusions116cannot be resolved by the naked eye119at a predefined distance D from the region109on the surface106. The predefined distance D may be, for example, 0.5 meters, 1 meter, 2 meters, or other predefined distance value.", "", "Accordingly, in one embodiment, the size of the protrusions116is generally sub-millimeter or less although the protrusions116may comprise some other size. Assuming the protrusions116are sized in the sub-millimeter range, then the protrusions116have a maximum width of less than 1 millimeter given tapered sizes or various shapes. Also, such sub-millimeter protrusions116may be less than 1 millimeter in height.", "", "As contemplated here, resolving the structure of the protrusions116with the naked eye refers to the ability to see individual ones of the protrusions116. In this manner, the region109will appear more as a single shade or color as opposed to identifying individual protrusions116.", "", "Referring next toFIG.2, shown is an example of the region109(FIG.1) denoted herein as region109aaccording to an embodiment of the present disclosure. The region109aincludes an example of the pattern113(FIG.1) of protrusions116(FIG.1) arranged in a pseudo-random manner, denoted herein as a pseudo-random pattern113aof protrusions116a.", "", "In one example, the pseudo-random pattern113aof protrusions116ainvolves positioning the protrusions116ain a pseudo-random pattern113awithin the region109aaccording to one embodiment. As contemplated herein, a pseudo-random pattern113ais created by positioning the protrusions116aaccording to a determinative process, but at the same time, the pseudo-random pattern113astill appears to be statistically random.", "", "The pseudo-random pattern113ais deterministic in that certain rules are specified to ensure a desired appearance of the pseudo-random pattern113aas viewed by the naked eye119(FIG.1). For example, in one embodiment, the pseudo-random pattern113ais defined by a predefined maximum distance between any two adjacent ones of the protrusions116a. That is to say that the protrusions116aare positioned such that no two adjacent ones of the protrusions116aare farther apart than the predefined maximum distance. Stated another way, a distance between any two adjacent ones of the protrusions116amust be less than or equal to the predefined maximum distance. This ensures that blank spaces are not created in the pseudo-random pattern113athat are too large that might impact a desired visual contrast of the region109arelative to other portions of the surface106(FIG.1).", "", "In another embodiment, the pseudo-random pattern113ais defined by a predefined minimum distance between any two adjacent ones of the protrusions116a. That is to say that the protrusions116aare positioned such that no two adjacent ones of the protrusions116aare closer to each other than the predefined minimum distance. Stated another way, a distance between any two adjacent ones of the protrusions116amust be greater or equal to the predefined minimum distance. This ensures that protrusions116ado not clump together in various areas of the region109aas might happen in a purely random placement of protrusions in the region109asuch that a desired visual contrast of the region109arelative to other portions of the surface106.", "", "In another embodiment, the protrusions116adepicted in the pseudo-random pattern113ahave a cross-section that is in the shape of a circle, although the cross-section may comprise other shapes as will be described. In this respect, the cross-section is taken in a plane that is parallel to the surface106. In addition, according to one embodiment, the sides of the protrusions116aare tapered so that, in the case the protrusions116aare formed by way of voids in a mold, they can be easily removed from the voids in the mold as will be described.", "", "Referring next toFIG.3, shown is an example of the region109(FIG.1) denoted herein as region109baccording to an embodiment of the present disclosure. The region109bincludes an example of the pattern113(FIG.1) of protrusions116(FIG.1) arranged in a pseudo-random manner, denoted herein as a pseudo-random pattern113bof protrusions116b.", "", "In addition, a shape of a cross-section of individual ones of the protrusions116bin the region109bdiffer relative to each other. For example, the shape of a cross-section of individual ones of the protrusions116bdiffer relative to the shape of the cross-section of other ones of the protrusions116b. The shapes of the cross-sections of the protrusions116bmay comprise, for example, a circle or a polygon as shown, or an amorphous shape as will be described. The polygons may comprise, for example, triangles, squares, pentagons, hexagons, heptagons, octagons, or other polygons having any number of sides.", "", "In one embodiment, the shape of the cross-sections of the protrusions116bvary randomly or pseudo-randomly. If the shape of the cross-sections of the protrusions116bvary pseudo-randomly, then a rule may be specified that no two adjacent ones of the protrusions would have the same cross-sectional shape. The randomness or pseudo-randomness of the variation of the shapes of the cross-sections of the protrusions116bprovides for a desired visual contrast of the region109brelative to other portions of the surface106(FIG.1).", "", "In addition, according to one embodiment, the sides of the protrusions116bare tapered so that, in the case the protrusions116bare formed by way of voids in a mold, they can be easily removed from the voids in the mold as will be described.", "", "Referring next toFIG.4A, shown is another example of the region109(FIG.1) denoted herein as region109caccording to an embodiment of the present disclosure. The region109cincludes an example of the pattern113(FIG.1) of protrusions116(FIG.1) arranged in a pseudo-random manner, denoted herein as a pseudo-random pattern113cof protrusions116c.", "", "In the pattern113c, the protrusions116chave a cross-section of a polygon such as a triangle as shown. Each of the protrusions116cis positioned with a given angular position within the region109c. As contemplated herein, the angular position of an object refers to how far the object is rotated relative to a reference angular position. The reference angular position may comprise the angular position of a given protrusion116cwithin the region109cor may be a predefined angular position relative to the structure of the tire such as a radial axis.", "", "In one embodiment, the angular position of individual ones of the protrusions116cis varied randomly or pseudo-randomly relative to a reference angular position or relative to each other. In one example, for protrusions116cthat have a common cross-sectional shape, a first one of the protrusions116cmay be positioned with a first angular position, and a second one of the protrusions116cmay be positioned with a second angular position, where the first angular position differs relative to the second angular position.", "", "The randomness or pseudo-randomness of the variation of the angular positions of the protrusions116cin this manner provides for a desired visual contrast of the region109crelative to other portions of the surface106(FIG.1).", "", "In addition, according to one embodiment, the sides of the protrusions116care tapered so that, in the case the protrusions116care formed by way of voids in a mold, they can be easily removed from the voids in the mold as will be described.", "", "Referring toFIG.4B, shown is a top view of two example protrusions116c. As shown, the angular position of either one of the protrusions116cvaries relative to the angular position of the other one of the protrusions116cby an angle β.", "", "Referring next toFIG.5, shown is another example of the region109(FIG.1) denoted herein as region109daccording to an embodiment of the present disclosure. The region109dincludes an example of the pattern113(FIG.1) of protrusions116(FIG.1) arranged in a pseudo-random manner, denoted herein as a pseudo-random pattern113dof protrusions116d.", "", "In the region109d, the width of each of the protrusions116dis varied in a random or pseudo-random manner. In one embodiment, the width of individual ones of the protrusions116dis varied relative to at least some of the other ones of the protrusions116d. Stated another way, given that the protrusions116dmay be tapered, the maximum width of individual ones of the protrusions116dvary relative to each other.", "", "In addition, according to one embodiment, the sides of the protrusions116dare tapered so that, in the case the protrusions116dare formed by way of voids in a mold, they can be easily removed from the voids in the mold as will be described.", "", "The randomness or pseudo-randomness of the variation of the width or maximum width of the protrusions116din this manner provides for a desired visual contrast of the region109drelative to other portions of the surface106(FIG.1).", "", "Referring next toFIG.6, shown is another example of the region109(FIG.1) denoted herein as region109eaccording to an embodiment of the present disclosure. The region109eincludes an example of the pattern113(FIG.1) of protrusions116(FIG.1) arranged in a pseudo-random manner, denoted herein as a pseudo-random pattern113eof protrusions116e.", "", "In the region109e, the height of each of the protrusions116eis varied in a random or pseudo-random manner. In one embodiment, the height of individual ones of the protrusions116eis varied relative to at least some of the other ones of the protrusions116e. Alternatively, the height of each individual one of the protrusions116eis unique with respect to the heights of the remaining ones of the protrusions116ewithin a region109e.", "", "In addition, according to one embodiment, the sides of the protrusions116eare tapered so that, in the case the protrusions116eare formed by way of voids in a mold, they can be easily removed from the voids in the mold as will be described.", "", "The randomness or pseudo-randomness of the variation of the height of the protrusions116ein this manner provides for a desired visual contrast of the region109erelative to other portions of the surface106(FIG.1).", "", "Referring next toFIG.7, shown is an example of a portion of a region109(FIG.1) denoted herein as a region109faccording to an embodiment of the present disclosure. The portion of the region109fincludes a pair of protrusions116(FIG.1) denoted herein as protrusions116f. The protrusions116fare part of a pattern113(FIG.1) arranged in a pseudo-random manner as described above.", "", "According to one embodiment, disposed on the distal end of each of the protrusions116fis a surface contour123. As shown, the surface contour123of a first one of the protrusions116fis unique with respect to the second one of the protrusions116f. According to another embodiment, in a given pattern113, the surface contour123of each one of the protrusions116fis unique with respect to the surface contours123of the other ones of the protrusions116f. In this way, the surface contours123are created in a random or pseudo-random manner.", "", "In addition, according to one embodiment, the sides of the protrusions116fmay be tapered so that, in the case the protrusions116fare formed by way of voids in a mold, they can be easily removed from the voids in the mold as will be described.", "", "The randomness or pseudo-randomness of the variation of the height of the protrusions116fin this manner provides for a desired visual contrast of the region109frelative to other portions of a surface106(FIG.1).", "", "Referring next toFIG.8, shown is an example of a portion of a region109(FIG.1) denoted herein as a region109gaccording to an embodiment of the present disclosure. The portion of the region109gincludes a pair of protrusions116(FIG.1) denoted herein as protrusions116g. Although only two protrusions116gare shown, it is understood that the region109gmay include many more protrusions116gas is depicted in the various regions109described above. Thus, the protrusions116gare part of a pattern113(FIG.1) arranged in a pseudo-random manner as described above.", "", "According to one embodiment, the cross-sectional shape of each individual one of the protrusions116gis amorphous. As contemplated herein, an amorphous shape is one that is indefinite or arbitrary. In one example, the amorphous cross-sectional shape of a first one of the protrusions116fis unique with respect to the amorphous cross-sectional shape126of the second one of the protrusions116g. According to another embodiment, in a given pattern113, the amorphous cross-sectional shape of each one of the protrusions116gis unique with respect to the amorphous cross-sectional shape of the other ones of the protrusions116g. In this way, the amorphous cross-sectional shape126of each of the protrusions116gis created in a random or pseudo-random manner.", "", "In addition, according to one embodiment, the sides of the protrusions116gmay be tapered so that, in the case the protrusions116gare formed by way of voids in a mold, they can be easily removed from the voids in the mold as will be described.", "", "The randomness or pseudo-randomness of the variation of the amorphous cross-sectional shape of the protrusions116fin this manner provides for a desired visual contrast of the region109grelative to other portions of a surface106(FIG.1).", "", "Referring back toFIGS.1through8, various features associated with a pattern113of protrusions116are described. It is understood that in any given pattern113of protrusions116, any combination of two or more of these features may be combined to achieve a desired visual contract or effect relative to other regions on the surface106of a tire103. As described above, such features may comprise, for example, the pseudo-random positioning of the protrusions116a(FIG.2), the cross-sectional shape of the protrusions116a(FIG.2), the fact that the cross-section of individual ones of the protrusions116b(FIG.3) in the region109b(FIG.3) differ relative to each other, or the fact that the angular position of individual ones of the protrusions116c(FIG.4) may be varied randomly or pseudo-randomly relative to a reference angular position or relative to each other. The features also include a width or maximum width of each of the protrusions116d(FIG.5) that may be varied in a random or pseudo-random manner, a height of each of the protrusions116e(FIG.6) that may be varied in in a random or pseudo-random manner, a surface contour123(FIG.7) of each of the protrusions116f(FIG.7) may be unique with respect to other ones of the protrusions116f(FIG.7), or an amorphous cross-sectional shape126(FIG.8) of one of the protrusions116f(FIG.8) that may be unique with respect to amorphous cross-sectional shape126of other ones of the protrusions116f.", "", "Referring next toFIG.9, shown is one approach to creating a pseudo-random pattern113of protrusions116in a region109on the surface106of a tire103(FIG.1). In one embodiment, a laser133is controlled to engrave the pseudo-random pattern113of protrusions116onto the surface106of the tire103.", "", "Turning toFIG.10, shown is a drawing that depicts a portion of a mold136that is used to form or create the pseudo-random pattern113of protrusions116in a region109on a surface106of a tire103(FIG.1). In one embodiment, the mold136is part of a tire mold used to create tires103. As shown, the mold136includes voids139that form the protrusions116.", "", "With reference toFIGS.1through10, in view of the foregoing discussion, below is a description of various example embodiments of the present disclosure. It is understood that the below embodiments are not an exhaustive recitation of the possible embodiments of the present disclosure.", "", "Embodiment 1 is an apparatus, comprising a tire having at least one surface, where at least one region on the surface includes a plurality of protrusions. The protrusions are positioned in a pseudo-random pattern within the region.", "", "Embodiment 2 is an apparatus as set forth in embodiment 1, wherein the surface is located on a sidewall of the tire.", "", "Embodiment 3 comprises an apparatus as set forth in embodiments 1 or 2, wherein the pseudo-random pattern is defined by a predefined minimum distance between any two adjacent ones of the protrusions.", "", "Embodiment 4 comprises an apparatus as set forth in any one of embodiments 1 through 3, wherein the pseudo-random pattern is defined by a predefined maximum distance between any two adjacent ones of the protrusions.", "", "Embodiment 5 comprises an apparatus as set forth in any one of embodiments 1 through 4, wherein individual ones of the protrusions are less than 1 millimeter in height.", "", "Embodiment 6 comprises an apparatus as set forth in any one of embodiments 1 through 5, wherein a maximum width of individual ones of the protrusions is less than 1 millimeter.", "", "Embodiment 7 comprises an apparatus as set forth in any one of embodiments 1 through 6, wherein the protrusions comprise a cross-section in a shape of a circle.", "", "Embodiment 8 comprises an apparatus as set forth in any one of embodiments 1 through 6, wherein the protrusions comprise a cross-section in a shape of a polygon.", "", "Embodiment 9 comprises an apparatus as set forth in any one of embodiments 1 through 6, wherein the protrusions comprise an amorphous cross-section.", "", "Embodiment 10 comprises an apparatus as set forth in any one of embodiments 1 through 9, wherein a shape of a cross-section of individual ones of the protrusions differs relative to the shape of the cross-section of other ones of the protrusions.", "", "Embodiment 11 comprises an apparatus as set forth in any one of embodiments 1 through 10, wherein a size of the protrusions is specified such that the protrusions cannot be resolved by the naked human eye at a distance of at least 1 meter.", "", "Embodiment 12 comprises an apparatus as set forth in any one of embodiments 1 through 11, further comprising each of the protrusions having one of a plurality of surface contours. Each of the surface contours are disposed at a distal end of a respective one of the protrusions. A first one of the surface contours is unique with respect to a plurality of the other ones of the surface contours.", "", "Embodiment 13 comprises an apparatus as set forth in any one of embodiments 1-9, 11, and 12, wherein a plurality of the protrusions have a common shape, and at least a first one of the protrusions is positioned with a first angular position and at least a second one of the protrusions is positioned with a second angular position, where the first angular position differs relative to the second angular position.", "", "Embodiment 14 is a method, comprising creating a plurality of protrusions within at least one region on a surface of a tire, wherein the positions of the protrusions within the at least one region are arranged in a pseudo-random pattern.", "", "Embodiment 15 comprises a method as set forth in embodiment 14, wherein the creation of the plurality of protrusions further comprises creating the protrusions by way of a mold.", "", "Embodiment 16 comprises a method as set forth in embodiment 14, wherein the creation of the plurality of protrusions further comprises creating the protrusions by way of laser engraving.", "", "Embodiment 17 comprises a method as set forth in any one of embodiments 14 through 16, further comprising specifying a predefined minimum distance between any two adjacent ones of the protrusions in the pseudo-random pattern, and specifying a predefined maximum distance between any two adjacent ones of the protrusions in the pseudo-random pattern.", "", "Embodiment 18 comprises a method as set forth in any one of embodiments 14 through 17, wherein individual ones of the protrusions are less than 1 millimeter in height and have a maximum width of less than 1 millimeter.", "", "Embodiment 19 is an apparatus, comprising an item including rubber surface. At least one region is included on the rubber surface, the at least one region including a plurality of protrusions. The protrusions are positioned in a pseudo-random pattern within the region.", "", "Embodiment 20 comprises an apparatus as set forth in embodiment 19, wherein a shape of a cross-section of individual ones of the protrusions differs relative to the shape of the cross-section of other ones of the protrusions.", "", "Embodiment 21 comprises an apparatus of embodiments 19 or 20, wherein individual ones of the protrusions are less than 1 millimeter in height and have a maximum width of less than 1 millimeter.", "", "In the present disclosure, disjunctive language such as the phrase “at least one of X, Y, or Z,” unless specifically stated otherwise, is otherwise understood with the context as used in general to present that an item, term, etc., may be either X, Y, or Z, or any combination thereof (e.g., X, Y, and/or Z). Thus, such disjunctive language is not generally intended to, and should not, imply that certain embodiments require at least one of X, at least one of Y, or at least one of Z to each be present.", "", "It should be emphasized that the above-described embodiments of the present disclosure are merely possible examples of implementations set forth for a clear understanding of the principles of the disclosure. Many variations and modifications may be made to the above-described embodiment(s) without departing substantially from the spirit and principles of the disclosure. All such modifications and variations are intended to be included herein within the scope of this disclosure and protected by the following claims."], "claims": ["a tire having at least one surface; at least one region on the surface including a plurality of protrusions; and the protrusions being positioned in a pseudo-random pattern within the region.", "2 . The apparatus of claim 1 , wherein the surface is located on a sidewall of the tire.", "3 . The apparatus of claim Error! Bookmark not defined, wherein the pseudo-random pattern is defined by a predefined minimum distance between any two adjacent ones of the protrusions.", "4 . The apparatus of claim Error! Bookmark not defined, wherein the pseudo-random pattern is defined by a predefined maximum distance between any two adjacent ones of the protrusions.", "5 . The apparatus of claim Error! Bookmark not defined, wherein individual ones of the protrusions are less than 1 millimeter in height.", "6 . The apparatus of claim Error! Bookmark not defined, wherein a maximum width of individual ones of the protrusions is less than 1 millimeter.", "7 . The apparatus of claim Error! Bookmark not defined, wherein the protrusions comprise a cross-section in a shape of a circle.", "8 . The apparatus of claim Error! Bookmark not defined, wherein the protrusions comprise a cross-section in a shape of a polygon.", "9 . The apparatus of claim Error! Bookmark not defined, wherein the protrusions comprise an amorphous cross-section.", "10 . The apparatus of claim Error! Bookmark not defined, wherein a shape of a cross-section of individual ones of the protrusions differs relative to the shape of the cross-section of other ones of the protrusions.", "11 . The apparatus of claim Error! Bookmark not defined, wherein a size of the protrusions is specified such that the protrusions cannot be resolved by a naked human eye at a distance of at least 1 meter.", "each of the protrusions having a one of a plurality of surface contours; wherein each of the surface contours are disposed at a distal end of a respective one of the protrusions; and a first one of the surface contours is unique with respect to a plurality of other ones of the surface contours.", "13 . The apparatus of claim Error! Bookmark not defined, wherein a plurality of the protrusions have a common shape, and at least a first one of the protrusions is positioned with a first angular position and at least a second one of the protrusions is positioned with a second angular position, where the first angular position differs relative to the second angular position.", "creating a plurality of protrusions within at least one region on a surface of a tire; and wherein positions of the protrusions within the at least one region are arranged in a pseudo-random pattern.", "15 . The method of claim 14 , wherein the creation of the plurality of protrusions further comprises creating the protrusions by way of a mold.", "16 . The method of claim 14 , wherein the creation of the plurality of protrusions further comprises creating the protrusions by way of laser engraving.", "specifying a predefined minimum distance between any two adjacent ones of the protrusions in the pseudo-random pattern; specifying a predefined maximum distance between any two adjacent ones of the protrusions in the pseudo-random pattern.", "18 . The method of claim Error! Bookmark not defined, wherein individual ones of the protrusions are less than 1 millimeter in height and have a maximum width of less than 1 millimeter.", "an item including rubber surface; at least one region on the rubber surface, the at least one region including a plurality of protrusions; and the protrusions being positioned in a pseudo-random pattern within the region.", "20 . The apparatus of claim 19 , wherein a shape of a cross-section of individual ones of the protrusions differs relative to the shape of the cross-section of other ones of the protrusions."], "bibtex": "@patent{20250121633,\n    title = {SYSTEM AND METHOD FOR CREATING CONTRAST ON A SURFACE},\n    number = {20250121633},\n    year = {2025},\n    note = {File: US20250121633A1-20250417.XML}\n    }", "classification": "B60C1300FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20250121634", "filename": "US20250121634A1-20250417.XML", "abstract": "A pneumatic tire can include a plurality of Helmholtz sound absorbers on a tire inner cavity surface. The plurality of Helmholtz sound absorbers can have a first resonance frequency as a maximum resonance frequency and a second resonance frequency as a minimum resonance frequency. A difference between the first resonance frequency and the second resonance frequency can be 10 to 90 Hz.", "detailed_description": ["Hereinafter, embodiments of the present disclosure will be described in detail with reference to the drawings.", "", "FIG.1is a tire meridian cross-sectional view showing a pneumatic tire1in a standardized state according to one or more embodiments of the present disclosure. Here, the term “standardized state” can refer to a state where: the pneumatic tire1is mounted on a standardized rim and adjusted to a standardized internal pressure; and no load is applied to the pneumatic tire1. Hereinafter, dimensions and the like of constituents of the pneumatic tire1are values measured in the standardized state, unless otherwise specified.", "", "One or more embodiments of present disclosure have been made in view of the above circumstances in the Background section, and a object of one or more embodiments the present disclosure, among one or more objects, can be to provide a pneumatic tire capable of decreasing cavity resonance sound with a relatively simple configuration.", "", "The pneumatic tire according to the present disclosure can have the above configuration, as an example, and thus can decrease cavity resonance sound with a relatively simple configuration.", "", "If there is a standard system including a standard on which the pneumatic tire1is based, the term “standardized rim” can be regarded a rim defined for each tire by the standard and may be, for example, the “standard rim” in the JATMA standard, the “Design Rim” in the TRA standard, or the “Measuring Rim” in the ETRTO standard. If there is no standard system including a standard on which the pneumatic tire1is based, the term “standardized rim” can be regarded as a rim having the smallest rim diameter and having the smallest rim width, among rims on which the pneumatic tire1can be mounted and which do not cause air leakage.", "", "If there is a standard system including a standard on which the pneumatic tire1is based, the term “standardized internal pressure” can be regarded as an air pressure defined for each tire by the standard and is the “maximum air pressure” in the JATMA standard, the maximum value indicated in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, or the “INFLATION PRESSURE” in the ETRTO standard, as examples. If there is no standard system including a standard on which the pneumatic tire1is based, the term “standardized internal pressure” can be regarded as an air pressure defined for each tire by the manufacturer or the like.", "", "As shown inFIG.1, the pneumatic tire1according to one or more embodiments of the present disclosure suitably used as a tire for passenger cars, for instance. The pneumatic tire1is not limited to a tire for passenger cars and can be applicable to various tires such as a heavy-duty tire, a tire for motorcycles, a tire for racing vehicles, and a tire for industrial vehicles, for example.", "", "The pneumatic tire1according to one or more embodiments of the present disclosure can include a tread portion2, a pair of sidewall portions3, and a pair of bead portions4. Each of the sidewall portions3can be, for example, a portion extending to an inner side in a tire radial direction from a corresponding one of both ends in a tire axial direction of the tread portion2. Each of the bead portions4can be, for example, a portion located on the inner side in the tire radial direction relative to a corresponding one of the sidewall portions3. The bead portion4in one or more embodiments of the present disclosure can be a portion in contact with the standardized rim.", "", "Each of the pair of bead portions4can have, for example, an annular bead core5extending in a tire circumferential direction and a bead apex8extending to an outer side in the tire radial direction from the bead core5. The bead core5can be formed of, for example, a steel wire. The bead apex8can be formed of, for example, hard rubber. Such a bead portion4can have a relatively high rigidity. Thus, the bead portion4can suppress deformation during running and can contribute to decrease of cavity resonance sound in the pneumatic tire1.", "", "The pneumatic tire1according to one or more embodiments of the present disclosure can include: a carcass6extending between the pair of bead portions4; and a belt layer7disposed in the tread portion2. The belt layer7can be disposed on the outer side in the tire radial direction relative to the carcass6, for example. According to one or more embodiments, the pneumatic tire1can include a tire inner cavity surface1iwhich is located inward of the carcass6and which delimits a tire inner cavity.", "", "FIG.2is a schematic cross-sectional view of the pneumatic tire1as seen in the tire axial direction. As shown inFIG.1andFIG.2, the pneumatic tire1according to one or more embodiments of the present disclosure can include a plurality of Helmholtz sound absorbers9disposed on the tire inner cavity surface1i. The plurality of Helmholtz sound absorbers9in one or more embodiments of the present disclosure can have a first resonance frequency f1 as a maximum resonance frequency fmax and a second resonance frequency f2 as a minimum resonance frequency fmin. Such a pneumatic tire1can resonate at the plurality of frequencies, and thus can decrease cavity resonance sound, in the tire, that differs according to the running speed.", "", "A difference (f1−f2) between the first resonance frequency f1 and the second resonance frequency f2 can be 10 to 90 Hz, as an example, according to one or more embodiments of the present disclosure. Such a pneumatic tire1can efficiently decrease cavity resonance sound generated at a running speed of 10 to 200 km/h, for instance, and can enable decrease in the number of the Helmholtz sound absorbers9. Consequently, the pneumatic tire1according to one or more embodiments of the present disclosure can decrease the cavity resonance sound with a relatively less complex configuration. From this viewpoint, the difference (f1−f2) between the first resonance frequency f1 and the second resonance frequency f2 optionally may be 10 to 60 Hz.", "", "Optionally, the first resonance frequency f1 of the Helmholtz sound absorbers9can be 130 to 350 Hz, for instance. The second resonance frequency f2 of the Helmholtz sound absorbers9can be 120 to 340 Hz, for instance. Such Helmholtz sound absorbers9can cover a frequency band of cavity resonance sound generated by a tire for passenger cars and can efficiently decrease the cavity resonance sound in a tire for passenger cars.", "", "As shown inFIG.1, for instance, the carcass6can include at least one carcass ply, and in one or more embodiments of the present disclosure, can include two carcass plies6A and6B. The two carcass plies6A and6B can be, for example, a first carcass ply6A located, in the tread portion2, on the inner side in the tire radial direction and a second carcass ply6B located, in the tread portion2, on the outer side in the tire radial direction relative to the first carcass ply6A.", "", "At least one of the carcass plies6A and6B can include: a body portion6aextending from the tread portion2through the sidewall portions3to the bead cores5of the bead portions4; and turned-up portions6bcontiguous with the body portion6aand turned up around the respective bead cores5from an inner side to an outer side in the tire axial direction. In one or more embodiments of the present disclosure, each of the first carcass ply6A and the second carcass ply6B can include the body portion6aand the turned-up portions6b. Such a carcass6can contribute to improvement of the rigidities of the bead portions4and decrease of cavity resonance sound in the pneumatic tire1.", "", "At least one of the carcass plies6A and6B can be such that an outer end6ein the tire radial direction of each of the turned-up portions6bis located on the outer side in the tire radial direction relative to a tire maximum width position P at which a tire cross-sectional width W is maximum. The carcass6can be, for example, such that: the outer end6eof the turned-up portion6bof the first carcass ply6A is located on the outer side in the tire radial direction relative to the tire maximum width position P; and the outer end6eof the turned-up portion6bof the second carcass ply6B is located on the inner side in the tire radial direction relative to the tire maximum width position P. Such a carcass6can achieve both the rigidities of the sidewall portions3and decrease in weight, and can decrease cavity resonance sound in, and the rolling resistance of, the pneumatic tire1.", "", "Each of the carcass plies6A and6B can include, for example, carcass cords which can be organic fiber cords. Examples of the organic fiber cords can include: single-fiber cords each made from one type of fiber selected from the group consisting of polyethylene terephthalate fibers, polyethylene naphthalate fibers, nylon fibers, aramid fibers, and rayon fibers; and hybrid-fiber cords each made from two or more types of fibers selected from said group.", "", "According to one or more embodiments, the carcass cords can be arranged at an angle of 25 to 90° relative to the tire circumferential direction. If the carcass cords are tilted at an angle of smaller than 90° relative to the tire circumferential direction, the carcass cords of the first carcass ply6A and the carcass cords of the second carcass ply6B can be tilted in mutually opposite directions relative to the tire circumferential direction. For the carcass6, for example, a bias structure may be employed. Here, the angle of each of the carcass cords can be an angle obtained with the pneumatic tire1being in the standardized state and can be ascertained by, for example, partially peeling the tread portion2.", "", "The belt layer7can include at least one belt ply such as two or more belt plies. According to one or more embodiments of the present disclosure, the belt layer7can include two belt plies7A and7B. The two belt plies7A and7B can be, for example, a first belt ply7A located on the inner side in the tire radial direction and a second belt ply7B located on the outer side in the tire radial direction relative to the first belt ply7A. The belt layer7according to one or more embodiments of the present disclosure can have outer ends7ewhich are outer ends7ein the tire axial direction of the first belt ply7A. Such a belt layer7can improve the rigidity of the tread portion2and can decrease cavity resonance sound in the pneumatic tire1.", "", "Each of the belt plies7A and7B may include, for example, belt cords which can be steel cords. The belt cords may each be, for example, a single steel wire or a twisted wire obtained by twisting a plurality of steel filaments together.", "", "The belt cords can be arranged at, for example, an angle of 10 to 30° relative to the tire circumferential direction. The belt cords of the first belt ply7A and the belt cords of the second belt ply7B can be tilted in mutually opposite directions relative to the tire circumferential direction.", "", "Such a belt layer7can improve the rigidity of the tread portion2in a balanced manner and can decrease cavity resonance sound in the pneumatic tire1. Here, the angle of each of the belt cords can be an angle obtained with the pneumatic tire1being in the standardized state and can be ascertained by, for example, partially peeling the tread portion2.", "", "The tread portion2according to one or more embodiments of the present disclosure can have a ground-contact surface2sextending between a pair of tread ends Te. Here, the tread ends Te can be regarded as outermost ground-contact positions in the tire axial direction when: 70% of a standardized load is applied to the pneumatic tire1in the standardized state; and the pneumatic tire1in this state is brought into contact with a flat surface at a camber angle of 0°. The ground-contact surface2scan have a tire tread width TW which can be regarded as the distance in the tire axial direction between the pair of tread ends Te. The center position in the tire axial direction between the pair of tread ends Te can be regarded as a tire equator C.", "", "If there is a standard system including a standard on which the pneumatic tire1is based, the term “standardized load” can be regarded as a load defined for each tire by the standard and is the “maximum load capacity” in the JATMA standard, the maximum value indicated in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, or the “LOAD CAPACITY” in the ETRTO standard, as examples. If there is no standard system including a standard on which the pneumatic tire1is based, the term “standardized load” can be regarded as a load defined for each tire by the manufacturer or the like as a maximum load that can be applied during use of the pneumatic tire1.", "", "Each of the plurality of Helmholtz sound absorbers9according to one or more embodiments of the present disclosure can be disposed on the inner side in the tire radial direction relative to the ground-contact surface2s. That is, each of the plurality of Helmholtz sound absorbers9can be disposed within the range of the tire tread width TW with the tire equator C being the center of the range. According to one or more embodiments of the present disclosure, the plurality of Helmholtz sound absorbers9can be arranged in one row on the tire equator C, for example. Such Helmholtz sound absorbers9can receive force in such a direction as to be pressed against the tire inner cavity surface1iwhen centrifugal force is applied, whereby the risk that the Helmholtz sound absorbers9peeling from the tire inner cavity surface1ican be decreased.", "", "Each of the outer ends7eof the belt layer7according to one or more embodiments of the present disclosure can be located on the outer side in the tire axial direction relative to a corresponding one of the tread ends Te. Such a belt layer7can improve the rigidity of the entirety of the ground-contact surface2sof the tread portion2and can contribute to decrease of cavity resonance sound in the pneumatic tire1.", "", "Each of the plurality of Helmholtz sound absorbers9according to one or more embodiments of the present disclosure can be disposed on the inner side in the tire radial direction relative to the belt layer7. With such a Helmholtz sound absorber9, since deformation of the tread portion2upon contact with the ground can be suppressed by the belt layer7having a relatively high rigidity, resonance sound generated from the Helmholtz sound absorber9owing to impact upon the contact with the ground can be suppressed.", "", "As shown inFIG.2, the plurality of Helmholtz sound absorbers9can be arranged away from each other. The plurality of Helmholtz sound absorbers9can be arranged away from each other in the tire circumferential direction, for example. Such Helmholtz sound absorbers9can decrease cavity resonance sound over the entire region of the pneumatic tire1.", "", "The plurality of Helmholtz sound absorbers9according to one or more embodiments of the present disclosure can include a plurality of first sound absorbers9A each having the first resonance frequency f1 and a plurality of second sound absorbers9B each having the second resonance frequency f2. According to one or more embodiments of the present disclosure, the number of the first sound absorbers9A provided in each of rows arranged in the tire circumferential direction can be an even number, and the number of the second sound absorbers9B provided in each of the rows can be an even number. Optionally, the number of first sound absorbers9A may be the same as the number of second sound absorbers9B. Such Helmholtz sound absorbers9can facilitate adjustment of balance at the time of rotation of the tire. Although Helmholtz sound absorbers can be arranged in one row as an example of the plurality of Helmholtz sound absorbers9, the plurality of Helmholtz sound absorbers9may be arranged in a plurality of rows.", "", "A pair of the first sound absorbers9A provided in each of the rows can be disposed at, for example, positions opposed to each other with a tire rotation axis therebetween. A pair of the second sound absorbers9B provided in each of the rows can be disposed at, for example, positions opposed to each other with the tire rotation axis therebetween. Such Helmholtz sound absorbers9can be provided in balanced manner or format at the time of rotation of the tire and can suppress generation of vibrations and noise during running with the pneumatic tire1.", "", "FIG.3is a perspective view of the Helmholtz sound absorber9according to one or embodiments of the present disclosure. As shown inFIG.3, the Helmholtz sound absorber9can include: a sound absorption chamber9ahaving a space therein; and a tube portion9bconnecting the sound absorption chamber9aand the tire inner cavity to each other. Such a Helmholtz sound absorber9can have a different resonance frequency f by adjusting the volume of the sound absorption chamber9aand the length of the tube portion9b.", "", "Each of the first sound absorbers9A according to one or more embodiments of the present disclosure can include a first sound absorption chamber9ahaving the first resonance frequency f1. Each of the second sound absorbers9B can include, for example, a second sound absorption chamber9chaving the second resonance frequency f2.", "", "According to one or more embodiments of the present disclosure, each of the plurality of Helmholtz sound absorbers9can be formed of a resin having a shape that does not change at 120° C. or lower, as an example range. Such a Helmholtz sound absorber9can maintain the sound absorption performance thereof without any change in the shape even when the temperature of the pneumatic tire1becomes high during running at a high speed.", "", "Examples of the material of the Helmholtz sound absorber9can include polypropylene (PP), polystyrene (PS), polyethylene terephthalate (PET), polyvinylidene chloride (PVDC), polyvinylidene fluoride (PVDF), polyamides (PA), polycarbonates (PC), polyphenylene sulfide (PPS), polyimides (PI), polyetherimide (PEI), polysulfone (PSF), polysulfone (PSU), polytetrafluoroethylene (PTFE), polychlorotrifluoroethylene (PCTFE), polyamide-imides (PAI), phenol resins (PF), melamine resins (MF), unsaturated polyesters (UP), polyurethane (PU), polydiallyl phthalate (PDAP), silicon resins (SI), epoxy resins (EP), furan-formaldehyde resins (FF), cellulose acetate (CA), cellulose nitrate (CN), cellulose propionate (CP), ethylcellulose (EC), and the like.", "", "The plurality of Helmholtz sound absorbers9may further have, for example, at least one resonance frequency f different from the first resonance frequency f1 and the second resonance frequency f2. Such Helmholtz sound absorbers9can widely resonate with a frequency band of cavity resonance sound and can more assuredly decrease cavity resonance sound.", "", "The plurality of Helmholtz sound absorbers9can be such that unit widths df which are differences between a set of the resonance frequencies f adjacent to each other in a frequency band are substantially equal. Here, the fact that the unit widths df can be substantially equal can mean that the difference between every two unit widths df is 10% or lower of each of said unit widths df. Such Helmholtz sound absorbers9can evenly absorb sound over the entire frequency band.", "", "According to one or more embodiments of the present disclosure, each of the unit widths df in the plurality of Helmholtz sound absorbers9can be 3 to 10 Hz, as an example range. Such Helmholtz sound absorbers9can evenly absorb sound over the entire frequency band without excessively increasing the number of types of the Helmholtz sound absorbers9.", "", "FIG.4is a perspective view of a Helmholtz sound absorber10according to one or more embodiments of the present disclosure. As shown inFIG.4, each of a plurality of the Helmholtz sound absorbers10may include, for example, a sound absorption chamber10ahaving a hemispherical shape and a tube portion10bextending along the sound absorption chamber10a. Such a Helmholtz sound absorber10can absorb cavity resonance sound in the tire inner cavity in a balanced manner by adjusting the orientation of the tube portion10b.", "", "FIG.5is a perspective view of a Helmholtz sound absorber11according to one or more embodiments of the present disclosure. As shown inFIG.5, each of a plurality of the Helmholtz sound absorbers11may include, for example, at least one first sound absorption chamber11ahaving the first resonance frequency f1 and at least one second sound absorption chamber11chaving the second resonance frequency f2. Such Helmholtz sound absorbers11can enable one of the Helmholtz sound absorbers11to have the plurality of resonance frequencies f. Consequently, the Helmholtz sound absorbers11can decrease cavity resonance sound with a simple configuration.", "", "A first sound absorber11A having the first sound absorption chamber11aand a second sound absorber11B having the second sound absorption chamber11ccan be formed to be integrated with each other or otherwise formed in one piece. Such Helmholtz sound absorbers11can enable decrease in the number of parts, and furthermore, can decrease cavity resonance sound over a wide frequency band.", "", "FIG.6is a tire meridian cross-sectional view showing a pneumatic tire21in the standardized state according to one or more embodiments of the present disclosure. As shown inFIG.6, similar to the above pneumatic tire1, the pneumatic tire21can include the tread portion2, the pair of sidewall portions3, and the pair of bead portions4. Each of the bead portions4can have, for example, the annular bead core5extending in the tire circumferential direction and the bead apex8extending to the outer side in the tire radial direction from the bead core5.", "", "The pneumatic tire21according to one or more embodiments of the present disclosure can include: the carcass6extending between the pair of bead portions4; and the belt layer7disposed, in the tread portion2, on the outer side in the tire radial direction relative to the carcass6. The carcass6can include, for example, the two carcass plies6A and6B each having the body portion6aand the turned-up portions6b. The belt layer7can include, for example, the two belt plies7A and7B. Similar to the above pneumatic tire1, the pneumatic tire21can include a tire inner cavity surface21iwhich is located inward of the carcass6and which delimits the tire inner cavity.", "", "Similar to the above pneumatic tire1, the pneumatic tire21according to one or more embodiments of the present disclosure can include the plurality of Helmholtz sound absorbers9disposed on the tire inner cavity surface21i. Each of the plurality of Helmholtz sound absorbers9can be disposed on the inner side in the tire axial direction relative to at least one of either of the sidewall portions3and either of the bead portions4. Such a Helmholtz sound absorber9can make it possible to, even when the tread portion2is deformed upon contact with the ground, suppress shift of the Helmholtz sound absorber9itself and suppress resonance sound generated from the Helmholtz sound absorber9owing to impact upon the contact with the ground.", "", "Each of the plurality of Helmholtz sound absorbers9can be disposed on the inner side in the tire axial direction relative to either of the bead portions4. Such a Helmholtz sound absorber9may not raise a concern that the Helmholtz sound absorber9might generate resonance sound owing to impact upon contact with the ground. Thus, the Helmholtz sound absorber9can assuredly decrease cavity resonance sound.", "", "Each of the plurality of Helmholtz sound absorbers9can be disposed on the inner side in the tire axial direction within a range extending from an inner end5ein the tire radial direction of either of the bead cores5to an outer end8ein the tire radial direction of a corresponding one of the bead apexes8, for example. That is, each of the plurality of Helmholtz sound absorbers9can be disposed within a range of a height H from the inner end5eof either of the bead cores5to the outer end8eof the corresponding one of the bead apexes8. Such a Helmholtz sound absorber9can assuredly decrease cavity resonance sound since the Helmholtz sound absorber9can be disposed within such a range that a high rigidity is imparted.", "", "In a case where each of the plurality of Helmholtz sound absorbers9is disposed on the inner side in the tire axial direction relative to either of the sidewall portions3, the Helmholtz sound absorber9can be disposed on the inner side in the tire radial direction relative to either of the outer ends6eof each of the carcass plies6A and6B. Such a Helmholtz sound absorber9can contribute to suppression of resonance sound generated from the Helmholtz sound absorber9owing to impact upon contact with the ground.", "", "Although the particularly preferred embodiments of the present disclosure have been described in detail above, one or more embodiments of the present disclosure are not limited to the above-described embodiments, and various modifications can be implemented."], "claims": ["a plurality of Helmholtz sound absorbers on a tire inner cavity surface, wherein the plurality of Helmholtz sound absorbers have a first resonance frequency as a maximum resonance frequency and a second resonance frequency as a minimum resonance frequency, and a difference between the first resonance frequency and the second resonance frequency is 10 to 90 Hz.", "the first resonance frequency is 130 to 350 Hz, and the second resonance frequency is 120 to 340 Hz.", "3 . The pneumatic tire according to claim 1 , wherein the plurality of Helmholtz sound absorbers are arranged away from each other.", "4 . The pneumatic tire according to claim 1 , wherein each of the plurality of Helmholtz sound absorbers is formed of a resin having a shape that does not change at 120° C. or lower.", "5 . The pneumatic tire according to claim 1 , wherein the plurality of Helmholtz sound absorbers further have at least one resonance frequency different from the first resonance frequency and the second resonance frequency.", "6 . The pneumatic tire according to claim 5 , wherein the plurality of Helmholtz sound absorbers are such that unit widths which are differences between a set of the resonance frequencies adjacent to each other in a frequency band are substantially equal.", "7 . The pneumatic tire according to claim 6 , wherein each of the unit widths is 3 to 10 Hz.", "8 . The pneumatic tire according to claim 1 , wherein each of the plurality of Helmholtz sound absorbers includes at least one first sound absorption chamber having the first resonance frequency and at least one second sound absorption chamber having the second resonance frequency.", "9 . The pneumatic tire according to claim 8 , wherein a first sound absorber having the first sound absorption chamber and a second sound absorber having the second sound absorption chamber are integrated with each other.", "10 . The pneumatic tire according to claim 1 , wherein the difference between the first resonance frequency and the second resonance frequency is 10 to 60 Hz.", "a tread portion; a pair of sidewall portions each extending to an inner side in a tire radial direction from a corresponding one of both ends in a tire axial direction of the tread portion; and a pair of bead portions each located on the inner side in the tire radial direction relative to a corresponding one of the pair of sidewall portions, wherein each of the plurality of Helmholtz sound absorbers is on an inner side in the tire axial direction relative to at least one of either of the pair of sidewall portions and either of the pair of bead portions.", "12 . The pneumatic tire according to claim 1 , wherein each of the plurality of Helmholtz sound absorbers is within a range of a tire tread width centered on an equator of the tire.", "of the plurality of Helmholtz sound absorbers a first set of the Helmholtz sound absorbers have the first resonance frequency, of the plurality of Helmholtz sound absorbers a second set of the Helmholtz sound absorbers, different from the Helmholtz sound absorbers of the first set, have the second resonance frequency, a total number of the Helmholtz sound absorbers of the first set is a first even number, and a total number of the Helmholtz sound absorbers of the second set is a second even number.", "14 . The pneumatic tire according to claim 13 , wherein the first resonance frequency is 210 Hz and the second resonance is 201 Hz.", "15 . The pneumatic tire according to claim 13 , wherein the first resonance frequency is 225 Hz and the second resonance is 195 Hz.", "16 . The pneumatic tire according to claim 1 , wherein the plurality of Helmholtz sound absorbers are evenly spaced on the tire inner cavity surface in a circumferential direction of the pneumatic tire.", "17 . The pneumatic tire according to claim 1 , wherein each of the plurality of Helmholtz sound absorbers is on the tire inner cavity surface within a range extending from an inner end in a tire radial direction of either bead core of the pneumatic tire to an outer end in the tire radial direction of a corresponding bead apex of the pneumatic tire.", "18 . The pneumatic tire according to claim 1 , wherein each of the plurality of Helmholtz sound absorbers is on the tire inner cavity surface within a range of a height H from an inner end of either bead core of the pneumatic tire to an outer end of a corresponding bead apex of the pneumatic tire.", "19 . The pneumatic tire according to claim 1 , wherein the pneumatic tire is configured to rotate at a speed of 20 Km/h to 150 Km/h."], "bibtex": "@patent{20250121634,\n    title = {PNEUMATIC TIRE},\n    number = {20250121634},\n    year = {2025},\n    note = {File: US20250121634A1-20250417.XML}\n    }", "classification": "B60C1900FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20250121635", "filename": "US20250121635A1-20250417.XML", "abstract": "The present invention is directed to a pneumatic tire including: a tread portion; a pair of sidewall portions extending to an inner side in a tire radial direction from both respective ends in a tire axial direction of the tread portion; a pair of bead portions located on the inner side in the tire radial direction relative to the pair of respective sidewall portions; and a plurality of Helmholtz sound absorbers disposed on a tire inner cavity surface. The plurality of Helmholtz sound absorbers include first and second sound absorbers respectively having a first resonance frequency and a second resonance frequency different from the first resonance frequency. Each of the first and second sound absorbers is disposed on an inner side in the tire axial direction relative to at least one of either of the pair of sidewall portions and either of the pair of bead portions.", "detailed_description": ["Hereinafter, an embodiment of the present invention will be described in detail with reference to the drawings.", "", "FIG.1is a tire meridian cross-sectional view showing a pneumatic tire1in a standardized state according to the present embodiment. Here, the “standardized state” refers to a state where: the pneumatic tire1is mounted on a standardized rim and adjusted to a standardized internal pressure; and no load is applied to the pneumatic tire1. Hereinafter, dimensions and the like of constituents of the pneumatic tire1are values measured in the standardized state, unless otherwise specified.", "", "If there is a standard system including a standard on which the pneumatic tire1is based, the “standardized rim” is a rim defined for each tire by the standard and is, for example, the “standard rim” in the JATMA standard, the “Design Rim” in the TRA standard, or the “Measuring Rim” in the ETRTO standard. If there is no standard system including a standard on which the pneumatic tire1is based, the “standardized rim” is a rim having the smallest rim diameter and having the smallest rim width, among rims on which the pneumatic tire1can be mounted and which do not cause air leakage.", "", "If there is a standard system including a standard on which the pneumatic tire1is based, the “standardized internal pressure” is an air pressure defined for each tire by the standard and is the “maximum air pressure” in the JATMA standard, the maximum value indicated in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, or the “INFLATION PRESSURE” in the ETRTO standard. If there is no standard system including a standard on which the pneumatic tire1is based, the “standardized internal pressure” is an air pressure defined for each tire by the manufacturer or the like.", "", "As shown inFIG.1, the pneumatic tire1according to the present embodiment is suitably used as a tire for passenger cars. The pneumatic tire1is not limited to a tire for passenger cars and is applicable to various tires such as a heavy-duty tire, a tire for motorcycles, a tire for racing vehicles, and a tire for industrial vehicles, for example.", "", "The pneumatic tire1according to the present embodiment includes a tread portion2, a pair of sidewall portions3, and a pair of bead portions4. Each of the sidewall portions3is, for example, a portion extending to an inner side in a tire radial direction from a corresponding one of both ends in a tire axial direction of the tread portion2. Each of the bead portions4is, for example, a portion located on the inner side in the tire radial direction relative to a corresponding one of the sidewall portions3. The bead portion4in the present embodiment is a portion in contact with the standardized rim.", "", "Each of the pair of bead portions4has, for example, an annular bead core5extending in a tire circumferential direction and a bead apex8extending to an outer side in the tire radial direction from the bead core5. The bead core5is formed of, for example, a steel wire. The bead apex8is formed of, for example, hard rubber. Such a bead portion4has a high rigidity. Thus, the bead portion4suppresses deformation during running and contributes to decrease of cavity resonance sound in the pneumatic tire1.", "", "The pneumatic tire1according to the present embodiment includes: a carcass6extending between the pair of bead portions4; and a belt layer7disposed in the tread portion2. The belt layer7is disposed on the outer side in the tire radial direction relative to the carcass6, for example. The pneumatic tire1desirably includes a tire inner cavity surface1iwhich is located inward of the carcass6and which delimits a tire inner cavity.", "", "FIG.2is a schematic cross-sectional view of the pneumatic tire1as seen in the tire axial direction. As shown inFIG.1andFIG.2, the pneumatic tire1according to the present embodiment includes a plurality of Helmholtz sound absorbers9disposed on the tire inner cavity surface1i. The plurality of Helmholtz sound absorbers9in the present embodiment include a first sound absorber9A having a first resonance frequency f1and a second sound absorber9B having a second resonance frequency f2different from the first resonance frequency f1. Such a pneumatic tire1resonates at the plurality of frequencies, and thus can decrease cavity resonance sound, in the tire, that differs according to the running speed.", "", "Each of the first sound absorber9A and the second sound absorber9B in the present embodiment is disposed on an inner side in the tire axial direction relative to at least one of either of the sidewall portions3and either of the bead portions4. Such a Helmholtz sound absorber9makes it possible to, even when the tread portion2is deformed upon contact with the ground, suppress shift of the Helmholtz sound absorber9itself and suppress resonance sound generated from the Helmholtz sound absorber9owing to impact upon the contact with the ground. Consequently, the pneumatic tire1according to the present embodiment can decrease the cavity resonance sound with a simple configuration.", "", "In a more preferable mode, the first resonance frequency f1is a maximum resonance frequency fmax in a frequency band including resonance frequencies f of the plurality of Helmholtz sound absorbers9. The second resonance frequency f2in the present embodiment is a minimum resonance frequency fmin in the frequency band including the resonance frequencies f of the plurality of Helmholtz sound absorbers9.", "", "A difference (f1−f2) between the first resonance frequency f1and the second resonance frequency f2is preferably 10 to 90 Hz. Such a pneumatic tire1can efficiently decrease cavity resonance sound generated at a running speed of 10 to 200 km/h and enables decrease in the number of the Helmholtz sound absorbers9. Consequently, the pneumatic tire1according to the present embodiment can decrease the cavity resonance sound with a simple configuration. From this viewpoint, the difference (f1−f2) between the first resonance frequency f1and the second resonance frequency f2is more preferably 10 to 60 Hz.", "", "The first resonance frequency f1of the Helmholtz sound absorbers9is preferably 130 to 350 Hz. The second resonance frequency f2of the Helmholtz sound absorbers9is preferably 120 to 340 Hz. Such Helmholtz sound absorbers9can cover a frequency band of cavity resonance sound generated by a tire for passenger cars and can efficiently decrease the cavity resonance sound in a tire for passenger cars.", "", "The plurality of Helmholtz sound absorbers9may further have, for example, at least one resonance frequency f different from the first resonance frequency f1and the second resonance frequency f2. Such Helmholtz sound absorbers9can widely resonate with a frequency band of cavity resonance sound and can more assuredly decrease cavity resonance sound.", "", "The plurality of Helmholtz sound absorbers9are desirably such that unit widths df which are differences between a set of the resonance frequencies f adjacent to each other in a frequency band are substantially equal. Here, the fact that the unit widths df are substantially equal means that the difference between every two unit widths df is 10% or lower of each of said unit widths df. Such Helmholtz sound absorbers9can evenly absorb sound over the entire frequency band.", "", "Each of the unit widths df in the plurality of Helmholtz sound absorbers9is preferably 3 to 10 Hz. Such Helmholtz sound absorbers9can evenly absorb sound over the entire frequency band without excessively increasing the number of types of the Helmholtz sound absorbers9.", "", "Each of the first sound absorber9A and the second sound absorber9B is desirably disposed on the inner side in the tire axial direction relative to either of the bead portions4. Such a Helmholtz sound absorber9does not raise a concern that the Helmholtz sound absorber9might generate resonance sound owing to impact upon contact with the ground. Thus, the Helmholtz sound absorber9can more assuredly decrease cavity resonance sound.", "", "Each of the first sound absorber9A and the second sound absorber9B is disposed on the inner side in the tire axial direction within a range extending from an inner end5ein the tire radial direction of either of the bead cores5to an outer end8ein the tire radial direction of a corresponding one of the bead apexes8, for example. That is, each of the plurality of Helmholtz sound absorbers9is desirably disposed within a range of a height H from the inner end5eof either of the bead cores5to the outer end8eof the corresponding one of the bead apexes8. Such a Helmholtz sound absorber9can more assuredly decrease cavity resonance sound since the Helmholtz sound absorber9is disposed within such a range that a high rigidity is imparted.", "", "In a case where each of the first sound absorber9A and the second sound absorber9B is disposed on the inner side in the tire axial direction relative to either of the sidewall portions3, the Helmholtz sound absorber9is desirably disposed on the inner side in the tire radial direction relative to either of the outer ends6eof each of the carcass plies6A and6B. Such a Helmholtz sound absorber9contributes to suppression of resonance sound generated from the Helmholtz sound absorber9owing to impact upon contact with the ground.", "", "As shown inFIG.1, the carcass6includes at least one carcass ply, and in the present embodiment, includes two carcass plies6A and6B. The two carcass plies6A and6B are, for example, a first carcass ply6A located, in the tread portion2, on the inner side in the tire radial direction and a second carcass ply6B located, in the tread portion2, on the outer side in the tire radial direction relative to the first carcass ply6A.", "", "At least one of the carcass plies6A and6B desirably includes: a body portion6aextending from the tread portion2through the sidewall portions3to the bead cores5of the bead portions4; and turned-up portions6bcontiguous with the body portion6aand turned up around the respective bead cores5from an inner side to an outer side in the tire axial direction. In the present embodiment, each of the first carcass ply6A and the second carcass ply6B includes the body portion6aand the turned-up portions6b. Such a carcass6contributes to improvement of the rigidities of the bead portions4and decrease of cavity resonance sound in the pneumatic tire1.", "", "At least one of the carcass plies6A and6B is such that an outer end6ein the tire radial direction of each of the turned-up portions6bis desirably located on the outer side in the tire radial direction relative to a tire maximum width position P at which a tire cross-sectional width W is maximum. The carcass6is, for example, such that: the outer end6eof the turned-up portion6bof the first carcass ply6A is located on the outer side in the tire radial direction relative to the tire maximum width position P; and the outer end6eof the turned-up portion6bof the second carcass ply6B is located on the inner side in the tire radial direction relative to the tire maximum width position P. Such a carcass6can achieve both the rigidities of the sidewall portions3and decrease in weight, and can decrease cavity resonance sound in, and the rolling resistance of, the pneumatic tire1.", "", "Each of the carcass plies6A and6B includes, for example, carcass cords (not shown) which are organic fiber cords. Examples of the organic fiber cords include: single-fiber cords each made from one type of fiber selected from the group consisting of polyethylene terephthalate fibers, polyethylene naphthalate fibers, nylon fibers, aramid fibers, and rayon fibers; and hybrid-fiber cords each made from two or more types of fibers selected from said group.", "", "The carcass cords are preferably arranged at an angle of 25 to 90° relative to the tire circumferential direction. If the carcass cords are tilted at an angle of smaller than 90° relative to the tire circumferential direction, the carcass cords of the first carcass ply6A and the carcass cords of the second carcass ply6B are desirably tilted in mutually opposite directions relative to the tire circumferential direction. For the carcass6, for example, a bias structure may be employed. Here, the angle of each of the carcass cords is an angle obtained with the pneumatic tire1being in the standardized state and can be ascertained by, for example, partially peeling the tread portion2.", "", "The belt layer7includes at least one belt ply and preferably includes two or more belt plies. In the present embodiment, the belt layer7includes two belt plies7A and7B. The two belt plies7A and7B are, for example, a first belt ply7A located on the inner side in the tire radial direction and a second belt ply7B located on the outer side in the tire radial direction relative to the first belt ply7A. The belt layer7in the present embodiment has outer ends7ewhich are outer ends7ein the tire axial direction of the first belt ply7A. Such a belt layer7can improve the rigidity of the tread portion2and can decrease cavity resonance sound in the pneumatic tire1.", "", "Each of the belt plies7A and7B includes, for example, belt cords (not shown) which are steel cords. The belt cords may each be, for example, a single steel wire or a twisted wire obtained by twisting a plurality of steel filaments together.", "", "The belt cords are arranged at, for example, an angle of 10 to 30° relative to the tire circumferential direction. The belt cords of the first belt ply7A and the belt cords of the second belt ply7B are desirably tilted in mutually opposite directions relative to the tire circumferential direction. Such a belt layer7can improve the rigidity of the tread portion2in a balanced manner and can decrease cavity resonance sound in the pneumatic tire1. Here, the angle of each of the belt cords is an angle obtained with the pneumatic tire1being in the standardized state and can be ascertained by, for example, partially peeling the tread portion2.", "", "The tread portion2in the present embodiment has a ground-contact surface2sextending between a pair of tread ends Te. Here, the tread ends Te are outermost ground-contact positions in the tire axial direction when: 70% of a standardized load is applied to the pneumatic tire1in the standardized state; and the pneumatic tire1in this state is brought into contact with a flat surface at a camber angle of 0°. The ground-contact surface2shas a tire tread width TW which is the distance in the tire axial direction between the pair of tread ends Te. The center position in the tire axial direction between the pair of tread ends Te is a tire equator C.", "", "If there is a standard system including a standard on which the pneumatic tire1is based, the “standardized load” is a load defined for each tire by the standard and is the “maximum load capacity” in the JATMA standard, the maximum value indicated in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, or the “LOAD CAPACITY” in the ETRTO standard. If there is no standard system including a standard on which the pneumatic tire1is based, the “standardized load” is a load defined for each tire by the manufacturer or the like as a maximum load that can be applied during use of the pneumatic tire1.", "", "Each of the outer ends7eof the belt layer7in the present embodiment is located on the outer side in the tire axial direction relative to a corresponding one of the tread ends Te. Such a belt layer7can improve the rigidity of the entirety of the ground-contact surface2sof the tread portion2and contributes to decrease of cavity resonance sound in the pneumatic tire1.", "", "As shown inFIG.1andFIG.2, the plurality of Helmholtz sound absorbers9are desirably arranged away from each other. The first sound absorber9A and the second sound absorber9B are arranged away from each other in the tire circumferential direction, for example. Among the plurality of Helmholtz sound absorbers9, sound absorbers of the same type, i.e., first sound absorbers9A or second sound absorbers9B, are desirably disposed at positions opposed to each other in the tire axial direction. Such Helmholtz sound absorbers9of the pneumatic tire1in the present embodiment can decrease cavity resonance sound over the entire region of the pneumatic tire1.", "", "The plurality of Helmholtz sound absorbers9in the present embodiment include a plurality of the first sound absorbers9A and a plurality of the second sound absorbers9B. The number of the first sound absorbers9A provided in each of rows arranged in the tire circumferential direction is desirably an even number, and the number of the second sound absorbers9B provided in each of the rows is desirably an even number. Such Helmholtz sound absorbers9facilitate adjustment of balance at the time of rotation of the tire. Although Helmholtz sound absorbers arranged in two rows are presented as an example of the plurality of Helmholtz sound absorbers9in the present embodiment, the plurality of Helmholtz sound absorbers9may be arranged in one row alone on one side in the tire axial direction or may be arranged in a plurality of rows in the tire radial direction.", "", "A pair of the first sound absorbers9A provided in each of the rows are disposed at, for example, positions opposed to each other with a tire rotation axis therebetween. A pair of the second sound absorbers9B provided in each of the rows are disposed at, for example, positions opposed to each other with the tire rotation axis therebetween. Such Helmholtz sound absorbers9are excellent in balance at the time of rotation of the tire and can suppress generation of vibrations and noise during running with the pneumatic tire1.", "", "FIG.3is a perspective view of any of the Helmholtz sound absorbers9in the present embodiment. As shown inFIG.3, the Helmholtz sound absorber9includes: a sound absorption chamber9ahaving a space therein; and a tube portion9bconnecting the sound absorption chamber9aand the tire inner cavity to each other. Such a Helmholtz sound absorber9can have a different resonance frequency f by adjusting the volume of the sound absorption chamber9aand the length of the tube portion9b.", "", "Each of the first sound absorbers9A in the present embodiment includes a first sound absorption chamber9ahaving the first resonance frequency f1. Although not shown, each of the second sound absorbers9B includes, for example, a second sound absorption chamber9chaving the second resonance frequency f2.", "", "Each of the first sound absorber9A and the second sound absorber9B is desirably formed of a resin having a shape that does not change at 120° C. or lower. Such a Helmholtz sound absorber9can maintain the sound absorption performance thereof without any change in the shape even when the temperature of the pneumatic tire1becomes high during running at a high speed.", "", "Examples of the material of the Helmholtz sound absorber9include polypropylene (PP), polystyrene (PS), polyethylene terephthalate (PET), polyvinylidene chloride (PVDC), polyvinylidene fluoride (PVDF), polyamides (PA), polycarbonates (PC), polyphenylene sulfide (PPS), polyimides (PI), polyetherimide (PEI), polysulfone (PSF), polysulfone (PSU), polytetrafluoroethylene (PTFE), polychlorotrifluoroethylene (PCTFE), polyamide-imides (PAI), phenol resins (PF), melamine resins (MF), unsaturated polyesters (UP), polyurethane (PU), polydiallyl phthalate (PDAP), silicon resins (SI), epoxy resins (EP), furan-formaldehyde resins (FF), cellulose acetate (CA), cellulose nitrate (CN), cellulose propionate (CP), ethylcellulose (EC), and the like.", "", "FIG.4is a perspective view of a Helmholtz sound absorber10in a second embodiment. As shown inFIG.4, each of a plurality of the Helmholtz sound absorbers10may include, for example, a sound absorption chamber10ahaving a hemispherical shape and a tube portion10bextending along the sound absorption chamber10a. Such a Helmholtz sound absorber10can absorb cavity resonance sound in the tire inner cavity in a balanced manner by adjusting the orientation of the tube portion10b.", "", "FIG.5is a perspective view of a Helmholtz sound absorber11in a third embodiment. As shown inFIG.5, each of a plurality of the Helmholtz sound absorbers11may include, for example, at least one first sound absorption chamber11ahaving the first resonance frequency f1and at least one second sound absorption chamber11chaving the second resonance frequency f2. Such Helmholtz sound absorbers11enable one of the Helmholtz sound absorbers11to have the plurality of resonance frequencies f. Consequently, the Helmholtz sound absorbers11in the third embodiment can decrease cavity resonance sound with a simple configuration.", "", "A first sound absorber11A having the first sound absorption chamber11aand a second sound absorber11B having the second sound absorption chamber11care desirably formed to be integrated with each other. Such Helmholtz sound absorbers11enables decrease in the number of parts, and furthermore, can decrease cavity resonance sound over a wide frequency band.", "", "Although the particularly preferred embodiments of the present invention have been described in detail above, the present invention is not limited to the above-described embodiments, and various modifications can be made to implement the present invention."], "claims": ["a tread portion; a pair of sidewall portions, each of the sidewall portions extending to an inner side in a tire radial direction from a corresponding one of both ends in a tire axial direction of the tread portion; a pair of bead portions, each of the bead portions being located on the inner side in the tire radial direction relative to a corresponding one of the pair of sidewall portions; and a plurality of Helmholtz sound absorbers disposed on a tire inner cavity surface, wherein the plurality of Helmholtz sound absorbers include a first sound absorber having a first resonance frequency and a second sound absorber having a second resonance frequency different from the first resonance frequency, and each of the first sound absorber and the second sound absorber is disposed on an inner side in the tire axial direction relative to at least one of either of the pair of sidewall portions.", "2 . The pneumatic tire according to claim 1 , wherein each of the first sound absorber and the second sound absorber is disposed on the inner side in the tire axial direction relative to either of the pair of bead portions.", "each of the pair of bead portions has an annular bead core extending in a tire circumferential direction and a bead apex extending to an outer side in the tire radial direction from the bead core, and each of the first sound absorber and the second sound absorber is disposed on the inner side in the tire axial direction within a range extending from an inner end in the tire radial direction of either of the bead cores to an outer end in the tire radial direction of a corresponding one of the bead apexes.", "4 . The pneumatic tire according to claim 1 , wherein each of the first sound absorber and the second sound absorber is formed of a resin having a shape that does not change at 120° C. or lower.", "the first resonance frequency is a maximum resonance frequency in a frequency band, and the second resonance frequency is a minimum resonance frequency in the frequency band.", "the first resonance frequency is 130 to 350 Hz, and the second resonance frequency is 120 to 340 Hz.", "7 . The pneumatic tire according to claim 1 , wherein the plurality of Helmholtz sound absorbers further have at least one resonance frequency different from the first resonance frequency and the second resonance frequency.", "8 . The pneumatic tire according to claim 7 , wherein the plurality of Helmholtz sound absorbers are such that unit widths, which are differences between a set of the resonance frequencies adjacent to each other in a frequency band, are substantially equal.", "9 . The pneumatic tire according to claim 8 , wherein each of the unit widths is 3 to 10 Hz.", "the second sound absorber has a resonance frequency between 195 Hz and 201 Hz.", "the third sound absorber has a resonance frequency of 220 Hz, and the fourth sound absorber has a resonance frequency of 215 Hz.", "the fifth sound absorber has a resonance frequency of 210 Hz, the sixth sound absorber has a resonance frequency of 205 Hz, and the seventh sound absorber has a resonance frequency of 200 Hz.", "a tread portion; a pair of sidewall portions, each of the sidewall portions extending to an inner side in a tire radial direction from a corresponding one of both ends in a tire axial direction of the tread portion; a pair of bead portions, each of the bead portions located on the inner side in the tire radial direction relative to a corresponding one of the pair of sidewall portions; and a plurality of Helmholtz sound absorbers disposed on a tire inner cavity surface, the plurality of Helmholtz sound absorbers having different resonance frequencies, wherein each of the plurality of Helmholtz sound absorbers includes at least one sound absorption chamber having a space therein and a tube portion connecting the at least one sound absorption chamber to the tire inner cavity.", "each tube portion extends along the sound absorption chamber.", "15 . The pneumatic tire according to claim 13 , wherein the at least one sound absorption chamber of each of the plurality of Helmholtz sound absorbers includes a first sound absorption chamber having a first resonance frequency and at least one second sound absorption chamber having a second resonance frequency.", "16 . The pneumatic tire according to claim 15 , wherein for each of the plurality of Helmholtz sound absorbers, the first sound absorption chamber is integrated with the at least one second sound absorption chamber.", "the plurality of Helmholtz sound absorbers are disposed at positions opposite to each other in the tire axial direction.", "each of the unit widths is 3 to 10 Hz.", "the first sound absorber has a resonance frequency between 210 Hz and 225 Hz, and the second sound absorber has a resonance frequency between 195 Hz and 201 Hz.", "the third sound absorber has a resonance frequency of 220 Hz, and the fourth sound absorber has a resonance frequency of 215 Hz."], "bibtex": "@patent{20250121635,\n    title = {PNEUMATIC TIRE},\n    number = {20250121635},\n    year = {2025},\n    note = {File: US20250121635A1-20250417.XML}\n    }", "classification": "B60C1900FI"}, {"title": "TIRE PRESSURE ALARM METHOD AND APPARATUS, COMPUTER DEVICE, AND STORAGE MEDIUM", "doc_number": "20250121636", "filename": "US20250121636A1-20250417.XML", "abstract": "A tire pressure alarm method includes: obtaining a static load parameter and an actual tire pressure value of a tire; determining a safe tire pressure value based on the static load parameter, the actual tire pressure value, and a preset mapping relationship between the static load parameter, the actual tire pressure value, and the safe tire pressure value; and comparing the actual tire pressure value with the safe tire pressure value, and emitting an alarm signal if the actual tire pressure value is less than the safe tire pressure value.", "detailed_description": [""], "claims": ["obtaining a static load parameter and an actual tire pressure value of a tire; determining a safe tire pressure value based on the static load parameter, the actual tire pressure value, and a preset mapping relationship between the static load parameter, the actual tire pressure value, and the safe tire pressure value; and comparing the actual tire pressure value with the safe tire pressure value, and emitting an alarm signal if the actual tire pressure value is less than the safe tire pressure value.", "2 . The tire pressure alarm method according to claim 1 , wherein obtaining the static load parameter comprises: scanning an inner cavity contour of the tire, wherein the static load parameter is determined based on a minimum size of the inner cavity contour in a radial direction of the tire.", "3 . The tire pressure alarm method according to claim 1 , wherein obtaining the static load parameter comprises: measuring a distance between a tire axis and a ground, wherein the static load parameter is determined based on the distance between the tire axis and the ground.", "determining a static load based on the actual tire pressure value, the static load parameter, and a preset mapping relationship between the static load parameter, the actual tire pressure value, and the static load; and determining the safe tire pressure value based on the static load, the actual tire pressure value, and a preset mapping relationship between the static load, the actual tire pressure value, and the safe tire pressure value.", "a radius detection module, configured to obtain a static load parameter of a tire; a tire pressure sensor, configured to obtain an actual tire pressure value of the tire; a calculation and comparison module, connected to the radius detection module and the tire pressure sensor through a signal, wherein the calculation and comparison module is configured to: determine a safe tire pressure value based on the static load parameter, the actual tire pressure value, and a preset mapping relationship between the static load parameter, the actual tire pressure value, and the safe tire pressure value, and compare the actual tire pressure value with the safe tire pressure value; and an alarm module, connected to the calculation and comparison module through a signal, wherein the alarm module is configured to emit an alarm signal if the actual tire pressure value is less than the safe tire pressure value.", "6 . The tire pressure alarm apparatus according to claim 5 , wherein the radius detection module is a laser scanner or an ultrasonic detector, and the radius detection module is configured to detect an inner cavity of the tire to obtain an inner cavity contour of the tire, wherein the static load parameter is determined based on a minimum size of the inner cavity contour in a radial direction of the tire.", "7 . The tire pressure alarm apparatus according to claim 5 , wherein the radius detection module is a rangefinder disposed on a wheel shaft, and the rangefinder is configured to measure a distance between a tire axis and a ground, wherein the static load parameter is determined based on the distance between the tire axis and the ground.", "8 . The tire pressure alarm apparatus according to claim 5 , wherein the calculation and comparison module comprises a first calculation unit and a second calculation unit, the first calculation unit is configured to obtain a static load of the tire through calculation based on the actual tire pressure value, the static load parameter, and a preset mapping relationship between the static load parameter, the actual tire pressure value, and the static load, and the second calculation unit is configured to obtain the safe tire pressure value of the tire through calculation based on the static load, the actual tire pressure value, and a preset mapping relationship between the static load, the actual tire pressure value, and the safe tire pressure value.", "9 . A computer device, comprising a memory, a processor, and a computer program that is stored in the memory and that is capable of running on the processor, wherein the processor executes the computer program to implement the tire pressure alarm method according to claim 1 .", "10 . A non-transitory computer-readable storage medium, wherein the computer-readable storage medium stores a computer program, and the computer program is executed by a processor to implement the tire pressure alarm method according to claim 1 ."], "bibtex": "@patent{20250121636,\n    title = {TIRE PRESSURE ALARM METHOD AND APPARATUS, COMPUTER DEVICE, AND STORAGE MEDIUM},\n    number = {20250121636},\n    year = {2025},\n    note = {File: US20250121636A1-20250417.XML}\n    }", "classification": "B60C2306FI"}, {"title": "VEHICLE TOW HOOKS AND SYSTEMS", "doc_number": "20250121637", "filename": "US20250121637A1-20250417.XML", "abstract": "A tow hook system is provided. The tow hook system may comprise a bumper beam, a crush box, and a tow hook. The tow hook may comprise a front tow hook end and a rear tow hook end. The front tow hook end may be secured to the bumper beam. The rear tow hook end may be secured to the crush box.", "detailed_description": ["The following Detailed Description is merely provided by way of example and not of limitation. Furthermore, there is no intention to be bound by any expressed or implied theory presented in the preceding background or in the following Detailed Description.", "", "Reference will now be made in detail to various exemplary embodiments of the subject matter, examples of which are illustrated in the accompanying drawings. While various embodiments are discussed herein, it will be understood that they are not intended to limit to these embodiments. On the contrary, the presented embodiments are intended to cover alternatives, modifications, and equivalents, which may be included within the spirit and scope of the various embodiments as defined by the appended claims. Furthermore, in this Detailed Description, numerous specific details are set forth in order to provide a thorough understanding of embodiments of the present subject matter. However, embodiments may be practiced without these specific details. In other instances, well known methods, procedures, components, and circuits have not been described in detail as not to unnecessarily obscure aspects of the described embodiments.", "", "Some portions of the detailed descriptions which follow are presented in terms of procedures, logic blocks, processing, and other symbolic representations of operations on data within an electrical device. These descriptions and representations are the means used by those skilled in the data processing arts to most effectively convey the substance of their work to others skilled in the art. In the present application, a procedure, logic block, process, or the like, is conceived to be one or more self-consistent procedures or instructions leading to a desired result. The procedures are those requiring physical manipulations of physical quantities. Usually, although not necessarily, these quantities may take the form of electrical or magnetic signals capable of being stored, transferred, combined, compared, and otherwise manipulated in an electronic system, device, and/or component.", "", "It should be borne in mind, however, that these and similar terms are to be associated with the appropriate physical quantities and are merely convenient labels applied to these quantities. Unless specifically stated otherwise as apparent from the following discussions, it is appreciated that throughout the description of embodiments, discussions utilizing terms such as “determining,” “communicating,” “taking,” “comparing,” “monitoring,” “calibrating,” “estimating,” “initiating,” “providing,” “receiving,” “controlling.” “transmitting,” “isolating,” “generating,” “aligning,” “synchronizing,” “identifying,” “maintaining,” “displaying,” “switching,” or the like, refer to the actions and processes of an electronic item such as: a processor, a sensor processing unit (SPU), a processor of a sensor processing unit, an application processor of an electronic device/system, or the like, or a combination thereof. The item manipulates and transforms data represented as physical (electronic and/or magnetic) quantities within the registers and memories into other data similarly represented as physical quantities within memories or registers or other such information storage, transmission, processing, or display components.", "", "It is understood that the term “vehicle” or “vehicular” or other similar term as used herein is inclusive of motor vehicles in general such as passenger automobiles including sports utility vehicles (SUV), buses, trucks, various commercial vehicles, watercraft including a variety of boats and ships, aircraft, and the like, and includes hybrid vehicles, electric vehicles, plug-in hybrid electric vehicles, hydrogen-powered vehicles and other alternative fuel vehicles (e.g. fuels derived from resources other than petroleum). As referred to herein, a hybrid vehicle is a vehicle that has two or more sources of power, for example both gasoline-powered and electric-powered vehicles. In aspects, a vehicle may comprise an internal combustion engine system as disclosed herein.", "", "The terminology used herein is for the purpose of describing particular embodiments only and is not intended to be limiting of the disclosure. As used herein, the singular forms “a,” “an” and “the” are intended to include the plural forms as well, unless the context clearly indicates otherwise. These terms are merely intended to distinguish one component from another component, and the terms do not limit the nature, sequence or order of the constituent components. It will be further understood that the terms “comprises” and/or “comprising,” when used in this specification, specify the presence of stated features, integers, steps, operations, elements, and/or components, but do not preclude the presence or addition of one or more other features, integers, steps, operations, elements, components, and/or groups thereof. As used herein, the term “and/or” includes any and all combinations of one or more of the associated listed items. Throughout the specification, unless explicitly described to the contrary, the word “comprise” and variations such as “comprises” or “comprising” will be understood to imply the inclusion of stated elements but not the exclusion of any other elements. In addition, the terms “unit”, “-er”, “-or”, and “module” described in the specification mean units for processing at least one function and operation, and can be implemented by hardware components or software components and combinations thereof.", "", "Although exemplary embodiment is described as using a plurality of units to perform the exemplary process, it is understood that the exemplary processes may also be performed by one or plurality of modules. Additionally, it is understood that the term controller/control unit refers to a hardware device that includes a memory and a processor and is specifically programmed to execute the processes described herein. The memory is configured to store the modules and the processor is specifically configured to execute said modules to perform one or more processes which are described further below.", "", "Further, the control logic of the present disclosure may be embodied as non-transitory computer readable media on a computer readable medium containing executable program instructions executed by a processor, controller or the like. Examples of computer readable media include, but are not limited to, ROM, RAM, compact disc (CD)-ROMs, magnetic tapes, floppy disks, flash drives, smart cards and optical data storage devices. The computer readable medium can also be distributed in network coupled computer systems so that the computer readable media is stored and executed in a distributed fashion, e.g., by a telematics server or a Controller Area Network (CAN).", "", "Unless specifically stated or obvious from context, as used herein, the term “about” is understood as within a range of normal tolerance in the art, for example within 2 standard deviations of the mean. “About” can be understood as within 10%, 9%, 8%, 7%, 6%, 5%, 4%, 3%, 2%, 1%, 0.5%, 0.1%, 0.05%, or 0.01% of the stated value. Unless otherwise clear from the context, all numerical values provided herein are modified by the term “about”.", "", "Embodiments described herein may be discussed in the general context of processor-executable instructions residing on some form of non-transitory processor-readable medium, such as program modules, executed by one or more computers or other devices. Generally, program modules include routines, programs, objects, components, data structures, etc., that perform particular tasks or implement particular abstract data types. The functionality of the program modules may be combined or distributed as desired in various embodiments.", "", "In the figures, a single block may be described as performing a function or functions; however, in actual practice, the function or functions performed by that block may be performed in a single component or across multiple components, and/or may be performed using hardware, using software, or using a combination of hardware and software. To clearly illustrate this interchangeability of hardware and software, various illustrative components, blocks, modules, logic, circuits, and steps have been described generally in terms of their functionality. Whether such functionality is implemented as hardware or software depends upon the particular application and design constraints imposed on the overall system. Skilled artisans may implement the described functionality in varying ways for each particular application, but such implementation decisions should not be interpreted as causing a departure from the scope of the present disclosure. Also, the example device vibration sensing system and/or electronic device described herein may include components other than those shown, including well-known components.", "", "Various techniques described herein may be implemented in hardware, software, firmware, or any combination thereof, unless specifically described as being implemented in a specific manner. Any features described as modules or components may also be implemented together in an integrated logic device or separately as discrete but interoperable logic devices. If implemented in software, the techniques may be realized at least in part by a non-transitory processor-readable storage medium comprising instructions that, when executed, perform one or more of the methods described herein. The non-transitory processor-readable data storage medium may form part of a computer program product, which may include packaging materials.", "", "The non-transitory processor-readable storage medium may comprise random access memory (RAM) such as synchronous dynamic random access memory (SDRAM), read only memory (ROM), non-volatile random access memory (NVRAM), electrically erasable programmable read-only memory (EEPROM), FLASH memory, other known storage media, and the like. The techniques additionally, or alternatively, may be realized at least in part by a processor-readable communication medium that carries or communicates code in the form of instructions or data structures and that can be accessed, read, and/or executed by a computer or other processor.", "", "Various embodiments described herein may be executed by one or more processors, such as one or more motion processing units (MPUs), sensor processing units (SPUs), host processor(s) or core(s) thereof, digital signal processors (DSPs), general purpose microprocessors, application specific integrated circuits (ASICs), application specific instruction set processors (ASIPs), field programmable gate arrays (FPGAs), a programmable logic controller (PLC), a complex programmable logic device (CPLD), a discrete gate or transistor logic, discrete hardware components, or any combination thereof designed to perform the functions described herein, or other equivalent integrated or discrete logic circuitry. The term “processor,” as used herein may refer to any of the foregoing structures or any other structure suitable for implementation of the techniques described herein. As employed in the subject specification, the term “processor” can refer to substantially any computing processing unit or device comprising, but not limited to comprising, single-core processors; single-processors with software multithread execution capability; multi-core processors; multi-core processors with software multithread execution capability; multi-core processors with hardware multithread technology; parallel platforms; and parallel platforms with distributed shared memory. Moreover, processors can exploit nano-scale architectures such as, but not limited to, molecular and quantum-dot based transistors, switches and gates, in order to optimize space usage or enhance performance of user equipment. A processor may also be implemented as a combination of computing processing units.", "", "In addition, in some aspects, the functionality described herein may be provided within dedicated software modules or hardware modules configured as described herein. Also, the techniques could be fully implemented in one or more circuits or logic elements. A general purpose processor may be a microprocessor, but in the alternative, the processor may be any processor, controller, microcontroller, or state machine. A processor may also be implemented as a combination of computing devices, e.g., a combination of an SPU/MPU and a microprocessor, a plurality of microprocessors, one or more microprocessors in conjunction with an SPU core, MPU core, or any other such configuration. One or more components of an SPU or electronic device described herein may be embodied in the form of one or more of a “chip,” a “package,” an Integrated Circuit (IC).", "", "Generally, rugged vehicles are configured to withstand harsh elements and enable drivers to maneuver through various weather conditions (e.g., snow, deep water, streams, etc.), terrains (e.g., desert, mud, sand, etc.), and activities (e.g., rock climbing, camping, etc.). Front tow hooks are essential equipment to assist rugged vehicles to maneuver through these weather conditions, terrains, and activities and contribute to the ruggedness of vehicle appearance.", "", "Referring now toFIGS.1A-1C, a perspective view of a tow hook assembly100mounted to a bumper beam102and a crush box104of a vehicle (FIG.1A), a perspective view of a plurality of tow hook assemblies100mounted to a bumper beam102and each tow hook assembly100mounted to a respective crush box104(FIG.1B), and an exploded view of a tow hook assembly100(FIG.1C) are illustratively depicted, in accordance with exemplary embodiments of the present disclosure.", "", "According to an exemplary embodiment, the tow hook assembly100is a front tow hook assembly. It is noted, however, that the tow hook assembly100may be positioned at one or more other positions along a vehicle, while maintaining the spirit and functionality of the of the present disclosure.", "", "According to an exemplary embodiment, the tow hook assembly100may be configured to be mounted to a bumper beam102and/or a crush box104of a vehicle.", "", "According to an exemplary embodiment, the crush box104may comprise a welded bracket positioned along and/or coupled to the bumper beam102. According to an exemplary embodiment, the crush box102may be configured to accommodate the mounting of the tow hook assembly100.", "", "According to an exemplary embodiment, one or more of the tow hook assemblies100may comprise a tow hook106. The tow book106may comprise a rear protrusion108. The rear protrusion108may be configured to enable connection of the tow hook assembly100to the crush box104. The tow hook assembly100may comprise a bracket member110(e.g., a welded mounting bracket reinforcement and/or other suitable component) configured to secure the tow hook assembly100to the crush box104.", "", "The tow hook106may comprise a front tow hook end114. The front tow hook end114may be configured to enable connection of the tow hook assembly100to the bumper beam102. According to an exemplary embodiment, the tow hook assembly100may comprise a bracket member112(e.g., a welded bracket and/or other suitable component) configured to secure the tow hook assembly100to the bumper beam102. According to an exemplary embodiment, the bracket member112may be configured to be bolted to the front tow hook106and mounted to the bumper beam102(via, e.g., welding, bolts, and/or other suitable securing means).", "", "According to an exemplary embodiment, the tow book106comprises a rear protruded shape with the front tow hook end114and a rear tow hook end116.", "", "The front tow book end114may be configured to mount to the bumper beam102via bracket member112. For example, the front tow hook end114and bracket member112may be mounted in the front of the bumper beam102, in a T-direction, via suitable securing means (e.g., bolts118, welding, etc.). According to an exemplary embodiment, the bracket member112may be welded to the bumper beam102and the front tow hook end114may be bolted to the bracket member112.", "", "The rear tow hook end116may be configured to mount to the crush box104in, e.g., an L-direction, in front of the crush box104. According to an exemplary embodiment, the rear tow hook end116and bracket member100may be mounted to the front of the crush box via suitable securing means (e.g., bolts118, welding, etc.). According to an exemplary embodiment, the bracket member110may be welded to the front of the crush box104and the rear tow hook end116may be bolted to the bracket member110.", "", "The present tow hook assembly100improves upon existing designs. For example, the tow hook assembly100is configured to enable both a highly desirable and rugged appearance of a permanently mounted front tow hook and reduce an offset load only to the bumper beam102, as the load is shared with the crush box104.", "", "Referring now toFIGS.2A-2B, a strength and stiffness load transfer path of a front perspective view (FIG.2A) and a side rear perspective view (FIG.2B) of a tow hook assembly100mounted to a bumper beam102and crush box104of a vehicle120are illustratively depicted, in accordance with an exemplary embodiment of the present disclosure.", "", "The arrangement of the tow hook assembly100has at least two primary functions: (1) a towing function; and (2) a front crash mode function.", "", "According to an exemplary embodiment, during loading of the tow hook assembly100in a case of recovery and towing (e.g., the towing function), a load, due to tension, compression, and/or slope loading, may get transferred to the bumper beam102in an L-direction (as shown, e.g., in arrow (a)—Load Transfer→Bumper Beam). According to an exemplary embodiment, the load path may, at the same time, be transferred to the crush box104and a front side member122of the vehicle120in a T-direction (as shown, e.g., in arrow (b)—Load Transfer→Crush Box & Front Side Mbr), causing the input load to displace the vehicle120rearwardly, and/or, at the same time, move angularly upward by a fender apron124(as shown, e.g., in arrow (c)—Load Transfer→Apron Upr Mbr), causing relatively no deformation of the tow hook assembly100from the input load.", "", "Referring now toFIG.3, an energy absorption load transfer path of a side rear perspective view of a tow hook assembly100mounted to a bumper beam102and a crush box104of a vehicle120is illustratively depicted, in accordance with an exemplary embodiment of the present disclosure.", "", "There are many frontal crash modes requirements for a vehicle120body structure during both low speed and high speed crashes in order to help vehicles mitigate damage that may be caused in crashes. Without a tow hook assembly100, a bumper beam102, crush box104, front side member122, and fender apron124are designed to bend and/or deform in a certain way in order to absorb the energy from the crash in the best possible way. These elements work together to achieve optimum results.", "", "According to an exemplary embodiment, during a front crash mode function, a load, due to tension, compression, and/or slope loading, may get transferred to the bumper beam102(as shown, e.g., in arrow (a)—Load Transfer→Bumper Beam). According to an exemplary embodiment, the load path may, at the same time, be transferred to the crush box104and a front side member122of the vehicle120(as shown, e.g., in arrow (b)—Load Transfer→Crush Box & Front Side Mbr), causing the input load to displace the vehicle120rearwardly, and/or, at the same time, move angularly upward by a fender apron124(as shown, e.g., in arrow (c)—Load Transfer→Apron Upr Mbr).", "", "According to an exemplary embodiment, the tow hook assembly100may be configured and positioned to not change a current front end member deformation load during a front crash mode function. For example, since a rear mounting assembly126of the tow hook assembly in in front of a crush initiation form128of the crush box104, the tow hook assembly100does not have an effect on the crash deformation of the vehicle120.", "", "What has been described above includes examples of the subject disclosure. It is, of course, not possible to describe every conceivable combination of components or methodologies for purposes of describing the subject matter, but it is to be appreciated that many further combinations and permutations of the subject disclosure are possible. Accordingly, the claimed subject matter is intended to embrace all such alterations, modifications, and variations that fall within the spirit and scope of the appended claims.", "", "In particular and in regard to the various functions performed by the above described components, devices, systems and the like, the terms (including a reference to a “means”) used to describe such components are intended to correspond, unless otherwise indicated, to any component which performs the specified function of the described component (e.g., a functional equivalent), even though not structurally equivalent to the disclosed structure, which performs the function in the herein illustrated exemplary aspects of the claimed subject matter.", "", "The aforementioned systems and components have been described with respect to interaction between several components. It can be appreciated that such systems and components can include those components or specified sub-components, some of the specified components or sub-components, and/or additional components, and according to various permutations and combinations of the foregoing. Sub-components can also be implemented as components communicatively coupled to other components rather than included within parent components (hierarchical). Additionally, it should be noted that one or more components may be combined into a single component providing aggregate functionality or divided into several separate sub-components. Any components described herein may also interact with one or more other components not specifically described herein.", "", "In addition, while a particular feature of the subject innovation may have been disclosed with respect to only one of several implementations, such feature may be combined with one or more other features of the other implementations as may be desired and advantageous for any given or particular application. Furthermore, to the extent that the terms “includes,” “including,” “has,” “contains,” variants thereof, and other similar words are used in either the detailed description or the claims, these terms are intended to be inclusive in a manner similar to the term “comprising” as an open transition word without precluding any additional or other elements.", "", "Thus, the embodiments and examples set forth herein were presented in order to best explain various selected embodiments of the present invention and its particular application and to thereby enable those skilled in the art to make and use embodiments of the invention. However, those skilled in the art will recognize that the foregoing description and examples have been presented for the purposes of illustration and example only. The description as set forth is not intended to be exhaustive or to limit the embodiments of the invention to the precise form disclosed."], "claims": ["a bumper beam; a crush box; and a tow hook, comprising: a front tow hook end; and a rear tow hook end, wherein: the front tow hook end is secured to the bumper beam, and the rear tow hook end is secured to the crush box.", "2 . The tow hook system of claim 1 , wherein the front tow hook end is secured to the bumper beam in a T-direction.", "3 . The tow hook system of claim 1 , wherein the rear tow hook end is secured to the crush box in an L-direction.", "4 . The tow hook system of claim 3 , wherein the rear tow hook end is secured to the crush box in front of a crush initiation form of the crush box.", "5 . The tow hook system of claim 1 , further comprising a bracket member configured to secure the front tow hook end to the bumper beam.", "6 . The tow hook system of claim 5 , further comprising one or more bolts configured to secure the front tow hook end to the bracket member.", "7 . The tow hook system of claim 5 , wherein the bracket member is welded to the bumper beam.", "8 . The tow hook system of claim 1 , further comprising a bracket member configured to secure the rear tow hook end to the crush box.", "9 . The tow hook system of claim 8 , further comprising one or more bolts configured to secure the rear tow hook end to the bracket member.", "10 . The tow hook system of claim 1 , wherein the tow hook comprises a rear protrusion.", "a vehicle, comprising: a bumper beam; and a crush box; and a tow hook, comprising: a front tow hook end; and a rear tow hook end, wherein: the front tow hook end is secured to the bumper beam, and the rear tow hook end is secured to the crush box.", "12 . The tow hook system of claim 11 , wherein the front tow hook end is secured to the bumper beam in a T-direction.", "13 . The tow hook system of claim 11 , wherein the rear tow hook end is secured to the crush box in an L-direction.", "14 . The tow hook system of claim 13 , wherein the rear tow hook end is secured to the crush box in front of a crush initiation form of the crush box.", "15 . The tow hook system of claim 11 , further comprising a bracket member configured to secure the front tow hook end to the bumper beam.", "16 . The tow hook system of claim 15 , further comprising one or more bolts configured to secure the front tow hook end to the bracket member.", "17 . The tow hook system of claim 15 , wherein the bracket member is welded to the bumper beam.", "18 . The tow hook system of claim 11 , further comprising a bracket member configured to secure the rear tow hook end to the crush box.", "19 . The tow hook system of claim 18 , further comprising one or more bolts configured to secure the rear tow hook end to the bracket member.", "20 . The tow hook system of claim 1 , wherein the tow hook comprises a rear protrusion."], "bibtex": "@patent{20250121637,\n    title = {VEHICLE TOW HOOKS AND SYSTEMS},\n    number = {20250121637},\n    year = {2025},\n    note = {File: US20250121637A1-20250417.XML}\n    }", "classification": "B60D104FI"}]