[{"title": "SEALING RING, HUB CAP SYSTEM AND VEHICLE", "doc_number": "20240157723", "filename": "US20240157723A1-20240516.XML", "abstract": "A sealing ring includes a retaining portion and a primary sealing lip, the retaining portion extending circumferentially around an axial direction, a radial direction extending radially and perpendicularly away from the axial direction, the primary sealing lip having an extension in the positive radial direction, the primary sealing lip having a pressure side in the direction of the axial direction.", "detailed_description": ["FIG.1shows a sectional view of a wheel hub system. The wheel hub system has a hub cap2and a sealing ring101and a wheel hub200. The sealing ring101is arranged in the space between the hub cap2and the wheel hub200. The detail area shown with dashed circle inFIG.1, which is also marked with Z, is shown inFIG.2for further explanation. The hub cap2has a compressed air passage arrangement25in a central aperture, which has a flow channel extending along the axial direction A. The air passage arrangement25is arranged in the center of the hub cap2. Radially pointing away from the axial direction A is the radial direction R. The connection28of the compressed air feed-through arrangement25extends in the radial direction R. In terms of flow, the compressed air feed-through arrangement25connects the connection28or its connection28to the interior of the axle and/or of an axle stub, which can also be part of the wheel hub system.", "", "FIG.2shows a detailed view of a section through a sealing ring101, where a hub cap2and a wheel hub200are also cut at the same time. The sectional plane is spanned by the radial direction R and the axial direction A. The sealing ring101is formed in an annular shape around the axial direction A. The sealing ring101has a primary sealing lip102that abuts and/or can abut against the wheel hub200. In addition, the sealing ring101also has a retaining portion105which serves to retain the sealing ring101against the hub cap200. In order to be able to form a pressure on the primary seal102and, at the same time, also to be able to realize a high sealing effect by means of a large contact surface between the primary seal102and the wheel hub200, the sealing ring102has grooves150which can extend in the radial direction R. The grooves150have a tapered shape. The grooves150have a rounded groove base152.", "", "FIG.3shows an isometric view of a sealing ring101. The sealing ring101in turn has a retaining region105, which is joined to the primary sealing lip102by a material bond, this material bond having been achieved in the example shown by forming the primary sealing lip102in one piece with the retaining region105. Both the primary sealing lip102and the retaining region105annularly surround the axial direction A. The sealing ring101shown inFIG.3has a plurality of grooves150which are arranged equidistantly from each other in a circumferential direction."], "claims": ["a retaining region extending circumferentially about an axial direction (A); and a primary sealing lip having an extension in a positive radial direction, wherein the radial direction extends radially and perpendicularly away from the axial direction, and wherein the primary sealing lip has a pressure side in the direction of the axial direction.", "2 . The sealing ring according to claim 1 , wherein a deformation space is located between the primary sealing lip and the retaining region, and wherein the deformation space extends rotationally symmetrically, circumferentially about the axial direction.", "3 . The sealing ring according to claim 2 , wherein the primary sealing lip extends in the axial direction and in the radial direction.", "4 . The sealing ring according to claim 3 , wherein the sealing ring has grooves extending in the radial direction.", "5 . The sealing ring according to claim 4 , wherein the grooves extend from the retaining region into the primary sealing lip and/or wherein the grooves have a rounded groove base in a radial plane.", "6 . The sealing ring according to claim 4 , wherein the grooves are arranged on the pressure side of the primary sealing lip.", "7 . The sealing ring according to claim 6 , wherein the primary sealing lip is configured such that when pressure is applied to the pressure side the primary sealing lip is deformed toward the retaining region.", "8 . The sealing ring according to claim 1 , wherein the primary sealing lip extends in the axial direction and in the radial direction.", "9 . The sealing ring according to claim 1 , wherein the sealing ring has grooves extending in the radial direction.", "10 . The sealing ring according to claim 9 , wherein the grooves extend from the retaining region into the primary sealing lip and/or wherein the grooves have a rounded groove base in a radial plane.", "11 . The sealing ring according to claim 9 , wherein the grooves are arranged on the pressure side of the primary sealing lip.", "12 . The sealing ring according to claim 1 , wherein the primary sealing lip is configured such that when pressure is applied to the pressure side, the primary sealing lip is deformed toward the retaining region.", "the sealing ring according to a hub cap having a compressed air feed-through arrangement, that extends in the axial direction.", "14 . The wheel hub system comprising the hub cap system according to claim 13 and a wheel hub, wherein the primary sealing lip abuts or is configured to abut the wheel hub and/or wherein the hub cap is reversibly fixed to the wheel hub via a click lock.", "15 . A commercial vehicle, comprising the sealing ring according to claim 1 .", "a sealing ring, comprising: a retaining region extending circumferentially about an axial direction; and a primary sealing lip having an extension in a radial direction, wherein the radial direction extends radially and perpendicularly away from the axial direction, and wherein the primary sealing lip has a pressure side in the direction of the axial direction; and a hub cap having a compressed air feed-through arrangement that extends in the axial direction.", "17 . The commercial vehicle according to claim 16 , wherein a deformation space is located between the primary sealing lip and the retaining region, and wherein the deformation space extends rotationally symmetrically, circumferentially about the axial direction.", "18 . The commercial vehicle of claim 17 , wherein the primary sealing lip extends in the axial direction and in the radial direction.", "a sealing ring comprising: a retaining region extending circumferentially about an axial direction; and a primary sealing lip having an extension in a radial direction, wherein the radial direction extends radially and perpendicularly away from the axial direction, and wherein the primary sealing lip has a pressure side in the direction of the axial direction; and a hub cap system, comprising: a hub cap having a compressed air feed-through arrangement that extends in the axial direction; and a wheel hub, wherein the primary sealing lip abuts or is configured to abut the wheel hub and/or wherein the hub cap is reversibly fixed to the wheel hub via a click lock.", "20 . The commercial vehicle according to claim 16 , wherein a deformation space is located between the primary sealing lip and the retaining region, and wherein the deformation space extends rotationally symmetrically, circumferentially about the axial direction."], "bibtex": "@patent{20240157723,\n    title = {SEALING RING, HUB CAP SYSTEM AND VEHICLE},\n    number = {20240157723},\n    year = {2024},\n    note = {File: US20240157723A1-20240516.XML}\n    }", "classification": "B60B700FI"}, {"title": "HUB CAP SYSTEM, WHEEL HEAD AND USE OF A SEALING RING", "doc_number": "20240157724", "filename": "US20240157724A1-20240516.XML", "abstract": "A hub cap system includes a hub cap and a sealing ring, wherein the hub cap system is configured to rotate about an axial direction, wherein a radial direction is perpendicular to the axial direction, wherein the hub cap at least partially encloses an inner space, wherein the hub cap includes and/or forms a fluid channel which is in fluid communication with the inner space or opens into the inner space, the sealing ring being held in a circumferential groove of the hub cap system, the groove being in fluid connection with the fluid channel or being capable of being brought into fluid connection with the fluid channel via openings.", "detailed_description": ["FIG.1shows a hub cap system1that is part of a wheel head2. In addition to the hub cap system1, the wheel head2also has an axle element500, which extends in particular in the axial direction A. The axle element500has an inside hollow area510. The axle element500has an inside hollow area510. This inside hollow area510of the axle element500is in fluid communication with the compressed air duct320of the rotor unit300. The compressed air duct320also extends in axial direction A and is guided through a central opening12of the central element40. The central element40is formed by a red material so as to form a red circular element. The central element14is irreversibly connected to the main body60of the hub cap10. The hub cap10is reversibly attached to the wheel hub600via fasteners20. The wheel hub600is rotatably mounted relative to the axle element500about the axial direction A via sealed wheel bearings. However, in a preferred embodiment, the wheel hub600is configured such that relative movement between the wheel hub600and the axle element500is prevented by the bearing arrangement in the axial direction A. Perpendicularly pointing away from the axial direction A, the radial direction R is formed. In order to achieve venting of the interior or inner space I of the hub cap10or also of the cavity, inner space or interior of the wheel hub600, a sealing ring110is provided in the embodiments shown, the sealing lip of which rests against the wheel hub600and the mounting region of which is guided in a groove of the hub cap10. In the embodiments shown—not apparent due to the rotational position—a fluid channel60is also provided in the hub cap10, which is delimited from the surroundings by a sealing ring100. The fluid channel60can open directly into the inner space I of the hub cap10, as is also shown, for example, in the embodiment according toFIG.2. In particular, the embodiment shown inFIG.1can be combined with the specific examples ofFIGS.2,3,4,5,6,7and/or8, should this be necessary.", "", "InFIG.2, a hub cap system1is shown in detail in a sectional view, the sectional plane being spanned by the axial direction A and the radial direction R. The hub cap10again has a main body16and a central element14, whereby according to the invention the hub cap10can also be fundamentally, therefore embodiment independent, formed in one piece. In order to create a fluid connection to the environment, the hub cap10or the main body16has a fluid channel60which, in the embodiment shown, extends at least substantially parallel to the axial direction A. The fluid channel60is in fluid communication with the surroundings. This fluid channel60is in fluid communication with the circumferential groove42, wherein the sealing ring100is arranged in the groove42. Through this, it is possible to cause a movement of the sealing ring100, in particular in positive radial direction R, at a certain pressure within the fluid channel60, so that the environment is in fluid communication with the inner space I and thus a venting of the inner space I can take place. The central element14also forms a central opening12, which is formed rotationally symmetrically about the axial direction A. This central opening12serves in particular to accommodate a rotor unit300, although in the illustrated embodiment example the rotor unit300is not shown for reasons of clarity.", "", "InFIG.3, an embodiment similar toFIG.2is shown. However, the sealing element100is covered by the cover element200in axial direction A and radial direction R to effectively prevent mechanical damage to the sealing ring100. An annular flow exit channel220is formed between the cover element200and the hub cap10, through which a fluid can escape from the inner space to the surroundings during a venting operation.", "", "FIG.4shows an alternative embodiment of a hub cap system1, wherein the hub cap system1comprises a sealing ring100and a sealing ring110with a sealing lip pointing outward in radial direction R. The sealing lip is provided with a sealing ring110. In order to enable or establish a fluid connection between the groove42and the inner space I of the hub cap10, the hub cap10has a fluid channel60pointing in the radial direction R. As a result, a particularly effective and short venting possibility of the inner space I of the hub cap10with respect to the environment can be achieved.", "", "FIG.5shows a likewise alternative embodiment of a hub cap system1. The hub cap system1has a fluid channel60running in axial direction A, which is and/or can be brought into fluid connection with the groove42via openings44. The sealing ring100is arranged within the annular groove42. In order to achieve a particularly compact design, the groove42is formed on a projection18which points in the axial direction A. The hub cap10has fastening means20which point in the axial direction A and in the radial direction R and form and/or can form a click fastener.", "", "FIG.6shows a further embodiment, also shown in a sectional view, with the sectional plane also spanned by the axial direction A and the radial direction R. The sealing ring100is arranged entirely within the groove42, the side walls of the groove being V-shaped. The groove42is in fluid communication with the fluid channel60facing in the axial direction A via an opening44. In order to achieve a radial delimitation and/or covering of the groove42and/or the sealing ring100, an annular element150is in engagement with the groove42. Basically, in the sense of the invention, an annular element is given in particular if this forms a ring which is closed in itself. An exception to this can be the ring element150, which in one possible embodiment can form only a ring segment. Alternatively, preferably, however, the ring element150can also be annular, thus forming a self-contained ring. More conveniently, however, in such an embodiment, an aperture and/or recess is formed within the ring element150which, in an assembled state, can form a fluid connection between the groove42and the environment and/or a flow exit channel.", "", "FIG.7shows an embodiment of a hub cap system1whose inner space I can enter into fluid communication with the environment through the groove42and the fluid channel60. The sealing ring100is preloaded in positive radial direction R, in particular by spring wire inserts of the sealing ring100.", "", "FIG.8shows a detailed view of a hub cap system1, which has a rotor unit300. The rotor unit300is guided within a central opening12of the hub cap10, wherein in the example shown the hub cap10is formed in one piece. Alternatively, preferably, the hub cap10may also be formed in multiple parts and therefore comprise, for example, a central element14and/or a main body16. The rotor unit300has a compressed air passage320extending in the axial direction A and passing through the central opening12. The central opening12also forms a fluid channel60, such that the inner space I of the hub cap10is in fluid communication with the groove42through the central opening12and/or the fluid channel60. A part of the groove42or one of the side walls of the groove42arranged in a V-shape relative to each other is formed by the hub cap10, and the side wall opposite in the axial direction A, on the other hand, is formed by the rotor unit300. The sealing ring100is arranged inside the groove42. The rotor unit300has a connection310, which points in the radial direction R. This connection310can have a thread312, on which in turn a hose and/or another fluid-conducting element can be arranged, in particular in order to establish a fluid connection between the connection310and a tire."], "claims": ["a hub cap and a sealing ring; wherein the hub cap system is configured to rotate about an axial direction; wherein a radial direction is perpendicular to the axial direction; wherein the hub cap at least partially encloses an inner space; wherein the hub cap includes a fluid channel which is in fluid communication with the inner space or opens into the inner space; wherein the sealing ring is held in a circumferential groove of the hub cap system; and wherein the groove is configured to be brought into fluid communication with the fluid channel via openings.", "2 . The hub cap system according to claim 1 , wherein the sealing ring is completely arranged in the groove, and wherein the groove is closed in the radial direction at least in sections by a ring element arranged in the groove.", "3 . The hub cap system according to claim 2 , the sealing ring is preloaded or prestressed in the positive radial direction via one or more inserts.", "4 . The hub cap system according to claim 3 , wherein the groove is formed on a projection of the hub cap projecting in the axial direction.", "5 . The hub cap system according to claim 4 , wherein the projection is cylindrically shaped.", "6 . The hub cap system according claim 4 , wherein the groove and/or the sealing ring located in the groove is covered by a cover element in axial direction and/or in radial direction, and wherein an annular flow exit channel is located between the cover element and the hub cap.", "a rotor unit that includes a compressed air duct, wherein the rotor unit is fixed to and guided by the hub cap.", "8 . The hub cap system according to a claim 7 , wherein the groove is formed by the hub cap and the rotor unit.", "9 . The hub cap systems according to claim 1 , the sealing ring is preloaded or prestressed in the positive radial direction via one or more inserts.", "10 . The hub cap system according to claim 1 , wherein the groove is formed on a projection of the hub cap projecting in the axial direction.", "11 . The hub cap system according to claim 10 , wherein the projection is cylindrically shaped.", "12 . The hub cap system according claim 1 , wherein the groove and/or the sealing ring located/arranged in the groove is covered by a cover element in axial direction and/or in radial direction, and wherein an annular flow exit channel is located between the cover element and the hub cap.", "a rotor unit that includes a compressed air duct, wherein the rotor unit is fixed to and guided by the hub cap.", "14 . Hub cap system according to a claim 13 , wherein the groove is formed by the hub cap and the rotor unit.", "the hub cap system according to an axle element wherein the axle element is hollow on the inside.", "a rotor unit that includes a compressed air duct, wherein the rotor unit protrudes into the hollow duct of the axle element and/or wherein the compressed air duct of the rotor unit is or is configured to be in fluid communication with the internally hollow portion of the axle element.", "the hub cap system of a wheel hub.", "18 . A commercial vehicle comprising the hub cap system according to claim 1 .", "a wheel head, comprising: a hub cap system, comprising: a hub cap, a sealing ring and a rotor unit; wherein the hub cap system is configured to rotate about an axial direction; wherein a radial direction is perpendicular to the axial direction; wherein the hub cap at least partially encloses an inner space; wherein the hub cap includes a fluid channel which is in fluid communication with the inner space or opens into the inner space; wherein the sealing ring is held in a circumferential groove of the hub cap system; wherein the groove is or is configured to be brought into fluid communication with the fluid channel via openings; and wherein the rotor unit includes a compressed air duct, wherein the rotor unit is fixed to and guided by the hub cap; and an axle element that is hollow on the inside, wherein the rotor unit protrudes into the hollow of the axle element and/or wherein the compressed air duct of the rotor unit is or is configured to be in fluid communication with the internally hollow portion of the axle element.", "20 . The commercial vehicle according to claim 19 , wherein the sealing ring is completely arranged in the groove, and wherein the groove is closed in the radial direction at least in sections by a ring element arranged in the groove."], "bibtex": "@patent{20240157724,\n    title = {HUB CAP SYSTEM, WHEEL HEAD AND USE OF A SEALING RING},\n    number = {20240157724},\n    year = {2024},\n    note = {File: US20240157724A1-20240516.XML}\n    }", "classification": "B60B700FI"}, {"title": "WHEELS, TRACKS SYSTEMS, AND WHEEL ASSEMBLIES", "doc_number": "20240157725", "filename": "US20240157725A1-20240516.XML", "abstract": "A compliant wheel includes a hub portion and a resilient portion. The hub portion defines an axis and a longitudinal plane. The resilient portion extends radially from the hub portion, and includes a plurality of elements, and a plurality of fold lines. A first element of the plurality of elements and a second element of the plurality of elements are connected by one of the plurality of fold lines. The one of the plurality of fold lines defines a bend axis, and the first element is configured to resiliently move relative to the second element about the bend axis.", "detailed_description": [""], "claims": ["a hub portion defining an axis and a longitudinal plane; and a resilient portion extending radially from the hub portion, the resilient portion including: a plurality of elements, a plurality of fold lines, and a first element of the plurality of elements and a second element of the plurality of elements being connected by one of the plurality of fold lines, the one of the plurality of fold lines defining a bend axis, the first element being configured to resiliently move relative to the second element about the bend axis.", "2 . The wheel of claim 1 , wherein a force applied to the compliant wheel is distributed to at least some of the plurality of elements according to a pre-determined profile of resiliency", "3 . The compliant wheel of claim 1 , wherein one of the plurality of elements has an element thickness, one of the plurality of fold lines has a fold line thickness, the element thickness being different from the fold line thickness.", "4 . The compliant wheel of claim 1 , wherein the plurality of fold lines includes a plurality of radial fold lines and a plurality of tangent fold lines.", "the plurality of elements defines at least one apex and at least one depression, the at least one apex and the at least one depression being connected by at least one of: a radial fold line of the plurality of radial fold lines; and a tangent fold line of the plurality of tangent fold lines.", "6 . The compliant wheel of claim 1 , wherein the plurality of elements includes peripheral elements forming a peripheral surface of the compliant wheel.", "7 . The compliant wheel of claim 6 , wherein the peripheral elements include a first peripheral element and a second peripheral element adjacent to the first peripheral element, the first and second peripheral elements extending at an angle to the longitudinal plane.", "8 . The compliant wheel of claim 1 , further comprising a flexible rim portion connected to the resilient portion.", "in a resting state, the compliant wheel has a first profile perimeter; and in response to a force being applied to the compliant wheel, the compliant wheel deforms to a deformed state, in which: at least some of the plurality of elements move about corresponding bend axes; and the compliant wheel has a second profile perimeter, the second profile perimeter being substantially equal to the first profile perimeter.", "the resilient portion defines a plurality of equal sections, each one of the plurality of sections comprising at least one peripheral segment; in the resting state, a length of each peripheral segment of the plurality of peripheral segments is substantially similar; and in the deformed state, a length of at least one of the peripheral segments varies.", "the first element extends along a first plane; the second element extends along a second plane; and the second plane is at an angle relative to the first plane.", "12 . The compliant wheel of claim 1 , wherein an inner profile of the resilient portion and an outer profile of the resilient portion are one of: asymmetrical relative to the longitudinal plane and symmetrical relative to the longitudinal plane.", "13 . The compliant wheel of claim 1 , wherein at least one of the plurality of elements has a shape formed of at least three sides.", "14 . The compliant wheel of claim 13 , wherein the first element has a first shape, the second element has a second shape, and the first and second shape are different from one another.", "15 . The wheel of claim 1 , wherein at least some of the plurality of elements are arranged in a pyramidal clusters.", "16 . The compliant wheel of claim 1 , wherein the first element and the second element are connected in a hinge configuration about the one of the plurality of fold lines.", "a frame; a plurality of wheel assemblies rotationally connected to the frame, at least one wheel assembly of the plurality of wheel assembly comprising the compliant wheel of an endless track surrounding the frame, and the plurality of wheel assemblies.", "a hub portion defining an axis and a longitudinal center plane; and a resilient portion extending radially from the hub portion, the resilient portion including a plurality of elements arranged in a mesh pattern, each one of the plurality of elements having a polygonal shape defining a plurality of vertices and a plurality of edges, a first element and a second element being connected by one of the plurality of edges, the one of the plurality of edges defining a bend axis; the first element being configured to resiliently move relative to the second element about the bend axis.", "an inner side defining: a first circle having a first diameter and defining a first plane axially spaced from the longitudinal center plane by a first distance; a second circle having a second diameter and defining a second plane axially spaced from the longitudinal center plane by a second distance; an outer side defining: a third circle having a third diameter and defining a third plane axially spaced from the longitudinal center plane by a third distance; a fourth circle having a fourth diameter and defining a fourth plane axially spaced from the longitudinal center plane by a fourth distance; wherein the vertices of the first element are on at least three of the first, second, third and fourth circles.", "the second diameter is greater than the first diameter; and the third diameter is greater than the fourth diameter."], "bibtex": "@patent{20240157725,\n    title = {WHEELS, TRACKS SYSTEMS, AND WHEEL ASSEMBLIES},\n    number = {20240157725},\n    year = {2024},\n    note = {File: US20240157725A1-20240516.XML}\n    }", "classification": "B60B926FI"}, {"title": "Polymer-Based Wheel Assembly For Non-Pneumatic Tire", "doc_number": "20240157726", "filename": "US20240157726A1-20240516.XML", "abstract": "The present disclosure is directed to a polymer-based wheel assembly for a non-pneumatic tire. The wheel assembly comprises: an inboard wheel segment comprising an inboard tubular body having an exterior inboard rim surface, a first inboard segment end having an inboard annular lip extending radially outward from the exterior inboard rim surface, and a second inboard segment end having an inboard wheel segment connecting surface; an outboard wheel segment comprising an outboard tubular body having an exterior outboard rim surface, a first outboard segment end having an outboard annular lip extending radially outward from the exterior outboard rim surface, and a second outboard segment end having an outboard wheel segment connecting surface; wherein the inboard and outboard wheel segment connecting surfaces are coupled together to form a joint, and wherein the exterior inboard and exterior outboard rim surfaces cooperate to form a wheel assembly rim surface; and wherein the inboard and outboard wheel segments are formed from a polymer-based composition.", "detailed_description": ["It is to be understood by one of ordinary skill in the art that the present discussion is a description of exemplary embodiments only and is not intended as limiting the broader aspects of the present disclosure.", "", "Generally speaking, the present disclosure is directed to a wheel assembly. The wheel assembly can be a useful alternative to traditional non-pneumatic wheels, which typically include a heavy metal wheel center and support system that is not easily recyclable. The disclosed wheel assembly, being made from a polymer-based composition, is far lighter yet structurally sound and easy to recycle.", "", "One embodiment of the wheel assembly comprises: an inboard wheel segment comprising an inboard tubular body having an exterior inboard rim surface, a first inboard segment end having an inboard annular lip extending radially outward from the exterior inboard rim surface, and a second inboard segment end having an inboard wheel segment connecting surface; an outboard wheel segment comprising an outboard tubular body having an exterior outboard rim surface, a first outboard segment end having an outboard annular lip extending radially outward from the exterior outboard rim surface, and a second outboard segment end having an outboard wheel segment connecting surface; wherein the inboard and outboard wheel segment connecting surfaces are coupled together to form a joint, and wherein the exterior inboard and exterior outboard rim surfaces cooperate to form a wheel assembly rim surface; and wherein the inboard and outboard wheel segments are formed from a polymer-based composition.", "", "The wheel assembly is suitable for most any vehicle. The term “vehicle” refers to any device that moves on wheels and transports people or freight or performs other functions. The vehicle may be self propelled or not. Non-limiting examples include automobiles, motorcycles, wheeled construction vehicles, all terrain vehicles (ATVs), trucks, trailers, bicycles, carriages, shopping carts, wheel barrows, and dollies.", "", "The wheel assembly of the present disclosure can be further described utilizingFIGS.1-10.", "", "FIG.1shows an exemplary embodiment of wheel assembly1having non-pneumatic tire100mounted thereon. Wheel assembly10is suitable for a variety of non-pneumatic tires and non-pneumatic tire assemblies. Thus, non-pneumatic tire100can be a single body or multiple bodies. For example, non-pneumatic tire100can be mounted as two complementary tire segments from the center of each wheel assembly segment.", "", "FIG.2shows wheel assembly10in a coupled configuration without a tire mounted thereon. Wheel assembly10has inboard wheel segment12comprising an inboard tubular body14which has an exterior inboard rim surface16. Exterior inboard rim surface16can also comprise other elements (not shown) suitable for mounting a non-pneumatic tire or a non-pneumatic tire segment thereon. Inboard wheel segment12also comprises an inboard annular lip20extending radially outward from the exterior inboard rim surface16. Annular lip20is configured to retain a non-pneumatic tire or a non-pneumatic tire segment on the exterior inboard rim surface16.", "", "Wheel assembly10comprises an outboard wheel segment22which is complementary to and configured to couple to inboard wheel segment12. As with inboard wheel segment12, outboard wheel segment22comprises an outboard tubular body24having an exterior outboard rim surface26and a first outboard segment end28having an outboard annular lip30extending radially outward from exterior outboard rim surface26.", "", "Wheel assembly10ofFIG.2is shown in the exploded view ofFIG.3. Inboard wheel segment12comprises a second inboard segment end32having an inboard wheel segment connecting surface34. Outboard wheel segment22similarly comprises a second outboard segment end33having an outboard wheel segment connecting surface36. Inboard wheel segment12and outboard wheel segment22can each comprise a respective plurality of openings38and40at the connecting surfaces34and36. The plurality of openings38and40of each wheel segment12,22can be aligned as shown inFIG.3. The plurality of openings38can be mounting bore holes that extend through inboard and outboard connecting surfaces34and36. Mounting bore holes can be used to mount wheel assembly10on a vehicle. The term “vehicle” refers to any device that moves on wheels and transports people or freight or performs other functions. The vehicle may be self-propelled or not. Non-limiting examples include automobiles, motorcycles, wheeled construction vehicles, all-terrain vehicles (ATVs), trucks, trailers, bicycles, carriages, shopping carts, wheel barrows, and dollies.", "", "Referring again toFIG.3, wheel assembly10can also include at least one fastener42that couples the inboard and outboard connecting surfaces34and36. Fastener42depicted inFIG.3is a nut and bolt fastener but it will be understood that any suitable fastener capable of joining the inboard and outboard connecting surfaces34and36can be used.", "", "Referring toFIG.4, inboard wheel segment12and outboard wheel segment22couple together at the wheel segment connecting surfaces to form a joint50. Thus, exterior inboard and exterior outboard rim surfaces together cooperate to form a wheel assembly rim surface52. Referring to the elevational view ofFIG.5, mounting bore holes38and connecting bore holes40can align with each respective wheel segment. The cross-sectional view ofFIG.6, taken at section line6-6ofFIG.5, shows the inboard and outboard connecting surfaces coupled together to form joint52through fasteners42.", "", "Referring again toFIG.3, which shows inboard and outboard connecting surfaces34and36as respective singular connecting surfaces, each wheel segment can have more than one connecting surface, i.e., a plurality of connecting surfaces, in other contemplated embodiments. When coupled, inboard and outboard connecting surfaces34and36can comprise an open interface or can abut one another in a flush configuration. In the embodiment shown inFIG.3, inboard and outboard connecting surfaces34and36extend radially inward and perpendicular to the rotational and longitudinal axis of inboard and outboard tubular bodies14and24shown inFIG.2. Referring toFIG.3, inboard and outboard wheel segment connecting surfaces34and36can substantially enclose or enclose second inboard and second outboard segment ends32and33.", "", "Referring toFIGS.7-9, in another embodiment of wheel assembly10, the interface of the inboard and outboard connecting surfaces can be formed by intermediate plate60. Intermediate plate60can comprise mounting bore holes38. As shown inFIG.7, the respective wheel segments can be overmolded to surround intermediate plate 60 or alternatively can be mechanically or chemically fastened or secured to the plate. Intermediate plate60can comprise any suitable material such as metal or a supportive plastic. In one example, intermediate plate60can be made by thixotropically molding magnesium into the desired shape and then overmolding each respective wheel segment over the plate. Intermediate plate60, such as one made in this manner, can provide creep resistance for the vehicle mounting means and can also function as a heat sink for applications with braking systems located near a non-pneumatic tire.", "", "Referring toFIG.10, wheel assembly10can comprise inboard connecting surface34and outboard connecting surface36coupled together via fasteners42(or any other suitable fastening means such as chemical adhesion and the like) and integrated with or fastened to offset hub70which can comprise at least one mounting bore hole70. More generally, each respective wheel segment can be identical or can vary in order to offset the connecting surfaces and the vertical mounting plane relative to the inboard and outboard side edges of the wheel assembly. Referring back toFIG.7for example, intermediate plate60can be centered or offset in a positive (outboard) or negative (inboard) direction relative to the center of the wheel assembly."], "claims": ["an inboard wheel segment comprising an inboard tubular body having an exterior inboard rim surface, a first inboard segment end having an inboard annular lip extending radially outward from the exterior inboard rim surface, and a second inboard segment end having an inboard wheel segment connecting surface; an outboard wheel segment comprising an outboard tubular body having an exterior outboard rim surface, a first outboard segment end having an outboard annular lip extending radially outward from the exterior outboard rim surface, and a second outboard segment end having an outboard wheel segment connecting surface; wherein the inboard and outboard wheel segment connecting surfaces are coupled together to form a joint, and wherein the exterior inboard and exterior outboard rim surfaces cooperate to form a wheel assembly rim surface; and wherein the inboard and outboard wheel segments are formed from a polymer-based composition.", "2 . The wheel assembly of claim 1 , wherein the inboard wheel segment connecting surface or the outboard wheel segment connecting surface is singular or plural.", "3 . The wheel assembly of claim 1 , wherein the joint extends through the wheel assembly rim surface.", "4 . The wheel assembly of claim 1 , further comprising at least one fastener that couples the inboard and outboard wheel connecting surfaces.", "5 . The wheel assembly of claim 1 , wherein the inboard and outboard wheel connecting surfaces abut one another.", "6 . The wheel assembly of claim 1 , wherein the inboard and outboard wheel connecting surfaces each comprise a respective plurality of openings, the plurality of openings of the inboard connecting surface being aligned with the plurality of openings of the outboard connecting surface.", "7 . The wheel assembly of claim 1 , wherein the inboard and outboard wheel segment connecting surfaces extend radially inward and perpendicular to the rotational and longitudinal axis of the inboard and outboard tubular bodies.", "8 . The wheel assembly of claim 1 , wherein the inboard and outboard wheel segment connecting surfaces substantially enclose the second inboard and outboard segment ends.", "9 . The wheel assembly of claim 1 , wherein the inboard and outboard wheel segment connecting surfaces enclose the second inboard and outboard segment ends.", "10 . The wheel assembly of claim 1 , wherein the inboard and outboard wheel segment connecting surfaces have at least one mounting bore hole extending therethrough.", "11 . The wheel assembly of claim 1 , wherein the interface of the inboard and outboard connecting surfaces is formed by an intermediate plate.", "12 . The wheel assembly of claim 11 , wherein the intermediate plate comprises a metal.", "13 . The wheel assembly of claim 1 , which is injection molded from the polymer-based composition.", "14 . The wheel assembly of claim 1 , wherein the polymer-based composition comprises a thermoplastic polyamide.", "15 . The wheel assembly of claim 1 , wherein the polymer-based composition comprises a polyester.", "16 . The wheel assembly of claim 1 , wherein the polymer-based composition comprises a copolyether-ester."], "bibtex": "@patent{20240157726,\n    title = {Polymer-Based Wheel Assembly For Non-Pneumatic Tire},\n    number = {20240157726},\n    year = {2024},\n    note = {File: US20240157726A1-20240516.XML}\n    }", "classification": "B60B2110FI"}, {"title": "RIM ACCESSORY FOR WHEEL POSITIONING ANGLE DETECTION, WARNING SYSTEM FOR WHEEL POSITIONING ANGLE DETECTION AND WARNING METHOD FOR WHEEL POSITIONING ANGLE DETECTION", "doc_number": "20240157727", "filename": "US20240157727A1-20240516.XML", "abstract": "A rim accessory for wheel positioning angle detection is illustrated, which can be detachably installed in a rim of a wheel of a vehicle. The rim accessory has a housing body and a sensor module. The housing body can be detachably installed in the rim, and the sensor module is installed in the housing body, and the sensor module used to generate multiple measurement data. The multiple measurement data are used to calculate multiple inclined angle data of the wheel in respect to at least a reference axis. A warning system and method for the wheel positioning angle detection are also illustrated, the warning system or method is used to compare the inclined angle data with a standard value, and when the inclined angle data deviates from a specific range of the standard value, the warning system or method sends out a warning message.", "detailed_description": [""], "claims": ["a housing body, detachably installed in the rim; and a sensor module, installed in the housing body, configured to generate at least one measurement data, wherein the at least one measurement data is used to calculate an inclined angle data of the wheel in respect to at least a reference axis; wherein the housing body is a rim cover of the rim which is used to installed in a central hole, the sensor module comprises at least a sensor, and the sensor is an accelerometer of a micro electromechanical system (MEMS).", "2 . The rim accessory for the wheel positioning angle detection of claim 1 , wherein the sensor module is installed on a surface of the housing body facing to the central hole.", "3 . The rim accessory for the wheel positioning angle detection of claim 2 , wherein the sensor module is located in the central hole.", "4 . The rim accessory for the wheel positioning angle detection of claim 1 , wherein the housing body has a bottom wall and a peripheral wall connected to the bottom wall, the bottom wall and the peripheral wall forms an accommodation space, the sensor module is disposed on the bottom wall and located in the accommodation space, and the peripheral wall has a clamping structure, such that the housing body is able to be clamped to the central hole.", "5 . The rim accessory for the wheel positioning angle detection of claim 1 , wherein the sensor module further comprises a circuit board, and the accelerometer is disposed on the circuit board.", "6 . The rim accessory for the wheel positioning angle detection of claim 5 , wherein the at least one measurement data is multiple measurement data, the multiple measurement data are gravitational acceleration components measured by the accelerometer respectively along a first measurement axis, a second measurement axis and a third measurement axis, the first measurement axis is vertical to the axial surface of the rim, the second measurement axis and the third measurement axis are parallel to the axial surface of the rim and vertical to the first measurement axis, the second measurement axis and the third measurement axis are vertical to each other.", "7 . The rim accessory for the wheel positioning angle detection of claim 6 , wherein the sensor module further comprises a processor and a wireless transceiver unit, the processor and the wireless transceiver unit are disposed on the circuit board, the sensor and the wireless transceiver unit are electrically connected to the processor, the multiple measurement data are transmitted to the processor, and the processor performs a calculation on the multiple measurement data, or indicates the wireless transceiver unit to send the multiple measurement data.", "8 . The rim accessory for the wheel positioning angle detection of claim 7 , wherein the processor comprises a calculation unit, the calculation unit receives the multiple measurement data and calculates the multiple inclined angle data by using a specific algorithm.", "9 . The rim accessory for the wheel positioning angle detection of claim 8 , wherein the sensor module further comprises a battery unit, the battery unit is connected to the processor, and the battery unit provides electricity to the sensor module.", "10 . The rim accessory for the wheel positioning angle detection of claim 1 , wherein a first measurement axis of the sensor is vertical to the axial surface of the rim.", "11 . The rim accessory for the wheel positioning angle detection of claim 10 , wherein the first measurement axis is disposed on a center of the rim cover and/or a central axis of the central hole of the rim.", "12 . The rim accessory for the wheel positioning angle detection of claim 11 , wherein the first measurement axis is overlapped with the central axis of the central hole of the rim.", "the rim accessory for the wheel positioning angle detection of a central processing unit, used to receiving the measurement data to calculate the inclined angle, or used to receive the inclined angle, and used to compare the inclined angle data with a standard value, wherein when the inclined angle data deviates from a specific range of the standard value, the central processing unit generates a control signal; and a warning unit, connected to the central processing unit, used to receive the control signal and send out a warning message.", "14 . The warning system for the wheel positioning angle detection of claim 13 , wherein the central processing unit is installed in a vehicle computer of a vehicle, or the central processing unit is installed in a mobile device.", "the wheel, having the rim accessory for the wheel positioning angle detection.", "a display, used to display the inclined angle data on the display, and the display acts as the warning unit to display the warning message.", "17 . The warning system for the wheel positioning angle detection of claim 13 , wherein the warning unit is a sign device on a dashboard of the vehicle.", "an installation step: installing a rim accessory for the wheel positioning angle detection in a rim of a wheel of a vehicle, wherein the rim accessory for the wheel positioning angle detection comprises a sensor module and a housing body, the sensor module is installed in the housing body, the housing body is a rim cover of the rim which is used to installed in a central hole; a communication paring step making the sensor module pair with a device having a central processing unit to establish a communication link between the device and the sensor module; a measuring step: generating at least one measurement data by using the sensor module; a calculating step: calculating an inclined angle data of the wheel in respect to at least a reference axis according to a measurement data by executing a specific algorithm; and a comparing and warning step: comparing the inclined angle with a standard value by using the central processing unit, and when the inclined angle data deviates from a specific range of the standard value, sending out a warning message.", "a calibration step: installing the wheel which has been installed with the rim accessory for the wheel positioning angle detection in a vehicle, and performing a four-wheel alignment procedure to obtain the standard value of the inclined angle data.", "20 . The warning method for the wheel positioning angle detection of claim 18 , wherein the at least one measurement data of the calculation step is multiple measurement data, the multiple measurement data are used to calculate multiple inclined angle data of the wheel in respect to a first reference axis, a second reference axis and a third reference axis, wherein the first reference axis is defined to be parallel to a wheel shaft and vertical to a gravity direction, the second reference axis is defined to be vertical to the gravity direction and the gravity direction, and the third reference axis is defined to be parallel to the gravity direction."], "bibtex": "@patent{20240157727,\n    title = {RIM ACCESSORY FOR WHEEL POSITIONING ANGLE DETECTION, WARNING SYSTEM FOR WHEEL POSITIONING ANGLE DETECTION AND WARNING METHOD FOR WHEEL POSITIONING ANGLE DETECTION},\n    number = {20240157727},\n    year = {2024},\n    note = {File: US20240157727A1-20240516.XML}\n    }", "classification": "B60B2112FI"}, {"title": "HUB SYSTEM, METHOD AND DEVICE WITH ADJUSTABLE DEADBAND", "doc_number": "20240157728", "filename": "US20240157728A1-20240516.XML", "abstract": "A freewheel hub having a non-zero deadband distance in order to reduce or eliminate pedal kickback. The deadband distance is able to have or be adjusted to a desired length including lengths that enable silent freewheeling operation where the pawls of the freewheel body do not engage or contact the teeth of the ratchet gear thereby eliminating any contact-based freewheeling sound.", "detailed_description": ["Embodiments of the application are directed to a bicycle and/or a freewheel hub having a non-zero deadband distance in order to reduce or eliminate pedal kickback. This allows the freehub body to always move through a prescribed free motion before hub engagement, regardless of the relative position of the freehub body and the hub shell, and regardless of the number of teeth in the freehub ratchet mechanism. The deadband distance is able to have and/or be adjusted to a desired length including lengths that enable silent freewheeling operation where the pawls of the freewheel body do not engage or contact the teeth of the ratchet gear thereby eliminating any contact-based freewheeling sound.", "", "Reference will now be made in detail to implementations of a bicycle and/or freewheel hub, such as illustrated in the accompanying drawings. The same reference indicators will be used throughout the drawings and the following detailed description to refer to the same or like parts. In the interest of clarity, not all of the routine features of the implementations described herein are shown and described. It will be appreciated that in the development of any such actual implementation, numerous implementation-specific decisions can be made in order to achieve the developer's specific goals, such as compliance with application and business related constraints, and that these specific goals will vary from one implementation to another and from one developer to another. Moreover, it will be appreciated that such a development effort might be complex and time-consuming, but would nevertheless be a routine undertaking of engineering for those of ordinary skill in the art having the benefit of this disclosure.", "", "FIG.1illustrates a bicycle assembly200according to some embodiments. As shown inFIG.1, the bicycle assembly200comprises a bicycle rear wheel202(including a hub assembly1), a bicycle front triangle204and a bicycle rear triangle206coupled with the front triangle204. The bicycle front triangle204and bicycle rear triangle206are coupled together via a bicycle suspension link216, which compresses a bicycle rear shock absorber210that is coupled between the front triangle204and the suspension link216. The assembly200further comprises a bicycle crank208operably coupled with a bicycle chainring209engaged with a bicycle chain212. A bicycle cassette214is mounted to the bicycle rear wheel202, which is engaged to said bicycle chain212. A bicycle rear derailleur215is engaged to said chain212and mounted to said rear triangle206proximate said rear wheel202. Alternatively, one or more of the above components are able to be omitted. Further, although only the components above are described in detail, it is understood that the bicycle assembly200is able to comprise one or more other components well known in the art that are not described herein for the sake of brevity.", "", "FIG.2illustrates a detailed view of the bicycle rear triangle206and bicycle rear wheel202according to some embodiments. As shown inFIG.2, overlaid geometry shows the Axle Position Resting AR, Axle Position Compressed AC, Wheel Path WP, Bicycle Chainstay Length L1and Bicycle Chainstay Length L2. In particular, this geometry is overlaid to demonstrate the change to the bicycle frame geometry under suspension compression. When not under significant compression, the axle is at position AR and the chainstay length is equal to L1. When under compression, the axle moves along path WP to position AC thereby increasing the chainstay length to L2. As described above, this increase in chainstay length can abruptly rotate the freewheel body with respect to the freewheel shell and thereby cause pedal kickback if the deadband is zero or minimal.", "", "FIG.3illustrates a perspective view of the hub assembly1according to some embodiments. As shown inFIG.3, the hub assembly1comprises first end2, second end4, and hub central axis6.FIG.4illustrates a perspective exploded view of the hub assembly1according to some embodiments. As shown inFIG.4, the hub assembly comprises a hub shell assembly30, a freehub body assembly100, a hub axle14and a hub axle cap10. Both the hub shell assembly30and the freehub body assembly100are able to slide onto the hub axle14such that they are located on a hub axle bearing surface20. The hub axle cap10is able to be threaded onto said axle14with a hub axle cap thread12threading onto a hub axle thread16, such that the hub axle right end18is opposite said end cap10with the assemblies30,100in between.", "", "FIG.5illustrates an exploded perspective view of the hub shell assembly30according to some embodiments. As shown inFIG.5, the hub shell assembly30comprises a hub shell32, a hub shell disc flange34, a hub shell bearing36, a hub shell ratchet gear bore38, one or more hub shell ratchet gear spline slots40, a one-way clutch42having an outer race44and an inner bore46, and a toothed ratchet gear180. In some embodiments, the one-way clutch is a sprag clutch. Alternatively, the one-way clutch42is able to be other types of over-running or one-way clutches, including but not limited to a roller clutch, a pawl clutch, a wound-spring type clutch, a face-gear clutch, and/or other similar clutches. Some of these clutches would not allow for silent hub operation, but they would allow for the same adjustable deadband operation of the hub1.", "", "FIG.6illustrates a cross-section view of the hub shell assembly30at section line according to some embodiments. As shown inFIG.6, the hub shell32comprises a hub shell body54, hub shell disc flange34(e.g. for coupling with a brake rotor), hub shell left spoke flange50and hub shell right spoke flange52(e.g. both for coupling with one or more spokes (not shown)). Further, as shown inFIG.6, the hub shell bearing36is able to be positioned within a bearing cavity within the flange34(e.g. for receiving axle14), the one-way clutch42is able to be fitted into hub shell clutch bore56(e.g. for receiving the stem142of the pusher140, and the ratchet gear180is able to be positioned within the hub shell ratchet bore38. In particular, when positioned within the hub shell ratchet bore38, each of a plurality of ratchet ring spline teeth184(seeFIG.15) of the ratchet ring180extend into a different one of the hub shell ratchet spline slots40. As a result, when the ratchet ring180is rotated, the ratchet ring spline teeth184apply a force to the ratchet spline slots40thereby causing the hub shell32to similarly rotate. Additionally, the outer surface of the stem142of the pusher140is able to contact the inner bore46of the one-way clutch42such that the inner bore46rotates with the pusher140in a first direction of rotation, but resists and/or stops rotation of the pusher140in the opposite direction (e.g. via friction between the outer surface of the stem142and the inner bore46).", "", "FIGS.7and8illustrates perspective and partially exploded perspective views, respectively, of the freehub body assembly100according to some embodiments. As shown inFIGS.7and8, the freehub body assembly100comprises a bearing assembly (or pawl support member)102, a pawl pusher140, a deadband adjustment key108, one or more ratchet pawls106a-c, and a pawl biasing element104. In some embodiments, the biasing element104is a wire spring. Alternatively, the biasing element104is able to be other types of biasing elements including, but not limited to, one or a combination of one or more leaf springs, one or more coil springs, one or more rubber bands, one or more magnets (e.g. placed in the freehub body under steel pawls106), and/or any other kind of spring loading mechanism.", "", "FIGS.9and10illustrate perspective and side views, respectively, of the bearing assembly102according to some embodiments. As shown inFIGS.9and10, the bearing assembly102comprises a freehub end bearing122(e.g. for receiving the axle14), a freehub external bearing126with an external bearing outer race128, a freehub internal bearing124with an internal bearing inner race125(e.g. for receiving the axle14), a cassette spline120, a cassette mounting thread116, a cassette mounting boss118, a biasing element slot134, one or more pawl cylinder slots130a-c, one or more deadband surfaces132a-c, one or more pusher stop surfaces136a-c, and a deadband adjustment key slot138. The cassette spline120and/or cassette mounting boss118is able to receive a splined cassette (not shown) in order to coupled with a drive assembly of the bicycle200(e.g. the bicycle crank208, the bicycle chainring209, the bicycle chain212, the derailleur215and/or other components). A cassette locking bolt (not shown) is able to threadably couple to the cassette mounting thread116to secure the cassette onto the spline120. Although as shown inFIGS.9and10, the bearing assembly102comprises three pawl cylinder slots130a-c, deadband surfaces132a-cand pusher stop surfaces136a-c, and a single deadband reducer slot138, more or less pawl cylinder slots130a-c, deadband surfaces132a-c, pusher stop surfaces136a-c, and deadband reducer slots138are contemplated.", "", "Similarly, although as shown inFIGS.7and8, the freehub body assembly100comprises a pawl pusher140having three fingers144, a single deadband adjustment key108, three ratchet pawls106a-cand a single pawl biasing element104, a pawl pusher140having more or less fingers144, more or less deadband adjustment keys108, more or less ratchet pawls106a-cand/or more or less pawl biasing elements104are contemplated. In particular, the number of deadband adjustment keys108is able to correspond to the number of deadband adjustment key slots138, and the number of fingers144, cylinder slots130a-c, deadband surfaces132a-cand stop surfaces136a-cis able to correspond to the number of pawls106a-c. The space defined between each of the pawl cylinder slots130a-c, the corresponding stop surface136a-cand the corresponding deadband surface132a-c, is able to form a plurality of deadband cavities that are filled by the fingers144of the pusher140, the pawls106a-c(at least in a fully retracted position) and the deadband adjustment key108(when coupled within the deadband adjustment key slot138).", "", "FIGS.11and12illustrate perspective and front views, respectively, of the pawl pusher140according to some embodiments. As shown inFIGS.11and12, the pawl pusher140comprises a central cavity147(for receiving the axle14), a stem or clutch cylinder142, a finger flange146and one or more pawl fingers144a-c. Each of the fingers144comprise finger pawl surface148, finger outside diameter154, finger locating cylinder150, and pusher freewheel stop152. In operation, the locating cylinder150of the pawl fingers144is able to slide along the deadband surface132a-cwithin the deadband cavities between the pawls106a-cand the stop walls136a-cor an inserted key108. As a result, the pawl surface148is able to slide under the pawl pusher cam surface166(seeFIG.14) in order to cause the pawls106a-cto pivot from the retracted position to the extended position. When slide in the opposite direction, the pusher freewheel stop152is able to contact the stop walls136a-cand/or the inserted key108(thereby defining the deadband distance).", "", "FIGS.13and14illustrate perspective and end views, respectively, of a ratchet pawl106a-caccording to some embodiments. As shown inFIGS.13and14, the ratchet pawl106a-ccomprises a pawl cylinder160, a pawl biasing element groove162, a pawl spring pad164, a pawl pusher cam surface166, a pawl driving surface168and a pawl tip radius170. The pawl pusher cam surface166is for sliding over the pusher fingers144as described above. The pawl driving surface168is configured to engage the ratchet tooth receiving face186and/or the pawl tip radius170is configured to fit within the valleys between the teeth185of the ratchet gear180(thereby engaging and causing the gear180to rotate with the freehub assembly100).", "", "The pawl cylinder160of each of the pawls106a-cis able to slidably fit within one of the pawl cylinder slots130a-c. When positioned within one of the slots130a-c, the pawls106a-care able to pivot about a central axis of the slot130between a retracted position adjacent to the respective deadband surface132a-cand an extended position away from the deadband surface132a-c. The biasing element104is able to fit withing the gap134(seeFIG.10) at least partially surrounding or blocking the pivoting of pawls106a-caway from the deadband surface132a-c. In particular, the biasing element104is able to be positioned within the pawl biasing element groove162and adjacent to or around the pawl spring pad164of each of the pawls106a-cin order to resist the pivoting away from the deadband surface132a-cand/or bias the pawls106a-cin the retracted position. Indeed, by providing a shortened pad164, the pawls106a-cenable the biasing element104to have a smaller diameter and/or size and be closer to the deadband surface132a-c.", "", "When in the extended position (seeFIGS.21and22), the pawls106a-care pivoted away from the deadband surface132a-csuch that they are able to engage the teeth185of the ratchet gear180(e.g. contact a ratchet tooth receiving face186and/or a bottom of the valley between teeth185). In some embodiments, when in the retracted position the pawls106a-care able to contact the deadband surface132a-cand/or be positioned fully within the corresponding deadband cavity (e.g. when the corresponding pusher finger144is able to slide to be adjacent to a stop wall136a-cor able to slide to be adjacent to the inserted key108, but still does not impede or block the pivoting of the corresponding pawl106a-c(seeFIGS.19and20)). Alternatively, when in the retracted position the pawls106a-care able to be at least partially blocked from contacting the deadband surface132a-cand/or from being positioned fully within the corresponding deadband cavity (e.g. when despite being fully slide against an inserted key108, the corresponding pusher finger144impedes or blocks the pivoting of the corresponding pawl106a-ctoward the deadband surface132a-c). In particular, by inserting and/or selecting a size of the key108, a user is able to adjust the retracted position by adjusting how close the fingers144are to the pawls106a-cand/or the extent that the fingers144block the inward pivoting of the pawls106a-c.", "", "FIGS.15and16illustrate perspective and detail views, respectively, of the toothed ratchet gear180according to some embodiments. As shown inFIG.15, the toothed ratchet gear180comprises a ring-shaped body having an outside surface182, one or more outer splines184protruding from the outside surface182of the body, and a plurality of inner teeth185protruding from an inner surface of the body. Each of the inner teeth185have a ratchet tooth receiving face186and a ratchet tooth sliding face188with a valley formed where the sliding face188of each tooth meets the receiving face186of the adjacent tooth185. A ratchet tooth pitch angle P is shown as the angle between two adjacent teeth185. The sliding face188is able to be longer and/or make a smaller angle with respect to the adjacent inner surface of the body than the receiving face186. Additionally, the shape, contour and/or size of the pawl driving surface168and the pawl tip radius170of each of the pawls106a-cis able to compliment the shape of the valleys and/or curvature of the sliding face188.", "", "As a result, when the pawls106a-care extended such that they contact the teeth185and moved/rotated in a direction from the valley in between teeth185along the adjacent sliding face188, the smaller angle enables the pawls106a-cto slide over the teeth185without engaging the teeth185. In contrast, when moved/rotated in the opposite direction from the valley in between teeth185along the adjacent receiving face186, the larger/steeper angle causes the pawl driving surface168and/or the pawl tip radius170to catch against the receiving face186and/or within the valleys thereby engaging the teeth185and forcing the ring to rotate in the same direction as the pawls106a-c. Alternatively, the sliding and receiving faces186,188are able to be the same length and/or angle.", "", "FIG.17illustrates a perspective view of the biasing element104according to some embodiments. As shown inFIG.17, the biasing element19comprises an elongated body shaped to surround each of the pawls106a-c, the body having a gap194enabling the body to flex to fit around the pawls106a-cbefore springing back to shape, and a tang192to catch on one or more of the pawls106a-cand thereby prevent the biasing element104from rotating with respect to the pawls106a-c. The biasing element104is able to comprise a flexible material or combination of materials including, but not limited to, rubber, metal, plastic or other flexible material known in the art. As described above, the biasing element104is able to fit withing the gap134(seeFIG.10) at least partially surrounding or blocking the pivoting of pawls106a-caway from the deadband surface132a-c. In particular, the biasing element104is able to be positioned within the pawl biasing element groove162and adjacent to or around the pawl spring pad164of each of the pawls106a-cin order to resist the pivoting away from the deadband surface132a-cand/or bias the pawls106a-cin the retracted position. Indeed, by providing a shortened pad164, the pawls106a-cenable the biasing element104to have a smaller diameter and/or size and be closer to the deadband surface132a-c. Additionally, the pad164provides a surface for the tang192to catch/grip and thereby prevent the biasing element104from rotating with respect to the pawls106a-c.", "", "FIG.18illustrates a perspective view of the deadband adjustment key108according to some embodiments. As shown inFIG.18, the deadband adjustment key108comprises an adjustment block232and a coupling member234. The coupling member234is able to have a trunk configured to fit within the deadband adjustment key slot138and a holding sheet that extends below an inside of the slot thereby keeping the trunk/key from falling out of the slot138. The adjustment block232is able to extend from the slot138into the adjacent deadband recess next to the stop wall136of that recess (seeFIGS.19and22). As a result, when inserted into the slot138, the adjustment block232reduces the size of the deadband recess by reducing the maximum distance that the pusher finger144of that recess (and all the other pusher fingers144because they are coupled together) is able to slide away from the pawl106a-cof that recess. Indeed, althoughFIG.18illustrates an adjustment block232having a first width (e.g. width R shown inFIG.19), it is understood that the adjustment block232is able to have larger or smaller widths and/or that the system is able to include multiple keys108having blocks232of different widths such that the user is able to select a key108having a desired width as a manner of adjusting the deadband distance of the system. Alternatively, the bearing assembly102is able to have a plurality of slots138along one of the deadband recesses such that deadband distance is able to be adjusted by inserting the key108in one of the slots138that is a desired distance from the stop wall136and/or pawl106a-cof that recess.", "", "FIG.19is a section view of hub assembly1with the freehub body assembly100inserted (e.g. concentrically nested) within the toothed ratchet gear180according to some embodiments. As shown inFIG.19, the pawls106a-care in the retracted position (e.g. due to the force applied by the biasing element104) with the block232of the inserted deadband adjustment key108reducing the distance between the pawls106a-cand the fingers144a-c. As a result, the hub assembly1is in a freewheeling configuration where the hub shell assembly30(e.g. the gear180) is able to rotate clockwise with respect to the freehub body assembly100(e.g. the pawls106a-c). Indeed, because the pawls106a-care able to retract such that they do not contact the gear180, the hub assembly1is in a silent freewheeling configuration where the hub assembly1does not make a clicking noise found in traditional assemblies due to the contact of the pawls106a-cwith the gear180. As shown inFIG.19, in this configuration the pawl106ais positioned so that the pawl pusher cam surface166is in contact with the deadband surface132aand/or within the deadband cavity. Further, the pusher freewheel stop152is in contact with the block232, therefore the deadband reduction angle R is developed between said pusher freewheel stop152and the stop surface136.", "", "FIG.20is another section view of hub assembly1with the freehub body assembly100inserted (e.g. concentrically nested) within the toothed ratchet gear180according to some embodiments. However, unlikeFIG.19, inFIG.20the key108is not inserted in the slot138such that the deadband distance remains at its maximum. In particular, the pawls106a-care in the retracted position (e.g. due to the force applied by the biasing element104) with the fingers144a-cslid against the stop walls136away from the pawls106a-c. As a result, the hub assembly1is in again in a silent freewheeling configuration where the hub shell assembly30(e.g. the gear180) is able to rotate clockwise with respect to the freehub body assembly100(e.g. the pawls106a-c). However, unlike the configuration inFIG.19, the longer deadband distance inFIG.20will increase the time required for the fingers144a-cto push the pawls106a-cto the extended position and thus increase the time required for the pawls106a-cto engage the gear180thereby reducing the likelihood of pedal kickback.", "", "FIG.21is another section view of hub assembly1with the freehub body assembly100inserted (e.g. concentrically nested) within the toothed ratchet gear180according to some embodiments. As shown inFIG.21, the pawls106a-care in the extended position due to the extending force applied to the pawls106a-cby the fingers144a-covercoming the biasing force applied by the biasing element104. In particular, as the freehub body assembly100begins to rotate clockwise (e.g. due to pedaling), the one-way clutch42provides a drag or stopping force to the stem142of the pusher140such that the fingers144a-cmove counterclockwise with respect to the pawls106a-c(and the remainder of the assembly100). As a result, the fingers144a-cslide along the deadband surface132a-ctoward the pawls106a-cand eventually contact the pawls106a-c, sliding under the tip168and the surface166thereby causing the pawls106a-cto pivot away from the deadband surface132a-ctoward the teeth185of the ratchet gear180and into the extended position. When in the extended position, the pawls106a-ccontact/engage the teeth185of the ratchet gear180so that pedaling torque applied to the freehub body assembly100is transferred to the hub shell assembly30via the pawls106a-cpressing against the teeth185of the ratchet gear180(which presses against the hub shell assembly30). In this extended position, the ratchet pawls106a-care positioned so that pawl driving surface168is pressing against ratchet tooth receiving face186. Engagement deadband angle/length A is shown as the free movement of the fingers144a-cof the pawl pusher140before the ratchet pawl106ais in complete contact with ratchet gear180. Indeed, because the key108is not inserted in the key slot138, the pawl pushers140must move the maximum deadband distance in order to cause the pawls106a-cto fully extend and/or engage the ratchet gear180.", "", "As described above, when transitioning from the extended position to the retracted position, as they move counterclockwise with respect to the gear180, the pawls106a-cslide against the sliding face188of the teeth185without engaging the teeth185thereby enabling the gear180to rotate clockwise independent of the freehub body assembly100. In contrast, when transitioning from the retracted position to the extended position, as they move clockwise with respect to the gear180, once the pawls106a-cpivot such that they are able to contact the gear180, the pawls106a-ccatch/engage with one of the receiving faces186of the teeth186thereby causing the gear180to rotate clockwise due to the force of the clockwise rotation of the freehub body assembly100.", "", "FIG.22is another section view of hub assembly1with the freehub body assembly100inserted (e.g. concentrically nested) within the toothed ratchet gear180according to some embodiments. In particular,FIG.22is substantially similar toFIG.21except that the deadband adjustment key108is inserted into the key slot138thereby reducing the deadband distance. As a result, as illustrated by the reduced length B, instead of moving the longer length/angle A as shown inFIG.21, the pawl pushers140only need to move the less than maximum deadband distance/angle B in order to cause the pawls106a-cto fully extend and/or engage the ratchet gear180. Thus, the hub assembly1provides the advantage of enabling the deadband distance to be adjusted and/or configured for silent freewheeling. In particular, the combination of the biasing element104causing the pawls106a-cto automatically retract into the retracted position and the one-way ratchet42and/or pusher140causing the pawls106a-cto extend when the assembly100is rotated in a drive direction (e.g. clockwise) enable the assembly to be customized to reduce pedal kickback and/or to a responsiveness level desired by the rider.", "", "In operation, as described above the hub1is able to operate in two modes. In the first mode, “freewheeling,” the hub1freewheels when the bicycle200is rolling forward and the pedal crank208remains stationary. The cranks208, chain212, cassette214and freehub body assembly100remain motionless relative to the bicycle frame204,206, while the rear wheel rotates forward. In the second mode, the hub1drives the bicycle200forward when the pedal cranks208are pedaled forward by the bicycle rider. The chainring209rotates and applies tension to the bicycle chain212, rotating the bicycle cassette214and freehub body assembly100, and the freehub body assembly100applies torque to the hub shell assembly30, rotating the wheel and driving the bicycle200forward. In this manner the rider propels the bicycle200forward by rotating the pedals.", "", "In further detail, as described above, the hub assembly1freewheels when the ratchet pawls106a-care in the retracted position towards the bearing assembly102, as depicted inFIG.19. Under freewheeling conditions, the hub shell assembly30rotates clockwise relative to the hub center axis6, while the freehub body assembly100remains stationary. The one-way clutch42is therefore also rotating clockwise relative to the pusher stem142. The one-way clutch42is able to be specified and installed such that it allows the pusher stem142to rotate freely in the drive (e.g. forward pedaling or clockwise direction), but locks and resists or stops rotation in the opposite direction (e.g. counter-clockwise direction). Thus, as the hub shell assembly30freewheels, the residual drag in the clutch42, which owing to the physics of any free-running clutch cannot be zero, is able to continuously rotate the pawl pusher140clockwise relative to the pawl pusher center axis147, which is nominally identical to the hub center axis6.", "", "During freewheeling, the biasing element104contacts the pawl pads164and presses the pawls106a-cinward towards the center of the hub100, allowing the ratchet gear180to rotate freely around the ratchet pawls106a-cwith no contact, and consequently no sound. In particular, as described above, the biasing element104is able to be sized such that it provides a constant inward force towards the hub center axis6on the pawl spring pads164throughout the entire free range of the pawls106a-cwithin the assembly1. This force may be controlled by sizing the resting diameter of the shape of the elongated body of the biasing element104, by choosing the strength/flexibility of the material of the biasing element104and/or the diameter of the body of the biasing element104.", "", "Depending on how the hub deadband distance has been configured, the pusher stop wall152is able to be pressed against either the freehub stop surface136or the deadband adjustment key block232(if the deadband adjustment key108is installed in the hub100). If the deadband adjustment key108is not installed, the parts of the hub will be resting in the configuration shown inFIG.20. If the deadband adjustment key108is installed, the parts will be resting in the configuration shown inFIG.19.", "", "The deadband of the hub1is developed as the rider transitions from coasting to moving the pedal cranks208and actively pedaling the bicycle200forward. As the pedal cranks208begin moving, the freehub bearing assembly102begins rotating clockwise relative to the hub center axis6, until the speed of the freehub bearing assembly102matches the rolling speed of the hub shell assembly30. Once these rotational velocities match, the pusher stem142is stationary relative to the one-way clutch42, and therefor as the one-way clutch42begins to develop a torque against the pusher stem142, and thus the pawl pusher140begins to rotates in the opposing direction (e.g. counter-clockwise) relative to the freehub bearing assembly102. As this rotation occurs, the pusher cam surface166of the pawls106a-cmoves towards and comes into contact with the pawl surface148of the pusher fingers144a-c. Once this happens the ratchet pawls106a-cbegin to pivot about the pawl cylinder160, such that the pawl tip radius170moves outward towards the ratchet gear180. Since the ratchet gear180may still be rotating relative to the freehub bearing assembly102, the pawl tip radius170contacts the ratchet gear180in a random location based on when the pedal stroke is started, the speed of the wheel, and other factors. Once this contact occurs, the pawl tip radius170slides over the ratchet tooth sliding face188until the pawl driving surface168contacts the ratchet tooth receiving face186. Once this contact occurs, torque is transferred from the freehub bearing assembly102to the hub shell assembly30via the ratchet pawls106a-cin compression against the teeth185.", "", "Once underway, the rider may cease pedaling to resume freewheeling. When torque is no longer applied to the freehub bearing assembly102, the ratchet gear180resumes (e.g. clockwise) rotation relative to the freehub bearing assembly102, and the ratchet pawl106is forced away from the ratchet ring180as the pawl tip radius170slides back down the ratchet tooth sliding face188(and/or due to the inward biasing force applied by the biasing element104). Simultaneously, the pawl pusher140is free to rotate (e.g. clockwise) with the hub shell assembly30, and is able to be helped along by the sliding contact between the pawl surface148of the pusher140and the pusher cam surface166of the pawls106a-c. Once the ratchet pawls106a-chave moved to the retracted position, the pawl pusher140continues rotating clockwise relative to the freehub bearing assembly102owing to the parasitic free-running drag between the pusher stem142and the one-way clutch42.", "", "FIG.23illustrates a method of providing a hub assembly1according to some embodiments. As shown inFIG.23, a toothed ratchet gear180is positioned within a ratchet gear bore38of the hub shell assembly30at the step2302. The ratchet gear180is able to be aligned within the bore38such that splines184slide into corresponding hub shell spine channels40thereby preventing rotation of the gear180within the bore38with respect to the hub shell assembly30. A freehub assembly100is provided at the step2304. The freehub assembly100is coupled with the hub shell assembly30at the step2306. In some embodiments, the coupling is able to comprise positioning an inner side of the pawl support member102is positioned the toothed ratchet gear180such that when the freehub assembly100is rotated in a first direction with respect to the hub shell assembly30, the plurality of pawls106are able to pivot away from the pawl support member102(e.g. away from the deadband surface and/or the deadband recesses132) until the plurality of pawls106engage teeth185of the toothed ratchet gear180causing the hub shell assembly30to rotate with the freehub assembly100in the first direction. In some embodiments, the method further comprises selectively inserting or removing a deadband adjustment key108within a deadband adjustment key slot138and/or selecting a deadband adjustment key108having a block232of a desired size. In particular, the method is able to comprise sliding trunk234of the deadband adjustment key108into the key slot138such that the block232of the deadband adjustment key108extends into the one of the deadband recesses132adjacent to one of the stop walls136. Thus, when the freehub assembly100rotates with respect to the hub shell assembly30in a second direction, each of the pushing fingers144slide along the deadband surface until one of the pushing fingers144abuts the block232of the deadband adjustment key108(thereby reducing the size of the deadband within the hub assembly1).", "", "As a result, the method provides the advantage of providing a hub assembly having pawls106biased away from the ratchet gear180thereby ensuring a non-zero deadband length (regardless of the relative position of the pawls106and the teeth185) and/or a silent hub assembly. Further, the method provides the advantage of enabling adjustment of a deadband length/amount of the hub assembly via a deadband adjustment key (to reduce or adjust kickback and/or sound produced by the hub) as desired by the user.", "", "The system, method and device described herein has numerous advantages. In particular, the system, method and device provide the advantage of providing a hub assembly having pawls biased away from the ratchet gear thereby ensuring a non-zero deadband length (regardless of the relative position of the pawls and the teeth). Further, the system, method and device provides the advantage of enabling adjustment of a deadband length/amount of the hub assembly via a deadband adjustment key (to reduce or adjust kickback and/or sound produced by the hub) as desired by the user. Additionally, the system, method and device provide the advantage of enabling the deadband distance to be adjusted and/or configured for silent freewheeling.", "", "The present invention has been described in terms of specific embodiments incorporating details to facilitate the understanding of the principles of construction and operation of the invention. Such references, herein, to specific embodiments and details thereof are not intended to limit the scope of the claims appended hereto. It will be apparent to those skilled in the art that modifications can be made in the embodiments chosen for illustration without departing from the spirit and scope of the invention. For example, although the hub assembly1is described herein with respect to a bicycle wheel, it is understood that the assembly1, hub shell assembly30and/or the freehub assembly100are able to operate in the same manner and be incorporated into other vehicles or devices to provide a ratchet mechanism/function. Further, although the assembly1is described herein with respect to a rear wheel, it is understood that the assembly1, hub shell assembly30and/or the freehub assembly100are able to operate in the same manner and be incorporated into other wheels and/or non-wheels using axle/rotation based mechanisms the require a ratcheting function."], "claims": ["a bicycle wheel including a hub shell assembly, the hub shell assembly having a central aperture for receiving an axle, a ratchet gear bore and a toothed ratchet gear positioned within the ratchet gear bore; and a freehub assembly including an outer hub sprocket attachment feature, a pawl support member having a plurality of pawl pivot channels, a plurality of pawls pivotably coupled within the pivot channels, and a biasing member that applies a biasing force to the plurality of pawls that resists the pivoting of the plurality of pawls away from a deadband surface of the pawl support member; wherein the pawl support member is positioned within the toothed ratchet gear such that when the freehub assembly is rotated in a first direction with respect to the hub shell assembly, the plurality of pawls are able to pivot away from the pawl support member until the plurality of pawls engage teeth of the toothed ratchet gear causing the hub shell assembly to rotate with the freehub assembly in the first direction.", "2 . The system of claim 1 , wherein the biasing member is a spring that impedes the pivoting of the plurality of pawls away from the pawl support member.", "3 . The system of claim 2 , wherein each the plurality of pawls include a groove for receiving the biasing member.", "4 . The system of claim 1 , wherein when fully rotated toward the deadband surface, the plurality of pawls are unable to contact the teeth of the toothed ratchet gear.", "5 . The system of claim 1 , further comprising a pawl pusher having a plurality of pushing fingers positioned along the deadband surface of the pawl support member.", "6 . The system of claim 5 , wherein when the freehub assembly is rotated in the first direction with respect to the hub shell assembly, the pushing fingers slide along the deadband surface of the pawl support member and push against tips of the plurality of pawls and thereby forcing the plurality of pawls to pivot away from the deadband surface of the pawl support member.", "7 . The system of claim 6 , wherein the hub shell assembly further comprises a one-way clutch that is operatively coupled with the pawl pusher such that the clutch prevents rotation of the pushing fingers in the first direction with respect to the hub shell assembly and thereby causes the pushing fingers to slide along the deadband surface when the freehub assembly is rotated in the first direction with respect to the hub shell assembly.", "8 . The system of claim 5 , wherein the deadband surface extends between each of the pivot channels and a corresponding stop wall of a plurality of stop walls of the pawl support member thereby forming a plurality of deadband cavities adjacent to the deadband surface.", "9 . The system of claim 8 , wherein a different pair of one of the plurality of pawls and one of the plurality of pushing fingers is positioned at least partially within each of the deadband cavities when the plurality of pawls are fully rotated against the deadband surface.", "10 . The system of claim 9 , wherein when the freehub assembly rotates with respect to the hub shell assembly in a second direction opposite the first direction, each of the pushing fingers slides along the deadband surface until the pushing finger abuts one of the stop walls.", "11 . The system of claim 10 , wherein the freehub assembly further comprises a deadband adjustment key configured to selectively couple to a key slot of the pawl support member, the key slot positioned adjacent to one of the deadband recesses.", "12 . The system of claim 11 , wherein when coupled within the key slot, a block of the deadband adjustment key extends into the one of the deadband recesses adjacent to the stop wall such that when the freehub assembly rotates with respect to the hub shell assembly in the second direction, each of the pushing fingers slides along the deadband surface until one of the pushing fingers abuts the block of the deadband adjustment key.", "13 . The system of claim 1 , wherein the outer hub sprocket attachment feature is an outer cassette spline for coupling with one or more sprockets.", "a toothed ratchet gear having a plurality of teeth; and a freehub assembly including a pawl support member having a plurality of pawl pivot channels, a plurality of pawls pivotably coupled within the pivot channels, and a biasing member that applies a biasing force to the plurality of pawls that resists the pivoting of the plurality of pawls away from a deadband surface of the pawl support member; wherein the pawl support member is positioned within the toothed ratchet gear such that when the freehub assembly is rotated in a first direction with respect to the toothed ratchet gear, the plurality of pawls are able to pivot away from the pawl support member until the plurality of pawls engage the teeth of the toothed ratchet gear causing the toothed ratchet gear to rotate with the freehub assembly in the first direction.", "15 . The assembly of claim 14 , wherein the biasing member is a spring that impedes the pivoting of the plurality of pawls away from the pawl support member.", "16 . The assembly of claim 15 , wherein each the plurality of pawls include a groove for receiving the biasing member.", "17 . The assembly of claim 14 , wherein when fully rotated toward the deadband surface, the plurality of pawls are unable to contact the teeth of the toothed ratchet gear.", "18 . The assembly of claim 14 , further comprising a pawl pusher having a plurality of pushing fingers positioned along the deadband surface of the pawl support member.", "19 . The assembly of claim 18 , wherein when the freehub assembly is rotated in the first direction with respect to the toothed ratchet gear, the pushing fingers slide along the deadband surface of the pawl support member and push against tips of the plurality of pawls and thereby forcing the plurality of pawls to pivot away from the deadband surface of the pawl support member.", "20 . The assembly of claim 19 , further comprising a one-way clutch that is operatively coupled with the pawl pusher such that the clutch prevents rotation of the pushing fingers in the first direction with respect to the toothed ratchet gear and thereby causes the pushing fingers to slide along the deadband surface when the freehub assembly is rotated in the first direction with respect to the toothed ratchet gear.", "21 . The assembly of claim 18 , wherein the deadband surface extends between each of the pivot channels and a corresponding stop wall of a plurality of stop walls of the pawl support member thereby forming a plurality of deadband cavities adjacent to the deadband surface.", "22 . The assembly of claim 21 , wherein a different pair of one of the plurality of pawls and one of the plurality of pushing fingers is positioned at least partially within each of the deadband cavities when the plurality of pawls are fully rotated against the deadband surface.", "23 . The assembly of claim 22 , wherein when the freehub assembly rotates with respect to the toothed ratchet gear in a second direction opposite the first direction, each of the pushing fingers slides along the deadband surface until the pushing finger abuts one of the stop walls.", "24 . The assembly of claim 23 , wherein the freehub assembly further comprises a deadband adjustment key configured to selectively couple to a key slot of the pawl support member, the key slot positioned adjacent to one of the deadband recesses.", "25 . The assembly of claim 24 , wherein when coupled within the key slot, a block of the deadband adjustment key extends into the one of the deadband recesses adjacent to the stop wall such that when the freehub assembly rotates with respect to the toothed ratchet gear in the second direction, each of the pushing fingers slides along the deadband surface until one of the pushing fingers abuts the block of the deadband adjustment key.", "26 . The assembly of claim 14 , wherein the freehub assembly includes an outer hub sprocket attachment feature for coupling with one or more sprockets.", "providing a hub shell assembly including a toothed ratchet gear positioned within a ratchet gear bore, the hub shell assembly for coupling with a bicycle wheel rim via a plurality of spokes; and providing a freehub assembly including an outer hub sprocket attachment feature, a pawl support member having a plurality of pawl pivot channels, a plurality of pawls pivotably coupled within the pivot channels, and a biasing member that applies a biasing force to the plurality of pawls that resists the pivoting of the plurality of pawls away from a deadband surface of the pawl support member; and coupling the freehub assembly with the hub shell assembly such that the pawl support member is positioned within the toothed ratchet gear and when the freehub assembly is rotated in a first direction with respect to the hub shell assembly, the plurality of pawls are able to pivot away from the pawl support member until the plurality of pawls engage teeth of the toothed ratchet gear causing the hub shell assembly to rotate with the freehub assembly in the first direction.", "28 . The method of claim 27 , wherein the biasing member is a spring that impedes the pivoting of the plurality of pawls away from the pawl support member.", "29 . The method of claim 28 , wherein each the plurality of pawls include a groove for receiving the biasing member.", "30 . The method of claim 27 , wherein when fully rotated toward the deadband surface, the plurality of pawls are unable to contact the teeth of the toothed ratchet gear.", "31 . The method of claim 27 , wherein the freehub assembly further comprises a pawl pusher having a plurality of pushing fingers positioned along the deadband surface of the pawl support member.", "32 . The method of claim 31 , wherein when the freehub assembly is rotated in the first direction with respect to the hub shell assembly, the pushing fingers slide along the deadband surface of the pawl support member and push against tips of the plurality of pawls and thereby forcing the plurality of pawls to pivot away from the deadband surface of the pawl support member.", "33 . The method of claim 32 , wherein the hub shell assembly further comprises a one-way clutch that is operatively coupled with the pawl pusher such that the clutch prevents rotation of the pushing fingers in the first direction with respect to the hub shell assembly and thereby causes the pushing fingers to slide along the deadband surface when the freehub assembly is rotated in the first direction with respect to the hub shell assembly.", "34 . The method of claim 31 , wherein the deadband surface extends between each of the pivot channels and a corresponding stop wall of a plurality of stop walls of the pawl support member thereby forming a plurality of deadband cavities adjacent to the deadband surface.", "35 . The method of claim 34 , wherein a different pair of one of the plurality of pawls and one of the plurality of pushing fingers is positioned at least partially within each of the deadband cavities when the plurality of pawls are fully rotated against the deadband surface.", "36 . The method of claim 35 , wherein when the freehub assembly rotates with respect to the hub shell assembly in a second direction opposite the first direction, each of the pushing fingers slides along the deadband surface until the pushing finger abuts one of the stop walls.", "37 . The method of claim 36 , wherein the freehub assembly further comprises a deadband adjustment key configured to selectively couple to a key slot of the pawl support member, the key slot positioned adjacent to one of the deadband recesses.", "38 . The method of claim 37 , further comprising sliding the deadband adjustment key into the key slot such that a block of the deadband adjustment key extends into the one of the deadband recesses adjacent to the stop wall and when the freehub assembly rotates with respect to the hub shell assembly in the second direction, each of the pushing fingers slides along the deadband surface until one of the pushing fingers abuts the block of the deadband adjustment key.", "39 . The method of claim 27 , wherein the outer hub sprocket attachment feature is an outer cassette spline for coupling with one or more sprockets."], "bibtex": "@patent{20240157728,\n    title = {HUB SYSTEM, METHOD AND DEVICE WITH ADJUSTABLE DEADBAND},\n    number = {20240157728},\n    year = {2024},\n    note = {File: US20240157728A1-20240516.XML}\n    }", "classification": "B60B2704FI"}, {"title": "Wheel and Non-Pneumatic Tire Assembly", "doc_number": "20240157729", "filename": "US20240157729A1-20240516.XML", "abstract": "The present disclosure is directed to a non-pneumatic tire assembly having a sidewall portion made from a copolyether-ester. The non-pneumatic tire assembly comprises complementary annular inboard and outboard tire casing segments. Each segment comprises: a closed end and an open end, a peripheral band comprising exterior and interior surfaces, and an inner band comprising exterior and interior surfaces, the inner band being coaxially spaced radially inward from the interior surface of the peripheral band, wherein the closed end comprises a resilient and contiguous sidewall extending radially between the interior surface of the peripheral band and the exterior surface of the inner band, the sidewall comprising convex or concave exterior and interior surfaces, wherein the open end comprises a void defined by the interior surfaces of the peripheral band, the exterior surface of the inner band, and the sidewall; wherein the inner band interior surfaces of the inboard and outboard tire casing segments are configured to be disposed on an exterior rim surface of a wheel such that the open ends of each segment do not form a sealed void within the inboard and outboard segments; and wherein the annular inboard and outboard tire casing segments are each made from a composition comprising a copolyether-ester. The present disclosure is also directed to a wheel and non-pneumatic tire assembly.", "detailed_description": ["It is to be understood by one of ordinary skill in the art that the present discussion is a description of exemplary embodiments only and is not intended as limiting the broader aspects of the present disclosure.", "", "Generally speaking, the present disclosure is directed to a non-pneumatic tire assembly. The non-pneumatic tire assembly has a particular configuration wherein the annular inboard and outboard tire casing segments are each made from a composition comprising a copolyether-ester. The present inventors have discovered that a non-pneumatic tire assembly described in this application is an improvement over designs such as those shown inFIG.1in that when assembled it features a contiguous and resilient sidewall which provides improved mechanical stability and allows for an aesthetic look suitable for many vehicle applications.", "", "One embodiment of the non-pneumatic tire assembly comprises: complementary annular inboard and outboard tire casing segments, with each segment comprising: a closed end and an open end, a peripheral band comprising exterior and interior surfaces, and an inner band comprising exterior and interior surfaces, the inner band being coaxially spaced radially inward from the interior surface of the peripheral band. The closed end can comprise a resilient and contiguous sidewall extending radially between the interior surface of the peripheral band and the exterior surface of the inner band, the sidewall comprising convex or concave exterior and interior surfaces. The open end can comprise a void defined by the interior surfaces of the peripheral band, the inner band, and the sidewall. The inner band interior surfaces of the inboard and outboard tire casing segments can be configured to be disposed on an exterior rim surface of a wheel such that the open ends of each segment do not form a sealed void within the inboard and outboard segments. The annular inboard and outboard tire casing segments can each be made from a composition comprising a copolyether-ester.", "", "This application also generally describes a wheel and non-pneumatic tire assembly. In addition to the features described above, the wheel and non-pneumatic tire assembly can comprise a wheel or wheel assembly having an exterior rim surface. The inner band interior surface of the inboard and outboard tire casing segments can be disposed on the exterior rim surface of the wheel such that the open ends of each segment do not form a sealed void within the inboard and outboard segments. The non-pneumatic tire assembly and wheel and non-pneumatic tire assembly", "", "are suitable for most any vehicle. The term “vehicle” refers to any device that moves on wheels and transports people or freight or performs other functions. The vehicle may be self propelled or not. Non-limiting examples include automobiles, motorcycles, wheeled construction vehicles, all terrain vehicles (ATVs), trucks, trailers, bicycles, carriages, shopping carts, wheel barrows, and dollies.", "", "The non-pneumatic tire assembly of the present disclosure can be further described utilizingFIGS.2-10.", "", "As shown inFIG.2, an embodiment of the wheel and non-pneumatic tire assembly10comprises the wheel assembly12and non-pneumatic tire assembly14mounted thereon.FIG.3andFIG.4show the non-pneumatic tire assembly14having the annular inboard tire casing segment16which complements the annular outboard tire casing segment18. The inboard and outboard tire casing segments16and18have a closed end20and an opposing open end. The open end22can be seen in the view ofFIG.3, which shows the interior of the inboard tire casing segment16. The inboard and outboard tire casing segments16and18each comprise peripheral band24which has exterior surface26. Tire casing segments16and18have an interior surface28of the peripheral band24.", "", "The inboard and outboard tire casing segments16and18also comprise an inner band30which has interior surface32and exterior surface34. Inner band30is coaxially spaced radially inward from the interior surface28of peripheral band24. The closed end20comprises a resilient and contiguous sidewall36extending radially between the interior surface28of peripheral band24and the exterior surface34of inner band30. Unlike existing non-pneumatic tires, tire assembly24does not have a spoked configuration at the location of sidewall36, i.e., sidewall36is contiguous. The sidewall36is also resilient, meaning that under load it will deform and spring back to an open position as a vehicle having the tire assembly moves. The open end22comprises a void38defined by the interior surface28of peripheral band24, the exterior surface34of inner band30, and the sidewall36. The complementary inboard segment16and outboard segment18of tire assembly14are shown as they would come together for assembly inFIG.5.", "", "FIG.6shows an exploded view of an embodiment of the wheel and tire assembly50, which includes non-pneumatic tire assembly14and wheel assembly52. As described above, tire assembly14features a closed end20and an open end22. Each segment of the wheel assembly52has an exterior rim surface54. In assembly, the interior surface32of the inner bands are disposed on the exterior rim surface54of wheel assembly52in the manner shown in theFIG.6and ultimately held in place by an annular lip extending radially outward from the exterior rim surface54of wheel assembly52.", "", "FIG.7shows assembled wheel and tire assembly50having the inboard tire segment16and the outboard tire segment18disposed on the exterior rim surface of wheel assembly52. The exterior surface26of the inner and outer band is suitable for additional layers such as a tread layer or an intermediate shear band layer as described below. As depicted inFIG.7, the closed end20has a convex sidewall (protruding inward toward the center of wheel assembly52). Other embodiments can have a concave sidewall (protruding outward from the center of wheel assembly52). In an assembled configuration, wheel and tire assembly50include inboard tire segment16and outboard tire segment18disposed over the exterior rim surface of wheel assembly52such that the open ends of each segment do not form a sealed void within the inboard and outboard tire segment. Thus, the gap56between the two tire segments ensures that the tire assembly remains non-pneumatic, that is, air can diffuse in and out of gap56.", "", "FIG.8shows an exploded view of an embodiment of the wheel and tire assembly50which further features outer tread layer60and intermediate shear band layer62. As described above, each segment of the wheel assembly52receives complementary inboard tire segment16and outboard tire segment18at the interior surface32of each respective inner band and the exterior rim surface54. The inboard and outboard segments16and18have a closed end20and an open end22as described above. In one embodiment, the wheel and tire assembly50can further comprise a contiguous tread layer60extending radially outward from exterior surface26of the peripheral band of the inboard and outboard tire casing segments16and18. The contiguous tread layer60can be disposed directly on the exterior surface26of the peripheral band, e.g., through mechanical or chemical adhesion. Alternatively, the contiguous tread layer60can be disposed on an intermediate shear band layer62which is disposed on the exterior surface26of the inboard and outboard tire casing segments16and18. The tread layer60can be rubber or reinforced rubber. The shear band layer62can be a thermoplastic composite or a rubber or reinforced rubber that integrates with the tread layer60. The shear band layer may comprise a thermoplastic polymer or composite. Such layer may be an optionally reinforced polyester. Suitable materials, such as for the optionally reinforced polyester, for the shear band layer62include a polyethylene terephthalate or a polybutylene terephthalate.", "", "FIG.9shows a partial cross-sectional view of tire assembly14, which includes the peripheral band24, the inner band30, and sidewall36. As described above, the inboard and outboard tire segments do not abut in a flushed manner and instead are spaced apart by gap56. The exterior contiguous and resilient surface70of the sidewall36can be concave as shown or convex. The open end of each respective tire casing segment comprises a void38defined by the interior surface of the peripheral band24, the exterior surface of the inner band, and the interior surface72of the sidewall36. The tire assembly14is configured to be disposed on a wheel or wheel assembly at the interior surface32of the inner band30.", "", "FIG.10shows a partial cross-sectional view of the wheel and non-pneumatic tire assembly10, which features an outer tread layer60and intermediate shear band layer62. The wheel assembly52is shown as two complementary wheel segments coupled by a suitable mechanical fastener such as the nut and bolt fastener shown. It will be understood that the wheel assembly52can be coupled together with any suitable fastener or can be joined through chemical adhesion. The wheel assembly52can comprise an annular lip74which extends radially outward from the exterior rim surface. The annular lip74is useful for retaining the tire assembly on the exterior rim surface during use."], "claims": ["1 - 26 . (canceled)", "complementary annular inboard and outboard tire casing segments, each segment comprising: a closed end and an open end, a peripheral band comprising exterior and interior surfaces, and an inner band comprising exterior and interior surfaces, the inner band being coaxially spaced radially inward from the interior surface of the peripheral band, wherein the closed end comprises a resilient and contiguous sidewall extending radially between the interior surface of the peripheral band and the exterior surface of the inner band, the sidewall comprising convex or concave exterior and interior surfaces, wherein the open end comprises a void defined by the interior surfaces of the peripheral band, the exterior surface of the inner band, and the sidewall; wherein the inner band interior surfaces of the inboard and outboard tire casing segments are configured to be disposed on an exterior rim surface of a wheel such that the open ends of each segment do not form a sealed void within the inboard and outboard segments; and wherein the annular inboard and outboard tire casing segments are each made from a composition comprising a copolyether-ester.", "28 . The non-pneumatic tire assembly of claim 27 , wherein the copolyether-ester is prepared from (i) a monomer comprising poly(tetramethylene oxide) glycol, poly(trimethylene oxide) glycol, polypropylene oxide glycol, or any mixture thereof; (ii) a dicarboxylic acid selected from isophthalic acid, terephthalic acid, or any mixture thereof; and (iii) a diol selected from 1,4-butanediol, 1,3-propanediol, or any mixture thereof.", "29 . The non-pneumatic tire assembly of claim 27 , wherein the copolyether-ester is prepared from (i) a monomer comprising poly(tetramethylene oxide) glycol; (ii) isophthalic acid, terephthalic acid, or any mixture thereof; and (iii) a diol selected from 1,4- butanediol, 1,3-propanediol, or any mixture thereof.", "30 . The non-pneumatic tire assembly of claim 27 , wherein copolyether-ester is prepared from (i) a monomer comprising poly(tetramethylene oxide) glycol; (ii) a mixture of terephthalic acid and isophthalic acid, and (iii) 1,4-butanediol; or wherein the copolyether-ester is prepared from (i) a monomer comprising poly(tetramethylene oxide) glycol; (ii) terephthalic acid, and (iii) 1,4-butanediol.", "31 . The non-pneumatic tire assembly of claim 27 , further comprising a contiguous tread layer extending radially outward from the peripheral band exterior surfaces of the inboard and outboard tire casing segments.", "32 . The non-pneumatic tire assembly of claim 31 , wherein the tread layer is disposed directly on the peripheral band exterior surfaces of the inboard and outboard tire casing segments.", "33 . The non-pneumatic tire assembly of claim 31 , wherein the tread layer comprises rubber.", "34 . The non-pneumatic tire assembly of claim 31 , further comprising a shear band layer between the tread layer and the peripheral band exterior surfaces of the inboard and outboard tire casing segments.", "35 . The non-pneumatic tire assembly of claim 34 , wherein the shear band layer comprises a thermoplastic polymer, or a reinforced rubber that is integral with the tread layer.", "36 . The non-pneumatic tire assembly of claim 35 , wherein the thermoplastic polymer is an optionally reinforced polyester.", "complementary annular inboard and outboard tire casing segments, each segment comprising: a closed end and an open end, a peripheral band comprising exterior and interior surfaces, and an inner band comprising exterior and interior surfaces, the inner band being coaxially spaced radially inward from the interior surface of the peripheral band, wherein the closed end comprises a resilient and contiguous sidewall extending radially between the interior surface of the peripheral band and the exterior surface of the inner band, the sidewall comprising convex or concave exterior and interior surfaces, wherein the open end comprises a void defined by the interior surfaces of the peripheral band, the inner band, and the sidewall; and a wheel or wheel assembly having an exterior rim surface; wherein the inner band interior surface of the inboard and outboard tire casing segments are disposed on the exterior rim surface of the wheel such that the open ends of each segment do not form a sealed void within the inboard and outboard segments; and wherein the annular inboard and outboard tire casing segments are each made from a composition comprising a copolyether-ester.", "38 . The wheel and non-pneumatic tire assembly of claim 37 , wherein the copolyether-ester is prepared from (i) a monomer comprising poly(tetramethylene oxide) glycol, poly(trimethylene oxide) glycol, polypropylene oxide glycol, or any mixture thereof; (ii) a dicarboxylic acid selected from isophthalic acid, terephthalic acid, or any mixture thereof; and (iii) a diol selected from 1,4-butanediol, 1,3-propanediol, or any mixture thereof.", "39 . The wheel and non-pneumatic tire assembly of claim 37 , wherein the copolyether-ester is prepared from (i) a monomer comprising poly(tetramethylene oxide) glycol; (ii) isophthalic acid, terephthalic acid, or any mixture thereof; and (iii) a diol selected from 1,4-butanediol, 1,3-propanediol, or any mixture thereof.", "40 . The wheel and non-pneumatic tire assembly of claim 37 , wherein copolyether-ester is prepared from (i) a monomer comprising poly(tetramethylene oxide) glycol; (ii) a mixture of terephthalic acid and isophthalic acid, and (iii) 1,4-butanediol; or wherein the copolyether-ester is prepared from (i) a monomer comprising poly(tetramethylene oxide) glycol; (ii) terephthalic acid, and (iii) 1,4-butanediol.", "41 . The wheel and non-pneumatic tire assembly of claim 37 , further comprising a contiguous tread layer extending radially outward from the peripheral band exterior surfaces of the inboard and outboard tire casing segments.", "42 . The wheel and non-pneumatic tire assembly of claim 41 , wherein the tread layer is disposed directly on the peripheral band exterior surfaces of the inboard and outboard tire casing segments.", "43 . The wheel and non-pneumatic tire assembly of claim 41 , wherein the tread layer comprises rubber.", "44 . The wheel and non-pneumatic tire assembly of claim 41 , further comprising a shear band layer between the tread layer and the peripheral band exterior surfaces of the inboard and outboard tire casing segments.", "45 . The wheel and non-pneumatic tire assembly of claim 44 , wherein the shear band layer comprises a thermoplastic polymer, or a reinforced rubber that is integral with the tread layer.", "46 . The wheel and non-pneumatic tire assembly of claim 37 , wherein the wheel or wheel assembly is formed from a polyester-based composition, a thermoplastic polyamide, or a copolyether-ester."], "bibtex": "@patent{20240157729,\n    title = {Wheel and Non-Pneumatic Tire Assembly},\n    number = {20240157729},\n    year = {2024},\n    note = {File: US20240157729A1-20240516.XML}\n    }", "classification": "B60C100FI"}, {"title": "TIRE CORD", "doc_number": "20240157730", "filename": "US20240157730A1-20240516.XML", "abstract": "The present disclosure relates to a tire cord. The tire cord includes a polyester drawn yarn containing recycled polyethylene terephthalate. The tire cord may exhibit excellent physical properties industrially required while including eco-friendly materials.", "detailed_description": [""], "claims": ["wherein a tensile strength is 7.0 g/d to 8.0 g/d and an elongation at break is 15.0% to 17.5% when measured according to the standard test method of ASTM D 885.", "wherein the recycled polyethylene terephthalate has an isophthalic acid content of 0 mol % to 0.95 mol % based on the total dicarboxylic acid component in the recycled polyethylene terephthalate.", "wherein the tire cord has 88.5% or more of a strength ratio {=[(tensile strength of tire cord)/(tensile strength of polyester drawn yarn)]×100}.", "wherein the tire cord has an elongation at specific load of 3.5% to 5.0% when measured under a load of 4.5 g/d according to the standard test method of ASTM D 885.", "wherein the tire cord has a thermal shrinkage of 3.0% to 6.0% when measured according to the standard test method of ASTM D 885 (specimen length 250 mm, 177° C., 2 minutes, load of 0.01 g/d).", "wherein the tire cord comprises a raw-cord having a total fineness of 1000 denier to 9000 denier.", "wherein the polyester drawn yarn comprises 30 wt % to 100 wt % of the recycled polyethylene terephthalate.", "wherein the polyester drawn yarn has a tensile strength of 8.0 g/d to 9.0 g/d and an elongation at break of 14.0% to 17.0%.", "wherein the polyester drawn yarn has a thermal shrinkage of 9.5% to 15.0% when measured according to the standard test method of ASTM D 885 (specimen length 250 mm, 177° C., 2 minutes, load of 0.01 g/d).", "wherein the polyester drawn yarn has a total draw ratio of 1.0 to 3.0 times.", "wherein the tire cord is a 2-ply yarn comprising the polyester drawn yarn.", "12 . A tire comprising the tire cord of claim 1 ."], "bibtex": "@patent{20240157730,\n    title = {TIRE CORD},\n    number = {20240157730},\n    year = {2024},\n    note = {File: US20240157730A1-20240516.XML}\n    }", "classification": "B60C900FI"}, {"title": "REINFORCEMENT WIRE", "doc_number": "20240157731", "filename": "US20240157731A1-20240516.XML", "abstract": "A composite wire has a thermoplastic core component and a sheath. The sheath includes at least two groups of reinforcement threads wrapped around the core component. The at least two groups of reinforcement threads form angles with the core component, with the overall sum of all angles which are essentially zero.", "detailed_description": [""], "claims": ["1 . A composite wire comprising a thermoplastic monofilament as a core component and a sheath, the sheath comprises at least two groups of reinforcement threads (wrapped around the core component wherein the at least two groups of reinforcement threads form angles with the core component with the overall sum of all angles being substantially zero.", "2 . The composite wire of claim 1 , wherein the core component has a thickness of at least 0.3 and at most 1.2 mm.", "3 . The composite wire of claim 1 , wherein the core component comprises a nucleating agent, the nucleating agent being talc or a similar inorganic filler, sodium benzoate, sodium stearate, sodium-ion ionomers, a sulfonamide compound metal salt or a sulfonimide compound metal salt, mono sodium salt of dicarboxylic acid, or any mixture thereof.", "4 . The composite wire of claim 1 , wherein at least two groups of reinforcement threads are wrapped around the core component.", "5 . The composite wire of claim 1 , wherein at least two groups of reinforcement threads are wound around the core component and/or at least two groups of reinforcement threads are braided around the core component.", "6 . The composite wire of claim 1 , wherein the core component forms an angle of at least ±15 degrees with every group of reinforcement threads.", "7 . The composite wire of claim 1 , wherein the core component comprises reinforcement fibers.", "8 . The composite wire of claim 1 , wherein the reinforcement fibers are comprised in the core component as at least one fiber bundle, yarn or cord.", "9 . The composite wire of claim 7 , wherein the reinforcement fibers in the core component comprise a monofilament.", "10 . The composite wire of claim 7 , wherein the reinforcement fibers comprise glass, carbon fibers, steel wire, aluminum wire, polyethylene terephthalate, polyethylene naphthalate, polyvinyl acetate, cellulose filaments, polyvinyl alcohol, polyvinyl acetate, polyamide-5, polyamide-6, polyamide-5,6, polyamide-5,10, polyamide-6,6, polyamide-4,10, polyamide-6,10, polyamide-6,8, polyamide or polyamide-11, proteinous fibers, aromatic polyamides, polyphenylene benzobisoxazole, ultra high molecular weight polyethylene or aromatic polyesters or copolymers comprising monomers of said materials or mixtures of said materials.", "11 . The composite wire of claim 10 , wherein the materials comprised in the reinforcement fibers are in part or in total biological and/or recycled materials.", "12 . The composite wire of claim 1 , wherein the core component comprises polyethylene terephthalate, polytrimethylen terephthalate, polybutylene terephthalate, polyethylene naphthalate aromatic polyesters, aromatic polyamides comprising para-polyphenylene terephthalamide or meta polyphenylene isophthalamide, polyvinyl alcohol, polyvinyl acetate, polyphenylene benzobisoxazole, polyamide-5, polyamide-6, polyamide-6,6, polyamide-5,6, polyamide-4,10, polyamide-6,10, polyamide-6,8, polyamide or polyamide-11, ultra high molecular weight polyethylene, polyurethane or polyetheretherketone, copolymers comprising monomers of said materials or mixtures of said materials.", "13 . The composite wire of claim 12 , wherein the materials comprised in the core component are in part or in total biological and/or recycled materials.", "14 . The composite wire of claim 1 , wherein the reinforcement threads comprise glass, carbon fibers, steel wire, aluminum wire, polyethylene terephthalate, polyethylene naphthalate, polyvinyl acetate, cellulose filaments, polyvinyl alcohol, polyvinyl acetate, polyamide-5, polyamide-6, polyamide-5,6, polyamide-5,10, polyamide-6,6, polyamide-4,10, polyamide-6,10, polyamide-6,8, polyamide or polyamide-11, proteinous fibers, aromatic polyamides, polyphenylene benzobisoxazole, ultra high molecular weight polyethylene or aromatic polyesters or copolymers comprising monomers of said materials or mixtures of said materials.", "15 . The composite wire of claim 14 , wherein the materials comprised in the reinforcement threads are in part or in total biological and/or recycled materials.", "16 . A reinforcement belt for a pneumatic vehicle tire comprising at least one composite wire of claim 1 .", "17 . A bead reinforcement for a pneumatic car tire comprising at least one composite wire of claim 1 .", "18 . A reinforcement body for a pneumatic vehicle tire comprising at least one composite wire of claim 1 .", "19 . A cap-ply for a pneumatic vehicle tire comprising at least one composite wire of claim 1 .", "20 . A pneumatic vehicle tire comprising at least one composite wire of claim 1 .", "21 . A tire of claim 20 , comprising a bead chafer or bead flipper reinforcement element comprising at least one string with embedded reinforcement fibers.", "22 . A thermoplastic string comprising a thermoplastic monofilament with embedded reinforcement fibers."], "bibtex": "@patent{20240157731,\n    title = {REINFORCEMENT WIRE},\n    number = {20240157731},\n    year = {2024},\n    note = {File: US20240157731A1-20240516.XML}\n    }", "classification": "B60C900FI"}, {"title": "MOTORCYCLE TIRE", "doc_number": "20240157732", "filename": "US20240157732A1-20240516.XML", "abstract": "A motorcycle tire includes a tread portion between a pair of tread edges. The tread portion includes a tread rubber forming a tread surface. The tread rubber includes a first rubber layer comprising a first rubber and forming the tread surface, and a second rubber layer comprising a second rubber and being adjacent inwardly in a tire radial direction of the first rubber layer. A loss tangent tan δa of the first rubber at 100 degrees C. is smaller than a loss tangent tan δb of the second rubber at 100 degrees C. A glass transition temperature of the first rubber is lower than a glass transition temperature of the second rubber.", "detailed_description": ["Hereinafter, one or more embodiments of the present disclosure will be described in detail based on the drawings.", "", "FIG.1is a meridian cross-sectional view of a motorcycle tire (hereinafter referred to simply as “tire”)1according to an embodiment of the present disclosure. The cross-sectional view is a cross-section of the tire1including the tire rotation axis (not illustrated) under its normal state. The tire1according to the present disclosure is suitable, for example, for racing on a circuit. Such a tire1may be designed to have a smaller driving range than ordinary tires. However, the tire1of the present disclosure is not limited to such racing tires.", "", "As used herein, the “normal state” is such that the tire1is mounted onto a standard wheel rim (not illustrated) with a standard pressure but loaded with no tire load. As used herein, unless otherwise noted, dimensions of portions of the tire are values measured under the normal state.", "", "As used herein, the “standard wheel rim” is a wheel rim officially approved for each tire by the standard organization on which the tire is based, wherein the standard wheel rim is the “standard rim” specified in JATMA, the “Design Rim” in TRA, and the “Measuring Rim” in ETRTO, for example.", "", "As used herein, the “standard pressure” is a standard pressure officially approved for each tire by the standard organization on which the tire is based, wherein the standard pressure is the “maximum air pressure” in JATMA, the maximum pressure given in the “Tire Load Limits at Various Cold Inflation Pressures” table in TRA, and the “Inflation Pressure” in ETRTO, for example.", "", "As illustrated inFIG.1, the tire1according to the present embodiment includes a tread portion2between a pair of tread edges Te and Te. For example, the tread surface2a, which is the outer surface of the tread portion2, extends between the pair of tread edges Te in a curved manner that protrudes outwardly in the tire radial direction. Such a tire1can turn with large camber angles.", "", "As used herein, the tread edges Te are the outer edges in the tire axial direction of the tread surface2athat come into contact with the ground when the camber angle is maximized. The length measured along the tread surface2abetween the tread edges Te, Te is the tread development width TWe. The axial center between the two tread ends Te and Te is the tire equator C.", "", "The tread portion2includes a tread rubber G forming the tread surface2a. The tread rubber G includes a first rubber layer11made of a first rubber G1and forming the tread surface2a, and a second rubber layer12made of a second rubber G2and being adjacent inwardly in the tire radial direction of the first rubber layer11.", "", "A loss tangent tan δa of the first rubber G1at 100 degrees C. is smaller than a loss tangent tan δb of the second rubber G2at 100 degrees C. Thus, the second rubber G2has large hysteresis loss and basic grip performance. In addition, the first rubber G1has a smaller heat generation rate and thus can reduce the wear. If the loss tangent tan δa is excessively smaller than the loss tangent tan δb, the grip of the first rubber G1which comes into contact with the ground may deteriorate excessively. Accordingly, the difference (tan δb−tan δa) between the loss tangent tan δb and the loss tangent tan δa is preferably equal to or more than 0.02, more preferably equal to or more than 0.04, but preferably equal to or less than 0.1, more preferably equal to or less than 0.08. In addition, the loss tangent tan δa is preferably equal to or more than 0.15, more preferably equal to or more than 0.20, but preferably equal to or less than 0.35, more preferably equal to or less than 0.30.", "", "As used herein, a loss tangent tan δ and the complex elastic modulus E* of rubber are the values measured by a viscoelasticity spectrometer under the conditions shown below, in accordance with JISK6394 “Vulcanized and thermoplastic rubbers—Determination of dynamic properties—General guidelines”.Initial distortion: plus/minus 10%Amplitude: plus/minus 2%Frequency: 10 HzDeformation mode: tensileTemperature: 100 degrees C.Viscoelasticity spectrometer: GABO's Iplexar (registered trademark)", "", "A glass transition temperature Tga of the first rubber G1is lower than a glass transition temperature Tgb of the second rubber G2. This can keep the first rubber layer11, which is in direct contact with the ground, soft and thus provides high grip performance when the tire temperature is relatively low, such as in the early stage of driving. Therefore, the motorcycle tires of the present disclosure can exhibit even better grip performance. If the glass transition temperature Tga is excessively smaller than the glass transition temperature Tgb, wear (abrasion, etc.) may occur earlier in the first rubber G1, and the wear appearance performance may deteriorate. From this point of view, the difference (Tgb−Tga) between the glass transition temperature Tgb and the glass transition temperature Tga is preferably equal to or more than 3 degrees C., more preferably equal to or more than 7 degrees C., but preferably equal to or less than 30 degrees C., more preferably equal to or less than 20 degrees C. In addition, the glass transition temperature Tga of the first rubber G1is preferably equal to or more than −10 degrees C., more preferably equal to or more than 5 degrees C., but preferably equal to or less than 30 degrees C., more preferably equal to or less than 20 degrees C. Thus, the tire1according to the present embodiment can improve both grip performance and wear appearance performance.", "", "As used herein, the glass transition temperature of rubber was measured with a differential scanning calorimeter (Q200) manufactured by T.A. Instruments Japan, Inc. at a temperature increase rate of 10 degrees C./min in accordance with JIS-K7121.", "", "In the present embodiment, the tread portion2includes a carcass6and a belt layer7adjacent to the carcass6outwardly in the tire radial direction. The belt layer7is adjacent to the tread rubber G inwardly in the radial direction of the tire. In the present embodiment, carcass6and belt layer7are conventionally structured.", "", "The tread rubber G further includes a third rubber layer13made of a third rubber G3disposed inwardly of the second rubber layer12in the tire radial direction. The third rubber layer13, in the present embodiment, is located innermost side of the tread rubber G in the tire radial direction. The third rubber layer13, for example, is adjacent to the belt layer7in the tire radial direction. The tread rubber G, for example, may include a fourth rubber layer (not illustrated) disposed inwardly of the third rubber layer13in the tire radial direction.", "", "Preferably, a 300% modulus M300aof the first rubber G1is greater than a 300% modulus M300bof the second rubber G2. The first rubber layer11forms the tread surface2a. Thus, such a first rubber G1can reduce abrasion on the tread surface2aand can maintain a large ground contact area, which further enhances the grip performance. If the 300% modulus M300ais excessively larger than the 300% modulus M300b, the grip performance may deteriorate. Thus, the difference (M300a−M300b) between the 300% modulus M300aand the 300% modulus M300bis preferably equal to or more than 1.0 MPa, more preferably equal to or more than 1.5 MPa, but preferably equal to or less than 6.0 MPa, more preferably equal to or less than 5.5 MPa. The 300% modulus M300ais preferably equal to or more than 3.0 MPa, more preferably equal to or more than 4.0 MPa, but preferably equal to or less than 7.0 MPa, more preferably equal to or less than 6.0 MPa. As used herein, a 300% modulus of rubber is the modulus at 300% elongation, measured at 30 degrees C. in accordance with JISK6251 “Vulcanized rubbers and thermoplastic rubbers—Determination of tensile properties”. The rubber with relatively large loss tangent tan δ at 100 degrees C. tends to have relatively small 300% modulus M300, and the rubber with relatively small loss tangent tan δ at 100 degrees C. tends to have relatively large 300% modulus M300.", "", "A complex elastic modulus E*a of the first rubber G1is greater than a complex elastic modulus E*b of the second rubber G2. Such a first rubber G1can reduce the deterioration of the tread surface2aand can improve the grip performance and handling performance. If the complex elastic modulus E*a is excessively larger than the complex elastic modulus E*b, the second rubber G2may be easily deformed, and the grip performance may be deteriorated instead. From this point of view, the difference (E*a−E*b) between the complex elastic modulus E*a and the complex elastic modulus E*b is preferably equal to or more than 0.1 MPa, more preferably equal to or more than 0.2 MPa, but preferably equal to or less than 1.0 MPa, more preferably equal to or less than 0.8 MPa. Furthermore, the complex elastic modulus E*a of the first rubber G1is preferably equal to or more than 1.0 MPa, more preferably equal to or more than 1.5 MPa, but preferably equal to or less than 3.0 MPa, more preferably equal to or less than 2.5 MPa.", "", "The second rubber layer12made of the second rubber G2, for example, is required to improve the grip performance from the beginning to the end of driving. On the other hand, the first rubber layer11made of the first rubber G1, for example, is required to improve wear appearance performance by reducing abrasion, while improving grip performance in relatively low tire temperature conditions such as in the early stage of driving. For this reason, the thickness d2of the second rubber layer12is preferably equal to or greater than the thickness d1of the first rubber layer11.", "", "In the present embodiment, the thickness d1of the first rubber layer11is the same as the thickness d2of the second rubber layer12. Such a tire1can suppress abrasion for a relatively long period of time, making it suitable, for example, for the tire1for the final races with larger mileage than the qualifying race. The above-mentioned “same” means that the difference (d1−d2) between the thickness d1of the first rubber layer11and the thickness d2of the second rubber layer12is not only 0 mm but also less than 1.0 mm. In the present embodiment, the thickness d1of the first rubber layer11and the thickness d2of the second rubber layer12are preferably equal to or more than 2.0 mm, more preferably equal to or more than 2.5 mm, but preferably equal to or less than 5.0 mm, more preferably equal to or less than 4.5 mm.", "", "An amount AEc of oil contained in the third rubber G3is smaller than an amount AEb of oil contained in the second rubber G2. This can prevent the oil of the third rubber G3from migrating to the belt layer7, and the oil of the second rubber G2is stopped by the third rubber G3, thus preventing damage to the belt cords (not shown) in the belt layer7. As a result, the grip performance can be maintained at a high level. Although not particularly limited, the amount AEc of oil of the third rubber G3is preferably equal to or more than 0.15 times the amount AEb of oil of the second rubber G2, more preferably equal to or more than 0.2 times, but preferably equal to or less than 0.45 times, more preferably equal to or less than 0.40 times. As used herein, the oil content (%) is the percentage of the mass of oil contained in the rubber composition to the mass of the rubber composition.", "", "The loss tangent tan δc of the third rubber G3at 100 degrees C. is preferably equal to or more than 0.05, more preferably equal to or more than 0.07, but preferably equal to or less than 0.20, more preferably equal to or less than 0.25. In addition, the glass transition temperature Tgc of the third rubber G3is preferably equal to or higher than −20 degrees C., more preferably equal to or higher than −15 degrees C., but preferably equal to or lower than 5 degrees C., more preferably equal to or lower than 0 degrees C. Further, the 300% modulus M300cof the third rubber G3is preferably equal to or more than 2.0 MPa, more preferably equal to or more than 2.5 MPa, but preferably equal to or less than 4.0 MPa, more preferably equal to or less than 3.5 MPa. Furthermore, the complex elastic modulus E*c of the third rubber G3is preferably equal to or more than 1.0 MPa, more preferably equal to or more than 1.5 MPa, but preferably equal to or less than 3.0 MPa, more preferably equal to or less than 2.5 MPa. For example, a thickness d3of the third rubber layer13is preferably equal to or more than 0.3 mm, more preferably equal to or more than 0.5 mm, but preferably equal to or less than 1.0 mm, more preferably equal to or less than 0.8 mm. The first rubber G1, the second rubber G2and the third rubber G3can be produced by using known rubber materials.", "", "For example, the first rubber layer11, the second rubber layer12and the third rubber layer13extend in the tire axial direction centered at the tire equator C. In the present embodiment, the first rubber layer11, the second rubber layer12and the third rubber layer13each have a developed length along the tread surface2athat is at least 80% of the tread developed width TWe. This enables the above-mentioned effects to be achieved in both straight running and turning. The developed length of each lubber layer is preferably equal to or more than 90% of the tread developed width TWe, more preferably equal to or more than 95%. In the present embodiment, the first rubber layer11extends from one of the tread edge Te to the other one of the tread edge Te. For example, the third rubber layer13has axially outer edges13ewhich are located outwardly in the tire axial direction of the belt layer7.", "", "FIG.2is a meridian cross-sectional view of the tire1according to another embodiment. In this embodiment, the same elements as in the previous embodiment are denoted by the same reference signs and the description may be omitted. As illustrated inFIG.2, in this embodiment, the tread rubber G includes a rubber layer10A having the largest rubber thickness and a rubber layer10B having the smallest rubber thickness.", "", "In this embodiment, the rubber layer10A with the largest rubber thickness is the second rubber layer12. This makes the second rubber G2more effective in improving the grip performance. If the thickness dm of the rubber layer10A is excessively large, smooth turning may be difficult and handling performance may deteriorate. In addition, the mass of the tire1becomes large, making it unsuitable for racing. Thus, the thickness dm of the rubber layer10A is preferably equal to or more than 3 mm, more preferably equal to or more than 4 mm, but preferably equal to or less than 8 mm, more preferably equal to or less than 7 mm.", "", "In this embodiment, the rubber layer10B with the minimum rubber thickness is the first rubber layer11. Such a first rubber layer11is suitable for the tire1for qualifying races with relatively small mileage, because the abrasion suppression effect may be smaller. Although not particularly limited, considering the distance driving in the qualifying rounds of the race, the thickness do of the rubber layer10B is preferably equal to or more than 0.3 mm, more preferably equal to or more than 0.5 mm, but preferably equal to or less than 1 mm, more preferably equal to or less than 0.8 mm. For example, the rubber layer10B with the minimum rubber thickness may be the first rubber layer11and the third rubber layer13.", "", "Although particularly preferred embodiments of the present disclosure have been described in detail, the present disclosure is not limited to the above-described embodiments and may be embodied in various aspects."], "claims": ["a tread portion between a pair of tread edges, wherein the tread portion comprises a tread rubber forming a tread surface, the tread rubber comprises a first rubber layer comprising a first rubber and forming the tread surface, and a second rubber layer comprising a second rubber and being adjacent inwardly in a tire radial direction of the first rubber layer, a loss tangent tan δa of the first rubber at 100 degrees C. is smaller than a loss tangent tan δb of the second rubber at 100 degrees C., and a glass transition temperature Tga of the first rubber is lower than a glass transition temperature Tgb of the second rubber.", "a 300% modulus M", "a complex elastic modulus E*a of the first rubber is greater than a complex elastic modulus E*b of the second rubber.", "a thickness of the second rubber layer is equal to or greater than a thickness of the first rubber layer.", "the tread rubber further comprises a third rubber layer comprising a third rubber located inwardly in the radial direction of the second rubber layer, the third rubber layer is located at the most inner radial side of the tread rubber, and an amount of oil contained in the third rubber is smaller than an amount of oil contained in the second rubber.", "in the tread rubber, a thickness of the rubber layer with the maximum rubber thickness is 3 to 8 mm.", "the rubber layer with the maximum rubber thickness is the second rubber layer.", "in the tread rubber, a thickness of the rubber layer with the minimum rubber thickness is 0.3 to 1 mm.", "the rubber layer with the minimum rubber thickness is the first rubber layer.", "the difference (tan δb−tan δa) between the loss tangent tan δb and the loss tangent tan δa is equal to or more than 0.02.", "the difference (tan δb−tan δa) between the loss tangent tan δb and the loss tangent tan δa is equal to or less than 0.1.", "the loss tangent tan δa is in a range from 0.15 to 0.35.", "the loss tangent tan δa is in a range from 0.15 to 0.35.", "the difference (Tgb−Tga) between the glass transition temperature Tgb and the glass transition temperature Tga is equal to or more than 3 degrees C.", "the difference (Tgb−Tga) between the glass transition temperature Tgb and the glass transition temperature Tga is equal to or less than 30 degrees C.", "the difference (Tgb−Tga) between the glass transition temperature Tgb and the glass transition temperature Tga is in a range from 3 to 30 degrees C.", "the glass transition temperature Tga of the first rubber is in a range from −10 to 30 degrees C.", "the difference (M", "the 300% modulus M", "the difference (E*a−E*b) between the complex elastic modulus E*a and the complex elastic modulus E*b is in a range from 0.1 to 1.0 MPa."], "bibtex": "@patent{20240157732,\n    title = {MOTORCYCLE TIRE},\n    number = {20240157732},\n    year = {2024},\n    note = {File: US20240157732A1-20240516.XML}\n    }", "classification": "B60C1100FI"}]