[{"title": "Structure Staggered Wheels", "doc_number": "20240066913", "filename": "US20240066913A1-20240229.XML", "abstract": "This embodiment of the present invention provides for a structure staggered set of four car wheels which achieves greater physical performance of the wheels of one axle by integrating additional structures. These structures would mainly be added to the face of the two wheels of a given axle. Further the structures may be added without largely departing from the stylistic arrangement of spokes found on the two wheels of another axle.", "detailed_description": ["With reference to the drawings shown inFIGS.1to4, the following description regards various example structures, systems, and methods. The systems, structures and methods illustrated comprise aspects of the invention which may be practiced. It is to be understood that other specific arrangements of parts, structures, examples, systems, and the like, may be utilized and structural and functional modifications may be made without departing from the scope of embodiments of the present invention. With reference to the drawings, and wherein the improvement comprises the methodical addition of stylized structural forms to the face of the wheels of either the front or rear axles independently so as to strengthen the said wheels of a given axle without greatly departing from the style of the full set of four wheels.", "", "The embodiment of the present invention as comparatively illustrated inFIG.1generally illustrates an example front-axle automobile wheel2. The front-axle automobile wheel2is one of a complete four-wheel-set having the other front-axle wheel comprised of the same number and mass of stylized structural forms. The two rear-axle wheels of this complete four-wheel-set are illustrated as rear-axle wheel6withinFIG.2. The front-axle wheel2illustrated has less physical stresses demanded and has a thin barrel width3as would be found on the front-axle wheels of a traditional four-wheel-set. The front-axle wheel2ofFIG.1illustrates an exemplary and arbitrary style on the wheel face5comprising exemplary spokes1of a given shape, size and style.", "", "FIG.2illustrates an exemplary rear-axle wheel6of a matching overall style face5to that ofFIG.1. Together, the front-axle wheel2ofFIG.1and the rear-axle wheel ofFIG.2would comprise example front-axle and rear-axle wheels of a full set of four wheels for a single car with an overall style commonality. The rear wheel6has a wider barrel3so as to put more tire and force onto the road when in use on the exemplary rear-wheel-drive car. Having only a wider rear wheel width is a traditional staggered arrangement. Given the additional torsional forces and lateral forces of the rear wheels, the spokes1would be under increased stress relative to that of the front wheel2ofFIG.1. As such an embodiment of the present invention comprises a plurality of additional stylized structural forms4to compensate for the increased forces and thus increase performance. The additional plurality of stylized structural forms4in this example, comprise solid spokes on the wheel face5which are also cohesive with the overall wheel style of the front-axle wheel2illustrated inFIG.1.", "", "Given the present invention is additionally applicable to an infinite variety of wheel face5styles,FIG.3andFIG.4illustrate an embodiment of the present invention as it may relate to a distinctly different exemplary vehicle wheel face5style. Together, the front-axle wheel7ofFIG.3and the rear-axle wheel8ofFIG.4correspond to a complete four-wheel-set for a single car having matching wheels for the opposing end of a given axle. The embodiment of the present invention as comparatively illustrated inFIG.3generally illustrates an example front-axle automobile wheel7. The front-axle wheel illustrated has less physical stresses demanded than the rear-axle wheel8illustrated inFIG.4and thus has a thin barrel width3. The front-axle wheel7ofFIG.3illustrates an additional exemplary and arbitrary style for the wheel face5comprising exemplary spokes1of a given shape, size and style.", "", "FIG.4illustrates an exemplary rear-axle wheel8having a matching general style face5to that of front-axle wheel inFIG.3. Together, the front-axle wheel7ofFIG.3and the rear-axle wheel8ofFIG.4would comprise example front and rear wheels of a full set of four wheels for a single car with a related style commonality. The rear wheel8has a wider barrel3so as to put more tire and force onto the road when in use on the exemplary rear-wheel-drive car. Having only a wider rear-axle wheel width is a normal staggered arrangement. Given the additional torsional and lateral forces of the rear-axle wheels8, the spokes1would be under increased stress relative to that of the front-axle wheel7ofFIG.3. As such an embodiment of the present invention comprises a plurality of additional stylized structural forms4to compensate for the increased forces and thus increase structural performance. The additional plurality of stylized structural forms4in this example, comprise solid spokes on the wheel face5which are also cohesive with the overall wheel style of the front-axle wheel7illustrated inFIG.3."], "claims": ["1 . A complete set of automotive wheels having the two wheels of a single axle comprising a plurality of additional stylized structural forms on the face such that the said wheels provide greater structural strength than the wheels on another axle.", "using computerized milling or mold-making technologies to add similar spokes adjacent to and/or connecting to the existing spokes of the wheels of the opposing axle to which less force is applied;"], "bibtex": "@patent{20240066913,\n    title = {Structure Staggered Wheels},\n    number = {20240066913},\n    year = {2024},\n    note = {File: US20240066913A1-20240229.XML}\n    }", "classification": "B60B100FI"}, {"title": "WHEEL PLATE ASSEMBLY AND METHOD FOR PRODUCING WHEEL PLATE INCLUDING COMPOSITE MATERIAL", "doc_number": "20240066914", "filename": "US20240066914A1-20240229.XML", "abstract": "A wheel plate assembly is used to solve the time-consuming problem in the conventional process for bonding a composite material to spokes of a wheel plate. The wheel plate assembly comprises a spoke portion, a connecting member, and a wheel plate body. The spoke portion is a thin shell member and defines an inner space therein. The connecting member is protrusively disposed on an outer side of the spoke portion. The wheel plate body includes a receiving space and at least one passage space intercommunicating with the receiving space. The receiving space and the at least one passage space together extend through the wheel plate body. The at least one passage space intercommunicates with the inner space.", "detailed_description": ["With reference toFIGS.1and2, a wheel plate assembly of a preferred embodiment according to the present invention comprises a spoke portion2, at least one connecting member3, and a wheel plate body4. The at least one connecting member3is connected to the wheel plate body4and the spoke portion2.", "", "The spoke portion2is a thin shell member and defines an inner space S1therein (seeFIG.4). Specifically, in an embodiment, the spoke portion2may include an upper-half casing21and a lower-half casing22. The upper-half casing21includes a first through-hole21H extending in an axial direction. The upper-half casing21further includes a plurality of first extension portions21E each extending outward in a radial direction perpendicular to the axial direction. The upper-half casing21includes a plurality of first engaging portions21C on an outer surface thereof opposite to the inner space S1. In an embodiment, each first engaging portion21C is recessed in the outer surface of the upper-half casing21to form an engaging groove and is preferably disposed in a location adjacent to a distal end of an associated first extension portion21E. In an embodiment, the upper-half casing21may be a thin shell member and includes an outer wall portion extending in the axial direction (such as the downwardly extending outer wall portion shown inFIG.1).", "", "The lower-half casing22is coupled with the upper-half casing21to define the inner space S1. Specifically, at least one of the upper-half casing21and the lower-half casing22includes an inner side which is recessed, such that when the lower-half casing22is coupled with the upper-half casing21, the recession forms the inner space S1. The first through-hole21H intercommunicates with the inner space S1. The lower-half casing22includes a plurality of second extension portions22E each extending outward in a radial direction and corresponding to an associated first extension portion21E (one to one correspondence). In an embodiment, the lower-half casing22may be a thin shell member and includes an outer wall portion extending in the axial direction (such as the downwardly extending outer wall portion shown inFIG.1) for coupling with the thin-shell upper-half casing21. In an embodiment, the lower-half casing22may include a second through-hole22H aligned with the first through-hole21H. The second through-hole22H intercommunicates with the inner space S1.", "", "Optionally, the thickness of each of the thin shell members formed by the spoke portion2, the upper-half casing21, and the lower-half casing22is 0.2-1 mm. Preferably, the thickness of the thin shell members is 0.5 mm. By selecting the thickness of the thin shell members, the material used can be effectively reduced. Optionally, the material of the thin shell members may be polyvinyl chloride (PVC) or acrylonitrile butadiene styrene (ABS).", "", "It should be noted that according to the drawings of the present invention, the number of each of the first extension portions21E and the second extension portions22E is five. However, the number of the extensions21E,22E is not limited in the present invention.", "", "The at least one connecting member3is protrusively disposed on an outer side of the spoke portion2. In an embodiment, each connecting member3may include a second engaging portion31for coupling with a corresponding first engaging portion21C. Specifically, the second coupling portion31has a shape complementary to the shape of the first engaging portion21C to reinforce the coupling stability between the first engaging portion21C and the second engaging portion31. In an embodiment, the first engaging portions21C is recessed in the outer surface of the upper-half casing21to form an engaging groove, and the second engaging portion31protrudes from a lower side of the connecting member3to form an engaging protrusion. Namely, one of the spoke portion2and the connecting member3includes an engaging groove, and another of the spoke portion2and the connecting member3includes an engaging protrusion. The engaging groove and the engaging protrusion match with each other in shape to engage the spoke portion2with the connecting member3. In other words, the engaging groove and the engaging protrusion have complementary shapes, such that the spoke portion2and the connecting member3are engaged via the engaging groove and the engaging protrusion. In an embodiment, the connecting member3may include at least one connecting hole32. Optionally the connecting member3may be made of aluminum.", "", "The wheel plate body4includes a receiving space S2and at least one passage space S3intercommunicating with the receiving space S2(seeFIG.2). The receiving space S2and the at least one passage space S3together extend through the wheel plate body4. The at least one passage space S3intercommunicates with the inner space S1. In an embodiment, the receiving space S2may extend in the axial direction, and the passage space S3may extend in a radial direction. Specifically, in an embodiment, the wheel plate body4can be placed into the first through-hole21H to couple with the spoke portion2. In an embodiment, the wheel plate body4may include an upper-half wheel plate41and a lower-half wheel plate42. The upper-half wheel plate41may include at least one through-hole41H and at least one first extension groove41E. In an embodiment, the upper-half wheel plate41may include at least one mounting hole41M. Preferably, each mounting hole41M is disposed corresponding to an associated first extension portion21E. The lower-half wheel plate42may include a recessed portion42R and at least one second extension groove42E. The through-hole41H and the recessed portion42R may be aligned with each other and together form the receiving space S2. The at least one first extension groove41E and the at least one second extension groove42E may be aligned with each other and together form the passage space S3. In an embodiment, the lower-half wheel plate42may include a first positioning portion42P.", "", "It should be noted that the structural features and disposition of the above upper-half casing21and the above lower-half casing22are merely a workable implementation example embodying the spoke portion2of the present invention. Furthermore, in the present invention, the main feature of the spoke portion2is to provide a thin shell member having the inner space S1and an optional first through-hole21H for mounting the wheel plate body4while optionally including the first engaging portion21C for mounting the connecting member3.", "", "Please refer toFIGS.1-3and5which show an example of disposition of a nozzle unit5and at least one air bag6into the above wheel plate assembly1according to the present invention. The he nozzle unit5includes a gas inlet51and at least one gas outlet52intercommunicating with the gas inlet51. All or a portion of the nozzle unit5is installed in the receiving space S2. The gas inlet51is exposed to the environment. The at least one gas outlet52is aligned with the at least one passage space S3. In an embodiment, the nozzle unit5may include a second positioning portion5P, such that when the nozzle unit5is mounted in the receiving space S2, the second positioning portion5P and the first positioning portion42P engage with each other, thereby enhancing the engaging stability between the nozzle unit5and the wheel plate body4, particularly avoiding relative rotational movement between the nozzle unit5and the wheel plate body4.", "", "With reference toFIG.3showing an implantation example of the nozzle unit5, the nozzle unit5includes a nozzle body5M, a nozzle upper cover5U, a nozzle base5B, and an optional nozzle cap5C. In an embodiment, the number of the at least one gas outlet52corresponds to the number of the at least one first extension portion21E. The nozzle body5M includes the gas inlet51and the at least one gas outlet52. In an embodiment, the nozzle body5M may include at least one nozzle extension5E extending outward in a radial direction. Each nozzle extension5E may include a corresponding one of the at least one gas outlet52(namely, a gas outlet52is disposed on each nozzle extension5E). The nozzle upper cover5U and the nozzle base5B engage with each other to form a space for partially receiving the nozzle body5M, such that the nozzle body5M can be coupled between the nozzle upper cover5U and the nozzle base5B. Particularly, in a case that the nozzle body5M includes the nozzle extension portion5E, one or both of the nozzle upper cover5U and the nozzle base5B have a groove5G corresponding to the nozzle extension portion5E, such that when the nozzle upper cover5U engages with the nozzle base5B, all or a portion of the nozzle extension portion5E is received in the space formed by the groove5G, thereby protecting the gas outlet52. The nozzle cap5C is connected to the nozzle body5M and the nozzle upper cover5U. In an embodiment, the bottom of the nozzle base5B may include the second positioning portion5P. Specifically, the second positioning portion5P has a shape complementary to the shape of the first positioning portion42P to reinforce the coupling stability between the first positioning portion42P and the second positioning portion5P. Optionally, the first positioning portion42P protrudes outward from an upper surface of the lower-half wheel plate42to form a positioning peg, and the second positioning portion5P is recessed in a lower surface of the nozzle base5B to form a positioning hole.", "", "It should be noted that each element illustrated inFIG.3is merely a workable implementation example embodying the nozzle unit5. Furthermore, the main feature of the nozzle unit5according to the present invention is to provide the gas inlet51, the at least one gas outlet52, and the optional second positioning portion5P. Therefore, in other examples, each element may be integrally formed or have another disposition (such as including more or fewer elements or having different shapes) to include the gas inlet51, the at least one gas outlet52, and the optional second positioning portion5P of the above nozzle unit5", "", "With reference toFIGS.1,3, and5, the at least one air bag6is disposed in the inner space S1and defines an air bag space S4(FIG.5). The air bag6includes an inlet end61, a main extension section62, and at least one optional branch section63. The inlet end61is an opening connected to the at least one gas outlet52to intercommunicate the at least one gas outlet52with the air bag space S4, such that a gas may be inputted via the gas inlet51and pass through the gas outlet52to enter the air bag space S4. Thus, the main extension section62and/or the at least one branch section63of the air bag6expands to support the spoke portion2(seeFIG.8). Specifically, the main extension section62extends a distance in the radial direction from the inlet end61to correspond to an associated first extension portion21E. Preferably, a distal end (away from the inlet end61) of the main extension section62after expansion can abut against a distal end of the spoke portion2(such as the upper-half casing21or the lower-half casing22) in the inner space S1and can support the spoke portion2. The branch sections63are located between the inlet end61and the distal end of the main extension section62and are substantially disposed in a circumferential direction (each branch section63extends in a radial direction) relative to the spoke portion2and the wheel plate body4, such that the branch sections63can support a portion of the spoke portion2not supported by the main extension section62before the air bag6expands. In an embodiment, the inlet end61is fit in the nozzle extension portion5E. Preferably, the space defined by the first extension portion21E, the second extension portion22E, the first extension groove41E, and the second extension groove42E is used to receive the main extension section62.", "", "Please refer toFIG.6illustrating a composite material7adhered to the outer surface of the above wheel plate assembly1. The composite material7may be in a condition of initially adhered to the spoke portion2or securely bonded to the spoke portion2. As shown inFIG.7, the mounting hole41M of the upper-half wheel plate41may be used to permit insertion of the composite material7, preferably by press-fit, thereby enhancing the bonding stability between the composite material7and the spoke portion2.", "", "Particularly, in a case that the composite material7is initially adhered to the spoke portion2, the composite material7requires further heating and pressurization to securely bond the composite material7to the spoke portion2. According to the structures and disposition of the above wheel plate assembly1, the nozzle unit5, and the at last one air bag6, the present invention may perform a method for producing a spoke portion with a composite material. In an embodiment, the method includes steps S1, S2, S3.", "", "In step S1, as shown inFIG.6, the spoke portion2of the wheel plate assembly1coated by the composite material7, particularly the portion of the spoke portion2exposed to the environment, and the connecting hole32is preferably exposed to the environment (namely, the connecting hole32is not shielded). Preferably, the composite material7is placed into the mounting hole41M of the upper-half wheel plate41(seeFIG.7), such that the composite material7can more stably coat the spoke portion2.", "", "In step S2, as shown inFIG.7, the wheel plate assembly1coated by the composite material7is placed into a mold8. The mold8includes a gas input portion80and a press/bonding contour corresponding to the shape of the wheel plate assembly1coated by the composite material7(such as an upper mold81and a lower mold82, with the upper and lower molds81,82having upper and lower contours corresponding to a to-be-press/bonded area of an object), such that the composite material7can be securely bonded to the wheel plate assembly1(particularly the spoke portion2) after the wheel plate assembly1coated by the composite material7is subjected to heating and press-bonding by the mold8. Specifically, as shown inFIG.8, when the mold8is press-bonding the wheel plate assembly1, the gas input portion80is connected to the gas inlet51to input a gas into the gas inlet51, such that the air bag6expands to provide a corresponding supporting force supporting the spoke portion2from an interior of the spoke portion2. At this time, a side of the composite material7not bonded to the wheel plate assembly1is subjected to the pressing force from the mold8, whereas another side of the composite material7bonded to the wheel plate assembly1is subjected to the supporting force from the air bag6. The pressing force and the supporting force together press-bond the composite material7to more efficiently press-bond the composite material7to the spoke portion2. Furthermore, during the press-bonding process of the mold8, the above supporting force also reliably prevents deformation of the spoke portion2(particularly in the form of a shell member) under the above pressing force, thereby avoiding generation of gaps between the composite material7and the mold8or uneven force caused by the deformation. Thus, the overall press-bonding quality is enhanced.", "", "In step S3, as shown inFIG.8, the mold8is used to press-bond the composite material7to the wheel plate assembly1. During the press-bonding process, the gas input portion80is connected to the gas inlet51, and the gas is inputted via the gas input portion80into the gas inlet51to expand the air bag6. Expansion of the air bag6generates an outward pushing force from the interior of the spoke portion2(pressing against the spoke portion2to generate the corresponding supporting force), thereby stably press-bonding the composite material7to the wheel plate assembly1. Particularly, the upper mold81and the lower mold82firstly press-bond the wheel plate assembly1to a preset pressure, and then the gas is inputted via the gas input portion80into the gas inlet51to expand the air bag6to a second preset pressure. Preferably, the temperature of the mold8is increased during the press-bonding process, such that the composite material7is heated and, thus, can be more securely bonded to the wheel plate assembly1. Particularly, the composite material7hardens when it is heated. Therefore, in a case of raising to a specific temperature during the press-bonding process to benefit the press-bonding of the composite material7, the mold8may maintain the desired relatively high temperature required for press-bonding, such that it is not necessary to repeatedly increase the temperature of the mold8(for press-bonding the composite material to the mold onto the wheel plate assembly) and lowering the temperature of the mold8(for adhering the composite material onto the mold). Therefore, a next press-bonding operation can be rapidly proceeded after completing press-bonding of the composite material7to a set of wheel plate assembly1, thereby significantly increasing the press-bonding efficiency of the composite material7. It should be noted that increasing the temperature of the mold is a technique which can be appreciated and achieved by one having ordinary skill in the art and can be adjusted and applied in the present invention according to practical needs and is, thus, not described in detail to avoid redundancy. Particularly, the nozzle cap5C abuts against the upper mold81during the press-bonding process of the mold8to apply a pressing force to the nozzle upper cover5U and the nozzle base5B, such that the nozzle upper cover5U and the nozzle base5B can tightly abut against each other for closing the inlet end61of the air bag6, avoiding generation of gaps between the nozzle upper cover5U and the nozzle base5B under the action of expansion of the air bag6, thereby maintaining a stable gas pressure in the air bag6.", "", "Please refer toFIG.9which is a diagrammatic view illustrating installation of the wheel plate assembly1(particularly, the nozzle unit5is removed from the wheel plate assembly1) with the composite material7obtained from the above steps onto a wheel frame9. The wheel frame9includes a predisposed installation portion (not shown), and the wheel plate assembly1can be mounted to the installation portion via the connecting hole32(seeFIG.6), thereby forming a wheel frame assembly.", "", "It should be noted that the description and the implementation examples of the present invention are based on the portion of the composite material7coated on the spoke portion2which is exposed to the environment. Nevertheless, based on the overall structure of the above wheel plate assembly1and the corresponding producing method, in other implementation examples (in which the composite material7is in an initial bonding state and a stable adhered state), the spoke portion2and/or the wheel plate body4which are/is partially or completely exposed to the environment can be coated by the composite material7.", "", "In view of the foregoing, in the wheel plate assembly according to the present invention, by the structure formed of the spoke portion and the wheel plate body which define the inner space, the receiving space, the passage space which intercommunicate with each other, the composite material can be advantageously pre-adhered to the wheel plate assembly, which benefits the process of press-bonding the composite material to the wheel plate assembly. Furthermore, by application of the nozzle unit and the air bag, during the process of press-bonding the composite material to the wheel plate assembly, a supporting/pushing force can be provided from the interior of the air bag to reinforce the pressure-bearing capacity of the whole wheel plate assembly while enhancing the efficiency and quality of press-bonding of the composite material. Furthermore, by providing the wheel plate body with the mounting hole for insertion of the composite material, the stability of bonding the composite material to the wheel plate assembly can be enhanced. Furthermore, by the overall structure and mechanism of the wheel plate assembly, the mold can maintain the relative high temperature required for press-bonding, such that it is not necessary to repeat the operation of increasing the temperature and lowering the temperature of the mold, which permits rapid subsequent press-bonding operation of the wheel plate assembly, thereby significantly enhancing the press-bonding efficiency of the composite material.", "", "Although the invention has been described in detail with reference to its presently preferable embodiments, it will be understood by one of ordinary skill in the art that various modifications can be made without departing from the spirit and the scope of the invention, as set forth in the appended claims. Further, if the above-mentioned several embodiments can be combined, the present invention includes any implementation aspects of combinations thereof"], "claims": ["a spoke portion which is a thin shell member and which defines an inner space therein; a connecting member protrusively disposed on an outer side of the spoke portion; and a wheel plate body including a receiving space and at least one passage space intercommunicating with the receiving space, wherein the receiving space and the at least one passage space together extend through the wheel plate body, and wherein the at least one passage space intercommunicates with the inner space.", "2 . The wheel plate assembly as claimed in claim 1 , further comprising a nozzle unit and at least one air bag, wherein the nozzle unit includes a gas inlet and at least one gas outlet intercommunicating with the gas inlet, wherein all or a portion of the nozzle unit is installed in the receiving space, wherein the gas inlet is exposed to an environment, wherein the at least one gas outlet is aligned with the at least one passage space, wherein the at least one air bag is disposed in the inner space and defines an air bag space, wherein the air bag includes an inlet end and a main extension section, wherein the inlet end is an opening connected to the at least one gas outlet, such that the at least one gas outlet intercommunicates with the air bag space via the inlet end, and wherein when a gas is inputted via the gas inlet, the gas passes through the at least one gas outlet and enters the air bag space, such that the main extension section of the air bag expands to support the spoke portion.", "3 . The wheel plate assembly as claimed in claim 2 , wherein the wheel plate assembly further includes a first positioning portion, wherein the nozzle unit further includes a second positioning portion, and wherein the first positioning portion and the second positioning portion engage with each other.", "4 . The wheel plate assembly as claimed in claim 1 , wherein all or a portion of the spoke portion exposed to the environment is coated by a composite material.", "5 . The wheel plate assembly as claimed in claim 4 , wherein the wheel plate body includes at least one mounting hole, and wherein the composite material is filled into the wheel plate body via the at least one mounting hole and is fixed.", "6 . The wheel plate assembly as claimed in claim 1 , wherein one of the spoke portion and the connecting member includes an engaging groove, wherein another of the spoke portion and the connecting member includes an engaging protrusion, and wherein the engaging groove and the engaging protrusion have complementary shapes, such that the spoke portion and the connecting member are engaged via the engaging groove and the engaging protrusion.", "7 . The wheel plate assembly as claimed in claim 1 , wherein the spoke portion includes an upper-half casing and a lower-half casing coupled with the upper-half casing, wherein the upper-half casing includes a first through-hole extending in an axial direction, wherein the upper-half casing further includes a plurality of first extension portions each extending outward in a radial direction perpendicular to the axial direction, wherein at least one of the upper-half casing and the lower-half casing includes an inner side which is recessed to form the inner space, wherein the first through-hole intercommunicates with the inner space, and wherein the lower-half casing includes a plurality of second extension portions each extending outward in a radial direction and corresponding to an associated first extension portion.", "8 . The wheel plate assembly as claimed in claim 7 , wherein the wheel plate body is placed into the first through-hole to couple with the spoke portion, wherein the wheel plate body includes an upper-half wheel plate and a lower-half wheel plate, wherein the upper-half wheel plate includes at least one through-hole and at least one first extension groove, wherein the lower-half wheel plate includes a recessed portion and at least one second extension groove, wherein the through-hole and the recessed portion are aligned with each other and together form the receiving space, and wherein the at least one first extension groove and the at least one second extension groove are aligned with each other and together form the at least one passage space.", "coating the spoke portion of the wheel plate assembly with the composite material; placing the wheel plate assembly coated by the composite material into a mold, wherein the mold includes a gas input portion, an upper mold, and a lower mold, and wherein the upper mold and the lower mold have press-bonding contours corresponding to a shape of the wheel plate assembly coated by the composite material; and using the mold to press-bond the composite material onto the wheel plate assembly, and during the press-bonding process, the gas input portion is connected to the gas inlet, wherein a gas is inputted via the gas input portion into the gas inlet to expand the air bag, and wherein expansion of the air bag generates an outward pushing force from an interior of the spoke portion, thereby stably press-bonding the composite material to the wheel plate assembly.", "10 . The method for producing the wheel plate assembly including the composite material as claimed in claim 9 , wherein during the press-bonding process, the upper mold and the lower mold press-bond the wheel plate assembly to a preset pressure, and then the gas is inputted via the gas input portion into the gas inlet to expand the air bag to a second preset pressure, wherein a temperature of the mold is increased during the press-bonding process, such that the composite material is heated and hardens.", "coating the spoke portion of the wheel plate assembly with the composite material; placing the wheel plate assembly coated by the composite material into a mold, wherein the mold includes a gas input portion, an upper mold, and a lower mold, and wherein the upper mold and the lower mold have press-bonding contours corresponding to a shape of the wheel plate assembly coated by the composite material; and using the mold to press-bond the composite material onto the wheel plate assembly, and during the press-bonding process, the gas input portion is connected to the gas inlet, wherein a gas is inputted via the gas input portion into the gas inlet to expand the air bag, and wherein expansion of the air bag generates an outward pushing force from an interior of the spoke portion, thereby stably press-bonding the composite material to the wheel plate assembly.", "12 . The method for producing the wheel plate assembly including the composite material as claimed in claim 11 , wherein during the press-bonding process, the upper mold and the lower mold press-bond the wheel plate assembly to a preset pressure, and then the gas is inputted via the gas input portion into the gas inlet to expand the air bag to a second preset pressure, wherein a temperature of the mold is increased during the press-bonding process, such that the composite material is heated and hardens."], "bibtex": "@patent{20240066914,\n    title = {WHEEL PLATE ASSEMBLY AND METHOD FOR PRODUCING WHEEL PLATE INCLUDING COMPOSITE MATERIAL},\n    number = {20240066914},\n    year = {2024},\n    note = {File: US20240066914A1-20240229.XML}\n    }", "classification": "B60B104FI"}, {"title": "HUBCAP", "doc_number": "20240066915", "filename": "US20240066915A1-20240229.XML", "abstract": "A hubcap includes a monolithic main body. The monolithic main body includes (i) a sidewall having an annular cross-section, a hub end, and a vent end opposite the hub end, (ii) an end-cap abutting and spanning across the vent end, and (iii) a flange abutting and at least partially surrounding the hub end. The flange has an outer flange-surface facing the vent end and, opposite the outer flange-surface, an inner flange-surface that defines an annular channel.", "detailed_description": ["FIGS.1,2, and3are respectively an isometric top view, an isometric bottom view, and a cross-sectional view of a hubcap101. Hubcap101incudes a monolithic main body100, which has the following regions: a flange110, a sidewall120, and an end-cap130.FIG.4is a cross-sectional view of sidewall120in a cross-sectional plane4-4′ shown inFIG.3.FIGS.1-4are best viewed together in the following description.", "", "Flange110, sidewall120, and end-cap130may be monolithic, e.g., formed of a single piece of material, such as a single continuous volume of material. Flange110, sidewall120, and end-cap130may be integrally formed, such that they make up a single piece or unit, and cannot be dismantled without destroying the integrity of main body100or any of its components.", "", "When flange110, sidewall120, and end-cap130are not monolithic, main body100may be integrally formed by irremovable attachment of at least one of flange110, sidewall120, and end-cap130, wherein, prior to said attachment, at least one of flange110, sidewall120, and end-cap130are separate pieces. For example, at least one of (a) flange110and sidewall120may be irremovably attached, and (b) sidewall120and end-cap130may be irremovably attached. The means of irremovable attachment may include welding, such as plastic welding, adhesive bonding, multi-part molding, or a combination thereof. At least two of flange110, sidewall120, and end-cap130may be formed of different respective materials. Main body100may include a volume of adhesive between at least one of at least one of (a) flange110and sidewall120, and (b) sidewall120and end-cap130.", "", "Sidewall120has an annular cross-section, a hub end122, and a vent end129opposite hub end122. The annular cross-section of sidewall120may be a circular annulus, as shown inFIG.4, or a non-circular annulus, such as a polygonal annulus. End-cap130abuts and spans across vent end129. In embodiments, sidewall120and end-cap130respectively form the lateral surface and a base surface of a frustum, such as a conical frustum or a polygonal frustum. Sidewall120has an interior surface126and an exterior surface128. End-cap130has an inner-facing surface136and an outer-facing surface138. The cross-sectional plane ofFIG.3is perpendicular to at least one of surfaces136and138, and may bisect hubcap101.", "", "Flange110abuts and at least partially surrounds hub end122. Flange110has an outer flange-surface118facing vent end129, and opposite outer flange-surface118, an inner flange-surface112that defines an annular channel116. Specifically, inner flange-surface112includes a recessed region113that defines annular channel116. In embodiments, inner flange-surface112also forms an annular channel114, which is surrounded by annular channel116.", "", "As shown inFIG.2, monolithic main body100may include a plurality of communication holes119, each spanning between recessed region113and one of outer flange-surface118(as shown inFIG.3) and exterior surface128.FIG.3illustrates a communication hole319, which is an example of communication hole119that is coplanar with a bolt-hole117in the cross-sectional plane ofFIG.3. Communication holes119may be coplanar with a bolt-hole117, as inFIG.3, or not coplanar in this sense, as illustrated by communication holes119ofFIG.2. For compatibility with tooling used in manufacturing main body100, an axis of communication hole319may be at least one of (a) perpendicular to one or more of surfaces112,136, and138, (b) parallel to an axis of a bolt-hole117, and (c) parallel to a symmetry axis of main body100.", "", "Each communication hole119may be defined by a respective surface111of main body100, which spans between recessed region113and one of outer flange-surface118(as shown inFIG.3) and exterior surface128. The total number of communication holes119of main body100may be between two and eight, inclusive. For example,FIG.2denotes three communication holes119.", "", "Inner flange-surface112may be a bottom surface of hubcap101, such that when hubcap101is installed on a hub assembly, at least part of inner flange-surface112is in direct contact with one of (i) the hub assembly and (ii) a gasket or sealing ring disposed between hubcap101and the hub assembly. For example, hubcap101may include at least one of a sealing ring316located at last partially in annular channel116, and a sealing ring314located at least partially in annular channel114. Each of sealing rings314and316contribute forming a seal at the interface of inner flange-surface112and a surface of a hub assembly to which hubcap101is attached. In embodiments, hubcap101includes gasket, such as a flange gasket, removably attached to inner flange-surface112. This gasket may function as at least one of sealing ring314and316, such that part of the gasket is in at least one of annular channel114and116.", "", "Monolithic main body100may be formed a high-impact plastic, examples of which include polyethylene terephthalate (PET) and polycarbonate. The plastic may have an Izod Impact Strength of at least 860 joules per meter. Flange110, sidewall120, and end-cap130have respective thicknesses115,125, and135, each of which may be between 4.5 millimeters and 8.0 millimeters. Monolithic main body100may be either opaque or transparent to visible light. Transparency of monolithic main body100enables visual inspection of oil levels in a hub assembly to which hubcap101is attached.", "", "In embodiments, flange110includes a plurality of bolt-holes117for bolting main body100to a hub assembly. Flange110may also include a respective compression limiter in each bolt-hole117to prevent main body100from cracking when bolts through bolt-holes117are tightened.", "", "In embodiments, hubcap101includes at least one of a vent134on outer-facing surface138, and a filter332adjacent to outer-facing surface138. At least one of filter332and vent334may be removably attached to end-cap130. Vent334may be fixedly attached to end-cap130. End-cap130may also include, between surfaces136and138, a surface137that defines an aperture through end-cap130.", "", "FIG.5is a cross-sectional view of a hubcap501, which is an embodiment of hubcap101.FIG.6is an isometric top view of hubcap501. Hubcap501includes an overmold500and main body100, which includes outer flange-surface118and exterior surface128of sidewall120. Overmold500covers, and is conformal to, at least part of each of (i) the outer flange-surface118and exterior surface128. Overmold500may also cover, and be conformal to, at least part of outer-facing surface138of end-cap130. Overmold500may be formed of a thermoplastic elastomer, which increases hubcap501's impact resistance. Overmold500also enables hubcap501to satisfies market demand for hubcaps that are at least partially opaque.", "", "In embodiments, hubcap101includes a sealing ring516in annular channel116. Sealing ring516is an example of sealing ring316. For example, hubcap501may include sealing ring516, as shown inFIG.5. Sealing ring516may be bonded to recessed region113. Sealing ring516may be either unconnected to overmold500, or connected to overmold500.", "", "A cross-sectional shape of sealing ring516may be that of a convex shape, such as a circle, ellipse, or a convex polygon. Alternatively, the cross-sectional shape may be that of convex shape, e.g., one with multiple lobes517as shown inFIG.5. Lobes517on provide redundancy against leaks.", "", "When sealing ring516is connected to overmold500, hubcap501may include a plurality of spokes518, each of which is formed of the same material as at least one of overmold500and sealing ring516. In embodiments, spokes518may be conformally attached to both sealing ring516and overmold500. Each spoke518(a) extends through a respective communication hole119, and (b) connecting respective region of sealing ring516with a respective region of overmold500that covers the respective communication hole119. In such embodiments, sealing ring516and overmold500may be monolithic, that is, they are formed of a continuous piece of material.", "", "Spokes518may be formed in the same process step as forming overmold500on main body100. In such embodiments, spokes518and overmold500are monolithic, and spokes518may be conformally attached to sealing ring516. Sealing ring may also be formed in the same process step as spokes518and overmold500. In such embodiments, overmold500, spokes518, and sealing ring516may be monolithic", "", "Forming sealing ring516and overmold500during a same process step eliminates material and labor costs associated with a separate sealing ring. Sealing ring516's being attached to overmold500also facilitates removal and reinstallation of hubcap501, as there is no separate step of installing a separate ring, during which the separate ring might be damaged.", "", "Each communication hole119may have a hydraulic diameter Dhbetween 1.0 and 1.5 millimeters, inclusive. Hydraulic diameter Dhmay be defined as Dh=4A/P, where A and P are, respectively, the cross-sectional area and total perimeter of communication hole119. When the hydraulic diameter exceeds one millimeter, communication holes119are sufficiently large to enable material of overmold500to flow through communication holes119and adjoin sealing ring516. When the hydraulic diameter is less than 1.5 millimeter, communication holes119are sufficiently small that they do not interfere with bolt-holes117.", "", "FIG.7is a cross-sectional view of hubcap501, in a cross-sectional plane that does not include a bolt-hole117. In such a cross-sectional plane, hubcap501may include a communication hole719and a spoke718therein. Communication hole719and spoke718are respective examples of communication hole119and spoke518.", "", "FIG.8is a schematic of a sealing ring816and three spokes818. Sealing ring816and spokes818may be a single piece of material, and may be part of a monolithic volume of material that includes overmold500. Sealing ring816is an example of sealing ring516. Each spoke818is an example of spokes518and718. In embodiments, sealing ring816is in annular channel116, and each spoke818is in a respective communication hole119shown inFIG.1."], "claims": ["a monolithic main body including (i) a sidewall having an annular cross-section, a hub end, and a vent end opposite the hub end, (ii) an end-cap abutting and spanning across the vent end, and (iii) a flange abutting and at least partially surrounding the hub end; the flange having an outer flange-surface facing the vent end and, opposite the outer flange-surface, an inner flange-surface that defines an annular channel.", "2 . The hubcap of claim 1 , further comprising an overmold covering, and conformal to, at least part of each of (i) the outer flange-surface and (ii) an exterior surface of the sidewall.", "3 . The hubcap of claim 2 , the overmold also covering, and conformal to, at least part of the end-cap.", "4 . The hubcap of claim 2 , the overmold comprising a thermoplastic elastomer.", "5 . The hubcap of claim 2 , further comprising a sealing ring disposed in the annular channel.", "6 . The hubcap of claim 5 , the sealing ring and the overmold being unconnected.", "7 . The hubcap of claim 5 , the inner flange-surface including a recessed region that defines the annular channel, the sealing ring being bonded to the recessed region.", "the monolithic main body including a plurality of communication holes each spanning between the recessed region and a surface of the hubcap covered by the overmold; the hubcap further comprising a plurality of spokes, each of the plurality of spokes (a) extending through a respective communication hole of the plurality of communication holes, and (b) connecting a respective region of the sealing ring with a respective region of the overmold that covers the respective communication hole.", "9 . The hubcap of claim 8 , a number of the plurality of communication holes being between two and eight.", "10 . The hubcap of claim 8 , each of the plurality of communication holes having a hydraulic diameter between 1.0 millimeters and 1.5 millimeters.", "11 . The hubcap of claim 8 , the inner flange-surface including a recessed region that defines the annular channel, each of the plurality of communication holes each spanning between the recessed region and one of (i) the outer flange-surface and (ii) a surface of the sidewall.", "12 . The hubcap of claim 8 , the main body having a plurality of interior surfaces, each of the plurality of interior surfaces (i) defining a respective one of the plurality of communication holes and (ii) spanning between the recessed region and a surface of the hubcap covered by the overmold.", "13 . The hubcap of claim 1 , the main body being formed of a high-impact plastic.", "14 . The hubcap of claim 1 , the main body being transparent to visible light.", "15 . The hubcap of claim 1 , the main body being opaque to visible light.", "16 . The hubcap of claim 1 , a thickness of the main body being between 4.5 mm and 8.0 mm.", "17 . The hubcap of claim 1 , the monolithic main body having an Izod Impact Strength of at least 860 joules per meter.", "18 . The hubcap of claim 1 , the inner flange-surface being a bottom surface of the hubcap.", "a vent attached to an outer-facing surface of the end-cap; and a filter removably attached in an inner-facing surface of the end-cap."], "bibtex": "@patent{20240066915,\n    title = {HUBCAP},\n    number = {20240066915},\n    year = {2024},\n    note = {File: US20240066915A1-20240229.XML}\n    }", "classification": "B60B700FI"}, {"title": "WHEEL FOR A VEHICLE AND SYSTEM COMPRISING THE WHEEL", "doc_number": "20240066916", "filename": "US20240066916A1-20240229.XML", "abstract": "The invention refers to a wheel for a vehicle, the wheel being rotatable around a rotation axis and comprising: a seating space for a brake disk extending around the rotation axis; a wheel rim having a rim well, the wheel rim extending around the seating space and the rotation axis, wherein the rim well protrudes from the wheel rim towards the rotation axis; and at least one spoke being connected to the wheel rim, the at least one spoke being arranged at an outward side of the wheel and extending at least in part radially to the rotation axis; wherein, along the rotation axis, the seating space is arranged closer to the outward side than the rim well. The invention improves the air flow in the vicinity of the wheel to reduce aerodynamic drag and lifting forces on the vehicle.", "detailed_description": [""], "claims": ["a seating space for a brake disk extending around the rotation axis; a wheel rim having a rim well, the wheel rim extending around the seating space and the rotation axis, wherein the rim well protrudes from the wheel rim towards the rotation axis; and at least one spoke being connected to the wheel rim, the at least one spoke being arranged at an outward side of the wheel and extending at least in part radially to the rotation axis; wherein, along the rotation axis, the seating space is arranged closer to the outward side than the rim well.", "2 . The wheel according to claim 1 , wherein the wheel rim comprises an air guide portion between the rim well and the outward side, wherein the air guide portion is configured to guide air towards the outward side.", "3 . The wheel according to claim 2 , wherein the air guide portion is tapered, wherein, along the rotation axis, the air guide portion comprises a diameter increasing towards the outward side.", "4 . The wheel according to claim 1 , wherein the at least one spoke is configured to accelerate air, which streams from the rim well towards the outward side, if the wheel turns in a predefined rotation direction around the rotation axis.", "5 . The wheel according to claim 4 , wherein the at least one spoke comprises a blade portion extending between the outward side and the rim well, wherein the blade portion is configured to accelerate air towards the outward side, if the wheel turns in the predefined rotation direction around the rotation axis.", "6 . The wheel according to claim 4 , wherein, along the rotation axis, the at least one spoke has an asymmetrical shape.", "7 . A system comprising the wheel according to claim 1 , the brake disk, and a wheel hub connectable to a vehicle, wherein the brake disk is arranged in the seating space, wherein the brake disk and the wheel are attached to the wheel hub.", "8 . The system according to claim 7 , wherein the brake disk comprises at least one cooling air channel extending at least in part radially to the rotation axis, the cooling air channel being configured to thrust out air towards the wheel rim.", "9 . The system according to claim 8 , wherein the cooling air channel comprises an outlet opening facing the wheel rim between the rim well and the outward side.", "10 . The system according to claim 7 , wherein the wheel hub comprises a guiding channel being configured to guide air from an inward side of the wheel towards the brake disk, the inward side being opposite to the outward side.", "11 . A vehicle comprising the wheel according to claim 1 , wherein the wheel is mounted the vehicle in a rotatable manner."], "bibtex": "@patent{20240066916,\n    title = {WHEEL FOR A VEHICLE AND SYSTEM COMPRISING THE WHEEL},\n    number = {20240066916},\n    year = {2024},\n    note = {File: US20240066916A1-20240229.XML}\n    }", "classification": "B60B1910FI"}, {"title": "COMPOSITE WHEEL WITH BEAD HUMP HAVING TIRE LOCK GEOMETRY", "doc_number": "20240066917", "filename": "US20240066917A1-20240229.XML", "abstract": "A composite wheel for use at normal tire pressures as well as at reduced tire pressures may include a spoke section with a mating surface, a barrel section in contact with the spoke section at said mating surface, and a bead hump with tire lock geometry on at least the spoke section. The barrel section may further include a bead hump with the tire lock geometry.", "detailed_description": ["Reference will now be made in detail to embodiments of the present disclosure, one or more drawings of which are set forth herein. Each drawing is provided by way of explanation of the present disclosure and is not a limitation. In fact, it will be apparent to those skilled in the art that various modifications and variations can be made to the teachings of the present disclosure without departing from the scope of the disclosure. For instance, features illustrated or described as part of one embodiment can be used with another embodiment to yield a still further embodiment.", "", "Thus, it is intended that the present disclosure covers such modifications and variations as come within the scope of the appended claims and their equivalents. Other objects, features, and aspects of the present disclosure are disclosed in, or are obvious from, the following detailed description. It is to be understood by one of ordinary skill in the art that the present discussion is a description of exemplary embodiments only and is not intended as limiting the broader aspects of the present disclosure.", "", "The words “connected”, “attached”, “joined”, “mounted”, “fastened”, and the like should be interpreted to mean any manner of joining two objects including, but not limited to, the use of any fasteners such as screws, nuts and bolts, bolts, pin and clevis, and the like allowing for a stationary, translatable, or pivotable relationship; welding of any kind such as traditional MIG welding, TIG welding, friction welding, brazing, soldering, ultrasonic welding, torch welding, inductive welding, and the like; using any resin, glue, epoxy, and the like; being integrally formed as a single part together; any mechanical fit such as a friction fit, interference fit, slidable fit, rotatable fit, pivotable fit, and the like; any combination thereof; and the like.", "", "Unless specifically stated otherwise, any part of the apparatus of the present disclosure may be made of any appropriate or suitable material including, but not limited to, metal, alloy, polymer, polymer mixture, wood, composite, or any combination thereof.", "", "As shown inFIGS.1-3, the present application provides an improved, two (2) piece wheel10which may be used on various automobiles, including but not limited to passenger cars and trucks. In some situations, it may be advantageous for a vehicle to improve tire grip, reduce slippage, and prevent creation of ruts by highly-pressurized tires by operating with tires inflated to a pressure that is lower than normal operating tire pressure. Reducing tire pressure can increase tire compression and thereby increase an amount of tire surface in contact with the ground surface below. Example situations include traverse of fine or loose surface material such as sand or gravel. The wheel10disclosed herein offers many advantageous features not found in prior art such as a lighter weight, stronger construction, and ability to function during operation at low tire pressure without a bolted bead lock ring as required by conventional off-road wheels.", "", "Traditional bead lock wheels have locking rings that bolt onto a wheel and hold tire beads to the wheels to prevent separation when operated at low pressures. The locking ring may require use of multiple (e.g., up to thirty) or more bolts in order to attach the locking ring to the wheel. Such bolts sometimes attach to the wheel via threaded holes created on the wheel.", "", "For wheels fabricated from metals, such as steel or aluminum, tapping threaded holes to accommodate bolts for a bead lock ring does not compromise integrity of the wheel to an unacceptable degree. However, tapping threaded holes in a carbon fiber component is likely to increase structural fatigue and compromise the component's structural integrity. This difficulty in adding traditional bead lock and bead lock ring posed a great challenge in carbon fiber bead lock design.", "", "As a result, an alternate and novel bead lock design was generated by eliminating a ring and including an aggressive bead hump design to hold the tire bead. This novel bead hump geometry includes a steep angle and a specific height to maintain appropriate locking pressure.", "", "Under pressurized operation, a tire may see most the load on the outer lip (where spoke is) during cornering. There is also a load on the inner lip (inside most of the vehicle), frequently less than the outer lip.", "", "In some embodiments, the bead lock design can be more aggressive on the outer lip than on the inner lip (or, the tire lock geometry may even be non-existent on the inner, barrel section). Note the traditional bead lock design with a ring doesn't have any parts on the inner lip.", "", "FIG.1shows a cross-sectional view of the fully assembled wheel10. The surface profile of the wheel10includes one or more bead humps150with tire lock geometry155that serve to add security to a tire at low pressure by locking the bead of a tire into a bead seat160of the wheel10defined between a flange170of the wheel and the bead hump150, thereby preventing slippage of the tire into the drop center200of the wheel (e.g., away from the wheel flange). As such, one of ordinary skill in the art can appreciate that although one design is shown in the figures included herewith, many different wheel designs and arrangements may be possible, and the scope of the present invention should not be limited by the design shown in the figures.", "", "The spoke section20is the portion of the wheel farthest from the automobile. The spoke section20also has a mating surface80which is in contact with the barrel surface's mating surface110when the wheel10is assembled. The barrel section30is the portion of the wheel10closest to the automobile.", "", "The spoke section20mates with the barrel section30at the mating surface110. The shape, design, number, and length of the spokes40can be varied to increase the strength of the wheel10. The mating surface110of the barrel section30may have a lip or stop130so that the leading edge of the spoke section's mating surface80rests against it once the two sections are fitted properly during assembly. This lip or stop130serves to provide that adequate overlap is created by the two opposing mating surfaces80,110to provide for a secure assembly. The amount of overlap may vary depending upon the desired use of the wheel. In some embodiments, the amount of overlap may be between approximately 0.10 and 6.00 inches, approximately 0.50 and 5.00 inches, approximately 1.00 and 4.0 inches and approximately 1.50 and 3.0 inches. In one preferred embodiment, the amount of overlap is between approximately 1.50 and 2.00 inches.", "", "The bead hump150with tire lock geometry155is configured in a manner that maintains the integrity of the tire to wheel connection during periods of operation at low tire pressure, generally below 20 psi. One or more of the spoke section20or the barrel section30may include the bead hump150with tire lock geometry155. As illustrated inFIGS.3and4, the one or more bead humps150may include a spoke section bead hump240with the tire lock geometry155. The one or more and a spoke section bead seat210. As illustrated inFIGS.3and5, the one or more bead humps150may include a barrel section bead hump480with the tire lock geometry155. The tire lock geometry155of each of the spoke section20and the barrel section30may share many common elements, as further discussed below.", "", "FIG.4shows a cross-sectional view of the spoke section20of the wheel. In particular,FIG.4shows the bead hump240with novel tire lock geometry155. In one embodiment, the wheel10may implement a bead hump having such tire lock geometry on one or more of the spoke section20of the wheel and the barrel section30of the wheel. In another embodiment, the wheel10may implement a bead hump with tire lock geometry on both the spoke section20and barrel section30of the wheel, as shown inFIG.3. In some embodiments, a bead hump with tire lock geometry may have an essentially constant cross-sectional geometric profile around an entire circumference of the wheel. Such cross-sectional geometric profile may comprise exclusively the tire lock geometry155described herein or may vary between other geometries and the tire lock geometry. In some embodiments, the bead hump's cross-sectional geometric profile may vary between a conventional bead hump profile and a bead hump profile having the tire lock geometry.", "", "Upon reading of this disclosure, one of ordinary skill in the art will appreciate the novelty of a bead hump with tire lock geometry in a carbon fiber composite wheel. Indeed, terms such as “bead seat” and “bead hump” have particular meanings in the art and that are well understood by those of ordinary skill. Thus, to aid the reader and for efficiency of discussion, features of each of the spoke section20and barrel section30may be identified in the drawings by reference numbers and by name herein without the need to specifically delineate portions of the surfaces of the spoke section20and barrel section30where such features begin and end. For example, one of ordinary skill in the art will appreciate upon reading of this disclosure that the spoke section bead hump240refers to a portion of the surface of spoke section20between a spoke section bead seat210and drop center200, and which is in contact with a portion of a tire's bead during operation, even without specific lines identifying points on the surface where such spoke section bead hump240begins and ends. Similarly, one of ordinary skill in the art will appreciate upon reading of this disclosure a barrel section bead hump480refers to a portion of the surface of barrel section30between a barrel section bead seat430and drop center200, and which is in contact with a portion of a tire's bead during operation, even without specific lines identifying points on the surface where such barrel section bead hump480begins and ends.", "", "The surface of the spoke section20has geometric variations defining bead hump240, front flange270, and the bead seat210. It has been observed that the particular geometry of the bead hump240may create a sufficiently secure interaction between surfaces of the bead hump240and a portion of a tire bead, to reduce or eliminate tire bead slip enough to permit safe operation at low tire pressures. In one embodiment, this geometry is present on a composite wheel, such as a wheel fabricated with carbon fiber or similar composite materials. The front flange270is positioned between a front flange surface260on the spoke side of the wheel, and an interior front flange surface280. The front flange surface260is adjacent to the front flange270on the spoke side of the wheel. The front flange270is positioned between the front flange surface260and interior flange surface280. Geometry of the front flange270may vary, but in some embodiments may have a curved or chamfered portion with essentially constant radius or a varying radius around the rim lip's circumference. The interior front flange surface280is positioned between the front flange270and the bead seat210.", "", "In some embodiments, the bead seat210may be configured to contact a tire bead and may comprise a section of wheel surface that is between the front flange270and the bead hump240. As is commonly done, when a tire is mated with the wheel10, the bead of the tire rests in the bead seat210. An exterior surface of the tire bead may be in contact with a surface of the front flange270and an interior surface of the tire bead may be in contact with a surface of the bead hump240. In addition to their interwoven geometry, the bead hump240and bead seat210exist in connection with friction, adhesion, and any other force as common in the art to prevent tire slippage into the drop center200of the wheel.", "", "The bead hump240may comprise a proximal surface300(e.g., relative to the front flange270), a top surface310, and a distal surface320(e.g., relative to the front flange270). The proximal surface300may be defined between the bead seat210and the top surface310. The proximal surface300may at least partially face the interior front flange surface280. In certain optional embodiments, the proximal surface300may be parallel to the interior front flange surface280. The interior front flange surface280may be parallel to the vertical axis (y-axis). In certain optional embodiments, the top surface310of the bead hump240may be essentially parallel to the horizontal axis (x-axis). In other optional embodiments, the top surface310of the bead hump240and the interior front flange surface280of the front flange270may be angled relative to each other at some angle other than ninety (90) degrees. The bead seat210may be angled relative to the interior front flange surface280, for example, at a first angle220. In certain optional embodiments, the first angle220may be between about ninety (90) degrees and about one-hundred (100) degrees. In other optional embodiments, the first angle220may be between about ninety-two (92) degrees and about ninety-eight (98) degrees. In further optional embodiments, the first angle220may be about ninety-five (95) degrees.", "", "A first transition corner222may be defined between bead seat210and the interior front flange surface280. The first transition corner222may be chamfered, having a first radius. The first radius may be about four-point-five (4.5) mm. In other optional embodiments, the first radius may be between about two (2) mm and about seven (7) mm. A second transition corner226may be defined between the bead seat210and the proximal surface300of the bead hump240. The second transition corner226may be chamfered, having a second radius. The second radius may be about one (1) mm. In other optional embodiments, the second radius may be between about zero-point-two-five (0.25) mm and about two (2) mm. A third transition corner230may be defined between the top surface310and the proximal surface300of the bead hump240. The third transition corner230may be chamfered, having a third radius. The third radius may be about zero-point-five (0.5) mm. In certain optional embodiments, the third radius may be about zero-point-three (0.3) mm. In other optional embodiments, the third radius may be between about zero-point-one (0.1) mm and about one (1) mm.", "", "The proximal surface300of the bead hump240may be angled relative to the bead seat210, for example, at a second angle234. In certain optional embodiments, the second angle234may be between about eighty (80) degrees and about one-hundred (100) degrees. In other optional embodiments, the second angle234may be between about eighty-five (85) degrees and about ninety-five (95) degrees. In further optional embodiments, the second angle234may be about ninety (90) degrees. Alternatively, the proximal surface300may be angled at about nine-point-nine (9.9) degrees relative to the vertical axis (y-axis), or more broadly, between about five (5) and fifteen (15) degrees. Other angles may be possible to achieve the effect of maintaining the integrity of the wheel to tire coupling and preventing slippage of the tire into the drop center200of the wheel, even when the tire is at low pressure. In some embodiments, an angle of a top portion of the proximal surface300may be about fifteen-point-five (15.5) degrees relative to a plane parallel to the surface of the ground (x-axis). The proximal surface300may have a slightly curved profile and may extend at an approximately constant angle to the top surface310of the bead hump240. In one embodiment, the proximal surface300measures about zero-point-nine (0.9) mm in length. In certain optional embodiments, the proximal surface300measures about one-point-nine (1.9) mm relative and perpendicular to the bead seat210. In other optional embodiments, the proximal surface300measures less than about three (3) mm relative and perpendicular to the bead seat210.", "", "The top surface310of the bead hump240extends from the proximal surface300to the distal surface320. The top surface310may have an essentially constant surface profile. The top surface310joins the distal surface320of the bead hump240after which the distal surface320descends toward the drop center200of the wheel. The bottom of the distal surface320descends beyond the bottom of the proximal surface300. The distal surface320of the bead hump240may be angled relative to the top surface310, for example, at a third angle236relative to the horizontal axis (x-axis). In certain optional embodiments, the third angle236may be between about fifty (50) degrees and about eighty (80) degrees. In other optional embodiments, the third angle236may be between about sixty (60) degrees and about seventy (70) degrees. In further optional embodiments, the third angle236may be about sixty-five (65) degrees.", "", "The front flange270may be taller than the bead hump240. The height of an element (e.g., how tall an element is) may be defined as extending radially from a center of the wheel relative to a reference point or reference element. In certain optional embodiments, the front flange270may be at least fourteen-point-five (14.5) mm tall relative to the bead seat210. A distance between the interior front flange surface280and the proximal surface300of the bead hump240may be between about fourteen-point-five (14.5) mm and about fifteen-point-seven (15.7) mm.", "", "FIG.5shows a cross-sectional view of the barrel section30of the wheel. The geometry of the barrel section30of the wheel may mirror that of the spoke section20of the wheel. The barrel section30of the wheel has a barrel side back flange410which is constructed in a similar fashion to the front flange270, in that it has a back flange surface400on the barrel side of the wheel, and an interior flange surface420, with the back flange410joining the back flange surface400and the interior flange surface420.", "", "The back flange surface400joins the back flange410on the barrel side of the wheel, after which the back flange410extends internally having an essentially constant profile. The back flange410joins the interior flange surface420which then sharply curves downwards and ultimately joins a barrel section bead seat430. The back flange410is separated from a barrel section bead hump480by the barrel section bead seat430.", "", "The bead seat430may be configured to contact a tire bead and may comprise a section of wheel surface that is between the barrel side back flange410and the bead hump480. As with the bead seat210of the spoke section, when a tire is mated with the wheel, the bead of the tire rests in the bead seat430. An exterior surface of the tire bead may be in contact with a surface of back flange410and an interior surface of the tire bead may be in contact with a surface of the bead hump480. In addition to their interwoven geometry, the bead hump480and bead seat430exist in connection with friction, adhesion, and any other force as common in the art to prevent tire slippage into the drop center200of the wheel. The barrel side bead hump480maintains similar geometry to the spoke side bead hump240.", "", "The bead hump480may comprise a proximal surface440(e.g., relative to the back flange410), a top surface450, and a distal surface460(e.g., relative to the back flange410). The proximal surface440may be defined between the bead seat430and the top surface450. The proximal surface440may at least partially face the interior flange surface420. In certain optional embodiments, the proximal surface440may be parallel to the interior flange surface420. The interior flange surface420may be parallel to the vertical axis (y-axis). In certain optional embodiments, the top surface450of the bead hump480may be parallel to the horizontal axis (x-axis). In other optional embodiments, the top surface450of the bead hump480and the interior flange surface420of the back flange410may be angled relative to each other at some angle other than ninety (90) degrees. The bead seat430may be angled relative to the interior flange surface420, for example, at a first angle486. In certain optional embodiments, the first angle486may be between about ninety (90) degrees and about one-hundred (100) degrees. In other optional embodiments, the first angle486may be between about ninety-two (92) degrees and about ninety-eight (98) degrees. In further optional embodiments, the first angle486may be about ninety-five (95) degrees.", "", "A first transition corner488may be defined between bead seat430and the interior flange surface420. The first transition corner488may be chamfered, having a first radius. The first radius may be about four-point-five (4.5) mm. In other optional embodiments, the first radius may be between about two (2) mm and about seven (7) mm. A second transition corner490may be defined between the bead seat430and the proximal surface440of the bead hump480. The second transition corner490may be chamfered, having a second radius. The second radius may be about one (1) mm. In other optional embodiments, the second radius may be between about zero-point-two-five (0.25) mm and about two (2) mm. A third transition corner492may be defined between the top surface450and the proximal surface440of the bead hump480. The third transition corner492may be chamfered, having a third radius. The third radius may be about zero-point-five (0.5) mm. In certain optional embodiments, the third radius may be about zero-point-three (0.3) mm. In other optional embodiments, the third radius may be between about zero-point-one (0.1) mm and about one (1) mm.", "", "The proximal surface440of the bead hump480may be angled relative to the bead seat430, for example, at a second angle494. In certain optional embodiments, the second angle494may be between about eighty (80) degrees and about one-hundred (100) degrees. In other optional embodiments, the second angle494may be between about eighty-five (85) degrees and about ninety-five (95) degrees. In further optional embodiments, the second angle494may be about ninety (90) degrees. Alternatively, the proximal surface440may be angled at about nine-point-nine (9.9) degrees relative to the vertical axis (y-axis), or more broadly, between about five (5) and fifteen (15) degrees. Other angles may be possible to achieve the effect of maintaining the integrity of the wheel to tire coupling and preventing slippage of the tire into the drop center200of the wheel, even when the tire is at low pressure. In some embodiments, an angle between the bead seat430and the top of the proximal surface440may be about fifteen-point-five (15.5) degrees relative to a plane parallel to the surface of the ground (x-axis), although other angles may be possible in some embodiments. The proximal surface440is present with a slightly curved profile and extends at an approximately constant angle to the top surface450of the bead hump480. In one embodiment, the proximal surface440measures about zero-point-nine (0.9) mm. In certain optional embodiments, the proximal surface440measures about one-point-nine (1.9) mm relative and perpendicular to the bead seat430. In other optional embodiments, the proximal surface440measures less than about three (3) mm relative and perpendicular to the bead seat430.", "", "The top surface450of the bead hump480extends from the proximal surface440to the distal surface460. The top surface450may have an essentially constant surface profile. The top surface450joins the distal surface460of the bead hump480after which the distal surface460descends toward the drop center200of the wheel. A bottom of the distal surface460may be defined as a portion that is essentially the same radial distance from a center of the wheel as that of a radially closest portion of a surface of the bead seat430. The distal surface460of the bead hump480may be angled relative to the top surface450, for example, at a third angle496relative to the horizontal axis (x-axis). In certain optional embodiments, the third angle496may be between about five (5) degrees and about thirty (30) degrees. In other optional embodiments, the third angle496may be between about twelve (12) degrees and about twenty-one (21) degrees. In further optional embodiments, the third angle496may be about fifteen-point-five (15.5) degrees. In still further optional embodiments, the third angle496may be greater than twenty (20) degrees.", "", "The back flange410may be taller than the bead hump480. In certain optional embodiments, the back flange410may be at least fourteen-point-five (14.5) mm tall relative to the bead seat430. A distance between the interior flange surface420and the proximal surface440of the bead hump480may be between about fourteen-point-five (14.5) mm and about fifteen-point-seven (15.7) mm.", "", "FIG.6shows a cross-sectional view of an embodiment of the spoke section20or the barrel section30of the wheel10.FIG.6includes element numbering for both the spoke section20and the barrel section30.", "", "The wheel10may be made of many different materials, including composite materials such as discontinuous carbon fiber. The term “discontinuous carbon fiber” as used herein includes discontinuous fiber reinforced composites which may be discontinuous and aligned or discontinuous and randomly oriented. The discontinuous fibers consist essentially of carbon, ranging from graphite fibers to amorphous carbon fibers. Graphite fibers are fibers which consist essentially of carbon and have a predominant X-ray diffraction pattern characteristic of graphite. Amorphous carbon fibers are fibers which consist essentially of carbon and have an essentially amorphous X-ray diffraction pattern. Additionally, the term also includes other high strength, low density materials such as boron, fiber glass or the like or any of the forgoing in a mixture, such as 1-99% carbon fiber mixed with 99-1% fiber glass. For example, the wheel10may comprise one or more of the following composite materials a carbon fiber/fiber mixture, carbon fiber or fiber glass. Additionally, additives such as nanoparticles may be added to the composite materials before molding. Additionally, the wheel10disclosed herein may not be manufactured from a composite material but rather a metallic material such as aluminum, steel or other alloy. In an embodiment where the wheel10is manufactured from a metallic material, the components of the wheel may be forged, cast or machined. In addition to the composite materials and optionally the nanoparticles, a resin is used to bind the composite materials during molding. In one embodiment, the resin is selected from the group consisting of epoxies, polyurethane, rubber and polyester resins. In a further embodiment the resin is a vinyl ester/polyurethane resin or any other thermoset or thermoplastic polymeric resin or a metallic matrix. In other alternate embodiments, the resin may be selected from the group consisting of butadiene rubber, ethylene-propylene-diene rubber, melamine formaldehyde, natural rubber, phenol-formaldehyde, polyamide, polycarbonate, polypropylene and polytetrafluoroethylene.", "", "The wheel10may be constructed using various methods of manufacture including compression molding. In one embodiment, the wheel10is constructed using a sheet molding compound (SMC) process or a bulk molding compound (BMC) process.", "", "Throughout the specification and claims, the following terms take at least the meanings explicitly associated herein, unless the context dictates otherwise. The meanings identified below do not necessarily limit the terms, but merely provide illustrative examples for the terms. The meaning of “a,” “an,” and “the” may include plural references, and the meaning of “in” may include “in” and “on.” The phrase “in one embodiment,” as used herein does not necessarily refer to the same embodiment, although it may.", "", "Although embodiments of the present invention have been described in detail, it will be understood by those skilled in the art that various modifications can be made therein without departing from the spirit and scope of the invention as set forth in the appended claims.", "", "It will be understood that the particular embodiments described herein are shown by way of illustration and not as limitations of the invention. The principal features of this invention may be employed in various embodiments without departing from the scope of the invention. Those of ordinary skill in the art will recognize numerous equivalents to the specific procedures described herein. Such equivalents are considered to be within the scope of this invention and are covered by the claims.", "", "All of the compositions and/or methods disclosed and claimed herein may be made and/or executed without undue experimentation in light of the present disclosure. While the compositions and methods of this invention have been described in terms of the embodiments included herein, it will be apparent to those of ordinary skill in the art that variations may be applied to the compositions and/or methods and in the steps or in the sequence of steps of the method described herein without departing from the concept, spirit, and scope of the invention. All such similar substitutes and modifications apparent to those skilled in the art are deemed to be within the spirit, scope, and concept of the invention as defined by the appended claims.", "", "The previous detailed description has been provided for the purposes of illustration and description Thus, although there have been described particular embodiments of a new and useful invention, it is not intended that such references be construed as limitations upon the scope of this disclosure except as set forth in the following claims."], "claims": ["a spoke section with a mating surface; a barrel section in contact with the spoke section at said mating surface; and a bead hump with tire lock geometry defined on at least the spoke section, the tire lock geometry including a flange with an interior flange surface and a bead seat positioned between the bead hump and the flange.", "2 . The wheel of claim 1 wherein the bead seat is angled relative to the interior flange surface of the flange at a first angle of about 92 degrees to about 98 degrees.", "3 . The wheel of claim 1 wherein a first transition corner is defined between the interior flange surface and the bead seat, the first transition corner chamfered with a radius of about 4.5 mm.", "4 . The wheel of claim 1 wherein the bead hump includes a proximal surface relative to the flange and at least partially facing the interior flange surface.", "5 . The wheel of claim 4 wherein a second transition corner is defined between the proximal surface of the bead hump and the bead seat, the second transition corner chamfered with a radius of about 1 mm.", "6 . The wheel of claim 4 wherein the proximal surface is angled relative to the bead seat at a second angle, the second angle being between about 85 degrees and about 95 degrees.", "7 . The wheel of claim 4 wherein a third transition corner is defined between the proximal surface of the bead hump and a top surface of the bead hump, the third transition corner chamfered with a radius between about 0.3 mm and about 0.5 mm.", "8 . The wheel of claim 1 wherein a top surface of the bead hump is perpendicular to the interior flange surface.", "9 . The wheel of claim 1 wherein said flange is taller than the bead hump.", "10 . The wheel of claim 1 wherein the flange is at least 14.5 mm tall relative to the bead seat.", "11 . The wheel of claim 1 wherein a top surface of the bead hump is at least 0.9 mm tall relative to the bead seat.", "12 . The wheel of claim 1 wherein a distal surface of the bead hump relative to the flange is angled relative to a top surface of the bead hump at a third angle greater than or equal to about 15.5 degrees.", "13 . The wheel of claim 1 wherein the wheel comprises a carbon fiber material.", "14 . The wheel of claim 1 wherein the wheel comprises a discontinuous carbon fiber material.", "a spoke section with a mating surface; a barrel section in contact with the spoke section at said mating surface; and a bead hump with tire lock geometry on each of the spoke section and the barrel section of the wheel.", "16 . The wheel of claim 15 wherein the spoke section and the barrel section each comprises a flange and a bead seat.", "17 . The wheel of claim 16 wherein said flanges are taller than said bead humps.", "18 . The wheel of claim 16 wherein the flanges are at least 14.5 mm tall relative to said bead seats and said bead humps are at least 0.9 mm tall relative to said bead seats.", "19 . the wheel of claim 15 wherein the wheel comprises a carbon fiber material.", "20 . The wheel of claim 15 wherein the wheel comprises a discontinuous carbon fiber material."], "bibtex": "@patent{20240066917,\n    title = {COMPOSITE WHEEL WITH BEAD HUMP HAVING TIRE LOCK GEOMETRY},\n    number = {20240066917},\n    year = {2024},\n    note = {File: US20240066917A1-20240229.XML}\n    }", "classification": "B60B2500FI"}, {"title": "WHEEL BEARING UNIT FOR A MOTOR VEHICLE AND MOTOR VEHICLE", "doc_number": "20240066918", "filename": "US20240066918A1-20240229.XML", "abstract": "A wheel bearing unit for a motor vehicle, comprising a wheel hub, a wheel bearing housing and a rolling bearing by which the wheel hub is mounted rotatably in relation to the wheel bearing housing. The rolling bearing has at least one row of rolling elements which are guided on the wheel hub side in a bearing inner ring which is designed as a separate component in relation to the wheel hub and which is fixedly connected to the wheel hub. The wheel hub has a through opening with an inner toothing, via which through opening the wheel hub can be connected in a non-rotational manner to a drive journal which is provided with an external toothing.", "detailed_description": ["FIG.1shows a wheel bearing unit for a motor vehicle, indicated in its totality by the reference numeral10. The wheel bearing unit10comprises a wheel hub12, a wheel bearing housing14and a rolling bearing16, via which the wheel hub12is rotatably mounted relative to the wheel bearing housing14.", "", "As can be further seen fromFIG.1, the rolling bearing16has two rows of rolling elements18. While the left row of rolling elements18—inFIG.1—rolls in a bearing race formed in the wheel hub12, the right row of rolling elements18is guided in a bearing inner ring20having a corresponding bearing race and which is firmly connected to the wheel hub12.", "", "The wheel hub12also has a through opening22, which is provided in some regions with an inner toothing24. Via the inner toothing24, the wheel hub12can be non-rotatably connected in a known manner to a drive journal of a joint source—not shown here for reasons of clarity—which has external toothing corresponding to the inner toothing24. In the following, the reference sign DZdenotes the root diameter of the inner toothing24.", "", "A disadvantage of the prior art is that as a result of the local material taper of the wheel hub12caused by the bearing inner ring20, in particular in the region of the transition to the end face20-1of the bearing inner ring20on the bearing inner side, high notch stresses occur in the tooth base of the inner toothing24, which in turn can lead to toothing cracks in the inner toothing24and thus cause premature failure of the wheel hub12or the wheel bearing unit10. This is where the invention comes in:", "", "AsFIG.2andFIG.3show, it is now provided that the inner toothing24has a first toothing portion24-1, a second toothing portion24-2and a toothless portion24-3, which, viewed in the axial direction a, lies between the two toothing portions24-1,24-2and separates the two toothing portions24-1,24-2from one other.", "", "As can be further seen fromFIG.2and in particularFIG.3, the portions24-1,24-2,24-3forming the inner toothing24are arranged and dimensioned in such a way that, viewed in the axial direction a, the toothless portion24-3is positioned radially opposite the end face20-1of the bearing inner ring20on the bearing inner side.", "", "Since the inner toothing24is now designed to be toothless in the critical portion of the wheel hub12, i.e. in the region of the transition to the end face20-1of the bearing inner ring20on bearing inner side, it is ensured in an advantageous manner that the local notch stresses leading to toothing cracks are reduced, which has a positive effect on the service life of the wheel hub12and thus of the wheel bearing unit10.", "", "The toothless portion24-3is formed in the present case in the form of an undercut or turned region introduced into the through opening22, and has a diameter DAbwhich in the present case is 10% larger than the root diameter D F of the inner toothing24.", "", "Viewed in the axial direction a, the toothless portion24-3is dimensioned such that it has an axial length LAbcorresponding to 10% to 30% of the total length Llnof the inner toothing24, seeFIG.2andFIG.3.", "", "As can be further seen fromFIG.2, the through opening22of the wheel hub12has, in addition to the region forming the inner toothing24, hereinafter also referred to as the support region22-1, a fastening region22-2, as well as an intermediate region22-3arranged between the support region22-1and the fastening region22-2—as viewed in the axial direction a-.", "", "The reference sign LBdenotes the axial length of the fastening region22-2, and the reference sign LZdenotes the axial length of the intermediate region22-3. Accordingly, the diameter of the fastening region22-2is denoted by D B and the diameter of the intermediate region22-3by DZ, seeFIG.2.", "", "In order to minimize the wear of the broaching tool during the manufacture of the inner toothing24, the diameter of the intermediate region DZis larger than the root diameter DFof the inner toothing24. In addition to the lower wear, the increase in diameter also advantageously results in a weight saving. In the present case, the diameter DZis selected so that it corresponds to the diameter DAbof the toothless portion24-3, i.e.", "", "DZ=DAb=1.1*DF", "", "Thus, the regions24-3and24-2can advantageously be manufactured in one working step. The fastening region22-2is dimensioned in such a way that the fastening diameter DBis larger than the root diameter DFby a factor of 1.2. This ensures that a sufficiently large fastening shoulder26is available for the fastening means, such as a nut or bolt, via which the wheel hub12is connected to the drive journal of a joint source, seeFIG.2.", "", "To ensure a compact design of the wheel bearing unit10, the axial lengths LBand LZof regions22-2and22-3are presently dimensioned such that the axial length LBof the fastening region22-2corresponds to about 30% to 60% of the total length Llnof the inner toothing24and the axial length LZof the intermediate region22-3corresponds to about 50% to 70% of the total length Llnof the inner toothing24."], "claims": ["wherein the inner toothing is formed comprising a first toothing portion, a second toothing portion and a toothless portion which, viewed in the axial direction, lies between the two toothing portions and separates the two toothing portions from one another, wherein the toothless portion of the inner toothing, viewed in the axial direction, is arranged in such a way that the toothless portion is positioned radially opposite the end face of the bearing inner ring on the bearing inner side.", "2 . A wheel bearing unit according to claim 1 , wherein relative to a root diameter of the toothing portions of the inner toothing, the toothless portion of the inner toothing has a diameter for which applies: 1 ≤ diameter ⁢ ( D Ab ) ⁢ of ⁢ the ⁢ toothless ⁢ portion root ⁢ diameter ⁢ ( D F ) . ≤ 1 , 2", "3 . The wheel bearing unit according to claim 1 , wherein the through opening of the wheel hub comprises a support region having the inner toothing, a fastening region having a bearing shoulder, and an intermediate region arranged between the support and fastening regions—as viewed in the axial direction—and in that, relative to the root diameter, the intermediate region has an intermediate region diameter for which applies: intermediate ⁢ region ⁢ diameter ⁢ ( D Z ) root ⁢ diameter ⁢ ( D F ) . > 1", "4 . The wheel bearing unit according to claim 2 , wherein the intermediate region diameter is greater than or equal to the diameter of the toothless portion of the inner toothing.", "5 . The wheel bearing unit according to claim 2 , wherein relative to the root diameter, the fastening region has a fastening region diameter for which applies: fastening ⁢ region ⁢ diameter ⁢ ( D B ) root ⁢ diameter ⁢ ( D F ) . ≥ 1 , 2", "6 . The wheel bearing unit according to claim 1 , wherein viewed in the axial direction, the inner toothing has a length, and in that, relative to the length of the inner toothing, the toothless portion has an axial portion length for which applies: 0.1 ≤ portion ⁢ length ⁢ ( L Ab ) length ⁢ of ⁢ inner ⁢ toothing ⁢ ( L In ) . ≤ 0.3", "7 . The wheel bearing unit according to claim 3 , wherein viewed in the axial direction, the inner toothing has a length, and in that relative to the length of the inner toothing, the intermediate region has an axial intermediate region length for which applies: 0.5 ≤ intermediate ⁢ region ⁢ length ⁢ ( L Z ) length ⁢ of ⁢ inner ⁢ toothing ⁢ ( L In ) . ≤ 0.7", "8 . The wheel bearing unit according to claim 3 , wherein viewed in the axial direction, the inner toothing has a length, and in that, relative to the length of the inner toothing, the fastening region has an axial fastening region length for which applies: 0.3 ≤ intermediate ⁢ region ⁢ length ⁢ ( L B ) length ⁢ of ⁢ inner ⁢ toothing ⁢ ( L In ) . ≤ 0.6", "characterized in that the toothless portion of the inner toothing is formed like an undercut.", "10 . A motor vehicle, comprising a wheel bearing unit, the wheel bearing unit is formed according to claim 1 .", "11 . The wheel bearing unit according to claim 2 , wherein the through opening of the wheel hub comprises a support region having the inner toothing, a fastening region having a bearing shoulder, and an intermediate region arranged between the support and fastening regions—as viewed in the axial direction—and in that, relative to the root diameter, the intermediate region has an intermediate region diameter for which applies: intermediate ⁢ region ⁢ diameter ⁢ ( D Z ) root ⁢ diameter ⁢ ( D F ) . > 1", "12 . The wheel bearing unit according to claim 3 , wherein the intermediate region diameter (D Z ) is greater than or equal to the diameter of the toothless portion of the inner toothing.", "13 . The wheel bearing unit according to claim 3 , wherein relative to the root diameter, the fastening region has a fastening region diameter for which applies: fastening ⁢ region ⁢ diameter ⁢ ( D B ) root ⁢ diameter ⁢ ( D F ) . ≥ 1 , 2"], "bibtex": "@patent{20240066918,\n    title = {WHEEL BEARING UNIT FOR A MOTOR VEHICLE AND MOTOR VEHICLE},\n    number = {20240066918},\n    year = {2024},\n    note = {File: US20240066918A1-20240229.XML}\n    }", "classification": "B60B2700FI"}, {"title": "DRIVE AXLE ASSEMBLY", "doc_number": "20240066919", "filename": "US20240066919A1-20240229.XML", "abstract": "A drive axle assembly capable of reducing drag torque by eliminating an inner bearing seal from a wheel bearing and capable of reducing the generation of frictional noise at corrugations of a boot. The drive axle assembly includes a wheel bearing assembled with a wheel housing, an outer ring having a ring shape and including an outer-diameter portion secured to an outer wheel of a wheel bearing, a boot including a large-diameter portion formed at one end thereof and assembled with an inner-diameter portion of the outer ring, and a bearing seal unit disposed between a small-diameter portion formed at the other end of the boot and a drive shaft to restrict rotation of the boot and to prevent introduction of foreign substances.", "detailed_description": ["Various exemplary embodiments will now be described more fully with reference to the accompanying drawings, in which only some exemplary embodiments are shown. Specific structural and functional details disclosed herein are merely representative for the purpose of describing exemplary embodiments. The present disclosure, however, may be embodied in many alternative forms, and should not be construed as being limited to the exemplary embodiments set forth herein.", "", "Accordingly, while exemplary embodiments of the disclosure are capable of being variously modified and taking alternative forms, embodiments thereof are shown by way of example in the drawings and will herein be described in detail. It should be understood, however, that there is no intent to limit the present disclosure to the particular exemplary embodiments disclosed. On the contrary, exemplary embodiments are to cover all modifications, equivalents, and alternatives falling within the scope of the disclosure.", "", "It will be understood that, although the terms “first”, “second”, etc. may be used herein to describe various elements, these elements should not be limited by these terms. These terms are only used to distinguish one element from another. For example, a first element could be termed a second element, and, similarly, a second element could be termed a first element, without departing from the scope of exemplary embodiments of the present disclosure.", "", "It will be understood that when an element is referred to as being “connected” or “coupled” to another element, it can be directly connected or coupled to the other element, or intervening elements may be present. In contrast, when an element is referred to as being “directly connected” or “directly coupled” to another element, there are no intervening elements present. Other words used to describe the relationship between elements should be interpreted in a like fashion (e.g. “between” versus “directly between”, “adjacent” versus “directly adjacent”, etc.).", "", "The terminology used herein is for the purpose of describing particular embodiments only and is not intended to be limiting of exemplary embodiments of the disclosure. As used herein, the singular forms “a”, “an”, and “the”, are intended to include the plural forms as well, unless the context clearly indicates otherwise. It will be further understood that the terms “comprises”, “comprising”, “includes”, and/or “including”, when used herein, specify the presence of stated features, integers, steps, operations, elements, components, or combinations thereof, but do not preclude the presence or addition of one or more other features, integers, steps, operations, elements, components, or combinations thereof.", "", "Unless otherwise defined, all terms used herein, which include technical or scientific terms, have the same meanings as those generally appreciated by those skilled in the art. The terms, such as ones defined in common dictionaries, should be interpreted as having the same meanings as terms in the context of pertinent technology, and should not be interpreted as having ideal or excessively formal meanings unless clearly defined in the specification.", "", "Hereinafter, an exemplary embodiment of the present disclosure will be described in detail with reference to the accompanying drawings.", "", "FIG.1is a cross-sectional view showing a drive axle assembly according to the present disclosure.", "", "Referring to the drawing, the drive axle assembly of the present disclosure is an integrated drive axle (IDA), in which an outer wheel210of a wheel bearing200is secured to a knuckle or a carrier, in which balls (or rollers)230and a cage are assembled and integrated with each other between the outer wheel210and an inner wheel220of the wheel bearing200, and in which the wheel bearing200is fitted on the outer circumferential surface of a wheel housing100.", "", "An orbital forming process is performed on the distal end portion of the wheel housing100such that the distal end portion of the wheel housing100is bent radially outwards, and the wheel bearing200is preloaded such that the inner wheel220is secured to the wheel housing100.", "", "A drive shaft500is connected to the inside of the wheel housing100via a constant velocity joint. Accordingly, the drive force of a powertrain is transmitted to the constant velocity joint through the drive shaft500, and the constant velocity joint is moved and articulated according to the behavior of the vehicle, whereby the wheel housing100is rotated.", "", "A boot assembly including a boot400is disposed between the outer wheel210of the wheel bearing200and the drive shaft500and is assembled therewith in the state in which rotation is restricted.", "", "Referring toFIGS.1and2, the present disclosure includes the wheel bearing200, which is assembled with the wheel housing100, an outer ring300, which has a ring shape and includes an outer-diameter portion300asecured to the outer wheel210of the wheel bearing200, the boot400, which includes a large-diameter portion400aformed at one end thereof and assembled with an inner-diameter portion300bof the outer ring300, and a bearing seal unit, which is disposed between a small-diameter portion400bformed at the other end of the boot400and the drive shaft500so as to restrict rotation of the boot400and prevent the introduction of foreign substances.", "", "In an example, the outer ring300, which is made of a plastic material, is secured to the large-diameter portion400aof the boot400, and is coupled to the outer wheel210of the wheel bearing200.", "", "The bearing seal unit is disposed between the small-diameter portion400bof the boot400and the drive shaft500and is assembled therewith so as to surround a portion of the drive shaft500, thereby allowing the drive shaft500to rotate relative to the boot400and restricting rotation of the boot400.", "", "As described above, since the region between the outer wheel210and the inner wheel220of the wheel bearing200is covered by the outer ring300, the introduction of foreign substances into the wheel bearing200is prevented. Accordingly, a conventional inner bearing seal is eliminated, which makes it possible to reduce drag torque, thus improving the fuel efficiency of the vehicle.", "", "Furthermore, since the boot400is prevented from rotating even when the constant velocity joint rotates, the corrugations of the boot400are not repeatedly folded and unfolded in the circumferential direction when the vehicle makes a full turn or travels in any of various other drive modes. Accordingly, it possible to prevent the occurrence of frictional noise attributable to repeated contact and separation between the corrugations of the boot while the vehicle is traveling.", "", "As shown inFIG.2, the outer ring300may directly face the balls230provided in the wheel bearing200through the space between the outer wheel210and the inner wheel220of the wheel bearing200.", "", "That is, the outer ring300is coupled to the outer wheel210of the wheel bearing200, and thus blocks the space between the outer wheel210and the inner wheel220of the wheel bearing200, thereby preventing foreign substances from entering the wheel bearing200.", "", "As described above, a conventional inner bearing seal is eliminated from the wheel bearing, and the outer ring300is disposed so as to face the balls230provided in the wheel bearing200. Accordingly, it is possible to prevent drag torque from increasing due to the inner bearing seal.", "", "In addition, the outer ring300is provided with an ABS sensor320.", "", "In an example, the ABS sensor320is mounted in the outer ring300, which is adjacent to the wheel bearing200, to detect the wheel speed.", "", "Still referring toFIG.2, the bearing seal unit includes a shaft bearing600and a shaft seal700.", "", "In detail, the bearing seal unit includes the shaft bearing600, which surrounds a portion of the drive shaft500and is disposed between the small-diameter portion400bof the boot400and the drive shaft500so as to be assembled therewith, and the shaft seal700, which is disposed between the shaft bearing600and the distal end of the small-diameter portion400bof the boot400so as to be assembled therewith.", "", "The shaft bearing600may be, for example, a ball bearing or a needle bearing. The inner wheel of the shaft bearing600is supported by the drive shaft500, and the outer wheel of the shaft bearing600is supported by the small-diameter portion400bof the boot400.", "", "Since the shaft seal700is mounted inside the distal end of the small-diameter portion400bof the boot400so as to surround a portion of the drive shaft500, introduction of foreign substances into the shaft bearing600and the boot400is prevented.", "", "Although the shaft seal700affects the drag torque, the shaft seal700has a very short circumferential length compared to the conventional inner bearing seal mounted to the wheel bearing200due to the positional characteristics of the shaft seal700, which is provided on the drive shaft500. Accordingly, compared to the case in which the inner bearing seal is provided, drag torque is reduced, whereby the fuel efficiency of the vehicle is improved.", "", "FIG.3is a cross-sectional view of the bearing housing800according to the present disclosure.", "", "Referring to the drawing, the bearing housing800may be press-fitted into the boot400so as to be in contact with the inner circumferential surface of the small-diameter portion400bof the boot400and to surround the shaft bearing600and the shaft seal700, and the bearing housing800may have a stepped portion820formed on the inner surface thereof to form a boundary between the shaft bearing600and the shaft seal700.", "", "In an example, the shaft bearing600is disposed on a portion of the inner surface of the bearing housing800that is adjacent to the large-diameter portion400aof the boot400with respect to the stepped portion820, and the shaft seal700is disposed on a portion of the inner surface of the bearing housing800that is adjacent to the small-diameter portion400bof the boot400with respect to the stepped portion820.", "", "That is, the shaft bearing600and the shaft seal700may be securely and stably disposed in the bearing housing800due to the stepped portion820, which is formed on the middle of the inner surface of the bearing housing800.", "", "In an example, the shaft bearing600and the shaft seal700may be press-fitted into the bearing housing800, and the bearing housing800may be integrated with the boot400.", "", "In addition, referring toFIGS.2and3, the boot400includes a housing support portion410, which extends radially inwards from the distal end of the small-diameter portion400bof the boot400, and the bearing housing800includes a seal support portion810, which extends radially inwards from the end of the bearing housing800that faces the housing support portion410. The seal support portion810is supported by the inner surface of the housing support portion410.", "", "That is, the seal support portion810is in close contact with the inner surface of the housing support portion410, thereby preventing external foreign substances from entering the boot400through a gap between the small-diameter portion400bof the boot400and the bearing housing800.", "", "In addition, the bearing housing800includes a maze-forming portion812, which extends in a stepped form toward the housing support portion410along the inner circumferential surface of the seal support portion810, and the boot400includes a foreign-substance-blocking portion412, which extends radially inwards in a stepped form along the inner circumferential surface of the housing support portion410to cover the maze-forming portion812.", "", "In an example, the foreign-substance-blocking portion412extends radially inwards toward the drive shaft500, and covers the maze-forming portion812in the axial direction.", "", "Accordingly, even if foreign substances are introduced into the space between the foreign-substance-blocking portion412and the drive shaft500, the foreign substances are prevented from entering the region between the housing support portion410and the seal support portion810because the maze-forming portion812is in close contact with the inner surface of the foreign-substance-blocking portion412.", "", "Consequently, external foreign substances are prevented from entering the boot400through the gap between the small-diameter portion400bof the boot400and the bearing housing800. In addition, the shaft seal700reliably prevents introduction of foreign substances into the boot400.", "", "In addition, the present disclosure further includes a reinforcement ring310, which is coupled to the outer-diameter portion300aof the outer ring300.", "", "The reinforcement ring310may be inserted into the wheel bearing200such that the outer circumferential surface of the reinforcement ring310is in contact with the inner circumferential surface of the outer wheel210of the wheel bearing200.", "", "In an example, the reinforcement ring310may be made of a steel material, and may be integrally formed with the outer ring300. The boot400may be integrally manufactured with the bearing housing800and the outer ring300, with which the ABS sensor320is integrally formed.", "", "FIGS.4and5are views showing the structure in which the outer ring300is coupled to the inner circumferential surface of the outer wheel210of the wheel bearing200according to the present disclosure. The reinforcement ring310and the outer wheel210of the wheel bearing200corresponding thereto may be coupled to each other in a groove-and-protrusion coupling manner.", "", "In an example, referring toFIG.4, the reinforcement ring310has an assembly groove312formed in the outer circumferential surface thereof in the circumferential direction, and the outer wheel210of the wheel bearing200has an assembly protrusion212formed on the inner circumferential surface thereof in the circumferential direction so as to correspond to the assembly groove312. The assembly protrusion212is fitted into the assembly groove312.", "", "In another example, referring toFIG.5, the reinforcement ring310has an assembly protrusion314formed on the outer circumferential surface thereof in the circumferential direction, and the outer wheel210of the wheel bearing200has an assembly groove214formed in the inner circumferential surface thereof in the circumferential direction so as to correspond to the assembly protrusion314. The assembly protrusion314is fitted into the assembly groove214.", "", "Accordingly, the reinforcement ring310is securely assembled with the outer wheel210of the wheel bearing200, thereby preventing the boot400from being separated from the outer wheel210of the wheel bearing200.", "", "Furthermore, the distal end of the inner circumferential surface of the outer wheel210of the wheel bearing200is formed at an incline in a chamfered form, whereby the assembly protrusion314formed on the reinforcement ring310may be easily fitted into the assembly groove214formed in the outer wheel210.", "", "FIGS.6and7are views showing the structure in which an O-ring O is interposed between the outer wheel210of the wheel bearing200and the outer ring300according to the present disclosure. An O-ring O may be interposed between the reinforcement ring310and the outer wheel210of the wheel bearing200corresponding thereto.", "", "In an example, referring toFIG.6, the reinforcement ring310may have a ring groove316formed in the outer circumferential surface thereof in the circumferential direction, and the O-ring O may be fitted into the ring groove316.", "", "In another example, referring toFIG.7, the outer wheel210of the wheel bearing200may have a ring groove216formed in the inner circumferential surface thereof in the circumferential direction, and the O-ring O may be fitted into the ring groove216.", "", "The O-ring O serves not only to prevent foreign substances from entering the wheel bearing200but also to prevent grease from leaking from the wheel bearing200.", "", "FIGS.8and9are views showing the structure in which the outer ring300is coupled to the outer circumferential surface of the outer wheel210of the wheel bearing200according to the present disclosure. A portion of the outer wheel210may be inserted into the outer ring300such that the outer circumferential surface thereof is in contact with the inner circumferential surface of the outer ring300.", "", "In an example, referring toFIG.8, the outer wheel210may have a stepped insertion portion218, which extends from the end of the outer circumferential surface thereof in a stepped form so as to have a reduced outer diameter. The stepped insertion portion218may be press-fitted into the outer ring300such that the outer circumferential surface thereof is in contact with the inner circumferential surface of the outer ring300.", "", "That is, the stepped insertion portion218may be formed so as to be stepped from the outer circumferential surface of the distal end of the outer wheel210of the wheel bearing200. The stepped insertion portion218may be press-fitted into the outer ring300such that the distal end of the stepped insertion portion218in the axial direction is in close contact with the inner surface of the outer ring300, thereby ensuring a seal between the outer wheel210and the outer ring300and preventing separation of the boot400.", "", "In an example, in the case in which the reinforcement ring310is secured to the inner circumferential surface of the outer ring300, the reinforcement ring310may be in close contact with the outer circumferential surface of the stepped insertion portion218.", "", "In another example, referring toFIG.9, the outer wheel210may have a stepped insertion portion218that extends from the end of the outer circumferential surface thereof in a stepped form so as to have a reduced outer diameter, and the outer ring300may have a stepped insertion groove308formed in the outer-diameter portion300athereof so as to correspond to the stepped insertion portion218. The stepped insertion portion218may be press-fitted into the stepped insertion groove308.", "", "That is, the stepped insertion portion218may be formed so as to be stepped from the outer circumferential surface of the distal end of the outer wheel210of the wheel bearing200. The stepped insertion portion218may be press-fitted into the stepped insertion groove308formed in the outer ring300such that the stepped insertion portion218is enveloped by the outer ring300and such that the distal end of the stepped insertion portion218in the axial direction is in close contact with the end of the inner surface of the stepped insertion groove308, thereby ensuring a seal between the outer wheel210and the outer ring300and preventing separation of the boot400.", "", "FIG.10is an enlarged view of portion B inFIG.1.", "", "Referring to the drawing, the large-diameter portion400aof the boot400envelopes the inner-diameter portion300bof the outer ring300, and thus a gap g1having a size less than a predetermined value may be formed between the large-diameter portion400aof the boot400and the wheel housing100. The outer ring300may have a protruding portion302formed on the inner surface thereof toward the wheel bearing200, and thus a gap g2having a size less than a predetermined value may be formed between the protruding portion302and the inner surface of the wheel bearing200.", "", "In an example, a fine gap may be formed between the inner wheel220of the wheel bearing200and the inner surface of the outer ring300that faces the inner wheel220, and a fine gap may be formed between the distal end of the wheel housing100, which has undergone an orbital forming process, and the large-diameter portion400aof the boot400, which faces the distal end of the wheel housing100.", "", "A maze structure is formed in the boot400due to formation of the two fine gaps, thereby making it possible to prevent grease for the constant velocity joint in the wheel housing100and grease for the bearing in the wheel bearing200from mixing.", "", "FIG.11Ais a view for explaining numerical relationships between main components of the drive axle assembly according to the present disclosure andFIG.11Bis an enlarged view for explaining a right side part of the drive axle assembly inFIG.11A. Referring toFIG.11B, the ratio of the length b of the bearing housing800in the axial direction, excluding the maze-forming portion812, to the length C from the inner surface of the bearing housing800that faces the shaft seal700to the distal end of the shaft bearing600may be expressed using Expression (1) below.", "", "1.1≤b/C≤1.4  (1)", "", "Here, “b” represents the length of the bearing housing in the axial direction, excluding the maze-forming portion, and “C” represents the length from the inner surface of the bearing housing that faces the shaft seal to the distal end of the shaft bearing.", "", "According to the above numerical relationships, the shaft bearing600and the shaft seal700are stably assembled in the bearing housing800, whereby the ease of assembly of the bearing seal unit may be improved, and the sealing capability thereof may be ensured.", "", "Still referring toFIG.11A, the ratio of the outer diameter d2of the portion of the drive shaft500that is assembled with the bearing seal unit to the outer diameter d1of a spline portion of the distal end of the drive shaft500may be expressed using Expression (2) below.", "", "1.03≤d2/d1≤1.16  (2)", "", "Here, “d2” represents the outer diameter of the portion of the drive shaft that is assembled with the bearing seal unit, and “d1” represents the outer diameter of a spline portion of the distal end of the drive shaft.", "", "According to the above numerical relationships, the ease of assembly of the components may be improved, and vibration of rotary bodies, including the drive shaft500, may be reduced.", "", "Still referring toFIGS.11A and11B, the ratio of the inner diameter D2of the distal end of the small-diameter portion400bof the boot400to the outer diameter d2of a portion of the drive shaft500that is assembled with the bearing seal unit may be expressed using Expression (3) below.", "", "0.9≤D2/d2≤1  (3)", "", "Here, “D2” represents the inner diameter of the distal end of the small-diameter portion of the boot, and “d2” represents the outer diameter of a portion of the drive shaft that is assembled with the bearing seal unit.", "", "According to the above numerical relationships, the foreign-substance-blocking portion412is formed in the maze-forming portion812, thereby realizing a maze structure, thus preventing the introduction of foreign substances thereinto.", "", "Still referring toFIG.11A, the ratio of the length L from the center of a groove formed in the wheel housing100to the center of the shaft bearing600to the outer diameter D1of a portion of the wheel housing100that is assembled with the inner wheel220of the wheel bearing200may be expressed using Expression (4) below.", "", "0.56≤L/D1≤0.73  (4)", "", "Here, “L” represents the length from the center of a groove formed in the wheel housing to the center of the shaft bearing, and “D1” represents the outer diameter of a portion of the wheel housing that is assembled with the inner wheel of the wheel bearing.", "", "As is apparent from the above description, according to the present disclosure, the conventional inner bearing seal, which seals the gap between the outer wheel210and the inner wheel220of the wheel bearing200, is eliminated, and the outer ring300is provided so as to cover the outer wheel210, thereby not only preventing the introduction of foreign substances but also reducing drag torque generated by a seal, thus improving the fuel efficiency of the vehicle.", "", "In addition, since the boot400is prevented from rotating, the corrugations of the boot400are not repeatedly folded and unfolded in the circumferential direction when the vehicle makes a full turn or travels in any of various other drive modes. Accordingly, it possible to prevent the occurrence of frictional noise attributable to repeated contact and separation between the corrugations of the boot while the vehicle is traveling.", "", "Although specific embodiments of the present disclosure have been disclosed for illustrative purposes, those skilled in the art will appreciate that various modifications, additions and substitutions are possible, without departing from the scope and spirit of the disclosure as disclosed in the accompanying claims."], "claims": ["a wheel bearing assembled with a wheel housing; an outer ring having a ring shape and comprising an outer-diameter portion secured to an outer wheel of a wheel bearing; a boot comprising a large-diameter portion formed at one end thereof and assembled with an inner-diameter portion of the outer ring; and a bearing seal unit disposed between a small-diameter portion formed at another end of the boot and a drive shaft to restrict rotation of the boot and to prevent introduction of foreign substances.", "2 . The drive axle assembly according to claim 1 , wherein the outer ring directly faces balls provided in the wheel bearing through a space between the outer wheel and an inner wheel of the wheel bearing.", "3 . The drive axle assembly according to claim 1 , wherein the outer ring is provided with an anti-lock brake system sensor.", "a shaft bearing disposed between the small-diameter portion of the boot and the drive shaft so as to surround a portion of the drive shaft; and a shaft seal disposed between the shaft bearing and a distal end of the small-diameter portion of the boot.", "a bearing housing press-fitted into the boot so as to be in contact with an inner circumferential surface of the small-diameter portion of the boot and to surround the shaft bearing and the shaft seal, wherein the bearing housing has a stepped portion formed on an inner surface thereof to form a boundary between the shaft bearing and the shaft seal.", "wherein the bearing housing has a seal support portion extending radially inwards from an end of the bearing housing that faces the housing support portion, and wherein the seal support portion is supported by an inner surface of the housing support portion.", "wherein the boot has a foreign-substance-blocking portion extending radially inwards in a stepped form along an inner circumferential surface of the housing support portion so as to cover the maze-forming portion.", "a reinforcement ring coupled to the outer-diameter portion of the outer ring, wherein the reinforcement ring is inserted into the wheel bearing such that an outer circumferential surface of the reinforcement ring is in contact with an inner circumferential surface of the outer wheel of the wheel bearing.", "9 . The drive axle assembly according to claim 8 , wherein the reinforcement ring and the outer wheel of the wheel bearing corresponding to the reinforcement ring are coupled to each other in a groove-and-protrusion coupling manner.", "10 . The drive axle assembly according to claim 8 , further comprising an O-ring interposed between the reinforcement ring and the outer wheel of the wheel bearing corresponding to the reinforcement ring.", "11 . The drive axle assembly according to claim 1 , wherein the outer wheel is partially inserted into the outer ring such that an outer circumferential surface of the outer wheel is in contact with an inner circumferential surface of the outer ring.", "wherein the stepped insertion portion is press-fitted into the outer ring such that an outer circumferential surface of the stepped insertion portion is in contact with an inner circumferential surface of the outer ring.", "wherein the outer ring has a stepped insertion groove formed in the outer-diameter portion thereof so as to correspond to the stepped insertion portion, and wherein the stepped insertion portion is press-fitted into the stepped insertion groove.", "wherein the outer ring has a protruding portion formed on an inner surface thereof toward the wheel bearing such that a gap having a size less than a predetermined value is formed between the protruding portion and an inner surface of the wheel bearing.", "where “b” represents a length of the bearing housing in an axial direction, excluding the maze-forming portion, and “C” represents a length from an inner surface of the bearing housing that faces the shaft seal to a distal end of the shaft bearing.", "where “d", "where “D", "where “L” represents a length from a center of a groove formed in the wheel housing to a center of the shaft bearing, and “D"], "bibtex": "@patent{20240066919,\n    title = {DRIVE AXLE ASSEMBLY},\n    number = {20240066919},\n    year = {2024},\n    note = {File: US20240066919A1-20240229.XML}\n    }", "classification": "B60B2700FI"}, {"title": "DRIVE SOCKET PROTECTOR FOR LUG NUTS AND WHEELS", "doc_number": "20240066920", "filename": "US20240066920A1-20240229.XML", "abstract": "The drive socket protector for wheels and lug nuts includes a flexible sheath shaped to define an elongated receptacle having a tubular wall extending from an enclosed end to an open end. The elongated receptacle includes an interior volume configured to receive a socket tool. The socket tool has a lug opening disposed at the enclosed end of the elongated receptacle. The elongated receptacle further includes an exterior surface at the enclosed end that is configured to interface with a lug nut. The tubular wall is flexible and is configured to conform into the lug opening of the socket tool to be disposed between the lug nut and the socket tool when the socket tool is contained within the interior volume of the elongated receptacle.", "detailed_description": ["The methods and devices described herein relate to lug nuts and socket tools used to retain a wheel at a wheel hub or similar component on a vehicle, such as a passenger car, truck, motorcycle, bus, tractor, or the like. A drive socket protector for lug nuts and wheels is used to prevent damage at the wheel and lug nut during installation and/or removal of the lug nut by providing a barrier or cover for the tool acting on the lug nut. While this application may frequently reference the example of a lug nut being attached at a wheel of a vehicle, it should be understood that the present disclosure relates to bolts and other attaching hardware as well as other applications in which it is desirable to prevent direct contact between a tool and the fastener on which it is acting and structure surrounding the fastener.", "", "Wheels commonly used by the vehicles listed above typically comprise a center portion or disk configured to engage the wheel hub, an outer rim or barrel configured to retain a rubber tire, and a wheel body or spoke assembly radiating outward from the center portion to the barrel. The wheel hub enables rotation of the wheel about the axle, drive shaft, or the like and provides a number of bolts protruding from the wheel hub in a circular array at which the center portion of the wheel is received. The wheel provides a corresponding circular array of holes at the center portion for receiving the bolts from the wheel hub (at a bolt hole portion) and receiving lug nuts engaged to the ends of the bolts (at a lug hole portion). The holes may be formed through a thickness of the wheel at the center portion, such as at equal spacing about the disk shaped portion of the center portion.", "", "When installed on a vehicle, an inward facing portion of the center portion or disk sits flush against the wheel hub so that the bolts extending from the wheel hub pass through the holes of the wheel and are exposed at an outward facing side of the wheel, generally at the center portion or disk. Lug nuts, having a thread configured to receive the bolts, are then installed at each of the bolts and tightened to retain the wheel at the wheel hub. The lug nuts have a body with a greater diameter than an inner portion (e.g., the bolt hole portion) of the corresponding hole, such as a collar that forms a seat for the lug nut. As the lug nuts engage the bolt, they will engage the wheel and apply a clamping force at the wheel and maintaining the wheel at the wheel hub. Specifically, the lug nuts engage around the inner portion or seat of the hole, such as at an outward facing surface of the center disk surrounding the bolt hole portion.", "", "In each hole, the bolt hole portion (also referred to as the bolt hole) is disposed at an inner portion of the wheel and corresponds to lug hole portion (also referred to as the lug hole) on an outward facing side of the center portion or disk. The holes may be bored from an outward facing side of the wheel, but the largest diameter (i.e., the lug hole portion) does not pass through the entire thickness of the wheel. Rather, the lug hole portion frequently represent bores through an irregular or outer surface of the wheel to present a regular or uniform or matching surface at which the lug nut interfaces with the wheel. The lug hole portion may comprise a number of different configurations, but generally present a uniform seat upon which the lug nut sits. For example, a lug hole portion may present a rounded seat configured to engage a ball-seat lug nut, a tapered seat configured to engage an acorn-seat lug nut, or flat seat configured to engage a flat-seat lug nut. Providing a uniform contact surface at each lug nut is desirable for achieving a uniform torque or clamping force across the many lug nuts, thereby preventing a wobble or uneven rotation of the wheel. At high revolutions, over time, a wobble or uneven rotation of the wheel can lead to uneven wear of the tires, tie rods, and brakes, warping of the wheel hub, broken lug nuts, or other undesirable results.", "", "Sometimes during installation, the lug nut or wheel may be scratched or scuffed or chipped or otherwise marred by the traditional tools used in removing and installing lug nuts (such as lug wrenches, socket wrenches, and impact wrenches). The surfaces of wheels and lug nuts often have an ornamental finish or coating applied to enhance the aesthetic qualities of the vehicle. For example, a surface may be powder-coated, paint-coated, chrome-plated, or polished. These surfaces, however, may be susceptible to scratching or chipping when the hard surface of a lug-attaching tool comes into contact. This damage most commonly occurs in four regions: the lug hole seat, the lug hole wall, the top surface of the lug nut, and the side surfaces of the lug nut. While scratches and like damage primarily affect the aesthetic qualities of the wheel and lug nut, some more severe damages such as chipping may affect a lug nuts ability to provide a consistent clamping force at the wheel. Additionally, because both aesthetic and structural damages to the wheel and lug nuts are undesirable and may cause safety concerns in their own right, they may also lead to a vehicle owner installing replacement wheels or lug nuts not originally intended for the vehicle, providing additional potential for a decline in safety, durability of related parts, or even monetary value of the vehicle attributed to having factory installed parts original to the vehicle. Thus, while lug nuts and wheels may be replaced, it remains highly desirable to maintain lug nuts and wheels in an unblemished state for at least the reasons discussed above.", "", "Referring now to the drawings and the illustrative examples depicted therein, a drive socket protector for lug nuts and wheels is provided. As shown inFIGS.1A-1C, a wheel20is provided at a vehicle10, the wheel having a center disk22configured to receive a 5-lug bolt pattern. The bolts24extend horizontally in a circular array from a wheel hub or axle or other suitable means for attaching the wheel20at the vehicle10, such that the wheel20will be free to rotate about a central axis and collaborate with additional wheels disposed about the vehicle10for driving the vehicle10across a ground or road surface. The circular array of the bolts24comprises the bolt pattern. In additional examples, the bolt pattern may consist of three or more bolts arranged in a circular pattern about the central axis, enabling substantially even support or clamping force at the wheel20about the circular pattern at the wheel hub.", "", "Corresponding to the bolt pattern, the wheel20presents a circular array of lug holes, which each have a bolt hole portion and a lug hole portion28. The bolt hole portion are generally through holes configured to receive the bolts24from the wheel hub such that a threaded portion of the bolts24may be presented at an outer surface20aof the wheel when installed at the vehicle10. The lug hole portion28represent a portion of the hole near the outer surface20aof the wheel having an increased bore diameter so as to accept a lug nut30. The lug hole portions28comprise lug hole seats that are configured to interface with the lug nut30engaging the bolt24. The lug hole portions28also include lug hole walls28bdefined by a surface of the wheel20within the lug hole portion28and spanning between the outer surface20aof the wheel and the lug seat. The wheel surfaces may be chrome-plated, powder-coated, paint-coated, polished aluminum, steel or similarly finished. The lug nuts30may have a similar surface finish corresponding or matching or contrasting with the finish of the wheel20.", "", "The wheel surface at the lug hole seats and lug hole walls28band outer surface20aas well as the exterior surface of the lug nuts30are susceptible to scratches caused by installation of the lug nuts30. As depicted inFIGS.1A-1C, a variety of socket tools40, such as impact wrenches, socket wrenches, or lug wrenches, may be used to remove or install lug nuts30at a wheel20. The tools40of the illustrated embodiments are depicted with a drive socket protector100to prevent such damage. Installation of a lug nut30without a drive socket protector100, however, may lead to scratches caused by direct contact between the socket tool40and lug nut30or between the socket tool40and the lug hole seat or wall28b.", "", "During installation, a wheel20is lifted and placed at a vehicle10so as to insert the bolts24through the holes in the wheel and expose the threaded portion of the bolts24at the outer surface20aof the wheel20. A user may place a lug nut30at each bolt24and then use a socket tool40(such as an impact wrench, lug wrench, or socket wrench) to apply torque and tighten the lug nut30to the wheel20at the bolt24. As the socket tool40is used to drive the lug nut30onto the bolt24, the lug nut30engages the lug hole seat, thus applying a clamping force to retain the wheel20at the vehicle10. If the socket tool40is used without a drive socket protector100, the socket tool40will contact the lug nut30and may contact the lug hole28at the lug hole seat or wall28bdue to the rotation or vibration or lateral movement of the socket tool40during installation or removal of the lug nut30. Dependent upon the depth of the lug hole28, the socket tool40may have to contact and press against the lug hole seat or wall28bfor an extended period of time. This contact may result in scratches, chips, or other undesirable surface or structural blemishes at the lug nut30or lug hole28or wheel20. The drive socket protector100aims to form a barrier between the socket tool40and the lug nut30and lug hole28during installation or removal of the lug nut30to greatly reduce the chances of surface and structural damages.", "", "Referring now toFIGS.2-3B, a drive socket protector100is depicted as a singular sheet or piece of material split or wrapped upon itself or otherwise formed as a flexible and hollow sheath or tube having walls106between an open end102and an enclosed end104. The open end102defined by a perimeter or rim or edge of material (FIG.3B) and the enclosed end104formed by a seamless convergence of two layers or walls106of material (FIG.3A). Thus, the drive socket protector100may resemble a tube having one open end and one closed end when the two layers of material are separated and distanced from one another, the two separate layers representing parallel walls106of the tube that is the drive socket protector100. However, as shown inFIG.3, the layers or walls106of the drive socket protector100may be configured to lie flat or collapse upon themselves when not in use such that the drive socket protector100may resemble a flat and rectangular sheet. The drive socket protector100may be formed from a flexible, synthetic polymer having a thickness100tof 0.1 mm or less or another suitably flexible and thin material such as rubber or cloth.", "", "When the two walls106of the drive socket protector100are separated from one another, such that it resembles a tubular sheath having an open end102and an enclosed end104, the drive socket protector100defines an interior volume110. The interior volume110may be configured to receive a socket tool, a lug nut key, or a driving tool in combination or individually such that the devices listed may be retained within the interior volume110of the drive socket protector100and provided a barrier from a lug nut and lug hole of a wheel. The drive socket protector100has a length dimension100dand a width dimension100w, both of which may be altered for various embodiments of the protector designed for different sized socket tools or lug nuts. Common embodiments of the protector may have a length100d, the distance between the open end102and enclosed end104, of between 2.5 inches and 9 inches and a width100wof approximately 2 inches.", "", "A desired length100dmay depend upon the length of the socket tool used with the drive socket protector100. For example, a user may not desire a drive socket protector that has a length100dthat substantially exceeds the length of the socket tool disposed within at least because, when the socket tool is disposed at the enclosed end104of the drive socket protector100and the walls106of the drive socket protector100are extended proximally at an exterior surface of the socket tool, excess material of the protector100may bunch at the driving tool, inhibiting the rotation or other usage of the driving or socket tool. Conversely, a user may not desire a drive socket protector with a length100dsubstantially less than the length of the socket tool (or combination socket tool, lug nut key, and/or driving tool), such that when the socket tool is disposed at the enclosed end104of the protector100and the walls106of the protector100are extended proximally along an outer surface of the socket tool, a substantial portion of the socket tool remains exposed, offering a potential for the socket tool to contact or damage the lug nut or wheel.", "", "Similarly, a user will desire a drive socket protector100with a width100wcompatible for specific sizes of lug nuts and/or socket tools. For example, a drive socket protector100that is not wide enough may not be able to receive its intended socket tool without stretching or tearing the material of the protector100or the protector100may encase the socket tool too tightly within the interior volume. If the protector100wraps around or encases the socket tool too tightly, the protector100may be unable to properly engage a lug nut at the enclosed end104due to the material of the protector100being taut over the lug opening of the socket tool and/or the walls106of the protector100not being free to move along an exterior surface of the socket tool so that excess material may enter the lug opening as the lug nut conforms to the enclosed end104of the protector100.", "", "The drive socket protector100may be configured to receive a variety of socket tools, such as lug wrenches, impact wrenches, socket wrenches, socket tools used in combination with a lug nut key, and other tools compatible with lug nuts and wheel bolts. It should be understood that while the characteristics of the illustrated embodiments may differ, the details and features of the systems and devices and methods described herein are not intended to be exhaustive or encompass all of the potential applications or benefits of a drive socket protector. Thus, the inclusion or exclusion of a given detail or feature in relation to a specific illustrated embodiment should not be read to necessitate the inclusion or exclusion of that detail or feature in all like embodiments.", "", "Referring now toFIGS.4-7, a drive socket protector100is depicted with a socket tool140having a socket142with a lug opening144defined by the perimeter of a recess144ain the socket tool configured to receive a lug nut130. In this example, the socket142is a standard socket capable of fitting many configurations of lug nuts and bolts based on the size of its lug opening144. In some examples, the socket tool may include a lug nut key that engages the socket, such as to provide a receptor matching the specific lug nut.", "", "In continued reference toFIGS.4-7, the socket142has a female square connection fitting146configured to receive a driving tool148for driving or turning the socket142and therefore lug nut130. The driving tool148may be a ratchet having a male square connector148athat snap-attaches to the female square connection fitting146, such as in the illustrated embodiment, or may be a similarly configured impact wrench. The socket142of the illustrated embodiment has an exterior surface142athat engages an interior surface100aof the walls106of the drive socket protector100. The socket142also has an interior surface142bat the recess144aconfigured to receive a lug nut130. The interior surface142bengages a portion of the interior surface100aof the protector100extended through the lug opening144into the recess144aby the presence of a lug nut130thereat (as shown inFIGS.6and7).", "", "FIGS.5-7depict various stages of the removal of a lug nut130from a bolt124at a wheel120by a socket tool140having a socket142and driving tool148. The bolt124, disposed at a wheel hub of a vehicle, extends from the wheel hub into the bolt hole portion126and the lug hole portion128, such that the threaded portion of the bolt is exposed in the lug hole portion128. The lug nut130, as it is installed on the bolt124, is engaged with the lug seat128aof the lug hole portion128. The lug hole wall128bis spaced from the lug nut130so as to permit the engagement of a socket tool140at the lug nut130. In this example, the lug hole seat128ais angled to match the angled engaging surface130aof the lug nut130and is spaced from the outer surface120aof the wheel120such that the installed lug nut130may appear sunken into the thickness of the wheel120. Thus, the socket tool140must substantially engage the lug nut130within the lug hole portion128, such as shown inFIG.6.", "", "As depicted, the drive socket protector100is disposed at the socket tool140such that the interior surface100aat the enclosed end104of the drive socket protector100interfaces with the lug opening144and the walls106of the protector100extend proximally along the exterior surface142aof the socket142. Thus, the socket142is substantially enclosed by the drive socket protector100with the driving tool148, or other addition/extension of the socket tool140, emanating from the drive socket protector100at the open end102. The walls106of the drive socket protector100sit in loose connection with the exterior surface142aof the socket142such that the socket142is relatively free to move within the interior volume110. Additionally, as the socket tool140engages a lug nut130, the walls106of the protector100will conform to both the lug nut130and interior surface142bof the socket142.", "", "In the direction of the arrow ofFIG.5, a user engages the socket tool140with the lug nut130at the lug opening144such that the lug nut130will engage the exterior surface100bof the protector100at the enclosed end104. As the socket tool140engages the lug nut130, the exterior surface100bof the drive socket protector100at the enclosed end104conforms to the surface of the lug nut130. Simultaneously, the interior surface100aof the protector100conforms to the interior surface142bof the socket142at the recess144. As the socket142is pressed further onto the lug nut130, the lug nut130becomes further disposed within the recess144(as depicted inFIG.6) and a portion of the drive socket protector100will be pulled into the recess144(from the exterior surface142aof socket142) and disposed between the socket tool and the lug nut. The drive socket protector100will move freely along the exterior surface142aof the socket142so as to provide the necessary amount of material to conform to the surface of the lug nut130and interior surface142bin the recess144. Thus, the drive socket protector100provides a thin barrier between the socket142and the lug nut130as the socket142engages the lug nut130at the wheel.", "", "Moreover, the drive socket protector100is configured to provide enough material to conform to the surface of the lug nut130within the recess144and also enough material to provide a substantial barrier between the socket tool140and surfaces of the lug hole128and wheel120. Even with the lug nut130disposed within the recess144(and thus pulling a portion of the protector100into the recess144from the exterior surface142aof the socket142), the illustrated embodiment of the drive socket protector100is able to cover the entirety of the exterior surface142aof the socket142disposed within the lug hole128(seeFIG.6) as well as a significant portion of the socket tool140distanced from the wheel120.", "", "As shown inFIG.6A, an installation or removal of a lug nut130at a wheel may be possible without contacting the surfaces of the wheel or lug hole128.FIG.6Ashows a socket142engaging a lug nut130(with a protector100disposed between) at a lug hole128with neither the socket tool nor protector100engaging a surface of the lug hole128or wheel120. However, inadvertent movement of the socket140, as it turns the lug nut130or engages or disengages the lug nut130from the bolt124, may cause contact between the drive socket protector100and the wheel120, lug hole seat128aor wall128b. Thus, even in settings in which a socket tool may only rarely or unintentionally contact the wheel or lug hole, it remains desirable to utilize a drive socket protector100with the socket tool.", "", "Once the socket tool140is engaged with the lug nut130, as shown inFIG.6, (with the drive socket protector100disposed between the socket142and the lug nut130) the socket tool140may operate to loosen and disengage the lug nut130from the bolt124. The drive socket protector100provides no noticeable interference in the usual operation of a socket tool in removing a lug nut (other than to provide a barrier between the tool and the wheel and lug nut). As shown inFIG.7, the drive socket protector100may help to retain the lug nut130at the socket142as the socket tool140is pulled away from the bolt124(in the direction of the arrow shown inFIG.7). However, the drive socket protector100maintains a barrier between the lug nut130and the socket142so as to prevent scratches at the lug hole128or lug nut130.", "", "Turning now toFIGS.8-11, a drive socket protector100may be disposed at socket tool240having a lug nut key242configured to engage a corresponding lug nut230. Although some details regarding the illustrated example inFIGS.8-11may differ from other examples provided by this disclosure, the function of the drive socket protector100remains similar between the multiple examples, such that a full description may not be necessary to express the full functionality of the drive socket protector in each embodiment. It should be understood that the characteristics and/or functionality of the drive socket protector100as discussed in relation to one example of the disclosure may be applicable to other examples within (or outside the scope of) the present disclosure even if those characteristics are not expressly described within the context of that example.", "", "InFIGS.8-11, much like a traditional socket, the lug nut key242may be snap-attached to a driving tool248and has a lug opening244defined by an edge or perimeter of a recess244aat which the lug nut230is received. Similar to the socket ofFIGS.4-7, the lug nut key242has a female square connector246for receiving the male connector248aof the driving tool. However, the lug nut key242is unlike a traditional socket in that the interior surface242bcomprises a unique pattern of ridges and valleys corresponding to an alternative pattern of ridges and valleys on the exterior surface of the lug nut230. Thus, a traditional socket may not be able to engage the lug nut230and a lug nut key242corresponding to the surface pattern of the lug nut230may be required to engage the lug nut230with a socket tool. The drive socket protector100is disposed at the lug nut key242in a similar fashion as embodiments above, with the lug opening244disposed at the enclosed end104of the drive socket protector100. The walls106of the protector extend proximally along an exterior surface242aof the lug nut key242so as to substantially provide a barrier at the lug nut key242. The ridged interior surface242bof the lug nut key242and ridged surface230bof the lug nut230present a more complex surface relationship between which the drive socket protector100will be disposed, relative to that of a traditional socket and lug nut (such as that inFIGS.4-7). However, the pliable nature of the drive socket protector100ensures that engagement of this type of lug nut230with a lug nut key242occurs in a similar fashion to engagement of other types of lug nuts (such as those inFIGS.18A-18H) and the corresponding socket tools needed to fasten those lug nuts at their bolts. Thus, the drive socket protector100is capable of conforming to a wide variety of different surface configurations without interfering in the usual operation of the socket tool.", "", "FIGS.9-11depict various stages of the installation of a lug nut230on a bolt224at a wheel220by a socket tool240comprising a lug nut key242and a driving tool248, where the lug nut key242is configured to receive the lug nut230. The bolt224, disposed at a wheel hub of a vehicle, emanates from the wheel hub, through the thickness of the wheel220and at the bolt hole226and lug hole228, such that the threaded portion is exposed at an outer surface220aof the wheel220. In this embodiment, the lug nut230has an angled bottom230a(corresponding to an angled lug nut seat228aof the lug hole228) and a ridged outer surface230bmatching the ridged interior surface242bof the lug nut key242. The thread of the lug nut230of course matches the thread of the bolt224. In this embodiment, the lug hole228angles continuously from the bolt hole226to the outer surface220aof the wheel220such that the lug hole228presents only a lug hole seat228awithout a substantial lug hole wall.", "", "As shown inFIG.9, a lug nut230is disposed at the lug nut key242in preparation of installing the lug nut230onto the bolt224at the wheel220. The drive socket protector100is installed covering the lug nut key242and forming a barrier between the lug nut key242and the lug nut230, including at the interior surface242bdefining the recess244a. Although the drive socket protector is thin, pliable, and mobile along the surfaces of the socket tool240, the presence of the drive socket protector100between the lug nut230and the interior surface242bhelps to retain the lug nut230. During installation, a user engages the lug nut230with the bolt224, in the direction of the arrow shown inFIG.9, using the socket tool240. As the lug nut230engages the bolt224, the driving tool248rotates the lug nut key242such that the lug nut230is driven onto the bolt224.", "", "When the lug nut230is fully driven onto the bolt224, such as seen inFIG.10, the lug nut engages the seat228aof the lug hole228. In contrast to the embodiments ofFIG.5-7orFIGS.13-15, the socket tool240here engages the outer surface220aof the wheel as the lug nut230is driven onto the bolt224. Thus, rather than provide a barrier between the socket tool and a lug hole wall or lug hole seat, the drive socket protector100provides a barrier between the lug nut key242and the outer surface220aof the wheel220.", "", "During disengagement of the socket tool240from the installed lug nut230, the socket tool240is pulled from the lug nut230in the direction of the arrow ofFIG.11. As the socket tool240disengages from the lug nut230, the lug nut230remains at the wheel220and releases from the drive socket protector100. Thus, the drive socket protector100is retained at the socket tool240. While the wheel220of this embodiment does not provide an obstacle in the way of, or proximate to, the socket tool240(such as a lug hole wall) during the disengagement, other embodiments (such as inFIG.5-7or13-15) will provide such an obstacle and retaining the drive socket protector100at the socket tool240ensures that a barrier is provided between the socket tool240and the surfaces of the wheel during the complete process of installing or removing a lug nut at a wheel.", "", "As shown inFIGS.12A-15, a socket tool340includes both a socket342and a lug nut key342kdepicted with a drive socket protector100containing portions of both components within the interior volume110of the protector100. Although a socket342is shown receiving the lug nut key342k, other examples may have an impact wrench, lug wrench, or other tool receiving the lug nut key342kwithin the interior110of the protector100. Unlike the lug nut key ofFIGS.8-11, the lug nut key342kof this example is not snap-attached (such as via a male-female square connector) to its counterpart socket342. When a lug nut key (or any socket tool) is not or cannot be attached to its corresponding tool via a retaining mechanism (such as the snap-attachment square connectors described above), it may require a user to hold the lug nut key at its corresponding socket or driving tool to maintain the connection thereat. Thus, a user frequently must use one hand to maintain the connection or interface or relationship at the lug nut key and socket or driving tool while the other hand turns the ratchet, drives the impact wrench, or otherwise applies the rotational force. This is undesirable because a user, especially one utilizing an impact wrench, may prefer to have a free hand to steady themselves, steady the impact wrench, steady the wheel to which the lug nut is being installed, or otherwise assist in the task. A benefit shown by the example ofFIGS.12A-15is that the drive socket protector100may be configured to receive multiple components of a socket tool340within its interior volume110and maintain the connection thereat. That is to say that the interior volume110of the drive socket protector100may be configured to hold both a lug nut key and a socket tool in close relation to maintain the connection or interface or relationship thereat.", "", "FIG.12Bshows a drive socket protector100with a lug nut key342kcontained wholly within its interior volume110with at least a portion of the socket tool342also retained within the interior110. The walls106of the drive socket protector100extend proximally along the exterior surface342aof both the lug nut key342kand the socket tool342so as to preclude movement of the key342kfrom the socket342. Disposed at the enclosed end104of the protector100, and pressed into the lug opening344is a lug nut330having a ridged surface330bconfigured to match the interior surface342bof the key342k. The lug nut330also has a rounded bottom surface330aconfigured to mate with the rounded lug nut hole seat328aof the wheel320, the lug hole wall328bspaced from the lug nut330so as to provide room for the engagement of the socket tool340.", "", "FIGS.13-15depict various stages of the installation of a lug nut330on a bolt324at a wheel320by a socket tool340comprising a lug nut key342k, and socket342, the lug nut key342kconfigured to receive the lug nut330. The bolt324, disposed at a wheel hub of a vehicle, emanates from the wheel hub, through the thickness of the wheel320and at the bolt hole326and lug hole328such that the threaded portion is exposed at an outer surface320aof the wheel320. Much of the installation occurring inFIGS.13-15mirrors the processes described above such that a full discussion need not be repeated here. One exception, however, is that the drive socket protector100retains both the lug nut key342kand socket342within its interior110throughout the full installation process, providing support to the connection between the two components at the exterior surfaces of the socket tool342a.", "", "FIGS.14A and14B, which are cross-sections of the lug nut key342k, lug nut330, and drive socket protector ofFIG.14, illustrate that the drive socket protector is capable of maintaining a loose or even non-contacting relationship with the exterior surface of a socket tool while also conforming substantially to the interior surface of the socket tool and exterior surface of the lug nut disposed therein. Thus, the drive socket protector remains mobile at the exterior surface of the socket tool and maintains a barrier across all surfaces contacting the lug nut and socket tool. The illustrated embodiment shows a drive socket protector100surrounding a lug nut key342kwith a lug nut330disposed within the recess344a, the drive socket protector disposed between and in direct contact with both the lug nut330and the interior surface342bof the lug nut key342k.", "", "Various embodiments of the drive socket protector, as seen inFIGS.16A-16C, may be formed from different materials capable of providing different advantages. For example, a drive socket protector may be manufactured from a thin plastic or other synthetic polymer (FIGS.16A and16B) or from a thin sheet of cloth, rubber, or other suitably durable material (FIG.16C). The embodiments ofFIGS.16A and16Bprovide a drive socket protector configured for single or disposable use because they may not provide extended durability, but can be manufactured at a relative low cost per unit. The drive socket protectors manufactured from synthetic polymer materials are capable of conforming to the surfaces of the lug nuts and socket tools on which they are used, but if they significantly stretch during use, the material may not rebound to an original state as easily as the drive socket protectors like that ofFIG.16C. Other embodiments, such as inFIG.16C, manufactured from a thin sheet of cloth, rubber, or other suitably durable material may be configured for reusable applications because the protector may stretch to conform to the surfaces of the lug nut and socket tool and rebound to an original state. These embodiments may have a higher manufacturing cost, but provide extended durability designed for repetitive use. Some users, such as professional mechanics, may prefer embodiments designed for disposable use because of their lower cost per unit relative to embodiments designed for reusable applications. Other users, such as those who purchase the drive socket protector for personal use, may prefer the increased durability of embodiments designed for reusable applications. The material of the drive socket protector may also dictate whether the protector is transparent (such asFIGS.16A and16B) or opaque (FIG.16C). A transparent drive socket protector allows a user to view the socket tool through the protector for such purposes as confirming a continued connection between a lug nut key and its socket. A logo or design or measurement tool may be screen printed on the outside surface of the drive socket protector100.", "", "The illustrated embodiment of the drive socket protector shown inFIG.16Bfurther comprises a drawstring160disposed at the tubular wall and configured to compass an outer ring of the elongated receptacle, such as at the exterior surface100bat or near the open end102. Here, the drawstring160is a length of cord or cord-like element received at each of its ends by a cord stopper162, the length of cord extending from the cord stopper162, looping back, and being received by and passing through the cord stopper162. A user may depress a button on the cord stopper162to loosen its grip on one end of the length of cord, allowing the user to pull the cord further through the cord stopper162to enclose the loop of cord around the drive socket protector100and socket tool. Similarly, with the button depressed, a user may pull on the looped portion of the cord to release the cord from the cord stopper162and enlarge the looped portion of cord, thus loosening the drive socket protector100from the socket tool. The drawstring160may also be a loose string or cord (requiring a user to tie a knot to tighten the drawstring around the protector and socket tool), a zip tie, or other suitable means for retaining the drive socket protector100at the socket tool. When using a drive socket protector with a drawstring mechanism, a user may wish to manually depress the enclosed end104of the protector100into the lug opening prior to tightening the drawstring160so that when the enclosed end104is engaged with a lug nut, the drive socket protector100is not taut across the lug opening preventing the engagement of the lug nut at the socket tool. Unlike embodiments without a drawstring mechanism, the drive socket protector100may not be free to move across the surface of the socket tool as the lug nut is received by the socket tool at the lug opening due to the drawstring160retaining the socket protector100at the socket tool.", "", "Turning now toFIGS.17A and17B, various embodiments of the drive socket protector100may be dispensed from a roll170(FIG.16A) or booklet172(FIG.16B) in which multiple drive socket protectors are coupled together and releasable at a tear-point or serrated edge174. As mentioned above, the pliable nature of the walls106of the protector100allow the sheath or tube-like shape of the protector100to collapse or flatten upon itself to resemble a substantially flat sheet. This quality allows multiple protectors100to be packaged together such as in the illustrated embodiments. InFIG.17A, the multiple drive socket protectors100are attached to one another via tear points or serrated edges174coupled together. The material forming the enclosed end104of one drive socket protector100is attached to the material at the open end102of the next protector100on the roll170and so on. A user pulls on the drive socket protector100at the end of the roll170, releasing the protector from the roll at the serrated edge174and rotating the roll170so that the next protector100is in position to be dispensed in a similar fashion. InFIG.17B, multiple drive socket protectors100are stacked upon each other, releasably connected in a booklet-like form where each protector100is releasably connected to a tab176via a serrated edge174and the multiple tabs176of the protectors100are bound together. Thus, when a user pulls a drive socket protector100from the booklet172, the protector releases from its corresponding tab176and the tab176remains bound to the rest of the booklet172. The serrated edge174may be at the enclosed end or open end of the protector100.", "", "Also for purposes of this disclosure, the terms “upper,” “lower,” “right,” “left,” “rear,” “front,” “vertical,” “horizontal,” and derivatives thereof shall relate to the orientation shown inFIG.1. However, it is to be understood that various alternative orientations may be provided, except where expressly specified to the contrary. It is also to be understood that the specific devices and processes illustrated in the attached drawings, and described in this specification are simply exemplary embodiments of the inventive concepts defined in the appended claims. Hence, specific dimensions and other physical characteristics relating to the embodiments disclosed herein are not to be considered as limiting, unless the claims expressly state otherwise.", "", "Changes and modifications in the specifically described embodiments may be carried out without departing from the principles of the present invention, which is intended to be limited only by the scope of the appended claims as interpreted according to the principles of patent law. The disclosure has been described in an illustrative manner, and it is to be understood that the terminology which has been used is intended to be in the nature of words of description rather than of limitation. Many modifications and variations of the present disclosure are possible in light of the above teachings, and the disclosure may be practiced otherwise than as specifically described."], "claims": ["a flexible sheath shaped to define an elongated receptacle having a tubular wall extending from an enclosed end to an open end; wherein the elongated receptacle includes an interior volume configured to receive a socket tool having a lug opening, the lug opening disposed at the enclosed end of the elongated receptacle; wherein the elongated receptacle includes an exterior surface at the enclosed end configured to interface with a lug nut; and wherein the tubular wall is flexible and configured to conform into the lug opening to be disposed between the lug nut and the socket tool contained in the interior volume.", "2 . The drive socket protector of claim 1 , wherein with a lug nut conforming the flexible sheath into the lug opening, the tubular wall is configured to wrap around a distal edge of the socket tool and extend proximally along an exterior surface the socket tool.", "3 . The drive socket protector of claim 1 , wherein the interior volume has a length dimension and a diameter dimension, the length dimension defined between the enclosed end and the open end and configured to protect the lug nut and a lug hole of the wheel.", "4 . The drive socket protector of claim 3 , wherein the diameter dimension corresponds to a diameter of the socket tool.", "5 . The drive socket protector of claim 1 , wherein the flexible sheath comprises a polymer film.", "6 . The drive socket protector of claim 5 , wherein the polymer film comprises a thickness less than 0.1 mm.", "7 . The drive socket protector of claim 1 , further comprising a drawstring configured to conform the open end to the socket tool.", "8 . The drive socket protector of claim 7 , wherein the drawstring is a cord-like element substantially disposed at the tubular wall and configured to compass an outer ring of the elongated receptacle.", "9 . The drive socket protector of claim 1 , wherein the exterior surface at the enclosed end is further configured to be removably attached to an open end of a second drive socket protector and provide a tear point for removing the second drive socket protector.", "10 . The drive socket protector of claim 9 , wherein the tear point comprises a serrated edge.", "11 . The drive socket protector of claim 1 , wherein the socket tool comprises a ratchet and a socket, the socket providing the lug opening and the ratchet configured to rotate the socket.", "12 . The drive socket protector of claim 1 , wherein the socket tool comprises an impact wrench, the impact wrench providing the lug opening.", "13 . The drive socket protector of claim 1 , wherein the socket tool comprises a lug nut key, the lug nut key providing the lug opening.", "an impact wrench configured to engage and rotate the lug nut key at the interior volume of the elongated receptacle, or a ratchet and a socket, the socket configured to engage the lug nut key at the interior volume of the elongated receptacle and the ratchet configured to rotate the socket and the lug nut key.", "inserting a socket tool having a lug opening through an open end of a drive socket protector, the open end defined by a rim of a tubular wall spanning between the open end an enclosed end formed by a meeting of the tubular wall, the tubular wall further defining an interior volume, such that the lug opening is disposed in the interior volume at the enclosed end and configured to engage an interior surface of the tubular wall at the enclosed end; engaging a lug nut with an exterior surface of the enclosed end such that the interior surface of the tubular wall substantially conforms to an interior surface of the lug opening, the lug nut disposed at a wheel; extending the tubular wall proximally along an exterior surface of the socket tool so as to provide a barrier between the socket tool and a lug hole of the wheel; and applying a rotational force at the socket tool so as to tighten or loosen the lug nut at a wheel.", "16 . The method of claim 15 , further comprising the step of tightening a drawstring disposed at the tubular wall so as to substantially conform the interior surface of the tubular wall to the socket tool.", "17 . The method of claim 16 , wherein the drawstring is a cord-like element substantially disposed at the tubular wall and configured to compass an outer ring of the elongated receptacle.", "18 . The method of claim 15 , further comprising the step of engaging a torque-applying tool at the socket tool and within the interior volume, such that the torque-applying tool and socket tool are substantially retained at the interior volume, the socket tool comprising a lug nut key.", "19 . The method of claim 18 , wherein the torque-applying tool is either an impact wrench or a ratchet assembly comprising a socket and a ratchet.", "20 . The method of claim 15 , wherein with the lug nut conforming the flexible sheath into the lug opening, the tubular wall is configured to wrap around a distal edge of the socket tool and extend proximally along an exterior surface the socket tool.", "21 - 25 . (canceled)"], "bibtex": "@patent{20240066920,\n    title = {DRIVE SOCKET PROTECTOR FOR LUG NUTS AND WHEELS},\n    number = {20240066920},\n    year = {2024},\n    note = {File: US20240066920A1-20240229.XML}\n    }", "classification": "B60B2900FI"}, {"title": "SPLIT TORSION AXLE FOR TRAILERS AND OTHER VEHICLES", "doc_number": "20240066921", "filename": "US20240066921A1-20240229.XML", "abstract": "A split torsion axle is configured to provide the advantages of a torsion axle while also allowing for the independent adjustment of related wheel assemblies positioned on opposite ends thereof. The split torsion axle also provides for additional stability provided by having a continuous axle member spanning the width of the trailer or vehicle upon which the split torsion axle is deployed. To provide these capabilities, the split torsion axle comprises a first torsion axle beam and a second torsion axle beam, which are rotatably coupled to one another by a central joint. The central joint comprises a first spindle coupled to the first torsion axle beam, a second spindle coupled to the second axle beam, and a bearing assembly rotatably coupling the first and second spindles to one another. Both the first torsion axle beam and the second torsion axle beam are configured to be coupled to respective wheel assemblies.", "detailed_description": [""], "claims": ["a first torsion axle beam and a second torsion axle beam, wherein the first torsion axle beam and the second torsion axle beam are substantially linear and are configured for attachment to a first wheel assembly and a second wheel assembly, respectively; a central joint rotatably coupling the first torsion axle beam to the second torsion axle beam, the central joint comprising: a first spindle coupled to the first torsion axle beam; a second spindle coupled to the second torsion axle beam; and a bearing assembly rotatably coupling the first spindle to the second spindle, wherein the bearing assembly is further configured to maintain substantially linear alignment of the first torsion axle beam and the second torsion axle beam.", "wherein the second torsion axle beam each further comprises a second outer tube which is configured to be coupled to the frame portion of the vehicle, a second axle member contained within at least a portion of the second outer tube and configured to be attached to the second wheel assembly, and a second resilient member contained within the second outer tube and surrounding the second axle member, the second resilient member configured to provide controlled movement between the second outer tube and the second axle member.", "3 . The split torsion axle of claim 1 wherein the bearing assembly comprises a hub coupled to the first spindle, and a bearing situated between the hub and an extending portion of the second spindle, wherein the hub is further configured to surround the extending portion of the second spindle, and wherein the bearing is situated within the hub.", "4 . The split torsion axle of claim 3 further comprising a second bearing coupled to the hub and the extending portion of the second spindle to further support the rotatable coupling of the first torsion axle beam to the second torsion axle beam.", "5 . The split torsion axle of claim 1 wherein the vehicle is a trailer, and wherein the first torsion axle beam is configured to be operatively coupled to a first wheel assembly of the trailer, and the second torsion axle beam is configured to be coupled to a second wheel assembly of the trailer, and wherein the first wheel assembly and the second wheel assembly are configured to be adjustable independently from one another.", "6 . The split torsion axle of claim 5 further comprising a first carrier axle bearing rotatably coupling the first torsion axle beam to the trailer and a second carrier axle bearing rotatably coupling the second torsion axle beam to the trailer.", "7 . The split torsion axle of claim 6 wherein the first torsion axle beam comprises a first outer housing coupled to the first carrier axle bearing and a first inner axle member coupled to the first wheel assembly, and wherein the second torsion axle beam comprises a second outer housing coupled to the second carrier axle bearing and a second inner axle member coupled to the second wheel assembly.", "8 . The split torsion axle of claim 7 wherein the first outer housing surrounds a first resilient member and the first resilient member surrounds the first inner axle member and wherein second outer housing surrounds a second resilient member and the second resilient member surrounds the second inner axle member; and wherein the first resilient member allows for dampened movement of the first inner axle member relative to the first outer housing and the second resilient member allows for dampened movement of the second inner axle member relative to the second outer housing.", "9 . The split torsion axle of claim 4 wherein the hub has a cylindrical bearing housing and an end cap coupled thereto, the end cap further coupled to the first spindle and forming a first closed end for the hub, and wherein the hub further has a bearing seal coupled to the bearing housing at an end with is opposite the end cap, the bearing seal configured to allow an extending portion of the second spindle to pass therethrough.", "a trailer framework having an upper support surface; a first wheel assembly having a first swing arm and a first torsion clamp arm, wherein the first swing arm is configured to support a first wheel at a first end thereof; a second wheel assembly having a second swing arm and a second torsional clamp arm, wherein the second swing arm is configured to support a second wheel at a first end thereof; and a split torsion axle comprising a first axle beam, a second axle beam and a central joint rotatably coupling the first axle beam to the second axle beam, wherein the first axle beam and the second axle beam are rotatably coupled to the framework, and wherein the first axle beam is also coupled to a second end of the first swing arm such that rotation of the first axle beam will cause rotation of the first swing arm, and wherein the second axle beam is coupled to a second end of the second swing arm such that rotation of the second axle beam will cause rotation of the second swing arm, wherein the first axle beam is further coupled to a first torsion clamp arm and the second axle beam is coupled to a second torsion clamp arm, such that rotation of the first torsion clamp arm causes an adjustment of a horizontal position of the first wheel relative to the upper support surface and rotation of the second torsion clamp arm causes an adjustment of a horizontal position of second wheel relative to the upper support surface, and wherein adjustment of the horizontal position of the first wheel relative to the upper support surface and adjustment of the horizontal position of the second wheel relative to the support surface can be achieved independently.", "a first spindle coupled to the first axle beam; a second spindle coupled to the second axle beam; and a bearing assembly rotatably coupling the first spindle to the second spindle, wherein the bearing assembly is further configured to maintain substantially linear alignment of the first torsion axle beam and the second torsion axle beam.", "12 . The trailer of claim 11 wherein the bearing assembly comprises a hub coupled to the first spindle, and a bearing situated between the hub and an extending portion of the second spindle, wherein the hub is further configured to surround the extending portion of the second spindle, and wherein the bearing is situated within the hub.", "13 . The trailer of claim 12 wherein split torsion axle is substantially linear and maintains a substantially linear configuration during use."], "bibtex": "@patent{20240066921,\n    title = {SPLIT TORSION AXLE FOR TRAILERS AND OTHER VEHICLES},\n    number = {20240066921},\n    year = {2024},\n    note = {File: US20240066921A1-20240229.XML}\n    }", "classification": "B60B3514FI"}, {"title": "TIRE", "doc_number": "20240066922", "filename": "US20240066922A1-20240229.XML", "abstract": "A tire has an outer diameter smaller than a value obtained by subtracting 4 mm from an outer diameter maximum value of new product dimensions defined by a JATMA standard or an ETRTO standard, and has a total width smaller than a value obtained by subtracting 5 mm from a maximum total width of the new product dimensions. The tire includes an outer surface including a tread surface and a pair of side surfaces. The tread surface includes an equator. Each of the side surfaces includes a maximum width position. In a normal state, a ratio of a length of the shoulder line segment to a length of the reference line segment is 85.9% or more and 89.3% or less, and a ratio of the radius of the center arc to the radius of the middle arc is 1.85 or more and 2.00 or less.", "detailed_description": ["In recent years, in the passenger vehicle, the appearance is also emphasized in addition to the performance. In particular, with regard to the appearance, it is required to improve a visual aspect of the vehicle and the tire as one unit.", "", "As described above, the tire T is accommodated in the wheel house H of a vehicle B. A clearance (reference numeral G inFIG.40) is provided between the wheel house H and the tire T such that the tire T does not interfere with the wheel house H. The clearance G is a distance from an outer surface of the tire T to the wheel house, which is measured along a straight line passing through a first reference point PB1and a second reference point PB2, which will be described below.", "", "As the clearance G is reduced, the sense of unity between the vehicle B and the tire T is enhanced. The enhancement in the sense of unity contributes to the improvement in the visual aspect.", "", "As shown by a dotted line inFIG.40, in a case where a contour line of a tread surface is modified such that a shoulder portion S has an angular shape, the clearance G is reduced, and the sense of unity between the vehicle B and the tire T is enhanced.", "", "However, the modification involves a change in the contour line of the tread surface. As a result of the shoulder portion S protruding, a ground contact pressure of the shoulder portion S is increased, and there is a concern that the uneven abrasion occurs.", "", "In order to improve the visual aspect, it is required to enhance the sense of unity between the vehicle B and the tire T in consideration of the influence on the uneven abrasion resistance.", "", "In addition, in a case where the contour line of the tread surface is simply modified, the shoulder portion S protrudes, and the volume of the shoulder portion S is increased. The increase in the volume increases the mass of the tire. Therefore, it is also required to enable to achieve the improvement in the visual aspect while suppressing the increase in the mass.", "", "Further, a projection area of the tire when the tire is viewed from the front of the vehicle is increased. The increase in the projection area leads to the increase in the air resistance. Therefore, it is also required to enable to achieve the improvement in the visual aspect while suppressing the increase in the air resistance. The modification of the contour line of the tread surface involves a change in a contour line of a carcass. As in the contour line of the tread surface, in a case where the contour line of the carcass is also modified to an angular shape, when the tire is inflated, the tire is deformed such that a crown portion C pops out and the shoulder portion S retracts. Since an outer diameter growth in the crown portion C is promoted, the contour line of the tread surface is rounded, and an effect of improving the visual aspect may not be sufficiently obtained.", "", "In the tire, the deformation and the restoration are repeated. The increase in the outer diameter growth in the crown portion C leads to the increase in an amount of deformation in a tread portion. Therefore, the rolling resistance may also be increased. Therefore, it is also required to enable to achieve the improvement in the visual aspect while suppressing the increase in the rolling resistance.", "", "In a case where the contour line of the tread surface is simply modified to protrude the shoulder portion S, a force that acts on the shoulder portion S when being in contact with the ground is increased, and there is a concern that compressive strain is increased. The increase in the compressive strain increases the rolling resistance. In a radially outer portion of a side surface at a maximum width position, the roundness of the side surface is gentle, and there is a concern that the volume of the rubber of a sidewall portion is increased. The increase in the volume of the rubber increases the rolling resistance. In a radially inner portion of the side surface at the maximum width position, the roundness of the side surface is tight, and there is a concern that the volume of the rubber of a portion being in contact with a flange of a rim is insufficient. The insufficient volume of the rubber promotes the exposure of the carcass cord, which should originally be covered with rubber. The exposure of the carcass cord deteriorates an appearance quality. Therefore, it is also required to enable to achieve the improvement in the visual aspect while suppressing the influence on the rolling resistance or the appearance quality.", "", "The present invention has been made in view of these circumstances. It is desirable to provide a tire that can achieve the improvement in the visual aspect.", "", "The tire may further include a pair of beads, and a carcass that bridges between the pair of beads. A ratio of a length of the shoulder line segment from the carcass to the shoulder reference point to the length of the shoulder line segment may be 6% or more and 12% or less.", "", "The tire may further include a pair of beads, a carcass that bridges between the pair of beads, a tread that is positioned radially outside the carcass, a pair of sidewalls that are positioned axially outside the carcass, and a pair of clinches that are positioned radially inside the sidewall. A protrusion that protrudes outward from the outer surface of the tire and extends in a circumferential direction may be provided at a boundary portion between the tread and the sidewall. The outer surface of the tire may include a serration region between the shoulder reference point and the maximum width position. The serration region may include a plurality of narrow grooves that extend in the circumferential direction, and a ridge that is positioned between the narrow grooves adjacent to each other. The serration region may be positioned radially inside the protrusion. A total of a height of the protrusion and a maximum depth of the narrow groove may be 0.5 mm or more and 0.9 mm or less.", "", "The tire may further include a pair of beads, a carcass that bridges between the pair of beads, a tread that is positioned radially outside the carcass, and a band that is positioned between the carcass and the tread. The tread may include the tread surface. The band may include a band cord that extends substantially in a circumferential direction. The band may include a center portion that intersects with the equatorial plane, and a pair of side portions that are positioned axially outside the center portion. The center portion may have stiffness higher than stiffness of the side portion.", "", "In the tire, a ratio of a radial distance from the bead baseline to the maximum width position to a cross-sectional height of the tire may be 51% or more and 62% or less.", "", "Hereinafter, the present invention will be described in detail based on a preferred embodiment while referring to the drawings as appropriate.", "", "A tire is assembled on a rim. An inside of the tire is filled with air, and an internal pressure of the tire is adjusted. In the present invention, the tire assembled on the rim is a tire-rim assembly. The tire-rim assembly includes the rim and the tire assembled on the rim.", "", "In the present invention, a state in which the tire is assembled on a normal rim, the internal pressure of the tire is adjusted to a normal internal pressure, and no load is applied to the tire is referred to as a normal state.", "", "In the present invention, unless otherwise specified, the dimensions and the angles of each portion of the tire are measured in the normal state.", "", "The dimensions and the angles of each portion in a meridional cross section of the tire, which cannot be measured in a state in which the tire assembled on the normal rim, are measured in a cross section (hereinafter, a reference cut surface) of the tire, which is obtained by cutting the tire along a plane including a rotation axis. In this measurement, a distance between left and right beads is set to match a distance between beads in the tire assembled on the normal rim.", "", "The normal rim means a rim determined in a standard on which the tire depends. A “Standard Rim” in a JATMA standard, a “Design Rim” in a TRA standard, and a “Measuring Rim” in an ETRTO standard are the normal rims.", "", "The normal internal pressure means an internal pressure determined in a standard on which the tire depends. A “maximum air pressure” in the JATMA standard, a “maximum value” published in “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, and an “INFLATION PRESSURE” in the ETRTO standard are the normal internal pressures.", "", "A normal load means a load determined in the standard on which the tire depends. A “maximum load capacity” in the JATMA standard, a “maximum value” published in “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in the TRA standard, and a “LOAD CAPACITY” in the ETRTO standard are the normal loads.", "", "In the present invention, a “designation of the tire” is a “Designation of the tire” defined in JIS D4202 “Automobile tires-Designation and dimensions”. The “designation of the tire” is also referred to as a tire size.", "", "In the present invention, a rubber composition is a composition containing base material rubber in an uncrosslinked state, which is obtained by mixing the base material rubber and a chemical in a kneading machine, such as a Banbury mixer. Crosslinked rubber is a crosslinked product of the rubber composition which is obtained by pressurizing and heating the rubber composition. The crosslinked rubber includes a crosslinked product of the base material rubber. The crosslinked rubber is also referred to as vulcanized rubber, and the rubber composition is also referred to as unvulcanized rubber.", "", "Examples of the base material rubber include natural rubber (NR), butadiene rubber (BR), styrene-butadiene rubber (SBR), isoprene rubber (IR), ethylene-propylene rubber (EPDM), chloroprene rubber (CR), acrylonitrile-butadiene rubber (NBR), and isobutylene-isoprene rubber (IIR). Examples of the chemical include a reinforcing agent, such as carbon black or silica, a plasticizing agent, such as aromatic oil, a filler, such as zinc oxide, a lubricant, such as stearic acid, an anti-aging agent, a processing aid, sulfur, and a vulcanization accelerator. The selection of the base material rubber and the chemical, the content of the selected chemical, and the like are determined as appropriate according to the specifications of each element, such as a tread and a sidewall to which the rubber composition is applied.", "", "In the present invention, a tread portion of the tire is a portion of the tire, which is in contact with a road surface. A bead portion is a portion of the tire, which is fitted into the rim. A sidewall portion is a portion of the tire, which bridges between the tread portion and the bead portion. The tire includes the tread portion, a pair of bead portions, and a pair of sidewall portions as the portions. A central portion of the tread portion is also referred to as a crown portion. A portion of an end of the tread portion is also referred to as a shoulder portion. A boundary portion between the tread portion and the sidewall portion is also referred to as a buttress.", "", "In the present invention, the number of cords that are included per a width of 5 cm of an element of the tire and that include cords arranged in parallel, is represented as the density (unit: ends/5 cm) of cords included in the element. Unless otherwise specified, the density of the cord is obtained in a cross section of an element obtained by cutting the tire in a surface perpendicular to a length direction of the cord.", "", "In the present invention, an intermediate elongation of an organic fiber cord conforms to “8.7 elongation rate under a constant load” of “JIS L1017 (Test methods for chemical fiber tire cords)”, and is expressed by an elongation (%) when a constant load determined by the standard is applied in a “load-elongation” curve of the organic fiber cord, which is obtained in an atmosphere adjusted to a temperature of 20° C.±2° C. and a humidity of 65±4%. The intermediate elongation is controlled as appropriate by adjusting the material, the fineness, the number of twists, and the like of a filament."], "claims": ["an outer surface having a tread surface that is in contact with a road surface, and a pair of side surfaces that are continuous with the tread surface, wherein the tread surface includes an equator that is an intersection point with an equatorial plane, each of the side surfaces includes a maximum width position indicating a maximum width of the tire, in a meridional cross section of the tire, an intersection point of a bead baseline and the equatorial plane is a first reference point, an intersection point of a straight line passing through the equator and extending in an axial direction and a straight line passing through the maximum width position and extending in a radial direction is a second reference point, a line segment connecting the first reference point and the second reference point is a reference line segment, an intersection point of the reference line segment and the outer surface of the tire is a shoulder reference point, and a line segment connecting the first reference point and the shoulder reference point is a shoulder line segment, a contour line of the tread surface is formed by a plurality of arcs arranged in the axial direction, the plurality of arcs include a center arc that is an arc passing through the equator, a pair of shoulder arcs each of which is positioned on an outermost side in the axial direction and has a smallest radius, a pair of middle arcs each of which is positioned adjacent to the center arc and has a radius smaller than a radius of the center arc, and a pair of side arcs each of which is positioned between the middle arc and the shoulder arc and has a radius smaller than the radius of the middle arc, and in a normal state in which the tire is assembled on a normal rim, an internal pressure of the tire is adjusted to a normal internal pressure, and no load is applied to the tire, a ratio of a length of the shoulder line segment to a length of the reference line segment is 85.9% or more and 89.3% or less, and a ratio of the radius of the center arc to the radius of the middle arc is 1.85 or more and 2.00 or less.", "wherein a ratio of the radius of the middle arc to the radius of the side arc is 2.08 or more and 2.74 or less.", "wherein a ratio of a ground contact width of a ground contact surface of the tire, which is obtained by assembling the tire on the normal rim, adjusting the internal pressure of the tire to the normal internal pressure, applying a load of 70% of a normal load to the tire, and bringing the tire into contact with a plane, to a cross-sectional width of the tire is 74% or more and 84% or less.", "a pair of beads; and a carcass that bridges between the pair of beads, wherein a ratio of a length of the shoulder line segment from the carcass to the shoulder reference point to the length of the shoulder line segment is 6% or more and 12% or less.", "wherein an axially outer end of a ground contact surface, which is obtained by applying a load of 70% of a normal load to the tire in the normal state and bringing the tire into contact with a plane, is a reference ground contact end, and a position corresponding to the reference ground contact end on the outer surface of the tire is a reference ground contact position, and in the normal state, a ratio of an axial distance from the equator to the reference ground contact position to an axial distance from the equator to the shoulder reference point is 79% or more and 86% or less.", "wherein, in the normal state, a ratio of an axial distance from the equator to the maximum width position to an axial distance from the equator to the shoulder reference point is 1.07 or more and 1.13 or less.", "wherein a contour line of the side surface includes an upper arc, the upper arc is an arc that extends from the maximum width position toward the shoulder reference point, and in the normal state, a ratio of a radial distance from the shoulder reference point to an outer end of the upper arc to a radial distance from the shoulder reference point to the maximum width position is 50% or more and 60% or less.", "a pair of beads; a carcass that bridges between the pair of beads; a tread that is positioned radially outside the carcass; a pair of sidewalls that are positioned axially outside the carcass; and a pair of clinches that are positioned radially inside the sidewall, wherein a protrusion that protrudes outward from the outer surface of the tire and extends in a circumferential direction is provided at a boundary portion between the tread and the sidewall, the outer surface of the tire includes a serration region between the shoulder reference point and the maximum width position, the serration region includes a plurality of narrow grooves that extend in the circumferential direction, and a ridge that is positioned between the narrow grooves adjacent to each other, the serration region is positioned radially inside the protrusion, and a total of a height of the protrusion and a maximum depth of the narrow groove is 0.5 mm or more and 0.9 mm or less.", "wherein a ratio of a radial width of the serration region to a radial distance from the shoulder reference point to the maximum width position is 10% or more and 50% or less.", "wherein a rim guard that protrudes outward from the outer surface of the tire and extends in the circumferential direction is provided at a boundary portion between the sidewall and the clinch, the rim guard includes a top surface, an outer inclined surface that is positioned radially outside the top surface and is continuous with an outer end of the top surface, and an inner inclined surface that is positioned radially inside the top surface and is continuous with an inner end of the top surface, and in the meridional cross section of the tire, an angle formed by a straight line passing through the outer end and the inner end of the top surface and a tangent line of the outer inclined surface at the outer end of the top surface is 10 degrees or more and 30 degrees or less.", "wherein an axial distance from a rim width baseline to the inner end of the top surface is 12 mm or more and 18 mm or less.", "a pair of beads; a carcass that bridges between the pair of beads; a tread that is positioned radially outside the carcass; and a band that is positioned between the carcass and the tread, wherein the tread includes the tread surface, the band includes a band cord that extends substantially in a circumferential direction, the band includes a center portion that intersects with the equatorial plane, and a pair of side portions that are positioned axially outside the center portion, and the center portion has a stiffness higher than a stiffness of the side portion.", "wherein a ratio of an axial width of the side portion to an axial width of the band is 10% or more and 25% or less.", "wherein a ratio of a radial distance from the bead baseline to the maximum width position to a cross-sectional height of the tire is 51% or more and 62% or less.", "wherein the tread surface includes a pair of boundary surfaces that are continuous with the side surface, and a main body surface that bridges between the pair of boundary surfaces, a contour line of each of the boundary surfaces is the shoulder arc, an intersection point of an extension line of a contour line of the main body surface and the reference line segment is a third reference point, and a radial distance from the equator to the third reference point is 9 mm or more and 15 mm or less.", "wherein an angle formed by a line segment connecting the maximum width position and the third reference point with respect to the radial direction is 9.8 degrees or more and 16.7 degrees or less.", "wherein an intersection point of the bead baseline and a rim width baseline is a fourth reference point, and an angle formed by a line segment connecting the maximum width position and the fourth reference point with respect to the radial direction is 22.2 degrees or less."], "bibtex": "@patent{20240066922,\n    title = {TIRE},\n    number = {20240066922},\n    year = {2024},\n    note = {File: US20240066922A1-20240229.XML}\n    }", "classification": "B60C304FI"}]