[{"title": "WHEEL ASSEMBLY FOR A VEHICLE", "doc_number": "20240059096", "filename": "US20240059096A1-20240222.XML", "abstract": "A wheel assembly for a vehicle can comprise a rim body formed in a cylindrical shape, a first cover element, and a second cover element, wherein the rim body comprises at least a wheel disc element arranged in an axial direction of the rim body, wherein the first cover element is arranged at a first side of the wheel disc element and the second cover element is arranged at a second side of the wheel disc element along the axial direction of the rim body, wherein the rim body comprises a first material, wherein the first cover element and the second cover element comprise a second material, wherein the first material differs from the second material, and wherein the first cover element and the second cover element are formed differently from each other.", "detailed_description": ["FIGS.1aand1bshow a vehicle200comprising a conventional wheel assembly210. Generally, an outer cover element220and/or an outer structure of the conventional wheel assembly210is adapted to fulfill design requirements. Accordingly, the conventional cover element220or the outer structure of the conventional wheel assembly210may be formed for one mounting position of the wheel assembly210as shown inFIG.1aand the same wheel assembly210is generally mounted at another position of the vehicle200as shown inFIG.1b.", "", "In other words, a rotation direction30of the conventional wheel assembly210is same as a design direction40of the conventional wheel assembly210on a left side of the vehicle200, as shown inFIG.1a. However, the rotation direction30of the conventional wheel assembly210differs from the design direction40of the conventional wheel assembly210on a right side of the vehicle200, as shown inFIG.1b. In case ofFIG.1a, a smooth airflow around the wheel assembly210may occur. In contrast, in case ofFIG.1b, a turbulent airflow may not be avoided which may significantly deteriorate the aerodynamic performances of the vehicle200.", "", "FIGS.2aand2bshow a vehicle100comprising a pair of wheel assembly10of a wheel system20according to the present disclosure. As shown inFIG.3a, each wheel assembly10comprises a rim body11formed in a cylindrical shape, a first cover element13, and a second cover element14. The rim body11comprises at least a wheel disc element12arranged in an axial direction A of the rim body11. The first cover element13is arranged at an outer side of the wheel disc element12exposed to environment of the vehicle100and the second cover element14is arranged at an inner side of the wheel disc element12directed to an interior of the rim body11.", "", "The rim body11comprises a metallic material such as steel, aluminum or magnesium to ensure a light-weight and a high strength of the rim body11. Whereas, the first cover element13and the second cover element14comprise a plastic material such as a polyphenylene ether-polyamide (PPE-PA) blend allowing a high machinability or processability. Accordingly, each of the first cover element13and the second cover element14can be individually designed in regard to its mounting position at the vehicle100.", "", "For instance, the first cover element13of a first wheel assembly10and the first cover element13of a second wheel assembly10may be formed mirrored relative to each other (seeFIGS.2aand2b) to maximize the aerodynamic performances of the vehicle. Hence, the rotation direction30of the wheel assembly10is same as the design direction40of the wheel assembly10on the left side of the vehicle100, as shown inFIG.2a. Further, the rotation direction30of the wheel assembly10is also same as the design direction40of the wheel assembly10on the right side of the vehicle100, as shown inFIG.2b.", "", "As shown inFIGS.3aand3b, each of the first cover element13and the second cover element14comprises a plurality of venting holes15,16. The first cover element13can be formed in conformity with its mounting position and the driving direction30of the vehicle to reduce the aerodynamic drag and maximize the aerodynamic performances of the vehicle100. The plurality of venting holes15of the first cover element13is arranged aligned with the plurality of venting holes16of the second cover element14forming a plurality of venting channels19through the rim body11. Accordingly, an effective ventilation of a brake system (not shown), which may be mounted adjacent to the wheel assembly10, may be achieved.", "", "Further, as shown inFIG.3c, the second cover element14comprises a seamless surface, which may be adapted to smoothly draw the airflow passing through the plurality of venting channels19.", "", "FIG.4shows three sectional view of the wheel assembly10, in which the first cover element13and/or the second cover element14is mounted at the rim body11by at least one clamping means17. The at least one clamping means17is integrally formed with the first cover element13and/or the second cover element14. The clamping means may form one or more resilient portions at each of the first cover element13and/or the second cover element14to be fit into the wheel disc element12.", "", "Such clamping means17may enable a gapless engagement of the first cover element13and the second cover element14via the wheel disc element12. Thus, the turbulent airflow at the rim body11and/or the wheel house may be minimized and the aerodynamic performances of the wheel assembly10may be improved.", "", "Alternatively or additionally to the clamping means17, the first cover element13and/or the second cover element14may be fixedly attached to the rim body11by mechanical fixing means18such as screw, bolt, etc. (see alsoFIG.3b). Further, the first cover element13and/or the second cover element14may be also mounted at the rim body11using an adhering means such as a tape, a glue, etc.", "", "It has to be noted that examples of the disclosure are described with reference to different subject matters. In particular, some examples are described with reference to method type claims whereas other examples are described with reference to the device type claims. However, a person skilled in the art will gather from the above and the following description that, unless otherwise notified, in addition to any combination of features belonging to one type of subject matter also any combination between features relating to different subject matters is considered to be disclosed with this application. However, all features can be combined providing synergetic effects that are more than the simple summation of the features.", "", "While the disclosure has been illustrated and described in detail in the drawings and description, such illustration and description are to be considered illustrative or exemplary and not restrictive. The disclosure is not limited to the disclosed examples. Other variations to the disclosed examples can be understood and effected by those skilled in the art in practicing a claimed disclosure, from a study of the drawings, the disclosure, and the dependent claims.", "", "In the claims, the word “comprising” does not exclude other elements or steps, and the indefinite article “a” or “an” does not exclude a plurality. A single processor or other unit may fulfil the functions of several items recited in the claims. The mere fact that certain measures are recited in mutually different dependent claims does not indicate that a combination of these measures cannot be used to advantage. Any reference signs in the claims should not be construed as limiting the scope."], "claims": ["a rim body formed in a cylindrical shape; a first cover element; and a second cover element, wherein the rim body comprises at least a wheel disc element arranged in an axial direction of the rim body, wherein the first cover element is arranged at a first side of the wheel disc element and the second cover element is arranged at a second side of the wheel disc element along the axial direction of the rim body, wherein the rim body comprises a first material, wherein the first cover element and the second cover element comprise a second material, wherein the first material differs from the second material, and wherein the first cover element and the second cover element are formed differently from each other.", "2 . The wheel assembly of claim 1 , wherein each of the first cover element and the second cover element comprise a plurality of venting holes.", "3 . The wheel assembly of claim 2 , wherein the plurality of venting holes of the first cover element are aligned with the plurality of venting holes of the second cover element, forming a plurality of venting channels through the rim body.", "4 . The wheel assembly of claim 2 , wherein the plurality of venting holes of the first cover element are formed to be compatible with a driving direction of the vehicle.", "5 . The wheel assembly of claim 1 , wherein the first side is an outer side of the wheel disc element exposed to an environment and the second side is an inner side of the wheel disc element directed to an interior of the rim body.", "6 . The wheel assembly of claim 1 , wherein the second cover element comprises a seamless surface.", "7 . The wheel assembly of claim 1 , wherein the first material comprises a metallic material.", "8 . The wheel assembly of claim 1 , wherein the second material comprises a plastic material.", "9 . The wheel assembly of claim 1 , wherein the first cover element or the second cover element are mounted at the rim body by at least one clamping means.", "10 . The wheel assembly of claim 9 , wherein the at least one clamping means is integrally formed with the first cover element or the second cover element.", "11 . The wheel assembly of claim 1 , wherein the first cover element or the second cover element is mounted at the rim body by at least one mechanical fixing means.", "a first wheel assembly, comprising: a first rim body formed in a cylindrical shape; a first cover element; and a second cover element, wherein the first rim body comprises at least a first wheel disc element arranged in an axial direction of the first rim body, wherein the first cover element is arranged at a first side of the first wheel disc element and the second cover element is arranged at a second side of the first wheel disc element along the axial direction of the first rim body, wherein the first rim body comprises a first material, wherein the first cover element and the second cover element comprise a second material, wherein the first material differs from the second material, and wherein the first cover element and the second cover element are formed differently from each other; and and a second wheel assembly, comprising: a second rim body formed in a cylindrical shape; a third cover element; and a fourth cover element, wherein the second rim body comprises at least a second wheel disc element arranged in an axial direction of the second rim body, wherein the third cover element is arranged at a third side of the second wheel disc element and the fourth cover element is arranged at a fourth side of the second wheel disc element along the axial direction of the second rim body, wherein the second rim body comprises the first material, wherein the third cover element and the fourth cover element comprise the second material, and wherein the third cover element and the fourth cover element are formed differently from each other, and wherein the first wheel assembly is arrangeable on a left side of the vehicle and the second wheel assembly is arrangeable on a right side of the vehicle relative to a driving direction of a vehicle.", "13 . The wheel system of claim 12 , wherein the first cover element of the first wheel assembly and the third cover element of the second wheel assembly are formed mirrored relative to each other.", "14 . The wheel system of claim 12 , wherein each of the first cover element and the second cover element comprise a plurality of venting holes.", "15 . The wheel system of claim 14 , wherein the plurality of venting holes of the first cover element are aligned with the plurality of venting holes of the second cover element, forming a plurality of venting channels through the first rim body.", "16 . The wheel system of claim 14 , wherein the plurality of venting holes of the first cover element are formed to be compatible with a driving direction of the vehicle.", "providing a rim body formed in a cylindrical shape and comprising at least a wheel disc element arranged in an axial direction of the rim body, wherein the rim body comprises a first material; providing a first cover element comprising a second material and a second cover element comprising a second material; and arranging the first cover element at a first side of the wheel disc element and arranging the second cover element at a second side of the wheel disc element along the axial direction of the rim body, wherein the first material differs from the second material, and wherein the first cover element and the second cover element are formed differently from each other.", "18 . The method of claim 17 , wherein the second cover element comprises a seamless surface.", "19 . The method of claim 17 , wherein the first material comprises a metallic material.", "20 . The method of claim 17 , wherein the second material comprises a plastic material."], "bibtex": "@patent{20240059096,\n    title = {WHEEL ASSEMBLY FOR A VEHICLE},\n    number = {20240059096},\n    year = {2024},\n    note = {File: US20240059096A1-20240222.XML}\n    }", "classification": "B60B704FI"}, {"title": "WHEEL HUB WITH PASSAGEWAY", "doc_number": "20240059097", "filename": "US20240059097A1-20240222.XML", "abstract": "In one aspect of the present disclosure, a wheel hub is provided that includes a wheel hub body having an inboard end and an outboard end. The wheel hub body has a wheel mounting portion, such as a flange, intermediate the inboard and outboard ends. The wheel hub body has a central opening, an interior surface extending about the central opening, and an exterior surface opposite the interior surface. The wheel hub includes a passageway having an interior port at the interior surface of the wheel hub body and an exterior port at the exterior surface of the wheel hub body. The interior port is outboard of the inboard end of the wheel hub body. The exterior port is intermediate the wheel mounting portion and the outboard end of the wheel hub body.", "detailed_description": ["With reference toFIG.1, a wheel end assembly10is provided for a commercial vehicle. The wheel end assembly10includes a wheel hub12mounted to a spindle14and rotatable about a central axis16. The wheel hub12includes axle studs18for receiving a drive flange19of a half-shaft21(seeFIG.2) that drives the wheel hub12about the axis16. The wheel hub12includes a wheel hub body20having axle stud bosses22, such as bosses24,26and an exterior port28of a passageway30positioned therebetween. With reference toFIG.2, the passageway30has an inlet port such as interior port34at a radially inner surface of the wheel hub body20. The passageway30provides a conduit for, for example, compressed air or electrical wiring to be directed from the interior port34to the exterior port28.", "", "RegardingFIG.2, the wheel hub body20has a central opening23that receives spindle14and internal components of the wheel hub12and an annular wall25extending around the central opening23. The wheel hub body20has an outboard end portion50with the axle studs18projecting therefrom for connecting to the drive flange19. The outboard end portion50has an outboard end50A against which the drive flange19seats. The wheel hub body20has an inboard end portion52to which a circular brake element, such as a brake rotor64is mounted. The inboard end portion52has an inboard end52A against which the brake rotor64seats. Because the interior port34is outboard of the inboard end52A, and the exterior port28is inboard of the outboard end50A, the passageway30provides a conduit for compressed air, wire, etc. without interference from the drive flange19and the brake rotor64.", "", "The wheel end assembly10includes a cartridge, such as a rotary union32, for transferring pressurized air to the passageway30when the vehicle is stopped or in motion. The rotary union32includes a pressurized air receiver102mounted to the spindle14and a pressurized air distributor104mounted to the wheel hub body20. The pressurized air distributor104rotates about the pressurized air receiver102during rotation of the wheel hub body20. The rotary union32facilitates airflow between the non-rotatable pressurized air receiver102and the rotatable pressurized air distributor104. More specifically, the pressurized air receiver102has a compressed air inlet100that receives pressurized air from a pressurized air source of the vehicle, such as a compressor reservoir. Application of pressurized air at the pressurized air inlet100causes a seal101of the rotary union32to engage and form an airtight seal between the pressurized air receiver102and the pressurized air distributor104. Pressurized air may thereby travel from the pressurized air inlet100, through the engaged seal101, out from the outlet106, and into the passageway30. The pressurized air may travel from the passageway30to a tire associated with the wheel hub body20. For example, a one-way valve may be threadingly engaged with the exterior port28and configured to direct compressed air into a conduit that leads to the tire.", "", "Returning toFIG.1, the wheel hub body20includes a mounting portion, such as a mounting flange40, for receiving a wheel. In one embodiment, the wheel hub12includes studs42of the mounting flange40that are positioned to receive openings of a central flange of a wheel. The wheel hub body20has a barrel44and a pilot45of the wheel hub body20that centers an opening of the central flange of the wheel as the wheel is mounted to the wheel hub12in inboard direction51or is removed from the wheel hub12in outboard direction53.", "", "The wheel hub body20has a protector56formed at least in part by the bosses24,26that inhibits the central flange of the wheel from contacting the exterior port28or a wheel end component, such as a valve, fitting, or tube, mounted to the exterior port28. Because the central flange of the wheel is kept away from the exterior port28, the component mounted to the exterior port28is less likely to be damaged during installation and removal of the wheel from the wheel hub12. For example, as the wheel center flange is advanced along the barrel44in the inboard direction51during mounting of the wheel to the wheel hub12, a radially inner edge of the wheel center flange may be supported on the bosses24,26radially outward from the exterior port28. Further, the wheel studs42have ends43that are outboard of the exterior port28. The wheel stud ends43extend in holes of the wheel central flange and help center the wheel central flange on the wheel hub body20when the wheel central flange is proximate the exterior port28.", "", "With reference toFIG.2, the wheel hub12includes a spindle lock nut70for engaging the spindle14and securing the wheel hub12to the spindle14. The wheel hub12further includes outboard and inboard bearings72,74that each include a cone76, a cup78, and bearing elements, such as tapered rollers80, that roll along races of the cone and cup76,78to facilitate rotation of the wheel hub body20around the axis16. The wheel hub12has a spacer84that maintains a fixed axial distance between the cones76of the outboard and inboard bearing assemblies72,74.", "", "To assemble the wheel hub12onto the spindle14, the wheel hub body20including the outboard and inboard bearing assemblies72,74, spacer84, and rotary union32mounted therein are advanced in an inboard direction51onto the spindle14. The cone76of the inboard bearing assembly74seats against a shoulder surface92of the spindle14and the spindle lock nut70is connected to an outboard end portion94of the spindle14, such as via a threaded connection. The spindle lock nut70nut may include a retainer to inhibit unintentional loosening of the spindle lock nut70from the spindle14. Because the passageway30is formed in the annular wall25and the rotary union32is mounted to the wheel hub body20, the wheel hub12provides a readily installed conduit for pressurized air from a non-rotatable pressurized air source on the vehicle to a tire mounted to the wheel hub20.", "", "RegardingFIG.3, a wheel hub body20A is provided that is similar in many respects to the wheel hub body20and may be used in place of the wheel hub body20in the wheel hub12. Thus, similar structures of the wheel hub bodies20,20A will be referred to with similar reference numerals, with the letter “A” added to the reference numbers to refer to the structure in the wheel hub body20A. It will be appreciated that the following description of various structures of the wheel hub body20A will be applicable to the corresponding structures of the wheel hub body20.", "", "The wheel hub body20A has an exterior port28A and axle stud bosses24A,26A on opposite sides thereof. The wheel hub body20A includes an interior120having a radially inner surface122with various surface portions to accommodate the internal components of the wheel hub12such as the outboard and inboard bearings72,74. The wheel hub body20includes an exterior124that is exposed to the wheel end surrounding environment. The wheel hub body20A has a sidewall25A and a lubricant fill opening132formed therein that opens to a grease pocket (see grease pocket130inFIG.2) of the interior120of the wheel hub body20A. The lubricant fill opening may be closed by a fill plug that is threadingly engaged with the opening132.", "", "RegardingFIG.4, the wheel hub body20A has a pocket140formed in the exterior124that radially recesses the exterior port28A from radially outer surface portions144,146of the axle stud bosses24A,26A. The exterior port28A includes an opening161and a flat surface142extending about the opening161. The outer surface portions144,146of the axle stud bosses24A,26A each have a maximum outer radius148,150taken perpendicularly from the central axis16. The outer surface portions144,146of the axle stud bosses24A,26A are peaks of outer surfaces154,156of the axle stud bosses24,26. The outer surface portions144,146are oriented along an arc160extending between the axle stud bosses24A,26A. The opening161has a maximum distance152taken perpendicularly to the central axis16that is less than the radii148,150such that the opening161is radially closer to the central axis16than the outer surface portions144,146of the axle stud bosses24A,26A. In this manner, the radially inner edge of a center flange of a wheel being mounted to or removed from the wheel hub body20A will contact the outer surface portions144,146and be supported thereon rather than damaging a component (e.g. a fitting) installed at the exterior port28.", "", "With reference toFIG.5, the wheel hub body20A has a through opening surface170defining a through opening171in the material of the wheel hub body20A that extends from the interior120to the exterior124of the wheel hub body20A. The passage30A includes a tube172in the through opening171. The tube172has an interior180that provides a channel for pressurized air to flow between the interior120and exterior124. As discussed in greater detail below, during manufacture of the wheel hub body20A the tube172is cast in the side wall of the wheel hub body20A. The tube172has an end portion177that is initially closed during casting to inhibit the flow of molten material into the interior180of the tube172.", "", "In one embodiment, the interior port34A of the passageway30A includes an inlet opening182of an inlet end portion184of the tube172. As discussed below with respect toFIG.12, the inlet opening182of the tube170is formed during machining of the geometry of the interior120of the wheel hub body20A. The machining of the interior120includes machining the portions that support with the components of the wheel hub12, such as outboard and inboard bearing seats190,192, a groove194to receive a seal case196(seeFIG.2) of a lubricant seal197associated with the inboard bearing assembly74, and a seat199for the pressurized air distributor104.", "", "With reference toFIGS.6-12, a method of manufacturing the wheel hub body20A is provided. With reference toFIGS.6and8, a core box is initially used to form a shell core210made of resin-coated sand. The shell core210is positioned in a mold212(seeFIG.10) for casting the wheel hub body20A. The core box includes at least two portions, such as halves, that are brought together and injected with the resin-coated sand and the core box is heated so that the resin-coated sand touching the core box cures to form the shell core210. In one embodiment, the core box includes a mold half214having a cavity216to form half of a body218(seeFIG.8) of the shell core210. The mold half214is shown empty inFIG.6to illustrate grooves218,220for receiving inserts to be cast with the wheel hub body such as tubes222,224. The tubes222,224are positioned in the mold half214as shown inFIG.7. A mold half identical to mold half214is brought together with the mold half214so that the aligned cavities216of the mold halves form a completed core box cavity. The resin-coated sand is then injected into the core box cavity and the core box with the resin-coated sand therein is heated to cure the sand.", "", "The mold half214is shown inFIG.6with two grooves218,220for receiving two tubes222,224. The two tubes222,224are shown positioned in the grooves218,220inFIG.7. The two tubes222,224each form a portion of one of two passageways of the wheel hub. Each of the passageways may be used to provide compressed air to one of two tires of a dual-tire wheel mounted to the wheel hub. In another embodiment, the wheel hub has a single passageway such that the mold half214used to form the shell core210for the wheel hub has a single groove to receive a single tube. The single passageway may be used to provide compressed air to the one tire of a single-tire wheel mounted to the wheel hub. It will be appreciated that any number of grooves may be formed in the mold half214to support a corresponding number of tubes for the resulting sand core.", "", "With reference toFIGS.8and9, the shell core210is shown after having been removed from the core box cavity. The shell core210is hollow and includes a hollow interior230and a sidewall232extending thereabout. The tubes222,224have end portions240,242that are embedded in retaining portions244,246of the sidewall232. The tube end portions240,242may be opened or closed. The tubes222,224have opposite end portions250,252that are spaced radially outward from a radially outer surface254of the body218. The end portions250,252are closed, such as by crimping, to inhibit the flow of molten material into interiors260,262of the tubes222224during the casting operation. The tubes222,224have one or more bends270,272and permit a manufacturer to provide a non-linear passageway between the interior120and the exterior124of the wheel hub body20A. The tubes222,224have sidewalls274that may be made of steel or aluminum, as some examples.", "", "RegardingFIG.10, the mold212includes one or more mold portions213, such as a cope282and a drag284, that define at least a portion of a cavity286for forming a wheel hub casting290(seeFIG.12). The mold212has a mold parting line285. The mold portions213are clamped together to inhibit seepage of molten material out of the cavity286. The mold212has an opening310for directing the molten material into the cavity286.", "", "RegardingFIGS.10and11, the shell core210is positioned in the cavity286with a socket portion291of the shell core210engaged with a boss292of a seat294of the mold212. The tubes222,224project radially outwardly into the mold cavity286from an outer surface287of the sidewall232of the shell core210. The end portions250,252of the tubes222,224are positioned in a portion of the cavity286between a radially inner surface300of the mold portions213and the radially outer surface254of the shell core210that is configured to form a sidewall306(seeFIG.12) of the casting290.", "", "To form the casting290, molten material is directed into the mold cavity286about the shell core210. The molten material may be, for example, aluminum. The molten material is permitted to cool and harden in the cavity286to form the casting290with the tubes222,224therein about the shell core210.", "", "Once the casting290has hardened, the cope282is disconnected from the drag284. The casting is then removed from the drag284.", "", "The method of forming the wheel hub body20A next includes removing the shell core body218from the wheel hub casting290. This may be done, for example, by vibration and/or air blasting to remove the resin-coated sand that forms the body218of the shell core210from a central opening320of the casting290.", "", "RegardingFIG.12, once the body218of the shell core210has been removed from the casting290, the tubes222,224have portions322,324protruding radially inward from a radially inner surface326extending about the central opening320. Further, the end portions250,252are embedded in the sidewall306of the casting290. The casting290has an exterior307with pockets140formed by corresponding features of the drag284. The casting290has wall portions330separating flat surfaces332of the pockets140from end portions250,252of the tubes222,224.", "", "The method of forming the wheel hub20A includes forming the openings161(seeFIG.5) in the flat surfaces332of the pockets140. The forming of the openings161opens the end portions250,252of the tubes222,224and places the interiors260,262of the tubes222,224in communication with the openings161. For example, the openings161may be formed by drilling into the flat surfaces332and advancing the drill bit until the drill bit removes the crimped material of the tube end portions250,252. The flat surfaces332make it easier to position the drill bit in the pockets140and orient the drill bit along a trajectory that intersects the tube end portions250,252.", "", "The method next includes machining the interior305of the wheel hub casting290to form the internal geometry of the wheel hub body20A, such as the inboard and outboard bearing seats190,192, groove194, and seat196(seeFIG.5). The machining operation also removes portions322,324of the tubes222,224protruding in the central opening320. The resulting wheel hub body20A is shown inFIG.5after the drilling of the holes161and the machining of the interior305of the wheel hub casting290.", "", "With reference toFIG.13, a wheel hub body400is provided that is similar in many respects to the wheel hub body20discussed above. The wheel hub body400includes a sidewall402extending about a central opening404of the wheel hub body400. The wheel hub400has two passageways420that operate as a conduit through the sidewall402for compressed air or wiring, as some examples. The wheel hub body400has a barrel406and a pilot407to direct movement of a center flange of a wheel as the wheel is mounted to or removed from the wheel hub body400. The wheel hub body400includes axle stud bosses408,410on either side of an exterior port412of the passageway420inFIG.13to protect the exterior port412and components connected thereto from damage by a wheel as the wheel is being mounted to or removed from the wheel hub body400.", "", "With reference toFIG.14, the two passageways420each have an exterior port412and an interior port422. Each exterior port412includes an opening434and a flat surface428extending thereabout. The opening434may be formed by, for example, drilling into the sidewall402along an axis437. Each interior port422is formed at an interior surface423of the wheel hub body420. The interior ports422have pockets424formed by protrusions460,462(seeFIG.16) of a shell core450as discussed below. The pockets424have openings432that open to the interior surface423.", "", "Each passageway420has a juncture430between the opening434of the exterior port412and the pocket424of the interior port422. The juncture430between opening434and the pocket424permits, for example, compressed air to flow from the pocket424, through the opening434, and out from the exterior port412.", "", "With reference toFIGS.15-19, an example method of manufacturing the wheel hub body400is provided. Initially, a shell core450is formed using a core box. The shell core450is used with a mold500(seeFIG.17) to form a casting484(seeFIG.19). The casting484is machined to form the wheel hub400.", "", "The shell core450includes a body452made of cured resin-coated sand and having a hollow interior454and a sidewall456extending thereabout. The shell core450has protrusions460,462extending radially outward from flats464,466. The shell core450also includes recesses470,472that receive casting material to form radially thicker portions480(seeFIG.19) of a sidewall482of the casting484. The additional material of the radially thicker portions480allows the openings434to be formed in thicker portions480of the sidewall482(seeFIG.19) of the casting484and increases the strength of the wheel hub400. In one embodiment, the thicker portions480includes two diametrically opposed ridges each axially aligned with one of the passageways420. In another embodiment, the shell core450does not includes recesses470,472but instead has an outer diameter sized to form a continuous, annular thicker portion480extending around a central opening486of the casting484.", "", "With reference toFIGS.17and18, the mold500is similar in structure and operation to the mold312discussed above. The mold500includes mold portions502that form a cavity504in which the shell core450is positioned. The mold portions502include a cope506and a drag508. The protrusions460,462of the shell core450extend radially outward into a portion510of the cavity504configured to form the sidewall482of the casting484between a radially inner surface514of the mold portions502and a radially outer surface516of the shell core450.", "", "The method includes directing molten wheel hub material, such as aluminum, into the cavity504about the shell core450. The molten material is permitted to cool and form the wheel hub casting484. InFIG.19, the wheel hub casting484is shown having been removed from the mold500and the shell core450removed from the central opening486of the wheel hub casting484using, for example, vibration and/or air blasting. The casting484includes pockets532,534formed by the protrusions460,462of the shell core450in a radially inner surface536of the casting484. In one approach, the casting formed using the mold500may be longer than the desired length of the wheel hub casting484, such that the inboard and/or outboard ends of the casting are machined to provide the desired length of the wheel hub casting484.", "", "The method further includes machining the radially inner surface536of the wheel hub casting484to accurately define the internal structures of the wheel hub400, such as the bearing seats, grooves, etc. The machining of the radially inner surface536involves machining radially inner portions of the pockets532,534to provide the pockets424as shown inFIG.14. The method further includes drilling or otherwise forming the openings434(seeFIG.14) of the passageways420. The intersection between the openings434and the pockets424completes the passageways420.", "", "Uses of singular terms such as “a,” “an,” are intended to cover both the singular and the plural, unless otherwise indicated herein or clearly contradicted by context. The terms “comprising,” “having,” “including,” and “containing” are to be construed as open-ended terms. It is intended that the phrase “at least one of” as used herein be interpreted in the disjunctive sense. For example, the phrase “at least one of A and B” is intended to encompass A, B, or both A and B.", "", "While there have been illustrated and described particular embodiments of the present invention, it will be appreciated that numerous changes and modifications will occur to those skilled in the art, and it is intended for the present invention to cover all those changes and modifications which fall within the scope of the appended claims."], "claims": ["a wheel hub body having an inboard end and an outboard end; a wheel mounting portion of the wheel hub body intermediate the inboard and outboard ends; a central opening of the wheel hub body; an interior surface of the wheel hub body extending about the central opening; an exterior surface of the wheel hub body opposite the interior surface; a passageway having an interior port at the interior surface of the wheel hub body, the interior port outboard of the inboard end of the wheel hub body; and an exterior port of the passageway at the exterior surface of the wheel hub body, the exterior port intermediate the wheel mounting portion and the outboard end of the wheel hub body.", "wherein the interior port is inboard of the inboard bearing seat.", "3 . The wheel hub of claim 1 wherein the wheel hub body includes axle stud bosses and recesses therebetween having at least a portion of the exterior surface thereon; and wherein the exterior port is in one of the recesses.", "4 . The wheel hub of claim 1 wherein the interior port is inboard of the wheel mounting portion.", "wherein the exterior port includes an opening and a flat surface portion of the exterior surface extending about the opening; and wherein the flat surface portion of the exterior port extends obliquely to the central axis.", "wherein the passageway comprises a through opening in the wheel hub body.", "7 . The wheel hub of claim 1 wherein the passageway comprises a through opening in the wheel hub body and a tube in the through opening.", "8 . The wheel hub of claim 7 wherein at least one of the interior port and the exterior port includes a portion of the tube.", "9 . The wheel hub of claim 1 wherein the exterior port includes a flat surface portion of the exterior surface and an opening that opens to the flat surface.", "wherein the passageway includes a tube in the through opening of the wheel hub body; and wherein the tube includes an end portion spaced inboard of the flat surface portion of the exterior port.", "11 . The wheel hub of claim 1 wherein the wheel hub body includes a protector adjacent the exterior port, the protector configured to inhibit a wheel from contacting the exterior port as the wheel is moved along the wheel hub body.", "wherein the passageway includes a straight through bore intersecting the pocket; and wherein the exterior port includes at least a portion of the straight through bore.", "13 . The wheel hub of claim 1 wherein the mounting portion comprises a flange.", "14 . The wheel hub of claim 1 further comprising inboard and outboard bearings engaged with the interior surface of the wheel hub body.", "15 . The wheel hub of claim 1 wherein the passageway comprises a first passageway and a second passageway.", "the passageway includes a straight portion extending obliquely to the central axis.", "17 - 27 . (canceled)", "casting a wheel hub casting having a central opening and a sidewall extending about the central opening, wherein casting includes forming a partial passageway in the sidewall of the wheel hub casting; and forming an opening in the sidewall to complete the passageway.", "wherein forming the opening in the sidewall includes forming the opening in an exterior surface of the sidewall.", "wherein forming the opening in the sidewall includes forming an elongate opening extending in a second direction transverse to the first direction.", "positioning a shell core in a cavity of a mold; and advancing casting material into the cavity of the mold about the shell core.", "wherein the passageway includes at least a portion of the tube.", "33 . The method of claim 32 wherein forming the opening in the sidewall includes removing a portion of the tube.", "34 . The method of claim 32 further comprising machining an interior of the wheel hub casting including removing a portion of the tube.", "positioning a shell core in a cavity of a mold, the shell core having a protrusion to form the partial passageway of the wheel hub casting; and advancing casting material into the cavity about the shell core.", "wherein forming the opening in the wheel hub casting includes forming the opening in the wheel hub adjacent the passageway protector.", "37 . The method of claim 28 wherein forming the opening in the sidewall includes forming the opening between axle stud bosses of the wheel hub casting.", "38 . The method of claim 28 further comprising machining an interior of the wheel hub casting, the machining including reshaping an opening of the partial passageway.", "39 - 47 . (canceled)", "a wheel hub body; a wheel mounting portion of the wheel hub body to receive a wheel; a passageway including an exterior port of the wheel hub body and an interior port of the wheel hub body; and a protector of the wheel hub body configured to inhibit the wheel from contacting the exterior port.", "49 . The wheel hub of claim 48 wherein the protector comprises a protrusion of the wheel hub body adjacent the exterior port so that the wheel contacts the protrusion instead of the exterior port as the wheel is moved along the wheel hub body.", "50 . The wheel hub of claim 49 wherein the protrusion comprises a pair of protrusions having the exterior port therebetween.", "wherein the exterior port has a first maximum radial distance from the central axis of rotation; and wherein the protector includes a protector surface portion adjacent the exterior port and having a second maximum radial distance from the central axis of rotation that is greater than the first maximum radial distance so that the protector surface portion is radially outward of the exterior port.", "wherein the wheel hub body includes a recess between the protector surface portions; and wherein the exterior port is in the recess.", "53 . The wheel hub of claim 48 wherein the protector comprises axle stud bosses.", "54 . The wheel hub of claim 48 wherein the exterior port comprises an opening and an annular surface extending about the opening.", "wherein the exterior port is inboard of the outboard end of the wheel hub body.", "wherein the interior port is outboard of the inboard end of the wheel hub body.", "wherein the exterior port includes a recess of the exterior surface.", "58 . The wheel hub of claim 57 wherein the interior port includes a recess of the interior surface.", "59 . The wheel hub of claim 48 wherein the passageway includes a through opening in the wheel hub body.", "60 . The wheel hub of claim 59 wherein the passageway includes a tube in the through opening of the wheel hub body."], "bibtex": "@patent{20240059097,\n    title = {WHEEL HUB WITH PASSAGEWAY},\n    number = {20240059097},\n    year = {2024},\n    note = {File: US20240059097A1-20240222.XML}\n    }", "classification": "B60B2702FI"}, {"title": "AUTOMATIC SPEED REDUCING WHEEL", "doc_number": "20240059098", "filename": "US20240059098A1-20240222.XML", "abstract": "An automatic speed reducing wheel includes a wheel unit and a speed reducing unit. The wheel unit includes a wheel seat, a wheel axle passing through the wheel seat, and a roller rotating about the wheel axle. A plurality of blockers is disposed on one side of the wheel frame in adjacent to an edge thereof in a radiation shape arrangement. The blockers rotate along with the roller. The speed reducing unit includes a fixing seat and a sliding member. The fixing seat is on one side of the roller and includes a sliding bore. The sliding member is slidably disposed in the sliding bore and includes an elastic portion having a blocking portion. When the roller moves downhill, the blocking portion of the sliding member protrudes out of an outer side of the sliding bore to interrupt a rotation route of the blockers, achieving a speed reducing effect.", "detailed_description": ["The aforementioned and further advantages and features of the present invention will be understood by reference to the description of the preferred embodiment in conjunction with the accompanying drawings where the components are illustrated based on a proportion for explanation but not subject to the actual component proportion.", "", "The following content is illustrated in conjunction with the drawings of the preferable embodiments of the present invention, so as to enable people skilled in the art of the present invention to implement the present invention according to the specification.", "", "Referring toFIG.1toFIG.4, the automatic speed reducing wheel1of the present invention comprises a wheel unit10and a speed reducing unit20.", "", "The wheel unit10comprises a wheel seat11, a wheel axle12passing through the wheel seat11, and a roller13rotating about the wheel axle12. Two side boards111extend from the wheel seat11, and a through hole1111pass through the two side boards111, such that the wheel axle12passes through the through hole1111. The wheel axle12comprises a non-circular section121on one end thereof. The roller13is disposed between the two side boards111. The roller13comprises a wheel frame131whose outer periphery is combined with an outer wheel132. The wheel frame131comprises an axle bore1311passing through the center thereof. The wheel axle12passes through the axle bore1311. Therefore, the roller13is configured to freely rotate about the wheel axle12. A plurality of blockers1312is circularly disposed on one side of the wheel frame131in adjacent to an edge thereof in a radiation shape arrangement. The plurality of blockers1312rotates along with the roller13.", "", "The speed reducing unit20comprises a fixing seat21, a sliding member22, and a protection cover23. The fixing seat21is disposed between the two side boards111and is arranged on one side of the roller13. The fixing seat21comprises a fixing bore211and a sliding bore212. The fixing bore211is mounted around the non-circular section121of the wheel axle12and fixed thereon. The sliding bore212is normally positioned in a horizontal arrangement. The sliding member22is slidably disposed in the sliding bore212, such that the sliding member22is able to slide along the sliding bore212. The sliding member22comprises a sliding body221. The sliding body221comprises a sheet shaped elastic portion222connected with a front end of the sliding body221. The elastic portion222comprises a blocking portion223connected with a front end of the elastic portion222. The protection cover23is disposed between the two side boards111of the wheel seat11and is arranged on one side of the roller13. The protection cover23covers the fixing seat21and the sliding member22. The protection cover23comprises a combination bore231passing through the center thereof, such that the combination bore231is mounted around the non-circular section121and fixed thereon.", "", "In use, the automatic speed reducing wheel1is able to be installed on a moving vehicle such as a wheelchair2(as shown byFIG.7) or a mobility aid3(as shown byFIG.8). When the wheelchair2or the mobility aid3move on a level ground, the blocking portion223of the sliding member22is away from the rotation route of the plurality of blockers1312(as shown byFIG.4), so that the wheelchair2or the mobility aid3is able to normally move. Referring toFIG.5andFIG.6, when the wheelchair2or the mobility aid3moves downhill, the sliding bore212slants downward by an inclination angle. The sliding member22slides along the sliding bore212due to the effect of the gravity force, such that the blocking portion223of the sliding member22protrudes out of an outer side of the sliding bore212to interrupt the rotation route of the plurality of blockers1312, whereby the blocking portion223hinders the rotation of the blockers1312with the elastic deformation and resilience of the elastic portion222, so that the plurality of blockers1312passes and hits the blocking portion223one by one, achieving a speed reducing effect.", "", "Referring toFIG.9toFIG.11, the automatic speed reducing wheel1in accordance with another embodiment of the present invention is provided, comprising a wheel unit10and a speed reducing unit20.", "", "The wheel unit10comprises a wheel seat11, a wheel axle12passing through the wheel seat11, and a roller13rotating about the wheel axle12. Two side boards111extend from the wheel seat11, and a through hole1111passes through the two side boards111, such that the wheel axle12passes through the through hole1111. The roller13is disposed between the two side boards111. The roller13comprises a wheel frame131whose outer periphery is combined with an outer wheel132. The wheel frame131comprises an axle bore1311passing through the center thereof. The wheel axle12passes through the axle bore1311. Therefore, the roller13is configured to freely rotate about the wheel axle12. A plurality of elastic blockers1313is circularly disposed on one side of the wheel frame131in adjacent to an edge thereof in a radiation shape arrangement. The plurality of elastic blockers1313rotates along with the roller13.", "", "The speed reducing unit20comprises a fixing seat24, a sliding member25, and a side cover26. The fixing seat24is disposed on one side of the roller13. The fixing seat24comprises a sliding bore241. The sliding member25is slidably disposed in the sliding bore241. The sliding member25comprises a position limiting groove251disposed on the middle section thereof. The position limiting groove251allows the sliding member25to slide along the sliding bore241in a position limiting range. The sliding member25comprises a blocking portion252on the front end thereof. The side cover26is disposed on one side of the roller13and is combined with the fixing seat24. The side cover26covers the fixing seat21and the sliding member22, such that the sliding bore241of the fixing seat24is normally positioned in a horizontal arrangement. The side cover26comprises a through bore261passing through the center thereof, and the wheel axle12passes through the through bore261. The side cover26comprises an arc bore262, by which two screws263pass to be fastened on one of the side boards111, whereby the side cover26is connected with the wheel seat11, and the wheel seat11is able to sway with respect to the side cover26within the arc bore262. Therein, the position limiting groove251comprises a first end2511and a second end2512. The position limiting range is the interval range between the first end2511and the second end2512.", "", "In use, the automatic speed reducing wheel1is able to be installed on a moving vehicle such as a wheelchair2(as shown byFIG.7) or a mobility aid3(as shown byFIG.8). When the wheelchair2or the mobility aid3move on a level ground, the blocking portion252of the sliding member25is away from the rotation route of the plurality of the elastic blockers1313(as shown byFIG.11), so that the wheelchair2or the mobility aid3is able to normally move. Referring toFIG.12andFIG.13, when the wheelchair2or the mobility aid3moves downhill, the sliding bore241slants downward by an inclination angle. The sliding member25slides along the sliding bore241due to the effect of the gravity force, such that the blocking portion252of the sliding member25protrudes out of an outer side of the sliding bore241to interrupt the rotation route of the plurality of elastic blockers1313, whereby the blocking portion252hinders the rotation of the plurality of elastic blockers1313with the elastic deformation and resilience of the elastic blockers1313, so that the elastic blockers1313pass and hit the blocking portion252one by one and then recover, achieving a speed reducing effect.", "", "Further, referring toFIG.11toFIG.13, the position limiting groove251comprises a first end2511and a second end2512, and the side edge of the wheel axle12is engaged with the position limiting groove251. When the sliding bore241slants downward by an inclination angle, the second end2512of the position limiting groove251abuts against the side edge of the wheel axle12, such that the sliding member25is able to move within the position limiting range, preventing the sliding member25from being separated from the sliding bore241.", "", "With the foregoing configuration, the present invention achieves following advantages.", "", "The automatic speed reducing wheel1is able to be installed on a moving vehicle such as a wheelchair2or mobility aid3. When the moving vehicle moves downhill, the present invention provides an automatic speed reducing function to avoid a sudden acceleration, thereby preventing the user from injury during the downhill movement and increasing the safety of the user.", "", "Although particular embodiments of the present invention have been described in detail for purposes of illustration, various modifications and enhancements may be made without departing from the spirit and scope of the present invention. Accordingly, the present invention is not to be limited except as by the appended claims."], "claims": ["a wheel unit having a wheel seat, a wheel axle passing through the wheel seat, and a roller rotating about the wheel axle, the wheel seat comprising a through hole through which the wheel axle passes, the wheel axle comprising a non-circular section on one end thereof, the roller comprising a wheel frame whose outer periphery is combined with an outer wheel, the wheel frame comprising an axle bore passing through a center thereof, the wheel axle passing through the axle bore, the roller being configured to freely rotate about the wheel axle, a plurality of blockers disposed on one side of the wheel frame in adjacent to an edge thereof in a radiation shape arrangement, the plurality of blockers being configured to rotate along with the roller; and a speed reducing unit comprising a fixing seat and a sliding member, the fixing seat comprising a fixing bore and a sliding bore, the fixing bore mounted around the non-circular section of the wheel axle and fixed thereon, the fixing seat located on one side of the roller, the sliding member slidably disposed in the sliding bore, the sliding member comprising a sliding body, the sliding body comprising an elastic portion connected with a front end thereof, the elastic portion comprising a blocking portion connected with a front end thereof; when the roller moves downhill, the sliding bore slants downward by an inclination angle, and the sliding member slides along the sliding bore due to a gravity force, such that the blocking portion of the sliding member protrudes out of an outer side of the sliding bore to interrupt a rotation route of the blockers, whereby the blockers pass and hit the blocking portion one by one, such that a cooperation between the blocking portion and an elasticity of the elastic portion achieves a speed reducing effect.", "2 . The automatic speed reducing wheel of claim 1 , wherein the wheel seat comprises two side boards extending therefrom; the fixing seat is disposed between the two side boards.", "3 . The automatic speed reducing wheel of claim 1 , wherein the sliding bore is normally positioned in a horizontal arrangement.", "4 . The automatic speed reducing wheel of claim 1 , wherein the elastic portion is formed in a sheet shape.", "5 . The automatic speed reducing wheel of claim 1 , wherein the speed reducing unit comprises a protection cover; the protection cover is disposed on one side of the roller and covers the fixing seat and the sliding member; the protection cover comprises a combination bore passing through a center thereof, such that the combination bore is mounted around the non-circular section and fixed thereon.", "a wheel unit having a wheel seat, a wheel axle passing through the wheel seat, and a roller rotating about the wheel axle, the wheel seat comprising a through hole through which the wheel axle passes, the roller comprising a wheel frame whose outer periphery is combined with an outer wheel, the wheel frame comprising an axle bore passing through a center thereof, the wheel axle passing through the axle bore, the roller being configured to freely rotate about the wheel axle, a plurality of elastic blockers disposed on one side of the wheel frame in adjacent to an edge thereof in a radiation shape arrangement, the plurality of elastic blockers being configured to rotate along with the roller; and a speed reducing unit comprising a fixing seat and a sliding member, the fixing seat disposed on one side of the roller, the fixing seat comprising a sliding bore, the sliding member slidably disposed in the sliding bore, the sliding member comprising a blocking portion on a front end thereof; when the roller moves downhill, the sliding bore slants downward by an inclination angle, and the sliding member slides along the sliding bore due to a gravity force, such that the blocking portion of the sliding member protrudes out of an outer side of the sliding bore to interrupt a rotation route of the elastic blockers, whereby the blocking portion hinders the elastic blockers with an elastic deformation and resilience of the elastic blockers, so that the elastic blockers pass and hit the blocking portion one by one and then recover, achieving a speed reducing effect.", "7 . The automatic speed reducing wheel of claim 6 , wherein the sliding member comprises a position limiting groove disposed on a middle section thereof; the position limiting groove allows the sliding member to slide along the sliding bore in a position limiting range.", "8 . The automatic speed reducing wheel of claim 6 , wherein the sliding bore is normally positioned in a horizontal arrangement.", "9 . The automatic speed reducing wheel of claim 6 , wherein the wheel seat comprises two side boards extending therefrom; the speed reducing unit comprises a side cover disposed on one side of the roller; the side cover is combined with the fixing seat, and covers the fixing seat and the sliding member; the side cover comprises a through bore passing through a center thereof, and the wheel axle passes through the through bore; the side cover comprises an arc bore, by which two screws pass to be fastened on one of the side boards, whereby the side cover is connected with the wheel seat, and the wheel seat is able to sway with respect to the side cover within the arc bore."], "bibtex": "@patent{20240059098,\n    title = {AUTOMATIC SPEED REDUCING WHEEL},\n    number = {20240059098},\n    year = {2024},\n    note = {File: US20240059098A1-20240222.XML}\n    }", "classification": "B60B3300FI"}, {"title": "EMERGENCY TRAILER WHEEL ASSEMBLY", "doc_number": "20240059099", "filename": "US20240059099A1-20240222.XML", "abstract": "An emergency trailer wheel assembly for temporarily replacing a trailer wheel includes a frame member with a mounting bracket attached on a first end of the frame member and configured for attaching to a leaf spring of a trailer and a wheel rotatably attached to a second end of the frame member.", "detailed_description": ["With reference now to the drawings, and in particular toFIGS.1through5thereof, a new spare wheel assembly embodying the principles and concepts of an embodiment of the disclosure and generally designated by the reference numeral10will be described.", "", "As best illustrated inFIGS.1through5, the emergency trailer wheel assembly generally comprises a frame member12having a first end14and a second end16, the frame member12being elongate between the first end14and the second end16. The frame member12has a top side18and a bottom side20, each which extending between the first end14and the second end16. The frame member12is formed of a square tube22.", "", "A mounting bracket24comprises a plate26, a pair of U-bolts28, and a plurality of nuts30. The plate26is positioned in abutment with the bottom side20of the frame member12proximate a first end14of the frame member12. Each U-bolt28has two threaded portions32extending through each of the top side18of the frame member12and the bottom side20of the frame member12. Each U-bolt28cooperates with the top side18of the frame member12to define an associated aperture34of a pair of apertures34, wherein the mounting bracket24is configured to receive a leaf spring38of a trailer36through the pair of apertures34such that the leaf spring38extends laterally from the frame member12. Each nut30threads onto each threaded portion32of each U-bolt28and is positioned in abutment with the plate26, wherein the mounting bracket24is configured for clamping to the leaf spring38when the leaf spring38extends through the pair of apertures34such that the frame member12extends away from the trailer36proximate to and parallel to an axle40of the trailer36.", "", "A stub axle42comprises a frame portion44and a wheel portion46rotatably coupled to the frame portion44. The frame portion44is coupled to the bottom side20of the frame member12such that the wheel portion46extends away from the second end16of the frame member12. The wheel portion46is rotatable about a rotational axis parallel to a central longitudinal axis of the frame member12. A wheel48is coupled to the wheel portion46of the stub axle42.", "", "In use, the mounting bracket24clamps to the leaf spring38of the trailer36, thereby securing the assembly10to the trailer36such that the wheel48supports the trailer36on a road surface50and rotates about the rotational axis parallel to the axle40of the trailer36. This use allows the trailer36to be towed until the trailer36can be repaired.", "", "With respect to the above description then, it is to be realized that the optimum dimensional relationships for the parts of an embodiment enabled by the disclosure, to include variations in size, materials, shape, form, function and manner of operation, assembly and use, are deemed readily apparent and obvious to one skilled in the art, and all equivalent relationships to those illustrated in the drawings and described in the specification are intended to be encompassed by an embodiment of the disclosure.", "", "Therefore, the foregoing is considered as illustrative only of the principles of the disclosure. Further, since numerous modifications and changes will readily occur to those skilled in the art, it is not desired to limit the disclosure to the exact construction and operation shown and described, and accordingly, all suitable modifications and equivalents may be resorted to, falling within the scope of the disclosure. In this patent document, the word “comprising” is used in its non-limiting sense to mean that items following the word are included, but items not specifically mentioned are not excluded. A reference to an element by the indefinite article “a” does not exclude the possibility that more than one of the element is present, unless the context clearly requires that there be only one of the elements."], "claims": ["a frame member having a first end and a second end; a mounting bracket having a first clamping member coupled to said frame member proximate said first end, said mounting bracket having a second clamping member movable toward and away from said second clamping member, said mounting bracket being configured for clamping a leaf spring of a trailer between said first clamping member and said second clamping member such that said frame member extends away from the trailer proximate to and parallel to an axle of the trailer; and a wheel being rotatably coupled to said frame member proximate said second end of said frame member.", "2 . The assembly of claim 1 , further comprising said frame member being elongate between said first end and said second end, said frame member having a top side and a bottom side, each of said top side and said bottom side extending between said first end and said second end.", "3 . The assembly of claim 1 , further comprising said frame member being formed of a square tube.", "4 . The assembly of claim 2 , further comprising said mounting bracket comprising a plate, a pair of U-bolts, and a plurality of nuts, said plate being positioned in abutment with said bottom side of said frame member proximate a first end of said frame member, each said U-bolt having two threaded portions extending through each of said top side of said frame member and said bottom side of said frame member, each said U-bolt cooperating with said top side of said frame member to define an associated aperture of a pair of apertures, said mounting bracket being configured to receive a leaf spring of a trailer through said pair of apertures such that the leaf spring extends laterally from said frame member, each said nut threading onto each said threaded portion of each said U-bolt, each said nut being positioned in abutment with said plate, said mounting bracket being configured for clamping to the leaf spring when said leaf spring extends through said pair of apertures such that the frame member extends away from the trailer proximate to and parallel to an axle of the trailer.", "5 . The assembly of claim 1 , further comprising a stub axle, said stub axle comprising a frame portion and a wheel portion, said wheel portion being rotatably coupled to said frame portion, said frame portion being coupled to said frame member, said wheel portion extending away from said second end of said frame member, said wheel being coupled to said wheel portion of said stub axle.", "6 . The assembly of claim 5 , further comprising said wheel portion being rotatable about a rotational axis parallel to a central longitudinal axis of said frame member.", "7 . The assembly of claim 2 , further comprising a stub axle comprising a frame portion and a wheel portion, said wheel portion being rotatably coupled to said frame portion, said frame portion being coupled to said bottom side of said frame member, said wheel portion extending away from said second end of said frame member, said wheel being coupled to said wheel portion of said stub axle.", "8 . The assembly of claim 7 , further comprising said wheel portion is rotatable about a rotational axis parallel to a central longitudinal axis of said frame member.", "a frame member having a first end and a second end, said frame member being elongate between said first end and said second end, said frame member having a top side and a bottom side, each of said top side and said bottom side extending between said first end and said second end, said frame member being formed of a square tube; a mounting bracket comprising a plate, a pair of U-bolts, and a plurality of nuts, said plate being positioned in abutment with said bottom side of said frame member proximate a first end of said frame member, each said U-bolt having two threaded portions extending through each of said top side of said frame member and said bottom side of said frame member, each said U-bolt cooperating with said top side of said frame member to define an associated aperture of a pair of apertures, said mounting bracket being configured to receive a leaf spring of a trailer through said pair of apertures such that the leaf spring extends laterally from said frame member, each said nut threading onto each said threaded portion of each said U-bolt, each said nut being positioned in abutment with said plate, said mounting bracket being configured for clamping to the leaf spring when said leaf spring extends through said pair of apertures such that the frame member extends away from the trailer proximate to and parallel to an axle of the trailer; a stub axle comprising a frame portion and a wheel portion, said wheel portion being rotatably coupled to said frame portion, said frame portion being coupled to said bottom side of said frame member, said wheel portion extending away from said second end of said frame member such that said wheel portion is rotatable about a rotational axis parallel to a central longitudinal axis of said frame member; and a wheel being coupled to said wheel portion of said stub axle."], "bibtex": "@patent{20240059099,\n    title = {EMERGENCY TRAILER WHEEL ASSEMBLY},\n    number = {20240059099},\n    year = {2024},\n    note = {File: US20240059099A1-20240222.XML}\n    }", "classification": "B60B3700FI"}, {"title": "COMPOSITIONS FOR ELASTOMERIC COMPOUNDS AND TYRES FOR VEHICLES COMPRISING REVERSIBLE CROSS-LINKING AGENT", "doc_number": "20240059100", "filename": "US20240059100A1-20240222.XML", "abstract": "The present invention relates to compositions for elastomeric compounds for tyres, in particular for tyre treads, comprising particular reversible cross-linking agents, tyre components and tyres for vehicle wheels which comprise them. The present elastomeric compounds, due to their particular hysteretic behaviour, allow manufacturing tyres characterised by a lower rolling resistance during moderate driving and at the same time greater resistance to tearing and road grip during sports driving.", "detailed_description": ["The elastomeric composition for tyre compounds according to the present invention is characterized by one or more of the following preferred aspects taken alone or in combination with one another.", "", "The elastomeric composition according to the invention comprises at least 100 phr of at least one diene elastomeric polymer.", "", "The diene elastomeric polymer (A) may be selected from those commonly used in sulphur-vulcanisable elastomeric compositions, which are particularly suitable for producing tyres, i.e. from among solid elastomeric polymers or copolymers with an unsaturated chain having a glass transition temperature (Tg) generally lower than 20° C., preferably in the range from 0° C. to -110° C.", "", "These polymers or copolymers may be of natural origin or may be obtained by solution polymerization, emulsion polymerization or gas-phase polymerization of one or more conjugated dienes, optionally mixed with at least one comonomer, preferably selected from monoolefins, monovinylarenes and/or polar comonomers, typically in an amount not exceeding 60% by weight.", "", "The conjugated dienes generally contain from 4 to 12, preferably from 4 to 8 carbon atoms and may be selected, for example, from the group comprising: 1,3-butadiene, isoprene, 2,3-dimethyl-1,3-butadiene, 1,3-pentadiene, 1,3-hexadiene, 3-butyl-1,3-octadiene, 2-phenyl-1,3-butadiene and mixtures thereof. 1,3-butadiene and isoprene are particularly preferred.", "", "The monoolefins can be selected from ethylene and α-olefins generally containing from 3 to 12 carbon atoms, such as for example propylene, 1-butene, 1-pentene, 1-hexene, 1-octene or mixtures thereof.", "", "Monovinylarenes, which may optionally be used as comonomers, generally contain from 8 to 20, preferably from 8 to 12 carbon atoms and may be selected, for example, from: styrene; 1-vinylnaphthalene; 2-vinylnaphthalene; various alkyl, cycloalkyl, aryl, alkylaryl or arylalkyl derivatives of styrene, such as, for example, α-methylstyrene, 3-methylstyrene, 4-propylstyrene, 4-cyclohexylstyrene, 4-dodecylstyrene, 2-ethyl-4-benzylstyrene, 4-p-tolyl-styrene, 4-(4-phenylbutyl)styrene, and mixtures thereof. Styrene is particularly preferred.", "", "Polar comonomers that may optionally be used, can be selected, for example, from among acrylic acid and alkylacrylic acid esters, acrylonitriles, or mixtures thereof, such as, for example, methyl acrylate, ethyl acrylate, methyl methacrylate, ethyl methacrylate, acrylonitrile and mixtures thereof.", "", "Preferably, the diene elastomeric polymer (A) may be selected, for example, from cis-1,4-polyisoprene (natural or synthetic, preferably natural rubber), 3,4-polyisoprene, polybutadiene (in particular polybutadiene with a high content of 1,4-cis), optionally halogenated isoprene/isobutene copolymers, 1,3-butadiene/acrylonitrile copolymers, styrene/1,3-butadiene copolymers, styrene/isoprene/1,3-butadiene copolymers, styrene/1,3-butadiene/acrylonitrile copolymers, and mixtures thereof.", "", "The elastomeric composition may possibly comprise at least one polymer of one or more monoolefins with an olefinic comonomer or derivatives thereof. The monoolefins can be selected from: ethylene and α-olefins generally containing from 3 to 12 carbon atoms, such as for example propylene, 1-butene, 1-pentene, 1-hexene, 1-octene or mixtures thereof. The following are preferred: copolymers selected from ethylene and an α-olefin, optionally with a diene; isobutene homopolymers or copolymers thereof with small amounts of a diene, which are optionally at least partially halogenated. The diene possibly present generally contains from 4 to 20 carbon atoms and is preferably selected from: 1,3-butadiene, isoprene, 1,4-hexadiene, 1,4-cyclohexadiene, 5-ethylidene-2-norbornene, 5-methylene-2-norbornene, vinylnorbornene or mixtures thereof. Among them, the following are particularly preferred: ethylene/propylene (EPR) copolymers or ethylene/propylene/diene (EPDM) copolymers; polyisobutene; butyl rubber; halobutyl rubbers, in particular chlorobutyl or bromobutyl rubbers; and mixtures thereof.", "", "The above-mentioned polymers can optionally be functionalised along the main chain or at the ends thereof.", "", "The functional group may be introduced into the elastomeric polymer by processes known in the art such as, for example, during the production of the elastomeric polymer by copolymerisation with at least one corresponding functionalised monomer containing at least one ethylene unsaturation; or by subsequent modification of the elastomeric polymer by grafting at least one functionalised monomer in the presence of a free radical initiator (for example, an organic peroxide).", "", "Alternatively, the functionalisation may be introduced by reaction with suitable terminating agents or coupling agents. In particular, the diene elastomeric polymers obtained by anionic polymerization in the presence of an organometallic initiator (in particular, an organolithium initiator) may be functionalised by reacting the residual organometallic groups derived from the initiator with suitable terminating agents or coupling agents such as, for example, amines, amides, imines, carbodiimides, alkyltin halides, substituted benzophenones, alkoxysilanes, aryloxy silanes, alkyldithiols, alkyldithiolsilanes, carboxyalkylthiols, carboxyalkylthiolsilanes, and thioglycols.", "", "Useful examples of terminating agents or coupling agents are known in the art and described, for example in patents EP2408626, EP2271682, EP3049447A1, EP2283046A1, EP2895515A1, EP451604, U.S. Pat. No. 4,742,124, WO2015/086039A1 and WO2017/211876A1.", "", "Preferably, said at least one functionalised elastomeric polymer is obtained from polybutadiene (in particular polybutadiene with a high content of 1,4-cis), styrene/1,3-butadiene copolymers, styrene/isoprene/1,3-butadiene copolymers, styrene/1,3-butadiene/acrylonitrile copolymers, and mixtures thereof.", "", "Advantageously, said at least one functionalised elastomeric polymer (b) is obtained from styrene/1,3-butadiene copolymers.", "", "Useful examples of functionalised diene elastomeric polymers are the functionalised styrene butadiene copolymers SPRINTAN™ SLR 3402 e SPRINTAN™ SLR 4602, SPRINTAN™ SLR 4630, manufactured and distributed by Trinseo, PA, USA.", "", "The elastomeric composition according to the invention may comprise two or more elastomeric polymers as defined above, in a mixture.", "", "The elastomeric composition for tyres according to the present invention may comprise at least 0.5 phr, preferably at least 2 phr, more preferably at least 5 phr, of at least one reversible cross-linking agent of formula (I)", "", "A-B-C   (I)", "", "The elastomeric composition for tyres according to the present invention may comprise not more than 20 phr, preferably not more than 15 phr, 10 phr or 8 phr of at least one reversible cross-linking agent of formula (I).", "", "Preferably, the elastomeric composition for tyres according to the present invention comprises from 0.5 to 20 phr, preferably from 1 to 15 phr or from 2 to 10 phr, more preferably from 4 to 8 phr of at least one reversible cross-linking agent of formula (I).", "", "In the reversible cross-linking agent of formula (I), A is at least one functional group capable of covalently binding to the elastomeric polymer.", "", "A group may bind to the elastomeric polymers of the compound either directly or through the formation of sulphide bridges.", "", "Preferably, A is a group selected from the activated double bonds, the sulphur groups such as mercapto, di- and polysulphides and thioesters, the reactive phenols having at least one unsubstituted ortho or para position, the precursors of 1,3-dipoles, such as the 2,5-disubstituted tetrazoles described for example in patent application IT102019000025804, the pyrroles substituted in the positions proximal to nitrogen as described for example in WO2020225595A1 and WO20180876851A1 and the diene groups capable of giving Diels-Alder reactions.", "", "In one embodiment, A group is an activated double bond.", "", "By activated double bond it is meant a double bond made reactive by conjugated electron-attracting or donor groups, by electron-rich or electron-poor atoms or by particular steric constraints such as the inclusion of the double bond in tensioned cycles.", "", "Examples of activated double bonds are vinyls, unsaturated tensioned cyclic systems and unsaturated alpha-beta bonds, preferred examples are norbornene, methacryl and vinyl ether.", "", "In one embodiment, A group is a sulphur group.", "", "Examples of preferred sulphur groups capable of covalently binding to the elastomeric polymer are the —SH, —S—S—, —S—(S)n-S—, —SC(O)R, —SC(S)R—S—NR′R″ wherein R, R′ and R″ independently represent C1-C20alkyl, C6-C20aryl, alkyl-C1-C10-aryl-C6-C10, aryl-C6-C10-alkyl-C1-C10, or R′ and R″ may optionally be fused in a cycle. At least one A group is present in the reversible cross-linking agent of formula (I) but two or more groups A, equal or different from each other, may be present.", "", "In a preferred embodiment, only one A group is present in the reversible cross-linking agent of formula (I).", "", "Typically these functional groups react with the elastomer under normal vulcanisation conditions, forming covalent bonds.", "", "During the reaction, the A group of the reversible cross-linking agent may partially interfere with the sulphur-based vulcanising system present in the compound and bind to the elastomer through polysulphide bridges, thus consuming part of the vulcaniser and, in fact, reducing the extent of the sulphur cross-linking. In these cases, the skilled in the art will be able to suitably modify the sulphur vulcanisation package, varying amounts and components, to compensate for the possible loss in the sulphur cross-linking and restore the normal level thereof.", "", "In the reversible cross-linking agent of formula (I) there is optionally present a B group, i.e. an at least divalent inert organic residue, covalently linked to A and C groups, which acts as a spacer.", "", "Inert organic B residue means an organic residue that is sufficiently stable under normal conditions of processing, vulcanisation and use of the elastomeric compound.", "", "In one embodiment, B group is absent.", "", "An example of a reversible cross-linking agent of formula (I) is the following compound (I-A):", "", "wherein A=SH, B is absent and C=ter-pyridyl.", "", "This compound is described in Example 3 of EP2607381A1.", "", "In one embodiment, B group is present and is selected from alkylene C1-C20, arylene C6-C20, alkylene-C1-C10-arylene-C6-C10, arylene-C6-C10-alkylene-C1-C10, possibly including in the chain one or more heteroatoms such as N, O, S, B, P or Si or one or more functional groups such as for example —COO—, —OCO—, —CONH—, —NHCO—, —OCONH—, —NHCONH—, —CO—, —NH—C(NH)—NH—, —C(S)—S—, —S—C(S)—.", "", "Alkylene and arylene refer to an at least divalent radical obtained by removing at least one hydrogen atom from an alkyl and aryl group, respectively.", "", "Examples of preferred divalent B groups are —O—CH2—, —O—(CH2)6—, —O—(CH2)10—, —O—(CH2)11, —O—C(O)—NH—(CH2)6—NH—C(O)—O—, NH—C(O)—NH—, —(CH2)6—NH—C(O)—. Preferably, the B group has a molecular weight lower than 2000 g/mol, more preferably lower than 1000 g/mol, even more preferably lower than 500 g/mol.", "", "In the reversible cross-linking agent of formula (I), C is a multidentate organic ligand capable of reversibly coordinating at least one metal cation.", "", "The multidentate organic C ligand is an at least bidentate organic ligand, preferably it is at least tridentate, more preferably it is tridentate.", "", "The multidentate organic C ligand may be charged or neutral, preferably it is neutral.", "", "The multidentate organic C ligand comprises at least two heteroatoms, preferably selected from N, P, S and O, more preferably at least two nitrogen atoms, capable of forming coordination bonds with the metal cation.", "", "Preferably, the multidentate organic C ligand comprises at least two monodentate ligand residues such as for example the ligands described in Coordin. Chem. Rev. (1973), 9 (3-4), 219-274, in particular 237-246, par. E, subpar. i) and ii); Helv. Chim. Acta (1993), 76, 372-384; Coordin. Chem. Rev. (1997), 160, 1-52, in particular 18-24, par. 3.2.3; Inorg. Chem. (2009), 48, 1132-1147; Chem. Eur. J. (2016), 22, 17892-17908, in particular 17894-17901; Molecules (2020), 25(21), 4984-5008.", "", "Preferably, the multidentate organic C ligand comprises at least one mono- or polycyclic, 5- or 6-terms ring heterocycle, saturated, unsaturated or aromatic, possibly benzocondensate, comprising at least one heteroatom selected from N, P, S and O.", "", "Preferably, the multidentate organic C ligand comprises at least one nitrogen heterocycle selected from pyridine, bipyridine, terpyridine, pyrazine, pyrimidine, pyridazine, imidazole, pyrrole, pyrazole, indole, 1,10-phenanthroline, quinoline, isoquinoline, triazole, tetrazole, triazine, tetrazine, substituted or unsubstituted, possibly benzocondensate, more preferably, the multidentate organic C ligand comprises at least one nitrogenous heterocycle selected from pyridine and benzimidazole.", "", "The skilled in the art, by appropriately selecting the C ligand and its substituents, is capable of modulating the coordination capacity of the ligand itself and therefore of conveniently shifting the equilibrium of the cross-linking/uncross-linking reaction as a function of the temperatures of interest for the present tyre applications.", "", "Examples of ligands C are the compounds of formula (II), (III) and (IV) described below.", "", "Examples of tridentate C ligand (II) are the tripyridines of formula (II-A):", "", "wherein R1 is B group, and R2 are independently selected from H and linear or branched C2-C6alkyl.", "", "An example of a particularly preferred tridentate C ligand (II) of the bis(benzimidazol) pyridine class is 2,6-bis(1-methylbenzimidazol-2-yl)-pyridine-4-yl (MeBIP) of formula:", "", "Examples of bidentate ligands C are the compounds of formula (III) or (IV):", "", "wherein R1 is B group, and R2 are independently selected from H and linear or branched C2-C6alkyl.", "", "The ligands of formula (II-A), (III) and (IV) are described in EP2607381A1 while the preparation of a reversible cross-linking agent of formula (I) comprising the ligand (II-B) is described in the present experimental part.", "", "At least one group multidentate organic C ligand is present in the reversible cross-linking agent of formula (I) but two or more ligands C, equal or different from each other, may be present.", "", "In a preferred embodiment, only one C ligand is present in the reversible cross-linking agent of formula (I).", "", "In one embodiment, in the reversible cross-linking agent of formula (I)", "", "A-B-C   (I)", "", "only one A group is present, only one C ligand and B group is absent.", "", "In a preferred embodiment, in the reversible cross-linking agent of formula (I)", "", "A-B-C   (I)", "", "only one A group is present, only one C ligand and B group is present and is divalent.", "", "Particularly preferred reversible cross-linking agents are the agents of formula (I) wherein A=SH or norbornyl, B=—O—(CH2)1-11— and C=a bis(benzimidazol)pyridyl, in particular 2,6-bis(1-methylbenzimidazol-2-yl)-pyridine-4-yl.", "", "The elastomeric composition according to the invention preferably comprises at least 0.2 phr, at least 0.5 phr, more preferably at least 0.7 phr of at least one salt of a metal cation capable of forming complexes with the multidentate organic C ligand of the reversible cross-linking agent of formula (I).", "", "Preferably, the elastomeric composition comprises not more than 10 phr, more preferably not more 7 phr of at least one salt of the metal cation, even more preferably not more 3 phr of at least one salt of the metal cation.", "", "Preferably, the elastomeric composition comprises from 0.2 phr to 7 phr, more preferably from 0.7 phr to 3 phr of at least one salt of the metal cation.", "", "Preferably, the elastomeric composition comprises not more than 6% by weight, more preferably not more than 3% by weight, even more preferably no more than 2% by weight of at least one salt of the metal cation.", "", "Preferably, the molar ratio of reversible cross-linking agent (I) to the salt of the metal cation is between 6:1 and 0.5:1, more preferably between 4:1 and 1:1, even more preferably between 4:1 and 2:1.", "", "Such ratio varies according to the type of multidentate C ligand and the metal cation. Preferably, the molar ratio between the reversible cross-linking agent of formula (I) and the salt of the metal cation is the stoichiometric one which allows the formation of the most effective complex in giving the desired reversible cross-linking, i.e. the one in which the metal cation is complexed by at least two C ligand groups belonging to different molecules of reversible cross-linking agents of formula (I), in turn bound to the elastomeric polymer.", "", "The aforesaid stoichiometric ratio between the reversible cross-linking agent of formula (I) and the salt of the metal cation depends on the coordination number of the metal cation and on the coordination centres of the ligand, and is typically between 2:1 and 4:1. However, it is possible that in the compound the ligand or the metal are not completely involved in forming the desired complexes, therefore it will be possible and technologically convenient to select ratios other than the theoretical stoichiometric ones.", "", "The elastomeric composition according to the invention may comprise a salt of the metal cation or more in mixture.", "", "The salt of the metal cation comprises a metal cation and an anion.", "", "The metal cation may be any metal cation capable of forming complexes with ligands.", "", "The metal cation is preferably a divalent or trivalent cation, more preferably divalent. Preferably, the metal cation is selected from alkaline earth metals (2A group), transition metals and lanthanides, more preferably from Cu2+, Fe2+, Zn2+, Mg2+, Ca2+, Ru3+, Tb3+and Eu3+, even more preferably it is selected from Zn2+or Tb3+.", "", "The elastomeric composition according to the invention may furthermore comprise possible other salts which are not however capable of forming complexes with the multidentate organic C ligand of the reversible cross-linking agent of formula (I), such as for example zinc stearate and zinc octoate.", "", "The anion of the salt of the metal cation according to the invention is preferably a non-coordinating or weakly coordinating anion (WCA).", "", "By the term weakly coordinating anion, now commonly used in general chemistry, it is meant to indicate those anions that interact weakly with cations, typically having the charge delocalised on the whole surface of the anion rather than localised on a specific atom. The properties characterising a weakly coordinating anion are reported for example in Chem. Rev. (1993), 93 (3), 927-942, in particular on page 929, par. II, subpar. C.", "", "Preferably, the anion of the salt of the metal cation is an anion which tends to complex the metal cation more weakly than the C ligand of the present reversible cross-linking agent of formula (I). In the present experimental part (Example 2, Table 1) a possible method is illustrated, useful to guide the skilled in the art in the selection of suitable anions, based on complexation studies.", "", "Some examples of weakly coordinating anions are described in Chem. Rev. (1993), 93 (3), 927-942; Angew. Chem. Int. Edit. (2004), 43 (16), 2066-2090; Angew. Chem. Int. Edit. (2018), 57 (43), 13982-14024; Chem. Soc. Rev. (2016), 45, 789-899.", "", "Examples of suitable anions are tosylate, triflate, bistriflimide and borates, including perfluorinated ones.", "", "Preferably, the anion is triflate.", "", "Preferably, the salt of the metal cation comprises the metal cation Zn2+or Th3+and a weakly coordinating anion selected from tosylate, bistriflimide, triflate, more preferably the salt of the metal cation is zinc triflate.", "", "Preferably, the salt of the metal cation is rather soluble in the elastomeric polymer of the present composition.", "", "The elastomeric composition for tyres according to the present invention may comprise at least 0.5 phr of at least one reinforcing filler.", "", "The present composition may comprise from 1 phr to 150 phr, from 5 phr to 120 phr or from 10 phr to 90 phr of at least one reinforcing filler.", "", "Preferably, the reinforcing filler is selected from carbon black, white fillers, silicate fibres, derivatives thereof and mixtures thereof.", "", "In an embodiment, said reinforcingfiller is a white filler selected from among hydroxides, oxides and hydrated oxides, salts and hydrated salts of metals, silicates fibres, derivatives thereof and mixtures thereof. Preferably, said white filler is silica. Preferably, said silica may be present in the elastomeric composition in an amount ranging between 1 phr and 100 phr, more preferably between 30 phr and 70 phr.", "", "Commercial examples of suitable silica are Zeosil 1165 MP, Zeosil 1115 MP, Zeosil 185 GR, Efficium from Solvay, Newsil HD90 and Newsil HD200 from Wuxi, K160 and K195 from Wilmar, H160AT and H180 AT from IQE, Zeopol 8755 and 8745 from Huber, Perkasil TF100 from Grace, Hi-Sil EZ 120 G, EZ 160G, EZ 200G from PPG, Ultrasil 7000 GR and Ultrasil 9100 GR from Evonik.", "", "In one embodiment, said reinforcing filler comprises silica mixed with carbon black.", "", "In one embodiment, said reinforcing filler comprises a modified silica.", "", "Silica can be modified for example by reaction with silsequioxanes (as in WO2018078480A1), by reaction with pyrroles (as in WO2016050887A1) or by reaction with silanising agents, such as bis(triethoxysilylpropyl)tetrasulphide (TESPT), 3-aminopropyltriethoxysilane (APTES) 3-glycidyloxypropyltriethoxysilane triethoxy(octyl)silane, triethoxy(ethyl)silane, triethoxy-3-(2-imidazolin-1-yl)propylsilane, triethoxy-p-tolylsilane, triethoxy(1-phenylethenyl)silane, triethoxy-2-thienylsilane, 1H,1H,2H,2H-perfluorooctyltriethoxysilane, 3-(triethoxysilyl)propyl isocyanate, 1H,1H,2H,2H-perfluorodecylthriethoxysilane, isobutyltriethoxysilane, n-octadecyltriethoxysilane, (3-chloropropyl)triethoxysilane, triethoxysilane and 3-(triethoxysilyl)propionitrile.", "", "Commercial examples of suitable silanising agents are Si69, Dynasilan AMEO and Dynasilan GLYEO from Evonik.", "", "The modified silica may be a sulphurised silanised silica.", "", "Sulphurised silanised silica is a silica prepared by reaction of a silica, such as fumed silica, precipitated amorphous silica, wet silica (hydrated silicic acid), anhydrous silica (anhydrous silicic acid), or mixtures thereof, or of a metal silicate, such as aluminium silicate, sodium silicate, potassium silicate, lithium silicate or mixtures thereof, with at least one sulphurised silanising agent.", "", "The term “sulphurised silanising agent” indicates an organic derivative of silicon containing mercapto, sulphide, disulphide or polysulphide groups, said derivative being capable of reacting with the OH groups of silica.", "", "A commercial example of suitable sulphurised silanised silica is Agilon 400 silica from PPG.", "", "In one embodiment, said reinforcing filler comprises a modified silica mixed with carbon black.", "", "In one embodiment, said reinforcing filler comprises silicates.", "", "In one embodiment, said silicates are lamellar silicates, such as bentonites, alloysite, laponite, saponite, vermiculite or hydrotalcite.", "", "In one embodiment, said silicates are modified lamellar silicates analogously to what is described below for modified silicate fibres.", "", "In one embodiment, said silicates are silicate fibres. These fibres typically have nano dimensions and have needle-like morphology.", "", "The silicate fibres are preferably selected from sepiolite fibres, paligorskite fibres (also known as attapulgite), wollastonite fibres, imogolite fibres and mixtures thereof.", "", "In one embodiment, said reinforcing filler comprises silicate fibres mixed with carbon black.", "", "In one embodiment, said silicate fibres are modified silicate fibres.", "", "In one embodiment, the modified silicate fibres can be for example fibres modified by acid treatment with partial removal of magnesium, such as those described and exemplified in patent application WO2016174629A1.", "", "In one embodiment, the modified silicate fibres can be for example fibres modified by deposition of amorphous silica on the surface, such as those described and exemplified in patent application WO2016174628A1.", "", "In one embodiment, the modified silicate fibres can be fibres organically modified by reaction, for example, with quaternary ammonium salts such as sepiolite fibres modified by reaction with talloyl benzyl dimethyl ammonium chloride marketed by Tolsa under the name Pangel B5.", "", "In one embodiment, the modified silicate fibres can be fibres modified by reaction with a silanising agent selected for example from mono or bifunctional silanes with one or two or three hydrolysable groups such as bis-(3-triethoxysilyl-propyl)disulphide (TESPD), bis(3-triethoxysilyl-propyl)tetrasulphide (TESPT), 3-thio-octanoyl-1-propyl-triethoxysilane (NXT), Me2Si(OEt)2, Me2PhSiCl, Ph2SiCl2.", "", "In one embodiment, said reinforcing filler is carbon black.", "", "Preferably, said carbon black is present in the elastomeric composition in an amount ranging between 1 phr and 100 phr, preferably between 5 phr and 70 phr. Preferably, the carbon black is selected from those having a surface area not smaller than 20 m2/g, preferably larger than 50 m2/g (as determined by STSA—statistical thickness surface area according to ISO 18852:2005).", "", "Carbon black may be for example N110, N115, N121, N134, N220, N234, N326, N330, N375 or N550, N660 marketed by Birla Group (India) or by Cabot Corporation, Vulcan@ 1391 supplied by Cabot Corporation or Birla Carbon™ 2115 supplied by Birla Group.", "", "The elastomeric composition for tyre compounds according to the invention may comprise from 0.1 to 10 phr of a vulcanising agent.", "", "Preferably, the composition comprises at least 0.2 phr, 0.5 phr, 0.8 phr or 1 phr of at least one vulcanising agent.", "", "Preferably, the composition comprises from 0.1 to 10 phr, from 0.2 to 10 phr, from 1 to 10 phr or from 1.5 to 5 phr of at least one vulcanising agent.", "", "The at least one vulcanising agent is preferably selected from sulphur, sulphurised agents (sulphur donors), such as, for example, bis[(trialkoxysilyl)propyl]polysulphides, caprolactam-disulphide or peroxides and mixtures thereof.", "", "Preferably, the vulcanising agent is sulphur, preferably selected from soluble sulphur (crystalline sulphur), insoluble sulphur (polymeric sulphur), (iii) oil-dispersed sulphur and mixtures thereof.", "", "Commercial example of a vulcanising agent suitable for use in the elastomeric composition of the invention is the Redball Superfine sulphur of International sulphur Inc.", "", "In the present elastomeric composition, the vulcanising agent may be used together with adjuvants such as vulcanisation activators, accelerants and/or retardants known to those skilled in the art.", "", "The elastomeric composition according to the invention may optionally comprise at least one vulcanisation activator.", "", "The vulcanisation activating agents suitable for use in the present elastomeric composition are zinc compounds, in particular ZnO, ZnCO3, zinc salts of saturated or unsaturated fatty acids containing from 8 to 18 carbon atoms, which are preferably formed in situ in the elastomeric composition by reaction of ZnO and of the fatty acid or mixtures thereof. For example, zinc stearate is used, preferably formed in situ in the elastomeric composition, by ZnO and fatty acid, or magnesium stearate, formed by MgO, or mixtures thereof.", "", "The vulcanisation activating agents may be present in the elastomeric composition of the invention in amounts preferably from 0.2 phr to 15 phr, more preferably from 1 phr to 5 phr.", "", "Preferred activating agents derive from the reaction of zinc oxide and stearic acid.", "", "An example of activator is the product Aktiplast ST marketed by Rheinchemie.", "", "The elastomeric composition according to the invention may further comprise at least one vulcanisation accelerant.", "", "Vulcanisation accelerants that are commonly used may be for example selected from dithiocarbamates, guanidines, thioureas, thiazoles, sulphenamides, sulphenimides, thiurams, amines, xanthates, or mixtures thereof.", "", "Preferably, the accelerant agent is selected from mercaptobenzothiazole (MBT), N-cyclohexyl-2-benzothiazol-sulphenamide (CBS), N-tert-butyl-2-benzothiazol-sulphenamide (TBBS) and mixtures thereof.", "", "Commercial examples of accelerants suitable for use in the present elastomeric composition are N-cyclohexyl-2-benzothiazyl-sulphenamide Vulkacit® (CBS or CZ), and N-terbutyl 2-benzothiazil sulphenamide, Vulkacit® NZ/EGC marketed by Lanxess.", "", "Vulcanisation accelerants may be used in the present elastomeric composition in an amount preferably from 0.05 phr to 10 phr, preferably from 0.1 phr to 7 phr, more preferably from 0.5 phr to 5 phr.", "", "The elastomeric composition according to the invention may optionally comprise at least one vulcanisation retardant agent.", "", "The vulcanisation retardant agent suitable for use in the present elastomeric composition is preferably selected from urea, phthalic anhydride, N-nitrosodiphenylamine N-cyclohexylthiophthalimide (CTP or PVI) and mixtures thereof.", "", "A commercial example of a suitable retardant agent is N-cyclohexylthiophthalimide VULKALENT G of Lanxess.", "", "The vulcanisation retardant agent may be present in the present elastomeric composition in an amount of preferably from 0.05 phr to 2 phr.", "", "The present elastomeric composition may comprise one or more vulcanisation retardant agents as defined above in a mixture.", "", "The elastomeric composition according to the invention may further comprise at least 0.05 phr, preferably at least 0.1 phr or 0.5 phr, more preferably at least 1 phr or 2 phr of at least one silane coupling agent.", "", "Preferably, the elastomeric composition according to the invention comprises from 0.1 phr to 20.0 phr or from 0.5 phr to 10.0 phr, even more preferably from 1.0 phr to 5.0 phr of at least one silane coupling agent.", "", "Preferably, said coupling agent is a silane coupling agent selected from those having at least one hydrolysable silane group which may be identified, for example, by the following general formula (III):", "", "(R′)3Si—CnH2n—X   (III)", "", "wherein the groups R′, equal or different from each other, are selected from: alkyl, alkoxy or aryloxy groups or from halogen atoms, provided that at least one of the groups R′is an alkoxy or an aryloxy group; n is an integer of from 1 to 6; X is a group selected from: nitrose, mercapto, amino, epoxide, vinyl, imide, chloro, —(S)mCnH2n—Si—(R′)3and —S—COR′, wherein m and n are integers of from 1 to 6 and the R′ groups are as defined above.", "", "Particularly preferred silane coupling agents are bis(3-triethoxysilylpropyl)tetrasulphide and bis(3-triethoxysilylpropyl)disulphide. Said coupling agents may be added as such or in mixture with an inert filler (such as carbon black) so as to facilitate their incorporation into the elastomeric composition.", "", "An example of the silane coupling agent is TESPT: bis(3-triethoxysilylpropyl)tetrasulphide Si69 marketed by Evonik.", "", "The elastomeric composition according to the invention may further comprise one or more additional ingredients, commonly used in the field, such as for example plasticising oils, resins, antioxidant and/or antiozonating agents (anti-aging agents), waxes, adhesives and the like.", "", "For example, the elastomeric composition according to the present invention, in order to further improve the workability of the compound, may further comprise at least one plasticising oil.", "", "The amount of plasticiser is preferably in the range from 5 to 25 phr, preferably from 8 to 20 phr.", "", "The term “plasticising oil” means a process oil derived from petroleum or a mineral oil or a vegetable oil or a synthetic oil or combinations thereof.", "", "The plasticising oil may be a process oil derived from petroleum selected from paraffins (saturated hydrocarbons), naphthenes, aromatic polycyclic and mixtures thereof.", "", "Examples of suitable process oils derived from petroleum are aromatic, paraffinic, naphthenic oils such as MES (Mild Extract Solvated), DAE (Distillate Aromatic Extract), TDAE (Treated Distillate Aromatic Extract), TRAE (Treated Residual Aromatic Extract), RAE (Residual Aromatic Extract) known in the industry.", "", "The plasticising oil may be an oil of natural or synthetic origin derived from the esterification of glycerol with fatty acids, comprising glycerine triglycerides, diglycerides, monoglycerides or mixtures thereof.", "", "Examples of suitable vegetable oils are sunflower, soybean, linseed, rapeseed, castor and cotton oil.", "", "The plasticising oil may be a synthetic oil selected from among the alkyl or aryl esters of phthalic acid or phosphoric acid.", "", "The elastomeric composition according to the present invention may further comprise at least one resin.", "", "The resin is a non-reactive resin, preferably selected from among hydrocarbon resins, phenolic resins, natural resins and mixtures thereof.", "", "The amount of resin is preferably in the range from 5 to 25 phr, more preferably from 7 to 20 phr.", "", "The elastomeric composition according to the invention may optionally comprise at least one wax.", "", "The wax may be for example a petroleum wax or a mixture of paraffins.", "", "Commercial examples of suitable waxes are the Repsol N-paraffin mixture and the Antilux® 654 microcrystalline wax from Rhein Chemie.", "", "The wax may be present in the elastomeric composition of the invention in an overall amount generally from 0.1 phr to 20 phr, preferably from 0.5 phr to 10 phr, more preferably from 1 phr to 5 phr.", "", "The elastomeric composition according to the invention may optionally comprise at least one antioxidant agent.", "", "The antioxidant agent is preferably selected from N-isopropyl-N′-phenyl-p-phenylenediamine (IPPD), N-(-1,3-dimethyl-butyl)-n′-phenyl-p-phenylenediamine (6PPD), N,N′-bis-(1,4-dimethyl-pentyl)-p-phenylenediamine (77PD), N,N′-bis-(1-ethyl-3-methyl-pentyl)-p-phenylenediamine (DOPD), N,N′-bis-(1,4-dimethyl-pentyl)-p-phenylenediamine, N,N′-diphenyl-p-phenylenediamine (DPPD), N,N′-ditolyl-p-phenylenediamine (DTPD), N,N′-di-beta-naphthyl-p-phenylenediamine (DNPD), N,N′-bis(1-methylheptyl)-p-phenylenediamine, N,N′-Di-sec-butyl-p-phenylenediamine (44PD), N-phenyl-N-cyclohexyl-p-phenylenediamine, N-phenyl-N′-1-methylheptyl-p-phenylenediamine and the like, and mixtures thereof, preferably it is N-1,3-dimethylbutyl-N-phenyl-p-phenylenediamine (6-PPD).", "", "A commercial example of a suitable antioxidant agent is 6PPD from Solutia or Santoflex produced by Eastman.", "", "The antioxidant agent may be present in the elastomeric composition in an overall amount preferably from 0.1 phr to 20 phr, more preferably from 0.5 phr to 10 phr.", "", "A further aspect of the present invention is a vulcanised elastomeric compound for tyres obtained by mixing and vulcanising the elastomeric composition according to the invention.", "", "The elastomeric compound of the invention is characterised by a particular hysteresis pattern.", "", "In fact, unlike conventional elastomeric compounds (for example reference compound 1,FIG.4a) where the hysteresis has a decreasing monotonic pattern as T increases, the compound of the invention instead has non-decreasing Tan delta values (for example compound 3,FIG.4c) or even increasing (for example compound 2,FIG.4b) as the T increases, i.e. once the temperature corresponding to normal driving has been exceeded and thus one has entered into the sports driving speed. The comparison between the Tan delta pattern of compounds 1-3 is shown in the summaryFIG.5.", "", "Furthermore, the elastomeric compound of the invention (2, 3) has improved static properties at break (see Table 3), maintaining modules and hardnesses close to those of the reference compound, thus showing that the reversible cross-linking agent of the invention does not distort the properties of the compound in which it is inserted, in particular it does not induce cold hardening of the compound, as instead occurs with the functionalised SBRs described in Macromolecules (2016), 49, 1781-1789.", "", "A further aspect of the present invention is a process for preparing the vulcanised elastomeric compound according to the invention, comprising a first non-productive step and a second productive step, preferably comprising:in the first non-productive step, mixing at least one diene elastomeric polymer, at least one reinforcing filler and at least one reversible cross-linking agent of formula (I) and possibly at least one antioxidant, a vulcanisation activating agent, a compatibilising agent, an antiozonant and/or a wax, preferably at a temperature between 110 and 190° C., to give a first elastomeric compound,in the second productive step, adding to the first elastomeric compound at least one vulcanising agent, at least one salt of the metal cation and possibly at least one accelerant agent, a retardant agent, a compatibilising agent, a vulcanisation activating agent and/or a peroxide, and mixing the components at a temperature preferably lower than 120° C., to give a vulcanisable elastomeric compound, andvulcanising the vulcanisable elastomeric compound, at a temperature preferably between 150° C. and 200° C., to give the vulcanised elastomeric compound.", "", "In one embodiment of the present process, the reversible cross-linking agent of formula (I) and the salt of the metal cation are both added in the first non-productive step.", "", "In an embodiment of the present process, the reversible cross-linking agent of formula (I) and the salt of the metal cation are both added in the second productive step.", "", "In a preferred embodiment of the present process, the reversible cross-linking agent of formula (I) is added in the first non-productive step while the metal cation salt in the second productive step.", "", "In an embodiment of the present process, the reversible cross-linking agent of formula (I) and the salt of the metal cation are made to pre-react, i.e. the complex between the reversible cross-linking agent of formula (I) and the metal cation is prepared first and, subsequently, the preformed complex is added and mixed in the second productive step.", "", "The process according to the invention typically comprises one or more thermomechanical mixing steps in at least one suitable mixer, in particular at least a first mixing step (step 1—non-productive) and a second mixing step (step 2—productive) as defined above.", "", "Each mixing step may comprise several intermediate processing steps or sub-steps, characterised by the momentary interruption of the mixing to allow the addition of one or more ingredients but without intermediate discharge of the compound.", "", "The mixing may be performed, for example, using an open mixer of the “open-mill” type or an internal mixer of the type with tangential rotors (Banbury®) or with interpenetrating rotors (Intermix), or in continuous mixers of the Ko-Kneader™ type (Buss®) or of the twin-screw or multi-screw type.", "", "Generally, but not necessarily, at the end of step 1 the first elastomeric compound is discharged and after a variable period of time it is recharged in the same or another suitable mixer, for the subsequent productive step 2.", "", "In productive step 2, the temperature is generally controlled to avoid undesired pre-vulcanisation phenomena.", "", "At the end of the second step, the vulcanisable elastomeric compound is incorporated into one or more components of the green tyre, preferably in the tread band, and subjected to vulcanisation, according to known techniques.", "", "Any of the usual vulcanisation processes may be used in the present process, such as heating in a press or mould, heating with superheated steam or hot air.", "", "The tyres may be built, formed, moulded and vulcanised with various methods known to the skilled in the art.", "", "A further aspect of the present invention is a tyre component for vehicle wheels comprising, or preferably consisting of, an elastomeric compound according to the invention, preferably selected from the tread band, under-layer, anti-abrasive strip, sidewall, sidewall insert, mini-sidewall, liner, under-liner, rubber layers, bead filler, bead reinforcing layers (flipper), bead protection layers (chafer), sheet. Preferably, the tyre component is a tread band, an anti-abrasive strip or a sidewall.", "", "The green tyre component is produced with the vulcanisable elastomeric compound and then vulcanised, preferably together with the other components, to give the vulcanised tyre component.", "", "A further aspect of the present invention is a tyre for vehicle wheels comprising at least one of the components according to the invention.", "", "Preferably, said component is a tread band.", "", "In one embodiment, a tyre for vehicles according to the present invention comprises at leasta carcass structure comprising at least a carcass ply having opposite lateral edges associated to respective bead structure;possibly a pair of sidewalls applied to the lateral surfaces of the carcass structure, respectively, in an axially outer position;possibly a belt structure applied in radially outer position with respect to the carcass structure;a tread band applied in a radially outer position to said carcass structure or, if present, a belt structure,possibly a layer of elastomeric material, referred to as under-layer, applied in a radially inner position with respect to said tread band,wherein at least one component, preferably the tread band, the anti-abrasive strip and/or the sidewalls, comprise, or preferably consist of, the elastomeric compound according to the invention.", "", "The tyre according to the invention may be for summer, winter use or for all seasons.", "", "In one embodiment, the tyre according to the invention is a tyre for a passenger car, with normal or high performance or for off-road vehicles, preferably a tyre for passengers, conceived for vehicles for personal use, such as sedans, coupes, crossovers, SUVs, minivans and small pickups.", "", "In one embodiment, the tyre according to the invention is a tyre for motorcycles, wherein at least one component comprises, or preferably consists of, the elastomeric compound according to the invention.", "", "The tyre according to the invention may be a tyre for two, three or four-wheeled vehicles.", "", "In one embodiment, the tyre according to the invention is a tyre for bicycle wheels.", "", "A tyre for bicycle wheels typically comprises a carcass structure turned around a pair of bead cores at the beads and a tread band arranged in a radially outer position with respect to the carcass structure. Preferably, at least the tread band comprises the elastomeric compound according to the invention.", "", "The tyre according to the present invention may be produced according to a process which comprises:building components of a green tyre on at least one forming drum;shaping, moulding and vulcanising the tyre;wherein building at least one of the components of a green tyre comprises:manufacturing at least one green component, preferably the tread band, comprising, or preferably consisting of, the vulcanisable elastomeric compound of the invention."], "claims": ["1 - 21 . (canceled)", "100 phr of at least one diene elastomeric polymer, at least 0.1 phr of at least one reversible cross-linking agent of formula (I): wherein A is at least one functional group capable of covalently binding to the elastomeric polymer, B, optionally present, is an at least divalent inert organic residue covalently bonded to A and C groups, C is at least one multidentate organic ligand capable of reversibly complexing at least one metal cation, at least 0.1 phr of at least one salt of the metal cation, at least 0.1 phr of at least one reinforcing filler, and at least 0.1 phr of the at least one vulcanising agent.", "23 . The composition according to claim 22 , wherein in the reversible cross-linking agent of formula (I), only one A group is present, only one C ligand is present, and the B residue is present and is divalent.", "24 . The composition according to claim 22 , wherein in the reversible cross-linking agent of formula (I), A is chosen from activated double bonds, sulphur groups, phenols, 1,3-dipole precursors, substituted pyrroles, and dienes capable of giving Diels-Alder reactions.", "25 . The composition according to claim 24 , wherein in the reversible cross-linking agent of formula (I), A is chosen from norbornyl, metacryl, vinylether and mercapto groups.", "26 . The composition according to claim 22 , wherein, in the reversible cross-linking agent of formula (I), B is present and is chosen from alkylene C 1 -C 20 , arylene C 6 -C 20 , alkylene-C 1 -C 10 -arylene-C 6 -C 10 , arylene-C 6 -C 10 -alkylene-C 1 -C 10 .", "27 . The composition according to claim 26 wherein B includes in the chain one or more heteroatoms or one or more functional groups chosen from —COO—, —OCO—, —CONH—, —NHCO—, —OCONH—, —NHCONH—, —CO—, —NH—C(NH)—NH—, —C(S)—S—, —S—C(S)—.", "28 . The composition according to claim 22 , wherein in the reversible cross-linking agent of formula (I), B is present and has a molecular weight of less than 4000 g/mol.", "29 . The composition according to claim 28 , wherein in the reversible cross-linking agent of formula (I), B has a molecular weight of less than 1000 g/mol.", "30 . The composition according to claim 22 , wherein, in the reversible cross-linking agent of formula (I), the multidentate organic C ligand comprises at least one mono- or polycyclic, 5- or 6-terms ring, saturated, unsaturated or aromatic, and optionally benzocondensate heterocycle, comprising at least one heteroatom chosen from N, P, S and O.", "31 . The composition according to claim 30 , wherein the multidentate organic C ligand comprises at least one substituted or unsubstituted, and optionally benzocondensate nitrogen heterocycle chosen from pyridine, bipyridine, terpyridine, pyrazine, pyrimidine, pyridazine, imidazole, pyrrole, pyrazole, indole, 1,10-phenanthroline, quinoline, isoquinoline, triazole, tetrazole, triazine, tetrazined.", "the reversible cross-linking agent of formula (I), A is chosen from activated double bonds, sulphur groups, phenols, 1,3-dipole precursors, substituted pyrroles, and dienes capable of giving Diels-Alder reactions, norbornyl, metacryl, vinylether and mercapto groups; B is present and is chosen from alkylene C the multidentate organic C ligand comprises at least one mono- or polycyclic, 5- or 6-terms ring, saturated, unsaturated or aromatic, and optionally benzocondensate, heterocycle, comprising at least one heteroatom chosen from N, P, S and O.", "33 . The composition according to claim 22 , wherein, in the reversible cross-linking agent of formula (I), A is SH or norbornyl, B is —O—(CH 2 ) 1-11 —, and C is 2,6-bis(1-methylbenzimidazol-2-yl)-pyridin-4-yl.", "34 . The composition according to claim 22 , wherein the metal cation is chosen from alkaline earth metals (2A group), transition metals, lanthanides Cu 2+ , Fe 2+ , Zn 2+ , Mg 2+ , Ca 2+ , Ru 3+ , Tb 3+ and Eu 3+ .", "35 . The composition according to claim 22 , wherein the salt comprises an anion and the anion is a weakly coordinating anion a tosylate, a bistriflimidate or a triflate.", "36 . The composition according to claim 22 , wherein the salt is zinc triflate.", "37 . The composition according to claim 22 , wherein the at least one reversible cross-linking agent of formula (I) is present in an amount ranging from 0.5 phr to 20 phr.", "38 . The composition according to claim 22 , wherein the at least one salt of the metal cation is present in an amount ranging from 0.2 phr to 7 phr.", "39 . The composition according to claim 22 , wherein the molar ratio of reversible cross-linking agent (I) to the salt of the metal cation ranges from 6:1 to 0.5:1", "40 . The composition according to claim 22 , wherein the at least one reinforcing filler is present in an amount ranging from 1 phr to 150 phr and is chosen from carbon black, white fillers, silicate fibres, derivatives thereof and mixtures thereof; and the at least one vulcanising agent is present in an amount from 0.1 phr to 10 phr and is chosen from sulphur, sulphur agents, peroxides, and mixtures thereof.", "41 . A vulcanised elastomeric tyre compound obtained by mixing and vulcanising the elastomeric composition according to claim 22 .", "in the first non-productive step, mixing at least one dienic elastomeric polymer, at least one reinforcing filler, and optionally, in whole or in part, at least one reversible cross-linking agent of formula (I) and at least one salt of the metal cation, wherein wherein the salt comprises an anion and the anion is a weakly coordinating anion a tosylate, a bistriflimidate or a triflate, to produce a first elastomeric compound, in the second productive step, adding to the first elastomeric compound at least one vulcanising agent and optionally, in whole or in part, the at least one reversible cross-linking agent of formula (I) and the at least one salt of the metal cation, and mixing the components, to produce a vulcanisable elastomeric compound, provided that the at least one reversible cross-linking agent of formula (I) and the at least one salt of the metal cation are added in at least one of the two steps, and vulcanising the vulcanisable elastomeric compound, to produce the vulcanised elastomeric compound.", "43 . The process according to claim 42 , wherein the reversible cross-linking agent of formula (I) is added in the first non-productive step while the metal cation salt in the second productive step.", "44 . A tyre component comprising the elastomeric compound according to claim 41 .", "45 . The tyre component according to claim 44 , wherein the tyre component is chosen from tread band, anti-abrasive strip, and sidewall.", "46 . A tyre for vehicle wheels comprising at least one tyre component according to claim 44 ."], "bibtex": "@patent{20240059100,\n    title = {COMPOSITIONS FOR ELASTOMERIC COMPOUNDS AND TYRES FOR VEHICLES COMPRISING REVERSIBLE CROSS-LINKING AGENT},\n    number = {20240059100},\n    year = {2024},\n    note = {File: US20240059100A1-20240222.XML}\n    }", "classification": "B60C100FI"}, {"title": "TIRE", "doc_number": "20240059101", "filename": "US20240059101A1-20240222.XML", "abstract": "In a tire, a tire outer diameter OD is in a range 200 mm≤OD≤660 mm. A total tire width SW is in a range 100 mm≤SW≤400 mm. A carcass layer is formed by layering two layers of carcass plies formed by covering organic fiber cords with coating rubbers. The organic fiber cords of the two layers of the carcass plies have cord angles in a range of 80 degrees or more and 100 degrees or less with respect to a tire circumferential direction. A tensile strength Tcs per a width of 50 mm of each of the two layers of the carcass plies ( 13 A, 13 B) is in a range 17 N/mm≤Tcs/OD≤120 N/mm with respect to the tire outer diameter OD.", "detailed_description": ["Embodiments of the technology will be described in detail below with reference to the drawings. Note that the technology is not limited to the embodiments. Additionally, constituents of the embodiments include constituents that are substitutable and are obviously substitutes while maintaining consistency with the embodiments of the technology. Additionally, a plurality of modified examples described in the embodiments can be combined in a discretionary manner within the scope apparent to one skilled in the art."], "claims": ["1 - 12 . (canceled)", "a pair of bead cores; a carcass layer extending between the bead cores; and a belt layer disposed on an outer side of the carcass layer in a radial direction, a tire outer diameter OD (mm) being in a range 200≤OD≤660, a total tire width SW (mm) being in a range 100≤SW≤400, the carcass layer being formed by layering two layers of carcass plies formed by covering organic fiber cords with coating rubbers, the organic fiber cords of the two layers of the carcass plies having cord angles in a range of 80 degrees or more and 100 degrees or less with respect to a tire circumferential direction, and a tensile strength Tcs (N/50 mm) per a width of 50 mm of each of the two layers of the carcass plies being in a range 17≤Tcs/OD≤120 with respect to the tire outer diameter OD (mm).", "a distance TL (mm) from a center of the organic fiber cord of the carcass ply on a radially inner side among the two layers of the carcass plies to a tire inner surface is in a range 0.001≤TL/OD≤0.009 with respect to the tire outer diameter OD (mm).", "a distance TCSU (mm) from a center of the organic fiber cord of the carcass ply on a radially inner side to an outer surface of the carcass ply on the radially inner side is in a range 0.09≤TCSU/TL≤1.00 with respect to a distance TL (mm) from the center of the organic fiber cord of the carcass ply on the radially inner side to a tire inner surface.", "an innerliner made of a rubber material, disposed on a tire inner surface, and covering the carcass layer, wherein the belt layer is formed by layering a plurality of belt plies formed by coating organic fiber cords with coating rubbers, and a modulus MC (MPa) at 100% elongation of the coating rubber of the carcass ply is in a range MIL≤MC≤MB with respect to a modulus MIL (MPa) at 100% elongation of the innerliner and a modulus MB (MPa) at 100% elongation of the coating rubber of the belt ply of an innermost layer of the belt layer.", "the modulus MC (MPa) of the coating rubber of the belt ply is in a range 1.00≤MC/MIL≤3.00 with respect to the modulus MIL (MPa) of the innerliner.", "the modulus MB (MPa) of the coating rubber of the belt ply on the innermost layer is in a range 1.10≤MB/MC≤2.40 with respect to the modulus MC (MPa) of the coating rubber of the carcass ply.", "the modulus MC (MPa) of the coating rubber of the carcass ply is in a range 4.5≤MC≤12.0.", "a product of a thicknesses TC (mm) of the carcass ply and a loss tangent tan δ at 60° C. of the coating rubber of the carcass ply is in a range 0.08≤TC× tan δ≤0.45.", "the belt layer is formed by layering a plurality of belt plies formed by coating organic fiber cords with coating rubbers, and a peel strength Hpp (N/25 mm) per a width of 25 mm between the carcass ply of an outermost layer of the carcass layer and the belt ply of an innermost layer of the belt layer is in a range 90≤Hpp/TCB≤300 with respect to a distance TCB (mm) from a center of an outer diameter of the carcass cord of the carcass ply to a center of an outer diameter of the belt cord of the belt ply.", "each of the two layers of the carcass plies comprises a body portion and a turned-up portion, the body portion extends along a tire inner surface, and the turned-up portion is turned up to an outer side in a tire width direction so as to wrap around the bead cores and extends in a tire radial direction, and a radial height Hcs (mm) from a measurement point of a rim diameter RD to an end portion of the turned-up portion is defined, and the radial height Hcs (mm) of the turned-up portion of at least the one carcass ply is in a range 0.49≤Hcs/SH≤0.80 with respect to a tire cross-sectional height SH (mm).", "the belt layer is formed by layering a pair of cross belts formed by coating steel cords with coating rubbers having cord angles having mutually different signs and 15 degrees or more and 55 degrees or less with respect to the tire circumferential direction, and a tensile strength Tbt (N/50 mm) per a width of 50 mm of each of the pair of cross belts is in a range 25≤Tbt/OD≤250 with respect to the tire outer diameter OD (mm).", "a pair of bead cores; and a carcass layer extending between the bead cores; and a tire outer diameter OD (mm) being in a range 200≤OD≤660, a total tire width SW (mm) being in a range 100≤SW≤400, the carcass layer being formed by layering two layers of carcass plies formed by covering organic fiber cords with coating rubbers, the organic fiber cords of the two layers of the carcass plies having cord angles having mutually different signs in a range of 45 degrees or more and 70 degrees or less with respect to a tire circumferential direction, and a tensile strength Tcs (N/50 mm) per a width of 50 mm of each of the two layers of the carcass plies being in a range 17≤Tcs/OD≤120 with respect to the tire outer diameter OD (mm)."], "bibtex": "@patent{20240059101,\n    title = {TIRE},\n    number = {20240059101},\n    year = {2024},\n    note = {File: US20240059101A1-20240222.XML}\n    }", "classification": "B60C900FI"}, {"title": "REINFORCED FABRIC COMPRISING A PLURALITY OF METAL REINFORCING ELEMENTS", "doc_number": "20240059102", "filename": "US20240059102A1-20240222.XML", "abstract": "A reinforced fabric comprises a plurality of metal reinforcing elements arranged in a transverse direction, substantially parallel to each other and extending in a main direction perpendicular to the transverse direction, embedded in an elastomer composition based on at least one elastomer, a reinforcing filler, and a crosslinking system, each metal reinforcing element having, in a plane perpendicular to the main direction, a cross-section inscribed in a rectangle of length W and a height T.", "detailed_description": [""], "claims": ["1 - 15 . (canceled)", "embedded in an elastomer composition based on at least one elastomer, a reinforcing filler, and a crosslinking system, each metal reinforcing element having, in a plane perpendicular to the main direction, a cross-section inscribed in a rectangle of length W and height T and having a breaking strength R the reinforced fabric having a breaking force expressed in N/mm equal to R wherein the laying pitch of the metal reinforcing elements is p≥0.8·R", "17 . The reinforced fabric as claimed in claim 16 , wherein 1/a ranges from 0.35 to 0.65.", "18 . The reinforced fabric as claimed in claim 16 , wherein the height T ranges from 0.15 mm to 0.70 mm.", "19 . The reinforced fabric as claimed in claim 16 , wherein the laying pitch p is such that p≤1.2·R F /R n ·(a−1+π/4)·T 2 .", "20 . The reinforced fabric as claimed in claim 16 , wherein each metal reinforcing element is at least high tensile grade having a breaking strength R F greater than or equal to 3,650-2,000·D, where D, expressed in mm, is equal to (T+W)/2.", "21 . The reinforced fabric as claimed in claim 16 , wherein each metal reinforcing element is at least super high tensile grade having a breaking strength R F greater than or equal to 4,000-2,000·D, where D, expressed in mm, is equal to (T+W)/2.", "22 . The reinforced fabric as claimed in claim 16 , wherein each metal reinforcing element is at least ultra high tensile grade having a breaking strength R F greater than or equal to 4,350-2,000·D, where D, expressed in mm, is equal to (T+W)/2.", "23 . The reinforced fabric as claimed in claim 16 , further comprising, on either side of the metal reinforcing elements, rubber thicknesses on a back of the metal reinforcing elements, denoted edos_1 and edos_2, measured in a radial direction perpendicular to the plane formed by the transverse and main directions, such that edos_1 and edos_2 range independently of each other from 0.10 to 0.40 mm.", "24 . The reinforced fabric as claimed in claim 16 , wherein each reinforcing element comprises a steel core covered with a metal coating layer made from a metal other than steel.", "25 . The reinforced fabric as claimed in claim 16 , wherein each reinforcing element has a torsional elastic deformation C, expressed as an absolute value, less than or equal to 6 turns per 6 m of metal reinforcer.", "26 . The reinforced fabric as claimed in claim 16 , wherein R n is greater than or equal to 220 N/mm.", "27 . The reinforced fabric as claimed in claim 16 , wherein the elastomer of the elastomer composition is a diene elastomer.", "28 . A pneumatic tire comprising a crown comprising a tread, two sidewalls, and two beads, each sidewall connecting each bead to the crown, a carcass reinforcement anchored in each of the beads and extending in the sidewalls and in the crown, a crown reinforcement extending in the crown in the circumferential direction and situated radially between the carcass reinforcement and the tread, the crown reinforcement comprising a working reinforcement comprising at least first and second working plies, wherein at least one working ply is the reinforced fabric as claimed in claim 16 .", "29 . The pneumatic tire as claimed in claim 28 , wherein each first and second working ply consists of the reinforced fabric.", "30 . The pneumatic tire as claimed in claim 28 , further comprising a hoop reinforcement comprising at least one hooping ply comprising textile reinforcing elements arranged substantially parallel to each other in the hooping ply."], "bibtex": "@patent{20240059102,\n    title = {REINFORCED FABRIC COMPRISING A PLURALITY OF METAL REINFORCING ELEMENTS},\n    number = {20240059102},\n    year = {2024},\n    note = {File: US20240059102A1-20240222.XML}\n    }", "classification": "B60C918FI"}, {"title": "Pneumatic Radial Tire for Passenger Vehicles", "doc_number": "20240059103", "filename": "US20240059103A1-20240222.XML", "abstract": "The pneumatic tire for passenger vehicles according to the present disclosure comprises a carcass consisting of plies of radially arranged cords, spanning toroidally between a pair of bead portions; the cross-sectional width SW and the outer diameter OD of the tire satisfy a given relationship; the land portion has a plurality of width direction sipes extending in the tire width direction; the pitch length in the tire circumferential direction of the plurality of width direction sipes is 3 mm to 10 mm; and the width direction sipe has a widened portion on the sipe bottom side where the sipe width is larger than that on the tread surface side.", "detailed_description": ["The following is a detailed illustrative description of one embodiment of the pneumatic radial tire for passenger vehicles of this disclosure, with reference to the drawings.", "", "FIG.1is a schematic diagram illustrating the cross-sectional width SW and outer diameter OD of the tire.", "", "In the one embodiment of a pneumatic radial tire for passenger vehicles, hereinafter referred to simply as “tire”, in the first aspect of the present disclosure, the cross-sectional width SW of the tire is less than 165 (mm), the ratio SW/OD of the cross-sectional width SW to the outer diameter OD of the tire is 0.26 or less, and accordingly the tire has a narrow-width and large-diameter shape. By making the cross-sectional width SW of the tire narrower relative to the outer diameter OD of the tire, air resistance can be reduced; by increasing the outer diameter OD of the tire relative to the cross-sectional width SW of the tire, the deformation of the tread rubber near the contact patch of the tire can be suppressed and rolling resistance can be reduced; and these can improve the fuel efficiency of the tire. The above ratio SW/OD is preferably 0.25 or less, and more preferably 0.24 or less.", "", "The above ratio is preferably satisfied when the internal pressure of the tire is 200 kPa or higher, more preferably when it is 220 kPa or higher, and even more preferably when it is 280 kPa or higher. This is because rolling resistance can be reduced. On the other hand, the above ratio is preferably satisfied when the internal pressure of the tire is 350 kPa or less. This is because ride comfort can be improved.", "", "From the viewpoint of securing the ground contact area, the cross-sectional width SW of the tire is preferably 105 mm or more, more preferably 125 mm or more, even more preferably 135 mm or more, and especially preferred 145 mm or more, within the range satisfying the above ratio. On the other hand, from the viewpoint of reducing air resistance, the cross-sectional width SW of the tire is preferably 155 mm or less, within the range satisfying the above ratio. From the viewpoint of reducing rolling resistance, the outer diameter OD of the tire is preferably 500 mm or more, more preferably 550 mm or more, and even more preferably 580 mm or more, within the range satisfying the above ratio. On the other hand, from the viewpoint of reducing air resistance, the outer diameter OD of the tire is preferably 800 mm or less, more preferably 720 mm or less, even more preferably 650 mm or less, and especially preferred 630 mm or less, within the range satisfying the above ratio. From the viewpoint of reducing rolling resistance, the rim diameter is preferably 16 inches or larger, more preferably 17 inches or larger, and even more preferably 18 inches or larger, when the cross-sectional width SW and the outer diameter OD of the tire satisfy the above ratio. On the other hand, from the viewpoint of reducing air resistance, the rim diameter is preferably 22 inches or less, more preferably 21 inches or less, even more preferably 20 inches or less, and especially preferred 19 inches or less, when the cross-sectional width SW and the outer diameter OD of the tire satisfy the above ratio. The aspect ratio of the tire is preferably 45 to 70, and more preferably 45 to 65, when the cross-sectional width SW and the outer diameter OD of the tire satisfy the above ratio.", "", "The specific tire sizes are not limited, but can be any of the following as an example: 105/50R16, 115/50R17, 125/55R20, 125/60R18, 125/65R19, 135/45R21, 135/55R20, 135/60R17, 135/60R18, 135/60R19, 135/65R19, 145/45R21, 145/55R20, 145/60R16, 145/60R17, 145/60R18, 145/60R19, 145/65R19, 155/45R18, 155/45R21, 155/55R18, 155/55R19, 155/55R21, 155/60R17, 155/65R18, 155/70R17, 155/70R19.", "", "In the one embodiment of the tire in the second aspect of the present disclosure, the cross-sectional width SW of the tire is 165 (mm) or more, the cross-sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the following relationship, and accordingly the tire has a narrow-width and large-diameter shape:", "", "OD (mm)≥2.135×SW (mm)+282.3", "", "Satisfying the above relationship reduces air resistance and rolling resistance, thereby improving fuel efficiency of the tire.", "", "In the second aspect, the ratio SW/OD of the cross-sectional width SW and the outer diameter OD of the tire is preferably 0.26 or less, more preferably 0.25 or less, and even more preferably 0.24 or less, after satisfying the above relationship. This is because it can further improve the fuel efficiency of the tire.", "", "The above relationship and/or ratio is preferably satisfied when the internal pressure of the tire is 200 kPa or higher, more preferably when it is 220 kPa or higher, and even more preferably when it is 280 kPa or higher. This is because rolling resistance can be reduced. On the other hand, the above relationship and/or ratio is preferably satisfied when the internal pressure of the tire is 350 kPa or less. This is because ride comfort can be improved.", "", "From the viewpoint of securing the ground contact area, the cross-sectional width SW of the tire is preferably 175 mm or more, and more preferably 185 mm or more, within the range satisfying the above relationship. On the other hand, from the viewpoint of reducing air resistance, the cross-sectional width SW of the tire is preferably 230 mm or less, more preferably 215 mm or less, even more preferably 205 mm or less, and especially preferred 195 mm or less, within the range satisfying the above relationship. From the viewpoint of reducing rolling resistance, the outer diameter OD of the tire is preferably 630 mm or more, and more preferably 650 mm or more, within the range satisfying the above relationship. On the other hand, from the viewpoint of reducing air resistance, the outer diameter OD of the tire is preferably 800 mm or less, more preferably 750 mm or less, and even more preferably 720 mm or less, within the range satisfying the above relationship. From the viewpoint of reducing rolling resistance, the rim diameter is preferably 18 inches or larger, and more preferably 19 inches or larger, when the cross-sectional width SW and the outer diameter OD of the tire satisfy the above relationship. On the other hand, from the viewpoint of reducing air resistance, the rim diameter is preferably 22 inches or less, and more preferably 21 inches or less, when the cross-sectional width SW and the outer diameter OD of the tire satisfy the above relationship. The aspect ratio of the tire is preferably 45 to 70, and more preferably 45 to 65, when the cross-sectional width SW and the outer diameter OD of the tire satisfy the above relationship.", "", "The specific tire sizes are not limited, but can be any of the following as an example: 165/45R22, 165/55R18, 165/55R19, 165/55R20, 165/55R21, 165/60R19, 165/65R19, 165/70R18, 175/45R23, 175/55R19, 175/55R20, 175/55R22, 175/60R18, 185/45R22, 185/50R20, 185/55R19, 185/55R20, 185/60R19, 185/60R20, 195/50R20, 195/55R20, 195/60R19, 205/50R21, 205/55R20, 215/50R21.", "", "In the one embodiment of the tire in the third aspect of the present disclosure, the cross-sectional width SW (mm) and the outer diameter OD (mm) of the tire satisfy the following relationship, and accordingly the tire has a narrow and large diameter shape:", "", "OD (mm)≥−0.0187×SW (mm)2+9.15×SW (mm)−380", "", "Satisfying the above relationship reduces air resistance and rolling resistance, thereby improving fuel efficiency of the tire.", "", "In the third aspect, the ratio SW/OD of the cross-sectional width SW and the outer diameter OD of the tire is preferably 0.26 or less, more preferably 0.25 or less, and even more preferably 0.24 or less, after satisfying the above relationship. This is because it can further improve the fuel efficiency of the tire.", "", "The above relationship and/or ratio is preferably satisfied when the internal pressure of the tire is 200 kPa or higher, more preferably when it is 220 kPa or higher, and even more preferably when it is 280 kPa or higher. This is because rolling resistance can be reduced. On the other hand, the above relationship and/or ratio is preferably satisfied when the internal pressure of the tire is 350 kPa or less. This is because ride comfort can be improved.", "", "From the viewpoint of securing the ground contact area, the cross-sectional width SW of the tire is preferably 105 mm or more, more preferably 125 mm or more, even more preferably 135 mm or more, and especially preferred 145 mm or more, within the range satisfying the above relationship. On the other hand, from the viewpoint of reducing air resistance, the cross-sectional width SW of the tire is preferably 230 mm or less, more preferably 215 mm or less, even more preferably 205 mm or less, and especially preferred 195 mm or less, within the range satisfying the above relationship. From the viewpoint of reducing rolling resistance, the outer diameter OD of the tire is preferably 500 mm or more, more preferably 550 mm or more, even more preferably 580 mm or more, within the range satisfying the above relationship. On the other hand, from the viewpoint of reducing air resistance, the outer diameter OD of the tire is preferably 800 mm or less, more preferably 750 mm or less, and even more preferably 720 mm or less, within the range satisfying the above relationship. From the viewpoint of reducing rolling resistance, the rim diameter is preferably 16 inches or larger, more preferably 17 inches or larger, and even more preferably 18 inches or larger, when the cross-sectional width SW and the outer diameter OD of the tire satisfy the above relationship. On the other hand, from the viewpoint of reducing air resistance, the rim diameter is preferably 22 inches or less, more preferably 21 inches or less, and even more preferably 20 inches or less, when the cross-sectional width SW and the outer diameter OD of the tire satisfy the above relationship. The aspect ratio of the tire is preferably 45 to 70, and more preferably 45 to 65, when the cross-sectional width SW and the outer diameter OD of the tire satisfy the above ratio.", "", "The specific tire sizes are not limited, but can be any of the following as an example: 105/50R16, 115/50R17, 125/55R20, 125/60R18, 125/65R19, 135/45R21, 135/55R20, 135/60R17, 135/60R18, 135/60R19, 135/65R19, 145/45R21, 145/55R20, 145/60R16, 145/60R17, 145/60R18, 145/60R19, 145/65R19, 155/45R18, 155/45R21, 155/55R18, 155/55R19, 155/55R21, 155/60R17, 155/65R18, 155/70R17, 155/70R19, 165/45R22, 165/55R18, 165/55R19, 165/55R20, 165/55R21, 165/60R19, 165/6R19, 165/70R18, 175/45R23, 175/55R18, 175/55R19, 175/55R20, 175/55R22, 175/60R18, 185/45R22, 185/50R20, 185/55R19, 185/55R20, 185/60R19, 185/60R20, 195/50R20, 195/55R20, 195/60R19, 205/50R21, 205/55R20, 215/50R21.", "", "FIG.2is a cross-sectional view in the tire width direction, illustrating a pneumatic radial tire for passenger vehicles according to one embodiment of the first to third aspects of this disclosure.FIG.2illustrates the cross section in the tire width direction of the tire when the tire is mounted on a rim, filled with prescribed internal pressure, and unloaded. As illustrated inFIG.2, the tire1comprises a carcass3consisting of plies of radially arranged cords, spanning toroidally between a pair of bead portions2. In addition, the tire1comprises, on the outer side of the carcass3in the tire radial direction, a belt4consisting of two belt layers4a,4bin the illustrated example and a tread portion5in this order.", "", "In this example, the pair of bead portions2each have a bead core2aembedded therein. In the present disclosure, the cross-sectional shape and material of the bead core2aare not limited and can be of the configuration normally used in the pneumatic radial tires for passenger vehicles. In the present disclosure, the bead core2amay be divided into a plurality of small bead cores. Alternatively, the tires herein can be configured without the bead core2a.", "", "The tire1in the illustrated example comprises a bead filler2bwith abbreviated triangular cross section on the outer side of the bead core2ain the tire radial direction. The cross-sectional shape of the bead filler2bis not limited to this example, nor is its material. Alternatively, the tire can be made lighter by not comprising bead filler2b.", "", "In this embodiment, the tire widthwise cross-sectional area S1 of the bead filler2bis preferably one or more and four or less times larger than the tire widthwise cross-sectional area S2 of the bead core2a. This is because; by making the above cross-sectional area S1 one time or more than the above cross-sectional area S2, the rigidity of the bead portion2can be secured, and by making the above cross-sectional area S1 four times or less than the above cross-sectional area S2, the tire can be made lighter and fuel efficiency can be further improved. In addition, in this embodiment, the ratio of the gauge Ts of the sidewall portion at the tire maximum width position to the bead width Tb at the center position in the tire radial direction of the bead core2a, Ts/Tb, is preferably 15% or more and 40% or less. Here, the “tire maximum width position” is the tire radial position where the width in the tire width direction is maximum, and if it is the radially extending area, it is the center position in the tire radial direction of that area. Also, the “bead width” is the width in the tire width direction of the bead portion2. This is because; setting the above ratio Ts/Tb to 15% or more ensures the rigidity of the sidewall portion, while setting the above ratio Ts/Tb to 40% or less makes the tire lighter and further improves fuel efficiency. Note, the gauge Ts is the sum of the thicknesses of all members, including rubber, reinforcement members, and inner liners. However, in a case that a sound control body is placed on the inner surface of the sidewall portion, its thickness is not included. Here, the term “sidewall portion” refers to the tire radial region on the outside of the ground contact edge E in the tire width direction, extending from the ground contact edge E to the outer edge in the tire radial direction of the bead portion. The “outer edge in the tire radial direction of the bead portion” is the outer edge in the tire radial direction of bead filler2bif the tire has a bead filler2b, or the outer edge in the tire radial direction of bead core2aif the tire does not have a bead filler2b. In the case of a structure in which the bead core2ais divided into multiple small bead cores by the carcass3, Tb is the distance between the innermost and outermost ends of all small bead cores in the tire width direction. In this embodiment, the ratio of the gauge Ts of the sidewall portion at the tire maximum width position to the diameter Tc of the carcass cords, Ts/Tc, is preferably 5 or more and 10 or less. This is because setting the above ratio Ts/Tc to 5 or more ensures the rigidity of the sidewall portion, while setting the ratio Ts/Tc to 10 or less makes the tire lighter and further improves fuel efficiency. In this embodiment, the tire maximum width position can be provided, for example, in the range of 50% to 90% of the tire cross-sectional height to the outer side in the tire radial direction from the bead base line. The “bead base line” is an imaginary line passing through the bead base and parallel to the tire width direction.", "", "Here, the term “bead portion” refers to the portion of the tire in the tire radial direction from the rim baseline to the outermost edge in the tire radial direction of the bead filler when the tire has bead filler, or to the portion in the tire radial direction from the rim baseline to the outermost edge in the tire radial direction of the bead core when the tire has no bead filler.", "", "In this embodiment, the tire1can also be configured with a rim guard. In this embodiment, the bead portion2can be further provided with additional members such as rubber layers or cord layers for reinforcement or other purposes. Such additional members can be provided in various positions relative to the carcass3and the bead filler2b.", "", "In the example illustrated inFIG.2, the carcass3consists of a single carcass ply. On the other hand, in the present disclosure, the number of carcass plies is not limited and can be two or more. Further, in the example illustrated inFIG.2, the carcass3has a carcass body portion3athat toroidally spans between a pair of bead portions2and a carcass turn-up portion3bthat is folded from the carcass body portion3aaround the bead core2a. On the other hand, in the present disclosure, the carcass turn-up portion3bcan be wrapped around the bead core2a, or it can be sandwiched between a number of divided small bead cores. In the illustration, the end3cof the carcass turn-up portion3bis located outer side in the tire radial direction than the outer edge in the tire radial direction of the bead filler2b, and inner side in the tire radial direction than the maximus width position of the tire. This allows the tire to be lightweight while maintaining the rigidity of the sidewall portion. On the other hand, in the present disclosure, the end3cof the carcass turn-up portion3bmay be located inner side in the tire radial direction than the outer edge in the tire radial direction of the bead filler2b, or it may be located outer side in the tire radial direction than the maximus width position of the tire. Alternatively, the end3cof the carcass turn-up portion3bcan be an envelope structure; with the end3clocated between the carcass body2aand the belt4in the tire radial direction and located inner side in the tire width direction than the end of the belt4, for example the end of the belt layer4b. Furthermore, when the carcass3consists of multiple carcass plies, the position of the edge3cof the carcass turn-up portion3b, e.g., in the tire radial direction, can be the same or different among the carcass plies. The number of cords in the carcass3is not particularly limited, however, can be in the range of 20 to 60 cords/50 mm, for example. In addition, various structures can be used for the carcass lines. For example, in the tire radial direction, the carcass maximum width position can be moved closer to the bead portion2side or the tread portion5side. For example, the carcass maximum width position can be provided in the range of 50% to 90% of the tire cross-sectional height, to the outer side in the tire radial direction from the bead base line. The above-mentioned “radially arranged” means a state of 85 degrees or more with respect to the tire circumferential direction, preferably 90 degrees with respect to the tire circumferential direction.", "", "The tire according to this embodiment preferably comprises one or more inclined belt layers consisting of a rubber-coated layer of cords extending at an angle with respect to the tire circumferential direction, and it is most preferable to have two layers of that for the balance between weight reduction and suppression of distortion of the contact patch shape. From the viewpoint of weight reduction, one belt layer can be used, and from the viewpoint of suppressing the distortion of the contact patch shape, three or more layers can be used. In the example illustrated inFIG.2, of the two belt layers4a,4b, the tire widthwise width of the belt layer4bon the outer side in the tire radial direction is smaller than the tire widthwise width of the belt layer4aon the inner side in the tire radial direction. On the other hand, the tire widthwise width of the belt layer4bon the outer side in the tire radial direction can be larger than or the same as the tire widthwise width of the belt layer4ain the tire radial direction. The tire widthwise width of the belt layer having the largest width in the tire width direction, in the illustrated example that of the belt layer4a, is preferably 90 to 115% of the ground contact width, and especially preferred 100 to 105% of the ground contact width. The term “ground contact width” refers to the distance in the tire widthwise direction between the above-mentioned ground contact edges E on the above-mentioned contact patch.", "", "In this embodiment, metal cords, especially steel cords, are most preferred as the belt cords for the belt layers4a,4b, but organic fiber cords can also be used. The steel cords are mainly composed of steel and can contain various trace inclusions such as carbon, manganese, silicon, phosphorus, sulfur, copper, and chromium. In this embodiment, the belt cords of the belt layers4a,4bcan be monofilament cords, cords with multiple filaments drawn together, or cords with multiple filaments twisted together. Various twist structures can be adopted, and the cross-sectional structure, twist pitch, twist direction, and distance between adjacent filaments can also be varied. Further, the cords made of twisted filaments of different materials can also be used, the cross-sectional structure is not limited, and the various twist structures such as single twist, layer twist, and multiple twist can be used.", "", "In this embodiment, the inclination angle of the belt cords of the belt layers4a,4bis preferably 10 degrees or more with respect to the tire circumferential direction. In this embodiment, the inclination angle of the belt cords of the belt layers4a,4bis preferably a high angle, specifically more than 20 degrees with respect to the tire circumferential direction, preferably more than 35 degrees, and especially in the range of 55 to 85 degrees with respect to the tire circumferential direction. This is because an inclination angle of 20 degrees or more, preferably 35 degrees or more, increases rigidity in the tire width direction and improves handling stability performance, especially during cornering. In addition, this is because it also reduces shear deformation of the interlayer rubber, thereby reducing rolling resistance.", "", "The tire according to this embodiment does not comprise the circumferential belt layer consisting of cords extending approximately along the tire circumferential direction on the outer side in the tire radial direction of the belt4. On the other hand, in this disclosure, the tire can also be configured with a circumferential belt consisting of one or more circumferential belt layers on the outer side in the tire radial direction of the belt4. In particular, it is preferable to provide a circumferential belt when the inclination angles θ1, θ2 of the belt cords of the belt layers4a,4bconstituting the belt4are 35 degrees or more. In this case, it is preferable to the circumferential belt that the tire circumferential rigidity per unit width is higher in the center region C than in the shoulder region S.", "", "In the cross-sectional view of the tire width direction when the tire is mounted on a rim, filled with prescribed internal pressure, and unloaded, the center region C is the tire widthwise direction area in the center 50% between the ground contact edges E and the shoulder regions S are the tire widthwise direction areas of 25% each on the outer side of the center region C.", "", "For example, by increasing the number of circumferential belt layers in the center region C compared to the shoulder regions S, the circumferential rigidity per unit width of the center region C can be higher than that of the shoulder regions S. Many tires with belt cords of belt layers4a,4binclined at 35 degrees or more with respect to the tire circumferential direction produce loud noise emission in the high-frequency range of 400 Hz to 2 kHz, because the tread surface will have a uniformly large vibration shape in first, second, and third etc., cross-sectional vibration modes. Therefore, by locally increasing the circumferential rigidity of the center region C of the tread portion5, the center region C of the tread portion5becomes more difficult to spread in the tire circumferential direction, and the spreading of the tread surface in the tire circumferential direction is suppressed, resulting in a reduction in noise emission.", "", "In this embodiment, it is also preferable that the inclination angle θ1 of the belt cords of the belt layer with the widest width in the tire width direction, the belt layer4ain the illustrated example, and the inclination angle θ2 of the belt cords of the belt layer with the narrowest width in the tire width direction, the belt layer4bin the illustrated example, with respect to the tire circumferential direction are 35°≤θ1≤85°, 10°≤θ2≤30°, and θ1>θ2. Many tires with belt cords of belt layers inclined at 35 degrees or more with respect to the circumferential direction produce loud noise emission in the high-frequency range of 400 Hz to 2 kHz, because the tread surface will have a uniformly large vibration shape, in first, second, and third etc., cross-sectional vibration modes. Therefore, by locally increasing the circumferential rigidity of the center region C of the tread portion5, the center region C of the tread portion5becomes more difficult to spread in the tire circumferential direction, and the spreading of the tread surface in the tire circumferential direction is suppressed, resulting in a reduction in noise emission.", "", "Here, in this embodiment, in case a circumferential belt is provided, the circumferential belt layer is preferably highly rigid, more specifically, it preferably consists of rubber-coated layer of cords extending in the tire circumferential direction, and 1500≥X≥225 is satisfied when defining X=Y×n×m×d with the Young's modulus of cords as Y (GPa), the number of implantation of cords as n (pcs/50 mm), the number of the circumferential belt layer as m (layers), and the cord diameter as d (mm). The young's modulus means Young's modulus relative to the tire circumferential direction and is determined in accordance with JIS L1017 8.8 (2002) by testing with JIS L1017 8.5 a) (2002). In the pneumatic radial tire for passenger vehicles with narrow-width and large-diameter, local deformation occurs in the tire circumferential direction in response to inputs from the road surface during turning, and the contact patch tends to be triangular in shape, i.e., the circumferential contact length varies greatly depending on the position in the tire width direction. In contrast, the use of a highly rigid circumferential belt layer improves the ring rigidity of the tire and suppresses the deformation in the tire circumferential direction, and for that reason, the non-compressibility of the rubber also suppresses deformation in the tire width direction, and the ground contact area is less likely to change. Furthermore, the increase in ring rigidity promotes eccentric deformation, which simultaneously increases rolling resistance. Furthermore, when using a high-rigidity circumferential belt layer as described above, the inclination angle of the belt cords of the belt layers4a,4bwith respect to the tire circumferential direction is preferably a high angle, specifically 35 degree or more. When the high-rigidity circumferential belt layer is used, the increased stiffness in the tire circumferential direction may result in reducing the ground contact length for some tires. Therefore, by using a high-angle belt layer, the out-plane flexural rigidity in the tire circumferential direction can be reduced to increase the circumferential elongation of the rubber during tread deformation, thereby reducing the reduction of the contact patch length. In this embodiment, the circumferential belt layer may also be made of wavy cords to increase breaking strength. Similarly, high elongation cords, e.g., 4.5 to 5.5% elongation at break, may be used to increase breaking strength. Furthermore, in this embodiment, a variety of materials can be employed for the circumferential belt layer and the typical examples include rayon, nylon, polyethylene naphthalate (PEN), polyethylene terephthalate (PET), aramid, glass fiber, carbon fiber, and steel. The organic fiber cords are particularly preferred in terms of weight reduction. Here, when a circumferential belt is provided, the cord of the circumferential belt layer can be a monofilament cord, a cord with multiple filaments drawn together, a cord with multiple filaments twisted together, or even a hybrid cord with filaments of different materials twisted together. In this embodiment, the number of cords in the circumferential belt layers can be in the range of 20 to 60 per 50 mm but is not limited to this range. Furthermore, in this embodiment, the stiffness, material, number of layers, and implantation density in the tire width direction can also be varied. For example, the number of the circumferential belt layers can be increased only in the shoulder area S, while the number of the circumferential belt layers can be increased only in the center region C. In this embodiment, the circumferential belt layer can be larger, smaller, or the same in the tire width direction than the belt layers4a,4b. For example, the tire widthwise width of the circumferential belt layer can be 90% to 110% of the widthwise width of the belt layer having the maximus widthwise width of the belt layers4a,4b, the belt layer4ain the example illustrated. Here, it is particularly advantageous from a manufacturing perspective to configure the circumferential belt layer as a spiral layer.", "", "In the illustrated example, the tread rubber forming the tread portion5consists of one layer. On the other hand, in this embodiment, the tread rubber forming the tread portion5may be consists by laminating a plurality of different rubber layers in the tire radial direction. For the plurality of rubber layers described above, rubber with different loss tangent (tan δ), modulus, hardness, glass transition temperature, material, etc. can be used. The ratio of the thicknesses of the multiple rubber layers in the tire radial direction may vary in the tire width direction, and only the bottom of the circumferential main groove, etc. may have a different rubber layer than the surrounding area. The tread rubber forming the tread portion5may be made up of multiple rubber layers that differ in the tire width direction. For the plurality of rubber layers described above, rubber with different loss tangent, modulus, hardness, glass transition temperature, material, etc. can be used. The ratio of the width in the tire width direction of the multiple rubber layers may vary in the tire radial direction, and only some limited areas, such as only near the circumferential main groove, only near the ground contact edge, only on the shoulder land portion, and only on the center land portion, may have a different rubber layer than the surrounding area.", "", "The rubber gauge of the tread rubber is preferably 5 mm or more and less than 8 mm. The rubber gauge in this embodiment is, as illustrated inFIG.2, the thickness of the tread rubber5from the outer surface of the tire to the outermost reinforcing member in the tire radial direction, the outermost belt layer4bof the two belt layers4a,4bin the illustrated example. By setting the rubber gauge to 8 mm or less, the tire can be made lighter and rolling resistance can be further reduced. On the other hand, by setting the rubber gauge to 5 mm or more, wet performance can be ensured even when wear has progressed to some extent.", "", "In this embodiment, in the cross-sectional view of the tire width direction, when a straight line passing through point P on the tread surface at the tire equatorial plane CL and parallel to the tire width direction is m1, a straight line passing through the ground contact edge E and parallel to the tire width direction is m2, the distance in the tire radial direction between the straight lines m1 and m2 is the fall height LCR, and the ground contact width of the tire is W, the ratio LCR/W is preferably 0.045 or less. By setting the ratio LCR/W to the above range, the crown portion of the tire is flattened, the ground contact area is increased, the input, i.e., input pressure, from the road surface is mitigated, the deflection rate in the tire radial direction is reduced, and thus the tire durability and wear resistance can be improved.", "", "The tire1according to this embodiment has an inner liner8on the inner surface7of the tire which is also referred to simply as the tire inner surface7. The thickness of the inner liner8is preferably about 1.5 mm to 2.8 mm. This is because it can effectively reduce vehicle-interior noise in the 80-100 Hz range. The air permeability coefficient of the rubber composition comprising the inner liner8is preferably 1.0×10−14cc-cm/(cm2-s-cmHg) or more and 6.5×10−10cc-cm/(cm2-s-cmHg) or less. It is preferable to have one or more fluorine-containing particles with a maximum diameter of 1.0 μm or greater per 100 μm2area of the tire inner surface. It is also preferable that a plurality of bladder ridges extending in the tire width direction are formed on the circumference of the tire inner surface. The bladder ridges are preferably formed at any location in the tire width direction on the tire inner surface, with at least five bladder ridges per inch in the circumferential direction of the tire.", "", "In this embodiment, the inner liner8can be formed by a rubber layer consisting mainly of butyl rubber, or by a film layer consisting mainly of resin. In this embodiment, the tire inner surface7can also be provided with a sealant material to prevent air leakage in the event of a puncture.", "", "FIG.3is a plan view of the tread surface of a tread portion of pneumatic radial tire for passenger vehicles.FIG.3is a plan view, schematically illustrating the tread surface of the tread portions of the pneumatic radial tires for passenger vehicles according to one embodiment of the first to third aspects of this disclosure. In this embodiment, the tread surface has one or more, two in the illustrated example, circumferential main grooves6extending in the tire circumferential direction. The number of circumferential main grooves6is preferably one to four. As illustrated inFIG.3, there are one or more, three in the illustrated example, land portions9(9a,9b) that are divided between the circumferential main grooves6or by the circumferential main grooves6and the tread edge TE. The number of land portions9is preferably 2 to 5, corresponding to the number of circumferential main grooves6described above. As in the illustrated example, each land portion can be a rib-like land portion that is not completely divided in the circumferential direction by the widthwise grooves extending in the tire width direction. According to this configuration, the rigidity of the land portion can be secured, and drainage can also be secured without having the widthwise grooves, since tires that satisfy the above equations for SW and OD can drain easily to the side. On the other hand, any one or more of the land portions may be a block-shaped land portion that is completely divided in the tire circumferential direction by the widthwise groove.", "", "For example, when the number of circumferential main grooves is two, and the tire widthwise region between the ground contact edges E is divided into two central regions C and two lateral regions S by dividing the tire widthwise region into four equal parts, the two circumferential main grooves6is preferably located in the central area C as illustrated in this example. This is because drainage can be better secured.", "", "Here, the term “extending in the tire circumferential direction” includes the case where extending without inclination to the tire circumferential direction as well as the case where extending at an inclination angle of 5 degrees or less with respect to the tire circumferential direction. As illustrate in the figure, the circumferential main groove6is preferably extends continuously in the tire circumferential direction. The shape of the circumferential main groove6is most preferable to be straight, as illustrated in the example, however it can also be zigzag, curved, etc.", "", "The width, the opening width, of the circumferential main groove6is preferably 9 mm to 16 mm. This is because the groove width of 9 mm or more improves drainage, while the groove width of 16 mm or less ensures greater rigidity of the land portion9. For the same reason, it is more preferable that the width of the circumferential main groove6is between 10 mm and 15.5 mm. The groove depth, the maximum depth, of the circumferential main groove6is preferably 1 to 5 mm. This is because a groove depth of 1 mm or more improves drainage, while a groove depth of 5 mm or less ensures the rigidity of the land portion9. For the same reason, it is more preferable that the depth of the circumferential main groove6is between 2 and 4 mm.", "", "The negative percentage of the tread surface of tread portion5is preferably 20% or less, more preferably 18% or less, and even more preferably 15% or less. On the other hand, from the viewpoint of ensuring drainage, the negative ratio of the tread surface of tread portion5is preferably at least 5%. Here, the term “negative ratio” shall mean the ratio of the groove area to the area of the tread surface. When calculating the groove area above, the groove area shall not include the area of sipes, whose opening width is 1 mm or less in the above standard condition.", "", "As illustrated inFIG.3, the land portion9has a plurality of width direction sipes10extending in the tire width direction. The term “extending in the tire width direction” includes the case where extending without inclination to the tire width direction as illustrated in the figure, as well as the case where inclined at an angle of 50 degrees or less with respect to the tire width direction. In the illustrated example, a plurality of width direction sipes10are equally spaced in the tire circumferential direction.", "", "The sipe width, the opening width, of the width direction sipe10is not limited as long as it is 1 mm or less, as described above, however can be 0.3 to 0.7 mm, for example. The sipe depth, the maximum depth, of the width direction sipe10can be about the same as the depth of the circumferential main groove6, although it is not limited. The pitch length in the tire circumferential direction of the plurality of width direction sipes10is preferably between 3 mm and 10 mm, more preferably between 5 mm and 10 mm. In order to reduce tire noise, the width direction sipes10can be arranged with a variation in pitch length, so-called pitch variation, in the tire circumferential direction.", "", "In the illustrated example, the width direction sipe10is connected to the circumferential main groove6at both ends in the extension direction. On the other hand, the width direction sipe10can be a so-called one-closed sipe, where only one end is connected to the circumferential main groove6and the other end remains within the land portion9, or it can be a sipe where both ends stay within the land portion9. The use of these types of sipes will minimize the reduction in stiffness of the land portion due to the formation of the sipes.", "", "In the illustrated example, the width direction sipes10are formed in all land portions9a,9b, however it is possible to have land portions9where no width direction sipes10are formed. In addition, in the illustrated example, the pitch length in the tire circumferential direction of the width direction sipes10formed on land portion9ais the same as that of the width direction sipes10formed on land portion9b, however it can be made longer or shorter.", "", "FIG.4is the cross-sectional view illustrating an example of the width direction sipe. As illustrated inFIG.4, in this example, the width direction sipe10consists of a plate-like portion10aand a widened portion10b, and has a widened portion10bon the sipe bottom side where the sipe width is larger than the tread surface side. The widened portion10beffectively reduces the compressive stiffness of the land portion during wear development. The sipe width, the opening width, of the plate-like portion10acan be 0.3 to 0.7 mm, for example, although it is not limited as long as it is 1 mm or less, as well as when the width direction sipe10is plate-like as a whole. The sipe width, the maximum width when measured in the same direction as the opening width, of the widened portion10bis preferably 2 to 30 times the opening width of the plate-like portion10a. By setting the value to 2 times or more, the compressive stiffness of the land portion can be further effectively reduced during wear development, while by setting the value to 30 times or less, the stiffness of the land portion during wear development can be prevented from decreasing to an extreme level. More preferably, the sipe width of the widened portion10bis 2 to 20 times the opening width of the plate-like portion10a. In addition, the length, that is the depth, of the widened portion10bin the tire radial direction can be 0.4 to 9 times the length, that is the depth, of the plate-like portion10ain the tire radial direction. By setting the value to 0.4 times or more, the compressive stiffness of the land portion can be effectively reduced as early as possible during wear development, while setting the value to 9 times or less, it is possible to prevent the land portion from losing its stiffness to an extreme degree. More preferably, the length, that is the depth, in the tire radial direction of the widened portion10bis preferably 0.5 to 7 times the length, that is the depth, in the tire radial direction of the plate-like portion10a. The cross-sectional shape of the widened portion10bis a horizontal oval in the illustrated example, but it can be a longitudinal oval, a circular shape, a triangular shape in which the sipe width spreads inward from the outside in the tire radial direction to the inside, or various other shapes. Although not specifically limited, the sipe width, the maximum width when measured in the same direction as the opening width, of the widened portion10bis preferably 1.5 to 3.5 mm when the widened portion10bis conical, that is triangular in cross-sectional shape, and is preferably 1.0 to 2.0 mm when it is spherical, that is circular or oval in cross-sectional shape. The ride comfort performance can be further improved by using plate-like sipes. On the other hand, instead of a flat plate-like portion10a, a sipe with a non-planar cross-sectional shape, such as a zigzag shape, can also be employed. Such a shape of sipe makes it easier to maintain the block rigidity of the entire land portion, which effectively reduces rolling resistance.", "", "The circumferential main groove6consists of a plate-like portion and a widened portion, with the widened portion on the groove bottom side where the groove width is larger than that on the tread surface side. The widened portion allows for better drainage during wear progression. The groove width, maximum width when measured in the same direction as the opening width, of the widened portion is preferably 1.1 to 1.5 times the opening width of the plate-like portion. The reason is that a value of 1.1 times or more improves drainage during wear development, while a value of 1.5 times or less ensures that the rigidity of the land portion is not reduced too much. In addition, the length, that is the depth, of the widened portion in the tire radial direction can be at least 0.4 times the length, that is the depth, of the plate-like portion in the tire radial direction. By setting the value to 0.4 times or more, drainage can be improved as early as possible during the wear progression. More preferably, the length, that is the depth, in the tire radial direction of the widened portion is preferably at least 0.5 times the length, that is the depth, in the tire radial direction of the plate-like portion. The upper limit is not limited because the plate-like portion may not be provided. The cross-sectional shape of the widened portion is a horizontal oval in the illustrated example, but it can be a longitudinal oval, a circular shape, a triangular shape in which the sipe width spreads inward from the outside in the tire radial direction to the inside, or various other shapes. Although not specifically limited, the groove width, the maximum width when measured in the same direction as the opening width, of the widened portion is preferably 11 to 12 mm when the widened portion is conical, that is triangular in cross-sectional shape, and is preferably 10 to 19 mm when it is spherical, that is circular or oval in cross-sectional shape.", "", "The cross-sectional shape of the circumferential main groove6can be an ordinary U-shaped or V-shaped. All circumferential main grooves6can be the ordinary U-shaped or V-shaped, or all circumferential main grooves6can be of a shape consisting of a plate-like portion and a widened portion, or they can be arranged in any combination.", "", "The following is a description of the effects of the pneumatic radial tire for passenger vehicles according to this embodiment.", "", "First, the pneumatic radial tire for passenger vehicles according to this embodiment, the cross-sectional width SW and the outer diameter OD of the tire satisfy the above predetermined relationship, thereby reducing air resistance and rolling resistance, and improving fuel efficiency. However, as mentioned above, such tires could have poor on-snow performance due to their high ring rigidity. To address this problem, the tire of this embodiment has a plurality of width direction sipes extending in the tire width direction in the land portion, and the width direction sipes have a widened portion on the sipe bottom side where the sipe width is larger than the tread surface side. This reduces the compressive stiffness of the land portion to prevent localized contact with the road surface, while also reducing drainage loss during wear development. And the pitch length in the tire circumferential direction of the plurality of width direction sipes is 3 mm to 10 mm. If the pitch length in the tire circumferential direction of the plurality of width direction sipes is less than 3 mm, the space for the widened portion to collapse cannot be sufficiently secured, while if the pitch length in the tire circumferential direction exceeds 10 mm, the above effect cannot be fully obtained. Here, a tire that satisfies the above prescribed relationship for SW and OD has high edge pressure due to high ground contact pressure, and even if the edge component in the tire width direction, that is the edge component relative to the tire circumferential direction, is reduced by setting the pitch length to 3 mm or more, it can still adequately ensure on-snow traction performance and on-snow cornering performance. In this way, high edge pressure and localized contact with the road surface can be suppressed, thereby suppressing the decrease in on-snow performance.", "", "As described above, the pneumatic radial tire for passenger vehicles of this embodiment can improve fuel efficiency while suppressing the decrease in on-snow performance.", "", "For the same reason, the pitch length in the tire circumferential direction of the plurality of width direction sipes is preferably 5 mm to 10 mm.", "", "To achieve the above effect more reliably, 50 to 100% of all width direction sipes by number are preferably width direction sipes with the widened portions described above. When the width direction sipes with the above widened portion are used in combination with other width direction sipes, e.g., which are plate-like as a whole, the width direction sipes with the above widened portion are preferably arranged so that they are uniformly distributed in the tire circumferential direction; such as being arranged every other or every two in the circumferential direction. In this example, all width direction sipes10consist of a plate-like portion10aand a widened portion10bas described above.", "", "In order to achieve the above effect, in any land portion, the width direction sipes with the above widened portions may account for 50 to 100% of all width direction sipes, and there may be a land portion where the number of width direction sipes with the above widened portions is less than 50% of the total, including zero sipes. As an example, at least one width direction sipe10, consisting of a plate-like portion10aand a widened portion10bas described above, can be located in the ground contact patch.", "", "Further, when the land portion9bdefined by the tread edge TE and the outermost circumferential main groove6in the tire width direction is the shoulder land portion, and the other land portion9ais the center land portion, forming the width direction sipe with the above widened portion in the center land portion can improve traction performance on snowy roads, and forming the width direction sipe with the above widened portion in the shoulder land portion can increase cornering power.", "", "Furthermore, the inner shoulder land portion when mounted on the vehicle contributes significantly to wear performance and the outer land portion when mounted on the vehicle contributes significantly to cornering performance. Therefore, it is possible to achieve a higher level of both wear resistance and cornering power by increasing the number density of the width direction sipes with the above widened portions on one side of the tire width direction, outside when mounted on the vehicle, than that of on the other side of the tire width direction, inside when mounted on the vehicle.", "", "When the land portion is divided into blocks by a plurality of width direction grooves extending in the tire width direction, the width direction sipe with widened portion is preferably located in the central region, which is the central 50%, not 25% of each side, of the circumferential length of the block, the circumferential length between both ends of the block in the tire circumferential direction. This is because the widened portion has sufficient space to collapse, further enhancing the effect of suppressing the decrease in on-snow performance.", "", "In addition, the width direction sipes with the widened portions described above may be provided as sipes closed on one side, and the width direction sipes connected to one circumferential main groove or tread edge and the width direction sipes connected to the other circumferential main groove or tread edge may be staggered alternately in the tire circumferential direction to increase the density of width direction sipes with widened portions described above. In this case, the pitch length shall be considered as the pitch length between width direction sipes that are connected to one circumferential main groove or tread edge and the pitch length between width direction sipes that are connected to the other circumferential main groove or tread edge.", "", "When the land portion is divided into blocks by a plurality of width direction grooves extending in the tire width direction, the width direction sipe with the widened portion is arranged more on one side of the block than the other side of the block in the tire circumferential direction. This is because when the one side of the block in the tire circumferential direction is the side where the block is stepped on when mounted on a vehicle, the widened portion on the side where the block is stepped on is more effective in collapsing than the side where the block is kicked off, thus more efficiently suppressing the decrease in on-snow performance.", "", "When the land portion is divided into blocks by a plurality of width direction grooves extending in the tire width direction, the sipe width at the widened portion of the width direction sipe located on one side of the tire circumferential direction of the block is also preferably larger than the sipe width of the widened portion of the width direction sipe located on the other side of the tire circumferential direction of the block. This is because when the one side of the block in the tire circumferential direction is the side where the block is stepped on when mounted on a vehicle, the widened portion on the side where the block is stepped on is more effective in collapsing than the side where the block is kicked off, thus more efficiently suppressing the decrease in on-snow performance."], "claims": ["the cross-sectional width SW of said tire is less than 165 (mm), and the ratio SW/OD of said cross-sectional width SW to the outer diameter OD of said tire is 0.26 or less, said tire has a tread portion, the tread surface of said tread portion has one or more land portions, said land portion has a plurality of width direction sipes extending in the tire width direction, the pitch length in the tire circumferential direction of said plurality of width direction sipes is 3 mm to 10 mm, and said width direction sipe has a widened portion on the sipe bottom side where the sipe width is larger than that on said tread surface side.", "the cross-sectional width SW of said tire is 165 (mm) or more, and said cross-sectional width SW (mm) and the outer diameter OD (mm) of said tire satisfy the following relationship: said tire has a tread portion, the tread surface of said tread portion has one or more land portions, said land portion has a plurality of width direction sipes extending in the tire width direction, the pitch length in the tire circumferential direction of said plurality of width direction sipes is 3 mm to 10 mm, and said width direction sipe has a widened portion on the sipe bottom side where the sipe width is larger than that on said tread surface side.", "the cross-sectional width SW (mm) and the outer diameter OD (mm) of said tire satisfy the following relationship: said tire has a tread portion, the tread surface of said tread portion has one or more land portions, said land portion has a plurality of width direction sipes extending in the tire width direction, the pitch length in the tire circumferential direction of said plurality of width direction sipes is 3 mm to 10 mm, and said width direction sipe has a widened portion on the sipe bottom side where the sipe width is larger than that on said tread surface side.", "said land portion is divided into blocks by a plurality of width direction grooves extending in the tire width direction, and said width direction sipe with said widened portion is located in the central region, which is the central 50% of the tire circumferential length of said block.", "said land portion is divided into blocks by a plurality of width direction grooves extending in the tire width direction, and said width direction sipe with said widened portion is arranged more on one side of said block than the other side of said block in the tire circumferential direction.", "said land portion is divided into blocks by a plurality of width direction grooves extending in the tire width direction, and the sipe width at said widened portion of said width direction sipe located on one side of said block in the tire circumferential direction is larger than the sipe width at said widened portion of said width direction sipe located on the other side of said block in the tire circumferential direction.", "7 . A pneumatic radial tire for passenger vehicles according to claim 5 , wherein said one side of said block in the tire circumferential direction is the step side of said block when mounted on the vehicle.", "said land portion is divided into blocks by a plurality of width direction grooves extending in the tire width direction, and said width direction sipe with said widened portion is located in the central region, which is the central 50% of the tire circumferential length of said block.", "said land portion is divided into blocks by a plurality of width direction grooves extending in the tire width direction, and said width direction sipe with said widened portion is located in the central region, which is the central 50% of the tire circumferential length of said block.", "said land portion is divided into blocks by a plurality of width direction grooves extending in the tire width direction, and said width direction sipe with said widened portion is arranged more on one side of said block than the other side of said block in the tire circumferential direction.", "said land portion is divided into blocks by a plurality of width direction grooves extending in the tire width direction, and said width direction sipe with said widened portion is arranged more on one side of said block than the other side of said block in the tire circumferential direction.", "said land portion is divided into blocks by a plurality of width direction grooves extending in the tire width direction, and said width direction sipe with said widened portion is arranged more on one side of said block than the other side of said block in the tire circumferential direction.", "said land portion is divided into blocks by a plurality of width direction grooves extending in the tire width direction, and the sipe width at said widened portion of said width direction sipe located on one side of said block in the tire circumferential direction is larger than the sipe width at said widened portion of said width direction sipe located on the other side of said block in the tire circumferential direction.", "said land portion is divided into blocks by a plurality of width direction grooves extending in the tire width direction, and the sipe width at said widened portion of said width direction sipe located on one side of said block in the tire circumferential direction is larger than the sipe width at said widened portion of said width direction sipe located on the other side of said block in the tire circumferential direction.", "said land portion is divided into blocks by a plurality of width direction grooves extending in the tire width direction, and the sipe width at said widened portion of said width direction sipe located on one side of said block in the tire circumferential direction is larger than the sipe width at said widened portion of said width direction sipe located on the other side of said block in the tire circumferential direction.", "said land portion is divided into blocks by a plurality of width direction grooves extending in the tire width direction, and the sipe width at said widened portion of said width direction sipe located on one side of said block in the tire circumferential direction is larger than the sipe width at said widened portion of said width direction sipe located on the other side of said block in the tire circumferential direction.", "17 . A pneumatic radial tire for passenger vehicles according to claim 6 , wherein said one side of said block in the tire circumferential direction is the step side of said block when mounted on the vehicle.", "said land portion is divided into blocks by a plurality of width direction grooves extending in the tire width direction, and the sipe width at said widened portion of said width direction sipe located on one side of said block in the tire circumferential direction is larger than the sipe width at said widened portion of said width direction sipe located on the other side of said block in the tire circumferential direction.", "said land portion is divided into blocks by a plurality of width direction grooves extending in the tire width direction, and the sipe width at said widened portion of said width direction sipe located on one side of said block in the tire circumferential direction is larger than the sipe width at said widened portion of said width direction sipe located on the other side of said block in the tire circumferential direction.", "20 . A pneumatic radial tire for passenger vehicles according to claim 8 , wherein said one side of said block in the tire circumferential direction is the step side of said block when mounted on the vehicle."], "bibtex": "@patent{20240059103,\n    title = {Pneumatic Radial Tire for Passenger Vehicles},\n    number = {20240059103},\n    year = {2024},\n    note = {File: US20240059103A1-20240222.XML}\n    }", "classification": "B60C1112FI"}, {"title": "METHOD OF MAKING A TIRE WITH MULTIPLE BODY PLIES", "doc_number": "20240059104", "filename": "US20240059104A1-20240222.XML", "abstract": "A method of making a tire includes providing a first body ply having a first width and laying a second body ply above the first body ply. The second body ply has a second width less than the first width. The method also includes laying a third body ply above the second body ply. The third body ply has a third width greater than the first width. The method further includes laying a first bead at a first location above the third body ply, laying a second bead at a second location above the third body ply, laying a first stabilizer ply insert at a third location above the third body ply, and laying a second stabilizer ply insert at a fourth location above the third body ply. The third location is between the first location and the second location, and the fourth location is between the third location and the second location.", "detailed_description": ["The following includes definitions of selected terms employed herein. The definitions include various examples and/or forms of components that fall within the scope of a term and that may be used for implementation. The examples are not intended to be limiting. Both singular and plural forms of terms may be within the definitions.", "", "“Axial” and “axially” refer to a direction that is parallel to the axis of rotation of a tire.", "", "“Circumferential” and “circumferentially” refer to a direction extending along the perimeter of the surface of the tread perpendicular to the axial direction.", "", "“Equatorial plane” refers to the plane that is perpendicular to the tire's axis of rotation and passes through the center of the tire's tread.", "", "“Radial” and “radially” refer to a direction perpendicular to the axis of rotation of a tire.", "", "“Tread” as used herein, refers to that portion of the tire that comes into contact with the road or ground under normal inflation and load.", "", "Directions are stated herein with reference to the axis of rotation of the tire. The terms “upward” and “upwardly” refer to a general direction towards the tread of the tire, whereas “downward” and “downwardly” refer to the general direction towards the axis of rotation of the tire. Thus, when relative directional terms such as “upper” and “lower” or “top” and “bottom” are used in connection with an element, the “upper” or “top” element is spaced closer to the tread than the “lower” or “bottom” element. Additionally, when relative directional terms such as “above” or “below” are used in connection with an element, an element that is “above” another element is closer to the tread than the other element.", "", "The terms “inward” and “inwardly” refer to a general direction towards the equatorial plane of the tire, whereas “outward” and “outwardly” refer to a general direction away from the equatorial plane of the tire and towards the sidewall of the tire. Thus, when relative directional terms such as “inner” and “outer” are used in connection with an element, the “inner” element is spaced closer to the equatorial plane of the tire than the “outer” element.", "", "While similar terms used in the following descriptions describe common tire components, it should be understood that because the terms carry slightly different connotations, one of ordinary skill in the art would not consider any one of the following terms to be purely interchangeable with another term used to describe a common tire component.", "", "FIG.1is a partial cross-section of one embodiment of a tire100.FIG.2is a detail view of a portion of the tire100. The tire100will thus be described with reference to bothFIG.1andFIG.2. While only one exemplary embodiment is illustrated, it should be understood that modifications may be employed without departing from the scope of the invention. Several such alternative embodiments are described below, but they are not intended to be limiting.", "", "The tire100includes a first annular bead portion105aand a second annular bead portion105b. The first annular bead portion105aincludes a first bead core110aand a first bead filler115a. A plurality of body plies extends between the first annular bead105aand the second annular bead105b. In the illustrated embodiment, the plurality of body plies includes a first body ply120, a second body ply130, a third body ply140and a fourth body ply150. In the present specification, the body plies are numbered in the order in which they would be layered on a TAM. This numbering of the body plies, however, is merely for convenience and the claims depart from this convention. It should be understood that the plies may be numbered in any order.", "", "In an alternative embodiment (not shown), three body plies are employed. In yet another alternative embodiment (not shown), five or more body plies may be employed.", "", "The first body ply120extends downward, axially inside of the first and second annular beads105a,band wraps around the first and second annular beads105a,b. A first turn up portion122aof the first body ply120extends upward, axially outside of the first annular bead105aand terminates at a first turn up end124a. A second turn up portion122bof the first body ply120extends upward, axially outside of the second annular bead105band terminates at a second turn up end124b. The first and second turn up ends124a,bof the first body ply120have a first radial height H1.", "", "The second body ply130extends downward, axially inside of the first and second annular beads105a,band axially outside of the first body ply120, and wraps around the first and second annular beads105a,b. A first turn up portion132aof the second body ply130extends upward, axially outside of the first annular bead and axially inside the first turn up portion122aof the first body ply120, and terminates at a first turn up end134a. A second turn up portion132bof the second body ply130extends upward, axially outside of the second annular bead105band axially inside the second turn up portion122bof the first body ply120, and terminates at a second turn up end134b. The first and second turn up ends134a,bof the second body ply130have a second radial height H2that is less than the first radial height H1.", "", "The third body ply140extends downward, axially inside of the first and second annular beads105a,band axially outside of the first body ply120and the second body ply130. The third body ply140wraps around the first and second annular beads105a,b. A first turn up portion142aof the third body ply140extends upward, axially outside of the first annular bead, axially inside the first turn up portion122aof the first body ply120, and axially inside the first turn up portion132aof the second body ply130. The first turn up portion142aof the third body ply140terminates at a first turn up end144a. A second turn up portion142bof the third body ply140extends upward, axially outside of the second annular bead105b, axially inside the second turn up portion122bof the first body ply120, and axially inside the second turn up portion132bof the second body ply130. The second turn up portion142bof the third body ply140terminates at a second turn up end144b. The first and second turn up ends144a,bof the third body ply140have a third radial height H3that is less than the first radial height H1, but greater than the second radial height H2.", "", "The fourth body ply150extends downward, axially inside of the first and second annular beads105a,band axially outside of the first body ply120, the second body ply130, and the third body ply140. The fourth body ply150wraps around the first and second annular beads105a,b. A first turn up portion152aof the fourth body ply150extends upward, axially outside of the first annular bead, axially inside the first turn up portion122aof the first body ply120, axially inside the first turn up portion132aof the second body ply130, and axially inside the first turn up portion142aof the third body ply140. The first turn up portion152aof the fourth body ply150terminates at a first turn up end154a. A second turn up portion152bof the fourth body ply150extends upward, axially outside of the second annular bead105b, axially inside the second turn up portion122bof the first body ply120, axially inside the second turn up portion132bof the second body ply130, and axially inside the second turn up portion142bof the third body ply140. The second turn up portion152bof the fourth body ply150terminates at a second turn up end154b. The first and second turn up ends154a,bof the fourth body ply150have a fourth radial height H4that is greater than the first radial height H1, the second radial height112, and the third radial height H3.", "", "In an alternative embodiment (not shown), the second height is greater than the third height, but still less than the first height and fourth height. In other alternative embodiments (not shown), having fewer than four body plies or greater than four body plies, the axially innermost turn up portion has the greatest height and the axially outermost turn up portion has the second greatest height. In such embodiments, the “sandwiched turn up portions” (i.e., any turn up portions located between the innermost turn up portion and outermost turn up portion) have heights that are less than those of the innermost turn up portion and outermost turn up portion. The sandwiched turn up portions may have progressively greater heights from the outermost turn up portion towards the innermost turn up portion. Alternatively, the sandwiched turn up portions may have progressively lesser heights from the outermost turn up portion towards the innermost turn up portion. In another alternative embodiment, the heights of the sandwiched turn up portions may vary in any manner.", "", "One or more circumferential belts160are disposed radially above the body plies120,130,140,150. In the illustrated embodiment, a pair of belts are employed. In alternative embodiments, any number of belts may be employed.", "", "The circumferential belt160extends axially across a portion of the body plies120,130,140,150. The tire may further include one or more cap plies165and an undertread (not shown).", "", "A circumferential tread170is disposed radially above the circumferential belt160and the cap ply165. The circumferential tread may include tread features (not shown), such as grooves, ribs, blocks, lugs, and sipes.", "", "The tire100further includes a first sidewall175aextending between the first annular bead105aand the circumferential tread170. A second sidewall175bextends between the second annular bead105band the circumferential tread170.", "", "The tire100also has first and second stabilizer ply inserts180a,b. The first stabilizer ply insert180ahas a first end that is axially inside a first end of the circumferential belt160and radially below the circumferential belt160. The first stabilizer ply insert180ahas a second end that is axially outside of the first end of the circumferential belt160and radially lower than the first turn up end124aof the first body ply120and radially lower than the first turn up end154aof the fourth body ply140. In an alternative embodiment (not shown), the second end of the first stabilizer ply insert is radially lower than the first turn up end of the fourth body ply, but radially higher than the first turn up end of the first body ply. In another alternative embodiment (not shown), the second end of the first stabilizer ply insert is radially lower than three or more of the turn up ends.", "", "In the illustrated embodiment, the first stabilizer ply insert180acontacts the first turn up portion152aof the fourth body ply150. In an alternative embodiment (not shown), the first stabilizer ply insert is spaced from the first turn up portion of the fourth body ply.", "", "The second stabilizer ply insert180bhas a first end that is axially inside a second end of the circumferential belt160and radially below the circumferential belt160. The second stabilizer ply insert180bhas a second end that is axially outside of the second end of the circumferential belt160and radially lower than the second turn up end124bof the first body ply120and radially lower than the second turn up end154bof the fourth body ply140. In an alternative embodiment (not shown), the second end of the second stabilizer ply insert is radially lower than the second turn up end of the fourth body ply, but radially higher than the second turn up end of the first body ply. In another alternative embodiment (not shown), the second end of the second stabilizer ply insert is radially lower than three or more of the turn up ends.", "", "In the illustrated embodiment, the second stabilizer ply insert180bcontacts the second turn up portion152bof the fourth body ply150. In an alternative embodiment (not shown), the second stabilizer ply insert is spaced from the second turn up portion of the fourth body ply.", "", "In one embodiment, the first sidewall175aand the second sidewall175bare constructed of the same rubber compound as the first stabilizer ply insert180aand the second stabilizer ply insert180b. In an alternative embodiment, the first sidewall175aand the second sidewall175bare constructed of a different rubber compound than the first stabilizer ply insert180aand the second stabilizer ply insert180b.", "", "To make a tire as shown inFIGS.1and2, an operator provides a first body ply having a first width, a second body ply having a second width less than the first width, a third body ply having a third width less than the first width but greater than the second width, and a fourth body ply having a fourth width greater than the first, second, and third widths. The operator lays the second body ply above the first body ply, lays the third body ply above the second body ply, and lays the fourth body ply above the third body ply. The operator then lays a first bead at a first location above the fourth body ply and lays a second bead at a second location above the fourth body ply.", "", "The operator also lays a first stabilizer ply insert at a third location above the fourth body ply, the third location being between the first location and the second location. The operator further lays a second stabilizer ply insert at a fourth location above the third body ply, the fourth location being between the third location and the second location. The operator then wraps the first body ply, second body ply, third body ply, and fourth body ply around the first bead, such that the first body ply has a first turn up portion with a first turn up height, the second body ply has a second turn up portion with a second turn up height less than the first turn up height, the third body ply has a third turn up portion with a third turn up height less than the first turn up height but greater than the second turn up height, and the fourth body ply has a fourth turn up portion with a fourth turn up height that is greater than the first, second, and third turn up heights.", "", "The operator then wraps the first body ply, second body ply, third body ply, and fourth body ply around the second bead in a similar manner. When the wrapping is complete, the turn up portions of the fourth body ply contact the first stabilizer ply insert and the second stabilizer ply insert. It should be understood that the method may be performed with two or three body plies. It should be further understood that the method may be performed with five or more body plies.", "", "The operator also lays a circumferential belt above the body plies, such that a first end of the circumferential belt contacts the first stabilizer ply insert and such that a second end of the circumferential belt contacts the second stabilizer ply insert. The operator further lays a circumferential tread above the circumferential belt. The operator also extends a first sidewall from a first bead region to the circumferential tread and extends a second sidewall from a second bead region to the circumferential tread.", "", "FIG.3is a detail view of a bead and sidewall portion of an alternative embodiment of a tire200. The tire200is substantially the same as the tire100described above with respect toFIGS.1and2, except for the differences discussed herein. The alternative embodiments described above with respect to tire100may also apply to tire200.", "", "In this embodiment, a first body ply220extends downward, axially inside of a first annular bead205aand a second annular bead (not shown), and wraps around the first annular bead205aand the second annular bead. A first turn up portion222aof the first body ply220extends upward, axially outside of the first annular bead205aand terminates at a first turn up end224a. A second turn up portion (not shown) of the first body ply220extends upward, axially outside of the second annular bead (not shown) and terminates at a second turn up end (not shown). The first turn up end224aand second turn up end of the first body ply220have a first radial height H1.", "", "A second body ply230extends downward, axially inside of the first annular bead205aand the second annular bead (not shown) and axially outside of the first body ply220, and wraps around the first annular bead205aand the second annular bead. A first turn up portion232aof the second body ply230extends upward, axially outside of the first annular bead205aand axially inside the first turn up portion222aof the first body ply220, and terminates at a first turn up end234a. A second turn up portion (not shown) of the second body ply230extends upward, axially outside of the second annular bead and axially inside the second turn up portion of the first body ply220, and terminates at a second turn up end (not shown). The first turn up end234aand the second turn up end of the second body ply230have a second radial height H2that is less than the first radial height H1.", "", "A third body ply240extends downward, axially inside of the first annular bead205aand the second annular bead, and axially outside of the first body ply220and the second body ply230. The third body ply240wraps around the first annular bead205aand the second annular bead. A first turn up portion242aof the third body ply240extends upward, axially outside of the first annular bead205a, axially inside the first turn up portion222aof the first body ply220, and axially inside the first turn up portion232aof the second body ply230. The first turn up portion242aof the third body ply240terminates at a first turn up end244a. A second turn up portion (not shown) of the third body ply240extends upward, axially outside of the second annular bead, axially inside the second turn up portion (not shown) of the first body ply220, and axially inside the second turn up portion (not shown) of the second body ply230. The second turn up portion of the third body ply240terminates at a second turn up end (not shown). The first turn up end244aand the second turn up end of the third body ply240have a third radial height H3that is less than the first radial height H1, but greater than the second radial height H2.", "", "A fourth body ply250extends downward, axially inside of the first and second annular beads and axially outside of the first body ply220, the second body ply230, and the third body ply240. The fourth body ply250wraps around the first and second annular beads. A first turn up portion252aof the fourth body ply250extends upward, axially outside of the first annular bead205a, axially inside the first turn up portion222aof the first body ply220, axially inside the first turn up portion232aof the second body ply230, and axially inside the first turn up portion242aof the third body ply240. The first turn up portion252aof the fourth body ply250terminates at a first turn up end254a. A second turn up portion (not shown) of the fourth body ply250extends upward, axially outside of the second annular bead, axially inside the second turn up portion (not shown) of the first body ply220, axially inside the second turn up portion (not shown) of the second body ply230, and axially inside the second turn up portion (not shown) of the third body ply240. The second turn up portion of the fourth body ply250terminates at a second turn up end (not shown). The first turn up end254aand the second turn up end (not shown) of the fourth body ply250have a fourth radial height H4that is greater than the second radial height H2and the third radial height H3, but less than the first radial height H1.", "", "The tire200also has a first stabilizer ply insert280aand a second stabilizer ply insert (not shown), similar to the stabilizer ply inserts180a,bof tire100. As can be seen inFIG.3, the first stabilizer ply insert180ahas a lower end that is radially lower than the first turn up end224aof the first body ply220and radially lower than the first turn up end254aof the fourth body ply240. In the illustrated embodiment, the first stabilizer ply insert280acontacts and the first turn up portion222aof the first body ply220the first turn up portion252aof the fourth body ply250.", "", "FIG.4is a partial cross-section of another alternative embodiment of a tire300. The tire300is substantially the same as the tires100,200described above with respect toFIGS.1-3, except for the differences discussed herein. The alternative embodiments described above with respect to tires100,200may also apply to tire300.", "", "The tire300includes a first annular bead portion305aand a second annular bead portion305b. The first annular bead portion305aincludes a first bead core310aand a first bead filler315a. A plurality of body plies extends between the first annular bead305aand the second annular bead305b. In the illustrated embodiment, the plurality of body plies includes a first body ply320, a second body ply330, a third body ply340and a turndown body ply350.", "", "The first body ply320extends downward, axially inside of the first and second annular beads305a,band wraps around the first and second annular beads305a,b. A first turn up portion of the first body ply320extends upward, axially outside of the first annular bead305aand terminates at a first turn up end324a. A second turn up portion of the first body ply320extends upward, axially outside of the second annular bead305band terminates at a second turn up end324b. The first and second turn up ends324a,bof the first body ply320have a first radial height. In the illustrated embodiment, the first and second turn up ends324a,bof the first body ply320are below the top of the first and second bead fillers315a,b.", "", "The second body ply330extends downward, axially inside of the first and second annular beads305a,band axially outside of the first body ply320, and wraps around the first and second annular beads305a,b. A first turn up portion of the second body ply330extends upward, axially outside of the first annular bead and axially inside the first turn up portion of the first body ply320, and terminates at a first turn up end334a. A second turn up portion of the second body ply330extends upward, axially outside of the second annular bead305band axially inside the second turn up portion of the first body ply320, and terminates at a second turn up end334b. The first and second turn up ends334a,bof the second body ply330have a second radial height that is greater than the first radial height. In an alternative embodiment, the second radial height is less than the first radial height. In the illustrated embodiment, the first and second turn up ends334a,bare below the top of the first and second bead fillers315a,b.", "", "The third body ply340extends downward, axially inside of the first and second annular beads305a,band axially outside of the first body ply320and the second body ply330. The third body ply340wraps around the first and second annular beads305a,b. A first turn up portion of the third body ply340extends upward, axially outside of the first annular bead, axially inside the first turn up portion of the first body ply320, and axially inside the first turn up portion of the second body ply330. The first turn up portion of the third body ply340terminates at a first turn up end344a. A second turn up portion of the third body ply340extends upward, axially outside of the second annular bead305b, axially inside the second turn up portion of the first body ply320, and axially inside the second turn up portion of the second body ply330. The second turn up portion of the third body ply340terminates at a second turn up end344b. The first and second turn up ends344a,bof the third body ply340have a third radial height that is greater than the first radial height and the second radial height.", "", "The turndown body ply350extends downward in the sidewalls, axially outside of the first and second annular beads305a,band axially outside of the first body ply320, the second body ply330, and the third body ply340. The turndown body ply350wraps around at least a portion of the first and second annular beads305a,b. In the illustrated embodiment, the turndown body ply350terminates below the first and second annular beads305a,b. In an alternative embodiment (not shown), the turndown body ply terminates axially inside the first and second annular beads. In another alternative embodiment (not shown), the turndown body ply wraps fully around the first and second annular beads and terminates radially above the first and second annular beads. In yet another alternative embodiment, the turndown body ply does not wrap around the first and second annular beads, and instead terminates axially outside the first and second annular beads.", "", "One or more circumferential belts360are disposed radially above the body plies320,330,340, and the turndown ply350. In the illustrated embodiment, a pair of belts are employed. In alternative embodiments, any number of belts may be employed.", "", "The circumferential belt360extends axially across a portion of the body plies320,330,340, and the turndown ply350. The tire300may further include one or more cap plies365and an undertread (not shown).", "", "A circumferential tread370is disposed radially above the circumferential belt360and the cap ply365. The circumferential tread may include tread features (not shown), such as grooves, ribs, blocks, lugs, and sipes.", "", "The tire300further includes a first sidewall375aextending between the first annular bead305aand the circumferential tread370. A second sidewall375bextends between the second annular bead305band the circumferential tread370. The tire300also has a first stabilizer ply insert380aand a second stabilizer ply insert380b, similar to the stabilizer ply inserts180a,bof tire100. As can be seen inFIG.4, the first and second stabilizer ply inserts180a,bhave lower ends that are radially lower than the turn up ends344a,bof the third body ply340. In the illustrated embodiment, the first stabilizer ply insert280acontacts and the turn up portions of the third body ply340. In the illustrated embodiment, the turndown ply350extends above the first and second stabilizer ply inserts380a,b. In an alternative embodiment (not shown), the turndown ply extends below the first and second stabilizer ply inserts. In another alternative embodiment (not shown), the stabilizer ply inserts may be omitted.", "", "FIG.5is a detail view of a bead and sidewall portion of yet another alternative embodiment of a tire400. The tire400is substantially the same as the tires100,200,300described above with respect toFIGS.1-4, except for the differences discussed herein. The alternative embodiments described above with respect to tires100,200,300may also apply to tire400.", "", "In this embodiment, a first body ply420extends downward, axially inside of a first annular bead405aand a second annular bead (not shown), and wraps around the first annular bead405aand the second annular bead. A first turn up portion422aof the first body ply420extends upward, axially outside of the first annular bead405aand terminates at a first turn up end424a. A second turn up portion (not shown) of the first body ply420extends upward, axially outside of the second annular bead (not shown) and terminates at a second turn up end (not shown). The first turn up end424aand second turn up end of the first body ply420have a first radial height H1.", "", "A second body ply430extends downward, axially inside of the first annular bead405aand the second annular bead (not shown) and axially outside of the first body ply420, and wraps around the first annular bead405aand the second annular bead. A first turn up portion432aof the second body ply430extends upward, axially outside of the first annular bead405aand axially inside the first turn up portion422aof the first body ply420, and terminates at a first turn up end434a. A second turn up portion (not shown) of the second body ply430extends upward, axially outside of the second annular bead and axially inside the second turn up portion of the first body ply420, and terminates at a second turn up end (not shown). The first turn up end434aand the second turn up end of the second body ply430have a second radial height H2that is less than the first radial height H1.", "", "A pair of turndown body plies440,450extend downward in the sidewalls475a, axially outside of the first second annular405aand the second annular bead (not shown) and axially outside of the first body ply420and the second body ply430. The turndown body plies440,450wrap around at least a portion of the first annular bead405aand the second annular bead. In the illustrated embodiment, the turndown body plies440,450terminate below the first and second annular beads. In an alternative embodiment (not shown), the turndown body plies terminate axially inside the first and second annular beads. In another alternative embodiment (not shown), the turndown body plies wrap fully around the first and second annular beads and terminate radially above the first and second annular beads. In yet another alternative embodiment, the turndown body plies do not wrap around the first and second annular beads, and instead terminate axially outside the first and second annular beads.", "", "One or more circumferential belts460are disposed radially above the body plies420,430, and the turndown plies440,450. In the illustrated embodiment, a pair of belts are employed. In alternative embodiments, any number of belts may be employed.", "", "The circumferential belt460extends axially across a portion of the body plies420,430, and the turndown plies440,450. The tire400may further include one or more cap plies465and an undertread (not shown).", "", "A circumferential tread470is disposed radially above the circumferential belt460and the cap ply465. The circumferential tread may include tread features (not shown), such as grooves, ribs, blocks, lugs, and sipes.", "", "The tire400further includes a first sidewall475aextending between the first annular bead405aand the circumferential tread470. A second sidewall (not shown) likewise extends between the second annular bead and the circumferential tread470. Unlike the prior illustrated embodiments, the tire400does not include a stabilizer ply insert. Instead, as can be seen inFIG.5, the first sidewall475ahas an upper end that extends radially inward, under the ends of the belts460and above the body plies420,430, and the turndown plies440,450. The second sidewall likewise has an upper end that extends radially inward, under the ends of the belts460and above the body plies420,430, and the turndown plies440,450.", "", "To the extent that the term “includes” or “including” is used in the specification or the claims, it is intended to be inclusive in a manner similar to the term “comprising” as that term is interpreted when employed as a transitional word in a claim. Furthermore, to the extent that the term “or” is employed (e.g., A or B) it is intended to mean “A or B or both.” When the applicants intend to indicate “only A or B but not both” then the term “only A or B but not both” will be employed. Thus, use of the term “or” herein is the inclusive, and not the exclusive use. See, Bryan A. Garner, A Dictionary of Modern Legal Usage624(2d. Ed. 1995). Also, to the extent that the terms “in” or “into” are used in the specification or the claims, it is intended to additionally mean “on” or “onto.” Furthermore, to the extent the term “connect” is used in the specification or claims, it is intended to mean not only “directly connected to,” but also “indirectly connected to” such as connected through another component or components.", "", "While the present disclosure has been illustrated by the description of embodiments thereof, and while the embodiments have been described in considerable detail, it is not the intention of the applicants to restrict or in any way limit the scope of the appended claims to such detail. Additional advantages and modifications will readily appear to those skilled in the art. Therefore, the disclosure, in its broader aspects, is not limited to the specific details, the representative system and method, and illustrative examples shown and described. Accordingly, departures may be made from such details without departing from the spirit or scope of the applicant's general inventive concept."], "claims": ["providing a first body ply having a first width; laying a second body ply above the first body ply, the second body ply having a second width less than the first width; laying a third body ply above the second body ply, the third body ply having a third width greater than the first width; laying a first bead at a first location above the third body ply; laying a second bead at a second location above the third body ply; laying a first stabilizer ply insert at a third location above the third body ply, the third location being between the first location and the second location; laying a second stabilizer ply insert at a fourth location above the third body ply, the fourth location being between the third location and the second location; wrapping the first body ply, the second body ply, and the third body ply around the first bead, such that the first body ply has a first turn up portion with a first turn up height, the second body ply has a second turn up portion with a second turn up height less than the first turn up height, and the third body ply has a third turn up portion with a third turn up height greater than the first turn up height, and such that the third turn up portion contacts the first stabilizer ply insert; and wrapping the first body ply, the second body ply, and the third body ply around the second bead, such that the first body ply has a fourth turn up portion with a fourth turn up height, the second body ply has a fifth turn up portion with a fifth turn up height less than the fourth turn up height, and the third body ply has a sixth turn up portion with a sixth turn up height greater than the fourth turn up height, and such that the sixth turn up portion contacts the second stabilizer ply insert.", "2 . The method of claim 1 , further comprising laying a circumferential belt above the third body ply.", "3 . The method of claim 2 , wherein the laying of the circumferential belt above the third body ply includes laying the circumferential belt above the third body ply such that a first end of the circumferential belt contacts the first stabilizer ply insert and such that a second end of the circumferential belt contacts the second stabilizer ply insert.", "4 . The method of claim 2 , further comprising laying a circumferential tread above the circumferential belt.", "5 . The method of claim 4 , further comprising extending a first sidewall from a first bead region to the circumferential tread and extending a second sidewall from a second bead region to the circumferential tread.", "6 . The method of claim 1 , wherein the first bead includes a first bead core and a first bead filler, and wherein the second bead includes a second bead core and a second bead filler.", "providing a first annular bead and a second annular bead; providing at least three body plies, including a first body ply, a second body ply, and a third body ply; extending each of the at least three body plies between the first annular bead and the second annular bead, including: extending the first body ply downward, axially inside of the first annular bead and wrapping the first body ply around the first annular bead, such that the first body ply has a first turn up portion that extends upward, axially outside of the first annular bead, and such that the first turn up portion terminates at a first turn up end, extending the second body ply downward, axially inside of the first annular bead and axially outside of the first body ply and wrapping the second body ply around the first annular bead, such that the second body ply has a second turn up portion that extends upward, axially outside of the first annular bead and axially inside the first turn up portion, and such that the second turn up portion terminates at a second turn up end that is radially lower than the first turn up end, and extending the third body ply downward, axially inside of the first annular bead and axially outside of the second body ply and wrapping the third body ply around the first annular bead, such that the third body ply has a third turn up portion that extends upward, axially outside of the first annular bead and axially inside the second turn up portion, and such that the third turn up portion terminates at a third turn up end that is radially higher than the first turn up end; placing a circumferential belt radially above the at least three body plies, such that the circumferential belt extends axially across a portion of the at least three body plies; placing a circumferential tread radially above the circumferential belt; placing a first stabilizer ply insert such that a first end of the first stabilizer ply insert is axially inside a first end of the circumferential belt and radially below the circumferential belt, and such that a second end of the first stabilizer ply insert is axially outside of the first end of the circumferential belt and radially lower than the third turn up end; placing a second stabilizer ply insert such that a first end of the second stabilizer ply insert is axially inside a second end of the circumferential belt and radially below the circumferential belt, and such that a second end of the second stabilizer ply insert is axially outside of the second end of the circumferential belt; extending a first sidewall between the first annular bead and the circumferential tread; and extending a second sidewall between the second annular bead and the circumferential tread.", "8 . The method of claim 7 , further comprising extending a fourth body ply between the first annular bead and the second annular bead.", "9 . The method of claim 8 , further comprising extending the fourth body ply downward, axially inside of the first annular bead and axially outside of the first body ply and wrapping the fourth body ply around the first annular bead, such that the fourth body ply has a fourth turn up portion that extends upward, axially outside of the first annular bead and axially inside the first turn up portion, and such that the fourth turn up portion terminates at a fourth turn up end that is radially lower than the first turn up end.", "10 . The method of claim 9 , wherein the fourth body ply extends downward axially outside of the second body ply and wherein the fourth turn up portion extends upward, axially inside the second turn up portion.", "11 . The method of claim 10 , wherein the fourth turn up end is radially higher than the second turn up end.", "12 . The method of claim 10 , wherein the fourth turn up end is radially lower than the second turn up end.", "13 . The method of claim 7 , wherein the first sidewall and the second sidewall are constructed of a first rubber compound, and wherein the first stabilizer ply insert and the second stabilizer ply insert are constructed of a second rubber compound.", "14 . The method of claim 13 , wherein the first rubber compound is different from the second rubber compound.", "15 . The method of claim 13 , wherein the first rubber compound is the same as the second rubber compound.", "providing a pair of beads; extending a plurality of body plies between the pair of beads, wherein the plurality of body plies includes at least a first body ply and a second body ply; wrapping the first body ply around each of the pair of beads, such that the first body ply has a first pair of turn up portions having a first height; wrapping the second body ply around each of the pair of beads, such that the second body ply has a second pair of turn up portions having a second height greater than the first height, and such that each of the second pair of turn up portions is axially inside each of the first turn up portions; placing a circumferential belt radially above the plurality of body plies; placing a circumferential tread radially above the circumferential belt; placing a first stabilizer ply insert such that a first end of the first stabilizer ply insert is radially below the circumferential belt, and a second end of the first stabilizer ply insert is radially lower than an end of one of the first pair of turn up portions; placing a second stabilizer ply insert such that a first end of the second stabilizer ply insert is radially below the circumferential belt, and a second end of the second stabilizer ply insert is radially lower than an end of one of the first pair of turn up portions; and extending a pair of sidewalls extending between the pair of beads and the circumferential tread.", "17 . The method of claim 16 , further comprising extending a third body ply between the first body ply and the second body ply.", "18 . The method of claim 17 , wherein the second end of the first stabilizer ply insert is radially above a first end of the third body ply, and wherein the second end of the second stabilizer ply insert is radially above a second end of the third body ply.", "19 . The method of claim 18 , further comprising extending a fourth body ply between the first body ply and the second body ply.", "20 . The method of claim 18 , further comprising providing a turndown ply."], "bibtex": "@patent{20240059104,\n    title = {METHOD OF MAKING A TIRE WITH MULTIPLE BODY PLIES},\n    number = {20240059104},\n    year = {2024},\n    note = {File: US20240059104A1-20240222.XML}\n    }", "classification": "B60C1500FI"}, {"title": "DISCRETE SOUND ABSORBERS FOR TIRE CAVITY NOISE REDUCTION", "doc_number": "20240059105", "filename": "US20240059105A1-20240222.XML", "abstract": "An array of discrete sound absorbers ( 20 a, 20 b ) is attached to an inner surface ( 122 ) of an annular tread portion ( 12 ) of a pneumatic tire ( 10 ) or an annular rim surface ( 34 ) of a wheel rim ( 30 ) to reduce tire cavity noise. Each sound absorber ( 20 a, 20 b ) includes a flexible sheet-like base material ( 54 ), a sheet-like screen material ( 52 ), and a sound absorbing material ( 56 ) disposed in a closed space formed by the sheet-like base material ( 54 ) and the sheet-like screen material ( 52 ).", "detailed_description": ["One typical solution for reducing tire cavity noise of a wheel is to adhere a layer of porous, sound-absorbing foam onto the inner surface of the tread portion of the tire. The foam layer continuously extends in the tire circumferential direction.FIG.1′ is an exploded partial view of a tire10′ including a continuous foam layer20′ attached to the inner surface of the tread portion12′ of the tire10′. The continuous foam layer20′ extends in the tire circumferential direction to form a substantially closed loop. This solution has been widely adopted by commercially available tires and wheels of vehicles. For example, a continuous polyurethane (PU) foam layer has been attached onto the inner tread of a vehicle tire to reduce tire cavity noise.", "", "The present disclosure found that the traditional solution such as shown inFIG.1′ may have several technical shortcomings. First, the acoustic performance of polyurethane (PU) foam is relatively low compared to other fibrous acoustic material. The normal incident sound absorbing coefficient of a 25 mm thick PU foam sample in the desired frequency range 100 Hz to 300 Hz is less than 0.1. Consequently, polyurethane (PU) foam may not be a desired material for tire cavity noise reduction, though it has been widely used due to its low material cost. In addition, the labor cost for adhering the continuous PU foam layer onto the tire is another concern from the tire manufactures. To achieve a better adhesive condition, commonly a pre-process of grinding away the mold release layer (with a thickness less than 0.5 mm) on the inner surface of tread is performed before the adhering process. Consequently, the larger the area of the continuous foam layer adhering to the tire, the higher the additional labor cost. For a typical automobile tire, for example, the area to be pre-processed can be around 0.3 to 0.6 m2. The adhesive area is also proportional to the material cost of adhesive. Furthermore, when a tire with the PU foam layer is punctured, the portion of the PU foam covering the punctured area needs to be removed before the repairing work. It may be difficult and expensive to remove the whole PU foam layer and replace it with a new one. In real practice, the PU foam layer attached to the tire usually has a thickness of 25 mm and a width ranging from 150 mm to 180 mm. A typical tire perimeter may be, for example, 2.372 m. Correspondingly, the volume of the PU foam layer is 8.9×10−3m3and the weight is 445 g, assuming the density of the PU foam is 50 kg/m3and the width is 150 mm. Such an additional weight may degrade the fuel efficiency of the tire.", "", "Some embodiments of articles and methods described herein are provided to reduce tire cavity noise while addressing the above issues for the traditional solution. The approach described herein provides a better acoustic performance in terms of a higher energy dissipation at tire cavity resonance and less additional weight effect, relative to the typical solution where a layer of porous, sound-absorbing foam is attached onto the inner surface of the tread portion of the tire.FIG.1Ais a schematic cross-sectional view of a pneumatic tire10with an array of discrete sound absorbers20a, according to one embodiment.FIG.1Bis a perspective side view of the tire10ofFIG.1A. The pneumatic tire10forms a substantially annular shape and includes a tread portion12, a pair of sidewall portions14, and a pair of axially spaced bead portions16. The sidewall portions14extends radially and inwardly from the edges of the tread portion12and the bead portions16are disposed at the inner edges of the sidewall portions14. The tread portion12has an outer surface121and an inner surface122opposite the outer surface121. When the pneumatic tire10is mounted on a wheel rim such as a wheel rim30ofFIG.3to be described further below, the open tire hollow is closed, and an annular closed tire cavity is formed. In some embodiments, the cavity-facing inner surface of the tire10may be covered with an inner liner rubber having a low air permeability.", "", "The pneumatic tire10may be, for example, a tubeless radial tire for a passenger vehicle. The pneumatic tire10may be made of a form used for passenger vehicles where quietness in the cabin is strongly desired, or may be a tire for a variety of uses such as for a truck, a motorcycle, an aircraft, a bicycle, a trailer, or the like. Additionally, the pneumatic tire10may be a bias tire.", "", "In the embodiment depicted inFIG.1A, an array of discrete sound absorbers20aare attached to the inner surface122of the tread portion12. The sound absorbers20aare distributed along the circumferential direction of the pneumatic tire10. The sound energy dissipates when the sound wave propagates through one sound absorber to the next one. Each sound absorber20ais attached to the inner surface122of the tread portion12via, for example, an adhesive or adhesive tape. The adhesive or adhesive tape can resist a high temperature, for example, no less than 80 degrees Celsius. Exemplary adhesive tapes include those commercially available from, for example, 3M Company (St. Paul, MN) under the trade designation 9988EG. In many applications, the bonding between the sound absorber20aand the inner surface122of the pneumatic tire can resist cyclic loads no less than 800,000 cycles under the standard of GB/T 4502-2016 (ISO 10191), which specifies the durability test where the lowest rolling speed is 80 km/h and the time duration is 34 hours.", "", "The sound absorbers20aare distributed discretely along the circumferential direction of the pneumatic tire10. The sound absorbers20aare considered to be discrete because the sound absorbing material of the adjacent sound absorbers are separated by a gap. The length dimension of the sound absorbers20aalong the circumferential direction of the tire10may be in the range, for example, from about 3 mm to about 2.5 m, from about 10 mm to about 1 m, or from about 15 mm to about 0.5 m. The length dimension of the sound absorbers20aalong the circumferential direction of the tire10may be in the range, for example, from about 0.1% to about 100%, from about 5% to about 99%, from about 10% to about 99%, or from about 20% to about 95% of the circumferential length of the inner surface122of the tire10.", "", "In some embodiments, the neighboring sound absorbers may be connected by a connection portion such as, for example, the connection portion21ofFIGS.2A-B(or70cofFIG.6AandFIG.6B), which will be described further below. In some embodiments, the adjacent sound absorbers may not be connected. For example, in the embodiment depicted inFIGS.2A-B, there is a gap22between the adjacent sound absorbers20aalong the circumferential direction of the tire10. The connection portion21or the gap22may have a length dimension along the circumferential direction in the range, for example, from about 1% to about 100% of the length of a sound absorber. The sound absorbers20amay be evenly distributed in the circumferential direction of the tire10. It is to be understood that while the adjacent sound absorbers can be connected by a connection portion, the sound absorbing material of the adjacent sound absorbers can be separated by a gap such that the sound absorbers can be considered as discrete.", "", "The sound absorbers20amay have a width along a direction substantially perpendicular to the circumferential direction of the tire10in the range, for example, from about 5 mm to about 250 mm. The width of the sound absorbers may be in the range, for example, from about 1% to about 150% of a tread width of the tread portion12. The tread width of the tread portion12of the pneumatic tire10is not particularly limited, but may be a width of from 60 mm to 315 mm. The term “tread width” means the width of the portion where the pneumatic tire10contacts the road surface in a cross-sectional view including the center axis of the pneumatic tire10. The tread width is not limited to the width of the tread portion12actually measured, and may be a width dimension given in terms of standard designation.", "", "FIG.2Adepicts a sound absorber assembly210, according to one embodiment. The sound absorber assembly210includes an array of sound absorbers20ato be attached to the inner surface122of the tread portion12ofFIG.1A. Adjacent sound absorbers20aare connected by the respective connection portions21to form a continuous tape, band, or strip. It is to be understood that while the adjacent sound absorbers20aare connected by the connection portion21, the connection portion21may contain substantially no sound absorbing material such that the sound absorbing material of the adjacent sound absorbers is discrete. When the sound absorber assembly210is mounted on the inner surface of a tire tread portion, a gap22is formed between the head and the tail of the sound absorber assembly210. In some cases, when the sound absorber assembly210is mounted on the inner surface of a tire tread portion, a connection portion21may connect the head and the tail of the sound absorber assembly210, forming a closed loop.", "", "FIG.2Bdepicts an array of sound absorbers20aarranged as multiple discrete sound absorber assemblies, which can be attached to the inner surface122of the tread portion12ofFIG.1A. Adjacent sound absorbers20aare connected by the respective connection portions21to form sound absorber assemblies210a,210b,210cor210d, which are separated by gaps22when mounted on the inner surface of a tire tread portion. It is to be understood that this layout is beneficial for replacing the damaged sound absorbers with a new one without replacing the whole array of discrete sound absorbers. It is to be understood that a sound absorber assembly can be formed by connecting any number of adjacent sound absorbers. It is also to be understood that the array of sound absorbers can include any number of sound absorber assemblies.", "", "FIG.3is a perspective side view of a wheel rim30including an array of discrete sound absorbers20b, according to one embodiment. The wheel rim30includes a pair of bead seats32on which tire bead portions such as the bead portions16ofFIG.1Aseat. The wheel rim30has a rim surface34. When a pneumatic tire is mounted on the wheel rim30, the open tire hollow is closed and an annular closed tire cavity is formed, where the rim surface34of the wheel rim30faces the annular closed tire cavity.", "", "In the embodiment depicted inFIG.3, the array of discrete sound absorbers20bare attached to the rim surface34. The sound absorbers20bare distributed along the circumferential direction of the wheel rim30. Each sound absorber is attached to the rim surface34via, for example, an adhesive or adhesive tape. The adhesive or adhesive tape can resist a high temperature, for example, no less than 80 degrees Celsius. Exemplary adhesive tapes include those commercially available from, for example, 3M Company (St. Paul, MN) under the trade designation 9988EG. In many applications, the bonding between the sound absorber20aand the rim surface34of the wheel rim30can resist cyclic loads no less than 800,000 cycles under the standard of GB/T 4502-2016 (ISO 10191), which specifies the durability test where the lowest rolling speed is 80 km/h and the time duration is 34 hours.", "", "The sound absorbers20bare distributed discretely along the circumferential direction of the wheel rim30. The sound absorbers20bare considered to be discrete because the sound absorbing material of the adjacent sound absorbers are separated by a gap. The energy of sound wave dissipates when the sound wave passes through from one sound absorber to the other. The length dimension of the sound absorbers20balong the circumferential direction of the wheel rim30may be in the range, for example, from about 3 mm to about 2.5 m, from about 10 mm to about 1 m, or from about 15 mm to about 0.5 m. The length dimension of the sound absorbers20balong the circumferential direction of the wheel rim30may be in the range, for example, from about 0.15% to about 100%, from about 5% to about 99%, from about 10% to about 99%, or from about 20% to about 95% of the circumferential length of the rim surface34.", "", "The adjacent sound absorbers20bcan be connected by a connection portion21or separated by a gap22. The connection portion21or the gap22may have a length dimension along the circumferential direction in the range, for example, from about 1% to about 100% of the length of the sound absorber. In some embodiments, the neighboring sound absorbers may be connected by a connection portion such as, for example, the connection portion70cofFIG.4, which will be described further below. The sound absorbers20bmay be evenly distributed in the circumferential direction of the wheel rim30. It is to be understood that while the adjacent sound absorbers can be connected by a connection portion, the sound absorbing material of the adjacent sound absorbers can be separated by a gap such that the sound absorbers can be considered as discrete.", "", "The sound absorbers20bmay have a width along a direction substantially perpendicular to the circumferential direction of the wheel rim30in the range, for example, from about 5 mm to about 200 mm. The width of the sound absorbers may be in the range, for example, from about 1.5% to about 100% of a rim width of the wheel rim30. The width of the wheel rim30is not particularly limited, but may be a width of from 127 mm to 317.5 mm. The term “rim width” means the axial distance between the pair of bead seats32.", "", "FIG.4Adepicts a sound absorber assembly410, according to one embodiment. The sound absorber assembly410includes an array of sound absorbers20bto be attached to the rim surface34of the rim30ofFIG.3. Adjacent sound absorbers20bare connected by the respective connection portions21to form a continuous tape. When the sound absorber assembly410is mounted on the rim surface34, a gap22is formed between the head and the tail of the sound absorber assembly410. In some cases, when the sound absorber assembly410is mounted on the rim surface34of the rim30, a connection portion21may connect the head and the tail of the sound absorber assembly410, forming a closed band. It is to be understood that this closed-loop configuration is beneficial for resisting the centrifugal force as the wheel is rolling. In some cases, the connection portions21in the closed-band configuration may be made of heat-shrinkable film. When the heat-shrinkable film is heated, e.g., in an oven or with a heat gun, the closed-band configuration can shrink its circumferential length so that the discrete sound absorbers20bcan be firmly bonded to the rim30.", "", "FIG.4Bdepicts an array of sound absorbers20barranged as multiple discrete sound absorber assemblies, which can be attached to the rim surface34of the rim30ofFIG.3. Adjacent sound absorbers20bare connected by the respective connection portions21to form sound absorber assemblies410a,410b,410cor410d, which are separated by gaps22when mounted on the rim. It is to be understood that this layout is beneficial for replacing the damaged sound absorbers with a new one without replacing the whole array of discrete sound absorbers. It is to be understood that a sound absorber assembly can be formed by connecting any number of adjacent sound absorbers. It is also to be understood that the array of sound absorbers can include any number of sound absorber assemblies.", "", "FIG.5is a schematic cross-sectional view of a sound absorber assembly510, according to one embodiment. The sound absorber assembly510includes multiple sound absorbers20a(e.g., seeFIG.1A) or sound absorbers20b(e.g., seeFIG.3). Each sound absorber20aor20bincludes a sheet-like screen material52and a sheet-like base material54, which are connected at the respective peripheries to form a closed space. A sound absorbing material56is disposed in the closed space formed by the base material54and the screen material52. An adhesive element58is provided to attach the sound absorber assembly510onto a surface. Adjacent sound absorbers20aor20bcan be connected by a connection portion21, which can include at least one of the sheet-like screen material52, the sheet-like base material54, or the adhesive element58extending into the gap region between the adjacent sound absorbers20aor20b. It is to be understood that the connection portion21can include other suitable materials to connect the adjacent sound absorbers20aor20b. The connection portion21may contain substantially no sound absorbing material56and the adjacent sound absorbing materials56are discrete.", "", "When the sound absorber assembly510is in use, the screen material52faces toward the air cavity when the sound absorbers are attached to a rim surface (e.g., the rim surface34of the rim30inFIG.3) or to a tire tread portion (e.g., the inner surface122of the tread portion12inFIG.1A). The screen material52can include one or more sheet-like materials such as, for example thermoplastic polyurethane (TPU) film. From mechanical perspective, it is to be understood that the screen material may protect the sound absorbing material when the sound absorber undergoes large deformation as the tire deforms or as the rim rotates. From acoustic perspective, it is to be understood that the screen material may change the low frequency absorption of the sound absorbing material56. The acoustic performance of the screen material is determined by its acoustic impedance Z, which is a complex function of its areal density and flow resistance. An analysis formulation describing this relationship is", "", "Z=112⁢π⁢i×ρarea+1Rf,", "", "where ρareais the areal density of the screen material and Rfis its flow resistance. The term “areal density” is defined as the mass per unit area. The term “flow resistance” indicates the air permeability of one material, which can be measured according to the test standard ASTM C522 or ISO 9053. For a suitable screen material, its areal density can be, for example, from about 0.5 g/m2to 10000 g/m2, or from about 1 g/m2to 1000 g/m2. Its flow resistance can be, for example, no less than 0.01 mks rayls, no less than 1 mks rayls, or no less than 1000 mks rayls.", "", "In some embodiments, an air impermeable screen material (e.g., a TPU film) can be used. The term “air impermeable” refers to an infinite large flow resistance Rfin the above formulation, indicating that the impermeable screen material introduces a pure reactance impedance. It is to be understood that the pure reactance impedance of an air impermeable screen material is beneficial for increasing the low frequency absorption of a sound absorber.", "", "In some embodiments, a porous screen material (e.g., an acoustic mesh fabric) may be used. A porous material has a relatively small value of flow resistance Rf, compared to an air impermeable material. A porous screen material may introduce an almost pure resistance impedance, i.e., Z≈Rf. Consequently, the existence of the porous screen material may not increase the low frequency absorption of a sound absorber, while it may increase the surface impedance of the sound absorber by Rf. The term “surface impedance” is defined as the acoustic impedance measured at the surface of the sound absorber.", "", "The base material54can include one or more flexible materials such as, for example, a polyurethane (PU) film. It is to be understood that the base material may include any suitable flexible material having the ability of desired deformation when attached to a curved surface (e.g., a rim surface or an inner surface of a tire tread portion). The base material54is stretchable or conformable such that when it receives a strain or stretch from a surface it is attached to, the base material54can deform correspondingly without affecting the mechanical integrity of the sound absorber. In some embodiments, the maximum elongation until failure of the base material can be, for example, no less than 105%, no less than 110%, or no less than 115%. When the sound absorber is disposed on the inner surface of a wheel tire, the base material may receive a periodical strain transferred from the tread portion, and may generate a heat as a result of repetition of ground contacting and ground non-contacting of the tread portion of the wheel tire. The base material can be water and oil proofing itself or have a water and oil proofing coating thereon.", "", "The sound absorbing material56is disposed in the closed space formed by the base material54and the screen material52. In some embodiments, the sound absorbing material is made from nonwoven fibers. It is to be understood that the sound absorbing material may include any suitable flexible material having sound attenuation as the sound wave passes through the porous microstructure of the sound absorbing material. The flow resistivity of sound absorbing material is one key material parameter for determining its sound attenuation performance. In some embodiments, the flow resistivity of sound absorbing material may be in the range, for example, from about 1000 mks rayls/m to about 50000 mks rayls/m, from about 2000 mks rayls/m to about 20000 mks rayls/m, from about 3000 mks rayls/m to about 10000 mks rayls/m, or from about 4000 mks rayls/m to about 6000 mks rayls/m. The term “flow resistivity” is defined as the ratio of the flow resistance to the thickness. The maximum temperature that sound absorbing material can resist may be in the range, for example, from about 80 degrees Celsius to about 180 degrees Celsius.", "", "In some embodiments, the sound absorbing material56and the impermeable screen material52may not be closely attached or bonded to each other such that an air gap exists due to the loose connection between the two materials. The air gap therebetween can further increase the low frequency absorption of the sound absorber.", "", "The thickness of the sound absorbing material56may be in the range, for example, from about 0.5 mm to about 200 mm, from about 1 mm to about 100 mm, or from about 5 mm to about 50 mm. The length dimension of the sound absorbing material56along the longitudinal direction of the base material may be in the range, for example, from about 3 mm to about 2 m. The width dimension of the sound absorbing material perpendicular to the longitudinal direction of the base material may be in the range, for example, from about 5 mm to about 250 mm.", "", "In some embodiments, vent holes can be provided on a screen material (e.g., the screen material52ofFIG.5), for balancing the air pressure between inside and outside of the sound absorber. In the embodiments depicted inFIGS.6A-B, the sound absorber assemblies710and720each include two sound absorbers or absorbing patches70aand70bconnected side by side via a connection portion70cor70c′. Each of the sound absorbing patches70aand70bmay have a configuration similar to the sound absorber20aor20bshown inFIG.5. As shown inFIG.6A, the connection portion70cconnects the two adjacent sound absorbing patches and may include the sheet-like screen material52and a sheet-like base material54of the sound absorber510. In another embodiment as depicted inFIG.6B, at least a portion of the connection portion70c′ may include the sheet-like base material54, but not the screen material52. From a mechanical perspective, with the connection portion70cor70c′, the sound absorber assembly710or720can be easily bended and can be easily accommodated to various rim surface34and various inner surface122of the tread portion12. From acoustic perspective, the connection portion70cor70c′ may introduce an acoustic impedance change between two adjacent sound absorbers when the sound wave propagates from one sound absorber to the other, providing more energy dissipation. The connection portion70cis also beneficial for repairability. When one sound absorber of the sound absorber assembly is damaged and is needed to be replaced by a new one, it is easy to cut the sound absorber to be replaced at the connection portion. The vent holes70d/70eare placed on the screen material52, for balancing the air pressure between inside and outside of the sound absorber. It is to be understood that the vent holes70d/70ecan be made of a porous material to achieve similar functions.", "", "Referring again toFIG.5, the adhesive element58is provided to attach the sound absorber assembly510onto a surface.FIGS.7A-Billustrate various configurations and arrangements of adhesive layer(s) or tape(s). InFIG.7A, a continuous layer of adhesive or adhesive element58ais attached to the base sheet-like material underneath adjacent sound absorbers20a/20b. The adhesive or adhesive element58aextends continuously across the connection portion21. The continuous layout of adhesive or adhesive tapes is beneficial for ease of manufacturing. InFIG.7B, discontinuous adhesive or adhesive tapes58bare attached to the base materials underneath the respective sound absorbers20a/20b. The adhesive layers or adhesive tapes58bare not connected at the connection portion21. It is to be understood that the discontinuous layout of adhesive or adhesive tapes is beneficial for repairability when one sound absorber is needed to be replaced.", "", "Unless otherwise indicated, all numbers expressing quantities or ingredients, measurement of properties and so forth used in the specification and embodiments are to be understood as being modified in all instances by the term “about.” Accordingly, unless indicated to the contrary, the numerical parameters set forth in the foregoing specification and attached listing of embodiments can vary depending upon the desired properties sought to be obtained by those skilled in the art utilizing the teachings of the present disclosure. At the very least, and not as an attempt to limit the application of the doctrine of equivalents to the scope of the claimed embodiments, each numerical parameter should at least be construed in light of the number of reported significant digits and by applying ordinary rounding techniques.", "", "Exemplary embodiments of the present disclosure may take on various modifications and alterations without departing from the spirit and scope of the present disclosure. Accordingly, it is to be understood that the embodiments of the present disclosure are not to be limited to the following described exemplary embodiments, but is to be controlled by the limitations set forth in the claims and any equivalents thereof."], "claims": ["a flexible sheet-like base material; a sheet-like screen material; and a sound absorbing material disposed in a closed space formed by the sheet-like base material and the sheet-like screen material, the sound absorbing material extending along a longitudinal direction of the sound absorber.", "2 . The sound absorber of claim 1 , wherein the flexible sheet-like base material has a stretchability along the longitudinal direction no less than about 105%, no less than about 110%, optionally, no less than about 115%.", "3 . The sound absorber of claim 1 , wherein the flexible sheet-like base material comprises at least one of rubber film, polyurethane (PU) film, thermoplastic polyurethane (TPU) film, polypropylene (PP) film, cast polypropylene (CPP) film, polyethylene terephthalate (PET), cast polyethylene terephthalate (CPET) film, or TPU/PU coated fabric.", "4 . The sound absorber of claim 1 , wherein the sheet-like screen material has a flow resistivity no less than 0.01 mks rayls, no less than 1 mks rayls, optionally, no less than 1000 mks rayls.", "5 . The sound absorber of claim 1 , wherein the sheet-like screen material comprises at least one of mesh fabric, nonwoven fabric, woven fabric, rubber film, polyurethane (PU) film, thermoplastic polyurethane (TPU) film, polypropylene (PP) film, cast polypropylene (CPP) film, polyethylene terephthalate (PET) film, cast polyethylene terephthalate (CPET) film, or TPU/PU coated fabric.", "6 . The sound absorber of claim 1 , wherein one or more vent holes are formed on the sheet-like screen material.", "7 . The sound absorber of claim 1 , wherein the sound absorbing material comprises at least one of polyurethane (PU) foam, glass fiber material, mineral fiber material, polyester fiber material, polypropylene fiber material, nonwoven fiber material embedded with sound absorbing particles, or a combination thereof.", "8 . The sound absorber of claim 1 , wherein the sound absorbing material has a flow resistivity in a range from about 1000 mks rayls/m to about 50000 mks rayls/m, optionally, from about 4000 mks rayls/m to about 6000 mks rayls/m.", "9 . The sound absorber of claim 1 , wherein the sound absorbing material has a thickness in a range from about 0.5 mm to about 200 mm, from about 2 mm to about 100 mm, optionally, from about 5 mm to about 50 mm.", "10 . The sound absorber of claim 1 , further comprising an adhesive layer disposed on the flexible sheet-like base material.", "11 . A sound absorber assembly comprising a plurality of the sound absorbers of claim 1 , wherein the sound absorbing material of the adjacent sound absorbers are separated by a gap.", "12 . The sound absorber assembly of claim 11 , wherein the plurality of the sound absorbers is connected by a connection portion.", "13 . The sound absorber assembly of claim 12 , wherein the connection portion comprises substantially no sound absorbing material.", "an annular tread portion extending in a circumferential direction thereof; and an array of discrete sound absorbers, at least one of the sound absorbers being the sound absorber of wherein the discrete sound absorbers each are attached to an inner surface of the annular tread portion, and the array of discrete sound absorbers are distributed along the circumferential direction of the tread portion.", "15 . The pneumatic tire of claim 14 , wherein the discrete sound absorbers each are attached to the inner surface of the annular tread portion via an adhesive layer.", "16 . (canceled)", "17 . The pneumatic tire of claim 13 , wherein the sound absorbing material of the adjacent sound absorbers are separated by a gap, the gap having a length along the circumferential direction of the tread portion in the range from 1% to 99% of a circumferential length of the inner surface of the tread portion.", "an annular rim surface extending in a circumferential direction thereof; and an array of discrete sound absorbers, at least one of the sound absorbers being the sound absorber of wherein the discrete sound absorbers each are attached to the annular rim surface, and the array of discrete sound absorbers are distributed along the circumferential direction of the annular rim surface.", "19 . The wheel rim of claim 18 , wherein the discrete sound absorbers each are attached to the inner surface of the annular rim surface via an adhesive layer.", "20 . (canceled)", "21 . The wheel rim of claim 18 , wherein the sound absorbing material of the adjacent sound absorbers are separated by a gap, the gap having a length along the circumferential direction of the annular rim surface in the range from 1% to 99% of a circumferential length of the annular rim surface.", "22 . (canceled)", "attaching an array of discrete sound absorbers to at least one of (i) an inner surface of an annular tread portion of a pneumatic tire, and (ii) an annular rim surface of a wheel rim, wherein the pneumatic tire is mounted to the wheel rim to form an enclosed tire cavity, and wherein at least one of the sound absorbers is the sound absorber of", "24 . (canceled)", "25 . (canceled)"], "bibtex": "@patent{20240059105,\n    title = {DISCRETE SOUND ABSORBERS FOR TIRE CAVITY NOISE REDUCTION},\n    number = {20240059105},\n    year = {2024},\n    note = {File: US20240059105A1-20240222.XML}\n    }", "classification": "B60C1900FI"}]