[{"title": "SAFETY BELT RETRACTOR PRE-WINDING AND BAFFLE INSTALLATION DEVICE", "doc_number": "20240293901", "filename": "US20240293901A1-20240905.XML", "abstract": "A safety belt retractor pre-winding and baffle installation device is provided, including a rotary table, which is provided with a loading station, a winding station, a stop slot positioning station, a baffle installation station, a NG discharging station, and a qualified product discharging station. The rotation shaft of the safety belt retractor is installed on the profiling fixture. After winding to the set number of turns through the winding mechanism, the position of the stop slot is found through the position detection mechanism, and finally the baffle is successfully installed by the multi-axis manipulator. The disclosure also uses the visual sensor to identify the type, control the number of turns of the servo motor in the pre-winding step, and check whether the torque fed back by the servo motor is within the set range, it can realize the processing of products with multiple specifications.", "detailed_description": ["The following will give a clear and complete description of the technical solution in the embodiments of the disclosure in combination with the drawings in the embodiments of the disclosure. It is apparent that the described embodiments are only part of the embodiments of the disclosure, not all of them. Based on the embodiments in the disclosure, all other embodiments obtained by ordinary skilled person in the art without creative work fall within the scope of the disclosure.", "", "As shown inFIGS.2-4, a safety belt retractor pre-winding and baffle installation device includes a rotary table3, which is provided with a loading station, a winding station, a stop slot positioning station, a baffle installation station, a NG discharging station, and a qualified product discharging station. A profiling fixture4is installed on each station. The profiling fixture4is positioned by means of a plane and two pins, and is pressed on the rotary table3by a fast pressing block. The profiling fixture4is provided with a variety of replaceable specifications. A ratchet seat5with adjustable rotation direction is installed under each profiling fixture4. The center of the ratchet seat5is provided with a ratchet shaft501, and the ratchet shaft501can only rotate in one direction, when turning in the other direction, it will be locked. The ratchet seat5is provided with an adjusting lever, when the adjusting lever is shifted, the rotation direction can be changed. The upper end of the ratchet shaft501passes through the profiling fixture4. The center of a rotation shaft102of the safety belt retractor1is provided with a spline groove. The upper end of the ratchet shaft501is provided with a guide structure, and the ratchet shaft501is inserted into the spline groove in the center of the rotation shaft102to form a transmission connection. The main work at the loading station is to load the material manually or mechanically. The safety belt retractor1is installed on the profiling fixture4, and a drive connection is formed between the ratchet shaft501and the rotation shaft102of the safety belt retractor1.", "", "As shown inFIG.5, a winding mechanism6is arranged under the winding station, which is installed on the equipment platform. The winding mechanism6is located under the ratchet seat5at the station, and the winding mechanism6includes a first lifting mechanism601and a first driving mechanism602with position feedback and torque feedback. In practical application, the first driving mechanism602is a servo motor, and the first lifting mechanism601is a sliding table cylinder. The sliding table cylinder drives the servo motor to lift and lower. The output end of the servo motor is provided with a sleeve603, which is a12-angle sleeve. The lower part of the ratchet shaft501is a hexagonal shaft. Both the sleeve603and the hexagonal shaft are provided with a guide structure. When the sliding table cylinder drives the servo motor to lift, the sleeve603and the lower end of the ratchet shaft501will smoothly form a transmission connection, and the ratchet shaft501is driven and rotated by the first driving mechanism602. When the first lifting mechanism601is lowered, the sleeve603and the ratchet shaft501are disconnected. For example, when the rotation shaft102of the safety belt retractor1with a certain specification rotates 21+0.5 turns from the fully relaxed state, the torque meets the requirements, then at the winding station, the sliding table cylinder drives the servo motor to lift, the sleeve603and the ratchet shaft501form a transmission connection, the servo motor drives the rotation shaft102to rotate21turns at a faster speed, and then the sliding table cylinder lowers, the sleeve603and the ratchet shaft501are disconnected, and the coil spring103tends to drive the rotation shaft102to reverse, because the ratchet shaft501is locked due to reverse rotation, the rotation shaft102remains in the state of21turns. During the winding process, the servo motor monitors the torque at the same time to ensure that the torque is also within a reasonable range.", "", "As shown inFIG.6-7, the winding mechanism6is also arranged under the stop slot positioning station, and the position detection mechanism7is also arranged above the profiling fixture4at the station. The position detection mechanism7includes a vertical support701, a second lifting mechanism702, a installation plate703, a displacement sensor704, a sliding part705, and a detection pin707. The vertical support701is installed on the equipment platform, the second lifting mechanism702and the displacement sensor704are fixed on the vertical support701. The output end of the second lifting mechanism702is provided with a installation plate703, the installation plate703is slidably connected with a sliding part705in the up-down direction. The sliding part705includes an upper connecting plate7051, a lower connecting plate7052, and a guide rod7053, and the upper connecting plate7051and the lower connecting plate7052are fixedly connected by two guide rods7053. The guide rod7053is slidably connected with the installation plate703. The elastic component706is a spring, and the spring sleeve is located on the guide rod7053, between the lower connecting plate7052and the installation plate703. The upper connecting plate7051is connected with the detection shaft of the displacement sensor704. The bottom of the lower connecting plate7052is provided with a detection pin707. The section shape of the detection pin707is the same as that of the pin of the baffle2, and its sectional dimension is not less than the sectional dimension of the pin of the baffle2. The detection pin707is located above the socket1011on the housing101of the safety belt retractor1at the station.", "", "At the winding station, the rotation shaft102has moved for21turns, but the stop slot1021on the rotation shaft102may not be aligned with the position of the socket1011. There are two stop slots1021on the rotation shaft102, so the rotation shaft102rotates to more than half a turn, and the stop slot1021must overlap with the socket1011once. Therefore, at the stop slot positioning station, the rotation shaft102is driven to rotate by the winding mechanism6at the station, and the position detection mechanism7detects whether the stop slot1021is in place, the main work of this station is to adjust the stop slot1021to the lower position of the socket1011of the housing101, so as to ensure that the pin of the baffle2can be smoothly inserted into the stop slot1021when the baffle2is installed later.", "", "Specifically, the second lifting mechanism702drives the installation plate703to lower, and the sliding part705moves downward under the spring force. The detection pin707is inserted into the socket1011of the housing, which forms an elastic contact with the rotation shaft102. The winding mechanism6under this station works the same as the winding mechanism6of the winding station, which lifts first to complete the transmission connection, and then drives the rotation shaft102to rotate. The difference is that the servo motor of this station drives the rotation shaft102to rotate at a relatively slow speed. When the displacement sensor704generates a displacement signal and the displacement value is within the set displacement value range, it indicates that the stop slot1021coincides with the socket1011, and the detection pin707has been inserted into the stop slot1021under the spring force. So far, the winding mechanism6of this station stops working and is disconnected, and the position detection mechanism7resets, the detection pin707is separated from the safety belt retractor1, and the rotation shaft102is still kept in the coincidence state of the stop slot1021and the socket1011under the action of the ratchet seat5. The work of this station is completed.", "", "The baffle installation station is provided with a multi-axis manipulator8and a vibrator bowl9. The vibrator bowl9is provided with a baffle2. In practical application, the vibrator bowl9is provided with two sets, which are respectively used for conveying the baffle plates2for the levorotation safety belt retractor1and the dextrorotation safety belt retractor1. Due to the different rotation directions of the safety belt retractor, the shape of the baffle2used is also different. At this station, the multi-axis manipulator8takes the material from the corresponding vibrator bowl9, and then inserts the pin part of the baffle2into the stop slot of the safety belt retractor1. So far, the pre-winding of the coil spring and the installation of the baffle have been completed, and NG discharging or qualified product discharging has been carried out in the subsequent stations to complete the whole set of work.", "", "As shown inFIG.3, in practical application, there are many specifications of safety belt retractor1. However, in order to achieve versatility and reduce costs, many of them adopt the same shape, but the required initial torque is not consistent with the number of coils. Therefore, the upper and lower colors and models of the housing101are used to distinguish. In order to realize automatic identification of models, the first visual sensor13used to judge the color and shape of the upper surface of the housing101of the safety belt retractor1is arranged above the loading station, and the optical fiber sensor14used to judge the color of the lower surface of the housing101of the safety belt retractor1is arranged below the loading station. The ratchet seat5and the rotary table3are provided with an avoidance through hole on the detection path of the optical fiber sensor14. The color and contour of the upper and lower surfaces of the housing are identified by the first visual sensor and the optical fiber sensor, and the specific model of the safety belt retractor1is determined, which is used to control the specific number of turns of the winding mechanism6at the winding station, and ensure that the torque is controlled within a reasonable range.", "", "As shown inFIG.3, in practical application, a second visual sensor15for determining whether the baffle2is installed in place is also installed above the baffle installation station. After the baffle2is installed, the second visual sensor15is used to detect whether the pin of the baffle2is fully inserted into the stop slot1021. If the baffle is detected to be warped or without baffle, the first NG product signal will be sent.", "", "As shown inFIG.8, in practical application, the rotary table3is also provided with a code spraying station, a code spraying mechanism10for spraying bar code or two-dimensional code is arranged on the code spraying station, a code scanning mechanism11for verifying the code spraying information is also arranged beside the code spraying mechanism10, the code spraying mechanism10and the code scanning mechanism11are arranged side by side, and are installed on a servo sliding table12which is movable in left-right direction, the code spraying mechanism10generally sprays the two-dimensional code on the housing101, one machine one code. The two-dimensional code covers the specifications, model, shell color, initial torque, number of pre-winding and other information of the seat belt retractor1, and then the servo sliding table12moves the code scanning mechanism11to the top of the safety belt retractor1at the station to scan the code, which is used to check whether the two-dimensional code is accurately sprayed. If the spraying is fuzzy or missing, the code scanning mechanism11cannot recognize it, sending the second NG product signal.", "", "As shown inFIG.9, in practical application, the NG discharging station is provided with a two-axis manipulator16in the horizontal and the vertical directions, a first NG material basket17, a second NG material basket18, and a chute20driven by a cylinder19. The first NG material basket17is located below the discharging position of the two-axis manipulator16, the second NG material basket18and the first NG material basket17are arranged in front and back, and the chute20is driven by a cylinder19to move above or to the side of the first NG material basket17, when it is located above the first NG material basket17, the lower opening of the chute20is located above the second NG material basket18.", "", "When the product at the NG discharging station has the first NG signal, the cylinder19retracts, and the two-axis manipulator16takes the material and puts it directly into the first NG material basket17. When the product at the NG discharging station has the second NG signal, the cylinder19extends, and the chute20moves to the top of the first NG material basket17, then the two-axis manipulator16takes the material and puts it directly on the chute20, and slides into the second NG material basket18through the guide of the chute20. Different NG products can be put into different material baskets to facilitate subsequent targeted rework.", "", "As shown inFIG.10, in practical application, the qualified product discharging station is provide with a horizontal and vertical two-axis manipulator16and a belt conveyor21, and the end of the belt conveyor21is provided with a material blocking mechanism. The two-axis manipulator16of this station moves the qualified products to the belt conveyor21. The qualified products are transported to the outside of the equipment by the belt conveyor21and blocked by the material blocking mechanism. Multiple qualified products can be stored and then removed manually or by the manipulator.", "", "In conclusion, the safety belt retractor pre-winding and baffle installation device described in the disclosure can determine the product specification through visual inspection, and then carry out automatic pre-winding, adjustment, baffle installation, code spraying, discharging and other work according to the specification, greatly improving the assembly efficiency.", "", "The basic principle, main features and advantages of the disclosure are shown and described above. The skilled person in the art should understand that the above embodiment is only to illustrate the technical concept and characteristics of the disclosure, and its purpose is to enable people familiar with the technology to understand the content of the disclosure and implement it, and cannot limit the scope of the disclosure. Any equivalent changes or modifications made according to the spirit of the disclosure should be within in the scope of the disclosure."], "claims": ["a winding mechanism ( the winding mechanism ( the baffle installation station is provided with a multi-axis manipulator (", "2 . The safety belt retractor pre-winding and baffle installation device according to claim 1 , wherein a first visual sensor ( 13 ) configured to determine the color and shape of an upper surface of the housing ( 101 ) of the safety belt retractor ( 1 ) is installed above the loading station, and an optical fiber sensor ( 14 ) configured to determine the color of a lower surface of the housing ( 101 ) of the safety belt retractor ( 1 ) is installed below the loading station, the ratchet seat ( 5 ) and the rotary table ( 3 ) are provided with an avoidance through hole on a detection path of the optical fiber sensor ( 14 ).", "3 . The safety belt retractor pre-winding and baffle installation device according to claim 2 , wherein a second visual sensor ( 15 ) for determining whether the baffle ( 2 ) is installed in place is installed above the baffle installation station.", "4 . The safety belt retractor pre-winding and baffle installation device according to claim 3 , wherein the rotary table ( 3 ) is further provided with a code spraying station, a code spraying mechanism ( 10 ) for spraying bar code or two-dimensional code is arranged at the code spraying station, and a code scanning mechanism ( 11 ) for verifying code spraying information is arranged beside the code spraying mechanism ( 10 ), and the code spraying mechanism ( 10 ) and the code scanning mechanism ( 11 ) are arranged side by side, and is installed on a servo sliding table ( 12 ) which is capable to move left and right.", "5 . The safety belt retractor pre-winding and baffle installation device according to claim 4 , wherein the NG discharging station is provided with a two-axis manipulator ( 16 ) moving along a horizontal direction and a vertical direction, a first NG material basket ( 17 ), a second NG material basket ( 18 ), and a chute ( 20 ) driven by a cylinder ( 19 ); the first NG material basket ( 17 ) is located below a discharging position of the two-axis manipulator ( 16 ), the second NG material basket ( 18 ) and the first NG material basket ( 17 ) are arranged in front and back; the chute ( 20 ) is driven by the cylinder ( 19 ) to move above or to a side of the first NG material basket ( 17 ); when it is above the first NG material basket ( 17 ), a lower opening of the chute ( 20 ) is above the second NG material basket ( 18 ).", "6 . The safety belt retractor pre-winding and baffle installation device according to claim 5 , wherein the qualified product discharging station is provided with a two-axis manipulator ( 16 ) moving along a horizontal direction and a vertical direction and a belt conveyor ( 21 ), and an end of the belt conveyor ( 21 ) is provided with a material blocking mechanism.", "7 . The safety belt retractor pre-winding and baffle installation device according to claim 1 , wherein the vibrator bowl ( 9 ) is provided with two sets, which are respectively used for conveying the baffle ( 2 ) for a levorotation safety belt retractor ( 1 ) and a dextrorotation safety belt retractor ( 1 ).", "8 . The safety belt retractor pre-winding and baffle installation device according to claim 1 , wherein the first driving mechanism ( 602 ) is a servo motor, and the first lifting mechanism ( 601 ) is a sliding table cylinder.", "9 . The safety belt retractor pre-winding and baffle installation device according to claim 1 , wherein the sliding part ( 705 ) comprises an upper connecting plate ( 7051 ), a lower connecting plate ( 7052 ) and guide rods ( 7053 ), the upper connecting plate ( 7051 ) and the lower connecting plate ( 7052 ) are fixedly connected by two guide rods ( 7053 ), and the guide rods ( 7053 ) and the installation plate ( 703 ) are slidably connected, the elastic components ( 706 ) are springs, and the springs are sleeved on the guide rods ( 7053 ) between the lower connecting plate ( 7052 ) and the installation plate ( 703 ).", "10 . The safety belt retractor pre-winding and baffle installation device according to claim 1 , wherein the profiling fixture ( 4 ) is positioned and installed on the rotary table ( 3 ) through a plane and two pins, the profiling fixture ( 4 ) is pressed on the rotary table ( 3 ) by a fast pressing block, and the profiling fixture ( 4 ) is provided with a variety of replaceable specifications."], "bibtex": "@patent{20240293901,\n    title = {SAFETY BELT RETRACTOR PRE-WINDING AND BAFFLE INSTALLATION DEVICE},\n    number = {20240293901},\n    year = {2024},\n    note = {File: US20240293901A1-20240905.XML}\n    }", "classification": "B60R2246FI"}, {"title": "VEHICLE WHEEL COVER", "doc_number": "20240294035", "filename": "US20240294035A1-20240905.XML", "abstract": "A vehicle wheel cover is provided. The vehicle wheel cover includes a base, and a printed layer formed at a first location of the base. The printed layer is formed from a plurality of layers of images, such that, at least a first layer of the plurality of layers is located at a first depth from other layers of the plurality of layers. The vehicle wheel cover further includes a plurality of brake cooling holes that is formed as a pattern at a second location of the base. The second location is different from the first location. Based on a movement and an illumination of the vehicle wheel cover, the printed layer forms a three-dimensional graphic image.", "detailed_description": ["The following described implementations may be found in a disclosed vehicle wheel cover. The vehicle wheel cover may include a base and a printed layer (for example, a graphic image of a wheel) that may be formed at a first location of the base. The printed layer may be formed from a plurality of layers of images (for example, a graphic image of plurality of spokes of the wheel), such that, at least a first layer (such as a graphic image of a first spoke of the wheel) of the plurality of layers is located at a first depth from other layers of the plurality of layers. Based on a change in depth between the first layer (such as the first spoke) and other layers (such as a graphic image of other spokes of the wheel) of the plurality of layers, the vehicle wheel cover may form a three-dimensional graphic image (such as a holographic image) based on an illumination of the vehicle wheel cover.", "", "The vehicle wheel cover may further include a plurality of brake cooling holes (such as vent holes) formed as a pattern (for example, circular pattern) at a second location of the base, which may be different from the first location. The plurality of brake cooling holes may be configured to allow airflow on brakes of the wheels and improve cooling of the brakes located in the wheels of the vehicle. Therefore, the plurality of brake cooling holes may improve a lifetime of the brakes located in the wheels of the vehicle.", "", "The vehicle wheel cover may be further configured to include a replaceable member with different wheel styles that may be selectively replaced based on a requirement of a user of the vehicle and may further facilitate a personalized styling for the user of the vehicle.", "", "Reference will now be made in detail to specific aspects or features, examples of which are illustrated in the accompanying drawings. Wherever possible, corresponding, or similar reference numbers will be used throughout the drawings to refer to the same or corresponding parts.", "", "FIGS.1A-1Bare perspective views of a vehicle wheel cover coupled to an exemplary vehicle, in accordance with an embodiment of the disclosure. With reference toFIG.1A, there is shown a vehicle wheel cover100. The vehicle wheel cover100may include a base102, and a printed layer104disposed on a first location102A of the base102. The vehicle wheel cover100may further include a first layer106, a second layer108, and a plurality of brake cooling holes110disposed on a second location102B of the base102.", "", "The base102may be configured to accommodate the printed layer104and the plurality of brake cooling holes110. In an embodiment, the base102may include the first location102A and the second location102B. The printed layer104may be formed on the first location102A of the base102and the plurality of brake cooling holes110may be formed on the second location102B of the base102. In an example, the first location102A may be located on a surface of the base102, which may include at least one of: a substantial boundary-section of the base102, a substantial mid-section of the base102, a substantially sliced section of the base102, or a substantially equidistant-sections of the base102. In another example, the first location102A may be a section that may be internally indented from a boundary of the base102. In another example, the second location102B may be located at a substantially sliced section of the base102, or a substantially equidistant sections of the base102.", "", "The base102may be circularly shaped and may have a substantially flat structure. The base102may also have other shapes and structures based on user requirements of the vehicle. For example, the base102may have any shape, such as, one of: a substantially circular shape, a substantially polygonal shape, and the like. In another example, the base102may have any structure, such as, one of: a minimally arcuate structure, a flat structure, and the like.", "", "In an embodiment, the base102may have a contour (such as the minimally arcuate structure) that may control an angle of incidence of an illumination of light on the printed layer104and control corresponding formation of the three-dimensional graphic image (as shown inFIG.1B). For example, if the base102has the contour that has a substantially flat structure, the angle of incidence of the illumination of light on the printed layer104may change and the three-dimensional graphic image may be correspondingly formed. In another example, if the base102has the contour that may be formed at a first angle (say, “θ”), then the angle of incidence of the illumination of light on the printed layer104may be a second angle (say, “α”). Therefore, a change in angle of the base102may change the angle of incidence of the light on the printed layer104. Description of the angle of incidence is further described, for example, inFIGS.1B, and3.", "", "In another embodiment, the base102may have a first thickness102C in a first range from 1 mm to 3 mm. For example, the base102may include 1 mm thickness in case of wheels of sports vehicles, where a minimal weight and reduced drag in aerodynamics of the vehicle are required. In another example, the base102may include 3 mm thickness in case of wheels of passenger vehicles. In certain instances, the base102of the vehicle wheel cover100may be merely used to conceal parts of the wheel and improve an aesthetic appearance of the wheels. The aesthetic appearance may be further improved by the printed layer104.", "", "The printed layer104is formed on the first location102A of the base102. In an embodiment, the printed layer104may be formed as images of spokes of the wheels. For example, each spoke is equally spaced from other spokes of the printed layer104. In another embodiment, each spoke is spaced at a pattern from other spokes of the printed layer104. For example, a first spoke and a second spoke of the printed layer104may be spaced at a first space and a third spoke and a fourth spoke of the printed layer104may be spaced at a second space. The first space may be different from the second space. The first space and the second space may be repeated in a sequential manner between other spokes of the printed layer104. In yet another embodiment, each spoke is spaced at different spacings from other spokes of the printed layer104. For example, no two spokes in the printed layer104have equal spacing with other two spokes of the printed layer104.", "", "In another embodiment, the printed layer104may include images other than spokes of the wheels. For example, the printed layer104may include a textual image, or a moving graphic image. The textual image or the moving graphic image may indicate a visual alert for users in an environment of the vehicle wheel cover100. The textual image or the moving graphic image may also improve styling of the vehicle wheel cover100. Details of the textual image or the moving graphic image of the printed layer104may be described, for example, inFIG.3.", "", "In an embodiment, the printed layer104may include at least one layer of the plurality of layers of the printed layer104, which may be formed from a translucent material. In such instances, the printed layer104may allow a part of light to pass through the printed layer104. In other instances, the printed layer104may prevent a part of light to pass through the printed layer104. Instead of passing through the printed layer104, the part of light may get scattered within each layer of the printed layer104and illuminate each layer of the printed layer104. In an example, all layers of the printed layer104may receive equal scattering of light via the translucent material and may generate the three-dimensional graphic image based on the illumination on the translucent material. In another example, each layer of the printed layer104may be configured to receive different scattering of light based on deposition of the printed layer104on the first location102A of the base102and may generate the three-dimensional graphic image based on the illumination on the translucent material of the printed layer104. Examples of the translucent materials may include a plastic material or a glass material, which may allow the light to scatter on the printed layer104.", "", "In another embodiment, each layer (such as, the first layer106and the second layer108) of the plurality of layers of the printed layer104comprises a material with different density. For example, the first layer106may include a first material having a first density in at least one of: an axial direction, a radial direction or a tangential direction. The second layer108may include a second material having a second density in at least one of: an axial direction, a radial direction or a tangential direction. Based on a directional orientation of the densities of the first layer and the second layer, there may be a modification in the generation of the three-dimensional image. In some instances, the second density may be different than the first density. For example, the second density may be higher than the first density. In such instances, the second layer108may generate the three-dimensional graphic image on the printed layer104in a higher resolution compared to the first layer106. In other instances, the second density may be oriented in a direction that may be different from the first density. For example, the second density may be orientated in the axial direction and the first density may be oriented in the radial direction. In such instances, there may be a corresponding variation in the generation of the three-dimensional graphic image.", "", "The printed layer104may be formed by a layer-by-layer printing process, which is sequentially formed on the base102of the vehicle wheel cover100. For example, there may be various materials (such as, plastics, liquids, or powders) that may be blended and disposed layer-by-layer onto the base102to form the printed layer104. Examples of such layer-by-layer printing process may include, but not limited to, an additive manufacturing process, a laminated object modeling process, and the like. In some instances, the printed layer104may also be formed from at least one of: a lenticular printing process, a holographic printing process, or a laser etching process.", "", "The lenticular printing process is a printing technology that involves lenticular lenses to produce the printed layer104with a depth illusion, or with a perspective to change or move the printed layer104as they are viewed from different angles. For example, the printed layer104formed via the lenticular printing process may also correspond to a perspective of the movement of images of the spokes printed on the base102, based on the depth illusion of images of the spokes of the printed layer104. Examples of the lenticular printing process may include, but not limited to, a transforming print process, an animated printing process, or a stereoscopic effect printing process. The transforming printing process may require a relatively large change in angle of view to switch from one illusion to another illusion. The animated printing process may require a minimal change in angle of view to switch from one image to another. The stereoscopic effect printing process may allow each eye of the user to see a slightly different view on the illusion.", "", "The holographic printing process may include a rendition of a hologram of the printed layer104on the base102(such as, the substantially flat surface), to produce the three-dimensional graphic image when viewed. In some instances, the printed layer104may be formed from a holographic print that may be different from a traditional hologram such that the print does not require any special lighting arrangements to form a 3-D effect. Thus, specific components (such as an eyewear, or a control stick) may not be required to view the printed layer104. Instead, mere change in the angle of view of the user may rapidly modify the illusion of the printed layer104, made via the holographic printing process.", "", "The laser etching process is another method of forming the printed layer104. In an embodiment, the laser etching process may involve lasers to etch and engrave to form the printed layer104. For example, the laser etching process may include melting of materials, or ablation of materials to form the printed layer104onto the base102of the vehicle wheel cover100. In such process, there may be a requirement for a selection of materials that may be suitable for the laser etching process. For example, the materials may include sensitive polymers or metal alloys. Based on the user requirements, the laser etching process may be used to form the printed layer104.", "", "The printed layer104may be formed from the plurality of layers of images (for example, the first layer106and the second layer108), such that, each layer of the plurality of layers of the printed layer104may be formed on the base102, with a second thickness in a second range from 1 mm to 5 mm. In an embodiment, the second thickness of the printed layer104may be different from the first thickness102C of the base102. In another embodiment, the second thickness of the printed layer104may be same as the first thickness102C of the base102.", "", "In an embodiment, each layer (such as the first layer106and/or the second layer) of the printed layer104may be formed at a dimension of the second thickness. In an example, the first layer106of the plurality of layers may be located at a first depth106A from other layers of the plurality of layers and the second layer108may be disposed at a second depth108A from other layers of the plurality of layers. In an embodiment, the second depth108A (such as, 3 mm) may be different from the first depth106A (such as, 1 mm). In embodiment, the second layer108may be thicker than the first layer106. In an embodiment, the first layer106and the second layer108may correspond to the second thickness of the printed layer104. Based on the varied thickness, there may be an improvement in the illusion of the formed three-dimensional graphic image of the spokes of the wheels.", "", "In another example, the first layer106of the plurality of layers may be located at the first depth106A (such as, 1 mm) from other layers of the plurality of layers and the second layer108may be disposed at the second depth108A (such as, 1 mm) from other layers of the plurality of layers. In an embodiment the second layer108may have the same thickness as the first layer106, which may correspond to the second thickness. Based on same thickness of all layers of the printed layer104, the vehicle wheel cover100may be formed at a minimal thickness, which may substantially reduce a weight of the vehicle wheel cover100and further, reduce the aerodynamic drag via the vehicle wheel cover100.", "", "In an embodiment, the printed layer104may form the three-dimensional graphic image based on the first depth106A of the first layer106of the printed layer104. For example, the vehicle wheel cover100with the printed layer104on the base102, may form the three-dimensional graphic image based on the first depth106A on the printed layer104. In another embodiment, the printed layer104may form the three-dimensional graphic image based on the first depth106A of the first layer106and the second depth108A of the second layer108of the printed layer104. For example, the vehicle wheel cover100with the printed layer104on the base102, may form the three-dimensional graphic image based on the first depth106A and the second depth108A on the printed layer104. In an alternate example, the printed layer104may be an inlay, or an etched surface (for example, via the laser etching process), which may be configured to generate the three-dimensional graphic image based on the illumination of the light.", "", "The plurality of brake cooling holes110may be formed as a pattern (such as a circular pattern, a polygonal pattern, etc.) at the second location102B of the base102. In an embodiment, the plurality of brake cooling holes110are vent holes formed in the circular pattern at the second location102B of the base102. Each of the plurality of brake cooling holes110may be configured to allow airflow on brakes of the wheels and improve cooling of the brakes disposed adjacent to the vehicle wheel cover100. Therefore, the plurality of brake cooling holes may improve a lifespan of the brakes that may be located adjacent to the vehicle wheel cover100.", "", "With reference toFIG.1B, there is shown the vehicle wheel cover100that is coupled to a vehicle112, in accordance with an embodiment of the disclosure.", "", "The vehicle112may include a non-autonomous vehicle, a semi-autonomous vehicle, or a fully autonomous vehicle, for example, as defined by National Highway Traffic Safety Administration (NHTSA). In some situations, the vehicle112may also include a vehicle with autonomous drive capability that uses one or more distinct renewable or non-renewable power sources, such as, a fossil fuel-based vehicle, an electric propulsion-based vehicle, a hydrogen fuel-based vehicle, a solar-powered vehicle, and/or a vehicle powered by other forms of alternative energy sources. The vehicle112shown inFIG.1Bis merely an example of a four-wheeled vehicle. In another example, the vehicle112may also be a one-wheeler vehicle, a two-wheeler vehicle, or a three-wheeler vehicle. Examples of the three-wheeler vehicle may include, but are not limited to, an electric three-wheeler, an internal combustion engine (ICE)-based three-wheeler, or a hybrid three-wheeler. In yet another example, the vehicle112may also include a vehicle with more than four wheels, such as a lorry, truck, and the like.", "", "InFIG.1B, there is shown an illumination element114that may be configured to illuminate the vehicle wheel cover100and form a three-dimensional graphic image116. In an embodiment, the illumination element114activates the printed layer104to output the three-dimensional graphic image116as an illusion of moving images (such as moving spokes) based on an angle of incidence114A of light from the illumination element114and an angle of view of a viewer. The angle of view of the viewer is described further, for example, inFIG.4.", "", "In an embodiment, the illumination element114may include at least one of: a natural light source, an artificial light source, or a reflective element, which may be configured to activate the printed layer104to output the three-dimensional graphic image116as the illusion of moving images (such as moving spokes). The natural light source may include one of: sun, stars, moon, lightning, and the like. For example, if the vehicle112is operated in a daytime, the illusion of the three-dimensional graphic image116may be directly activated under the influence of the sun and the artificial light source or the reflective element may not be required to activate the illusion of the three-dimensional graphic image116of the printed layer104.", "", "In another example, if the vehicle112is operated in a night-time, the illusion of the three-dimensional graphic image116may be required to be manually activated either under the influence of the artificial light source or the reflective element. The artificial light source may include one of: an incandescent light, a fluorescent light, a vapor bulb, a light emitting diode (LED) bulb, and the like. In an embodiment, the artificial light source may be releasably coupled to a part of the vehicle wheel cover100and configured to manually activate the illusion of the three-dimensional graphic image116formed on the printed layer104. In another embodiment, the artificial light source may be integrated with the vehicle wheel cover100and configured to manually activate the illusion of the three-dimensional graphic image116formed on the printed layer104. In yet another embodiment, the artificial light source may be remotely coupled with the vehicle wheel cover100via the vehicle112and configured to manually activate the illusion of the three-dimensional graphic image116formed on the printed layer104.", "", "In certain instances, instead of the artificial light source, the reflective element may be used to manually activate the illusion of the three-dimensional graphic image116formed on the printed layer104. The reflective element may include any shiny surface that is configured to reflect light towards the three-dimensional graphic image116that may be formed on the printed layer104. In an example, the reflective element may include one of: a polished metal, or a mirror glass, which may be configured to reflect light towards the three-dimensional graphic image116that may be formed on the printed layer104. The key advantage of having the reflective element is that there will be no energy spent by the vehicle112to activate the three-dimensional graphic image116of the printed layer104. The reflective element may be configured to receive light illumination from other external sources (such as natural and/or artificial light sources in an environment of driving operation) and reflect such illumination towards the printed layer104of the vehicle wheel cover100to form the three-dimensional graphic image116.", "", "In certain instances, the output of the three-dimensional graphic image116may be controlled based on the angle of incidence114A of the illumination of light from the illumination element114(such as, via at least one of: the natural light source, the artificial light source, or the reflective element) on the printed layer104. In an example, the angle of incidence114A may be controlled based on a location and an angle of the illumination element114(for example, the location and the angle of one of: the natural light source, the artificial light source, or the reflective element). Therefore, based on the angle of the illumination element114and subsequent angle of incidence114A of the illumination of light, the three-dimensional graphic image116may be modified with a change in illusion for the viewer of the vehicle112.", "", "The three-dimensional graphic image116may include one or more graphic images based on the plurality of layers of the printed layer104. In an embodiment, the three-dimensional graphic image116may include a central hub116A and a plurality of spokes116B that may radially extend from the central hub116A. In an embodiment, the central hub116A may be located at a midpoint of the base102and the plurality of spokes116B may be spaced apart from each other and radially arranged exterior to the central hub116A. In an example, the plurality of spokes116B may be formed as images of spokes of the wheels. For example, each spoke is equally spaced from other spokes of the three-dimensional graphic image116. In another embodiment, each spoke may be spaced at a pattern from other spokes of the three-dimensional graphic image116. For example, a first spoke and a second spoke of the three-dimensional graphic image116may be spaced at a first space and a third spoke and a fourth spoke of the three-dimensional graphic image116may be spaced at a second space. The first space may be different from the second space. The first space and the second space may be repeated in a sequential manner between other spokes of the three-dimensional graphic image116. In yet another embodiment, each spoke is spaced at different spacings from other spokes of the three-dimensional graphic image116. For example, no two spokes in the three-dimensional graphic image116may have equal spacing with other two spokes of the three-dimensional graphic image116.", "", "In another embodiment, the three-dimensional graphic image116may include images other than spokes of the wheels. For example, the three-dimensional graphic image116may include a textual image, or a moving graphic image. The textual image or the moving graphic image may indicate a visual alert for users in an environment of vehicle wheel cover100. The textual image or the moving graphic image may also improve styling of the vehicle wheel cover100. Details of the textual image or the moving graphic image of the three-dimensional graphic image116may be described, for example, inFIG.3.", "", "In operation, the vehicle wheel cover100may include the printed layer104at the first location102A of the base102. The printed layer104may be formed from the plurality of layers of images that has the first layer106(such as the graphic image of the first spoke), which may be located at the first depth106A from other layers (such as the graphic image of other spokes of the wheel) of the plurality of layers. Based on a change in depth between the first layer106(such as the graphic image of the first spoke) and other layers (such as the graphic image of other spokes of the wheel) of the plurality of layers, the vehicle wheel cover100may form the three-dimensional graphic image116(such as a holographic/lenticular printed image) based on the illumination of the vehicle wheel cover100from the illumination element114(such as via one of, the natural light source, the artificial light source, or the reflective element) and based on the movement of the vehicle wheel cover100and the vehicle112. As the three-dimensional graphic image forms a styling of the wheel of the vehicle112, there may not be a requirement for a substantially concave structure (which may cause an aerodynamic drag) of the wheel covers for styling the vehicle. Therefore, the vehicle wheel cover100substantially reduces the aerodynamic drag of the vehicle112.", "", "The vehicle wheel cover100may further include the plurality of brake cooling holes110that may be formed as the pattern at the second location102B on the second location102B of the base102. In an embodiment, the pattern may include the circular pattern, the polygonal pattern, and the like, and may be formed at the second location102B of the base102. For example, the plurality of brake cooling holes110are vent holes formed in the circular pattern at the second location102B of the base102. The vent holes may be configured to allow airflow on brakes of the wheels and improve cooling of the brakes disposed adjacent to the vehicle wheel cover100. Therefore, the plurality of brake cooling holes may improve the lifespan of the brakes that may be disposed adjacent to the vehicle wheel cover100.", "", "FIG.2is a perspective view that illustrates a first exemplary scenario of the vehicle wheel cover ofFIG.1A, in accordance with an embodiment of the disclosure.FIG.2is explained in conjunction with elements fromFIGS.1A-1B. With reference toFIG.2, there is shown the vehicle wheel cover100that may be coupled to a wheel200. The wheel200may include a wheel rim202and an annular cooling bed204between the wheel rim202and the wheel200.", "", "The wheel200may be formed as a circular component that is intended to rotate on an axle bearing (not shown) of the vehicle112(shown inFIG.1B). The wheel200may be disposed in conjunction with axles, to allow transportation of cargo and/or users from one location to another location, via the vehicle112. The wheel200may include the wheel rim202and other components, which are omitted from the disclosure for the sake of brevity.", "", "The wheel rim202may be a metallic component of the wheel200that may be configured to hold a tire and/or an inner tube of the vehicle112. The inner tube is configured to be disposed between the wheel rim202and the tire (not shown). In some instances, the wheel rim202may not be aesthetically styled in the vehicle112. Hence, the vehicle wheel cover100is disposed on the wheel rim202to conceal the wheel rim202and improve aesthetic styling of the vehicle112. In another instance, if the wheel rim202is directly exposed to an external environment of the driving conditions of the vehicle112, a lifespan of the wheel rim202may be reduced. In such instances, the vehicle wheel cover100may shield the wheel rim202from the external environment and improve lifespan of the wheel rim202. In yet another instance, if the wheel rim202is directly exposed during operation, it may contribute to aerodynamic drag of the vehicle112. In such instances, the vehicle wheel cover100shields the wheel rim202and forms the substantially aerodynamic structure to minimize the aerodynamic drag of the vehicle112.", "", "In an embodiment, the printed layer104may be sized to fit on the base102and within the wheel rim202of the vehicle112. In an example, the printed layer104is the image of spokes of the wheel200that may be sized to fit on the base102and within the wheel rim202, such that, when illuminated, the printed layer104may form a realistic illusion of the three-dimensional graphic image116(shown inFIG.1B).", "", "The annular cooling bed204may be formed between the wheel rim202and the vehicle wheel cover100. In an embodiment, a portion between the base102and the wheel rim202forms the annular cooling bed204. The annular cooling bed204may form a chamber to cool components of the wheel200based on the air flow via the brake cooling holes110(shown inFIG.1A).", "", "In operation, the base102of the vehicle wheel cover100may be coupled to the wheel rim202of the vehicle112. During operation of the vehicle112, the annular cooling bed204may be configured to receive a cooling fluid (such as the air flow) via the brake cooling holes110. In an example, the annular cooling bed204may have a minimally convex surface at one portion, such that, when the cooling fluid is allowed in the annular cooling bed204via the brake cooling holes110, a movement of a jet of cooling fluid is along the minimally convex surface (i.e., the Coanda effect), and may further improve cooling of components of the vehicle112.", "", "FIG.3is a perspective view that illustrates a second exemplary scenario of the vehicle wheel cover ofFIG.1A, in accordance with an embodiment of the disclosure.FIG.3is explained in conjunction with elements fromFIGS.1A-1BandFIG.2. With reference toFIG.3, there is shown an exemplary scenario300of the vehicle wheel cover100. When illuminated via the illumination element114and/or based on the movement of the vehicle112, the printed layer104may form the three-dimensional graphic image116that may include one or more graphic images based on the plurality of layers of the printed layer104. For example, the printed layer104of the vehicle wheel cover100may form one of: a moving graphic image302, or a textual image304.", "", "The moving graphic image302may include at least two different images located at different portions and at different depths as the printed layer104. For example, the moving graphic image302may include a first image and a second image. As shown inFIG.3, for example, the first image may indicate an arrow that may be disposed at a first portion. The second image may indicate an arrow that may be disposed at a second portion. The second portion may be different from the first portion. In such instances, based on the angle of incidence114A of the illumination element114, the printed layer104may form the three-dimensional graphic image116that indicates a presence of the first arrow at the first portion and an absence of the second arrow at the second portion of the printed layer104.", "", "When the angle of incidence114A of the illumination element114is changed, the three-dimensional graphic image116may be modified that may indicate an absence of the first arrow at the first portion and a presence of the second arrow at the second portion of the printed layer104, as shown inFIG.3. Such sequential operation may form an illusion of the moving graphic image302. The moving graphic image302shown inFIG.3is merely an example. The printed layer104may include any other moving graphic images, such as, a moving graphic of a running horse, a moving graphic of a telephone number, and the like. In another embodiment, the three-dimensional graphic image116may also be formed as at least one of: the moving graphic image302, a static graphic image, the textual image304, or a combination thereof. The static graphic image may include a graphic image that may look substantially like the moving graphic image302; but disposed at a single location without any change in movement of the illusion irrespective of the angle of incidence114A form the illumination element114.", "", "The textual image304may include at least one textual image on the printed layer104of the vehicle wheel cover100. The textual image304may relate to any indication and/or alert for viewers of the vehicle112. For example, in case the vehicle112is an ambulance vehicle, it may display the textual image304as “Emergency! Please leave the way!” or “Urgent” (as shown for example inFIG.3). In another example, in case the vehicle112is an advertising billboard vehicle, it may display the textual image304as “Sale! Sale! Expires this week!”. In an embodiment, the textual image304may be modified based on user requirements of the vehicle112.", "", "FIG.4is a perspective view that illustrates a third exemplary scenario of the vehicle wheel cover ofFIG.1A, in accordance with an embodiment of the disclosure.FIG.4is explained in conjunction with elements fromFIGS.1A-1B,FIG.2, andFIG.3. With reference toFIG.4, there is shown an exemplary scenario400of the vehicle wheel cover100. In certain instances, based on a viewer402of the vehicle112, the shape and the structure of the three-dimensional graphic image116may be modified.", "", "In an embodiment, based on a viewing angle of the viewer402, the shape and the structure of the three-dimensional graphic image116may be modified. For example, based on a first viewing angle402A of the viewer402, the three-dimensional graphic image116may be formed as a first shape and a first structure. In another example, based on a second viewing angle402B of the viewer402, the three-dimensional graphic image116may be formed as a second shape and a second structure. Therefore, in addition to the angle of incidence114A (shown inFIGS.1B and3) of the illumination element114, the viewing angle of the viewer402may also significantly contribute to a change in the shape and the structure of the three-dimensional graphic image116. In another embodiment, a viewing capability (such as an eyesight of the user, for example, the three-dimensional graphic image viewed by a viewer with a normal vision, may be different, from the three-dimensional graphic image viewed by a viewer with a distant vision) of the viewer402may also significantly contribute to the change in the shape and the structure of the three-dimensional graphic image116. In yet another embodiment, an intensity of the illumination element114may be an additional factor that may contribute to the change in the shape and the structure of the three-dimensional graphic image116. In yet another embodiment, a lifespan (such as a date of formation of the printed layer104or a date of purchase of the vehicle112) of the printed layer104may be an additional factor that may contribute to the change in the shape and the structure of the three-dimensional graphic image116.", "", "FIG.5is a flowchart that illustrates exemplary operations to form the vehicle wheel cover ofFIG.1A, in accordance with an embodiment of the disclosure.FIG.5is explained in conjunction with elements fromFIGS.1A-1B,FIG.2,FIG.3, andFIG.4. With reference toFIG.5, there is shown a flowchart500. The operations from502to508may be implemented, for example, by a user or a manufacturer of the vehicle112. The operations of the flowchart500may start at502.", "", "At502, the base102may be disposed. In an embodiment, the user or the manufacturer of the vehicle112may form or dispose the base102as described further, for example,FIGS.1A-1B.", "", "At504, the printed layer104may be formed at the first location102A of the base102. The printed layer104may be formed from the plurality of layers of images. In an embodiment, the user or the manufacturer may form the printed layer104as described, for example, inFIGS.1A-1B.", "", "At506, the plurality of brake cooling holes may be formed as the pattern (such as the circular pattern) at the second location102B of base102. The second location102B may be different from first location102A. In an embodiment, the user or the manufacturer may form the plurality of brake cooling holes110as described, for example, inFIGS.1A-1B.", "", "In certain instances, the second layer108of the plurality of layers may be formed or disposed at the second depth108A from the other layers of the plurality of layers, where the second depth108A may be different from the first depth106A, as described, for example, inFIGS.1A-1B. In an embodiment, the user or the manufacturer may form the second layer108as described, for example, inFIGS.1A-1B.", "", "The flow chart shown inFIG.5is illustrated as discrete operations, such as from502to506, which relates to the formation of the vehicle wheel cover100for the vehicle112. However, in certain embodiments, such discrete operations may be further divided into additional operations, combined into fewer operations, or eliminated, depending on the particular implementation without detracting from the essence of the disclosed embodiments.", "", "For the purposes of the present disclosure, expressions such as “including”, “comprising”, “incorporating”, “consisting of”, “have”, “is” used to describe, and claim the present disclosure are intended to be construed in a non-exclusive manner, namely allowing for items, components or elements not explicitly described also to be present. Reference to the singular is also to be construed to relate to the plural. Further, all joinder references (e.g., attached, affixed, coupled, connected, and the like) are only used to aid the reader's understanding of the present disclosure, and may not create limitations, particularly as to the position, orientation, or use of the systems and/or methods disclosed herein. Therefore, joinder references, if any, are to be construed broadly. Moreover, such joinder references do not necessarily infer that two elements are directly connected to each other.", "", "The foregoing description of embodiments and examples has been presented for purposes of illustration and description. It is not intended to be exhaustive or limiting to the forms described. Numerous modifications are possible considering the above teachings. Some of those modifications have been discussed and others will be understood by those skilled in the art. The embodiments were chosen and described for illustration of various embodiments. The scope is, of course, not limited to the examples or embodiments set forth herein but can be employed in any number of applications and equivalent devices by those of ordinary skill in the art. Rather it is hereby intended the scope be defined by the claims appended hereto. Additionally, the features of various implementing embodiments may be combined to form further embodiments."], "claims": ["a base; a printed layer formed at a first location of the base, the printed layer is formed from a plurality of layers of images, wherein at least a first layer of the plurality of layers is located at a first depth from other layers of the plurality of layers; and a plurality of brake cooling holes formed as a pattern at a second location of the base, the second location is different from the first location, wherein, based on a movement and an illumination of the vehicle wheel cover, the printed layer forms a three-dimensional graphic image.", "at least a second layer of the plurality of layers is disposed at a second depth from the other layers of the plurality of layers, the second depth is different from the first depth, and the three-dimensional graphic image is formed based on the first depth and the second depth of the printed layer.", "3 . The vehicle wheel cover according to claim 1 , wherein at least one layer of the plurality of layers of the printed layer is formed from a translucent material.", "4 . The vehicle wheel cover according to claim 1 , wherein each layer of the plurality of layers of the printed layer comprises a material with different density.", "5 . The vehicle wheel cover according to claim 1 , wherein the printed layer is formed from at least one of: a lenticular printing process, a holographic printing process, or a laser etching process.", "the base is coupled to a wheel rim of a vehicle; and a portion between the base and the wheel rim forms an annular cooling bed, the annular cooling bed is configured to receive a cooling fluid via the brake cooling holes.", "7 . The vehicle wheel cover according to claim 6 , wherein the printed layer is sized to fit on the base and within the wheel rim of the vehicle.", "8 . The vehicle wheel cover according to claim 6 , wherein the base has a first thickness in a first range from 1 mm to 3 mm; and each layer of the plurality of layers of the printed layer on the base has a second thickness in a second range from 1 mm to 5 mm.", "9 . The vehicle wheel cover according to claim 6 , wherein a contour of the base controls an angle of incidence of the illumination of light on the printed layer and corresponding formation of the three-dimensional graphic image.", "wherein the three-dimensional graphic image comprises a central hub and a plurality of spokes radially extending from the central hub, and wherein the central hub is located at a midpoint of the base.", "wherein the three-dimensional graphic image is formed as at least one of: a moving graphic image, a static graphic image, or a textual image.", "wherein a shape and a structure of the three-dimensional graphic image is modified based on a viewing angle of a viewer.", "13 . The vehicle wheel cover according to claim 1 , wherein an output of the three-dimensional graphic image is controlled based on an angle of incidence of the illumination of light on the printed layer.", "an illumination element configured to illuminate the vehicle wheel cover and form the three-dimensional graphic image.", "wherein the illumination element comprises at least one of: a natural light source, an artificial light source, or a reflective element.", "wherein the three-dimensional graphic image may include one or more graphic images based on the plurality of layers of the printed layer.", "a base; a printed layer disposed at a first location of the base, the printed layer is formed from a plurality of layers of images, wherein at least a first layer of the plurality of layers is located at a first depth from other layers of the plurality of layers; and a plurality of brake cooling holes formed as a pattern and disposed at a second location of the base, the second location is different from the first location.", "at least a second layer of the plurality of layers is disposed at a second depth from the other layers of the plurality of layers, the second depth is different from the first depth, based on the first depth and the second depth of the printed layer, the printed layer forms a three-dimensional graphic image.", "disposing a base; forming a printed layer at a first location of the base, the printed layer is formed from a plurality of layers of images, wherein at least a first layer of the plurality of layers is located at a first depth from other layers of the plurality of layers; and forming a plurality of brake cooling holes as a pattern at a second location of the base, the second location is different from the first location.", "disposing at least a second layer of the plurality of layers at a second depth from the other layers of the plurality of layers, wherein, the first layer has a first material with a first density, the second layer has a second material with a second density, the second density is different from the first density."], "bibtex": "@patent{20240294035,\n    title = {VEHICLE WHEEL COVER},\n    number = {20240294035},\n    year = {2024},\n    note = {File: US20240294035A1-20240905.XML}\n    }", "classification": "B60B700FI"}, {"title": "VEHICLE WHEEL COVER CASING AND A METHOD OF MANUFACTURING A VEHICLE WHEEL COVER CASING", "doc_number": "20240294036", "filename": "US20240294036A1-20240905.XML", "abstract": "A sleeve for covering vehicle wheels includes a fabric band having an annular arrangement and therefore with a circumferential path as a result of the annular geometry, the band having such proportions and being enabled to cover and surround an external region of a wheel of a vehicle. The fabric band has a central area along its circumferential path and at least one lateral area adjacent to the central area following the same circumferential path. The at least one adjacent lateral area of the band has a surface density value lower than the surface density value of the central area of the same band. The band also presents a textile or fabric continuity in the mutual contact between its central area and at least one adjacent lateral area, the band being formed in one piece or textile body.", "detailed_description": [""], "claims": ["1 .- 34 . (canceled)", "a fabric band having an annular arrangement and therefore with a circumferential path as a result of the annular geometry, the band having such proportions and being enabled to cover and surround an external region of a wheel of a vehicle, wherein the fabric band has a central area along its circumferential path and at least one lateral area adjacent to the central area following the same circumferential path, wherein the at least one adjacent lateral area of the band has a surface density value lower than the surface density value of the central area in the same band; wherein the band further has a textile or fabric continuity in the mutual contact between its central area and the at least one adjacent lateral area, the band being formed in one piece or textile body.", "36 . The sleeve for covering vehicle wheels according to claim 35 , wherein the band is enabled to totally or partially cover at least the tread and at least one flank of the wheel of a vehicle.", "37 . The sleeve for covering vehicle wheels according to claim 36 , wherein the central area of the band corresponds to at least the tread of the wheel and the at least one lateral area corresponds to at least one flank of the same wheel.", "38 . The sleeve for covering vehicle wheels according to claim 37 , wherein the central area of the band corresponds to the tread and also partially over at least one flank of the wheel.", "39 . The sleeve for covering vehicle wheels according to claim 35 , wherein there are at least two adjacent lateral areas, resulting in at least one adjacent lateral area on both sides of the central area of the band, following the circumferential path of the annular geometry of the band.", "wherein when (i) the central area of the band corresponds to at least the tread of the wheel and the at least one lateral area corresponds to at least one flank of the same wheel, or (ii) the central area of the band corresponds to the tread and also partially over at least one flank of the wheel; the central area of the band corresponds at least to the tread of the wheel and at least one adjacent lateral area corresponds to each of the flanks of the wheel.", "41 . The sleeve for covering vehicle wheels according to claim 40 , wherein the band has an adjacent lateral area arranged on each side of the central area following the circumferential path of the annular geometry of the band.", "42 . The sleeve for covering vehicle wheels according to claim 40 , wherein the lateral areas of the band have a symmetry in relation to the central area of the same band.", "43 . The sleeve for covering vehicle wheels according to claim 35 , wherein the band incorporates an elastic means on at least one of its lateral edges following the circumferential path of the annular geometry of the band.", "44 . The sleeve for covering vehicle wheels claim 35 , which is made totally or partially of polymeric material or the like.", "45 . The sleeve for covering vehicle wheels according to claim 35 , wherein the central area of the band has projections on its surface.", "46 . The sleeve for covering vehicle wheels according to claim 45 , wherein the projections have a linear or rectilinear arrangement.", "47 . The sleeve for covering vehicle wheels according to claim 46 , wherein the projections have a linear and rectilinear arrangement, and with an orientation that is parallel to the axial axis of the annular arrangement of the band.", "48 . The sleeve for covering vehicle wheels according to claim 35 , wherein the textile band incorporates metallic yarns in the total or partial conformation of its constituent fabric.", "49 . The sleeve for covering vehicle wheels according to claim 48 , wherein the metal yarns are totally or partially made of titanium.", "50 . The sleeve for covering vehicle wheels according to claim 48 , wherein the metal yarns are totally or partially made of stainless steel.", "wherein when (i) the central area of the band has projections on its surface, (ii) the projections have a linear or rectilinear arrangement, or (iii) the projections have a linear and rectilinear arrangement, and with an orientation that is parallel to the axial axis of the annular arrangement of the band, the projections of the band are metallic in nature.", "52 . The sleeve for covering vehicle wheels according to claim 35 , wherein the band simultaneously incorporates in its conformation at least yarns of a polymeric nature or the like and yarns of a metallic nature or the like.", "an arrangement and supply of warp yarns from and along a warp and another arrangement and supply of weft yarns from and along a creel, the warp and the creel being mutually positioned and enabled to result in a fabric band, wherein the amount or properties of the warp yarns supplied is heterogeneous along the same warp, resulting in the fabric band having a different surface density along its surface depending on the heterogeneity in the amount or properties of the warp yarns supplied along the same warp.", "54 . The method of manufacturing a sleeve for covering vehicle wheels, according to claim 53 , wherein the number or properties of the weft yarns supplied is heterogeneous along the creel, resulting in the fabric band having projections on its surface that are in turn resulting from the differentiated weft yarns supplied from the creel, the projections being in turn oriented in the direction of the arrangement of the weft yarns supplied from the creel."], "bibtex": "@patent{20240294036,\n    title = {VEHICLE WHEEL COVER CASING AND A METHOD OF MANUFACTURING A VEHICLE WHEEL COVER CASING},\n    number = {20240294036},\n    year = {2024},\n    note = {File: US20240294036A1-20240905.XML}\n    }", "classification": "B60B1500FI"}, {"title": "REMOVABLE WORK BOX CASTER", "doc_number": "20240294037", "filename": "US20240294037A1-20240905.XML", "abstract": "Removable work box casters for a job site work box having support skids comprised of an open polygonal shaped frame having a skid base plate and skid side plates. Each caster has an upper plate segment, a closed end section, a lower plate segment that creates a sleeve between the upper and lower plate segments, and a wheel assembly. The skid base plates of the skids are positioned within the sleeve of a selected removable work box caster. A security device may be included to assist in retaining the skid base plate within the sleeve of the removable work box caster.", "detailed_description": ["FIG.1one shows a perspective view of a typical job site work box (100) for which the removable work box casters (10) are to be utilized. The work box (100) is supported on skids (110) that are comprised of a plate or plates formed to create an open polygonal shaped frames (112) having a skid base plate (114) and skid side plates (116). One or more skids (110) may be utilized to support the work box (100). The skids inFIG.1are shown as a trapezoidal shaped frame but the skids may be comprised of a plate or plates of any suitable polygonal shape such as a triangle shape.", "", "The removable work box caster (10) of applicant's invention is shown inFIGS.2-4. The removable work box caster (10) is comprised of an upper plate segment (12), a lower plate segment (14), a closed end section (16), and a sleeve (18) created between the upper plate segment (12) and the lower plate segment (14). Preferably, the removable work box caster (10) will be comprised on a single plate that is folded over upon itself to create the upper plate segment (12), the lower plate segment (14), the end section (16), and the sleeve section (18). However, the upper plate segment (12), the lower plate segment (14), the end section (16) may be formed from multiple plates that are welded or otherwise connected together.", "", "The sleeve (18) the upper plate segment (12) and the lower plate segment (14) is configured to receive the base plate (114) of skid frame (112). A pivotable wheel assembly (20) is mounted to the underside (22) of the lower plate segment (14). The wheel assembly (20) will preferably have a wheel (24) that rotates horizontally 360 degrees about a vertically extending wheel assembly shaft (29). A security device (26) is provided to retain the base plate (114) of the skid frame (112) of the skid (110) within the sleeve (18) created by the upper plate segment (12) and the lower plate segment (14). The security device (26) is shown as a removable cotter pin (28) positioned in cotter pin holes (30) in the upper plate segment (12) and the lower plate segment (14). The cotter pin (28) may be attached to a pin cord (32) that is attached to the upper plate segment (12) as a convenient way to retain the pin (30) when it is removed. The pin cord may be wire, a cable, string, or a chain. Other security devices may be utilized such as a hasp and loop or one or more bolts with corresponding nuts.", "", "FIG.5shows a schematic view of the installation of the removable work box caster (10) on the skids (110) of a work box (100). For use, a removable work box caster (10) is provided for each skid (110) of a work box (100). The sleeve (18) of a selected removable work box caster (10) is then inserted over the base plate (114) of each skid (110) of the work box (100) so that each base plate (114) is positioned between the upper plate segment (12) and the lower plate segment (14) of a removable work box caster with the respective wheel assembly (20) and wheel (24) of the selected work box caster (10) positioned beneath each of the skid base plates (114).FIG.6shows a schematic view of the work box (100) with the mounted removable work box casters (10) mounted onto the skids (110).FIG.7, a partial cross-section view from section7-7ofFIG.6, shows a cross-section schematic view of a removable work box caster (10) mounted on the skid (110) of the work box (100).", "", "Once the sleeves (18) of the removable work box caster (10) are so positioned, each of the removable work box caster (10) may be then held in place around the skid base plates (114) by the latching mechanism (26) such as one or more cotter pins (28) inserted in pin holes (30) in the upper and lower plate segments. The removable work box caster (10) may be readily removed from the job site work box (100) by pulling the cotter pin or pins (28) and sliding the sleeve (18) off of the skid base plates (114).", "", "It is thought that the removable work box caster (10) and method of the present invention and many of its attendant advantages will be understood from the foregoing description and it will be apparent that various changes may be made in the form, construction and arrangement of the parts thereof without departing from the spirit and scope of the invention or sacrificing all of its material advantages, the form described herein being merely a preferred or exemplary embodiment of the invention."], "claims": ["(a) an upper plate segment, a lower plate segment, and a closed end section; (b) a sleeve between said upper plate segment and said lower plate segment; and (c) a wheel assembly attached to said lower plate segment.", "2 . The combination recited in claim 1 wherein said removable work box caster has a security device whereby said skid base plate is retained within said sleeve.", "3 . The combination recited in claim 2 wherein said security device is comprised of a removable pin positioned through said upper plate segment and said lower plate segment of said removable work box caster.", "4 . The combination recited in claim 3 further comprising a cord attaching said removable work box caster to said removable pin.", "5 . The combination recited in claim 2 wherein said upper plate segment, said lower plate segment and said closed end section are comprised of a single continuous plate.", "(a) a job site work box supported on a plurality of skids, each of said skids comprised of an open polygonal shaped frame having a skid base plate and skid side plates; (b) a plurality of removable work box casters, each said caster of said plurality of casters comprising an upper plate segment, a closed end section, and a lower plate segment having a bottom surface, a wheel assembly attached to said bottom surface of said lower plate segment, and a sleeve between said upper plate segment and said lower plate segment; and (c) wherein said skid base plate of each of said skids is positioned within said sleeve of a selected removable work box caster selected from said plurality of removable work box casters.", "7 . The removable work box casters recited in claim 6 , further comprising a security device retaining skid base plates of each of said skids within said sleeve of said selected work box caster.", "8 . The removable work box casters recited in claim 7 wherein said security device is comprised of a pin positioned through a pin hole in said upper plate segment and said lower plate segment of each of said work box casters.", "9 . The removable work box casters recited in claim 8 further comprising a pin cord attached to said pin and each said removable work box caster of said a plurality of removable work box casters.", "14 . The removable work box casters recited in claim 6 wherein each said wheel assembly has a wheel that rotates 360° horizontally.", "(a) providing a job site work box supported on a plurality of skids, each of said skids of said job site work box comprised of an open polygonal shaped frame having a skid base plate and skid side plates; (b) providing a plurality of removable work box casters, each removable work box caster of said caster of said plurality of casters comprising an upper plate segment, a closed end section, and a lower plate segment having a bottom surface, a wheel assembly attached to said bottom surface of said lower plate segment, and a sleeve between said upper plate segment and said lower plate segment; (c) selecting a said removable work box caster from said plurality of removable work box casters; (d) sliding said sleeve of said selected removable work box caster onto said skid base plate of a selected skid of said job site work box with said lower plate segment positioned below said skid base plate of said selected skid; and (e) repeating steps (c) and (d) until a said removable work box caster is mounted onto each said skid of said job site work box.", "11 . The method of adding removable work box casters to a job site work box recited in claim 10 further comprising providing a security device attached to each said removable work box caster whereby said skid base plate of each of said skids is retained within said sleeve of a said selected work box caster.", "12 . The method of attaching removable work box casters to a job site work box recited in claim 11 wherein said security device is comprised of at least one pin positioned through a pin hole in said upper plate segment and said lower plate segment of each said selected removable work box caster", "13 . The method of attaching removable work box casters to a job site work box recited in claim 12 further comprising the step of providing a pin cord attached to each said pin and each said selected removable work box caster."], "bibtex": "@patent{20240294037,\n    title = {REMOVABLE WORK BOX CASTER},\n    number = {20240294037},\n    year = {2024},\n    note = {File: US20240294037A1-20240905.XML}\n    }", "classification": "B60B3300FI"}, {"title": "VEHICLE PNEUMATIC TYRE AND RUBBER MIXTURE FOR A TREAD", "doc_number": "20240294038", "filename": "US20240294038A1-20240905.XML", "abstract": "A pneumatic vehicle tire in radial design that is a summer tire or all-season tire, with a profiled tread including rows of profile blocks and/or profile ribs running around the tire in circumferential direction, wherein the total number of sipes within each row of profile blocks and/or profile ribs is not more than 150, wherein the tread is in the form of a single layer or multiple layers with a radially outermost tread layer that extends at least over the width of the ground contact area, wherein the profile depth of the tread is up to 6.5 mm, and the tread or its radially outermost tread layer consists of a rubber material with a Shore A hardness at room temperature in accordance with DIN ISO 7619-1 of 40 ShA to 55 ShA.", "detailed_description": [""], "claims": ["wherein the tread is in the form of a single layer or multiple layers with a radially outermost tread layer that extends at least over the width of the ground contact area; wherein the profile depth of the tread is up to 6.5 mm; and, wherein the tread or its radially outermost tread layer consists of a rubber material with a Shore A hardness at room temperature in accordance with DIN ISO 7619-1 of 40 ShA to 55 ShA.", "2 . The pneumatic vehicle tire as claimed in claim 1 , wherein the Shore A hardness at room temperature in accordance with DIN ISO 7619-1 of the rubber material of the tread or of the radially outermost tread layer is from 40 ShA to 50 ShA.", "3 . The pneumatic vehicle tire as claimed in claim 1 , where the rubber material of the tread or of the radially outermost tread layer has a dynamic storage modulus at 8% elongation and 55° C. ((E′8%) in accordance with DIN 53 513, ascertained by dynamic-mechanical measurement with a strain sweep, of 2.5 MPa to 4.0 MPa.", "4 . The pneumatic vehicle tire as claimed in claim 1 , wherein the profile depth of the tread is not more than 6.0 mm.", "5 . The pneumatic vehicle tire as claimed in claim 4 , wherein the profile depth of the tread is at least 4.5 mm.", "a rubber having a glass transition temperature (Tg) of lower than −35° C. or a mixture of at least two rubbers having an average glass transition temperature (Tg) of lower than −35° C.", "30 phr to 250 phr of silica (s); 5.0 phr to 75 phr of resin (s); and 3.0 phr to 25.0 phr of activator (s).", "0.5 phr to 6.0 phr of accelerator (s); and, 0.5 phr to 5.0 phr of sulfur or a sulfur donor.", "5.0 phr to 70 phr of liquid polymer (s).", "10 . The pneumatic vehicle tire as claimed in claim 6 , wherein the rubber mixture comprises rubber having a glass transition temperature (Tg) of lower than −55° C. or a mixture of at least two rubbers having an average glass transition temperature (Tg) of lower than −55° C.", "11 . The pneumatic vehicle tire as claimed in claim 6 , wherein the rubber or the mixture of at least two rubbers includes 50 phr to 100 phr of modified solution styrene-butadiene rubber.", "12 . The pneumatic vehicle tire as claimed in claim 7 , wherein the rubber mixture comprises 60 phr to 150 phr of silica.", "13 . The pneumatic vehicle tire as claimed in claim 7 , wherein the rubber mixture comprises 10 phr to 50 phr of resin (s).", "14 . The pneumatic vehicle tire as claimed in claim 7 , wherein the activator (s) includes blocked and/or unblocked mercaptosilane.", "15 . The pneumatic vehicle tire as claimed in claim 14 , wherein the blocked and/or unblocked mercaptosilane is present in the rubber mixture in an amount from 7.0 phr to 13.0 phr.", "16 . The pneumatic vehicle tire as claimed in claim 9 , wherein the liquid polymer (s) includes liquid polybutadiene.", "17 . The pneumatic vehicle tire as claimed in claim 16 , wherein the liquid polybutadiene is present in the rubber mixture in amount from 10 phr to 50 phr.", "a rubber having a glass transition temperature (Tg) of lower than −35° C. or a mixture of at least two rubbers having an average glass transition temperature (Tg) of lower than −35° C.; 30 phr to 250 phr of silica (s); 5.0 phr to 75 phr of resin (s); 3.0 phr to 25.0 phr of activator (s); 5.0 phr to 70 phr of liquid polymer (s); 0.5 phr to 6.0 phr of accelerator (s); and 0.5 phr to 5.0 phr of sulfur or a sulfur donor.", "the rubber mixture comprises rubber having a glass transition temperature (Tg) of lower than −55° C. or a mixture of at least two rubbers having an average glass transition temperature (Tg) of lower than −55° C.; the rubber or the mixture of at least two rubbers includes 50 phr to 100 phr of modified solution styrene-butadiene rubber; the rubber mixture comprises 60 phr to 150 phr of silica; the rubber mixture comprises 10 phr to 50 phr of resin (s); the activator (s) includes blocked and/or unblocked mercaptosilane; and the liquid polymer (s) includes liquid polybutadiene, the liquid polybutadiene is present in the rubber mixture in amount from 10 phr to 50 phr.", "the Shore A hardness at room temperature in accordance with DIN ISO 7619-1 of the rubber material of the tread or of the radially outermost tread layer is from 40 ShA to 50 ShA; and wherein the profile depth of the tread is in a range of 4.5 mm to 6.0 mm."], "bibtex": "@patent{20240294038,\n    title = {VEHICLE PNEUMATIC TYRE AND RUBBER MIXTURE FOR A TREAD},\n    number = {20240294038},\n    year = {2024},\n    note = {File: US20240294038A1-20240905.XML}\n    }", "classification": "B60C1103FI"}, {"title": "TIRE AND A MOULD FOR MANUFACTURING A TIRE", "doc_number": "20240294039", "filename": "US20240294039A1-20240905.XML", "abstract": "A mould for manufacturing a tire includes a plurality of segments including a first segment. The first segment has a first end, an opposite second end, primary lamella blades that are arranged close to the first end, and secondary lamella blades that are arranged far from both the ends. An average of the heights of the primary lamella blades is at least 75% of an average of the heights of the secondary lamella blades. A bending strength of the primary lamella blades against bending in a circumferential direction of the mould is greater than a bending strength of the secondary lamella blades against bending in the circumferential direction of the mould. A tire is manufactured by the mould.", "detailed_description": ["FIGS.1ato1dshow general principles of last steps for manufacturing a tire. A green (i.e. uncured) tire is made as known in the art, e.g. from EP3243644. To cure the green tire105to form a vulcanized tire, the green tire105is arranged in a mould200and heated to vulcanize the green tire105to form the tire100. The mould200is annular, as is the green tire105and the tire100, and typically comprises segments211,212,213,214,215,216,217, and218. Naturally, the mould200may comprise a greater number or a smaller number of segments than eight, such as 6 to 14 segments.", "", "The segments211,212, . . . ,218are movably radially outwards (in the +SR direction) to open the mould so that the green tire105can be inserted into the mould200as shown inFIG.1a, and the vulcanized tire100can be removed from the mould200, as shown inFIG.1c. InFIGS.1aand1c, the mould200is in an open position.", "", "As shown inFIG.1b, when the green tire105is being vulcanized to form the vulcanized tire100, the segments have been moved radially inwards (in the direction −SR) to close the mould and to form the annular mould200. InFIG.1b, the mould200is in an closed position.", "", "Such a manufacturing process produces segment seams411,412,413to the vulcanized tire100. The segment seams are located at the points, where two segments, such as211and212, contact each other when the mould200is in the closed position.", "", "The mould200often comprises ridges configured to form grooves of the tire. The mould often comprises lamella blades configured to form sipes of the tire. The sipes, as well as the lamella blades, are typically transversal and the lamella blades protrude radially inwards from surfaces of the mould segments. Sipes are provided to the tire to effectively soften the tire material and to improve grip particularly of winter tires. Thus, the shapes of the lamella blades of the mould define the shapes of the sipes of the tire. Likewise, the shapes of the ridges of the mould defined the shapes of the grooves of the tire. The sipes and the grooves are arranged on a tread of a tire, as well known. Moreover, in certain types of tires, the transversal grooves (393,394,395,396;FIG.3a) define a direction of rotation R for the tire. The direction of rotation R is the direction of rotation R of the tire, when the vehicle onto which the tire is mounted travels forward. In an embodiment, the transversal grooves (393,394,395,396) define a V-shape that opens reverse to the direction of rotation (seeFIGS.3aand3b). In an embodiment, the transversal grooves define only a half of a V-shape that opens reverse to the direction of rotation (seeFIGS.4aand4b). In an embodiment, the tread110of tire100has such a shape that the tread defines a direction of rotation R. In such an embodiment, the tire100preferably further comprises a marking on a sidewall of the tire, the marking being indicative of a direction of rotation of the tire. However, the embodiments are usable in other tires, too, which may be e.g. asymmetric tires not having a defined direction of rotation.", "", "As indicated inFIG.1b, when the green tire is being cured, the segments are in arranged in the closed position (i.e. a radially inward position). However, after vulcanizing the tire, the segments are moved radially outwards to the open position, as readable fromFIGS.1band1c. Thus, the transversal lamella blades near the ends of the mould segments are exposed to reasonably high bending forces caused by the vulcanized tire material in the vicinity of the lamella blades.", "", "To elaborate the embodiments of the present invention, a first segment211of the mould200is schematically shown inFIGS.2aand2b.FIG.2ashows a side view of the first segment211; andFIG.2bshows an outward radial projection of the first segment211; i.e. the first segment211as viewed from a centre O (seeFIG.1c) of the mould200in the radially outward direction +SR (seeFIG.1c).FIG.2cshows an outward radial projection of another first segment211; i.e. the other first segment211as viewed from a centre O (seeFIG.1c) of the mould200in the radially outward direction +SR (seeFIG.1c). As shown inFIG.2b, the ends221,222of the first segment211may be straight. As shown inFIG.2c, an the ends221,222of the first segment211need not be straight. The ends211,222of the first segment may e.g. mainly follow the ridges for forming grooves as inFIG.2c. The ends211,222of the first segment may e.g. only follow the ridges for forming grooves, in which case segments seams shown inFIG.4bwould be obtained.", "", "To improve properties of the tire100, including the handling properties of the tire100, particularly a worn tire, the sipes of the tire100are as deep near the segment seams411,412,413as further away from them. This shows in the mould segment211such that a height of primary lamella blades511arranged near the segments ends221,222substantially equals a height of secondary lamella blades512arranged far away the segments ends221,222. When the sipes of the tire100are as deep near the segment seams411,412,413as further away from them the tire, in use, wears in the same manner near the segments seams and away from the segments seams. In particular, the wearing of the tire, which effectively makes the sipes less deep, affects the local properties of the tread in the same manner near the segments seam as further away from the segment seam. Thus, the handling of the worn tire improves, compared to a tire of prior art that has worn the same amount. This also reduces the vibrations of the tire in use as well as reduces noise generated by the tire. While the noise is reduced in general, also certain frequencies thereof is reduced, whereby the harshness of the tire is also reduced. This also affects grip of the tire, as a depth of the sipes needs not be reduced near segment seams, as well as stability, in particular when driving on a curved road.", "", "However, as detailed above, in such a case high bending stress is imposed to the primary lamella blades511. In order to withstand the high bending stress, a bending strength of the primary lamella blade511is greater than a bending stiffness of the secondary lamella blade512. Herein bending strength refers to strength against bending in the circumferential direction C of the mould200.", "", "The bending strength of the primary lamella blade511may be increased e.g. by using a stiffening member550. In contrast, a secondary lamella blade512may be free from such a stiffening member, but otherwise identical, as shown inFIGS.5aand5c. The bending strength can be increased in other ways, too (i.e. in the alternative or in addition), as will be detailed below.", "", "In view of what has been said above, an embodiment of a mould200for manufacturing a tire100comprises a plurality of segments (211,212,213,214,215,216,217,218) including a first segment211. The plurality of segments are configured to be in a first position (i.e. the closed position) and a second position (i.e. the open position). In the first position, the segments are arranged next to each other to form an annular mould for a green tire105. In the second position, the segments are arranged apart from each other to remove the tire100from the mould200.", "", "The first segment211comprises a first end221and an opposite second end222, as shown inFIGS.2ato2c. The first end221is arranged opposite the second end222in a circumferential direction C. The first segment211comprises a primary region231, the whole primary region231being arranged at most 20 mm apart from the first end221. This defines how “close” the primary lamella blade511, as discussed above, is from the first end221. The first segment211comprises a secondary region235, the whole secondary region235being arranged at least 25 mm apart from the first end221and the second end222. This defines how “far” the secondary lamella blade512, as discussed above, is from the first and second ends221,222. Reference is made toFIGS.2ato2c.", "", "In line with what has been said above, the first segment211comprises primary lamella blades511that are transversal (i.e. not circumferential) and arranged within the primary region231. The first segment211further comprises secondary lamella blades512that are transversal (i.e. not circumferential) and arranged within the secondary region235.", "", "As for the term “transversal” (i.e. not circumferential) within the context of this specification, a transversal lamella blade (511,512) is such a lamella blade that a direction of a length L of the lamella blade511,512does not form an angle of less than 30 degrees with a circumferential C direction of the first segment511.", "", "In contrast, in an embodiment where the first segment211comprises a circumferential ridge for forming a circumferential groove, the circumferential ridge extends primarily is such a direction that forms an angle of less than 30 degrees with the circumferential direction C. It is noted, that in such a case, the direction of extension of the circumferential ridge may form also an angle of more than 30 degrees with the circumferential direction C, because an intersection of two straight lines defines four angles, i.e. two pairs of equal angles, as well known.", "", "As an example,FIGS.5ato8d,10ato10c, and13aand13bshow lamella blades. Their lengths, L, are also shown in the figures. In general, a direction of the length L is perpendicular to a direction of the height h1, h2of the lamella blade511,512, respectively. Moreover, in general, a direction of the length L is perpendicular to a direction of the thickness t1, t2of the lamella blade511,512, respectively. As for the term “direction of a length”, it is noted that a length is measured (or defined) in a certain direction. The direction of the length refers to the direction in which the length is measured or defined. This applies mutatis mutandis to the direction of the height h1, h2and to the direction of the thickness t1, t2. As readable from the figures, a direction of thickness may depend on the position where the thickness is defined. Typically a “length” is greater than a thickness. The length of a sipe may be e.g. a distance between two ends of the sipe. Typically the height is defined (or measured) in the radial direction SR.", "", "Referring toFIGS.2aand2b, the primary lamella blades511comprise a first primary lamella blade521, and the secondary lamella blades512comprise a first secondary lamella blade531. Thus, even if the first segment211comprises multiple primary lamella blades511arranged in the primary region231, some structural details of one specific blade of those blades, i.e. the first primary lamella blade521will be detailed below. In a similar manner, even if the first segment211comprises multiple secondary lamella blades512arranged in the secondary region235, some structural details of one specific blade of those blades, i.e. the first secondary lamella blade531will be detailed below. Naturally all the primary lamella blades511may have the features detailed below for the one specific blade, i.e. the first primary lamella blade521.", "", "To improve the properties of the tire100manufacturable by the mould200, a height of primary lamella blades511arranged near the segments ends221,222substantially equals a height of secondary lamella blades512arranged far away the segments ends221,222. In more specific terms, an average of the heights h1of the primary lamella blades511is at least 75% of an average of the heights h2of the secondary lamella blades512. More specifically, an average of the heights h1of the primary lamella blades511is 75% to 125% of an average of the heights h2of the secondary lamella blades512. More preferably, an average of the heights h1of the primary lamella blades511is 90% to 110% of an average of the heights h2of the secondary lamella blades512. The heights are shown at least inFIGS.5a,5c,6a,7a, and7c. It is noted that when a lamella blade does not have a constant height, the height refers to the maximum height of that lamella blade, as shown inFIGS.5a,5c,6a,7a, and7c. The average height is calculated as usual; i.e. by calculating the sum of heights of the transversal lamella blades and dividing the sum by the number of transversal lamella blades (the average is calculated separately for the primary region231and for the secondary region235).", "", "To withstand the high bending stress, on the average, a bending strength of the primary lamella blades511against bending in a circumferential direction C of the mould200is greater than a bending strength of the secondary lamella blades512against bending in the circumferential direction C of the mould200.", "", "With respect to how a bending strength of the primary lamella blades511can be made greater than the bending strength of the secondary lamella blades512, there are at least three options, which are combinable.", "", "As a first option, to increase bending strength, the first primary lamella blade521may comprise a stiffening member550configured to strengthen the first primary lamella blade521against bending in the circumferential direction C of the mould200.", "", "A first example of a stiffening member550, the stiffening member being a stiffening ridge551, is shown inFIGS.5a,5b,5e,7a,7b,10a-10c, and13aand13b. The figures show a first primary lamella blade521comprising the stiffening ridge551. In contrast, the first secondary lamella blade531ofFIGS.5cand5ddoes not comprise the stiffening ridge551. The stiffening ridge is a ridge that protrudes from a wall of the lamella blade. The stiffening ridge is a ridge, which may protrude, from wall of the lamella blade, to a direction that is substantially perpendicular to a direction of length of the lamella blade. The stiffening ridge may protrude from a wall of the lamella blade to a direction that forms an angle of 20 to 160 degrees with a direction of the length of the first primary lamella blade512. The length of the first primary lamella blade512may be defined as a distance between two most distant end points of a projection of the first primary lamella blade512, the projection being to a plane having a normal to the direction of height of the first primary lamella blade512. Such a projection, and the length L, are shown inFIG.5b.", "", "Moreover, preferably the stiffening ridge551protrudes from the wall of the lamella blade to a direction that forms an angle of at most 30 degrees with the circumferential direction C. This has the effect that the stiffening ridge551supports the lamella blade particularly in the circumferential direction C. It is noted that the opening of the mould as discussed above generates forces to the lamella blades particularly in the circumferential direction; and particularly to transversal lamella blades. The term “transversal” has been defined above, and need not refer to exactly axial direction of the tire (or corresponding direction of the segment).", "", "For example, the first primary lamella blade521shown inFIGS.5aand5bis arranged to produce such a transversal sipe that a direction of a length of the sipe forms a right angle with the circumferential direction (seeFIG.5b). Moreover, as shown inFIG.5b, the stiffening ridge551protrudes from a wall of the lamella blade521to a direction that forms an angle of 90 degrees with a direction of the length L of the first primary lamella blade512. Furthermore, in such a case, the stiffening ridge551protrudes from the wall of the lamella blade to a direction that forms an angle of zero degrees with the circumferential direction C (seeFIG.5b).", "", "As another example, the first primary lamella blade521shown inFIG.5eis arranged to produce such a transversal sipe that a direction of a length L of the sipe forms an angle of 60 degrees angle with the circumferential direction C (seeFIG.5e). It is noted that inFIG.5e, the direction of a length L of the sipe also forms an angle of 120 degrees angle with the circumferential direction C; neither the angle 60 nor 120 degrees being less than 30 degrees in accordance with the definition of “transversal” (see above). Moreover, as shown inFIG.5e, the stiffening ridge551protrudes from a wall of the lamella blade521to a direction that forms angles of 60 degrees and 120 degrees with a direction of the length L of the first primary lamella blade512. Furthermore, inFIG.5e, the stiffening ridge551protrudes from the wall of the lamella blade to a direction that forms an angle of zero degrees with the circumferential direction C (seeFIG.5e).", "", "A lamella blade521may comprise only one stiffening member550as readable from above. However, referring toFIGS.13aand13b, a lamella blade521may comprise two stiffening members550, such as two stiffening ridges551. The stiffening ridges may be arranged on opposite sides of the lamella blade521as shown inFIGS.13aand13b. In the alternative or in addition, two stiffening ridges551may be arranged on a same side of a lamella blade521. A lamella blade521may comprise more than two stiffening members550(FIG.7a). Even if not shown, a lamella blade521may comprise more than two stiffening ridges551. Some or all of them may be arranged on one side of the lamella blade521. Some of them may be arranged on opposite sides of the lamella blade521.", "", "FIGS.10ato10cshow further embodiments of a stiffening ridge551. As shown inFIG.10a, an end of the stiffening ridge551may be rounded. However, the end need not be rounded as shown inFIG.5a. In both theFIGS.5aand10athe stiffening ridge becomes shorter in the inwards radial direction −SR (see the Figs). Moreover, inFIGS.5aand10a, the shortening takes place throughout the whole height h1of the primary lamella blade511. However, as shown inFIG.10c, the stiffening ridge551need not shorten at all. In contrast, a height (not shown) of the stiffening ridge551may be constant throughout the whole height h1of the primary lamella blade511. Thus, the stiffening ridge511may be seen as a part of the primary lamella blade511that locally thickens the primary lamella blade. As detailed below as a second option, the thickness of the whole primary lamella blade can be increased, too. Moreover, as shown inFIG.10b, the shortening of the stiffening ridge511in the inwards radial direction −SR may take place only on a part of the height of the primary lamella blade511.", "", "A second example of a stiffening member550is shown inFIGS.7ato7c. Therein the stiffening member550is a joint552(seeFIG.7a) that joins the first primary lamella blade521to a ridge611, wherein the ridge611is configured to form a groove. Referring toFIG.7c, the secondary lamella blades512need not comprise such a joint552. Referring toFIG.7b, the primary lamella blades511need not comprise such a joint552, e.g. if the first primary lamella blade521comprises a stiffening ridge551(as inFIG.7b), or comprises another joint that joins the first primary lamella blade521to a second ridge621for forming a groove. As detailed inFIG.7a, the first primary lamella blade521may comprise a first joint552that joins the first primary lamella blade521to a first ridge611for forming a groove, a second joint553that joins the first primary lamella blade521to a second ridge621for forming a groove, and a stiffening ridge551.", "", "A third example of a stiffening member550is shown inFIGS.8aand8b. Therein the stiffening member550is constructed as a fold554. As well known, a lamella blade also normally comprises bends. However, the fold554, which is intended for strengthening the lamella blade, changes the direction of extension of the projection of the lamella blade, as viewed in the direction of height of the lamella blade, more than a regular bend. Referring toFIG.8b, a projection of the lamella blade to a plane having a normal to the direction of height of the first primary lamella blade512extendstowards the fold554and to the fold554in a first direction dir1andaway from the fold554and from the fold554in a second direction dir2such thatan angle a between the first direction dir1and the second direction dir2is 60 to 120 degrees.", "", "Preferable, the fold554is also arranged to such a location that no bend of the projection of the first primary lamella blade512to a plane having a normal to the direction of height of the first primary lamella blade512is arranged between the fold and one of the ends of the projection; as shown inFIGS.8aand8b. As an example, inFIG.8b, there are two bends between the fold554and the upper end of the projection of the first primary lamella blade521, but no bend between the fold554and the lower end of the projection of the first primary lamella blade521. Thus, preferably, the first primary lamella blade521extends straight from the fold554to an end of the lamella blade, when viewed in the direction of the height of the first primary lamella blade521.", "", "For comparative purposes,FIGS.8cand8dshow a secondary lamella blade512not comprising a fold, but only comprising bends. As readable from the figures, the primary lamella blade511ofFIG.8acan be made by folding an end of a secondary lamella blade512ofFIG.8cto form the fold554.", "", "As a second option to increase bending strength, a thickness t1of the first primary lamella blade521can be chosen to be greater than a thickness t2of the first secondary lamella blade531. Thus, the first primary lamella blade521may be made from a thicker plate than the first secondary lamella blade531. As an example,FIGS.6aand6bshow a first primary lamella blade521of which thickness t1is greater than a thickness t2of the first secondary lamella blade531ofFIGS.5cand5d.", "", "A thickness of the lamella blade521or the lamella blade531needs not be constant. If the thickness is not constant, the thickness, as discussed above, refers to a maximum thickness of the lamella blade. Thus, the lamella blades ofFIGS.10band10cmay be seen as having a stiffening ridge551, or in the alternative, as having a greater thickness at a location of the stiffening ridge551than the comparative blade ofFIG.5c. Other possibilities for increasing thickness is to gradually increase a thickness e.g. from one end to the other in the direction of the length L of the lamella blade.", "", "As a third option, to increase bending strength, a strength of the material of the first primary lamella blade521may be selected to be greater than a strength of the material of the first secondary lamella blade531. The first primary lamella blade521may be made from material having a higher ultimate tensile strength than the material of the first secondary lamella blade531. The first primary lamella blade521may be made from more rigid material than the first secondary lamella blade531. As an example, the first primary lamella blade521may be made by an additive manufacturing method, which typically results in stronger material (i.e. material with higher ultimate stress) than normally used for making lamella blades. In an embodiment, at least one of the primary lamella blades511has been manufactured by an additive manufacturing technology.", "", "As an example, stainless steel, which is commonly used as material for a lamella blade, has a modulus of elasticity of about 190 GPa and an ultimate tensile strength of about 500 MPa. In contrast, an additively manufactured metal material, such as Ti-6Al-4V may have an ultimate strength of 1100 MPa. Some Cobalt-Chromium based metals manufactured by rapid prototyping also have an ultimate strength of over 900 MPa. Thus, in an embodiment, an ultimate tensile strength of the material of the first primary lamella blade521is at least 20% greater than an ultimate tensile strength of the material of the first secondary lamella blade531. In an embodiment, an ultimate tensile strength of the material of the first primary lamella blade521is at least 50% greater than an ultimate tensile strength of the material of the first secondary lamella blade531. Strength can be increased by other material selections, too.", "", "As discussed above, the first segment211comprises the primary region231, and primary lamella blades511that are transversal are arranged within the primary region231. As shown inFIG.9a, which shows in more detail a part of Fib.2b, the primary lamella blades511include the first primary lamella blade521and a second primary lamella blade522. In a similar manner, the first segment211comprises the secondary region235, and secondary lamella blades512that are transversal are arranged within the secondary region235. As shown inFIG.9a, the secondary lamella blades512include the first secondary lamella blade531and a second secondary lamella blade532.", "", "To further improve the handling of the tire100, the lamella blades are arranged to the first segment211such a distance between the lamella blades near the first segment end221is the same as further away from the first segment end221and away from the second segment end222. Herein the distance refers to the distance between adjacent lamella blades as measured between their central lines CL, which central lines CL are perpendicular both to the height (h1, h2) and the thickness (t1, t2). The central line CL of each lamella blade remains at a centre between two walls of the lamella blade, wherein both of the two walls have a normal to direction of the thickness t1, t2of that lamella blade. Examples of central lines CL have been shown inFIGS.5b,5d, and5e. The distances d1and d2are shown inFIGS.9band9c.", "", "Thus, in an embodiment, the primary lamella blades511comprise a second primary lamella blade522adjacent to the first primary lamella blade521and the secondary lamella blades512comprise a second secondary lamella blade532adjacent to the first secondary lamella blade531. Moreover, a first distance d1(seeFIG.9b) between the central line CL of the first primary lamella blade521and the central line CL of the second primary lamella blade522is equal to a second distance d2(seeFIG.9c) between the central line CL of the first secondary lamella blade531and the central line CL of the second secondary lamella blade532.", "", "Hereinabove the term “adjacent” means that the second primary lamella blade522, which is “adjacent” to the first primary lamella blade521is such a lamella blade that no other lamella blade (or ridge for a groove) is arranged between the second primary lamella blade522and the first primary lamella blade521. Moreover, the second primary lamella blade522is adjacent in the circumferential direction C to the first primary lamella blade521. Thus, at least one circumferential curve, which is parallel to the circumference, intersects both the second primary lamella blade522and the first primary lamella blade521in such a way that the circumferential curve does not intersect another lamella blade or a ridge for a groove between the second primary lamella blade522and the first primary lamella blade521. These definitions apply mutatis mutandis to the second secondary lamella blade532, which is adjacent to the first secondary lamella blade531.", "", "It is also noted that typically a tread pattern, i.e. the shape of the tread, is formed of pitches. Pitches are repeating parts of tread. A pitch may comprise e.g. only one such tread block that is part of an inner-side shoulder area of the tread. A pitch may comprise two such tread blocks that are part of an inner-side shoulder area of the tread. A pitch may comprise three such tread blocks that are part of an inner-side shoulder area of the tread. A pitch may comprise one, two, or three tread blocks that are part of an inner-side shoulder area of the tread and one, two, or three tread blocks that are part of an outer-side shoulder area of the tread. A tread may comprise e.g. 60 to 150 shoulder blocks on both inner and outer sides of the tread. More typically, a tread comprises e.g. 60 to 90 shoulder blocks on both inner and outer sides of the tread. Herein the terms inner and outer are used also for such tires that are not asymmetric tires. In use, one of the sides of the tread is implicitly an inner side and one side is the outer side even if the tire is a directional tire with a predefined direction of rotation R. A pitch may consist of an elementary portion or a pitch may comprise two or three elementary portions, an elementary portion comprising only one shoulder block per side or only one shoulder block on a side and extending towards the other side but not throughout the width of the tread. The elementary portions may be selected from one, two, three, four, five, or more than five different types of elementary portions. As an example, the elementary portions may be selected from a group of “large”, “small”, and “intermediate”. As another example, the elementary portions may be selected from a group of “large”, “large-intermediate”, “intermediate”, “small-intermediate”, and “small”.", "", "To clarify,FIG.4ashows a large elementary portion LP (with four sipes on a shoulder block on the right side) and a small elementary portion SP (with three sipes on a shoulder block on the right side); and a pitch (not shown) could be formed of the two elementary portions LP, SP; or a pitch could consist of either one of the elementary portions LP or SP; or a pitch could comprise both LP and SP and a further elementary portion.", "", "A pitch need not comprise a shoulder block of both sides of the tread. Instead a pitch may extend from a side of the tread e.g. up to circumferential groove (or some other intermediate point between the sides of the tread), and another pitch may extend from that point to the other side of the tread.", "", "In different types of elementary portions, the distance between adjacent sipes may be different. In a similar way, a distance between all adjacent lamella blades need not be equal.", "", "The lamella blades are used to form sipes to the tread110by pressing the lamella blades into the tread of the green tyre105and removing the lamella blades from the vulcanized tire100(seeFIGS.1ato1d). Referring toFIGS.3ato4b, a tread110of a tire100typically comprises also a groove390. The tread110may comprise a circumferential groove (or several circumferential grooves) and a transverse grooves.FIGS.3ato4bshow a groove390, which is circumferential. Referring toFIGS.2aand2bsuch a groove390(circumferential or transverse) is also formed by the mould200. Therefore, referring toFIG.2b, in an embodiment, the first segment211comprises a primary ridge611for forming a first part391of a groove390(circumferential or transverse). The primary ridge611is arranged in the primary region231.FIGS.3aand3bshow the first part391of the groove390manufacturable by the primary ridge611. A more realistic figure of a primary ridge611is shown inFIGS.7ato7c. These figures show both a first primary ridge611and a second primary ridge621.", "", "In the embodiment, the first segment211further comprises a secondary ridge615for forming a second part392, which second part392is a second part392of the groove390or a second part392of another groove. The secondary ridge615is arranged in the secondary region235.FIGS.3aand3bshow the second part392of the groove390manufacturable by the secondary ridge615. A more realistic figure of a secondary ridge615is shown inFIGS.7ato7c. These figures show both a first secondary ridge615and a second secondary ridge625. To improve handling of the tire100, an average depth of the first part391of the groove (e.g. circumferential groove390or transverse groove392,394,395,396) equals an average depth of the second part392of the groove or another groove (e.g. circumferential groove390or transverse groove392,394,395,396). Correspondingly, in the mould200, an average height of the secondary ridge615equals an average height of the primary ridge611. The height is defined in the radial direction SR.FIGS.7aand7bshow the height h3of the primary ridge611andFIG.7cshows the height h4of the secondary ridge615.", "", "Preferably this applies to at least a circumferential groove390. Thus, in an embodiment, an average depth of the first part391of a circumferential groove390equals an average depth of the second part392of the groove390. Correspondingly, in the mould200, an average height of the secondary circumferential ridge615equals an average height of the primary circumferential ridge611.", "", "Moreover, to ensure that the sipes of the tire soften the material of the tire also for a substantial amount of wear, in an embodiment, an average of the heights h1of the primary lamella blades511is 45% to 95% of the average of the height h3of the primary ridge611(seeFIG.7a). In an embodiment, the average of the heights h1of the primary lamella blades511is 65% to 90% of the average of the height h3of the primary ridge611(seeFIG.7a). In an embodiment, the height h3of the primary ridge611is constant in the direction of the length of the primary ridge611(i.e. independent of location in the longitudinal direction). In an embodiment, the height of the secondary ridge615is constant in the direction of length of the secondary ridge615(i.e. independent of location in the longitudinal direction). Such an arrangement is facilitated by the fact that the primary lamella blades511are more or less as deep as the secondary lamella blades512, as discussed in more detail above.", "", "A gist of the present embodiments is that the primary lamella blades511have a higher bending strength than the secondary lamella blades512. As detailed above, this may be achieved only by material selection for the primary lamella blades511.", "", "However, in an embodiment, the first primary lamella blade521(i.e. one of the primary lamella blades511)comprises a one or more stiffening members550configured to strengthen the first primary lamella blade521against bending in the circumferential direction C of the mould, examples of stiffening members550including a stiffening ridge, a joint, and a fold, as discussed above, and/oris thicker than one of the secondary lamella blades512, as shown inFIGS.6aand6b.", "", "Moreover, in that embodiment, preferably none the secondary lamella blades512is identical in shape and thickness to the first primary lamella blade521. A secondary lamella blade512, e.g. that ofFIGS.5cand5dmay have the same thickness as the first primary lamella blade521of e.g.FIGS.5aand5b. However, the shape is different. A secondary lamella blade512, e.g. that ofFIGS.5cand5dmay have a smaller thickness t2than the first primary lamella blade521t1of e.g.FIGS.6aand6b. However, the shape may be otherwise similar.", "", "The mould200is used to manufacture a tire100as shown inFIGS.1ato1d. The lamella blades511,512form sipes. The shape of the sipes thus correspond to the shape of the lamella blades. The shape may be considered as mirror-symmetric mainly because the tread110of the tire is viewed from different direction than the mould200. For example, a tread110can only be seen, when viewed from outside, towards the centre, in the negative radial direction −SR. In contrast, the mould200or the first segment211thereof can be viewed from the centre O (seeFIG.1c) outwards, in the positive radial direction +SR. For these reasons, the tread pattern ofFIGS.3aand3bare mirror images of the lamella blades and ridges for grooves ofFIGS.2band2c, respectively.", "", "Thus, an embodiment of the invention is a tire100, which is manufacturable by the mould200as detailed above.", "", "In more specific terms and with reference toFIGS.3ato4b, an embodiment of the invention is a tire100that comprises a first side wall102, a second side wall104, and a tread110. Because the tire100has been manufactured by the mould200as detailed above, the tire100comprises a first segment seam411extending between the first side wall102and the second side wall104. As shown inFIGS.3aand4a, the first segment seam411may extend straight between the first side wall102and the second side wall104. As shown inFIGS.3band4b, the first segment seam411need not extend straight between the first side wall102and the second side wall104. This applies to other segments seams412,413as well.", "", "As detailed above, the first segment211comprises a primary region231and a secondary region235. Likewise, the tread110of the tire, which has been made by the mould200, comprises a primary area111and a secondary area115, of which at least a part of the primary area111corresponds to the primary region231and the secondary area115corresponds to the secondary region235. Another part of the primary area111may be produced by an end of another segment as will be discussed in connection withFIGS.11ato12c.", "", "The whole primary area111is arranged at most 20 mm apart from the first segment seam411and the whole secondary area115is arranged at least 25 mm apart from the first segment seam411. In an embodiment, the primary area111comprises a part of the first segment seam411. Moreover, the primary area111is provided with primary sipes311, and the secondary area115is provided with secondary sipes315. Referring toFIGS.3aand3b, in an embodiment, the primary sipes311comprise a first primary sipe321and a second primary sipe322. Referring toFIGS.3aand3b, in an embodiment, the secondary sipes315comprise a first secondary sipe331and a second secondary sipe332. As detailed in connection with the mould, the primary sipes311are not circumferential sipes (i.e. they are transversal sipes) and the secondary sipes315are cot circumferential sipes (i.e. they are transversal sipes). In line with what has been said for the lamella blades, a transversal sipe is such a sipe that a direction of a length of the sipe (311,315) does not form an angle of less than 30 degrees with a circumferential C direction of the tread110. In contrast, a circumferential groove (if present in the tire, e.g. the groove390) extends primarily in such a direction that forms an angle of less than 30 degrees with the circumferential direction C. What has been said about the angles in connection with lamella blades applies mutatis mutandis to the sipes.", "", "In the primary area111the primary sipes311are substantially as deep as the secondary sipes315of the secondary area115. Thus, an average of the depths of the primary sipes311is at least 75% of an average of the depths of the secondary sipes315. Preferably, an average of the depths of the primary sipes311is 75% to 125% of an average of the depths of the secondary sipes315. More preferably, an average of the depths of the primary sipes311is 90% to 110% of an average of the depths of the secondary sipes315. When a depth of a sipe is not constant, a depth of the sipe refers to its maximum depth. The average is calculated as usual. Reference is made to what has been said in connection with the first segment211.", "", "As detailed above, in an embodiment, (i) at least one of the primary sipes311has been produced by a lamella blade that comprises a stiffening member550strengthening the lamella blade in a circumferential direction of the tire100and/or (ii) a width of at least one of the primary sipes311is greater than a width of one of the secondary sipes315. As a results of the manufacturing method, a width of a sipe equals to a thickness t1, t2of the lamella blade used to form the sipe. In an embodiment, (iii) at least one of the primary sipes311has been produced by a lamella blade that comprises material having higher ultimate tensile strength than the material of the lamella blades used for producing the secondary sipes315.", "", "Concerning the first option (i), several different types of stiffening members550have been discussed in the context of the first segment211. Presence of such a stiffening member500, e.g. a stiffening ridge551, a joint552,553, or a fold554, is observable from the shape of at least one of the primary sipes311. Concerning the second option (ii), even if a stiffening member was not used, the width of at least one of the primary sipes311being greater than a width of one of the secondary sipes315is indicative of the at least one of the primary sipes311having been produced by a thick lamella blade, which, as disclosed above, has a higher bending strength than a thinner lamella blade. Naturally, one or more of the primary sipes311may be both thick and have such a shape that the shape is indicative of the sipe having been produced by a lamella blade that comprises a stiffening member strengthening the lamella blade in a circumferential direction of the tire100.", "", "As detailed in the context of the first segment211, preferably the distance d1between two adjacent primary lamella blades511(e.g. the blades521,522inFIG.9bequals the distance d2between two adjacent secondary lamella blades512(e.g. the blades531,532inFIG.9c. This applies to the tread110of the tire100as well.", "", "Thus, in an embodiment, the primary sipes311comprise a first primary sipe321and a second primary sipe322adjacent to the first primary sipe321and the secondary sipes315comprise a first secondary sipe331and a second secondary sipe332adjacent to the first secondary sipe331. Such sipes, which are also adjacent to each other, are shown e.g. inFIGS.3aand3b. Moreover, preferably, a distance between a central line of the first primary sipe321and a central line of the second primary sipe322is equal to a distance between a central line the first secondary sipe331and a central line of the second secondary sipe332.", "", "Hereinabove the term “adjacent” means that the second primary sipe322, which is “adjacent” to the first primary sipe321is such a sipe that no other sipe (or groove) is arranged between the second primary sipe322and the first primary sipe321. Moreover, the second primary sipe322, is adjacent in the circumferential direction C to the first primary sipe321. Thus, at least one circumferential curve, which is parallel to the circumference, intersects both the second primary sipe322and the first primary sipe321in such a way that the circumferential curve does not intersect another sipe or a groove between the second primary sipe322and the first primary sipe321. These definitions apply mutatis mutandis to the second secondary sipe332, which is adjacent to the first secondary sipe331.", "", "As detailed above, in an embodiment, the first segment211comprises a primary ridge611for forming a first part391of a groove390,393,394,395,396and a secondary circumferential ridge615for forming a second part392, the second part392being a second part392of the groove (390,393,394,395,396) or a second part392of another groove (393,394,395,396,390). Thus, in an embodiment of the tire100, the primary area111comprises a first part391of a groove390,393,394,395,396and the secondary area115comprises a second part392of the groove or another groove (seeFIGS.3aand3b). Moreover, to have good properties, the depth of the groove390does not vary in the direction of length of the groove (i.e. longitudinal direction of the groove). Thus, an average depth of the first part391of the groove390equals an average depth of the second part392(of the groove or of the other groove). It is noted that a depth of the first part391of the groove corresponds to the height h3of the primary ridge611and a depth of the second part392groove corresponds to the height h4of the secondary ridge615(seeFIGS.7ato7c).", "", "The groove need not be circumferential. In the alternative, the groove may be transversal.", "", "Moreover, to ensure that the sipe functions as intended also when the tire wears, in an embodiment, an average of the depths of the primary sipes211is 45% to 95% of the average depth of the first part391of the groove390,393,394,395,396(circumferential groove or transversal groove). A depth of a primary sipe211corresponds to the height h1of the primary lamella blade511by which the primary sipe211is manufactured. Preferably, an average of the depths of the primary sipes211is 65% to 90% of the average of the average depth of the first part391of the groove.", "", "In general, a width of a sipe of the secondary region (i.e. a “normal”) sipe may be in the range 0.3 mm to 1.2 mm. However, the width may depend on the type of the tire. In a tire for a passenger car, the width may be e.g. 0.3 mm to 0.8 mm, such as 0.4 mm to 0.6 mm. In a tire for a car other than a passenger car, e.g. light truck, the width may be e.g. 0.5 mm to 1.2 mm, such as 0.6 mm to 1.0 mm.", "", "Thus, in an embodiment, a width of a secondary sipe315is 0.3 mm to 1.2 mm, such as 0.4 mm to 1.0 mm. Thus, in an embodiment, an average of the widths of the secondary sipes315is 0.3 mm to 1.2 mm, such as 0.4 mm to 1.0 mm.", "", "In an embodiment, the tire100is configured to be used on a wheel of a passenger car and a width of a secondary sipe315is 0.3 mm to 0.8 mm, such as 0.4 mm to 0.6 mm. Thus, in an embodiment, the tire100is configured to be used on a wheel of a passenger car and an average of the widths of the secondary sipes315is 0.3 mm to 0.8 mm, such as 0.4 mm to 0.6 mm.", "", "In an embodiment, the tire100is generally intended to be used in a wheel other than a passenger car wheel and a width of a secondary sipe315is 0.5 mm to 1.2 mm, such as 0.6 mm to 1.0 mm. Thus, in an embodiment, the tire100is configured to be used in a wheel other than a passenger car wheel, e.g. a wheel of a light truck, and an average of the widths of the secondary sipes315is 0.5 mm to 1.2 mm, such as 0.6 mm to 1.0 mm.", "", "Correspondingly, a thickness t2of a secondary lamella blade512may be 0.3 mm to 1.2 mm, such as 0.3 mm to 0.8 mm, such as 0.4 mm to 0.6 mm; or such as 0.5 mm to 1.2 mm, such as 0.6 mm to 1.0 mm.", "", "Moreover, a thickness t1of a primary lamella blade511may be 0.3 mm to 1.2 mm, such as 0.3 mm to 0.8 mm, such as 0.4 mm to 0.6 mm; or such as 0.5 mm to 1.2 mm, such as 0.6 mm to 1.0 mm.", "", "However, in an embodiment, the primary lamella blades511by which the primary sipes311have been made are thicker. Therefore, in an embodiment, a width of the first primary sipe321is at least 5% greater, preferably at least 10% greater, than a width of the first secondary sipe331. In an embodiment, an average of the widths of the primary sipes311is at least 5% greater, preferably at least 10% greater, than an average of the widths of the secondary sipes315.", "", "Thus, a thickness t1of a primary blade511may be at least 5% or at least 10% greater than a thickness t2of a secondary lamella blade512. This applies also when the thickness t2of a secondary lamella blade512is within the limits disclosed above.", "", "In an embodiment of the tire, the primary sipes311comprise a first primary sipe321. The first primary sipe has been produced by a primary lamella blade511, such as the first primary lamella blade521discussed above. Thus, in an embodiment, a shape of the first primary sipe321is indicative of the first primary sipe321having been manufactured by using a primary lamella blade511comprising a stiffening member550configured to strengthen the primary lamella blade511against bending in a circumferential direction C of the tire. Examples of stiffening members have been disclosed above.", "", "In a preferable embodiment, the secondary sipes315have not been produced by using lamella blades comprising a stiffening member; or secondary sipes315have been produced by using lamella blades that are thinner than the lamella blades used to form the primary sipes311. Thus, preferably, the primary sipes311comprise a first primary sipe321and none the secondary sipes315is identical in shape and width to the first primary sipe321. Also in this case, a shape of the first primary sipe321is indicative of the first primary sipe321having been manufactured by using a primary lamella blade511comprising a stiffening member550.", "", "A first example of a stiffening member550is the stiffening ridge551, detailed above in connection with the lamella blade. In an embodiment, the first primary sipe321is indicative of the first primary sipe321having been manufactured by using a primary lamella blade511comprising a stiffening ridge551, and none of the secondary sipes315have a shape indicative of the secondary sipe315having been manufactured by using a lamella blade comprising a stiffening ridge. Thus, in an embodiment, a shape of the first primary sipe321is indicative of the first primary sipe321having been manufactured by using a primary lamella blade511comprising at least a stiffening ridge551. Moreover, in an embodiment, none of the secondary sipes315has such a shape that would be indicative of a secondary sipe315having been manufactured by using a lamella blade comprising a stiffening ridge551.", "", "A second example of a stiffening member550is a joint552,553joining the lamella blade to a ridge611,621forming a groove (e.g. for forming a transversal groove or a circumferential groove). Correspondingly, in an embodiment, the first primary sipe321extends to a groove, preferably a circumferential groove, at one end. In an embodiment, the first primary sipe321extends from one groove, preferably a circumferential groove, to another groove. Thus, in an embodiment, a shape of the first primary sipe321is indicative of the first primary sipe321having been manufactured by using a primary lamella blade511comprising (i) a joint552connecting the primary lamella blade511to a ridge611,621for forming a groove (e.g. circumferential groove) or (ii) a first joint552connecting the primary lamella blade511to a first ridge611for forming a groove (e.g. circumferential groove) and a second joint552connecting the primary lamella blade511to a second ridge621for forming a groove.", "", "A third example of a stiffening member550is a fold554. Correspondingly, in an embodiment, when viewed from top, the first primary sipe321extends to a fold554in a first direction dir1and from the fold554in a second direction dir2such that an angle between the first direction dir1and the second direction dir2is 60 to 120 degrees. Preferably, the when viewed from top, the first primary sipe321extends straight from the fold554to an end of the primary sipe321, which may be a groove.", "", "As detailed above in connection with the mould200, the mould200comprises multiple segments. Thus, an embodiment of the tire100comprises multiple segment seams411,412,413. As discussed above, in the tire100, the whole secondary area115is arranged at least 25 mm apart from the first segment seam411. However, the secondary area115may refer to such an area that has been produced by the secondary region235of the first segment211of the mould. In such a case, the secondary area115of the tire refers to such an area that is far away from all the segments seams of the tire. Moreover, preferably, the lamella blades near the ends of other segments (212,213,214,215,216,217,218) are made stronger in a manner similar to how the primary lamella blades511near the ends221,222of the first segment211are made stronger. Also for this reason, preferably, the secondary area115is not near any other segment seam412,413either.", "", "Thus, in an embodiment, the tire100comprises a second segment seam412extending between the first sidewall102and the second side wall104and the whole secondary area115is arranged at least 25 mm apart both from the first segment seam411and from the second segment seam412. In an embodiment, the tire comprises multiple segment seams (411,412,413), such as at least six segment seams, each extending between the first side wall102and the second side wall104, and the whole secondary area115is arranged at least 25 mm apart from all the segment seams (411,412,413) of the tire100.", "", "It is also noted that a tire designer needs to take into account various aspects in addition to handling and handling of worn tire. These aspects include grip, noise, vibrations, harshness, and stability, as detailed above. In the design process, the tire designer has some options for designing the tire tread110. However, when applying these principles, it may happen that the tire tread110needs to comprise at least a sipe that extends on both sides of the first segment seam411. Such an example is shown inFIG.11a. As shown inFIG.11a, the primary sipes311comprise a first primary sipe321. As detailed above, the primary sipes311are arranged within the primary area111. The first primary sipe321extends on both sides of the first segment seam411and across the first segment seam411.", "", "FIG.11bshows the first primary sipe321ofFIG.11ain more detail. As shown therein, the tread110comprises the first segment seam411and the first primary sipe321, wherein a first part321aof the first primary sipe321is arranged on a first side S1of the first segment seam411and a second part321bof the first primary sipe321is arranged on a second side S2of the first segment seam411. The first primary sipe321extends across only the first segment seam411. In other words, along a shortest path of the circumference of the tire100, in between the first side S1of the first segment seam411and the second side S2of the first segment seam411is arranged only the first segment seam411and no other segment seam.", "", "Because the parts321a,321bof the first primary sipe321are produced by lamella blades near ends of two different mould segments, what has been said above about primary sipes311applies to each one of the parts321aand321b.", "", "Therefore, in this casethe first part321aof the first primary sipe321has been produced by a lamella blade that comprises a stiffening member strengthening the lamella blade in a circumferential direction of the tire100and the second part321bof the first primary sipe321has been produced by a lamella blade that comprises a stiffening member strengthening the lamella blade in a circumferential direction of the tire100, ora width of the first part321aof the first primary sipe321is greater than a width of one of the secondary sipes315and a width of the second part321bof the first primary sipe321is greater than a width of one of the secondary sipes315, orthe first part321aof the first primary sipe321has been produced by a lamella blade that comprises a stiffening member strengthening the lamella blade in a circumferential direction of the tire100and a width of the second part321bof the first primary sipe321is greater than a width of one of the secondary sipes315.", "", "These alternatives are not exclusive. Primary sipes311(in particular the parts321a,321b) may have a greater width than the secondary sipes315and also a shape indicative of being produced by a lamella blade having a stiffening member.", "", "The first part321aof the first primary sipe321may be made by using a primary lamella blade511as discussed above (however, a shorter one to make only a part of the sipe). The second part321bof the first primary sipe321may be made by using a lamella blade that is similar to a primary lamella blade511as discussed above (however, a shorter one to make only a part of the sipe).", "", "In particular, the first part321aof the first primary sipe321may be made by using a first primary lamella blade521of a first segment211and the second part321bof the first primary sipe321may be made by using a primary tertiary lamella blade545of a second segment212; such segments being discussed below.", "", "Such a tire100can be made by a mould200comprising an arrangement of (at least) two mould segments: the first mould segment211as discussed above and a second mould segment212, as shown inFIG.12a. InFIG.12a, the mould is in an open position. As discussed above and shown inFIG.12a, the first segment211comprises the first end221and the opposite second end222. The first segment211comprises the primary region231, the whole primary region231being arranged close to the first end221as discussed above. The first segment211comprises the secondary region235, which is arranged far from the first end221and the second end222in line with what has been discussed.", "", "Referring toFIG.12a, the second segment212(i.e. the second mould segment212) comprises a first end223of the second segment212and a second end224of the second segment212. The reference numerals inFIG.12ahave been drawn so that a first end of a segment faces a first end of an adjacent segment. Thus, when an even number of segments is used, a second end of a segment faces a second end of an adjacent segment (not shown).FIG.12bshows the detail XIIb of the arrangement ofFIG.12ain more detail.", "", "The second segment212comprises a tertiary region241, the whole tertiary region241being arranged close to the first end first end223of the second segment212as discussed above for the primary region231of the first segment211mutatis mutandis. It is noted that the second segment212comprises a quaternary region245, which is arranged far from the first end223of the second segment212and the second end224of the second segment212in line with what has been discussed for the secondary region235of the first segment211mutatis mutandis.", "", "The first segment211comprises primary lamella blades511that are transversal and arranged within the primary region231. The primary lamella blades511comprise the first primary lamella blade521as detailed above.", "", "The second segment212comprises tertiary lamella blades541that are transversal and arranged within the tertiary region241. The tertiary lamella blades541comprise a first tertiary lamella blade545. What has been said above for the first primary lamella blade521of the first segment211applies to the first tertiary lamella blade545of the second segment212.", "", "Moreover, as shown inFIG.12c, the first and second segments211,212are configured such that when the mould200is in the closed position, the first end221of the first segment211contacts the first end223of the second segment212. Moreover, the first tertiary lamella blade545is configured to form the second part321bof the first primary sipe321and the first primary lamella blade521is configured to form the first part321aof the first primary sipe321, wherein the first primary sipe321extends from the first part321ato the second part321bcontinuously.", "", "In an embodiment corresponding to the first option (see above) the first primary lamella blade521comprises a stiffening member550and the first tertiary lamella blade545comprises a stiffening member550. Different embodiments of stiffening members550have been discussed above and shown e.g. inFIGS.5a,5b,7a,7b,8a, and8b.", "", "In an embodiment corresponding to the second option (see above) a thickness t1of the first primary lamella blade521is greater than a thickness t2of the first secondary lamella blade531and a thickness of the first tertiary lamella blade545is equal to the thickness t1of the first primary lamella blade521.", "", "In an embodiment corresponding to the third option (see above) an ultimate tensile strength of the material of the first primary lamella blade521is greater than an ultimate tensile strength of the material of the first secondary lamella blade531and an ultimate tensile strength of the material of the first tertiary lamella blade545equals the ultimate tensile strength of the material of the first primary lamella blade521.", "", "It is also possible to strengthen the first primary lamella blade521by a stiffening member and to strengthen the first tertiary lamella blade545by increasing its thickness and/or using stronger material. Likewise, it is possible to strengthen the first primary lamella blade521by increasing its thickness and to strengthen the first tertiary lamella blade545by using a stiffening member and/or using stronger material. Likewise, it is possible to strengthen the first primary lamella blade521by using stronger material and to strengthen the first tertiary lamella blade545by using a stiffening member and/or by increasing thickness.", "", "As detailed above, sipes are especially effective in improving grip. Therefore, in an embodiment, the mould comprises a first marking configured to press, to the tire100, a second marking, the second marking being indicative of the tire100being suitable for use as a winter tire. Such a second marking may be e.g. “M+S” indicating that the tire is suitable for use on mud and snow. In an embodiment, the tire100comprises the second marking indicative of the tire100being suitable for use as a winter tire.", "", "In addition or alternatively, a winter tire may comprise studs for improving grip. Thus, in an embodiment, the tread110of the tire100is equipped with studs for improving grip. In an embodiment, at least one of the segments on the mould comprises rods for making blind holes to the tread of the tire, which blind holes are configured to receive studs for improving grip of the tire."], "claims": ["1 - 15 . (canceled)", "a first side wall; a second side wall; a tread comprising a primary area and a secondary area; and a first segment seam extending between the first and second side walls; wherein: the whole primary area is arranged at most 20 mm apart from the first segment seam, the whole secondary area is arranged at least 25 mm apart from the first segment seam, the primary area comprises primary sipes that are non-circumferential, and the secondary area comprises secondary sipes that are non-circumferential, an average of depths of the primary sipes is 75% to 110% of an average of depths of the secondary sipes, and at least one of the primary sipes comprises a lamella blade shaped primary sipe, wherein the lamella blade comprises a stiffening member strengthening the lamella blade in a circumferential direction of the tire and/or a width of at least one of the primary sipes is greater than a width of one of the secondary sipes.", "the primary area comprises a first part of a groove; and an average of the depths of the primary sipes is 45% to 95% of the average depth of the first part of the groove.", "the primary sipes comprise a first primary sipe; the secondary sipes comprise a first secondary sipe; and a width of the first primary sipe is at least 5% greater than a width of the first secondary sipe.", "the primary sipes comprise a first primary sipe; and a shape of the first primary sipe corresponds to a primary lamella blade comprising a stiffening member configured to strengthen the primary lamella blade against bending in a circumferential direction of the tire.", "a joint connecting the primary lamella blade to a ridge for forming a groove, a joint connecting the primary lamella blade to a circumferential ridge for forming a circumferential groove, a first joint connecting the primary lamella blade to a first ridge for forming a first groove and a second joint connecting the primary lamella blade to a second ridge for forming a second groove, a fold, wherein the primary lamella blade extends to the fold in a first direction and from the fold in a second direction such that an angle between the first direction and the second direction is 60 to 120 degrees, a fold, wherein the primary lamella blade extends to the fold in a first direction and from the fold in a second direction such that an angle between the first direction and the second direction is 60 to 120 degrees, and the primary lamella blade extends straight between the fold and an end of the primary lamella blade, a stiffening ridge that protrudes from a wall of the first primary lamella blade to strengthen the first primary lamella blade.", "the primary sipes comprise a first primary sipe; and none of the secondary sipes is identical in shape and width to the first primary sipe.", "the primary sipes comprise a first primary sipe and a second primary sipe adjacent to the first primary sipe, the secondary sipes comprise a first secondary sipe and a second secondary sipe adjacent to the first secondary sipe, and a distance between a central line of the first primary sipe and a central line of the second primary sipe is equal to a distance between a central line of the first secondary sipe and a central line of the second secondary sipe, wherein: the central line of each sipe remains at a center between two walls of the sipe.", "a second segment seam extending between the first side wall and the second side wall, wherein: the whole secondary area is arranged at least 25 mm apart from the second segment seam.", "a plurality of segments including a first segment, the plurality of segments configured to be in a first position and a second position, wherein in the first position, the segments are arranged next to each other to form an annular mould for a green tire, and wherein in the second position, the segments are arranged apart from each other to remove the tire from the mould, the first segment comprising: a first end and an opposite second end, a primary region, the whole primary region being arranged at most 20 mm apart from the first end, a secondary region, the whole secondary region being arranged at least 25 mm apart from the first end and the second end, primary lamella blades arranged within the primary region and are non-circumferential, and secondary lamella blades that are arranged within the secondary region and non-circumferential, wherein: the primary lamella blades comprise a first primary lamella blade, the secondary lamella blades comprise a first secondary lamella blade, an average of heights of the primary lamella blades is 75% to 110% of an average of heights of the secondary lamella blades, and a bending strength of the primary lamella blades against bending in a circumferential direction of the mould is greater than a bending strength of the secondary lamella blades against bending in the circumferential direction of the mould.", "the first primary lamella blade comprises a stiffening member configured to strengthen the first primary lamella blade against bending in the circumferential direction of the mould; or a thickness of the first primary lamella blade is greater than a thickness of the first secondary lamella blade; or an ultimate tensile strength of the material of the first primary lamella blade is greater than an ultimate tensile strength of the material of the first secondary lamella blade.", "a primary ridge for forming a first part of a groove, the primary ridge arranged in the primary region, and the average of the heights of the primary lamella blades is from 45% to 95% of the average of the height of the primary ridge.", "the first primary lamella blade is thicker than one of the secondary lamella blades or comprises a stiffening member configured to strengthen the first primary lamella blade against bending in the circumferential direction of the mould, and none of the secondary lamella blades is identical in shape and thickness to the first primary lamella blade.", "the first primary lamella blade comprises a stiffening member configured to strengthen the first primary lamella blade against bending in the circumferential direction of the mould.", "a joint connecting the first primary lamella blade to a ridge for forming a groove, a joint connecting the first primary lamella blade to a circumferential ridge for forming a circumferential groove, a first joint connecting the first primary lamella blade to a first ridge for forming a first groove and a second joint connecting the first primary lamella blade to a second ridge for forming a second groove, a fold, wherein the first primary lamella blade extends to the fold in a first direction and from the fold in a second direction such that an angle between the first direction and the second direction is 60 to 120 degrees, and the first primary lamella blade extends straight between the fold and an end of the first primary lamella blade, a stiffening ridge that protrudes from a wall of the first primary lamella blade to strengthen the first primary lamella blade.", "the primary lamella blades comprise a second primary lamella blade adjacent to the first primary lamella blade, the secondary lamella blades comprise a second secondary lamella blade adjacent to the first secondary lamella blade, and a distance between a central line of the first primary lamella blade and a central line of the second primary lamella blade is equal to a distance between a central line of the first secondary lamella blade and a central line of the second secondary lamella blade, wherein: the central line of each lamella blade remains at a center between two walls of the lamella blade.", "31 . The mould of claim 24 , wherein at least one of the primary lamella blades comprises additive manufactured lamella blade.", "32 . A tire manufacturable by the mould of claim 24 ."], "bibtex": "@patent{20240294039,\n    title = {TIRE AND A MOULD FOR MANUFACTURING A TIRE},\n    number = {20240294039},\n    year = {2024},\n    note = {File: US20240294039A1-20240905.XML}\n    }", "classification": "B60C1112FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240294040", "filename": "US20240294040A1-20240905.XML", "abstract": "The pneumatic tire comprises a carcass and a pair of bead portions each with a bead core and a bead apex. The carcass comprises a carcass ply having a pair of turned-up portions and a main portion therebetween. At least one of the bead portions 4 is provided with a bead reinforcing rubber disposed on the axially outside of the turned-up portion. The bead reinforcing rubber comprises an axially outer first reinforcing rubber layer and an axially inner second reinforcing rubber layer. The complex elastic modulus of the second reinforcing rubber layer is smaller than the complex elastic modulus of the first reinforcing rubber layer.", "detailed_description": ["An embodiment of the present disclosure will now be described in detail in conjunction with accompanying drawings.", "", "FIG.1is a tire meridian cross section including the tire rotational axis, showing a pneumatic tire1as an embodiment of the present disclosure.The present disclosure is suitably applied to passenger car tires, and the tire1of the present embodiment is a pneumatic tire for passenger cars.InFIG.1, there is shown the tire1under its standard state.", "", "Incidentally, in order to aid understanding of the present disclosure, the drawings may include expressions exaggerated or dimensionally differed from the actualities.", "", "In the case that the tire1is a kind of pneumatic tires for which various standards have been established,the “standard state” means a state of the tire when mounted on a standard wheel rim, and inflated to a standard tire pressure, but loaded with no tire load.The “standard wheel rim” is a wheel rim specified for the tire in a standard system including standards on which the tire is based, for example, the “Standard rim” in JATMA, “Design Rim” in TRA, “Measuring Rim” in ETRTO,The “standard tire pressure” is the air pressure specified for the tire in a standard system including standards on which the tire is based, for example, the “maximum air pressure” in JATMA, “INFLATION PRESSURE” in ETRTO, and the maximum air pressure listed in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in TRA.", "", "In the case that the tire1is a tire for which various standards are not yet established, the “standard state” means a standard usage state depending on the purpose of use of the tire and in a condition in which the tire is not attached to a vehicle and no tire load is applied.", "", "In this application including specification and claims, dimensions and positions of each part or portion of the tire refer to those measured under the standard state unless otherwise noted.", "", "As shown inFIG.1, the tire1of the present embodiment comprises a tread portion2, a pair of sidewall portions3, a pair of bead portions4and a carcass6.The sidewall portions3are respectively connected with the ends in the tire axial direction of the tread portion2.The bead portions4are respectively connected with the inner ends in the tire radial direction of the sidewall portions3.The carcass6extends between the bead portions4through the tread portion2and the sidewall portions3and has a toroidal shape.", "", "The bead portions4are each provided with a bead core5and a bead apex8, the bead apex8extending radially outwardly from the bead core5in a tapered manner.The bead core5is a ring-shaped body formed by winding a high tensile modulus member, for example, a steel wire or filament (not shown) in multiple turns in the radial distortion and axial direction.The cross-sectional shape of the bead core5is, for example, a polygon, in the present embodiment, generally a rectangle.The bead apex8is made of hard rubber, for example, having a generally triangular cross sectional shape.", "", "The carcass6comprises at least one carcass ply6A.The carcass ply6A extends between the bead portions4through the tread portion2and the sidewall portions3and is turned up around the bead core5in each bead portion from the axially inside to the axially outside so as to form a pair of turned-up portions6band a main portion6atherebetween.The turned-up portions6bextend radially outwardly from the bead cores on the axially outsides of the bead apexes8, respectively.", "", "The carcass ply6A is made of carcass cords covered with topping rubber (not shown).As the carcass cords, for example, organic fiber cords such as aramid or rayon can be used.The carcass cords are arranged at an angle in a range from 70 to 90 degrees with respect to the tire equator C, for example.Although the carcass6of the present embodiment is composed of only one carcass ply6A, it may be composed of a plurality of carcass plies6A.", "", "In the tire1of the present embodiment, the tread portion2is provided with a belt7on the radially outside of the carcass6.The belt7in this example comprises two belt plies7A and7B of parallel belt cords arranged at an angle in a range from 15 to 45 degrees with respect to the tire circumferential direction.The belt cords of one belt ply7A and the belt cords of the other belt ply7B are inclined in opposite directions with respect to the tire circumferential direction to thereby effectively reinforce the tread portion2.", "", "In the present disclosure, at least one of the bead portions4is provide with a bead reinforcing rubber10as shown inFIG.2. In the present embodiment, each of the bead portions4is provide with the bead reinforcing rubber10.The bead reinforcing rubber10is disposed axially outside the turned-up portion6b.", "", "The bead reinforcing rubber10comprises a plurality of reinforcing rubber layers arranged in the tire axial direction and each extending in a tire radial direction.In the present disclosure, the bead reinforcing rubber10comprises a first reinforcing rubber layer11and a second reinforcing rubber layer12, the second reinforcing rubber layer12disposed axially inside the first reinforcing rubber layer11.Although the bead reinforcing rubber10in the present embodiment is composed of only the first reinforcing rubber layer11and the second reinforcing rubber layer12, the bead reinforcing rubber10may include another rubber layer.", "", "In the present disclosure, the complex elastic modulus E*2 of the second reinforcing rubber layer12is smaller than the complex elastic modulus E*1 of the first reinforcing rubber layer11.", "", "In this application including specification and claims, the complex elastic modulus is measured according to Japanese Industrial Standard (JIS) K6394 under the following conditions using a viscoelastic spectrometer:Initial strain: 10%Strain amplitude: +/−2%Frequency: 10 HzDeformation mode: tensionMeasuring temperature: 30 degrees C.", "", "As the tire1of the present disclosure is provided with the above configurations, steering stability can be improved while maintaining ride comfort. The reason is considered as follows.", "", "The bead reinforcing rubber10in the present disclosure can change the state of the turned-up portion6bfrom a compressed state to a tensile state when the bead portion4is deformed outward in the tire axial direction. This improves the stiffness of the bead portion4and improves the steering stability.", "", "Further, the first reinforcing rubber layer11having the complex elastic modulus E*1 can prevent the bead portion4from falling outward in the tire axial direction, further improving the steering stability.Furthermore, in the present disclosure, since the second reinforcing rubber layer12having a relatively small complex elastic modulus E*2 is disposed on the inner side in the tire axial direction, minute vibrations (especially high-frequency components of the vibrations) of the carcass6, bead apex8and bead core5cab be easily absorbed, without sacrificing the ride comfort.", "", "Further, in the present disclosure, since the complex elastic modulus E*2 of the second reinforcing rubber layer12is relatively small, embrittlement due to heat generation of the second reinforcing rubber layer12is prevented, and damages such as separation between the bead reinforcing rubber10and the turned-up portion6bcan be prevented.Therefore, according to the present disclosure, it is also expected to improve the durability of the bead portion4.", "", "Hereinafter, a more detailed configuration of the present embodiment will be described.", "", "The dimension Lb in the tire radial direction of the bead apex8is preferably set in a range from 5% to 10% of the total tire height h1(for example, the dimension Lb is 20 mm or less) so that, with respect to positions in the tire radial direction, the radially outer end of the bead apex8approximates the radially outer end of the rim flange (not shown). As a result, when the bead portion4falls outward in the tire axial direction, strain in the bead portion4can be prevented from concentrating on the radially outer end portion of the bead apex8.", "", "Here, the total tire height h1means, as shown inFIG.1, the radial dimension from the bead base line BL to the radially outermost position on the tread surface which usually occurs at the tire equator C.The bead base line BL means a base line extending parallel to the tire axial direction at a radial position corresponding to the rim diameter of the standard wheel rim.", "", "Preferably, the complex elastic modulus of the bead apex8is not less than 40 MPa, more preferably not less than 50 MPa, but not more than 80 MPa, more preferably not more than 70 MPa.Thereby, the stiffness of the bead portion4becomes appropriate for improving the steering stability and ride comfort in a well-balanced manner.", "", "For example, the bead apex8may contain a thermosetting resin in order to improve strength so as to withstand large pressure and external forces that occur during running, and thereby improving the durability.", "", "Each of the bead portions4is provided with a clinch rubber14disposed on the axially outer side of the bead reinforcing rubber10to form the outer surface of the bead portion4.The complex elastic modulus of the clinch rubber14is smaller than that of the bead apex8, and is set in a range from 15 to 30 MPa for example.", "", "As shown inFIG.2, the radially outer end6boof the turned-up portion6bof the carcass ply6A is positioned at a distance L3in the tire radial direction from the above-mentioned bead base line BL which is, for example, in a range from 15% to 25% of the above-mentioned total tire height h1.", "", "It is preferable that the radially outer end6boof the turned-up portion6bis spaced apart at least 5 mm in the tire radial direction from both of the radially outer end of the first reinforcing rubber layer11and the radially outer end of the second reinforcing rubber layer12.Thereby, failures at the radially outer ends of the turned-up portion6band the rubber layers11and12are suppressed and the bead portion4is improved in durability.", "", "As shown inFIG.1, the bead reinforcing rubber10is disposed radially outside the bead core5.The bead reinforcing rubber10is spaced apart at least 5 mm from the outer end70in the tire axial direction of the belt7.The bead reinforcing rubber10is preferably arranged on the radially inside than a tire maximum width position3M in the sidewall portion3.The bead reinforcing rubber10is arranged so as to contact with an axially outer side of the turned-up portion6bof the carcass ply6A and an axially outer side of the main portion6aof the carcass ply6A as shown inFIG.2.", "", "It is preferable that the complex elastic modulus E*1 of the first reinforcing rubber layer11and the complex elastic modulus E*2 of the second reinforcing rubber layer12are both larger than the complex elastic modulus of the clinch rubber14.The complex elastic modulus E*1 of the first reinforcing rubber layer11is preferably not less than 40 MPa, more preferably not less than 50 MPa, but preferably not more than 80 MPa, more preferably not more than 70 MPa.The complex elastic modulus E*2 of the second reinforcing rubber layer12is preferably not less than 10 MPa, more preferably not less than 15, but preferably not more than 35 MPa, more preferably not more than 30 MPa.", "", "The ratio E*1/E*2 of the complex elastic modulus E*1 to the complex elastic modulus E*2 is preferably larger than 1.5, more preferably not less than 2.5, but preferably smaller than 5.0, more preferably not more than 4.0 from the viewpoint of improving the steering stability and ride comfort in a well-balanced manner.", "", "FIG.3is a cross-sectional view showing only the first reinforcing rubber layer11and the second reinforcing rubber layer12.As shown, each of the first reinforcing rubber layer11and the second reinforcing rubber layer12has a tapered radially inner end portion and a tapered radially outer end portion.Accordingly, each of the first reinforcing rubber layer11and the second reinforcing rubber layer12has a portion having a maximum thickness located between the tapered radially inner end portion and tapered radially outer end portion thereof.", "", "The first reinforcing rubber layer11has an axially outer surface16and an axially inner surface17, andin this example, as shown inFIG.2, the entire outer surface16is in contact with the clinch rubber14, and the entire inner surface17is in contact with the second reinforcing rubber layer12.Preferably, the radially outer end110of the first reinforcing rubber layer11is located radially outside the radially outer end6boof the turned-up portion6b.The dimension L1in the tire radial direction of the first reinforcing rubber layer11is preferably not less than 80%, but not more than 100% of the above-mentioned distance L3in the tire radial direction from the bead base line BL to the radially outer end6boof the turned-up portion6b,for reliably improving the steering stability.", "", "The second reinforcing rubber layer12has an axially outer surface18and an axially inner surface19.", "", "In this example, as shown inFIG.2, a part of the axially outer surface18is in contact with the first reinforcing rubber layer11, and the remaining part of the axially outer surface18is in contact with the clinch rubber14.In the cross section as shown inFIG.2, the length along the above-mentioned part of the axially outer surface18contacting with the first reinforcing rubber layer11is larger than the length along the above-mentioned part of the axially outer surface18contacting with the clinch rubber14, and is in a range from 60% to 70% of the length along the entire axially outer surface18. Thereby, ride comfort can be reliably maintained.", "", "In this example, as shown inFIG.2, a part of the axially inner surface19is in contact with the turned-up portion6b,and the remaining part of the axially inner surface19is in contact with the main portion6a.In the cross section as shown inFIG.2, the length along the above-mentioned part of the axially inner surface19contacting with the main portion6ais in a range from 40% to 60% of the length along the entire axially inner surface19.Thereby, slight vibrations of the main portion6abecomes easily absorbed by the second reinforcing rubber layer12, and riding comfort can be improved.", "", "Preferably, the dimension L2in the tire radial direction of the second reinforcing rubber layer12is larger than the dimension L1in the tire radial direction of the first reinforcing rubber layer11.For example, the dimension L2is not less than 130%, but not more than 170% of the dimension L1.Such second reinforcing rubber layer12helps to improve the ride comfort and steering stability in a well-balanced manner.", "", "Preferably, the radially outer end110of the first reinforcing rubber layer11is spaced apart at least 5 mm in the tire radial direction from the radially outer end120of the second reinforcing rubber layer12from the view point of suppressing separation between the first reinforcing rubber layer11and the second reinforcing rubber layer12,", "", "Further, it is preferable that, as shown inFIG.2, the sum of a maximum thickness tc of the clinch rubber14and a thickness t1of the first reinforcing rubber layer11measured at a position on the axially inner surface of the clinch rubber at which the maximum thickness tc of the clinch rubber14occurs, is not less than 50% of the overall thickness Bt of the bead portion4measured at the above-mentioned position.Thereby, the first reinforcing rubber layer11and the clinch rubber14can effectively prevent the bead portion4from falling axially outward, and the durability of the bead portion4and the steering stability are further improved.", "", "While detailed description has been made of a preferable embodiment of the present disclosure, the present disclosure can be embodied in various forms without being limited to the illustrated embodiment."], "claims": ["a pair of bead portions each provided with a bead core and a bead apex which extends radially outwardly from the bead core in a tapered manner, and a toroidal carcass comprising a carcass ply extending between the bead portions and turned up around the bead core in each bead portion from the axially inside to the axially outside so as to form a pair of turned-up portions and a main portion therebetween, the turned-up portions extending radially outwardly on the axially outer sides of the bead apexes, respectively, wherein at least one of the bead portions is provided with a bead reinforcing rubber disposed on the axially outer side of the turned-up portion, the bead reinforcing rubber comprises a first reinforcing rubber layer and a second reinforcing rubber layer disposed axially inside the first reinforcing rubber layer, and a complex elastic modulus E*2 of the second reinforcing rubber layer is smaller than a complex elastic modulus E*1 of the first reinforcing rubber layer.", "a ratio E*1/E*2 of the complex elastic modulus E*1 to the complex elastic modulus E*2 is greater than 1.5.", "the ratio E*1/E*2 of the complex elastic modulus E*1 to the complex elastic modulus E*2 is smaller than 5.0.", "the dimension in the tire radial direction of the bead apex is not more than 20 mm.", "the dimension in the tire radial direction of the bead apex is not more than 20 mm.", "the dimension in the tire radial direction of the bead apex is not more than 20 mm.", "the bead apex comprises a thermosetting resin.", "the bead apex comprises a thermosetting resin.", "the bead apex comprises a thermosetting resin.", "the dimension in the tire radial direction of the second reinforcing rubber layer is greater than the dimension in the tire radial direction of the first reinforcing rubber layer.", "the dimension in the tire radial direction of the second reinforcing rubber layer is greater than the dimension in the tire radial direction of the first reinforcing rubber layer.", "the dimension in the tire radial direction of the second reinforcing rubber layer is greater than the dimension in the tire radial direction of the first reinforcing rubber layer.", "the first reinforcing rubber layer has an axially inner surface of which entirety is in contact with the second reinforcing rubber layer.", "the first reinforcing rubber layer has an axially inner surface of which entirety is in contact with the second reinforcing rubber layer.", "the first reinforcing rubber layer has an axially inner surface of which entirety is in contact with the second reinforcing rubber layer.", "the radially outer end of the first reinforcing rubber layer is spaced apart at least 5 mm in the tire radial direction from the radially outer end of the second reinforcing rubber layer.", "the radially outer end of the first reinforcing rubber layer is spaced apart at least 5 mm in the tire radial direction from the radially outer end of the second reinforcing rubber layer.", "the radially outer end of the first reinforcing rubber layer is spaced apart at least 5 mm in the tire radial direction from the radially outer end of the second reinforcing rubber layer.", "the radially outer end of the turned-up portion is spaced apart at least 5 mm in the tire radial direction from the radially outer end of each of the first reinforcing rubber layer and the second reinforcing rubber layer.", "said at least one of the bead portions is provided, on the axially outer side of the bead reinforcing rubber, with a clinch rubber forming an outer surface of the bead portion, and when measured at a position in the tire radial direction where the clinch rubber has a maximum thickness tc. the sum of a thickness t"], "bibtex": "@patent{20240294040,\n    title = {PNEUMATIC TIRE},\n    number = {20240294040},\n    year = {2024},\n    note = {File: US20240294040A1-20240905.XML}\n    }", "classification": "B60C1506FI"}, {"title": "MOBILE CARBON CAPTURE SYSTEM ENHANCEMENT", "doc_number": "20240294041", "filename": "US20240294041A1-20240905.XML", "abstract": "The technology disclosed herein relates to a system for the efficient capture and storage of carbon dioxide from a vehicle's exhaust while in transit. The system includes an apparatus for extracting the carbon dioxide from an exhaust gas and passing it to a compressor or carbon dioxide management system. The system then compresses the carbon dioxide and determines if a tire has capacity for the carbon dioxide. The tire has a carbon dioxide chamber and an external air chamber. If the carbon dioxide air chamber has capacity, the compressor will supply compressed carbon dioxide into the carbon dioxide chamber. Upon arrival at an external storage location, the carbon dioxide stored in the tires are able to be extracted and supplied to the external storage location.", "detailed_description": ["The present disclosure provides for a system for facilitating the capture and storage of carbon dioxide from the exhaust of a fuel burning engine on a vehicle. The system has one or more components which allow the system to capture or extract carbon dioxide from the exhaust and store it within one or more tires. This apparatus allows for the efficient storage of carbon dioxide while the vehicle is away from a facility to dispose of it properly. When the vehicle arrives at a proper disposal facility, the carbon dioxide is able to be purged from the tires and sold or used in a variety of ways.", "", "Among the challenges of the energy transition, reducing carbon dioxide emissions of the transportation sector is one of the most difficult. Electrification of vehicles is of course a good solution to replace fossil fuel for mobility. This path is however penalized by the density of the electricity storage in the batteries. Mobile Carbon Capture is considered a transitional technology. As a retrofit option, it will be most useful in the period while current internal combustion engine vehicles are replaced by other alternatives with lower emissions. The length of that period will be influenced by the constrained supply of EVs in adequate quantities. Carbon dioxide capture is an alternative, if one can capture with limited energy penalty, and convert captured carbon dioxide into fuels using renewable electricity. This however requires the efficient capture and storage of the carbon dioxide of engine exhaust while moving or in transit. The capture of carbon dioxide while in transit present several problems, one of which is the efficient storage of the captured carbon dioxide. Current methods require large and heavy storage tanks attached to the vehicles. Or alternatively, a higher energy usage to liquefy and compress the collected CO2 into high pressure storage. This takes up valuable space and adds weight, which reduces fuel efficiency of the vehicle. If storage of the carbon dioxide could be done in a more efficient way, costs could be reduced, which would make carbon dioxide capture a more viable option.", "", "The technology described herein provides for an efficient and cost reducing system that allows for the storage of captured carbon dioxide. The system relies on storage already housed on vehicles. Such systems rely on the space within the tires of the vehicle. Vehicles rely on air pressure to keep tires inflated. Many tires have pressures of near 100 psi and volumes of 3.5 cubic feet of storage. Additionally, semi-trucks and trailers have as many as 18 tires to fill. As such, there is a potential to store significant amounts of captured carbon dioxide within the tires of the vehicle. The system described herein provides elements and components for storing carbon dioxide within tires while the vehicle is in transit. Components include compressors, valves, pressure lines, spindle air passages, and tires having two or more pressure compartments. These components allow the system to extract carbon dioxide from the vehicle's exhaust and store it in the tires until it can be disposed of at a facility.", "", "In addition, words such as “a” and “an,” unless otherwise indicated to the contrary, may also include the plural as well as the singular. Thus, for example, the constraint of “a feature” is satisfied where one or more features are present. As such, an element in the singular may refer to “one or more.”", "", "Further, the term “or” includes the conjunctive, the disjunctive, and both (a or b thus includes either a or b, as well as a and b).", "", "Additionally, the term “some” may refer to “one or more.”", "", "The term “combination” (e.g., one or more combinations thereof) may refer to, for example, “at least one of A, B, and C”; “at least two of A, B, or C” (e.g., AA, AB, AC, BB, BA, BC, CC, CA, CB); “each of A, B, and C”; and may include multiples of A, multiples of B, or multiples of C (e.g., CCABB, ACBB, ABB, etc.). Other combinations may include more or less than three options associated with the A, B, and C examples.", "", "Unless specifically stated otherwise, descriptors such as “first,” “second,” and “third,” for example, are used herein without imputing or otherwise indicating any meaning of priority, physical order, arrangement in a list, or ordering in any way, but are merely used as labels to distinguish elements for ease of understanding the disclosed examples. In some examples, the descriptor “first” may be used to refer to an element in the detailed description, while the same element may be referred to in a claim with a different descriptor such as “second” or “third.” In such instances, it should be understood that such descriptors are used merely for identifying those elements distinctly that might, for example, otherwise share a same name.", "", "Additionally, “user device,” as used herein, is a device that has the capability of using a wireless telecommunications network, and may also be referred to as a “computing device,” “mobile device,” “user equipment” (UE), or “wireless communication device.” A user device, in some aspects, may take on a variety of forms, such as a PC, a laptop computer, a tablet, a mobile phone, a PDA, a server, an Internet of Things device, any other device capable of communicating with other devices (e.g., by transmitting or receiving a signal) using a wireless communication, or one or more combinations thereof. A user device may be, in an embodiment, similar to computing device described herein with respect toFIG.1. A user device may also be, in another embodiment, similar to user device700, described herein with respect toFIG.7.", "", "FIG.1provides an example vehicle environment100that may be used containing the carbon capture and storage system. Example vehicle environment100comprises vehicle102, carbon dioxide storage tank104, carbon dioxide capture system106, pressure transfer lines108, carbon dioxide management system110, pressurized lines112, one or more valves116, and a plurality of tires114. The carbon dioxide management system110comprises a database, which includes tire data, vehicle data, and carbon dioxide capture data.", "", "Example vehicle environment100is but one example of a suitable environment for facilitating capture and storage of exhaust-generated carbon dioxide, and is not intended to suggest any limitation as to the scope of use or functionality of aspects herein. Neither should the environment100be interpreted as having any dependency or requirement relating to any one or combination of components illustrated. As an example, the carbon dioxide management system110can also include a plurality of models (e.g., machine learning models) to learn instructions for facilitating the management of carbon dioxide capture and storage on a vehicle102.", "", "Components of example vehicle environment100, such as carbon dioxide management system110, can be devices either on the on-site or off site portion of example vehicle environment100, or the carbon dioxide management system110may operate on a backend or in some instances a server side of example vehicle environment100. Such user-side components may facilitate the completion of tasks and make a record of activities, such as inputting settings, changing component requirements, updating vehicle status, monitoring carbon dioxide capture and storage, monitoring carbon dioxide pressures, and so on. The carbon dioxide management system110backend component may comprise distributed software operating across user- and server-side, or server-side software designed to work in conjunction with user-side software on user-side devices, so as to implement any combination of the features and functionalities of the present technology. This division of vehicle environment100is illustrated to be one example of a suitable environment, and there is no requirement for each implementation that any combination of carbon dioxide management system110and user-side devices exist as separate entities.", "", "User devices associated with or configured to run the carbon dioxide management system110, such as user device700ofFIG.7for example, is a device that is suitable for collecting information from the user. By way of example and not limitation, user device may be embodied as a personal computer, a laptop computer, a mobile device, a smartphone, a tablet computer, a smart watch, a wearable computer, a fitness tracker, a virtual reality headset, augmented reality glasses, a personal digital assistant, an MP3 player, a global positioning system (GPS) or device, a digital camera, a video player, a handheld communications device, a gaming device or system, an entertainment system, a vehicle computer system, an embedded system controller, a remote control, an appliance, a consumer electronic device, a workstation, another type of suitable device, or one or more combinations of these delineated devices, whether integrated or distributed. In some cases, user device may include devices such as smart mailboxes; smart home appliances; such as a smart refrigerator; smart thermostat; personal assistant, such as Amazon Echo or Google Home; or other smart systems that are capable of providing information to a user and collecting information from a user. In some cases, a user (e.g., human or robotic device user) may interact with the user device by running apps, such as computer software applications stored locally or accessed from a distributed data store. In some cases, apps may access information about the user through other apps or services operating on the user device or operating in the cloud and associated with user device. For example, in some embodiments a user may provide permission for a user-side logistics app to access other apps that the user may utilize, such as a calendar app, a contacts app, a location app or service, a communications app or service such as email or instant messaging, which may include accessing a user's email account with permission, a gaming app, a microphone app, and so on, in order to access and receive information about the user. In this way, additional information about a user may be received by accessing apps and services on one or more user devices utilized by the user.", "", "Vehicle102can be comprised of any vehicle with one or more carbon dioxide producing engines or methods. For example, vehicle102can be a semi-truck which drive train is powered by a diesel engine or any other fuel burning engine. The diesel engine generates carbon dioxide gasses when operating and an exhaust system, shown with inFIG.2, provides an exit for those gases in a desired location. The vehicle102may be any vehicle such as a passenger car, delivery van, delivery truck, delivery van, passenger truck, semi-truck, air craft, fuel powered air conditioned trailer, or any other vehicle that has need for a carbon dioxide generated engine or motor. The exhaust from the engine, shown inFIG.2, is passed to the carbon dioxide capture system106.", "", "Carbon dioxide capture system106operates to remove carbon dioxide from the exhaust gases passed to it from the engine. The carbon dioxide capture system106comprises components and systems that allow for the selective removal of carbon dioxide from the exhaust gases and direct them to one or more transfer lines108and one of several storage components. The carbon dioxide capture system operates by numerous methods which are beyond the scope of this invention. To be complete though, carbon dioxide is selectively removed from the exhaust gasses through numerous means and methods. Some exemplary and non-limiting methods may be liquid solvents, absorption-based method, scrubbing technology, or any other means or method for capturing carbon dioxide from a mixture of gasses. The carbon dioxide capture system106may be attached to the frame of the vehicle102or any other rigid structure associated with the vehicle102.", "", "The captured carbon dioxide from the carbon dioxide capture system106is then transferred to the carbon dioxide management system110to be distributed to one or more of the storage systems associated with the vehicle. The carbon dioxide management system110is able to determine an available storage location for the carbon dioxide. For example, the carbon dioxide management system110is able to determine if storage tank104or any one of tires114have capacity to receive the carbon dioxide. If no capacity is available, the carbon dioxide management system may turn the carbon dioxide capture system106off and allow the exhaust gasses to exit the system without removal of any carbon dioxide. Additionally, carbon dioxide management system110is able to prioritize storage locations. For example, if the carbon dioxide management system110has instructions to deposit carbon dioxide within the one or more tires114before the storage tank104, it is able to ensure that the carbon dioxide is transferred to that location first. Additionally, the carbon dioxide management system110has therein a compressor to compress the carbon dioxide to a desired pressure. The incoming carbon dioxide from the carbon dioxide capture system106is at a first pressure and may need to be at a second pressure.", "", "The compressor found within the carbon dioxide management system110is able to compress the carbon dioxide from the first pressure to the second pressure based on the desired storage location's pressure needs. Storage tank104may have a pressure capacity of 860 psi or higher. The one or more tires114may only be able to have tire pressure requirements of 120 psi or lower. As such, the carbon dioxide management system110is able to manage the pressure based on the storage location. Additionally, the carbon dioxide management system is able to operate valves116to determine where the compressed carbon dioxide is directed to. Valve116may be part of a series of valves which are operated using the carbon dioxide management system. For example, one valve may be opened such that the carbon dioxide is directed to the storage tank104. In another example, a valve116may be closed and a second valve116may be opened to allow the compressed carbon dioxide to fill the one or more tires116. The compressed carbon dioxide is passed from the carbon dioxide management system110to the storage location by way of compressed gas transfer lines112that are able to withstand pressures up to the compressed gas pressure.", "", "The vehicle environment100may have one or more storage systems. A first storage system is a storage compartment such as storage tank104. Storage tank104in one example is capable of housing carbon dioxide in the gaseous form. In another example, the storage tank104is capable of housing liquid carbon dioxide. The compressor associated with the carbon dioxide management system110is capable of compressing the carbon dioxide to a pressure within a range of 10 psi to 1500 psi or above. Storage tank104may be comprised of one or more materials in a variety of shapes. The storage tank104may also have an inlet and an outlet for inputting and outputting carbon dioxide gas and removal of the stored gas. In another example, the one or more tires114may be used as a storage system. The one or more tires114each have systems and components therein to receive carbon dioxide from the carbon dioxide management system110and expel air stored within the one or more tires114. Thus, ensuring that at any given time the fill rate of both the carbon dioxide storage and the air storage are combined to provide the ideal shape to the tire. By inputting carbon dioxide and expelling air, the one or more tires gradually increase in carbon dioxide percentage until the tire is fully inflated using carbon dioxide. Such components and systems associated with the one or more tires are described herein with respect toFIGS.3-5.", "", "FIG.2provides an example vehicle environment200for the sequestration and confinement of carbon dioxide from the exhaust of one or more engines such as engine204. The vehicle environment200comprises an engine204, an exhaust system206, an exhaust inlet208, a carbon dioxide capture system210, a compressor212, one or more pressure lines214, carbon dioxide fill systems216, a drivetrain218, exhaust exit220, and a plurality of tires222. The engine204in one embodiment may be a diesel fueled engine that drives drivetrain218. In other embodiments, the engine204comprises a gasoline fueled engine or a natural gas fueled engine. In alternative embodiments, the engine204comprises any combustion engine that produces carbon dioxide as a byproduct of the combustion. Such byproduct is expelled from engine204following combustion into exhaust outlet206and into exhaust system208. The exhaust system208comprises a series of pipes used to direct the exhaust gasses away from the engine to a desired location such as above a cab of a truck or behind and away from a vehicle at an exhaust outlet220.", "", "The exhaust system208is directed into the carbon dioxide capture system210before the exhaust exists the exhaust system208at exhaust exit220. The carbon dioxide captures system210is similar to the carbon dioxide system106described inFIG.1. The exhaust gasses produced by engine204comprise a mixture of many gas types. Carbon dioxide capture system210removes the carbon dioxide from the exhaust gasses allowing the remainder to exit the system through the exhaust exit220. There are numerous technologies that remove carbon dioxide from exhaust gasses any of which may be employed to remove the carbon dioxide from the exhaust. Additional gasses may also be removed such as water vapor, nitrogen oxides, or any other desired gases. The carbon dioxide capture system210takes the captured gas and passes it on through a line to the compressor212.", "", "The compressor212may also be associated with a carbon dioxide management system such as carbon dioxide management system110. The management system and compressor work tandemly to provide sufficiently pressurized gas to the tires222or storage tanks. For example, tires222may require pressurized air at a pressure of 90 psi and management system and compressor212is able to supply that to tires222through compression lines214. The compressor212may be any sort of compressor that is able to pressurize the supplied air including carbon dioxide to pressures of 0 to 150 psi. Additionally, the compressor212may be able to pressurize the supplied air to pressures of up to 1500 psi. The compressor212may be one single compressor212or may be a series of compressors.", "", "The pressure lines214comprise lines able to withstand air pressures required. Such air pressures may be up to 1500 psi or up to 150 psi. The pressure lines may also have valves that are operated by the carbon dioxide management system110. These valves in the pressure lines214are able to direct the compressed air one tire of the plurality of tires222. For example, the carbon dioxide management system110may determine that the front driver side tire222is capable of accepting additional carbon dioxide. As such, a series of valves will be opened or closed such that only the front driver's side tire222receives the compressed carbon dioxide or compressed air. The pressure lines are linked to carbon dioxide fill systems216at each tire222. The carbon dioxide fill systems216are designed such that carbon dioxide fills a compartment within the tire222and air existing within a second compartment exits. This is done while maintaining a desired tire pressure. Carbon dioxide fill system216is described in more detail inFIGS.4and5.", "", "FIG.3provides another example environment300of a carbon dioxide supply system that facilitates the removal of carbon dioxide from vehicle exhaust and stores the carbon dioxide with within tires312. The example environment300comprises a carbon dioxide removal system302, a carbon dioxide management system304, pressure lines306, axels308, carbon dioxide supply systems310, and tires312. Example systems described herein with respect to example environment300are similar to portions described above inFIG.2andFIG.1.", "", "In example environment300, the carbon dioxide management system304incorporates a compressor, one or more computer components such as components for user device described inFIG.7. The carbon dioxide management system304is able to receive instructions and setting for several portions of the environment300. For example, instructions may be received that instruct the carbon dioxide management system304to distribute the captured carbon dioxide to the tires at a particular pressure (e.g., 90 psi). Alternatively, the settings or instructions may be modified such that a first tire is filled. Once the first tire is filled a second tire is filled until all of the tires associated with the vehicle and/or trailer are filled. The order of filling may be specified in the settings or instructions. Other settings or instructions may be received by the carbon dioxide management system304. The carbon dioxide management system304may be communicatively coupled to sensors, valves, and switches within the example environment to detect pressures of volumes, turn valves on or off, initiate compression, increase pressure settings, detect flow, detect leaks, or any other system required activities or sensed requirements.", "", "In example environment300, the pressure lines306are attached to an axel308by way of a pressure protection valve or other valve. The pressure lines may also be attached to the axel by way of a petcock of other attachment mechanism. The pressure lines306may also bypass any axels and directly connect to the tires, wheel hub assemblies, or wheel rims. The pressure lines306are connected to the carbon dioxide supply system310, which is described in more detail inFIG.5. The carbon dioxide supply system310is able to supply a first chamber within tire312with pressurized carbon dioxide and remove air within a second chamber within tire312.", "", "FIG.4depicts example environment400of a portion of a carbon dioxide management system for the compression and storage of carbon dioxide. The carbon dioxide management system comprises a pressure valve402, a shut-off valve404, a filter406, a compressor408, a flow sensor410, pressure lines414, and a petcock412. Each of the valves or sensors described with respect toFIG.4may be communicatively coupled with a device such as user device described inFIG.7. Each of the components may be controlled using one or more processors configured to operate within particular specifications.", "", "In some embodiments, pressure valve402and the shut-off valve404operate to restrict or allow a particular pressure of carbon dioxide into the compressor408. The pressure valve402may protect the entire system from over-pressurization and only allow pressures below a threshold into the compressor. The pressure valve402may be adjusted manually or by way of a remote operating system. Each of the components may be wirelessly connected to the remote operating system. Additionally, the shut-off valve404operates as an on or off valve to either allow the flow of carbon dioxide from the carbon dioxide removal system to any of the tires or storage tanks found within a vehicle. Filter406may be used to filter out excess water or other contaminants within the input un-compressed air.", "", "Following the filter, the carbon dioxide enters compressor408. The compressor may be operated manually using a pressure knob to increase or decrease the desired output pressure. Additionally, the compressor may be communicatively coupled to a remote operating system such as a user device ofFIG.7. The user device may send instructions to compressor408to pressurize the incoming carbon dioxide to a set pressure. The compressor may operate variably as well based on the storage location. As an example, if the storage location is a tire on the semi-truck, the compressor408may pressurize the carbon dioxide to 90 psi. However, if the tire is found on a trailer, the compressor408may pressurized the carbon dioxide to, for example 110 psi. The flow switch410operates to determine where the flow of pressurized carbon dioxide will go. The flow switch410is operated in one example by the remote user device which monitors the capacity of each storage location. The user device will instruct the flow switch410or system of switches to turn on or off to direct the flow of pressurized carbon dioxide from the compressor408through pressure line414to petcock412. Petcock412connects the pressure line414to the desired storage location.", "", "FIG.5illustrates an example carbon dioxide supply environment500for supply of carbon dioxide into a tire512and extraction of air out of the tire512. The carbon dioxide supply environment500comprises a drive shaft component501, a hub assembly502, a supply line504, a spindle air passage506, an inlet line system508, a wheel assembly510, a tire512, a run flat system514, a first chamber516, a second chamber518, and an air fill system520. The drive shaft component501and the hub assembly work in tandem to provide rotational energy to the wheel510and tire512. However, other exemplary systems do not have a drive shaft and simply rotate with movement of the vehicle. For example, some wheel systems are drive wheels whereas others are non-powered wheels and do not require drive-shaft components by may be attached to an axel such as a solid axel.", "", "In some embodiments, the supply line504receives compressed carbon dioxide from the compressor as described in prior figures. Compressor compresses captured carbon dioxide and delivers it to the supply line504. The supply line connects to the spindle air passage506. Spindle air passage506operates using air passage bearings and allows air to pass from one side of the wheel hub assembly502to the other without loss of carbon dioxide. This is especially important as the wheel510and hub assembly502spin freely of each other and normal air passage would not operate without significant loss of pressure. The compressed carbon dioxide passes through the spindle air passage506to the carbon dioxide line system508.", "", "In some embodiments, the carbon dioxide line system508splits the carbon dioxide that is coming from the spindle air passage506into two, to inflate the first compartment from two locations. In other embodiments, the carbon dioxide line system508takes the carbon dioxide from the spindle air passage506to the first compartment through a single line. At the end of the carbon dioxide line system508, a valve is placed so carbon dioxide can be directed into the first compartment516. In another embodiment, the carbon dioxide may be extracted from the first compartment516through the carbon dioxide line system508.", "", "In one example, the first chamber516is a fillable airtight container connected to the carbon dioxide air system508. The carbon dioxide air system508provides compressed carbon dioxide to the first chamber516. As the compressed carbon dioxide fills the first chamber, the tire fills beyond the desired pressure. As such, pressure is released from the second chamber through the air fill system520. The air fill system may comprise a pressure release valve that releases air when the second chamber518exceeds a threshold pressure. The air fill system520may also comprise a petcock that allows a user to input compressed air into the second chamber518and expel the carbon dioxide within the first chamber516. For example, while driving, the carbon dioxide removal system removes air from the exhaust of the vehicle. The carbon dioxide is then compressed and sent through the spindle air passage506and the carbon dioxide line system508to the first chamber516. As an example, when a vehicle starts a trip, the second chamber518is filled to the desired pressure with external air and the first chamber516is empty. When the engine runs the first chamber516begins to fill with carbon dioxide. The pressure of the tire512increases and once the pressure of the tire512exceeds a threshold, the air filling the second chamber518is released through the air fill system520. Once the first chamber516is filled, the compressed carbon dioxide is diverted at the carbon dioxide management system110to another tire or storage location.", "", "At a deposit location, the carbon dioxide filling the first chamber516is removed through the carbon dioxide line system518and placed into an external storage container. External air is also placed into the second chamber518such that the pressure in the tire remains at a desired level. The external air may be supplied using an external or on board air compressor.", "", "The first chamber516comprises a fillable container that is isolated pressure wise from the second chamber. The first chamber may be made up of a material that is expandable such as an inner tube or some other chamber that is able to hold the pressure. The second chamber518may be made up of the same chamber material as the first chamber516. The second chamber may also be the space within the tire512that is not the first chamber516. Each of the chamber also may contain pressure sensors and methods of measuring the volume remaining. For example, a flow valve may be placed in the carbon dioxide line system to measure the amount of carbon dioxide input into the first chamber. Based on the volume of the tire and a threshold pressure, the maximum amount of carbon dioxide can be determined. As such, the volume input into the first chamber can be measured and a shut off valve can be used to stop the flow into that tire512when the maximum amount of carbon dioxide is provided.", "", "FIG.6provides an example flowchart600for delivering pressurized carbon dioxide from a carbon dioxide sequestration system to a tire onboard a vehicle. In some embodiments. At610first chamber (such as first chamber516) within a first tire is determined to have capacity to accept carbon dioxide. At612, a second chamber (such as second chamber518) within the first tire is determined to have capacity to discharge air contained in the second chamber. At step614based at least in part on the determination that the first chamber within the first tire has capacity to accept carbon dioxide, supply pressurized carbon dioxide at a first pressure to the first chamber until the first chamber does not have capacity wherein the pressurized carbon dioxide supplied is provide by a carbon sequestration system that captures carbon dioxide from an engine exhaust system. The supplied pressurized carbon dioxide is extracted from an exhaust system attached to a combustion engine. At step616, air that is pressurizing the second chamber is allowed to be released from the second chamber until the first chamber is at full capacity.", "", "Having described the example embodiments discussed above of the presently disclosed technology, an example operating environment of an example device is described below with respect toFIG.7. User device700is but one example of a suitable computing environment, and is not intended to suggest any particular limitation as to the scope of use or functionality of the technology disclosed. Neither should user device700be interpreted as having any dependency or requirement relating to any particular component illustrated, or a particular combination of the components illustrated inFIG.7.", "", "As illustrated inFIG.7, example user device700includes a bus702that directly or indirectly couples the following devices: memory704, one or more processors706, one or more presentation components708, one or more input/output (I/O) ports710, one or more I/O components712, a power supply714, and one or more radios716.", "", "Bus702represents what may be one or more busses (such as an address bus, data bus, or combination thereof). Although the various blocks ofFIG.7are shown with lines for the sake of clarity, in reality, these blocks represent logical, not necessarily actual, components. For example, one may consider a presentation component, such as a display device, to be an I/O component. Also, processors have memory. Accordingly,FIG.7is merely illustrative of an exemplary user device that can be used in connection with one or more embodiments of the technology disclosed herein.", "", "User device700can include a variety of computer-readable media. Computer-readable media can be any available media that can be accessed by user device700and may include both volatile and nonvolatile media, removable and non-removable media. By way of example, and not limitation, computer-readable media may comprise computer storage media and communication media. Computer storage media includes both volatile and nonvolatile, removable and non-removable media implemented in any method or technology for storage of information, such as computer-readable instructions, data structures, program modules, or other data. Computer storage media includes, but is not limited to, RAM, ROM, EEPROM, flash memory or other memory technology, CD-ROM, digital versatile disks (DVDs) or other optical disk storage, magnetic cassettes, magnetic tape, magnetic disk storage or other magnetic storage devices, or any other medium which can be used to store the desired information and which can be accessed by user device700. Computer storage media does not comprise signals per se. Communication media typically embodies computer-readable instructions, data structures, program modules, or other data in a modulated data signal such as a carrier wave or other transport mechanism and includes any information delivery media. The term “modulated data signal” means a signal that has one or more of its characteristics set or changed in such a manner as to encode information in the signal. By way of example, and not limitation, communication media includes wired media, such as a wired network or direct-wired connection, and wireless media, such as acoustic, RF, infrared, and other wireless media. One or more combinations of any of the above should also be included within the scope of computer-readable media.", "", "Memory704includes computer storage media in the form of volatile and/or nonvolatile memory. The memory704may be removable, non-removable, or a combination thereof. Example hardware devices of memory704may include solid-state memory, hard drives, optical-disc drives, other hardware, or one or more combinations thereof. As indicated above, the computer storage media of the memory704may include RAM, Dynamic RAM, ROM, EEPROM, flash memory or other memory technology, CD-ROM, a cache memory, DVDs or other optical disk storage, magnetic cassettes, magnetic tape, magnetic disk storage or other magnetic storage devices, a short-term memory unit, a long-term memory unit, any other medium which can be used to store the desired information and which can be accessed by user device700, or one or more combinations thereof.", "", "The one or more processors706of user device700can read data from various entities, such as the memory704or the I/O component(s)712. The one or more processors706may include, for example, one or more microprocessors, one or more CPUs, a digital signal processor, one or more cores, a host processor, a controller, a chip, a microchip, one or more circuits, a logic unit, an integrated circuit (IC), an application-specific IC (ASIC), any other suitable multi-purpose or specific processor or controller, or one or more combinations thereof. In addition, the one or more processors706can execute instructions, for example, of an operating system of the user device700or of one or more suitable applications.", "", "The one or more presentation components708can present data indications via user device700, another user device, or a combination thereof. Example presentation components708may include a display device, speaker, printing component, vibrating component, another type of presentation component, or one or more combinations thereof. In some embodiments, the one or more presentation components708may comprise one or more applications or services on a user device, across a plurality of user devices, or in the cloud. The one or more presentation components708can generate user interface features, such as graphics, buttons, sliders, menus, lists, prompts, charts, audio prompts, alerts, vibrations, pop-ups, notification-bar or status-bar items, in-app notifications, other user interface features, or one or more combinations thereof. For example, the one or more presentation components708can present a visualization that compares a plurality of inspections of one or more cores of a central processing unit and a visualization of each task of each of the plurality of inspections.", "", "The one or more I/O ports710allow user device700to be logically coupled to other devices, including the one or more I/O components712, some of which may be built in. Example I/O components712can include a microphone, joystick, game pad, satellite dish, scanner, printer, wireless device, and the like. The one or more I/O components712may, for example, provide a natural user interface (NUI) that processes air gestures, voice, or other physiological inputs generated by a user. In some instances, the inputs the user generates may be transmitted to an appropriate network element for further processing. An NUI may implement any combination of speech recognition, touch and stylus recognition, facial recognition, biometric recognition, gesture recognition both on screen and adjacent to the screen, air gestures, head and eye tracking, and touch recognition associated with the one or more presentation components708on the user device700. In some embodiments, the user device700may be equipped with one or more imaging devices, such as one or more depth cameras, one or more stereoscopic cameras, one or more infrared cameras, one or more RGB cameras, another type of imaging device, or one or more combinations thereof, (e.g., for gesture detection and recognition). Additionally, the user device700may, additionally or alternatively, be equipped with accelerometers or gyroscopes that enable detection of motion. In some embodiments, the output of the accelerometers or gyroscopes may be provided to the one or more presentation components708of the user device700to render immersive augmented reality or virtual reality.", "", "The power supply714of user device700may be implemented as one or more batteries or another power source for providing power to components of the user device700. In embodiments, the power supply714can include an external power supply, such as an AC adapter or a powered docking cradle that supplements or recharges the one or more batteries. In aspects, the external power supply can override one or more batteries or another type of power source located within the user device700.", "", "Some embodiments of user device700may include one or more radios716(or similar wireless communication components). The one or more radios716can transmit, receive, or both transmit and receive signals for wireless communications. In embodiments, the user device700may be a wireless terminal adapted to receive communications and media over various wireless networks. User device700may communicate using the one or more radios716via one or more wireless protocols, such as code division multiple access (“CDMA”), global system for mobiles (“GSM”), time division multiple access (“TDMA”), another type of wireless protocol, or one or more combinations thereof. In embodiments, the wireless communications may include one or more short-range connections (e.g., a Wi-Fi® connection, a Bluetooth connection, a near-field communication connection), a long-range connection (e.g., CDMA, GPRS, GSM, TDMA, 802.16 protocols), or one or more combinations thereof. In some embodiments, the one or more radios716may facilitate communication via radio frequency signals, frames, blocks, transmission streams, packets, messages, data items, data, another type of wireless communication, or one or more combinations thereof. The one or more radios716may be capable of transmitting, receiving, or both transmitting and receiving wireless communications via mmWaves, FD-MIMO, massive MIMO, 3G, 4G, 5G, 6G, another type of Generation, 802.11 protocols and techniques, another type of wireless communication, or one or more combinations thereof.", "", "The subject matter of embodiments of the invention is described with specificity herein to meet statutory requirements. However, the description itself is not intended to limit the scope of this patent. Rather, the inventors have contemplated that the claimed subject matter might also be embodied in other ways, to include different steps or combinations of steps similar to the ones described in this document, in conjunction with other present or future technologies. Moreover, although the terms “step” and/or “block” may be used herein to connote different elements of methods employed, the terms should not be interpreted as implying any particular order among or between various steps herein disclosed unless and except when the order of individual steps is explicitly described.", "", "Embodiments of the present invention have been described in relation to particular embodiments which are intended in all respects to be illustrative rather than restrictive. Alternative embodiments will become apparent to those of ordinary skill in the art to which the present invention pertains without departing from its scope.", "", "From the foregoing, it will be seen that this invention is one well adapted to attain all the ends and objects hereinabove set forth together with other advantages which are obvious and which are inherent to the structure.", "", "It will be understood that certain features and sub-combinations are of utility and may be employed without reference to other features or sub-combinations. This is contemplated by and is within the scope of the claims. The described technology may be made without departing from the scope, it is to be understood that all matter described herein or illustrated in the accompanying drawings is to be interpreted as illustrative and not in a limiting sense."], "claims": ["a carbon dioxide capture apparatus; a carbon dioxide compressor coupled to the carbon dioxide capture apparatus by a first air transfer line; and a tire coupled to the carbon dioxide compressor by a second transfer line, the tire having a first compartment and a second compartment.", "2 . The system of claim 1 , wherein the carbon dioxide capture apparatus captures carbon dioxide from an exhaust gas emitted from an engine associated with the vehicle.", "3 . The system of claim 1 , wherein the carbon dioxide compressor is operated using one or more processors.", "4 . The system of claim 3 , wherein the one or more processors are linked to one or more sensors that detect pressure and flow to the first chamber from the compressor.", "5 . The system of claim 4 , wherein one or more processors are configured to determine, using a detected flow and a detected pressure, if a volume of carbon dioxide within the first chamber is below a threshold.", "6 . The system of claim 5 , wherein the one or more processors are configured to turn the compressor on based on the determination that the volume of carbon dioxide is below the threshold.", "7 . The system of claim 1 , wherein the tire has a first pressure and a first volume, the first volume being a combination of a first compartment volume and a second compartment volume.", "determining that a first chamber within a first tire has capacity to accept carbon dioxide; determining that a second chamber within the first tire has capacity to discharge air contained in the second chamber; based at least in part on the determination that the first chamber within the first tire has capacity to accept carbon dioxide, supplying pressurized carbon dioxide at a first pressure to the first chamber until the first chamber does not have capacity; and allowing the air contained within the second chamber to be released until the first chamber is at full capacity.", "9 . The method of claim 8 , wherein the first chamber is determined to have capacity based at least in part an available volume of the first chamber.", "10 . The method of claim 9 wherein the first chamber is further determined to have capacity based in part on a measured flow and a measured pressure of the carbon dioxide within the first chamber.", "11 . The method of claim 10 , wherein the measured flow is determined by a flow valve located between a compressor and the tire.", "12 . The method of claim 8 , wherein the pressurized carbon dioxide supplied is provide by a carbon sequestration system that captures carbon dioxide from an engine exhaust system.", "13 . The method of claim 8 , further comprising: removing the carbon dioxide from the first compartment by pressurizing the second chamber and opening a release valve connected to the first chamber.", "14 . The method of claim 12 , wherein the tire has and a first volume, the first volume being a combination of a first compartment volume and second compartment volume.", "determining that a first chamber within a first tire has capacity to accept carbon dioxide; determining that a second chamber within the first tire has capacity to discharge air contained in the second chamber; based at least in part on the determination that the first chamber within the first tire has capacity to accept carbon dioxide, supplying pressurized carbon dioxide at a first pressure to the first chamber until the first chamber does not have capacity wherein the pressurized carbon dioxide supplied is provide by a carbon sequestration system that captures carbon dioxide from an engine exhaust system; and allowing the air contained within the second chamber to be released until the first chamber is at full capacity.", "16 . The media of claim 15 , wherein the first chamber is determined to have capacity based at least in part an available volume of the first chamber.", "17 . The media of claim 16 wherein the first chamber is further determined to have capacity based in part on a measured flow and a measured pressure of the carbon dioxide within the first chamber.", "18 . The media of claim 17 , wherein the measured flow is determined by a flow valve located between a compressor and the tire.", "19 . The media of claim 15 , wherein the pressurized carbon dioxide supplied is provided by a carbon sequestration system that captures carbon dioxide from an engine exhaust system.", "20 . The media of claim 15 , further comprising: removing the carbon dioxide from the first compartment by pressurizing the second chamber and opening a release valve connected to the first chamber."], "bibtex": "@patent{20240294041,\n    title = {MOBILE CARBON CAPTURE SYSTEM ENHANCEMENT},\n    number = {20240294041},\n    year = {2024},\n    note = {File: US20240294041A1-20240905.XML}\n    }", "classification": "B60C2300FI"}, {"title": "TIRE-REPAIRING CONNECTOR", "doc_number": "20240294042", "filename": "US20240294042A1-20240905.XML", "abstract": "A tire-repairing connector includes a main body and an insertion tube. The main body has a connecting end and a second end. The main body is provided therein with a gas inlet channel extending through the connecting end. The insertion tube is provided with a gas passage therein. One end of the insertion tube is provided in the second end of the main body, with the gas passage in communication with the gas inlet channel. The other end of the insertion tube is a pointed end with a clamping groove having an opening. The clamping groove is configured to hold a tire plug. The insertion tube and the tire plug held in the clamping groove can be inserted into a puncture in a tire to repair the puncture, and the tire can be inflated directly through the tire-repairing connector.", "detailed_description": ["The present invention provides a tire-repairing connector for use as a tire repair tool to not only repair but also inflate a tire. The tire-repairing connector10in each of the following embodiments has a main body20and an insertion tube30.", "", "Referring toFIG.1toFIG.4, the tire-repairing connector10a(10) provided by the first preferred embodiment of the present invention includes a main body20aand an insertion tube30.", "", "The main body20ahas two ends. The first end of the main body20ais a connecting end21and has a gas inlet channel23. One end of the gas inlet channel23extends through the connecting end21of the main body20a. An internal hole portion24is provided in the connecting end21of the main body20a, has an internal thread, and forms a part of the gas inlet channel23. A puncturing portion25and a packing ring26are provided in the gas inlet channel23. A coupling portion27is provided at the second end22of the main body20a. The coupling portion27in this embodiment is an external thread provided on the outer periphery of the second end22. The main body20ahas a relatively large large-diameter portion201located between the first end and the second end to make it easy for a user to rotate the tire-repairing connector.", "", "The insertion tube30is a hollow tube and is provided therein a gas passage32that opens at the two ends of the insertion tube30. One end of the insertion tube30is provided in the second end22of the main body20asuch that the inner end of the gas passage32is in communication with the gas inlet channel23. The other end (i.e., the free end) of the insertion tube30is a pointed end34. A clamping groove36is provided at the pointed end34and has an opening361. The pointed end34has an inclined surface35and thus forms a high edge341and a low edge342, which two edges have a difference in height. The low edge342is closer to the main body20athan is the high edge341. The opening361of the clamping groove36is located at the high edge341. Referring toFIG.3, the two walls364of the clamping groove36curve toward each other such that a middle section362of the clamping groove36has the smallest width of the clamping groove36. That is to say, the width of the middle section362is smaller than those of the closed end363and the opening361of the clamping groove36.", "", "Referring toFIG.5toFIG.7, the tire-repairing connector10acan be received in a hollow cylindrical body40, with the coupling portion27of the second end22of the main body threadedly connected to the threaded portion42at one end41of the cylindrical body40and thus the tire-repairing connector10ais coupled to the cylindrical body40in a separable manner. The insertion tube30in that case is received in a receiving space43of the cylindrical body40, with a flexible cover44mounted around the pointed end34. A plurality of tire plugs45can also be received in the receiving space43.", "", "When a tire is punctured by a foreign object and needs repairing, the user of the tire-repairing connector10amay push a tire plug45through the opening361into the clamping groove36of the insertion tube30, passing through the middle section362, until the tire plug45is held at the closed end363of the clamping groove36. Then, referring toFIG.8, the user inserts the pointed end34of the insertion tube30into the puncture in the tire50together with the tire plug45in order for the tire plug45to fill and seal the puncture.", "", "Once the insertion tube30is inserted into the tire50, one end of the gas passage32is in communication with the internal space of the tire50, so the user continues by threadedly connecting the threaded connection end56of a tire-inflating gas cartridge55, which contains a high-pressure gas, to the internal hole portion24of the connecting end21of the main body20a, as shown inFIG.9. During the process, the puncturing portion25pierces through the sealing membrane of the gas cartridge55such that the high-pressure gas in the gas cartridge flows through the gas inlet channel23of the main body20ainto the gas passage32of the insertion tube30and enters the tire50through the outer end of the gas passage32to inflate the tire. When the tire is fully inflated, the insertion tube30is pulled out of the tire50to complete the tire repairing and inflating operation. The tire-repairing connector of the present invention makes it possible to repair and inflate a punctured tire directly at the puncture, thereby providing convenience of operation.", "", "FIG.10shows that the tire-repairing connector10baccording to the second preferred embodiment of the present invention can be coupled to a hollow cylindrical body40in a detachable manner to form a tire-repairing device, with the insertion tube30received in the receiving space43of the cylindrical body40. The tire-repairing connector10bin this embodiment has the same overall structure as its counterpart in the first preferred embodiment. Identical parts in these two embodiments can be recognized by the use of identical reference numerals and will not be described repeatedly.", "", "The tire-repairing connector10bis different from the tire-repairing connector10ain the first embodiment only in that the outer periphery of the connecting end21of the main body20bis provided with a second coupling portion28. The second coupling portion28is a thread having the same outer diameter as the coupling portion27provided at the second end22of the main body20.", "", "To repair a tire50, referring toFIG.11, the second coupling portion28of the connecting end of the main body20bis threadedly connected to the threaded portion42at the end41of the cylindrical body40such that the cylindrical body40becomes a handle of the tire-repairing connector. The user of the tire-repairing connector, therefore, can hold the cylindrical body40while inserting the insertion tube30and a tire plug45into the tire50. After the insertion, referring toFIG.12, the cylindrical body40is removed, and a tire-inflating gas cartridge55is connected to the internal hole portion24of the connecting end21of the main body20bto inflate the tire. When the tire is fully inflated, the insertion tube30is pulled out of the tire.", "", "FIG.13andFIG.14show the tire-repairing connector10caccording to the third preferred embodiment of the present invention. As in the previous embodiments, the tire-repairing connector10cincludes a main body20cand an insertion tube30.", "", "The connecting end (i.e., the first end)21of the main body20cis provided therein with a gas inlet channel23extending through the connecting end21. A second coupling portion28is provided at the connecting end. More specifically, the second coupling portion28is an external thread provided on the outer periphery of the connecting end21. A coupling portion27is provided at the second end22of the main body and is an external thread.", "", "The end face of the connecting end21of the main body20cis further provided with a bridging portion29. The bridging portion29in this embodiment is a portion having a smaller outer diameter than the second coupling portion28and is a post protruding outward from the connecting end21. A thread291is provided on the outer periphery of the bridging portion29. The gas inlet channel23extends through the connecting end21and the bridging portion29.", "", "The insertion tube30has the same structure as its counterpart in the first preferred embodiment and can be understood from the first embodiment. Identical parts of the insertion tubes in the two embodiments are indicated by identical reference numerals.", "", "One end of the insertion tube30is fixedly provided in the second end22of the main body20csuch that the gas passage32is in communication with the gas inlet channel23in the connecting end21.", "", "Referring toFIG.15toFIG.17, the tire-repairing connector10ccan be received in a hollow cylindrical body40, with the coupling portion27of the second end22of the main body20cthreadedly connected to the threaded portion42at the end41of the cylindrical body40and thus coupled to the cylindrical body40in a separable manner. The insertion tube30in that case will be received in a receiving space43of the cylindrical body40, with a flexible cover44mounted around the pointed end34. A plurality of tire plugs45can be received in the receiving space43as well.", "", "An adapter60can also be received in the receiving space43and can be taken out of the receiving space43when needed. The adapter60is provided with a gas cartridge connecting hole62at one end and a connecting hole65at the opposite end. The two connecting holes62and65are in communication with each other. A puncturing portion63and a packing ring64are provided in the gas cartridge connecting hole62. The gas cartridge connecting hole62is configured to connect with a tire-inflating gas cartridge, and the puncturing portion63is configured to pierce through the sealing membrane of the tire-inflating gas cartridge.", "", "To repair a tire50, referring toFIG.18, a tire plug45is pushed into the clamping groove36of the insertion tube30, and the second coupling portion28of the connecting end21of the main body20cis threadedly connected to the threaded portion42at the end41of the cylindrical body40. Then, holding the cylindrical body40, the user inserts the insertion tube30and the tire plug45into the tire50. After that, referring toFIG.19, the cylindrical body40is removed, the connecting hole65of the adapter60is threadedly connected to the bridging portion29of the connecting end21of the main body20c, and a tire-inflating gas cartridge55is connected to the gas cartridge connecting hole62of the adapter60to inflate the tire50.", "", "In this embodiment, the bridging portion29has the same outer diameter as a Schrader, Presta, or English tire valve, and the connecting hole65is threadedly connectable to the bridging portion29or a tire valve. The adapter60, therefore, makes it possible to inflate a tire through the tire valve using a tire-inflating gas cartridge. To inflate a tire in this way, the connecting hole65is coupled to the tire valve, and the gas cartridge connecting hole62is coupled to the tire-inflating gas cartridge.", "", "FIG.20andFIG.21show an example of using the tire-repairing connector10ctogether with a bicycle tool kit70. The bicycle tool kit70has a main body71and a plurality of bicycle tools72. A gas cartridge connecting hole74is provided at one end of the main body71, and a connecting hole75at the opposite end of the main body71. The two connecting holes74and75are in communication with each other. A puncturing portion76is provided in the gas cartridge connecting hole74. The bridging portion29of the main body20cis connected to the connecting hole75, and a tire-inflating gas cartridge can be connected to the gas cartridge connecting hole74in order to inflate a punctured tire after the puncture is repaired.", "", "The tire-repairing connector10of the present invention can be used to repair a punctured tire and then inflate the tire through the insertion tube30directly at the puncture, thereby reducing the effort and time required for repairing and inflating the tire.", "", "Although the invention has been disclosed as above with the embodiments, it is not intended to limit the invention. A person having ordinary skill in the art to which the invention pertains can make various changes and modifications without departing from the spirit and scope of the invention. Therefore, scope of protection of the invention shall be subject to what is defined in the pending claims."], "claims": ["a main body having two ends, one end of the two ends being a connecting end, the other end of the two ends being a second end, a gas inlet channel being provided in the main body and extending through the connecting end; and an insertion tube configured as a hollow tube with two ends, a gas passage being provided in the insertion tube, one end of the insertion tube being provided in the second end of the main body, with the gas passage in communication with the gas inlet channel, the other end of the insertion tube being a pointed end, the pointed end being provided with a clamping groove, and the clamping groove having an opening.", "2 . The tire-repairing connector of claim 1 , wherein the pointed end of the insertion tube has an inclined surface and thus the pointed end forms a high edge and a low edge, with a height difference between the high edge and the low edge, and the opening of the clamping groove is located at the high edge.", "3 . The tire-repairing connector of claim 1 , wherein the clamping groove has a middle section, and the middle section has a smallest width of the clamping groove.", "4 . The tire-repairing connector of claim 2 , wherein the clamping groove has a middle section, and the middle section has a smallest width of the clamping groove.", "5 . The tire-repairing connector of claim 3 , wherein the clamping groove has two walls curving toward each other such that the middle section of the clamping groove has the smallest width of the clamping groove.", "6 . The tire-repairing connector of claim 1 , wherein the second end of the main body is provided with a coupling portion, the tire-repairing connector further comprises a cylindrical body, and the coupling portion is configured to be coupled to one end of the cylindrical body in a detachable manner.", "7 . The tire-repairing connector of claim 6 , wherein the connecting end of the main body is provided with a second coupling portion, and the second coupling portion is configured to be coupled to the end of the cylindrical body in a detachable manner.", "8 . The tire-repairing connector of claim 1 , wherein the connecting end of the main body is provided with an internal hole portion forming a part of the gas inlet channel.", "9 . The tire-repairing connector of claim 1 , wherein the connecting end of the main body is protrudingly provided with a bridging portion, and the gas inlet channel extends through the bridging portion."], "bibtex": "@patent{20240294042,\n    title = {TIRE-REPAIRING CONNECTOR},\n    number = {20240294042},\n    year = {2024},\n    note = {File: US20240294042A1-20240905.XML}\n    }", "classification": "B60C2500FI"}, {"title": "TOW HITCH LEAD IN SYSTEM", "doc_number": "20240294043", "filename": "US20240294043A1-20240905.XML", "abstract": "Methods and systems for aligning a vehicle and a trailer. The system includes a guide coupled to a tow hitch of the vehicle, a plurality of sensors disposed along the guide, and an electronic control unit (ECU). The guide includes a first arm extending from a hinge and a second arm extending from the hinge. The first arm and the second arm are configured to provide a space therebetween to receive a tongue of the trailer. The plurality of sensors are configured to detect sensor data indicative of an alignment between the vehicle and the trailer. The ECU is configured to receive the sensor data, determine a position of the tongue relative to the first arm and the second arm, and transmit the determination to the vehicle.", "detailed_description": ["Disclosed herein are systems, vehicles, and methods for guiding, monitoring, and/or viewing a trailer hitch to attach a towing vehicle to a towed vehicle. The systems and methods described herein includes a retractable arm mechanism and sensors placed thereon to guide the trailer hitch and provide sensor and/or video feedback to a driver. The retractable arm mechanism may extend outward in a “V” shape to help guide the driver. Additionally, a base of the retractable arm mechanism may extend from the trailer hitch depending on an amount of lead needed to guide the hitch to the trailer. Sensor and/or video data from the sensors/cameras may be sent to a display screen so the driver can see images, for instance, of the hitch and the trailer.", "", "Conventional vehicles have hitches located at a lengthwise centerline axis along the rear end of conventional vehicles, and the hitches of conventional vehicles do not move. In addition, trailers have tongues that couple to the hitches of conventional vehicles, and the tongues are located at a lengthwise centerline axis of the trailer and extend outward from the trailer at a front end of the trailer. Since the tongues of trailers and hitches of conventional vehicles do not move, there is a possibility of misalignment between the vehicle and the trailer when the vehicle backs up toward the trailer. Aftermarket attachments that can be put onto the hitch are not easily accessible and does not provide sensor feedback to the driver. The systems and methods describe herein prevent (or mitigate) these issues.", "", "As used herein, “driver” may refer to a human being driving the vehicle when the vehicle is a non-autonomous vehicle, and/or “driver” may also refer to one or more computer processors used to autonomously or semi-autonomously drive the vehicle. “User” may be used to refer to the driver or occupant of the vehicle when the vehicle is a non-autonomous vehicle, and “user” may also be used to refer to an occupant of the vehicle when the vehicle is an autonomous or semi-autonomous vehicle.", "", "FIGS.1A-1Billustrate a vehicle using the dynamic lateral trailer hitch positioning system with a trailer. The vehicle102may be any vehicle configured to couple to a trailer104. For example, the vehicle102may be a truck, a sport utility vehicle, an all-terrain vehicle, or a tractor. The vehicle102has a front end126and a rear end128. The vehicle102may have a hitch (or trailer hitch)106located at a rear end128. The hitch106may have a channel (e.g., a square-shaped channel) for receiving a mount (e.g., a ball mount). The mount may be secured to the hitch106via a retainer (e.g., a pin). As used herein, “hitch” or “trailer hitch” may refer to the channel for receiving the mount alone or may also refer to the channel and the mount together. The hitch106may be coupled to the frame of the vehicle102and is capable of mating with an object (e.g., a trailer) to couple the object to the vehicle102.", "", "The trailer104may be any object capable of receiving cargo and being pulled by the vehicle102. The trailer104may be covered or uncovered. The trailer104may have multiple wheels for traversing roads or paths.", "", "The trailer104has a front end130and a rear end132. The trailer104has a tongue124located at the front end130and extending outward from the front end130. The tongue124may have a coupler located at the tip end of the tongue124. The coupler is configured to mate with the hitch106. For example, when the hitch106includes a ball, the ball may be received and secured by the coupler to maintain the connection between the hitch106and the tongue124, and more broadly, the connection between the vehicle102and the trailer104.", "", "Conventional hitches are located along a lengthwise centerline axis of the vehicle. Similarly, conventional tongues are located along a lengthwise centerline axis of the trailer. Thus, conventional hitches and tongues (as well as conventional vehicles and trailers) are aligned with a centerline axis108, as shown inFIG.1A.", "", "As shown inFIG.1A, when the hitch106of the vehicle102lies along the centerline axis108, the rear end128of the vehicle102is separated from the front end130of the trailer104by a first distance110.", "", "The vehicle102may use sensor data to determine the exact location to shift the hitch106to, along the rear end128of the vehicle102. This determination of ideal location (or “target location”) may be made prior to moving the hitch106. Adjustments to the hitch106location may be made as updated sensor data is detected.", "", "In some embodiments, a display (e.g., part of an infotainment unit or an instrument panel) within the passenger cabin of the vehicle may show the location of the hitch106on an on-screen graphic when it is moved. The relative location and orientation of the vehicle and the trailer may also be shown.", "", "FIG.2illustrates a rear end118of the vehicle102. The hitch106may be located below a bumper of the vehicle102or along a bumper of the vehicle102. The hitch106may be located along a track214that spans a width (or a substantial width) of the vehicle102. The hitch106may travel laterally along the track214. As shown inFIG.2A, the hitch106may have a baseline position208at a center of the track214, aligned with the lengthwise centerline axis of the vehicle102. In various embodiments, the hitch106may move to a left position210to the left of the baseline position208. In various embodiments, the hitch106may move to a right position212to the right of the baseline position208. For instance, the hitch106may be configured to rotate relative to a pivot point, or hinge304(e.g., seeFIG.3C).", "", "Referring now toFIGS.3A-3E, a hitch lead in system300is illustrated. The hitch lead in system300includes a guide302. The guide302may be removably coupled to the hitch106. For instance, the guide302may be clipped, screwed, pinned, or otherwise attached to the hitch106. The guide302may be rotatably coupled to the hitch106via a hinge304. As such, the guide302may be configured to rotate from a stowed position (e.g., seeFIG.3A) to a deployed position (e.g., seeFIG.3B) by rotating the guide302about the hinge304. In various embodiments, the hinge304may be located at an end of the hitch106, proximate the ball of the hitch106. In various embodiments, the hinge304may be located adjacent the rear end118, or bumper, of the vehicle102(e.g., seeFIG.3E).", "", "In various embodiments, the guide302may move along a track along the hitch106. As such, the guide302may be configured to move from the deployed position as shown inFIG.3Eto the deployed position as shown inFIG.3D. For instance, the guide302may include a wheel configured to be received by the track such that the guide302is configured to roll, slide, etc. In various embodiments, the guide302may be positioned manually. In various embodiments, an actuator coupled to the track may move the guide302along the track. For instance, a pneumatic or hydraulic cylinder may be used to move the guide302along the track. In yet other embodiments, there may also be a plurality of teeth located along the length of the track, and the guide302may be connected to a gear with corresponding teeth configured to mesh with the teeth of the track. An actuator coupled to the gear may rotate the gear in a first direction or a second direction to move the guide302along the track. While threads, toothed gears, and pneumatic or hydraulic cylinders are described herein, any other method or device for adjusting the location of the guide302along the track214may be used.", "", "The guide302may include a first arm306and a second arm308. In the deployed position, the first arm306and the second arm308may be configured in a V-formation. For instance, a vertex of the V-formation (e.g., the meeting point between the first arm306and the second arm308) may align with the hitch106such that the first arm306and the second arm308extend outward from the hitch106. The first arm306and the second arm308may extend away from the sides of the hitch106and extend beyond the end of the hitch106. The first arm306and the second arm308may be rotatably coupled to the hinge304. As such, the first arm306and the second arm308may be configured to rotate from the stowed position to the deployed position via the hinge304, and may be configured to be positioned with a variable distance between the first arm306and the second arm308. In other words, the first arm306may be positioned a first distance from the second arm308, the first arm306may be positioned a second distance from the second arm308, the second distance being larger than the first distance, the first arm306may be positioned a third distance from the second arm308, the third distance being larger than the second distance, etc. Such a “scissor style” shape that can be rotated out when needed provides optional support to the driver without having a permanent extension extending from the vehicle102.", "", "The guide302may further include a plurality of sensors310. The sensors310are configured to detect sensor data used to provide feedback to the user to indicate the relative position and orientation of the vehicle102and the trailer104. One or more of the sensors310may be a camera.", "", "The sensors310may include a rear-view camera (or image sensor) configured to detect image data of the environment behind the vehicle102. The rear-view camera may also be used to display the environment behind the vehicle102to the driver to assist the driver in maneuvering the vehicle while parking the vehicle102. The detected image data from the rear-view camera may be analyzed and used to determine proximity of the trailer104to the vehicle102as well as orientation of the trailer104relative to the vehicle102. For example, reference locations of the trailer104may be detected based on analysis of the image data, and the detection of these reference locations and comparison to baseline values may be used to determine the orientation of the trailer104relative to the vehicle102and may also be used to determine a proximity of the trailer104to the vehicle102. The rear-view camera204may be located adjacent to a handle for opening a trunk or a tailgate of the vehicle102. The rear-view camera may be one or more cameras and/or image sensors.", "", "The sensors310may also include clearance sensors (e.g., RADAR or LIDAR sensors) configured to detect the proximity of the trailer104to the rear of the vehicle102. When there are multiple clearance sensors, they may be configured to detect the proximity of the trailer104to the respective rear parking clearance sensor206. The clearance sensors may also be configured to detect an orientation of the trailer104relative to the vehicle102. For example, the clearance sensors206may detect a plurality of reference locations of the trailer104and the detection of these reference locations and comparison to baseline values may be used to determine the orientation of the trailer104relative to the vehicle102. The clearance sensors206may also be used to provide feedback to the driver of the vehicle102regarding the distance between the rear of the vehicle102and an object behind the vehicle102.", "", "The sensors310may also include an angle detection sensor configured to detect an angle of the trailer104relative to the vehicle102. The angle detection sensor may be an image sensor, or a spatial detection sensor (e.g., RADAR or LIDAR), for example. The angle detection sensor may detect a plurality of reference locations of the trailer104and the detection of these reference locations and comparison to baseline values may be used to determine the angle of the trailer104relative to the vehicle102. The detected angle may correspond to the angle formed between the lengthwise centerline axis of the vehicle102compared to the lengthwise centerline axis of the trailer104. Thus, an angle of 0 degrees would indicate that the vehicle102and the trailer104are aligned, and an angle of 90 degrees would indicate that the vehicle102and the trailer104are perpendicular to each other. In some embodiments, a positive angle value may indicate that the trailer104is angled to the left of the vehicle102and a negative angle value may indicate that the trailer104is angled to the right of the vehicle102, or vice versa. In other embodiments, all detected angle values are positive, and an additional indication of left or right may be provided to indicate whether the trailer104is angled to the left or right of the vehicle102.", "", "While the sensors310are shown inFIG.3C, for instance, as being in particular locations, in some embodiments, the sensors310may be disposed in any suitable arrangement.", "", "FIG.3Dillustrates a process of a vehicle102aligning with a trailer104. More specifically, the process of aligning the hitch106of the vehicle102with the tongue124of the trailer104is shown. For instance, when the driver begins to drive the vehicle102in reverse toward the trailer104, the vehicle102and the trailer104are not aligned. That is, the lengthwise centerline axis of the vehicle102is not aligned with the lengthwise centerline axis of the trailer104. Accordingly, the hitch106in the baseline position and the tongue124are not aligned.", "", "Conventionally, when a vehicle and a trailer are in a situation where they are not aligned, the vehicle or the trailer would be moved to place the vehicle and the trailer in alignment. However, it may be cumbersome and difficult to shift a large vehicle or a heavy trailer by precise, oftentimes small, distances. Using the systems and methods described herein, an error tolerance is provided in order to align the hitch106and the tongue124.", "", "In various embodiments, the vehicle102uses sensor data from the various sensors310to determine the distance and angles of the trailer104relative to the vehicle102. The sensor data may be transmitted to a user interface312(e.g., a display) within the vehicle102so the user can view the rear of the vehicle102more easily and clearly. The user may then drive the vehicle102toward the trailer and allow the guide302and the sensors310thereon to provide real-time feedback as the user is approaching the trailer104with the hitch106. The first arm304and the second arm306provide a greater range to capture the tongue124. For instance, if the user approaches the tongue124while the hitch106is still not aligned, the first arm304or the second arm306may engage with the tongue124and provide sensor data to instruct the user to angle the vehicle102more appropriately. In various embodiments, the user interface312may provide audible feedback (e.g., chimes, alarms, etc.) to indicate alignment or misalignment.", "", "In some embodiments, the vehicle102uses sensor data from the various sensors310to automatically identify a current location of the tongue124, automatically determine a target location of the hitch106along the rear end118of the vehicle102to move the hitch106, and automatically move the hitch106to the target location. For instance, the guide302may be positioned along the track according to the distance between the vehicle102and the trailer104. Similarly, the distance between the first arm304and the second arm306may be set based on the amount of misalignment between the vehicle102and the trailer104. In other embodiments, a button or an icon is engaged by a user to move the guide302. For example, an icon on the user interface312, a button on the instrument panel, or a button on the rear portion of the vehicle102may be engaged by a user to manually move the guide302using one or more actuators. In this example, the user interface312or the buttons are electrically connected to the one or more actuators and instruct the one or more actuators to move the hitch106.", "", "Further, the vehicle102uses sensor data from the various sensors310to determine whether the trailer104is secured to the vehicle102. For instance, once the hitch106and the tongue124are connected, they may be communicably coupled such that the hitch lead in system300is configured to receive and/or determine status data of the trailer104(e.g., trailer brake condition). Further, by integrating such communication features, the hitch lead in system300can indicate all components are connected and securely physically connected without the need for a second system.", "", "FIG.5illustrates a block diagram of the system500. The system500includes a vehicle102and a remote data server516.", "", "The vehicle102may have an automatic or manual transmission. The vehicle102is a conveyance capable of transporting a person, an object, or a permanently or temporarily affixed apparatus. The vehicle102may be a self-propelled wheeled conveyance, such as a car, a sports utility vehicle, a truck, a van or other motor or battery driven vehicle. For example, the vehicle102may be an electric vehicle, a hybrid vehicle, a plug-in hybrid vehicle, a fuel cell vehicle, or any other type of vehicle that includes a motor/generator. Other examples of vehicles include bicycles, planes, and any other form of conveyance that is capable of transportation. The vehicle102may be a semi-autonomous vehicle or an autonomous vehicle. That is, the vehicle102may be self-maneuvering and navigate without human input. An autonomous vehicle may use one or more sensors and/or a navigation unit to drive autonomously.", "", "The vehicle102includes an electronic control unit (ECU)504, a transceiver506, sensors508, a memory510, an actuator512, and a hitch106.", "", "Each ECU504may be one or more ECUs, appropriately programmed, to control one or more operations of the vehicle. The one or more ECUs504may be implemented as a single ECU or in multiple ECUs. The ECU504may be electrically coupled to some or all of the components of the vehicle. In some embodiments, the ECU504is a central ECU configured to control one or more operations of the entire vehicle. In some embodiments, the ECU504is multiple ECUs located within the vehicle and each configured to control one or more local operations of the vehicle. In some embodiments, the ECU504is one or more computer processors or controllers configured to execute instructions stored in a non-transitory memory510. The ECU504may utilize artificial intelligence logic and techniques to precisely determine a relative location and/or a relative orientation of a trailer104relative to the vehicle102.", "", "The vehicle102and one or more other vehicles similar to vehicle102may be coupled to a network. The network, such as a local area network (LAN), a wide area network (WAN), a cellular network, a digital short-range communication (DSRC), the Internet, or a combination thereof, connects the vehicle102to a remote data server516.", "", "The transceiver506may include a communication port or channel, such as one or more of a Wi-Fi unit, a Bluetooth® unit, a Radio Frequency Identification (RFID) tag or reader, a DSRC unit, or a cellular network unit for accessing a cellular network (such as 3G, 4G, or 5G). The transceiver506may transmit data to and receive data from devices and systems not directly connected to the vehicle. For example, the ECU504may communicate with the remote data server516. Furthermore, the transceiver506may access the network, to which the remote data server516is also connected. The vehicle102may communicate with other vehicles directly or via a network.", "", "The sensors508include sensors configured to detect sensor data associated with the trailer104. These sensors may include the sensors310, as described herein.", "", "The sensors508may also include a location sensor configured to detect location data associated with the vehicle102. The location sensor may be a GPS unit or any other global location detection device. The ECU504may use the location data along with the map data stored in the memory510to determine a location of the vehicle. In other embodiments, the location sensor has access to the map data and may determine the location of the vehicle and provide the location of the vehicle to the ECU504.", "", "The vehicle102includes an actuator512, which may be one or more actuators, configured to adjust the location of the hitch106and/or the guide302. The actuator512may be controlled by the ECU504or may have one or more processors of its own to perform the functions described herein.", "", "The memory510is connected to the ECU504and may be connected to any other component of the vehicle102. The memory510is configured to store any data described herein, such as the map data, the location data, the vehicle data, the trailer data, and any data received from the remote data server516via the transceiver506. The vehicle data associated with the vehicle102may indicate the features, capabilities, reference points, and measurements of the vehicle102. The trailer data associated with the trailer104may indicate the features, capabilities, reference points, and measurements of the trailer104.", "", "The ECU504may use the detected data from the sensors508to provide feedback to the driver, and the ECU504may use the actuator512to move the hitch106to the ideal hitch position. The ideal hitch position may be determined by first determining a relative location and orientation of the trailer104and the vehicle102. The ECU504may use sensor data from various sensors (e.g., rear corner sensors, rear-view camera, clearance sensors, angle detection sensor) to determine the relative location and orientation of the trailer104and the vehicle102.", "", "The remote data server516includes a processor518, a memory522, and a transceiver520. The processor518of the remote data server516may be one or more computer processors configured to execute instructions stored in non-transitory memory522. The remote data server516may store data, such as traffic data, road condition data, and map data in the memory522and communicate the stored data to the vehicle102via the transceiver520. While only one remote data server516is shown, any number of remote data servers in communication with each other may be used.", "", "As used herein, “substantially” may refer to being within plus or minus 10% of the value.", "", "Exemplary embodiments of the methods/systems have been disclosed in an illustrative style. Accordingly, the terminology employed throughout should be read in a non-limiting manner. Although minor modifications to the teachings herein will occur to those well versed in the art, it shall be understood that what is intended to be circumscribed within the scope of the patent warranted hereon are all such embodiments that reasonably fall within the scope of the advancement to the art hereby contributed, and that that scope shall not be restricted, except in light of the appended claims and their equivalents."], "claims": ["a guide coupled to a tow hitch of the vehicle, the guide having: a first arm extending from a hinge; and a second arm extending from the hinge, the first arm and the second arm configured to provide a space therebetween to receive a tongue of the trailer; a plurality of sensors disposed along the guide, the plurality of sensors configured to detect sensor data indicative of an alignment between the vehicle and the trailer; and an electronic control unit (ECU) configured to: receive the sensor data; determine a position of the tongue relative to the first arm and the second arm; and transmit the determination to the vehicle.", "2 . The system of claim 1 , further comprising a user interface configured to receive the determination of the position of the tongue relative to the first arm and the second arm.", "3 . The system of claim 1 , wherein the plurality of sensors comprise a camera configured to detect image data of the environment behind the vehicle.", "analyze the image data from the camera; and determine a proximity of the trailer to the vehicle or an orientation of the trailer relative to the vehicle.", "5 . The system of claim 1 , wherein the plurality of sensors comprise a RADAR or LIDAR sensor.", "6 . The system of claim 5 , wherein the plurality of sensors are configured to detect an angle of the trailer relative to the vehicle.", "7 . The system of claim 1 , wherein the first arm and the second arm are configured to rotate about the hinge such that the distance between the first arm and the second arm is variable.", "8 . The system of claim 1 , wherein the first arm and the second arm are configured to form a V-shape.", "9 . The system of claim 1 , wherein the ECU is further configured to actuate an actuator configured to position the guide.", "10 . The system of claim 1 , wherein the ECU is further configured to determine an ideal hitch location based on the sensor data, and instruct an actuator to move the guide to the ideal hitch location.", "11 . The system of claim 1 , wherein the guide is rotatably coupled to the hinge such that the guide may be folded in a stowed position and rotated about the hinge to a deployed position.", "a vehicle comprising a hitch disposed on a rear end of the vehicle; a trailer comprising a tongue disposed on a front end of the trailer and configured to couple to the hitch; and a guide coupled to a tow hitch of the vehicle, the guide configured to provide an error tolerance for aligning the vehicle and the trailer.", "a first arm extending from a hinge; and a second arm extending from the hinge, the first arm and the second arm configured to provide a space therebetween to receive the tongue of the trailer.", "14 . The system of claim 13 , further comprising a plurality of sensors disposed along the first arm and the second arm, the plurality of sensors configured to detect sensor data indicative of an alignment between the vehicle and the trailer.", "receive the sensor data; determine a position of the tongue relative to the first arm and the second arm; and transmit the determination to the vehicle.", "16 . The system of claim 15 , further comprising a user interface configured to receive the determination of the position of the tongue relative to the first arm and the second arm.", "analyze the sensor data; and determine a proximity of the trailer to the vehicle or an orientation of the trailer relative to the vehicle.", "18 . The system of claim 13 , wherein the first arm and the second arm are configured to rotate about the hinge such that the distance between the first arm and the second arm is variable.", "detecting, by one or more sensors of a guide, sensor data indicating a location and an orientation of the trailer relative to the vehicle; determining, by an electronic control unit (ECU), a position of a tongue of the trailer relative to a hitch of the vehicle based on the sensor data; and transmitting the determination of the position of the tongue to the vehicle.", "identifying, by the ECU, potential contact between the guide and the tongue based on the sensor data; determining, by the ECU, a vehicle movement to align the vehicle and the trailer; and transmitting the determination of the vehicle movement to the vehicle, wherein the determination is received at a user interface."], "bibtex": "@patent{20240294043,\n    title = {TOW HITCH LEAD IN SYSTEM},\n    number = {20240294043},\n    year = {2024},\n    note = {File: US20240294043A1-20240905.XML}\n    }", "classification": "B60D136FI"}]