[{"title": "WHEEL COMPONENT, METHOD OF MANUFACTURING, AND TOOL DEVICE", "doc_number": "20240208262", "filename": "US20240208262A1-20240627.XML", "abstract": "A wheel component, method, and tool device for a bicycle, including a plurality of integrally interconnected component parts, which form a spoked rim, wherein the rim and spokes are manufactured of a fibrous composite material by an injection molding process with fluid injection, wherein the liquefied fibrous composite material is injected into a cavity of a tool device, and a fluid is injected into the partially liquid fibrous composite material within the cavity to form at least one hollow space within the component part. A further component part forming a spoke, is manufactured by an injection molding process, wherein a mold core device for forming a hollow space within the spoke is disposed within a further cavity of the tool device. The fibrous composite material is injected into the further cavity. The mold core device is retracted from the fibrous composite material to form a cavity in the spoke.", "detailed_description": ["TheFIGS.1and2show a mountain bike respectively a racing bicycle100, each equipped with wheel components1according to the invention. The mountain bike or racing bicycle100is provided with a front wheel101and a rear wheel102, which are configured as wheel components1according to the invention. The two wheels101,102comprise spokes109to connect the rim111a, which comprises multiple rim segments111, with the hubs110.", "", "The wheel components1comprise component parts2,2aand2b. The component parts2are rim segments111of the rim111a, and the component parts2aform the spokes109, which connect the central component parts2c(central component) integrally with the rim111a.", "", "A bicycle100comprises a frame103, a handlebar106, a saddle107, a fork or suspension fork104and in the case of the mountain bike, a rear wheel damper105may be provided. A pedal crank112with pedals serves for driving. Optionally, an electric auxiliary drive may be provided on the pedal crank112and/or the wheels101,102. The hubs110of the wheels may be attached to the frame103by means of a clamping system113(for example a through axle or a quick release).", "", "FIG.3shows a schematic, perspective view of a wheel component1according to the invention, which is configured as a wheel101,102of a bicycle100. The wheel component1comprises multiple component parts2,2a,2b, all of which are manufactured by an injection molding process. The rim111acomprises five rim segments111. Each of the rim segments111is formed by a component part2. All of the rim segments111are manufactured by an injection molding process with fluid injection. The spokes109and the hub110form component parts2a,2b, again manufactured by an injection molding process, but different from the injection molding process with fluid injection. The hub110furthermore comprises an insert configured as a hub body10, which is cast in during manufacturing.", "", "In all the configurations, the wheel component1, and, in particular, the component parts2(rim segments111), the component parts2a(spokes109), and the central component part2c, are manufactured quasi concurrently with the cast-in hub body10. “Quasi concurrently” means that these component parts are preferably all manufactured (in one process step), while and as long as all the component parts are located in one (shared) tool device. This means that the component parts are integrally configured within the tool device. The parts are not produced separately, taken out of the production, and then interconnected.", "", "FIG.4shows a schematic detail illustration of an enlarged part of the rim area111aof the wheel component1according to the invention configured as a wheel100. The rim segment111aillustrated extends between two spokes109.", "", "The component part2configured as a rim segment111is manufactured by an injection molding process with fluid injection, and therefore has a hollow space5formed by injection of a fluid4, which extends along the peripheral direction of the rim111a. The rim segment111or the component part2may be referred to as a peripheral component. Due to the manufacturing process, the hollow space5has two openings5areaching through the wall7, for inlet and outlet of the injected fluid4. The openings5acan be closed airtight by plugs or end covers, not shown, so that tubeless tires can also be used in combination with the wheel component1according to the invention.", "", "The spokes109as the component parts2a, also comprise hollow spaces5, each of which is shaped by means of a mold core device52. The hollow spaces5of the component parts2aare separated from one another by walls7and not connected, i.e., there is no continuous connection between the hollow spaces5. Each mold core device52(FIG.8) is retracted prior to injecting fibrous composite material and after solidification, extended again.", "", "FIG.5ashows a schematic sectional view of an enlarged part of the rim segment111of the wheel component1configured as a wheel101,102. A section through a component part2is shown, configured as a rim segment111of the rim111a, seeFIG.4.", "", "The rim segment111comprises two rim flanges12,13, a rim well17, a rim base14, and two rim flanks15,16. Between the rim base14, the rim well17and the rim flanks15,16, the cavity5is configured, which is manufactured by an injection molding process with fluid injection, and which curves along the rim segment111, in the plane of the drawing.", "", "FIG.5bshows a schematic, perspective view of a part of the wheel component1, wherein a rim segment111is visible as a component part2and a spoke109, as a component part2a. The spoke109is configured hollow and comprises a hollow space5or a cavity109bin the spoke109. The component part2may also be referred to as a peripheral component, and the component part2a, as a radial component. The hollow space5of the spoke109opens into the rim well17. There, a takeup recess18is configured in the component part2, which is configured in the closest fit possible immediately in the manufacturing process. After removing the wheel component1from the tool, a fitted end cover19is mounted and, in particular, glued on. The end cover19seals the takeup recess18and the spoke cavity109b(airtight). The surface of the end cover19forms a portion of the rim well17.", "", "FIG.6shows a schematic detail illustration of an enlarged part around the hub110of the wheel component1according to the invention configured as a wheel101,102. The altogether five spokes109extend from the hub110radially (and linearly extended) outwardly. A hub body10is cast in the hub110. The hub body10is manufactured of a lightweight aluminum, in which bearing seats11are configured by way of chip-removing machining. Thus, ball bearings can be inserted directly after manufacturing the wheel component1. Subsequent, chip-removing machining of the wheel component1after manufacturing by an injection molding process is not required. As a rule, overflow cavities and e.g. sprues must be subsequently removed. Optionally, also webbing. As a rule, refinishing is limited to finishing the connection points such as sprues and overflow cavities.", "", "The component parts2,2a,2bare all manufactured by an injection molding process. The component parts2,2aare integrally interconnected, showing a homogeneous material structure, and not showing any seams or transition lines.", "", "In all the configurations and embodiments, examinations by section determines that the cavities109bin the spokes109have been formed or shaped by (smooth) mold core devices52, inserted prior to injection molding and retracted or removed thereafter. The inner surface is configured (nearly perfectly or perfectly) symmetrical and remains unchanged over substantial portions of the length. The inside surfaces of the component parts2(rim segments111) show considerably more surface variations, since as a rule the injected fluid causes less than perfectly smooth and symmetric surfaces in manufacturing, even though the surface quality on the inside is good and the wall thickness constancy meets requirements. In this respect there are measurable differences in different component parts2,2a, which determines the type of the (local) manufacturing method.", "", "FIG.7shows a schematic, perspective view of a hub body10for casting into a component part2a, manufactured by an injection molding process different from the injection molding process with fluid injection, seeFIG.6. The hub body10shows on the outside surface, moldings10aconfigured as grooves or notches10a. These moldings10aare enclosed in the liquid fibrous composite material20during the injection molding process, generating a form closure, i.e. a form-closed connection. This ensures a functionally reliable force transmission between the hub body10and the fibrous composite material20, in particular, in the case of high rotational forces or high transmitted forces, and independently of volume shrinkage during solidification of the fibrous composite material20, or with thermal expansion.", "", "FIG.8shows a schematic view of an apparatus60according to the invention with a tool device50for manufacturing a wheel component1according to the invention configured as a wheel101,102. In the inner area of the tool device50, there is a plurality of interconnected cavities3. In each cavity3, a component part2,2ais manufactured by an injection molding process. Thus, the component parts2,2aare integrally interconnected (and, in particular, material-formed and of a single material). The apparatus60comprises a tool device50, and in preferred configurations the apparatus60consists of a tool device50. Optionally, a control device70(separate where appropriate) and further aggregates are provided.", "", "The tool device50is subdivided in five equal tool segments51. Each of the tool segments51comprises an injection molding device56, through which the at least partially liquid fibrous composite material20can be injected, at least into the cavities3of the tool device50assigned to the tool segment51. The quantity of the tool segments51corresponds to the quantity of the spokes109of the wheel component1configured as a wheel101,102. Furthermore, the injection molding device56comprises further elements such as a takeup volume8, not shown in detail.", "", "FIG.9shows schematic illustrations for visualising the method and, in particular, the function of the injection molding device56for manufacturing a wheel component1according to the invention configured as a wheel101,102. The component parts of the tool segment51are illustrated in detail for one of the altogether five equal tool segments51.", "", "The wheel component1configured as a wheel101,102comprises component parts2manufactured by an injection molding process with fluid injection, and further component parts2amanufactured by an injection molding process where no fluid4is injected, thus differing from the injection molding process with fluid injection in at least one process step.", "", "The rim segments111are formed by component parts2manufactured by an injection molding process with fluid injection. The spokes109shown are formed by other component parts2a, manufactured by an injection molding process, wherein a mold core device52is inserted into the cavity3for forming a hollow space5. The component part2aconfigured as a hub110comprises the insert configured as a hub body10, which is cast in.", "", "For manufacturing the wheel component1configured as a wheel101,102, the cavities3are configured such that the walls3aof all the cavities3correspond to an outer surface of the wheel component1. The cavities3are interconnected, so that the component parts2,2a, and also the resulting wheel component1, are integrally configured.", "", "For manufacturing the wheel component1, a mold core device52is first inserted into the cavity3, forming a component part2aconfigured as a spoke109. The geometry of the mold core device52determines the shape of the hollow space5within the component part2aconfigured as a spoke109. The mold core device52shown is configured as a slidegate, which is retracted into the cavity3. The slidegate shows a cross section (e.g. round) so that the slidegate can be extended again (without any problems).", "", "This slidegate preferably shows an oval or round cross section. Or, the cross section may be configured non-round or star-shaped. As a rule, the slidegate travels (only) linearly. Other than linear movement, however, a rotary motion is likewise conceivable, so that e.g. a helical cavity forms.", "", "The hub body10is received centered by a takeup device55and oriented within one of the cavities3.", "", "The cavities3are evacuated through the outlet nozzle54bby means of a pump, not shown. During evacuation, the at least partially liquefied fibrous composite material20is injected through the altogether five injection ports53of the tool device5. The fibrous composite material20fills the cavities3. All the cavities3are completely filled with fibrous composite material20. When the fibrous composite material20is at least partially solidified on the wall3aof the cavity3, a fluid4for forming the hollow space5is injected into the rim segments111through the injection nozzles54.", "", "Due to the high heat capacity, water is used as the fluid4. The fluid4displaces the fibrous composite material20into the overflow volumes8, which are configured as overflow cavities8a. The overflow cavities8acan be adaptively selected by means of a valve device8bconfigured as a control element8b, comprising a mechanical slidegate. Alternately, the displaced fibrous composite material20may be displaced, and, in particular, urged back, into the injection port53. Additionally, the walls3aof the cavities3may be cooled by cooling devices57in the shape (e.g.) of a water jacket with water pipes, to control and accelerate the solidification process. By way of example, a water jacket of a cooling device57is configured, comprising a number of cooling pipes disposed within the mold core device52.", "", "The hub body10is enclosed by the fibrous composite material20, the mold elements10aestablish a form closure between the hub body10and the fibrous composite material20.", "", "After solidification, all the component parts2,2aare integrally interconnected. The hollow spaces5manufactured by fluid injection and the mold core device52are separated from one another. The finished wheel component1can be removed and can, without any further post-processing or further manufacturing steps, be prepared for mounting, for example by inserting the bearings into the bearing seats11.", "", "FIG.10shows schematic illustrations of the injection molding process with fluid injection for manufacturing a component part2configured as a rim segment111, of the wheel component1configured as a wheel101,102. The process flow is shown from the left to the right. In the first process step, the at least partially liquid fibrous composite material20is injected into the cavity3, and the cavity3is entirely filled. The cavity3is formed by multiple molding devices51aof the tool device50.", "", "When the fibrous composite material20is at least partially solidified on the wall3aof the cavity3, the fluid4is injected so as to form the hollow space5. The solidification process is assisted by a cooling device57configured as a water jacket. Injecting the fluid4displaces a part of the still liquid fibrous composite material20into the overflow volume8. The fluid4forms the hollow space5provided in the solidified component part2.", "", "The wall7shows an even, thin wall thickness7a, which can be preset by controlled use of the cooling device57. While the hollow space5forms, the injected fluid4is at least partially urged back out through the opening5ain the hollow space5. The injection nozzle54and the outlet nozzle54bare represented in this Figure by the same opening.", "", "While a particular embodiment of the present wheel component, method of manufacturing, and tool device have been described herein, it will be appreciated by those skilled in the art that changes and modifications may be made thereto without departing from the invention in its broader aspects and as set forth in the following claims.", "", "List of reference numerals:1wheel component2component part, circumferential component2aother, further component part, radial component2bcentral component part, central component3cavity3awall of 34fluid5hollow space5aopening7wall of 27awall thickness of 78takeup volume8aoverflow cavity8bvalve device, control element10hub body, insert10amold element11bearing seat12, 13rim flange14rim base15, 16rim flank17rim well18takeup recess19end cover20fibrous composite material50tool device51tool segment51amolding device52mold core device53injection port54injection nozzle54boutlet nozzle55takeup device56injection molding device57cooling unit60apparatus70control device100bicycle101wheel, front wheel102wheel, rear wheel103frame104fork, suspension fork105rear wheel damper106handlebar, handle107saddle109spoke109bcavity in the spoke, spoke cavity110hub111rim segment111arim111bsegment hollow space, hollow space in the rim segment112pedal crank113clamping system"], "claims": ["wherein the component parts of the rim are at least partially manufactured by an injection molding process with fluid injection, comprising at least the following process steps: the at least partially liquefied fibrous composite material is injected into a cavity of a tool device; and at least one fluid is injected into the at least partially liquid fibrous composite material within the cavity, to form at least one hollow space within the component part; and wherein at least one further component part, which forms at least part of a spoke, is manufactured by an injection molding process, comprising at least the following process steps: within the at least one further cavity of the tool device, a mold core device is disposed for forming at least one hollow space within the further component part; the fibrous composite material is injected into the at least one further cavity for forming the other component part; and the mold core device is retracted from the at least partially solidified fibrous composite material to form a cavity (", "2 . The wheel component according to claim 1 , wherein component parts of the spokes and the rim are integrally interconnected, and wherein at least some hollow spaces of the component parts of the rim are separated from one another.", "and wherein the at least partially liquefied fibrous composite material is injected into the further cavity of the tool device, so that the hub body is coated by the fibrous composite material and is cast in a central component part, and wherein the hub body comprises at least one mold element, which is enclosed by the fibrous composite material and forms at least one form closure between the hub body and the fibrous composite material of the central component part.", "and wherein at least one (other) component part is radially aligned as a radial component, and forms at least one part of a spoke, and wherein the hollow space in the spoke forms a spoke cavity, and wherein a central component part with the accommodated hub body is connected with the peripheral component by way of the radial component.", "5 . The wheel component according to claim 4 , wherein the hollow space in the spoke extends radially outwardly through the peripheral component, where a takeup recess is configured, which is covered by an end cover, and wherein the end cover forms a part of a rim well.", "6 . The wheel component according to claim 1 , wherein the fibrous composite material comprises fibers of a length between 8 mm and 20 mm.", "injecting the at least partially liquefied fibrous composite material into at least one cavity of a tool device; injecting at least one fluid into the at least partially liquid fibrous composite material within the cavity, to form at least one hollow space within the solidified component part, to thus form the component parts of the rim; and wherein at least one further component part, which forms at least part of a spoke, is manufactured by way of the following process steps: within the at least one further cavity of the tool device, a mold core device is disposed for forming at least one hollow space within the further component part; the fibrous composite material is injected into the at least one further cavity for forming the other component part; and the mold core device is retracted from the at least partially solidified fibrous composite material to form a cavity ( the wheel component with the rim and the integrally interconnected spokes is removed from the tool device.", "and wherein the cavity is completely filled with the fibrous composite material prior to injecting the fluid, so that the liquid fibrous composite material is at least partially displaced from the cavity into an overflow volume by way of injecting the fluid.", "9 . The method according to claim 7 , wherein the tool device comprises at least two cavities for manufacturing two component parts, and wherein the cavities are interconnected, and wherein fibrous composite material is injected into each cavity, so that the fibrous composite material bonds to form an integral wheel component.", "10 . The method according to claim 7 , wherein the fluid comprises a liquid such as water.", "wherein the tool device serves to manufacture wheel components comprising: a plurality of component parts, wherein the component parts are integrally interconnected and form a rim and a plurality of integrally configured spokes, wherein the rim and the spokes are manufactured in the tool device of a fibrous composite material by injection molding, wherein the tool device, for forming the component parts of the rim and the spokes, comprises at least two molding devices, which form cavities for forming a plurality of integrally interconnected component parts of the wheel component, wherein, for forming at least one component part of the rim, at least one injection port for injecting an at least partially liquid fibrous composite material and at least one injection nozzle for injecting at least one fluid is comprised within the one cavity for forming at least one hollow space within the component part of the rim; and wherein the tool device comprises at least one further cavity, which is connected with the cavity with the injection port; and wherein the tool device comprises a plurality of mold core devices, which, for forming hollow spaces in the spokes as component parts, are each retractable into, and extendable out of, the further cavities.", "12 . The apparatus with a tool device according to claim 11 , comprising at least one takeup device to at least partially dispose a hub body within the further cavity.", "13 . The apparatus with a tool device according to claim 11 , comprising at least four or five equal tool segments, wherein each tool segment comprises at least one cavity and at least one injection molding device with at least one injection nozzle for forming rim segments of the rim.", "14 . The apparatus with a tool device according to claim 11 , wherein each tool segment comprises at least one separate overflow volume, in particular an overflow cavity.", "15 . The apparatus with a tool device according to claim 11 , wherein each tool segment comprises at least one injection port for injecting an at least partially liquid fibrous composite material, and at least one assigned injection nozzle for injecting at least one fluid for forming hollow spaces in the rim segments, and a mold core device provided for controlled traversing for forming hollow spaces in the spokes."], "bibtex": "@patent{20240208262,\n    title = {WHEEL COMPONENT, METHOD OF MANUFACTURING, AND TOOL DEVICE},\n    number = {20240208262},\n    year = {2024},\n    note = {File: US20240208262A1-20240627.XML}\n    }", "classification": "B60B100FI"}, {"title": "CARBON FIBER REINFORCED THERMOPLASTIC SPOKE AND MANUFACTURING METHOD FOR THE SAME", "doc_number": "20240208263", "filename": "US20240208263A1-20240627.XML", "abstract": "A spoke has a carbon rod and at least one connecting unit. The carbon rod is made of a composite material containing thermoplastic resin and carbon fibers and has at least one blocking portion. Each one of the at least one connecting unit has a tube mounted on and around the carbon rod and blocked by a corresponding one of the at least one blocking portion. The carbon rod is heated and shaped to form the blocking portion. The spoke in accordance with the present invention blocks the connecting unit by the blocking portion to promote a connection stability of the spoke.", "detailed_description": ["With reference toFIGS.1to3, a first embodiment of a carbon fiber reinforced thermoplastic spoke manufactured by a manufacturing method for the same has a carbon rod10and two connecting units20. Wherein, the carbon rod10is made of a composite material containing thermoplastic resin and carbon fibers. The carbon rod10has two blocking portions11and a wind-resistant section12. The two blocking portions11are respectively disposed at two opposite ends of the carbon rod10. The wind-resistant section12is disposed at a middle portion of the carbon rod10and between the two blocking portions11.", "", "With reference toFIGS.1to3, each connecting unit20has a positioning sleeve21and a tube22. The positioning sleeve21has a connected section211and a receiving section212. The connected section211and the receiving section are both ring-shaped and are coaxially connected to each other. The connected section211has an inner diameter smaller than an inner diameter of the receiving section212. The tube22has an outer diameter smaller than the inner diameter of the receiving section212. The connected section211and the receiving section212of each connecting unit20are mounted on and around the carbon rod10. The two connecting units20are respectively adjacent to the two opposite ends of the carbon rod10and are respectively blocked by the two blocking portions11.", "", "With reference toFIGS.1to3, the tube22of each connecting unit20has two opposite ends. One of the two opposite ends of the tube22is blocked by a corresponding one of the two blocking portions11, the other one of the two opposite ends of the tube22is inserted in the receiving section212of the positioning sleeve21of the connecting unit20and is blocked by the positioning sleeve21. In the first embodiment of the present invention, the carbon rod10is heated and shaped to form the two blocking portions11configured to respectively block the two connecting units20. An end portion of the tube22of one of the two connecting units20is a divergent conical end, the corresponding one of the blocking portions11corresponds to the divergent conical end in shape and is substantially spherical. The other one of the blocking portions11is shaped as a short pillar. In the present invention, the middle portion of the carbon rod10is heated and shaped to form the wind-resistant section12with a thin cross-section for reducing wind resistance.", "", "With reference toFIG.4, in the present invention, peripheral surfaces of the tube22of one of the two connecting units20and the corresponding blocking portion11of the connecting unit20can be machined to form a thread, which is for screwing, on the corresponding blocking portion11.", "", "With reference toFIGS.5and6, a second embodiment of the spoke in accordance with the present invention is shown. The first embodiment and the second embodiment are similar in that the carbon rod10is heated and shaped to form said blocking portions11to block said connecting unit20. Difference between the first and the second embodiments is that the second embodiment only has one connecting unit20and the carbon rod10only has one blocking portion11accordingly. In addition, in the second embodiment, the connecting unit20does not have the positioning sleeve21and only has the tube22mounted on and around the blocking portion11. In the second embodiment of the present invention, the tube22of the connecting unit20and the blocking portion11are bent together. Therefore, the tube22of the connecting unit20is blocked by the blocking portion11. In the second embodiment, the blocking portion11even has a protrusion which is substantially spherical and is disposed outside the tube22.", "", "With reference toFIGS.7and8, a third embodiment of the spoke in accordance with the present invention is shown. The first, second, and third embodiments of the present invention are similar, as said carbon rod10is heated and shaped to form said blocking portion11for blocking said connecting unit20. In the third embodiment, the spoke in accordance with the present invention also has the two connecting units20and the carbon rod10. The carbon rod10also has two blocking portions11respectively blocking the two connecting units20. In the third embodiment, each connecting unit20does not have the positioning sleeve21and only has the tube22. Please refer toFIGS.7and8: the tube22of the connecting unit20sleeved adjacent to a right end of the carbon rod10is bent with and blocked by the blocking portion11disposed at the right end of the carbon rod10. Please refer toFIGS.7and8again: the tube22of the other connecting unit20is mounted on and around a left end of the carbon rod10and is blocked by the other blocking portion11formed between the tube22and the wind-resistant section12of the carbon rod10.", "", "With reference toFIGS.9and10, a fourth embodiment and a fifth embodiment are respectively shown. In the fourth and the fifth embodiments, the tube22of each connecting unit20is made of a flexible material such as metal. The tube22and the carbon rod10are heated and shaped by pressing together to form said blocking portion11configured to block the tube22of said connecting unit20.", "", "In the first embodiment, one of the two blocking portions11is shaped as a short pillar, the other one of the two blocking portions11is shaped as a ball. Practically, as long as each blocking portion11is able to block one corresponding connecting unit20or the tube22of the corresponding one connecting unit20, the shape and the position of said blocking portion11are not restricted. In the present invention, the cross-section of the wind-resistant section12of the carbon rod10is rectangular. Practically, as long as the cross-section of the wind-resistant section12is sufficiently thin for reducing wind resistance, the contour of the cross-section of the wind-resistant section12is not restricted.", "", "With reference toFIG.11, a manufacturing method for a carbon fiber reinforced thermoplastic spoke comprises steps of a connecting unit assembly step S1, a blocking portion formation step S2, a wind-resistant section formation step S3, and a finishing step S4.", "", "In the connecting unit assembly step S1: first of all, preparing one said carbon rod10made of a composite material containing thermoplastic resin and carbon fibers and a said connecting unit20. Wherein, the connecting unit20has one said positioning sleeve21and one said tube22. Then, mount the positioning sleeve21and the tube22of the connecting unit20on and around the carbon rod10.", "", "In the blocking portion formation step S2: heating and shaping the carbon rod10to form one said blocking portion11for blocking the tube22of the connecting unit20. With reference toFIGS.5to8, in the blocking portion formation step S2, when the tube22is thermoplastic, the carbon rod10and the tube22mounted on and around the carbon rod10can be heated together and bent together. The blocking portion11and the tube22are both curved, so the tube22can be blocked by the blocking portion11accordingly. With reference toFIGS.9and10, when the tube22is flexible, the carbon rod10and the tube22mounted on and around the carbon rod10can be heated together and pressed together to shape the blocking portion11configured to block the tube22.", "", "In the wind-resistant section formation step S3: heating and shaping the middle portion of the carbon rod10to form the wind-resistant section12with said thin cross-section to reduce wind resistance. In the present invention, the wind-resistant section formation step S3may be performed before the blocking portion formation step S2. Sequences of the blocking portion formation step S2and the wind-resistant section formation step S3are not limited.", "", "In the finishing step S4: processing the blocking portion11to remove rough edges, formed by heating and shaping, on the blocking portion11and on the wind-resistant section12. With reference toFIG.4, in the finishing step S4, the blocking portion11may be milled to form the thread for screwing.", "", "Compared to a conventional carbon spoke combining a carbon rod and a connecting unit by glue, the carbon fiber reinforced thermoplastic spoke, manufactured by the manufacturing method of the present invention, blocks the tube22of the connecting unit20via the blocking portion11formed on the carbon rod10by heating and shaping. The present invention combines or blocks the tube22of the connecting unit20in structure. The carbon rod10and the tube22of the connecting unit20are free from detaching from each other due to deterioration of the glue. The connection between the carbon rod10and the tube22of the connecting unit20is promoted.", "", "Even though numerous characteristics and advantages of the present invention have been set forth in the foregoing description, together with details of the structure and features of the invention, the disclosure is illustrative only. Changes may be made in the details, especially in matters of shape, size, and arrangement of parts within the principles of the invention to the full extent indicated by the broad general meaning of the terms in which the appended claims are expressed."], "claims": ["a carbon rod made of a composite material containing thermoplastic resin and carbon fibers and having at least one blocking portion; at least one connecting unit, each one of the at least one connecting unit having a tube mounted on and around the carbon rod and blocked by a corresponding one of the at least one blocking portion; wherein the carbon rod is heated and shaped to form the at least one blocking portion.", "each one of the at least one connecting unit has a positioning sleeve mounted on and around the carbon rod, fixed to the carbon rod, and being unmovable relative to the carbon rod; and the tube of each one of the at least one connecting unit has two opposite ends, one of the two opposite ends of the tube is blocked by the corresponding one of the at least one blocking portion, the other one of the two opposite ends of the tube is blocked by the positioning sleeve of the connecting unit.", "the positioning sleeve of each one of the at least one connecting unit has a connected section shaped as a ring and having an inner diameter; and a receiving section shaped as a ring, coaxially connected to the connected section, and having an inner diameter larger than the inner diameter of the connected section; and the tube of each one of the at least one connecting unit has an outer diameter smaller than the inner diameter of the receiving section of the connecting unit; one of the two opposite ends of the tube of each one of the at least one connecting unit is blocked by the corresponding one of the at least one blocking portion, the other one of the two opposite ends of the tube is inserted in and blocked by the receiving section of the positioning sleeve of the connecting unit.", "4 . The spoke as claimed in claim 3 , wherein the spoke has a thread formed on a peripheral surface of the tube of one of the at least one connecting unit and extending to a peripheral surface of the corresponding one of the at least one blocking portion which blocks the tube of the connecting unit.", "5 . The spoke as claimed in claim 1 , wherein one of the at least one blocking portion is curved, the tube of one of the at least one connecting unit mounted on and around the blocking portion curves with the blocking portion and is blocked by the blocking portion.", "the carbon rod is heated and shaped to form a wind-resistant section disposed at a middle portion of the carbon rod; and the wind-resistant section has a thin cross-section.", "the carbon rod is heated and shaped to form a wind-resistant section disposed at a middle portion of the carbon rod; and the wind-resistant section has a thin cross-section.", "the carbon rod is heated and shaped to form a wind-resistant section disposed at a middle portion of the carbon rod; and the wind-resistant section has a thin cross-section.", "the carbon rod is heated and shaped to form a wind-resistant section disposed at a middle portion of the carbon rod; and the wind-resistant section has a thin cross-section.", "the carbon rod is heated and shaped to form a wind-resistant section disposed at a middle portion of the carbon rod; and the wind-resistant section has a thin cross-section.", "a connecting unit assembly step: preparing a carbon rod made of a composite material containing thermoplastic resin and carbon fibers and a connecting unit having a tube and mounting the tube on and around the carbon rod; a blocking portion formation step: heating and shaping the carbon rod to form a blocking portion for blocking the tube of the connecting unit; and a finishing step: processing the blocking portion to remove rough edges, formed by heating and shaping, on the blocking portion.", "12 . The spoke as claimed in claim 11 , wherein the manufacturing method has a wind-resistant section formation step: heating and shaping a middle portion of the carbon rod to form a wind-resistant section with a thin cross-section for reducing wind resistance.", "13 . The spoke as claimed in claim 11 , wherein the carbon rod and the tube are heated and bent together to curve both the blocking portion and the tube such that the tube is blocked by the blocking portion in the blocking portion formation step.", "14 . The spoke as claimed in claim 11 , wherein the carbon rod and the tube are heated and pressed to shape the carbon rod to form the blocking portion configured to block the tube in the blocking portion formation step."], "bibtex": "@patent{20240208263,\n    title = {CARBON FIBER REINFORCED THERMOPLASTIC SPOKE AND MANUFACTURING METHOD FOR THE SAME},\n    number = {20240208263},\n    year = {2024},\n    note = {File: US20240208263A1-20240627.XML}\n    }", "classification": "B60B502FI"}, {"title": "REDUCED NOISE WHEEL HUB UNIT", "doc_number": "20240208264", "filename": "US20240208264A1-20240627.XML", "abstract": "A vehicular wheel hub unit includes a radially outer bearing ring, a radially inner bearing ring, and a plurality of rolling elements supporting the inner bearing ring and the outer bearing ring for relative rotation. The inner bearing ring has an axially facing metal coupling surface configured to frictionally engage a connecting surface of an element, such as a bell of a constant velocity joint, adjacent to the inner bearing ring, and the coupling surface includes at least one first region having a plurality of coupling surface ablations configured to affect an amount of friction between the coupling surface and the connecting surface. Also a method including ablating at least a first region of a coupling surface of an inner bearing ring.", "detailed_description": ["InFIG.1, reference sign1indicates a vehicle wheel hub assembly in its entirety. The wheel hub assembly comprises a wheel hub unit2including a rolling bearing3, which in the illustrated example is a mixed bearing with two rows of rolling elements (balls) and a bell50of a constant velocity joint60(both shown schematically inFIG.1and of a known type, and thus will not be described further herein).", "", "The wheel hub unit2is configured to support a wheel (not shown) of a vehicle in a rotary manner about a rotation axis A and can be axially butt coupled to the bell50of the constant velocity joint60to transmit a drive torque to the wheel.", "", "The wheel hub unit2includes a radially outer ring6, a radially inner ring7and a plurality of rolling elements8, in this case two rows of balls arranged side by side, interposed between the inner ring7and the outer ring6to enable relative rotation therebetween.", "", "The outer ring6and the inner ring7and the rolling elements8are part of the rolling bearing3. In the non-limiting example shown, the rolling bearing3is a “third generation” bearing, and therefore directly forms the entire wheel hub unit2, since the outer ring6comprises a known flange9that is used for attachment to a suspension pillar (not shown) and is integral with the outer ring6, and since the inner ring7comprises a known flange10that is configured to be attached to the wheel of a vehicle (not shown) and is integral with the inner ring7, particularly at an axial end11thereof opposite the flange9and at a second end12of the inner ring7.", "", "However, in embodiments, the flanges9and/or10would be formed on a wheel hub or spindle provided with the rolling bearing3without one or both of the flanges9and10, but including the rings6and7thereof connected to the flanges9and10, respectively, in a rotationally fixed manner.", "", "In the non-limiting, preferred example illustrated, the inner ring7is also split, according to a known configuration, into two separate elements that are angularly coupled together in a rotationally fixed manner, one element being an annular element formed by the ends11,12and the one-piece flange10, and the other element being a known small inner ring13, driven onto the end12to butt axially against an axial shoulder14of the inner ring7that is oriented towards the end12.", "", "FIGS.1and2show respective example embodiments of the wheel hub unit.", "", "In particular,FIG.1shows an open wheel hub assembly2in which the inner rolling ring is axially held in place by attaching the wheel hub unit2to the aforementioned constant velocity joint60.", "", "On the other hand,FIG.2shows an asymmetric wheel hub unit200, i.e. one in which the two rows of rolling elements have different pitch diameters, and in which the inner rolling ring is axially held in place by an annular edge21deformed orbitally by cold upsetting. The deformed and upset annular edge is formed against the small inner ring13, thereby axially securing the small inner ring13to the inner ring7.", "", "In any case, the small inner ring13or the inner ring7has a metal surface19that is part of either the small inner ring13or the inner ring7and that is or can be butt coupled in contact, and without interposition of additional components, with a corresponding metal surface of the bell50of the constant velocity joint60.", "", "According to the possible embodiments of the disclosure shown inFIGS.1and2, the metal surface19can be defined by a front face of the small inner ring13axially spaced from the face15(FIG.1) or by a front face of the annular edge21which has been deformed and upset against the small inner ring13(FIG.2).", "", "According to one aspect of the disclosure, the metal surface19is provided with a plurality of surface ablations30(the term “ablation” to be understood indifferently to mean grooves or impressions/depressions) intended to affect the friction between the metal surface19and the corresponding mating metal surface of the constant velocity joint. The is intended to reduce the noise generated by stick-slip, which can be done in two ways, either a high-friction method or a low-friction method, each of which is discussed in greater detail below.", "", "In the high friction method, noise reduction is achieved by increasing the roughness of the metal surface19, i.e. the friction coefficient between the two surfaces in contact so as to almost completely eliminate the stick-slip phenomenon. Given that the roughness value Ra of the metal surface19, at the end of the finishing processes, is approximately 0.15 μm, according to this method the plurality of surface ablations30will have to generate a roughness Ra of between 0.20 μm and 6 μm, according to the results of experimental tests. This method allows the relative slipping between the surfaces in contact to be almost completely eliminated, thereby eliminating any noise associated with this slipping. In particular, the upper value of 6 μm is compatible with a localized laser treatment, which is one possible way of obtaining surface ablations, as explained in more detail below. Furthermore, the value of 6 μm was chosen as it is close to the roughness value used for the interfaces between the radially outer ring and the suspension pillar in order to reduce noise.", "", "In the low friction method, noise reduction is achieved by reducing the roughness of the metal surface19, i.e. the friction coefficient between the two surfaces in contact to enable practically noise-free local slipping. In this second method, the roughness value Ra must be less than 0.10 μm. This method clearly does not eliminate the relative slipping between the surfaces in contact, but rather facilitates it; however this also significantly reduces the noise associated with such slipping.", "", "The disclosure is applicable both to the wheel hub unit2inFIG.1and to the wheel hub unit200inFIG.2.", "", "The wheel hub units2,200therefore include these surface ablations in the metal surface19(belonging to the small inner ring13or to the inner ring7) which enable very low friction or very high friction between the two surfaces in contact, depending on the method used.", "", "With reference toFIG.3and as already mentioned, the surface ablations can be obtained by localized laser treatment of the contact surface using a laser device40of a known type, for example similar to laser marking devices, performing the localized ablation by means of a pulsed-light laser beam41. Naturally, the laser device is only one of the possibilities for obtaining surface ablations, which can also be done using other known methods.", "", "The description below refers only to the method according to which the roughness of the metal surface19is increased. This is because this methods resolves the technical problem at the root by completely eliminating the slipping between the surfaces and therefore any related noise source, and because this method is easier to control using the normal control parameters of a laser device (power, speed and frequency), given that this method involves forming grooves that are larger than the grooves resulting from the normal surface finish of the small inner ring13(or the inner ring7).", "", "Naturally, the second method (with roughness Ra<0.10 μm) can also be implemented in all the forms described below by changing the aforementioned parameters accordingly.", "", "Advantageously, the plurality of surface ablations can also be present on the corresponding coupling surface of the bell50of the constant velocity joint60with the metal surface19of the small inner ring13or of the inner ring7. This significantly increases the friction coefficient between the inner ring and the bell of the joint.", "", "The plurality of surface ablations30can be described with reference to the macrostructure thereof, i.e. what is visible to the naked eye, this macrostructure being of the same order of magnitude as the diameter of the small inner ring13of the bearing3. Alternatively, the surface ablations30can be described with reference to the microstructure thereof, i.e. with the order of magnitude of the obtainable roughness (a few microns or a few tenths or hundredths of microns depending on the chosen method).", "", "With reference toFIGS.4and5, the macrostructure of the surface ablations30can for example take either a localized or continuous circumferential or wavy form each of which is discussed below.", "", "When the surface ablations are localized, each localized surface ablation31comprises a plurality of point-like impressions packed together. There may be four localized ablations31(as in the example inFIG.4) arranged circumferentially at 90° from each other. Evidently, both the number of point-like impressions and the number of localized surface ablations31are variable and can be optimized using experimental tests based on the intended use of the wheel hub assembly;", "", "When the surface ablations are continuous circumferentially, each surface ablation can be circular so that the entire metal surface19is covered by plurality of concentric circular grooves. This shape is well suited to the high friction method as well as to obtaining roughness values of a few microns according to the low friction method.", "", "When the surface ablations are wavy as shown inFIG.5, each wavy surface ablation32can be made by means of a circumferential groove with a plurality of waves33with crests and troughs extending in a radial direction. The wavy surface ablations can be continuous or discontinuous, as inFIG.5.FIG.5shows an example in which the waves33are discontinuous.", "", "Some examples of the microstructure of surface ablations can be appreciated with reference toFIGS.6to8. The microstructure is not visible to the naked eye andFIGS.6to8show images acquired with an electron microscope. Different roughness values in different directions can be obtained by acting on the nature of the microstructure. By way of example, embodiments of the microstructure may comprise points.FIG.6Ashows an example of microstructure with points. This microstructure is characterized by a plurality of point-like impressions34, which are well suited to providing a macrostructure with localized surface ablations31(as inFIG.4). The microstructure can comprise points or lines or grooves.", "", "In particular, with reference toFIG.6B, the microstructure34is made on the metal surface19, and has a crater shape with a concave trough34″ and an annular edge34′ projecting from the metal surface19. This structure provides further advantages since localized laser treatment causes localized hardening of the material, and a hardened surface combined with the presence of the annular edge34′ improves performance in terms of roughness and consequently increases static friction between the coupling surfaces. The greater surface hardness is achieved because the process involves rapid heating and cooling and has an effect similar to a heat treatment. As a result, the surface structure has greater hardness and abrasion resistance than the base material. The locally hardened surface portions thus increase static friction due to pressure concentrations and local deformations of the corresponding coupling surface;", "", "The microstructure can also take the form of a plurality of lines or grooves, wherein each line can be continuous or comprise a series of points. The line microstructure can have a radial, circumferential or inclined orientation. The example shown inFIG.7Ais a surface ablation with a microstructure with inclined lines35, whileFIG.7Bshows an example of a surface ablation with circumferential lines36.", "", "In particular, where the linear microstructure comprises a plurality of radial lines, experimental tests have shown that creating a distance between consecutive radial lines of the same order of magnitude as the width of said radial lines, i.e. the width of the grooves created by the laser treatment, is advantageous, again in terms of increasing static friction.", "", "Preferably, the same linear microstructure with radial lines can also be applied on the coupling surface of the bell50of the constant velocity joint60. With this configuration, the pitch of the two coupling surfaces enables meshing. This helps to maximize static friction in the circumferential direction. This condition in which differential roughness is created (high in the circumferential direction, low in the radial direction) facilitates both torque transmission and radial slipping between the coupling surfaces during tightening;", "", "The microstructure can also take the form of a plurality of crossed lines (or crossed grooves), in which each line can be continuous or comprise a series of points.FIG.8shows an example of surface ablation with crossed lines37. Advantageously, such a microstructure allows the same depth value or two different depth values to be used for the crossed lines, creating a single roughness value or two different roughness values, respectively. This solution has the advantage of providing continuous and, if desired, symmetrical immobilization in both relative slipping directions.", "", "In the specific case in which the surface ablations are obtained using a laser device, in addition to the power of the laser source the size of the laser beam and the feed speed of the beam and the frequency of the pulses must be determined. The power of the laser beam defines the minimum size of a single impression, and these two parameters together define the spacing and depth of the micro-grooves.", "", "For example, in tests carried out on the small inner ring13, speed values of 4000 mm/s and pulse frequency values varying from 30 to 110 kHz were used. Localized surface ablations with a crossed-line microstructure were obtained.", "", "The disclosure can also be applied to other surfaces affected by the stick-slip phenomenon. For example and with reference toFIG.2, the disclosure can be applied to the surface16of the flange9of the outer ring6that interfaces with a corresponding surface of the suspension pillar.", "", "The present disclosure has numerous advantages. For example, it solves the technical problem of noise deriving from stick-slip, making the wheel hub assembly more stable over time, since the implementation of surface ablations is a process not subject to variation and/or ageing. In addition, there is no impact on the assembly procedures of the wheel hub unit with the constant velocity joint and there are no additional components, and the axial dimensions of the wheel hub assembly (wheel hub unit and constant velocity joint) remain unchanged. Furthermore, from a structural point of view, the presence of surface ablations does not lead to failure, even over time, since the two coupling surfaces are made of hardened steel.", "", "It should be understood that, in addition to the embodiments of the disclosure described above, numerous other variants of the disclosure exist. It should also be understood that said embodiments are merely examples and do not limit the scope of the disclosure, the applications thereof, or the possible configurations thereof. On the contrary, although the description provided above enables the person skilled in the art to carry out the present disclosure at least according to one exemplary configuration thereof, it should be understood that numerous variations of the components described may be devised, without thereby departing from the scope of the disclosure, as defined in the attached claims, interpreted literally and/or according to their legal equivalents."], "claims": ["a radially outer bearing ring, a radially inner bearing ring, and a plurality of rolling elements supporting the inner bearing ring and the outer bearing ring for relative rotation, wherein the inner bearing ring has an axially facing metal coupling surface configured to frictionally engage a connecting surface of an element adjacent to the inner bearing ring, and wherein the coupling surface includes at least one first region having a plurality of coupling surface ablations configured to affect an amount of friction between the coupling surface and the connecting surface.", "wherein a surface roughness Ra of the at least one first region is from 0.20 μm to 6 μm.", "wherein a surface roughness Ra of the at least one first region is less than 0.10 μm.", "wherein the connecting surface includes a plurality of connecting surface ablations.", "wherein the at least one first region comprises a plurality first regions, each adjacent pair of first regions being separated by a non-ablated second region.", "wherein each of the first regions comprises a plurality of point-like impressions.", "wherein each of the plurality of coupling surface ablations is circumferentially continuous.", "wherein each of the plurality of coupling surface ablations comprises a wavy arc shape having a plurality of crests and troughs.", "wherein each of the plurality of coupling surface ablations has a point-like microstructure.", "wherein each of the plurality of coupling surface ablations has a crater shape.", "wherein each of the plurality of surface ablations has a linear microstructure which is continuous or formed by a series of points.", "wherein the linear microstructure comprises a plurality of radial lines, and wherein a distance between consecutive radial lines is of a same order of magnitude as a width of each of the radial lines.", "wherein each of the plurality of coupling surface ablations has a microstructure in the form of crossed lines.", "wherein the microstructure in the form of crossed lines generates a single roughness value or two different roughness values on the metal surface.", "wherein the element adjacent to the inner bearing ring comprises a bell of a constant velocity joint.", "wherein a bell of the constant velocity joint includes the connecting surface, and wherein the coupling surface is in direct contact with the connecting surface.", "providing an inner bearing ring having an axially facing coupling surface configured to engage a connecting surface of a bell of a constant velocity joint, the axially facing coupling surface having an initial surface roughness, ablating at least one first region of the coupling surface to change the initial surface roughness of the at least one first region of the coupling surface to a new surface roughness, and assembling the inner bearing ring with an outer bearing ring and a plurality of rolling elements to form a vehicular wheel hub unit.", "wherein the ablating comprises a laser ablating.", "wherein the new surface roughness is from 0.20 μm to 6 μm.", "including leaving at least one surface region of the coupling surface unablated."], "bibtex": "@patent{20240208264,\n    title = {REDUCED NOISE WHEEL HUB UNIT},\n    number = {20240208264},\n    year = {2024},\n    note = {File: US20240208264A1-20240627.XML}\n    }", "classification": "B60B2700FI"}, {"title": "CASTER WITH A BREAKING UNIT", "doc_number": "20240208265", "filename": "US20240208265A1-20240627.XML", "abstract": "A caster includes a caster unit and at least one braking unit. The caster unit includes a receptacle, a wheel shaft disposed through the receptacle, a wheel assembly sleeved on the wheel shaft and rotatable relative to the receptacle, and a spring assembly which acts on the receptacle and the wheel shaft. The receptacle is movable relative to the wheel assembly in a vertical direction. The braking unit includes a surrounding teeth structure formed on the wheel assembly and having a hardness ranging from 65 to 75 on a Shore D scale, and a braking piece mounted on the receptacle. The braking piece includes a braking surface in form of a curve surface having a hardness ranging from 40 to 46 on the Shore D scale to be engaged with the surrounding teeth structure to retard rotation of the wheel assembly.", "detailed_description": ["It should be noted herein that for clarity of description, spatially relative terms such as “top,” “bottom,” “upper,” “lower,” “on,” “above,” “over,” “downwardly,” “upwardly” and the like may be used throughout the disclosure while making reference to the features as illustrated in the drawings. The features may be oriented differently (e.g., rotated 90 degrees or at other orientations) and the spatially relative terms used herein may be interpreted accordingly.", "", "Referring toFIGS.3,4and5, an embodiment of a caster according to the disclosure is fitted to a piece of furniture, such as a chair through a mounting shaft91, and includes a caster unit2and two braking units3.", "", "With reference toFIGS.4,5and6, the caster unit2includes a receptacle21, a wheel shaft22which extends along an axial direction (D11) (i.e., a left-right direction) and which is loosely engaged and is disposed through the receptacle21, a wheel assembly23which is sleeved on the wheel shaft22and which is rotatable relative to the receptacle21, and a spring assembly24which acts on the receptacle21and the wheel shaft22in a vertical direction.", "", "The receptacle21is mounted below and connected with a chair leg through the mounting shaft91in a known manner. The receptacle21is movable relative to the wheel assembly23in the vertical direction, and includes two mount housing portions25which project in the axial direction (D11). Each mount housing portion25has a rectangular surrounding wall250to define a housing space255. The surrounding wall250includes a first wall edge251and a second wall edge252which are formed at a lower end of the surrounding wall250and which are spaced apart from each other in the axial direction (D11). Each of the first and second wall edges251,252extends in an arcuate direction (D12). The first wall edge251is formed with a notch253which is tapered upwardly and in the form of a sector.", "", "The wheel assembly23includes two wheels231which are respectively mounted on two ends of the wheel shaft22and outboard of two sides of the receptacle21in the axial direction (D11) (i.e., left and right sides of the receptacle21). Each wheel231includes an outer rim surface232for contacting the ground surface92, and an inner rim surface233inwardly of the outer rim surface232in a radial direction (D13). The mount housing portions25are disposed inwardly of the inner rim surfaces232of the wheels231, respectively.", "", "The spring assembly24includes a support piece241which is sleeved on the wheel shaft22and is disposed in the receptacle21, and a biasing piece242which is connected between the support piece241and the receptacle21. The biasing piece242is a compression spring which is compressed as a result of a downward movement of the receptacle21relative to the wheel assembly23to urge the receptacle21upwardly relative to the wheel assembly23.", "", "Each braking unit3includes a surrounding teeth structure31which is formed on the inner rim surface233of the respective wheel231, and a braking piece32which is mounted within the respective mount housing portion25of the receptacle21.", "", "Each surrounding teeth structure31is made of a nylon material which has a hardness ranging from 65 to 75 on a Shore durometer type D scale, and includes a plurality of teeth311which are arranged along the arcuate direction (D12) and cooperatively define an inner teeth rim312. In this embodiment, each surrounding teeth structure31is made of nylon material having a hardness of 70 on the Shore D scale. Each braking piece32is made of a material which has a hardness ranging from 40 to 46 on the Shore D scale, such as polyurethane having a hardness of 43 on the Shore D scale.", "", "Each braking piece32is disposed inwardly of the corresponding surrounding teeth structure31in the radial direction (D13), and includes an insert portion33which is inserted upwardly into the housing space255of the corresponding mount housing portion25, a barb portion34which is integrally formed with and extends upwardly from the insert portion33, and a braking portion35which is integrally formed with and extends downwardly from the insert portion33and outwardly of the corresponding mount housing portion25. The insert portion33is rectangular. The barb portion34is retained on an upper end of the surrounding wall250of the corresponding mount housing portion25. The braking portion35has a braking surface350at a bottom end thereof and facing the corresponding surrounding teeth structure31. The braking surface350is in the form of a curved surface without teeth, and extends along the arcuate direction (D12). The braking portion35further includes a first engaging protrusion351and a second engaging protrusion352which project in the axial direction (D11) from the insert portion33and away from each other.", "", "The braking surface350is formed as a part of the braking piece32so as to have a hardness of 43 on the Shore D scale. The braking surface350extends in the arcuate direction (D12), and intersects a plane sectioned in the radial direction (D13) at an arcuate line (L11). The curvature of the inner teeth rim312is the same as the arcuate line (L11).", "", "The first engaging protrusion351extends along the arcuate direction (D12), and has a first upper edge section3511which abuts against and is engaged with the corresponding first wall edge251. The first upper edge section3511of the first engaging protrusion351has a protuberance353projecting in the radial direction (D13) to be inserted upwardly into the notch253of the first wall edge251. The protuberance353is in the form of a sector so as to be fitted to the notch253. The second engaging protrusion352extends along the arcuate direction (D12), and has a second upper edge section3521which abuts against and is engaged with the corresponding second wall edge252.", "", "With reference toFIGS.5to8, the caster of the embodiment is shiftable between a movable state (seeFIGS.5and6) and an unmoved state (seeFIGS.7and8). In the movable state, the biasing piece242urges the receptacle21upwardly so as to keep the braking surfaces350of the braking pieces32to disengage and be spaced apart from the surrounding teeth structures31. In this state, the wheels231are rotatable relative to the receptacle21so as to move the chair.", "", "When a user sits on the chair, a downward pressure is transmitted to the receptacle21through the mounting shaft91to move the receptacle21downwardly relative to the wheels231and compress the biasing pieces242. The braking pieces32are moved downwardly to abut against and be engaged with the surrounding teeth structures31so as to be shifted to the unmoved state. With reference toFIGS.4,7and8, in the unmoved state, each braking surface350abuts against and is engaged with the teeth311of the corresponding surrounding teeth structure31. At this stage, with the weight of the user, and the braking surfaces350having the hardness smaller than that of the teeth311of the surrounding teeth structures31, the braking surfaces350are slightly deformed such that the teeth311of each surrounding teeth structure31are slightly engaged in the corresponding braking surface350, as shown inFIG.8so as to be retained unmoved by the braking surface350. As such, the braking surfaces350cooperate with the surrounding teeth structures31to retard rotation of the wheels231of the wheel assembly23relative to the receptacle21to prevent movement of the chair.", "", "When the user leaves the chair and the downward pressure is relieved, the receptacle21is urged upwardly by the biasing piece242to permit the braking surfaces350to be disengaged from the surrounding teeth structures31so as to shift the caster to the movable state ofFIGS.5and6.", "", "Since the braking surfaces350are in the form of a curve surface free of teeth, generation of striking noise when the braking surfaces350are moved to abut against and engaged with the surrounding teeth structures31is minimized. Moreover, with the braking surfaces350and the surrounding teeth structures31having appropriate hardness, the braking surfaces350are slightly deformed for retainingly engaging the surrounding teeth structures31so as to provide a meshing engagement therebetween as a toothed structure.", "", "The curvature of each inner teeth rim312(i.e. the curvature of a line connecting edges of the teeth) is the same as the arcuate line (L11) of the braking surface350, which facilitates the engagement of the teeth311with the braking surfaces350so as to optimize the braking effect. Moreover, each of the first wall edges251, the second wall edges252, the first engaging protrusions351and the second engaging protrusions352extends in the arcuate direction (D12) so as to facilitate mating engagement therebetween. Furthermore, with the protuberance353of each first engaging protrusion351being engageable into the notch253of the corresponding first wall edge251, alignment instruction is provided during fabrication of the caster, and movement of the braking pieces32relative to the mount housing portions25in the arcuate direction (D12) is prevented.", "", "As illustrated, with the braking surfaces350and the surrounding teeth structures31having appropriate hardness, and with the braking surfaces350in the form of a curved surface without teeth, a new caster with a different braking structure from the prior art is provided which can prevent generation of noise during the braking operation.", "", "While the disclosure has been described in connection with what is considered the exemplary embodiment, it is understood that this disclosure is not limited to the disclosed embodiment but is intended to cover various arrangements included within the spirit and scope of the broadest interpretation so as to encompass all such modifications and equivalent arrangements."], "claims": ["a caster unit including a receptacle, a wheel shaft which extends along an axial direction and which is disposed through said receptacle, a wheel assembly which is sleeved on said wheel shaft and which is rotatable relative to said receptacle, and a spring assembly which acts on said receptacle and said wheel shaft in a vertical direction, said receptacle being movable relative to said wheel assembly in the vertical direction, said spring assembly being compressed as a result of a downward movement of said receptacle relative to said wheel assembly to urge said receptacle upwardly relative to said wheel assembly; and at least one braking unit including a surrounding teeth structure which is formed on said wheel assembly, and a braking piece which is mounted on said receptacle, said surrounding teeth structure being made of a material which has a hardness ranging from 65 to 75 on a Shore D scale, said braking piece being disposed inwardly of said surrounding teeth structure in a radial direction, and including a braking surface which faces said surrounding teeth structure, said braking surface being in form of a curved surface without teeth, and being made of a material which has a hardness ranging from 40 to 46 on the Shore D scale, said braking surface being engaged with and disengaged from said surrounding teeth structure when said receptacle is moved downwardly and upwardly, respectively, and cooperating with said surrounding teeth structure to retard rotation of said wheel assembly relative to said receptacle when being engaged with said surrounding teeth structure.", "2 . The caster of claim 1 , wherein said wheel assembly includes two wheels which are respectively mounted on two ends of said wheel shaft and outboard of two sides of said receptacle in the axial direction, each of said wheels including an outer rim surface and an inner rim surface inwardly of said outer rim surface in the radial direction, said caster comprising two of said braking units, said surrounding teeth structure of each of said braking units being formed on said inner rim surface of a respective one of said wheels, said braking piece of each of said braking units being disposed inwardly of said inner rim surface of said respective wheel in the radial direction.", "3 . The caster of claim 2 , wherein said receptacle includes two mount housing portions which project in the axial direction and which are disposed inwardly of said inner rim surfaces of said wheels, respectively, said braking pieces of said braking units being respectively disposed within said mount housing portions, each of said braking pieces including an insert portion which is inserted into a respective one of said mount housing portion, and a braking portion which extends downwardly from said insert portion and outwardly of said respective mount housing portion, said braking portion of each of said braking pieces having said braking surface at a bottom end thereof and facing said surrounding teeth structure.", "4 . The caster of claim 3 , wherein each of said mount housing portions has a surrounding wall to define a housing space for insertion of and receiving said insert portion of a respective one of said braking pieces, said surrounding wall including a first wall edge and a second wall edge which are formed at a lower end of said surrounding wall and which are spaced apart from each other in the axial direction, each of said first and second wall edges extending in an arcuate direction, said braking portion of each of said braking pieces including a first engaging protrusion and a second engaging protrusion which project in the axial direction from said insert portion and away from each other, said first engaging protrusion having a first upper edge section which abuts against and is engaged with said first wall edge, said second engaging protrusion having a second upper edge section which abuts against and is engaged with said second wall edge.", "5 . The caster of claim 4 , wherein one of said first engaging protrusion and said first wall edge has a protuberance projecting in a radial direction to be inserted into the other one of said first engaging protrusion and said first wall edge in the radial direction.", "6 . The caster of claim 5 , wherein said protuberance is in form of a sector.", "7 . The caster of claim 3 , wherein each of said mount housing portions has a surrounding wall to define a housing space for insertion of and receiving said insert portion of a respective one of said braking pieces, each of said braking pieces further including a barb portion which extends upwardly from said insert portion and which is retained on an upper end of said surrounding wall of a respective one of said mount housing portions.", "8 . The caster of claim 3 , wherein said braking surface of each of said braking pieces extends in an arcuate direction, and intersects a plane sectioned in the radial direction at an arcuate line.", "9 . The caster of claim 8 , wherein said surrounding teeth structure of each of said braking units includes a plurality of teeth which are arranged along the arcuate direction and cooperatively define an inner teeth rim, a curvature of said inner teeth rim being the same as said arcuate line."], "bibtex": "@patent{20240208265,\n    title = {CASTER WITH A BREAKING UNIT},\n    number = {20240208265},\n    year = {2024},\n    note = {File: US20240208265A1-20240627.XML}\n    }", "classification": "B60B3300FI"}, {"title": "Magnetic Apparatus for Centering Caster Wheels", "doc_number": "20240208266", "filename": "US20240208266A1-20240627.XML", "abstract": "An autonomous delivery vehicle having one or more caster wheels that may be held off the ground for a portion of the time that the autonomous delivery vehicle travels. Each caster wheel is mounted in a pivot with a centering mechanism to hold the caster wheels in a design orientation. The caster wheel in the design orientation maximizes the view of forward-looking sensors on the autonomous delivery vehicle. The centering mechanism uses magnetic attraction/repulsion to center the caster wheel. The centering mechanism may incorporate a plurality of permanent magnets and or electro-magnets.", "detailed_description": ["The autonomous delivery vehicle (ADV)100inFIG.1may deliver cargo and/or perform other functions involving autonomously navigating to a desired location. In some applications, the ADV100ofFIG.1may be remotely guided. A cargo container (not shown) is mounted on the cargo platform160, which is mechanically connected to the power base170. The power base170includes the four powered wheels174and two caster wheels176. The power base170provides speed and directional control to move the ADV100along the ground and over obstacles including curbs and other discontinuous surface features.", "", "The cargo platform160is connected to the power base170through two U-frames162. Each U-frame162is rigidly attached to the structure of the cargo platform160and includes two holes that allow a rotatable joint164to be formed with the end of each arm172on the power base170. The power base170controls the rotational position of the arms and thus controls the height and attitude of the cargo platform160. The ADV100includes one or more processors to receive data, navigate a path and select the direction and speed of the power base170. The processors receive data from the short-range sensors510,520,530in the cargo platform160and other sensors not shown inFIG.1.", "", "The caster assemblies180,181are mounted to the power base body178. The caster assemblies comprise a left caster assembly181and a right caster assembly180. Referring now toFIG.4, each caster assembly comprises a caster wheel176, a caster frame184, a caster pivot186, a caster arm188and a mounting element189. The caster wheel176is rotatably mounted in the caster frame184. The caster frame184is attached to the caster arm188via the caster pivot186which allows the caster frame184and caster wheel176pivot about the caster pivot axis192. Allowing the caster wheel176to pivot about the axis of the caster pivot186facilitates the wheel aligning with the direction of travel, when the caster wheel176is in contact with the ground.", "", "Referring now toFIGS.2A-2D, the power base170can operate in at least two configurations or modes. In standard mode, depicted inFIGS.2A-2B, the front of the two clusters175are rotated upward to lift the front wheel174A off the ground20. The clusters175comprise a structure that connects the driven wheels174A,174B to the base base178. The cluster175provide motive power to the wheels. The cluster175rotates about hub177which connects the cluster175to the power base body178. Rotating the front of the cluster up, brings the caster wheels176in contact with the ground20so the power base170and the ADV100rest on the back powered wheels175B and the caster wheels176. In standard mode, contact with the grown and motion of the power base170cause caster frame184and wheel176to align with the direction of motion.", "", "In four-wheel model, depicted inFIGS.4C-4D, the clusters175are rotated to put both the front174A and back powered wheels174B on the ground20and lift the wheels176off the ground. In four-wheel mode, the caster assemblies180,181are tilted back so that the rotation axis of the pivot192tilts backward from a vertical axis194. The pivot192and the vertical axis194define a pivot plane. The backward tilt of the pivot axis192causes the caster frame176under the influence of gravity to align approximately (+15 degrees) with a center plane of the base176. The base center plane is a vertical plane that comprises the base centerline179. The tilt of axis192, alignment of the pivot plane, and gravity also cause the caster wheel176to approximately align with the clusters175and with the centerline179of the power base body178. However, the caster frames184and the caster wheel176may swing or rotate about pivot186in response to motion of the ADV100.", "", "Referring now toFIGS.3A,3B, the swinging motion of the caster frame and wheel184,176may interfere with the field of view (FOV)512of the forward looking sensors including sensor510. Movement of the caster wheels within the FOV512of the forward looking sensors may interfere with the detection of obstacles and surface type. It is beneficial to obstacle detection to minimize the pivoting movement of the caster wheels176and to encourage the caster wheels into an orientation aligned with the centerline of the power base body178. Aligning the caster wheels176with the power base body178has an additional benefit of having the wheels generally pointing in the right direction when the power base170transitions back to standard mode. The power base may170wobble or move unpredictably if the casters are not approximately aligned with the base when the caster wheels176contact the ground20as the power base transitions to standard mode.", "", "Referring nowFIGS.5A,5B, the centering mechanism700, comprising an actuator705, a kingpin710and bearings715,720, is located in the caster pivot186. The centering mechanism700acts to align the caster frame184and wheel176with the center plane or centerline179(FIG.2D) of the power base body178. Referring again toFIGS.5A,5B, the centering mechanism700acts to apply a restoring force to the caster frame184when the frame pivots away from a pre-defined design position. In an example, the design position has the caster frame and wheel184,176aligned with the center plane of the power base body178. The kingpin710is fixedly mounted to the caster frame184and rotationally mounted to the shell of the caster pivot186via bearings715,720. The actuator705applies a restoring torque to the kingpin710that increases as the kingpin710, caster frame and wheel184,176rotate further and further from the design position. In one example, the restoring force is zero when the caster frame184and wheel176are in the preferred position. The restoring force reaches a maximum when the caster frame184and wheel176are opposite or 180 degrees from the design position. If the caster rotates past 180 degrees, the restoring force decreases. Thus, the caster frame184and wheel176will rotate to the design position in the most direct direction rather than retracing its path past the 180 degree position.", "", "The actuator705comprises a stator attached to the caster pivot shell186A and a rotor attached to the kingpin710. The actuator705further comprises a plurality of magnets that provide a restoring force to the kingpin that increases with rotation away from the design position. A magnetic actuator705is preferred to a spring-based centering mechanism as a spring-based centering mechanism will have a limited range of rotation that can create instability in the caster wheel position when the wheel is on the ground. In addition, the mechanical spring may prevent the caster wheel from turning more than 180 degrees, which is needed when the ADV100reverses direction.", "", "Prior art including U.S. Pat. Nos. 9,649,881 and 8,875,855 include pairs of magnets, with one on the rotating portion and the other magnet on the static portion of caster that encourage a caster wheel and frame to remain in a given rotary position. The pairs of magnets are arranged with opposite poles facing each other to create an attractive magnetic force between the pairs. One theory of forces between magnets holds that magnets are dipoles and the attractive/repulsive force between magnets varies with the inverse of the distance cubed. That is to say doubling the distance between the two magnets will reduce the forces between them to one eighth the original force. Therefore the magnets disclosed in the prior art will have little effect on the casters once when the casters have been displaced more than a short distance from the preferred orientation.", "", "FIGS.6A and6Bshow an embodiment of the actuator705comprising a stator709and a rotor707where the rotor has been displaced axially to expose the elements of the stator and rotor. InFIG.6A, the rotor707is fully displaced out of the stator709. InFIG.6B, the rotor707is significantly but not fully inserted into the stator709. The stator709is composed of a shell730and a plurality of magnets732-752that are oriented along the pivot axis or kingpin (not shown). The rotor707comprises a shell735and a plurality of magnets760-780. As described elsewhere, the rotor707is rigidly attached to the kingpin and the kingpin is rigidly attached to the caster frame. Thus, forces applied to the rotor are applied to the caster frame. The stator is attached to the caster pivot shell as described elsewhere.", "", "The stator shell730and the rotor shell735are shown inFIGS.6A,6Bwith a section cutaway to reveal the location and orientation of the magnets. The magnets may to attached to the rotor shell735and stator shell730with an adhesive or held in place mechanically using one or more of the following mechanical methods including, but limited to deforming the shells730,735after magnet insertion, screws and pins, and clips that hold the magnets in the shell slots.", "", "The magnets in the stator709are arranged in two rows around the circumference of the shell735. In alternative embodiments, the stator709may contain a single row of magnets or more than 2 rows of magnets. The restoring force will increase with the number of rows assuming equivalent magnets. The magnets are arranged so a first set of the magnets have their poles oriented in one direction, while the rest of the magnets are oriented in the opposite direction. Referring toFIG.6A, a first set of the stator magnets732,734,736,738, and others not visible are oriented so the south (S) pole is upward. A second set of the stator magnets742,744,746,748,750,752, and others not visible are oriented so the north (N) pole is upward. All the magnets in the stator are in either the first or the second set. In one example, the first set accounts for approximately half the magnets. If the number of magnets around the circumference is not an even number, then the first set will comprise one magnet per row more or less than half the magnets. In an example, the first set of magnets are grouped together and the second set are grouped together and the two groups are not intermingled. In other examples, the first or second set of magnets may occupy different fractions of the circumferences such as a quarter, a third, a sixth or an eighth. However, to sum of the first and second sets will occupy the full circumference of the rotor/stator.", "", "Continuing to refer toFIG.6A, the rotor707comprises a first set of rotor magnets760,762,764,766where the magnets are oriented so the north (N) pole is upward and a second set774,776,778,780, where the magnets are oriented so the south (S) pole is upward. Similar to the stator, the first rotor set accounts for approximately half the magnets on the rotor and the second rotor set accounts for the rest of the magnets on the rotor.", "", "The rotor707and stator709inFIGS.6A,6Bare shown with respect to each other in the design position. As noted elsewhere, rotation of the rotor707away from the design position results in an increasing restoring force. At the design position, shown inFIG.6A, the first set of the rotor magnets760,762,764,766are oriented so the north (N) pole are directly across from the first set of the stator magnets732,734,736and738that are oriented with the south (S) pole upward. At the same time the second set of the rotor magnets774,776,778,780are oriented with the south (S) pole upward are arranged opposite the second set of the stator magnets742,744,746,748,750,752that are oriented with the north (N) pole upward. Arranging opposite poles of the stator magnets and the stator poles across the gap between the stator and rotor crate an attraction force that tends to hold the rotor707in the design position.", "", "In an example, the design position is where all the stator magnets are across the gap from a rotor magnet of the opposite orientation or polarity. In another example, due to an uneven number of magnets around the rotor and or sensor, the design position occurs when the fewest possible stator magnets are across the gap from a rotor magnet with the same polarity or orientation.", "", "FIGS.7A-7Cshow a schematic of the actuator705with different rotation positions of the stator709with regard to the rotor707. The rotor707contains a plurality of magnets781arranged around a center point783. In this schematic the dipole magnets are arranged radially and the pole of each magnet indicated with an S for south pole and N for north pole. The stator709contains a plurality of magnets791arranged radially about center point783.", "", "Referring toFIG.7B, magnets781in the rotor707are arranged in two sets, where the first rotor set784have a south pole directed outwardly, while the second rotor set782has a north pole faced outwardly.", "", "The stator709also has two sets of magnets where the first stator set792has north pole facing inwardly and the second stator set794has the south pool facing inwardly. The magnets may be arranged radially with the north and south poles oriented inward or outward or as inFIGS.6-8, the magnets may be arranged axially with the north and south poles oriented up and down. The invention contemplates both magnet arrangements and other arrangements that allow magnets to be oriented in two directions so that magnet poles in the rotor707can face either the same or opposite pole in the stator709.", "", "In the design position,FIG.7A, the rotor is in the design position. As shown inFIG.7B, the rotor magnets782,784are near stator magnets792,794with opposite poles, so the rotor magnets are attracted to the opposite stator magnet. This attractive force resists the rotation of the rotor and thus the rotation of the king pin and caster frame and wheel.", "", "InFIG.7B, the rotor707has rotated clockwise through angle790inside the stator709from the design position. In this example, four rotor magnets (2 magnets of first rotor set782, 2 magnets of the second rotor set784) face stator magnets (2 magnets of first stator set781, 2 magnets of the second stator set794) with the same poles. Magnets782have outward facing north poles and at the displaced condition inFIG.7B, the nearby stator magnets781are or oriented with north poles facing inward. Similarly, magnets784have outward facing south poles and at the displaced condition inFIG.7B, the nearby stator magnets794are or oriented with south poles facing inward. Magnets782,784are repelled by the stator magnets781,794which turns the rotor707counter clockwise, back toward the design position ofFIG.7A. The repelling force would increase if the rotor continued to turn clockwise.FIG.7Cshows a more extreme displacement, where the rotor has rotated clockwise nearly a half a revolution from the design position. In the greater displacement ofFIG.7C, a total of 10 magnets783,784in the rotor707have a pole facing outward that are near stator magnets with the same pole facing inward. The greater number of nearby opposing poles inFIG.7Cproduces a larger restoring force on the rotor. Thus, the restoring force increases with the displacement of the rotor from the design position. In examples pictured inFIGS.7B and7C, the restoring force torques the rotor in the opposite direction from its displacement. In an example, where the rotor has turned more than 180° in a given direction, say clockwise, the restoring force will change direction and torque the rotor toward the design position in the clockwise direction as that is the direction of reducing torque. The result is that the magnetic actuator705will push the rotor back to the design position by the shortest possible direction", "", "Referring now toFIG.8, the rotor707and the stator709of the actuator are located within the caster pivot case186A. The pivot shell186A and part of the stator709are cut away to show stator magnets736,738,742,744. The tops of the rotor magnets764,744are visible at the top of the rotor707. The rotor707is attached to the kingpin710and via the kingpin to the caster frame184. The rotor707may be attached to the kingpin710via a key, a pin, interlocking splines, an intermediate compliant element, a fiction fit, a thermal shrink fit or with adhesive. Similarly, the stator709may be attached to the pivot shell186A with mechanical means such as a key or a fiction fit or attached with adhesive. The kingpin710is rotatably attached to the pivot shell186A by bearings710,715. The magnetic force from stator709is applied to the rotor707and transferred to the kingpin710and the caster frame184.", "", "Referring now toFIGS.9A-9D, the relationship of caster position to the stator and rotor positions is demonstrated.FIG.9Ashows the right caster assembly180with the caster frame and wheel184,176in the design position i.e. aligned with power base (not shown).FIG.9Bis a detailed view of the caster pivot186where pivot shell186A has been cut away to show orientation of the stator709and rotor707in the design position. In the design position, the stator magnets with south poles facing up732,736are next to rotor magnets with the opposite pole, north, face up760,764. At the same time the stator magnets with the north pole facing up742is next to a rotor magnet with a south pole facing up774.", "", "InFIG.9C, the caster frame and wheel184,176is not aligned with the power base. A detailed view of the caster pivot186is presented inFIG.9D, where the pivot shell186A has been cut-away to show the orientation of the stator707relative to the stator709when the caster fame and wheel are not in the design position. In this non-design position, one or more of the second set of stator magnets with north poles facing up742,746,750are across from the first set of rotor poles with north poles facing up760,764. The first set of rotor magnets are repelled by the second set of stator magnets. The rotor moves toward the design position as that direction reduces the repelling force.", "", "In another embodiment, the stator709comprises a plurality of electromagnets that that are controlled by a stator processor. The stator electromagnets may be arranged axially and act in a similar fashion to the permanent magnets described elsewhere. An individual electromagnet will attract or repel a rotor magnet depending on the polar orientation of the rotor magnet and polarity of the electromagnet. The stator processor may selectively turn stator magnets on by connecting a given stator electro magnet to a voltage cause that causes cause electric current to flow through the given electro-magnet. The stator processor may selectively switch the applied voltage polarity switch the polarity of a given electro-magnet. On one example, the processor turns the stator electromagnets off in standard mode and on in 4-wheel mode to minimize power consumption. In another example, the stator electromagnets may cause the caster frame and wheel184,176to be held a desired orientation that is not aligned with the power base. The stator processor controls the magnets similarly to a motor controller for a permanent magnet DC motor or a stepper motor. In another embodiment, the rotor comprises steel or iron elements that are attracted to the applied magnetic fields similar to a solenoid.", "", "In compliance with the statute, the present teachings have been described in language more or less specific as to structural and methodical features. It is to be understood, however, that the present teachings are not limited to the specific features shown and described, since the means herein disclosed comprise various ways of putting the present teachings into effect. While the present teachings have been described above in terms of specific configurations, it is to be understood that the present teachings are not limited to these disclosed configurations. Many modifications and other configurations will come to mind to those skilled in the art to which these teachings pertain, and which are intended to be and are covered by both this disclosure and the appended claims. It is intended that the scope of the present teachings should be determined by proper interpretation and construction of the appended claims and their legal equivalents, as understood by those of skill in the art relying upon the disclosure in this specification and the attached drawings."], "claims": ["a first part comprising a fixed element; and a second part rotatably mounted in said first part and comprising a rotary element; wherein said rotary element comprises a first magnet having a first north pole oriented outwardly and a second magnet having a second north pole oriented inwardly.", "2 . Caster mount of claim 1 wherein a magnetic force between said first part and said second part increases with an angular difference therebetween.", "3 . Caster mount of claim 1 wherein said fixed element comprises a permanent magnet.", "4 . Caster mount of claim 1 wherein said fixed element comprises an electro-magnet.", "5 . Caster mount of claim 4 further comprising a controller configured to vary a voltage applied to said electro-magnet.", "6 . Caster mount of claim 1 wherein magnetic poles of said rotary element and said fixed element are axially aligned with an axis of said second part.", "7 . Caster mount of claim 1 wherein said rotary element is oriented radially relative to said second part.", "8 . Caster mount of claim 1 wherein said rotary element comprises two or more rows of magnets.", "9 . Caster mount of claim 1 wherein the first magnet is arranged on a sector of the second part and the second magnet is arranged on a second sector of the second part.", "a container base comprising a controller; and a power base configured for moving said container base across a surface comprising: a base comprising a second controller; a cluster rotatably mounted on said base; and a caster connected to said base with a caster mount of", "11 . Autonomous vehicle of claim 10 further comprising a caster arm interposed between said base and said caster mount."], "bibtex": "@patent{20240208266,\n    title = {Magnetic Apparatus for Centering Caster Wheels},\n    number = {20240208266},\n    year = {2024},\n    note = {File: US20240208266A1-20240627.XML}\n    }", "classification": "B60B3302FI"}, {"title": "TIRE", "doc_number": "20240208267", "filename": "US20240208267A1-20240627.XML", "abstract": "Provided is a tire comprising a tread part, the tread part having at least one rubber layer, wherein a ratio (G/W L ) of a tire weight G (kg) to the maximum load capacity W L (kg) of the tire is 0.0160 or less, wherein the tread part has land parts partitioned by tread edge and a plurality of circumferential grooves extending continuously in a tire circumferential direction, wherein a first rubber layer of the tread surface is composed of a rubber composition comprising a rubber component, and wherein a contact angle θ with a pure water of the rubber composition is 105° or more.", "detailed_description": [""], "claims": ["wherein a ratio (G/W wherein the tread part has land parts partitioned by tread edge and a plurality of circumferential grooves extending continuously in a tire circumferential direction, wherein a first rubber layer of the tread surface is composed of a rubber composition comprising a rubber component, and wherein a contact angle θ with a pure water of the rubber composition is 105° or more.", "2 . The tire of claim 1 , wherein the rubber composition comprises 50 parts by mass or more of silica based on 100 parts by mass of the rubber component.", "3 . The tire of claim 1 , wherein a content of carbon black in the rubber composition based on 100 parts by mass of the rubber component is 15 parts by mass or less.", "4 . The tire of claim 1 , wherein the ratio (G/W L ) of the tire weight G (kg) to the maximum load capacity W L (kg) of the tire is 0.0150 or less.", "5 . The tire of claim 1 , wherein a ratio (θ/G) of the contact angle θ (°) with the pure water of the rubber composition to the tire weight G (kg) is 12.5 or more.", "6 . The tire of claim 1 , wherein the contact angle θ with the pure water of the rubber composition is 115° or more.", "7 . The tire of claim 1 , wherein the rubber composition comprises at least one selected from a group consisting of a recycled rubber and a powdered rubber.", "8 . The tire of claim 1 , wherein the rubber composition comprises at least one selected from a group consisting of silicone, a silicone-based polyurethane, and a fluorine-based polyurethane.", "9 . The tire of claim 1 , wherein the rubber composition comprises at least one selected from a group consisting of a terpene-based resin and a cyclopentadiene-based resin.", "10 . The tire of claim 1 , wherein the rubber composition comprises 30 parts by mass or more of oil based on 100 parts by mass of the rubber component.", "11 . The tire of claim 1 , wherein a ratio (0° C. tan δ/0° C. E*) of a tan δ at 0° C. (0° C. tan δ) of the rubber composition to a complex elastic modulus (MPa) at 0° C. (0° C. E*) of the rubber composition is 0.020 or more.", "12 . The tire of claim 1 , wherein a groove depth of the deepest part of the circumferential groove is 5.0 to 9.0 mm.", "13 . The tire of claim 1 , wherein, when a length in a width direction on the tread surface of the land part closest to a tire equatorial plane is defined as L 0 , and a length in a width direction at 90% position of the groove depth of the deepest part of the circumferential groove adjacent to the land part closest to the tire equatorial plane is defined as L 90 , L 0 /L 90 is 0.95 or less."], "bibtex": "@patent{20240208267,\n    title = {TIRE},\n    number = {20240208267},\n    year = {2024},\n    note = {File: US20240208267A1-20240627.XML}\n    }", "classification": "B60C100FI"}, {"title": "NON-PNEUMATIC TIRE", "doc_number": "20240208268", "filename": "US20240208268A1-20240627.XML", "abstract": "A tire includes an inside and an outside annular part, and a plurality of spokes, in which a pair of inside sloped faces approaching the outside annular part from both ends in a tire-width direction towards the tire-width direction center is formed at an outer circumferential part of the inside annular part opposing the outside annular part, a pair of outside sloped faces approaching the inside annular part from both ends in the tire-width direction towards the tire-width direction center is formed at an inner circumferential part of the outside annular part opposing the inside annular part, the spoke has an intermediate part extending between the inside annular part and the outside annular part, an inside connection part that connects the intermediate part and the inside annular part, and an outside connection part connecting the intermediate part and outside annular part, the inside connection part includes an inside continuous part.", "detailed_description": ["Hereinafter, an embodiment will be explained while referencing the drawings.FIG.1is a side view looking at a tire1, which is a non-pneumatic tire of the embodiment, from a direction parallel to a tire rotation axis (tire meridian plane), i.e. direction following a front/back direction of the paper plane inFIG.1. The tire1shown inFIG.1is an unloaded state.FIG.2is a cross-sectional view along the line II-II inFIG.1.FIG.3is a partial perspective view of the tire1when viewing obliquely a portion shown inFIG.2.FIG.4is a partial perspective view of the tire1when viewing the portion shown inFIG.2from a different direction thanFIG.3.", "", "InFIGS.1,3and4, the arrow C indicates a tire circumferential direction. InFIGS.1to4, the arrow X shows a tire-radial direction. InFIGS.2,3and4, the arrow Y shows the tire-width direction. The tire-width direction inFIG.1is the front/back direction of the paper plane. The symbol S1inFIG.2is a tire equatorial plane. The tire-circumferential direction inFIG.2is the front/back direction of the paper plane.", "", "The tire-circumferential direction is a direction around the tire rotational axis, which is the same direction as the direction in which the tire1rotates. The tire-radial direction is a direction perpendicular to the tire rotational axis. The tire-width direction is a direction parallel to the tire rational axis. InFIGS.2,3and4, one side in the tire-width direction is indicated as Y1, and the other side in the tire-width direction is indicated as Y2. The tire equatorial plane S1shown inFIG.2is a plane orthogonal to the tire rotational axis, and is a plane positioned at the center of the tire-width direction.", "", "The tire1of the embodiment includes: an inside annular part20, an outside annular part30, a plurality of spokes40, and tread50.", "", "It should be noted that, hereinafter, the thicknesses of the inside annular part20and outside annular part30are dimensions in a direction along the tire-radial direction. The widths of the inside annular part20and outside annular part30are dimensions in a direction along the tire-width direction.", "", "The inside annular part20is an annular portion along the tire-circumferential direction constituting the inner circumferential part of the tire1. The thickness and width of the inside annular part20are set to be constant in order to improve the uniformity. A tire wheel (not shown) is arranged in the space on the inner circumferential side of the inside annular part20. At the outer circumferential part of the rim of this tire wheel, the inner circumferential part of the inside annular part20fits and is mounted. The inside annular part20is mounted to the rim, and the tire1is mounted to the tire wheel. On the inner circumferential surface of the inside annular part20, a fitting part configured by a convex part, groove or the like is provided for fitting with the rim of the tire wheel.", "", "The inside annular part20can be formed by a resin material having elasticity, for example; however, the material is not limited to resin.", "", "The inside annular part20transmits rotation of the above-mentioned tire wheel to the spokes40and outside annular part30. The thickness of the inside annular part20is decided from the viewpoint of obtaining a weight reduction and durability, while satisfying the function of sufficiently transmitting rotational force to the spokes40. The thickness of the inside annular part20is not particularly limited; however, a thickness of at least 2% and no more than 7% of the tire cross-sectional height, or at least 3% and no more than 6%, for example, can be exemplified. The inside diameter of the inside annular part20is a value depending on the diameter of the rim of the tire wheel to which the tire1is mounted, use of the vehicle, or the like. For example, in the case assuming a replacement for a general pneumatic tire, as the inside diameter of the inside annular part20, for example, a dimension of 250 mm to 500 mm can be exemplified; however, it is not particularly limited. The width of the inside annular part20is a value depending on the application of the vehicle to which the tire1is mounted, axle length, etc. For example, in the case assuming a replacement for a general pneumatic tire, as the width of the inside annular part20, a dimension of 100 mm to 300 mm can be exemplified; however, it is not particularly limited.", "", "As shown inFIG.2, a pair of inside sloped faces21approaching the outside annular part30from both ends in the tire-width direction toward the center in the tire-width direction is formed at the outer circumferential part of the inside annular part20facing the outside annular part30. The inside sloped face21includes a first inside sloped face211on a side of the tire-width direction Y1of the outer circumferential surface20a of the inside annular part20from the tire-width direction center; and a second inside sloped face212on a side of the tire-width direction Y2of the outer circumferential surface20a from the center in the tire-width direction. The first inside sloped face211slopes to the inner side in the tire-radial direction (upwards inFIG.2) as approaching an end on the side of the tire-width direction Y1of the outer circumferential surface20a.The second inside sloped face212slopes to the inner side in the tire-radial direction as approaching an end on the side of the tire-width direction Y2of the outer circumferential surface20a.In other words, the inside sloped face21has a feature of a mountain-shaped cross section sloping to the inner side in the tire-radial direction as approaching both sides in the tire-width direction from the tire-width direction center, and is configured to include the first inside sloped face211and second inside sloped face212.", "", "The inside sloped face21preferably slopes at an angle greater than 0° and less than 3° relative to the tire-width direction. In other words, the sloping angle θ1of the first inside sloped face211is preferably greater than 0° and less than 3° relative to the tire-width direction. The sloping angle θ2of the second inside sloped face212is also preferably greater than 0° and less than 3° relative to the tire-width direction.", "", "The inside sloped face21preferably slopes at an angle greater than 0° and less than 2° relative to the tire-width direction. In other words, the sloping angle θ1of the first inside sloped face211is preferably greater than 0° and less than 2° relative to the tire-width direction. The sloping angle θ2of the second inside sloped face212is also preferably greater than 0° and less than 2° relative to the tire-width direction.", "", "Each of the first inside sloped face211and second inside sloped face212extends to the end in the tire-width direction of the outer circumferential surface20a.In other words, the inside sloped face21extends to both ends in the tire-width direction of the inside annular part20. Each of the first inside sloped face211and second inside sloped face212is a flat surface along a direction intersecting the tire-radial direction and the tire-circumferential direction.", "", "The outside annular part30is a ring-shaped portion along the tire-circumferential direction constituting the outer circumferential part of the tire1. The outside annular part30is arranged coaxially with the inside annular part20at the outer circumferential side of the inside annular part20. The thickness and width of the outside annular part30are set to be constant for improving the uniformity.", "", "The outside annular part30, for example, can be formed by a resin material having elasticity; however, the material is not limited to resin.", "", "The outside annular part30transmits the rotation of the inner annular part20and spokes40to the road surface via the tread50. The thickness of the outside annular part30is decided from the viewpoint of obtaining a weight reduction and durability, while satisfying the function of sufficiently transmitting the rotational force from the spokes40to the road surface. The thickness of the outside annular part30is not particularly limited; however, for example, a thickness of at least 2% and no more than 7% of the tire cross-sectional height, or at least 2% and no more than 5% can be exemplified. The inside diameter of the outside annular part30is a value depending on the dimension of the rim of the tire wheel to which the tire1is mounted, application of the vehicle, etc. For example, in the case assuming a replacement for a general pneumatic tire, as the inside diameter of the outside annular part30, a dimension of 420 mm to 750 mm can be exemplified; however, it is not limited thereto. The width of the outside annular part30is the same as the width of the inside annular part20.", "", "As shown inFIG.2, a pair of outside sloped faces31approaching the inside annular part20from both ends in the tire-width direction towards the tire-width direction center is formed at the inner circumferential part of the outside annular part30opposing the inside annular part20. The outside sloped face31includes: a first outside sloped face311on a side of the tire-width direction Y1of the inner circumferential surface30aof the outside annular part30from the tire-width direction center; and a second outside sloped face312on a side of the tire-width direction Y2of the inner circumferential surface30afrom the tire-width direction center. The first outside sloped face311is sloping to the outer side in the tire-radial direction (downwards inFIG.2) towards an end on the side of the tire-width direction Y1of the inner circumferential surface30a.The second outside sloped face312is sloping to an outer side in the tire-radial direction as approaching the end on the side of the tire-width direction Y2of the inner circumferential surface30a.In other words, the outside sloped face31has a feature of a mountain-shaped cross section sloping to the outer side in the tire-radial direction as approaching both sides in the tire-width direction from the center in the tire-width direction, and is configured to include the first outside sloped face311and second outside sloped face312.", "", "The outside sloped surface31preferably slopes at an angle greater than 0° and less than 3° relative to the tire-width direction. In other words, the sloping angle θ3of the first inside sloped face311is preferably greater than 0° and less than 3° relative to the tire-width direction. The sloping angle θ4of the second inside sloped face312is preferably greater than 0° and less than 3° relative to the tire-width direction.", "", "The outside sloped face31preferably slopes at an angle greater than 0° and less than 2° relative to the tire-width direction. In other words, the sloping angle θ3of the first outside sloped face311is preferably greater than 0° and less than 2° relative to the tire-width direction. The sloping angle θ4of the second outside sloped face312is preferably greater than 0° and less than 2° relative to the tire-width direction.", "", "Each of the first outside sloped face311and second outside sloped face312extends to the end in the tire-width direction of the outer circumferential surface30a.In other words, the outside sloped face31extends to both ends in the tire-width direction of the outside annular part30. Each of the first outside sloped face311and second outside sloped face312is a flat surface along a direction intersecting the tire-radial direction and the tire-circumferential direction.", "", "A plurality of the spokes40connect the inside annular part20and outside annular part30. The inside annular part20and outside annular part30connected by the plurality of spokes40are arranged coaxially with each other. Each of the plurality of spokes40is arranged independently along the tire circumferential direction. As shown inFIG.1, the plurality of spokes40extends substantially parallel to the tire-radial direction when viewed from a side, in the unloaded state of the tire1. The plurality of spokes40are arranged at equal intervals in the tire-circumferential direction.", "", "As shown inFIGS.2to4, the plurality of spokes40in the embodiment includes a plurality of first spokes41and a plurality of second spokes42. For all of the first spokes41and second spokes42, the extending direction thereof is not parallel to the tire-radial direction when viewing in a direction along the tire-circumferential direction. The first spokes41slope to one side in the tire-width direction. The second spokes42slope to the opposite side than the first spoke41. The first spokes41and second spokes42are arranged alternately in the tire-circumferential direction.", "", "As shown inFIGS.2to4, the first spokes41all extend from the Y1side, which is one side in the tire-width direction of the outside annular part30, to slope towards the Y2side, which is the other side of the tire-width direction of the inside annular part20. The second spokes42all extend from the Y2side, which is the other side in the tire-width direction of the outside annular part30, to slope towards the Y1side, which is one side in the tire-width direction of the inside annular part20.", "", "The sloping angles of the first spokes41and second spokes42are the same. For this reason, the first spokes41and second spokes42adjacent in the tire-circumferential direction are arranged in a substantially X shape when viewing from a direction along the tire-circumferential direction. As shown inFIG.2, the first spokes41slope at an angle e relative to the tire-width direction, and this angle θ is preferably at least 30° and no more than 60°, for example. The second spoke42also slopes at the same angle θ to the opposite side.", "", "As shown inFIG.2, each of the first spokes41and second spokes42are the same shape symmetrical to the tire equatorial plane S1, in a state viewing from a direction along the tire-circumferential direction. Therefore, in the following, when it is not necessary to differentiate between the first spokes41and second spokes42, and they can be explained collectively, the first spoke41and second spoke42are generically called spoke40.", "", "The spoke40is formed in a plate shape extending in-plane of the tire-radial direction and the tire-width direction. The spoke40extends obliquely at the angle of angle θ in the above way, from the inside annular part20towards the outside annular part30. As shown inFIG.3, the thickness direction of plate thickness t of the spoke40follows the tire-circumferential direction. As shown inFIGS.2and3, the plate width w of the spoke40is the width of the first intermediate part410and second intermediate part420described later, and is a dimension in a direction orthogonal to the sloping direction in which the spoke40extends, when viewing the spoke40from a direction following the tire-circumferential direction. In the embodiment, the plate thickness t of all spokes40is the same. In addition, the plate width w of all spokes40is the same.", "", "Since the spoke40is an elongated plate shape, even if thinning the plate thickness t, it is possible to improve the durability of the spokes40by setting the plate width w to be wide. Furthermore, by increasing the number of spokes40by thinning the plate thickness t, it is possible to decrease the intervals between spokes40adjacent in the tire-circumferential direction, while maintaining the rigidity of the tire1overall. The ground pressure during tire rolling distributes by the spokes40, and can thereby reduce the ground pressure.", "", "It should be noted that the spokes40of the embodiment are parallel to the tire-radial direction in a side view; however, the spokes40may be a state extending obliquely relative to the tire-radial direction so as to intersect the tire-radial direction in a side view.", "", "The first spoke41includes a first intermediate part410as an intermediate part extending between the inside annular part20and outside annular part30; a first inside connection part411as the inside connection part connecting the first intermediate part410and inside annular part20; and a first outside connection part412as the outside connection part connecting the first intermediate part410and outside annular part30.", "", "The first intermediate part410is a portion having a plate width w of the spoke40, and is a portion matching in the sloping direction of the first spoke41. The first intermediate part410is positioned in the middle of the tire-radial direction between the inside annular part20and outside annular part30. The first intermediate part410refers to a region in the tire-radial direction having a portion in which both sides facing the tire-width direction are straight.", "", "The first inside connection part411is provided in half the region on the Y2side in the tire-width direction of the inside annular part20. The first inside connection part411has a first inside transition part411barranged at an inner side in the tire-width direction, and which continuously transitions from the first intermediate part410to the inside annular part20; and a second inside transition part411aarranged at an outer side in the tire-width direction and which continuously transitions from the first intermediate part410to the inside annular part20. The first inside transition part411bis arranged at a side at which the angle formed by the first intermediate part410and inside annular part20makes an acute angle. The second inside transition part411ais arranged at a side at which the angle formed by the first intermediate part410and inside annular part20makes an obtuse angle.", "", "The first inside transition part411b is arranged at an inner side in the tire-width direction (side of tire equatorial plane S1). The first inside transition part411bis formed in a recessed arc shape from the first intermediate part410until a position of the tire equatorial plane S1of the inside annular part20, and links to the first inside sloped face211. In other words, the first inside connection part411includes the first inside transition part411bhaving a shape continuously linking from the first intermediate part410to the first inside sloped face211. The first inside transition part411bis provided at a side of the first inside connection part411at which the angle formed by the first intermediate part410and inside annular part20makes an acute angle. The first inside transition part411bof the embodiment is an example of the inside continuous part according to the present disclosure continuously linking to the first inside sloped face211.", "", "It should be noted that the first inside transition part411bof the embodiment is formed so as to link to the first inside sloped face211at a position of the tire equatorial plane S1; however, it may be formed so as to link to the second inside sloped face212at a position closer to the first inside connection part411than the tire equatorial plane S1, or link to the first inside sloped face211past the tire equatorial plane S1.", "", "The second inside transition part411ais arranged at the outer side in the tire-width direction. The second inside transition part411aextends while gently bending to the end on the Y2side in the tire-width direction of the inside annular part20.", "", "The first inside connection part411has a shape which widens along the tire-width direction as approaching the inside annular part20, by the first inside transition part411band second inside transition part411a", "", "The first outside connection part412is provided to half the region on the tire-width direction Y1side of the outside annular part30. The first outside connection part412includes a first outside transition part412barranged at the inner side of the tire-width direction and which continuously transitions from the first intermediate part410to the outside annular part30; and a second outside transition part412aarranged at the outer side of the tire-width direction and which continuously transitions from the first intermediate part410to the outside annular part30. The first outside transition part412bis arranged at a side at which the angle formed by the first intermediate part410and outside annular part30makes an acute angle. The second outside transition part412ais arranged at a side at which the angle formed by the first intermediate part410and outside annular part30makes an obtuse angle.", "", "The first outside transition part412bis arranged at the inner side in the tire-width direction (side of tire equatorial plane S1). The first outside transition part412bis formed in a recessed arc shape from the first intermediate part410to a position of the tire equatorial plane S1of the outside annular part30, and links to the second outside sloped face312. In other words, the first outside connection part412includes a first outside transition part412bhaving a shape that continuously links from the first intermediate part410to the second outside sloped face312. The first outside transition part412bis arranged at a side of the first outside connection part412at which the angle formed by the first intermediate part410and outside annular part30makes an acute angle. The first outside transition part412bof the embodiment is an example of an outside continuous part according to the present disclosure continuously linking to the second outside sloped face312.", "", "It should be noted that the first outside transition part412bof the embodiment is formed so as to link to the second outside sloped face312at the position of the tire equatorial plane S1; however, it may be formed so as to link to the first outside sloped face311at a position closer to the first outside connection part412than the tire equatorial plane S1, or to link to the second outside sloped face312past the tire equatorial plane S1.", "", "The second outside transition part412ais arranged at the outer side in the tire-width direction. The second outside transition part412aextends while gently bending until the end on the Y1side in the tire-width direction of the outside annular part30.", "", "By the first outside transition part412band second outside transition part412a,the first outside connection part412has a shape widening along the tire-width direction as approaching the outside annular part30.", "", "The second spoke42is the same shape as the first spoke41, and is a symmetrical shape with the first spoke41relative to the tire equatorial plane S1.", "", "As shown inFIGS.2and3, the second spoke42includes a second intermediate part420as an intermediate part extending between the inside annular part20and outside annular part30; a second inside connection part421as an inside connection part connecting the second intermediate part420and inside annular part20; and a second outside connection part422as an outside connection part connecting the second intermediate part420and outside annular part30.", "", "The second intermediate part420is a portion having a plate width w of the spoke40, and is a portion matching in the sloping direction of the second spoke42. The second intermediate part420is positioned at the middle in the tire-radial direction between the inside annular part20and outside annular part30. The second intermediate part420refers to a region in the tire-radial direction having a portion in which both sides facing the tire-width direction are straight.", "", "The second inside connection part421is provided in half of the region on the Y1side in the tire-width direction of the inside annular part20. The second inside connection part421has a first inside transition part421barranged at the inner side of the tire-width direction and which continuously transitions from the second intermediate part420to the inside annular part20; and a second inside transition part421aarranged at the outer side in the tire-width direction and which continuously transitions from the second intermediate part420to the inside annular part20. The first inside transition part421is arranged at a side at which the angle formed by the second intermediate part420and inside annular part20makes an acute angle. The second inside transition part421ais arranged at a side at which the angle formed by the second intermediate part420and inside annular part20makes an obtuse angle.", "", "The first inside transition part421bis arranged at an inner side in the tire-width direction (side of tire equatorial plane S1). The first inside transition part421bis formed in a recessed arc shape from the second intermediate part420to a position of the tire equatorial plane S1of the inside annular part20, and links to the second inside sloped face212. In other words, the second inside connection part421includes the first inside transition part421bhaving a shape continuously linking from the second intermediate part420to the second inside sloped face212. The first inside transition part421bis provided to a side of the second inside connection part421at which the angle formed by the second intermediate part420and inside annular part20makes an acute angle. The first inside transition part421bof the embodiment is an example of the inside continuous part according to the present disclosure continuously linking to the second inside sloped face212.", "", "It should be noted that the first inside transition part421bof the embodiment is formed so as to link to the second inside sloped face212at a position of the tire equatorial plane S1; however, it may be formed so as to link to the first inside sloped face211at a position closer to the second inside connection part421than the tire equatorial plane S1, or link to the second inside sloped face212past the tire equatorial plane S1.", "", "The second inside transition part421ais arranged at the outer side in the tire-width direction. The second inside transition part421aextends while gently bending to the end on the Y1side in the tire-width direction of the inside annular part20.", "", "By way of the first inside transition part421band second inside transition part421a,the second inside connection part421has a shape widening along the tire-width direction as approaching the inside annular part20.", "", "The second outside connection part422is provided in half of the region on the Y2side in the tire-width direction of the outside annular part30. The second outside connection part422includes: a first outside transition part422barranged at an inner side in the tire-width direction and which continuously transitions from the second intermediate part420to the outside annular part30; and a second outside transition part422aarranged at the outer side in the tire-width direction and which continuously transitions from the second intermediate part420to the outside annular part30. The first outside transition part422bis arranged at a side at which the angle formed by the second intermediate part420and outside annular part30makes an acute angle. The second outside transition part422ais arranged at a side at which the angle formed by the second intermediate part420and outside annular part30makes an obtuse angle.", "", "The first outside transition part422bis arranged at the inner side in the tire-width direction (side of tire equatorial plane S1). The first outside transition part422bis formed in a recessed arc shape from the second intermediate part420to a position of the tire equatorial plane S1of the outside annular part30, and links to the first outside sloped face311. In other words, the second outside connection part422includes a first outside transition part422bhaving a shape continuously linking from the second intermediate part420to the first outside sloped face311. The first outside transition part422bis provided at a side of the second outside connection part422at which the angle formed by the second intermediate part420and outside annular part30makes an acute angle. The first outside transition part422bof the embodiment is an example of an outside connection part according to the present disclosure continuously linking to the first outside sloped face311.", "", "It should be noted that the first outside transition part422bof the embodiment is formed so as to link to the first outside sloped face311at a position of the tire equatorial plane S1; however, it may be formed so as to link to the second outside sloped face312at a position closer to the second outside connection part422than the tire equatorial plane S1, or link to the first outside sloped face311past the tire equatorial plane S1.", "", "The second outside transition part422ais arranged at the outer side in the tire-width direction. The second outside transition part422aextends while gently bending to an end on the Y2side in the tire-width direction of the outside annular part30.", "", "By way of the first outside transition part422band second outside transition part422a,the second outside connection part422has a shape widening along the tire-width direction as approaching the outside annular part30.", "", "As mentioned above, the plate thickness t of all spokes40of the embodiment are the same. The plate thickness t of the spoke40is not particularly limited; however, since the spokes40receive sufficient rotational force from the inside annular part20and outside annular part30, while being configured to be able to flex and deform appropriately upon receiving load, it is preferably at least 1 mm and no more than 30 mm, and more preferably at least 5 mm and no more than 25 mm.", "", "As mentioned above, the plate width w of all spokes40of the embodiment are the same. The plate width w of the spoke40is the width of the first intermediate part410and the second intermediate part420. The plate width w of the spoke40is not particularly limited; however, since configured so as to be able to flex and deform appropriately upon receiving load, while sufficiently receiving rotational force from the inside annular part20and outside annular part30, it is preferably at least 5 mm and no more than 25 mm, and more preferably at least 10 mm and no more than 20 mm. In addition, the plate width w is preferably at least 110% of the plate thickness t, and more preferably at least 115%, from the viewpoint of being able to distribute the contact pressure while improving durability.", "", "As the number of spokes40, from the viewpoint of weight reduction being possible while sufficiently supporting the load from the vehicle, and enabling to achieve both power transmission and a durability improvement, it is preferably at least 80 and no more than 300, and more preferably at least 100 and no more than 200 spokes.", "", "The interval in the tire-circumferential direction of the plurality of the spokes40, for example, is preferably set to at least 1.0 mm and no more than 4.1 mm. It should be noted that, in the embodiment, the interval in the tire-circumferential direction of the plurality of spokes40is equal; however, it may be unequal spacing.", "", "As the dimension in the tire-radial direction of the spoke40, a dimension of at least 45 mm and no more than 75 mm can be exemplified, but is not limited thereto.", "", "The spoke40can be formed by an elastic material listed below. First, as characteristics of this elastic material, from the viewpoint of providing appropriate rigidity while maintaining sufficient durability, a tensile test is performed based on JIS K 7312, and the tensile module calculated from the tensile stress at 10% elongation is preferably at least 3 MPa and no more than 12 MPa.", "", "In the spokes40, in the case of the tensile modulus calculated from the tensile stress at 10% elongation falling below 3 MPa, sufficient rigidity will not be obtained, and there is a possibility of spokes40adjacent in the tire-circumferential direction containing. On the other hand, in the case of the tensile modulus calculated from the tensile stress at 10% elongation exceeding 12 MPa, the rigidity becomes excessively high, and riding comfort worsens.", "", "As the elastic material which can be used as the base material of the spoke40, a thermoplastic elastomer, crosslinked rubber and other resins can be exemplified.", "", "As the thermoplastic elastomer, polyester elastomer, polyolefin elastomer, polyamide elastomer, polystyrene elastomer, polyvinyl chloride elastomer, polyurethane elastomer and the like are exemplified.", "", "As the rubber material constituting the crosslinked rubber, it is possible to use any of natural rubbers and synthetic rubbers. As synthetic rubbers, styrene butadiene rubber (SBR), butadiene rubber (BR), isoprene rubber (IIR), nitrile rubber (NBR), hydrogenated nitrile rubber (hydrogenated NBR), chloroprene rubber (CR), ethylene propylene rubber (EPDM), fluororubber, silicone rubber, acrylic rubber, urethane rubber and the like are exemplified. These rubber materials may be jointly used as two or more types as necessary.", "", "As the other resins, thermoplastic resin and thermosetting resin can be exemplified. As the thermoplastic resin, polyethylene resin, polystyrene resin, polyvinyl chloride resin and the like can be exemplified. As the thermosetting resin, epoxy resin, phenolic resin, polyurethane resin, silicone resin, polyimide resin, melamine resin and the like can be exemplified.", "", "In the spokes40, among the above-mentioned elastic materials, a polyurethane resin can be preferably used from the viewpoint of molding, workability and cost. It should be noted that, as the elastic material, it is also possible to use foam materials. In other words, it is possible to use a material made by foaming the above-mentioned thermoplastic elastomers, crosslinked rubber, and other resins.", "", "It should be noted that the elastic material that can be used as the base material of the spokes40may be reinforced by reinforced fiber. As the reinforced fiber, long fibers, short fibers, woven fabrics, non-woven fabrics and the like can be exemplified. As the types of reinforced fibers, polyamide cords such as rayon cord and nylon-6, 6, polyester cords such as polyethylene terephthalate, aramid cord, glass fiber cord, carbon fiber, steel cord and the like can be exemplified.", "", "It should be noted that reinforcement of the elastic material is not limited to reinforcement by reinforced fibers. For example, reinforcement may be performed by the addition of granular filler. As the granular filler added, carbon black, ceramics such as silica and alumina, and fillers of other inorganic materials can be exemplified.", "", "However, the aforementioned inside annular part20and outside annular part30are preferably formed of the same resin material as the spokes40, and in this case, it is possible to integrally mold the inside annular part20, outside annular part30and spokes40by a cast molding method, for example.", "", "The tread50is provided to the outer circumferential surface of the outside annular part30. The tread50constitutes the outermost circumferential portion of the tire1. The tread50includes tread rubber51. The tread rubber51has a tread surface51a making ground contact with the road surface at the outer circumferential surface. As the rubber material of the tread rubber51, there is no particular limitation to the type thereof, and it is possible to use a common vulcanized rubber or the like as the rubber constituting the tread for a vehicle tire. At the tread surface51a of the tread rubber51, the tread pattern formed by a plurality of grooves and land blocks are provided similarly to a conventional pneumatic tire. It should be noted that the tread rubber51may be a configuration in which a plurality of rubber layers of different composition and properties are laminated (for example, two layers or three layers). In addition, the tread50may be formed with resin.", "", "It should be noted that the tire1of the embodiment may further be provided with a reinforcement layer for improving the rigidity and traction of the tire1over the entire tire circumference. The reinforcement layer is provided over the entire tire circumference, for example, and may be embedded inside of the outside annular part30, and may be provided between the outside annular part30and tread50.", "", "According to the tire1of the embodiment, the following effects are exerted.", "", "(1) The tire1according to the embodiment is a non-pneumatic tire including: an inside annular part20; an outside annular part30disposed coaxially at an outer circumferential side of the inside annular part20; a plurality of spokes40connecting the inside annular part20and the outside annular part30, and arranged along a tire-circumferential direction; and tread50provided at an outer circumferential surface of the outside annular part30, in which a pair of inside sloped faces21approaching the outside annular part30from both ends in a tire-width direction towards the tire-width direction center is formed at an outer circumferential part of the inside annular part20opposing the outside annular part30, a pair of outside sloped faces31approaching the inside annular part20from both ends in the tire-width direction towards the tire-width direction center is formed at an inner circumferential part of the outside annular part30opposing the inside annular part20, the spoke40has an intermediate part (first intermediate part410, second intermediate part420) extending between the inside annular part20and the outside annular part30, an inside connection part (first inside connection part411, second inside connection part421) that connects the intermediate part and the inside annular part20, and an outside connection part (first outside connection part412, second outside connection part422) connecting the intermediate part and the outside annular part30, the inside connection part includes an inside continuous part (first inside transition parts411b,421b) having a shape continuously linking to the inside sloped face21, and the outside connection part includes an outside continuous part (first outside transition parts412b,422b) having a shape continuous to the outside sloped face31.", "", "In the spokes40of the embodiment, the inside connection part connecting to the inside annular part20has an inside continuous part which continuously links to the inside sloped face21of the inside annular part20, and the outside connection part connecting to the outside annular part30has an outside continuous part that continuously links to the outside sloped face31of the outside annular part30. Stress concentration at the root portions of the spoke40relative to the inside annular part20and outside annular part30is suppressed by the inside continuous part and outside continuous part, and as a result thereof, rigidity of the spokes40improves, and durability improves. By deformation of the spokes40being suppressed accompanying a rigidity improvement of the spokes40, the interval between the spokes40is maintained, and contact of spokes40adjacent in the tire-circumferential direction is suppressed. The spokes40are thereby hardly damaged. As a result of these, a durability improvement of the tire1overall is achieved. Furthermore, by the deformation suppressing effect of the spokes40accompanying the rigidity improvement of the spokes40, the rolling resistance decreases.", "", "By the inside annular part20having the inside sloped face21, the rigidity of the inside annular part20improves, and the fitting property of the inside annular part20with the rim thereby improves. By the outside annular part30having the outside sloped face31, the rigidity of the outside annular part30improves, and buckling thereby hardly occurs, and flat spots are suppressed from occurring in the tread50accompanying this.", "", "By having the inside sloped face21and outside sloped face31, upon mold forming the tire1, the inside sloped face21and outside sloped face31serve as drafts whereby it becomes possible to facilitate release from the mold.", "", "(2) In the tire1according to the present embodiment, the inside sloped face21and outside sloped face31are sloping at an angle greater than 0° and less than 3° relative to a tire-width direction.", "", "Although ride comfort tends to decline when raising the rigidity of the tire1, since the sloping angles of the inside sloped face21and outside sloped face31relative to the tire-width direction are less than 3°, it is thereby possible to maintain favorable ride comfort.", "", "(3) In the tire1according to the present embodiment, the inside sloped face21and outside sloped face31are sloping at an angle no greater than 2° relative to a tire-width direction.", "", "It thereby becomes possible to improve the rigidity of the tire1overall, while maintaining favorable traction and wear resistance.", "", "(4) In the tire1according to the present embodiment, the intermediate part of the spoke40extends to slope relative to a tire-radial direction when viewing from a tire-circumferential direction, the inside continuous part is provided at a side of the inside connection part at which an angle formed by the intermediate part and the inside annular part20makes an acute angle, and the outside continuous part is provided at a side of the outside connection part at which an angle formed by the intermediate part and the outside annular part30makes an acute angle.", "", "In the case of the intermediate part of the spoke40sloping, a great stress acts on the side of the inside contact part and outside contact part at which the angle formed by each annular part20,30makes an acute angle. Herein, since the inside continuous part and outside continuous part which are continuous with each sloped face are provided to these portions in the embodiment, stress is less concentrated, and an improvement in rigidity is achieved.", "", "(5) In the tire1according to the present embodiment, the inside sloped face21extends to both ends in the tire-width direction of the inside annular part20, and the outside sloped face31extends to both ends in the tire-width direction of the outside annular part30.", "", "The improvement effect in rigidity of the tire1overall accompanying the rigidity improvement by the inside sloped face21and outside sloped face31thereby increases.", "", "(6) In the tire1according to the present embodiment, each of the inside sloped face21and the outside sloped face31are flat.", "", "The stress acting on the inside sloped face21and outside sloped face31tends to disperse, and tends to obtain the effect of a rigidity improvement.", "", "(7) In the tire1according to the present embodiment, the spokes40include: a first spoke41at which the intermediate part slopes to one side in the tire-axial direction, and a second spoke42at which the intermediate part slopes to the opposite side than the first spoke41, in which the first spoke41and the second spoke42are alternately disposed in the tire-circumferential direction.", "", "The first spoke41and second spoke42are thereby arranged in a substantially X shape when viewed from a direction along the tire-circumferential direction. The first spoke41and second spoke42suppress the rigidity from becoming excessively high due to each being sloped in the tire-axial direction, and thus a ride comfort improvement is achieved."], "claims": ["an inside annular part; an outside annular part disposed coaxially at an outer circumferential side of the inside annular part; a plurality of spokes connecting the inside annular part and the outside annular part, the plurality of spokes arranged along a tire-circumferential direction; and a tread provided at an outer circumferential surface of the outside annular part, wherein a pair of inside sloped faces approaching the outside annular part from both ends in a tire-width direction towards the tire-width direction center is formed at an outer circumferential part of the inside annular part opposing the outside annular part, a pair of outside sloped faces approaching the inside annular part from both ends in the tire-width direction towards the tire-width direction center is formed at an inner circumferential part of the outside annular part opposing the inside annular part, each spoke in the plurality of spokes has an intermediate part extending between the inside annular part and the outside annular part, an inside connection part that connects the intermediate part and the inside annular part, and an outside connection part connecting the intermediate part and the outside annular part, the inside connection part includes an inside continuous part having a shape continuously linking to the inside sloped face, and the outside connection part includes an outside continuous part having a shape continuous to the outside sloped face.", "2 . The non-pneumatic tire according to claim 1 , wherein the inside sloped face and the outside sloped face are sloping at an angle greater than 0° and less than 3° relative to a tire-width direction.", "3 . The non-pneumatic tire according to claim 2 , wherein the inside sloped face and the outside sloped face slope at an angle no greater than 2° relative to a tire-width direction.", "wherein the inside continuous part is provided at a side of the inside connection part at which an angle formed by the intermediate part and the inside annular part makes an acute angle, and wherein the outside continuous part is provided at a side of the outside connection part at which an angle formed by the intermediate part and the outside annular part makes an acute angle.", "wherein the inside continuous part is provided at a side of the inside connection part at which an angle formed by the intermediate part and the inside annular part makes an acute angle, and wherein the outside continuous part is provided at a side of the outside connection part at which an angle formed by the intermediate part and the outside annular part makes an acute angle.", "wherein the inside continuous part is provided at a side of the inside connection part at which an angle formed by the intermediate part and the inside annular part makes an acute angle, and wherein the outside continuous part is provided at a side of the outside connection part at which an angle formed by the intermediate part and the outside annular part makes an acute angle.", "wherein the outside sloped face extends to both ends in the tire-width direction of the outside annular part.", "wherein the outside sloped face extends to both ends in the tire-width direction of the outside annular part.", "wherein the outside sloped face extends to both ends in the tire-width direction of the outside annular part.", "wherein the outside sloped face extends to both ends in the tire-width direction of the outside annular part.", "wherein the outside sloped face extends to both ends in the tire-width direction of the outside annular part.", "wherein the outside sloped face extends to both ends in the tire-width direction of the outside annular part.", "13 . The non-pneumatic tire according to claim 1 , wherein each of the inside sloped face and the outside sloped face are flat.", "14 . The non-pneumatic tire according to claim 2 , wherein each of the inside sloped face and the outside sloped face are flat.", "15 . The non-pneumatic tire according to claim 3 , wherein each of the inside sloped face and the outside sloped face are flat.", "16 . The non-pneumatic tire according to claim 4 , wherein each of the inside sloped face and the outside sloped face are flat.", "17 . The non-pneumatic tire according to claim 5 , wherein each of the inside sloped face and the outside sloped face are flat.", "a first spoke at which the intermediate part slopes to one side in the tire-axial direction, and a second spoke at which the intermediate part slopes to the opposite side than the first spoke, wherein the first spoke and the second spoke are alternately disposed in the tire-circumferential direction.", "a first spoke at which the intermediate part slopes to one side in the tire-axial direction, and a second spoke at which the intermediate part slopes to the opposite side than the first spoke, wherein the first spoke and the second spoke are alternately disposed in the tire-circumferential direction.", "a first spoke at which the intermediate part slopes to one side in the tire-axial direction, and a second spoke at which the intermediate part slopes to the opposite side than the first spoke, wherein the first spoke and the second spoke are alternately disposed in the tire-circumferential direction."], "bibtex": "@patent{20240208268,\n    title = {NON-PNEUMATIC TIRE},\n    number = {20240208268},\n    year = {2024},\n    note = {File: US20240208268A1-20240627.XML}\n    }", "classification": "B60C714FI"}, {"title": "PNEUMATIC TYRE FOR A TWO-WHEELED VEHICLE HAVING A PROTECTIVE LAYER", "doc_number": "20240208269", "filename": "US20240208269A1-20240627.XML", "abstract": "A two-wheeler pneumatic tire, in which damage protection and puncture protection are improved while providing good rolling resistance and good tightness; the two-wheeler pneumatic tire in the bead regions has a protective layer which is disposed axially outside the carcass and which has strength members embedded in rubber material; wherein the tire carcass is formed from a first carcass ply and a second carcass ply disposed radially within in a vertex, and wherein the second carcass ply ends with a second carcass ply turn-up in a second carcass ply end in the bead region; the purpose of damage protection and puncture protection is achieved in that the first carcass ply is guided from the respective bead region in a first carcass ply turn-up over the respective tire sidewall to below the tread and at the latter ends in each case in a first carcass ply end; and that in each of the two axial halves the protective layer is guided from the bead region over the respective tire sidewall to below the tread.", "detailed_description": ["FIGS.1and2each show the substantial tire components of a two-wheeler tire1in a cross-sectional view. This is a two-wheeler pneumatic tire1, preferably bicycle tire, particularly preferably road or mountain bike tire, having a tread2, a tire carcass, tire sidewalls3, and in each axial half20of the tire a bead region4with a tire bead having a core5, wherein the two-wheeler pneumatic tire1in the bead regions4has a protective layer8which is disposed axially outside the carcass and which has strength members embedded in rubber material.", "", "The tire carcass is formed from a first carcass ply6and a second carcass ply6′, each having strength members. The strength members within the respective carcass ply here are typically disposed so as to be mutually parallel and at an angle of 40 degrees to 60 degrees in relation to the revolving direction U. The strength members of the two carcass plies6,6′ may have opposing angles of inclination. The tire I may at least be symmetrical in terms of the carcass plies6,6′.", "", "The second carcass ply6′ in a vertex17of the tire1is disposed radially within the first carcass ply6. Said second carcass ply6′ extends from the vertex17of the two-wheeler pneumatic tire1over the tire sidewalls3to both bead regions4, and in the latter wraps the respective core5from axially inside to axially outside, and ends in a second carcass ply end7′ radially within the respective tread end21, in particular in the respective bead region4, as illustrated.", "", "The first carcass ply6extends from the vertex17of the tire1over the tire sidewalls to both bead regions4, and in the latter wraps the respective core from axially inside to axially outside.", "", "The two-wheeler tire is distinguished in that the first carcass ply6is guided from the respective bead region4in a first carcass ply turn-up61over the respective tire sidewall3to below the tread2and at the latter ends in each case in a first carcass ply end7, and in that in each of the two axial halves20the protective layer8is guided from the bead region4over the respective tire sidewall3to below the tread2.", "", "The first carcass ply6ends at the first carcass ply ends7below the tread2. The first carcass ply ends7can thus each be disposed spatially between the tread2and the second carcass ply6′, and radially outside and axially within the tread ends21of the tread. A first straight line18aligned perpendicularly to the second carcass ply6′ can connect the tread2and the first carcass ply end7to one another.", "", "The protective layer8at least conjointly forms an external face of the bead region designed as a contact surface to the rim. The protective layer covers the respective second carcass ply end7′ from axially outside.", "", "The protective layer8, emanating from the sidewalls3, in the bead regions4extends at most to a respective outermost reversal point14of an external edge of the strength members of the second carcass layer6′ which are folded about the core, and here ends in front of the respective outermost reversal point14at a first height13of 0 to 2 mm, measured relative to the outermost reversal point. The sizing of the first height13is visualized inFIG.3.", "", "The second carcass ply6′ ends in the second carcass ply ends7′ in the respective bead region4, in particular in front of the respective sidewall3when emanating from the core. The second carcass ply ends7′ of the second carcass ply6′ may be disposed at a second height15of at most 15 mm, preferably of 10 mm to 12 mm, measured relative to the outermost reversal point14. Sizing of the second height15is highlighted inFIG.3.", "", "In a preferred embodiment, the protective layer is embodied as a woven fabric rubberized with the rubber material, wherein the woven fabric comprises the strength members. The woven fabric can be a woven cord fabric or a woven cross-ply fabric. A particularly good airtightness is achieved with a woven cross-ply fabric comprising monofilaments as strength members.", "", "In one advantageous embodiment, the woven fabric has a thread density of at least100epdm. This may be a woven canvas fabric. In one advantageous embodiment, the strength members are made of polyester or polyamide, preferably polyamide6, particularly preferably polyamide6.6. In one advantageous embodiment, the breaking force of the individual strength member is at least 15 N.", "", "The strength members of the protective layer8may be monofilaments, preferably monofilaments of a woven monofilament fabric.", "", "The carcass is in direct contact with the tire interior10. The tire1in particular has no inner liner. Advantages according to the invention can however also be achieved by a tire1which has a further layer, in particular an inner liner, between tire interior10and carcass.", "", "As is illustrated, a damping rubber insert made of a highly elastic rubber is disposed as an intermediate layer9between the tread2and the tire carcass, wherein the damping rubber insert9in particular has a material thickness between 0.2 mm and 1 mm, measured in the tire vertex. The damping rubber insert may preferably consist of a highly elastic rubber having a material rebound value between70and80.", "", "However, the intermediate layer9can alternatively also be formed from a hard rubber mixture, wherein the rubber insert in particular has a material thickness of a maximum of6mm, measured in the tire vertex. The rubber insert can be a rubber breaker. The hard rubber compound may have a Shore hardness A greater than45and a rebound value greater than60.", "", "Alternatively or additionally to the rubber insert, a protective layer which is not illustrated and, as an intermediate layer, comprises an in particular tear-resistant rubberized woven fabric, preferably a rubberized woven fabric comprising fibers of polyethylene terephthalate—polyacry late, may be disposed between the tread2and the tire carcass.", "", "The tire illustrated is in each case be a tubeless tire, in particular a “tubeless” tire or a “tubeless ready” tire. The tire may be suitable, intended and used for tubeless operation. A tire for operation with a tube, in particular a clincher tire, can however also have an advantageous construction with corresponding features.", "", "The tires illustrated are a racing bike tire. Alternatively, it can also be another bicycle tire, especially a mountain bike tire. But also other tires, in particular tires for a bicycle having an electric motor for driving the bicycle, can be designed accordingly. Motorcycle tires, in particular electric scooter tires, can also have the advantageous construction illustrated.", "", "The embodiments ofFIGS.1and2differ in the extent of the first carcass ply turn-ups61and the design of the protective layer8below the tread2:FIG.1shows a tire1with particularly low rolling resistance. Here, each first carcass ply end7is disposed below the tread2, in particular as illustrated below a tread runout22of the tread, in each case in that axial half20of the tire1in which the first carcass ply6is guided in the first carcass ply turn-up61, over the tire sidewall3to below the tread2, to the respective first carcass ply end7. In the respective axial half20of the tire, the tread runout22extends, proceeding from the respective tread end21, axially inward by at most10mm, preferably at most2mm, as measured along a radially inner boundary of the tread, to an axially inner tread runout end23.", "", "The two first carcass ply turn-ups61therefore do not overlap in the vertex17of the tire1. The first carcass ply ends7are disposed in each case in the same axial half20as that first carcass ply turn-up61that terminates at the respective first carcass ply end7. The first carcass ply turn-ups61are thus disposed so as to be restricted to the respective axial half20of the tire.", "", "The protective layer8illustrated inFIG.1is a protective layer divided into two protective layer parts81, in which in each of the two axial halves20a protective layer part81of the two protective layer parts is guided from the bead region4over the respective tire sidewall3to below the tread2and at the latter, in the respective axial half20, ends in front of the vertex17in a radially outer protective layer part end81′.", "", "The radially outer protective layer part ends81′ can thus each be disposed spatially between the tread2and the second carcass ply6′ and radially outside and axially within the tread ends21of the tread. A first straight line aligned perpendicularly to the second carcass ply6′ can connect the tread2and the radially outer protective layer part end81′ to one other (not shown).", "", "As shown, the respective radially outer protective layer part end81′ can be disposed at most 3 mm axially within the tread end21of the respective axial half20, measured from the tread end21along a radially inner delimitation of the tread.", "", "A corresponding embodiment of the protection layer8is also compatible with a tire according toFIG.2.", "", "FIG.2shows a tire1with particularly good damage protection. As opposed to the tire illustrated inFIG.1, the two first carcass ply turn-ups7are disposed so as to overlap one another in the vertex17of the tire1. Each of the two first carcass ply turn-ups61extends from a bead region4in one axial half20of the tire to below the tread2, and ends in the respective first carcass ply end7in the respective other axial half20of the tire. Thus, in the vertex17of the tire, the tire1is reinforced by four layer thicknesses of the carcass, as illustrated.", "", "The protective layer8illustrated inFIG.2extends integrally from one bead region4over the vertex17to the other bead region4of the two bead regions4. This embodiment of the protective layer8is also compatible with a tire according toFIG.1.", "", "FIG.3highlights the sizing of the first height13and of the second height15. In order to determine the first height13and the second height15, the two-wheeler pneumatic tire1in the cross section thereof can be bent upward in such a way that the two carcass plies6,6′, emanating from the vertex17, are disposed largely rectilinearly in the region of the sidewall3, and transition to a wrapping of the core5that is largely symmetrical in terms of the core5. This can be a fragment of the tire ofFIG.1orFIG.2, wherein the two-wheeler pneumatic tire1in the cross section thereof is correspondingly bent upward. In this arrangement, the first height13and the second height15are measured relative to the outermost reversal point14of an external edge of the strength members of the second carcass ply6′ that are folded around the core5, and measured parallel to the carcass plies6,6′ disposed substantially rectilinearly in the region of the sidewall3."], "claims": ["1 - 14 . (canceled)", "a tread; a tire carcass; tire sidewalls; a bead region having a tire bead with a core; the bead region has a protective layer disposed axially outside the carcass and has strength members embedded in rubber material; the tire carcass formed from a first carcass ply and a second carcass ply, each having strength members; the second carcass ply is disposed in a vertex of the tire radially within the first carcass and extends from the vertex over the tire sidewalls to the bead regions, and in the latter wraps the core from axially inside to axially outside, and ends in a second carcass ply end radially within a tread end of the tread; and the first carcass ply extends from the vertex of the two-wheeler pneumatic tire over the tire sidewalls to the bead regions, and in the latter wraps the core from axially inside to axially outside; and the first carcass ply is guided from the bead region in a first carcass ply turn-up over the respective tire sidewall to below the tread and at the latter ends in a first carcass ply end; and each of two axial halves of the protective layer is guided from the bead region over the respective tire sidewall to below the tread.", "16 . The tire of claim 15 , further comprising a tread runout of the tread in an axial half in which the first carcass ply is guided in the first carcass ply turn-up, over the tire sidewall to below the tread, to the respective first carcass ply end.", "17 . The tire of claim 15 , wherein the first carcass ply turn-up and the second carcass ply turn-up overlap one another in the vertex.", "18 . The tire of claim 15 , wherein the protective layer extends integrally from one bead region over the vertex ( 17 ) to another bead region.", "19 . The tire of claim 15 , wherein the protective layer is divided into two protective layer parts; in that in each of the two axial halves a protective layer part of the two protective layer parts is guided from the bead region over the respective tire sidewall to below the tread and at the latter, in the respective axial half, ends in front of the vertex in a radially outer protective layer part end.", "20 . The tire of claim 15 , wherein the protective layer emanates from the sidewalls in the bead regions and extends at most to a respective outermost reversal point of an external edge of the strength members of the second carcass ply that are folded about the core, and herein ends in front of the respective outermost reversal point at a first height of 0 to 2 mm, measured relative to the outermost reversal point.", "21 . The tire of claim 15 , wherein the protective layer is embodied as a woven fabric rubberized with the rubber material.", "22 . The tire of claim 15 , wherein the strength members of the protective layer are monofilaments.", "23 . The tire of claim 15 , wherein the protective layer has a colored rubber coating or a white rubber coating.", "24 . The tire of claim 15 , wherein the carcass is in direct contact with a tire interior.", "25 . The tire of claim 15 , wherein the tire is airtight and operable without a tube.", "26 . The tire of claim 15 , further comprising a folding core mounted with the bead on a rim flange.", "27 . The tire of claim 15 , the tire carcass comprises a plurality of intermediate layers of a tear-resistant woven fabric.", "28 . The tire of claim 15 , the tire carcass comprises a protective rubber insert having a rubber compound with a Shore hardness of more than 45 and a rebound value of more than 60 ."], "bibtex": "@patent{20240208269,\n    title = {PNEUMATIC TYRE FOR A TWO-WHEELED VEHICLE HAVING A PROTECTIVE LAYER},\n    number = {20240208269},\n    year = {2024},\n    note = {File: US20240208269A1-20240627.XML}\n    }", "classification": "B60C909FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240208270", "filename": "US20240208270A1-20240627.XML", "abstract": "A tire has a first sidewall portion having a reference surface and provided with a raised part. The raised part has a top surface having a second color. The tread portion is provided with shoulder lateral grooves and shoulder blocks The shoulder block has a first block wall surface inclined to the axially outer side toward the radially inner side from a first tread edge The radially inner edge of the first block wall surface is separated from the bottom surface of the shoulder lateral groove by at least 3 mm, and located axially inside a tire radial direction line passing through a position corresponding to the midpoint of the protruding height of the raised part.", "detailed_description": ["An embodiment of present disclosure will now be described in detail in conjunction with accompanying drawings.", "", "FIG.1is a cross-sectional view of a pneumatic tire1as an embodiment of the present disclosure, showing a first cross section including the rotational axis of the tire1in its standard state.", "", "In this embodiment, the tire1is a pneumatic tire for passenger cars, suitably used as a winter tire intended for driving on icy and snowy roads or ground.The present disclosure is however, not limited to such a tire, and may be applied to a pneumatic tire for heavy duty vehicles, for example.", "", "In the case that the tire1is a kind of pneumatic tires for which various standards have been established:the “standard state” means a state of the tire when mounted on a standard wheel rim, and inflated to a standard tire pressure, but loaded with no tire load:the “standard wheel rim” is a wheel rim specified for the tire in a standard system including standards on which the tire is based, for example, the “Standard rim” in JATMA, “Design Rim” in TRA, “Measuring Rim” in ETRTO:the “standard tire pressure” is the air pressure specified for the tire in the above-mentioned standard system, for example, the “maximum air pressure” in JATMA, “INFLATION PRESSURE” in ETRTO, and the maximum air pressure listed in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in TRA; andthe undermentioned “standard load” is the load specified for the tire in the above-mentioned standard system, for example, the “maximum load capacity” in JATMA, “LOAD CAPACITY” in ETRTO, and the maximum tire load listed in the table “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” in TRA.", "", "In the case that the tire1is a tire for which various standards are not yet established:the “standard state” means a standard usage state depending on the purpose of use of the tire and in a condition in which the tire is not attached to a vehicle and no tire load is applied; andthe undermentioned “standard load” means the maximum load that can be applied when the tire is used depending on the purpose of use.", "", "In this application including specification and claims, dimensions and positions of each part or portion of the tire refer to those measured under the standard state unless otherwise noted,", "", "The tire1comprises a tread portion2, a first sidewall portion3A, a second sidewall portion3B, a first bead portion4A, and a second bead portion4B.", "", "The first sidewall portion3A and the second sidewall portion3B extend inward in the tire radial direction from the tread portion2. The first sidewall portion3A and the second sidewall portion3B have a substantially same structure.", "", "The first bead portion4A is continuous to the inner side in the tire radial direction of the first sidewall portion3A. The second bead portion4B is continuous to the inner side in the tire radial direction of the second sidewall portion3B. The first bead portion4A and the second bead portion4B have a substantially same structure.", "", "The structure and configuration of the first sidewall portion3A described below can be applied to the second sidewall portion3B.", "", "Further, the tire1comprises a carcass6and a tread reinforcing layer7.", "", "The carcass6extends from the first bead portion4A to the second bead portion4B through the first sidewall portion3A, the tread portion2, and the second sidewall portion3B.", "", "The tread reinforcing layer7is disposed radially outside the carcass6in the tread portion2.", "", "In the present disclosure, a pair of tread edges, namely, a first tread edge T1and a second tread edge T2, of the tread portion2are defined as the axially outermost edges of the ground contacting patch of the tire when the tire under its standard state is placed on a horizontal flat surface at a camber angle of 0 degrees and loaded by 70% of the normal load.", "", "InFIG.2showing a part of the tread portion2and a part of the first sidewall portion3A, internal structural components are not shown.", "", "As shown in Fig. and Fig., the first sidewall portion3A has a reference surface9having a first color, and is provided with a raised part10which protrudes from the reference surface9. The first color of the reference surface9in this example is black.As shown inFIG.3, in a tire meridian cross section, or a tire cross section including the tire rotational axis and the raised part10, the raised part10protrudes outwardly in the tire axial direction from the reference surface9at a protruding height h.Here, the protruding height h is defined as the maximum height in the tire axial direction from the reference surface9at the root of the raised part10immediately outside in the tire radial direction to the axially outermost point of the raised part10.", "", "As shown inFIG.2, the raised part10constitutes a character, characters, a figure, figures, a symbol or symbols.", "", "InFIG.2, as an example, the raised part10forms an English character “M”.", "", "The raised part10has a top surface11facing outward in the tire axial direction, and the top surface11has a second color different from the first color. InFIG.2, the top surface11is dotted. InFIG.3, a different-colored rubber member26forming the top surface11and having the second color is dotted.", "", "The second color in this example is white. Namely, the different-colored rubber member26is made from white rubber.However, the present disclosure is not limited to such white rubber, and various colors may be adopted for the top surface11.", "", "As shown inFIG.2, the tread portion2is provided with shoulder blocks15divided by shoulder lateral grooves13.", "", "Each of the shoulder lateral grooves13extends outwardly in the tire axial direction beyond the tread edge T1, and has a bottom surface smoothly merged into the reference surface9of the first sidewall portion3A.", "", "As shown inFIG.2andFIG.3, on the radially outer side of the raised part10, there is located at least one of the shoulder blocks15which has a first block wall surface16.", "", "The first block wall surface16extends inwardly in the tire radial direction from the first tread edge T1on the shoulder block15while inclining outwardly in the tire axial direction.", "", "The first block wall surface16has an inner edge25in the tire radial direction, which is spaced apart from the bottom surface of the shoulder lateral groove13, and a minimum distance LI from the inner edge25to the bottom surface is not less than 3 mm in a tire meridian section as shown inFIG.3.", "", "As a result, when driving on a snowy road or ground, the shoulder blocks15sink into the snow together with the first block wall surfaces16, and shear the snow, thereby increasing snow traction.Further, such a configuration can be expected to suppress damage of the bottom surface13dof the shoulder lateral groove13near the inner edge25.The first block wall surface16in this example is inclined at a constant angle with respect to the tire radial direction.In the case of the first block wall surface16having a variable angle with respect to the tire radial direction,the inner edge25corresponds to a position where the first block wall surface16is no longer inclined in the above-mentioned direction, namely, inclined to the axially outside toward the radially inside.", "", "The inner edge25of the first block wall surface16is located axially inside a straight line20passing through a position corresponding to the midpoint of the protruding height h of the raised part.", "", "Therefore, when the tire1with such configuration is stopped after driving on an icy and snowy road or ground, even if muddy water formed by melted snow and ice on the tread flows down to the inner edge25, the dripping hits the reference surface9of the first sidewall portion3A or the side surface of the raised part10and flows down, therefore, the muddy water becomes difficult to reach the top surface11of the raised part10and adhere thereto. As a result, the appearance of the raised part10can be maintained.", "", "Hereinafter, configurations of the present embodiment will be detailed.", "", "Note that each configuration described below indicates a specific example in the present embodiment, therefore, the present disclosure can exhibit the above-described effects even if it does not include the configuration described below.Further, even if any one of the configurations described below is applied alone to the tire of the present disclosure having the above-mentioned characteristics, an improvement in performance in accordance with the applied configuration can be expected.Furthermore, when some of the configurations described below are applied in combination, a combined performance improvement in accordance with the applied configurations can be expected.", "", "FIG.4is a cross-sectional view showing a shoulder block15that can be seen inFIG.3.", "", "As shown inFIG.4, the first block wall surface16extends from the first tread edge T1, namely, the axially outer edge of the shoulder block15toward the inner side in the tire radial direction,while inclined to the axially outside at a constant angle, to have a radially inner edge. Thus, the first block wall surface16is an inclined flat surface.The angle θ1of the first block wall surface16with respect to the tire radial direction is, for example, in a range from 20 to 30 degrees.The present disclosure is however, not limited to this example, and the first block wall surface16may be smoothly curved.", "", "As shown inFIG.2, the dimension of the first block wall surface16in the tire circumferential direction is gradually decreased toward the inside in the tire radial direction. Thereby, the shoulder lateral grooves13can catch a large volume of snow, and excellent on-snow performance is exhibited.", "", "The present disclosure is however, not limited to such configuration.", "", "The first block wall surface16in this embodiment is provided with at least one narrow groove22extending from the first tread edge T1at least to the inner edge25of the first block wall surface16.", "", "Preferably, the narrow groove22traverses the ground contacting top surface of the shoulder block15from the first tread edge T1toward the inside in the tire axial direction. Such narrow grooves22improve the on-snow performance, and help to prevent muddy water from adhering to the top surface11of the raised part10by dispersing the path for muddy water to flow down.", "", "As shown inFIG.4, the shoulder block15has a second block wall surface17and a third block wall surface18.", "", "The second block wall surface17is connected to the radially inner edge25of the first block wall surface16.", "", "The second block wall surface17is parallel to the tire radial direction, or alternatively, inclined to the inside in the tire axial direction toward the inside in the tire radial direction from the radially inner edge25of the first block wall surface16.", "", "The third block wall surface18is connected to the radially inner edge of the second block wall surface17.", "", "The third block wall surface18is inclined to the outside in the tire axial direction toward the inside in the tire radial direction from the radially inner edge of the second block wall surface17.", "", "The angle θ2of the second block wall surface17with respect to the tire radial direction is not more than 50 degrees, preferably not more than 20 degrees. This prevents muddy water from dripping from the radially inner edge25of the first block wall surface16, making it easier for muddy water to flow down along the second block wall surface17, and making it difficult for muddy water to adhere to the top surface11of the raised part10.", "", "In order to prevent muddy water from adhering to the top surface11of the raised part10, it is preferred that, between the radially inner edge25of the first block wall surface16and the raised part10, the muddy water is guided to flow down along the outer surface of the tire so that the muddy water flows at a relatively slow speed. From this point of view, the angle θ3of the third block wall surface18with respect to the tire radial direction is set in a range from 10 to 20 degrees, for example.", "", "From a similar point of view, it is preferred that the axially outer surface of the tire between the radially inner edge25of the first block wall surface16and the raised part10, has a portion or portions where the angle with respect to the tire radial direction is 10 degrees or less, and the total length in the tire radial direction of such portion or portions is not more than 6.5 times the protruding height h.", "", "The raised part10has a radially outer side surface28facing outward in the tire radial direction and extending from the reference surface9of the first sidewall portion3A to the top surface11.", "", "The angle θ4between the radially outer side surface28and the reference surface9is set in a range from 80 to 98 degrees. Thereby, the muddy water flowing down along the reference surface9of the first sidewall portion3A is reduced in flowing force, and flows sideways. As a result, the muddy water becomes difficult to reach the top surface11of the raised part10and adhere thereto.", "", "As shown inFIG.2, it is desirable that, between the shoulder block15and the raised part10, there is formed a rib30extending in the tire circumferential direction and protruding outward in the tire axial direction.", "", "Such ribs30can direct the flow of muddy water along the tire circumferential direction, and can further suppress muddy water from adhering to the top surface11of the raised part10.", "", "FIG.5is an enlarged schematic side partial view of the tire showing the positional relationship between the first block wall surface16and the raised part10.", "", "As shown inFIG.5, it is desirable that the position in the tire circumferential direction of the center28cin the tire circumferential direction of the radially outer side surface28of the raised part10is shifted in the tire circumferential direction from the center position25cin the tire circumferential direction of the radially inner edge25of the first block wall surface16. This makes it difficult for muddy water flowing down from the first block wall surface16to adhere to the top surface11of the raised part10.When the radially inner edge25is interrupted by the narrow groove22as in the present embodiment, the center position25cis determined by filling up the narrow groove22.", "", "In this embodiment, since “M” is formed by the raised part10, the radially outer side surface28in this example includes a recess29which is concave inwardly in the tire radial direction when viewed from the side of the tire as shown inFIG.5.", "", "Further, the center position in the tire circumferential direction of the recess29(in this embodiment, corresponds to the center position28cof the radially outer side surface28) is shifted in the tire circumferential direction from the center position25cin the tire circumferential direction of the radially inner edge25of the first block wall surface16. Thereby, it is possible to suppress muddy water from entering the recess29.", "", "FIG.6shows another example of the raised part10.", "", "FIG.7shows a cross section of the raised part10shown inFIG.6.As shown inFIG.6andFIG.7, in this example, the raised part10comprisesa pedestal portion33protruding outward in the tire axial direction from the reference surface9, anda mark portion34protruding outward in the tire axial direction from the pedestal portion33and constituting a letter or letters, a figure or figures or a symbol or symbols.In this example, since the raised part10includes the pedestal portion33, it is possible to effectively suppress muddy water from adhering to the top surface11of the raised part10.", "", "As shown inFIG.7, the axially outer surface of the tire between the radially inner edge25of the first block wall surface16and the raised part10, has a portion or portions where the angle with respect to the tire radial direction is 10 degrees or less, and the total length in the tire radial direction of such portion or portions is not more than 4.0 times the maximum protruding height HP in the tire axial direction of the pedestal portion33. Thereby, the speed at which the muddy water flows down can be reduced, and the adhesion of the muddy water to the top surface11of the raised part10can be effectively suppressed.", "", "While detailed description has been made of preferable embodiments of the present disclosure, the present disclosure can be embodied in various forms without being limited to the illustrated embodiments."], "claims": ["a tread portion having a first tread edge; and a first sidewall portion extending inward in the tire radial direction from the tread portion, wherein the first sidewall portion comprises a reference surface having a first color, and a raised part protruding outward in the tire axial direction from the reference surface at a protruding height h in a first cross section of the tire including the rotational axis of the tire and the raised part, the raised part has a top surface facing outward in the tire axial direction and having a second color different from the first color, the tread portion is provided with a plurality of shoulder lateral grooves having a bottom surface extending outwardly in the tire axial direction beyond the first tread edge and smoothly merged into the reference surface of the first sidewall portion, and a plurality of shoulder blocks divided by the shoulder lateral grooves, at least one of the shoulder blocks is located on the outer side in the tire radial direction, of the raised part, the at least one shoulder block has a first block wall surface extending from the first tread edge toward the inner side in the tire radial direction, while inclining to the outer side in the tire axial direction, so as to have a radially inner edge, in the above-said first cross section, the radially inner edge of the first block wall surface is separated from the bottom surface of the shoulder lateral groove, so that a minimum distance from the radially inner edge to the bottom surface is not less than 3 mm, and in the above-said first cross section, the radially inner edge of the first block wall surface is located inward in the tire axial direction of a straight line drawn parallel to the radial direction of the tire passing through a position corresponding to a midpoint (h/2) of the protruding height h of the raised part.", "the at least one shoulder block has a second block wall surface connected to the radially inner edge of the first block wall surface, and the second block wall surface extends inward in the tire radial direction from the radially inner edge of the first block wall surface, while inclining to the inner side in the tire axial direction or in parallel to the tire radial direction, so that the angle of the second block wall surface with respect to the tire radial direction is not more than 50 degrees.", "the outer surface of the tire between the radially inner edge of the first block wall surface and the raised part has a portion or portions where the angle with respect to the radial direction of the tire is 10 degrees or less in the above-said first cross section, and a total length in the tire radial direction of the portion or portions is not more than 6.5 times the protruding height h in the above-said first cross section.", "the outer surface of the tire between the radially inner edge of the first block wall surface and the raised part has a portion or portions where the angle with respect to the radial direction of the tire is 10 degrees or less in the above-said first cross section, and a total length in the tire radial direction of the portion or portions is not more than 6.5 times the protruding height h in the above-said first cross section.", "the raised part has a radially outer side surface facing outward in the tire radial direction, and extending from the reference surface to the top surface of the first sidewall portion, and the angle between the radially outer side surface and the reference surface is in a range from 80 to 98 degrees in the above-said first cross section.", "the raised part has a radially outer side surface facing outward in the tire radial direction, and extending from the reference surface to the top surface of the first sidewall portion, and the angle between the radially outer side surface and the reference surface is in a range from 80 to 98 degrees in the above-said first cross section.", "the raised part has a radially outer side surface facing outward in the tire radial direction, and extending from the reference surface to the top surface of the first sidewall portion, and the angle between the radially outer side surface and the reference surface is in a range from 80 to 98 degrees in the above-said first cross section.", "the raised part has a radially outer side surface facing outward in the tire radial direction, and extending from the reference surface to the top surface of the first sidewall portion, and the angle between the radially outer side surface and the reference surface is in a range from 80 to 98 degrees in the above-said first cross section.", "a rib protruding outward in the tire axial direction and extending in the circumferential direction of the tire, is provided between the at least one shoulder block and the raised part.", "a rib protruding outward in the tire axial direction and extending in the circumferential direction of the tire, is provided between the at least one shoulder block and the raised part.", "a rib protruding outward in the tire axial direction and extending in the circumferential direction of the tire, is provided between the at least one shoulder block and the raised part.", "the first block wall surface is provided with at least one narrow groove extending from the first tread edge to the radially inner edge of the first block wall surface.", "the first block wall surface is provided with at least one narrow groove extending from the first tread edge to the radially inner edge of the first block wall surface.", "the first block wall surface is provided with at least one narrow groove extending from the first tread edge to the radially inner edge of the first block wall surface.", "the first block wall surface is provided with at least one narrow groove extending from the first tread edge to the radially inner edge of the first block wall surface.", "the dimension in the tire circumferential direction of the first block wall surface is gradually decreased toward the inner side in the tire radial direction, and the center position in the tire circumferential direction of the radially outer side surface is shifted in the tire circumferential direction from the center position in the tire circumferential direction of the radially inner edge of the first block wall surface.", "the raised part has a radially outer side surface facing outward in the tire radial direction, and extending from the reference surface to the top surface of the first sidewall portion, the radially outer side surface includes a recess concave inward in the tire radial direction, and the center position in the tire circumferential direction of the recess is shifted in the tire circumferential direction from the center position in the tire circumferential direction of the radially inner edge of the first block wall surface.", "the radially outer side surface includes a recess concave inward in the tire radial direction, and the center position in the tire circumferential direction of the recess is shifted in the tire circumferential direction from the center position in the tire circumferential direction of the radially inner edge of the first block wall surface.", "the raised part comprises a pedestal portion protruding outward in the tire axial direction from the reference surface, and a mark portion protruding outward in the tire axial direction from the pedestal portion and constituting a letter, a figure or a symbol, the outer surface of the tire between the radially inner edge of the first block wall surface and the raised part has a portion or portions where the angle with respect to the radial direction of the tire is 10 degrees or less in the above-said first cross section, and a total length in the tire radial direction of the portion or portions is not more than 4.0 times a maximum protruding height in the tire axial direction of the pedestal part in the above-said first cross section."], "bibtex": "@patent{20240208270,\n    title = {PNEUMATIC TIRE},\n    number = {20240208270},\n    year = {2024},\n    note = {File: US20240208270A1-20240627.XML}\n    }", "classification": "B60C1302FI"}, {"title": "TREAD HAVING TURN AROUND SIPE", "doc_number": "20240208271", "filename": "US20240208271A1-20240627.XML", "abstract": "A heavy truck tire tread that has a shoulder rib and shoulder groove is provided. A sipe is in the shoulder rib that extends from the shoulder groove to the lateral outer surface. A first end of a teardrop of the sipe is located at the lateral outer surface, and a second end at the shoulder groove. A middle section of the teardrop is located between the first and second ends in the lateral direction. A first transition is located between the first end and the middle section, and a second transition is located between the second end and the middle section and they both extend in the lateral and thickness directions. The entire middle section is farther from the upper surface in the thickness direction than any portion of the first or second ends are to the upper surface in the thickness direction.", "detailed_description": ["Reference will now be made in detail to embodiments of the invention, one or more examples of which are illustrated in the drawings. Each example is provided by way of explanation of the invention, and not meant as a limitation of the invention. For example, features illustrated or described as part of one embodiment can be used with another embodiment to yield still a third embodiment. It is intended that the present invention include these and other modifications and variations.", "", "The present invention provides for a turn around sipe22design for a tread12of a heavy truck tire10that reduces or eliminates crack propagation while at the same time maintaining rigidity and end of life performance. The turn around sipe22is configured into five segments30,42,54,66,78that are contiguous so that the sipe22extends outboard in a lateral direction28, turns around, and then extends inboard in the lateral direction28. The first segment30is oriented at a first segment angle38that is larger than a second segment angle50of a contiguous second segment42. Likewise, a third segment54is oriented at a third segment angle62that is greater than a fourth segment angle74of a fourth segment66that is contiguous to the third segment54. The fifth segment78is contiguous with both the second and fourth segments42,66and is located within a 20% length82of the rolling tread width80from the first tread edge18. In other embodiments, the length82is from 20%-30% of the rolling tread width80from the first tread edge18, and in yet other embodiments the length82is 30% of the rolling tread width80from the first tread edge18. The turn around sipe22creates a geometry that reduces or eliminates crack propagation/formation. With the geometry provided, the overall depth of the sipe22in the thickness direction24does not need to be moved up to the upper surface16, and the cross-sectional size of the teardrop90of the sipe22, if present, does not need to be increased.", "", "FIG.1shows a tire10that is a heavy duty truck tire10. In this regard, the tire10is not designed for nor used with a car, motorcycle, or light truck (payload capacity less than 4,000 pounds), but is instead designed for and used with heavy duty trucks such as 18 wheelers, garbage trucks, or box trucks. The tire10may be a steer tire, a drive tire, a trailer tire, or an all position tire. In a preferred embodiment, the tire10that includes the turn around sipe22as used herein is a drive tire of a tractor of a tractor trailer, however the sipe22is not shown inFIG.1. The tire10includes a sidewall104onto which a tread12is disposed thereon. The central axis of the tire10extends through the center of the sidewall104, and the lateral/axial direction28of the tire10is parallel to the central axis. The thickness direction24, which is also known as the radial direction24, of the tire10is perpendicular to the central axis, and the tread12is located farther from the central axis in the thickness direction24than the sidewall104. The tread12extends all the way around the sidewall104in the circumferential direction26of the tire10and circles the central axis 360 degrees. The tread12has a series of ribs14and grooves102that are oriented at an angle so as to extend in both the circumferential direction26and the lateral direction28.", "", "With reference now toFIG.2, a top view of the tread12is provided that includes the turn around sipe22which is a structural feature that can reduce tearing or crack initiation and propagation. The sipes22are thin grooves/cuts in the tread12. The sipes22at the upper surface16of the tread12may have widths that are two millimeters or less. The sipe22has a body that extends from the upper surface16down into the tread12in the thickness direction24, and the body has a width that is likewise 2 millimeters or less. At the bottom of the body, a teardrop90may be included in the sipe22. The teardrop90may be less than two millimeters or may be greater than or equal to two millimeters in cross-sectional size or diameter. The tread12includes grooves102that extend in both the lateral direction28and the circumferential direction26and are spaced from one another along the circumferential direction26. Ribs14are between the grooves102and likewise extend in both the circumferential and lateral directions26,28. The turn around sipes22are located in the angled ribs14.", "", "The tread12has a first tread edge18on one end and a second tread edge20located on an opposite end in the lateral direction28. The rolling tread width80extends from the first tread edge18to the second tread edge20in the lateral direction28, and is the portion of the tread12that engages the ground during use of the tire10. A lateral midpoint88is defined as the midpoint in the lateral direction28such that one half of the tread12is between the first tread edge18and the lateral midpoint88, and so that the other half of the tread12is between the lateral midpoint88and the second tread edge20. A 20% length82is defined as being 20% of the length of the rolling tread width80in the lateral direction82. As such, length82is 20% of the length80. The 20% length82begins at the first tread edge18and extends inboard in the lateral direction28towards the lateral midpoint88so as to extend along 20% of the length80. The 20% length82thus does not reach the lateral midpoint88which would be 50% of the length of 80 from the first tread edge18. In other embodiments, the 20% length82could be changed to be instead a 30% length82in which length82is 30% of the length80.", "", "The turn around sipe22is positioned on the tread12so that it does not engage the first tread edge18but is instead spaced from and free from engagement with the first tread edge18in the lateral direction28. The turn around sipe22is positioned proximate to the first tread edge18so that the fifth segment78is located within the 20% length82. In some instances, the entire fifth segment78is located within the 20% length82. Other portions of the sipe22such as the second and fourth segments42and66may be both inside and outside of the 20% length82, and other portions of the sipe22such as the first and third segments30,54are completely outside of the 20% length82.", "", "The sipe22includes a first segment30that is a portion of the sipe22and includes a first segment inboard point32that is the point of the first segment30that is farthest from the first tread edge18in the lateral direction28. The first segment30also has a first segment outboard point34that is the portion of the first segment30that is closest to the first tread edge18. A first segment line36is defined as being a straight line that extends from the first segment inboard point32to the first segment outboard point34. The entire first segment30extends in a straight line inFIG.2, so the first segment line36overlays completely the entire first segment30. Also illustrated inFIG.2is a first segment lateral line40that extends completely in the lateral direction28with no component of extension in the circumferential direction26. The first segment lateral line40extends through the first segment inboard point32. A first segment angle38is defined as being between the first segment lateral line40and the first segment line36, and this first segment angle38is less than 90 degrees. The first segment angle38may be 45 degrees, from 40-50 degrees, 65 degrees, from 60-70 degrees, from 35-55 degrees or any degree less than 90 degrees in accordance with different embodiments, however the first segment angle38is greater than 0 degrees.", "", "The turn around sipe22has a second segment42that is contiguous with the first segment30. The second segment42as with the first segment30extends both in the circumferential and lateral directions26,28. The second segment42has a second segment inboard point44that is the portion of the second segment42that is the most inboard in the lateral direction28. The second segment inboard point44is coincident with the first segment outboard point34such that these two points34,44lay on top of one another. The second segment42also has a second segment outboard point46which is the outboard most portion of the second segment42in the lateral direction28. A second segment line48extends from the second segment inboard point44to the second segment outboard point46. The second segment42has a slight curve to it and the second segment line48does not lay exactly along the second segment42. A second segment lateral line52extends completely in the lateral direction28and extends through the second segment inboard point44. A second segment angle50is measured from the second segment lateral line52to the second segment line48and is less than 90 degrees. The second segment angle50may be 20 degrees, from 15-25 degrees, from 10-30 degrees, or other degrees in other embodiments. The second segment angle50may be greater than 0 degrees. The magnitude of the second segment angle50is less than the magnitude of the first segment angle38.", "", "The third segment54of the sipe22has a third segment inboard point56which is the most inboard portion of the third segment54in the lateral direction28. The third segment54also has a third segment outboard point58that is the most outboard portion of the third segment54. A third segment line60extends from the third segment inboard point56to the third segment outboard point58. The third segment54is linear and the third segment line60completely overlays the third segment54. A third segment lateral line64extends completely in the lateral direction28and through the third segment inboard point56. A third segment angle62is less than 90 degrees and is measured from the third segment lateral line64to the third segment line60. The third segment angle62may be 45 degrees, from 40-50 degrees, 65 degrees, from 60-70 degrees, from 35-55 degrees or any degree less than 90 degrees in accordance with different embodiments, however the third segment angle62is greater than 0 degrees.", "", "The sipe22also has a fourth segment66that is contiguous with the third segment54and extends in both the circumferential and lateral directions26,28. The fourth segment66has a fourth segment inboard point68that is coincident with the third segment outboard point58and is the portion of the fourth segment66that is located the most inboard in the lateral direction28. The fourth segment66has a fourth segment outboard point70that is the most outboard portion of the fourth segment66in the lateral direction28. A fourth segment line72extends from the fourth segment inboard point68to the fourth segment outboard point70. The fourth segment line72does not completely overlay the fourth segment66as the fourth segment66changes direction slightly along its length so that it is not completely linear in the top view ofFIG.2. A fourth segment lateral line76extend through the fourth segment inboard point68and is completely oriented in the lateral direction28. The fourth segment angle74is measured from the fourth segment lateral line76to the fourth segment line72. The fourth segment angle74may be 20 degrees, from 15-25 degrees, from 10-30 degrees, or other degrees in other embodiments. The fourth segment angle74may be greater than 0 degrees. The magnitude of the third segment angle62is greater than the magnitude of the fourth segment angle74.", "", "The fifth segment78of the sipe22is contiguous with both the second segment42and the fourth segment66and extends from the second segment outboard point46to the fourth segment outboard point70. The entire fifth segment78is within the 20% length82, although in other embodiments only a portion of the fifth segment78need be within the 20% length82. In some embodiments, the majority of the fifth segment78is within the 20% length82. The fifth segment78may extend completely in the circumferential direction26with no component in the lateral direction28, or in different arrangements the fifth segment78may be configured so that it has a component of extension in both the circumferential direction26and the lateral direction28.", "", "In some embodiments, the first segment angle38is of a magnitude that is the same as the magnitude of the third segment angle62, and the second segment angle50is of the same magnitude as that of the fourth segment angle74. All five segments30,42,54,66,78may be straight such that the first segment30and the third segment54are parallel to one another, and so that the second segment42is parallel to the fourth segment66. In the embodiments where the segments are not straight, such as inFIG.2where the second and fourth segments42,66, the second segment line48can be parallel to the fourth segment line72. Further, the first segment line36may be parallel to the third segment line60. In other embodiments, none of the lines36,48,60,72are parallel to one another, or only a pair of the lines are parallel and the other pair of lines are not parallel.", "", "The angles38,50,62,74can be arranged so that none of them have the same magnitude, or so that some of them do in fact share the same magnitude with one another. However, it will never be the case that all of the angles38,50,62,74have the same magnitude. Although some of the sipe22is within the 20% length82, it may be the case that portions of the sipe22are outside of the 20% length82. The entire first segment36and third segment54may be outside the 20% length82. In other embodiments, the entire sipe22is within the 20% length82. The first segment inboard point32and the third segment inboard point56are both located outboard from the lateral midpoint88in the lateral direction28. In other embodiments, the points32,56may be located at the lateral midpoint88, or extend beyond the lateral midpoint88. The sipe22as shown inFIG.2extends beyond the first and third segments36,54past the lateral midpoint88and to a position proximate to the second tread edge20. However, the sipe22does not engage the second tread edge20and is thus spaced from and free from engagement with the second tread edge20. The sipe22could also be described as having the four segments36,42,54,66on the right hand side of the sipe22which is unlabeled and thus the sipe22has a turn around feature on both of its lateral ends. The tread12may include a plurality of sipes22in which some or all of them have a turn around feature, and some or all of them may have turn around features both lateral ends as shown inFIG.2. In other embodiments, the tread12will have sipes that do not have the turn around feature, or may be arranged so that they have the turn around feature on one lateral end but not the other. The grooves102extend in from the tread edges18,20but do not extend as far inboard so as to engage the lateral midpoint88. Although a single sipe22in each rib14is disclosed, other embodiments are possible in which a plurality of sipes22that have the turn around feature are within each one of the ribs14.", "", "The tread12is directional in that the tire10that includes the tread12is designed to roll primarily in one direction. The arrangement of the features such as the grooves102, ribs14, and sipes22may facilitate the directional properties of the tread12. With respect to the circumferential direction26, the rolling direction100is shown which the direction the tread12is designed to roll during use of the tire10. However, it is to be understood that tire10could travel in the direction opposite to the rolling direction100during certain times such as when the vehicle is backing up. The turn around sipe22is positioned relative to the rolling direction100so that the first segment36is forward from the second segment42in the rolling direction100. The third segment54is forward from the fourth segment66in the rolling direction100. Also, the first and second segments36,42are forward of the third and fourth segments54,66in the rolling direction100. The first segment inboard point32may be the portion of the five segments35,42,54,66,78that is the most forward in the rolling direction100. In some embodiments, the first segment inboard point32is the forward most portion of the sipe22in the rolling direction100.", "", "FIG.3shows an alternate embodiment in which the turn around sipe22is configured the same as that previously disclosed with respect toFIG.2, and a repeat of this information is not necessary. The tread12differs in that decoupling grooves84are present proximate to both side edges18,20. The decoupling groove84decouples the shoulder rib106from the center rib of the tread12. Likewise, the decoupling groove (unlabeled) on the right hand side decouples the shoulder rib108from the center rib of the tread12. The decoupling groove84is arranged in the circumferential direction26with no component of extension in the lateral direction28, and engages the grooves102. Additionally, the decoupling groove84engages the turn around sipe22at the second segment42and at the fourth segment66. The decoupling groove84is free from engagement with the first segment36, third segment54, and fifth segment78. The decoupling groove84is discontinuous across the turn around sipe22so that it does not extend from the second segment42to the fourth segment66. As such, the upper surface16of the tread12is continuous at all points within the perimeter formed by the sipe22.", "", "Another exemplary embodiment of the tread12is shown inFIG.4which is similar to that ofFIGS.2and3and thus a repeat of the features of the tread12is not necessary. However, the arrangement inFIG.4differs from that ofFIG.3in that the decoupling groove84is continuous around the entire circumference of the tire10, at most being discontinuous within the grooves102and turn around sipe22which it engages. In this regard, the decoupling groove84engages the second segment42and extends to and engages the fourth segment66. The upper surface16within the perimeter formed by the sipe22is thus discontinuous due to the presence of the decoupling groove. The center rib and the shoulder rib106are thus both present within the upper surface16that is within the perimeter of the sipe22. The other decoupling groove (not labeled) likewise extends across the upper surface16bound by the sipe22so that both the center rib and the shoulder rib108are likewise present within the perimeter of the sipe22.", "", "Another exemplary embodiment of the tread12is shown with reference toFIG.5. The tread12has a center rib112and a shoulder rib106with a shoulder groove86separating the center rib112from the shoulder rib106. The shoulder groove86is a circumferential groove that extends the entire circumference around the tire10. There is another shoulder groove (unlabeled) that separates the center rib112from the shoulder rib108which is likewise oriented in the circumferential direction26. The shoulder rib106has a portion that is decoupled via a decoupling groove84. The decoupling groove84is broken up into multiple sections that each have components of extension in the lateral direction28and circumferential direction26. The decoupling groove84engages the grooves102and functions to decouple the laterally outboard portion of the shoulder rib106from the laterally inboard portion of the shoulder rib106. The rib14forms a portion of the shoulder rib106that is defined between two consecutive grooves102, the shoulder groove86, and the first tread edge18. The turn around sipe22is located in the rib14and is thus located within the shoulder groove106. The turn around sipe22is provided with first, second, third, fourth and fifth segments30,42,54,66,78in the same manner as previously discussed, and a repeat of this information is not necessary. One difference between the turn around sipe22ofFIG.2and that inFIG.5is that the second and fourth segments42,66are straight completely from their inboard points44,68to their outboard points46,70. The grooves102as shown herein are parallel with the adjacent sipes22such that the grooves102have different segments some of which are parallel to the first and third segments36,54and others of which are parallel to the second and fourth segments42,72. All of the variously illustrated embodiments in the figures are arranged in this manner with parallel sipes22and grooves102. However, other embodiments exist in which the entire grooves102are not parallel with the sipes22, or in which some parts of the grooves102are parallel with some or all of the sipes22and other parts of the grooves102are not parallel with all of the sipes22.", "", "The first segment inboard point32and the third segment inboard point56are located at the shoulder groove86. The fifth segment78is spaced from the first tread edge18and is not in contact therewith. The entire fifth segment78and the decoupling groove84are both contained entirely within the 20% length82. The decoupling groove86is outside of the 20% length82. The points44,34may be within the 20% length82, and the points58,68may be outside of the 20% length82, but in other embodiments the various points34,44,58,68could be inside or outside of the 20% length82. The decoupling groove84engages both the second segment42and the fourth segment66and extends completely from the second segment42to the fourth segment66so that the upper surface16defined within the perimeter of the sipe22is discontinuous inboard and outboard of the decoupling groove84in the lateral direction28. The fifth segment78is located within the portion of the rib14that is decoupled by the decoupling groove86.", "", "The sipe22ends at the shoulder groove86and does not extend inboard beyond the shoulder groove86in the lateral direction28. The rib14continues on beyond the shoulder groove86inboard in the lateral direction28to a point slightly past the lateral midpoint88in the lateral direction28at which point it terminates by encountering a groove102extending inboard from the second tread edge20. A sipe110extends in the rib14from the shoulder groove86to the end of the rib14which terminates at the previously mentioned groove102. This sipe110is wavy in shape and is not part of the turn around sipe22in the rib14. There is no portion of the turn around sipe22between the shoulder groove86and the lateral midpoint88. The right hand side of the tread12is arranged in a similar manner and thus a repeat of this information is not necessary.", "", "Another arrangement of the tread12is shown with reference toFIGS.6and7in which the turn around sipe22is configured with the five segments30,42,54,66,78as previously discussed. However, the turn around sipe22is not straight but includes segments30,42,54,66,78that are wavy in shape. In other embodiments, the segments30,42,54,66,78can be variously shaped such as being zig-zag, angled, wavy, straight, or curved. The lines40,48,60,72may still be straight regardless of whether the segments30,42,54,66are not straight. The tread12includes a sacrificial rib92on both sides of the tread12in the lateral direction28. The sacrificial rib92is not included within the rolling tread width80and thus is laterally outboard of the 20% length in the lateral direction28. The sacrificial rib92protects the shoulder of the tread12from abnormal wear, and has an upper surface that is located lower than the upper surface16in the thickness direction24. The turn around sipe22is not located within the sacrificial rib92, and again ends short of the first tread edge18so that the turn around sipe22is spaced from and not in engagement with the first tread edge18. The first and third segments30,54end at the lateral midpoint88such that the first segment inboard point32and the third segment inboard point56are both located at the lateral midpoint88. Teardrops90are located at the bottom of the sipe22in the thickness direction24and have a circular cross-sectional shape.", "", "The sipe22continues past the lateral midpoint88and forms another turn around sipe22on the right hand side of the tread12which terminates short of the second tread edge20and spaced therefrom in the lateral direction28. The sacrificial rib on the right hand side is configured the same way as the sacrificial rib92previously described.", "", "Another embodiment of the tread12is shown with reference toFIGS.8and9in which the ribs14are not angled as in previous embodiments. The tread12includes a center groove that extends in the circumferential direction in which the lateral midpoint88is located therein. The tread includes a pair of center ribs112on either side of the center groove in the lateral direction28. An intermediate rib114is located between a shoulder rib106and the left center rib112. An intermediate rib116is located between the right center groove112and the shoulder rib108. The shoulder groove86separates the shoulder rib106from the intermediate rib114, and a counterpart shoulder groove likewise separates the intermediate rib116from the shoulder rib108. The turn around sipe22can be configured with the five segments30,42,54,66,78as previously described and a repeat of this information is not necessary. The inboard points32,56are located at the center groove at the left hand center rib112. The entire shoulder rib106is within the 20% length82, and the entire first and third segments30,54are straight along their entire lengths, with the outboard points34,58being within the 20% length82. The first and third segments30,54extend completely across the entire left hand center groove112and the intermediate rib114.", "", "The shoulder rib106includes a plurality of block grooves96that extend in the lateral direction28, with no component of extension in the circumferential direction26, and open into the first tread edge18. A shoulder rib block98is located between successive block grooves96and the turn around sipe22is located within the shoulder rib block98so that the entire second segment42, fourth segment66, and fifth segment78are completely within the shoulder rib block98, and so that minority portions of the first and third segments30,54are within the shoulder rib block98. The shoulder rib block98has a square shape, but could be rectangular or variously shaped in accordance with other exemplary embodiments. The turn around sipe22has a teardrop90at its bottom which is at the same position in the thickness direction24as the bottom of the block grooves96. The teardrop can have the same size and shape along all five segments30,42,54,66,78or may be differently sized and/or shaped or not even present in one or more of the segments30,42,54,66,78.", "", "Although shown incorporated into a shoulder rib106that has a block design in which block grooves96are present in the shoulder rib106, the turn around sipe22can also be used with a tread12that features a shoulder rib106that is a solid shoulder rib106that does not have block grooves96in it, and consequently is not broken up into a plurality of shoulder rib blocks98. By being present within the shoulder rib106, it is to be understood that this means at least the fifth segment78is present within the shoulder rib106.", "", "In the various embodiments, the first and third segment lines36,60can be longer than the second and fourth segment lines48,72. The fifth segment78may be the shortest segment of the entire turn around sipe22such that the fifth segment78is shorter than the other segments30,42,54,66. The first and third segment lines36,60may each be 5 millimeters or longer in some embodiments. The second and third segment lines48,72may be each 3 millimeters or longer in some embodiments. The fifth segment78may be 3 millimeters in length or longer in some embodiments. The five segments30,42,54,66,78may make up the entire turn around sipe22, or there may be other segments in addition to the five segments30,42,54,66,78that make up the rest of the sipe22as for example theFIG.4embodiment in which the sipe22has other portions to it besides just the five segments designed as segments30,42,54,66,78.", "", "The provision of the turn around sipe22with the fifth segment78in the 20% length82causes the end of life traction to not be compromised, and minimizes impact to rolling resistance and wear. The aforementioned placement of the fifth segment78with the rest of the turn around sipe22minimizes shoulder bottom groove cracking when the sipe22has a teardrop90such that the teardrop90is present within the shoulder rib106or otherwise within the 20% length82. Although described as having the fifth segment78within the 20% length82, other embodiments of the tread12exist in which the 20% length is instead a 10% length such that the entire fifth segment78is within 10% of the rolling tread width80to the first tread edge18. The turn around shape of the sipe22in addition to the orientation of the angles38,50,62,74allows for the benefits of having a sipe22proximate to the tread edge18and/or within a shoulder rib106, while reducing or in some cases eliminating the negative consequences of having a sipe in the shoulder rib106. The turn around sipe22may be arranged so that it does not open into the shoulder such that it does not extend to the first tread edge18(or second tread edge20). As the turn around sipe22is not exposed in this manner to the outside of the tread12, the geometry may provide better resistance to aggression, which may be defined as cracking at the bottom of the sipe22, that can be induced by impact or scrub. The sipe22can thus be more durable.", "", "While the present subject matter has been described in detail with respect to specific embodiments and methods thereof, it will be appreciated that those skilled in the art, upon attaining an understanding of the foregoing may readily produce alterations to, variations of, and equivalents to such embodiments. Accordingly, the scope of the present disclosure is by way of example rather than by way of limitation, and the subject disclosure does not preclude inclusion of such modifications, variations and/or additions to the present subject matter as would be apparent."], "claims": ["a sipe that has a first segment that extends forward in the circumferential direction and outboard in the lateral direction, wherein the first segment has a first segment inboard point and a first segment outboard point and a first segment line that extends from the first segment inboard point to the first segment outboard point, wherein a first segment angle is less than 90 degrees and is measured between a first segment lateral line and the first segment line, wherein the first segment lateral line extends completely in the lateral direction and extends through the first segment inboard point, wherein the first segment inboard point is the farthest inboard position of the first segment in the lateral direction, and wherein the first segment outboard point is the farthest outboard position of the first segment in the lateral direction; a second segment that extends forward in the circumferential direction and outboard in the lateral direction, wherein the second segment has a second segment inboard point coincident with the first segment outboard point, wherein the second segment has a second segment outboard point that is a farthest outboard position of the second segment in the lateral direction, wherein the second segment has a second segment line that extends from the second segment inboard point to the second segment outboard point, wherein a second segment angle is less than 90 degrees and is measured between a second segment lateral line and the second segment line, wherein the second segment lateral line extends completely in the lateral direction and extends through the second segment inboard point; wherein the first segment angle is greater than the second segment angle; a third segment that extends forward in the circumferential direction and outboard in the lateral direction, wherein the third segment has a third segment inboard point and a third segment outboard point and a third segment line that extends from the third segment inboard point to the third segment outboard point, wherein a third segment angle is less than 90 degrees and is measured between a third segment lateral line and the third segment line, wherein the third segment lateral line extends completely in the lateral direction and extends through the third segment inboard point, wherein the third segment inboard point is the farthest inboard position of the third segment in the lateral direction, and wherein the third segment outboard point is the farthest outboard position of the third segment in the lateral direction; a fourth segment that extends forward in the circumferential direction and outboard in the lateral direction, wherein the fourth segment has a fourth segment inboard point coincident with the third segment outboard point, wherein the fourth segment has a fourth segment outboard point that is a farthest outboard position of the fourth segment in the lateral direction, wherein the fourth segment has a fourth segment line that extends from the fourth segment inboard point to the fourth segment outboard point, wherein a fourth segment angle is less than 90 degrees and is measured between a fourth segment lateral line and the fourth segment line, wherein the fourth segment lateral line extends completely in the lateral direction and extends through the fourth segment inboard point; wherein the third segment angle is greater than the fourth segment angle; a fifth segment that extends from the second segment outboard point to the fourth segment outboard point; a first tread edge; a second tread edge with a rolling tread width defined from the first tread edge to the second edge in the lateral direction, wherein the fifth segment is located within 20% of the length of the rolling tread width from the first tread edge, wherein the sipe is free from engagement with the first tread edge; a rib that is not oriented completely in the circumferential direction so as to extend both in the circumferential direction and the lateral direction, wherein the sipe is locate in the rib.", "2 . (canceled)", "3 . The tread as set forth in claim 1 , further comprising a decoupling groove, wherein the decoupling groove engages the second segment and the fourth segment, wherein the decoupling groove is free from engagement with the first segment, the third segment, and the fifth segment, wherein the fifth segment is located outboard from the decoupling groove in the lateral direction.", "4 . The tread as set forth in claim 3 , wherein the decoupling groove extends from the second segment to the fourth segment.", "5 . The tread as set forth in claim 1 , further comprising a shoulder groove that extends in the circumferential direction, wherein the first segment inboard point is located at the shoulder groove, wherein the third segment inboard point is located at the shoulder groove.", "6 . The tread as set forth in claim 1 , wherein the tread has a lateral midpoint that is located equal distance to the first tread edge and the second tread edge in the lateral direction, wherein the first segment inboard point is located at the lateral midpoint, and wherein the third segment inboard point is located at the lateral midpoint.", "7 . The tread as set forth in claim 1 , wherein the first segment angle is the same magnitude as the third segment angle, and wherein the second segment angle is the same as the fourth segment angle.", "8 . The tread as set forth in claim 1 , wherein the first segment is straight and extends completely along the first segment line, wherein the second segment is straight and extends completely along the second segment line, wherein the third segment is straight and extends completely along the third segment line, wherein the fourth segment is straight and extends completely along the fourth segment line, and wherein the fifth segment is straight.", "9 . The tread as set forth in claim 1 , wherein the first segment, the second segment, the third segment, the fourth segment, and the fifth segment are wavy.", "10 . The tread as set forth in claim 1 , wherein the sipe has a teardrop that extends along the first segment, the second segment, the third segment, the fourth segment, and the fifth segment, wherein the teardrop has a circular cross-sectional shape and is located at the bottom of the sipe.", "11 . The tread as set forth in claim 1 , further comprising a sacrificial rib that is located outboard from the first tread edge in the lateral direction, and wherein a sacrificial rib groove is located between the first tread edge and the sacrificial rib in the lateral direction.", "12 . The tread as set forth in claim 1 , further comprising a shoulder rib that has a plurality of block grooves that cause the shoulder rib to be arranged as a plurality of shoulder rib blocks, wherein the fifth segment is located within one of the shoulder rib blocks, and wherein the sipe is spaced from and not in engagement with any of the block grooves.", "13 . The tread as set forth in claim 1 , wherein the heavy truck tire tread is directional and has a rolling direction that extends in the circumferential direction, wherein the sipe is arranged relative to the rolling direction such that the first segment and the second segment are located forward of the third segment and the fourth segment in the rolling direction."], "bibtex": "@patent{20240208271,\n    title = {TREAD HAVING TURN AROUND SIPE},\n    number = {20240208271},\n    year = {2024},\n    note = {File: US20240208271A1-20240627.XML}\n    }", "classification": "B60C1112FI"}]