[{"title": "Composite Rim", "doc_number": "20240262127", "filename": "US20240262127A1-20240808.XML", "abstract": "A composite rim is provided, including: an annular body extending around a center, an imaginary annular line being defined on an outer surface of the annular body, the imaginary annular line extending around the center; and at least one composite fiber strip, spirally disposed around the imaginary annular line for at least 360 degrees and attached to the outer surface of the annular body, opposing ends of each of the at least one composite fiber strip in a longitudinal direction of the at least one composite fiber strip being aligned with the imaginary annular line.", "detailed_description": ["Please refer toFIGS.1to4for a preferable embodiment of the present invention. A composite rim1of the present invention includes an annular body10and at least one composite fiber strip20.", "", "The annular body10extends around a center C, an imaginary annular line R is defined on an outer surface of the annular body10, and the imaginary annular line R extends around the center C. The at least one composite fiber strip20is spirally disposed around the imaginary annular line R for at least 360 degrees and attached to the outer surface of the annular body10, and opposing ends21of each of the at least one composite fiber strip20in a longitudinal direction of the at least one composite fiber strip20are aligned with the imaginary annular line R. The at least one composite fiber strip20can be, for example, made of carbon fiber or other fiber strips pre-impregnated with resin. As such, it is equivalent to that only a single break point formed by each of the at least one composite fiber strip20which spirals for at least one circle, which provides excellent structural strength and better flatness.", "", "In this embodiment, the at least one composite fiber strip includes a plurality of composite fiber strips20, and at least two of the plurality of composite fiber strips20spiral in different angles. Preferably, the at least two of the plurality of composite fiber strips20spiral in opposing directions (clockwise and counterclockwise, for example), the at least two of the plurality of composite fiber strips20are at least partially overlap with each other; however, the plurality of composite fiber strips20may be interlaced with each other (FIG.5), which can comprehensively, omnidirectionally and evenly enhance and strengthen the structural strength, and evenly distribute the stress.", "", "Specifically, the opposing ends21of each of the at least one composite fiber strip20are not overlap with each other on the imaginary annular line R; one of the opposing ends21of one of the plurality of composite fiber strips20is located between the opposing ends21of another one of the plurality of composite fiber strips20; however, the opposing ends21of each of the at least one composite fiber strip20may be at least partially or entirely overlap with each other on the imaginary annular line R. The aforementioned arrangements of the at least one composite fiber strip20contributes to the flatness of the surface of the composite rim1. Preferably, the at least two of the plurality of composite fiber strips20are perpendicular to each other, which increases the structural strength and effectively and evenly distribute the stress. Preferably, relative to the center C the at least one composite fiber strip20is arranged along the imaginary annular line R for at least 350 degrees. As such, the entire range of the outer surface of the annular body10is almost or completely wrapped continuously and uninterruptedly, so that the structure has good integrity and structural strength, the manufacturing process is simple and the yield is high.", "", "In this embodiment, the annular body10includes a tire installation groove11, the annular body10further includes two annular lips12, the two annular lips12project toward each other from two peripheries of the tire installation groove11, the imaginary annular line R extends within the tire installation groove11, and the at least one composite fiber strip20is conformably adhered to a surface of the tire installation groove11. As such, the thinner side wall of the tire installation groove11can be highly strengthened and is not easy to be damaged and deformed. It is noted that the tire installation groove may be provided without the two annular lips and can be adapted to a tubular tire; the imaginary annular line may extend annularly on other sides of the annular body10but not within the tire installation groove11.", "", "Although particular embodiments of the invention have been described in detail for purposes of illustration, various modifications and enhancements may be made without departing from the spirit and scope of the invention. Accordingly, the invention is not to be limited except as by the appended claims."], "claims": ["an annular body extending around a center, an imaginary annular line being defined on an outer surface of the annular body, the imaginary annular line extending around the center; and at least one composite fiber strip, spirally disposed around the imaginary annular line for at least 360 degrees and attached to the outer surface of the annular body, opposing ends of each of the at least one composite fiber strip in a longitudinal direction of the at least one composite fiber strip being aligned with the imaginary annular line.", "2 . The composite rim of claim 1 , wherein the at least one composite fiber strip includes a plurality of composite fiber strips, and at least two of the plurality of composite fiber strips spiral in different angles.", "3 . The composite rim of claim 2 , wherein the at least two of the plurality of composite fiber strips spiral in opposing directions.", "4 . The composite rim of claim 3 , wherein the at least two of the plurality of composite fiber strips are at least partially overlap with each other.", "5 . The composite rim of claim 1 , wherein the at least one composite fiber strip includes a plurality of composite fiber strips, and one of the opposing ends of one of the plurality of composite fiber strips is located between the opposing ends of another one of the plurality of composite fiber strips.", "6 . The composite rim of claim 1 , wherein the opposing ends of each of the at least one composite fiber strip are not overlap with each other on the imaginary annular line.", "7 . The composite rim of claim 4 , wherein the at least two of the plurality of composite fiber strips are perpendicular to each other; relative to the center the at least one composite fiber strip is arranged along the imaginary annular line for at least 350 degrees; one of the opposing ends of one of the plurality of composite fiber strips is located between the opposing ends of another one of the plurality of composite fiber strips; the opposing ends of each of the at least one composite fiber strip are not overlap with each other on the imaginary annular line.", "8 . The composite rim of claim 1 , wherein the annular body includes a tire installation groove, and the imaginary annular line extends within the tire installation groove.", "9 . The composite rim of claim 8 , wherein the at least one composite fiber strip is conformably adhered to a surface of the tire installation groove.", "10 . The composite rim of claim 8 , wherein the annular body further includes two annular lips, and the two annular lips project toward each other from two peripheries of the tire installation groove."], "bibtex": "@patent{20240262127,\n    title = {Composite Rim},\n    number = {20240262127},\n    year = {2024},\n    note = {File: US20240262127A1-20240808.XML}\n    }", "classification": "B60B502FI"}, {"title": "FREEWHEEL ADAPTER AND FREEWHEEL ASSEMBLY INCLUDING THE SAME", "doc_number": "20240262128", "filename": "US20240262128A1-20240808.XML", "abstract": "A freewheel adapter and a freewheel assembly including the same are provided. The freewheel adapter is configured to be disposed on a driver body of a bicycle, and the driver body is configured to be connected with a bicycle hub and includes a first threaded portion. The freewheel adapter includes a barrel and an annular flange. The barrel includes a first end portion and a second end portion, and an inner peripheral surface of the first end portion has a second threaded portion disposed thereon. The second threaded portion is configured to be screwed with the first threaded portion. The annular flange is disposed on the second end portion and radially protrudes outward beyond an outer peripheral surface of the barrel. The freewheel adapter allows the driver body to be assembled with different types of freewheels.", "detailed_description": ["Please refer toFIGS.1to4for a first preferable embodiment of the present invention. A freewheel adapter1of the present invention is configured to be disposed on a driver body2of a bicycle, and the driver body2is configured to be connected with a bicycle hub and includes a first threaded portion210. The freewheel adapter1includes a barrel10and an annular flange20.", "", "The barrel10includes a first end portion11and a second end portion12axially opposite to each other, and an inner peripheral surface of the first end portion11has a second threaded portion111disposed thereon. The second threaded portion111is screwed with the first threaded portion210. The annular flange20is disposed on the second end portion12and radially protrudes outward beyond an outer peripheral surface of the barrel10. Therefore, the driver body2can be assembled with a thread-on freewheel by the existing first threaded portion210and be assembled with a cassette by the freewheel adapter1without replacement of the driver body2. For the sake of illustration, the thread-on freewheel refers to a sprocket assembly which is assembled with a driver body by threads, the cassette refers to a sprocket assembly which is assembled with a driver body by splines, and “freewheel” may refer to the thread-on freewheel or/and the cassette.", "", "In this embodiment, the annular flange20is integrally formed as a part of the second end portion12, which is easy to manufacture and provides good structural strength. The barrel10has a circular cross-sectional profile and the outer peripheral surface of the barrel10has a single diametrical dimension in an axial direction of the barrel10. In assembling, the cassette is sleeved to the driver body2, and then the freewheel adapter1is sleeved between the cassette and the driver body2and screwed to the first threaded portion210, which provides easy and quick assembling. The freewheel adapter1is made of aluminum alloy so as to have light weight and good structural strength. A wall thickness of the barrel10is between 0.5 mm and 2.0 mm, which provides sufficient structural strength and allows the barrel10to be rotated between the cassette and the driver body2. In other embodiments, the freewheel adapter may be made of copper, iron, or any other metals and plastics.", "", "Preferably, a width of the annular flange20radially protruding beyond the outer peripheral surface of the barrel10is larger than or equal to 0.15 mm so as to be stably blocked with the cassette in the axial direction. An inner side of the annular flange20has an engaging portion21configured to be non-rotatably connected with a removal tool for easy assembling and disassembling.", "", "Please refer to a second preferable embodiment of the present invention shown inFIG.5. The second end portion12aincludes a third threaded portion121, and the annular flange20includes a fourth threaded portion22screwed with the third threaded portion121for detachable connection. Specifically, the annular flange20further includes a sleeving portion23extending along an axial direction of the annular flange20. The third threaded portion121is an inner threaded segment disposed on an inner peripheral surface of the second end portion12, and the fourth threaded portion22is an outer threaded segment disposed on an outer peripheral surface of the sleeving portion23, which has a simple structure and stable assembling and is easy to assemble. In assembling, the barrel10ais sleeved to the driver body2and the second threaded portion111is screwed to the first threaded portion210, the cassette is sleeved to the barrel10a, then the fourth threaded portion22of the annular flange20ais screwed with the third threaded portion121. In other way, the barrel10amay be assembled with the annular flange20afirst and then be sleeved between a freewheel3and the driver body2, which is the same as the first preferable embodiment.", "", "Please refer to a third preferable embodiment of the present invention shown inFIG.6. The third preferable embodiment differs from the second preferable embodiment in that: an outer peripheral surface of the second end portion12bpreferably has a first spline portion122radially protruding therefrom. The first spline portion122is configured to be engaged correspondingly with a freewheel3of the bicycle (by a spline structure310of the existing freewheel) so as to disperse force and provides stable support.", "", "The present invention further provides a freewheel assembly includes the freewheel adapter1as described above, further including: the driver body2and the freewheel3. The driver body2further includes a second spline portion220, and the freewheel3is sleeved to the driver body2and includes a plurality of sprockets320comovable with one another and a third spline portion330correspondingly engaged with the second spline portion220. The annular flange20is axially abuttable against an end surface of the freewheel3remote from the third spline portion330. In this embodiment, the freewheel3is a cassette.", "", "Furthermore, the freewheel3includes a first inner peripheral surface340and a second inner peripheral surface350coaxial with the first inner peripheral surface340, and the third spline portion330is protrudingly disposed on the first inner peripheral surface340. A difference between an inner diametrical dimension of the second inner peripheral surface350and an outer diametrical dimension of the barrel10is between 0.1 mm and 0.3 mm, which is convenient to insert the barrel10between the freewheel3and the driver body2. The second inner peripheral surface350is adjacent to the annular flange20and is radially abutted against the outer peripheral surface of the barrel10so as to provide radial support and good structural strength.", "", "Although particular embodiments of the invention have been described in detail for purposes of illustration, various modifications and enhancements may be made without departing from the spirit and scope of the invention. Accordingly, the invention is not to be limited except as by the appended claims."], "claims": ["a barrel, including a first end portion and a second end portion axially opposite to each other, an inner peripheral surface of the first end portion having a second threaded portion disposed thereon, the second threaded portion being configured to be screwed with the first threaded portion; and an annular flange, disposed on the second end portion, radially protruding outward beyond an outer peripheral surface of the barrel.", "2 . The freewheel adapter of claim 1 , wherein the annular flange is integrally formed as a part of the second end portion.", "3 . The freewheel adapter of claim 1 , wherein the barrel has a circular cross-sectional profile and the outer peripheral surface of the barrel has a single diametrical dimension in an axial direction of the barrel.", "4 . The freewheel adapter of claim 1 , wherein a wall thickness of the barrel is between 0.5 mm and 2.0 mm.", "5 . The freewheel adapter of claim 1 , wherein a width of the annular flange radially protruding beyond the outer peripheral surface of the barrel is larger than or equal to 0.15 mm.", "6 . The freewheel adapter of claim 1 , wherein an inner side of the annular flange has an engaging portion configured to be non-rotatably connected with a removal tool.", "7 . The freewheel adapter of claim 1 , wherein the second end portion includes a third threaded portion, and the annular flange includes a fourth threaded portion screwed with the third threaded portion.", "8 . The freewheel adapter of claim 7 , wherein an outer peripheral surface of the second end portion has a first spline portion radially protruding therefrom, and the first spline portion is configured to be engaged correspondingly with a freewheel of the bicycle.", "9 . The freewheel adapter of claim 7 , wherein the annular flange further includes a sleeving portion extending along an axial direction of the annular flange, the third threaded portion is an inner threaded segment disposed on an inner peripheral surface of the second end portion, and the fourth threaded portion is an outer threaded segment disposed on an outer peripheral surface of the sleeving portion.", "a driver body, configured to be connected with a bicycle hub and including a first threaded portion and a second spline portion, the second threaded portion screwed with the first threaded portion; and a freewheel, sleeved to the driver body, including a plurality of sprockets comovable with one another and a third spline portion correspondingly engaged with the second spline portion, the annular flange being axially abuttable against an end surface of the freewheel remote from the third spline portion.", "11 . The freewheel adapter of claim 10 , wherein the freewheel includes a first inner peripheral surface and a second inner peripheral surface coaxial with the first inner peripheral surface, the third spline portion is protrudingly disposed on the first inner peripheral surface, and a difference between an inner diametrical dimension of the second inner peripheral surface and an outer diametrical dimension of the barrel is between 0.1 mm and 0.3 mm.", "12 . The freewheel adapter of claim 11 , wherein the second inner peripheral surface is adjacent to the annular flange and is radially abutted against the outer peripheral surface of the barrel."], "bibtex": "@patent{20240262128,\n    title = {FREEWHEEL ADAPTER AND FREEWHEEL ASSEMBLY INCLUDING THE SAME},\n    number = {20240262128},\n    year = {2024},\n    note = {File: US20240262128A1-20240808.XML}\n    }", "classification": "B60B2704FI"}, {"title": "RUBBER COMPOSITION FOR TIRE", "doc_number": "20240262129", "filename": "US20240262129A1-20240808.XML", "abstract": "A rubber composition contains 10-50 parts by mass of a thermoplastic resin in 100 parts by mass of a diene rubber containing 60 mass % or more of a styrene-butadiene rubber having a styrene content of 5-30 mass % and a vinyl content of 10-35 mass %. In a mixture containing the diene rubber and the thermoplastic resin in a mass ratio of 1:1, a difference (Tga−Tgm) between a theoretical value (Tga) of a glass transition temperature of the mixture calculated based on an average glass transition temperature (Tg1) of the diene rubber and a glass transition temperature (Tg2) of the thermoplastic resin, and a measurement value (Tgm) of a glass transition temperature of the mixture, is 5-50° C., and a difference (Tg2−Tg1) is 110-150° C. An amount of the thermoplastic resin is 30 mass % or more in 100 mass % total of a plasticizer component contained in the rubber composition.", "detailed_description": ["The rubber composition for a tire contains a diene rubber containing 60 mass % or more of a styrene-butadiene rubber. The styrene-butadiene rubber has a styrene content of from 5 to 30 mass % and a vinyl content of from 10 to 35 mass %, and has a specific relationship with the thermoplastic resin.", "", "The styrene content in the styrene-butadiene rubber is from 5 to 30 mass %. When the styrene content is 5 mass % or more, good wet performance is achieved. When the styrene content is 30 mass % or less, deterioration in wear resistance can be suppressed. The styrene content is preferably from 10 to 25 mass %, and more preferably from 10 to 20 mass %. In the present specification, the styrene content of the styrene-butadiene rubber is determined by infrared spectroscopy (the Hampton method).", "", "The vinyl content in the styrene-butadiene rubber is from 10 to 35 mass %. When the vinyl content is 10 mass % or more, good rolling resistance is achieved. When the vinyl content is 35 mass % or less, deterioration in wear resistance can be suppressed. The vinyl content is preferably from 20 to 35 mass %, and more preferably from 25 to 35 mass %. In the present specification, the vinyl content of the styrene-butadiene rubber is determined by infrared spectroscopy (the Hampton method).", "", "The styrene-butadiene rubber is preferably a modified styrene-butadiene rubber having a modification group at at least one terminal of a molecular chain of the styrene-butadiene rubber. Examples of the modification group include a carboxy group, an amino group, a hydroxy group, an alkoxy group, a silyl group, an alkoxysilyl group, an oxysilyl group, a silanol group, an epoxy group, an amide group, an isocyanate group, an isothiocyanate group, a carbonyl group, and an aldehyde group.", "", "The diene rubber is only required to be a diene rubber that is typically used in a tire. Examples of the diene rubber other than the styrene-butadiene rubber include natural rubber, isoprene rubber, butadiene rubber, styrene isoprene rubber, isoprene butadiene rubber, ethylene-propylene-diene copolymer rubber, chloroprene rubber, and acrylonitrile butadiene rubber. These diene rubbers may be modified with one or more functional groups. The type of the functional group is not particularly limited, and examples thereof include an epoxy group, carboxy group, amino group, hydroxy group, alkoxy group, silyl group, alkoxysilyl group, amide group, oxysilyl group, silanol group, isocyanate group, isothiocyanate group, carbonyl group, and aldehyde group.", "", "The diene rubber containing the styrene-butadiene rubber preferably has the average glass transition temperature (Tg1) of −45° C. or lower. The average glass transition temperature (Tg1) of the diene rubber of −45° C. or lower is preferred because good wear resistance is achieved. The average glass transition temperature (Tg1) is more preferably from −80° C. to −50° C., and even more preferably from −75° C. to −60° C. In the present specification, for the glass transition temperature of each of the diene rubber, the thermoplastic resin, and the mixture thereof, a thermogram is obtained by differential scanning calorimetry (DSC) at a rate of temperature increase of 20° C./minute and the temperature at the midpoint of the transition region is defined as the glass transition temperature. When the diene rubber is an oil extended product, the glass transition temperature is the glass transition temperature of the diene rubber containing no oil-extending component (the oil).", "", "The rubber composition for a tire contains 60 mass % or more of the styrene-butadiene rubber described above in 100 mass % of the diene rubber. When 60 mass % or more of the styrene-butadiene rubber is contained, wear resistance can be ensured. The amount of the styrene-butadiene rubber is preferably from 60 to 100 mass %, more preferably from 65 to 85 mass %, and even more preferably from 70 to 80 mass %.", "", "For the rubber composition for a tire, it is necessary to combine the diene rubber and the thermoplastic resin in a manner that the diene rubber and the thermoplastic resin simultaneously satisfy the following relationships (i) and (ii). That is,", "", "(i) for a mixture in which the diene rubber and the thermoplastic resin are blended in a mass ratio of 1:1 (hereinafter, simply abbreviated as “mixture”), a difference (Tga−Tgm) between a theoretical value (Tga) of a glass transition temperature of the mixture calculated based on an average glass transition temperature (Tg1) of the diene rubber and a glass transition temperature (Tg2) of the thermoplastic resin, and a measurement value (Tgm) of a glass transition temperature of the mixture, is from 5 to 50° C., and", "", "(ii) a difference (Tg2−Tg1) between the glass transition temperature (Tg2) of the thermoplastic resin and the average glass transition temperature (Tg1) of the diene rubber is from 110 to 150° C.", "", "In the present specification, the average glass transition temperature (Tg1) of the diene rubber, the glass transition temperature (Tg2) of the thermoplastic resin, and the glass transition temperature (Tgm) of the mixture are measured by the method described above. Furthermore, the theoretical value (Tga) of the glass transition temperature of the mixture can be calculated as a weighted average value based on the glass transition temperatures and the mass ratio of the diene rubber and the thermoplastic resin.", "", "As in (i) above, when the difference (Tga−Tgm) between the theoretical value (Tga) of the glass transition temperature of the mixture and the measurement value (Tgm) of the glass transition temperature of the mixture is set to 5° C. or higher, deterioration in wear resistance can be suppressed. Furthermore, when the difference (Tga−Tgm) is set to 50° C. or lower, deterioration in wet performance can be suppressed. The difference (Tga−Tgm) is preferably 40° C. or lower, more preferably 20° C. or lower, and even more preferably 11° C or lower. Furthermore, the difference (Tga−Tgm) is preferably 6° C. or higher, more preferably 7° C. or higher, and even more preferably 8° C. or higher.", "", "As in (ii) above, when the difference (Tg2−Tg1) between the glass transition temperature (Tg2) of the thermoplastic resin and the average glass transition temperature (Tg1) of the diene rubber is set to 110° C. or higher, good wet performance is achieved. Furthermore, when the difference (Tg2−Tg1) is set to 150° C. or lower, deterioration in wear resistance performance can be suppressed. The difference (Tg2−Tg1) is preferably from 115 to 140° C., and more preferably from 120 to 135° C.", "", "When the rubber composition for a tire contains from 10 to 50 parts by mass of the thermoplastic resin per 100 parts by mass of the diene rubber, wet grip properties and wear resistance can be provided in a compatible manner. When the amount of the thermoplastic resin is less than 10 parts by mass, the effect of improving wet grip properties cannot be adequately achieved. When the amount of the thermoplastic resin is more than 50 parts by mass, the effect of improving wear resistance cannot be adequately achieved. The blended amount of the thermoplastic resin is preferably from 15 to 45 parts by mass, and more preferably from 20 to 40 parts by mass.", "", "The amount of the thermoplastic resin is preferably 30 mass % or more in 100 mass % total of the plasticizer component contained in the rubber composition. Setting the amount of the thermoplastic resin to 30 mass % or more is preferred because the effect of improving wear resistance becomes significant. The amount of the thermoplastic resin is more preferably from 35 to 100 mass %, and even more preferably from 40 to 100 mass %, in 100 mass % total of the plasticizer component. Note that examples of the plasticizer component contained in the rubber composition include a thermoplastic resin, a natural oil, a synthetic oil, an oil-extending component (oil) contained in diene rubber, and a liquid rubber.", "", "Furthermore, the ratio of the mass of the thermoplastic resin to the mass of the styrene-butadiene rubber described above is preferably from 0.1 to 0.6. The mass ratio of 0.1 or more is preferred because the distribution of the thermoplastic resin in the rubber composition becomes uniform. Furthermore, the mass ratio of 0.6 or less is preferred because the thermoplastic resin is dispersed in the rubber component, which serves as a matrix, in the rubber composition. The ratio of the mass of the thermoplastic resin to the mass of the styrene-butadiene rubber is more preferably from 0.2 to 0.6, and even more preferably from 0.3 to 0.5.", "", "The glass transition temperature (Tg2) of the thermoplastic resin is preferably from 30 to 80° C., more preferably from 35 to 75° C., and even more preferably from 40 to 75° C. Setting the glass transition temperature (Tg2) to 30° C. or higher is preferred because excessive adhesion of the rubber composition can be suppressed. Furthermore, setting the glass transition temperature (Tg2) to 80° C. or lower is preferred because dissolution in the rubber becomes uniform.", "", "The softening point of the thermoplastic resin is preferably from 80 to 125° C., more preferably from 90 to 125° C., and even more preferably from 95 to 125° C. Setting the softening point to 80° C. or higher is preferred because excessive adhesion of the rubber composition can be suppressed. Furthermore, setting the softening point to 125° C. or lower is preferred because dissolution in the rubber becomes uniform. In the present specification, the softening point of a thermoplastic resin is measured in accordance with JIS (Japanese Industrial Standard) K6220-1 (ring and ball method).", "", "The thermoplastic resin is not particularly limited as long as the thermoplastic resin and the diene rubber simultaneously satisfy the relationships (i) and (ii) described above. Examples of the thermoplastic resin include a terpene resin, a terpene phenol resin, a rosin resin, a rosin ester resin, a C5/C9 resin, and a coumarone-indene resin. Among these, a C5/C9 resin and a terpene resin are preferred.", "", "The rubber composition for a tire preferably contains from 10 to 150 parts by mass of silica per 100 parts by mass of the diene rubber, and preferably contains an alkylalkoxy silane containing an alkyl group having from 3 to 8 carbons in an amount of 1 to 20 mass % of the silica amount. Blending of 1 mass % or more of alkylalkoxysilane with respect to the silica amount can improve dispersibility of the silica. Furthermore, blending of 20 mass % or less is preferred because deterioration in a reinforcing property of the silica can be suppressed. The alkylalkoxysilane is blended in an amount of more preferably from 3 to 15 mass %, and even more preferably from 4 to 12 mass %, of the silica amount.", "", "The alkyl group having from 3 to 8 carbons may be in a straight-chain, branched, or cyclic form, or a combination of these, but is preferably in a straight-chain form. Examples of the alkyl group include a propyl group, a butyl group, a pentyl group, a hexyl group, a heptyl group, and an octyl group, and an octyl group is more preferred.", "", "The alkylalkoxysilane is preferably an alkyltrialkoxysilane having three alkoxy groups. Examples of the alkoxy group include a methoxy group, an ethoxy group, a propoxy group, and a butoxy group, and an ethoxy group is preferred.", "", "The rubber composition for a tire contains from 10 to 150 parts by mass of the silica in 100 parts by mass of the diene rubber. Blending of 10 parts by mass or more of the silica can improve wet grip properties and wear resistance. Furthermore, blending of 150 parts by mass or less of the silica can suppress deterioration in rolling resistance. The blended amount of the silica is preferably from 50 to 135 parts by mass, and more preferably from 60 to 125 parts by mass. Examples of the silica include wet silica (hydrous silicic acid), dry silica (silicic anhydride), calcium silicate, and aluminum silicate. One type of these can be used alone, or a combination of two or more types of these can be used. Furthermore, surface-treated silica, in which the surface of silica is surface-treated by a silane coupling agent, may be also used.", "", "In the rubber composition for a tire, a silane coupling agent is preferably blended together with the silica, and good dispersibility of the silica can be achieved. As the silane coupling agent, a type of silane coupling agent that is typically blended together with silica can be used. The silane coupling agent is blended in an amount of preferably from 5 to 15 mass %, and more preferably from 8 to 12 mass %, of the silica amount.", "", "The rubber composition for a tire can contain another inorganic filler besides the silica. Examples of such other inorganic fillers include carbon black, calcium carbonate, magnesium carbonate, talc, clay, mica, alumina, aluminum hydroxide, titanium oxide, and calcium sulfate. One type of these other fillers can be used alone, or a combination of two or more types of these can be used.", "", "The rubber composition for a tire may also contain various additives that are commonly used in a rubber composition for a tire within a range that does not impair the present technology. Examples thereof include vulcanization or crosslinking agents, vulcanization accelerators, anti-aging agents, plasticizers, processing aids, liquid polymers, and thermosetting resins. These additives may be kneaded by any commonly known method to form a rubber composition for a tire, and can be used for vulcanization or crosslinking. Blended amounts of these additives may be any known amount, so long as the present technology is not hindered.", "", "The rubber composition for a tire described above is preferably a rubber composition for a tire tread and can suitably constitute a tread portion of a tire. A tire having a tread portion made of the rubber composition for a tire of an embodiment of the present technology can provide wet grip properties and wear resistance in a compatible manner. Note that the tire may be a pneumatic tire or a non-pneumatic tire.", "", "Embodiments according to the present technology are further described below by Examples. However, the scope of the present technology is not limited to these Examples."], "claims": ["1 - 7 . (canceled)", "the styrene-butadiene rubber having a styrene content of from 5 to 30 mass % and a vinyl content of from 10 to 35 mass %, a mixture containing the diene rubber and the thermoplastic resin in a mass ratio of 1:1 satisfying a relationship where a difference (Tga−Tgm) between a theoretical value (Tga) of a glass transition temperature of the mixture calculated based on an average glass transition temperature (Tg1) of the diene rubber and a glass transition temperature (Tg2) of the thermoplastic resin, and a measurement value (Tgm) of a glass transition temperature of the mixture, is from 5 to 50° C., and a difference (Tg2−Tg1) between the glass transition temperature (Tg2) of the thermoplastic resin and the average glass transition temperature (Tg1) of the diene rubber is from 110 to 150° C., and an amount of the thermoplastic resin being 30 mass % or more in 100 mass % total of a plasticizer component contained in the rubber composition.", "9 . The rubber composition for a tire according to claim 8 , wherein the average glass transition temperature (Tg1) of the diene rubber is −45° C. or lower.", "10 . The rubber composition for a tire according to claim 8 , wherein a ratio of a mass of the thermoplastic resin to a mass of the styrene-butadiene rubber is from 0.1 to 0.6.", "11 . The rubber composition for a tire according to claim 8 , wherein the glass transition temperature (Tg2) of the thermoplastic resin is from 30 to 80° C.", "12 . The rubber composition for a tire according to claim 8 , wherein the styrene-butadiene rubber contains a modification group at at least one terminal of a molecular chain of the styrene-butadiene rubber.", "13 . The rubber composition for a tire according to claim 8 , further comprising from 10 to 150 parts by mass of silica per 100 parts by mass of the diene rubber.", "14 . The rubber composition for a tire according to claim 13 , further comprising an alkylalkoxysilane containing an alkyl group having from 3 to 8 carbons in an amount of 1 to 20 mass % of the silica amount.", "15 . The rubber composition for a tire according to claim 9 , wherein a ratio of a mass of the thermoplastic resin to a mass of the styrene-butadiene rubber is from 0.1 to 0.6.", "16 . The rubber composition for a tire according to claim 15 , wherein the glass transition temperature (Tg2) of the thermoplastic resin is from 30 to 80° C.", "17 . The rubber composition for a tire according to claim 16 , wherein the styrene-butadiene rubber contains a modification group at at least one terminal of a molecular chain of the styrene-butadiene rubber.", "18 . The rubber composition for a tire according to claim 17 , further comprising from 10 to 150 parts by mass of silica per 100 parts by mass of the diene rubber.", "19 . The rubber composition for a tire according to claim 18 . further comprising an alkylalkoxysilane containing an alkyl group having from 3 to 8 carbons in an amount of 1 to 20 mass % of the silica amount."], "bibtex": "@patent{20240262129,\n    title = {RUBBER COMPOSITION FOR TIRE},\n    number = {20240262129},\n    year = {2024},\n    note = {File: US20240262129A1-20240808.XML}\n    }", "classification": "B60C100FI"}, {"title": "TIRE", "doc_number": "20240262130", "filename": "US20240262130A1-20240808.XML", "abstract": "A tire having a cross-sectional height ranging 50-150 mm, in an unloaded state where the tire is mounted on a specified rim and inflated to a specified internal pressure, an opening distance (A) between the tire and a rim flange on a perpendicular line drawn from an outermost point of the rim flange in the radial direction to an outer surface of the tire with respect to the cross-sectional height (SH) satisfies 0.015≤A/SH≤0.16, and a point (P) at which a horizontal line in a tire width direction passing through the outermost point of the rim flange in the radial direction intersects with the outer surface of the tire, a point (Q) specifying a rim width and a rim diameter of the specified rim, and an angle (α) formed by a straight line connecting the points (P) and (Q) and a horizontal line in the tire width direction satisfies 50°≤α≤80°.", "detailed_description": ["Configurations of embodiments of the present technology will be described in detail below with reference to the accompanying drawings.FIGS.1to12illustrate a pneumatic tire according to an embodiment of the present technology. InFIG.1, one side of the pneumatic tire delimited by a tire equator CL is illustrated, but the pneumatic tire has a symmetrical structure or an asymmetrical structure on both sides of the tire equator CL.", "", "As illustrated inFIG.1, a pneumatic tire10of the present embodiment includes a tread portion1extending in a tire circumferential direction and formed in an annular shape, a pair of sidewall portions2,2disposed on both sides of the tread portion1, and a pair of bead portions3,3disposed on an inner side of the sidewall portions2in a tire radial direction.", "", "A carcass layer4is mounted between the pair of bead portions3,3. The carcass layer4includes a plurality of reinforcing cords extending in the tire radial direction and is folded back around a bead core5disposed in each of the bead portions3from a tire inner side to a tire outer side. A bead filler6having a triangular cross-sectional shape and formed of a rubber composition is disposed on the outer circumference of the bead core5. The carcass layer4includes a body portion4A delimited by the bead core5and a turned-up portion4B.", "", "On the other hand, a plurality of belt layers7are embedded on the outer circumferential side of the carcass layer4in the tread portion1. The belt layers7include a plurality of reinforcing cords that are inclined with respect to the tire circumferential direction, and the reinforcing cords are disposed so as to intersect each other between the layers. In the belt layers7, the inclination angle of the reinforcing cords with respect to the tire circumferential direction is set to fall in a range from 10° to 40° for example. Steel cords are preferably used as the reinforcing cords of the belt layers7. To improve high-speed durability, at least one belt cover layer8formed by arranging reinforcing cords at an angle of, for example, 5° or less with respect to the tire circumferential direction is disposed on an outer circumferential side of the belt layers7. Organic fiber cords such as nylon and aramid are preferably used as the reinforcing cords of the belt cover layer8.", "", "Note that the tire internal structure described above represents a typical example for the pneumatic tire10, but the pneumatic tire is not limited thereto. InFIG.1, a tread rubber layer11is disposed in the tread portion1, a sidewall rubber layer12is disposed in the sidewall portion2, and a rim cushion rubber layer13is disposed in the bead portion3. An innerliner rubber layer14is disposed on the inner surface of the tire10along the carcass layer4. Additionally, a rim protector15for protecting a rim flange22is formed on the sidewall portion2so as to protrude toward an outer side in a tire width direction.", "", "The tire10described above has a cross-sectional height SH ranging from 50 mm to 150 mm and is mainly a tire for a passenger vehicle. The following configuration is applied to such a tire10. In other words, as illustrated inFIGS.1and2, in an unloaded state where the tire10is mounted on a specified rim21and inflated to the specified internal pressure, an opening distance between the tire10and the rim flange22on a perpendicular line drawn from an outermost point Tr of the rim flange22in the radial direction to the outer surface of the tire10is defined as A (mm), and the opening distance A with respect to the cross-sectional height SH (mm) satisfies the relationship 0.01≤A/SH≤0.16, and a point at which a horizontal line in the tire width direction passing through the outermost point Tr of the rim flange22in the radial direction intersects with the outer surface of the tire10is defined as P, a point specifying a rim width DW and a rim diameter DO of the specified rim21is defined as Q, and an angle α formed by a straight line connecting the points P and Q and a horizontal line in the tire width direction is in the range 50°≤α≤80°. When the rim flange22has a portion extending parallel to the tire width direction at the outermost position in the radial direction, the outermost point Tr of the rim flange22in the radial direction is a point that is on the innermost side of the rim flange22in the radial direction in the outermost position of the rim flange22in the radial direction.", "", "In tire10described above, the opening distance A between the tire10and the rim flange22in the unloaded state with respect to the cross-sectional height SH satisfies the relationship 0.01≤A/SH≤0.16, and the angle α corresponding to the inclination angle of the bead portion3is in the range 50° ≤α≤80°. This can properly set the opening distance A with respect to the amount of deflection and deformation of the tire10and effectively reduce a failure due to deflection of the tire10and a failure due to rubbing between the tire10and the flange22. This can reduce a failure at or near the bead portion3and improve the durability of the tire10. In particular, when the aspect ratio of the tire10is 55% or less, excellent durability is required, and in such a case, the effect of improving the durability can be enjoyed to the maximum.", "", "Here, the ratio A/SH of less than 0.01 causes the opening distance A to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the ratio A/SH of more than 0.16 causes the opening distance A to be too large, thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur, and further pebbles or the like to be likely to enter, which may cause the durability to significantly decrease. In particular, it is preferable to satisfy the relationship 0.015≤A/SH≤0.14 and further satisfy the relationship 0.02≤A/SH≤0.12.", "", "Similarly, the angle α of less than 50° causes the opening distance A to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the angle α of more than 80° causes the opening distance A to be too large, thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur, and further pebbles or the like to be likely to enter, which may cause the durability to significantly decrease. In particular, it is preferable to satisfy the range 55°≤α≤75° and further satisfy the range 60°≤α≤70°.", "", "As illustrated inFIGS.1and3, in an unloaded state where the tire10is mounted on the specified rim21and inflated to the specified internal pressure, a point specifying a total width TW of the tire10is defined as L, and an angle θ formed by the straight line connecting the points P and Q and a straight line connecting the points L and Q is preferably in the range 2° 0 30°. This can properly set the opening distance A with respect to the amount of deflection and deformation and enhance the effect of improving the durability. The total width TW of the tire10is a total width of the tire10at a position in which the carcass layer4is most bulged toward an outer side in the tire width direction. In other words, the rim protector15for protecting the rim flange22is excluded from the total width TW.", "", "Here, the angle θ of less than 2° causes the opening distance A to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the angle θ of more than 30° causes the opening distance A to be too large and thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In either case, the effect of improving the durability decreases. In particular, it is preferable to satisfy the range 4°≤θ≤25° and further to satisfy the range 6°≤θ≤20°.", "", "In the tire10described above, as illustrated inFIG.4, in an unloaded state where the tire10is mounted on the specified rim21and inflated to the specified internal pressure, an opening start point at which the rim flange22separates from the tire10is defined as S, the outermost point of the rim flange22in the radial direction is defined as Tr, a point at which a perpendicular line drawn from the point Tr to the outer surface of the tire10intersects with the outer surface of the tire10is defined as T, and an angle β formed by a straight line connecting the points S and T and a straight line connecting the points S and Tr is preferably in the range 15°≤β≤65°. This can enhance the effect of improving the durability.", "", "Here, the angle β of less than 15° causes stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the angle β of more than 65° causes a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In particular, it is preferable to satisfy the range 20°≤β≤60° and further satisfy the range 25°≤β≤55°.", "", "In the tire10described above, as illustrated inFIG.5, a horizontal distance B (mm) in the tire width direction between the points Q and S with respect to the cross-sectional height SH (mm) preferably satisfies the relationship 0.02≤B/SH≤0.18. This allows stress due to repeated deformation to fall within an appropriate range and the effect of improving the durability to be enhanced.", "", "Here, the ratio B/SH of less than 0.02 causes a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In contrast, the ratio B/SH of more than 0.18 causes stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In either case, the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 0.03≤B/SH≤0.15 and further satisfy the relationship 0.04≤B/SH≤0.13.", "", "In the tire10described above, the horizontal distance B is preferably in the range 3.0 mm≤B≤9.0 mm. This allows stress due to repeated deformation to fall within an appropriate range and the effect of improving the durability to be enhanced.", "", "Here, the horizontal distance B of less than 3.0 mm causes a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In contrast, the horizontal distance B of more than 9.0 mm causes stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In either case, the effect of improving the durability decreases. In particular, the horizontal distance B is preferably in the range 3.2 mm≤B≤8.5 mm and is further preferably in the range 3.4 mm≤B≤8.0 mm.", "", "In the tire10described above, the opening distance A is preferably in the range 1.5 mm≤A≤8.0 mm. This can reduce stress due to repeated deformation and enhance the effect of improving the durability.", "", "Here, the opening distance A of less than 1.5 mm causes the opening distance A to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the opening distance A of more than 8.0 mm causes the opening distance A to be too large and thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In either case, the effect of improving the durability decreases. In particular, the opening distance A is preferably in the range of 1.8 mm≤A≤7.5 mm, and it is further preferably in the range 2.0 mm≤A≤7.0 mm.", "", "In the tire10described above, as illustrated inFIG.6, a point at which the perpendicular line drawn from the outermost point Tr of the rim flange22in the radial direction to the outer surface of the tire10intersects with the outer surface of the tire10is defined as T, and the arc (radius of curvature Rb) of the tire10passing through the points S. P, and T preferably has a center on an outer side in the tire width direction. This makes it difficult for compressive stress to be applied to a portion that comes into contact with the rim flange22of the tire10and thus can enhance the effect of improving the durability.", "", "In particular, as illustrated inFIG.6, the point at which a perpendicular line drawn from the point P to the outer surface of the tire10intersects with the outer surface of the rim flange22is defined as Pr, and the radius of curvature Rb (mm) of the arc of the tire10passing through the points S, P, and T with respect to a radius of curvature Rr (mm) of the arc of the rim flange22passing through the points S. Pr, and Tr preferably satisfies the relationship 1.2≤Rb/Rr≤14.5. This makes it difficult for compressive stress to be applied to a portion that comes into contact with the rim flange22of the tire10and thus can enhance the effect of improving the durability.", "", "Here, when the ratio Rb/Rr is out of the range described above, compressive stress is likely to be applied to a portion of the tire10that comes into contact with the rim flange22, and thus the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 1.5≤Rb/Rr≤12.2 and further satisfy the relationship 2.0≤Rb/Rr≤10.0.", "", "In the tire10described above, as illustrated inFIG.7, in an unloaded state where the tire10is mounted on the specified rim21and inflated to the specified internal pressure, a point at which a horizontal line in the tire width direction passing through an edge portion of the belt layer7on the innermost side in the tire radial direction of the plurality of belt layers7intersects with the outer surface of the tire10is defined as V, a point that defines the total width TW of the tire10is defined as L, and an angle γ formed by a straight line connecting the points L and V and a horizontal line in the tire width direction is preferably within the range 450≤γ≤80°. This allows stress due to repeated deformation to fall within an appropriate range and the effect of improving the durability to be enhanced.", "", "Here, when the angle γ is out of the range described above, stress due to repeated deformation is out of an appropriate range, and thus the effect of improving the durability decreases. In particular, it is preferable to satisfy the range 50°≤γ≤75° and further satisfy the range 55°≤γ≤70°.", "", "In the tire10described above, as illustrated inFIG.7, a point located at the center position between the points L and V in the tire radial direction on the outer surface of the tire10is defined as W, and a radius of curvature Rs of the arc of the tire10passing through the points V. W, and L with respect to the cross-sectional height SH preferably satisfies the relationship 0.3≤Rs/SH≤2.5. This allows stress due to repeated deformation to fall within an appropriate range and the effect of improving the durability to be enhanced.", "", "Here, when the ratio Rs/SH is out of the range described above, stress due to repeated deformation is out of an appropriate range, and thus the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 0.4≤Rs/SH≤2.3 and further satisfy the relationship 0.5≤Rs/SH≤2.0.", "", "In the tire10described above, as illustrated inFIGS.1and8, in an unloaded state where the tire10is mounted on the specified rim21and inflated to the specified internal pressure, the amount of projection that is one half of a difference between the total width TW of the tire10and the rim width DW of the specified rim21is a projection amount W (mm), and the opening distance A with respect to the projection amount W preferably satisfies the relationship 0.03≤A/W≤1.60.", "", "As described above, the opening distance A between the tire10in the unloaded state and the rim flange22with respect to the projection amount W that is one half of the difference between the total width TW of the tire10and the rim width DW of the specified rim21satisfies the relationship 0.03≤A/W≤1.60. This can properly set the opening distance A with respect to the amount of deflection and deformation of the tire10and effectively reduce a failure due to deflection of the tire10and a failure due to rubbing between the tire10and the flange22. This can reduce a failure at or near the bead portion3and further enhance the effect of improving the durability of the tire10.", "", "Here, the ratio A/W of less than 0.03 causes the opening distance A to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the ratio A/W of more than 1.60 causes the opening distance A to be too large, thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur, and further pebbles or the like to be likely to enter, which may cause the durability to significantly decrease. In particular, it is preferable to satisfy the relationship 0.035≤A/W≤1.5 and further satisfy the relationship 0.04≤A/W≤1.4.", "", "In the tire10described above, as illustrated inFIG.9, in a state where the tire10is mounted on the specified rim21, inflated to the specified internal pressure, and loaded with 100% of specified load capacity, an opening distance between the tire10and the rim flange22on the perpendicular line drawn from the outermost point Tr of the rim flange22in the radial direction to the outer surface of the tire10is defined as A100(mm), and the opening distance A100with respect to the cross-sectional height SH (mm) preferably satisfies the relationship 0.003≤A100/SH≤0.100. The measurement position of the opening distance A100is identical to the measurement position of the opening distance A. Thus optimizing the opening distance A100when the tire10is deflected allows the effect of improving the durability to be enhanced.", "", "Here, the ratio A100/SH of less than 0.003 causes the opening distance A100to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the ratio A100/SH of more than 0.100 causes the opening distance A100to be too large and thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In either case, the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 0.005≤A100/SH≤0.070 and further satisfy the relationship 0.007≤A100/SH≤0.065.", "", "In the tire10described above, the opening distance A100(mm) with respect to the projection amount W (mm) preferably satisfies the relationship 0.010≤A100/W≤1.000. This can enhance the effect of improving the durability.", "", "Here, the ratio A100/W of less than 0.010 causes the opening distance A100to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the ratio A100/W of more than 1.000 causes the opening distance A100to be too large and thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In either case, the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 0.015≤A100/W≤0.800 and further satisfy the relationship 0.020≤A100/W≤0.800.", "", "In the tire10described above, the opening distance A (mm) and the opening distance A100(mm) satisfy the relationship 0.20≤A100/A≤0.80. This can reduce stress due to repeated deformation and enhance the effect of improving the durability.", "", "Here, the ratio A100/A of less than 0.20 causes deformation at or near the rim flange22to significantly increase when the tire10is deflected, and thus the effect of improving the durability may decrease. In contrast, the ratio A100/A of more than 0.80 causes deformation at a position away from the rim flange22to significantly increase when the tire10is deflected, and thus the effect of improving the durability may decrease. In particular, it is preferable to satisfy the relationship 0.23≤A100/A≤0.75 and further satisfy the relationship 0.25≤A100/A≤0.70.", "", "In the tire10described above, the opening distance A (mm) with respect to a height SDH (mm) in the tire radial direction to the maximum width position (measurement position of the total width TW) of the tire10preferably satisfies the relationship 0.01≤A/SDH≤0.50. Specifying the opening distance A with respect to the height SDH having a significant influence on the deformation of the bead portion3allows stress due to repeated deformation to be reduced and the effect of improving the durability to be enhanced.", "", "Here, the ratio A/SDH of less than 0.01 causes the opening distance A to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the ratio A/SDH of more than 0.50 causes the opening distance A to be too large and thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In either case, the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 0.02≤A/SDH≤0.45 and further satisfy the relationship 0.03≤A/SDH≤0.40.", "", "In the tire10described above, as illustrated inFIG.8, in an unloaded state where the tire10is mounted on the specified rim21and inflated to the specified internal pressure, an opening distance between the tire10and the rim flange22on a perpendicular line drawn from an intermediate point Ur between the outermost point Tr of the rim flange22in the radial direction and the opening start point S at which the rim flange22separates from the tire10to the outer surface of the tire10is defined as A′ (mm), and the opening distance A′ with respect to the cross-sectional height SH (mm) preferably satisfies the relationship 0.006≤A′/SH≤0.150. This can reduce stress due to repeated deformation and enhance the effect of improving the durability.", "", "Here, the ratio A′/SH of less than 0.006 causes the opening distance A′ to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the ratio A′/SH of more than 0.150 causes the opening distance A′ to be too large and thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In either case, the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 0.010≤A′/SH≤0.130 and further satisfy the relationship 0.014≤A′/SH≤0.110.", "", "In the tire10described above, the opening distance A (mm) and the opening distance A′ (mm) preferably satisfy the relationship 0.50≤A′/A≤0.96. This can reduce stress due to repeated deformation and enhance the effect of improving the durability.", "", "Here, the ratio A′/A of less than 0.50 causes the opening distance A′ to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the ratio A′/A of more than 0.96 causes the opening distance A′ to be too large and thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In either case, the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 0.53≤A′/A≤0.94 and further satisfy the relationship 0.56≤A′/A≤0.92.", "", "In the tire10described above, the opening distance A′ is preferably in the range 1.0 mm≤A′≤7.5 mm. This can reduce stress due to repeated deformation and enhance the effect of improving the durability.", "", "Here, the opening distance A′ of less than 1.0 mm causes the opening distance A′ to be insufficient and stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In contrast, the opening distance A′ of more than 7.5 mm causes the opening distance A′ to be too large and thus a failure due to rubbing between the tire10and the rim flange22to be likely to occur. In either case, the effect of improving the durability decreases. In particular, the opening distance A′ is preferably in the range 1.2 mm≤A′≤7.0 mm and is further preferably in the range 1.4 mm≤A′≤6.5 mm.", "", "In the tire10described above, as illustrated inFIG.10, in an unloaded state where the tire10is mounted on the specified rim21and inflated to the specified internal pressure, the opening start point at which the rim flange22separates from the tire10is defined as S, the point at which the perpendicular line drawn from the outermost point Tr of the rim flange22in the radial direction to the outer surface of the tire10intersects with the outer surface of the tire10is defined as T, two perpendicular lines are drawn from the points S and T to the turned-up portion4B of the carcass layer4, and a cross-sectional area Sr of a rubber portion R (hatched portion) included in a region surrounded by these two perpendicular lines and the turned-up portion4B of the carcass layer4is preferably in the range 12 mm2≤Sr≤101 mm2. The cross-sectional area Sr of the rubber portion R is the cross-sectional area of a portion located further on an outer side than carcass cords constituting the carcass layer4.", "", "As described above, the cross-sectional area Sr of the rubber portion R bearing the buffering function with respect to the rim flange22is in the range 12 mm2≤Sr≤101 mm2. This can properly set the opening distance A with respect to the amount of deflection and deformation of the tire10and effectively reduce a failure due to deflection of the tire10and a failure due to rubbing between the tire10and the flange22. This can reduce a failure at or near the bead portion3and further enhance the effect of improving the durability of the tire10.", "", "Here, the cross-sectional area Sr of the rubber portion R of smaller than 12 mm2causes compressive stress to be likely to be applied to the carcass layer4at or near the rim flange22when the tire10is deflected, leading to a failure. In contrast, the cross-sectional area Sr of larger than 101 mm2makes it difficult to sufficiently have the opening distance A and causes stress at or near the rim flange22to increase when the tire10is deflected, leading to a failure. In particular, it is preferable to satisfy the range 14 mm2≤Sr≤98 mm2and further satisfy the range 16 mm2≤Sr≤93 mm2.", "", "In the tire10described above, as illustrated inFIG.11, the thickness of the rubber portion R on the perpendicular line drawn from the point S to the turned-up portion4B of the carcass layer4is defined as Gl (mm), the thickness of the rubber portion R on the perpendicular line drawn from the point T to the turned-up portion4B of the carcass layer4is defined as Gu (mm), and the thicknesses Gl and Gu preferably satisfy the relationship 0.40≤Gl/Gu≤0.90. This allows a good buffering function to be ensured and the effect of improving the durability to be enhanced.", "", "Here, when the ratio Gl/Gu is out of the range described above, the buffering function decreases, and the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 0.45≤Gl/Gu≤0.85 and further satisfy the relationship 0.50≤Gl/Gu≤0.80. Preferably, the thickness Gl of the rubber portion R satisfies the range 0.5 mm≤Gl≤4.0 mm and further satisfies the range 1.5 mm≤Gl≤3.0 mm. The thicknesses Gl and Gu of the rubber portion R can also be measured in a cut sample of the tire10.", "", "In the tire10described above, as illustrated inFIG.11, in an unloaded state where the tire10is mounted on the specified rim21and inflated to the specified internal pressure, a point at which the perpendicular line drawn from the point S to the turned-up portion4B of the carcass layer4intersects with the turned-up portion4B of the carcass layer4is defined as Sc, a point at which a perpendicular line drawn from the point T to the turned-up portion4B of the carcass layer4intersects with the turned-up portion4B of the carcass layer4is defined as Tc, an intermediate point between the points Sc and Tc is defined as Uc, and the arc (radius of curvature RC) of the carcass layer4passing through points Sc, Tc, and Uc preferably has a center on an outer side in the tire width direction. This makes it difficult for compressive stress to be applied to the carcass layer4when the tire is deformed and thus can enhance the effect of improving the durability. The arc of the carcass layer4passing through the points Sc, Tc, and Uc preferably has a center on an outer side in the tire width direction even in a state where the tire10is a single body while not being mounted on a rim or in a state where a 100% load is applied to the tire.", "", "In particular, as illustrated inFIG.11, the intermediate point between the points S and Tr is defined as Ur, and the radius of curvature Rc (mm) of the arc of the carcass layer4passing through the points Sc, Tc, and Uc with respect to the radius of curvature Rr (mm) of the arc of the rim flange22passing through the points S. Tr, and Ur preferably satisfies the relationship 1≤Rc/Rr≤55. This makes it difficult for compressive stress to be applied to the carcass layer4when the tire is deformed and thus can enhance the effect of improving the durability.", "", "Here, when the ratio Rc/Rr is out of the range described above, compressive stress is likely to be applied to the carcass layer4when the tire is deformed, and thus the effect of improving the durability decreases. In particular, it is preferable to satisfy the relationship 2≤Rc/Rr≤50 and further satisfy the relationship 3≤Rc/Rr≤45.", "", "FIG.12illustrates a modified example of the bead portion. InFIG.12, the body portion4A and the turned-up portion4B of the carcass layer4are in contact with each other without a bead filler interposed therebetween and thus form a closed region including the bead core5. In other words, the carcass layer4is wound up around the bead core5from the inner side to the outer side of the tire such that the body portion4A and the turned-up portion4B are disposed in close contact with each other at the upper end position of the bead core5. Adopting such a turned-up structure of the carcass layer4allows the carcass layer4to be kept away from the rim flange22at a contact portion with the rim flange22, allowing compressive stress applied to the carcass layer4to be significantly reduced and the effect of improving the durability to be enhanced. The rubber distribution in the closed region formed by the carcass layer4is preferably 15% or less, more preferably 10% or less, and further more preferably 5% or less. The rubber distribution mentioned here is a percentage of a rubber portion (for example, an insulation rubber of a bead wire or a small bead filler) in the closed region formed by the carcass layer4in a tire meridian cross-section.", "", "Additionally, in the structure ofFIG.12, the durability can be improved by disposing the secondary bead filler9on an outer side of the turned-up portion4B of the carcass layer4in the tire width direction or by increasing the thickness of the rim cushion rubber layer13. In this case, the cross-sectional area Sr of the rubber portion R can be set in the range 36 mm2≤Sr≤101 mm2. In particular, it is preferable to satisfy the range 42 mm2≤Sr≤98 mm2and further satisfy the range 48 mm2≤Sr≤93 mm2.", "", "In the tire10described above, as illustrated inFIG.10, when the tire10includes the rim cushion rubber layer13disposed in the region in contact with the rim flange22and the sidewall rubber layer12disposed on an outer side of the rim cushion rubber layer13in the tire radial direction, a boundary point X between the rim cushion rubber layer13and the sidewall rubber layer12on the outer surface of the tire10is preferably located further on an outer side in the tire radial direction than the point T in an unloaded state in which the tire10is mounted on a specified rim21and inflated to the specified internal pressure. In other words, the rim cushion rubber layer13preferably extends from the lower side of the bead core5toward the outer side in the tire radial direction at least to the position of the point T. This makes it difficult for compressive stress to be applied to the carcass layer4when the tire is deformed and thus can enhance the effect of improving the durability.", "", "The hardness of the rim cushion rubber layer13at 20° C. is preferably 55 or more and 80 or less. This can improve the durability of the rim cushion rubber layer13. Here, when the hardness of the rim cushion rubber layer13is out of the range described above, the effect of improving the durability decreases. The hardness is the durometer hardness measured in accordance with JIS (Japanese Industrial Standard)-K6253 with the use of a type A durometer and under a temperature of 20° C.", "", "The 100% modulus of the rim cushion rubber layer13at 20° C. is preferably 2.0 MPa or more and 9.5 MPa or less. This can improve the durability of the rim cushion rubber layer13. Here, when the 100% modulus of the rim cushion rubber layer13is out of the range described above, the effect of improving the durability decreases. The 100% modulus is a predetermined tensile stress measured at a temperature of 20° C. in accordance with JIS-K6251.", "", "The loss tangent (tan δ) at 20° C. of the rim cushion rubber layer13is preferably 0.05 or more and 0.35 or less. This can suppress an increase in rolling resistance while having the thickness (durability) of the rim cushion rubber layer13. Here, the loss tangent of the rim cushion rubber layer13of more than 0.35 will cause the rolling resistance to increase. Loss tangent (tan δ) is measured according to JIS-K6394 using a viscoelastic spectrometer (available from Toyo Seiki Seisaku-sho, Ltd.) at a frequency of 20 Hz, an initial strain of 10%, a dynamic strain of 2%, and a temperature of 60° C.", "", "The intermediate elongation of the carcass cords constituting the carcass layer4under a load of 1.5 cN/dtex is preferably 3.3% or more and 6.2% or less. This can enhance the effect of improving the durability. Here, when the intermediate elongation under a load of 1.5 cN/dtex of the carcass cords constituting the carcass layer4is out of the range described above, the effect of improving the durability decreases. In particular, the intermediate elongation of the carcass cords under a load of 1.5 cN/dtex is preferably 3.8% or more and 5.9% or less. The intermediate elongation is measured by performing a tensile test, on the carcass cords removed from the sidewall portion of the tire10, in accordance with JIS-L 1017 at a length between grips of 250 mm and a tensile speed of 300±20 mm/minute.", "", "The carcass cords constituting the carcass layer4are organic fiber cords. When, for example, high-modulus rayon cords are used as the carcass cords, the durability is improved. The total thickness of the carcass layer4is preferably 0.8 mm or more and 1.5 mm or less. In the case of the rayon cords, the cord diameter is preferably 0.6 mm or more and 1.1 mm or less, and the cord density is preferably 43 cords or more/50 mm and 59 cords or less/50 mm. Polyester cords having excellent fatigue resistance are also preferable as carcass cords. In the case of the polyester cords, the cord diameter is preferably 0.7 mm or more and 1.2 mm or less, and the cord density is preferably 44 cords or more/50 mm and 60 cords or less/50 mm.", "", "Further, the angle of the carcass cords constituting the carcass layer4with respect to the tire circumferential direction can be set in the range of 75° or more and 900 or less. In particular, when the angle of the carcass cords is set to be less than 88°, the tire rigidity is increased and thus the durability is improved. Furthermore, the turned-up portion4B of the carcass layer4preferably extends beyond the tire maximum width position to a position overlapped with the edge portion of the belt layer7. Adopting such a turned-up portion structure increases the tire rigidity, thus improving the durability."], "claims": ["1 - 10 . (canceled)", "in an unloaded state where the tire is mounted on a specified rim and inflated to a specified internal pressure, an opening distance between the tire and a rim flange on a perpendicular line drawn from an outermost point of the rim flange in a radial direction to an outer surface of the tire being defined as A, and the opening distance A with respect to the cross-sectional height SH satisfying a relationship 0.01≤A/SH≤0.16, and a point at which a horizontal line in a tire width direction passing through the outermost point of the rim flange in the radial direction intersects with the outer surface of the tire being defined as P, a point specifying a rim width and a rim diameter of the specified rim being defined as Q, and an angle α formed by a straight line connecting the points P and Q and a horizontal line in the tire width direction being in a range 50°≤α≤80°.", "12 . The tire according to claim 11 , wherein in an unloaded state where the tire is mounted on the specified rim and inflated to the specified internal pressure, a point specifying a total width of the tire is defined as L, and an angle θ formed by the straight line connecting the points P and Q and a straight line connecting the points L and Q is in a range 2°≤θ≤30°.", "13 . The tire according to claim 11 , wherein in an unloaded state where the tire is mounted on the specified rim and inflated to the specified internal pressure, an opening start point at which the rim flange separates from the tire is defined as S, the outermost point of the rim flange in the radial direction is defined as Tr, a point at which a perpendicular line drawn from the point Tr to the outer surface of the tire intersects with the outer surface of the tire is defined as T, and an angle β formed by a straight line connecting the points S and T and a straight line connecting the points S and Tr is in a range 15°≤β≤65°.", "14 . The tire according to claim 11 , wherein in an unloaded state where the tire is mounted on the specified rim and inflated to the specified internal pressure, an opening start point at which the rim flange separates from the tire is defined as S, and a horizontal distance B in the tire width direction between the points Q and S with respect to the cross-sectional height SH satisfies a relationship 0.02≤B/SH≤0.18.", "15 . The tire according to claim 11 , wherein in an unloaded state where the tire is mounted on the specified rim and inflated to the specified internal pressure, an opening start point at which the rim flange separates from the tire is defined as S, and a horizontal distance B in the tire width direction between the points Q and S is in a range 3.0 mm≤B≤9.0 mm.", "16 . The pneumatic tire according to claim 11 , wherein the opening distance A is in a range 1.5 mm≤B≤8.0 mm.", "17 . The tire according to claim 11 , wherein in an unloaded state where the tire is mounted on the specified rim and inflated to the specified internal pressure, an opening start point at which the rim flange separates from the tire is defined as S, the outermost point of the rim flange in the radial direction is defined as Tr, a point at which a perpendicular line drawn from the point Tr to the outer surface of the tire intersects with the outer surface of the tire is defined as T, and an arc of the tire passing through the points S, P, and T has a center on an outer side in the tire width direction.", "18 . The tire according to claim 11 , wherein in an unloaded state where the tire is mounted on the specified rim and inflated to the specified internal pressure, an opening start point at which the rim flange separates from the tire is defined as S, the outermost point of the rim flange in the radial direction is defined as Tr, a point at which a perpendicular line drawn from the point Tr to the outer surface of the tire intersects with the outer surface of the tire is defined as T, a point at which a perpendicular line drawn from the point P to the outer surface of the tire intersects with the outer surface of the rim flange is defined as Pr, and a radius of curvature Rb of an arc of the tire passing through the points S, P, and T with respect to a radius of curvature Rr of an arc of the rim flange passing through the points S, Pr, and Tr satisfies a relationship 1.2≤Rb/Rr≤14.5.", "19 . The tire according to claim 11 , comprising a plurality of belt layers embedded in a tread portion, wherein in an unloaded state where the tire is mounted on the specified rim and inflated to the specified internal pressure, a point at which a horizontal line in the tire width direction passing through an edge portion of a belt layer on an innermost side in a tire radial direction of the plurality of belt layers intersects with the outer surface of the tire is defined as V, a point specifying a total width of the tire is defined as L, and an angle γ formed by a straight line connecting the points L and V and a horizontal line in the tire width direction is in a range 450≤γ≤80°.", "20 . The tire according to claim 19 , wherein in an unloaded state where the tire is mounted on the specified rim and inflated to the specified internal pressure, a point located at a center position between the points L and V in the tire radial direction and on the outer surface of the tire is defined as W, and a radius of curvature Rs of an arc of the tire passing through the points V, W, and L with respect to the cross-sectional height SH satisfies a relationship 0.3≤Rs/SH≤2.5.", "21 . The tire according to claim 12 , wherein in an unloaded state where the tire is mounted on the specified rim and inflated to the specified internal pressure, an opening start point at which the rim flange separates from the tire is defined as S, the outermost point of the rim flange in the radial direction is defined as Tr, a point at which a perpendicular line drawn from the point Tr to the outer surface of the tire intersects with the outer surface of the tire is defined as T, and an angle β formed by a straight line connecting the points S and T and a straight line connecting the points S and Tr is in a range 15°≤β≤65°.", "22 . The tire according to claim 21 , wherein in an unloaded state where the tire is mounted on the specified rim and inflated to the specified internal pressure, an opening start point at which the rim flange separates from the tire is defined as S, and a horizontal distance B in the tire width direction between the points Q and S with respect to the cross-sectional height SH satisfies a relationship 0.02≤B/SH≤0.18.", "23 . The tire according to claim 22 , wherein in an unloaded state where the tire is mounted on the specified rim and inflated to the specified internal pressure, an opening start point at which the rim flange separates from the tire is defined as S, and a horizontal distance B in the tire width direction between the points Q and S is in a range 3.0 mm≤B≤9.0 mm.", "24 . The pneumatic tire according to claim 23 , wherein the opening distance A is in a range 1.5 mm≤B≤8.0 mm.", "25 . The tire according to claim 24 , wherein in an unloaded state where the tire is mounted on the specified rim and inflated to the specified internal pressure, an opening start point at which the rim flange separates from the tire is defined as S, the outermost point of the rim flange in the radial direction is defined as Tr, a point at which a perpendicular line drawn from the point Tr to the outer surface of the tire intersects with the outer surface of the tire is defined as T, and an arc of the tire passing through the points S, P, and T has a center on an outer side in the tire width direction.", "26 . The tire according to claim 25 , wherein in an unloaded state where the tire is mounted on the specified rim and inflated to the specified internal pressure, an opening start point at which the rim flange separates from the tire is defined as S, the outermost point of the rim flange in the radial direction is defined as Tr, a point at which a perpendicular line drawn from the point Tr to the outer surface of the tire intersects with the outer surface of the tire is defined as T, a point at which a perpendicular line drawn from the point P to the outer surface of the tire intersects with the outer surface of the rim flange is defined as Pr, and a radius of curvature Rb of an arc of the tire passing through the points S, P, and T with respect to a radius of curvature Rr of an arc of the rim flange passing through the points S, Pr, and Tr satisfies a relationship 1.2≤Rb/Rr≤14.5.", "27 . The tire according to claim 26 , comprising a plurality of belt layers embedded in a tread portion, wherein in an unloaded state where the tire is mounted on the specified rim and inflated to the specified internal pressure, a point at which a horizontal line in the tire width direction passing through an edge portion of a belt layer on an innermost side in a tire radial direction of the plurality of belt layers intersects with the outer surface of the tire is defined as V, a point specifying a total width of the tire is defined as L, and an angle γ formed by a straight line connecting the points L and V and a horizontal line in the tire width direction is in a range 450≤γ≤80°.", "28 . The tire according to claim 27 , wherein in an unloaded state where the tire is mounted on the specified rim and inflated to the specified internal pressure, a point located at a center position between the points L and V in the tire radial direction and on the outer surface of the tire is defined as W, and a radius of curvature Rs of an arc of the tire passing through the points V, W, and L with respect to the cross-sectional height SH satisfies a relationship 0.3≤Rs/SH≤2.5."], "bibtex": "@patent{20240262130,\n    title = {TIRE},\n    number = {20240262130},\n    year = {2024},\n    note = {File: US20240262130A1-20240808.XML}\n    }", "classification": "B60C304FI"}, {"title": "PNEUMATIC TIRE WITH INTEGRATED ENVELOPE", "doc_number": "20240262131", "filename": "US20240262131A1-20240808.XML", "abstract": "The present invention provides a pneumatic tire ( 100 ) with integrated envelope comprising, a tread ( 1 ), a belt system ( 2 ), and a tire casing ( 3 ), wherein said tire casing ( 3 ) comprises a side wall ( 4 ), a bead ( 5 ), a plurality of layer including but not limited to a carcass ply ( 6 ) acting as a top layer, an inner liner ( 7 ) acting as bottom layer and an envelope ( 8 ) that is sandwiched between said carcass ply ( 6 ) and the inner liner ( 7 ), said envelope ( 8 ) is injected with a fluid inside said tire casing ( 3 ) in which said tire casing ( 3 ) is pasted on said belt system ( 2 ) and said belt system ( 2 ) is pasted on said tread ( 1 ) in said pneumatic tire ( 100 ) and said side wall ( 4 ) protects said tire casing ( 3 ).", "detailed_description": ["The present invention will now be described hereinafter with reference to the accompanying drawings in which a preferred embodiment of the invention is shown. This invention may, however, be embodied in many different forms and should not be construed as being limited to the embodiment set forth herein. Rather, the embodiment is provided so that this disclosure will be thorough, and will fully convey the scope of the invention to those skilled in the art.", "", "Many aspects of the invention can be better understood with references made to the drawings below. The components in the drawings are not necessarily drawn to scale. Instead, emphasis is placed upon clearly illustrating the components of the present invention. Moreover, like reference numerals designate corresponding parts through the several views in the drawings. Before explaining at least one embodiment of the invention, it is to be understood that the embodiments of the invention are not limited in their application to the details of construction and to the arrangement of the components set forth in the following description or illustrated in the drawings. The embodiments of the invention are capable of being practiced and carried out in various ways. In addition, the phraseology and terminology employed herein are for the purpose of description and should not be regarded as limiting.", "", "The present invention provides a pneumatic tire accommodating an envelope with sealant and coolant to improve its strength, durability and life comprising of a tire casing having an envelope for encapsulating a sealant and coolant and also increasing the potency and verve of tire.", "", "In an embodiment, the present invention provides a pneumatic tire with integrated envelope comprising, a tread, a belt system, and a tire casing, wherein, said tread is an outer layer of said pneumatic tire that comes in contact with a road surface, said tire casing comprises a side wall, a bead, a plurality of layer including but not limited to a carcass ply acting as a top layer, an inner liner acting as bottom layer and an envelope that is sandwiched between said carcass ply and the inner liner, said envelope is a closed hollow body that is injected with a fluid inside said tire casing in which said tire casing is pasted on said belt system and said belt system is pasted on said tread in said pneumatic tire, and said side wall protects said tire casing and said bead that wraps around the tire casing to connect said pneumatic tire to a rim of a wheel.", "", "The pneumatic tire is manufactured without using a desired amount of talcum powder thereby preventing cracks and fixtures in said pneumatic tire and increasing life of said pneumatic tire. The envelope is sandwiched between said inner liner and said plurality of layer of said pneumatic tire. The envelope is pre-fabricated in said pneumatic tire. The envelope is semi-vulcanized and sandwiched between said plurality of layer and an inner surface of said inner liner. The envelope covers proportionately the tread area of said pneumatic tire. The envelope covers proportionately said tread area and a shoulder area from inner side of said pneumatic tire. The envelope covers proportionately said tread area and shoulder area from inner side part of side wall of said pneumatic tire. The envelope forming said middle layer is made of a material that includes but not limited to on butyl rubber and reclaim butyl and/or bromo butyl rubber. The envelope forming said middle layer is made of a material that includes butyl rubber and reclaim butyl and/or EPDM. The envelope forming said middle layer is made of a natural rubber and reclaim natural rubber and/or EPDM and/or neoprene rubber. The envelope forming said middle layer is made of a material that includes synthetic fibers like polyamides and/or nylon and/or dyneema and/or Kevlar and/or EPDM to encompass said fluid in said pneumatic tire. The envelope encompasses said fluid which includes but not limited to a semi viscous fluid which acts like a heat sink. The envelope is injected with a coolant to prevent overheating and/or localized overheating of the pneumatic tire. The envelop is having anti-freeze additives to keep it in fluid state even in sub-zero temperature. The envelope is injected with a sealant to seal any leakage in the pneumatic tire.", "", "Now referring toFIG.1, the present invention provides a structure of pneumatic tire (100) having a tread (1), a belt system (2) and a tire casing (3). The tread (1) is the outer layer of the tire (100) which forms the covering of said tire (100) that makes contact with the road or the ground. The tire casing (3) is the body of the tire (100) comprises of a side wall (4), a bead (5) and a plurality of layers such as but not limited to carcass ply (6), an inner liner (7) and an envelope (8). The tire casing (3) has plurality of layer including but not limited to carcass ply (6) acting as a top layer that sustains load and absorbs shock subsequently, an inner liner (7) acting as bottom layer to hold the air pressure inside the tire and an envelope (8) that is sandwiched between said carcass ply (6) and inner liner (7). The side wall (4) is the side part of the tire that protects the tire casing (3) and bead (5) wraps around the tire casing (3) that connects the tire to a rim of a wheel. Bead (5) is made of materials such as but not limited to rubber, elastomer. The envelope (8) is a closed hollow body injected with a sealant to seal any leakage in the tire. The envelope either touches the sidewall of the tire or is placed within the sidewall of the tire. The envelope (8) provided inside the tire casing (3) takes no load and is attached to the tire (100) and the pneumatic tire (100) is manufactured without using a desired amount of talcum powder thereby preventing cracks and fixtures and increasing life of said pneumatic tire (100). The tire casing (3) is pasted on the belt system (2) and said belt system (2) is pasted on the tread (1) and vulcanized together to form the structure of said tire (100). The belt system (2) provides strength and stability to the tread (1) and contributes to wear, handling and traction.", "", "Now referring toFIG.2, the present invention provides the view of tire casing (3). The tire casing (3) has plurality of layers wherein the top layer is a carcass ply (6) made of rubber that bears the load and provides the strength to the tire pasted on the belt system (2) subsequently, in one of the embodiment, the tire casing (3) has plurality of layer including but not limited to carcass ply (6) acting as a top layer that sustains load and absorbs shock subsequently, an inner liner (7) acting as bottom layer to hold the air pressure inside the tire and an envelope (8) that is sandwiched between said carcass ply (6) and inner liner (7) and is made of different materials. The material of the envelope is based on butyl rubber and reclaims butyl and/or bromo butyl rubber.", "", "In another embodiment the material of the envelope is based on butyl rubber and reclaims butyl and/or EPDM. In yet another embodiment said material of the envelope is based on butyl rubber and reclaim butyl and/or EPDM and/or neoprene rubber. In another embodiment said material of the envelope is based on natural rubber and reclaims natural rubber and/or EPDM.", "", "In another embodiment said material of the envelope is based on natural rubber and reclaims natural rubber and/or EPDM and/or neoprene rubber. In another embodiment said material of the envelope is multilayered synthetic fibers like polyamides, nylon, dyneema etc. The envelope is manufactured to contain sealant to seal the leakage in said tire in case of puncture and/or coolant to decrease localized over-heating.", "", "The envelope (8) is pre-fabricated in said pneumatic tire (100) and envelope (8) is semi-vulcanized and sandwiched between said plurality of layer and an inner surface of said inner liner of said tire (100). The semi viscous fluid injected inside the envelope works like a heat sink maintaining temperature when vehicle soaks in cold at night in winter. The rubber compounds being brittle at low temperature said fluid inside the envelope works in maintaining temperature and thereby increasing life of the tire and averting tire failures.", "", "The envelope (8) is a hollow body injected with a sealant and coolant. The level of pressure contained within the envelope (8) is controlled by injecting sealant so that if puncture arises, the sealant seeps through the envelope to seal the leakage in tire. The tire casing (3) is pasted on the belt system (2) and said belt system (2) is pasted on the tread (1) without any powder which provides an additional advantage of preventing cracks and fissures on pneumatic tire (100).", "", "Now referring toFIG.3, the present invention provides the perspective view of the of the tire casing having envelope that at least covers the area proportionate to tread area from the inner side of the pneumatic tire is depicted. The tire casing (3) has plurality of layers wherein the top layer is a carcass ply (6) made of rubber that bears the load and provides the strength to the tire pasted on the belt system (2) subsequently, in one of the embodiment, an inner liner (7) pasted to the carcass ply (6) to ensure the retention of air when tire is inflated followed by an envelope (8) that at least covers the area proportionate to tread (1) area from the inner side to contain a sealant to seal the leakage in said pneumatic tire (100).", "", "Now referring toFIG.4, the present invention provides the perspective view of the tire casing having envelope that covers the tread area and shoulder area from inner side of the pneumatic tire is depicted. The tire casing (3) has plurality of layers wherein the top layer is a carcass ply (6) made of rubber that bears the load and provides the strength to the tire pasted on the belt system (2) subsequently, in one of the embodiment, an inner liner (7) pasted to the carcass ply (6) to ensure the retention of air when tire is inflated followed by an envelope (8) that covers the tread area and shoulder (9) area from inner side.", "", "Now referring toFIG.5, the perspective view of the tire casing having envelope that covers the tread area and shoulder area from inner side and part of side wall of the pneumatic tire is depicted. The tire casing (3) has plurality of layers wherein the top layer is a carcass ply (6) made of rubber that bears the load and provides the strength to the tire pasted on the belt system (2) subsequently, in one of the embodiment, an inner liner (7) pasted to the carcass ply (6) to ensure the retention of air when tire is inflated followed by an envelope (8) that covers the tread area and shoulder (9) area from inner side and part of the side wall (4).", "", "Thus present invention provides the tire having an envelope sandwiched between inner liner and other elements of the tire that provides numerous advantages such as increase the life of tire by maintaining uniformity in temperature, pasted and vulcanized on the tread without the powder or any other separator at the time of assembly which prevents the crack and fissures in tire.", "", "Many modifications and other embodiments of the invention set forth herein will readily occur to one skilled in the art to which the invention pertain having the benefit of the teachings presented in the foregoing descriptions and the associated drawings. Therefore, it is to be understood that the invention is not to be limited to the specific embodiments disclosed and that modifications and other embodiments are intended to be included within the scope of the appended claims. Although specific terms are employed herein, they are used in a generic and descriptive sense only and not for purposes of limitation.", "", "The foregoing description of embodiments of the invention has been presented for purposes of illustration and description. It is not intended to be exhaustive or to limit the invention to the precise form disclosed, and modifications and variations are possible in light of the above teachings or may be acquired from practice of the invention. The embodiments were chosen and described in order to explain the principals of the invention and its practical application to enable one skilled in the art to utilize the invention in various embodiments and with various modifications as are suited to the particular use contemplated."], "claims": ["a tread ( a belt system ( a tire casing ( wherein: said tread ( said tire casing ( said envelope ( said side wall (", "2 . The pneumatic tire ( 100 ) with integrated envelope as claimed in claim 1 , wherein said pneumatic tire ( 100 ) is manufactured without using a desired amount of talcum powder thereby preventing cracks and fixtures in said pneumatic tire ( 100 ) and increasing life of said pneumatic tire ( 100 ).", "3 . The pneumatic tire ( 100 ) with integrated envelope as claimed in claim 1 , wherein said envelope ( 8 ) is sandwiched between said inner liner and said plurality of layer of said pneumatic tire ( 100 ).", "4 . The pneumatic tire ( 100 ) with integrated envelope as claimed in claim 1 , wherein said envelope ( 8 ) is pre-fabricated in said pneumatic tire ( 100 ).", "5 . The pneumatic tire ( 100 ) with integrated envelope as claimed in claim 1 , wherein said envelope ( 8 ) is semi-vulcanized and sandwiched between said plurality of layer and an inner surface of said inner liner.", "6 . The pneumatic tire ( 100 ) with integrated envelope as claimed in claim 1 , wherein said envelope ( 8 ) covers proportionately the tread area of said pneumatic tire ( 100 ).", "7 . The pneumatic tire ( 100 ) with integrated envelope as claimed in claim 1 , wherein said envelope ( 8 ) covers proportionately said tread ( 1 ) area and a shoulder ( 9 ) area from inner side of said pneumatic tire ( 100 ).", "8 . The pneumatic tire ( 100 ) with integrated envelope as claimed in claim 1 , wherein said envelope ( 8 ) covers proportionately said tread ( 1 ) area and shoulder ( 9 ) area from inner side part of side wall ( 4 ) of said pneumatic tire ( 100 ).", "9 . The pneumatic tire ( 100 ) with integrated envelope as claimed in claim 1 , wherein said envelope ( 8 ) forming said middle layer is made of a material that includes but not limited to on butyl rubber and reclaim butyl and/or bromo butyl rubber.", "10 . The pneumatic tire ( 100 ) with integrated envelope as claimed in claim 1 , wherein said envelope ( 8 ) forming said middle layer is made of a material that includes butyl rubber and reclaim butyl and/or EPDM.", "11 . The pneumatic tire ( 100 ) with integrated envelope as claimed in claim 1 , wherein said envelope ( 8 ) forming said middle layer is made of a natural rubber and reclaim natural rubber and/or EPDM and/or neoprene rubber.", "12 . The pneumatic tire ( 100 ) with integrated envelope as claimed in claim 1 , wherein said envelope ( 8 ) forming said middle layer is made of a material that includes synthetic fibers like polyamides and/or nylon and/or dyneema and/or Kevlar and/or EPDM to encompass said fluid in said pneumatic tire ( 100 ).", "13 . The pneumatic tire ( 100 ) with integrated envelope as claimed in claim 1 , wherein said envelope ( 8 ) encompass said fluid which includes but not limited to a semi viscous fluid which acts like a heat sink.", "14 . The pneumatic tire ( 100 ) with integrated envelope as claimed in claim 1 , wherein said envelope ( 8 ) is injected with a coolant to prevent overheating and/or localized overheating of the pneumatic tire ( 100 ).", "15 . The pneumatic tire ( 100 ) with integrated envelope as claimed in claim 1 , wherein said envelope ( 8 ) is having anti-freeze additives to keep it in fluid state even in sub-zero temperature.", "16 . The pneumatic tire ( 100 ) with integrated envelope as claimed in claim 1 , wherein said envelope ( 8 ) is injected with a sealant to seal any leakage in the pneumatic tire ( 100 )."], "bibtex": "@patent{20240262131,\n    title = {PNEUMATIC TIRE WITH INTEGRATED ENVELOPE},\n    number = {20240262131},\n    year = {2024},\n    note = {File: US20240262131A1-20240808.XML}\n    }", "classification": "B60C900FI"}, {"title": "TIRE", "doc_number": "20240262132", "filename": "US20240262132A1-20240808.XML", "abstract": "A tire according to the present disclosure comprises a carcass extending between a first bead core in a first half portion of the tire and a second bead core in a second half portion of the tire. The carcass comprises a body portion, a first foldback portion extending from the body portion and folding back around the first bead core, and a second foldback portion extending from the body portion and folding back around the second bead core. A first end of the first foldback portion is positioned further to the tire radial direction outer side than a second end of the second foldback portion in the tire radial direction. A communication device is embedded in a sidewall portion of the first half portion, further to the tire radial direction inner side than the first end and further to the tire radial direction outer side than the second end.", "detailed_description": ["The following describes embodiments of a tire according to the present disclosure, with reference to the drawings. Members and portions that are common to each drawing use the same reference signs. Note, however, that the drawings are schematic and that the proportions of each dimension and the like may differ from those in reality.", "", "In the present specification, “tire width direction” refers to a direction parallel to a rotation axis of the tire. “Tire radial direction” refers to a direction perpendicular to the rotation axis of the tire. “Tire circumferential direction” refers to a direction in which the tire rotates centered on the rotation axis of the tire.", "", "Further, in the present specification, “tire radial direction inner side” refers to a side along the tire radial direction closer to the rotation axis of the tire, and “tire radial direction outer side” refers to a side along the tire radial direction farther from the rotation axis of the tire. On the other hand, “tire width direction inner side” refers to a side along the tire width direction closer to a tire equatorial plane, denoted as CL, and “tire width direction outer side” refers to a side along the tire width direction farther from the tire equatorial plane CL.", "", "In the present specification, the “tire equatorial plane” is a plane, in a cross section in the tire width direction of the tire, that is perpendicular to a bead line at a midpoint of the bead line, the bead line being a straight line connecting centers of a pair of bead cores.", "", "Unless otherwise noted, in the present specification, the positional relationship or the like of each element of the tire is measured in a standard state. The “standard state” is a state in which the tire is fitted to a rim of a wheel that is an applicable rim, a prescribed internal pressure is applied, and no load is applied. The following describes a tire that has a cavity filled with air and is installed on a vehicle such as a passenger vehicle. However, the cavity of the tire may be filled with a fluid other than air, and the tire may be installed on a vehicle other than a passenger vehicle.", "", "In the present specification, “applicable rim” (Measuring Rim in the STANDARDS MANUAL of ETRTO and Design Rim in the YEAR BOOK of TRA) refers to an approved rim of an applicable size as described by, or as described in the future by, valid industrial standards for the region in which a tire is produced or used, such as the JATMA YEAR BOOK of JATMA (the Japan Automobile Tyre Manufacturers Association) in Japan, the STANDARDS MANUAL of ETRTO (European Tyre and Rim Technical Organization) in Europe, and the YEAR BOOK of TRA (The Tire and Rim Association, Inc.) in the U.S. In a case in which a rim size is not described in the industrial standards, the “applicable rim” refers to a rim with a width corresponding to a bead width of the pneumatic tire. The “applicable rim” includes current sizes as well as sizes that will be included in the future in the above industrial standards. Examples of “sizes described in the future” may include sizes as described in “FUTURE DEVELOPMENTS” in the 2013 edition of the STANDARDS MANUAL of ETRTO.", "", "In the present specification, “prescribed internal pressure” refers to an air pressure (maximum air pressure) corresponding to the maximum load capability of a single wheel in an applicable size and ply rating as described in the JATMA YEAR BOOK or other industrial standards. In case of a size not described in the above industrial standard, the “prescribed internal pressure” refers to an air pressure (the maximum air pressure) corresponding to the maximum load capability prescribed for each vehicle on which the tire is installed. Furthermore, in the present specification, “prescribed load” refers to a load corresponding to the maximum load capability of a single wheel in an applicable size and ply rating as described in the above industrial standards. In case of a size not described in the above industrial standards, the “prescribed load” refers to a load corresponding to the maximum load capability prescribed for each vehicle on which the tire is installed."], "claims": ["a carcass that extends between a first bead core positioned in the first half portion and a second bead core positioned in the second half portion, the carcass comprising: a carcass body portion that extends toroidally between the first bead core and the second bead core; a first carcass foldback portion that extends from the carcass body portion, folds back around a perimeter of the first bead core from a tire width direction inner side to a tire width direction outer side, and extends to a tire radial direction outer side; and a second carcass foldback portion that extends from the carcass body portion, folds back around a perimeter of the second bead core from the tire width direction inner side to the tire width direction outer side, and extends to the tire radial direction outer side, wherein a first end of the tire radial direction outer side of the first carcass foldback portion is positioned further to the tire radial direction outer side than a second end of the tire radial direction outer side of the second carcass foldback portion, and a communication device is embedded in a sidewall portion of the first half portion, further to the tire radial direction inner side than the first end and further to the tire radial direction outer side than the second end.", "wherein the first end of the first carcass foldback portion is positioned further to the tire width direction inner side than an end of the tire width direction outer side of the belt in the first half portion.", "wherein the first end of the first carcass foldback portion is positioned further to the tire width direction outer side than an end of the tire width direction outer side of the belt in the first half portion.", "4 . The tire according to claim 1 , wherein the communication device is embedded in the sidewall portion of the first half portion, further to the tire width direction outer side than the first carcass foldback portion.", "5 . The tire according to claim 1 , wherein the communication device is embedded in the sidewall portion of the first half portion, further to the tire width direction inner side than the carcass body portion.", "6 . The tire according to claim 1 , wherein the communication device is embedded in the sidewall portion of the first half portion, further to the tire width direction outer side than the carcass body portion and further to the tire width direction inner side than the first carcass foldback portion.", "7 . The tire according to claim 2 , wherein the communication device is embedded in the sidewall portion of the first half portion, further to the tire width direction outer side than the first carcass foldback portion.", "8 . The tire according to claim 2 , wherein the communication device is embedded in the sidewall portion of the first half portion, further to the tire width direction inner side than the carcass body portion.", "9 . The tire according to claim 2 , wherein the communication device is embedded in the sidewall portion of the first half portion, further to the tire width direction outer side than the carcass body portion and further to the tire width direction inner side than the first carcass foldback portion.", "10 . The tire according to claim 3 , wherein the communication device is embedded in the sidewall portion of the first half portion, further to the tire width direction outer side than the first carcass foldback portion.", "11 . The tire according to claim 3 , wherein the communication device is embedded in the sidewall portion of the first half portion, further to the tire width direction inner side than the carcass body portion.", "12 . The tire according to claim 3 , wherein the communication device is embedded in the sidewall portion of the first half portion, further to the tire width direction outer side than the carcass body portion and further to the tire width direction inner side than the first carcass foldback portion."], "bibtex": "@patent{20240262132,\n    title = {TIRE},\n    number = {20240262132},\n    year = {2024},\n    note = {File: US20240262132A1-20240808.XML}\n    }", "classification": "B60C908FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240262133", "filename": "US20240262133A1-20240808.XML", "abstract": "A pneumatic tire that is mounted on a vehicle in a specified direction and includes a tread rubber on a tread. The tread rubber has a plurality of main grooves extending along a tire circumferential direction, a pair of shoulder blocks that are defined by the main grooves and arranged on outer sides in a tire axial direction, and center blocks located between the pair of shoulder blocks. The center blocks are ribbed blocks that are continuous in the tire circumferential direction, and the tread rubber has a storage modulus at −25° C. (−25° C. E′) of 60 MPa or more and 150 MPa or less.", "detailed_description": ["Embodiments of a pneumatic tire according to the present invention will be described in detail with reference to the drawings. The embodiments described below are merely an example, and the present invention is not limited to the embodiments. In addition, selective combinations of components of the embodiments described below are included in the invention.", "", "FIG.1is a perspective view showing a pneumatic tire1according to an embodiment.FIG.1also shows an internal structure of the pneumatic tire1. As shown inFIG.1, the pneumatic tire1includes a tread10that is a part contacting a road surface, a pair of sidewalls12arranged on both sides of the tread10, a pair of beads14arranged on the inside of the sidewalls12in a tire radial direction, a carcass15hung between the pair of beads14, and an inner liner16located on the inside of the carcass15in the tire radial direction.", "", "The pneumatic tire1is a tire mounted on a vehicle in a specified direction. Thus, on the right and left sides of the vehicle, the pneumatic tires1are mounted in opposite directions. The tread10has an asymmetrical tread pattern with respect to a tire equator CL (seeFIG.2). The equator CL is an imaginary line extending along a tire circumferential direction at the center of the tread10in a tire axial direction. Hereinafter, the terms “right” and “left” will be used for convenience of explanation. These term mean right and left in the traveling direction of the vehicle on which the pneumatic tire1is mounted.", "", "The tread10is made of tread rubber11. In the present embodiment, the tread10has a main groove30(center main groove) formed on the tire equator CL and a pair of main grooves31and32(shoulder main grooves). The three main grooves30,31, and32are formed straight along the tire circumferential direction without being curved in the tire axial direction.", "", "The tread10has a center block40(first center block) defined by the main grooves30and31, and a center block50(second center block) defined by the main grooves30and32. The tread10also has a shoulder block60(first shoulder block) located to face the first center block40in the tire axial direction with the shoulder main groove31in between, and a shoulder block70(second shoulder block) located to face the second center block50in the tire axial direction with the shoulder main groove32in between. The blocks are formed straight along the tire circumferential direction. Each of the blocks is a portion that rises outward in the tire radial direction from a position corresponding to the bottom of the main grooves, and is also referred to as a land.", "", "The bead14is a portion that is located on the inside of the sidewall12in the tire radial direction and fixed to a wheel rim. The bead14has a bead core17and bead filler18. The bead core17is an annular member composed of a steel bead wire and extends around the entire circumference of the tire in the circumferential direction. The bead core17is embedded in the bead14. The bead filler18is an annular hard rubber member that has a tapered tip extending outward in the tire radial direction and extends around the entire circumference of the tire.", "", "The carcass15is hung between the pair of beads14. It is folded around the bead core17and locked in place. The carcass15includes carcass cords made of organic fibers and a topping rubber. The carcass cords are arranged at substantially right angles (for example, 80° to 90°) to the tire circumferential direction. The organic fibers used for the carcass cords include, for example, polyester fiber, rayon fiber, aramid fiber, and nylon fiber.", "", "The inner liner16covers an inner surface of the tire between the pair of beads14. The inner liner16is made of air permeation resistant rubber and serves to maintain the air pressure of the pneumatic tire1.", "", "The pneumatic tire1further includes a belt19located on the outside of the carcass15in the tire radial direction, a cap ply22that covers the entire outside of the belt19in the tire radial direction, and an edge ply23located on the outside of the cap ply22in the tire radial direction and that covers both ends of the belt19in the tire axial direction. The cap ply22and the edge ply23serve to reinforce the belt19.", "", "The belt19is provided on the outer circumferential side of a top of the carcass15so as to overlap an outer circumferential surface of the carcass15. The belt19is composed of belt plies that are rubber-coated cords arranged in a direction oblique to the tire circumferential direction. The material of the cords of the belt19is not particularly limited, and organic fibers, such as polyester, rayon, nylon, and aramid, or metals, such as steel, may be used. In the present embodiment, the belt19is composed of two belt plies including steel cords. The number of belt plies is not particularly limited, and one or three or more belt plies may be used.", "", "Hereinafter, a tire tread rubber composition (hereinafter simply referred to as a rubber composition) constituting the tread rubber11will be explained in detail.", "", "The rubber composition of the present invention has a storage modulus at −25° C. (−25° C. E′) of 60 MPa or more and 150 MPa or less. When −25° C. E′ is within this range, using that rubber composition for the tread rubber11having a tread pattern described below makes it possible to achieve both wet performance and snow performance in a well-balanced manner. In other words, when −25° C. E′ is less than 60 MPa, the grip force with the road surface will decrease, and wet performance will deteriorate. In addition, when −25° C. E′ is more than 150 MPa, snow performance will deteriorate. In the present invention, −25° C. E′ is a value obtained by measuring the rubber composition which has been subjected to a vulcanization process, by using a method described in examples, at a temperature of −25° C., initial strain of 10%, dynamic strain of 1%, and frequency of 10 Hz.", "", "The lower limit of −25° C. E′ of the rubber composition may be 60 MPa, preferably 70 MPa, and more preferably 80 MPa. Further, the upper limit of −25° C. E′ of the rubber composition may be 150 MPa, preferably 140 MPa, and more preferably 130 MPa. By setting the upper and lower limits in this way, it becomes easy to achieve both wet performance and snow performance.", "", "The rubber composition includes a rubber component containing styrene-butadiene-based rubber and isoprene-based rubber. The rubber composition containing these two types of rubber can achieve improved workability as well as exhibit the advantageous effects of the present invention.", "", "The styrene-butadiene-based rubber is not particularly limited as long as it is rubber containing styrene units and butadiene units, and may be, for example, emulsion-polymerized styrene-butadiene rubber (E-SBR) and solution-polymerized styrene-butadiene rubber (S-SBR). In the styrene-butadiene-based rubber, the total content of styrene units and butadiene units in 100 parts by mass of rubber may be, for example, 95 parts by mass or more, 98 parts by mass or more, or 100 parts by mass. Although one type of the styrene-butadiene-based rubbers may be used alone, it is preferable to use two or more types in combination.", "", "Although the styrene-butadiene-based rubber may be unmodified SBR or may be modified SBR, it is preferable that it contains modified SBR. By containing modified SBR, it is possible to reduce rolling resistance and achieve good fuel economy. In the present specification, a “modified” rubber component refers to a rubber component having a functional group reactive with silica, while an “unmodified” rubber component refers to a rubber component having no functional group reactive with silica. The functional group reactive with silica includes, for example, a hydroxyl group, amino group, carboxyl group, alkoxy group, alkoxysilyl group, and epoxy group. The functional group reactive with silica may be introduced to the molecular end or into the molecular chain.", "", "As the styrene-butadiene-based rubber, for example, SBRs manufactured and sold by Sumitomo Chemical Company Limited, ENEOS Material Corporation, Asahi Kasei Corp., Zeon Corporation may be used.", "", "In the above rubber composition, the content of styrene-butadiene-based rubber in 100 parts by mass of the rubber component is preferably 30 parts by mass or more, more preferably 40 parts by mass or more, and even more preferably 50 parts by mass or more. Good steering stability can be obtained by setting the content of styrene-butadiene-based rubber to 30 parts by mass or more. In addition, the content of styrene-butadiene-based rubber is preferably 80 parts by mass or less. Although there is a concern that workability may deteriorate when a large amount of styrene-butadiene-based rubber is used, such deterioration can be reduced by controlling the content of styrene-butadiene-based rubber to 80 parts by mass or less. Thus, a suitable range for the content of the styrene-butadiene-based rubber is, for example, 30 parts by mass or more and 80 parts by mass or less.", "", "The glass transition temperature (Tg) of styrene-butadiene-based rubber is preferably −70° C. or more and −20° C. or less because the advantageous effects of the present invention can be obtained satisfactorily within this range. Here, the glass transition temperature of styrene-butadiene-based rubber is measured by using the differential scanning calorimetry (DSC) method in accordance with JIS K7121, at a temperature rising rate of 20° C./min (measurement temperature range: −150° C. to 50° C.).", "", "Although rubbers commonly used in the tire industry, such as isoprene rubber (IR) and natural rubber, may be used as the isoprene-based rubber, natural rubber is more preferable from the viewpoint of improving snow performance. Natural rubber includes not only unmodified natural rubber (NR) but also modified natural rubber, such as epoxidized natural rubber (ENR), hydrogenated natural rubber (HNR), deproteinized natural rubber (DPNR), high purity natural rubber (UPNR), and grafted natural rubber. These rubbers may be used alone or in combination of two or more.", "", "In the above rubber composition, the content of isoprene-based rubber in 100 mass parts of the rubber component is preferably 15 parts by mass or more, more preferably 20 parts by mass or more, and even more preferably 25 parts by mass or more.", "", "In addition to the styrene-butadiene-based rubber and the isoprene-based rubber, the rubber component may include other rubber components. The other rubber components include, for example, butadiene-based rubber (BR), ethylene propylene diene rubber (EPDM), chloroprene rubber (CR), acrylonitrile butadiene rubber (NBR), butyl rubber (IIR), and other diene rubbers. These rubber components may be used alone or in combination of two or more.", "", "The butadiene-based rubber (BR) is not particularly limited as long as it is a polymer containing butadiene units as its main unit. For example, BR with high cis content, BR with low cis content, and the like may be used. They may be used alone or in combination of two or more.", "", "In the present embodiment, carbon black and silica are used as reinforcing fillers.", "", "The carbon black is not limited to any particular type, and a variety of known types of carbon black may be used. For example, it is preferable to use carbon black having a nitrogen adsorption specific surface area (N2SA) (JIS K6217-2) of 70 to 150 m2/g. Specifically, carbon black of SAF class (N100 series), ISAF class (N200 series), and HAF class (N300 series) may be used. Carbon black in these grades may be used alone or in combination of two or more.", "", "The blending amount of carbon black is preferably less than 10 parts by mass, and more preferably less than 8 parts by mass, with respect to 100 parts by mass of the rubber component. By reducing the blending amount of carbon black, it is possible to reduce the hardness of the rubber composition and improve noise performance. The lower limit of the blending amount of carbon black is, for example, more than 2 parts by mass. Thus, an example of a suitable range for the blending amount of carbon black is more than 2 parts by mass and less than 10 parts by mass, and more preferably more than 2 parts by mass and less than 8 parts by mass.", "", "The silica is not limited to any particular type, and, for example, wet silica, such as wet precipitation silica and wet gel silica, may be used. The BET specific surface area of silica (measured according to the BET method described in JIS K6430) is not particularly limited, and may be, for example, 90 to 250 m2/g or 150 to 220 m2/g.", "", "The blending amount of silica is preferably more than 60 parts by mass, more preferably 65 parts by mass or more, with respect to 100 parts by mass of the rubber component. Wet performance is improved by setting the blending amount of silica to be more than 60 parts by mass. The blending amount of silica is preferably less than 90 parts by mass, and more preferably 85 parts by mass or less. Rolling resistance is reduced by setting the blending amount of silica to be less than 90 parts by mass. Thus, a suitable range for the blending amount of silica is, for example, more than 60 parts by mass and less than 90 parts by mass.", "", "In addition to the above-mentioned components, the rubber composition according to the present embodiment may contain various additives commonly used in rubber compositions for tire treads, such as, for example, silane coupling agents, stearic acid, zinc oxide, waxes, anti-aging agents, oils, vulcanization accelerators, and vulcanizing agents.", "", "Known silane coupling agents, such as sulfide silane and mercaptosilane, may be used as the silane coupling agents. Although the blending amount of the silane coupling agent is not particularly limited, it is preferably 2 parts by mass or more and 20 parts by mass or less of the blending amount of silica, and more preferably 5 parts by mass or more and 15 parts by mass or less of the blending amount of silica.", "", "Various oils that are commonly blended into a rubber composition may be used as the oils. For example, at least one mineral oil selected from a group consisting of paraffin oil, naphthenic oil, and aromatic oil may be used. The content of oil is not particularly limited, and may be, for example, 40 parts by mass or less, or 30 parts by mass or less with respect to 100 parts by mass of the rubber component.", "", "Sulfur is preferably used as the vulcanizing agent. The blending amount of the vulcanizing agent is not particularly limited and may be, for example, 0.1 parts by mass or more and 5 parts by mass or less, or 0.5 parts by mass or more and 3 parts by mass or less, with respect to 100 parts by mass of the rubber component.", "", "Various types of vulcanization accelerators, such as sulfenamide type, thiuram type, thiazole type, and guanidine type, may be used as the vulcanization accelerator. These vulcanization accelerators may be used alone or in combination of two or more. The blending amount of the vulcanization accelerator is not particularly limited and may be, for example, 0.1 parts by mass or more and 5 parts by mass or less, or 0.5 parts by mass or more and 3 parts by mass or less, with respect to 100 parts by mass of the rubber component.", "", "The rubber composition according to the present embodiment can be produced by kneading according to a conventional method by means of a commonly used mixer, such as a Banbury mixer, a kneader, or a roll. Specifically, for example, in the first mixing stage (non-productive kneading step), additives other than the vulcanizing agent and the vulcanization accelerator are added and mixed into the rubber component together with carbon black and silica. Then, in the final mixing stage (productive kneading step), the vulcanizing agent and the vulcanization accelerator may be added and mixed with the resulting mixture from the first mixing step to thereby prepare an unvulcanized rubber composition.", "", "The non-productive kneading step may be performed as a single mixing step, or may be divided into a plurality of mixing steps in which mixing and discharging are repeated. For example, the non-productive kneading step may include a first non-productive kneading step in which the entire amount of the rubber component and carbon black is mixed with part of silica and the silane coupling agent, and a second non-productive kneading step in which part of silica and the silane coupling agent and the entire amount of zinc oxide and anti-aging agent are mixed into the mixture from the first non-productive kneading step. By carrying out the mixing process in the plurality of steps, it is possible to form a uniform chemical bond between the fillers and the polymer.", "", "Hereinafter, the tread pattern of the pneumatic tire1will be described in detail with reference toFIG.2.FIG.2is a plan view showing the pneumatic tire1(tread10).", "", "As shown inFIG.2, the tread10has an asymmetrical tread pattern with respect to a tire equator CL. Hereinafter, an area closer to a ground contact end E1than the tire equator CL will be referred to as a first area10A, and an area closer to a ground contact end E2than the tire equator CL will be referred to as a second area10B. In the present specification, the “ground contact ends E1and E2” are defined as both ends of an area of the tire that contacts a flat road surface (ground contact area) in the tire axial direction when the unused pneumatic tire1is mounted on a regular rim and inflated to a regular internal pressure and a predetermined load is applied thereto. In the case of a passenger car tire, the predetermined load is a load equivalent to 88% of a regular load. The tread pattern of the pneumatic tire1exhibits the advantageous effects of the present invention when the tire is mounted on the vehicle such that the first region10A is located on the inner side of the vehicle and the second region10B is located on the outer side of the vehicle.", "", "The tread10has the center main groove30formed on the tire equator CL, the shoulder main groove31formed between the tire equator CL and the ground contact end E1on the inner side of the vehicle, the shoulder main groove32formed between the tire equator CL and the ground contact end E2on the outer side of the vehicle, and a plurality of blocks defined by the three main grooves30,31, and32. The number of main grooves is not limited to three, and may be two, or four or more.", "", "The shoulder main grooves31and32are preferably formed at the same distance from the tire equator CL (center main groove30). This makes it possible to achieve good rigidity balance between the left and right regions that have the tire equator CL as a boundary, thereby exhibiting the advantageous effects of the present invention more clearly.", "", "The total width of the three main grooves30,31, and32is preferably 3% or more, more preferably 5% or more, and even more preferably 8% or more of the length from the ground contact end E1to the ground contact end E2along the tire axial direction (hereinafter referred to as “tire ground contact width”). This improves drainage performance and enhances wet performance significantly. Further, the total width of the three main grooves30,31, and32is preferably 30% or less, more preferably 28% or less, and even more preferably 25% or less of the tire ground contact width. This ensures excellent steering stability. Thus, a suitable range for the total width of the three main grooves30,31, and32is, for example, 5% or more and 30% or less of the tire ground contact width. Further, when more emphasis is placed on improving wet performance, the total width of the three main grooves30,31, and32may be 10% or more and 30% or less of the tire ground contact width. In the present specification, the width of the groove means the width of the groove on the profile surface along the ground contact surface of the tread10, unless otherwise specified.", "", "The width of the shoulder main grooves31and32is preferably greater than the width of the center main groove30formed on the tire equator CL. This improves drainage performance and enhances wet performance. The width of the center main groove30is, for example, 8 mm or more and 14 mm or less, and the width of the shoulder main grooves31and32is, for example, 9 mm or more and 15 mm or less. The depth of the three main grooves30,31, and32is not particularly limited, and is, for example, 7 mm or more and 15 mm or less.", "", "At least one of the three main grooves30,31, and32is typically provided with a wear indicator (not shown). The wear indicator is a protrusion located at the bottom of the groove and serves as an index for checking the wear level of the tread rubber.", "", "Walls of the three main grooves30,31, and32are inclined such that the groove width gradually becomes narrower toward the groove bottom. The walls of the main grooves constitute the side walls of the blocks. Therefore, in other words, the side walls of the block are inclined such that the width of the block becomes wider as the distance from the ground contact surface increases.", "", "The tread10has the first center block40defined by the main grooves30and31and the second center block50defined by the main grooves30and32. The tread10also includes the first shoulder block60located to face the first center block40in the tire axial direction with the shoulder main groove31in between, and the second shoulder block70located to face the second center block50in the tire axial direction tire with the shoulder main groove32in between.", "", "The first center block40and the second center block50are ribbed blocks that are continuous in the tire circumferential direction. In the present specification, the “ribbed block” means a block without a groove having a width greater than 2 mm. By adopting the ribbed blocks continuous in the tire circumferential direction as the first center block40and the second center block50, the rigidity of the tread10is improved. As a result, wet performance and snow performance can be improved.", "", "If wide grooves are present in the first center block40and the second center block50, water flowing in the main grooves30,31, and32enters the grooves formed in the first center block40and the second center block50, thereby generating a vortex in the water flowing in the main grooves30,31, and32. This vortex may reduce the speed of water flow in the main grooves30,31, and32, leading to degradation of drainage performance. For the pneumatic tire1of the present embodiment, such wide grooves are not formed in the first center block40or the second center block50. Thus, a vortex is less likely to be generated in the water flowing in the main grooves30,31, and32. Wet performance can thus be improved.", "", "The first center block40and the second center block50are separated by the center main groove30. Further, the first center block40is separated from the first shoulder block60by the shoulder main groove31, and the second center block50is separated from the second shoulder block70by the shoulder main groove32. In the present embodiment, the first center block40and the second center block50have the same width. Further, the first shoulder block60and the second shoulder block70have the same width. The width of the first shoulder block60and the second shoulder block70is formed to be wider than that of the first center block40and the second center block50. The pneumatic tire1has excellent performance not only on dry roads but also on wet roads and snowy and icy roads. It is thus suitable as an all-season tire.", "", "Hereinafter, the center blocks40and50and the shoulder blocks60and70that constitute the tread10will be explained in more detail with reference toFIG.2."], "claims": ["the tread rubber comprises: a plurality of main grooves that extend along a tire circumferential direction, a pair of shoulder blocks that are defined by the main grooves and arranged on outer sides in a tire axial direction, and a center block that is located between the pair of shoulder blocks, the center block is a ribbed block continuous in the tire circumferential direction, wherein the tread rubber has a storage modulus at −25° C. (−25° C. E′) of 60 MPa or more and 150 MPa or less.", "2 . The pneumatic tire according to claim 1 , wherein a total width of the main grooves is greater than 3% and less than or equal to 30% of a ground contact width of the tire.", "the center block has a plurality of sipes formed therein at intervals in the tire circumferential direction, and each sipe of the plurality of sipes crosses the center block and has a curved portion that protrudes to one side in the tire circumferential direction relative to positions of both ends of the sipe in the tire circumferential direction in a plan view of the center block.", "the center block has a plurality of sipes formed therein at intervals in the tire circumferential direction, and each sipe of the plurality of sipes is generally S-shaped in a plan view of the center block.", "the main grooves include: a pair of shoulder main groove that are arranged on the outer sides in the tire axial direction, and a center main groove that is located between the pair of shoulder blocks, and the center block includes: a first center block that is defined by the shoulder main groove and the center main groove and is located on an inner side of the vehicle relative to a tire equator, and a second center block that is defined by the shoulder main groove and the center main groove and is located on an outer side of the vehicle relative to the tire equator, and a plurality of sipes formed on the center block, wherein a number of sipes crossing the second center block is smaller than a number of sipes crossing the first center block.", "the shoulder blocks include: a first shoulder block that is located on an inner side of the vehicle relative to a tire equator, and a second shoulder block that is located on an outer side of the vehicle relative to the tire equator, the second shoulder block has a lateral groove extending in the tire axial direction, and the lateral groove is connected to the shoulder main groove via a sipe."], "bibtex": "@patent{20240262133,\n    title = {PNEUMATIC TIRE},\n    number = {20240262133},\n    year = {2024},\n    note = {File: US20240262133A1-20240808.XML}\n    }", "classification": "B60C1103FI"}, {"title": "TIRE", "doc_number": "20240262134", "filename": "US20240262134A1-20240808.XML", "abstract": "A tire includes a pair of bead cores, a carcass layer extended across the bead cores, a belt layer disposed on an outer side of the carcass layer in a radial direction, and a tread portion. The tire outer diameter OD (mm) is in a range 200≤OD≤660. The total tire width SW (mm) is in a range 100≤SW≤400. A groove area ratio Aa (%) of the tread portion is in a range 0.008≤Aa/OD≤0.150. When a region of 48×(OD/SW){circumflex over ( )}(1/5) (%) from a maximum ground contact width end portion on a tire inner side when the tire is mounted on a vehicle is defined as a tire inner region of the tread portion, a groove area ratio Ai (%) of the tire inner region and a groove area ratio Ao (%) of a tire outer region as a region other than the tire inner region have a relationship Ai<Ao.", "detailed_description": ["Embodiments of the technology will be described in detail below with reference to the drawings. Note that the technology is not limited to the embodiments. Additionally, constituents of the embodiments include constituents that are substitutable and are obviously substitutes while maintaining consistency with the embodiments of the technology. Additionally, a plurality of modified examples described in the embodiments can be combined in a discretionary manner within the scope apparent to one skilled in the art."], "claims": ["1 - 9 . (canceled)", "a pair of bead cores; a carcass layer extended across the bead cores; a belt layer disposed on an outer side of the carcass layer in a radial direction; and a tread portion; a tire outer diameter OD (mm) being in a range 200≤OD≤660, a total tire width SW (mm) being in a range 100≤SW≤400, a groove area ratio Aa (%) of the tread portion being in a range 0.008≤Aa/OD≤0.150, and when a region of 48×(OD/SW){circumflex over ( )}(1/5) (%) from a maximum ground contact width end portion on a tire inner side when the tire is mounted on a vehicle is defined as a tire inner region of the tread portion, a groove area ratio Ai (%) of the tire inner region and a groove area ratio Ao (%) of a tire outer region as a region other than the tire inner region have a relationship Ai<Ao.", "a groove area ratio Ai30 in a region from a ground contact edge on a tire inner side of the tread portion to 30% of a ground contact width is in a range 0≤Ai30≤40, and a groove area ratio Ao30 in a region from a ground contact edge on a tire outer side of the tread portion to 30% of a ground contact width is in a range 5≤Ao30≤50.", "12 . The tire according to claim 11 , wherein a ratio Ao30/Ai30 of the groove area ratio Ai30 to the groove area ratio Ao30 is in a range 0.1≤Ai30/Ao30≤1.", "13 . The tire according to claim 10 , wherein a maximum groove depth G max (mm) of the entire tread portion satisfies 0.006≤G max/OD≤0.083.", "14 . The tire according to claim 10 , wherein a ratio Ai/Ao of the groove area ratio Ai to the groove area ratio Ao satisfies 0.05×(OD/650)<Ai/Ao<1.", "15 . The tire according to claim 10 , wherein a ratio Gi/Go of a maximum groove depth Gi (mm) of the tire inner region to a maximum groove depth Go (mm) of the tire outer region satisfies 0.4≤Gi/Go≤1.6.", "the tread portion has a circumferential main groove extending in a tire circumferential direction, the circumferential main groove has a groove width of 3 mm or more, and a projected area C (mm", "17 . The tire according to claim 10 , wherein an average pitch number Po (piece) (Po is a natural number) within a tire ground contact length in the tire outer region satisfies OD/200≤Po≤OD/50 with respect to the tire outer diameter OD.", "18 . The tire according to claim 10 , wherein a ratio Pi/Po between an average pitch number Pi (piece) within a tire ground contact length in the tire inner region and an average pitch number Po (piece) in the tire ground contact length in the tire outer region satisfies 0.7≤Pi/Po≤1.5.", "19 . The tire according to claim 12 , wherein a maximum groove depth G max (mm) of the entire tread portion satisfies 0.006≤G max/OD≤0.083.", "20 . The tire according to claim 19 , wherein a ratio Ai/Ao of the groove area ratio Ai to the groove area ratio Ao satisfies 0.05×(OD/650)<Ai/Ao<1.", "21 . The tire according to claim 20 , wherein a ratio Gi/Go of a maximum groove depth Gi (mm) of the tire inner region to a maximum groove depth Go (mm) of the tire outer region satisfies 0.4≤Gi/Go≤1.6.", "the tread portion has a circumferential main groove extending in a tire circumferential direction, the circumferential main groove has a groove width of 3 mm or more, and a projected area C (mm", "23 . The tire according to claim 22 , wherein an average pitch number Po (piece) (Po is a natural number) within a tire ground contact length in the tire outer region satisfies OD/200≤Po≤OD/50 with respect to the tire outer diameter OD.", "24 . The tire according to claim 23 , wherein a ratio Pi/Po between an average pitch number Pi (piece) within a tire ground contact length in the tire inner region and an average pitch number Po (piece) in the tire ground contact length in the tire outer region satisfies 0.7≤Pi/Po≤1.5."], "bibtex": "@patent{20240262134,\n    title = {TIRE},\n    number = {20240262134},\n    year = {2024},\n    note = {File: US20240262134A1-20240808.XML}\n    }", "classification": "B60C1113FI"}, {"title": "TIRE", "doc_number": "20240262135", "filename": "US20240262135A1-20240808.XML", "abstract": "Provided in a tire are a second land portion defined by a shoulder main groove and a center main groove extending in a circumferential direction, and sets of first and second lug grooves that extend in the second land portion in a width direction and are disposed alternately in the circumferential direction. The first lug groove opens to the shoulder main groove and terminates inside the second land portion in which the groove width on one end side is formed wider than the groove width on the other end side, and the second lug groove opens to the center main groove and terminates inside the second land portion in which the groove width on one end side is formed narrower than the groove width on the other end side and the one end side of the second lug groove that is formed narrower is closed at ground contact.", "detailed_description": ["Embodiments of the present technology will be described in detail below with reference to the drawings. However, the technology is not limited to the embodiment. Constituents of the embodiment include elements that are essentially identical or that can be substituted or easily conceived by one skilled in the art.", "", "A pneumatic tire according to the present embodiment will be described. In the following description, a tire radial direction refers to a direction orthogonal to a rotation axis of the tire, an inner side in the tire radial direction refers to a side toward the rotation axis in the tire radial direction, and an outer side in the tire radial direction refers to a side away from the rotation axis in the tire radial direction. In addition, a tire circumferential direction refers to a circumferential direction about the rotation axis as a center axis. Moreover, a tire width direction refers to a direction parallel to the rotation axis, an inner side in the tire width direction refers to a side toward a tire equatorial plane (tire equator line) in the tire width direction, and an outer side in the tire width direction refers to a side away from the tire equatorial plane in the tire width direction. Note that “tire equatorial plane” refers to the plane orthogonal to the rotation axis of the pneumatic tire, the plane passing through the center of the tire width.", "", "FIG.1is a plan view of a tread surface of the pneumatic tire according to the present embodiment. InFIG.1, a reference sign CL denotes the tire equatorial plane, and reference signs T denote tire ground contact edges, respectively. Additionally, a pneumatic tire1according to the present embodiment (hereinafter, also referred to simply as “tire1”) is specified in the mounting direction with respect to the vehicle, and in the example ofFIG.1, it has a left-right asymmetric tread pattern centered on the tire equatorial plane CL. Note that inFIG.1, the region illustrated on the outer side in the tire width direction of the ground contact edge T includes a so-called sidewall portion. The ground contact edge Tis defined as a maximum width position in the tire axial direction of the contact surface between the tire1and a flat plate when the tire1is mounted on a specified rim, inflated to a specified internal pressure, placed perpendicular to the flat plate in a static state, and loaded with a load corresponding to a specified load.", "", "“Specified rim” refers to an “applicable rim” defined by the Japan Automobile Tyre Manufacturers Association Inc. (JATMA), a “Design Rim” defined by the Tire and Rim Association, Inc. (TRA), or a “Measuring Rim” defined by the European Tyre and Rim Technical Organisation (ETRTO). Additionally, the specified internal pressure refers to a “maximum air pressure” specified by JATMA, the maximum value in “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” specified by TRA, or “INFLATION PRESSURES” specified by ETRTO. Additionally, the specified load refers to a “maximum load capacity” specified by JATMA, the maximum value in “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” specified by TRA, or “LOAD CAPACITY” specified by ETRTO. However, in the case of JATMA, for a tire for a passenger vehicle, the specified internal pressure is an air pressure of 180 kPa, and the specified load is 88% of the maximum load capacity.", "", "A tread portion10of the tire1is made of a rubber material (tread rubber) and is exposed on the outermost side of the tire1in the tire radial direction, with the surface thereof constituting the contour of the tire1. The surface of the tread portion10forms a tread surface12that is a surface that comes into contact with the road surface when a vehicle (not illustrated) on which the tire1is mounted is driven.", "", "The tire1includes, in the tread surface12, a plurality of circumferential main grooves21to24extending in the tire circumferential direction, a plurality of land portions31to35defined by the circumferential main grooves21to24, a plurality of lug grooves311,321,322,331,341, and351disposed in each of the land portions31to35, and a plurality of sipes4disposed in each of the land portions31to35. Here, “circumferential main groove” refers to a groove extending in the tire circumferential direction on which a wear indicator must be provided as specified by JATMA and typically has a groove width of 5.0 mm or more and a groove depth of 6.5 mm or more. “Lug groove” refers to a lateral groove extending in a direction intersecting the circumferential main groove (tire width direction) and typically having a groove width of 1.0 mm or more and a groove depth of 3.0 mm or more. Further, “sipe” refers to a cut formed in the tread surface and typically has a sipe width of less than 1.0 mm and a sipe depth of 2.0 mm or more, such that the sipe is closed when the tire comes into contact with the ground. Accordingly, the tire1of the present embodiment is configured as a studless tire provided with the sipe4on the tread surface12.", "", "A plurality (four inFIG.1) of circumferential main grooves21to24that extend in the tire circumferential direction are provided on the tread surface12at predetermined intervals in the tire width direction respectively. In the present embodiment, with the tire equatorial plane CL as the boundary, two circumferential main grooves21,22are provided on the inner side in the vehicle width direction, and two circumferential main grooves23,24are provided on the outer side in the vehicle width direction, respectively, as illustrated inFIG.1. Here, the inner side in the vehicle width direction and the outer side in the vehicle width direction are specified as orientations with respect to the vehicle width direction when the tire1is mounted on the vehicle. Additionally, two circumferential main grooves21,24on the outermost side in the tire width direction are defined as shoulder main grooves, and two circumferential main grooves22,23on the inner side in the tire width direction are defined as center main grooves.", "", "In the example ofFIG.1, the shoulder main grooves21,24each have straight shapes. In contrast, the center main grooves22,23oscillate in the tire width direction while extending in the tire circumferential direction to form zigzag shapes. In particular, the center main groove22on the inner side in the vehicle width direction has a groove wall on the tire equatorial plane CL side having a straight shape, while a groove wall on the ground contact edge T side oscillates in the tire width direction while extending in the tire circumferential direction to form a zigzag shape. Note that the number of circumferential main grooves is not limited to the above, and three or five or more circumferential main grooves may be disposed on the tread surface12.", "", "A plurality of (five inFIG.1) land portions31to35extending in the tire circumferential direction are defined and formed by the four circumferential main grooves21to24on the tread surface12. In the present embodiment, the land portions31,35defined on the outer side in the tire width direction by the shoulder main grooves21,24respectively are defined as shoulder land portions. Furthermore, the land portions32,34defined on the inner side in the tire width direction by the shoulder main grooves21,24are defined as second land portions. The second land portions32,34are adjacent to the shoulder land portions31,35with the above-described circumferential main grooves21,24disposed respectively therebetween. Additionally, a land portion33defined between the center main grooves22,23is defined as a center land portion. The center land portion33is provided extending on the tire equatorial plane CL.", "", "Note that in the example ofFIG.1, only the single center land portion33exists, but in a configuration with five or more circumferential main grooves, a plurality of center land portions are formed. Furthermore, in a configuration with three circumferential main grooves, the center land portion may also serve as the second land portion.", "", "The left and right shoulder land portions31,35include a plurality of lug grooves311,351, respectively. Each of the lug grooves311,351has one end opening to the shoulder main grooves21,24, respectively, and extends in the outer side in the tire width direction, and has an other end opening in a region across the ground contact edge T. A plurality of lug grooves311,351are provided repeatedly in the tire circumferential direction in the shoulder land portions31,35, respectively. Accordingly, the shoulder land portions31,35are partitioned into a plurality of blocks B (shoulder blocks) by the lug grooves311,351, respectively. The blocks B include circumferential narrow grooves312,352each extending in the tire circumferential direction, and a plurality of sipes4extending in the tire width direction. In the example ofFIG.1, the circumferential narrow grooves312,352are formed in a straight shape.", "", "Additionally, the second land portion32on the inner side in the vehicle width direction includes two types of a plurality of sets of lug grooves321,322, and a plurality of sipes4extending in the tire width direction. The lug groove321(first lug groove) has one end facing one end of the above-mentioned lug groove311and opening to the shoulder main groove21, and an other end terminating inside the second land portion32. Further, the lug groove322(second lug groove) has one end opening to the center main groove22and an other end terminating inside the second land portion32. In the example of inFIG.1, one end of the lug groove322opens to a corner portion of the center main groove22having a zigzag shape that projects on the ground contact edge T side. Therefore, the lug grooves321,322have a semi-closed structure that does not cross the second land portion32. Additionally, the lug grooves321,322are disposed in a staggered manner (alternately) in the tire circumferential direction, and each extend so as to be inclined in opposite directions with respect to the tire circumferential direction, and overlap each other in the tire width direction. Accordingly, the second land portion32is formed as a rib R that is continuous in the tire circumferential direction without being divided in the tire circumferential direction by the lug grooves321,322.", "", "The center land portion33includes a plurality of lug grooves331. The lug groove331is formed extending in the tire width direction between the two center main grooves22,23, and both end portions are open to the center main grooves22,23, respectively. In the example of inFIG.1, one end of the lug groove331opens to a corner portion projecting on the tire equatorial plane CL side in the zigzag-shaped center main groove23, and extends along the extension direction of the short portion of the center main groove23. Further, the lug groove331is provided with respect to every other corner portion that forms the zigzag of the center main groove23. The center land portion33is partitioned into a plurality of blocks B by a plurality of lug grooves331, and a plurality of sipes4extending in the tire width direction are provided in each block B.", "", "The second land portion34on the outer side in the vehicle width direction includes a plurality of lug grooves341. The lug groove341is formed extending in the tire width direction between the adjacent center main groove23and a shoulder main groove24, and one end opens to the center main groove23, and an other end opens to the shoulder main groove24. In the example ofFIG.1, one end of the lug groove341opens to a corner portion projecting on the ground contact edge T side of the zigzag-shaped center main groove23, and an other end opens to the shoulder main groove24facing one end of the lug groove351described above. The second land portion34is partitioned into a plurality of blocks B by a plurality of lug grooves341. The blocks B include a circumferential narrow groove342and a plurality of sipes4each extending in the tire width direction. In the example ofFIG.1, the circumferential narrow groove342is formed in a zigzag shape that oscillates in the tire width direction while extending in the tire circumferential direction.", "", "Note that the pneumatic tire1according to the present embodiment has a meridian cross-section shape similar to that of a known pneumatic tire. Here, the meridian cross-section form of the pneumatic tire refers to the cross-sectional shape of the pneumatic tire as it appears on a plane normal to the tire equatorial plane CL. The tire1according to the present embodiment has a bead portion, a sidewall portion, a shoulder portion, and a tread portion10from the inner side to the outer side in the tire radial direction in a tire meridian cross-sectional view, not illustrated. Further, in the tire meridian cross-sectional view; for example, the tire1includes a carcass layer extending from the tread portion10to the bead portions on both sides and wound around a pair of bead cores, and a belt layer and a belt reinforcing layer provided in that order on the above-described carcass layer on the outer side in the tire radial direction.", "", "Incidentally, in the development of studless tires, in recent years, wet performance (drainage performance) is required in addition to performance on snow and performance on ice, and it is important to provide these performance on snow, performance on ice, and wet performance in a compatible manner. In general, it is effective to reduce the groove area of the tread pattern in improving performance on ice, while it is effective to increase the groove area of the tread pattern in improving performance on snow and wet performance. Therefore, there is a problem that it is difficult to provide performance on ice, performance on snow, and wet performance in a compatible manner. The pneumatic tire1according to the present embodiment employs the following configurations for providing performance on ice, performance on snow, and wet performance in a compatible manner.", "", "FIG.2is a plan view illustrating a second land portion of the tread pattern illustrated inFIG.1on the inner side in the vehicle width direction. As illustrated inFIG.2, the second land portion32on the inner side in the vehicle width direction includes two types of a plurality of lug grooves321,322. These two types of lug grooves321,322are lateral grooves extending in the tire width direction, and one lug groove321is defined as the first lug groove and the other lug groove322is defined as the second lug groove.", "", "As described above, the first lug groove321has one end opening to the shoulder main groove21(one circumferential main groove) and an other end terminating inside the second land portion32. The first lug groove321has a step shape in which the groove width is widened on one end side that opens to the shoulder main groove21. Specifically, the first lug groove321includes a broad width portion321A having a wider groove width on one end side that opens to the shoulder main groove21, and a narrow width portion321B having a narrower groove width than the broad width portion321A on the other end side that terminates, and the broad width portion321A and the narrow width portion321B are connected in a straight line.", "", "Additionally, each of the broad width portion321A and the narrow width portion321B is formed in a constant groove width, and a groove width change portion321C in which the groove width changes uniformly is provided between the broad width portion321A and the narrow width portion321B. In the groove width change portion321C, the length of the groove width change portion321C in the tire width direction with respect to the length of the first lug groove321in the tire width direction is set to 3% or more and 10% or less, which is not illustrated. In the present embodiment, one edge portion (upper side inFIG.2) of the first lug groove321has a linear shape, and the other edge portion (lower side inFIG.2) has a step shape. The groove width change portion321C forms a rising portion having a step shape, and an inclination angle φ of the rising portion is an obtuse angle (for example, 120° or more and 135° or less).", "", "In the present embodiment, by providing the broad width portion321A on one end side that opens to the shoulder main groove21, the drainage properties from the first lug groove321to the shoulder main groove21are improved, and thus the wet performance of the tire1can be improved. Furthermore, since the shoulder main groove21to which the broad width portion321A opens is formed in a straight shape, the drainage properties from the first lug groove321to the shoulder main groove21can be further improved.", "", "Additionally, the groove width Wa1 of the broad width portion321A (one end side) of the first lug groove321and the groove width Wa2 of the narrow width portion321B (other end side) satisfy the relationship 1.50≤Wa1/Wa2≤3.0. The groove widths Wa1, Wa2 are measured as a maximum value of the distance between the opposing groove walls in the groove opening portion in an unloaded state in which the tire1is mounted on a specified rim and inflated to a specified internal pressure.", "", "In this configuration, when 1.50>Wa1/Wa2, the drainage properties from the first lug groove321to the shoulder main groove21are not sufficient, and thus sufficient wet performance cannot be exhibited. In addition, when Wa1/Wa2>3.0, the rigidity of the land portion is decreased, and thus sufficient performance on ice cannot be exhibited. In contrast, this configuration satisfies 1.50≤Wa1/Wa2≤3.0, and thus performance on ice and wet performance can be improved, providing performance on ice and wet performance in a compatible manner.", "", "On the other hand, the second lug groove322has one end opening to the center main groove22(other circumferential main groove) and an other end terminating inside the second land portion32. The second lug groove322has a step shape having a narrow groove width at one end side that opens to the center main groove22, unlike the first lug groove321. Specifically, the second lug groove322includes a narrow width portion322A having a narrow groove width on one end side that opens to the center main groove22and a broad width portion322B having a wider groove width than the narrow width portion322A on an other end side that terminates, and the narrow width portion322A and the broad width portion322B are connected in a straight line.", "", "Additionally, each of the narrow width portion322A and the broad width portion322B is formed in a constant groove width, and a groove width change portion322C in which the groove width changes uniformly is provided between the narrow width portion322A and the broad width portion322B. In the groove width change portion322C, the length of the groove width change portion322C in the tire width direction with respect to the length of the second lug groove322in the tire width direction is set to 3% or more and 10% or less, which is not illustrated. In the present embodiment, one edge portion (lower side inFIG.2) of the second lug groove322has a linear shape, and the other edge portion (upper side inFIG.2) has a step shape. The groove width change portion322C forms a rising portion having a step shape, and the inclination angle φ of the rising portion is an obtuse angle (for example, 120° or more and 135° or less).", "", "Additionally, the second lug groove322is preferably formed with the groove width Wb1 of the narrow width portion322A (one end side) being 0.5 mm or more and 1.6 mm or less, and in the present embodiment, the groove width Wb1 is specified as 1.0 mm. Thus, the narrow width portion322A is configured to be closed when the tire comes into contact with the ground. According to this configuration, the narrow width portion322A is closed when the tire comes into contact with the ground, and thus snow column shear force is improved without missing snow taken in the second lug groove322, and thus performance on snow can be improved. Further, in the present embodiment, the center main groove22to which the narrow width portion322A opens is formed in a zigzag shape in which the groove wall on the opening side oscillates in the tire width direction while extending in the tire circumferential direction. Accordingly, since the groove width of the center main groove22changes, the length of the edge portion of the second land portion32on the inner side in the vehicle width direction increases, and thus the snow traction index STI is improved, and performance on snow can be further improved.", "", "Additionally, the groove width Wb1 of the narrow width portion322A (one end side) of the second lug groove322and the groove width Wb2 of the broad width portion322B (other end side) satisfy the relationship 0.20≤Wb1/Wb2≤0.75. The groove widths Wb1, Wb2 are also measured as a maximum value of the distance between the opposing groove walls in the groove opening portion in an unloaded state in which the tire1is mounted on a specified rim and inflated to a specified internal pressure.", "", "In this configuration, when 0.20>Wb1/Wb2, the amount of snow that can be taken into the second lug groove322is small, and the snow column shear force is not sufficiently improved, and thus the performance on snow cannot be sufficiently exhibited. Additionally, when Wb1/Wb2>0.75, the rigidity difference between the block central portion and the block edge portion increases, and thus ensuring the performance on ice is difficult due to the collapse of the block. In contrast, this configuration satisfies 0.20≤Wb1/Wb2≤0.75, and thus the rigidity difference between the block central portion and the block edge portion can be balanced, and performance on snow and performance on ice can be provided in a compatible manner.", "", "Additionally, the first lug groove321and the second lug groove322are disposed in a staggered manner (alternately) in the tire circumferential direction, and overlap each other in the tire width direction. Therefore, the first lug groove321and the second lug groove322can be disposed with a gap in the second land portion32on the inner side in the vehicle width direction without being connected to each other. Accordingly, rigidity of the land portion of the second land portion32can be improved and performance on ice can be improved. In the present embodiment, each groove width change portion321C,322C of the first lug groove321and the second lug groove322is disposed in a region32A where the first lug groove321and the second lug groove322overlap each other. The region32A is a region defined by the other end of the first lug groove321and the other end of the second lug groove322, and when the width of the region32A in the tire width direction is W2 and the maximum width in the tire width direction of the second land portion32on the inner side in the vehicle width direction is W1, the maximum width W1 and the width W2 satisfy the relationship 0.50≤W2/W1≤0.70.", "", "In general, rigidity of the land portion tends to decrease on the outer side (edge side) of the land portion in the tire width direction. In the present embodiment, each groove width change portion321C,322C is arranged in the overlapping region32A described above, and the maximum width W1 of the second land portion32and the width W2 of the region32A satisfy the relationship 0.50≤W2/W1≤0.70 so that a local bias in rigidity of the land portion can be reduced and the contact with the ground is improved, and thus performance on ice can be improved.", "", "Further, each of the first lug groove321and the second lug groove322is inclined and extends in the direction opposite to the tire circumferential direction. Specifically, the inclination angle θ1 of the first lug groove321with respect to the tire circumferential direction is within the range 95°≤θ1≤125°. Further, the inclination angle θ2 of the second lug groove322with respect to the tire circumferential direction is also within the range 95°≤θ2≤125°. In the example ofFIG.2, the inclination angle θ2 is formed larger than the inclination angle θ1, and the angle difference (θ2−θ1) is preferably within the range 5°≤θ2−θ1≤15°. The inclination angles θ1, θ2 of the first lug groove321and the second lug groove322are measured as angles formed by the groove center lines of the lug grooves and the tire circumferential direction. According to this configuration, the inclination angles θ1, θ2 of the first lug groove321and the second lug groove322can be made proper, and thus the snow traction index STI at other than 0°, for example, is improved in a well-balanced manner and performance on snow can be improved.", "", "Additionally, the first lug groove321and the second lug groove322each have a raised bottom portion having a groove bottom raised on the other end side that terminates. Specifically, the first lug groove321has a raised bottom portion321B1in the narrow width portion321B, and the second lug groove322has a raised bottom portion322B1in the broad width portion322B. These raised bottom portions321B1,322B1are portions formed with a relatively shallow groove depth from the tread surface12, and are set to 30% or more and 70% or less of the deepest groove depth. Additionally, the raised bottom portions321B1,322B1are formed along the tire width direction from the other end (tip) toward one end of the first lug groove321and the second lug groove322, respectively. In the present embodiment, the length La1 of the raised bottom portion321B1in the tire width direction and the length La of the first lug groove321in the tire width direction satisfy the relationship 0.30≤La1/La≤0.40, and the length Lb1 of the raised bottom portion322B1in the tire width direction and the length Lb of the second lug groove322in the tire width direction satisfy the relationship 0.30≤Lb1/Lb≤0.40.", "", "In this case, when the relationship between the lengths La1, Lb1 of the raised bottom portions321B1,322B1and the lengths La, Lb of the first lug groove321, the second lug groove322is less than 0.30, the rigidity of the land portion is relatively decreased, and thus performance on ice is decreased. In addition, when the relationship between the lengths La1, Lb1 of the raised bottom portions321B1,322B1and the lengths La, Lb of the first lug groove321, the second lug groove322is greater than 0.40, the amount of snow that can be taken into the first lug groove321and the second lug groove322is small, and the snow column shear force is not sufficiently improved, and thus the performance on snow cannot be sufficiently exhibited. According to this configuration, the above-described region32A where the groove widths of the first lug groove321and the second lug groove322change and rigidity of the land portion tends to decrease can be provided with the raised bottom portions321B1,322B1, respectively, and thus rigidity of the land portion is ensured and performance on ice can be improved. Furthermore, by sufficiently taking snow into the first lug groove321and the second lug groove322, the snow column shear force is improved and performance on snow can be improved.", "", "Further, in the present embodiment, the second land portion32on the inner side in the vehicle width direction includes a plurality of sipes4in the tread surface12. In the present embodiment, the plurality of sipes4are disposed parallel with the first lug groove321, and are inclined upward to the right in the drawing along with the first lug groove321.", "", "Here, among the plurality of sipes4, a pair of sipes adjacent to the broad width portion321A (one end side) of the first lug groove321in the tire circumferential direction is defined as first sipes41, and a pair of sipes adjacent to the narrow width portion322A (one end side) of the second lug groove in the tire circumferential direction are defined as second sipes42. In the present embodiment, the pair of first sipes41each have an end portion41A on the side toward the shoulder main groove21that terminates in the second land portion32. In contrast, the pair of second sipes42each have an end portion42B on the side toward the center main groove22that opens to the center main groove22.", "", "According to this configuration, the pair of first sipes41adjacent to the broad width portion321A of the first lug groove321having a wide groove width in the tire circumferential direction are terminated in the land portion without opening to the shoulder main groove21, so that rigidity of the land portion can be relatively increased. In addition, the pair of second sipes42adjacent to the narrow width portion322A of the second lug groove322having a narrow groove width in the tire circumferential direction are opened to the center main groove22, so that rigidity of the land portion can be relatively reduced. As a result, a local bias in rigidity of the land portion can be suppressed for the entire second land portion32and contact with the ground is improved, and thus performance on ice can be improved.", "", "Additionally, in the present embodiment, the second land portion32includes a plurality of separated portions32B where the plurality of sipes4(including the first sipe41and the second sipe42described above) are disposed being separated in the tire width direction. The separated portions32B are regions where the sipes4are disconnected continuously, and many of the separated portions32B are provided in the region32A where the first lug groove321and the second lug groove322overlap in the tire width direction.", "", "According to this configuration, the above-described region32A where the groove widths of the first lug groove321and the second lug groove322change and rigidity of the land portion tends to decrease can be provided with the separated portion32B in which the sipes4are disposed being separated, respectively, and thus rigidity of the land portion can be ensured and performance on ice can be improved.", "", "The tire1according to the present embodiment includes the second land portion32defined by the shoulder main groove21(one circumferential main groove) extending in the tire circumferential direction and the center main groove22(other circumferential main groove), and a plurality of sets of a first lug groove321and a second lug groove322that extend in the second land portion32in the tire width direction and are disposed alternately in the tire circumferential direction. The first lug groove321has one end that opens to the shoulder main groove21and an other end that terminates inside the second land portion32in which the groove width on one end side is formed wider than the groove width on the other end side, and the second lug groove322has one end that opens to the center main groove22and an other end that terminates inside the second land portion32in which the groove width on one end side is formed narrower than the groove width on the other end side and the narrow width portion322A of the second lug groove322that is formed narrow is closed at ground contact, and thus performance on snow and performance on ice and wet performance can be provided in a compatible manner.", "", "Next, another embodiment will be described.FIG.3is a plan view illustrating a tread surface of a pneumatic tire according to another embodiment. Components that are the same as those of the above-described embodiment have the same reference sign and the description thereof is omitted. In the above-described embodiment, the tire1has a configuration including four circumferential main grooves21to24extending in the tire circumferential direction in the tread surface12, but a difference in this another embodiment is that a pneumatic tire1A (hereinafter referred to simply as the tire1A) includes five circumferential main grooves21A to25A in the tread surface12A.", "", "Specifically, with the tire equatorial plane CL as the boundary, two circumferential main grooves21A,22A are provided on the inner side in the vehicle width direction, two circumferential main grooves23A,24A are provided on the outer side in the vehicle width direction, and one circumferential main groove25A is provided on the tire equatorial plane CL, respectively, as illustrated inFIG.3. Similar to the embodiment described above, the circumferential main grooves21A,24A on the outermost side in the tire width direction are defined as the shoulder main grooves, and the circumferential main grooves22A,23A on the inner side in the tire width direction of the shoulder main groove are defined as the second main grooves. Furthermore, the circumferential main groove25A is defined as the center main groove.", "", "In this embodiment, six land portions31to36extending in the tire circumferential direction are defined and formed by the five circumferential main grooves21A to25A in the tread surface12A. In this embodiment, the new center land portion36is formed in addition to the center land portion33by the two second main grooves22A,23A and the center main groove25A. The center land portion36includes a plurality of lug grooves361. The lug groove361is formed extending in the tire width direction between the second main groove22A and the center main groove25A, and both end portions are open to the second main groove22A and the center main groove25A, respectively. The center land portion36is partitioned into a plurality of blocks B by a plurality of lug grooves361, and a plurality of sipes4extending in the tire width direction are provided in each block B.", "", "This another embodiment also includes a plurality of sets of a first lug groove321and a second lug groove322each disposed alternately in the tire circumferential direction in the second land portion32on the inner side in the vehicle width direction defined by the shoulder main groove21A (one circumferential main groove) and the second main groove22A (other circumferential main groove). The first lug groove321has one end that opens to the shoulder main groove21A and an other end that terminates inside the second land portion32in which the groove width on one end side is formed wider than the groove width on the other end side, and the second lug groove322has one end that opens to the second main groove22A and an other end that terminates inside the second land portion32in which the groove width on one end side is formed narrower than the groove width on the other end side and the narrow width portion322A of the second lug groove322that is formed narrow is closed at ground contact, and thus performance on snow and performance on ice and wet performance can be provided in a compatible manner."], "claims": ["1 - 10 . (canceled)", "two circumferential main grooves that extend in a tire circumferential direction; a land portion defined by the circumferential main grooves; and a plurality of sets of a first lug groove and a second lug groove that extend in a direction intersecting the circumferential main grooves in the land portion and are alternately disposed in the tire circumferential direction, the first lug groove comprising one end that opens to one of the circumferential main grooves and an other end that terminates inside the land portion, a groove width on a side of the one end being formed wider than a groove width on a side of the other end, and the second lug groove comprising one end that opens to an other one of the circumferential main grooves and an other end that terminates inside the land portion, a groove width on a side of the one end being formed narrower than a groove width on a side of the other end, and the side of the one end of the second lug groove that is formed narrower being closed at ground contact.", "the first lug groove has a groove width Wa1 on the side of the one end and a groove width Wa2 on the side of the other end satisfying a relationship 1.50≤Wa1/Wa2≤3.0, and the second lug groove has a groove width Wb1 on the side of the one end and a groove width Wb2 on the side of the other end satisfying a relationship 0.2≤Wb1/Wb2≤0.75.", "13 . The tire according to claim 11 , wherein the first lug groove and the second lug groove each comprise a groove width change portion in which a groove width changes, and each groove width change portion is provided in a region in which the first lug groove and the second lug groove overlap in a tire width direction.", "14 . The tire according to claim 13 , wherein a width W2 of the region in the tire width direction and a maximum width W1 of the land portion in the tire width direction satisfy a relationship 0.50≤W2/W1≤0.70.", "15 . The tire according to claim 11 , wherein the first lug groove and the second lug groove are inclined in mutually opposite directions with respect to the tire circumferential direction, and inclination angles θ1, θ2 of the first lug groove and the second lug groove with respect to the tire circumferential direction satisfy 95°≤θ1≤125°, 95°≤θ2≤125°, and 5°≤θ2−θ1≤15°, respectively.", "the first lug groove and the second lug groove each comprise a raised bottom portion comprising a groove bottom raised on the side of the other end, and lengths La1, Lb1 of the raised bottom portion in the tire width direction and each of length La, Lb of the first lug groove and the second lug groove in the tire width direction satisfy relationships 0.30≤La1/La≤0.40 and 0.30≤Lb1/Lb≤0.40, respectively.", "17 . The tire according to claim 11 , wherein one of the circumferential main grooves comprises a groove wall that forms an edge of the land portion and has a straight shape, and the other one of the circumferential main grooves comprises a groove wall that forms an edge of the land portion and has a zigzag shape in which the groove wall oscillates in the tire width direction while extending in the tire circumferential direction.", "the land portion comprises a plurality of sipes extending in the tire width direction, and of the plurality of sipes, a sipe disposed on the side of the one end of the first lug groove and adjacent to the first lug groove in the tire circumferential direction comprises an end portion toward one of the circumferential main grooves that terminates inside the land portion, and a sipe disposed on the side of the one end of the second lug groove and adjacent to the second lug groove in the tire circumferential direction opens to the other one of the circumferential main grooves.", "the land portion comprises a separated portion in which the plurality of sipes are disposed separated in the tire width direction, and the separated portion is provided in a region in which the first lug groove and the second lug groove overlap in the tire width direction.", "20 . The tire according to claim 11 , wherein the land portion in which the first lug groove and the second lug groove are disposed is disposed on an inner side in a vehicle width direction demarcated by a tire equatorial plane when a tire is mounted on a vehicle.", "21 . The tire according to claim 12 , wherein the first lug groove and the second lug groove each comprise a groove width change portion in which a groove width changes, and each groove width change portion is provided in a region in which the first lug groove and the second lug groove overlap in a tire width direction.", "22 . The tire according to claim 21 , wherein a width W2 of the region in the tire width direction and a maximum width W1 of the land portion in the tire width direction satisfy a relationship 0.50≤W2/W1≤0.70.", "23 . The tire according to claim 22 , wherein the first lug groove and the second lug groove are inclined in mutually opposite directions with respect to the tire circumferential direction, and inclination angles θ1, θ2 of the first lug groove and the second lug groove with respect to the tire circumferential direction satisfy 95°≤θ1≤125°, 95°≤θ2≤125°, and 5°≤θ2−θ1≤15°, respectively.", "the first lug groove and the second lug groove each comprise a raised bottom portion comprising a groove bottom raised on the side of the other end, and lengths La1, Lb1 of the raised bottom portion in the tire width direction and each of length La, Lb of the first lug groove and the second lug groove in the tire width direction satisfy relationships 0.30≤La1/La≤0.40 and 0.30≤Lb1/Lb≤0.40, respectively.", "25 . The tire according to claim 24 , wherein one of the circumferential main grooves comprises a groove wall that forms an edge of the land portion and has a straight shape, and the other one of the circumferential main grooves comprises a groove wall that forms an edge of the land portion and has a zigzag shape in which the groove wall oscillates in the tire width direction while extending in the tire circumferential direction.", "the land portion comprises a plurality of sipes extending in the tire width direction, and of the plurality of sipes, a sipe disposed on the side of the one end of the first lug groove and adjacent to the first lug groove in the tire circumferential direction comprises an end portion toward one of the circumferential main grooves that terminates inside the land portion, and a sipe disposed on the side of the one end of the second lug groove and adjacent to the second lug groove in the tire circumferential direction opens to the other one of the circumferential main grooves.", "the land portion comprises a separated portion in which the plurality of sipes are disposed separated in the tire width direction, and the separated portion is provided in a region in which the first lug groove and the second lug groove overlap in the tire width direction.", "28 . The tire according to claim 27 , wherein the land portion in which the first lug groove and the second lug groove are disposed is disposed on an inner side in a vehicle width direction demarcated by a tire equatorial plane when a tire is mounted on a vehicle."], "bibtex": "@patent{20240262135,\n    title = {TIRE},\n    number = {20240262135},\n    year = {2024},\n    note = {File: US20240262135A1-20240808.XML}\n    }", "classification": "B60C1113FI"}, {"title": "TIRE", "doc_number": "20240262136", "filename": "US20240262136A1-20240808.XML", "abstract": "A tire 1 includes a communication device 10 embedded within a tire side portion 1 d , a decorative portion 14 formed on a tire outer surface Ids of the tire side portion and having a base surface 30 , and one or more patterned regions K disposed in the decorative portion. In each patterned region, protrusions Q that protrude with a protrusion height of 0.1 mm or greater and 1.0 mm or less from the base surface of the decorative portion are formed in plural with a spacing of 0.1 mm or greater and 3.0 mm or less. The communication device is wholly positioned within the decorative portion in a plane projected in a tire width direction of the tire side portion.", "detailed_description": ["A tire according to the present disclosure can be preferably used for any type of pneumatic tire, for example, a passenger vehicle pneumatic tire, a truck/bus pneumatic tire, etc.", "", "Embodiments of the tire according to the present disclosure are described below, with reference to the drawings.", "", "Members and portions common between the drawings have the same reference numerals. In certain drawings, a tire width direction is denoted by a reference sign “TW”, a tire radial direction is denoted by a reference sign “RD”, and a tire circumferential direction is denoted by a reference sign “CD”. In the present specification, a side closer to a tire cavity is referred to as “tire inner side” and a side farther from the tire cavity is referred to as “tire outer side”.", "", "FIG.1andFIG.2are drawings for describing a tire1according to a first embodiment of the present disclosure.FIG.1is a side view illustrating a portion of a tire side portion of the tire according to the first embodiment of the present disclosure as viewed from the tire width direction outer side.FIG.2is a cross-sectional view, in the tire width direction, illustrating a portion of the tire (specifically, a portion on one side relative to a tire equatorial plane, CL) inFIG.1in cross section along the A-A line inFIG.1.FIG.5is a cross-sectional view, in the tire width direction, illustrating a portion of the tire (specifically, a portion on one side relative to the tire equatorial plane, CL) according to a second embodiment of the present disclosure.", "", "The tire1of the embodiment inFIG.1andFIG.2is configured as a passenger vehicle pneumatic tire. The tire1of the embodiments inFIG.5is configured as a truck/bus pneumatic tire. For convenience of explanation, these embodiments are described together below.", "", "The tire1of any embodiment of the present disclosure may be configured as any type of tire.", "", "The tire1includes a tire body1M and a communication device10. The tire body1M corresponds to portions of the tire1other than the communication device10.", "", "Hereafter, unless otherwise noted, the positional relationship and dimensions of each element are measured in a standard state, with the tire1fitted to an applicable rim, a prescribed internal pressure applied, and no load applied. Additionally, in a state in which the tire1is fitted to an applicable rim, a prescribed internal pressure is applied, and no load is applied, the width, in a tire width direction, of a contact patch in contact with the ground is referred to as a ground contact width of the tire, and an end in the tire width direction of the ground contact width is referred to as a ground contact end.", "", "In the present specification, “applicable rim” (Measuring Rim in the STANDARDS MANUAL of ETRTO and Design Rim in the YEAR BOOK of TRA) refers to an approved rim of an applicable size as described by, or as described in the future by, valid industrial standards for the region in which a pneumatic tire is produced or used, such as the JATMA YEAR BOOK of JATMA (the Japan Automobile Tyre Manufacturers Association) in Japan, the STANDARDS MANUAL of ETRTO (European Tyre and Rim Technical Organization) in Europe, and the YEAR BOOK of TRA (The Tire and Rim Association, Inc.) in the U.S., and in a case in which a rim size is not as described in these industrial standards, the “applicable rim” refers to a rim with a width corresponding to a bead width of the pneumatic tire. The “applicable rim” includes current sizes as well as sizes that will be included in the future in the above industrial standards. Examples of a “size described in the future” may include sizes described in “FUTURE DEVELOPMENTS” in the 2013 edition of the STANDARDS MANUAL of ETRTO.", "", "In the present specification, “prescribed internal pressure” refers to an air pressure (maximum air pressure) corresponding to the maximum load capacity of a single wheel in an applicable size and ply rating described in the JATMA YEAR BOOK or other industrial standards, and in case of a size that is not described in the above industrial standard, the “prescribed internal pressure” refers to an air pressure (the maximum air pressure) corresponding to the maximum load capability prescribed for each vehicle on which the tire is installed. Additionally, in the present specification, “maximum load” means a load that corresponds to the maximum load capability in a tire in an applicable size described in the above industrial standards, or, in case of a size that is not described in the above industrial standards, the “maximum load” means a load that corresponds to the maximum load capability prescribed for each vehicle on which the tire is installed.", "", "First, the tire body1M is described.", "", "As illustrated in drawings such asFIG.2andFIG.5, in each embodiment described herein, the tire body1M includes a tread portion1a, a pair of sidewall portions1bthat extend to the tire radial direction inner side from both ends in the tire width direction of the tread portion1a, and a pair of bead portions1cdisposed at an end of the tire radial direction inner side of each sidewall portion1b. The tread portion1ais a part, in the tire width direction, of the tire body1M between a pair of ground contact ends. When the tire is1is fitted to a rim, the bead portion1cis configured to contact the rim on the tire radial direction inner side and the tire width direction outer side.", "", "The tire body1M has a pair of tire side portions1dthat extend to the tire radial direction inner side from both ends, in the tire width direction, of the tread portion1a. The tire side portions1dare composed of a sidewall portion1band a bead portion1c. In the present specification, the surface of the tire outer side at the tire side portion1dis referred to as “tire outer surface Ids of the tire side portion1d”.", "", "Additionally, the tire body1M includes a pair of bead cores4a, a pair of bead fillers4b, a carcass5, a belt6, tread rubber7, side rubber8, and an inner liner9.", "", "Each bead core4ais embedded in a corresponding bead portion1c. The bead cores4ainclude multiple bead wires with a periphery covered with rubber. The bead wires are preferably made of a metal (for example, steel). The bead wires can, for example, be composed of monofilaments or stranded wires. The bead wires may be made of organic fibers or carbon fibers.", "", "Each bead filler4b, respectively, is positioned on the tire radial direction outer side with respect to a corresponding bead core4a. The bead fillers4bextend in tapered form to the tire radial direction outer side. The bead fillers4bare, for example, rubber.", "", "The bead fillers may be referred to as “stiffeners”.", "", "As illustrated inFIG.5, when the tire body1M (and thus the tire1) is configured as a truck/bus pneumatic tire, the bead fillers4bmay be made of multiple bead filler portions4b1and4b2(two in each example inFIG.5). These multiple bead filler portions4b1and4b2can, for example, differ in hardness. These multiple bead filler portions4b1and4b2are, for example, arranged (layered) along the tire radial direction.", "", "The carcass5spans between the pair of bead cores4aand extends toroidally. The carcass5is made of one or more carcass plies5a. Each carcass ply5aincludes one or more carcass cords and a coating rubber that covers the carcass cords. The carcass cords can be formed from monofilaments or stranded wires.", "", "The carcass cords may be made of organic fibers composed of polyester, nylon, rayon, aramid, etc., and may be made of a metal (for example, steel). When the tire1is configured as a truck/bus pneumatic tire, the carcass cords are preferably made of a metal (for example, steel). When the tire1is configured as a passenger vehicle pneumatic tire, the carcass cords are preferably made of organic fibers composed of polyester, nylon, rayon, aramid, or the like.", "", "The carcass plies5ainclude a ply main body5mpositioned between the pair of bead cores4a. The carcass plies5amay further include a ply foldback portion5T that folds back from both ends of the ply main body5M around the bead cores4afrom the tire width direction inner side to the tire width direction outer side. However, the carcass plies5amay not necessarily include a ply foldback portion5T. The carcass5preferably has a radial structure, but may have a biased structure.", "", "The belt6is arranged on the tire radial direction outer side with respect to a crown portion of the carcass5. The belt6includes one or more belt layers6a. Each belt layer6aincludes one or more belt cords and a coating rubber that covers the belt cords. The belt cords can be formed from monofilaments or stranded wires. The belt cords may be made of a metal (for example, steel) or made of organic fibers composed of polyester, nylon, rayon, aramid, or the like.", "", "The tread rubber7is positioned in the tread portion1a, on the tire radial direction outer side of the belt6. The tread rubber7forms a tread surface, which is a surface of the tire radial direction outer side of the tread portion1a. A tread pattern is formed on the tread surface.", "", "The side rubber8is positioned in the sidewall portion1b, on the tire width direction outer side of the carcass5. The side rubber8forms a surface of the tire width direction outer side of the sidewall portion1b. The side rubber8is integrally formed with the tread rubber7.", "", "The inner liner9is arranged on the tire inner side of the carcass5of the tire and, for example, may be layered on the tire inner side of the carcass5. The inner liner9is, for example, formed from a butyl-based rubber with low air permeability. Butyl-based rubbers include, for example, butyl rubber and halogenated butyl rubber, which is a derivative thereof. The inner liner9is not limited to butyl-based rubber, and can be made of other rubber compositions, resins, or elastomers.", "", "As illustrated inFIG.5, when the tire body1M (and thus the tire1) is configured as a truck/bus pneumatic tire, the tire body1M may include a reinforcement member3around the bead cores4a. The reinforcement member3may be arranged on a side of the bead core4aopposite from the carcass5, as in the example inFIG.5. The reinforcement member3includes one or more reinforcement plies3a(three in the example inFIG.5). Each reinforcement ply3aincludes a reinforcement cord. The reinforcement cord may be made of a metal (for example, steel) or made of organic fibers composed of polyester, nylon, rayon, aramid, etc.", "", "In each embodiment described herein, as illustrated inFIG.1,FIG.2, andFIG.5, the tire body1M includes a decorative portion14, which has a base surface30formed from a tire outer surface ids of the tire side portion1d, and one or more patterned regions K disposed on the decorative portion14. In each patterned region K, multiple protrusions Q are formed. These multiple protrusions Q protrude from the base surface30of the decorative portion14with a protrusion height of 0.1 mm or greater and 1.0 mm or less. The spacing between these multiple protrusions Q is 0.1 mm or greater and 3.0 mm or less. The base surface30forms a bottom surface of the decorative portion14. The tire body1M may include only one decorative portion14, or the tire body1M may include multiple decorative portions14.", "", "As such, the multiple protrusions Q form fine irregularities on the decorative portion14, which thus easily absorbs light. Therefore, the amount of light reflected to the outer side at the decorative portion14becomes less than the amount of light reflected to the outer side at portions of the tire outer surface ids of the tire side portion1dother than the decorative portion14. Therefore, the brightness of the decorative portion14is lower than the brightness of the portions of the tire outer surface ids of the tire side portion1dother than the decorative portion14.", "", "Next, the communication device10is described.", "", "The communication device10may be configured to be capable of wireless communication with a prescribed external device (for example, a reader or a reader/writer) that is external to the tire1, and the configuration of the communication device10is not particularly limited.", "", "The communication device10preferably has an RF tag. The RF tag may also be referred to as an “RFID tag”. The RF tag is preferably configured as a passive type, but may be configured as an active type.", "", "The communication device10may have, instead of or in addition to an RF tag, an accelerometer that detects the acceleration of the tire1, an internal pressure sensor that detects the internal pressure of the tire1, or other sensors.", "", "FIG.3andFIG.4illustrate an example of the communication device10. In the present example, the communication device10has an RF tag. In the present example, the communication device10has an RF tag10eand a cover10f. The RF tag10eincludes an IC chip10cand an antenna section10b. The RF tag10eis configured as a passive type.", "", "The IC chip10coperates, for example, by dielectric electromotive force generated by radio waves received at the antenna section10b. The IC chip10c, for example, has a controller and a memory unit.", "", "The memory unit may store any information. For example, the memory unit may store identification information for the tire1. The identification information for the tire1is, for example, unique identification information for the tire1that can identify each tire by tire, such as the manufacturer of the tire1, the manufacturing plant, and the date of manufacture. Additionally, the memory unit may also store tire history information such as running distance of the tire, the number of sudden brakings, the number of sudden starts, and the number of sudden cornering situations. Additionally, for example, sensors that detect tire internal temperature, tire internal pressure, tire acceleration, or the like are disposed in the tire cavity, and the memory unit may store detection information detected by these sensors. In this case, the RF tag10ecan acquire the detection information from a sensor by communicating wirelessly with the sensor through the antenna section10b.", "", "The controller is configured to be able to read out information from the memory unit.", "", "The antenna section10bhas a pair of antennas10b1and10b2. The pair of antennas10b1,10b2are connected to ends, positioned on opposite sides to each other, of the IC chip10c. The antenna section10bis configured to be capable of transmitting to and receiving from the above prescribed external device that is external to the tire1. In the examples inFIG.3andFIG.4, each antenna10b1,10b2extends linearly, but each antenna10b1,10b2may extend to form any shape, for example, a wavy shape or the like.", "", "The cover10fcovers the entirety of the RF tag10e. The cover10fis formed, for example, from rubber or resin.", "", "In the present example, the cover10fhas a pair of sheet-shaped cover members10f1,10f2. The pair of cover members10f1,10f2overlap each other with the RF tag10etherebetween. The pair of cover members10f1,10f2are preferably fixed to each other by an adhesive or the like.", "", "However, the cover10fmay be made of one member.", "", "In the present example, the cover10fhas a rectangular shape in a planar view, but the cover10fmay have any shape in a planar view.", "", "The communication device10may have no cover10f, i.e., the communication device10may be made of only the RF tag10e.", "", "The communication device10thus formed is capable of receiving, by the antenna section10b, information transmitted over radio waves or magnetic fields from the prescribed external device. Power is generated in the antenna section10bof the communication device10by rectification (in case of radio waves) or resonance (in case of magnetic fields), and the memory unit and the controller of the IC chip10cperform prescribed operations. For example, the controller reads the information in the memory unit and returns (transmits) the information to the prescribed external device from the antenna section10bover radio waves or magnetic fields. The prescribed external device receives the radio waves or the magnetic fields from the communication device10. The prescribed external device can retrieve the received information and thereby acquire the information stored in the memory unit of the IC chip10cof the communication device10.", "", "However, the communication device10may have any configuration that is different from this example.", "", "The communication device10may have a longitudinal direction LD, a lateral direction SD, and a thickness direction TD. The longitudinal direction LD, the lateral direction SD, and the thickness direction TD are perpendicular to each other.", "", "As illustrated inFIG.3andFIG.4, when the communication device10has an RF tag10e, the longitudinal direction LD of the communication device10is parallel to the extension direction of the antenna section10b. When each antenna10b1,10b2of the antenna section10bis a wavy shape, the extension direction of the antenna section10brefers to the extension direction of the amplitude centerline of the waved formed by each antenna10b1,10b2. For the communication device10, the thickness direction TD of the communication device10refers to the thickness direction of the cover10fwhen the communication device10has the cover10f, and when the communication device10has no cover10f, the thickness direction TD of the communication device10refers to the thickness direction of the IC chip10c.", "", "The length of the RF tag10ein the longitudinal direction LD is, for example, 20 mm or greater, or preferably 50 mm or greater. Additionally, the length of the RF tag10ein the longitudinal direction LD is, for example, 100 mm or less, or preferably 70 mm or less.", "", "The length of the RF tag10ein the lateral direction SD is, for example, 10 mm or less, or preferably 8 mm or less.", "", "The RF tag10ehas a length in the thickness direction TD of preferably, for example, 5 mm or less, or 2 mm or less.", "", "When the communication device10has the cover10f, the length of the communication device10in the longitudinal direction LD is, for example, 30 mm or greater, or preferably 60 mm or greater. Additionally, the length of the RF tag10ein the longitudinal direction LD is, for example, 110 mm or less, or preferably 80 mm or less.", "", "When the communication device10has the cover10f, the length of the communication device10in the lateral direction SD is, for example, 20 mm or less, or preferably 15 mm or less.", "", "When the communication device10has the cover10f, the length of the communication device10in the thickness direction TD is, for example, 6 mm or less, or preferably 3 mm or less.", "", "The thickness of each cover member10f1,10f2of the cover10fis, for example, preferably 0.5 mm or greater. Additionally, the thickness of each cover member10f1,10f2of the cover10fis, for example, preferably 1 mm or less.", "", "In each embodiment described herein, the entirety of the communication device10is embedded within the tire side portion1dof the tire body1M, as illustrated inFIG.1,FIG.2, andFIG.5. The communication device10is embedded in a part of the tire side portion1dof the tire body1M that is further to the tire width direction outer side than the carcass5.", "", "The entirety of the communication device10is positioned within the decorative portion14in a plane (FIG.1) projected in a tire width direction of the tire side portion1d. Here, “plane projected in a tire width direction of the tire side portion1d” is a projected surface of the tire side portion1dwhen viewed as projected in the tire width direction, as inFIG.1.", "", "The communication device10is oriented so that the thickness direction TD of the communication device10approximately follows the tire width direction (FIG.2andFIG.5).", "", "During the production of the tire1, the communication device10and a raw tire that forms the tire body1M are placed within a tire-forming mold and vulcanization molded.", "", "The decorative portion14either may be formed by performing a cutting operation on a raw tire that is obtained after vulcanization molding using the tire-forming mold, or may be formed by vulcanization molding using the tire-forming mold.", "", "Here, the effects of each embodiment described herein are described.", "", "First, as described above, in each embodiment described herein, the communication device10is embedded within the tire side portion1d, as illustrated inFIG.1,FIG.2, andFIG.5. Here, in general, a metal may weaken radio waves between the communication device10and the prescribed external device (for example, a reader or a reader/writer), thereby reducing the communication performance between the communication device10and the prescribed external device, which in turn may shorten a communication distance between the communication device10and the prescribed external device. On the other hand, for the tire body1M, a metal (for example, steel) can be used for the carcass5, the belt6, the bead cores4a, the reinforcement members3, and the like. Then, in general, the tire side portion1dtends to have less metal compared to the tread portion1a. Therefore, by arranging the communication device10on the tire side portion1d, the communication performance can be improved, thereby enabling lengthening of the communication distance between the communication device10and the prescribed external device compared to a case in which the communication device10is arranged in the tread portion1a.", "", "Additionally, as described above, in each embodiment described herein, by positioning the entirety of the communication device10within the decorative portion14in the plane projected in the tire width direction of the tire side portion1d, as inFIG.1, the decorative portion14that is easily visible from the outside has an indicator function that indicates the position of the communication device10, and thus the position of the communication device10becomes easier to grasp. Therefore, a worker who attempts to read the communication device10with the prescribed external device (for example, a reader or a reader/writer) can read the communication device10simply by holding the above prescribed external device near the decorative portion14, thereby facilitating the reading process. Additionally, the decorative portion14can decorate the tire1, and thus can improve the appearance of the tire1. In other words, the decorative portion14can have both a decorative function for the tire1and a position display function for the communication device10.", "", "Additionally, by positioning the entirety of the communication device10within the decorative portion14in the plane projected in the tire width direction of the tire side portion1d, the load applied to the communication device10can be reduced, and thus the durability of the communication device can be improved because the fine irregularities that are formed on the decorative portion14impede distortions from concentrating near the decorative portion14during rolling and other movements of the tire1.", "", "Additionally, by positioning the entirety of the communication device10within the decorative portion14in the plane projected in the tire width direction of the tire side portion1d, the outline (in particular, for example, when the communication device10has an RF tag10e, the outline of the RF tag10e) of the communication device10, that is positioned on the tire width direction inner side with respect to the decorative portion14becomes less noticeable due to the fine irregularities that are formed on the decorative portion14, and thus the appearance of the tire1can be improved. When the irregularities formed on the decorative portion14are not so fine (specifically, when the protrusion height of the protrusions Q exceeds 1.0 mm, and/or a case in which the spacings between the protrusions Q exceed 3.0 mm), the outline of the communication device10becomes more noticeable, and the appearance of the tire1may be reduced.", "", "In each embodiment described herein, the alignment direction (orientation) of the communication device10is arbitrary, but in terms of the durability of the communication device10, etc., the communication device10is preferably oriented so that the longitudinal direction LD of the communication device10approximately follows the tire circumferential direction as in the example inFIG.1. However, the communication device10may be oriented so that the lateral direction LD of the communication device10approximately follows the tire circumferential direction.", "", "In each embodiment described herein, the communication device10is preferably arranged in the sidewall portion1b, as in each embodiment inFIG.2andFIG.5. In general, the sidewall portion1btends to have less metal compared to the bead portion1c. Therefore, by arranging the communication device10in the sidewall portion1b, communication performance can be improved, thereby enabling lengthening of the communication distance between the communication device10and the prescribed external device compared to the communication device10being arranged in the bead portion1c.", "", "In each embodiment described herein, when the tire1is configured as a passenger vehicle pneumatic tire (FIG.2), the tire radial direction outer end10uof the communication device10(more preferably, the entirety of the communication device10) is preferably further to the tire radial direction outer side than the tire radial direction outer end of the bead core4a, more preferably further to the tire radial direction outer side than a tire radial direction center of the bead filler4b, and, for example, preferably further to the tire radial direction outer side than a tire radial direction outer end4buof the bead filler4b.", "", "In each embodiment described herein, when the tire1is configured as a passenger vehicle pneumatic tire (FIG.2) and the communication device10is arranged in the sidewall portion1bas described above, the tire radial direction outer end10uof the communication device10is preferably positioned further to the tire radial direction inner side than the tire radial direction outer end5eof the ply foldback portion5T of the carcass5as in the example inFIG.2. Accordingly, the communication performance can be improved, thereby enabling lengthening of the communication distance between the communication device10and the prescribed external device, and by being able to arrange the communication device10in a portion of the tire body1M with comparatively less distortion during rolling and other movements of the tire1, the durability of the communication device10and thus the tire1can also be improved.", "", "A distance, in the tire radial direction, between the tire radial direction outer end10uof the communication device10and the tire radial direction outer end5eof the ply foldback portion5T of the carcass5is preferably 3 to 30 mm, and more preferably 5 to 15 mm.", "", "In each embodiment described herein, when the tire1is configured as a passenger vehicle pneumatic tire (FIG.2), the tire radial direction outer end5eof the ply foldback portion5T of the carcass5is positioned further to the tire radial direction outer side than the tire radial direction outer end4buof the bead filler4b, as in the example inFIG.2. However, the tire radial direction outer end5eof the ply foldback portion5T of the carcass5may be positioned either in the same tire radial direction position as the tire radial direction outer end of the bead filler4b, or further to the tire radial direction inner side.", "", "In each embodiment described herein, when the tire1is configured as a passenger vehicle pneumatic tire (FIG.2), the tire radial direction outer end5eof the ply foldback portion5T of the carcass5may be positioned further to the tire radial direction outer side than a tire maximum width position of the tire body1M. The tire radial direction outer end5eof the ply foldback portion5T of the carcass5may be positioned in the same tire radial direction position as the tire maximum width position of the tire body1M. The tire radial direction outer end5eof the ply foldback portion5T of the carcass5may be positioned further to the tire radial direction inner side than the tire maximum width position of the tire body1M. Here, the “tire maximum width position of the tire body1M” is a tire radial direction position at which the tire body1M has the largest dimension in the tire width direction.", "", "In each embodiment described herein, when the tire1is configured as a passenger vehicle pneumatic tire (FIG.2), the communication device10preferably contacts the surface of the tire width direction outer side of the carcass5, and more preferably contacts the surface of the tire width direction outer side of the ply foldback portion5T of the carcass5, as in the example inFIG.2.", "", "In each embodiment described herein, when the tire1is configured as a truck/bus pneumatic tire (FIG.5), a tire radial direction center10mof the communication device10(more preferably, the entirety of the communication device10) is preferably further to the tire radial direction outer side than a tire radial direction outer end of the bead core4a. Accordingly, the communication performance can be improved, thereby enabling lengthening of the communication distance between the communication device10and the prescribed external device.", "", "In each embodiment described herein, when the tire1is configured as a truck/bus pneumatic tire (FIG.5), the tire radial direction center10mof the communication device10(more preferably, the entirety of the communication device10) is preferably further to the tire radial direction outer side than a tire radial direction outer end5eof the ply foldback portion5T of the carcass5. Accordingly, the communication performance can be improved, thereby enabling lengthening of the communication distance between the communication device10and the prescribed external device, and by being able to arrange the communication device10in a portion of the tire body1M with comparatively less distortion during rolling and other movements of the tire1, the durability of the communication device10and thus the tire1can also be improved.", "", "Here, “tire radial direction outer end5eof the ply foldback portion5T of the carcass5” refers to a tire radial direction outer end that is furthest to the tire radial direction outer side among the tire radial direction outer ends of the ply foldback portions5T of each carcass ply5aof the carcass5.", "", "In each embodiment described herein, when the tire1is configured as a truck/bus pneumatic tire (FIG.5), the tire radial direction center10mof the communication device10(more preferably, the entirety of the communication device10) is preferably further to the tire radial direction outer side than the tire radial direction outer end3uof the reinforcement member3. Accordingly, the communication performance can be improved, thereby enabling lengthening of the communication distance between the communication device10and the prescribed external device, and by being able to arrange the communication device10in a portion of the tire body1M with comparatively less distortion during rolling and other movements of the tire1, the durability of the communication device10and thus the tire1can also be improved.", "", "Here, “tire radial direction outer end3uof the reinforcement member3” refers to a tire radial direction outer end that is furthest to the tire radial direction outer side among the tire radial direction outer ends of each reinforcement ply3aof the reinforcement member3.", "", "In each embodiment described herein, when the tire1is configured as a truck/bus pneumatic tire (FIG.5), the tire radial direction center10mof the communication device10(more preferably, the entirety of the communication device10) is preferably further to the tire radial direction inner side than a tire radial direction outer end4buof the bead filler4b. Accordingly, the communication performance can be improved, thereby enabling lengthening of the communication distance between the communication device10and the prescribed external device, and by being able to arrange the communication device10in a portion of the tire body1M with comparatively less distortion during rolling and other movements of the tire1, the durability of the communication device10and thus the tire1can also be improved.", "", "A distance, in the tire radial direction, between the tire radial direction center10mof the communication device10and the tire radial direction outer end4buof the bead filler4bis preferably 1 to 30 mm, and more preferably 5 to 15 mm.", "", "In each embodiment described herein, when the tire1is configured as a truck/bus pneumatic tire (FIG.5), the tire radial direction outer end5eof the ply foldback portion5T of the carcass5is preferably positioned further to the tire radial direction inner side than the tire radial direction outer end4buof the bead filler4b. The tire radial direction outer end5eof the ply foldback portion5T of the carcass5may be positioned either in the same tire radial position as the tire radial direction outer end4buof the bead filler4bor further to the tire radial direction outer side.", "", "In each embodiment described herein, when the tire1is configured as a truck/bus pneumatic tire (FIG.5), the tire radial direction outer end3uof the reinforcement member3is preferably positioned further to the tire radial direction inner side than the tire radial direction outer end4buof the bead filler4b. The tire radial direction outer end3uof the reinforcement member3may be positioned either in the same tire radial position as the tire radial direction outer end4buof the bead filler4bor further to the tire radial direction outer side.", "", "In each embodiment described herein, when the tire1is configured as a truck/bus pneumatic tire (FIG.5), the tire radial direction outer end5eof the ply foldback portion5T of the carcass5may be positioned further to the tire radial direction inner side than a tire maximum width position of the tire body1M as in the example inFIG.5. The tire radial direction outer end5eof the ply foldback portion5T of the carcass5may be positioned in the same tire radial position as the tire maximum width position of the tire body1M. The tire radial direction outer end5eof the ply foldback portion5T of the carcass5may be positioned further to the tire radial direction outer side than the tire maximum width position of the tire body1M.", "", "Here, the “tire maximum width position of the tire body1M” is a tire radial direction position at which the tire body1M has the largest dimension in the tire width direction.", "", "In each embodiment described herein, when the tire1is configured as a truck/bus pneumatic tire (FIG.5), the tire radial direction outer end3uof the reinforcement member3may be positioned further to the tire radial direction inner side than a tire maximum width position of the tire body1M as in the example inFIG.5. The tire radial direction outer end3uof the reinforcement member3may be positioned in the same tire radial position as the tire maximum width position of the tire body1M. The tire radial direction outer end3uof the reinforcement member3may be positioned further to the tire radial direction outer side than a tire maximum width position of the tire body1M.", "", "In each embodiment described herein, when the tire1is configured as a truck/bus pneumatic tire (FIG.5), the communication device10preferably contacts a surface of the tire width direction outer side of the bead filler4b, as in the example inFIG.5.", "", "Various modifications to the decorative portion14and the patterned region K are described below with reference toFIG.6toFIG.36.", "", "FIG.6toFIG.12are drawings for describing a tire1according to a third embodiment of the present disclosure.FIG.13toFIG.21are drawings for describing a tire1according to a fourth embodiment of the present disclosure.FIG.22toFIG.26are drawings for describing a tire1according to a fifth embodiment of the present disclosure.FIG.27toFIG.30are drawings for describing a tire1according to a sixth embodiment of the present disclosure.FIG.31toFIG.36are drawings for describing a tire1according to a seventh embodiment of the present disclosure. The configurations of the decorative portion14and the patterned region K of each embodiment inFIG.6toFIG.36are respectively different. However, in each embodiment inFIG.6toFIG.36, as in each embodiment described above with reference toFIG.1toFIG.5, the tire body1M, includes a decorative portion, which has a base surface30that is formed on a tire outer surface of the tire side portion1d, and one or more patterned regions K disposed on the decorative portion14. In each patterned region K, multiple protrusions Q are formed. These multiple protrusions Q protrude from the base surface30of the decorative portion14with a protrusion height of 0.1 mm or greater and 1.0 mm or less. The spacing between these multiple protrusions Q is 0.1 mm or greater and 3.0 mm or less. The base surface30forms a bottom surface of the decorative portion14. The tire body1M may include only one decorative portion14, or the tire body1M may include multiple decorative portions14.", "", "InFIG.6toFIG.36, the communication device10is omitted for convenience. However, in each embodiment inFIG.6toFIG.36, the tire1includes the communication device10, the entirety of the communication device10is embedded within the tire side portion1dof the tire body1m, and the entirety of the communication device10is positioned within the decorative portion14in the plane projected in the tire width direction of the tire side portion1d.", "", "The tire1according to the third embodiment of the present disclosure is described below with reference toFIG.6toFIG.12.", "", "For the tire1of the third embodiment, the one or more patterned regions K that are disposed on the decorative portion14include a first patterned region K. In the first patterned region K, multiple first protrusions Q protrude from the base surface30of the decorative portion14with a protrusion height of 0.1 mm or greater and 1.0 mm or less and are formed at a spacing of greater than 1.0 mm and 3.0 mm or less.", "", "As illustrated inFIG.6, the decorative portion14is formed on the tire side portion1dof the tire1. The decorative portion14is arc-shaped, as viewed from an axial direction of the tire1, and is arranged at two symmetrical positions across a tire center axis CE. Furthermore, the base surface30is formed on the decorative portion14on the tire side portion1d. The base surface30is recessed with respect to other regions20that are regions other than the decorative portion14and are regions in which no protrusions or the like are formed. The base surface30forms a bottom surface of the decorative portion14and is a curved surface that is convex on the outer side in the width direction of the tire1as viewed from the tire circumferential direction. In the present embodiment, the base surface30is recessed by 0.4 (mm) with respect to the other regions20.", "", "Furthermore, on the decorative portion14, a low brightness region18(K) that is lower in brightness compared to the other regions20and appears black and medium brightness regions16(K) that are lower in brightness compared to the other regions20, higher in brightness compared to the low brightness region18, and appear gray are formed. In other words, the decorative portion14is formed by the low brightness region18and the medium brightness regions16. The medium brightness regions16are an example of the first patterned region (patterned region) K, and the low brightness region18is an example of a second patterned region (patterned region) K.", "", "Then, as illustrated inFIG.7, the low brightness region18that is formed on the decorative portion14extends in the tire circumferential direction, and the medium brightness regions16is arranged respectively at both ends of the low brightness region18in the tire circumferential direction.", "", "The low brightness region18and the medium brightness regions16are formed by disposing irregularities in portions in the tire-forming mold for forming the tire1. These portions in the tire-forming mold correspond to the low brightness region18and the medium brightness regions16. Additionally, the low brightness region18and the medium brightness regions16are preferably arranged further to the outer side in the tire radial direction than the tire maximum width position (a part with maximum linear distance between the tire side portions) in terms of visibility when the tire1is installed on a vehicle."], "claims": ["a communication device embedded within a tire side portion; a decorative portion formed on a tire outer surface of the tire side portion and having a base surface; and one or more patterned regions disposed in the decorative portion, wherein in each patterned region, protrusions that protrude with a protrusion height of 0.1 mm or greater and 1.0 mm or less from the base surface of the decorative portion are formed in plural with a spacing of 0.1 mm or greater and 3.0 mm or less, and the entirety of the communication device is positioned within the decorative portion in a plane projected in a tire width direction of the tire side portion.", "in the first patterned region, first protrusions that protrude with a protrusion height of 0.1 mm or greater and 1.0 mm or less from the base surface of the decorative portion are formed in plural with a spacing of greater than 1.0 mm and 3.0 mm or less.", "the plurality of patterned regions includes a first patterned region and a second patterned region, in the first patterned region, first protrusions that protrude with a protrusion height of a predetermined value of 0.1 mm or greater and 1.0 mm or less from the base surface of the decorative portion are formed in plural with a spacing of a predetermined value of 0.1 mm or greater and 1.0 mm or less, in the second patterned region, second protrusions that protrude with a protrusion height of a predetermined value of 0.1 mm or greater and 1.0 mm or less from the base surface of the decorative portion are formed in plural with a spacing of a predetermined value of 0.1 mm or greater and 1.0 mm or less, the spacing between the first protrusions and the spacing between the second protrusions are similar, and the protrusion height of the first protrusions and the protrusion height of the second protrusions are different.", "in the first patterned region, first protrusions that protrude with a protrusion height 0.1 mm or greater and 1.0 mm or less from the base surface of the decorative portion are formed in plural with a spacing of greater than 0.1 mm and 1.0 mm or less, and in at least the first patterned region, a plurality of the first protrusions is inclined in a direction with respect to a normal line that is perpendicular to the base surface.", "in the first patterned region, first protrusions that protrude with a protrusion height 0.1 mm or greater and 1.0 mm or less from the base surface of the decorative portion are formed in plural with a spacing of greater than 0.1 mm and 1.0 mm or less, and in the first patterned region, a gradual decrease region is disposed within which the protrusion height of a plurality of the first protrusions that are arranged adjacent to each other gradually decrease.", "in the first patterned region, first protrusions are formed in plural in a state of being adjacent to each other, each of the first protrusions extends along the base surface, each of the first protrusions is configured to include a base portion that forms a side of the base surface and a tip portion that forms a side of the protruding tip, the first patterned region has a portion formed therein within which at least some of the first protrusions that are adjacent to each other overlap each other as viewed from a direction of a length of the first protrusions, the first protrusions in the first patterned region protrude with a protrusion height of 0.1 mm or greater and 1.0 mm or less from the base surface, and the first protrusions adjacent to each other have a pitch of 0.1 mm or greater and 1.0 mm or less.", "7 . The tire according to claim 2 , wherein each first protrusion is an asterisk protrusion.", "8 . The tire according to claim 1 , wherein the communication device has an RF tag.", "9 . The tire according to claim 3 , wherein each first protrusion is an asterisk protrusion.", "10 . The tire according to claim 4 , wherein each first protrusion is an asterisk protrusion.", "11 . The tire according to claim 5 , wherein each first protrusion is an asterisk protrusion.", "12 . The tire according to claim 2 , wherein the communication device has an RF tag.", "13 . The tire according to claim 3 , wherein the communication device has an RF tag.", "14 . The tire according to claim 4 , wherein the communication device has an RF tag.", "15 . The tire according to claim 5 , wherein the communication device has an RF tag.", "16 . The tire according to claim 6 , wherein the communication device has an RF tag.", "17 . The tire according to claim 7 , wherein the communication device has an RF tag."], "bibtex": "@patent{20240262136,\n    title = {TIRE},\n    number = {20240262136},\n    year = {2024},\n    note = {File: US20240262136A1-20240808.XML}\n    }", "classification": "B60C1300FI"}]