[{"title": "FACE TO RIM REINFORCING CONNECTOR OF A COMPOSITE WHEEL", "doc_number": "20240278595", "filename": "US20240278595A1-20240822.XML", "abstract": "A spoke-to-rim reinforcing connector of a composite wheel. The composite wheel has a rim portion with a complementary rim fibre layup and a circumferential axis, and a face portion with a hub and spokes interconnecting the rim portion and the hub, each spoke having a complementary spoke fibre layup. The spoke-to-rim reinforcing connector comprises at least one spoke saddle and at least two rim tabs. The spoke saddle has a seat portion extending around an end portion, about the spoke axis, and over a face surface of the spoke fibre layup, and at least two spoke legs that extend over the sides of the spoke fibre layup. Each rim tab extends from a spoke leg perpendicularly to the spoke axis and is configured to be incorporated into the rim fibre layup. The connector has a continuous body having a fibre orientation extending perpendicular to the spoke axis.", "detailed_description": ["Referring firstly toFIG.1, there is shown a perspective view of a composite wheel100which includes the spoke to rim reinforcing connector300(FIG.3A and4) of the present invention integrated within the spoke to rim connection110. The illustrated composite wheel100has been developed by the Applicant as being formed as a one-piece body. The general process of manufacture of the composite wheel100is described in International Patent Publication No. WO2010/025495A1 and International Patent Publication No. WO2019/033169A1, the contents of which are to be understood to be incorporated into this specification by this reference.", "", "The illustrated composite wheel100includes two main sections:A). a rim portion102comprises an annulus shaped structure which circumferentially extends about a wheel axis X-X (FIG.1) onto which a tyre (not illustrated) is mounted; andB). a face portion104(FIG.2) comprising a circular hub106and a series of spokes108. The hub106includes five fastening apertures107configured to receive fastening bolts (not illustrated) used to fix the wheel to a wheel mount of a vehicle. The spokes108comprise elongate arms connected to the hub106at one end and the rim portion102at another end and extend generally along and about a spoke axis S-S (FIGS.1and3). Each spoke108has an outwardly extending face surface130, an opposing back surface132and side surfaces134. It should be appreciated that whilst the illustrated hub106and wheel configuration has five fastening apertures, the hub106of the composite wheel100could have other configurations, for example having a different number of fastening apertures (such as four, six or more) or may comprise a centerlock wheel with a central fastening aperture.", "", "The rim portion102has a complementary shaped and configured fibre layup therein and the face portion104and comprising spokes108have a complementary shaped and configured fibre layup therein. The fibre layup provides a reinforcing skeleton and fibre structure about which the composite wheel100can be moulded and mirrors the surfaces and shapes described above for those sections of the carbon fibre wheel. Parts and locations of the fibre layup of the rim portion102, face portion104and spokes108will therefore be described in the context of the comprising part of the composite wheel100in this patent specification.", "", "As described in International Patent Publication No. WO2010/025495A1, the creation of such a moulded one-piece composite wheel100necessitates use of a separate rim portion mould (not illustrated) and face portion mould (not illustrated).", "", "In some embodiments, in use, the rim portion102is formed by laying up a first set of fibres typically embodied in a reinforcement fabric seated in the rim portion mould, and the face portion104is formed by separately laying up a second set of fibres, typically embodied in a reinforcement fabric seated in the face portion mould. The reinforcement fabric from the rim portion mould and face portion mould are then assembled together in a combined mould, with the separate portions being interconnected at a connection point110with the connection between the rim portion102and face portion104being laid up with reinforcement. After forming the connection, a resin is injected and/or impregnated into the reinforcement of each of the rim portion102, the face portion104of the wheel100and then allowed to cure to produce a moulded single piece wheel100.", "", "It should be appreciated that in other embodiments, the rim portion102can be formed as a stacked laminate formed from alternating layers of: a hoop tow layer formed from at least one annularly wound elongate fibre tow; and a bias ply layer as taught in the Applicant's International Patent Publication No. WO2019/033169A1, the contents of which should be understood to be incorporated into this specification by this reference. As described in that specification, the face portion104is interconnected to the rim portion102whilst laying up the rim portion102. The fibre layup of the rim portion102is also laid up after the face portion104layup is completed so that the connection between the face portion104and the rim portion102can be included directly in the fibre layup of the rim portion102. As described in WO2019/033169A1, the face portion104is laid up with reinforcement with connection sections or tabs. The connection sections from the face portion104layup are laid onto and into the fibre layup of the rim portion to form the rim portion to face portion interconnection.", "", "A mechanically efficient connection between the rim portion102and face portion104, and in particular each spoke to rim connection110is important to provide stiffness and strength to the wheel100. In this respect, lateral, vertical and torsional loads are transmitted through a tyre to the rim portion102of the wheel100. These loads transmit bending and torsional stresses through the spokes108that need to be resolved efficiently at each spoke to rim connection110.", "", "The spoke to rim connection110of the present invention is formed through the interconnection of the rim reinforcement and face reinforcement of the rim portion102and the spoke108of the face portion104of the composite wheel100which is reinforced with the spoke to rim reinforcing connector300of the present invention. This connection110is shown in more detail inFIGS.2and3.", "", "Referring firstly toFIG.2, there is shown a more detailed view of the spoke to rim connection110of the composite wheel100shown inFIG.1. Externally, the connection region110is orientated with the outer surface114of the rim portion102and is configured to blend into that configuration.", "", "Referring now toFIGS.3and4, there is shown a schematic representation of the positioning of one embodiment of the spoke to rim reinforcing connector300within connection110between the rim portion102and the face portion104of the composite wheel100shown inFIGS.1and2. The illustrated spoke to rim reinforcing connector300comprises two distinct sections which extend through adjacent sections of the fibre layup of the rim portion102and the spoke section108of composite wheel100as follows:(1) A spoke saddle310wrapping around the end section150of the fibre layup of spoke108. The spoke saddle310comprises a top spoke seat portion312which extends around the fibre layup of end section150of spoke108generally circumferentially about the spoke axis S-S and over the fibre layup of face surface130of the spoke108and at least two spoke legs316that extend over the sides134of the fibre layup of spoke108and generally perpendicularly away from the fibre layup of face surface130of the spoke108; and(2) Two rim tabs320which extend from a spoke leg316of the spoke saddle310generally perpendicularly to the spoke axis S-S to be aligned with the fibre layup of inner surface140of rim portion102of the composite wheel100. Each rim tab320includes a planar face322which is orientated about 90 degrees to a planar face321of the spoke legs316from which the rim tab320is connected to and extends from. Each rim tab320is positioned and configured to be incorporated into the fibre layup of the rim portion102of the composite wheel100.", "", "As shown inFIGS.3A,3B and3C, each spoke saddle310is located at and over or within the fibre layup of end section150of the spoke108located at the connection region110between the rim portion102and spoke portion108of the composite wheel100. Each spoke saddle310can be located over all of the layers of the fibre layup of end section150or may be incorporated under one or more layers within the fibre layup of end section150of the spoke108. In most cases, the spoke saddle310is located as close to the top layer of the fibre layup as practical. The connector300is therefore located at the outboard end of the fibre layup of the spoke108where the load transfer between the rim and face structures are required. The spoke to rim reinforcing connector300has a continuous configuration position on and within the fibre layup of the connection region110that starts in the inner surface140of rim portion102(the first rim tab320), wraps around the face surface130of the spoke108(the spoke saddle310), and ends back in the inner surface140of the rim portion102(the second rim tab320). As shown inFIGS.3B and3C, the spoke saddle310is integrated into the fibre layup of the end portion150of spoke108.", "", "As best shown inFIG.4, each of the spoke saddle310and rim tabs320are formed from a substantially planar sheet of material. However, it should be appreciated that in other embodiments the spoke to rim reinforcing connector can also be formed from multiple plies of materials, each having the described and illustrated configuration. The illustrated spoke saddle310comprises a planar body wrapped around the fibre layup of the sides134and the face surface130of the end section150of a spoke108. The spoke saddle310forms a generally arched shape over the fibre layup of the spoke108. The illustrated spoke saddle310includes a generally rectangular shaped (or if an end portion near the rim portion102is considered—perhaps a slight trapezoidal shaped) top section318shaped to cover a portion of the fibre layup of the face surface130of the spoke107proximate where the spoke108connects to the rim portion102. The spoke legs316of each spoke saddle310have a generally triangular shape.FIG.3Bshows the top section318within the fibre layup of spoke section108.", "", "As best shown inFIGS.3A and4, each spoke leg316also include a series of edge flange portions319configured to extend at an angle outwardly of the face321of the spoke legs316and towards the fibre layup of the inner surface140of the rim portion102of the composite wheel100. The edge flange portions319assists in load transfer between the rim portion102and the side surfaces134of the spoke108and the spoke face130.", "", "Each rim tab320also comprises a substantially planar body configured to be generally parallel aligned with the inner surface140and fibre layup thereof of the annular body of the rim portion102of the composite wheel100. Each of the rim tabs320is configured to be integrated into the fibre layup or the rim portion102of the composite wheel100.", "", "The illustrated rim tabs320comprise a generally rectangular body324connected to a trapezoidal shaped spoke section326. Each rim tab320is connected to the respective spoke leg316through an integral joint330(FIG.5A), formed as a bend or fold line, about which each rim tab320is angled around 90 degrees relative to the face321of the spoke legs316.", "", "As shown inFIGS.3B and3C, the rim tabs320and more particularly the generally rectangular body324of rim tabs320is integrated into the fibre layup of the rim portion102. Similarly, the spoke saddle310is integrated into the fibre layup of the end portion150of spoke108.", "", "The configuration of each rim tab320enables each rim tab320to wrap around the fibre layup at the back surface132of each spoke108, to complete coverage around the spoke108from the fibre layup of the inner surface140of the rim portion102under the fibre layup of the each spoke108, through to the fibre layup of the back surface132of each spoke108. As shown inFIG.3A,3B and3C, each rim tab320is configured to abut an adjacent rim tab320under the fibre layup of the back surface132of the spoke108to form a continuous cover.", "", "The trapezoidal shaped spoke section326of each rim tab320is configured to curve towards the fibre layup of the back surface132of the spoke108(and fibre layup thereof) wrapping around at least part of the fibre layup of the back surface132to allow a transition of the fibre orientation (as shown by curved arrows F7and F8inFIG.4) in the spoke section326from substantially perpendicular to the spoke axis S-S towards becoming more spoke axis S-S aligned in the distal portion of the spoke section326. In some embodiments (not illustrated) that distal portion of the spoke section326can be configured to be aligned with the back surface132of the spoke108(and fibre layup thereof). However, in the illustrated embodiment, the distal portion of the spoke section326ends only part way up the transition curve to the back surface132of the spoke108(and fibre layup thereof).", "", "The fibre orientation within the connector300is configured so that the comprising fibres are orientated substantially perpendicular to the spoke axis S-S in the spoke saddle310and rim tabs320forming the connector300, as indicated by fibre direction arrows F1to F6(FIG.4). The connector300therefore has continuous fibre orientation therethrough that extends substantially perpendicular to the spoke axis S-S that starts in the rim portion102(rim tab320), wraps around the face of the spoke108(spoke saddle310), and ends back in the rim portion102(rim tab320). Moreover, when the transitional fibre orientation (F7and F8) of the spoke section326is considered, the fibre orientation of the connector300is perpendicular to the spoke axis S-S in the spoke saddle310of the connector300. The fibre orientation of the connector300is also perpendicular to the spoke axis S-S in the face portion322of the rim tabs320. However, the fibre orientation of the connector300then wraps around the back of spoke radius in such a way that the fibre orientation F7and F8transitions to become more spoke aligned in the spoke section326of rim tab320of the connector300.", "", "This fibre orientation can be formed in any suitable manner. Two embodiments of the connector300showing fibre orientation are illustrated inFIGS.5A and5B.", "", "FIG.5Ashows a Tailor Fibre Placement (TFP) preform form300A of the spoke to rim reinforcing connector300. This embodiment uses tailor fibre placement technology to enable optimal fibre alignment and thickness changes to form fibre layout400. This ensures the fibre direction is maintained through the preforming and layup operations.", "", "As shown inFIG.5B, the spoke to rim reinforcing connector300B may be alternatively formed from uniaxial fabric having fibre direction F10which is cut into the appropriate shape and configuration, and then shaped as shown inFIGS.3and4. Any appropriate uniaxial fabric arrangements could be used, such as stitch bonded, or weft stabilised uniaxial fabrics.", "", "As discussed previously, the spoke to rim reinforcing connector is typically formed as an integral body, formed from a single ply of material. However again it should be appreciated that in embodiments the spoke to rim reinforcing connector can also be formed from multiple plies of materials, each having the described configuration.", "", "As previously noted, the Applicant's composite wheel100illustrated inFIGS.1,2and3is preferably formed as an integrally formed composite wheel, with the rim portion102and face portion104of the composite wheel100integrally formed and connected. The connection portion110and the spoke to rim reinforcing connector300therein is also integrally formed with the composite wheel100.", "", "The illustrated spoke to rim reinforcing connector300is used to reinforce the connection portion110of the spoke to rim connection of composite wheel100by laying up the connection between the rim portion102and face portion104of that composite wheel100.", "", "For example, as described in the Applicant's International Patent Publication No. WO2019/033169A1, the face portion104is interconnected to the rim portion102using a connection architecture that is included in the face portion104layup and then integrated into the rim portion102layup during the subsequent layup process. The fibre layup of the rim portion102is also laid up after the face portion104layup is completed so that the connection between the face portion104and rim portion102can be included directly in the fibre layup of the rim portion102. The face portion104fibre layup has a selected carbon fibre layup which includes a generally circular shaped hub106and a plurality of spokes108which extend along spoke axis S-S from the hub106and a connection sections or tabs (not illustrated). The connection sections from the face portion104layup are laid onto and into the fibre layup of the rim portion102to form the rim portion to face portion interconnection. During this process, the spoke to rim connector300is integrated into the layup of the face portion104. positioning the spoke saddle310of each connector300within the layup of the end section150of each spoke108in the desired layer (in many cases close to the top or upper layer of that layup), and each rim tab320in alignment with the fibre layup of the rim portion102of the composite wheel100. An annular mould tool (not illustrated) shaped to provide the designed configuration of the rim portion102is provided, and the connection sections and rim tabs320are laid into that annular mould tool. The fibre layup and architecture of the rim portion102is then laid up to incorporate each rim tab320therein.", "", "Whilst the illustrated embodiments show the positioning of a single spoke to rim reinforcing connector300in the connection portion110of the spoke to rim connection of composite wheel100, it should be appreciated that the spoke fibre layup in the face portion104layup can include one or more spoke to rim reinforcing connectors300within those layers. In embodiments, multiple spoke to rim reinforcing connectors300are included in that layup. For example, three spoke to rim reinforcing connectors300could be respectfully positioned at the bottom, middle and top of the spoke fibre layup of the face portion104.", "", "The fibre layup or fibre architecture of the rim portion102and face portion104comprises a multi-layered structure. The number of layers may vary considerably depending on the design of the rim portion102and the size and type of composite members. In some embodiments, one or more layers can be used, for example only a few layers, such as 4 to 10 layers, or 4 to 20 layers, for example, 4, 6, 8, 10, 12, 14, 16, 18 or 20 layers can be used. In other embodiments, a higher number, for example 20, 30, 50, 100 or more layers are needed to obtain the desired quality and/or properties of the rim portion102.", "", "It should be appreciated that a wide variety of fibres may be used in the present invention, including but not limited to fibres selected from the group consisting of carbon fibres, glass fibres, aramid fibres, synthetic fibres such as acrylic, polyester, PAN, PET, PE, PP or PBO-fibres, or the like, bio fibres such as hemp, jute, cellulose fibres, or the like, mineral fibres for example Rockwool or the like, metal fibres for example steel, aluminium, brass, copper, or the like, boron fibres or any combination of these. In a preferred embodiment, the fibres comprise carbon fibres.", "", "The fibre volume fraction in carbon fibre layer can be controlled by forming the various layers out of materials of a selected fibre areal weight. The fibre areal weight in each layer is from 50 to 400 g/m2, preferably from 180 to 250 g/m2, more preferably from 180 to 220 g/m2, yet more preferably about 200 g/m2.", "", "The illustrated composite wheel100(FIG.1) is intended to be formed as a unitary body. This involves simultaneous injection and/or impregnation of a matrix material, which in the exemplary embodiment is a resin, into all parts including the rim portion102, face portion104and connection portion110(including the spoke to rim reinforcing connector300) and then curing of each of the portions of the composite wheel100. The resin used is preferably epoxy-based. However, it should be understood that any suitable resin can be used for example unsaturated polyester, polyurethane, polyvinyl ester, epoxy, thermoplastics, similar chemical compounds or combinations thereof. A variety of resin delivery systems can be used including, but not limited to Resin Infusion and/or Resin Transfer Moulding and/or Vacuum Assisted Resin Transfer Moulding.", "", "The formed rim portion102and face portion104of the composite wheel100therefore also comprises a matrix material enveloping the fibres of the stacked laminate, typically a resin based on unsaturated polyester, polyurethane, polyvinyl ester, epoxy, thermoplastics, similar chemical compounds or combinations thereof. However, it should be appreciated other matrix materials may also be applicable.", "", "After forming the connection, a resin is injected and/or impregnated into the reinforcement of each of the rim portion102, the face portion104and connection of the wheel and then allowed to cure.", "", "Those skilled in the art will appreciate that the invention described herein is susceptible to variations and modifications other than those specifically described. It is understood that the invention includes all such variations and modifications which fall within the spirit and scope of the present invention.", "", "Where the terms “comprise”, “comprises”, “comprised” or “comprising” are used in this specification (including the claims) they are to be interpreted as specifying the presence of the stated features, integers, steps or components, but not precluding the presence of one or more other features, integers, steps, components or group(s) thereof."], "claims": ["1 - 31 . (canceled)", "the composite wheel having a rim portion comprising a shaped annulus formed about a central axis of rotation of the composite wheel and having a circumferential axis extending circumferentially about the central axis and around the rim portion, and a face portion comprising a circular shaped hub and a plurality of spokes which extend along a spoke axis that extends radially to the circumferential axis, the plurality of spokes extending between the rim portion and the hub to interconnect the rim portion and the hub, each spoke having an outwardly extending face surface, an opposing back surface and side surfaces therebetween, the rim portion has a complementary rim fibre layup therein and each spoke has a complementary spoke fibre layup therein, the spoke to rim reinforcing connector comprising: at least one spoke saddle comprising a seat portion which extends around an end portion of the spoke fibre layup about the spoke axis and over the face surface of the spoke fibre layup, and at least two spoke legs that extend over the sides of the spoke fibre layup; and at least two rim tabs, each rim tab extending from a spoke leg perpendicularly to the spoke axis, each rim tab configured to be incorporated into the rim fibre layup of the rim portion of the composite wheel, wherein the connector comprises a continuous body having a fibre orientation that extends perpendicular to the spoke axis.", "33 . The spoke to rim reinforcing connector according to claim 32 , wherein the connector has a continuous fibre orientation therethrough that extends perpendicular to the spoke axis.", "34 . The spoke to rim reinforcing connector according to claim 32 , wherein each rim tab comprises a planar body configured to be parallel aligned with the annular body of the rim fibre layup of the rim portion of the composite wheel.", "35 . The spoke to rim reinforcing connector according to claim 32 , wherein the spoke saddle comprises a planar body wrapped around the sides and face surface of the end portion of the spoke fibre layup of a spoke, and the planar body of each rim tab optionally includes a planar face which is orientated 90 degrees to a planar face of the spoke legs from which the rim tab is connected to and extends from.", "36 . The spoke to rim reinforcing connector according to claim 32 , wherein each rim tab is configured to abut an adjacent rim tab under the back surface of the spoke fibre layup of the composite wheel, and adjoining rim tabs are optionally configured to form a continuous cover that extends over the section of the rim fibre layup under the back surface of the spoke of the composite wheel.", "37 . The spoke to rim reinforcing connector according to claim 32 , wherein each rim tab includes a spoke section configured to extend along a portion of the rim fibre layup of the rim portion that is adjacent to and under the back surface of the spoke of the composite wheel.", "38 . The spoke to rim reinforcing connector according to claim 37 , wherein the spoke section of each rim tab, preferably a top section of each rim tab, is configured to curve towards a back surface of the spoke fibre layup of the composite wheel.", "39 . The spoke to rim reinforcing connector according to claim 37 , wherein the spoke section of each rim tab is curved to wrap around the back surface of the spoke fibre layup to facilitate the transition of the fibre orientation in the spoke section from perpendicular to the spoke axis toward being more spoke axis aligned.", "40 . The spoke to rim reinforcing connector according to claim 32 , wherein each rim tab comprises a rectangular body connected to a trapezoidal shaped spoke section.", "41 . The spoke to rim reinforcing connector according to claim 32 , wherein each rim tab is connected to the respective spoke leg through a joint about which each rim tab is angled between 80 to 100 degrees, optionally around 90 degrees relative to the face of the spoke legs, wherein each joint preferably comprises at least one fold line or bend line.", "42 . The spoke to rim reinforcing connector according to claim 32 , wherein each spoke saddle comprises a curved, optionally arched shaped planar sheet.", "43 . The spoke to rim reinforcing connector according to claim 32 , wherein each spoke leg extends perpendicularly away from the face surface of the spoke fibre layup of the spoke.", "44 . The spoke to rim reinforcing connector according to claim 32 , wherein the spoke legs include at least one edge flange portion which is configured to extend at an angle outwardly of the face of the spoke legs and towards the rim fibre layup of the composite wheel.", "45 . The spoke to rim reinforcing connector according to claim 32 , wherein each spoke seat is located at and over the proximal end of the spoke fibre layup located at an interface between the rim portion and spoke portion of the composite wheel.", "46 . The spoke to rim reinforcing connector according to claim 32 , wherein the spoke legs of each spoke saddle have a triangular shape.", "47 . The spoke to rim reinforcing connector according to claim 32 , wherein the spoke seat of each spoke saddle includes a top section shaped to cover a portion of the top face of the spoke fibre layup proximate where the spoke connects to the rim portion, the top section of the spoke seat having a rectangular or trapezoidal shape.", "48 . The spoke to rim reinforcing connector according to claim 32 , wherein the spoke to rim reinforcing connector comprises a fabric sheet, preferably a uniaxial carbon fibre fabric sheet, wherein the spoke to rim reinforcing connector preferably comprises an integral or continuous uniaxial carbon fibre fabric.", "49 . The spoke to rim reinforcing connector according to claim 32 , wherein the spoke to rim reinforcing connector comprises at least one tailored fibre preform having a desired shape and fibre orientation, wherein the spoke to rim reinforcing connector preferably comprises a Tailor Fibre Placement (TFP) preform.", "each of the rim portion and the face portion is at least partially uncured at the time when the connection is prepared; or the connection further comprises a matrix material comprising a resin based on unsaturated polyester, polyurethane, polyvinyl ester, epoxy, thermoplastics, similar chemical compounds or combinations thereof enveloping the fibre layup thereof.", "51 . A composite wheel including a spoke to rim reinforcing connector according to claim 32 , wherein the composite wheel optionally comprises a carbon fibre wheel.", "52 . A composite wheel including a connection according to claim 50 , wherein the composite wheel optionally comprises a carbon fibre wheel."], "bibtex": "@patent{20240278595,\n    title = {FACE TO RIM REINFORCING CONNECTOR OF A COMPOSITE WHEEL},\n    number = {20240278595},\n    year = {2024},\n    note = {File: US20240278595A1-20240822.XML}\n    }", "classification": "B60B310FI"}, {"title": "VEHICLE WHEEL HUB COVER, VEHICLE WHEEL, POWERED VEHICLE, AND METHOD OF MANUFACTURE", "doc_number": "20240278596", "filename": "US20240278596A1-20240822.XML", "abstract": "The present disclosure relates to a vehicle wheel hub cover, a vehicle wheel, a powered vehicle, and a related method of manufacture. The vehicle wheel hub cover comprises a first curved region and at least two protrusions radially disposed about a periphery of the first curved region. Each of the at least two protrusions comprises a first end, a second end, an elongate portion extending from the first end to the second end, and an inner surface defining a cavity configured to receive a lug of a vehicle wheel. The first ends of each of the at least two protrusions are disposed within a plane. The first curved region extends radially inwardly from a first location on each of the elongate portions of the at least two protrusions and towards the plane.", "detailed_description": ["Various embodiments are described and illustrated herein to provide an overall understanding of the structure, function, and use of the disclosed articles and methods. The various embodiments described and illustrated herein are non-limiting and non-exhaustive. Thus, an invention is not limited by the description of the various non-limiting and non-exhaustive embodiments disclosed herein. Rather, the invention is defined solely by the claims. The features and characteristics illustrated and/or described in connection with various embodiments may be combined with the features and characteristics of other embodiments. Such modifications and variations are intended to be included within the scope of this specification. As such, the claims may be amended to recite any features or characteristics expressly or inherently described in, or otherwise expressly or inherently supported by, this specification. Further, Applicant reserves the right to amend the claims to affirmatively disclaim features or characteristics that may be present in the prior art. The various embodiments disclosed and described in this specification can comprise, consist of, or consist essentially of the features and characteristics as variously described herein.", "", "Any references herein to “various embodiments”, “some embodiments”, “one embodiment”, “an embodiment”, “a non-limiting embodiment”, or like phrases mean that a particular feature, structure, or characteristic described in connection with the example is included in at least one embodiment. Thus, appearances of the phrases “in various embodiments”, “in some embodiments”, “in one embodiment”, “in an embodiment”, “in a non-limiting embodiment”, or like phrases in the specification do not necessarily refer to the same embodiment. Furthermore, the particular described features, structures, or characteristics may be combined in any suitable manner in one or more embodiments. Thus, the particular features, structures, or characteristics illustrated or described in connection with one embodiment may be combined, in whole or in part, with the features, structures, or characteristics of one or more other embodiments without limitation. Such modifications and variations are intended to be included within the scope of the present embodiments.", "", "As used herein, a referenced element or region that is “intermediate” two other elements or regions means that the referenced element/region is disposed between, but is not necessarily in contact with, the two other elements/regions. Accordingly, for example, a referenced element that is “intermediate” a first element and a second element may or may not be immediately adjacent to or in contact with the first and/or second elements, and other elements may be disposed between the referenced element and the first and/or second elements.", "", "Vehicle wheels can be a source of aerodynamic drag for a powered vehicle and, thus, aerodynamic covers for vehicle wheels are commonly used to reduce the aerodynamic drag produced by the vehicle's wheels. Additionally, other regions of the powered vehicle, such as fenders, can be sources of aerodynamic drag. Typically, aerodynamic covers are assessed for aerodynamic efficiency in isolation, and aerodynamic drag of the full vehicle system, including aerodynamic drag produced by the installed aerodynamic covers and the fender, is not assessed. The inventors of the present disclosure surprisingly discovered that embodiments of a vehicle wheel hub cover according to the present disclosure can improve aerodynamic efficiency of a powered vehicle compared with the same vehicle outfitted with comparative wheel hub covers that may be more aerodynamically efficient when assessed in isolation. Embodiments of a vehicle wheel hub cover according to the present disclosure, for example, can direct air away from the vehicle's fenders, thereby further increasing aerodynamic efficiency of the vehicle.", "", "Embodiments of a vehicle wheel hub cover according to the present disclosure comprise a first curved region and at least two protrusions radially disposed about a periphery of the curved region. Each of the at least two protrusions comprise a first end, a second end, an elongate portion extending from the first end to the second end, and an inner surface defining a cavity configured to receive a lug of a vehicle wheel. The first ends of each of the at least two protrusions can be disposed within a plane. The first curved region can extend radially inwardly from a first location on each of the elongate portions of the at least two protrusions and towards the plane.", "", "Referring toFIGS.1and2, a non-limiting embodiment of a vehicle wheel hub cover100is shown. The vehicle wheel hub cover100can comprise a first curved region102and at least two protrusions radially disposed about a periphery116of the first curved region102. For example, as illustrated inFIGS.1and2, the vehicle wheel hub cover100can comprise ten protrusions104a-104jspaced equally about the periphery116of the first curved region102. In various other non-limiting embodiments, the vehicle wheel hub cover100can comprise eight protrusions (not shown) spaced equally about the periphery116of the first curved region102. In certain other non-limiting embodiments, the vehicle wheel hub cover100can comprise a number of protrusions based on the desired application, spaced equally about the periphery116of the first curved region102. In various non-limiting embodiments in which the vehicle wheel hub cover100is installed on a vehicle wheel of a powered vehicle (e.g., vehicle wheel540of a powered vehicle542, illustrated inFIG.5), the vehicle wheel hub cover100can reduce aerodynamic drag of the powered vehicle relative to the powered vehicle without the vehicle wheel hub cover100installed thereon.", "", "Referring again toFIGS.1and2, the protrusions104a-104jwill be described herein with reference to protrusion104a. However, it is understood that protrusions104b-104jcan have a configuration that is substantially the same as, or is identical to, protrusion104a. Protrusion104acan comprise a first end106a, a second end108a, and an elongate portion110aextending from the first end106ato the second end108a, and, as illustrated inFIG.2, an inner surface112adefining a cavity114aconfigured to receive a lug of a vehicle wheel. For example, the inner surface112acan extend from the second end108atowards the first end106a, and the inner surface112acan be sized to create a friction fit between the inner surface112aand a vehicle wheel lug nut received by the cavity114a. The first end106acan be closed and the second end108adefines an opening122a, which can receive the lug nut. In various non-limiting embodiments, the protrusion104acan comprise a tubular shape such that the shape of the inner surface112asubstantially conforms to the lug nut shape. In certain non-limiting embodiments, the protrusion104acomprises a frustoconical shape. In various embodiments, all of protrusions104a-104jare configured so as to friction fit with a lug nut of the vehicle wheel when the vehicle wheel hub cover100is installed on the vehicle wheel. In various other embodiments, at least one but less than less than all of protrusions104a-104jare configured so as to friction fit with a lug nut of the vehicle wheel when the vehicle wheel hub cover100is installed on the vehicle wheel.", "", "The first curved region102and the protrusions104a-104jcan be configured to reduce the aerodynamic drag of a powered vehicle when the vehicle wheel hub cover100is installed on the powered vehicle. As illustrated in the cross-sectional view inFIG.4, the first ends (e.g., first end106aof protrusion104a) of each of the protrusions104a-104jcan be disposed within a plane118(i.e., an imaginary plane). As indicated by directional arrow124inFIG.4, the first curved region102can extend radially inwardly from a first location (e.g. first location120aon protrusion104a) on each of the elongate portions (e.g., elongate portion110a) of each protrusion104a-104jand towards the plane118. In various non-limiting embodiments, the first curved region102does not intersect the plane118. For example, the first curved region102can be convex and disk-shaped, such that the first curved region102extends radially inwardly from the first location on the elongate portion110of each protrusion104a-104j, along the first curved region102, and towards an apex126. The apex126can be positioned intermediate the plane118and a plane128defined by the first locations on the elongate portions of each protrusion104a-104j. In various non-limiting embodiments, the first curved region102can define a radius of curvature, r, in a range of 5.00 inches (127 millimeters) to 50.00 inches (1270 millimeters), such as, for example, in a range of 20.00 inches (508 millimeters) to 35.00 inches (889 millimeters). The first curved region102can define a portion of a sphere and comprise a single radius of curvature or the first curved region can be a complex curve having at least two radii of curvature. In various non-limiting embodiments, the first curved region102comprises a spline that substantially follows a radius of curvature, r.", "", "The positioning and/or size of the first curved region102relative to the protrusions104a-104jcan reduce the aerodynamic drag of a powered vehicle on which the vehicle wheel hub cover100is installed. The first curved region102can at least partially cover the protrusions104a-104jbut may not fully cover the protrusions104a-104jsuch that the protrusions104a-104jcan enhance the aerodynamics of a powered vehicle on which the vehicle wheel hub cover100is installed. Referring again toFIG.4, a first distance, d1, separates the first end106aand the second end108a, and a second distance, d2, separates the first location120aand the second end108a. In various non-limiting embodiments, the second distance, d2, can be in a range of 20% to 95% of the first distance, d1, such as, for example, a range of 25% to 90% of the first distance, d1; a range of 30% to 90% of the first distance, d1; a range of 35% to 90% of the first distance, d1; a range of 40% to 90% of the first distance, d1; a range of 45% to 90% of the first distance, d1; a range of 50% to 90% of the first distance, d1; a range of 50% to 85% of the first distance, d1; a range of 55% to 85% of the first distance, d1; a range of 55% to 80% of the first distance, d1; or a range of 60% to 80% of the first distance, d1.", "", "According to various non-limiting embodiments, the vehicle wheel hub cover100can comprise at least two second curved regions, and each second curved region can be disposed intermediate two of the protrusions104a-104jand about the periphery116of the first curved region102. For example, as illustrated inFIGS.1and2, the vehicle wheel hub cover100can comprise ten second curved regions130a-130j, and each second curved region130a-130jcan be disposed intermediate two of protrusions104a-104jand equally spaced about the periphery116of the first curved region102. In various non-limiting embodiments in which the vehicle wheel hub cover100comprises eight protrusions, the vehicle wheel hub cover100can comprise eight second curved regions (not shown), and each second curved region can be disposed intermediate two of the eight protrusions and spaced equally about the periphery116of the first curved region102. In certain non-limiting embodiments, the vehicle wheel hub cover100can comprise a number of second curved regions based on the number of protrusions defined by the vehicle wheel hub cover100such that one second curved region is defined between each two adjacent protrusions104a-104j.", "", "The second curved regions130a-130jcan enhance the aerodynamics (i.e. reduce the aerodynamic drag) of a powered vehicle on which the vehicle wheel hub cover100is installed. For example, the second curved regions130a-130jcan provide a “ramp” for air flowing between two adjacent protrusions104a-104jand to the first curved region102.", "", "The vehicle wheel hub cover100can comprise an annular region132abutting the second end (e.g.,108a) of each of the protrusions104a-104j. The second curved regions130a-130jcan extend from the annular region132to the first curved region102. As illustrated inFIG.4, and referring to the second curved region130ias an example, the second curved region130ican start at a second location134ion the annular region132and end at a third location136ion the first curved region102in the plane128. Curved regions130a-130hand130jcan be configured substantially the same as, or identical to, the second curved region130i.", "", "Referring toFIG.5, the vehicle wheel hub cover100can be configured to attach over a hub538of a vehicle wheel540of a powered vehicle542. When installed in this way, the vehicle wheel hub cover100can cover the lug nuts544used to secure the vehicle wheel540to the vehicle axle546of the powered vehicle542. The first curved region102and each of the at least two protrusions104a-104jcan comprise shapes that reduce aerodynamic drag of the powered vehicle542when the vehicle wheel hub cover100is installed on a vehicle wheel540of the powered vehicle542by, for example, directing air around a fender548of the powered vehicle542. The reduced aerodynamic drag of the powered vehicle542can result in a reduced fuel consumption rate of the powered vehicle542. For example, during operation of a hydrocarbon fuel-powered vehicle, the vehicle wheel hub cover100can reduce aerodynamic drag of the powered vehicle, resulting in increased hydrocarbon fuel mileage (e.g., miles per gallon) for the powered vehicle. In situations in which the vehicle wheel hub cover100is installed on an electrically powered vehicle, the resultant reduced aerodynamic drag that can be achieved with the vehicle wheel hub cover100may increase, for example, the distance the vehicle can travel on a single vehicle battery charge and/or increase the miles per gallon gasoline equivalent (MPGe) of the vehicle.", "", "A vehicle wheel hub cover according to the present disclosure can be configured to be installed on a variety of wheeled vehicles. For example, the powered vehicle542can comprise a vehicle weight class in a range of 1 to 8, such as, for example, 3 to 8, as defined by the U.S. Federal Highway Administration. For example, in various non-limiting embodiments the gross weight of the powered vehicle542can be at least 10,001 lbs. (4536.48 kg) or at least 26,000 lbs. (11,798.4 kg). The powered vehicle542can be, for example, a light-duty, medium-duty, or heavy-duty vehicle. In various non-limiting embodiments, the powered vehicle542can be a truck (e.g., pick-up, full-sized, tractor (e.g., semi-truck)), a van, or a bus. The powered vehicle542can comprise at least two axles, such as, for example, at least three axles, at least four axles, at least five axles, or at least six axles. In various non-limiting embodiments, the powered vehicle542can comprise no greater than ten axles such as, for example, no greater than six axles, no greater than five axles, no greater than four axles, or no greater than three axles. In various non-limiting embodiments, the powered vehicle542can comprise a number of axles in a range of two to ten. In various non-limiting embodiments, the powered vehicle542can be powered by a combustion engine, one or more electric motors, or a combination thereof.", "", "In various embodiments, the vehicle wheel hub cover100can comprise a first diameter, ϕ1, and can be configured to mount on the vehicle wheel540(e.g., a steer wheel of a semi-truck) comprising a second diameter, ϕ2. The second diameter, ϕ2, can be greater than the first diameter, ϕ1. Bores in the vehicle wheel540can be configured to receive studs of a vehicle axle546. The bores can form a mounting circle (i.e., imaginary circle) which can comprise a third diameter, ϕ3, and the first diameter, ϕ1, can be greater than the third diameter, ϕ3.", "", "In various non-limiting embodiments, the vehicle wheel540can comprise a nominal rim diameter in a range of 1 inch (2.54 mm) to 200 inches (5080 mm), such as, for example, 14 inches (406.4 mm) to 25 inches (635 mm), or 19 inches (482.6 mm) to 25 inches (635 mm). In various non-limiting embodiments, the vehicle wheel540can comprise a nominal rim width in a range of 1 inch (2.54 mm) to 100 inches (2540 mm), such as, for example, 6 inches (152.4 mm) to 24 inches (609.6 mm), or 6 inches (152.4 mm) to 12 inches (304.8 mm).", "", "In various non-limiting embodiments, the vehicle wheel hub cover100can comprise a polymer, a metal, a metal alloy, or a combination of two or more of those materials. In various non-limiting embodiments, the vehicle wheel hub cover100can comprise rigid materials.", "", "The vehicle wheel hub cover100can be formed by various methods. For example, the vehicle wheel hub cover100can be injection molded and can comprise a substantially similar wall thickness throughout the vehicle wheel hub cover100that is suitable for injection molding. In various non-limiting embodiments, the first curved region102and the protrusions104a-104jare integrally formed. In certain non-limiting embodiments, the annular region132, the second curved regions130a-130j, the first curved region102, and the protrusions104a-104jare integrally formed such that the vehicle wheel hub cover100is a single piece. In other non-limiting embodiments, the vehicle wheel hub cover100can be formed such that is comprises at least two pieces that are assembled together to form the vehicle wheel hub cover100.", "", "Referring toFIG.6, the present disclosure also provides a method for reducing aerodynamic drag of a powered vehicle. The method comprises mounting a vehicle wheel hub cover according to the present disclosure (such as vehicle wheel hub cover100) to a vehicle wheel of a powered vehicle at step602. The vehicle wheel may be attached to an axle of the powered vehicle, such as, for example, a steer axle, a drive axle, or a trailer axle of the powered vehicle. For example, the vehicle wheel hub cover100can be attached to a steer wheel or a trailer axle of a semi-truck. The method can comprise operating the vehicle, including rotating the vehicle wheel on which the vehicle wheel hub cover100is installed, at step604. The method can comprise reducing aerodynamic drag of the vehicle during operation such that less hydrocarbon fuel can be consumed per unit distance traveled, less battery power can be consumed per unit distance traveled, or a combination thereof (relative to the vehicle without the vehicle wheel hub cover100installed thereon), at step606."], "claims": ["a first curved region; and at least two protrusions radially disposed about a periphery of the first curved region, each of the at least two protrusions comprising a first end, a second end, an elongate portion extending from the first end to the second end, and an inner surface defining a cavity configured to receive a lug of a vehicle wheel, wherein the first ends of each of the at least two protrusions are disposed within a plane; wherein the first curved region extends radially inwardly from a first location on each of the elongate portions of the at least two protrusions and towards the plane.", "2 . The vehicle wheel hub cover of claim 1 , wherein the first curved region does not intersect the plane.", "3 . The vehicle wheel hub cover of claim 1 , wherein the first curved region is convex.", "4 . The vehicle wheel hub cover of claim 1 , wherein the first curved region and each of the at least two protrusions are integrally formed.", "5 . The vehicle wheel hub cover of claim 1 , wherein on each of the at least two protrusions, a first distance separates the first end and the second end, a second distance separates the first location and the second end, and the second distance is in a range of 20% to 95% of the first distance.", "6 . The vehicle wheel hub cover of claim 5 , wherein the second distance is in a range of 40% to 90% of the first distance.", "7 . The vehicle wheel hub cover of claim 5 , wherein the second distance is in a range of 60% to 80% of the first distance.", "8 . The vehicle wheel hub cover of claim 1 , wherein each of the at least two protrusions comprises a tubular shape, each first end is closed, and each second end defines an opening.", "9 . The vehicle wheel hub cover of claim 1 , wherein each of the at least two protrusions comprises a frustoconical shape.", "10 . The vehicle wheel hub cover of claim 1 , further comprising at least two second curved regions, each second curved region disposed intermediate two of the at least two protrusions and about the periphery of the first curved region.", "11 . The vehicle wheel hub cover of claim 10 , further comprising an annular region abutting the second end of each of the at least two protrusions.", "12 . The vehicle wheel hub cover of claim 11 , wherein each of the at least two second curved regions extends from the annular region to the first curved region.", "13 . The vehicle wheel hub cover of claim 1 , wherein the vehicle wheel hub cover comprises a first diameter and is configured to mount on a vehicle wheel comprising a second diameter that is greater than the first diameter.", "14 . The vehicle wheel hub cover of claim 1 , wherein the vehicle wheel hub cover comprises a first diameter and is configured to mount on a vehicle wheel, a mounting circle formed by bores in the vehicle wheel configured to receive studs of a vehicle axle comprises a second diameter, and the first diameter is greater than the second diameter.", "15 . The vehicle wheel hub cover of claim 1 , wherein the vehicle wheel hub cover comprises eight protrusions spaced equally about the periphery of the first curved region or ten protrusions spaced equally about the periphery of the first curved region.", "16 . The vehicle wheel hub cover of claim 1 , wherein, when the vehicle wheel hub cover is mounted on a vehicle wheel of a powered vehicle, the first curved region and each of the at least two protrusions comprises a shape that reduces aerodynamic drag of the powered vehicle.", "17 . The vehicle wheel hub cover of claim 1 , wherein the vehicle wheel hub cover is configured to mount on a vehicle wheel comprising a nominal rim diameter in a range of 1 inch to 200 inches and a nominal rim width in a range of 1 inch to 100 inches.", "18 . The vehicle wheel hub cover of claim 1 , wherein the vehicle wheel hub cover is configured to mount on a steer wheel of a semi-truck.", "19 . A powered vehicle comprising a vehicle wheel hub cover as recited in claim 1 mounted on a vehicle wheel of the powered vehicle, wherein the vehicle wheel hub cover is configured to reduce aerodynamic drag of the powered vehicle and result in a reduced fuel consumption rate for the powered vehicle.", "20 . A method for reducing aerodynamic drag of a vehicle, the method comprising mounting a vehicle wheel hub cover as recited in claim 1 to a vehicle wheel of the vehicle."], "bibtex": "@patent{20240278596,\n    title = {VEHICLE WHEEL HUB COVER, VEHICLE WHEEL, POWERED VEHICLE, AND METHOD OF MANUFACTURE},\n    number = {20240278596},\n    year = {2024},\n    note = {File: US20240278596A1-20240822.XML}\n    }", "classification": "B60B700FI"}, {"title": "HALF SHAFT TO BEARING CONNECTION TO REDUCE DRIVELINE CLICK", "doc_number": "20240278597", "filename": "US20240278597A1-20240822.XML", "abstract": "The present disclosure includes a vehicle drive assembly including a wheel bearing and a half shaft. The wheel bearing defines a receptacle including internal splines. A bearing face of the wheel bearing defines an opening to the receptacle. The half shaft includes a joint housing and a stem extending from the joint housing. The stem is configured to be seated within the receptacle of the wheel bearing. The stem includes a splined portion, a shoulder, and a stop surface. The splined portion includes a plurality of external splines configured to mesh with the internal splines. The shoulder is between the splined portion and the joint housing. The shoulder has a maximum outer diameter that is greater than a minor diameter of the internal splines of the wheel bearing. A stop surface is between the splined portion and the shoulder, the stop surface configured to contact ends of the internal splines of the wheel bearing to stop the joint housing from moving into contact with the bearing face.", "detailed_description": ["FIG.1illustrates an exemplary drive assembly10in accordance with the present disclosure. The drive assembly10may be configured to drive a wheel of any suitable vehicle. The drive assembly10may be configured for use in non-vehicular applications as well. In the example illustrated, the drive assembly10generally includes a steering knuckle12, a wheel bearing20, and a half shaft50. The wheel bearing20is seated in the steering knuckle12. The half shaft50cooperates with the wheel bearing20to rotate the wheel bearing20and any wheel mounted thereto.", "", "With additional reference toFIGS.2,4, and5, the wheel bearing20defines a receptacle22. The receptacle22includes internal splines24, which are arranged about an interior of the receptacle22. A bearing face26of the wheel bearing20defines an opening to the receptacle22.", "", "With reference toFIGS.1-5, the half shaft50includes a joint housing52with a housing face54. The joint housing52is configured to house a constant velocity joint, or any other suitable joint. Extending from the joint housing52is a stem56. The stem56includes a splined portion60including external splines62. A plurality of the external splines62are arranged about the splined portion60of the stem56.", "", "The stem56further includes a shoulder64between the housing face54and the splined portion60. The shoulder64is without splines. The shoulder64has a maximum diameter that is greater than a minor diameter of the internal splines24of the bearing20. The shoulder64has an outer surface that is spaced apart from the wheel bearing20so as to not contact the wheel bearing20when the stem56is seated within the receptacle22. A distal end66of the stem56is fastened to the wheel bearing20in any suitable manner, such as with any suitable fastener68.", "", "With particular reference toFIGS.3-5, the stem56includes a stop surface70, which is an intermediate surface between the shoulder64and the splined portion60. The stop surface70may be integral with the shoulder64, or spaced apart from the shoulder64. The stop surface70may be any suitable sloped surface, ridge, curved surface, planar surface, flange, protrusion, etc. The stop surface70may extend completely, partially, or intermittently around the stem56. Between the stop surface70and the splined portion60is a transition area80. The transition area80may be devoid of the external splines62.", "", "The stop surface70is configured to contact the internal splines24of the wheel bearing20to stop the housing face54of the joint housing52from moving into contact with the bearing face26. With particular reference toFIG.4, the stop surface70is spaced apart from the housing face54at a first distance X1. Ends of the internal splines24that contact the stop surface70are spaced apart from the bearing face26at a second distance X2. The first distance X1is greater than the second distance X2. Therefore, as the stem56is inserted into the receptacle22, the stop surface70will contact the ends of internal splines24before the housing face54contacts the bearing face26. Contact between the stop surface70and the internal splines24prevents the stem56from being inserted further into the receptacle22, and thus a gap will be defined between the housing face54and the bearing face26. The present disclosure thus generally moves the location of where the half shaft50bottoms out to the bearing20from a bearing roll form area at the bearing face26to the internal splines24to reduce the risk of click and eliminate need for washer between the bearing face26and the housing face54.", "", "With reference toFIG.5, the stop surface70may be configured as a sloped surface of the stem56. The sloped surface may have any suitable slope and shape. The sloped stop surface70is configured to contact any suitable portion of the internal splines24, such as sloped inner ends28of the internal splines24. In the configuration ofFIG.5, contact between the sloped stop surface70and the sloped inner ends28of the internal splines24generally occurs at an uppermost portion of the sloped stop surface70nearest the shoulder64.", "", "The half shaft50may twist and/or bend under torsional loads during torque transitions, which may cause the housing face54to move towards the bearing face26. The gap is sized such that any twisting or bending of the half shaft50during torque transitions will not result in contact between the housing face54and the bearing face26. Cooperation between the stop surface70and the internal splines24also limits the degree to which the joint housing52can twist during torque transitions, which limits movement of the housing face54towards the bearing face26to further prevent contact between the housing face54and the bearing face26.", "", "With particular reference toFIGS.2and4, a seal90is arranged in the gap between the housing face54and the bearing face26. The seal90is made of any suitable polymeric material. The seal90has a thickness sufficient to span the gap so that the seal90contacts both the housing face54and the bearing face26, which retains the seal90in the gap. The seal90extends around the stem56to prevent dirt and other debris from entering the wheel bearing20. The seal90extends along the housing face54from the gap. At a top end of the seal90is an excluder92. The excluder92is an outwardly extending portion that is integral with the rest of the seal90. The excluder92is also configured to keep dirt and debris out of the wheel bearing20and away from a speed sensor. The excluder92is anchored by the portion of the seal90between the housing face54and the bearing face26. Because the excluder92is rigidly secured between the housing face54and the bearing face26, the excluder92will have limited flex as surrounding parts move or possibly rust.", "", "The foregoing description is merely illustrative in nature and is in no way intended to limit the disclosure, its application, or uses. The broad teachings of the disclosure can be implemented in a variety of forms. Therefore, while this disclosure includes particular examples, the true scope of the disclosure should not be so limited since other modifications will become apparent upon a study of the drawings, the specification, and the following claims. It should be understood that one or more steps within a method may be executed in different order (or concurrently) without altering the principles of the present disclosure. Further, although each of the embodiments is described above as having certain features, any one or more of those features described with respect to any embodiment of the disclosure can be implemented in and/or combined with features of any of the other embodiments, even if that combination is not explicitly described. In other words, the described embodiments are not mutually exclusive, and permutations of one or more embodiments with one another remain within the scope of this disclosure.", "", "Spatial and functional relationships between elements (for example, between modules, circuit elements, semiconductor layers, etc.) are described using various terms, including “connected,” “engaged,” “coupled,” “adjacent,” “next to,” “on top of,” “above,” “below,” and “disposed.” Unless explicitly described as being “direct,” when a relationship between first and second elements is described in the above disclosure, that relationship can be a direct relationship where no other intervening elements are present between the first and second elements, but can also be an indirect relationship where one or more intervening elements are present (either spatially or functionally) between the first and second elements. As used herein, the phrase at least one of A, B, and C should be construed to mean a logical (A OR B OR C), using a non-exclusive logical OR, and should not be construed to mean “at least one of A, at least one of B, and at least one of C.”"], "claims": ["a wheel bearing defining a receptacle including internal splines, a bearing face of the wheel bearing defines an opening to the receptacle; and a half shaft including a joint housing and a stem extending from the joint housing, the stem configured to be seated within the receptacle of the wheel bearing, the stem including: a splined portion including a plurality of external splines configured to mesh with the internal splines; a shoulder between the splined portion and the joint housing, the shoulder has a maximum outer diameter that is greater than a minor diameter of the internal splines of the wheel bearing; and a stop surface between the splined portion and the shoulder, the stop surface configured to contact ends of the internal splines of the wheel bearing to stop the joint housing from moving into contact with the bearing face.", "2 . The vehicle drive assembly of claim 1 , wherein the stop surface is spaced apart from the joint housing at a first distance, and the ends of the internal splines are spaced apart from the bearing face at a second distance, the first distance is greater than the second distance such that the bearing face does not contact the joint housing when the stop surface is in contact with the ends of the internal splines.", "3 . The vehicle drive assembly of claim 1 , wherein the stop surface includes a sloped surface.", "4 . The vehicle drive assembly of claim 3 , wherein the sloped surface of the stop surface contacts sloped ends of the internal splines to stop the joint housing from moving into contact with the bearing face.", "5 . The vehicle drive assembly of claim 4 , wherein the stop surface extends around the stem of the half shaft.", "6 . The vehicle drive assembly of claim 1 , wherein the stem further includes a transition area devoid of the plurality of external splines, the transition area is between the splined portion and the stop surface.", "7 . The vehicle drive assembly of claim 1 , wherein the shoulder is surrounded by, and spaced apart from, the wheel bearing.", "8 . The vehicle drive assembly of claim 1 , further comprising a gap defined between the bearing face and the joint housing.", "9 . The vehicle drive assembly of claim 1 , further comprising a polymeric seal seated in a gap defined between the bearing face and the joint housing, the polymeric seal contacts both the bearing face and the joint housing.", "10 . The vehicle drive assembly of claim 9 , wherein the polymeric seal includes an excluder outboard of the gap, the excluder configured to sit on the joint housing and restrict debris from entering the wheel bearing.", "11 . The vehicle drive assembly of claim 1 , wherein the joint housing is a constant velocity joint housing.", "a wheel bearing defining a receptacle including internal splines, a bearing face of the wheel bearing defines an opening to the receptacle; and a half shaft including a joint housing and a stem extending from the joint housing, the stem seated within the receptacle of the wheel bearing, the stem including: a splined portion including a plurality of external splines meshed with the internal splines; a shoulder between the splined portion and the joint housing, the shoulder has a maximum outer diameter that is greater than a minor diameter of the internal splines of the wheel bearing; and a sloped stop surface between the splined portion and the shoulder, the sloped stop surface in contact with ends of the internal splines of the wheel bearing to stop the joint housing from moving into contact with the bearing face; wherein the sloped stop surface is spaced apart from the joint housing at a first distance, and the ends of the internal splines are spaced apart from the bearing face at a second distance, the first distance is greater than the second distance such that contact between the sloped stop surface and the ends of the internal splines stops the joint housing from contacting the bearing face.", "13 . The vehicle drive assembly of claim 12 , wherein the sloped stop surface extends around the stem.", "14 . The vehicle drive assembly of claim 12 , wherein the joint housing is a constant velocity joint housing.", "15 . The vehicle drive assembly of claim 12 , wherein the wheel bearing is seated in a steering knuckle.", "16 . The vehicle drive assembly of claim 12 , further comprising a polymeric seal seated in a gap defined between the bearing face and the joint housing, the polymeric seal contacts both the bearing face and the joint housing.", "17 . The vehicle drive assembly of claim 16 , wherein the polymeric seal includes an excluder outboard of the gap, the excluder configured to sit on the joint housing and restrict debris from entering the wheel bearing.", "a wheel bearing defining a receptacle including internal splines, a bearing face of the wheel bearing defines an opening to the receptacle; and a half shaft including a joint housing and a stem extending from the joint housing, the stem seated within the receptacle, the stem including: a splined portion including a plurality of external splines meshed with the internal splines; a shoulder between the splined portion and the joint housing, the shoulder has a maximum outer diameter that is greater than a minor diameter of the internal splines of the wheel bearing; and a stop surface between the splined portion and the shoulder, the stop surface in contact with ends of the internal splines of the wheel bearing to stop the joint housing from moving into contact with the bearing face; and a polymeric seal seated in a gap defined between the bearing face and the joint housing, the polymeric seal contacts both the bearing face and the joint housing.", "19 . The vehicle drive assembly of claim 18 , wherein the polymeric seal includes an excluder outboard of the gap, the excluder configured to sit on the joint housing and restrict debris from entering the wheel bearing.", "20 . The vehicle drive assembly of claim 18 , wherein the stop surface is spaced apart from the joint housing at a first distance, and the ends of the internal splines are spaced apart from the bearing face at a second distance, the first distance is greater than the second distance such that contact between the stop surface and the ends of the internal splines stops the joint housing from contacting the bearing face."], "bibtex": "@patent{20240278597,\n    title = {HALF SHAFT TO BEARING CONNECTION TO REDUCE DRIVELINE CLICK},\n    number = {20240278597},\n    year = {2024},\n    note = {File: US20240278597A1-20240822.XML}\n    }", "classification": "B60B2700FI"}, {"title": "WHEEL HUB", "doc_number": "20240278598", "filename": "US20240278598A1-20240822.XML", "abstract": "A sensor is mounted to or embedded in a wheel hub. The sensor node includes a power source and a sensing device that detects and monitors at least one parameter associated with the wheel hub. The sensor node also includes a communication module that communicates via wireless communication signals and a processing device in communication with the sensing device and the communication module. The processing device collects data from the sensing devices, processes the data, and based on that processing, communicates information relating to the wheel hub to a remote server or network. A mesh network of multiple sensor nodes can be applied to multiple different wheel hubs on a vehicle and communicate with a central processing device. The processing device can thus monitor performance and/or operation of each wheel hub.", "detailed_description": ["This application describes wheel hubs with telematics sensors. The sensors are attached to the wheel hub, for instance, by being mounted to or embedded within the hub. The sensors relay the data that they collect or sense wirelessly to a console, network, or other electronic device. This transmitted data can assist in remote diagnostics and predictive maintenance of the wheel hubs. In some cases, multiple sensors embedded in multiple different wheel hubs on a vehicle communicate wirelessly to form a mesh network of sensors. Through the mesh network, the sensors and the related monitoring equipment can all communicate; thereby allowing for the comparison and analysis of information measured pertaining to the multiple wheel hubs. This can facilitate an improvement in the automated diagnostic and maintenance process. Further, mounting the sensors to the wheel hubs, or embedding them within the wheel hubs helps to simplify the installation process and thus reduces the manufacturing costs associated with employing other monitoring systems.", "", "The sensors described herein have wireless communication capabilities and can be embedded or attached to the wheel hubs. Via wireless communication, the sensors can form a network, for instance, via a server that is remote or local to the vehicle. A processing device that communicates with the network can analyze the data from the sensors and make comparisons on multiple wheel hubs on a vehicle.", "", "FIG.1shows a vehicle10, specifically a truck, equipped with a sensor network that includes a plurality of sensor nodes1. The network includes local servers, such as a cab base station2and a trailer base station3, and local display devices such as a local interface or console4, and controller networks, such as vehicle bus5. The system is capable of communicating remotely with a remote server6or other cloud-based devices, for example, via the internet.", "", "InFIG.1, one or more sensor nodes1are associated with individual wheel hubs of the truck10. The sensor nodes1can include a variety of different data collection equipment, including but not limited to position sensors, pressure sensors, temperature sensors, vibration sensors, optical sensors, sound sensors, accelerometers, gyroscopes, global positioning sensors, RFID tags or readers, or laser scanners, among others.", "", "The sensor nodes1can also include data processing equipment, such as a CPU or other microprocessor that takes data received from other sources to generate information about the sensor, wheel hub, and/or vehicle. In some examples, each sensor node1includes both sensing equipment and a processing unit of some type. The sensor nodes1also include communication equipment that allows the nodes1to communicate with other sensors or devices on the network.", "", "The sensor nodes1collect and/or process information about the wheel hub and the associated components and relay the information to local servers. For example, sensors along the cab portion13of the truck10relay information to the cab base station2. The cab base station2can be a server or router on board the vehicle10, and may include a processing device. In some examples, the base station2receives and processes data transmitted from the sensor nodes1and establishes metrics, which may relate to the health or performance of the wheel hubs on the vehicle. These metrics can also be used to perform condition monitoring.", "", "The base station2can transmit the metrics to local devices, such as an interface4(e.g., a local console) on board the cab13of the truck10, or to another user operated device, such as a computer, tablet, smart phone, or the like. In this way, the vehicle operator (e.g., driver) can be aware of the operating conditions of the wheel hub, and take action when appropriate. The base station2may also transmit the metrics to a vehicle bus5, which directly or indirectly controls operation of the vehicle1or vehicle components. The vehicle bus5may also use the metrics to adjust performance or operating parameters to account for the operating conditions of the wheel hubs. In some examples, the base station2may communicate with a remote server6via wireless communication techniques, for instance, via the internet or other cloud-based infrastructures.", "", "FIG.1also shows that sensor nodes1are associated with the hubs on the trailer portion11of the vehicle10. These trailer sensor nodes1communicate with a separate base station3associated with the trailer11. This trailer base station3can thus forward data collected from the trailer sensor nodes1to the base station2on the cab13of the truck10. In other formats, the trailer base station3can collect, process, and store data locally and transmit the data to the truck base station2, or directly to other remote servers6at a time in the future.", "", "In some examples, the sensor network evaluates the data collected by the sensor nodes1and the associated equipment of the system individually per each sensor node. In other examples, the network aggregates information from each sensor and compares and analyzes the information together as a system. In such an example, the network may use the data to detect differences among the sensors at various wheel hubs, thereby highlighting conditions that may warrant attention. The network may also use the data to detect and report on the condition of the components within and around the hubs including the wheels and wheel ends, bearings, seals, tires, and brakes.", "", "FIG.2is a schematic block diagram of one example of a sensor node1, showing the sensors and other components of the node1, as well as the other components of the network with which the node1communicates. In this embodiment, the sensor node1comprises one or more sensors or sensing devices. The sensing devices include an accelerometer21to measure the linear acceleration and a gyroscope22to measure the angular momentum of the sensor node1. The sensor node1also includes a temperature sensor23and a pressure sensor24to measure thermodynamic properties of the hub. The sensor node1may also include a strain sensor that monitors the strain or stretch in the material of a hub.", "", "The sensor node1also includes a power source. The power source can include a battery25, a capacitor, and/or a power input (e.g., a port for receiving electrical power from an outside source). The power source can also include a generator26, such as a thermoelectric generator that generates electricity from thermal energy. In some examples, the generator can include a generator that turns kinetic energy into electrical energy. For example, the generator may be able to convert movement or vibrations in the wheel hub into electricity that powers the sensor node. The generator26can also operate in connection with the capacitor25so that electricity can be stored in the capacitor for later harvesting. The power source supplies power to operate the sensor node1and the associated components.", "", "The sensor node1also includes a processor15, which communicates with the various sensors and components of the sensor node1. The processor15can also communicate wirelessly via a communication module16, which utilizes one or more of a variety of wireless communication techniques, including radio frequency, infrared, WiFi, and Bluetooth, to name a few examples, to communicate with remote devices. In this way, the sensor node1can communicate with other remote devices, such as the base stations2or3shown inFIG.1, with other sensor nodes in a mesh network30, or with other networks or network devices. In some examples, the processor15aggregates data from the various sensor devices and generates metrics from that data, but in other examples the processor15collects and transmits the data without providing any particular processing or analysis. The processor15can also receive data and commands wirelessly through the communication module16. For example, the sensor can receive commands from a control interface in the cab of the vehicle1, or via a remote computer via the internet.", "", "The sensor node1ofFIG.2is just an example configuration, and other examples may have components that include more, less, or other components not shown inFIG.2, or combinations thereof.", "", "FIGS.3and4show various locations for mounting or embedding a sensor node1relative to a wheel hub.FIG.3shows different sensor nodes embedded in a variety of different locations of a wheel hub20. For example, sensor node7is embedded in the oil fill plug of the hub20. Sensor node8is mounted to the outside of the inner portion of the hub20. Sensor node9is fastened or embedded in a pocket of the hub20. The sensor node9can be potted in using epoxy or other potting compound into a cast-in pocket of the hub. Alternatively, the sensor node9could be fastened or potted into a machined-in pocket of the hub20.FIG.4shows a sensor node embedded14embedded in a hubcap17that is mounted on a hub.", "", "The sensor boards can be affixed to a cast-in pocket in the hub with machined features specifically for mounting the sensor board. The potting epoxy compound can protect the sensor board from the harsh environment of the wheel end. This allows for vibrations to transfer into the vibration sensor because it has rigid contact with the hub. It also allows good heat transfer from the hub to enable energy harvesting to power the sensor node.", "", "In operation, the sensor nodes1can be used to detect a variety of different parameters. For example, the sensor node1may be configured to detect hub rotational speed using a gyro sensor, an accelerometer sensor, or combinations thereof. The hub rotational speed can be used in connection with other data and calculations to improve the accuracy of the calculations pertaining to the sensors.", "", "In one example, the accelerometer and gyroscope sensors detect damage or adjustment problems associated with bearings in the wheel hub. The sensors detect and monitor the magnitude of vibration at specific frequencies corresponding to the frequency multipliers of the bearing, and take into account the rotational speed of the hub. The accelerometer vibration data help to detect brake component irregularities. The accelerometer data may also be used to detect tire imbalance or damage by looking at the magnitude of vibration at the frequency corresponding to the rotational speed of the hub.", "", "The described systems and sensors can also be used to detect bearing damage, brake damage, and other wheel end issues by monitoring the temperature of the hub, and comparing it to ambient air temperature and the other hubs on the vehicle.", "", "In some examples of operation, the sensor nodes are used to monitor the lubrication level in the hub using a pressure sensor measuring inside the hub cavity. For example, the lubrication level can be determined in proportion to the height of the lubrication fluid column over the sensor and the rotational velocity of the hub.", "", "Certain embodiments may use an accelerometer, gyroscope, or combinations thereof, mounted to a wheel hub to measure the hub speed. The sensor nodes can then wirelessly transmit the hub speed to the vehicle (or to processing equipment associated with the vehicle), and the data can be used to provide a speed signal. Such a speed signal can be used to monitor anti-lock braking systems or other functionality. This can provide benefits over existing systems. For example, existing systems wired sensor can be used to measure the hub rotation speed. Information from these wired sensors is transferred utilized by braking systems on the truck to monitor various parameters. These wired sensors can fail or provide unreliable information. For instance, the sensors can develop issues caused from wear and damage to the sensors, the sensors moving out of range, and corrosion that can occur on the sensors, in particular, the wired parts of the sensors. Replacing these systems with the wireless sensor nodes described herein, by embedding the wireless sensors into the wheel hub for instance, can improve the performance and reliability of the sensors.", "", "In some embodiments, a sensor mounted to a wheel hub may be configured to use an accelerometer, gyroscope, or combinations thereof can to track the cumulative number of rotations of the wheel hub. The collected rotation data could then be used, for example, things tracking the mileage, or distance traveled, of the vehicle and/or trailer.", "", "In another method of operation, a sensor node mounted to a wheel hub can monitor strain in the material of a wheel hub. The collected data can then be used to measure hub speed. For example, as a hub rotates, it can experience alternating stress. By measuring the strain in the hub via a strain sensor and measuring the rate of the fluctuations in the strain, the system can estimate the rotation speed of the hub. This method can provide a cleaner signal than that provided by other types of sensors typically used to monitor hub speed while also limiting the sources of noise into the signal.", "", "In another example, the mounted strain sensor can be used to measure hub cumulative rotations for tracking mileage or part life.", "", "In another example, a sensor can be configured to measure wheel stud stretch or strain in wheel studs. In this way, when the sensors are embedded or mounted in a wheel hub, the hub will detect and report the condition of the wheel to hub bolted joint.", "", "This application describes preferred embodiments and examples of wireless wheel hub sensors for illustrative purposes, not intended to be limiting. Those skilled in the art will recognize that the described examples could be modified and/or combined with one another without departing from the scope described herein. Further, features of one embodiment or example may be combined with features of other embodiments or examples to provide still further embodiments or examples as desired. All references that this application cites, discusses, identifies, or refers to are hereby incorporated by reference in their entirety."], "claims": ["1 - 16 . (canceled)", "a housing having a central opening to receive a spindle of a vehicle; a wheel mounting portion of the housing to have a wheel secured thereto; a bearing in the central opening of the housing to rotatably connect the housing to the vehicle spindle; a sensor node rotatable with the housing and mounted to the housing external to the central opening, the sensor node comprising: a temperature sensor configured to detect a temperature external to the central opening; and communication circuitry operatively connected to the temperature sensor, the communication circuitry operable to wirelessly communicate data indicative of the temperature to an external device, the data configured to facilitate a determination of bearing damage based at least in part upon the detected temperature.", "18 . The wheel hub of claim 17 in combination with the external device, the external device configured to determine the bearing damage based at least in part upon a comparison of the temperature and an ambient air temperature.", "19 . The wheel hub of claim 17 in combination with the external device, the external device configured to determine the bearing damage based at least in part upon a comparison of the temperature and a temperature of another wheel hub of the vehicle.", "20 . The wheel hub of claim 17 wherein the communication circuitry is operable to communicate the data to the external device via a base station of the vehicle.", "wherein the base station is configured to relay the data to a vehicle-based computer and/or a server computer.", "22 . The wheel hub of claim 17 wherein the temperature sensor is configured to detect a temperature of a portion of the housing adjacent the sensor node.", "wherein the sensor node is mounted to the radially outer surface of the housing.", "24 . The wheel hub of claim 17 wherein the sensor node is mounted to the housing outboard of the wheel mounting portion.", "wherein the wheel mounting portion comprises a flange extending radially outward from the tubular side wall intermediate the opposite ends of the tubular side wall; and wherein the sensor node is mounted to the tubular side wall of the housing spaced axially from the opposite ends.", "wherein the sensor node is in one of the recesses.", "wherein the sensor node overlaps the bearing in a radial direction.", "wherein the communication circuitry is operatively connected to the accelerometer and/or gyroscope, the communication circuitry operable to wirelessly communicate data indicative of the acceleration to the external device.", "29 . The wheel hub of claim 17 wherein the wheel mounting portion comprises a flange and studs extending from the flange.", "30 . The wheel hub of claim 17 wherein the housing has a unitary, one-piece construction.", "31 . The wheel hub of claim 17 wherein the sensor node comprises a battery to provide electrical power to the sensor and the communication circuitry.", "32 . The wheel hub of claim 17 wherein the communication circuitry is configured to wirelessly communicate the data via a Bluetooth communication protocol.", "33 . The wheel hub of claim 17 wherein the sensor node is potted in a pocket of the housing.", "a base station of the vehicle; an on-board computer of the vehicle; a portable electronic device; or another wheel hub of the vehicle."], "bibtex": "@patent{20240278598,\n    title = {WHEEL HUB},\n    number = {20240278598},\n    year = {2024},\n    note = {File: US20240278598A1-20240822.XML}\n    }", "classification": "B60B2700FI"}, {"title": "CASTER ASSEMBLIES HAVING CAM-OPERATED BRAKES", "doc_number": "20240278599", "filename": "US20240278599A1-20240822.XML", "abstract": "Caster assemblies are disclosed herein. An example caster assembly includes a caster frame assembly including a caster frame, a caster mounting plate, and a brake arm; a pin having a first end and a second end opposite the first end, the second end to engage the brake arm; and a lever arm having a third end and a fourth end opposite the third end, the lever arm to pivot relative to the caster frame assembly between a first position and a second position, movement of the lever arm to the first position to cause the fourth end of the lever arm to actuate the pin in a first direction to move the brake arm to the engaged position to restrict rotation of the wheel.", "detailed_description": ["Engine installation systems can include a transport dolly to transport an engine across a tarmac or flight deck to an aircraft. The transport dolly uses brakes to secure the engine installation system in place on flat or sloped ground or surface. For example, when the engine installation system is in position beneath an engine bay of the aircraft, an operator can engage one or more brakes to prevent and/or restrict movement of the dolly and safely raise an adapter cradle to lift the engine (e.g., into place) relative to an engine bay. Furthermore, engine installation systems can be operated on a flight deck of an aircraft carrier, which can rock or tilt due to the waves. Thus, an operator may engage the brakes due to movement of the ground surface (e.g., flight deck).", "", "Example transport dollies disclosed herein are described in connection with example engine installation systems for transporting and/or installing engines onto aircraft. However, in some examples, disclosed transport dollies and disclosed caster assemblies can be implemented on installation systems for weapons (e.g., missiles, artillery, etc.), fuel tanks, structural components (e.g., beams, ribs, stringers, panels, etc.), communication apparatus (e.g., radars, etc.), or the like, and/or other applications that employ a transport dolly.", "", "Some known engine installation systems use dead man brakes to lock or restrict movement of one or more wheels of a transport dolly. Dead man brakes typically include a handle (e.g., a bail handle, etc.) that operates a cable or hydraulics to engage or release brakes of a wheel. For example, the handle is coupled to a brake via a brake line (e.g., a hydraulic brake line, a cable, etc.) such that when the handle is engaged (e.g., held), the brakes are disengaged, and when the handle is disengaged (e.g., released), the brakes are engaged. However, dead man brakes are associated with increased weight, which increases the push force required to transport goods (e.g., an engine) on the transport dolly. Furthermore, dead man brakes are prone to increased repairs or maintenance and are typically impractical and/or unnecessary when the transport dolly is utilized on flat, steady ground (e.g., in a hangar). In some examples, dead man brakes employ an additional wheel that supports the brake.", "", "Some known engine installation systems use caster brakes to lock or restrict movement of one or more wheels of a transport dolly. Caster brakes typically include a foot-activated pedal located adjacent a caster frame. When the pedal is pressed/activated, a brake pad engages a wheel of the engine installation system and restricts rotation thereof. Such caster brakes are simpler than dead man brakes and are typically lighter, less complex, and more reliable. However, foot-activated caster brakes can be challenging to activate, especially when the transport dolly is in motion and supporting a relatively heavy load (e.g., an aircraft engine). For example, a position of a pedal on the caster brakes can be difficult for the operator to reach based on a size of the pedal, a location of the pedal, etc. Additionally, pedals of caster brakes protrude from the caster frame in one or more directions, such as sideways and away from a dolly frame. Moreover, when the size of the pedal is increased to improve accessibility of the caster brake, the pedals can also be prone to unintentional or inadvertent activation and/or release by a nearby operator, object, etc. Furthermore, when the caster brake uses a locking mechanism (e.g., latch, spring, etc.) to keep the brake engaged, the components of the mechanism can wear, weaken, or otherwise reduce the force that the brake applies to the wheel.", "", "Examples disclosed herein employ hand-operated caster brake assemblies for a transport dolly. In some instances, caster brake systems disclosed herein can be implemented with engine transportation systems. Example caster assemblies disclosed herein employ a lever arm mounted on a dolly frame of the transportation dolly. Example lever arms disclosed herein employ a cam at one end to remotely operate a brake arm of a caster wheel (e.g., to move a brake arm between an engaged position and a released position). The cam of the lever arm interfaces with a pin, and the pin interfaces with (e.g., operatively couples) the cam and a brake arm of a brake assembly. As such, the cam, the pin, and the brake arm define a mechanical linkage. The brake arm is rotatably coupled to a caster frame, and a spring influences or biases the brake arm toward a released position. Thus, when the lever arm is moved from a first position (e.g., a lowered position relative to the dolly frame) to a second position different than the first position (e.g., a raised position relative to the dolly frame), the cam allows the brake arm to release or disengage the wheel (e.g., a released position), respectively. Alternatively, when the lever arm is moved to the first position from the second position, the cam applies a compressive force on the pin, which causes the brake arm to engage the wheel (e.g., an engaged position).", "", "Example caster assemblies disclosed herein apply greater compressive forces on the brake arm, which improves engagement performance and/or movement restriction of one or more caster wheels than conventional caster brakes (e.g., foot-operated caster brakes). For example, the cam and the pin have certain properties (e.g., shape, length, diameter, material, etc.) to ensure compressive forces cause the brake arm to engage the wheel. Additionally, example cam-operated caster assemblies disclosed herein can be easier to engage than traditional caster brakes. For instance, example lever arms are coupled to the dolly frame, which the operator can access and activate by hand (e.g., as opposed to a foot). Furthermore, the length of example lever arms is increased relative to pedals of conventional caster brakes, which corresponds to greater torque and greater compressive force on the brake arm when the operator applies a given force on the lever arm. Moreover, example caster assemblies disclosed herein include fewer components that are prone to wear and/or failure. For example, the lever arm, the cam, and the pin are the primary sources of the compressive force that causes the brake arm to engage the wheel, and such components have increased durability, reduced mechanical complexity, improved reliability, etc.", "", "FIG.1is a side view of an example transport dolly100in accordance with teachings of this disclosure. The transport dolly100of the illustrated example includes a dolly frame102supported by a caster brake assembly system104. The caster brake assembly system104is to facilitate movement of the transport dolly100and/or to selectively restrict or prevent movement of the transport dolly100relative to a ground surface10. As such, the transport dolly100can be rotated or turned (e.g., clockwise and/or counterclockwise) within a turning radius about a first axis12A, transported along a straight path (e.g., in a forward direction14A or a rearward direction14B along a second axis12B or a third axis12C) and/or transported along a skewed path (e.g., in a path along a combination of the second axis12B and the third axis12C). To facilitate movement of the transport dolly100, the transport dolly100includes one or more transport handles106rotatably and/or operatively coupled to the dolly frame102. The transport handles106are configured to be gripped by a user to facilitate transporting the transport dolly100across the ground surface10, such as by pushing or pulling on one or more of the transport handles106.", "", "FIG.2is a front view of the example transport dolly100ofFIG.1. The caster brake assembly system104of the illustrated example includes a plurality of caster assemblies200. Each of the caster assemblies200of the illustrated example defines a rotational axis202and a swivel axis204. The rotational axis202is substantially horizontal or parallel to the ground surface10and the swivel axis204is substantially vertical or perpendicular relative to the ground surface10. The swivel axis204of the illustrated example is substantially parallel relative to the first axis12A. Thus, the rotational axis202of the illustrated example is substantially perpendicular relative to the swivel axis204.", "", "As used herein, the term “vertical,” is used to describe a direction, a dimension, an orientation, etc. and is intended to refer to an axis that is parallel to a direction of a force of gravity and/or that is perpendicular to the ground surface10. However, such descriptions are not limited to examples in which ground surface10is perfectly level and/or perpendicular to the direction of the force of gravity. For example, the first axis12A (e.g., a vertical axis) may be described as extending perpendicular to the ground surface10and/or to a portion thereof even when ground surface10is uneven, angled, tilted, and/or otherwise does not extend entirely and/or perfectly perpendicular to the direction of the force of gravity. Additionally, as used herein, a component, path, etc. may be described as moving and/or extending vertically, and/or in a vertical direction, when the component, path, etc. moves and/or extends along a direction at least substantially parallel to the first axis12A even in examples in which such motion and/or extent is not perfectly parallel to the first axis12A.", "", "As used herein, the term “horizontal,” as used to describe a direction, a dimension, an orientation, etc. and is intended to refer to an axis that is orthogonal to a direction of a force of gravity and/or that is parallel to the ground surface10. However, such descriptions are not limited to examples in which ground surface10is perfectly level and/or perpendicular to the direction of the force of gravity. For example, the second axis12B and/or the third axis12C (e.g., horizontal axes) may be described as extending parallel to the ground surface10and/or to a portion thereof even when ground surface10is uneven, tilted, and/or otherwise does not extend entirely and/or perfectly perpendicular to the direction of the force of gravity. Additionally, as used herein, a component, path, etc. may be described as moving and/or extending horizontally, and/or in the forward direction14A or the rearward direction14B when the component, path, etc. moves and/or extends along a direction at least substantially parallel to the ground surface10and/or a horizontal reference line11, even in examples in which such motion and/or extent is not perfectly parallel to the horizontal reference line11.", "", "FIG.3is a perspective view of a caster assembly300disclosed herein that can implement the caster brake assembly system104and/or one or more of the caster assemblies200ofFIGS.1and2. The caster assembly300of the illustrated example includes a wheel302, a caster frame assembly304, a dolly frame assembly306, a brake arm308, a brake arm bracket310, and a lever arm312.", "", "The caster frame assembly304of the illustrated example rotatably supports the wheel302about the rotational axis202. To enable rotation of the wheel302about the rotational axis202, the caster frame assembly304includes a caster frame314(e.g., a yoke, a leg, a prong, etc.). Specifically, the caster frame314includes an aperture aligned (e.g., coaxially aligned) with the rotational axis202and receives a fastener, a bushing, a bearing, etc., of the wheel302(e.g., to enable rotation of the wheel302relative to the caster frame314about the rotational axis202). In some examples, the wheel302(e.g., a wheel center) is supported by a radial bearing to reduce a force required to rotate the wheel302about the rotation axis202. The wheel302of the illustrated example can be made of a hard material, such as rubber (e.g., air pneumatic, solid pneumatic, etc.), plastic (e.g., phenolic, etc.), polymer (e.g., polyurethane, etc.), metal (e.g., iron, etc.), etc. In such examples, the wheel302can have a hardness that corresponds with a 70D rating on a durometer shore hardness scale to facilitate ease of movement of the transport dolly100(FIG.1) while reducing wear of the wheel302. In some examples, the wheel302has a diameter302A of 8.5 inches. Alternatively, the diameter302A may be greater than or less than 8.5 inches.", "", "Additionally, the caster frame assembly304is pivotally coupled to the dolly frame assembly306to enable the wheel302to swivel relative to the dolly frame102about the swivel axis204. To enable the wheel302to swivel about the swivel axis204, the caster frame314of the illustrated example is rotatably coupled to a caster mounting plate316of the caster frame assembly304. More specifically, the caster frame314includes a flange318that interfaces with a platform320of the caster mounting plate316. The platform320can be mounted on the flange318with an interposing thrust bearing to facilitate rotation of the caster frame314.", "", "The caster frame assembly304of the illustrated example includes the brake arm308and the brake arm bracket310. In particular, the brake arm bracket310is fixed to the caster frame314. Additionally, the brake arm308of the illustrated example is pivotally coupled to the brake arm bracket310. As such, the brake arm308pivots relative to the caster frame314via the brake arm bracket310.", "", "The dolly frame assembly306couples the caster frame assembly304and the frame102. To couple the caster frame assembly304and the frame102, the dolly frame assembly306of the illustrated example includes a dolly mounting plate322and a plurality of struts324. The mounting plate322of the illustrated example is coupled (e.g., fixed) to the frame102(e.g., via welding, fasteners, etc.). Additionally, the struts324are fastened (e.g., welded) to the dolly mounting plate322and the dolly frame102. The struts324inhibit bending or buckling of the caster assembly300. In the illustrated example, the dolly frame assembly306includes four struts324. In some examples, the dolly frame assembly306can include any number of struts324, such as, six, eight, etc.", "", "To operate the brake arm308, the caster assembly300of the illustrated example includes the lever arm312. The lever arm312is coupled to the dolly frame102via a clevis joint336. The clevis joint336includes a bracket338, a hinge pin340, and a shim342. The bracket338is coupled to the dolly frame102via fasteners (e.g., bolts). The shim342is positioned between the bracket338and the dolly frame102. In some examples, the shim342is made of a different material (e.g., a polymer, beryllium copper, etc.) than the bracket338and/or the dolly frame102to prevent corrosion between materials of the shim342, the bracket338and/or the dolly frame102. In some examples, the bracket338and/or the dolly frame102may be stainless steel and/or another suitable material (e.g., iron, steel alloy, etc.). In some examples, the caster assembly300does not include the shim342.", "", "In the illustrated example, the clevis joint336allows the lever arm312to rotate about a hinge axis340A defined by the hinge pin340. In some examples, the swivel axis204is positioned orthogonal to the hinge axis340A. The hinge axis340A may or may not intersect the swivel axis204. In some examples, the hinge axis340A is aligned (e.g., is substantially parallel) with the third axis12C. In some examples, the swivel axis204is aligned (e.g., substantially parallel) with the first axis12A. In the illustrated example, rotation of the lever arm312about the hinge axis340A is decoupled from rotation of the caster frame assembly304about the swivel axis204. In other words, the wheel302is able to swivel relative to frame102about the swivel axis204without the lever arm312also swiveling relative to the frame102about the swivel axis204. In other words, the lever arm312can only pivot relative to the frame102about the hinge axis340A and does not swivel relative to the frame102relative to the swivel axis204.", "", "As shown inFIG.3, the caster assembly300includes a lock343to fix the orientation of the caster frame assembly304(and the wheel302) relative to the dolly frame assembly306and/or the dolly frame102. The lock343includes an upper sleeve section344, a lower sleeve section346, and a locking pin348. In the illustrated example, the upper sleeve section344protrudes from the platform320of the caster mounting plate316, and the lower sleeve section346protrudes from the flange318of the caster frame314. The upper sleeve section344aligns with the lower sleeve section346to receive the locking pin348therebetween. When the locking pin348is inserted with the lock343, the locking pin348can be rotated by a certain degree (e.g., ninety degrees) to fix the orientation of the caster frame314relative to the caster mounting plate316. As shown, the flange318includes a plurality of slots334(or holes). The slots334of the illustrated example are circumferentially spaced relative to swivel axis204. In the illustrated example, the slots334are radially spaced about the swivel axis204at approximately 45-degree increments. However, in other examples, the slots334can be radially spaced relative to the swivel axis204about approximately 15-degree increments, 30-degree increments, 60-degree increments, or any other desired increment(s). The lower sleeve section346is removable from the flange318and insertable into another one of the slots334. As such, the caster frame assembly304and the wheel302can be fixed in a certain orientation (e.g., 45 degrees, 90 degrees, etc.) other than the orientation (e.g., zero degrees) depicted inFIG.3.", "", "FIG.4is an exploded perspective view of the caster assembly300ofFIG.3. To actuate or move the brake arm308via the lever arm312, the caster assembly300of the illustrated example includes a pin402. Specifically, the lever arm312includes a cam404(or a cam surface profile) to actuate the pin402. Specifically, rotation of the lever arm312relative to the dolly frame102in a first rotational direction405A is to cause the cam404to actuate or engage the pin402to enable the brake arm308to move to an engaged position to restrict or prevent rotation of the wheel302(e.g., about the rotation axis202). Rotation of the lever arm312relative to the dolly frame102in a second rotational direction405B opposite the first rotational direction405A is to cause the cam404to release or disengage the pin402to enable the brake arm308to move to a released position to enable rotation of the wheel302. Moreover, the cam404includes an eccentric shape that maintains a first (e.g., lowered) position of the lever arm312until an operator applies a force to the lever arm312in the second rotational direction405B.", "", "The lever arm312of the illustrated example includes a first hole406(e.g., a first through hole) to receive the hinge pin340and a second hole408(e.g., a second through hole) to receive a spring pin410. In the illustrated example, the first hole406intersects with the second hole408(e.g., a longitudinal axis of the first hole406is perpendicular relative to a longitudinal axis of the second hole408). Furthermore, as shown, the hinge pin340includes a third hole412(or third through hole) that aligns with the second hole408(e.g., when the lever arm312and the hinge pin340are coupled to the bracket338). In other words, the spring pin410can be disposed within the second hole408and the third hole412when the hinge pin340is disposed within the first hole406. As such, the spring pin410intersects the hinge pin340to hold the hinge pin340within the lever arm312and the bracket338. In some examples, the spring pin410is a coiled spring pin. In other examples, the spring pin410is a slotted spring pin or any other suitable biasing element or spring.", "", "In the illustrated example ofFIG.4, the pin402has an overall length414between a first end416and a second end418opposite the first end416. In some examples, the first end416of the pin402extends at least partially through the dolly frame102, and the second end418extends at least partially through the caster frame314. Furthermore, the pin402includes a first portion420and a second portion422. The first portion420has a first diameter424, and the second portion422has a second diameter426different than (e.g., less than) the first diameter424. For example, the first diameter424can be 0.5 inches (in), 0.625 in, 0.75 in, etc. In another example, the second diameter426can be 0.25 in, 0.272 in, 0.30 in, etc. The pin402of the illustrated example includes a transitional portion428positioned between the first end416and the second end418. The transitional portion428defines a tapered surface between the first diameter424and the second diameter426. In some examples, the transitional portion428defines an abrupt change or stepped surface between the first diameter424and the second diameter426. The first portion420of the pin402is defined between the first end416of the pin402and the transitional portion428of the pin402. The second portion422of the pin402is defined between the second end418of the pin402and the transitional portion428.", "", "In the illustrated example ofFIG.4, the caster assembly300includes a first bushing434and a second bushing436disposed within a sleeve438. The sleeve438extends through the dolly frame102and is flush or aligned with a first surface440(e.g., an upper surface) of the dolly frame102. In some examples, the sleeve438is flush or aligned with the first surface440and a second (or lower) surface442of the dolly frame102. The first portion420of the pin402is disposed within the dolly frame102and is supported by at least one of the first bushing434and/or the second bushing436. More specifically, the first bushing434and the second bushing436are coupled to (e.g., fixed within) the sleeve438via an interference fit. The first portion420of the pin402is slidably disposed within the first bushing434and the second bushing436. As such, inner diameters of the first bushing434and the second bushing436correspond to the first diameter424of the first portion420of the pin402. Thus, the first bushing434and the second bushing436align (e.g., coaxially align) with the pin402relative to the swivel axis204(e.g., vertically align). As a result, the pin402(or a central axis of the pin402) is substantially parallel relative to the first axis12A. In some examples, the first bushing434and the second bushing436include (e.g., are composed of) aluminum bronze (e.g., CuAl5, CuAlFe3, etc.) to provide a smooth (e.g., a low friction) contact and/or non-corrosive contact between the pin402and the bushings434,436.", "", "In some examples, the caster assembly300includes means for rotatably supporting the wheel302of the caster assembly300. For example, the means for rotatably supporting the wheel302can be implemented by the dolly frame assembly306and/or the caster frame314. In some examples, the caster assembly300includes means for locking rotation of the wheel302operatively coupled to the means for rotatably supporting the wheel302. For example, the means for locking can be implemented by the brake arm308, the pin402and/or the lever arm312. In some examples, the caster assembly300includes means for moving (e.g., activating or deactivating) the means for locking rotation between a brake position to restrict movement of the wheel302and a release position to enable rotation of the wheel302. For example, the means for moving can be implemented by the pin402. In some examples, the caster assembly300includes means for operating the means for locking rotation. The means for operating is rotatably coupled relative to the means for rotatably supporting the wheel302. Furthermore, rotation of the means for operating between a first position and a second position is to cause the means for locking rotation to move between the brake position and the release position via the means for moving. For example, the means for operating can be implemented by the lever arm312.", "", "FIG.5is a perspective, cross-sectional view of the caster assembly300ofFIG.3. In the illustrated example ofFIG.5, the lever arm312has a first dimension502(e.g., a length) between a third end504and a fourth end506opposite the third end504. As shown, the fourth end506of the lever arm312includes the cam404to engage the pin402. The lever arm312includes a base508(or base portion) defining the fourth end506and a handle510(or handle portion) defining the third end504. The cam404has an irregular or eccentric shape (e.g., surface profile) to engage (e.g., contacts, interfaces with, etc.) the first end416of the pin402. The shape of the cam404corresponds to an eccentric arc with a varying distance between the first end416of the pin402and the hinge axis340A. As such, when the lever arm312is lowered, the cam404rotates, and the distance between the first end416and the hinge axis340A increases.", "", "The handle510is oriented at a first angle512relative to the base508. In some examples, the first angle512is between 25 degrees and 35 degrees, such as 30 degrees, 29 degrees, 31 degrees, etc. Furthermore, the hinge pin340extends through the bracket338and the fourth end506of the lever arm312to allow the lever arm312and the cam404to pivot (e.g., rotate) relative to the dolly frame102. Additionally, the lever arm312includes a first lip514(e.g., a first stop) and a second lip516(e.g., a second stop) at the fourth end506and on opposing sides of the cam404. Thus, the cam404extends circumferentially along the fourth end506between the first lip514and the second lip516. As such, when the lever arm312is in a first position (e.g., as shown inFIG.5), the first lip514abuts the first end416of the pin402. Similarly, when the lever arm312is in a second position (e.g., as shown inFIG.7), the second lip516abuts the first end416of the pin402. Thus, when an operator or user manually rotates the lever arm312to operate (e.g., engage or disengage) the caster assembly300, the first lip514and the second lip516prevent the lever arm312from rotating beyond an arcuate path defined between the first lip514and the second lip516.", "", "Furthermore, the caster assembly300includes a spring518to influence or bias the brake arm308. Specifically, the caster assembly300and/or the spring518are structured to enable the spring518to bias the brake arm308toward a released position when the lever arm312is rotated to cause the cam404to release the pin402so that the pin402does not apply a force to the brake arm308. That is, when the lever arm312is in a second (e.g., raised) position, the spring518causes the brake arm308to rotate and disengage the wheel302. The spring518is disposed within a fourth hole520(e.g., an angled, slanted or a diagonal bore, a through hole, an opening, etc.) of the brake arm bracket310. In some examples, the spring518is coupled to and/or disposed within a sleeve and/or a counterbore of the fourth hole520. In some examples, the spring518does not bottom out when the lever arm312is in a first position (e.g., a brake position).", "", "In the illustrated example, the brake arm308includes a fifth through hole522(e.g., a straight, bore or opening) to couple the brake arm308and the brake arm bracket310. For example, the brake arm308includes a fastener (e.g., a bolt, a pin, a spring pin, etc.) disposed in the fifth through hole522to couple the brake arm308to the brake arm bracket310and to enable rotation of the brake arm308about the pivot axis522A. As such, the fifth through hole522defines a pivot axis522A about which the brake arm308rotates. Thus, the brake arm308rotates about the pivot axis522A to move between the engaged and released positions.", "", "As shown inFIG.5, the caster assembly300includes a buffer pad524and a brake pad526coupled (e.g., chemically bonded, welded, etc.) to the brake arm308. In some examples, the lever arm312is made of a first material (e.g., stainless steel). The pin402is made of a second material (e.g., beryllium copper) different than the first material to ensure the contacting components do not corrode, dent, abrade, and/or otherwise become damaged. For example, the caster assembly300can be implemented on an aircraft carrier where salt water or vapor acts as an electrolyte and causes corrosion between two engaging components formed from the same or like materials or metals. Thus, because the pin402is composed of the second material, the contacting components (e.g., the lever arm312and/or the pin402) are less susceptible to corrosion. In some examples, the brake arm308can be made of stainless steel, beryllium copper, iron, steel, an alloy, and/or any other material(s). The buffer pad524of the illustrated example provides a pin/brake arm interface to prevent or reduce damage to the pin402and/or the brake arm308during operation. In some examples, the buffer pad524is made of stainless steel, steel alloy, beryllium copper alloy, and/or any other suitable material(s).", "", "The brake arm308supports the brake pad526and causes the brake pad526to move relative to the wheel302. The brake pad526of the illustrated example can be removed or separated from the brake arm308to enable replacement of the brake pad526when worn. In other examples, the brake pad526and the brake arm308are a single, unified part. The brake pad526includes one or more ridges that run parallel to the third axis12C. In some known caster brakes, a corresponding brake arm may include a high friction (e.g., textured, tacky, etc.) surface to contact a wheel. The brake pad526ofFIG.5includes more surface area with multiple contact lines for improved interfacing with the hard material of the wheel302.", "", "FIG.6is a partial, cross-sectional side view of the caster assembly300shown in an example braked or engaged position600. In the illustrated example ofFIG.6, the lever arm312is in a first position602(e.g., a lowered position). Rotation of the lever arm312(in the first rotational direction405A) to the first position602(shown inFIG.6) causes the fourth end506or the cam404of the lever arm312to actuate the pin402in a first linear direction603(e.g., in a downward direction in the orientation ofFIG.6) toward the brake arm308. In the illustrated example, the first linear direction603is parallel to the first axis12A. Specifically, the cam404of the lever arm312is positioned to engage the first end416of the pin402to apply a force (e.g., a downward force) to the pin402that causes the pin402to slide in the sleeve438(e.g., in a downward direction in the orientation ofFIG.6). Furthermore, the pin402causes the brake arm308to pivot about the pivot axis522A in the first rotational direction405A to cause the brake pad526to engage the wheel302. In other words, the brake arm308pivots about the pivot axis522A against the biasing force of the spring518to move the brake pad526of the brake arm308against the wheel302to restrict rotation of the wheel302(e.g., about the rotational axis202). Thus, the lever arm312transmits a force to the brake arm308(e.g., against the bias of the spring518) to cause the caster assembly300to move to the engaged position600.", "", "In the illustrated example ofFIG.6, the base508has a longitudinal axis604that is oriented non-parallel relative to the swivel axis204when the brake arm308is in an engaged position606. More specifically, the longitudinal axis604of the base508is oriented at a second angle608relative to a first surface610(e.g., an upper surface) of the dolly frame102when the lever arm312is in the first position602. In some examples, the second angle608corresponds to (e.g., is equal to) the first angle512. In other examples, the second angle608is different (e.g., greater, or less) than the first angle512.", "", "FIG.7is a partial, cross-sectional side view of the caster assembly300shown in an example released position700. In the illustrated example ofFIG.7, the lever arm312is in an example second position702(e.g., a raised position). In the released position700, the brake pad526disengages the wheel302. Specifically, as the lever arm312is rotated in the first rotational direction405A to the second position702, the cam404reduces the force (e.g., the downward force) acting on the pin402(e.g., the first end416of the pin402). In some examples, the cam404releases the pin402. In turn, the spring518applies a force to the brake arm308to move the brake arm308into a disengaged position704. In other words, the spring518causes the brake pad526of the brake arm308to pivot about the pivot axis522A in the second rotational direction405B in a direction away from the wheel302. The brake arm308, under the bias of the spring518and engagement of the buffer pad524and the pin402, causes the pin402to move in a second linear direction705opposite the first linear direction603ofFIG.6in a direction toward the lever arm312. In other words, the brake arm308applies a force to the second end418of the pin402to cause the pin402to slide within the sleeve438toward the lever arm312(e.g., an upward direction in the orientation ofFIG.7).", "", "The first angle512between the base508and the handle510results in the lever arm312having a second dimension706(e.g., an overall width) when in the second position702. A ratio of the first dimension502to the second dimension706may be between 2.50 and 3.00 (e.g., 2.57, 2.72, 2.83, etc.). Furthermore, because of the limited rotational path defined by the first lip514and the second lip516of the lever arm312, the base508of the lever arm312is oriented substantially parallel to the swivel axis204when the lever arm312is in the second position702. More specifically, the longitudinal axis604of the base508is substantially parallel relative to the swivel axis204when the lever arm312is in the second position702. In the illustrated example ofFIG.7, when the caster assembly300and the brake arm308are in the released position700, a clearance708is provided between the brake pad526and the wheel302. The clearance708can be between 0.25 inches and 0.30 inches, such as 0.27 inches, 0.28 inches, etc. The brake pad526disengages the wheel302by the clearance708to ensure that the brake pad526does not engage the wheel302during rotation of the wheel302when the caster assembly300is in the released position700.", "", "FIG.8is a top view of the transport dolly100ofFIG.1. The dolly frame102of the illustrated example can include a plurality of beams802(e.g., multiple square or hollow sections). The beams802of the illustrated example can be made of one or more metals (e.g., steel, alloy, etc.). Specifically, the dolly frame102of the illustrated example includes a first side beam802A, a second side beam802B, a front beam802C, and a rear beam802D. The first side beam802A is opposite the second side beam802B, and the front beam802C is opposite the rear beam802D. In other words, the front beam802C is coupled (e.g., welded, fastened, etc.) to respective first ends803of the first and second side beams802A,802B, and the rear beam802D is coupled (e.g., welded, fastened, etc.) to respective second ends805of the first and second side beams802A,802B opposite the respective first ends803.", "", "Additionally, the caster brake assembly system104of the illustrated example includes the plurality of caster assemblies200. For example, the transport dolly100of the illustrated example includes a first caster assembly804A, a second caster assembly804B, a third caster assembly804C, and a fourth caster assembly804D. For example, the caster assembly300ofFIGS.3-7can implement the first caster assembly804A, the second caster assembly804B, the third caster assembly804C and/or the fourth caster assembly804D ofFIG.8. The first caster assembly804A and the second caster assembly804B are coupled (e.g., attached) to the first side beam802A, and the third caster assembly804C and the fourth caster assembly804D are coupled (e.g., attached) to the second side beam802B. In the illustrated example ofFIG.8, the first caster assembly804A and the third caster assembly804C are proximate to the front beam802C (e.g., within six inches, one foot, two feet, etc.). Furthermore, the second caster assembly804B and the fourth caster assembly804D are proximate the rear beam802D (e.g., within six inches, one foot, two feet, etc.). In some examples, the transport dolly100can include any number of caster assemblies200. For example, the transport dolly100can include six of the caster assemblies200, eight of the caster assemblies200, etc. Additionally or alternatively, the transport dolly100can include additional components to facilitate transportation of the transport dolly100, such as wheels, rollers, etc., which may be positioned between and/or adjacent to one or more of the plurality of caster assemblies200. For example, an additional wheel may be coupled to the dolly frame102between the first caster assembly804A and the third caster assembly804C to improve turning or pivoting control of the transport dolly100.", "", "In the illustrated example ofFIG.8, the transport dolly100and/or the caster brake assembly system104includes a plurality of lever arms312. For example, the transport dolly100of the illustrated example includes a first lever arm806A, a second lever arm806B, a third lever arm806C, and a fourth lever arm806D. The first lever arm806A is associated with the first caster assembly804A, the second lever arm806B is associated with the second caster assembly804B, the third lever arm806C is associate with the third caster assembly804C and the fourth lever arm806D is associated with the fourth caster assembly804D. The plurality of lever arms312pivot relative to the dolly frame102.", "", "Each of the lever arms312of the illustrated example is rotatable (or pivotable) between the first position602(e.g., lowered position, etc.) and the second position702(e.g., raised position, etc.). In some examples, the first position602of the lever arms806A-D is associated with the engaged position600of the caster brake assembly system104. In such examples, the second position702of the lever arms806A-D is associated with the released position700of the caster assembly200. As shown inFIG.8, the lever arms806A-D are in the first position602. In some examples, the first lever arm806A and the third lever arm806C pivot toward the front beam802C when moved (e.g., manually actuated) from the second position702to the first position602. In some examples, the second lever arm806B and the fourth lever arm806D pivot toward the rear beam802D when moved from the second position702to the first position602. Additionally or alternatively, each of the lever arms806A-D may pivot toward the front beam802C or the rear beam802D when moved from the second position702to the first position602(e.g., and away from the front beam802C or the rear beam802D when moved from the first position602to the second position702).", "", "In some examples, the transport dolly100can include a first linkage (e.g., a bar, a rod, a coupling, etc.) the couple the first lever arm806A and the second lever arm806B and/or a second linkage (e.g., a bar, a rod, a coupling, etc.) to couple the third lever arm806C and the fourth lever arm806D. The first linkage is to cause rotation of the first lever arm806A and the second lever arm806B substantially simultaneously (e.g., within +/−one second). Furthermore, in some examples, the second linkage is to cause rotation of the third lever arm806C and the fourth lever arm806D substantially simultaneously (e.g., within +/−one second). For example, the first linkage can be coupled to the first lever arm806A and the second lever arm806B to pivotably interlock the first and second lever arms806A,806B. In another example, the second linkage can be coupled to the third lever arm806C and the fourth lever arm806D to pivotably interlock the third and fourth lever arms806C,806D. Thus, in some examples, movement (e.g., manual pivoting) of the first lever arm806A or the second lever arm806B causes movement of the other one of the second lever arm806B or the first lever arm806A via the first linkage. Furthermore, in some examples, movement of the third lever arm806C or the fourth lever arm806D causes movement of the other one of the fourth lever arm806D or the third lever arm806C via the second linkage.", "", "In some examples, the first linkage can include a first handle affixed thereto to enable an operator to move the first and second lever arms806A,806B based on a force applied to the first handle. Furthermore, in such examples, the second linkage can include a second handle similar to the first handle of the first linkage. In other examples, the transport dolly100includes a brake line system having brake lines coupled to the plurality of caster assemblies200. Thus, movement of one of the lever arms312(e.g., the first lever arm806A) can cause the plurality of caster assemblies200to move into the engaged position via hydraulic pressure in the brake lines.", "", "FIG.9is a side view of an example engine installation system900in accordance with teachings disclosed herein. Specifically, the engine installation system900includes the transport dolly100ofFIGS.1-8. As illustrated inFIG.9, the ground surface10is level (e.g., flat). The engine installation system900can be used to transport an engine902across the ground surface10and/or to position the engine902relative to an engine bay of an aircraft. The engine902can be installed on the aircraft in a hangar, on the tarmac, on a flight deck of an aircraft carrier, etc. The engine installation system900includes an adapter cradle904configured to be selectively and operatively coupled to the engine902to support a load W of the engine902. In some examples, the load W of the engine902corresponds to a weight of at least one 2000 pounds, 2200 pounds, 2500 pounds, etc.", "", "The engine installation system900of the illustrated example includes the transport dolly100to receive or support the adapter cradle904and/or the engine902. The transport dolly100enables movement of the engine installation system900in the forward direction14A and/or the rearward direction14B along the second axis12B (e.g., a first horizontal axis), the third axis12C (e.g., a second horizontal axis orthogonal to the first horizontal axis and/or the vertical axis) and/or along a skewed path between the second axis12B and the third axis12C.", "", "FIG.10is a side view of the example engine installation system900ofFIG.9shown on an inclined surface20. As shown inFIG.10, the inclined surface20is angled, sloped, or uneven based on surrounding conditions affecting the surface20. For example, the engine installation system900can be located on an aircraft carrier flight deck, which may tilt, or sway, based on waves or other sea conditions. In the illustrated example, the inclined surface20is tilted at an angle22relative to a horizontal reference line24.", "", "As mentioned, the transport dolly100includes the plurality of caster assemblies200. In the illustrated example, at least the first caster assembly804A is in the released position700and at least the second caster assembly804B is in the engaged position600. More specifically, in the illustrated example ofFIG.10, the first lever arm806A is in the second position702, and the second lever arm806B is in the first position602. Additionally or alternatively, the third caster assembly804C (FIG.8) is in the released position700, and the fourth caster assembly804D (FIG.8) is in the engaged position600to prevent movement of the transport dolly100along (e.g., down) the inclined surface20.", "", "In some examples, the transport dolly100can support the weight W of the engine902on the inclined surface20and remain stationary due to engagement of two of the caster assemblies200(e.g., the second and fourth caster assemblies804B,804D). In some examples, an angle22of the ground surface10is fifteen degrees. In other examples, the angle22is greater than fifteen degrees. In such examples, the transport dolly100is capable of remaining stationary and supporting the weight W up to a first threshold angle (e.g., 20 degrees, 25 degrees, etc.) with two of the caster assemblies200in the engaged position600and two of the caster assemblies200in the released position700. In some examples, the transport dolly100is capable of remaining stationary and supporting the weight W up to a second threshold angle (e.g., 30 degrees, 45 degrees, etc.) greater than the first threshold angle when all (e.g., all four) of the caster assemblies200are in the engaged position600.", "", "Example caster assemblies for restricting movement of transport dollies are disclosed herein. Disclosed caster assemblies include a lever arm mounted on a dolly frame of the transportation dolly with a cam at one end to remotely move a brake arm into an engaged position. The cam interfaces with a pin, and the pin interfaces with both the cam and the brake arm. As such, the cam, the pin, and the brake arm define a mechanical linkage. Thus, when the lever arm is raised, the cam allows the brake arm to release from the wheel. Alternatively, when the lever arm is lowered, the cam applies a compressive force on the pin, which causes the brake arm to engage the wheel.", "", "Disclosed caster assemblies apply greater compressive forces on the brake arm, which improves engagement performance and movement restriction of the wheel. For example, the cam and the pin have certain properties (e.g., shape, length, diameter, material, etc.) to ensure the compressive force causes the brake arm to sufficiently engage the wheel. Furthermore, the length of example lever arms is increased relative to pedals of conventional caster brakes, which corresponds to greater torque and greater compressive force on the brake arm when the operator applies a given force on the lever arm. Additionally, disclosed caster assemblies are easier to engage in view of certain tactile and visual feedback associated with the lever arm and/or the cam. For example, the lever arm is coupled to the dolly frame, which the operator can access by hand with relative ease. Moreover, disclosed caster assemblies include fewer components that are prone to wear or failure. For example, the lever arm, the cam, and the pin are the primary sources of the compressive force that causes the brake arm to engage the wheel, and such components have increased durability, reduced mechanical complexity, improved reliability, etc.", "", "Example methods, apparatus, systems, and articles of manufacture to remotely actuate a brake of a caster assembly using a lever arm having a cam surface are disclosed herein. Further examples and combinations thereof include the following:", "", "Example 1 includes a caster assembly comprising a caster frame assembly including a caster frame, a caster mounting plate, and a brake arm, the caster frame rotatably coupled to the caster mounting plate to enable a wheel to swivel relative to the caster mounting plate, the brake arm rotatably coupled to the caster frame, the brake arm to engage the wheel when the brake arm is in an engaged position, a pin having a first end and a second end opposite the first end, the second end to engage the brake arm, and a lever arm having a third end and a fourth end opposite the third end, the lever arm to pivot relative to the caster frame assembly between a first position and a second position, movement of the lever arm to the first position to cause the fourth end of the lever arm to actuate the pin in a first direction to move the brake arm to the engaged position to restrict rotation of the wheel, movement of the lever arm to the second position to cause the fourth end of the lever arm to actuate the pin in a second direction to move the brake arm to a released position to enable rotation of the wheel, the second direction opposite the first direction.", "", "Example 2 includes the caster assembly of example 1, wherein the fourth end of the lever arm includes a cam to engage the pin.", "", "Example 3 includes the caster assembly of any of examples 1 or 2, wherein the caster frame assembly includes a brake arm bracket coupled to the caster frame, the brake arm rotatably coupled relative to the caster frame via the brake arm bracket.", "", "Example 4 includes the caster assembly of any of examples 1-3, wherein the lever arm includes a base portion defining the fourth end and a handle portion defining the third end, the handle portion oriented at an angle relative to the base portion.", "", "Example 5 includes the caster assembly of any of examples 1-4, wherein the angle is between 25 degrees and 35 degrees.", "", "Example 6 includes the caster assembly of any of examples 1-5, wherein the base portion has a longitudinal axis that is oriented (i) non-parallel relative to a swivel axis of the caster frame when the brake arm is in the engaged position and (ii) substantially parallel relative to the swivel axis of the caster frame when the brake arm is in the released position.", "", "Example 7 includes the caster assembly of any of examples 1-6, wherein the pin includes a first portion having a first diameter and a second portion having a second diameter less than the first diameter.", "", "Example 8 includes the caster assembly of any of examples 1-7, wherein the first portion extends between the first end of the pin and a transitional portion of the pin, and the second portion extends between the second end of the pin and the transitional portion, the transitional portion positioned between the first end and the second end and defines a tapered surface between the first diameter and the second diameter.", "", "Example 9 includes the caster assembly of any of examples 1-8, wherein the pin is made of beryllium copper.", "", "Example 10 includes the caster assembly of any of examples 1-9, wherein the brake arm includes a buffer pad, and the second end of the pin engages the buffer pad to move the brake arm into the engaged position, the buffer pad made of stainless steel.", "", "Example 11 includes a transport dolly comprising a dolly frame, and a plurality of caster assemblies, the caster assemblies each including a wheel, a caster frame assembly including a caster frame and a brake arm, the wheel coupled to the caster frame, the brake arm rotatably coupled to the caster frame, the brake arm to rotate between an engaged position and a released position, the brake arm to engage the wheel when in the engaged position to restrict rotation of the wheel relative to the caster frame, the brake arm to disengage the wheel when in the released position to enable rotation of the wheel relative to the caster frame, a pin having a first end extending at least partially through the dolly frame and a second end opposite the first end extending at least partially through the caster frame, and a lever arm rotatably coupled to the dolly frame, the lever arm including a handle and a cam, the lever arm to move the brake arm between an engaged position to restrict rotation of the wheel relative to the dolly frame and a released position to enable rotation of the wheel relative to the dolly frame via the cam and the pin when the lever arm is rotated relative to the dolly frame.", "", "Example 12 includes the transport dolly of example 11, wherein the a first portion of the pin is disposed within the dolly frame and is supported by at least one bushing.", "", "Example 13 includes the transport dolly of any of examples 11-12, wherein the caster frame assembly includes a caster mounting plate, further including a dolly frame assembly including a dolly mounting plate coupled to the dolly frame, the caster mounting plate coupled to the dolly mounting plate.", "", "Example 14 includes the transport dolly of any of examples 11-13, wherein the lever arm is coupled to the dolly frame via a clevis joint, the clevis joint including a bracket and a hinge pin, the hinge pin extending through the bracket and the lever arm.", "", "Example 15 includes the transport dolly of any of examples 11-14, wherein the cam engages the first end of the pin, and the second end of the pin engages the brake arm.", "", "Example 16 includes the transport dolly of any of examples 11-15, wherein rotation of the lever arm relative to the dolly frame in a first rotational direction is to cause the cam to actuate the pin such that the brake arm moves to an engaged position to restriction rotation of the wheel.", "", "Example 17 includes the transport dolly of any of examples 11-16, wherein rotation of the handle relative to the dolly frame in a second rotational direction opposite the first rotational direction is to cause the cam to actuate the pin such that the brake arm moves to a released position to enable rotation of the wheel.", "", "Example 18 includes the transport dolly of any of examples 11-17, wherein the plurality of the caster assemblies includes at least one of a first caster assembly, a second caster assembly, a third caster assembly, and a fourth caster assembly.", "", "Example 19 includes an apparatus comprising means for rotatably supporting a wheel, means for locking rotation of the wheel operatively coupled to the means for rotatably supporting the wheel, means for moving the means for locking rotation between a engaged position to restrict movement of the wheel and a released position to enable rotation of the wheel, and means for operating the means for locking rotation, the means for operating rotatably coupled relative to the means for rotatably supporting the wheel, rotation of the means for operating between a first position and a second position to cause the means for locking rotation to move between the engaged position and the released position via the means for moving.", "", "Example 20 includes the apparatus of example 19, further including means for pivotally mounting the wheel to a frame to enable the wheel to rotate relative to the frame about a swivel axis.", "", "The following claims are hereby incorporated into this Detailed Description by this reference. Although certain example systems, methods, apparatus, and articles of manufacture have been disclosed herein, the scope of coverage of this patent is not limited thereto. On the contrary, this patent covers all systems, methods, apparatus, and articles of manufacture fairly falling within the scope of the claims of this patent."], "claims": ["a caster frame assembly including a caster frame, a caster mounting plate, and a brake arm, the caster frame rotatably coupled to the caster mounting plate to enable a wheel to swivel relative to the caster mounting plate, the brake arm rotatably coupled to the caster frame, the brake arm to engage the wheel when the brake arm is in an engaged position; a pin having a first end and a second end opposite the first end, the second end to engage the brake arm; and a lever arm having a third end and a fourth end opposite the third end, the lever arm to pivot relative to the caster frame assembly between a first position and a second position, movement of the lever arm to the first position to cause the fourth end of the lever arm to actuate the pin in a first direction to move the brake arm to the engaged position to restrict rotation of the wheel, movement of the lever arm to the second position to cause the fourth end of the lever arm to actuate the pin in a second direction to move the brake arm to a released position to enable rotation of the wheel, the second direction opposite the first direction.", "2 . The caster assembly of claim 1 , wherein the fourth end of the lever arm includes a cam to engage the pin.", "3 . The caster assembly of claim 1 , wherein the caster frame assembly includes a brake arm bracket coupled to the caster frame, the brake arm rotatably coupled relative to the caster frame via the brake arm bracket.", "4 . The caster assembly of claim 1 , wherein the lever arm includes a base portion defining the fourth end and a handle portion defining the third end, the handle portion oriented at an angle relative to the base portion.", "5 . The caster assembly of claim 4 , wherein the angle is between 25 degrees and 35 degrees.", "6 . The caster assembly of claim 5 , wherein the base portion has a longitudinal axis that is oriented (i) non-parallel relative to a swivel axis of the caster frame when the brake arm is in the engaged position and (ii) substantially parallel relative to the swivel axis of the caster frame when the brake arm is in the released position.", "7 . The caster assembly of claim 1 , wherein the pin includes a first portion having a first diameter and a second portion having a second diameter less than the first diameter.", "8 . The caster assembly of claim 7 , wherein the first portion extends between the first end of the pin and a transitional portion of the pin, and the second portion extends between the second end of the pin and the transitional portion, the transitional portion positioned between the first end and the second end and defines a tapered surface between the first diameter and the second diameter.", "9 . The caster assembly of claim 1 , wherein the pin is made of beryllium copper.", "10 . The caster assembly of claim 9 , wherein the brake arm includes a buffer pad, and the second end of the pin engages the buffer pad to move the brake arm into the engaged position, the buffer pad made of stainless steel.", "a dolly frame; and a plurality of caster assemblies, the caster assemblies each including: a wheel; a caster frame assembly including a caster frame and a brake arm, the wheel coupled to the caster frame, the brake arm rotatably coupled to the caster frame, the brake arm to rotate between an engaged position and a released position, the brake arm to engage the wheel when in the engaged position to restrict rotation of the wheel relative to the caster frame, the brake arm to disengage the wheel when in the released position to enable rotation of the wheel relative to the caster frame; a pin having a first end extending at least partially through the dolly frame and a second end opposite the first end extending at least partially through the caster frame; and a lever arm rotatably coupled to the dolly frame, the lever arm including a handle and a cam, the lever arm to move the brake arm between an engaged position to restrict rotation of the wheel relative to the dolly frame and a released position to enable rotation of the wheel relative to the dolly frame via the cam and the pin when the lever arm is rotated relative to the dolly frame.", "12 . The transport dolly of claim 11 , wherein the a first portion of the pin is disposed within the dolly frame and is supported by at least one bushing.", "13 . The transport dolly of claim 11 , wherein the caster frame assembly includes a caster mounting plate, further including a dolly frame assembly including a dolly mounting plate coupled to the dolly frame, the caster mounting plate coupled to the dolly mounting plate.", "14 . The transport dolly of claim 11 , wherein the lever arm is coupled to the dolly frame via a clevis joint, the clevis joint including a bracket and a hinge pin, the hinge pin extending through the bracket and the lever arm.", "15 . The transport dolly of claim 14 , wherein the cam engages the first end of the pin, and the second end of the pin engages the brake arm.", "16 . The transport dolly of claim 15 , wherein rotation of the lever arm relative to the dolly frame in a first rotational direction is to cause the cam to actuate the pin such that the brake arm moves to an engaged position to restriction rotation of the wheel.", "17 . The transport dolly of claim 16 , wherein rotation of the handle relative to the dolly frame in a second rotational direction opposite the first rotational direction is to cause the cam to actuate the pin such that the brake arm moves to a released position to enable rotation of the wheel.", "18 . The transport dolly of claim 11 , wherein the plurality of the caster assemblies includes at least one of a first caster assembly, a second caster assembly, a third caster assembly, and a fourth caster assembly.", "means for rotatably supporting a wheel; means for locking rotation of the wheel operatively coupled to the means for rotatably supporting the wheel; means for moving the means for locking rotation between a engaged position to restrict movement of the wheel and a released position to enable rotation of the wheel; and means for operating the means for locking rotation, the means for operating rotatably coupled relative to the means for rotatably supporting the wheel, rotation of the means for operating between a first position and a second position to cause the means for locking rotation to move between the engaged position and the released position via the means for moving.", "20 . The apparatus of claim 19 , further including means for pivotally mounting the wheel to a frame to enable the wheel to rotate relative to the frame about a swivel axis."], "bibtex": "@patent{20240278599,\n    title = {CASTER ASSEMBLIES HAVING CAM-OPERATED BRAKES},\n    number = {20240278599},\n    year = {2024},\n    note = {File: US20240278599A1-20240822.XML}\n    }", "classification": "B60B3302FI"}, {"title": "RUBBER COMPOSITION FOR TIRE", "doc_number": "20240278600", "filename": "US20240278600A1-20240822.XML", "abstract": "A rubber composition for a tire contains a diene rubber, silica, a silane coupling agent, a fatty acid metal salt, and an alkylsilane. 60-95 mass % of a specific conjugated diene rubber is used as the diene rubber and is formed by reacting a polyorganosiloxane with an active terminal of a conjugated diene-based polymer chain having the active terminal and by making a polymer block A continuous with a polymer block B. The polymer block A contains 80-95 mass % of isoprene and 5-20 mass % of aromatic vinyl, has an active terminal, and has a weight average molecular weight of 500-15000. The polymer block B contains 1,3-butadiene and an aromatic vinyl and has an active terminal. 55-90 parts by mass of silica having a CTAB adsorption specific surface area of 185 m 2 /g or more is used as the silica.", "detailed_description": ["Configurations of embodiments of the present technology will be described in detail below with reference to the accompanying drawings.", "", "As illustrated in the Drawing, a pneumatic tire using a rubber composition for a tire according to an embodiment of the present technology includes a tread portion1, a pair of sidewall portions2respectively disposed on both sides of the tread portion1, and a pair of bead portions3each disposed on an inner side of the pair of sidewall portions2in a tire radial direction. “CL” in the Drawing denotes a tire equator. Although not illustrated in the Drawing, which is a meridian cross-sectional view, the tread portion1, the sidewall portions2, and the bead portions3each extend in a tire circumferential direction and have an annular shape. This forms a toroidal basic structure of the pneumatic tire. Although the description using the Drawing is basically based on the illustrated meridian cross-sectional shape, all of the tire components extend in the tire circumferential direction and form the annular shape.", "", "A carcass layer4is mounted between the left-right pair of bead portions3. The carcass layer4includes a plurality of reinforcing cords extending in the tire radial direction and is folded back around a bead core5disposed in each of the bead portions3from a vehicle inner side to a vehicle outer side. Additionally, a bead filler6is disposed on the periphery of the bead core5, and the bead filler6is enveloped by a body portion and a folded back portion of the carcass layer4. On the other hand, in the tread portion1, a plurality of belt layers7(two layers in the Drawing) are embedded on an outer circumferential side of the carcass layer4. The belt layers7each include a plurality of reinforcing cords inclining with respect to the tire circumferential direction and are disposed such that the reinforcing cords of the different layers intersect each other. In these belt layers7, the inclination angle of the reinforcing cords with respect to the tire circumferential direction is set in a range of, for example, from 10° to 40°. Moreover, a belt reinforcing layer8(two layers including a full cover8acovering the entire width of the belt layer7and an edge cover8blocally covering an end of the belt layer7) is provided on an outer circumferential side of the belt layer7. The belt reinforcing layer8includes organic fiber cords oriented in the tire circumferential direction. In the belt reinforcing layer8, the angle of the organic fiber cords with respect to the tire circumferential direction is set, for example, to from 0° to 5°.", "", "A tread rubber layer10is disposed on the outer circumferential side of the carcass layer4in the tread portion1. A side rubber layer20is disposed on the outer circumferential side (outward in the tire lateral direction) of the carcass layer4in each of the sidewall portions2. A rim cushion rubber layer30is disposed on the outer circumferential side (outward in the tire lateral direction) of the carcass layer4in each of the bead portions3. The tread rubber layer10has a structure in which two types of rubber layers having different physical properties (a cap tread11constituting a road contact surface of the tread portion1and an undertread12disposed on an inner circumferential side of the cap tread11) are stacked in the tire radial direction.", "", "The rubber composition for a tire according to an embodiment of the present technology is mainly used for the cap tread11of the tire as described above. Thus, in the tire to which the rubber composition for a tire of an embodiment of the present technology is used, as long as the tread portion1(tread rubber layer10) includes the cap tread11and the undertread12, a basic structure of other portions is not limited to the above-described structure.", "", "In the rubber composition for a tire of an embodiment of the present technology, the rubber component is a diene rubber and always contains a specific conjugated diene rubber described below. The proportion of the specific conjugated diene rubber is from 60 mass % to 95 mass %, and preferably from 70 mass % to 85 mass %, with respect to 100 mass % of the diene rubber. By allowing the specific conjugated diene rubber to be contained, dispersibility of the silica described below can be improved, and fuel efficiency can be improved. When the blended amount of the specific conjugated diene rubber is less than 60 mass %, wet performance deteriorates. When the blended amount of the specific conjugated diene rubber is more than 98 mass %, fuel efficiency and wear resistance deteriorate.", "", "The specific conjugated diene rubber is a conjugated diene rubber formed by reacting a polyorganosiloxane with an active terminal of a conjugated diene-based polymer chain having the active terminal. The conjugated diene-based polymer chain is formed by making a polymer block A continuous with a polymer block B. The polymer block A contains from 80 mass % to 95 mass % of isoprene and from 5 mass % to 20 mass % of aromatic vinyl, has an active terminal, and has a weight average molecular weight of from 500 to 15000. The polymer block B contains 1,3-butadiene and an aromatic vinyl and has an active terminal.", "", "Examples of the aromatic vinyl in the polymer block A include styrene, α-methylstyrene, 2-methylstyrene, 3-methylstyrene, 4-methylstyrene, 2-ethylstyrene, 3-ethylstyrene, 4-ethylstyrene, 2,4-diisopropylstyrene, 2,4-dimethylstyrene, 4-t-butylstyrene, 5-t-butyl-2-methylstyrene, vinylnaphthalene, dimethylaminomethylstyrene, and dimethylaminoethylstyrene. Among these, styrene is preferred. Such aromatic vinyl may be used alone, or a combination of two or more types may be used.", "", "The weight average molecular weight (Mw) of the polymer block A is from 500 to 15000, preferably from 1000 to 12000, more preferably from 1500 to 10000, as described above. When the weight average molecular weight of the polymer block A is less than 500, the desired low rolling performance and wet performance are less likely to be expressed. When the weight average molecular weight of the polymer block A exceeds 15000, the balance of viscoelastic properties, which is an index of desired low rolling performance and wet performance, may be lost. The weight average molecular weight is a value measured by gel permeation chromatography (GPC) based on calibration with polystyrene.", "", "The content of the isoprene unit content in the polymer block A is preferably from 80 to 95 mass %, preferably from 85 to 95 mass %, and more preferably from 87 mass % to 95 mass %. The aromatic vinyl content in the polymer block A is preferably from 5 to 20 mass %, preferably from 5 to 15 mass %, and more preferably from 5 to 13 mass %, as described above.", "", "The polymer block A may contain monomer units other than isoprene and aromatic vinyl, but the content of monomer units other than isoprene and aromatic vinyl is preferably 15 mass % or less, more preferably 10 mass % or less, and more preferably 6 mass % or less. Examples of monomer units other than isoprene and aromatic vinyl include conjugated dienes other than isoprene such as 1,3-butadiene, 2,3-dimethyl-1,3-butadiene, 2-chloro-1,3-butadiene, 1,3-pentadiene, and 1,3-hexadiene: α- and β-unsaturated nitriles such as acrylonitrile and methacrylonitrile: unsaturated carboxylic acids or acid anhydrides such as acrylic acid, methacrylic acid, and maleic anhydride; unsaturated carboxylic acid esters such as methylmethacrylate, ethylacrylate, and butylacrylate; and non-conjugated dienes such as 1,5-hexadiene, 1,6-heptadiene, 1,7-octadiene, dicyclopentadiene, and 5-ethylidene-2-norbornene.", "", "The specific examples and suitable aspects of the aromatic vinyl in the polymer block B are identical to those of the polymer block A and as described above. The 1,3-butadiene unit content in the polymer block B is not particularly limited, but is preferably from 55 mass % to 95 mass %, and more preferably from 55 mass % to 90 mass %. The aromatic vinyl unit content in the polymer block B is not particularly limited, but is preferably from 5 mass % to 45 mass %, and more preferably from 10 mass % to 45 mass %.", "", "The polymer block B may have monomer units other than the 1,3-butadiene unit and aromatic vinyl unit. Examples of other monomers used to constitute other monomer units include those excluding 1,3-butadiene among “examples other than aromatic vinyl among monomers other than isoprene” described above, and isoprene. The content of the other monomer units in the polymer block B is preferably 50 mass % or less, more preferably 40 mass % or less, and further preferably 35 mass % or less.", "", "The conjugated diene-based polymer chain having the active terminal formed by making the polymer block A continuous with the polymer block B is, from the perspective of productivity, constituted by (the polymer block A)-(the polymer block B), and the terminal of the polymer block B is preferably an active terminal. However, the conjugated diene-based polymer chain may have a plurality of polymer blocks A or may have other polymer blocks. Examples thereof include conjugated diene-based polymer chains having an active terminal, such as blocks composed only of (the polymer block A)-(the polymer block B)-(the polymer block A) and of (the polymer block A)-(the polymer block B)-isoprene. The mass ratio of the polymer block A to the polymer block B in the conjugated diene-based polymer chain having an active terminal described above (when there are a plurality of polymer blocks A and B, based on each total mass) is preferably from 0.001 to 0.1, more preferably from 0.003 to 0.07, and further preferably from 0.005 to 0.05, as (mass of the polymer block A)/(mass of the polymer block B).", "", "The polyorganosiloxane is represented by Formula (1) below. In Formula (1) below, R1to R8are alkyl groups having from 1 to 6 carbons or aryl groups having from 6 to 12 carbons and may be the same or different from each other. X1and X4are groups selected from the group consisting of alkyl groups having from 1 to 6 carbons, aryl groups having 6 to 12 carbons, alkoxy groups having 1 to 5 carbons, and epoxy group-containing groups having from 4 to 12 carbons and may be the same or different from each other. X2is an alkoxy group having from 1 to 5 carbons or an epoxy group-containing group having from 4 to 12 carbons, and the plurality of X2groups may be the same or different from each other. X3is a group containing 2 to 20 alkylene glycol repeating units, and, when there are a plurality of X3groups, they may be the same or different from each other. m is an integer from 3 to 200, n is an integer from 0 to 200, and k is an integer from 0 to 200.", "", "In the rubber composition for a tire of an embodiment of the present technology, in addition to the specific conjugated diene rubber described above, a poly butadiene rubber can be blended as the rubber component. When a polybutadiene rubber is used in combination, the blended amount thereof is preferably from 5 mass % to 40 mass %, and more preferably from 15 mass % to mass %, with respect to 100 mass % of the diene rubber. Combined use of the polybutadiene rubber in this manner can reduce the glass transition temperature of the rubber composition and thus is advantageous to improve wear resistance. When the blended amount of the poly butadiene rubber is less than 5 mass %, wear resistance deteriorates. When the blended amount of the polybutadiene rubber is more than 40 mass %, wet performance deteriorates.", "", "When the rubber component contains a polybutadiene rubber, the poly butadiene rubber is preferably a modified poly butadiene rubber. Use of the modified poly butadiene rubber is advantageous to make rolling resistance low. The modified poly butadiene rubber preferably contains a functional group that is reactive with silica. Examples of such a functional group include a hydroxy group, a hydroxy silyl group, an alkoxy group, a carboxy group, and an amino group. The modified poly butadiene rubber may be produced by an ordinary method or may be appropriately selected from commercially available products for use.", "", "In the rubber composition for a tire of an embodiment of the present technology, silica is always blended as a filler for the diene rubber described above. The silica used in an embodiment of the present technology has a CTAB adsorption specific surface area of 185 m2/g or more, and preferably from 190 m2/g to 210 m2/g. When such silica having a small particle size is used, wet performance can be improved. The silica that is used may be a silica that is ordinarily used in rubber compositions for tires such as, for example, wet silica, dry silica, surface-treated silica, or the like. The silica may be appropriately selected from commercially available products. Silica obtained by a normal manufacturing method can also be used.", "", "The blended amount of the silica is from 55 parts by mass to 90 parts by mass, and preferably from 70 parts by mass to 80 parts by mass, with respect to 100 parts by mass of the diene rubber described above. Blending of an appropriate amount of the silica as described above is advantageous to provide fuel economy performance, wet performance, and wear resistance performance in a well-balanced and compatible manner. When the blended amount of the silica is less than 55 parts by mass, wear resistance deteriorates. When the blended amount of the silica is more than 90 parts by mass, fuel efficiency deteriorates.", "", "The rubber composition of an embodiment of the present technology may contain a filler other than the silica. Examples of such inorganic fillers include materials typically used for a rubber composition for a tire, such as carbon black, clay, talc, calcium carbonate, mica, and aluminum hydroxide.", "", "In the rubber composition for a tire of an embodiment of the present technology, a silane coupling agent is always used in combination when the silica described above is blended. Blending a silane coupling agent can improve dispersibility of the silica in the diene rubber. The type of the silane coupling agent is not particularly limited as long as it is a silane coupling agent that can be used in a rubber composition containing silica. Examples thereof include a sulfur-containing silane coupling agent, such as bis(3-triethoxysilylpropyl)tetrasulfide, bis(3-triethoxysilylpropyl)disulfide, 3-trimethoxysilylpropyl benzothiazole tetrasulfide, γ-mercaptopropyl triethoxysilane, and 3-octanoylthiopropyl triethoxysilane. Among these, a silane coupling agent containing a tetrasulfide bond in a molecule can be particularly preferably used. The blended amount of the silane coupling agent is preferably 15 mass % or less, and more preferably from 3 mass % to 12 mass %, with respect to the blended amount of the silica. When the blended amount of the silane coupling agent is greater than 15 mass % with respect to the blended amount of the silica, the silane coupling agent condenses, and thereby desired hardness and strength of the rubber composition are failed to achieve.", "", "In the rubber composition for a tire of an embodiment of the present technology, an alkylsilaneis always blended as a plasticizer component when the silica described above is blended. When the alkylsilane is blended, aggregation of silica and viscosity increase in the rubber composition can be suppressed, and excellent rolling resistance and wet performance can be achieved. Examples of the alkylsilane include monoalkyltrialkoxysilane, dialkyldialkoxysilane, and trialkylmonoalkoxysilane. Among these, alkyltrialkoxysilane is preferred, and alkyltriethoxy silane is more preferred. As the alkyltriethoxysilane, an alkyltriethoxysilane containing an alkyl group having from 7 to 20 carbons is preferred. Examples of the alkyl group having from 7 to 20 carbons include a heptyl group, octyl group, nonyl group, decyl group, undecyl group, dodecyl group, tridecyl group, tetradecyl group, pentadecyl group, hexadecyl group, heptadecyl group, octadecyl group, nonadecyl group, and icosyl group. Among these, from the perspective of miscibility with the diene rubber, an alkyl group having from 8 to 10 carbons is preferable, and an octyl group or nonyl group is even more preferable. The blended amount of the alkylsilane is preferably from 0.1 mass % to 20 mass %, and more preferably from 1 mass % to 5 mass %, with respect to the mass of the silica. When the blended amount of the alkylsilane is less than 0.1 mass %, rolling resistance deteriorates. When the blended amount of the alkylsilane is more than 20 mass %, wet grip deteriorates.", "", "In the rubber composition for a tread of an embodiment of the present technology, a fatty acid metal salt as a plasticizer component is always blended. When the fatty acid metal salt is blended, aggregation of silica and viscosity increase in the rubber composition can be suppressed, and excellent rolling resistance and wet performance can be achieved. Examples of the fatty acid metal salt include various fatty acids such as caprylic acid, undecylenic acid, lauryl acid, myristic acid, palmitic acid, margaric acid, stearic acid, alginic acid, lignoceric acid, cerotic acid, melissic acid, myristoleic acid, oleic acid, linoleic acid, and linolenic acid, and a salt of alkali metal such as lithium, sodium, and potassium. A single type or a combination of multiple types of fatty acid metal salts can be blended. The blended amount of the fatty acid metal salt is preferably from 2 mass % to 8 mass %, and more preferably from 3 mass % to 6 mass %, with respect to the mass of the silica. When the blended amount of the fatty acid metal salt is less than 2 mass %, rolling resistance deteriorates. When the blended amount of the fatty acid metal salt is more than 8 mass %, wet grip deteriorates.", "", "In the rubber composition according to an embodiment of the present technology, compounding agents other than those above may also be added. Examples of such other compounding agents include various compounding agents generally used in rubber compositions for tires, such as vulcanizing or crosslinking agents, vulcanization accelerators, anti-aging agents, liquid polymers, thermosetting resins, and thermoplastic resins. These compounding agents can be blended in typical amounts in the related art so long as the present technology is not hindered. As a kneader, a typical kneader for a rubber, such as a Banbury mixer, a kneader, or a roller, may be used.", "", "Since the rubber composition for a tire of an embodiment of the present technology is mainly used for the cap tread11, the blend of the rubber composition constituting the undertread12to be used in combination when used in the tire is not particularly limited. However, the cap tread11containing the rubber composition for a tire of an embodiment of the present technology preferably has a higher hardness than that of the undertread12, and the hardness difference between the cap tread11and the undertread12is preferably 5 or less, and more preferably 3 or less, in terms of JIS-A hardness. When the hardness difference from the undertread12is adequately made small as described above when the rubber composition for a tire of an embodiment of the present technology is used in the cap tread11, wet performance can be improved while good steering stability is maintained. When the hardness difference between the cap tread11and the undertread12is too large, it becomes difficult to maintain good steering stability. Note that the hardness of the undertread12of the rubber composition for a tire of an embodiment of the present technology is not particularly limited and can be set to, for example, from 56 to 63 in terms of JIS-A hardness.", "", "The present technology will further be described below by way of Examples, but the scope of the present technology is not limited to Examples."], "claims": ["1 - 7 . (canceled)", "the diene rubber containing from 60 mass % to 95 mass % of a specific conjugated diene rubber, the specific conjugated diene rubber formed by reacting a polyorganosiloxane with an active terminal of a conjugated diene-based polymer chain having the active terminal, the conjugated diene-based polymer chain formed by making a polymer block A continuous with a polymer block B, the polymer block A containing from 80 mass % to 95 mass % of isoprene and from 5 mass % to 20 mass % of aromatic vinyl, having an active terminal, and having a weight average molecular weight of from 500 to 15000, and the polymer block B containing 1,3-butadiene and an aromatic vinyl and having an active terminal; and the silica having a CTAB adsorption specific surface area of 185 m", "9 . The rubber composition for a tire according to claim 8 , wherein the diene rubber contains from 5 mass % to 40 mass % of a polybutadiene rubber.", "10 . The rubber composition for a tire according to claim 8 , wherein the silane coupling agent contains a tetrasulfide bond in a molecule.", "11 . The rubber composition for a tire according to claim 8 , wherein a blended amount of the fatty acid metal salt is from 2 mass % to 8 mass % of a blended amount of the silica.", "12 . The rubber composition for a tire according to claim 8 , wherein a blended amount of the alkylsilane is from 0.1 mass % to 20 mass % with respect to a blended amount of the silica.", "a tread portion extending in a tire circumferential direction and having an annular shape; a cap tread constituting a road contact surface of the tread portion; and an undertread disposed on an inner circumferential side of the cap tread; the cap tread containing a rubber composition for a tire according to claim", "14 . The tire according to claim 13 , wherein a hardness difference between the undertread and the cap tread in terms of JIS-A hardness is 5 or less.", "15 . The rubber composition for a tire according to claim 9 , wherein the silane coupling agent contains a tetrasulfide bond in a molecule.", "16 . The rubber composition for a tire according to claim 15 , wherein a blended amount of the fatty acid metal salt is from 2 mass % to 8 mass % of a blended amount of the silica.", "17 . The rubber composition for a tire according to claim 16 , wherein a blended amount of the alkylsilane is from 0.1 mass % to 20 mass % with respect to a blended amount of the silica.", "a tread portion extending in a tire circumferential direction and having an annular shape; a cap tread constituting a road contact surface of the tread portion; and an undertread disposed on an inner circumferential side of the cap tread; the cap tread containing a rubber composition for a tire according to claim", "19 . The tire according to claim 18 , wherein a hardness difference between the undertread and the cap tread in terms of JIS-A hardness is 5 or less."], "bibtex": "@patent{20240278600,\n    title = {RUBBER COMPOSITION FOR TIRE},\n    number = {20240278600},\n    year = {2024},\n    note = {File: US20240278600A1-20240822.XML}\n    }", "classification": "B60C100FI"}, {"title": "TIRE", "doc_number": "20240278601", "filename": "US20240278601A1-20240822.XML", "abstract": "A tire includes a first shoulder land portion, a first circumferential groove, a first middle land portion, a second circumferential groove, a center land portion, a third circumferential groove, a second middle land portion, a fourth circumferential groove, and a second shoulder land portion in this order from a vehicle mounting inner side in a tire plan view. The center land portion includes a plurality of center sipes extending in a tire width direction. At least one of the plurality of center sipes includes a chamfered portion at at least any of one and the other edge portions in a tire circumferential direction. The first middle land portion includes a plurality of middle sipes extending in the tire width direction. At least one of the plurality of middle sipes includes a chamfered portion at at least any of one and the other edge portions in the tire circumferential direction.", "detailed_description": ["Hereinafter, tires according to embodiments of the present technology (Basic Embodiment and Additional Embodiments 1 to 12 described later) will be described in detail with reference to the drawings. The present technology is not limited to these embodiments. Furthermore, constituents of the embodiment include elements that can be substituted or easily conceived by one skilled in the art or that are essentially identical. In addition, the various modes included in the embodiments can be combined as desired within the scope of obviousness by one skilled in the art."], "claims": ["1 - 14 . (canceled)", "a first shoulder land portion, a first circumferential groove, a first middle land portion, a second circumferential groove, a center land portion, a third circumferential groove, a second middle land portion, a fourth circumferential groove, and a second shoulder land portion in this order from a vehicle mounting inner side, the center land portion comprising a plurality of center sipes extending in a tire width direction, at least one of the plurality of center sipes comprising a chamfered portion at at least any of one and the other edge portions in a tire circumferential direction, the first middle land portion comprising a plurality of middle sipes extending in the tire width direction, and at least one of the plurality of middle sipes comprising a chamfered portion at at least any of one and the other edge portions in the tire circumferential direction.", "the center sipe comprises: a first center sipe comprising the chamfered portion at one edge portion in the tire circumferential direction; and a second center sipe comprising the chamfered portion at the other edge portion in the tire circumferential direction, the chamfered portion of the first center sipe comprises: a base end communicating with the second circumferential groove; and an end disposed within the center land portion, and the chamfered portion of the second center sipe comprises: a base end communicating with the third circumferential groove; and an end disposed within the center land portion; and the first center sipes and the second center sipes are alternately disposed in the tire circumferential direction.", "the first middle land portion comprises a first middle groove extending in the tire width direction, the first middle groove comprises: a base end communicating with the first circumferential groove; and an end disposed at a position closer to the second circumferential groove than a center of the first middle land portion in the tire width direction, the second middle land portion comprises a second middle groove extending in the tire width direction, and the second middle groove comprises: a base end communicating with the fourth circumferential groove; and an end disposed at a position closer to the third circumferential groove than a center of the second middle land portion in the tire width direction.", "at least one base end of the plurality of middle sipes communicates with the end of the first middle groove, and at least one end of the plurality of middle sipes communicates with the second circumferential groove.", "the second middle land portion comprises a third middle groove communicating with the end of the second middle groove, the second middle groove is inclined to one side in the tire circumferential direction with respect to the tire width direction, the third middle groove has a base end communicating with the end of the second middle groove, and the end of the third middle groove communicates with the third circumferential groove, and the end of the second middle groove and the base end of the third middle groove form a communicating portion protruding to one side or the other side in the tire circumferential direction.", "the second shoulder land portion comprises: an outer auxiliary groove extending in the tire circumferential direction; and a second shoulder groove intersecting with the outer auxiliary groove, and the second shoulder groove comprises: a base end positioned on an outer side in the tire width direction with respect to a ground contact edge on a vehicle mounting outer side; and an end disposed between the outer auxiliary groove and the fourth circumferential groove.", "the first shoulder land portion comprises a first shoulder groove extending in the tire width direction, and the first shoulder groove comprises: a base end positioned on an outer side in the tire width direction with respect to a ground contact edge on a vehicle mounting inner side; and an end communicating with the first circumferential groove.", "the first shoulder land portion comprises: an inner auxiliary groove extending in the tire circumferential direction; and a first shoulder groove intersecting with the inner auxiliary groove, and the first shoulder groove comprises: a base end positioned on an outer side in the tire width direction with respect to a ground contact edge on a vehicle mounting inner side; and an end disposed between the inner auxiliary groove and the first circumferential groove.", "the first shoulder land portion comprises a first shoulder groove extending in the tire width direction, the first shoulder groove comprises: a base end positioned on an outer side in the tire width direction with respect to a ground contact edge on a vehicle mounting inner side; and an end communicating with the first circumferential groove, the second shoulder land portion comprises: an outer auxiliary groove extending in the tire circumferential direction; and a second shoulder groove intersecting with the outer auxiliary groove, the second shoulder groove comprises: a base end positioned on the outer side in the tire width direction with respect to the ground contact edge on a vehicle mounting outer side; and an end disposed between the outer auxiliary groove and the fourth circumferential groove, a position of the end of the first shoulder groove is displaced from a position of the base end of the first middle groove in the tire circumferential direction, and a position where an imaginary line obtained by extending the second shoulder groove toward the vehicle mounting inner side intersects with the fourth circumferential groove is displaced from a position of the base end of the second middle groove in the tire circumferential direction.", "the first shoulder land portion comprises: an inner auxiliary groove extending in the tire circumferential direction; and a first shoulder groove intersecting with the inner auxiliary groove, the first shoulder groove comprises: a base end positioned on an outer side in the tire width direction with respect to a ground contact edge on a vehicle mounting inner side; and an end disposed between the inner auxiliary groove and the first circumferential groove, the second shoulder land portion comprises a second shoulder groove extending in the tire width direction, the second shoulder groove comprises: a base end positioned on the outer side in the tire width direction with respect to the ground contact edge on the vehicle mounting inner side; and an end disposed within the second shoulder land portion, a position where an imaginary line obtained by extending the first shoulder groove toward a vehicle mounting outer side intersects with the first circumferential groove is displaced from a position of the base end of the first middle groove in the tire circumferential direction, and a position where an imaginary line obtained by extending the second shoulder groove toward the vehicle mounting inner side intersects with the fourth circumferential groove is displaced from a position of the base end of the second middle groove in the tire circumferential direction.", "the first shoulder land portion comprises: an inner auxiliary groove extending in the tire circumferential direction; and a first shoulder groove intersecting with the inner auxiliary groove, the first shoulder groove comprises: a base end positioned on an outer side in the tire width direction with respect to a ground contact edge on a vehicle mounting inner side; and an end disposed between the inner auxiliary groove and the first circumferential groove, the second shoulder land portion comprises: an outer auxiliary groove extending in the tire circumferential direction; and a second shoulder groove intersecting with the outer auxiliary groove, the second shoulder groove comprises: a base end positioned on the outer side in the tire width direction with respect to the ground contact edge on a vehicle mounting outer side; and an end disposed between the outer auxiliary groove and the fourth circumferential groove, a position where an imaginary line obtained by extending the first shoulder groove toward the vehicle mounting outer side intersects with the first circumferential groove is displaced from a position of the base end of the first middle groove in the tire circumferential direction, and a position where an imaginary line obtained by extending the second shoulder groove toward the vehicle mounting inner side intersects with the fourth circumferential groove is displaced from a position of the base end of the second middle groove in the tire circumferential direction.", "the first middle groove has a groove width wider than a groove width of the first shoulder groove, and the second middle groove has a groove width wider than a groove width of the second shoulder groove.", "in a region from the inner side of the first shoulder land portion in the tire width direction to the ground contact edge, the first shoulder groove is inclined to the outer side in the tire width direction in a same direction as the first middle groove in the tire circumferential direction, and in a region from the inner side of the second shoulder land portion in the tire width direction to the ground contact edge, the second shoulder groove is inclined to the outer side in the tire width direction in a same direction as the second middle groove in the tire circumferential direction.", "an angle between the first middle groove and the tire width direction is larger than an angle between the first shoulder groove and the tire width direction in a region from the inner side of the first shoulder land portion in the tire width direction to the ground contact edge, and an angle between the second middle groove and the tire width direction is larger than an angle between the second shoulder groove and the tire width direction in a region from the inner side of the second shoulder land portion in the tire width direction to the ground contact edge."], "bibtex": "@patent{20240278601,\n    title = {TIRE},\n    number = {20240278601},\n    year = {2024},\n    note = {File: US20240278601A1-20240822.XML}\n    }", "classification": "B60C1103FI"}, {"title": "COMMERCIAL VEHICLE TYRE", "doc_number": "20240278602", "filename": "US20240278602A1-20240822.XML", "abstract": "The invention relates to a commercial vehicle tire having a tread with at least one profile rib which runs in encircling fashion in a circumferential direction, is arranged laterally with respect to the tire equatorial plane and has sipes extending through it, which sipes each have sipe walls, a sipe midplane spaced apart equally from the sipe walls, a width of 0.4 mm to 2.0 mm and a maximum depth in a radial direction of at least 40% of the profile depth, wherein each sipe, at least in a portion which runs over the predominant part thereof as seen in plan view, has at least one sipe zone which is offset in relation to the radially outer sipe periphery and which runs in an extent direction of the sipe in an undulating form and in arcuate or singly serrated form in a radial direction, wherein a plane running through the point of the maximum excursion of the sipe zone has a line of intersection with the sipe midplane, which line of intersection follows the undulating form of the sipe zone. The sipe runs in the undulating form exclusively in the sipe zone, wherein the amplitude of the line of intersection that follows the undulating form of the sipe zone decreases, in each line-of-intersection portion running over one half of a wavelength, in the direction of the tread-outside sipe end.", "detailed_description": ["Commercial vehicle tires designed according to the invention are tires for multi-track commercial vehicles, preferably for medium-weight trucks (7.5 t<gross vehicle weight≤18.0 t) or for heavy trucks (gross vehicle weight>18.0 t), and in particular commercial vehicle tires of radial construction. The commercial vehicle tires according to the invention are preferably installed on the drive axle.", "", "FIG.1shows a plan view of a circumferential portion of a shoulder-side profile rib1of a tread of a commercial vehicle tire. A second shoulder-side profile rib, which is mirror-symmetrical with respect to the shoulder-side profile rib1in relation to the tire equatorial plane, is preferably formed in the second tread shoulder. The tread preferably has a directional profiling, which is intended for being installed on a commercial vehicle so as to have the rolling direction indicated inFIG.1by the arrow R during forward travel.", "", "The shoulder-side profile rib1is delimited toward the inside of the tread by a shoulder-side circumferential channel2, which in the exemplary embodiment shown runs in undulating fashion as seen in plan view and which, in a radial direction, is formed with the respectively provided profile depth TP(indicated inFIG.3), normally of 12.0 mm to 26.0 mm. In the case of treads with circumferential channels of different depths, the expression “profile depth” refers to the depth of the deepest circumferential channel(s).", "", "The shoulder-side profile rib1has a rib outer surface1asituated at the tread periphery and is equipped with a multiplicity of shoulder-side transverse channels3which are distributed over the tread circumference, which run parallel to one another as seen in plan view, which are inclined relative to the axial direction and which extend through the shoulder-side profile rib1such that said profile rib exhibits rib elements4. At the rib outer surface1a, each rib element4has a leading edge5aat one adjoining transverse channel3, said leading edge entering the ground contact patch first as the tire rolls during forward travel (arrow R), has a trailing edge5bat the other adjoining transverse channel3, and has an edge Sc at the circumferential channel2. As seen in plan view, the edges5a,5brun substantially parallel to one another, each with a scarcely perceptible S-shaped curvature, and, based on a line1(FIG.2) which connects the ends of the particular edge5a,5band which is straight in plan view, at an angle α (FIG.2) relative to the axial direction of 10° to 25°, in particular of 13° to 20°, wherein the angle α of the edge5adiffers from the angle α of the edge5bby at most 3, in particular by at most 1°. Shoulder-side transverse channels3that directly follow one another in a circumferential direction have spacings a1to one another of preferably 20.0 mm to 80.0 mm, in particular of 30.0 mm to 70.0 mm, based on the edges5a,5band measured in the circumferential direction.", "", "In the exemplary embodiment shown, a bevel6aproceeds from the edge5aand a bevel6cproceeds from the edge Sc, wherein, as viewed in a cross section perpendicular to the associated edge5a, Sc, the bevels6a,6cappear as straight lines and run at an angle of preferably 30° to 55° with respect to the radial direction, and said bevels furthermore each extend in a radial direction to a depth tf(FIG.3) of in particular up to 3.0 mm and each have a bevel edge7a(bevel6a:FIG.2andFIG.3),7c(bevel6c:FIG.2andFIG.3) that runs at the depth tf.", "", "The further configuration of the shoulder-side transverse channels3will be discussed below with reference to a single shoulder-side transverse channel3.", "", "As shown inFIG.2, the shoulder-side transverse channel3has a scarcely perceptible S-shaped curvature as seen in plan view, similarly to the edges5a,5b. The transverse channel3has a width bQR, measured as a smallest possible spacing between the edges5a,5b, of 6.0 mm to 12.0 mm, said width either being constant over the extent of the edges5a,5bor varying by at most 2.0 mm, and a length lQRprojected in the axial direction and based on the edges5a,5b, specifically on the longer of the two edges5a,5bin the case of edges5a,5bof different lengths.", "", "A profile rib web8(cf.FIG.3andFIG.4) is formed in the transverse channel3, which profile rib web8is spaced apart from the ends of the transverse channel3, extends over the predominant part of the length lQRof the transverse channel3, extends to the rib elements4, and is offset in a radial direction in relation to the rib outer surface1a, such that the transverse channel3, as seen in plan view, is made up of a central channel main portion3a, which runs on the profile rib web8, a channel mouth portion3badjoining the tread-inside end of the profile rib web8, and a channel shoulder portion3cadjoining the tread-outside end of the profile rib web8.", "", "The channel mouth portion3band the channel shoulder portion3care, as seen in cross section, each delimited by a base9b(channel mouth portion3b, cf.FIG.3),9c(channel shoulder portion3c, cf.FIG.4) and by flanks9d(cf.FIG.3andFIG.4) formed on the rib elements4, with in each case one flank9drunning to the bevel edge7a(FIG.2toFIG.4) and the other flank9drunning to the trailing edge5b(FIG.2andFIG.4).", "", "As is also shown inFIG.2, the profile rib web8is delimited in a radial direction by a top surface8arunning parallel to the rib outer surface1a, toward the channel mouth portion3bby a tread-inside side flank8b(seeFIG.3) running in the direction of the base9b, and toward the channel shoulder portion3cby a tread-outside side flank8c(cf.FIG.4) running in the direction of the base9c. The top surface8aruns, in relation to the rib outer surface1a(FIG.4), at a depth ta, measured at the lowest point(s) of said top surface in a radial direction, of 1.0 mm to 10.0 mm, in particular of 2.0 mm to 5.0 mm. The side flanks8b,8crun in a radial direction or at an angle of up to 3° relative to the radial direction, and in the exemplary embodiment shown are surfaces which have a slight curvature over their entire extent and which indent the end regions of the profile rib web8and which transition continuously (without sharp angles) into the flanks9dof the channel mouth portion3band the flanks9dof the channel shoulder portion3c(FIG.2toFIG.4) respectively. Furthermore, in the exemplary embodiment shown, between the top surface8aand each adjoining rib element4, there is formed a rounded transition portion10(FIG.2toFIG.4) which extends from the tread-inside side flank8b(FIG.3) to the tread-outside side flank8c(FIG.4) and adjoins these in continuous fashion (without sharp angles). Further rounded transition portions11(FIG.2toFIG.4) are formed between the ends of the top surface8aand the side flanks8b,8c.", "", "As perFIG.2, the profile rib web8has a length lS, based on the furthest spaced-apart ends of its top surface8aand projected in the axial direction, of 50% to 80%, in particular of 65% to 75%, of the length lQRof the transverse channel3, and is provided with a sipe12which proceeds from the center of the top surface8a, which runs in a radial direction into the interior of the profile rib web8, which extends through the profile rib web8over the longitudinal extent thereof, and which in the exemplary embodiment opens, over its entire extent, into a tubular channel13(cf.FIG.5) formed in the interior of the profile rib web8. Both the sipe12and the channel13therefore emerge from the profile rib web8at the side flanks8b,8c, with the sipe12furthermore emerging at the rounded transition portions11.", "", "As shown inFIG.5,FIG.6andFIG.8, the sipe12has two mutually opposite sipe walls12aand a constant width bE(FIG.8), measured between and perpendicular to the sipe walls12a, of 0.4 mm to 2.0 mm, in particular of up to 1.2 mm, preferably of up to 0.8 mm, and, over the predominant part of its extent, extends in a radial direction to a maximum depth tE(FIG.3, depth at the lowest point), measured in relation to the level of the rib outer surface1a, of 40% to 90%, in particular of 50% to 80%, of the profile depth TP(FIG.3). The sipe12becomes narrower in the direction of the tread shoulder, in a manner known per se.", "", "The sipe12has a sipe centerline mE(FIG.6), which as seen in plan view follows the sipe profile present at the top surface8a, a sipe midplane fE(FIG.8), which proceeds from said sipe centerline and which is spaced apart equally from the sipe walls12a, a tread-inside sipe end12b(FIG.6) and a tread-outside sipe end12c(FIG.6), and, as seen in cross section as shown inFIG.8, said sipe is made up in a radial direction of a radially outer sipe portion12′ (scarcely visible inFIG.8), a middle sipe zone12″ which runs in arcuate or singly serrated form (that is to say in the present case in a V shape), and a radially inner sipe portion12′″.", "", "The radially outer sipe portion12′ and the radially inner sipe portion12′″ run in a radial direction and as a continuation of one another (in alignment), and have respective lengths l′ (sipe portion12′) and l′″ (sipe portion12′″), based on the sipe midplane fEand measured in a radial direction, of preferably 0.5 mm to 1.5 mm in each case.", "", "The middle sipe zone12″ is thus offset in a radial direction relative to the level of the radially outer sipe periphery that is present at the top surface8a(level of the sipe edges), that is to say into the interior of the profile rib web8. The middle sipe zone12″ runs in an extent direction of the sipe12in an undulating form (FIG.6) and has a length l″ (FIG.8), based on the sipe midplane fEand measured in a radial direction, of 30% to 90%, in particular of 35% to 80%, of the maximum depth tE(FIG.3). In the direction of the outside of the tread, the length l″ preferably decreases by 10% to 30% in relation to its particular maximum value (cf.FIG.10).", "", "As can be seen fromFIG.8in particular in combination withFIG.5, the middle sipe zone12″ furthermore has a plane of symmetry F1(indicated inFIG.5by the level N7), which is oriented parallel to the rib outer surface1aand which runs through the point of the maximum excursion of the middle sipe zone12″ and, at least over the predominant part of its extent, at a constant depth tF(FIG.8), measured in a radial direction, of 45% to 65%, in particular of 50% to 60%, of the maximum depth tE(FIG.3). The point of the maximum excursion of the middle sipe zone12″ is defined by that point of the sipe midplane fEwhich has the greatest excursion in relation to the sipe centerline mEas seen in the cross section which, in plan view, is oriented perpendicular to the sipe centerline mE.", "", "FIG.9andFIG.10each show the sipe midplane fEof the sipe12. InFIG.9, the sipe midplane fEhas a line of intersection l1with the plane of symmetry F1(FIG.8), which line of intersection, as seen in plan view, runs in a zigzag-shaped undulation over the aforementioned length lS(cf.FIG.2), projected in the axial direction, of the profile rib web8. The line of intersection l1thus follows the undulating form of the middle sipe zone12″. As shown inFIG.7, the middle sipe zone12″ is thus formed by shallow pyramid-shaped projections14, which are formed correspondingly alternately on the sipe walls12aand each have a rectangular, in particular square, base lying on the particular sipe wall12a(cf. the visualization inFIG.10), and depressions15which are situated opposite, and correspond with, the projections14.", "", "The profile of the line of intersection l1will hereinafter be discussed with the aid of an undulation baseline lb(FIG.9) that runs in the plane of symmetry F1. The undulation baseline lbis obtained by projecting the sipe centerline mE(FIG.6) into the plane of symmetry F1(FIG.8) and is the line in relation to which the amplitude of the undulation is measured in a known manner. As perFIG.9, the line of intersection l1running in undulating fashion extends over three to six, preferably over up to five, in the exemplary embodiment over four, wavelengths λ, which in the exemplary embodiment are of equal size. Furthermore, the line of intersection l1running in undulating fashion has a varying amplitude which decreases, over each line-of-intersection portion l1′ (two of these are labeled inFIG.9) running over one half of a wavelength λ/2, in the direction of the tread-outside sipe end12c. The decrease in amplitude thus takes place in each case from the tread-inside end of a line-of-intersection portion l1′, which is situated closer to the tread-inside sipe end12b, to the tread-outside end of said line-of-intersection portion l1′, which is situated closer to the tread-outside sipe end12c. At the tread-inside end of that line-of-intersection portion l1′ which is furthest to the inside of the tread, the amplitude has an amplitude value A1. At the tread-outside end of that line-of-intersection portion l1′ which is furthest to the inside of the tread, the amplitude has an amplitude value A2(A2<A1), which is thus also simultaneously present at the tread-outside end of the next line-of-intersection portion l1′. This decrease in amplitude progresses over the further line-of-intersection portions l1′, such that, in the exemplary embodiment, the amplitude has the following amplitude values in succession proceeding from the tread-inside end of that line-of-intersection portion l1′ which is furthest to the inside of the tread to the tread-outside end of that line-of-intersection portion l1′ which is furthest to the outside of the tread: A1-A2-A3-A4-A5-A6-A7-A8. The amplitude value A1is 100% to 500%, in particular 120% to 300%, preferably 150% to 250%, of the width bE(FIG.8) of the sipe12. For the further amplitude values Ai+1, the following applies: Ai+1=Ai*0.60 to Ai*0.95 (in the exemplary embodiment, i=1 to 7). It is thus for example the case that the amplitude value A2is 60% to 95% of the amplitude value A1, and the amplitude value A3is 60% to 95% of the amplitude value A2.", "", "As perFIG.8, the aforementioned channel13has a circular cross section with a diameter dKof 200% to 600%, in particular of 300% to 500%, preferably of 350% to 450%, of the width bEof the sipe12, and is designed such that the sipe12, over its entire extent, opens centrally into said channel (FIG.6), such that the channel13has a channel axis running through its center and parallel to the sipe centerline mE(FIG.6).", "", "The invention is not limited to the exemplary embodiment described.", "", "The channel13is optional. The tread may also be of non-directional design.", "", "The sipes12run at an angle of 0° to 50° with respect to the axial direction and may have a straight, arcuate or curved profile as seen in plan view. In the case of sipes12which run in straight fashion as seen in plan view, the angle relates to the sipe centerline; otherwise, the angle relates to a line which is straight in plan view and which connects the ends of the sipe centerline. The sipes12are situated in at least a profile rib which is formed laterally with respect to the tire equatorial plane and which runs in encircling fashion in a circumferential direction (not in a central profile rib that is bisected by the tire equatorial plane). Here, the sipes12may proceed in each case directly from the rib outer surface1a, in each case from a base of a shallow depression which is formed in the profile rib and which is open to the tread periphery and which has a depth, measured at the lowest point(s) of said depression in a radial direction, of 1.0 mm to 10.0 mm, preferably of 2.0 mm to 5.0 mm, or from a profile rib web situated in a transverse channel, wherein the sipes extend through the profile rib or through the profile rib webs belonging to said profile rib. The aforementioned variants may also be combined with one another as desired. The sipe zones are provided at least in a portion of the sipe that runs over the predominant part of the sipe. The form of the undulation that is present in the extent direction of the sipe in the sipe zone may vary, such that the form of the undulation is, as described, a zigzag-shaped undulation, alternatively a sawtooth-shaped undulation, or a rounded undulation, for example a sinusoidal undulation."], "claims": ["1 - 15 . (canceled)", "a shoulder side profile rib that runs in encircling fashion in a circumferential direction, is arranged laterally with respect to a tire equatorial plane and has a plurality of sipes extending through it; the sipes each have sipe walls, a sipe midplane spaced apart equally from the sipe walls, a width (b the maximum depth is at least 40% of the profile depth (T each sipe of the plurality of sipes has at least one sipe zone which is offset in relation to the radially outer sipe periphery and which runs in an extent direction of the sipe in an undulating form and in arcuate or singly serrated form in a radial direction; a plane (F wherein a sipe of the plurality of sipes runs in the undulating form exclusively in the sipe zone, wherein the amplitude of the line of intersection (l) that follows the undulating form of the sipe zone decreases, in each line-of-intersection portion running over one half of a wavelength (λ/2), in the direction of a tread-outside sipe end.", "17 . The tire of claim 16 , wherein the amplitude has a first amplitude value (A i ) at the tread-inside end of each line-of-intersection portion (l 1 ′) and has a second amplitude value (A i+1 ) at the tread-outside end of each line-of-intersection portion (l 1 ′), wherein each second amplitude value (A i+1 ) is 0.60 times to 0.95 times the associated first amplitude value (A i ).", "18 . The tire of claim 16 , wherein the amplitude (A 1 ) at the tread-inside end of that line-of-intersection portion (l 1 ′) which is furthest to the inside of the tread has an amplitude value (A 1 ) of 100% to 500% of the width (b E ) of the sipe ( 12 ).", "19 . The tire of claim 16 , wherein the line of intersection (l 1 ) that follows the undulating form of the sipe zone ( 12 ″) runs over three to six wavelengths (λ).", "20 . The tire of claim 16 , wherein the wavelengths (λ) are of equal size.", "21 . The tire of claim 16 , wherein the plane (F 1 ) that runs through the point of the maximum excursion of the sipe zone ( 12 ″) runs parallel to the rib outer surface ( 1 a ) of the profile rib ( 1 ).", "22 . The tire of claim 16 , wherein the plane (F 1 ) that runs through the point of the maximum excursion of the sipe zone ( 12 ″) is a plane of symmetry (F 1 ) of the sipe zone ( 12 ″).", "23 . The tire of claim 16 , wherein the plane (F 1 ) that runs through the point of the maximum excursion of the sipe zone ( 12 ″) runs, at least over the predominant part of its extent, at a constant depth (t F ), measured in a radial direction, of 45% to 65%, in particular of 50% to 60%, of the maximum depth (t E ) of the sipe ( 12 ).", "24 . The tire of claim 16 , wherein the line of intersection (l 1 ) that follows the undulating form of the sipe zone ( 12 ″) runs in the form of a zigzag-shaped undulation.", "25 . The tire of claim 16 , wherein as viewed in a cross section of the sipe ( 12 ), the sipe zone ( 12 ″) has a length (l″), based on the sipe midplane (f E ) and measured in a radial direction, of 30% to 90%, in particular of 35% to 80%, of the maximum depth (t E ) of the sipe ( 12 ).", "26 . The tire of claim 16 , wherein the sipe ( 12 ) has a radially outer sipe portion ( 12 ″) which runs in a straight manner between the sipe zone ( 12 ″) and the sipe periphery and in the cross section of the sipe ( 12 ) and which has a length (l″), based on the sipe midplane (f E ), of preferably 0.5 mm to 1.5 mm.", "27 . The tire of claim 16 , wherein the sipe ( 12 ) has a radially inner sipe portion ( 12 ′″) which adjoins the sipe zone ( 12 ″) and which runs in a straight manner in the cross section of the sipe ( 12 ) and which has a length (l′″), based on the sipe midplane (f E ), of preferably 0.5 mm to 1.5 mm.", "a) which proceed from the rib outer surface ( b) which are each situated in a profile rib web ( c) which each proceed from the base of a depression extending through the profile rib (", "29 . The tire of claim 16 , wherein the sipes ( 12 ) are provided which each, over their entire extent, open into a channel ( 13 ) which is formed in the interior of the profile rib ( 1 ) and which has a diameter (d K ) of 200% to 600%, in particular of 300% to 500%, preferably of 350% to 450%, of the width (b E ) of the sipe ( 12 ).", "30 . The tire of claim 16 , wherein the profile rib ( 1 ) is a shoulder-side profile rib ( 1 ).", "a shoulder side profile rib that runs in encircling fashion in a circumferential direction, is arranged laterally with respect to a tire equatorial plane and has a plurality of sipes extending through it; the sipes each have sipe walls, a sipe midplane spaced apart equally from the sipe walls, a width (b the maximum depth is at least 40% of the profile depth (T each sipe of the plurality of sipes has at least one sipe zone which is offset in relation to the radially outer sipe periphery and which runs in an extent direction of the sipe in an undulating form and in arcuate or singly serrated form in a radial direction; a plane (F wherein a sipe of the plurality of sipes runs in the undulating form exclusively in the sipe zone, wherein the amplitude of the line of intersection (l) that follows the undulating form of the sipe zone decreases, in each line-of-intersection portion running over one half of a wavelength (λ/2), in the direction of a tread-outside sipe end; wherein one or more of the plurality of sipes: proceed from a rib outer surface; and are each situated in a profile rib web of the shoulder profile rib and which is formed in a transverse channel, wherein the profile rib web extends over a predominant part of the transverse channel and has a top surface which, in relation to the rib outer surface (", "32 . The tire of claim 32 , wherein the one or more of the plurality of sipes each proceed from the base of a depression extending through the profile rib, wherein the depression has a depth of 1.0 mm to 10.0 mm, in particular of 2.0 mm to 5.0 mm, in a radial direction in relation to the rib outer surface of the profile rib."], "bibtex": "@patent{20240278602,\n    title = {COMMERCIAL VEHICLE TYRE},\n    number = {20240278602},\n    year = {2024},\n    note = {File: US20240278602A1-20240822.XML}\n    }", "classification": "B60C1103FI"}, {"title": "PNEUMATIC TIRE", "doc_number": "20240278603", "filename": "US20240278603A1-20240822.XML", "abstract": "A pneumatic tire is provided with a mark portion raised from a surface of at least one of side portions. A first region demarcated on the mark portion side of a boundary position between the mark portion and the surface of the at least one of the side portions is provided with a plurality of micro protrusions each having a raised height smaller than a raised height of the mark portion and a second region demarcated on the surface-of-the-at-least-one-of-the-side-portions side of the boundary position is not provided with the micro protrusions.", "detailed_description": ["An embodiment of the present disclosure will now be described in conjunction with accompanying drawings. The drawings contain exaggerations and representations different from the actual dimensional ratios of the structure to aid in the understanding of the present disclosure. Further, in the case where there are multiple embodiments, identical or common elements will be assigned with the same reference sign throughout the specification, and redundant explanations will be omitted.", "", "FIG.1is a partial side view of a pneumatic tire1(hereinafter simply referred to as “tire1”) showing an embodiment of the present disclosure.FIG.1is a partial side view of the tire1(hereinafter referred to simply as “Tire1”). The tire1of the present embodiment is suitably used for passenger cars, for example. However, the present disclosure may be applied to the tire1for motorcycles or for heavy duty, for example.", "", "In the present specification, unless otherwise noted, the dimensions and the like of various parts of the tire1are the values measured under the standard state. In the case of pneumatic tires for which various standards have been established, the term “standard state” refers to a state in which the tire1is mounted on the standard rim (not shown), inflated to the standard inner pressure, and loaded with no tire load. In the case of tires for which various standards have not been established, the standard state refers to a standard use state according to the purpose of use of the tire and being unmounted to a vehicle and loaded with no tire load.", "", "The term “standard rim” refers to a wheel rim specified for the concerned tire by a standard included in a standardization system on which the tire is based, for example, the “normal wheel rim” in JATMA, “Design Rim” in TRA, and “Measuring Rim” in ETRTO.", "", "The term “standard inner pressure” refers to air pressure specified for the concerned tire by a standard included in a standardization system on which the tire is based, for example, the maximum air pressure in JATMA, maximum value listed in the “TIRE LOAD LIMITS AT VARIOUS COLD INFLATION PRESSURES” table in TRA, and “INFLATION PRESSURE” in ETRTO.", "", "As shown inFIG.1, the tire1of the present embodiment includes a tread portion2and a pair of side portions3extending from the tread portion2inwardly in the tire radial direction.FIG.1shows one of the side portions3.", "", "At least one of the pair of the side portions3is provided with a mark portion4containing letters, symbols, or figures that rise from a surface (3s) of the side portion3. The mark portion4is formed on both of the pair of the side portions3, for example. The mark portion4consists of the four letters “A”, “L”, “K”, and “E” in the present embodiment. It should be noted that the mark portion4is not limited to such a manner.", "", "The surface (3s) of the side portions3and the mark portion4are formed of rubber G1. The rubber G1is manufactured from known rubber materials. It should be noted that the rubber G1is black rubber in the present embodiment, although it is not limited to this. Further, the mark portion may include rubber material of different color from black.", "", "FIG.2is a perspective view of the letter “L” which is one of the letters that make up mark portion4, andFIG.3is a cross section taken along the A-A line ofFIG.2. As shown inFIGS.1through3, the side portion3include a boundary position (Y) between the surface (3s) of the side portion3and the mark portion4, a first region7on the side of the mark portion4from the boundary position (Y), and a second region8on the side of the surface (3s) of the side portion3from the boundary position (Y). In the first region7, a plurality of micro protrusions9each having a raised height smaller than a raised height of the mark portion4is formed. The micro protrusions9suppress diffuse reflection of the irradiated light, therefore, the blackness of the first region7is increased. In addition, the micro protrusions9are not formed in the second region8. As a result, the blackness of the second region8is smaller than the blackness of the first region7. Thereby, the appearance of the mark portion4is improved by the surface (3s) of the side portion3being clearly distinguished from the mark portion4, which also makes the mark portion4appear to stand out higher or more three-dimensionally. For convenience, the first region7where a plurality of the micro protrusions9is formed is shaded inFIGS.1through4andFIG.6.", "", "A raised height (Ha) of the mark portion4is preferably 3 mm or more, more preferably 4 mm or more, and preferably 7 mm or less, more preferably 6 mm or less, for example. Thereby, the mark portion4becomes more visible and damage to the mark portion4can be suppressed.", "", "The surface (3s) of the side portion3in the present embodiment is formed with a smooth surface facing outward in the tire axial direction. It should be noted that the surface (3s) of the side portion3can be formed with a well-known serration pattern (not shown) consisting of a plurality of grooves and ridges arranged between adjacent grooves.", "", "The first region7is formed over the entire circumference of the mark portion4, and in the present embodiment, over the entire circumference of each of the letters, for example. In other words, the micro protrusions9are provided around the entire circumference of each of the letters in the present embodiment.", "", "FIG.4is an enlarged view ofFIG.3. As shown inFIG.2orFIG.4, the mark portion4includes a sidewall surface11rising from the surface (3s) of the side portion3and an outward surface12facing outward in the tire axial direction. The outward surface12is connected to an outer edge (11e) in the tire axial direction of the sidewall surface11, for example. The first region7is not formed on the outward surface12in the present embodiment.", "", "The boundary position (Y) is an outer edge (raised edge) of the mark portion4that rises from the surface (3s) of the side portion3if it can be clearly identified. Further, the boundary position (Y) is defined as the position where a shortest distance (La) from the outer edge (11e) is 5 mm in a plan view of the side portion3, if the outer edge (raised edge) of the mark portion4cannot be clearly identified.", "", "The second region8surrounds the entire circumference of the boundary position (Y) of the mark portion4, for example. The second region8is formed continuously between the boundary positions (Y) of the adjacent mark portions4in the present embodiment.", "", "The sidewall surface11includes a planar portion11A and an arcuate surface11B connecting the planar portion11A and the boundary position (Y). The planar portion11A includes a mode formed with a flat surface as well as that with a radius of curvature (Ra) exceeding 8.0 mm. The arcuate surface11B prevents loads acting on the mark portion4from concentrating at the base of the mark portion4, thereby reducing damage to the mark portion4and further enhancing its appearance.FIGS.3and4are also cross sections orthogonal to the sidewall surface11and the surface (3s) of the side portion3.", "", "The first region7is formed on the arcuate surface11B in the present embodiment. The arcuate surface11B is the area where the amount of light irradiated is less compared to the surface (3s). The micro protrusions9formed on the arcuate surface11B configured as such further increase the blackness of the arcuate surface11B, therefore, the appearance (i.e., visibility) of the mark portion4is further improved.", "", "The first region7is provided within the arcuate surface11B, for example. In other words, the first region7is not provided in the planar portion11A in the present embodiment. As a result, the blackness of the arcuate surface11B is greater than the blackness of the planar portion11A, which makes them clearly distinguishable and thus further improves the appearance of the mark portion4. It is preferred that the first region7is provided over the entire range of the arcuate surface11B, for example. It should be noted that the first region7may be provided in the arcuate surface11B and the planar portion11A. Such an embodiment increases the overall blackness of the sidewall surface11.", "", "It is preferred that a radius of curvature R1of the arcuate surface11B is 2.0 mm or more. As a result, the number of the micro protrusions9arranged on the arcuate surface11B is ensured, and thus the effect of increasing blackness is exerted. Further, the effect of increasing the rigidity of the mark portion4is exerted. If the radius of curvature R1of the arcuate surface11B is excessively large, the micro protrusions9formed on the arcuate surface11B will be noticeable, which may deteriorate the appearance performance. Therefore, the radius of curvature R1of the arcuate surface11B is more preferably 2.5 mm or more, and preferably 8.0 mm or less, and more preferably 5.0 mm or less.", "", "FIG.5Ais an enlarged perspective view of the first region7andFIG.5Bis a perspective view of one of the micro protrusions9in the present embodiment. As shown inFIG.5A, the first region7is formed by a plurality of the micro protrusions9and a joint surface13that connects the micro protrusions9to each other. The joint surface13is located inside the mark portion4(i.e., recessed) than the planar portion11A and the surface (3s), for example. This makes the shape of the micro protrusions9themselves less noticeable. In the present specification, the radius of curvature R1of the arcuate surface11B is identified at the joint surface13. It should be noted that the joint surface13may be smoothly connected to the planar portion11A and the surface (3s) (this embodiment not shown).", "", "The micro protrusions9are formed as truncated cones. As a result, even when a load is applied to the arcuate surface11B, damage caused by contact between the micro protrusions9formed on the arcuate surface11B can be suppressed, and thus the effect of improving the appearance of the mark portion4can be exerted for a long time. In addition, this type of the micro protrusions9facilitates the separation between the tire1and the tire vulcanization mold of the well-known structure during vulcanization molding. Each of the micro protrusions9includes a side surface (9a) tapered in a direction away from the joint surface13, and a top surface (9b) connected to the side surface9a, for example. Each of the micro protrusions9of the present embodiment further includes a recessed portion14recessed from the top surface (9b). The micro protrusions9configured as such help to further increase the blackness. It should be noted that the micro protrusions9are not limited to such an embodiment, and may have a truncated cone shape without the recessed portion14, or a conical shape formed only with the side surface (9a) without the top surface (9b) (not shown). Further, the top surface (9b) is not limited to a flat surface, but may be formed as an arcuate surface convex outward in the tire axial direction depending on manufacturing precision (not shown).", "", "A maximum diameter L1of each of the micro protrusions9is preferably 0.1 mm or more, more preferably 0.15 mm or more, and preferably 0.5 mm or less, more preferably 0.45 mm or less. Since the maximum diameter L1of each of the micro protrusions9is 0.1 mm or more, the effect of suppressing rubber flow is highly exhibited, therefore, the appearance of the mark portion4can be improved. Since the maximum diameter L1of each of the micro protrusions9is 0.5 mm or less, the micro protrusions9are less noticeable and the appearance can be maintained high. In order to effectively exert such an effect, a raised height H1of each of the micro protrusions9is preferably 0.1 mm or more, more preferably 0.15 mm or more, and preferably 0.5 mm or less, more preferably 0.45 mm or less. Furthermore, it is preferred that the micro protrusions9are provided at a density of 2 to 10 per mm2of the first region7.", "", "In order to make the shape of the micro protrusions9less noticeable and to enhance the appearance of the mark portion4, it is preferred that the raised height H1of each of the micro protrusions9is the same as a shortest distance DI between the joint surface13and the surface (3s).", "", "As shown inFIGS.2to4, the mark portion4further includes a recessed portion15formed in the outward surface12in the present embodiment. The recessed portion15includes an opening edge16, a bottom surface17, and an inner wall surface18extending from the opening edge16toward the bottom surface17. The opening edge16extends along the outer edge (11e) of the sidewall surface11in the present embodiment. As a result, in the present embodiment, the mark portion4is formed in a so-called open face that traces the outline (outer edge (11e)) of the outward surface12. The bottom surface17extends substantially parallel to the outward surface12, for example. In the present embodiment, the bottom surface17is located axially outside the surface (3s) of the side portion3. In other words, the recessed portion15is formed to have a depth (d1) smaller than the raised height (Ha) of the mark portion4. The recessed portion15configured as such suppresses a large decrease in the rigidity of the mark portion4and thereby suppresses damage to the mark portion4.", "", "In a cross section perpendicular to the bottom surface17, the bottom surface17and the inner wall surface18are connected via an inner arcuate surface20. A plurality of micro protrusions21is formed on the inner arcuate surface20. Therefore, the blackness of the inner arcuate surface20is increased, thereby, the appearance of the mark portion4is further improved. The cross section perpendicular to the bottom surface17is the same as the cross section perpendicular to the sidewall surface11and the surface (3s), for example.FIGS.3and4are also cross sections perpendicular to the bottom surface17.", "", "The inner arcuate surface20has a smaller separation distance from the outward surface12than the arcuate surface11B, therefore, smaller stress is generated than the stress generated in the arcuate surface11B. Further, the smaller a radius of curvature R2of the inner arcuate surface20, the more clearly the bottom surface17and the inner wall surface18can be distinguished. Therefore, it is preferred that the radius of curvature R2of the inner arcuate surface20is smaller than the radius of curvature R1of the arcuate surface11B. Although not particularly limited, the radius of curvature R2of the inner arcuate surface20is preferably 1.5 mm or more, more preferably 2.0 mm or more, and preferably 7.0 mm or less, more preferably 4.0 mm or less.", "", "It is preferred that the micro protrusions21have the same shape (not shown) or the same size as the micro protrusions9. Thereby, the effect of increasing the blackness of the inner arcuate surface20is effectively exerted. In the present embodiment, the micro protrusions21have the same shape and the same size as the micro protrusions9.", "", "FIG.6is a cross-sectional view orthogonal to the surface (3s) of the side portion3and the sidewall surface11in another embodiment. As shown inFIG.6, in the present embodiment, the first region7is provided only on a part of the arcuate surface11B that is separated (i.e., spaced apart) from the boundary position (Y) toward the mark portion4side. In other words, the first region7is not provided in an area of the arcuate surface immediately adjacent to the boundary position (Y), i.e., the micro protrusions9are not provided in the area of the arcuate surface immediately adjacent to the boundary position (Y). Even in such an embodiment, the appearance of the mark portion4is improved because the mark portion4and the surface (3s) of the side portion3can be easily distinguished by the effect of increasing the blackness by the first region7.", "", "While detailed description has been made according to an especially preferred embodiment of the present disclosure, the present disclosure can be embodied in various forms without being limited to the illustrated embodiment."], "claims": ["a tread portion; a pair of side portions extending inward in a tire radial direction from the tread portion; a mark portion raised from a surface of at least one of the side portions and including a letter, a symbol, or a figure; a boundary position between the mark portion and the surface of the at least one of the side portions; a plurality of micro protrusions having a raised height smaller than a raised height of the mark portion; a first region demarcated on the mark portion side of the boundary position and provided with the micro protrusions; and a second region demarcated on the surface-of-the-at-least-one-of-the-side-portions side of the boundary position and not provided with the micro protrusions.", "2 . The pneumatic tire according to claim 1 , wherein the micro protrusions are conical or truncated conical.", "3 . The pneumatic tire according to claim 2 , wherein the micro protrusions have a maximum diameter of 0.1 mm or more and 0.5 mm or less and the raised height of 0.1 mm or more and 0.5 mm or less.", "the mark portion includes a sidewall surface rising from the surface of the at least one of the side portions, the sidewall surface includes a planar portion and an arcuate surface connecting the planar portion and the boundary position in a cross section perpendicular to the sidewall surface and the surface of the at least one of the side portions, and the first region is formed on the arcuate surface.", "5 . The pneumatic tire according to claim 4 , wherein the first region is provided within the arcuate surface.", "6 . The pneumatic tire according to claim 4 , wherein the arcuate surface has a radius of curvature of 2.0 mm or more.", "the mark portion includes a sidewall surface rising from the surface of the at least one of the side portions, an outward surface facing outward in a tire axial direction, and a recessed portion formed in the outward surface, the recessed portion includes an opening edge, a bottom surface, and an inner wall surface extending from the opening edge toward the bottom surface, the bottom surface and the inner wall surface are connected via an inner arcuate surface in a cross section perpendicular to the bottom surface, and the inner arcuate surface is provided with a plurality of micro protrusions.", "8 . The pneumatic tire according to claim 7 , wherein the opening edge extends along an outer edge in the tire axial direction of the sidewall surface.", "9 . The pneumatic tire according to claim 1 , wherein the first region is formed over the entire circumference of the mark portion.", "10 . The pneumatic tire according to claim 4 , wherein the first region is provided over the entire range of the arcuate surface.", "11 . The pneumatic tire according to claim 4 , wherein the first region is not formed in the planar portion.", "12 . The pneumatic tire according to claim 4 , wherein the first region is formed in the planar portion.", "the first region is formed by the micro protrusions and a joint surface connecting the micro protrusions to each other, and the joint surface is recessed from the planar portion and the surface of the at least one of the side portions.", "14 . The pneumatic tire according to claim 13 , wherein each of the micro protrusions includes a side surface tapered in a direction away from the joint surface, a top surface connected to the side surface, and a recessed portion 14 recessed from the top surface.", "15 . The pneumatic tire according to claim 13 , wherein the raised height of the micro protrusions is the same as a shortest distance between the joint surface and the surface of the at least one of the side portions.", "16 . The pneumatic tire according to claim 1 , wherein the micro protrusions are provided at a density of 2 to 10 per mm 2 of the first region.", "17 . The pneumatic tire according to claim 7 , wherein the bottom surface is located axially outside the surface of the at least one of the side portions.", "the sidewall surface includes a planar portion and an arcuate surface connecting the planar portion and the boundary position in a cross section perpendicular to the sidewall surface and the surface of the at least one of the side portions, and the inner arcuate surface has a radius of curvature smaller than a radius of curvature of the arcuate surface.", "19 . The pneumatic tire according to claim 7 , wherein the micro protrusions of the inner arcuate surface have the same shape or the same size as the micro protrusions of the arcuate surface.", "20 . The pneumatic tire according to claim 1 , wherein the first region is formed only on a part of the arcuate surface spaced apart from the boundary position toward the mark portion side."], "bibtex": "@patent{20240278603,\n    title = {PNEUMATIC TIRE},\n    number = {20240278603},\n    year = {2024},\n    note = {File: US20240278603A1-20240822.XML}\n    }", "classification": "B60C1300FI"}, {"title": "TIRE", "doc_number": "20240278604", "filename": "US20240278604A1-20240822.XML", "abstract": "Tire 1 is a tire that includes a marking portion 20 disposed on a tire outer surface 1 ds of a tire side portion 1 d and a communication device 10 , wherein the marking portion has one or more markings 21 , each of the one or more markings 21 forms a letter, a symbol, or a graphic and is formed into a convex shape, and at least a part of the communication device is embedded within at least one of the one or more markings 21.", "detailed_description": ["A tire according to the present disclosure can be preferably used for any type of pneumatic tire, and can be used, for example, for a passenger vehicle pneumatic tire, a truck/bus pneumatic tire, or the like.", "", "The following describes the embodiments of a tire according to the present disclosure with reference to the drawings.", "", "Members and portions common between the drawings have the same reference signs. In certain drawings, a tire width direction is denoted by the reference sign “TW”, a tire radial direction is denoted by the reference sign “RD”, and a tire circumferential direction is denoted by the reference sign “CD”. In the present specification, “tire inner side” refers to a side closer to a tire cavity, and “tire outer side” refers to a side farther from the tire cavity.", "", "FIG.1toFIG.3are drawings for describing a tire1according to a first embodiment of the present disclosure.FIG.1is a side view illustrating a portion of a tire side portion of the tire according to the first embodiment of the present disclosure as viewed from a tire width direction outer side.FIG.2is an enlarged view illustrating an enlargement of a portion ofFIG.1.FIG.3is a cross-sectional view in the tire width direction illustrating a portion of the tire (specifically, a portion on one side relative to a tire equatorial plane CL) inFIG.2in cross section along the A-A line inFIG.2.FIG.6toFIG.8are drawings for describing a tire1according to a second embodiment of the present disclosure.FIG.6is a side view illustrating a portion of a tire side portion of the tire according to the second embodiment of the present disclosure as viewed from the tire width direction outer side.FIG.7is a cross-sectional view, in the tire width direction, illustrating a portion of the tire (specifically, a portion on one side relative to the tire equatorial plane CL) inFIG.6in cross section along the B-B line inFIG.6.FIG.8is a cross-sectional view illustrating a portion of the tire ofFIG.6in cross section along the C-C line inFIG.6.FIG.9is a drawing for describing a tire1according to a third embodiment of the present disclosure.FIG.9is a cross-sectional view, in the tire width direction, illustrating a portion of the tire (specifically, a portion on one side relative to the tire equatorial plane CL) according to the third embodiment of the present disclosure.", "", "The tire1of each embodiment inFIG.1toFIG.3andFIG.6toFIG.8is configured as a truck/bus pneumatic tire. The tire1of the embodiment inFIG.9is configured as a passenger vehicle pneumatic tire. For convenience of explanation, these embodiments are described together below.", "", "The tire1of any embodiment of the present disclosure may be configured as any type of tire.", "", "The tire1includes a tire body1M and a communication device10. The tire body1M corresponds to the portion of the tire1other than the communication device10.", "", "Hereafter, unless otherwise noted, the positional relationship and dimensions or the like of each element shall be measured in a standard state, with the tire1fitted to an applicable rim, a prescribed internal pressure applied, and no load applied. Further, in a state in which the tire1is fitted to an applicable rim, a prescribed internal pressure is applied, and no load is applied, a width in a tire width direction of a contact patch in contact with the ground is referred to as a ground contact width of the tire, and an end in the tire width direction of the ground contact width is referred to as a ground contact edge.", "", "In the present specification, “applicable rim” (Measuring Rim in the STANDARDS MANUAL of ETRTO and Design Rim in the YEAR BOOK of TRA) refers to an approved rim of an applicable size as described by, or as described in the future by, valid industrial standards for the region in which a pneumatic tire is produced or used, such as the JATMA YEAR BOOK of JATMA (the Japan Automobile Tyre Manufacturers Association) in Japan, the STANDARDS MANUAL of ETRTO (European Tyre and Rim Technical Organization) in Europe, and the YEAR BOOK of TRA (The Tire and Rim Association, Inc.) in the U.S., and in a case in which a rim size is not as described in these industrial standards, the “applicable rim” refers to a rim with a width corresponding to a bead width of the pneumatic tire. The “applicable rim” includes current sizes as well as sizes that will be included in the future in the above industrial standards. Examples of a “size described in the future” may include sizes as described in “FUTURE DEVELOPMENTS” in the 2013 edition of the STANDARDS MANUAL of ETRTO.", "", "In the present specification, “prescribed internal pressure” refers to an air pressure (maximum air pressure) corresponding to the maximum load capacity of a single wheel in an applicable size and ply rating as described in the JATMA YEAR BOOK or other industrial standards, and in case of a size that is not as described in the above industrial standard, the “prescribed internal pressure” refers to an air pressure (the maximum air pressure) corresponding to the maximum load capability prescribed for each vehicle on which the tire is installed. Additionally, in the present specification, “maximum load” means a load corresponding to the maximum load capability in a tire in an applicable size as described in the above industrial standards, or, in case of a size that is not as described in the above industrial standards, the “maximum load” means a load corresponding to the maximum load capability prescribed for each vehicle on which the tire is installed.", "", "First, the following describes the tire body1M.", "", "As illustrated in drawings such asFIG.3,FIG.7, andFIG.9, in each embodiment described herein, the tire body1M includes a tread portion1a, a pair of sidewall portions1bthat extend to a tire radial direction inner side from both ends, in the tire width direction, of the tread portion1a, and a pair of bead portions1cthat are disposed in ends of the tire radial direction inner side of each sidewall portion1b. The tread portion1ais a portion, in the tire width direction, of the tire body1M between a pair of ground contact edges. When the tire is 1 is fitted to a rim, the bead portions1care configured to contact the rim at the tire radial direction inner side and a tire width direction outer side.", "", "The tire body1M has a pair of tire side portions1dthat extend to the tire radial direction inner side from both ends, in the tire width direction, of the tread portion1a. The tire side portions1dare composed of the sidewall portions1band the bead portions1c. In the present specification, a surface of the tire outer side on the tire side portion1dis referred to as a “tire outer surface1dsof the tire side portion1d”.", "", "The tire body1M also includes a pair of bead cores4a, a pair of bead fillers4b, a carcass5, a belt6, tread rubber7, side rubber8, and an inner liner9.", "", "Each bead core4ais respectively embedded in a corresponding bead portion1c. The bead cores4ainclude multiple bead wires with a periphery covered with rubber. The bead wires are preferably made of a metal (for example, steel). The bead wires can, for example, be composed of monofilaments or stranded wires. The bead wires may be formed from organic fibers or carbon fibers.", "", "Each bead filler4bis respectively positioned in the tire radial direction outer side with respect to a corresponding bead core4a. The bead fillers4bextend tapering to the tire radial direction outer side. The bead fillers4bare, for example, rubber.", "", "The bead fillers may be referred to as “stiffeners”.", "", "As illustrated inFIG.3andFIG.7, when the tire body1M (and thus the tire1) is configured as a truck/bus pneumatic tire, the bead fillers4bmay be formed from multiple bead filler portions4b1and4b2(two in each example inFIG.3andFIG.7). These multiple bead filler portions4b1and4b2can, for example, differ in hardness. These multiple bead filler portions4b1and4b2are, for example, arranged (layered) along the tire radial direction.", "", "The carcass5spans between the pair of bead cores4aand extends toroidally. The carcass5is formed from one or more carcass plies5a. Each carcass ply5aincludes one or more carcass cords and a coating rubber covering the carcass cords. The carcass cords can be formed from monofilaments or stranded wires.", "", "The carcass cords may be formed from organic fibers composed of polyester, nylon, rayon, aramid, or the like, and may be formed from a metal (for example, steel). When the tire1is configured as a truck/bus pneumatic tire, the carcass cords are preferably formed from a metal (for example, steel). When the tire1is configured as a passenger vehicle pneumatic tire, the carcass cords are preferably formed from organic fibers composed of polyester, nylon, rayon, aramid, or the like.", "", "The carcass plies5aincludes a ply main body5mpositioned between the pair of bead cores4a. The carcass plies5amay further include a ply foldback portion5T that folds back from both ends of the ply main body5M and around each bead core4afrom the tire width direction inner side to the tire width direction outer side. However, the carcass plies5amay not necessarily include a ply foldback portion5T. The carcass5may preferably have a radial structure, but may also have a biased structure.", "", "The belt6is arranged on the tire radial direction outer side with respect to a crown portion of the carcass5. The belt6includes one or more belt layers6a. Each belt layer6aincludes one or more belt cords and a coating rubber covering the belt cords. The belt cords can be formed from monofilaments or stranded wires. The belt cords may be formed from a metal (for example, steel) or formed from organic fibers composed of polyester, nylon, rayon, aramid, or the like.", "", "The tread rubber7is positioned in the tread portion1a, on the tire radial direction outer side of the belt6. The tread rubber7forms a tread surface, which is a surface of the tire radial direction outer side of the tread portion1a. A tread pattern is formed on the tread surface.", "", "The side rubber8is positioned in the sidewall portion1b, on the tire width direction outer side of the carcass5. The side rubber8forms a surface of the tire width direction outer side of the sidewall portion1b. The side rubber8is integrally formed with the tread rubber7.", "", "The inner liner9is arranged on the tire inner side of the carcass5and, for example, may be layered on the tire inner side of the carcass5. The inner liner9is, for example, formed from a butyl-based rubber with low air permeability. Butyl-based rubbers encompass, for example, butyl rubber and halogenated butyl rubber, which is a derivative thereof. The inner liner9is not limited to butyl-based rubber, and can be made of other rubber compositions, resins, or elastomers.", "", "As illustrated inFIG.3andFIG.7, when the tire body1M (and thus the tire1) is configured as a truck/bus pneumatic tire, the tire body1M may include a reinforcement member3around each bead core4a. The reinforcement member3may be arranged on an opposite side of the bead core4afrom the carcass5, as in each example inFIG.3andFIG.7. The reinforcement member3includes one or more reinforcement plies3a(three in each example inFIG.3andFIG.7). Each reinforcement ply3aincludes reinforcement cords. The reinforcement cords may be formed from a metal (for example, steel) or formed from organic fibers composed of polyester, nylon, rayon, aramid, or the like.", "", "In each embodiment described herein, the tire body1M includes one or more marking portions20disposed on the tire outside surface1dsof the tire side portion1d. The marking portions20are formed from the side rubber8. As illustrated inFIG.1,FIG.2, andFIG.6, the marking portions20have one or more markings21. Each marking21forms a letter, a symbol, or a graphic. A graphic is a concept that encompasses barcodes and patterns. In each example inFIG.1,FIG.2, andFIG.6, the marking portion20has four markings21that form four letters “T”, “I”, “R”, and “E”. The marking portion20can represent, for example, a company name, trade name, logo, tire size, or the like. Each marking21is formed in a convex shape. Specifically, each marking21protrudes further to the tire width direction outer side than a base surface2abon the tire outer surface1dsof the tire side portion1d. The base surface2abcorresponds to a background surface in the marking portion20and specifically refers to the portion of the tire outer surface1dsof the tire side portion1dthat surrounds each marking21, as illustrated inFIG.3,FIG.7, andFIG.9. The base surface2abmay be a smooth planar surface with no irregularities, or the base surface2abmay be an uneven surface with finer irregularities than the markings21. In each example inFIG.1,FIG.2, andFIG.6, the marking portion20has multiple markings21. These multiple marking21are arranged along the tire circumferential direction. However, the multiple markings21, which form the marking portion20, may be arranged along any direction.", "", "The following describes the communication device10.", "", "The communication device10may have a configuration that is capable of wireless communication with a prescribed external device (for example, a reader or a reader/writer) that is external to the tire1, and the configuration of the communication device10is not particularly limited.", "", "The communication device10preferably has an RF tag. The RF tag may also be referred to as an “RFID tag”. The RF tag is preferably configured to be passive, but may be configured to be active.", "", "The communication device10may have, instead of or in addition to an RF tag, an accelerometer for detecting an acceleration of the tire1, an internal pressure sensor for detecting an internal pressure of the tire1, or the like.", "", "FIG.4andFIG.5illustrate an example of the communication device10. In the present example, the communication device10has an RF tag. In the present example, the communication device10includes an RF tag10eand a cover10f. The RF tag10eincludes an IC chip10cand an antenna section10b. The RF tag10eis configured to be passive.", "", "The IC chip10coperates, for example, by dielectric electromotive force generated by radio waves received at the antenna section10b. The IC chip10c, for example, has a controller and a memory unit.", "", "The memory unit may store any information. For example, the memory unit may store identification information for the tire1. The identification information for the tire1is, for example, unique identification information for the tire1that can identify each tire to each tire, such as the manufacturer of the tire1, the manufacturing plant, the date of manufacture. The memory unit may also store tire history information such as running distance of the tire, the number of sudden brakings, the number of sudden starts, and the number of sudden cornering situations. For example, sensors that detect tire internal temperature, tire internal pressure, tire acceleration, or the like are disposed in the tire cavity, and the memory unit may store detection information detected by these sensors. In this case, the RF tag10ecan acquire the detection information from a sensor by communicating wirelessly with the sensor through the antenna section10b.", "", "The controller is configured to be able to read out information from the memory unit.", "", "The antenna section10bhas a pair of antennas10b1,10b2. The pair of antennas10b1,10b2are connected to ends, positioned on opposite sides to each other, of the IC chip10c. The antenna section10bis configured to be capable of transmitting to and receiving from the above prescribed external device that is external to the tire1. In the examples inFIG.4andFIG.5, each antenna10b1,10b2extends linearly, but each antenna10b1,10b2may extend to form any shape, for example, a wavy shape or the like.", "", "The cover10fcovers the entirety of the RF tag10e. The cover10fis formed, for example, from rubber or resin.", "", "In the present example, the cover10fhas a pair of sheet-shaped cover members10f1,10f2. The paired cover members10f1,10f2overlap each other with the RF tag10etherebetween. The paired cover members10f1,10f2are preferably fixed to each other by adhesion or the like.", "", "However, the cover10fmay be formed from a single member.", "", "In the present example, the cover10fhas a rectangular shape in a planar view, but the cover10fmay have any shape in a planar view.", "", "The communication device10may have no cover10f, i.e., the communication device10may be formed from only the RF tag10e.", "", "The communication device10configured in this manner is configured to be capable of receiving, by the antenna section10b, information transmitted over radio waves or magnetic fields from the prescribed external device. Rectification (in the case of radio waves) or resonance (in the case of magnetic fields) generates power in the antenna section10bof the communication device10, and the memory unit and the controller of the IC chip10cperforms a prescribed operation. For example, the controller reads out the information in the memory unit and returns (transmits) the information to the prescribed external device from the antenna section10bover radio waves or magnetic fields. The prescribed external device receives the radio waves or the magnetic fields from the communication device10. By retrieving the received information, the prescribed external device can acquire the information stored in the memory unit of the IC chip10cof the communication device10.", "", "However, the communication device10may have any configuration that is different from this example.", "", "The communication device10may have a longitudinal direction LD, a lateral direction SD, and a thickness direction TD. The longitudinal direction LD, the lateral direction SD, and the thickness direction TD are perpendicular to each other.", "", "As illustrated inFIG.4andFIG.5, when the communication device10has an RF tag10e, the longitudinal direction LD of the communication device10is parallel to an extension direction of the antenna section10b. When each antenna10b1,10b2of the antenna section10bhas a wavy shape, the extension direction of the antenna section10brefers to an extension direction of the amplitude centerline of the wavy shape formed by each antenna10b1,10b2. In the communication device10, the thickness direction TD of the communication device10refers to the thickness direction of the cover10fwhen the communication device10has the cover10f. The thickness direction TD of the communication device10refers to the thickness direction of the IC chip10cwhen the communication device10has no cover10f.", "", "The length of the RF tag10ein the longitudinal direction LD is preferably, for example, 20 mm or greater, or 50 mm or greater. The length of the RF tag10ein the longitudinal direction LD is preferably, for example, 100 mm or less, or 70 mm or less.", "", "The length of the RF tag10ein the lateral direction SD is preferably, for example, 10 mm or less, or 8 mm or less.", "", "The length of the RF tag10ein the thickness direction TD is preferably, for example, 5 mm or less, or 2 mm or less.", "", "When the communication device10has the cover10f, the length of the communication device10in the longitudinal direction LD is preferably, for example, 30 mm or greater, or 60 mm or greater. The length of the RF tag10ein the longitudinal direction LD is preferably, for example, 110 mm or less, or 80 mm or less.", "", "When the communication device10has the cover10f, the length of the communication device10in the lateral direction SD is preferably, for example, 20 mm or less, or 15 mm or less.", "", "When the communication device10has the cover10f, the length of the communication device10in the thickness direction TD is preferably, for example, 6 mm or less, or 3 mm or less.", "", "The thickness of each cover member10f1,10f2of the cover10fis preferably, for example, 0.5 mm or greater. The thickness of each cover member10f1,10f2of the cover10fis preferably, for example, 1 mm or less.", "", "In each embodiment described herein, the entirety of the communication device10is embedded within the tire body1M, as illustrated inFIG.1toFIG.3andFIG.6toFIG.9. The communication device10is embedded in a part of the tire side portion1dof the tire body1M that is further to the tire width direction outer side than the carcass5. The communication device10is at least partially embedded within at least one marking21(21a). The communication device10is oriented such that the thickness direction TD of the communication device10approximately follows a protrusion height direction of the marking21a(FIG.3andFIG.7).", "", "During the production of the tire1, a raw tire, which forms the tire body1M, and the communication device10are placed inside a mold for forming a tire and vulcanized to form the tire1.", "", "The following describes the effects of each embodiment described herein.", "", "First, as described above, for each embodiment described herein, as illustrated inFIG.1toFIG.3andFIG.6toFIG.9, the communication device10is at least partially embedded within at least one marking21of the marking portion20that is disposed on the tire outer surface1dsof the tire side portion1d. That is, the communication device10is arranged in the tire side portion1d. In general, a metal may weaken the radio waves between the communication device10and the prescribed external device (for example, a reader or a reader/writer), thereby reducing the communication performance between the communication device10and the prescribed external device, which in turn may shorten a communication distance between the communication device10and the prescribed external device. However, for the tire body1M, a metal (for example, steel) can be used for the carcass5, the belt6, the bead cores4a, the reinforcement members3, or the like. Further, in general, the tire side portion1dtends to have less metal compared to the tread portion1a. Accordingly, by arranging the communication device10in the tire side portion1d, the communication performance can be improved, thereby enabling lengthening of the communication distance between the communication device10and the prescribed external device compared to a case in which the communication device10is arranged in the tread portion1a.", "", "As mentioned above, in each embodiment described herein, at least a portion of the communication device10is embedded within at least one marking21, as illustrated inFIG.1toFIG.3andFIG.6toFIG.9. A configuration in this manner enables the distance between the communication device10and any metal that may be used inside the tire body1M to be longer compared to a case in which the entirety of the communication device10is embedded further to a portion in the tire inner side of the tire body1M than in the marking portion20(and thus further to the tire inner side than the base surface2ab). Therefore, the communication performance can be improved, enabling lengthening of the communication distance between the communication device10and the prescribed external device.", "", "Further, by at least partially embedding the communication device10within at least one marking21, the marking portion20, which is easily visible from the outside, has an indicator function that indicates the position of the communication device10and thus the position of the communication device10becomes easier to grasp. Therefore, a worker who attempts to read the communication device10with the prescribed external device (for example, a reader or a reader/writer) can read the communication device10simply by holding the above prescribed external device near the marking portion20, thereby facilitating the reading process. Another advantage of the marking portion20having the indicator function that indicates the position of the communication device10is that separately processing the tire side portion1dto indicate the position of the communication device10is unnecessary.", "", "Further, each marking21of the marking portion20has relatively little rubber flow during the manufacturing of the tire1. Therefore, even if the communication device10is at least partially embedded within at least one marking21, the communication device10is less susceptible to strain, which can suppress any reduction in the durability of the communication device10.", "", "For each embodiment described herein, of the markings21that form the marking portion20, a marking21a(21), within which the communication device10is embedded, has a protrusion height of preferably 0.4 mm or greater, and more preferably 1.5 mm or greater. Accordingly, the communication device can be further lengthened.", "", "Further, for each embodiment described herein, of the markings21that form the marking portion20, the marking21a(21), within which the communication device10is embedded, has a protrusion height that may be, for example, 3.0 mm or less.", "", "In measuring the protrusion height of the marking21a, the height of the marking21afrom a hypothetical surface (indicated by a dotted line inFIG.3,FIG.7, andFIG.9), which is a smooth extension of the base surface2abwithin the marking21a, is measured along a perpendicular line to the hypothetical surface.", "", "For each embodiment described herein, in each example inFIG.1toFIG.3andFIG.9, the entirety of the communication device10may be embedded within any one marking21(21a) of the markings21that form the marking portion20. In this case, the communication device10can be further positioned on the tire outer side, enabling further lengthening of the communication distance.", "", "For each embodiment described herein, when the entirety of the communication device10is embedded within any one marking21(21a) as in each example inFIGS.1to3andFIG.9, the length L1(FIG.2) of the marking21a, within which the communication device10is embedded, is preferably 40 mm or greater, and more preferably 70 mm or greater as measured along the longitudinal direction LD of the communication device10at a center of the lateral direction SD of the communication device10. Accordingly, the communication device10becomes easier to arrange in the recess for forming the marking21ain the mold for forming a tire during tire manufacturing. Further, the design freedom in the alignment direction (orientation) and shape of the communication device10can be increased.", "", "The length L1(FIG.2) of the marking21a, within which the communication device10is embedded, may be, for example, 120 mm or less as measured along the longitudinal direction LD of the communication device10at the center of the lateral direction SD of the communication device10.", "", "The length L1is measured along a hypothetical surface (indicated by a dotted line inFIG.3,FIG.7, andFIG.9), which is a smooth extension of the base surface2abwithin the marking21a. When the marking21ahas multiple portions separated from each other along the longitudinal direction LD of the communication device10at a center of the lateral direction SD of the communication device10, the length L1refers to the length of only the portion within which the communication device10is embedded.", "", "For each embodiment described herein, when the entirety of the communication device10is embedded within any one marking21(21a) as in each example inFIG.1toFIG.3andFIG.9, the length L2(FIG.2) of the marking21a, within which the communication device10is embedded, is preferably 10 mm or greater, and more preferably 14 mm or greater as measured along the lateral direction SD of the communication device10at a center of the longitudinal direction LD of the communication device10. Accordingly, the communication device10becomes easier to arrange in the recess for forming the marking21ain the mold for forming a tire during tire manufacturing. Further, the design freedom in the alignment direction (orientation) and shape of the communication device10can be increased.", "", "The marking21awithin which the communication device10is embedded may have a length L2(FIG.2) of, for example, 20 mm or less when measured along the lateral direction SD of the communication device10at the center of the longitudinal direction LD of the communication device10.", "", "The length L2is measured along the hypothetical surface (indicated by a dotted line inFIG.3,FIG.7, andFIG.9), which is a smooth extension of the base surface2abwithin the marking21a. The length L2refers to the length of only the portion within which the communication device10is embedded, when the marking21ahas a plurality of portions separated from each other along the lateral direction SD of the communication device10at the center of the longitudinal direction LD of the communication device10.", "", "In each embodiment described herein, in the examples inFIG.6toFIG.8, the communication device10may be only partially embedded inside at least one marking21(21a) of the markings21that form the marking portion20. In this case, other portions of the communication device10may be positioned further to the tire inner side than the at least one marking21(21a). For example, when the communication device10has an RF tag10e, as in the examples inFIG.6toFIG.8, at least a portion of the IC chip10cof the RF tag10emay be positioned within the marking21a, and the antenna section10bof the RF tag10emay be positioned further to the tire inner side than the marking21a. In the examples inFIG.6toFIG.8, only a portion of the communication device10is embedded inside any one marking21(21a) of the markings21that form the marking portion20.", "", "In each embodiment described herein, the alignment direction (orientation) of the communication device10is arbitrary, and in terms of the durability of the communication device10or the like, the communication device10is preferably aligned such that the longitudinal direction LD of the communication device10approximately follows the tire circumferential direction as in the examples inFIG.6toFIG.8. However, the communication device10may be aligned such that the lateral direction LD of the communication device10approximately follows the tire circumferential direction as in the examples inFIG.1toFIG.3.", "", "In each embodiment described herein, the communication device10is preferably arranged in the sidewall portion1b, as inFIG.3,FIG.7, andFIG.9. In general, the sidewall portion1btends to have less metal compared to the bead portion1c. Accordingly, by arranging the communication device10in the sidewall portion1b, communication performance can be improved, thereby enabling lengthening of the communication distance between the communication device10and the prescribed external device compared to the communication device10being arranged in the bead portion1c.", "", "In each embodiment described herein, when the tire1is configured as a truck/bus pneumatic tire (FIG.1toFIG.3andFIG.6toFIG.8), a tire radial direction center10mof the communication device10(more preferably, the entirety of the communication device10) is preferably further to the tire radial direction outer side than a tire radial direction outer end of the bead core4a. Accordingly, the communication performance can be improved, thereby enabling lengthening of the communication distance between the communication device10and the prescribed external device.", "", "In each embodiment described herein, when the tire1is configured as a truck/bus pneumatic tire (FIG.1toFIG.3andFIG.6toFIG.8), the tire direction radial center10mof the communication device10(more preferably, the entirety of the communication device10) is preferably further to the tire radial direction outer side than a tire radial direction outer end Se of the ply foldback portion5T of the carcass5. Accordingly, the communication performance can be improved, thereby enabling lengthening of the communication distance between the communication device10and the prescribed external device. The durability of the communication device10and thus the tire1can also be improved because the communication device10can be arranged in a portion of the tire body1M with comparatively less distortion during rolling and other movements of the tire1.", "", "Here, “tire radial direction outer end5eof the ply foldback portion5T of the carcass5” refers to a tire radial direction outer end that is furthest to the tire radial direction outer side among tire radial direction outer ends of the ply foldback portion5T of each carcass ply5aof the carcass5.", "", "In each embodiment described herein, when the tire1is configured as a truck/bus pneumatic tire (FIG.1toFIG.3andFIG.6toFIG.8), the tire radial direction center10mof the communication device10(more preferably, the entirety of the communication device10) is preferably further to the tire radial direction outer side than the tire radial direction outer end3uof the reinforcement member3. Accordingly, the communication performance can be improved, thereby enabling lengthening of the communication distance between the communication device10and the prescribed external device. The durability of the communication device10and thus the tire1can also be improved because the communication device10can be arranged in a portion of the tire body1M with comparatively less distortion during rolling and other movements of the tire1.", "", "Here, “tire radial direction outer end3uof the reinforcement member3” refers to a tire radial direction outer end that is furthest to the tire radial direction outer side among tire radial direction outer ends of each reinforcement ply3aof the reinforcement member3.", "", "In each embodiment described herein, when the tire1is configured as a truck/bus pneumatic tire (FIG.1toFIG.3andFIG.6toFIG.8), the tire radial direction center10mof the communication device10(more preferably, the entirety of the communication device10) is preferably further to the tire radial direction inner side than a tire radial direction outer end4buof the bead filler4b. Accordingly, the communication performance can be improved, thereby enabling lengthening of the communication distance between the communication device10and the prescribed external device. The durability of the communication device10and thus the tire1can also be improved because the communication device10can be arranged in a portion of the tire body1M with comparatively less distortion during rolling and other movements of the tire1.", "", "A distance in the tire radial direction between the tire radial direction center10mof the communication device10and the tire radial direction outer end4buof the bead filler4bis preferably 1 to 30 mm, and more preferably 5 to 15 mm.", "", "In each embodiment described herein, when the tire1is configured as a truck/bus pneumatic tire (FIG.1toFIG.3andFIG.6toFIG.8), the tire radial direction outer end Se of the ply foldback portion5T of the carcass5is preferably positioned further to the tire radial direction inner side than the tire radial direction outer end4buof the bead filler4b. The tire radial direction outer end5eof the ply foldback portion5T of the carcass5may be positioned either in the same tire radial direction position as the tire radial direction outer end4buof the bead filler4bor further to the tire radial direction outer side.", "", "In each embodiment described herein, when the tire1is configured as a truck/bus pneumatic tire (FIG.1toFIG.3andFIG.6toFIG.8), the tire radial direction outer end3uof the reinforcement member3is preferably positioned further to the tire radial direction inner side than the tire radial direction outer end4buof the bead filler4b. The tire radial direction outer end3uof the reinforcement member3may be positioned either in the same tire radial direction position as the tire radial direction outer end4buof the bead filler4bor further to the tire radial direction outer side.", "", "In each embodiment described herein, when the tire1is configured as a truck/bus pneumatic tire (FIG.1toFIG.3andFIG.6toFIG.8), the tire radial direction outer end5eof the ply foldback portion5T of the carcass5may be positioned further to the tire radial direction inner side than a tire maximum width position of the tire body1M as in each example inFIG.1toFIG.3andFIG.6toFIG.8. The tire radial direction outer end5eof the ply foldback portion5T of the carcass5may be positioned in the same tire radial direction position as the tire maximum width position of the tire body1M. The tire radial direction outer end5eof the ply foldback portion5T of the carcass5may be positioned further to the tire radial direction outer side than the tire maximum width position of the tire body1M.", "", "The “tire maximum width position of the tire body1M” is a tire radial direction position at which the tire body1M has the largest dimension in the tire width direction.", "", "In each embodiment described herein, when the tire1is configured as a truck/bus pneumatic tire (FIG.1toFIG.3andFIG.6toFIG.8), the tire radial direction outer end3uof the reinforcement member3may be positioned further to the tire radial direction inner side than a tire maximum width position of the tire body1M as in each example inFIG.1toFIG.3andFIG.6toFIG.8. The tire radial direction outer end3uof the reinforcement member3may be positioned in the same tire radial direction position as the tire maximum width position of the tire body1M. The tire radial direction outer end3uof the reinforcement member3may be positioned further to the tire radial direction outer side than a tire maximum width position of the tire body1M.", "", "In each embodiment described herein, when the tire1is configured as a passenger vehicle pneumatic tire (FIG.9), the tire radial direction outer end10uof the communication device10(more preferably, the entirety of the communication device10) is preferably further to the tire radial direction outer side than the tire radial direction outer end of the bead core4a, more preferably further to the tire radial direction outer side than a tire radial direction center of the bead filler4b, and, for example, preferably further to the tire radial direction outer side than a tire radial direction outer end4buof the bead filler4b.", "", "In each embodiment described herein, when the tire1is configured as a passenger vehicle pneumatic tire (FIG.9) and the communication device10is arranged in the sidewall portion1bas described above, the tire radial direction outer end10uof the communication device10is preferably positioned further to the tire radial direction inner side than the tire radial direction outer end5eof the ply foldback portion5T of the carcass5as in the example inFIG.9. Accordingly, the communication performance can be improved, thereby enabling lengthening of the communication distance between the communication device10and the prescribed external device. The durability of the communication device10and thus the tire1can also be improved because the communication device10can be arranged in a portion of the tire body1M with comparatively less distortion during rolling and other movements of the tire1.", "", "A distance, in the tire radial direction, between the tire radial direction outer end10uof the communication device10and the tire radial direction outer end5eof the ply foldback portion5T of the carcass5is preferably 3 to 30 mm, and more preferably 5 to 15 mm.", "", "In each embodiment described herein, when the tire1is configured as a passenger vehicle pneumatic tire (FIG.9), the tire radial direction outer end5eof the ply foldback portion5T of the carcass5is positioned further to the tire radial direction outer side than the tire radial direction outer end4buof the bead filler4b, as in the example inFIG.9. However, the tire radial direction outer end5eof the ply foldback portion5T of the carcass5may be positioned either in the same tire radial direction position as the tire radial direction outer end of the bead filler4b, or further to the tire radial direction inner side.", "", "In each embodiment described herein, when the tire1is configured as a passenger vehicle pneumatic tire (FIG.9), the tire radial direction outer end5eof the ply foldback portion5T of the carcass5may be positioned further to the tire radial direction outer side than a tire maximum width position of the tire body1M. The tire radial direction outer end5eof the ply foldback portion5T of the carcass5may be positioned in the same tire radial direction position as the tire maximum width position of the tire body1M. The tire radial direction outer end5eof the ply foldback portion5T of the carcass5may be positioned further to the tire radial direction inner side than the tire maximum width position of the tire body1M. The “tire maximum width position of the tire body1M” is a tire radial position at which the tire body1M has the largest dimension in the tire width direction."], "claims": ["a marking portion disposed on a tire outer surface of a tire side portion; and a communication device, wherein the marking portion has one or more markings, each of the one or more markings forms a letter, a symbol, or a graphic and is formed into a convex shape, and at least a part of the communication device is embedded within at least one of the one or more markings.", "2 . The tire according to claim 1 , wherein the marking within which the communication device is embedded has a protrusion height of 0.4 mm or greater.", "3 . The tire according to claim 1 , wherein the entirety of the communication device is embedded within any one of the one or more markings.", "4 . The tire according to claim 3 , wherein the marking within which the communication device is embedded has a length L 1 of 40 mm or more as measured along a longitudinal direction of the communication device at a center of a lateral direction of the communication device.", "5 . The tire according to claim 3 , wherein the marking within which the communication device is embedded has a length L 2 of 10 mm or more as measured along a lateral direction of the communication device at a center of a longitudinal direction of the communication device.", "6 . The tire according to claim 1 , wherein the communication device has an RF tag.", "7 . The tire according to claim 2 , wherein the entirety of the communication device is embedded within any one of the one or more markings.", "8 . The tire according to claim 4 , wherein the marking within which the communication device is embedded has a length L 2 of 10 mm or more as measured along a lateral direction of the communication device at a center of a longitudinal direction of the communication device.", "9 . The tire according to claim 2 , wherein the communication device has an RF tag.", "10 . The tire according to claim 3 , wherein the communication device has an RF tag.", "11 . The tire according to claim 4 , wherein the communication device has an RF tag.", "12 . The tire according to claim 5 , wherein the communication device has an RF tag."], "bibtex": "@patent{20240278604,\n    title = {TIRE},\n    number = {20240278604},\n    year = {2024},\n    note = {File: US20240278604A1-20240822.XML}\n    }", "classification": "B60C1900FI"}]